{"17-Mile Drive": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "17-Mile Drive", "url": "/Attraction_Review-g32737-d146192-Reviews-17_Mile_Drive-Monterey_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/11/d8/c1/another-viewpoint.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "7503"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Monterey", "addressRegion": "California", "postalCode": "93953", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "lots of place to stop along the way", "a pleasant drive through Pebble Beach area and several beautiful places to stop and take pictures; including the lone cypress tree and several look outs. You have to pay $10.25 to go on the road however, and beautiful views and look outs if you go along highway 1 out of Carmel too; and that is free!\nShow less"], ["Reviewed 3 days ago", 5.0, "17 Miles of Heaven!", "This was a highlight of our trip! We stopped numerous times, took short hikes, saw the most beautiful coastal scenery, stopped for dinner at the Pebble Beach Golf Club and generally had an amazing time! Not to be missed."], ["Reviewed 4 days ago", 5.0, "Breathtakingly beautiful!!!!!", "If you are in the area - even close to the area - this is a MUST!\nWe brought our kids for this drive and the many stops along the way. The views of the pacific are literally breathtaking! We’ve done this drive a couple of times and to share with our kids was incredible. The rock formations and breaking surf are so beautiful. If you’re a golfer - well are you in for a treat. Drive along Spanish Bay and Pebble Beach - it’s like a pilgrimage for the golfer.\nPlease do the drive and enjoy!\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth every penny you pay at the gate even if you don't care about golf", "This beautiful drive was one of my favorite parts about our visit to the Monterey Peninsula. We're not big golf fans, but it was fun to see the amazing golf holes right on the ocean. But even if you have zero interest in golf, this drive is worth every penny of the admission fee. They have frequent, large parking areas so it's easy to stop and take pictures. The gates are also very conveniently located to both Monterey and Carmel, with each gate about 5 minutes from the center of each town. I would take this drive (or walk parts) every time I visited the area if I could.\nShow less"], ["Reviewed 1 week ago", 3.0, "Do you want to pay for this? I wouldn't.", "17 mile drive offers a good ocean access for kayakers and spear fishermen and some nice views of the bay. I wouldn't pay to drive through here though and support the grotesque wealth of this place. You'd be better off driving a bit down HW-1 and checking out Big Sur.\nShow less"], ["Reviewed 1 week ago", 3.0, "Bit hit and miss - literally!!", "We pulled up to the main entrance into the 'starting point' and kind of HAD to do it as we were committed. This sounds odd, but we were in an RV! We chose to do the drive as the lady confirmed it would be suitable for us. In fact, her recommendation could not have been more wrong. There are overhanging branches which, in a smaller vehicle you'd not notice, but in a 34ft RV, you kind of do!\n\nThere were lots of beautiful houses to see and fabulous views of the sea from various view points.\n\nWe got to the bottom and headed out onto the main drag, before heading to our RV park, and actually breathed a sigh of relief, that we were still intact! If you do this drive, don't take an RV and make sure you have a guide, rather than rely on your phones for information!\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful views", "This was a neat drive! I would definitely say check out a map and see what areas you actually want to see. We started from the Carmel gate and left out of the main gate and that covered the whole coast, which was what we really wanted to see.\nShow less"], ["Reviewed 1 week ago", 5.0, "Go there!", "The 17-Mile Drive is a must-see at the West coast. There are beautiful beaches, cliffs and trees. And don’t forget to take your camera with you :-)"], ["Reviewed 1 week ago", 5.0, "Gorgeous", "If you’re feeling lazy and you prefer to drive rather than walk, then this drive is for you. Even if you do prefer to walk, drive here anyway. It’s beautiful on a sunny day, with many vista points to stop on... the sea and surf is beyond wonderful, and the drive is not taxing. Just go and enjoy yourself.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great views but many others nearby without the charge.", "There are many great views plus access to Pebble Beach and ability to see the Lone Cypress. Other than that you can see very similar views near the scenic route around Carmel Beach and Sunset Dr near Pacific Grove without the $10 charge."], ["Reviewed 1 week ago", 5.0, "One of the most gorgeous drives anywhere", "Spectacular views is what this is all about. When in the Monterey/Carmel area, take the time to drive this route. It will etch unforgettable memories in your mind."], ["Reviewed 1 week ago", 5.0, "Beautiful views", "We spent the entire afternoon enjoying the scenery 17 mile drive has to offer! Spectacular Pacific Ocean views, intriguing homes are just a few of the things to enjoy along the drive. It's a must do when you visit the area."], ["Reviewed 1 week ago", 4.0, "Quiet and lovely", "Beautiful views on the ocean! Go there to feel the magic and power of the Pacific! But be peapare to pay for that drive - around 20$"], ["Reviewed 2 weeks ago", 5.0, "Enjoyable drive", "Relaxing and enjoyable drive. Plenty of pullouts and photo opportunities. Best to enjoy on a clear day."], ["Reviewed 2 weeks ago", 5.0, "Great place to enjoy the sunset", "Its a great place to drive and enjoy, we saw one deer near by one garden. Has Amazing houses, and to see the sunset the best place is the number 11 from the map that they are going to give you \"Seal Rock picnic area\" it is a big open area and has a great view. I am going to provide some pictures later. You pay 10,25 to enter.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A beautiful drive", "I was more curious to see how “ the other half live” but it really is a great scenic drive with lots of areas to stop and take amazing photos...manicured golf courses and million dollar homes are part of the experience....if you have the time, it’s well worth it, you do pay a park entrance fee but the scenery is worth it ( something like $10)...\n\n\n\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful is an understatement!", "I had heard a lot about the 17 mile drive, but the real beauty is so striking, that it catches you off guard when you actually experience it.\nWe drove across Monterey, 17 mile drive, carmel by the sea and saw sunset at Bixby.\n17 mile drive actually is though some private bungalows with golf course at the most beautiful location.\nMust do...\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful Road!", "By bike or car, do not miss out on the 17 mile drive! Its worth the entrance fee (which I believe is waived for bikes). Be sure to get the map and stop at each point along the way. Breathtaking!"], ["Reviewed 3 weeks ago", 5.0, "Everything you’ve heard is correct", "A fabulous drive even though we ran out of time. A bit confusing as it was not marked in one section (all others were) & we went onto the wrong road & missed Pebble Beach (the primary point of interest for us). Backtracking took us there and a wonderful clerk in the gift shop directed us further after our visit there. Got to see the famous lone cypress. Also got to watch many whales & some sea otters. Watched an amazing sunset but then had to leave so we probably only got through 7 miles. It takes much longer than you’d think as the road is very windy.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Highly enjoyed the views!", "Really enjoyed this drive! Amazing scenery and tons of pelicans and sea lions and seals. Really enjoyed the part before the toll booth, in Monterey, as well. I think that area was called Pacific Grove. The Lone Cypress was neat to see and even though we aren't golfers, we actually really enjoyed going through the Pebble Beach area. When you come out in Carmel, definitely keep driving as far as you can along the water - there is a fantastic road that snakes around some very cool houses.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful!", "So happy to be back in Monterey! The 17 Mile drive is beautiful. There are numerous pullouts to take in the views. There are a few picnic tables and benches. People like to clamour on the rocks but be careful. The waves are powerful!"], ["Reviewed 3 weeks ago", 4.0, "A beutiful scenic way to spend some time", "It had been years since we drove this route, and thought it a nice way to spend an afternoon before going to Monterey for dinner. This is a privately owned area, thus they charge $10.25 for the opportunity to drive it. But, yoou get a good map with locations to stop and view \"things\". With a carload, it's not bad. Our day was warm with a very slight breze, so it was very pleasant to get out and view the scenery. Note that it can get cold and windy in the fall and winter. Check out the homes as you drive along. Boy, it must be nice to live like these folks.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "17-Mile Drive", "A quiet drive with beautiful scenery within a long stretch of a gated community. A fee must be paid upon entering, but the ten dollars are worth the peaceful look out into the ocean. Several stops punctuate where beautiful photos can be taken for that profile picture you've been trying to get. :)\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Words can’t describe", "This drive had such incredible scenery. It’s a simple a shore drive with some amazing homes along the way. There are plenty of places to pull over and get out and walk around. A must do for anyone visiting the area."], ["Reviewed 4 weeks ago", 5.0, "Gorgeous Coastal Drive", "At first we wondered why we were spending ten dollars to drive on a loop road through residential neighborhoods, but we soon appreciated the opportunity to enjoy the magnificent vistas of the Monterey peninsula. Be sure to pull off at the numbered locations on the map you're given where possible and take your time -- don't rush this experience. We were thrilled to catch sight of sea otters in the surf just offshore. This drive was one of the best things we did on our California trip.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Gorgeous", "This drive is so gorgeous - if you are in Monterey you should plan to do this. You can do the drive in under an hour depending on how often you want to stop and pull over.\n\nIt costs $10.25 per car to drive from one end to the other and winds around Pebble Beach.\n\nThere is a walking trail, there are bike trails, there is a golf course, there are restaurants and inns and private mansions and residences in here. It's very pretty and there is loads to do and see.\n\nThe most beautiful thing of course is the coast and enjoying the beautiful blue of the pacific ocean. The waves break on the beach in different places in different ways and you can scramble over rocks and fish and take photos.\n\nThere are plenty of generous pull-off locations where you can park and get out of your car or picnic with tables and trash cans and restrooms.\n\nThe Lone Cypress is another popular spot to pull over for a photo-op.\n\nIt's worth the cost of admission and no matter where you start you'll end somewhere fabulous for lunch/dinner (either Carmel or Monterey) so you can't lose there either!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Beautiful scenery!", "Love to stop and get out to visit the tide pools! The entire drive, looking at the ocean and forest as well as the real estate is amazing! I don’t love having to pay the $10.50 to enter, otherwise I would have given it 5 stars.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun but lengthy.", "Will see stunning beaches and views. Give this trip time to enjoy. Many places to stop at that from the street not able to see the best of them, hidden views worth seeing."], ["Reviewed 4 weeks ago", 4.0, "Nice drive, some great views, some great homes", "We made this drive to check it off the list. Glad we did. Between the ocean sunset views, the large homes, the golf course views, and the slightly winding road, it was a great way to wrap up the day. Recommend going at sunset!"], ["Reviewed 4 weeks ago", 5.0, "Driving with Mustang near the ocean", "A private road (10.25usd fee) near the ocean. A lot of amazing landscapes. No words must be added. Do not miss it."], ["Reviewed 4 weeks ago", 2.0, "Average Views, Average Beaches", "We did the drive on the afternoon of 9 Sept. 2017. It was OK but both of us had grownup not far from the seashore, so we did not think the views or beaches were anything out of the ordinary and we did not think much of seeing the multi-million dollar properties. We might have better enjoyed a stroll through town. Tip: There are many places to park free at the water’s edge and get out to take photos or walk around.\nDid this review earn a “helpful” vote?\nShow less"], ["Reviewed 4 weeks ago", 5.0, "walking better than driving. Parking available", "We walk along the path, which eliminates driving and having to find a parking spot, tho during the winter season, there isn't as much of an issue with too many tourists. Definitely recommend going along the beach path."], ["Reviewed 4 weeks ago", 5.0, "A must do!", "I recommend this beautiful scenic drive for anyone! Lots of beautiful photo ops and some great stops for lunch and drinks along the way."], ["Reviewed 4 weeks ago", 5.0, "Stunning coastal drive", "This afternoon we did the 17 mile drive.It was fantastic.Cost is $10 given it is a private road.We loved the rugged coastline and stunning golf courses.We suggest you take your time and stop off at many of the notable places to soak in the atmosphere."], ["Reviewed 4 weeks ago", 5.0, "Charming 17-Mile Drive, with incredibly awesome views", "We did the 17-mile drive along the Monterey Peninsula between Pebble Beach and Pacific Grove, stopping a few times along the way to enjoy the stunningly beautiful coastline scenery and to take photos. The shoreline is mostly rocky, has some golden-sand beaches, and calm coves. Overlooking the ocean, there are many multi-million dollar mansions.\n\nEn route at Stop 16, I took a photo (attached) of the lone Monterey cypress tree in Pebble Beach which seems to be growing on the granite hillside. It is likely the most photographed tree in the Americas and an icon of California.\n\nFor the 17-Mile Drive, there is a $10 gate entrance fee of $10 per car.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Unbelievably beautiful scenic drive!", "One of the most beautiful scenic drive in CA. We went on a sunny day stopping at most of the scenic stops. Beware though if you have a large group like us (a group of 9) they don’t charge you the vehicle rate but they charge you a $5 per person rate instead, so it is quite steep in my opinion. But the drive was definitely worth it. We took a lot of amazing pictures and stopped over at the pebble beach golf club house for lunch. This was the highlight, since we were lucky enough we get some tables on the terrace just above the golf course. The view was spectacular and the food was excellent. We thoroughly enjoyed ourselves there and ended up not having enough time to see the rest of the scenic points.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A must do!", "This is a beautiful drive with so many places to stop and get out to explore the coastline. It is a must do for any trip to Monterey!"], ["Reviewed January 24, 2018", 4.0, "Worth the drive and cost", "If you have not been to Pebble Beach, then when you do you will need to pull out the wallet for a reasonable cost to see the homes, the lone Cyprus, the golf courses and views. We spent some time in the pro shop at Pebble Beach and in the special members locker area. It was raining, so limited views, but still spectacular.\nShow less"], ["Reviewed January 23, 2018", 5.0, "The lovely ocean", "This is a nice mellow scenic drive along the coast. I live much of the year in Hawaii and never get tired of a coastal drive."], ["Reviewed January 22, 2018", 5.0, "Beautiful Drive", "Was very eager to do this and glad we got to. Beautiful drive ending up at pebble beach golf course which we had a few drinks and chatted to the locals. On my list to do again one day."], ["Reviewed January 22, 2018", 4.0, "Beautiful drive", "We had a beautiful sunny January day, so I am guessing we were particularly lucky. The drive and the scenery are spectacular from the wild beaches to the amazing golf courses to the audaciously expensive homes!"], ["Reviewed January 22, 2018", 5.0, "Amazing and energizing environment!!!", "The 17 miles are usually run by stages, and people hardly get out of the car but if you stop in some spots you can really enjoy the view, take amazing pictures of the sea, and with luck enjoy some of the sea life in the area. It is a nice trip, and if you are traveling with kids stop in the beach, and let them play for an hour you will enjoy a restful night after they spent that energy!!!\nShow less"], ["Reviewed January 21, 2018", 2.0, "I am not sure looking at expensive homes is exactly a worthwhile tour.", "The scenery is not bad, but definitely not worth the $9 entrance fee.\nThere are much better places to visit for free. If checking out homes of the rich is your thing, then go for it.\nThe Spanish Bay and Roy's are good places to dine, but over priced for the quality. The view and beach is million dollar though.\nShow less"], ["Reviewed January 21, 2018", 5.0, "You must do it", "This is a beautiful drive with some amazing Terrain. The granite coastline is Awesome from every angle. Stop plenty of times along the way. Kids will love to climb on the rocks. Adults will be amazed by the rock formations.\n\nIf you're into geology, you will not find a better Seascape of porphyritic rocks anywhere. The granite here has feldspar crystals as big as a centimeter.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Must do in Monterey", "It takes a while and the signage could be better, but Bird Rock was the highlight until we had drinks at the Pebble Beach Golf Club Lounge. Not a great view for sunsets but great drinks while watching the ocean waves"], ["Reviewed January 21, 2018", 5.0, "Must see", "It's a must see. Spectacular view of the forces of nature as well as the its beauty. Plan enough time since it's something to see."], ["Reviewed January 20, 2018", 5.0, "As good as advertised", "Hard to add anything new when it’s already rated so high but this drive is simply magical. Our timing happened to be perfect so we got beautiful blue sky’s with puffy white clouds which turned into a stunning sunset. The trees cypress, oak and pine trees were like twisted works of art. The contrast between the perfectly manicured green grass of the golf course and then deep blue ocean was breathtaking. We watched golfers tee off on the rock outcropping overlooking the crashing waves. You simply have to see it to believe it.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Just incredible!", "So stunning! Wanted to stay forever, so gorgeous! Seriously so beautiful that taking pics isnt enough, you just want to stay & watch the ocean forever. Wasn't as crowded as we thought it might be, maybe its the time of year, but we made lots of stops along the way just enjoying it all. If you haven't been, go!\nShow less"], ["Reviewed January 18, 2018", 5.0, "Fabulous drive!", "What an amazing spectacle today! A bit foggy but with major storm in the Pacific, we were treated to spectacular waves along the coast. The $10.25 fee for the drive is more than worth it. Nice stop for breakfast at the Lodge at Pebble Beach! A must see if you are in the Monterey/Carmel area!\nShow less"], ["Reviewed January 18, 2018", 5.0, "Beautiful, worth a drive through!", "17 Mile Drive is definitely worth a drive through. Depending on how many places you park at and get out, it can take 1-2 hours. We followed the map that is provided when you enter, which marks all the places you can stop at. We were there in the middle of the day (around 2pm) and most sites/stops had easy parking. Most of the places we stopped we were in and out of the car in less then 10 minutes, so this drive does not take a lot of time (unless you want it to). Parking around Pebble Beach would most likely be your longest stop.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Wow!", "Beautiful views along this 17-Mile Drive! You can take your time driving, and enjoying the amazing scenery!"], ["Reviewed January 16, 2018", 3.0, "Pretty drive with plenty of trees, golf courses, and ocean", "My three friends and I agreed that we enjoyed the coastal drive from Carmel to Big Sur more than we enjoyed the 17-Mile Drive, but we had a week in Carmel, and we had plenty of time to do both (and more). We were somewhat rushed on our 17-mile drive, but stopped several times for photos of interesting architectural details on homes and also for ocean views. We attempted to use the 50-cent telescope to see otters and wildlife on rocks, but either the telescopes had the shortest time ever before closing or, more likely, they just took our money and did not work. We drove past a number of golfers and golf courses and did not see any obvious opportunities to stop to see their amenities. I would say the ride was very pleasant but not extraordinary. There was a fee of $9 per vehicle for the 17-Mile Drive, as I recall. It started and stopped north of Carmel. For some reason, we thought it would put us a little further south along the coast.\nShow less"], ["Reviewed January 16, 2018", 4.0, "A must do for anyone in that area", "$10.25 is the entry charge for a car. It's worth paying that money.\nMy Suggestion will be keep no more than half day for this activity even if you stop at every point for sigh seeing. Kids and Families will surely like it. Take pictures as much as you can.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Very nice scenic drive. Must-see.", "A wonderful drive past some of the main attractions of Carmel, with the coastline and the famous golf course plus a section through the forest."], ["Reviewed January 16, 2018", 4.0, "Nice drive", "If you love the sea and trees and mountains and nature from the safety of you car, then this is your jam!"], ["Reviewed January 15, 2018", 4.0, "Recommended scenic Drive", "Our Family enjoyed the sights of the 17 Mile drive which took us two hours with stopping and taking pictures."], ["Reviewed January 14, 2018", 3.0, "Nice, but there are better view in Monetary and Point Lobos.", "The views are nice, but better other places without the traffic. I suggest driving in pacific grove, where you can get on the beach."], ["Reviewed January 14, 2018", 3.0, "Beautiful views", "Beautiful views and lots of stops to make. Wasn’t completely blown away by it but was a nice thing to do."], ["Reviewed January 12, 2018", 4.0, "To pay or not to pay", "We debated paying the fee for the drive and went ahead and did it. It was beautiful and it did save us some time, we were heading south and to go around would've taken longer. I've seen lovely homes and yards, I wanted to see birds and seals and there were plenty because we had quite a bit of actual coastline views. I downloaded the Pebble Beach app and it gave me history of the places as we arrived, I do recommend that, it was free.\nShow less"], ["Reviewed January 12, 2018", 1.0, "Don't botjer", "We were really disappointed to find that they charge you to drive this. The roads around Monterey are just as beautiful and we felt they were exploiting visitors when the area is obviously already very affluent. We might have missed a gem but principals meant more. Don't like being taken for a fool.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Breathtaking scenery!", "Well worth the $10.25 for the remarkable scenery! We went in January of 2018 and are already planning a return trip! Going at your own pace, you are able to stop and take in the breathtaking views at your leisure."], ["Reviewed January 10, 2018", 5.0, "Allow yourself plenty of time to see everything !", "This is one of those things you just have to do at least once. There is a fee to go in; I believe it's $10 (bring cash). The scenic route is gorgeous! There are plenty of designated areas to stop and park so you can just sit and admire the view or get off and take pictures or enjoy the beach. Allow yourself plenty of time to see everything in daylight, although sunset is really nice too. It's a very long drive, so plan ahead! If you plan on stopping along the way, just make this an all day event and pack some food for a picnic :)\nShow less"], ["Reviewed January 9, 2018", 5.0, "Amazing scenery...", "This is a must. Take in beautiful scenery on a nice drive at your own pace. Plenty of photo ops for your scrapbook our photo collage. The scenery never disappoints."], ["Reviewed January 9, 2018", 4.0, "Pretty", "It's pretty, a nice drive. It's nothing you can't see by just driving down Highway One. But it was worth the ten bucks to be able to see all the views so close to the hotel in Monterey. Otherwise it would have been a much longer drive to see such views. Nothing spectacular, but nice and worth the price in my opinion.\nShow less"], ["Reviewed January 9, 2018", 5.0, "A bucket list activity", "Save your receipt from the toll and stop at the Lodge at Pebble Beach for a drink. You get some credit when you spend over a certain amount. We did this drive close to sunset, and it can't be beat!"], ["Reviewed January 7, 2018", 4.0, "Views of the Pacific Ocean and Some Estates", "This is a nice drive with views of the Pacific Ocean and some estates. Most of the estates are now well hidden, however."], ["Reviewed January 6, 2018", 5.0, "Well Worth It!", "Ok, so yes, it's $10.75 to do the 17-Mile Drive, but it's well worth the fee. The Drive meanders through Pebble Beach, which is largely well-heeled residential and golf courses, but the route for the Drive sticks mostly to the coastline and is well marked and easy to follow. They even give you a little map/brochure at the beginning to tell you about the places along the way. The spots that are famous and/or great for photos have signs so you know where to pull off. Depending on how long you spend at each spot and how many pictures you take, the Drive will take anywhere from 1 to 3 hours. If you're anything like me, you will take A LOT of pictures. Everything is so dang beautiful, it hurts. Oh, and if you stop at any of the businesses along the way and spend at least $30, they discount the $10 entrance fee. We stopped at the The Lodge at Pebble Beach Links and ate at The Bench Restaurant. Pricey but very, very good, with great views overlooking the ocean and the 18th green.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Amazing Views", "There are 21 view points, however we found around 8 places scenic and worth. Since we visited during December, and evening time it was slightly chilly and misty. Took good number of pictures and had fun driving through the scenic area. Make sure you have 2 hours to spare after entering the drive.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Family vacation", "What a view! This drive takes about 35 - 40 min with optional stops for views and photographs. Highly recommend as views are to die for"], ["Reviewed January 5, 2018", 5.0, "Worth the $10 charge.", "Beautiful drive along the coast, We did it twice.Numerous places to stop and take pictures. The houses, or should I say mansions, are amazing."], ["Reviewed January 4, 2018", 4.0, "Nice drive to kill some time", "If you're waiting to check into your hotel motel room this is a nice drive that will take some time.. some gorgeous homes through the drive some beautiful views. After you've done it once you're probably not go back for some time.. We did it about 35 years ago and finally again jan 2018. Not much has changed except the trees just got bigger. If you're looking to kill some time this might be for you.\nShow less"], ["Reviewed January 3, 2018", 5.0, "A place not to be missed.", "Recent visit to San fransisco my cousin took me here and was awesome.\n\nFirst thought whats a big deal here to go, but once you are there, the views, the restaurants and the drive was excellent.\n\nIts more of the views and photo opportunity makes you enjoyable in this place.\n\nIts not a regular tourist thing to do, but if you have a chance do not miss.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great 17 Mile Drive bike ride from Monterey & FREE!", "Yes, it's free to ride bikes on 17 Mile Drive. We rented bikes from Monterey Cannery Row area, rode along the coastline and entered 17 Mile Drive from Sunset Drive on the Asilomar side. There was a separate path for bikes to enter bypassing the gate where cars had to pay to get in. For a few miles there was a nice sized shoulder/bike lane until past Seal Rock. After that, cars and bikes were sharing the road but motorists were driving slow and very courteous and patient around us cyclists.\n\nWe were going pretty slow on our mountain bike rentals but we saw many roadies whizz by and it was evident that 17 Mile Drive was a popular training spot for cyclists. It seemed that most of the traffic was headed in the same direction as we were which made cars passing cyclists easier but there were occasionally cars and bikes going the other way too. We were riding late morning so probably fewer cars earlier in the morning and possibly more cyclists.\n\nThe southwest section of 17 Mile Drive has some hills to climb with no shoulder so it is probably best for more experienced road cyclists although we did see an Adventures By the Sea tour group (2 guides and 8 cyclists) stopping at the same places we did. After the Lone Cypress Tree, there is a lot more climbing on the route towards Pebble Beach and then a long climb towards the junction with Hwy 1 and Hwy 68.\n\nTo get back to Monterey where we rented the bikes, we crossed over Hwy 1 and took a short paved bike path along Hwy 1/68 that ended and put us on Viejo Road. A left turn onto Soledad led to Del Monte Mall. We rode down Munras on another paved path then onto regular streets back to where we rented our bikes. The ride ended up being just under 20 miles but filled with some good hill climbs, non-stop gorgeous scenery, and many stops to enjoy the sights and smells along the coast. Awesome ride for tourists who enjoy biking!\nShow less"], ["Reviewed January 2, 2018", 5.0, "Great fun seeing how the 1% live!", "For a fun afternoon, spend the $10.25 and take this charming drive. Amazing homes, fantastic views and lots of vistas to stop at and take pictures. Especially great for those outside of California that want to see why coastal California is a stunning marvel to behold. I won't do this on every trip to the area, but will certainly do it again in the future. Bring a picnic lunch and enjoy the views!\nShow less"], ["Reviewed January 2, 2018", 3.0, "Nice drive", "It's insane to have to pay to drive around a neighborhood. This area is beautiful. Note: there are no gas stations. Cold and windy at this time of year."], ["Reviewed January 1, 2018", 5.0, "A must see!", "Beautiful part of the coast line!! its is a must see. I would recommend driving up from Carmel as opposed to down from Monterey- less traffic."], ["Reviewed December 31, 2017", 5.0, "Beautiful and relaxing drive", "Beautiful golf courses, Poppy Hills & Pebble Beach. Also views from along the coast. Must do when in Monterey."], ["Reviewed December 30, 2017", 5.0, "Worth the money", "Very pleasant drive along the coast with some very nice spots. Some houses around the 5th mile are very unique. Beautiful place."], ["Reviewed December 30, 2017", 5.0, "Truly a gorgeous drive!", "Swung by here while visiting nearby Monterey. Scenic drive past large houses and forests, topped by the beautiful views of the water, coves and world class golf courses. We even saw seals on the rocks. Great pictures taken! Well worth the trip!"], ["Reviewed December 29, 2017", 3.0, "Coastal Family Trip", "We started out trip in Vegas then to Yosemite, then Monterey as we headed up to Seattle. For us personally the Monterey / 17 mile drive part of the trip was our least favorite. All was beautiful and appealing to the eyes, but the $10 fee and the tour buses and the enormity of money there just detracted from the beauty for us. Granted we are middle class mid westerners who like to camp and prefer State parks? I'm glad we saw it, but would not feel obligated to visit again.\n\nShow less"], ["Reviewed December 29, 2017", 3.0, "Weather permitting", "Sadly, the day we visited was overcast and drizzly. We couldn't see much at all. I would love to go back on a sunny day."], ["Reviewed December 28, 2017", 3.0, "Pretty drive", "Checked it off the list of things to do while in California. Very pretty drive. Hard not to stop at every turnoff. I am sure the residents hate the tourists though. $10 park entrance. Don't need to do it again."], ["Reviewed December 28, 2017", 3.0, "Scenic drive", "Nice drive but I wonder why they charge for access to this drive? And who is charging? There are prettier drives in the area and Free."], ["Reviewed December 28, 2017", 5.0, "Great drive worth the monety", "The drive from our hotel to the 17 mile drive is also very nice scenic. It cost $10.50 per car to enter the area. The views are incredible, winding roads ocean views. Pebble beach golf course views. Near the end of the drive is the market place. Food, drinks and rest rooms. A must see. Lots of photo opportunities.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Fabulous Drive!", "A relaxing look at California’s coast is a perfect way to end the holiday’s. The easy stopping areas offer great photo opportunities and perfect spots for sunsets."], ["Reviewed December 27, 2017", 5.0, "Beutiful drive", "Worth taking a few hours to enjoy this scenic drive. Beautiful views and sights. Map shows where the stops are plus road signs. very easy to navigate."], ["Reviewed December 27, 2017", 4.0, "Beautiful Drive!", "The drive was very scenic with beaches on one side and forestation on the other. There was a 10.50 USD fee per car which was inconvenient but so worth it. You better come prepared as it can take you through residential areas navigating through roads that go out of the venue.\nShow less"], ["Reviewed December 26, 2017", 4.0, "Pretty but it costs.", "If your driving, it costs about $10 USD to get in. Just like any national park area. Beautiful untouched beaches and ocean. Was quite nice even though the temperatures were quite low. Takes all up about 60-70minutes to do."], ["Reviewed December 22, 2017", 5.0, "Gorgeous fusion of nature and humanity", "If you can bear to get up early while visiting this part of the country, this drive is the thing to do. You drive through forest, beautiful shoreline - and past golf courses and incredible mansions. I love the morning here because it is invariably quieter, which brings out more wildlife. You can stop at various points along the way to take photos, walk, or picnic. It is relaxing and magical. Yes, they now charge $10.25 (I believe that is per carload), and for that you get a map and a well-kept route.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Beautiful Drive", "We picked a beautiful day to take this drive. They give you a map at the entrance. Be sure to stop at all their points and take pictures. Lots of great spots. The views are breathtaking."], ["Reviewed December 20, 2017", 5.0, "Truly amazing and beautiful!", "This is one of the most beautiful coastlines I've ever visited and some of the homes are pretty spectacular too. We traveled the Drive on bicycles which was awesome, you get in free too on bikes.There are several turnout spots to stop at and enjoy the view and ocean. This one is a must do!\nShow less"], ["Reviewed December 19, 2017", 4.0, "A picturesque drive", "Worth doing and reasonable priced at 10USD per vehicle. The whole route takes around 1h 30 mins. If you time it right you can watch the sunset towards the end of the route which is incredible. Be prepared to fight other tourists for the good photo shots as it’s popular!\nShow less"], ["Reviewed December 15, 2017", 5.0, "Fabulous", "Well worth the 17 miles instead of the 3 to go around. Not crazy about the $10.25 fee but something I don't mind paying once, find a way to bike, hike or run would be preferable to me, but it worked in a pinch!"], ["Reviewed December 15, 2017", 5.0, "A Beautiful Sunday Drive", "Look up an open house in Pebble Beach on a Sunday. Give the address to the gatekeeper and skip the fee. Go see the house (ranging from $1mil-50+) and maybe you'll fall in love and move to this paradise."], ["Reviewed December 11, 2017", 4.0, "A worthwhile and picturesque drive.", "The $10.25 entrance fee goes directly into the coffers of the Penble Beach developers, but it's probably worth it to see pricey real estate, breathtaking golf courses, and outstanding views."], ["Reviewed December 10, 2017", 5.0, "Pay the $10.25", "This was a great drive with lots to see. I'd recommend planning for 2-3 hours if you want to stop frequently to take it all in. This place is beautiful."], ["Reviewed December 10, 2017", 5.0, "The most relaxing drive - absolute beauty", "The views and stops along the drive are fantastic. However as you meander through the coastal golf course, you get to see the rugged beauty of the coastline.You get the chance to see and hear the Sea Lions on the small islands just off the coast. The beaches are perfect golden sand.\n\nAn added bonus is seeing some fantastic homes. Finally we arrived in the picturesque town Carmel. It is worth parking up and taking a walk round the shops and streets.\n\nIf you are in the Monteray Bay / Carmel area, this is one trip that you have to do.\nShow less"], ["Reviewed December 9, 2017", 3.0, "Plenty of free California shoreline just as nice", "There is nothing wrong with the vista's along this drive but having traveled extensively in Cal I can assure you there are hundreds of miles of shoreline equally as spectacular as this. In reality only about 1/2 of this drive is coastline. The rest is interior woods and neighborhoods, Right next door is the shore with trails in Pacific Grove. Is this drive worth $10.25? (Why the quarter?) Depends. How precious is a ten spot to you. This is per car, so pricey for solo drivers but chump change for groups. Glad I did it but doubt I'd ever do it again. Hint; if you do go take a lunch and make a day of it.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Beautiful views", "We drove around 17 mile drive at our leisure an it was gorgeous. We stopped at the markers of each mile and got out and had a wander around and took in the glorious vistas. We walked along a beautiful beach, admired the amazing houses and met and chatted to lots of others doing the same. Worth a drive round, an hour or two well spent.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Great Views", "Beautiful drive when the weather is nice. Have done it twice on bright sunny days and the views were spectacular. Don't know how good it would be on a cloudy/rainy day. Nice way to spend an afternoon."], ["Reviewed December 2, 2017", 5.0, "Well worth the toll", "One of the most beautiful sites in America. Well worth the ten dollar toll! The view of the ocean along this drive is absolutely breathtaking."], ["Reviewed November 26, 2017", 3.0, "Good views but not rare in California. Ruined by vibe of surrounding neighbourhoods.", "There is something relaxing and serene about watching waves crash into the cliffs as you sit amongst the sun bleached trees.\nYou know what isn't relaxing? Paying 10 dollars to drive through the gated community and posh golf courses. There was an odd vibe to the place with the display of wealth and fences to keep plebeians out.\n\nDo yourself a favour. Drive from Santa Cruz to Pacifica. It's free, just as beautiful and you don't feel a mixture of being unwanted and exploited.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Surf & Sights of Pebble Peach, Monterey", "We were lucky to spend this year’s Thanksgiving weekend in a Pebble Beach community. Our rented home\nOn Marcheta Lane afforded us easy access to the 17-mile drive. We spent gorgeous mornings on the Bird Rock Point watching the waves crash, the sea gulls swooping low over the ocean spray, the seals and walruses barking from their perch on the Bird Rock which they shared with the gulls, cormorants and pelicans. The 17-mile drive also gave us opportunity to get to other viewpoints, and we captured the lonely Cypress and witnessed a spectacular sunset at the Sunset Point (Also called the Cypress Point). The cypress trees themselves are of very shapes, not seen many place else, and the combination of the forests, rocky shoreline, white beaches and teeming wildlife makes this a must-visit destination in California!!\nShow less"], ["Reviewed November 24, 2017", 5.0, "Beautiful!", "Worth any and every stop! Scenery is so beautiful that you have to plan plenty of time to stop and contemplate the nature and take pictures!"], ["Reviewed November 24, 2017", 5.0, "Beautiful", "Always wanted to make the 17 mile drive. $10 to do it. Worth every penny. Beautiful scenery and wild life. Stop by Pebble Beach Golf Course the pro shop is amazing but not for clubs"], ["Reviewed November 22, 2017", 5.0, "Beautiful drive", "On a beautiful November Sunday, we had a fabulous drive with several stops along the way. Not to be missed!"], ["Reviewed November 22, 2017", 5.0, "Stunning Drive", "Worth 10 dollars, got some great pictures along the route. Kids loved going on the beach and had their 1st dip in the Pacific. Some amazing houses too."], ["Reviewed November 21, 2017", 5.0, "17 mile", "Download the pebble beach app and it will tell you about what you are seeing. The views are breathtaking pack s picnic lunch to eat at the picnic area"], ["Reviewed November 21, 2017", 3.0, "First half much better than the rest", "We started the 17 mile drive near Spanish Bay and went anti-clockwise. So the coastal scenery and cypresses were what we encountered first. Some very good spots; look out for the Sea Otters - just cute guys. And some of the houses were great to check out.\n\nNot being golf types the visit to Pebble Beach was not a highlight, we can now say we’ve been there.\n\nAfter the Highway 1 entrance the route is inland and much less interesting for us. So if I’d realised I’d have quit at that entrance and not bothered with rest.\n\nThe $10.25 entry fee was hard to understand for a public road. But I guess they need to manage traffic.\nShow less"], ["Reviewed November 21, 2017", 4.0, "nice senic drive. .", "famous, but not really worth $10.25 unless full car load. beautiful scenery & views of some great golf courses, homes, ocean."], ["Reviewed November 20, 2017", 5.0, "A pleasant afternoon drive.", "17 mile drive is a very pleasant afternoon drive to see beautiful landscapes and the ocean coast. Lots of places to see along the way."], ["Reviewed November 20, 2017", 5.0, "Gotta do this. Yes, you need to spend $10.", "We took this detour on our ride back to LA. This is a chance to see how the other half lives, so you pass Pebble Beach Golf Club and an inn that charges $700 for its cheapest room. But it is also a chance to see a group of cypress trees that grow almost nowhere else naturally.\nShow less"], ["Reviewed November 19, 2017", 2.0, "Beautiful scenary ruined by posh houses and golf courses! Uggggh No Thanks.", "Well I had heard so much of 17 Mile Drive I decided that we had to go. My husband had been 20 years prior and according to him it wad been totally spoiled and hundreds of luxury million dollar houses had been added compared to the unspoiled views he had enjoyed.\n\nI love Clint Eastwood but when he bought it he decided a fee of $10.25 was fair to access the 'privileged-upscale' area. We drove the entire area and looked at a lot of the properties too. The beach access areas were no doubt marvelous with white sand and no trash. Enjoyable listening to the harbour seals at Bird Point but as you turn around you see the golf courses in the back ground. About 4 of them total and a lot of tourists. I just was so put off that I wanted to leave and won't go back. Imagine what it is like in Summer when schools are out and more tourists are visiting compared to now in November! Uggh No tks.\n\nI debated stopping for a drink and buying a souvenir but changed my mind when I saw the packed parking lot.......I prefer places with less people and tranquility of enjoying the sea on my own.\nI get it though in this location you are buying the privilege of the location-name and it is very well maintained and upscale.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Great Scenic View & Tour of Pebble Beach", "I was recently visiting and at the end of my trip, I decided to pay the $10.50 for the tour. I didn't know what to expect, but I saw some really great thing and I learned a lot.\n\nMy favorite things were all of the stops along the water! What gorgeous ocean views, beautiful scenery - these views are worth the drive alone.\n\nTowards the end of the tour, I stopped and had lunch at the famous Pebble Beach Gold Course. I've seen it on TV but to walk around and see it in person was impressive.\n\nI suggest that you leave some time so you can get out at the various stops to take pictures, enjoy the views or have lunch. It probably took me 2.5 hours in total but I stopped a lot and enjoyed the leisurely drive. If you didn't make any stops - you could probably get through in 40 minutes.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Spectacular views", "Ok our recent visit to Monterey, we decided to take the drive to Carmel. It was worth the $10.25 fee. So many wonderful photo ops! We saw lots of seals, too."], ["Reviewed November 16, 2017", 5.0, "Beautiful view", "This place involves a $10 entry fee. Paying it once will give you access to several beaches. Beaches are well maintained, peaceful and calm. Our favorite was white sand beach and pebble beach. If you love photography, this is must visit place for some exceptional clicks. Would definitely love to visit again.\nShow less"], ["Reviewed November 15, 2017", 2.0, "Nothing spectacular", "Paid USD10 to drive through this and left completely underwhelmed like.. is that it? Maybe we did not visit enough attractions along the drive but overall would suggest travellers to give it a miss."], ["Reviewed November 14, 2017", 3.0, "Another scenic drive, you could save your money", "I guess if you want to see where the rich live this is for you. The views of the coastline are great but can be found elsewhere all throughout the area. They wanted $10.50 in cash, no credit cards. This was an inconvenience, who carries cash while traveling?\nShow less"], ["Reviewed November 14, 2017", 5.0, "Awesome", "Just go! Very well organized. Get a map when you pay and stop at each site and enjoy the views. Very stunning views. The mix of homes and ocean views is breathtaking. Traffic was great when we went, not overly crowded. Loved pebble beach, wow. Walked around hole 18 and I️ was in awe. I️ am a golfer, just loved being on the course. Other stops were great as well. I️ highly recommend doing this. Overall experience was fantastic for us. Light crowds and beautiful weather.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Beautiful drive but packed with tourists", "We did the 17-mile drive on a Friday morning in early November -- you would think it would be off tourist season. And I guess it was based on other reports I've heard about doing this drive in the summer. Still, we shared every view stop with lots of cars and a couple tour buses filled with tourists. You pay $10.25 to do the drive (goes toward maintenance) but the pass is good for all day.\n\nIt was beautiful and scenic, but I far preferred walking along the coastal path in Pacific Grove from Lover's Point to Asilomar Beach ... technically you could also walk or bike from the Monterey Bay Aquarium all the way to Asilomar. You can go at your own pace, stop when you want, and just sit and soak in the scene without bus-loads of tourists rushing to take their selfies.\nShow less"], ["Reviewed November 13, 2017", 5.0, "A magnificent drive", "This was everything we hoped it would be. The scenery on the drive is just stunning. We stopped several times to take photos and the sites were spectacular. This is a must do!"], ["Reviewed November 13, 2017", 4.0, "Good tourist attraction", "Beautiful scenery some spectacular homes. Kind of brings out the voyeur in me, seeing how the top 1% live. Worth the drive. Actually more fun as a bike ride and you don't have to pay."], ["Reviewed November 13, 2017", 1.0, "Paying the wealthy to share their views?", "It has always annoyed me to have to pay to drive through this area. Very wealthy properties. Save you money and head down to Pacific Grove and the Asilomar area. Better yet, spend the money at Pt Lobos Preserve. The views are better in both areas.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Take it clow in an open top and enjoy the view", "we hired (through the excellent Alamo) a v8 Chevrolet and had a blast ! take your time around those bends because there are stopping places to take great photos at every corner, a truly once-in-a-lifetime experience !"], ["Reviewed November 13, 2017", 4.0, "Spectacular", "As a warm up for Big Sur, this is an amazing drive and well worth the $10.25 road charge. it covers all sorts of different types of view and makes for a very relaxing drive between Monterey and Carmel by the Sea!!!"], ["Reviewed November 12, 2017", 4.0, "Spectacular 17-mile drive!", "What a great drive! We took our time and made quite a number of stops. We started at Spanish beach and made our way to the exit near downtown Carmel. Stunning ocean views and lots of birds and seals. Next time we are taking our bicycles.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Beautiful!", "Yes you have to pay to enter, but the chance to see some of the most beautiful homes, at least a small glimpse of these homes is a treat. The area is beautiful, and there are spots along the way to pull over and enjoy the views, beach and water.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Stunning in every sense of the word", "I have driven the 17 mile drive at least 20 times and I never grow tired of it. The character of this drive is unmatched in all the world. Each turn seems to provide some breathtaking vista or forested wonder. I have thousands of photos of the seascapes and landscapes and every time I take more photos I seem to capture something new. The viewing area where the lone cypress is located is worth the entire drive. I have captured it during the fall where a blanket of fog is on the ocean and the cypress is always magnificent. Do not miss this venue if you are in the central coast of California.\nShow less"], ["Reviewed November 11, 2017", 5.0, "A Must In Monterey", "The 17 mile drive is scenic and serene- a must for any visit to The Monterey Bay and Peninsula. We combined wine tasting in Carmel by The Sea and lunch there with this drive back towards Monterey proper. An awesome way to spend an afternoon on the peninsula.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Absolutely Stunning!!!", "Loved every minute of touring along 17 Mile drive. I just love seeing the ocean's waves crash over rocks and onto the shore. An absolute must see if you're in the Monterey or Carmel areas. Also leave some time to stop at the Pebble Beach gift shop (unfortunately I wasn't able). Also took a really close up photo if a deer while driving through cross roads to get to 17 Mile drive. Weather was also great...just a wee bit of fog.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Don't forget your camera!", "This drive is so full of beautiful views, on both sides of the road. Give yourself plenty of time to pull over and take photos. This time of the year the ice plants are blooming and the weather has been sunny, but cool. At times when the fog rolls in, it often blows away shortly. The colors seem more vibrant on the overcast days. The thrill of watching the ocean waves plummet the rocky cliffs, draws my attention and appreciation of the mighty Pacific.\nShow less"], ["Reviewed November 9, 2017", 3.0, "More Buzz Than It Deserves", "Everybody says you have to do this when visiting the Monterey Bay but I find it to be one of the most overrated things to do in the area. First off you have to pay to enter Pebble Beach, although if you rent a bike you can ride in and bike it for free. The other way to avoid paying is to make a reservation at one of the two restaurants associated with the either of the golf courses. Personally as I local I either bike in or go have brunch and drive the road after dining. Frankly if you want great ocean views head south on 1 to Big Sur (it's open again!!) or go to Point Lobos. The admission price is better spent elsewhere.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Sometimes it's fun to be a lookiloo...", "Not going to lie, it was a kick to see the fantastic manors of the wealthy along this drive, and the scenery was gorgeous. One modest mansion on the drive was for sale for a mere $40M. If you have some time to kill and don't mind paying ten bucks to drive a public road, enjoy! The brochure makes a nice souvenir.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Beautiful and tranquil drive along the coast", "This was a last minute decision and I am so glad we did it. We had rented a convertible and that made it even more fun. There are beautiful spots to stop along the way and take pictures or just hang out."], ["Reviewed November 9, 2017", 5.0, "Beautiful!!", "We did this on a Saturday morning in August but its was cool and breezy. Even though it was cloudy and misty the scenery was stunningly beautiful the whole way. Leave yourself plenty of time to stop and enjoy the views and bringing a picnic to have at one of the overlooks would definitely be a good idea.\nShow less"], ["Reviewed November 8, 2017", 5.0, "It is always interesting to see how the other half live, but ...", "I would certainly never do this again. The traffic was terrible and you have to pay! Seriously? Look it up on Google Earth instead!"], ["Reviewed November 8, 2017", 4.0, "Had to be done", "$10.25 to access at the gate where you get the route map marked with all the stops. Take as long as you like (between sunrise and sunset) and follow the red-dotted line along the road. Pebble Beach is a gated residential community between Monterey and Carmel with famous golf courses and iconic vistas. Lovely coastal landscape and wildlife.\nShow less"], ["Reviewed November 8, 2017", 5.0, "CA Trip 2017", "Awesome drive! Worth the $10.25 you have to pay! The ocean sights were beautiful. We didn't have time to stop at all stops but ones we did we're gorgeous to see restless sea and rocks and Beautiful sunset."], ["Reviewed November 7, 2017", 5.0, "Drive of a lifetime", "This will be one of the most memorable drives of my life. As a huge golf fan the chance to drive around the pebble beach estate was exciting enough. This lived up to every expectation and more. The view over the Pacific was breathtaking at every point. Lunch overlooking the 1st tee at Pebble Beach and then a chance to stand behind the iconic 18th green was more than a dream come true. Take a visit to the pro shop too where the staff were engaging, friendly and a free scorecard and ball marker later I was a very happy customer. The views, the nature, the golf, what an incredible place made all the more memorable by hiring a convertible.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Eternal Beauty", "Took a short drive down 17 mile drive. It was just as beautiful as it has always been! Serve was surging the trees were beautiful and the sun was shining 90°! If there were ever a do not miss place to go, this is it! Praise God for all the beauty He has created!!!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Good scenery drive", "17 mile is a beautiful scenery drive near Carmel and Monterey. There are several lookouts that you can stop and take pictures. There is a gate fee when you entering the area."], ["Reviewed November 7, 2017", 5.0, "Really enjoyed this drive", "I found this scenic drive while looking for things to do in the Monterey area. I am so glad we decided to take a couple hours to do the drive. The weather was perfect and the drive beautiful. It was an easy to follow out with very good signage. Lots of pull off areas. Loved looking at all the golf courses that line the way. Be sure to stop at the lodge at Pebble Beach and visit the shops and also take a look at the 18th hole. People at the lodge were very friendly and accommodating. It took us about 2 1/2 hours to make the drive and you could easily spend more time doing it if you wanted to make all the stops and spend time at each one.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Awesome views for a leisurely drive", "We have done this drive a few times and it does not get old. They have improved the parking spots over the years so that it makes it much easier to stop and get out."], ["Reviewed November 7, 2017", 5.0, "Best bike ride ever!", "What a wonderful way to spend the early hours of the day! The little less than 3 hours on the bike felt like seconds. A great and easy trail through magnificent scenery! A must do when in the Monterey area!"], ["Reviewed November 6, 2017", 5.0, "Amazing - well worth $11 fee", "Definitely, take time out to do the 17 mile drive it is amazing. You get so see some amazing architecture and some wonderful wildlife along the coast. There are plenty of places to stop and take photos or a short walk along the coast. The road is well sign-posted and you can get refreshments on route at the clubhouse.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Third time for the 17 mile drive", "This was my fourth visit to the west coast and my third time to do the 17 Mile Drive. It is now $10.50c to do the trip and worth every cent. This time it was a fabulous day and visibility was excellent, I got some lovely sunset shots and will gladly share if anyone is interested.\nAll of the home here are amazing and probably worth millions. The scenery is just incredible and super photo opportunities, we arrived about 1.30pm and stayed till sunset. We had coffee at the hotel and Pebble Beach Golf Club.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Loved the Drive", "Some of the beautiful spots to visit. I am so glad I traveled this road. Started slow as I entered from Monterey, but I was captivated by the views. Ended up in Carmel and I am enchanted. Great photo opportunities every where."], ["Reviewed November 5, 2017", 3.0, "Pretty but underwhelming drive", "Let me start by saying that this was a very pretty drive. If you're in the area and you only have time for one scenic trip, it's totally worth it. We had just spent two days exploring the PCH from just south of the Bixby Bridge to Carmel and our minds were blown by the incredible beauty around every turn. Plus, that drive was free with plenty of opportunities to pull off and take photos. Everyone told us that we should totally do the 17 mile drive on our way north, so we did but I would probably skip it next time. You have to pay an entrance fee and it just felt underwhelming compared to everything we had just seen. I totally get the appeal if you're into golf but if straight up majesty is what you're after, drive south on the PCH and take it all in for free.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Worth the toll", "Lovey views, closer to the coast than big Sue. Lots of places to stop and sign posted clearly. Don't miss it."], ["Reviewed November 5, 2017", 5.0, "Fantastic drive and must do", "Was over in Monterey with a friend and decided to do the 17 mile drive and must say it is worth it. Very nice way to view the CA coast."], ["Reviewed November 4, 2017", 5.0, "Great morning ride", "Worth an hour especially if you want to see Pebble Beach. Lots of neat scenic views. Great map provided on where to stop in the 17 mile road."], ["Reviewed November 4, 2017", 4.0, "Very beautiful coastline", "well worth the money to see this amazing coastline. Have to admit, i was a bit envious of the golfers on the different courses and next time i may try playing on the public courses."], ["Reviewed November 3, 2017", 5.0, "Beautiful", "My wife and I paid the $10.25 and made this drive on an October Saturday morning starting at 8am. The drive along the bay was beautiful, and this early, we were alone at many of the stops. I also enjoyed stopping at Pebble Beach. There is a public restroom at one of the stops along the bay. I highly recommend this drive to anyone in the area.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Spectacular views!", "Well worth the $10. Great nature views, sea otters and sea lions. The golf course are not to shabby!"], ["Reviewed November 1, 2017", 5.0, "Beautiful drive", "Beautiful drive that will have you discovering a high-end neighbourhood and dramatic views on the sea, rocky and sandy beaches, seals and more."], ["Reviewed October 31, 2017", 5.0, "Great Views!!", "Take the time to make this drive - well worth it! Stunning views of the coastline and ocean golf courses. There is a charge of $10.25 to enter, but if you stop for lunch or to shop at Pebble Beach, give them your receipt and they'll deduct it from your bill. Take lots of photos!\nShow less"], ["Reviewed October 31, 2017", 5.0, "Not Worth missing!!", "You get to see some of the breath-taking views of the Pacific from here. You can drive in one's own car but make sure you carry cash for the entry ($10/ car i guess). There are maps given at entry & some of the views are just out of this world. Bear in mind, during long weekends / weekends it might get crowded, so have some spare time handy & enjoy the nature ride. Some of the houses / mansions are well worth looking as well, of course from outside. Wish i could afford a villa / mansion here- God wishing - Amen !! : )\nShow less"], ["Reviewed October 30, 2017", 5.0, "Breath taking view of the pacific", "A great view of the Pacific Ocean. There are maps when you pay at toll booth. A small fee $10.25 a car. Maps show you point of interest. There are places to stop of and enjoy landmarks."], ["Reviewed October 30, 2017", 4.0, "Certainly worth the drive.", "If you have a car this drive for the View is fantastic. We ended at Carmel which is just a perfect stop. We loved it here."], ["Reviewed October 30, 2017", 5.0, "Stunning Drive", "Despite misty weather this drive was well worth doing. The free map they give you at the start of the drive is full of useful information and some of the views are stunning. We also saw Jordan Spieth at Pebble Beach - leaving my golf mad teenage son hyperventilating with excitement! He was incredibly kind to pose for a picture with him - made my sons year! What a lovely man.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Spectacular", "A must-see when in the area. Gorgeous views. Kids loved playing on the beach. Saw cute harbor seals at Cypress Point"], ["Reviewed October 30, 2017", 4.0, "Beautiful, especially at sunset", "We were in two minds about doing 17-mile drive. I'd read a lot of reviews saying that it wasn't worth the money. We decided that for $10, we'd give it a go. I'd say it is worth it - there are some spectacular views.\n\nThere are also lots of coach trips, which I suspect is what irritates other people, but you can avoid them.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Nice and beutiful", "Very nice way! Worth the 8 dollar Beatiful Views! ..... Nice drive. I recommend to bring food and drinks"], ["Reviewed October 29, 2017", 5.0, "MUST DO", "Every visitor to the Monterey Peninsula should do the 17 Mile Drive. It's a wonderful combination of natural beauty, classic golf courses, stately homes and some that are hopelessly over the top. The toll is worth it."], ["Reviewed October 29, 2017", 4.0, "Beautiful drive", "We spent the $10.25 to enter this drive. Some of it is through wooded areas which were pretty common place. However, the parts of the drive along the coast is absolutely beautiful! Plenty of sights and plenty of parking. Don’t forget your camera! We saw seals, lots of birds and even some deer. This is worth a few hours of your time.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Don't miss this when in Monteray", "Well worth the couple bucks it costs. The drive is set up with stops about all kinds of things, but the coastal is the best. A must do!"], ["Reviewed October 28, 2017", 4.0, "Well worth the drive", "Don't miss this one. Several great stops by the water and the lone cypress tree etc. You literally drive beside the fairways of Spanish Bay, Cypress point etc. Don't miss the 'rock towers' on the beach by Spanish Bay"], ["Reviewed October 28, 2017", 5.0, "A must visit", "This was our first look at the fantastic scenery along the coastline. it was most definitely worth the cost to make the drive."], ["Reviewed October 28, 2017", 5.0, "Bike ride", "We did bike ride from Cannery row to the lodge at pebble beach, with the kids (8-3)\nMy daughter did the ride by herself I was carrying my son! We ride all the way to the lodge had lunch and ride back again! Beautiful scenery, lovely day out in family\nShow less"], ["Reviewed October 28, 2017", 5.0, "Beautiful views", "Definitely worth the $10.25 fee. Stunning views and countless picture taking opportunities. A must see!"], ["Reviewed October 28, 2017", 5.0, "Beautiful drive", "This was a great experience. I bought a sports car 10 years ago for this trip and finally made it. The views are amazing and there are many places along the way to get out of the car a enjoy the views. My two quibbles would be that in some areas the road signs aren't clearly marked and that motorcycles are not allowed.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Relax and absorb its beauty", "Just getting there passing through Pacific Grove and its ruggedly beautiful coast sets the stage for submerging yourself in the majesty of this virtual paradise. Viewing the so often photographed Cypress tree is like finally seeing a long lost friend."], ["Reviewed October 27, 2017", 5.0, "The views can’t be beat", "Such a lovely drive and well worth the $10.25. Sometimes was crowded because of your buses. The housing was incredible through the golf course. A must see if in Monterey!"], ["Reviewed October 27, 2017", 3.0, "Scenic Drive", "This drive is scenic, as you will get a chance to see the Pacific coastline. However, I thought it felt too much like a resort area. While the coastline is impressive, you go to see the million dollar homes along the coastline. If you are want a feeling of being surrounded by nature, this is not the place for you. I would suggest taking a drive along CA-1 going through Big Sur. There you get a chance to view the coastline from up high, and the views are much better. Also, if you do take this scenic drive, download the app \"17 Mile Drive\" so that you can hear about the history of the area.\nShow less"], ["Reviewed October 27, 2017", 5.0, "17 Mile Drive is Absolutely Beautiful!", "This part of the coast is AMAZING with the waves CRASHING into the rocks. We typically go to the East Coast southern beaches (closer to us) and these are nothing like them. If you are wanting an active beach trip this is the place to go. Hiking is available as well as bigger waves for surfing. The scenery is very uncommercialized for the most part. However, if you want a \"lay on the beach\" type vacation, this area isn't, for the most part, great for that. Plan to spend all day driving and getting out frequently to take pictures. Its not something you just want to view from the car as you quickly drive by!\nShow less"], ["Reviewed October 26, 2017", 4.0, "This costs money! But worth it.", "We did not realize that this costs money until we were at the entrance gate. No indication of this in the brochures we picked up. The app is neat but a little tricky to navigate and use with Bluetooth. The beach spots/sunsets are beautiful and I recommend planning the drive around a little picnic or beach visit, spending some time there instead of just driving through. You will feel more like you got your money’s worth. The houses are neat to look at too. The bathrooms near Bird Rock were not that great. Also plan it so you end before dark. Seems obvious, but not much to see on a scenic route after dark.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Worth The Drive", "We rented a car when we arrived on the cruise ship. It was worth every penny. The scenery is lovely with lots of places to stop along the way. There is a fee to get onto part of the drive which leads you up to the Pebble Beach Golf course and it is worth the price of admission.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Amazing!!", "Truly an incredible drive with breathtaking views of Pebble Beach. You can drive at your own pace, explore and take in nature, wildlife and ocean views"], ["Reviewed October 26, 2017", 5.0, "Gorgeous scenery", "Beautiful drive along the bay with convenient parking for photo ops. Wish I could have taken better photos of the golf course for the golfers in my family."], ["Reviewed October 25, 2017", 2.0, "Rip Off", "It's just a drive through a neighborhood. No big deal. Skip it. These fees must pay the home owners accociation for the wealthy residents. No thanks."], ["Reviewed October 25, 2017", 4.0, "Totally worth the entrance fee", "We weren't sure whether this would be worth the $10 entrance fee but we really enjoyed this most scenic drive along the coastline in Millionaire's Row. It was interesting to see the faux European style houses that been built sparing no expense, they are really something to see. Some are the most crazy designs but others absolutely beautiful, and huge! If you're interested in nature, property or design, you'll be in seventh heaven!\nShow less"], ["Reviewed October 24, 2017", 5.0, "This is a must!", "You really must do this drive if only part of it. There are so many stopping places to see the natural beauty and prime areas of the peninsula. Its the easiest way to take it all in. Pack a lunch and go!"], ["Reviewed October 24, 2017", 5.0, "Great and easy drive to take, worth it.", "Just know that you must pay $10 to enter the park that the drive is in. It has beautiful views of the ocean, wildlife, and upscale houses. At the other end is Carmel, a charming little town worth a walkabout. Don't miss it."], ["Reviewed October 24, 2017", 5.0, "Vacation", "Beautiful, will definitely make the drive again. Take advantage of the 20 stops to get out and photograph the beauty of the beach and the ocean and to take a stroll along the beach. Download the Pebble Beach app. It will narrate the area you touring.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Beautiful drive....", "This is a stunning 17 mile stretch around the pacific ocean. Lots of stopping points for pictures. A must in Monterey"], ["Reviewed October 23, 2017", 4.0, "Great trip", "Our day tour to Monterey and Carmel was wonderful with many stop along the way with beautiful scenery of the Californian coast line, Pebble Beach Golf course the Lone Pine tree.\nMonterey Cannery Row was very interesting history of the Sardine fishing industry . Bubba Cumps for lunch was amazing. The stop in Carmel was as good meeting a local restaurateur with stories to tell about the town and the local community beautiful spot. The tour guide kept us entertained with local knowledge and the odd story whether true or not very good. All and a great day tour. Back in San Francisco in time for dinner\nShow less"], ["Reviewed October 23, 2017", 5.0, "What A Stunning Place", "Sometimes in life you have to go with the flow and do the really touristy stuff and sometimes you're chuffed that you did. 17 Mile Drive is one of those times.\n\nThat said, I did spend the whole time wishing I had my bike with me because if you're a roadie, you'd be in paradise.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Beautiful/ A Must-See!", "We really had not planned on touring the 17 mile drive for several hours but we were so happy we did. We ended up having lunch at Roy's which was fabulous (get the short-rib). Take lots of photos and enjoy nature's beauty."], ["Reviewed October 23, 2017", 4.0, "Interesting drive", "Does what it says on the tin, lots of places to stop and take photos, ends at Pebble Beach golf club, to please the hubby!"], ["Reviewed October 22, 2017", 3.0, "Typical coastal drive + rich people", "Not sure whether this was worth the $10.25 for entry. For those who are interested in seeing golf courses, mansions and disneyland for old rich white guys, this might be up your alley. Otherwise, head south on highway 1 and enjoy similar beautiful views and places to stop on the road to big sur.\nShow less"], ["Reviewed October 22, 2017", 4.0, "A nice experience", "While staying in Carmel, we decided to drive through the 17-mile drive. A fee must be paid for non resident.\nIt is a nice drive with several interesting and scenic stops over. Nature is just astonishing.\nIf you are in the area, I highly recommend the experience.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Spectacular", "This road is famous for the Pebble Beach Car Show and golf course. The coastal scenery is breath taking You pay $10 per car at the entry point."], ["Reviewed October 22, 2017", 5.0, "View upon view", "Having stayed at pebble beach we travelled along 17mile drive unshore why people raved about it but breathtaking scenery amazing wildlife you do have to pay $10 to enter pebble Beach if you not staying but the drive is worth a stop at each point and if you do a later drive the sunset at spanish bay is fantastic you will have to wait to park at some points as it can get busy and don't be in a hurry as most cars are driving along slow to admire the scenery between points\nShow less"], ["Reviewed October 21, 2017", 5.0, "Epic Drive", "If you're in the area and haven't been to Big Sur, take this drive. The coastline views are epic and one-of-a-kind. Plan for a little shopping and lunch in Carmel."], ["Reviewed October 21, 2017", 3.0, "Beautiful Scenery but...", "We had driven along the coast and paid $10 to enter Pebbles Beach to keep on the 17-mile drive. Most of the stops had too make flies and insects in swarms. I am not sure if this is a one-time phenomena or they are always there. We certainly did not get out of the car because of the swarms of insects on most stops and on the other stops, there was a potent smell of organic matter which was intolerable. There are too many coastal view points in Carmel and on Route 1 so we could have done without entering Pebbles Beach.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Beautiful drive", "We stumbled upon 17 mile drive on accident, and I'm so glad we did. Sweeping views of the dramatic landscape, a true life-experience memory we'll always have."], ["Reviewed October 21, 2017", 5.0, "The Monterey coast is beautiful!", "We drove the 17 mile drive yesterday. The views were spectacular along the coast. We stopped at the beach by Pebble Beach Golf Course. We also stopped at Seal Rock. It was covered with sea lions & harbor seals. The crashing waves were really cool too. The drive is definitely worth the $10.25 it costs.\nShow less"], ["Reviewed October 20, 2017", 5.0, "We love biking around 17 mile drive! It's the best way to enjoy it.", "We do this ride every year! We love bikig 17 mile drive, leaving by 7am to beat the tourists and crowds, we have the road virtually to ourselves! We ride to Carmel, have a pastry and coffee at the bakery in Carmel on Ocean Ave. and then bike back! Heavenly!\nShow less"], ["Reviewed October 20, 2017", 1.0, "Nice drive, but $10, really!?", "Wow! Americans really will try an charge you for anything. The drive was lovely, but its really not worth paying for, not when you consider that you have hundreds of miles of the PCH to drive on for free, where you will find equally as good views.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Stunning views and amazing homes!", "We got on the 17 mile drive at Pacific Grove and got off at Carmel by the Sea. The day we took the drive was sunny and clear which made seeing the sights and taking pictures absolutely perfect. Of course we had to stop at Pebble Beach and walk around the beautifully manicured golf course. I can see why people live inside this 17 miles of protected paradise!\nShow less"]]}}