{"26-Mile Bike Path": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "26-Mile Bike Path", "url": "/Attraction_Review-g33052-d110204-Reviews-26_Mile_Bike_Path-Santa_Monica_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/a4/f7/b8/bicy-cross.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1226"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Santa Monica", "addressRegion": "California", "postalCode": "90403", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Must do while in Santa Monica", "Your hotel may offer a bicycle as part of your room package if not there are bike rentals. I recommend riding to Venice Beach, there are many shops and restaurants as well as the Venice Beach Muscle Beach Area."], ["Reviewed 5 days ago", 4.0, "See it all", "The beaches are lovely. They were pretty empty but there was lots of action along the path. We enjoyed our bike ride and saw all manner of wheeled action from bikes to skateboards to motorized scooters and rollerblades. There was a bagpiper out, some homeless people along the path, people pumping iron at Muscle Beach, and folks out slacklining. The ride up Washington to the bike trail to Marina del Rey wasn’t bad but we had to turn back before making it to Redondo Beach so I can’t speak to whether that part was worthwhile. Overall a lovely way to spend a few hours.\nShow less"], ["Reviewed 6 days ago", 4.0, "Lots of fun path", "It is to be able to appreciate diversity in people, cultures and follies. I did not like that the whole path smells of marijuana, I did like that my children could experience coexistence with those who think and do differently and that it is up to each person to be whatever they want to be. Here we could see everything from semi-naked people, drugged to healthy and doing fitness, but all fun. The things that are sold in business are great and the atmosphere is spectacular. There are urban artists who sing and dance and you can interact with them all. It is a must to visit if you come to Cali.\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome Bike Path!", "No trip to Santa Monica is complete without riding the bike path! My wife and I rented two bikes and rode from Santa Monica to Venice and back. We had a great time sightseeing and checking out all the shops and things to do in between. I was amazed at all the different activities people were doing along the path such as yoga, volleyball, basketball, dance, spray painting, selling arts & crafts, filming a music video, etc. There was never a dull moment. I would highly recommend you ride down this bike path :)\nShow less"], ["Reviewed 1 week ago", 5.0, "Blading on the Bike Path", "Fantastic. Love it. It is one of the best paths in the world to blade on. Some great places to stop off as well."], ["Reviewed 2 weeks ago", 3.0, "It's a BIKE path, not a walking path", "We've ridden this BIKE path many times and almost everytime, someone has stepped out in front of me and I've gone down. I'm too old to fall."], ["Reviewed 2 weeks ago", 5.0, "Fun path", "This is a great bike path. Many fun areas to stop along the ride. A lot of food and drink also. Beautiful on a sunny day."], ["Reviewed 3 weeks ago", 5.0, "So fun!", "Loved this bike path. Part of our fav thing to do during our trip to Santa Monica. Rode from Samar Monica to Venice beach and back. The path is easy to use and everyone seems to respect the designated bike path areas. A ‘must do’ for any stay in Santa Monica/Venice\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Crowded on weekends", "...but a lovely place to ride a bike during off hours — you can ride all the way to Manhattan beach along the lovely coast, stop to eat, and ride home— a great way to spend the day!"], ["Reviewed 3 weeks ago", 5.0, "Nothing can beat biking at the beach!!", "I have lived in SoCal for a long time, and have to say nothing can beat biking at the beach!! You get to see a lot along the strand."], ["Reviewed January 24, 2018", 5.0, "My favorite part of Santa Monica", "One of the best bike/walking/rollerblading paths anywhere. Beautiful scenery and everyone having fun."], ["Reviewed January 22, 2018", 5.0, "Fun Ride through several Los Angeles Beach Neighborhoods", "I have riding this path for many years, and it is truly an iconic Los Angeles, must see-and-do highlight. A great way to see several of the most interesting beach neighborhoods in LA.\n\nFor athletic and attractive people watching, to interesting street performers, to countless beach goers, as well as great sightseeing, this path has it all.\n\nDesigned for cyclists, skaters and other modes of wheeled transport, this path allows for \"traffic free\" passage along the beach-front. That said, it can get busy on weekends and often pedestrians can overlook the rules, but all in all it is a great bike path where most people adopt to the rules making for a great experience.\n\nThe path runs from Santa Monica Pier, South through Venice Beach and Marina Del Rey.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Great riding on weekdays in the morning", "This is an excellent bike path. Beautiful scenery, pavement in generally good condition, and if you ride the full length it passes through some of the best places in SoCal. The afternoon winds can be an issue if you're headed north in the afternoon, so schedule accordingly. But avoid it on weekends at all costs. Saturdays and Sundays bring so many utterly oblivious pedestrians that riding it will become an exercise in frustration, and actually dangerous. Summer weekday afternoons can also have similar, if slightly less extreme, conditions. And the area right around the Santa Monica pier is always pedestrian congested and they never bother to look both ways, or even look up from their phones, as the cross the path.\n\nBut on quiet weekday mornings, it's utter heaven!\nShow less"], ["Reviewed January 20, 2018", 4.0, "Great way to see the area", "We had bikes from our hotel and enjoyed a ride through Santa Monica, Venice Beach, etc. the path is well marked and large enough to share the road with walkers, skaters, and skooters. Many things and people to see along the road so you have to keep your eye on the road. We would have gone further and perhaps out to Malibu but it was slow going with our very heavy comfort bikes, 3 gears, and lots of people.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Loved biking along the ocean!!", "Loved biking along the ocean!! This is a beautiful, safe path with outstanding views. Its easy to bike to breakfast on the beach, or even other towns."], ["Reviewed January 17, 2018", 5.0, "Perfect for a scenic bike ride", "This is a great way to see the West LA beaches. We usually ride from Santa Monica to Venice to grab a few drinks at sunset."], ["Reviewed January 15, 2018", 5.0, "Great views", "Great views, very safe path - in need of exercise or to relax -- make the effort to use this bike path!"], ["Reviewed January 12, 2018", 5.0, "Hire a bike - The pathways are great and you see alot more than by walking.", "Hire your bike for the full day its much cheaper at $30US than by the hour at $10US Bikes have their own paths so you dont have to dodge those walking and your safely off the busy roads and for those who love to cycle you can take your bike and see all the beaches along the coast. The weather in January is perfect for cycling with temps around 20-24 with a nice breeze coming off the ocean - You cant beat it.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Great experience", "Rented great bikes from Santa Monica Beach Cycle Rentals for $15 a day. Enjoyed a ride down to Venice Beach, The canals and back. Great path. Well worthwhile."], ["Reviewed January 7, 2018", 5.0, "Fun way to spend the day", "Renting a hulu bike is a cheap and enjoyable way to ride up and down the coast and feel the ocean breeze."], ["Reviewed January 5, 2018", 5.0, "Great ride from Santa Monica to Venice Beach", "Hired a tandem and two individual bikes to ride from Santa Monica to Venice Beach - great afternoon after a few days at Disneyland!"], ["Reviewed January 3, 2018", 4.0, "Probably the safest bike path in LA", "My friends and I always take this bike path to avoid traffic and parking during the summer months. It’s a great way to exercise and from LAX to Santa Monica, it’s only about a 30 min ride. Save gas and ride a bike."], ["Reviewed December 31, 2017", 5.0, "Bike trail from pacific palisades to Palos verdes", "Great bike trail on the beach. Can go for miles. It does get really crowded in spots (Venice, Santa Monica). Flat, smooth paved bike path. Great for cruising or more stenosis biking. Please wear a helmet. So much activity and opportunity for a collision."], ["Reviewed December 31, 2017", 3.0, "Parade of Humanity", "If you enjoy people watching and can tolerate crowds, this may be for you. Living in LA County, our expectations are clear. However, when in Santa Monica, we will do a few miles on the path for the light exercise and ocean air. For native New Yorkers, as we are, we consider this Central-Park-by-the-sea.\nShow less"], ["Reviewed December 24, 2017", 5.0, "A must do!", "My family took the bike path from the Santa Monica Pier to the end of Venice beach. It was the highlight of our trip! If I had the bike rental longer I would have taken the whole path!"], ["Reviewed December 23, 2017", 5.0, "Can't beat this...", "Absolutely amazing opportunity to see the beachside communities of LA while careening along the Pacific coast. Grab a bike or motorized scooter ...and get going!"], ["Reviewed December 23, 2017", 5.0, "Grab a bike and go!", "We rented bikes at Loews. $8/hr! DEAL! We had a few cruisers and a hybrid. The path is well taken care of! This makes for an easy way to see Santa Monica and Venice Beach areas! A lot of walkers wander into bike path and sometimes it is a shared path. Wave and say \"Hi\" to the most interesting humans around! I wish I had time to stop and get a massage by the beach from the therapist waiting by the path! Venice Beach is quite interesting and it educated my kids in a different way. They now know distinct smells! @_@ And they learned valuable lessons about homelessness and other lifestyles than ours. All in all a great experience! Stop and enjoy the beauty!\nShow less"], ["Reviewed December 19, 2017", 5.0, "Awesome boardwalk to ride anything on wheels! Great beach boardwalk location!", "The best way to travel in Santa Monica on the beach! We love this bike trail! You never know what you might see! From skateboards, bikes, scooters, strollers, joggers, walkers, and our 4 legged friends everyone enjoys having the beach and open air to cruise to. Grab your Bluetooth speaker and cold drink you are sure to have a blast. Even threw Venice it seems to be a different world. We love that the entire area is diverse and outdoors! Please be mindful of the beach people and park people you see that made the beach and areas around the bathrooms there home. If you keep your eyes open you may even pass a star!\nShow less"], ["Reviewed December 12, 2017", 4.0, "Great fun!", "We rode from Santa Monica pier to Venice beach return. It was great fun and magic weather. Several places to get food/drink along the way."], ["Reviewed December 10, 2017", 5.0, "Awesome bike path", "Have been riding this bike path since I was a kid. The cities have done an amazing job of making this a fun and safe place to ride from town to town without worrying about cars. Good for adults and kids alike. Easy and mostly flat with a view of the beaches that can’t be topped. Only downside is lots of people, but it is LA and that is what makes it interesting. This is one of the things I miss the most since moving to San Diego, but I still come back several times a year to visit and walk/ride the strand.\nShow less"], ["Reviewed December 5, 2017", 5.0, "peace and biking", "don be shy, rent a bike and ride. this path is flat and fantastic, you will cross several neibourhoods and sigth seeings, but avoid the touristc attractions and popular stores, research before go, cause there is a lot of trick offers on the beach front. ask for hotel assistante and rent a bike in your hotel, its better.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Great way to see the beach cities!", "Favorite place to walk my dog, go for a run, or just people watch in Santa Monica and Venice. You can see the vibe and atmosphere change as you travel through different cities along the path. There's muscle beach if you're in the mood for a workout, and the tight ropes and acro equipment if you want to watch people performing superhuman feats. Definitely worth an hour or two!\nShow less"], ["Reviewed November 22, 2017", 5.0, "A pleasure", "Very nice to walk from Santa Monica to Venice , brunch at \" eggslut\" and ride the bike bath back . Sunshine and great views . Surprised to see homeless encampments . One of the simple highlights of our trip"], ["Reviewed November 16, 2017", 5.0, "This is a must do", "We had such a great time riding bikes up the Ocean to Venice beach. Ours were in with our hotel deal. They are so easy to ride to very chichi do it it’s great fun."], ["Reviewed November 16, 2017", 5.0, "Love Riding - then you'll love this bike path", "Not only is this for bike riders, but throw in the skate-boarders, roller skaters and straight up pedestrians - makes this a hibe of activity and a great way to get into the true Californian groove. Highly recommended - for sight-seeing as well as exercising and just getting around on a budget\nShow less"], ["Reviewed November 13, 2017", 4.0, "Be careful", "Great path but with everyone looking at the sites it can be a bit dangerous! We were there on a Saturday morning and rode from Santa Monica Pier to Venice (about 10-15 minute ride), saw a kid have a very bad wipe out with lots of cuts to knees hands and face so be careful!!!!\nShow less"], ["Reviewed November 13, 2017", 4.0, "Nice route", "Here you can ride on funny looking bikes, others go inlines or rollerskating.Do not expect any tempo training, as this paved stretch will also be filled up by walkers.Also note that many turists on bicycles do it for the first time in life, so sometimes it becomes chaotic\nShow less"], ["Reviewed November 10, 2017", 5.0, "Always a must do when visiting LA's beach towns", "The light version is to rent a bike in Santa Monica and turn around at marina del rey at Washington. This will take an hour or two depending on your speed and stoppage.\n\nThe full version is to go all the way down to Manhattan beach. This requires a medium to high level of health as you will be on a bike 2 hours each way.\n\nI like to do the full and do a good 2-3 hour stop in Manhattan beach to eat and hang out at the beach...i think a lot more stuff going on then in santa monica (less tourists)\n\nalternatively, rent a bike down in Manhattan beach and do a light Manhattan to redondo round trip that will be 1-2 hours max.\n\neither way you can't lose. wear sunblock and be very careful with all the tourists crossing the bike path without watching where they are going.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A must do", "The best way to view the South Bay beaches is on a bike. Sun, sand, ocean, people watching, exercise. Check prices online of bike rental costs if you don't have your own bicycle as there is much variance in costs. Most of the path follows the edge of the strand, but at times will go around obstacles. Also during very busy weekends, you will be directed by signage to dismount and walk your bike for safety sake. Just remember that on a hot day the path is not circular, so you will have to cycle all the way back to your starting point.\nShow less"], ["Reviewed November 3, 2017", 5.0, "What a great way to spend the day!", "We cycled north as far as we could (not very from SM) - a lovely ride and saw a school of dolphins playing close to the shore on our return, what a thrill. South we only went as far as Venice, but stopped off along the way at the skatepark and muscle beach, and went inland at Venice to cycle round the canal area and Abbott Kinney. A great way to catch the sun and get around - would thoroughly recommend Ron at Santa Monica Bike Rental on 4th- cheap, and lovely easy service. Just be very careful not to accidentally ride down onto the freeway when coming off Ocean Ave to the sea, by the pier!\nShow less"], ["Reviewed October 29, 2017", 4.0, "Wonderful bike ride", "This wide and fenced bike path is perfect for the family. It is safe, wide and clean. It takes you right to the Santa Monica Pier, restaurants and shopping."], ["Reviewed October 26, 2017", 4.0, "Long, flat bike path", "You can rent bikes at several along the bike path. The middle of the day tends to get very hot, so early or later in the day works best. And watch out for pedestrians. Even though there are separate paths for bikes and pedestrians, some of them don't pay attention.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Great SoCal Experience!", "My husband and I borrowed bikes from our hotel and rode just from Santa Monica to Venice Beach and back. We stopped for brunch in Venice Beach and spent some time watching the skaters in the skate park and the whole trip tool about 3 hours. The path is flat and pretty wide although it narrowed in Venice Beach. It was fun to see Muscle Beach, the surfers, and people watch in general. You get a fun LA vibe by doing this path. It was fairly crowded when we were there in October, so I imagine it's worse in the Summer. You just have to be patient and try not to hit the pedestrians that decide to walk on the path. It's very flat and an easy ride with great views of the beaches. I highly recommend.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Worth doing", "Great flat ride with the most interesting sights and sounds along the way. However caution needed with wayward pedestrians walking along the bike path and sand making some areas a bit slippy under the wheels. Fairly easy cycling even for this 50 year old, overweight woman. Great fun would recommend.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Favorite activity in Santa Monica", "Loved renting bikes and riding down 26 mile path in Santa Monica/Venice Beach. Two seperate paths for bikes and pedestrians!"], ["Reviewed October 17, 2017", 5.0, "Bike Path", "Loved this bike path. Rode in mornings up to Canyon Road intersection where path signals no bikes past a certain point, then back past the pier to Venice beach again where the path seems to divert you to a road to continue South. I think navigating past the Marina the path continues to earn its name. But wasn't quite sure of how to connect the path from Venice beach to the path past the Marina. Just got off the plan from Australia and I was a bit scared in right sided traffic and didn't really like the traffic volume on a major road that must have taken you to the path continuation. So I just did some loops of the above and loved it\nShow less"], ["Reviewed October 16, 2017", 5.0, "Absolutely Excellent - Just Go Early", "Hired a bike from a reputable shop and headed out from Santa Monica Pier towards Venice Beach and Marina Del Rey.\n\nTook it easy taking in the sights. Fantastic way to start the day. It gets really busy later in the morning onwards at weekends so an early start is recommended.\n\nA little snakey in parts and loose sand blown over the path means care needed...... Just don’t bomb on.\n\nSuperb sights and easy to navigate too. Felt 100% safe.\n\nCame back under the pier after Venice and Marina and headed the other way to take in the less interesting but still worthwhile pathway including a steep incline up to the promenade - optional if you are not adventurous or fit.\n\nBest experience of my short stay. Fantastic experience and would highly recommend.\n\nShow less"], ["Reviewed October 16, 2017", 5.0, "I wish London had this too", "It is a very safe area: safe for biking etc or simply walking. The views are also to die for and whether you are in Marina del Rey or simply walking towards Santa Monica, you have the ocean with the sand to one sand and some amazing houses, in some areas, or shops, restaurants etc\n\nYou can see the fitness fanatics or the street vendors selling some rubbish or little souvenir shops: also what I liked is that people are so friendly.\n\nAlthough it can be very cold when the wind picks up - so make sure you dress appropriately.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Great concept for a large area", "This paved walk/cycle lane is fantastic to have in such a busy tourist location.\nThe paved cycle path is generally home to cyclists, walkers, runners, skateboarders, rollerbladers etc.\nThe whole pathway is safe with pedestrian crossings over to the beach at safe locations.\nThe pathway takes you from beyond Venice beach on one side right the way down Santa Monica beach and well beyond.\nThere are garbage cans dotted along the way so usually remains clean and litter free.\nDog owners are really good at cleaning up dog mess also.\nThere's usually a police presence seen alone the long stretch usually around the Venice beach location which is reassuring.\nThere many restroom facilities along the way also and plenty benches to sit back and enjoy the ocean.\nShow less"], ["Reviewed October 12, 2017", 5.0, "The famous 26 mile coastal path!", "We've done the whole ride - in stages!\n\nIt is best done on a week day as weekends are quite crowded. Easier to bike during week. Any time is a good time but fall and spring especially nice as the summer crowds have thinned and the weather is usually delightful.\n\nPart of the ride we have done many times, just from Santa Monica through Venice is great fun.\n\nThe characters that you see along the way are a big part of the adventure. I recommend taking plenty of time over the path - drink in the experience!\nShow less"], ["Reviewed October 10, 2017", 5.0, "excellent way to see the beach communities", "IF you do the whole 26 miles ....It is a long ride. It is equally fun to do portions of the bike path. It is best done on a week day as weekends are quite crowded...high speed bikers, children with poor bike control, walkers who seem unable to read the bike path sign\n( there is a walking path). Easier to bike during week.\nAny time is a good time but fall and spring especially nice as the summer crowds have thinned and the weather is usually delightful. THere are rentals just north of the Santa Monica pier and many places in between.\nGoing just from Santa Monica through Venice is fun..stop for snacks or a meal, enjoy watching some of the skaters and boarders, admire art work and jewelry ( more on the weekend)\nIf you elect to do the whole 26 miles you will be off the water path and on a street path to get through the marina. Do wear a helmet especially there.\nYou could also start in Redondo beach..walk that pier, have some seafood, crack your own crabs if you like but you will smell like crab the rest of the day. The path to the marina would be a good ride. Get off the bike in Hermosa Beach or Manhattan Beach and look at the shops one block up. On second thought, might be better to bike and do those shops as a walking day later.\nYou can watch beach volley ball players, especially by the Manhattan Beach pier. Do not turn your head to the side to ogle the players or you may go into the sand and over the handle bars head first!!!...not necessarily lethal but definitely embarrassing.\nIT is such fun to be out biking that you may forget to watch where you are going.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Flat w/ a sea breeze", "The bike path is well marked along the beach. When the path goes through Marina Del Rey it can be a little confusing. Heading down Washington turn right onto the path after the pond. Follow it along the park until you cross the street at the library. Its marked through the parking lots.\nIf you choose to ride between santa monica and venice keep an eye out for novice riders stopping without notice and pedestrians not paying attention.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Beautiful Beach Views", "Until I developed a medical disability, I used the 26 mile bike path almost daily for two years and never got bored. The views of the ocean and the backdrop of the Malibu Hills are always delightful, and the trail is great for people watching. My only caveat is that not all of those miles are created equal. Heading south from Will Rogers State Beach, you will cross two large parking lots (not scenic in themselves, but with elevated ocean views). These are usually almost empty unless the Beach is being used for a film shoot--and if it is, there's activity to dodge, but it is interesting to watch. As you descend into Santa Monica Beach, the scenery is more typically beachy and then you'll travel through a tunnel under the Santa Monica Pier and emerge into \"old\" Muscle Beach which is often full of folks doing fantastic feats on ropes, rings, and slack wires. A little farther south and you're in Venice Beach which has a whole new vibe of street vendors and performers. Here the bike trail will take you by a fantastic skateboard park, and it is worth your while to stop and watch the antics. Alas, about a half mile farther south your beach idyll is interrupted by an inland swing through Marina Del Rey. This part of the trip runs a zig-zagging course on city streets and through ugly parking lots. I usually stopped my bike path journeys at this point, preferring to cover the pretty part several times in order to increase my mileage.\nShow less"], ["Reviewed September 28, 2017", 5.0, "DO IT!", "Rent a bike - approx. $20 per day - and do the bike path. It takes you all along the beach in both directions. The path is pretty level so no particular fitness level is required. It was a great ride with beautiful views and being right on the water you didn't overheat.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Quintessential LA experience - packed full of attractions", "Have done this ride 3 times in 4 years with the kids. Each time on holidays from Australia and not staying in Santa Monica. We make the trip from DTLA just for the ride .\n\nIt is a must do ... again and again ... You spend an hour or a day.\n\nSo much to see and do along the ride:\n\n- Santa Monica pier\n- exercise equipment (have to try the ring swings)\n- Muscle Beach\n- pick up basketball\n- hand ball\n- beach volleyball\n- beach\n- ice creams stands\n- Venice people watching\n- Venice markets\n- skate bowl\n\nThat is all just in the short section from Santa Monica to Venice. Can also go in land at Venice to the canals and Abbott Kinney shops (both definitely worth doing).\n\nThere is always something different to see or some event on as well.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Terrific way to get some gentle exercise", "What a great way to see Santa Monica and Venice. Very easy ride, except coming back up the incline from beach to street level. Very well designed and maintained. A must do."], ["Reviewed September 24, 2017", 5.0, "Number one thing to do in Santa Monica.", "Loved cycling on the cycle path. Disappears in Venice Beach so look on a google map if you want to cycle more than the 3miles from Santa Monica to Venice. Need to find the path which goes round marina del Ray"], ["Reviewed September 20, 2017", 5.0, "Loads of fun", "The bike path is awesome ! We hired bikes and road them down to Venice beach where we returned them . Great way to see Santa Monica beach ."], ["Reviewed September 19, 2017", 5.0, "Worth the Visit", "We were pleasantly surprised to discover the 26 mile bike path. We were staying in Venice Beach and rented bicycles from a local vendor. The bike route is amazing. It mainly runs on the bike path along the ocean, but for a brief time in Marina Del Ray, the route takes you along a busy road. So, if you have children, be aware you will need to watch them during this part of the route. The path passes by such beautiful homes and scenery, it was definitely one of the highlights of our visit to this area. There are food stands along the route so you are able to purchase snacks and fluids as needed. Enjoy!\nShow less"], ["Reviewed September 19, 2017", 5.0, "free and great to walk or bike!", "you can rent bikes at various locations. Its a very easy ride! We walked it from Santa Monica through Venice and it was a great workout. plenty to see and do along the way!"], ["Reviewed September 19, 2017", 4.0, "bikeway with lanes for both directions", "Quite broad bikeway with 2 lanes, one for each directions, so this makes this bikeway quite comfortable. It goes parallelly to the walkway most of the time."], ["Reviewed September 17, 2017", 5.0, "Endless hours of free fun !", "Epic route with great views and plenty of places to stop along the way for beach, food, relaxing, pier, shops, etc.... Rentals shops all along to pickup some bikes, segways, tandoms, etc...."], ["Reviewed September 17, 2017", 5.0, "SEA MIST", "We rented from sea mist and hired good bikes with baskets for $20 for the day\nFantastic value!\nWe first cycled towards Malibu and considering it was a Saturday it was quiet\nWe crashed out on the beach for an hour the came back to the pier locked the bikes and went into town for lunch\nWe then cycled out past Venice , again it wasn't too busy\nWhat a brilliant fun day out !!\nIt'll last long in our memories after we head home to a cold rainy UK\nShow less"], ["Reviewed September 16, 2017", 5.0, "Tandem fun had by all", "We hired 2 tandem bikes for the family ( kids 10 and 8) and loved it, we started at Santa Monica and biked past muscle beach to the pier south of Venice beach and back, it was a great 2 hours, the bike path was excellent, busy but no dramas, this two hours was one of the highlights of our Holiday, the cost was $80USD but well worth the bike hire\nShow less"], ["Reviewed September 16, 2017", 5.0, "GO FOR THE MARATHON AND ENJOY", "This resource is a cyclists or tourists dream come true. Nothing better than going for a casual bike ride for however far your budget and your butt can stand. The road system is perfect and goes on and on and on. Lots of great stops along the way including restrooms. You couldn't ask for better. Plan on at least a couple of hours so as to really enjoy the experience\nShow less"], ["Reviewed September 14, 2017", 4.0, "Best cycle track !!", "Borrowed bikes from our hotel and off we went not expecting such a wonderful facility - didn't attempt the full 26 miles but certainly found the route great fun - the pedestrians respect the cycle path which is wide enough to pass slower riders easily whilst avoiding oncoming cyclists - plenty of sites to see path goes via Santa Monica past Venice Beach and onwards - fresh air, exercise & sunshine included !!\nShow less"], ["Reviewed September 13, 2017", 5.0, "Amazing bike trail along the beach", "We loved biking on the paved Marvin Braude cycling trail which goes from the Will Rogers State Beach in Pacific Palisades, Los Angeles to the Torrance County Beach. The mid point is in the Playa del Rey residential area. For the vast majority of the time the trail goes along the beach, but there are occasional sections where it deviates and a few sections where you go on the road but in very well marked and safe cycle lanes. Its very easy riding, flat all the way. Its very wide with clearly marked sections for cyclists and walkers / joggers. The views are amazing all the way. Plenty of places where you can hire a bike, get a coffee or a snack or go to the rest room. We cycled from Playa Del Rey, through Marina Del Rey and Venice to Santa Monica pier and back A total distance of 16 miles. Great fun and a fantastic way to spend a morning or an afternoon, with a swim to cool down at the end of the ride.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Clearly marked track - joggers & cyclists share happily", "Son hired a bike and did the full loop to Redondo and back, daughter & I hired town bikes and went to Venice pier , over to Venice canals and back - joggers and cyclists share the pathway well, great way to see the area"], ["Reviewed September 9, 2017", 4.0, "Nice ride, but a little disappointing", "The 26 mile Bike trail that goes from Santa Monica to Manhattan Beach does exist. It does not however go on the beach the entire way as the map might indicate. You will be on the road , some of it busy once you get to The Venice Pier.\n\nWe rented bikes in Venice from a bike shop whose name escapes me. They are are Venice Blvd right near 17th street.\n\nWe headed towards Venice and found to get around Marina Del Rey you need to go on the street, then again near LAX.\n\nWe stopped at Marina Del Rey, went around a little bit then came back and went through Santa Monica under the pier.\n\nThe sites of Venice Beach and Muscle Beach are what you expect but it’s a “must see”. Going under the pier is an added plus.\n\nBefore you rent or ride get the most updated maps. Had I not seen a police officer on a bike I would never have known which way to go.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Awesome bike path!!", "This is one of the best bike paths I've been on. It's especially wide. Separates the walkers/joggers from bikers. It also offers ample places to hope off, grab something to eat, use a restroom, etc. Great way to spend half a day."], ["Reviewed September 6, 2017", 4.0, "Not too strenuous, but you'll work up a sweat", "Rode south 10 miles from the pier (and back) to just south of LAX\nNice, smooth path, except for the trip around Marina Del Rey, which got a little confusing, and had to battle some street traffic\nNice site seeing and people watching, while getting a little exercise\nShow less"], ["Reviewed September 5, 2017", 5.0, "fresh air and sea breeze on bike", "Great way to explore the coast line and beach area. plenty of shops ,sights and people watching along the way.. fascinating people from all walks of life !"], ["Reviewed September 2, 2017", 5.0, "Great activity with teens", "Loved cycling along the cycle path by the beach - interesting views. Lovely experience but you need your wits about you to avoid people meandering along the cycle path.\nCycled to Marina Del Ray for lunch ( at Tony P's which was outstanding) then a little further to a beach.\n\nMost seems along the beach side but you have to go inland on roads which can seem daunting.\n\nWish they would hire bikes with brakes and gears rather than bikes you need to back pedal to brake.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Possibly the best part of our holiday", "Cycling from Santa Monica down to Venice Beach past the amazing properties, glorious beach and array of interesting people was a huge highlight of the holiday. The kids loved the freedom and exercise and we loved basking in the sun but with the breeze of a gentle bike ride. Keep your wits about you as pedestrians don't always stick to the right paths but this was so much fun. Highly recommended especially on the weekends when it's much busier and you get to see all the locals out enjoying the route too.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Amazing bike ride!", "Riding a bike from Santa Monica to Venice Beach was an awesome experience! The path runs right along the beach and it's just beautiful. No matter where you rent your bike, doing this bike path is a must!!"], ["Reviewed August 31, 2017", 5.0, "Best way to see Santa Monica and surrounding area", "During our stay in Santa Monica, my family and I rented bicycles. If you are planning a trip there, I can't say enough about doing the same. It's the best way to see the area. It is cost effective and you can stop and go as you like. The bike path is very safe and accommodating.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Best activity in Santa Monica", "I enjoyed riding the bike path so much that I insisted we do it a second time before we left town. This trail takes you along the beach and the Pacific Ocean. You'll pass the Santa Monica Pier and the eclectic shops and people in Venice.\n\nThe fun does not stop at the end of the path. The Venice canals and shopping on Abbot Kinney Blvd are not too far away by bike.\n\nShow less"], ["Reviewed August 29, 2017", 5.0, "Great cycle track", "Great dedicated cycle track. You will do well to cover all 26 miles as you will want to keep stopping and see some of the many sights along the way. This is a must do activity if you are in town, views are amazing, people watching brilliant.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Jealous I Can't Use This Every Day", "Great way to get out and see the beach front area. Tons of people out so not a speed route. Can be used bikes, skates, and saw some electric skateboards. Lots of spots to get off for a bite to eat, watch volleyball, check out vendors along Venice beach, or just enjoy the breeze.\nShow less"], ["Reviewed August 24, 2017", 5.0, "incredible ride!", "We rent our bikes over at the Santa Monica Bike center on 2nd street and ride the WHOLE WAY DOWN and back. It usually takes us the day, about 4-5 hours as we stop for lunch and drinks along the way. Beautiful and easy bike path if you'd like to see the Pacific Coast a more breezy way.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Cycle by the ocean", "This is a great place to cycle, more so if you feel unsure about cycling on busy LA streets. Peaceful and lovely right next to the ocean. Lovely in any season as California beach weather is always good for cycling or walking along this beach path. One of my fave places to cycle and walk.\nShow less"], ["Reviewed August 21, 2017", 4.0, "Twice on rollerblades and what a challenge", "I used to be an avid, avid rollerblader and I lived for my weekends so I could get out and go up and down the bike path. I grew up in Torrance so I knew where the bike path started but hadn't put two and two together years later, when I moved to Venice, that Venice's bike path was the same! Well frankly, all the way to Pacific Palisades practically. Anyway, I had ridden it a few times on my bike and it was an amazing trip and work out but then I was like, could I do it on rollerblades? I was in good shape, young and energetic and I was a good skater so I went for it! Getting there wasn't so tough but by the time I got all the way to the end of the path, the wind had picked up and boy, was my return harder than I could have ever imagined! My saving grace was my Walkman - you remember those don't you? I had several 'high energy' dance music 'cassettes' that I had made just for my skating expeditions and they are what got me back, barely, in one piece! Incredible memories but I couldn't do that anymore! But I dare anyone else to do it- at least once! You'll never forget it!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Lots of fun", "Nice activity to do with children which will cost a family of 4 about USD 100. Best time to do it is around 9:00am before it gets too warm"], ["Reviewed August 17, 2017", 3.0, "Fun cycle path along the beach", "Having been in Santa Monica many times I never did the bike path. This time we got bikes from the hotel and did the bit from Santa Monica to Venice beach. Lots of things to see on the way. Skateboard park, muscle beach in Venice and the Venice Boulevard stalls. Worth doing if you have some spare time. Better than wasting your time to seen the Santa Monica pier.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Very nice", "It's actually not only a bike path. You can also walk there. very even path. easy to walk on. Beautiful ocean views. If you do choose to ride... You can bring your own bike or rent from numerous places"], ["Reviewed August 16, 2017", 5.0, "Get out of Beverly Hills, grab a bike and go....", "Beautiful way to tour Santa Monica, Venice, almost all the way up to Pacific Palisades.\nRented a bike in Santa Monica - plenty of bike centers - big cushy seats and fat tires. Easy ride a block along Ocean Ave to the Pier, go down ramp and path runs under Pier. South is Venice. North is Pacific Palisades. South is busier, but good to stop and people watch. North is quieter, but good to zen on a bike.\n\nThey have these Perry's stands every half mile or so. After an hour or so of biking, a cold shake from Perry's hits the spot.\n\nDo it!\nShow less"], ["Reviewed August 15, 2017", 5.0, "Love love love", "We hired bikes for a couple hours from Santa Monica to Venice and totally enjoyed the experience. Highly recommend."], ["Reviewed August 14, 2017", 5.0, "Nice and Flat", "This bike bath is chared by all. Bikes, skatedboards, roller bladers, joggers and walkers. You can hire just about anything to go from one end of the path to the other."], ["Reviewed August 12, 2017", 5.0, "Santa Monica bike ride", "The cycle track gives great access to a stretch of beautiful beaches and some quiet spots once you get past Santa Monica and Venice beaches. Be aware of a section that is on a very busy four lane road and not suitable for smaller children (you could get off and push as not too long). Water stops along the route. A laid back way to explore the coast. We ran out of time and couldn't do it all - lazy start and a long stop to swim in the ocean - so plan on a full day. Bike hire $20 a day. Would highly recommend.\nShow less"], ["Reviewed August 9, 2017", 2.0, "Overcrowded and nobody follows the rules", "Everyone wants to ride bikes on the beach, so as you can imagine it's overly crowded; the bigger problem? The people walking on the bike path. It's clearly labeled but there's no dividers that keep the walkers on their side and it causes a mess and isn't safe for bikers. So, if you're going to bike or walk on it, follow the rules and think of those around you (e.g. don't just stop in the middle of the bike path).\nShow less"], ["Reviewed August 7, 2017", 5.0, "A must do", "A must do activity while in LA. Cruise along and enjoy. Do not forget to visit the Venice canals as well ;)."], ["Reviewed August 6, 2017", 5.0, "Superb for Sight Seeing", "Great mode of transport to visit both Santa Monica Beach and Venice Beach. Bikes were easy to rent and it was a fun ride."], ["Reviewed August 4, 2017", 4.0, "Great bike path", "A wonderful and relaxing way to spend a day. We rode from Santa Monica to Playa del Ray (17 miles return) and the path is dedicated on beach most of the way then some cycle lanes around the marina, then back to dedicated. If you have kids then maybe stick to the beach paths. We rented bikes and locked them in various locations and walked around. Whilst the paths are dedicated for bikes, rollerbladers and some walkers will use, and be cautious of skill levels from novice cyclists, there heaps of rental bikes around and many placed to rent along the way.\nShow less"], ["Reviewed August 3, 2017", 5.0, "The best way to get around the coast in Santa Monica and Venice.", "This is the best way to get around and see the coast. No car and parking hassles, plus your getting excersice while being outdoors."], ["Reviewed August 2, 2017", 5.0, "Fun!", "I rented bikes with my family (wife and two kids, age 10 and 12) at the Blazing Saddles bike rental on Santa Monica pier. We rode our bikes to Venice and back, stopping to see some sites along the way.\n\nThe bike path was great - well maintained, wide, flat, and easy to follow.\n\nWe stopped at the skateboard park to watch the kids do their tricks, at the Venice art walls for pictures, Muscle Beach, and at the Venice canals (a couple blocks off the trail).\n\nIt was shocking to see so many homeless people living on the beach along the trail.\nShow less"], ["Reviewed August 1, 2017", 5.0, "A must do!", "Rented bikes for the day. Great family activity. If you have an inexperienced rider may want to get them a tandem bike to ride with a parent as the path can be very busy in parts."], ["Reviewed July 31, 2017", 5.0, "fun for the family", "A lot of kids and bike rentals on this path, so you don't have to dodge the racers (too much.) It's a great way to go see Venice Beach or go north to the less populated beaches. Relaxing and fun!"], ["Reviewed July 31, 2017", 5.0, "Scenic oceanside path!", "My husband and I walked over half of this path. You see a lot of cyclists, but it is not overcrowded during the daytime. In the evening the path is fairly deserted which would make for a cool, quiet ride. There are a lot of rentals nearby if you did not bring your own wheels. I would recommend this path because it has separate walking and biking, it's clean, and you have a beautiful view of the beach and ocean.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Pedalling into the sun", "This is a must. Grab a bike from Santa Monica Beach Bike Rentals, head to the pier a few blocks away and cruise along the bike path. Safe and fun. Check out the skateboard park , muscle beach and the countless cafes and eateries but don't forget to lock ya ride to something when leaving it.\nShow less"], ["Reviewed July 30, 2017", 2.0, "Pedestrians, race bikes, and sand dunes", "I took my skateboard out for a stroll and you quickly realize the same terrible drivers of Los Angeles also own bikes. Inconsiderate people who drive in oncoming lane, racer bikes who pretend this is the Tour de France last mile, and pedestrians who can’t read the signs or pavement markings and assume it’s a sidewalk.\n\nIt’s still a great ride, but be ready to run over or be run over.\nShow less"], ["Reviewed July 30, 2017", 4.0, "A must do when in Santa Monica", "Run north up to Malibu, south down to Venice Beach. This has it all. Great for walking, blading, biking, people watching, fund with kids. A must do."], ["Reviewed July 27, 2017", 5.0, "This is a must \"to do\"", "Absolutely the best way to see the coast. Bikes are easily found for rent-rates typically $30 for the day which includes locks. My wife and I spent the morning riding the path down the coast. Easy ride-flat, breezy, and beautiful! Places to stop and eat, shop, and drink. Shops also along the way. We spent the rest of the day touring Santa Monica on the bikes. It's the way to go!\nShow less"], ["Reviewed July 25, 2017", 5.0, "26 miles of Ocean", "A must do in LA. Best people watching and sunshine. You can rent bikes easily and just take off . Stop anywhere, lots Of cafes, swim and be part of the most healthy, fit, tanned Calif locals for the day."], ["Reviewed July 24, 2017", 5.0, "You must cycle along this beach", "A fabulous experience - if there is one thing you should do when you visit Santa Monica, you must hire bikes and cycle to Venice Beach and back. There is a superb purpose built wide cycle path, which makes the whole experience much more enjoyable."], ["Reviewed July 23, 2017", 5.0, "Great shared space", "This space is a shared bike and walking path, can't say we travelled the whole length and it can be pretty busy, in the shared areas and sometimes there is a separate area for bikes and pedestrians. There are lots of shops and places to stop for reception and you have to pause at Muscle Beach, if only to watch and not to try and develop your own muscles. Lots to see as you walk/cycle along.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Cycling in Santa Monica ? Hop on the bike at Bergamot train stop", "The bike trail is one of my preferred routes for cycling to the ocean in Santa Monica.\n\nMy starting point for the bike path is Bergamot train station (about 30 blocks away from the coast)\nI like this route because the elevation differences are negligible on this route. That allows for a more relaxed ride as compared to using Ocean Park for cycling down to the beach. There are some steep hills to climb on the Ocean Park route.\n\nAttention; the bike path ends at 17th and Colorado. However it is pretty ok to bike on Colorado all the way down to the ocean (about 19 blocks)\nColorado takes you right to the Santa Monica Pier.\n\n\nI have also used the bike path to bike from Bergamot metro stop to Sawtelle, Sawtelle is a great place for eating out if you crave Japanese food.\nShow less"], ["Reviewed July 18, 2017", 4.0, "Immerse yourself in the culture", "Feel like a local. Enjoy the the sunshine and the views. Easy ride along wide concrete path . Start early as the foot traffic gets busy later in the day"], ["Reviewed July 15, 2017", 5.0, "Love this ride. Best of L.A.", "I think it's called the Marvin Braude Memorial Trail, I've seen his name posted along it in the past. Great bike ride most right next to the ocean. Best of the beach cities. Bike rentals in SaMo, Venice, and elsewhere along the trail. Best in the morning and weekdays. Less crowded. This is why people live in L.A.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Great day activity", "Rent a beach bike for $18 for full day and travel through Venice area back streets, Marina del Rey and beyond, and of course just the classic beach section. Bring lots of water (fill up on ice at your hotel) and apply lots of sunscreen."], ["Reviewed July 14, 2017", 5.0, "Fun bike trip", "Only did the stretch from Santa Monica south to Dockweiler State beach of around 15 miles round trip going through Venice and Marina del Rey. Rental bikes are easily available and the cycling is on flat well marked paths. Pedestrians can be a hazard in busier parts but are all part of the fun. A really nice way to see the coastline\nShow less"], ["Reviewed July 14, 2017", 5.0, "Fun day on southern end of path!", "We rented bikes in Hermosa Beach and rode as far as Venice Beach (about 12 miles each way). We parked in the public garage near Hermosa cyclery which was very convenient. We went on a weekday so the path wasn't very crowded and we were able to get parking. On the southern end of the path, you can also rent bikes in Redondo Beach just south of Hermosa Beach. I really enjoyed Hermosa and Manhattan Beach since you have the beach on one side and interesting homes on the other with no street crossings. Once you reach Marina Del Rey, you will be riding away from the beach most of the time until you reach Venice so that part of the ride wasn't spectacular. There's not much to eat/drink once you leave Hermosa Beach until you get to Venice so plan accordingly. We didn't continue north to Santa Monica because the ride back would have been too long. Highly recommend!\nShow less"], ["Reviewed July 14, 2017", 3.0, "Crowded bike path", "If I were leisurely riding a tricycle for sightseeing, this would have been a 5-star rating. It is a very busy, crowded path. But since I was riding to get to a destination, and hoping for some exercise, it rates much lower. That is NOT this path.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Our family did a bike ride along the beach, then finished up with a swim.", "The bike ride is wonderful as a family event, then you can stop to have lunch on the way. This was a great day for us."], ["Reviewed July 10, 2017", 5.0, "Super bike ride", "Loved the long strip for biking! Relaxing and a full view of different art selling by merchants! Renting of bikes is all over so no worries for finding One. A place to visit anytime!"], ["Reviewed July 10, 2017", 5.0, "Great way to explore the coast!", "If you are energetic and want to catch the true local flavor, this ride is for you.\nThe landscape changes as you ride from one beach town to another with lots of places to stop along the way.\nIt's best to do this early in the day. Stop for lunch once you've completed the 26th mile, then head back. Late afternoons can be very crowded and much less enjoyable through certain areas like Santa Monica and Venice. The path is narrow and many people decide to walk blocking most of the path. Be careful of children in attended running out across the path.\nThis is a great activity any time of year.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Best place to rent a bike and go for a ride along the beach", "We always rent a bike(s) and bike down to Venice beach and back. The people watching is amazing and there are a few good ice cream shops. Muscle beach is a sight to see."], ["Reviewed July 8, 2017", 5.0, "Great safe activity. It's a must do", "Rented bikes, loved every second. Around every corner was something different (we did it on a public holiday) dead flat and safe. Take it easy and enjoy. Took 2 hrs from sm to Venice and back."], ["Reviewed July 7, 2017", 4.0, "Great way to take it all in", "Perfect way to see Santa Monica and Venice Beach.\nYou can go as fast as you like or just take it easy like a Sunday morning.\nThere are plenty of places to lock your bike up if you want to take a stroll around any of the areas along the route.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Great for families! Ride whatever distance you want", "We went on a Tuesday after noon. We parked in the 5th parking structure, walked down Broadway to a bike shop called Public bike shop, one street away from the pier. We promptly received well maintained bikes for two adults and one 10 year old, baskets, helmets and locks promptly for $20+ each all day. I felt safe with the bikes. We crossed one street and weren't sure at first how to access the path. You ride to the left to the wooden ramp that takes you to the boardwalk, Bubba Gump's and the Ferris wheel, etc. Everybody goes down the wooden ramp to the pier. Once you descend the ramp, on your left and tucked in the back behind yellow poles is an access to the bike bath. There are some stairs that say \"to the aquarium\". Take your bikes through the poles and go the right instead, down a path, around a corner and you will see the path that goes under the boardwalk. We went to the left and toward Venice. It didn't take long to get there. I was surprised, thinking it was much further away. We loved the bike path. We only rode a couple miles each way but it was so beautiful, clean and safe. Lots of people and scenery to observe. In Venice, we saw the skate park, arts and crafts, unavoidable marijuana accessories and art, an interesting troop that put on an impromptu comedy, \"athletic\" show, and hustled people for money. Some of the guys used rough language and racial stereotypes, so I would watch for this if you have kids. In fact, some of the shops and art work, and unsavory characters are not for younger kids. Just get back on the bike path. It is safe and separated from the shops and activities on the Venice path. You have to move off the bike trail to visit the shops, and easily get back on if you don't like what you see. Highly recommended for families. Again, if you have small kids, just don't go off the trail when in Venice. Just keep riding merrily along as far as you want, then turn around and go back to the Santa Monica pier.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Busy!", "This is a great facility but you need to get out past the Marina before there's enough space to pick up a bit of speed if you're cycling for fitness. It's a cycle path but expect pedestrians strolling four across, skateboarders, rollerbladers etc and the area around Santa Monica and Venice beaches is particularly crazy. Nevertheless this is a great facility and you just need to relax, talkie in the vibe and accept that you're not going to go 35km/hr.\nShow less"], ["Reviewed July 1, 2017", 5.0, "A must do!", "We rented bikes in Hermosa Beach and rode to Santa Monica and back. It is super flat and easy with a beach cruiser. We stopped along the way at a few spots.....Venice Beach, Manhattan Beach Pier. We spent a few hours on the Santa Monica pier and had a blast before returning to Hermosa.\nThis is an all day activity so plan accordingly!\nShow less"], ["Reviewed June 27, 2017", 5.0, "This was fun!", "We rented bikes from Perry's and had a blast on this path. We rode all the way down to Marina Del Ray and Venice beach. Make sure you take locks so you can get off the bikes when you want to explore on your feet. It was a Sunday and the path was extremely crowded, but it was still fun.\nJust watch out for folks crossing the path without looking to see if you are coming. They were oblivious to the bikers which caused many near miss collisions.\nShow less"], ["Reviewed June 26, 2017", 5.0, "A great way to spend the afternoon", "Definitely a must! I ordered a bike from Venice & rode pass Santa Monica pier & stopped for a bite to eat at a beach restaurant. A relaxing way to spend the afternoon taking in the sites."], ["Reviewed June 25, 2017", 5.0, "great bike ride, classic So Cal", "We rented bikes up around third street and went the entire length of the bike path. The beach is lovely and the path is clean and clear. There's lots of homeless folk along the way and some shops and cafes if you want to stop."], ["Reviewed June 24, 2017", 5.0, "Easy Ride Along the Coast", "Started in Santa Monica early in the morning and rode all the way to the end, and back. It's a great way to see different areas along the coast and an easy flat ride with plenty of restrooms and stops along the path."], ["Reviewed June 21, 2017", 4.0, "Great fun any day of the week ...", "Bike, run or walk ... it's up to you.\nThe entire route is great although the Venice portion, I personally do not like. Too many people and the marihuana\nSmell it's just not my deal ... personally I dint like that this is the Venice image.\nOther than this, it's a great ride !\nShow less"], ["Reviewed June 21, 2017", 4.0, "smooth ride", "what a nice path this is. smooth and great views of the beach and venice. you can rent bikes pretty cheaply. fairly safe, and you can see a lot of beach."], ["Reviewed June 16, 2017", 5.0, "Excellent idea", "We didn't know about this until we visited. The pathway is clean and tidy and well maintained. The path is used by pedestrians, bikers, skate boarders and others. It's a great way to walk at the side and see most of the beach and surrounding area.\nShow less"], ["Reviewed June 13, 2017", 3.0, "Wear a helmet! And any other protective equipment!!", "A long lovely path that runs to Playa del Rey is ruined by the homeless and crowds in Venice and Ocean Park who wander on to the path, not to mention speeding bike riders.\nYou take your life in your hands on the weekends especially. Keep the kids off.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Great and a must do", "I have ridden down the 26 mile path many many times. It's just quite fabulous to ride along by the beach and ocean, whether you ride all the way or just a few miles and turn around. You can equally walk, skate etc the route."], ["Reviewed June 12, 2017", 5.0, "PERRYS", "We rented bikes at Perry's on the beach with numerous locations down the boardwalk! the tandem was a blast!"], ["Reviewed June 11, 2017", 5.0, "Amazing time. Must do", "It was our first experience on an electric bicycle and we absolutely loved this 3 hour activity.\n\nJust for information of what you get to do\n\n01. You get a electric bicycle and helmet and basic training on how to ride\n\n02. You go in a group riding the cycle as a guided tour and the tour guide is very knowledged and helpful\n\n03. You get a fabulous tour of the Santa Monica and Venice beach\n\n04. There are several stops on the way.\n\n05. The activity is not difficult and can be easily done as long as you know how to ride a bicycle or scooter.\n\n06. Must do as a leisure activity and also to explore the area.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Redondo to Venice & back", "My son and I cycled from Redondo Beach to Venice beach and back on Tuesday 6th June .... it was a fantastic trip and we parked our bikes outside the police sub station in Venice beach as there are lots of cameras there. Houses on Hermosa Beach & Manhattan beach are fab as well as the beaches & all the activities there.\nShow less"], ["Reviewed June 9, 2017", 5.0, "Awesome", "Love the bike path here it's great for casual cycling, good if it's quiet for getting about. There are one or two people walking on it at times but that's not really an issue"], ["Reviewed June 9, 2017", 5.0, "Best of L.A", "This is the must experience you need to get when you coming to L.A As a local I still go for biking on regular bases and I think this is the best L.A can offer to Tourists as well"], ["Reviewed June 5, 2017", 4.0, "Ride Away", "It is a flat sidewalk and you can ride for miles and miles. It runs right along beside the ocean. There are two paths, one for riding a bike, skate boarding, or roller blading. The second path is for pedestrians. I did walking on the path and was very interesting.\nShow less"], ["Reviewed June 4, 2017", 5.0, "One of my fave things to do when in LA....", "Anyone staying in LA has to head to Santa Monica and hire a bike and ride along this path.....this is our fifth time riding towards LAX and Malibu, but it was our 7 year old daughters first time riding a bike on her own...she loved it and to her credit she made it all the way around....the best place to hire bikes is under the pier, genuinely friendly, the cheapest prices and a great selection of bikes.\nShow less"], ["Reviewed June 2, 2017", 5.0, "It's a great bike path.", "This bike path goes all the way from Palos Verdes to Pacific Palisades. Along the way you're going to have to tackle Washington Blvd. The scenery and the bike path is usually in good condition but on occasion if it gets windy or rainy it can be a little bit of a challenge. Just make sure you know how to find your way to the portion in Marina Del Rey in order to get to either end. It's a total of 26 miles. Lots of nice places along the way to accumulate a few carbs(:\nShow less"], ["Reviewed May 29, 2017", 5.0, "Good way to see Beaches", "Good way to see and explore beaches and places nearby. Paved path, lot of people, so look out anothers."], ["Reviewed May 25, 2017", 5.0, "Great place to run, walk or ride your bike", "My daughter and I utilized the path for our morning runs. I would have loved to rent a bike...just didn't have time. Oh if only I lived next to path like this one!!! Beautiful, clean, comfortably crowded, safe. A great time."], ["Reviewed May 24, 2017", 5.0, "So much fun!!", "We stayed in Santa Monica for our honeymoon and absolutely loved the bike path! We went all the way to Venice and several miles north as well. We were able to visit so many wonderful spots along the way and the hulu bikes made it so convenient and affordable. The bike path was a highlight for our trip and one of my favorite things about the area!\nShow less"], ["Reviewed May 23, 2017", 5.0, "Simply awesome!!", "After renting bikes near the SM pier we decided to tackle the popular bike path and head to Manhattan Beach, a two hour ride!\nWe used the trail map provided and followed this well marked trail. We passed alongside Venice Beach, stopped by the canals and headed to Marina del Ray. While the trail avoids much of the busy streets, there are parts where you ride alongside traffic but nothing too stressful. The city has done a great job with this trail and it's easy to ride. I highly recommend it for even the novice rider.\nThe ride to Manhattan Beach takes you along the ocean for much of the trial and I suggest sunscreen and water as you will get burned. Enjoy great restaurants in Manhattan Beach, explore up the hill as well as the pier but save your energy for the ride back!\nThis trail was definitely the highlight of my visit to Santa Monica!!\nShow less"], ["Reviewed May 23, 2017", 5.0, "Brilliant bike path", "This got to be one of the best cycle paths I have ever seen. It is so scenic and breathtaking. It is totally level, no effort needed. There is plenty of places to stop and have a drink of water, toilet facilities etc. Fantastic for a great day with bikes easily available for hire if you haven't got own.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Nice and flat", "Wind through the cute beach towns like Venice. It's suppose to be for bikes only, but you have to watch out for the slow walkers!"], ["Reviewed May 22, 2017", 5.0, "So much fun!!", "My husband and I rented bikes and had a great time riding the path. You cant beat the scenery and crisp ocean air. I cant wait to go back and do it again!"], ["Reviewed May 22, 2017", 5.0, "Great bike path allover the city", "You could ride for miles on the bike path along the beach, the morning are best, but check the weather for wind."], ["Reviewed May 21, 2017", 4.0, "My favourite....", ".....part of LA. As a U.K. visitor I not that sure what LA has to offer other than great weather and a stunning beach. We did about 10 miles of the bike path and absolutely loved every mile of it (and back). The buzz around Venice beach great!\nShow less"], ["Reviewed May 20, 2017", 5.0, "Great way to spend a sunny afternoon", "This is an easy bike ride and perfect for taking in all the sites and people watching along Santa Monica and Venice Beach. Must-do when you're in the area!"], ["Reviewed May 18, 2017", 5.0, "Need a ride back!", "Out in the clear skies beautiful sunny day, coating along & stopping along the multiple beach bars, you may need a friend to give you a ride back! Views are exceptional!"], ["Reviewed May 17, 2017", 5.0, "May 2016", "On of the best urban bike paths I have been on. Fantastic scenery, so close to the ocean and some of Santa Monica's best real estate. There are not a lot of access points from Wilshire Blvd, we had to ride down to the pier but it was well worth it. Early in the morning is best as there is not a lot of traffic, you get to share the path with joggers, roller bladers.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Ride into the beach", "I finished a 2-week bikecamping trip by taking this path from Santa-Monica to Ventura and then going to the airport. It was a wonderful conclusion to my journey. The path mostly goes right through the sand, and only occasionally along the road. It is smooth, wide and offers some views that I hadn't thought actually existed outside movies and tv-series. There are facilities like toilets and bicycle parking, and the city is only one turn away. No better way to spend a sunny spring day.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Nice beach views. Be sure to stop along the way", "We rented bikes and traveled from Santa Monica to Venice beach. It is an easy pedal of 5 miles or so. We rode around the Canals in Venice. Stopped for Breakfast along the way. You have many choices. Dropped off the path to shop as well. We hit the SM pier on the way back. Little hill getting back up to the hotel.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Fantastic views - nice place to ride your bike!", "The beaches are amazing, the path is well maintained and flat. There is a lot to see along the way and many places to stop and eat, get a drink, shop, and take a break!"], ["Reviewed May 16, 2017", 5.0, "A MUST DO", "If you are visiting and want the full experience of different communities walk the bike path. Lots of wonderful places to eat, purchase goodies and people watch."], ["Reviewed May 11, 2017", 5.0, "So happy I did this!", "This was the perfect way to see a good stretch of Beach in a relatively short time. The weather was perfect and the bike path is well maintained. You do have to be careful of pedestrians - even though they're not supposed to walk in the bike path, they do anyway! I rode from Venice Beach, through Santa Monica Beach, to Will Rogers State Park. Make it to Will Rogers if you can -- it's only a few miles more, but the views are ten times as nice, and there are hardly any people there! Don't forget sunscreen!\nShow less"], ["Reviewed May 10, 2017", 5.0, "beatiful", "although i don't bike any more i can tell you that if i could i would certainly put it on my bucket list if you are able to bike make it a must there are many bike rental shop's all along venice beach"], ["Reviewed May 8, 2017", 4.0, "Best poeple watching scene in the world", "A great way to discover the coast and the scene of So-cal! the path is decently maintained, there are a lot of places to stop. There are bikes renters who also rent bikes with child-seat and child-bike."], ["Reviewed May 7, 2017", 5.0, "Fun, fun", "Bike path is great and you can see the ocean as you bike. Great places to eat nearby if you want to stop along the way. You can rent bikes right on the beach."], ["Reviewed May 7, 2017", 5.0, "Coastal bike ride", "The ride is beautiful, but it's not easy. The one nice thing is you can go as fast or slow as you want. It's also not completely flat. Make sure you rent a bike with a comfortable seat, multiple gears and a bike lock. Bring water also. The path travels along the ocean except for when you get to Marina Del Ray. It's a 4-6 hour day round trip. Great day!\nShow less"], ["Reviewed May 3, 2017", 4.0, "Fun afternoon ride", "It was fun to ride, but areas were so crowded it was almost impossible to keep the bike upright because of such slow pedaling . There were hundreds of inexperienced riders that didn't follow normal courteous rules do the road. Foreigners surely didn't know. People riding side by side and impossible to pass at times. I did ride to the end by Venice beach and that was fun to see, again very crowded there. There were spots on the path that were very sandy and easy to slip if you weren't careful. It was fun, but very crowded. I rode in late afternoon, can't imagine what it would've been like earlier.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Great Bike path for everyone and every bike type!!", "Wife and I used Beach Crusiers Bikes and road for a few Hours and walk around Venice Beach, People watch. Bike path is well maintained and very little sand on path.. Watch for some stupid walkers.. Two different paths walking and biking!! Great stopping spots for drinks, food and beer or Butt breaks.. Shade..\nShow less"], ["Reviewed April 27, 2017", 5.0, "Perfect way to see the beach", "Hired bike from nearest bike hire to Santa Monica pier. Left $20 deposit for security chain. Got 2 comfy bikes with baskets for $7 per hour. Rode to marina included a detour to Venice canals and rode back to Santa Monica in 1 and a half hours. Loved every minute. Best value eva.\nShow less"], ["Reviewed April 26, 2017", 5.0, "great ride", "bring your own bikes. it is worth it. Take some time to go all the way and watch the sunset. Do not forget sunscren"], ["Reviewed April 24, 2017", 4.0, "Fun", "Renting beach cruisers are a part of the local flavor and easily found. Can be rented by the hour and that is enough time to move up and down the beach.\n\nA bike makes it a lot easier see as much of the beach as possible.\n\nA must!\nShow less"], ["Reviewed April 24, 2017", 5.0, "Great way to see the area!", "This is a wonderful bike path and it's a great way to see the entire Santa Monica bay and all of the different communities along the way. In the Palisades it zips along the open beach. The path zig zags through the craziness that is Venice Beach. And there is beautiful parkland in Marina Del Rey. It can get crowded on the weekends, particularly around Santa Monica Pier and Venice. There are plenty of restrooms, dining spots and fun opportunities along the way. Just wear a helmet, ok?\nShow less"], ["Reviewed April 20, 2017", 5.0, "Car free cycle", "Just a great experience. Car free walking and cycling for all the family. Just behind the beech. Numerous cafe en-route. Thoroughly enjoyable."], ["Reviewed April 19, 2017", 5.0, "Get your bike on", "Pedal away on this l o n g bike path that passes many enjoyable scenes to engage in....from a skateboarding park to the Santa Monica Pier to a kids park with swings and volleyball nets. Bike rentals also available right there on the beach for a minimal cost.\nShow less"], ["Reviewed April 18, 2017", 5.0, "Fabulous Fun!", "We hired bikes from the Santa Monica pier and loved our time riding down to Venice Beach. The bike path was fantastic. Wide and easy to ride. The day we were there it was fairly busy however all the traffic on the path moved well and it was easy to hop to the side and take photos along our way or simply to stop and take in sights. A great way to explore the area. We spent 3 hours bike riding down and back.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Ideal for panoramic views of sun, surf and mountains", "We strolled along this path while others biked along it and riders and pedestrians alike were courteous to one another, as long as everyone followed rules of the road. The views are picturesque and exactly what one would expect from a California beach. Definitely worth the drive to get here.\nShow less"], ["Reviewed April 13, 2017", 4.0, "Nice!", "Definitely a great way to see the beach and the pier. Great access to many hotels and restaurants. We didn't get to bike, but we walked it."], ["Reviewed April 10, 2017", 5.0, "A Great ride for the day", "Santa Monica all the way thru Huntington, Manhattan to Palos Verdes. A great ride with many places to stop and watch the people go by"], ["Reviewed April 5, 2017", 5.0, "We rented bikes and rode to Venice to see the Venice canal", "It was really fun to ride bikes down the beach boardwalk to Venice and find out way to the beautiful homes along the Venice canal."], ["Reviewed April 5, 2017", 5.0, "Superb facility", "Hire yourself a bike and get out along the path. Early mornings are best before it all gets too busy. Best way to see the very different beaches."], ["Reviewed April 4, 2017", 5.0, "LOVE IT", "Biked this twice on two different trips, once just from Santa Monica to Venice Beach and back, and once from Hermosa to Playa del Ray and back. LOVE IT!!! Each area has its own flavor, there are people and sand to dodge but that just makes it more interesting...\nShow less"], ["Reviewed April 3, 2017", 5.0, "Smooth bike paths and friendly people!", "Rented both from a bike vending machine and a bike rental hut. Hut was better value, better bikes and way more personality :)"], ["Reviewed April 3, 2017", 5.0, "How can I resist!", "We were in Santa Monica and after visiting the pier we wanted to go to Venice Beach, but as we drove by the beach in the car, we could not resist the idea of stopping to rent bicycles. We were encouraged by the beautiful sunny day and warm tmeperatures that are quite normal in November. It was really hard to resist being outside!\nShow less"], ["Reviewed April 3, 2017", 5.0, "Eclectic to Suave this has something for all", "This path runs along Santa Monica and Venice. There is absolutely no doubt when you shift from one to the other. Santa Monica is pristine and clean, Venice is eclectic and crazy. The path is smooth and well designed so as not to conflict bikers with runners/walkers. You pass by the Santa Monica pier, gymnasts, lively street performers and one of the prettiest beaches around. It was pretty windy each day, but this is a must do if you are down in that area.\nShow less"], ["Reviewed April 2, 2017", 5.0, "Great day", "Enjoy the beautiful coastline through to muscle beach and Venice Beach good food and people along the way"], ["Reviewed April 2, 2017", 5.0, "Exercise with a View", "There is so much to see biking along the well maintained bike path. We went from Shutters to the Santa Monica Pier and down to Muscle Beach in Venice, stopping along the way at a couple of beautifully kept playgrounds with our little one."], ["Reviewed April 1, 2017", 5.0, "Well maintained path, beautiful views, lots to see!", "Very well maintained path, with separate lanes for walking and for biking. Right along the beach, but far enough out to not be in the middle of the activities of those on the beach. Access to clean washroom facilities along the way, as well as water fountains. Also little shops offering bike rentals along the path if you don't have your own. Some spots available along the way to stop and sit for a bit, have picnic or just relax a bit at a table. Great place to spend a day walking and taking in the scenery and views offered by the area. We walked from Santa Monica Pier down to Venice Pier.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Fabulous walk", "Hire a bike, rollerblade or walk. We had fabulous weather and wandered. Not many cafes or restaurants. Lots of homeless but they did not annoy us. Shops at the venice end are very average. Tourist and tattoo shops. Lots of people entertainment. The scenery was spectacular.\nShow less"], ["Reviewed March 25, 2017", 5.0, "Great place to bike", "We were staying at a vacation rental close to the Venice Canals, and fortunately our place came with a pair of bikes. It was great biking along this stretch, although a bit challenging with the crowds and sandy path.\n\nWe got close to the Malibu Beach area. If we had more time it would be great to go further and make a day trip out of it.\n\nThe biking was a bit more enjoyable in the Playa del Rey-to-Manhattan Beach stretch because it is less dense with people.\nShow less"], ["Reviewed March 24, 2017", 5.0, "The Strand", "We recently rode The Strand on cruiser bikes with our grandchildren and enjoyed it from where we began to where we ended. It was effortless with excellent scenery! We hope to return again, real soon."], ["Reviewed March 24, 2017", 4.0, "Bike Path", "This is a good way to see the beach. Bike can be rented by the hour or you can bring your own. There are plenty of things to see while riding. There are places to eat along the way if you like."], ["Reviewed March 21, 2017", 4.0, "Incredible way to see the coast", "You can bike from Santa Monica to Will Rogers State Park in Malibu, then head south to Marina del Rey. The only negative is passing through Venice - the cigarette and marijuana (now legal) smoke is thick, and people wander onto the bike path without noticing that it's for bike's only. Avoid Venice and you'll enjoy a beautiful coastline.\nShow less"], ["Reviewed March 20, 2017", 5.0, "Fun way to a lot of coast, definitely rent a bike, don't walk", "We rode from Santa Monica to Venice Beach. Great way to see the coast, iconic beaches. It is a very wide, paved path, easy to ride. The beaches are pretty spread out so it would be a lot to walk, and you might get run over by a bike! Lots of shops and restaurants along the path as well. Definitely worth the bike rental!\nShow less"], ["Reviewed March 13, 2017", 5.0, "The best activity to do on a bike in LA.", "Fastest and most beautiful way to get around from Santa Monica to Marina Del Rey. Ocean front views, sand, and endless fit women in bikinis!"], ["Reviewed March 13, 2017", 5.0, "Fantastic bike path!", "It was very comfortable and safety to ride around the island on 26-mile bike path. But it's not only safety but also very nice. Do not miss it!"], ["Reviewed March 12, 2017", 5.0, "Its california baby", "The \" bike path\" is awesome..in parts..most parts...the northern start point is quiet and beautiful looking towards malibu...going south into santa monica is very cool..total beach vibe...next stop venice, which is actually very gross and dirity, but great to ride by on the path...look right its the beautiful pacific..look left its the discussting Venice...next some street riding..not great , but fun...then marina del ray..gets quiet again...and then a long stretch of nothing, but still a nice ride and the ocean right by your side...final stop: Manhattan Beach...well worth the ride..\nShow less"], ["Reviewed March 12, 2017", 5.0, "Not to be missed!", "We enjoyed our ride from Santa Monica up to Venice Beach and Marina del Rey very much. We rented a bike for the whole day and took our time, which you have to anyway, as the path is used by many many people. Bikers, walkers and rollerbladers all share the same path so drive carefully and pay attention to others.\nShow less"], ["Reviewed March 11, 2017", 5.0, "Nice long bike path", "Although I did not walk or ride the entire path, I saw it from my car. It would have been fun to ride the entire way, especially the sections without all the tourists."], ["Reviewed March 11, 2017", 5.0, "Pedaling through Beauty and Entertainment", "Rent a bike right on the walking path. Walk your bike to the bike path and pedal through the beauty and culture of Santa Monica! So many people to observe and the beauty of the ocean and beach. The path is flat easy riding. Even when it's a bit crowed people are pretty considerate and you will see that people ride anything on a wheel or wheels. Its an amazing way to spend a few hrs on a beautiful day.\nShow less"], ["Reviewed March 8, 2017", 5.0, "Beautiful and Relaxing... and Weird", "Well-maintained bike path that stretches along the Pacific coast. We walked about 4 miles of the path and had a lovely time despite sketchy weather. People doing yoga on the sides and lots of bikes, scooters and skateboards zipping by. As it stretches into Venice Beach, be sure to check out the bodybuilders, the skatepark, and all the bizarre sights to behold. Really nice afternoon.\nShow less"], ["Reviewed March 7, 2017", 5.0, "Bike Path", "Excellent Bike Path the weather was good and there is a placefor people to walk as well, makes for an excellent experiencce"], ["Reviewed March 7, 2017", 5.0, "Wonderful exercise and lots to see", "We biked from the Pier to several play areas for toddlers, stopping at each one to play. The bike path is well organized with both coming and going paths and separate walking paths"], ["Reviewed March 5, 2017", 4.0, "Looks", "Like a lot of fun great collection of people who can ride and many that can't mixed with rollerbladers"], ["Reviewed March 4, 2017", 5.0, "Wonderful Ride", "The whole family thoroughly enjoyed renting cruiser bikes and cruising from Santa Monica Pier to Venice Beach Pier. Not a bead of sweat was broken!"], ["Reviewed March 4, 2017", 5.0, "One of the Best Beach Bike Strands in the World", "This bike path is one of the most beautiful, enjoyable, colorful and fun rides you'll ever find. The sights are tremendous, there's lots of places to stop and take in the view and if you're from out of town there's Perry's Beach Cafe for refreshments and bike rentals. Don't miss it!\nShow less"], ["Reviewed March 4, 2017", 5.0, "Family visit", "As a runner it is just wonderful to be able to step out of the hotel and head right to this amazing bike path that is also runner/walker friendly."], ["Reviewed March 3, 2017", 5.0, "Excitement w/ exercise", "Great way to catch the cultural flavor- diversity of the Venice Beach area and its physical beauty. I do not shield my kids from the homeless, transvestites, gay couples and every other kind of human. There was wonderful musicians, dancers, artists, and athletes- worthy experience and the Hulu bikes fit all of us including my 12 year old.\nShow less"]]}}