{"Alamo Square": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Alamo Square", "url": "/Attraction_Review-g60713-d156290-Reviews-Alamo_Square-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/12/ed/07/postcard-perfect-houses.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1168"}, "address": {"@type": "PostalAddress", "streetAddress": "Hayes & Steiner", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94117", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Beautiful park, great views!", "The park sits up high on a hill providing some great views of the city. Park was filled with people and families out for walks, playing on the playground, sitting on benches, etc., very peaceful. Park is a bit hilly. The painted lady homes are just across the street and those were beautiful to see as well.\nShow less"], ["Reviewed 5 days ago", 4.0, "Great park & the Painted Ladies", "Nice to see the painted ladies of San Francisco. The house from full house is found in this area, as well. The park is great. Many locals walking their dogs and families playing with their kids. We felt safe in this area as we walked all around.\nShow less"], ["Reviewed 6 days ago", 5.0, "Pretty park, Full House trivia", "We took our Full(er) House fan for the obvious reasons, but we were all pleasantly surprised by the nice children's playground and lovely park"], ["Reviewed 2 weeks ago", 4.0, "Iconic Park", "This park has a nice view of the beautiful painted ladies. Alamo Square always makes me think of full house. This was quite a walk from Union Square but I think it was worth it. I'm a full house nerd and this was on my bucket list.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Cute little park", "It's really nothing more than a cute little park with nice views of the city. While the painted ladies are pretty, they're nothing spectacular, and Alamo Square in and of itself wasn't worth more than a half hours visit, if that."], ["Reviewed 3 weeks ago", 3.0, "It's just a park with a nice view", "Sure it has a view of some famous houses and a pretty nice view of the skyline but it is just a small park. If you go there not thinking it will be anything other than maybe a couple minutes to take a picture then you won't be disappointed.\n\nWe took a Lyft there and then walked to a nearby restaurant for lunch and on to Golden Gate park. If you plan out your time on that side if the city you'll have some nice walks and can enjoy the quiet neighborhoods and parks.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A beautiful park on a hill in the city", "If you want a peaceful break inside the city, go here. This is a lovely green patch of SF with lovely old homes around and great views. You may also enjoy the natives walking their pups. It was easy to get to on the MUNI (bus) system from BART.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Relaxt small City park with great views", "Predominantly used by locals to walk their dogs this park lies on a plateau providing great vistas on down town SAN fran. It has a relaxed mellow vibe to it. Nice for a morning stroll with Some espesso to go"], ["Reviewed January 18, 2018", 5.0, "full house back drop", "you can park long the side of the road but be careful for street sweeper times posted. a nice clean park. pretty view!"], ["Reviewed January 15, 2018", 4.0, "Nice city view", "went there for the view of the painted ladies, but honestly found those to be a bit overrated. The park was a great place for a nice city view and the view of the other side of the city was even more impressive. We were there at sunset so it was really beautiful\nIt's honestly not a super special place and I'm not even sure why it's on the tourist list, but it's a beautiful park area to hang around if that's what you're looking for\nShow less"], ["Reviewed January 9, 2018", 5.0, "Nice place for painted ladies", "It is a good place to see the famous painted ladies and it's best if you have a car to drive to this place, because you will not have what to do more at this place."], ["Reviewed December 30, 2017", 4.0, "Painted Ladies", "Vernacular New World domestic architecture...reminded me, on a much larger scale of course, of hillside houses in Wellington and in the port of Lytellton.. They're lovely, gracious houses arranged around a square full of huge pine trees. This is surprising and at odds with the tamed comfortable nature of the houses. I think I expected a flower gardeny sort of park in that context, really. The views of the SF downtown skyline are fun. And the interesting and pretty houses continue in the surrounding streets and right into Haight Ashbury, which is only a short walk away, meaning that if you have time, this is a fun all day expedition. The square is easily accessed by trolley or bus from the terminus at the junction of Market and Powell and the line runs all the way past Golden Gate Park and down to Ocean Beach. So you can hit lots of high spots by branching out from here.\nShow less"], ["Reviewed December 25, 2017", 5.0, "Beautiful park and view of skyline and painted ladies", "Must visit if you are in San Fran! Very accessible and beautifully maintained park. If not cold, great for picnic too. Perfect view of skyline and painted ladies - great for photos."], ["Reviewed December 19, 2017", 4.0, "Beautiful view of San Francisco", "Beautiful houses with nice backdrop of the San Francisco skyline. It is a tourist trap so be prepared to wait for a good picture."], ["Reviewed December 16, 2017", 3.0, "Cute houses, that is all", "The Painted Ladies next to Alamo Square are cute and worth a few photos, but I'm not quite sure why they're so popular.\n\nThey're nice old houses situated in a row which obviously have had plenty of money spent on their upkeep and relatively fresh paint jobs...that is all.\nShow less"], ["Reviewed December 12, 2017", 4.0, "Very pretty homes", "The painted lady Homes are visible from the park The park is quite large The Victorian homes facing the park are beautifully and individually painted"], ["Reviewed December 9, 2017", 5.0, "Full House", "Fun to see the painted ladies, watched them in the credits of full house for years, nice to see them in person"], ["Reviewed November 28, 2017", 1.0, "Untrustworthy", "Been renting from Alamo for years in the USA ( from Uk)\nRented from here in August - the car was booked from 9am but we had to wait 2 hours as the car wasn’t there. They tried to fob us off with an “upgrade” instead of a caravan with a broken seat. We waited for this car to arrive and it had a massive dent and scratch down the side. The manager said it’s fine don’t worry I will make a note on the paperwork. I took a video of the damage and of him signing the paperwork. Today 3 months after returning the car I receive an email from the damage department asking me to complete the claim form for the damage !\nIt’s been 3 months ! I imagine they deliberately wait that long hoping people have no proof left or can’t remember. They provided poor service and are now trying to charge me for their damaged car ! So unfair .\nDon’t trust them .\nShow less"], ["Reviewed November 24, 2017", 5.0, "Fabulous family vacation", "We took our children to the Alamo on vacation. We spent hour's touring ang looking at all of the sites. My teenage boy's were fascinated! This is the place you want to take your kid's if you're in texas!!!"], ["Reviewed November 18, 2017", 4.0, "Lovely place", "Alamo square (and the painted ladies) is something you definitely don't get to see everyday, so I would highly recommend visiting (especially if you are not from the US).\nI was lucky enough to visit when there was no fog and it was not raining so there were many people in Alamo square with their dogs or having picnics and just relaxing.\nWorth a visit!\nShow less"], ["Reviewed November 14, 2017", 4.0, "More than the painted ladies", "This park covers an entire block and the painted ladies are just one end of it. Lots of space here with a tennis court, Children's playground and a free roaming Dog area. So take time to view all of it. 1973"], ["Reviewed November 9, 2017", 5.0, "A must to see painted ladies & victorian houses", "One must visit this square to see Painted Ladies or Colorful Victorian houses which are pretty old, as old as as 100 to 150 years but well maintained & very expensive. Its a very Rich Neighbourhood of hardly 2000 homes."], ["Reviewed November 7, 2017", 4.0, "Nice spot", "Nice park with a great view of the city and the painted ladies. We had no issue with parking and it was not overly crowded."], ["Reviewed October 30, 2017", 5.0, "Beautiful views and perfect for photos!", "Alamo Square is very beautiful the park itself! I have been wanting to come here since watching Full House which I grew up with. I was so excited to see the Painted Ladies and I really felt like singing the Full House theme song. This is a must visit spot you will not regret it!\nShow less"], ["Reviewed October 27, 2017", 4.0, "Lovely place and view", "It's a good place to take a rest. You have a beautiful view on the painted ladies and the skyline of San Francisco. A must see place."], ["Reviewed October 25, 2017", 4.0, "Lovely square", "A small and cozy square/park in front of the painted ladies. A square on a hill with a lovely view of SF, not quite high enough to view all of the city but you get a lovely glimpse of it.\n\nThe park wasn't too crowded on this Wednesday but I hear on the weekends it is really busy.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Great view of the San Francisco Skyline", "We went here for the beautiful view of the San Francisco Skyline. The houses next to the park is also a pleasant view.\n\nWe went here first thing in the morning and the fog totally ruined our view. We grabbed some coffee and waited it out though. It was kind of amazing to see how the city eventually cleared through the fog.\nShow less"], ["Reviewed October 20, 2017", 4.0, "Most photgraphed spot in San Francisco", "Park is worth stopping by. Great place for dog watching esp after work and on weekends, Several nice bed and breakfast's and restaurants in the neighborhood Chateau Tivoli. Alamo Square Fish House, Located about as central as possible for lodging yet quite at night"], ["Reviewed October 18, 2017", 5.0, "The famouse painted ladies of San Francisco", "Newly remodel park with lovely views of the city and the often photograph \"Painted Ladies Of San Francisco\" It can be a bit crowed on sunny days, come and check them out bring a picnic basket and watch families and dogs play in the park. And soak up the views.... You will leave your heart in San Francisco after you leave this park.....\nShow less"], ["Reviewed October 16, 2017", 5.0, "painted ladies", "came here at night for a short period just to see the painted ladies (full house intro) not the actual house . the city is in the backdrop behind the houses and looks amazing"], ["Reviewed October 16, 2017", 5.0, "Dramatic views of San Francisco skyline from Alamo Square", "Located in the Hayes Valley district of San Francisci, Alamo Square is a large four block park with dramatic views because of its steep elevation. Bordered by Fulton, Steiner, Hayes and Scott streets, this urban green space has open grass where locals exercise their dogs, a public tennis court, and restroom facilities but most importantly has some of the best panoramic views of the San Francisco city skyline, City Hall and the painted ladies, the magnificently restored Victorian Era homes along Steiner Street.\nThe square is often crowded with tourists and Finding parking can be a major challenge, especially if parallel parking on a steep hill is not familiar to you.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Wonderful views", "If you want the best view of downtown San Francisco go to Alamo Square. You also get to see the famous painted ladies which is an added bonus. The Park is great for a rest (sleep!!) if you are having a busy day sightseeing and you can easily catch a trolley bus back to downtown from alongside the square\nShow less"], ["Reviewed October 9, 2017", 5.0, "Beautiful Alamo Square", "Get a trolley bus, jump onto a muni bus and you get to Alamo square with its beautiful Victorian ladies- houses painted in lovely colours surrounding a beautiful park. Views across the city to the bay are stupendous and the experience of being able to navigate round the city is great. Everyone wants to help you get where you want to go but with a map you can get anywhere\nShow less"], ["Reviewed October 5, 2017", 4.0, "The Painted Ladies", "We went to Alamo Square to see tge famous Painted Ladies. However there were so many beautiful old homes in the area it made me wonder why the Painted Ladies became so famous. In truth it must be the background that makes those particular homes so photographed.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Take a walk back in time.", "If you want to see what San Francisco used to look like, head to Alamo Square. This small-ish park in San Francisco provides great views but more importantly allows you to see some great historical architecture.\n\nThe beautiful ‘Painted Ladies’ give you an insight into how the Victorians lived and displayed their wealth to their neighbours. Still, generally, very well preserved, this quick break from the busy city allows you to pause and take a quick trip back in time.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Famous Landmark", "The houses are in a nice area with a grass park in front of them.\nThey are a bit out of the way from the usual visitor areas.\nThere are many other houses in San Francisco that are as good as these but this seems to be the only place where there are 5 together.\nIf you like architecture of this period you have to walk around the residential areas of San Francisco.\nYou will need a spare memory card for your camera as there are so many houses of this type between the other buildings .\nShow less"], ["Reviewed September 23, 2017", 5.0, "Lovely Park, Great for Picnic and Views!", "So glad the park was open this year when we visited. We stopped by Alamo Square last October and were so disappointed, but all that disappointment was erased this time around. What a beautiful hilltop park which takes up the enter block. The views from the top of the city behind the painted ladies is iconic and a must see. The homes all around the square are beautiful. Lots of shade and open space great for picnics, strolling around the park or playing with your dog. There was even a coffee shop truck parked in the park which was a gem. Parking around the square can be tough during peaks but we didn't have any trouble on a Friday around lunch (it was still full of locals and tourists).\nShow less"], ["Reviewed September 16, 2017", 5.0, "Famous Painted Ladies", "This has to be one of the most iconic views of San Francisco, identifying the city at once through many movies and TV shows. They must be the most photographed houses on earth! But, the park itself is an oasis of green and one of many around San Francisco, which relieve the built up areas. Go see the ladies at least once in your lifetime!\nShow less"], ["Reviewed September 14, 2017", 5.0, "Great park and view", "If you remember the opening of Full House, then this is where that row of homes are located. There is a great park across the street and frankly takes up the whole square block in Alamo Square."], ["Reviewed September 13, 2017", 4.0, "Full House - Painted Ladies", "Just like the TV shows opening credits, just have to walk to the top of the park and get the right angle. Really nice view of the city,"], ["Reviewed September 12, 2017", 4.0, "Painted ladies Beautiful", "We visited the square to see the famous \"painted ladies\" and they are beautiful. One can stroll around the square and enjoy the walk."], ["Reviewed September 6, 2017", 5.0, "Beautiful Park! Great view of Full House Street!", "This is a beautiful part to have a picnic or just walk around. Great place to take a picture in front of the famous row of houses that is in the intro to the original Full House Show."], ["Reviewed September 6, 2017", 5.0, "Wonderful Park for a picnic", "Stop in to see the famous painted ladies, but then walk down to Divisadero and grab some food for a picnic. On a nice day the park is sunny and warm and perfect for a picnic. There's a good playground and an area for dogs too.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Reputed to be the most photographed homes in San Francisco", "You've probably seen the \"painted ladies\" aka Victorian homes in magazines in commercials... Pretty impressive! Fun to see."], ["Reviewed September 1, 2017", 4.0, "Fun Quick Stop", "If you are a Full House fan this is a fun quick stop. These are the houses that were in the intro to the show not the house where the family \"lived\" in the show. Was still a fun stop for quick pics."], ["Reviewed August 28, 2017", 4.0, "Iconic Views", "This is where you will see the postcard view of the line of Victorian houses right up close. Plus it's a very pleasant park. Good views of SF downtown. Surrounded by unique and spectacular architecture. On the tourist route."], ["Reviewed August 28, 2017", 4.0, "Come for the Painted Ladies", "Just sit at this vantage point to see the Painted Ladies. Watch the sun set behind them and its beautiful. Everyone is so chilled hanging out and having picnics. Another side to the beautiful and scenic San Francisco."], ["Reviewed August 26, 2017", 3.0, "Small park, overcrowded", "Everyone goes to Alamo Square to see the famous Painted Ladies. That's where the crowds come from. Not a great place to have a picnic or relax. FYI, these aren't the houses from the show Full House."], ["Reviewed August 21, 2017", 4.0, "Iconic view in San Francisco!", "I really loved the painted ladies with the San Fran landscape in the background. We sat in the park and admired the view. Careful if you park here, we saw a lot of broken glass on the floor from car break ins."], ["Reviewed August 12, 2017", 4.0, "Remember The Alamo, Square", "I did see some of the Victorian's in the Haight Ashbury area which I thought were incredible examples of the enchanted Painted Ladies, but my curiosity was now peaked to see the famous view of the iconic Victorians at the park.\nThe SF Ladies are a bit different from Cape May, NJ's structures being that a lot of them are situated on a hill & are extremely close together, but both cities can boast about their captivating colorful charm.\nThe Alamo Park setting photographed so well. An added bonus is the view of the city in the background. I will remember Alamo Square as being a quaint city park where the public can leisurely spend some time not only viewing the brilliance of these man made historic homes, but also mother natures gift of greenery.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Alamo Square", "Beautiful Victorian homes. The painted ladies are must see, educational and Informative. Definitely a family adventure"], ["Reviewed August 11, 2017", 4.0, "Victoria houses painted ladies", "Loved the painted ladies Victorian houses beautiful view and skyline San Francisco such a beautiful City lots to see"], ["Reviewed August 4, 2017", 4.0, "Alamo Square Review", "Had to go here for the op photo and the historic relevance of this San Fran landmark. My wife and I had been in SF before but not here. Nice square with beautiful houses. Recommend it highly."], ["Reviewed August 1, 2017", 5.0, "The Famous houses", "We had cheese and biscuits and good drinks when we visit the park and have a look at this famous houses. With a MUNI-bus pass it`s Easy to get here. On top of the hill it`s a good look over a part of San Francisco."], ["Reviewed July 31, 2017", 5.0, "Great photo op", "Was in downtown SF for business and had a free afternoon to explore. Took the 5 bus from Union Square so didnt have to worry about parking. Popular place to see the Painted Ladies and the SF skyline. It's a small park, just recently renovated. Walk around the square to get a good shot of the houses and the skyline.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Great place to spend a lazy day", "Alamo square has some great view points of the city, but most famously the painted ladies, a group of 7 victorian style houses that make for a great photo opportunity, and one of the most visited places in San Francisco. The parking situation around alamo square is all parallel street parking, but I had no issues finding a spot to park. There's a few great walking paths and a playground for kids to play on, along with bathroom facilities. There is also a pretty awesome view of Coit Tower. Definitely recommend stopping by.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Eye candy!", "If you like details, this is the right place to visit. These houses are full of details in their architecture. Sitting at the park feels good, or just laying on the lawn. Nice friend to walk around."], ["Reviewed July 28, 2017", 5.0, "Beautiful views.", "The view from the park above the Painted Ladies is simply gorgeous. The painted ladies are so pretty too."], ["Reviewed July 24, 2017", 4.0, "What you see on TV and Movies", "If you remember the opening credits of Full House you will recognize this area. The Square is just that. A large Square Grassy area. There are some great views of San Francisco, and you can see the famous houses on the hill. This is not where the Full House is, but you can find it in town. We stopped briefly to take in the view, but you might be fine just driving by the square and on. It would be a nice place for a picnic in nice weather.\nShow less"], ["Reviewed July 23, 2017", 3.0, "Alamo Square--Just a Park with Great Views", "San Fransisco is a beautiful city. Really an amazingly beautiful city. With breathtaking views at nearly every turn. It is also a city with smallish parks dotting its landscape. And, many of these parks offer amazing and wonderful scenic views.\n\nAlamo Square is one of these wonderful urban oasis with great views. And, the famous Painted Ladies houses are across the street from the park.\n\nIn San Fransisco, the parks are packed with people (on nice weather days). Families with kids on blankets. Twenty-somethings hanging out because the weather is great. And, at Alamo Square, there is a large section for people with dogs.\n\nGreat view. Cool to see the Painted Ladies. I'm not sure it would be a destination site. We hit four parks on our personal walking tour and they were all great.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Painted ladies", "To be very honest the houses in san Francisco are so pretty i dont think the painted ladies are nothing special. In alamo square you have beautiful views of the city"], ["Reviewed July 14, 2017", 4.0, "Famous Painted Ladies from TV", "My granddaughter had begged to see the Painted Laddies from TV;s Full House. She was not disappointed. We walked around seeing so many more painted ladies similar to the row. Actually it was very interesting to see how many variations there were and the unique architecture. We took the 21 bus from Market Street and back. The park has restrooms if needed. Great views of the city from the top of the hill..\nShow less"], ["Reviewed July 12, 2017", 4.0, "good view of the city, nice architecture around the square", "First - the children's playground - it is great but DIRTY! I've never encountered my children (5 years and toddler) getting so filthy after a trip here. Plan on kids having a bath afterwards. It also has a lot of sand - so we take some little accessories to have fun with it (shovels, buckets etc). The view of the city whilst pushing my little one on the swing is awesome. I love the houses in this city, and yes, the Painted Ladies are lovely to look at. I feel awful for the owners having tourists gawk at their homes all day long. I was surprised by the number of people there for these houses (and the view). There is a public toilet near the playground - I've never used it but it tends to have a queue of people the times I've been there.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Nice place", "Alamo square is a very nice place to visit. You can see The Painted Ladies and also take some great photos of San Francisco. The view is breathtaking!!!"], ["Reviewed July 5, 2017", 5.0, "The Painted Ladies", "If visiting San Francisco, one must visit the beautiful painted ladies near the Alamo Square. They are Victorian style homes painted with artistry. Many believe that they were used for the outdoor scene of the television series Full House."], ["Reviewed July 5, 2017", 5.0, "Fun!!", "Beautiful park with wonderful architecture completely surrounding it! Get there early on a Sunday and you won't have a problem finding a spot to park! And don't forget to check out the old haunted mansion looking house on one of the close by corners!"], ["Reviewed June 27, 2017", 5.0, "Amazing, but careful about parking around-freuqnet car breakins", "I spend some time there before going to the airport. Amazing view on a par at the top of SF. However, bad surprise on the way back. My car rental had a window smashed and a backpack with a laptop taken. Apparently they happen frequently every day. So, watch out. Do not park around and if you do do not leave anything in the car. They would need some video canera around, would love to get these rats.\nShow less"], ["Reviewed June 26, 2017", 3.0, "Quick Visit", "We walked through the park to the other side to see the Victorian Houses. Okay, saw them, took a few pictures and that's it, you wont even spend 15 minutes here. We walked through the park to get to the side of the houses, not too thrilled to see all the dogs from the dog park running freely around, even on the walking path. I get it, its a dog park but where they are suppose to be not where people are relaxing, sitting and walking about.\nDon't think this is a must on anyone's list. Its just pretty houses at the end of the day.\nShow less"], ["Reviewed June 22, 2017", 1.0, "Car break-ins common", "Warning - car break-ins in this area are very common. We parked our car and walked the park for 15 minutes to see the Painted Ladies (row of houses). When we came back, our car and another car had windows smashed on. Our car only had things like coloring books stolen but the car was a rental and it took time to go back to the airport for an exchange, not to mention the cost of repairing a broken window. A woman walking by said that this happens every day. We borrowed a broom from a gentleman who lives across the street and he said that car break-ins are very common here. My advice if you're visiting from out of town: drive by the houses, don't stop at the park. Or take an Uber.\nShow less"], ["Reviewed June 16, 2017", 4.0, "Must see", "I love the view. Reminds me of full house and now fuller house. What a great view. A good background for a scenic shot."], ["Reviewed June 12, 2017", 4.0, "A very nice park", "Another small park where you can relax and have a nice view of San Francisco. You can easily relax on the meadow, take a picnic or sunbath."], ["Reviewed June 12, 2017", 5.0, "places to see in San Francisco", "One-of-a-kind attraction! Only in San Francisco! Nostalgic and historic remembrance of old houses in view. The park is newly renovated and worth the trip to visit. A \"must\" see!"], ["Reviewed June 10, 2017", 5.0, "Painted Houses", "We had to see this. Painted Ladies. The houses were something to see and this is where Full HOuse was filmed. They had just re-opened the park across the street. Beautiful"], ["Reviewed June 3, 2017", 5.0, "Beautiful park", "Awesome park to relax and take pics of the painted ladies. Has a nice area for the kids to place in the swings and slides. And great for pics"], ["Reviewed June 2, 2017", 4.0, "Go there once in your life", "The houses are pretty but they don't look like this photo. Many have been painted different colors and it is rarely sunny. Still a good park to walk around."], ["Reviewed June 1, 2017", 5.0, "Well kept", "This area is well kept and seems to be popular with a lot of tourist as many people had cameras while we checked out this area."], ["Reviewed May 22, 2017", 3.0, "Lots of Construction", "It is always fun to see a childhood memory in real life except the park across the street which would normally allow you to take good pics is under construction and parking is TOUGH"], ["Reviewed May 10, 2017", 5.0, "Worth the view", "We went to see the \"painted ladies\" and it was definitely worth it. SF sky line from the top of the hill are breathtaking and the views of the \"Painted ladies\" worth the trip. The park is under construction but I do not regret going."], ["Reviewed May 4, 2017", 5.0, "Beautiful Painted Ladies", "These house are grand, elegant and beautiful. The park was closed so we couldnt get a more elevated photo of the painted ladies but never the less they are a sight not to be missed."], ["Reviewed May 4, 2017", 3.0, "Not what I expected and over rated.", "We took a few buses before we got to Alamo square...that was fun with the kids. Considering they are big fans of Full House this is why we wanted to go. They were disappointed since the house doesn't look the same. Would i trek all over town to see this place...NO. The park across the street was also under construction which made it even more of an 'average' experience.\nShow less"], ["Reviewed April 26, 2017", 4.0, "A Work in Progress", "The area is under construction, but that will be ending soon our tour guide had told us. That said, this is a beautiful area with awesome views of the bay. However, bring your hiking shoes as that hill is brutal coming from the east up,...More"], ["Reviewed April 23, 2017", 4.0, "Under construction, but still beautiful", "I have a tween daughter, so this was a must on our trip. The park is under construction, but is still quite nice. We did a hop on hop off tour and had to walk a few blocks from where they let you off. Great...More"], ["Reviewed April 19, 2017", 5.0, "The square across from the Painted Ladies", "It was a bucket list experience to see the Painted Ladies while I was in San Francisco! What better way to appreciate the ladies than sitting on the beautiful grassy square right across the road on a perfect sunny day!"], ["Reviewed April 16, 2017", 4.0, "Beautiful houses", "Alamo Square is famous for the Victorian style houses called Painted Ladies. We stumbled on this place while on a walking tour of SF. The houses have amazing architecture and during sunset, the place is really spectacular."], ["Reviewed April 13, 2017", 4.0, "The Houses", "Such beautiful homes in this area. All the different colours and designs. Made for some good photography."], ["Reviewed April 13, 2017", 5.0, "Iconic lanscape", "We walked from the city hall all the way to the painted ladies and the walk there was as nice as the ladies. There are so many gorgeous houses on the way there. If we go back to San Francisco we will defentely go there...More"], ["Reviewed April 12, 2017", 3.0, "No a must-do", "Honestly, if you've seen a picture, that's pretty much it. Not much different from houses we saw all, over SF. My kids wanted to see it because of the opening credits of Full House (note: Full House House is in a different location). 10 minutes...More"], ["Reviewed April 3, 2017", 4.0, "I walk by here every May with Bay to Breakers", "A nice park to visit and lots going on in the Hayes Valley area with restaurants, coffee shops and cafes."], ["Reviewed March 27, 2017", 4.0, "Fenced up", "Alamo Square was fenced up, with the exception of a corner. You could see the Painted Ladies, but with a chain link fence as foreground. Be careful not to leave anything in plain view inside cars: I saw a couple of break-ins, despite the crowded...More"], ["Reviewed March 15, 2017", 4.0, "Photo Op", "Go and take your photos. It's obligatory. But seriously, this is a nice park in a formerly sketchy area, now very safe and prosperous. Pretty park, great views."], ["Reviewed March 9, 2017", 5.0, "The Pink Ladies", "Great example of San Francisco architecture and fun to see if you watch the TV show Full House. These homes are in the open shot of the show."], ["Reviewed March 6, 2017", 5.0, "Great city landmark", "Great city landmark with a park and good view. Parking is difficult so it is best to take the BART or public transportation."], ["Reviewed February 22, 2017", 5.0, "Park close, but able to see the painted ladies", "Park was close because of some remodeling and new grass on the gardens. Really nice place, but careful, we saw some glass on the sidewalks and I asked local people and they confirmed that during night, cars can get open or broke glasses to get whats inside of the cars.\nView of the painted ladies are great...\nLooks like an expensive neighborhood..\nShow less"], ["Reviewed February 21, 2017", 5.0, "lovely old ladies", "A great day out with lots of parking. Alamo Square is a lovely green park located across the road from the painted ladies. Go and enjoy a relaxing walk around the park or just sit back and admire the scenary of the beautifully painted ladies. Great for the whole family, park has a play ground for the kids.\nShow less"], ["Reviewed February 19, 2017", 4.0, "Mrs Doubtfire", "San Francisco is know for the beautiful Victorian style homes, these on Alamo Square even more so known as the \"Painted Ladies\" these vibrant Victorians are located on Steiner St in the Haight Ashbury neighbourhood. The park was being renovated when we were there."], ["Reviewed February 19, 2017", 3.0, "Not a must-see place in San Francisco due to the construction", "Alamo Square may be a popular spot for tourists, but we didn't find it that interesting, especially with the construction going on as of February 2017. At this point you can't walk in the park or take any good photos with the green grass in the foreground and the colourful houses in the back. There are fences everywhere and even though many tourists visit this place it really is not a must-see unless you have plenty of time and want to cover the whole city. That said, this is a nice area and one can walk from here all the way to the University of San Francisco and from there enter the Golden Gate Park, located in the southwest of the city. You can also walk the other direction and discover lots of little cafe places and enjoy the peace and quiet. This area is very different from the eastern and northern shores of the city, bustling with tourists and locals. This is a quiet residential area where people walk their dogs and tourists come to take photos. I believe it might be better once the construction is finished and the weather gets warmer. Then people could actually hang out at the park and maybe even have a little picnic.\nShow less"], ["Reviewed February 16, 2017", 4.0, "Square currently under reconstruction, but the photo point is still available", "Square currently under reconstruction, but the photo point is still available. It is possible to park at the square. The view is indeed as we know it from movies..."], ["Reviewed February 15, 2017", 5.0, "The Painted Ladies - how many shows/movies have they appeared in?", "Tourists everywhere and limited parking. . . park is being \"rejuvenated\" for the next couple of months so there is blue fencing in the way of your picture taking and the park is MUDDY! Go early in the day (but the \"Ladies\" will be in the shade) to avoid the insane crowds. Be aware of many car break in's in the area . . . they watch you get out of your car . . . have someone drive around the block and come back to pick you up instead. A must see if you have a family member who is a fan of \"Full House\"\nShow less"], ["Reviewed February 14, 2017", 4.0, "Full House Lovers Must See", "The famous clips from Full House. Park was under construction but still able to see the famous view. I went in the afternoon and not as many people."], ["Reviewed February 2, 2017", 4.0, "Busy", "This is where you can see the painted ladies but get ready for tourists everyone and huge RVs trying to park. The architecture is beautiful so I did enjoy seeing them."], ["Reviewed January 24, 2017", 3.0, "Currently under construction", "The Alamo Sq and its park from where the Seven Ladies are best seen is currently renovating. There's a small part accessible for taking pics, but no need to come if it's not on your way.\nSuch houses, even more beautiful can be seen in all of SF, specially around Haight-Ashbury.\nShow less"], ["Reviewed January 21, 2017", 4.0, "Beautiful Victorian homes", "Drove by on bus tour of San Francisco. Beautiful Victorian homes in pastel colours. Very nice neighbourhood and expensive. Visited in September 2016."], ["Reviewed January 12, 2017", 2.0, "It's a row of houses", "Quite far out To snap a photo of a row of houses. Ok it might mean more to some people. But for someone from the UK. Yep. Houses. Shall we got to the pub?"], ["Reviewed January 9, 2017", 5.0, "The most iconic view in San Francisco.", "This is it! The most iconic view in San Francisco. The painted ladies of Alamo Square! The park itself has a great vista for one of the best views of the City By the Bay, but also has a dog run, playground and several tennis courts. The streets (on all 4 sides) are lined with the beauty of wonderful examples of Victorian archetecture.\nShow less"], ["Reviewed January 8, 2017", 4.0, "Landmark Homes in Downtown SF", "I was surprised how many families and other visitors had the same idea that we had, to visit the Painted Ladies. They is featured on the American TV sitcom, \"Full House.\" The park across the street, currently under construction, but still featuring benches to sit and reflect on the city, offer a nice view of the homes, and the city beyond.\nShow less"], ["Reviewed December 30, 2016", 4.0, "The view toward downtown (Transamerica Bldg) is iconic", "The park has construction fencing around it is not worth spending much time, but the view of the Painted Ladies and downtown is iconic. Worth a 10 minute stop on your driving tour of the neighborhoods."], ["Reviewed December 29, 2016", 3.0, "Gosh", "Cmon folks-leave the people who live in these houses alone. There are better views elsewhere. They are."], ["Reviewed December 26, 2016", 4.0, "Dog Friendly", "There was construction on the park so it was a little crowded when we went on the weekend, so watch out for tourists (including you)."], ["Reviewed December 18, 2016", 4.0, "A dog friendly park, but more meaning than that for me", "Alamo Square and Park on the western addition is probably mostly known as the best spot to view the ‘Painted Ladies’, but it offers a lot more. There are many residences in the neighborhood and at the center is this park. The park is a very popular doggie walk area, has a tennis court, benches, grassy area, trees, and restrooms facilities that on my visit were soon closing down for the summer and fall for severely needed upgrades and repairs.\n\nThis park also happens to be located at the top of the only hill during the course of the annual Bay to Breakers race. The musicians, performers and well-wishers along this tough section of the race was beyond a doubt always the most inspiring and motivating area for me during the entire race, which I will always appreciate and respect.\nShow less"], ["Reviewed December 17, 2016", 5.0, "Underrated", "This is a great little spot that you can get to via the city tour bus. The actual square facing the famous houses is quite nice and may be worth packing a picnic and sitting in there for a while. It's not a big place so not much time is needed, but it's still quite nice and not over crowded\nShow less"], ["Reviewed December 16, 2016", 4.0, "I always love the Painted Ladies", "Some beautiful Victorian homes. These homes have been around for a long time, and still look amazing. I love visiting Alamo Square for a quiet afternoon when I'm in SF."], ["Reviewed November 28, 2016", 4.0, "The houses are just amazing!", "We remembered this from Full House and the initial impression was a little disappointing as they were re seeding the grassed area across the road. But the houses are amazing. the painted ladies are just a small example of just fabulous architecture of the time. Great to walk around and look.\nShow less"], ["Reviewed November 26, 2016", 5.0, "Limited views for the time being", "Alamo Square Park is currently being remodeled/relandscaped/whatever. The whole area is dirt and is fenced off. The bottom line is that you're not allowed even half way up the hill, which means that you're not going to get good pictures of the Painted Ladies with downtown in the background. It doesn't stop people from coming though. If you can manage to grab a bench, you can have a very pleasant and scenic sit-down for as long as you'd like.\nShow less"], ["Reviewed November 18, 2016", 4.0, "Nice Victorian architecture, but there are other sections of town that are just as architecturally relevant", "This landmark neighborhood and square is known for its beautiful Victorian architecture but it's important to know that there are many other neighborhoods in the city that have just as nice Victorian houses with amazing gingerbread and character. This is also the place where a scene from the first part of Tales of the City was filmed.\nShow less"], ["Reviewed November 7, 2016", 4.0, "Full house memories", "This is a great place to take pictures of the house from the TV show Full house. Even if you haven't seen it the houses are pretty"], ["Reviewed November 1, 2016", 5.0, "A must see", "This is a must see for tourists in the city! It is a great photo op and just cool to say you have been to the \"full house\""], ["Reviewed October 27, 2016", 4.0, "Full House", "The Painted Ladies are so beautiful! Very San Fran! Cool to see especially if you are a fan of Full House!"], ["Reviewed October 24, 2016", 4.0, "Painted Ladies", "They've been in so many movie back drops you have to go for a selfie or just go look. The were renovating the park when we went but still well worth a ride on the bus and walk up on he hill"], ["Reviewed October 24, 2016", 4.0, "From the show \"The Full House\"", "If you watched the show \"The Full House\" its a must to visit. Even though the park and one of the houses were under construction, it was nice to to be there, it brought me back good memories of the show. Located on the hearth of San Francisco downtown.\nShow less"], ["Reviewed October 21, 2016", 4.0, "Full House of Painted Ladies", "We visited to see the splendour of the painted ladies having never seen Full House. It would be interesting whether this is a popular place because of the TV show or for the painted ladies themselves. As with all recent TA reviews, we did not get to see the splendour of the Alamo park as it was having a major facelift while we were there. The painted ladies made it worthwhile as they are truly architecturally aesthetically pleasing.\nShow less"], ["Reviewed October 18, 2016", 3.0, "Damaged Park, but...", "When we went there, the Park was sadly damaged and they were refurbishing it to make as good as new.\nthe bright side is that the Seven Sisters are still there, standing, damn Beautiful.\nSo don't hesitate and enjoy your time in the square but mostly in San Francisco !!!\nShow less"], ["Reviewed October 11, 2016", 3.0, "Under construction", "This is an iconic place in San Francisco, especially for Full House fans, but unfortunately, it's under severe construction. I was expecting a grassy knoll maybe fit for a picnic, but none such luck. You can still get a good picture of the Painted Ladies, though.\nShow less"], ["Reviewed October 11, 2016", 3.0, "A Must for a 90s kid", "I loved the fact that i could visit the houses from the Full House opening credits. They were beautiful. The down side was that the square was completely dry. No grass just dirt. So not much to do there but take a picture and be on our way.\nShow less"], ["Reviewed October 10, 2016", 3.0, "5 minutes stop", "The park at Alamo Square is closed right now so basically you are walking by the painted ladies victorian houses. Good for a quick stop to say you've been there, but you probably won't hang out for long."], ["Reviewed October 1, 2016", 4.0, "Under construction", "The square is closed off, but you can still get a decent view of the Painted Ladies, they are really beautiful and worth a visit, but people must be respectful of the owners of these houses, take your photos from a distance and keep noise to a minimum.\nShow less"], ["Reviewed October 1, 2016", 1.0, "The only thing to do is take a picture, save time and visit the less famous, but more beautiful homes of SF", "Boring, boring, boring. The park is under renovation. There isn't really parking. There is a plot of grass on the hill adjacent to these houses where everyone stands and takes pics with these houses. These aren't even the most beautiful homes in the city, save time for something worthwhile.\nShow less"], ["Reviewed September 26, 2016", 3.0, "Alamo Square", "The Park at Alamo Square is under construction so you are limited to a small space from with to view the Painted Ladies/Seven Sisters. Last week also one of the Painted Ladies was being made over (painted)."], ["Reviewed September 23, 2016", 4.0, "Under construction", "Who wouldn't want to stand in the spot of the opening of Full House and admire the beautiful Painted Ladies. Park is currently under constructions so it's a mound of dirt. They do have a small area in the park across the painted ladies for picture, but you can get up high enough to get the view of the city. Visit when park construction is finished!\nShow less"], ["Reviewed September 11, 2016", 1.0, "Pls don't come...", "First of all, Alamo Square is under renovation, it is no longer a good place to view the skyline of San Francisco.\n\nSecondly, with so many tourists daily to \"view\" the Painted Ladies, I pity the residents of the 6 households.\n\nI witnessed how 3 Asian ladies taking turns to pose and take their individual and group portrait in front of the houses, at the middle of the road in order to take the \"perfect\" picture. There were even tourists who parked in front of the houses in order to take pictures. It is intrusive, dangerous and disrespectful. If you entire purpose is to take the shot and show off to people you have been there, buy a postcard and you could always Photoshop yourself on it...\n\nIf you want to appreciate the buildings in a more quiet atmosphere, pick any building along Golden Gate Avenue or walk along Haight Ashbury.\n\nFor Guide Books, pls take this \"tourist attraction\" out of your book.\nShow less"], ["Reviewed September 6, 2016", 3.0, "Park currently closed", "The park is currently closed for renovation. There is a huge fence around the park, and all of the grass is gone. The dirt from the park is tossed around (at least wear sunglasses to keep it from flying into your eyes), however they have left a section open to view the Painted Ladies. It is a nice view from the park. I can see that it will be very nice when the renovation is complete. I wouldn't consider this a must see on a short trip to SF, however we are staying for a month and thought it was a nice stop.\nShow less"], ["Reviewed September 3, 2016", 5.0, "A more classic view that doesn't include a bridge would be hard to find", "Yes, this is the iconic view of the Painted Ladies. And, for a bonus, if you arrive when there is at least some sun, the sunset from the park is grand."], ["Reviewed September 2, 2016", 3.0, "Painted Ladies", "The painted ladies of Alamo Square looked quite different than they were the first time I viewed them back in 1969. The bright vibrant pastel colors have been updated to more subdue colors but the Victorian residential architecture stills has its beautiful details everyone has grown to love over the years.\nThe Alamo Square Park was closed and fenced off, really was quite ugly, all brown and no green grass. Hopefully they will be finished with the upgrades soon so everyone can enjoy the view of the Victorian Painted Ladies from atop the green hill as we all remember seeing them over the past years.\nShow less"], ["Reviewed September 2, 2016", 4.0, "Great views", "we were disappointed that the park was closed for renovation. However the whole area was interesting and the houses were lovely. The painted ladies are worth a photo stop but we were stunned at the number of people posing on the steps, by the front doors, and even peering through the windows! No wonder the residents have net curtains!\nShow less"], ["Reviewed August 29, 2016", 3.0, "Nice views... But..", "I was there for an hour. The views from San Francisco are amazing BUT ... Be aware that the park is going under renovation and is closed .\nI still recommend a visit and walk around, but you don't need more than an hour.\nHave fun and enjoy San Francisco!!\nShow less"], ["Reviewed August 26, 2016", 4.0, "Reno under way", "At the moment the city is revovating the park opposite the square so there is only one pathway to lookout from and get pictures\nThis means the area can get a little crowded at times\nThe square is easily accessible by public transport\nIt is a nice photo stop/opportunity during your San Fran adventure\nWe stopped off on our way back from the golden gate park\nShow less"], ["Reviewed August 20, 2016", 5.0, "Beautiful spot to get your Full House fantasy on", "The best part of this park is checking out the view of all of SF... best to come during the sunny part of the day - it usually becomes chilly and windy in the evening."], ["Reviewed August 18, 2016", 5.0, "Houses are beautiful", "These homes are so intricate and well maintained. Hard to believe there are people who actually live there. The park across the street is closed. That is normally so peaceful to lay in the grass and relax for awhile."], ["Reviewed August 17, 2016", 3.0, "Not as Pretty as Expected", "The homes were not as bright as i thought they would be and the park was closed and being renovated. Not worth a trip there we passed as we had a car to do so otherwise we wouldnt have bothered"], ["Reviewed August 13, 2016", 4.0, "Park is closed :(", "Sadly, the park is closed, but you can still enjoy seeing the painted ladies. My husband pulled up the Full House theme when we got there and everyone around us sang along!"], ["Reviewed August 12, 2016", 3.0, "Not So Painted", "If your time is limited, visiting the Painted Ladies is something that you could skip. The houses are pretty, but the city is full of beautiful houses."], ["Reviewed August 9, 2016", 3.0, "Park is under construction with chain linked fence", "You can drive around and still get a great photo of the painted ladies but actual park is under construction with fence around it."], ["Reviewed August 9, 2016", 5.0, "Pictures in you...", "The only bad luck of this place is that the owners of 7 houses, everyday, give to petulant travelers their privacy. Anyway if you are in the beautiful SFO, you have to dedicate a walk to the ladies.\nPretty point of view; must see at sunset...\nShow less"], ["Reviewed August 8, 2016", 3.0, "Nice houses as there are so many in London", "Ok the houses - The painted ladies - are nice but we have seen more and even more beautiful houses in San Francisco if you just walk the streets in this same neighborhood. Of course they are worth a photo omens"], ["Reviewed August 5, 2016", 4.0, "Fun little stip", "There was construction going on in the park so there was a lot of ugly fences up but managed to get a few great pictures! So fun to see these houses in person! It was busy with people picnicking and playing with their dogs! It was a great stop for stretching our legs!\nShow less"], ["Reviewed August 5, 2016", 5.0, "Best Spot to Shot The Painted Ladies", "This is the place to be to shot the Painted Ladies, because you can have a better angle for your pictures and put the SFO Bay just behind them all."], ["Reviewed August 4, 2016", 4.0, "Few people take advantage of the Site of Seven Sisters in the middle of Town.", "Take a lot of picures here. Do selfies in front of iconic Victorians. See the City from the top of the hill. Enter the Bishop's Inn opposite the Victorian homes to see wonderful decor, terrific architecture and an incredible stained glass skylight at the top of an elegant circular staircase. This is the Heart of San Francisco. If you can manage it take a room at an Inn on Alamo Square. You won't forget it or regret it. Drive up or taxi to Clement Street, the Other Suburban Chinatown. Tour the shops, see the Asian Foods and eat a great meal at prices far from the tourist traps. All of the shops and retaurants are West of Divisadero.\nGet directions or use GPS to tour the Presidio on 49 Mile Drive. See the bridges and the Pacific Ocean. Drink it in. This is a city to leave your heart in.\nShow less"], ["Reviewed August 3, 2016", 5.0, "Come for the Painted Ladies on Steiner Stay for drinks coffee or food", "This is my hood and though it has changed. It offers so so so much. There is music at the Independent. I've seen Gregg Allman and a band called Yemen Blues that make you dance. I've eaten at Nopalito and I recommend the pork and cabbage salad.I've walked up to Flybar to sit with a friend in the window soaking up the sun and enjoyed their house piazza.I've had breakfast at the Grind on Haight and Scott and I've walked the panhandle to get to work. There's a record store, You can get your nails done or just walk along Divisadero. It's noisy,vibrant and alive.\nShow less"], ["Reviewed August 1, 2016", 3.0, "Major construction with the park", "Really sucked because the park that was suppose to be just outside of this street was all torn up!! So it really sucked not being able to sit on the grass and enjoy the view it was so dusty and just placed a damper on the whole thing :(\nShow less"], ["Reviewed August 1, 2016", 2.0, "Skip until the renovation is completed", "We went for the famous view but the park is being renovated (we were there July 2016) so it is closed off. You can only therefore go to walk past the houses and if you're only in San Francisco for a short time it isn't worth the time out of your day to visit.\nShow less"], ["Reviewed July 31, 2016", 2.0, "Only 4 nice houses. Over rated", "If this was in Europe it would not be a recommended visit. But it is in States. There are 4 nice houss and they are like the photo... Nothing more. Better spend your time in the peers area, in the bridge or wslking in the golden gate park\nShow less"], ["Reviewed July 30, 2016", 3.0, "Closed for works", "This is a small park directly opposite the Painted Ladies. Anyway, it's undergoing some work and the whole area is fenced off so at least until the works are finished there's nothing to see. Next!"], ["Reviewed July 28, 2016", 5.0, "The Home of \"Full House\" is Found Here and the Painted Ladies!", "So, if you are or were a fan of the Olsen sisters and the series Full House, you will want to visit this site. The home featured in the show is1709 on Broderick Street. There is a pretty and typically sunny park in this square where dogs run about. May be a spot to rest and eat.\nShow less"], ["Reviewed July 28, 2016", 5.0, "Make sure you walk around San Francisco when you visit, and get out of the touristy sites into the city.", "Alamo Square is a good place to start a walk to see the real San Francisco. There are great shops on Divisadero (around Golden Gate) and Fillmore Streets (around Sacramento Street). It is much better to stay out here and away from Fisherman's Wharf, the Tenderloin or downtown, for instance, the Metro Hotel on Divisadero or the Stanyan Inn, or airbnb it. This area is not far from Baker Beach, the Presdio, Fort Point on the way across the Golden Gate Bridge, Golden Gate Park, the Castro, the Haight and the streets in between. It is a real mistake to stay only in the downtown and never stay in the Tenderloin, which for some reason, is where Euros often end up -- must be their travel sites send them that way. Also, recognize that summer is cold in SF, so plan part of your trip in Napa or the foothills or Sierras for some summer sun.\nShow less"], ["Reviewed July 27, 2016", 3.0, "will be really nice once the renovations are complete", "Any Full House fan must go. It looks just like on the show. But that is all there is to do there right now. Look and take a picture."], ["Reviewed July 24, 2016", 4.0, "Easy to get to with public transportation", "This is easy to go see with the public transportation in San Francisco. Beautiful photos of the painted ladies can be obtained especially on a beautiful sunny day. They tend to look more dull if it's overcast. Recommend for the photo op especially if you don't have much time to spend here.\nShow less"], ["Reviewed July 22, 2016", 5.0, "Must see Painted Ladies", "The square is currently being renovated so is a bit of a dust bowl but lots of people still there to see the 'Painted Ladies'. The houses are worth going to look at and will provide you with that iconic SF architecture photo. There are also other less famous houses around the square so it is worth a walk around the whole perimeter to view all the houses. From here you can have a walk through Pacific Heights or through to Divisidero St for lunch/good coffee.\nShow less"], ["Reviewed July 21, 2016", 4.0, "Alamo Square Park is being renovated in 2016 so that iconic photo you wanted to take isn't gonna happen!", "Just a heads up that the park is closed for renovation for the next few months so we weren't able to take that iconic photo of the Painted Ladies with the city in the background. When we were there in early July, the entire park was fenced off. We were able to walk by and see the Painted Ladies which are just lovely homes! Anyway, that's a reason to come back to San Francisco and visit the new and improved Alamo Square next year!\nShow less"], ["Reviewed July 19, 2016", 3.0, "Disappointed and park being upgraded", "I was really looking forward to this iconic San Francisco site but was left really disappointed! The painted ladies are lovely but there are alot of other houses around the city that are far more impressive. The view of the city behind also can be viewed from other locations. But the biggest disappointment was that Alamo Square Park was completely fenced off as it's being upgraded so you couldn't get the full effect. So if you are planning on visiting this summer be warned, you can't access the park.\nShow less"], ["Reviewed July 16, 2016", 3.0, "5 Victorian Houses.", "It's ok, but it's 5 Victorian houses across the street from a torn up lot. We rode the big bus out, walked a few blocks, stayed for about 5 minutes and walked back to the pick up place. The wait for the bus was long , not sure it was worth it. If your pressed for time, skip this.\nShow less"], ["Reviewed July 16, 2016", 5.0, "Alamo Square under Reno action but painted ladies are still great", "Alamo Square under Reno action but painted ladies are still great. Tip: I jogged here the other morning and there was only a few peeps and dogs, so the earlier the better! The view is still great!"], ["Reviewed July 15, 2016", 3.0, "Not the Full House House", "this is not the Full House House, the Painted Ladies are in the credits but this isn't where they lived.\n\nMy niece really wanted to go there so we went. The park across the street is in pretty bad shape, all the grass is brown and it looks rough. The Painted Ladies themselves are in good shape, there are tons of buses and people walking and driving past the houses so be prepared for that.\n\nthere is no real parking so you may have to park and walk\nShow less"], ["Reviewed July 13, 2016", 3.0, "Beware of Park closure for construction.", "There is some construction happening in the park while we were there in May 2016. Its still ok for a photo or 2 of the \"Painted the ladies\" houses from the street. It's worth the visit!"], ["Reviewed July 12, 2016", 2.0, "Under renovation but can still see the Painted Ladies", "I don't know why I had an image a sprawling park like setting in front of the Painted Ladies (maybe from the opening intro to Full House?) but that is not what is here. Currently the park is under renovation so it is closed. However across the street from the Painted Ladies is a hillock with some trees on top. The ladies are looking a little drab and frankly, I saw some much more impressive houses just up the street.\nShow less"], ["Reviewed July 4, 2016", 3.0, "Under construction", "Worth a quick visit to see the famous brightly coloured houses or \"painted ladies\", but the square itself is currently under construction and does not offer much.. Construction is not due to be finished until late 2016."], ["Reviewed July 4, 2016", 5.0, "Full house house", "Park is closed but the hill in front of the houses is available for pictures. Find parking on Steiner street. Nice view of the city."], ["Reviewed July 4, 2016", 5.0, "Cute", "Cute place. Unfortunately the park was under construction when we went (late June). But we were able to get pics of the \"Full House\" house. Super cute."], ["Reviewed July 4, 2016", 3.0, "Good to see but very average", "We enjoyed visiting the painted ladies. Definatley something that has to be seen, and taken some photos of, however the park was closed off and the grass very brown. So it was nothing like on TV. Bit disappointing."], ["Reviewed July 2, 2016", 5.0, "Beautiful! Must see", "A gorgeous area!\nWe took a taxi from out hotel on Sutter St, our driver informed us that the streets surrounding the square are relatively private, with tour buses prohibited from driving past. The painted ladies are stunning, as are all buildings around the area. A stroll through the park also provides stunning views of the San Francisco area.\nShow less"], ["Reviewed June 29, 2016", 5.0, "Full House Victorians", "Cute Victorian row houses as depicted in the 80's TV show Full House. Worth the visit for the photo op."], ["Reviewed June 29, 2016", 5.0, "A must do in SF", "You have to go there for the experience the beautiful and just because it is nice and we have seen it somewhere before. A little spot of déjà vu with a few very nice cafe nearby."], ["Reviewed June 26, 2016", 3.0, "Closed for Construction", "Don't get your hopes up. Yes, you can still see \"The Painted Ladies,\" but you will NOT get the perfectly iconic view of them with the full San Francisco background. Sorry, I don't remember if the signs had a planned re-opening date. For those that don't \"get it\" about \"The Painted Ladies,\" they're from the opening credits of \"Full House.\" Yes, there are plenty of pretty buildings all over the San Francisco area, but these (normally) also have a great background (plus great childhood t.v. memories).\nShow less"], ["Reviewed June 20, 2016", 3.0, "Just some houses", "The painted ladies is just fine, a picture and that's all. The Park is closed for reparations and looks abandoned. If You are nearby, go and take a picture."], ["Reviewed June 19, 2016", 5.0, "a must", "We had the opportinity to see the Painted Laidies houses in front of the park, but the park is closed for maintenance. So we missed the best spots to take photos of the Laides."], ["Reviewed June 17, 2016", 4.0, "Postpone your visit", "I’ve enjoyed visiting the park, lounging on the grass and seeing the Painted Ladies up close and personal on several occasions, including rest stops during two Bay to Breakers jaunts. However, at this time there is little point in visiting the place if you can wait until the park fully reopens and construction projects in the area are finished. When we arrived in the Alamo Square neighborhood during our recent tour of the city our guide showed a conspicuous lack of enthusiasm for stopping.\nShow less"], ["Reviewed June 15, 2016", 3.0, "Iconic but yeh", "Okay so im kinda confused as to why this place is like so part of what we view as <<San Francisco>> i mean, the houses were beautiful and all that but the city is chalk full of gorgeous architecture I dont quite see what makes these all that special... maybe im missing part of the story though?? who knows.\nShow less"], ["Reviewed June 7, 2016", 3.0, "Park closed", "The park is closed for several months, as if June 2016. For that reason you can't get that iconic view. You can obviously still see the houses, but there are more beautiful ones to see. I wouldn't make a special trip to see them."], ["Reviewed June 7, 2016", 4.0, "Pretty", "We liked getting some pictures of the pretty \"painted ladies\" but the construction and closed park was a little disappointment. We were shocked to see people going onto steps and porches of private homes for pictures. \"How rude!\" (*Stephanie Tanner voice*) The walk to the actual Full House house was long but a needed picture for a teenage fan.\nShow less"], ["Reviewed June 6, 2016", 3.0, "A little disappointing", "When we visited the park was closed off and we had been advised not to visit when we were on the bus tour and they were right. There are a few houses that remain true to the painted ladies theme but there are also plenty of apartment buildings too which I thought took from the area. If your driving or cycling it's an easy stop but if your on a tour there really I isn't much to do for a full hour until the next bus comes. The houses that are there are spectacular and some have been so lovingly restored. I enjoy architecture so I personally loved it and we were driving.\nShow less"], ["Reviewed June 6, 2016", 4.0, "Nice scenic houses", "The painted ladies are beautiful scenic houses. The park on Alamo Square is nice but nothing special. There are also several other nice houses in the neighbourhood."], ["Reviewed June 5, 2016", 5.0, "Hear the Full House theme yet?", "If you're in SF, have a picnic and sit in Alamo Square across from the famous Painted Ladies. Those Victorian houses have become famous from all sorts of TV shows and Movies but especially Full House. Even if you aren't a fan of the show, these houses are postcard ready with a click of the camera. People watch in Alamo Square too. Watch Hipsters, hippie and people hanging out with their dogs and people hula-hooping it up. It's quite relaxing and fun.\nShow less"], ["Reviewed June 1, 2016", 3.0, "Just for the Pics", "I expected more of this area. The park was deteriorated. The only highlight was the houses' pictures."], ["Reviewed June 1, 2016", 5.0, "Warning. Construction and fenced off area for pictures.", "Tourists are very disappointed as the park in front of these homes is fenced off and construction will be going on for some time. That's SF. Always construction and it seems to be forever for them to complete a project - and hoping that when it is completed it doesn't have to be redone because they forgot what they were doing in the first place.\nShow less"], ["Reviewed May 26, 2016", 4.0, "Great for pics", "Want to see the Painted Ladies....this is the place.\n\nIf you are in San Francisco, this is a must stop tourist location for pictures, but parking is very tough to find. Spend some time trying to get the perfect photo as there will be a ton of other people doing the same thing.\n\nIf you want a special secret, bring your tennis racquets and some balls as there is a hidden tennis court in the middle of the park surrounded by very tall trees and I have NEVER seen anyone playing on that court.\nShow less"], ["Reviewed May 24, 2016", 4.0, "Architecture thrill", "Loved walking around the park, there are several houses around that are worth the picture and the scene. But... It felt kind of unsafe, the streets were lonely, I saw few homeless guys and it just gave me the feeling of unsafety. I wouldn't miss it anyway, victorian houses are worth the stroll.\nShow less"], ["Reviewed May 22, 2016", 3.0, "See the Painted Ladies..... Full House revisted!", "Alamo Square is the small park across the street from the Painted Ladies. Because this is fairly out of the way, we took a cab over and the driver suggested he stay to wait for us. Thank goodness he did! We snapped a few photos and were done. It was desolate on a Sunday morning so we would have been stuck without him waiting. If you're nostalgic for your childhood like me, the chance to snap some photos is worth a visit. You'll need 15 minutes tops and you'll be back on your way. Enjoy the views on your way to and from the area. You'll pass some amazing homes as you travel through the Pacific Heights.\nShow less"], ["Reviewed May 18, 2016", 3.0, "Under construction", "The park where you can snap a full house picnic scene is fenced off till fall 2016.. so you can tske a pic of pa ok nted lsdies but no pic in park"], ["Reviewed May 17, 2016", 3.0, "A quick photo op", "A little out of the way but definitely an iconic spot. A small park in front of the painted ladies. A place to take a nice picture of the Victorians with the San Francisco skyline as the backdrop. Bring a blanket and eat lunch or read a book or just relax. Perhaps a nice place to watch the sunset.\nShow less"], ["Reviewed May 15, 2016", 3.0, "I was underwhelmed", "Homes you have seen in various movies or clips. We came, we saw, we snapped a couple pics, and left. THE END"], ["Reviewed May 12, 2016", 4.0, "Fun to do list", "Its a nice park area. lots of folks bring pets. It was lovely to view at sunset. its a popular tourist spot."], ["Reviewed May 6, 2016", 1.0, "Extremely disappointing", "Yes, the house from full house is nearby and so are the Painted Ladies, but the Alamo itself is just a square with lots of dead grass from all the dog pee. Ended up walking here from the Castro and just wanted to cry because it was exhausting and horrible.\n\nEither I'm missing something or this is the most disappointing tourist attractions ever.\n\nShow less"], ["Reviewed May 5, 2016", 2.0, "😒", "Overrated. I was so disappointed every other house in san fran looks like this. Nothing special. Many people go and take pictures the park in front is nicer than the houses"], ["Reviewed May 3, 2016", 4.0, "Perfect spot for a picnic, a walk, and the obligatory photograph(s).", "Go when the sky is clear, so that you can picnic or walk with the locals, and photograph the Painted Ladies in all their glory."], ["Reviewed May 1, 2016", 3.0, "Iconic view", "This is not really a place where one spends any time and is usually a drive by on a tour bus. We generally go past to see if the houses have changed colors."], ["Reviewed May 1, 2016", 5.0, "Fun even in the rain!", "What can I say? Our kids grew up watching Full House and now our granddaughter is a huge fan of the reruns, so this stop was a must. Even in the rain, there were sightseers and people taking pictures. Would be fun to picnic there in nice weather.\nShow less"], ["Reviewed May 1, 2016", 4.0, "Sunset", "If you can get here for the late afternoon last light as it hits the houses Live his part of San Francisco and such lovely architecture"], ["Reviewed April 30, 2016", 3.0, "totally overated.", "I saw many houses around SF that were much nicer and far more photogenic than these supposed icons. Just keep your eyes open."], ["Reviewed April 30, 2016", 4.0, "beautiful", "We went here when we were on the movie tours, this was a great way to visit as you do not have the hassle of trying to park. It was lovely to see the painted ladies, we got lots of pictures as there was not a huge amount of people when we went there, its nice to stand in the square and enjoy the views of the city behind the painted ladies.\nShow less"], ["Reviewed April 29, 2016", 3.0, "Painted Ladies are here......", "Small park affording good views of San Francisco. Good representation of Victorian architecture. Easy to access via bus."], ["Reviewed April 29, 2016", 5.0, "Iconic views of the city", "My son lives near here and we took our lunch to the park one beautiful day. It was crowded, but there is nothing like looking out over the \"painted ladies\" with the view of the downtown behind. The park is clean, if well-used. You may want to take a blanket or something to sit on, but it is a great place to stop for a rest on your tour or stay for an hour or more.\nShow less"], ["Reviewed April 26, 2016", 4.0, "Hot Fun in the Summer time", "Fun to get to any way. Nice views of my town. Relaxing park with friendly people.Tour buses but not a problem."]]}}