{"Alcatraz Island": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Alcatraz Island", "url": "/Attraction_Review-g60713-d102523-Reviews-Alcatraz_Island-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/3b/00/ac/alcatraz-island.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "45877"}, "address": {"@type": "PostalAddress", "streetAddress": "Pier 33 B201 Fort Mason", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94122", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Awesome", "This place was awesome. I was on a family trip and took the time to go to the island, it was great experience."], ["Reviewed 2 days ago", 5.0, "Great Tour", "I loved this cruise and tour. Although it was a cold and damp day the fascinating Tour more than made up for it. We wore the headsets and they guided us throughout giving us important facts along the way. Must see trip for anyone visiting."], ["Reviewed 2 days ago", 5.0, "fascinating and full of unexpected treats", "We booked the Sunday morning, first boat over to Alcatraz. I'm glad we did, because when we arrived, all the boats until Tuesday were sold out. On the island, we did the Garden Tour with a guide, Dick Miner, who really loved his job and the gardens. It gave us a great perspective on the natural history of the island, as well as the prisoners who worked in the gardens. We also did the Famous Prisoners tour, and my wife did the Self-guided audio tour, which she said was a little underwhelming. Overall, an amazing experience, and we left after about 4 hours feeling like we got our $37.50 fare worth.\nShow less"], ["Reviewed 2 days ago", 5.0, "You cannot refuse to become a part of history", "First, book your tickets online in advance. Second, enjoy this magnificent place.\n\nAlcatraz Island is easily accessible by a ferry. In no time you find yourself in sight of the famous prison and have to make sure you are not dreaming. A friendly welcome in the port and hooray, let us look around.\n\nI recommend taking one of the morning tours since I believe the place can get quite crowded however having your audio guide enables you walk around in your own pace.\n\nYou could easily spend the whole afternoon exploring the island, watching seals and birds and admiring the views of San Francisco but if you walk quickly, two to three hours should suffice.\n\nYou do not need to be a history fan to visit this place, Alcatraz will enthrall you anyway.\nShow less"], ["Reviewed 2 days ago", 4.0, "Wild feeling to say the lest", "To think who shared the halls and cells with you is a lot. Some of the baddest types called this place home. They even have a solitary confinement cell set up that they will lock you in for a few minutes........Dark and tight space. Warning; It's a little bit of an uphill walk when you get off the boat but inside is an easy walk.\nShow less"], ["Reviewed 2 days ago", 4.0, "Alcatraz Island trip", "Really enjoyed this trip make sure you book online well in advance and book the trip to arrive as early as possible as you can then leave on any boat you want"], ["Reviewed 2 days ago", 4.0, "Nice afternoon!!!", "My friends and I went to this prison and we had a great time just walking around, we were there so we had to do the most that we could, so we took a tour and it was a great idea, definitely a place to visit while in San Francisco.\nShow less"], ["Reviewed 2 days ago", 4.0, "Something special", "I mean since there's not a lot of things to visit in san francisco we didn't doubt about visiting Alcatraz, it was definitely something you should see...specially the views from the boat and island itself!\n\nThe only upside I would say its that is not very steady for seasick people like me.\n\nIt wasn't a very enjoyable :(\nLoved it tho!\nShow less"], ["Reviewed 3 days ago", 5.0, "Eerie but fascinating!", "Alcatraz is a must see in San Francisco. The self guided audio tour that is included provides a great insight to life inside the prison both from the inmates and the guards and their families."], ["Reviewed 3 days ago", 5.0, "Well worth it", "Interesting and fun way to spend a morning! Really worth doing and beautiful views on the way over as well as amazing views of San Francisco from the rock"], ["Reviewed 3 days ago", 5.0, "Well Worth it!", "Alcatraz is a must for anyone visiting San Francisco! First off, buy your tickets early they go quickly. We went during the middle of the day and though there were a lot of people, it did not feel crowded and claustrophobic. The walking tour is perfectly timed and never felt like we were stuck in traffic. It is child friendly as we had our 11 month old in a stroller the whole time. You will have to hike up some inclines so be prepared for that but otherwise there is an elevator in the prison to get you to the actual tour. Extremely friendly and helpful staff. I am glad we did this!!\nShow less"], ["Reviewed 3 days ago", 5.0, "Facinating", "The boat trip only takes 15 minutes out to Alcatraz Island. The tour around the prison is fascinating, from seeing the tiny cells they lived in to hearing about the various escape attempts. Put this on your list!"], ["Reviewed 3 days ago", 5.0, "Highly recommend a visit to Alcatraz", "Everything is really well organized. We were really impressed with everyone we encountered. They really have everything down to a science, loading and unloading the boat was very quick. After you get the short but informative talk from the Ranger on the island, I recommend seeing the short movie, it was very informative. The tour itself was also easy to follow. There is lots of walking, be prepared. We took our own lunch, so after we took the jailhouse tour we went back down to the dock and had our picnic. I would have liked to of done the inland tour as well, but we were out of time. You will need to make reservations several weeks in advance.\nShow less"], ["Reviewed 3 days ago", 5.0, "For me, a dream come true", "You can get to Alcatraz for less than $40 a ticket and spend the entire day there. And there's a lot to see! We went on a Sunday so we could take the Gardens of Alcatraz 9:35 tour. It was a blast--you get to see gardens that are only open to the public when escorted by a guide.\nI found the whole experience very moving. And the views of the city and the bay are amazing. Can you imagine how the inmates felt seeing those views and knowing they could only see it from afar?\nShow less"], ["Reviewed 3 days ago", 5.0, "Great Tour", "A must tour when in San Fran, we booked the behind the scenes tour so you get to see areas the normal tour doesn't have access to. Plus this tour goes in the afternoon which seem to be a less busy time at Pier and island, plus sunset behind the bridge!! All staff are friendly and so knowledgeable about all aspects of Alcatraz, once you have your holiday arranged book well in advance and you wont be disappointed.\nShow less"], ["Reviewed 4 days ago", 5.0, "Not to be missed", "Make sure you book ahead. So many people turn up on the day and are dissapointed. And be prepared as its a long trip and not much refreshment . But you can't miss it. Its just soooo interesting and a real snap shot of American culture, warts and all. great guides and well organised.\nShow less"], ["Reviewed 4 days ago", 5.0, "Fab", "Brilliant this trip is amazing the audio tour us great highly recommend this to anyone it puts in a good few hours and ferry going over is great fun"], ["Reviewed 4 days ago", 5.0, "Impressive", "I visited Alcatraz in February, I booked in advance online, 10 minutes queue to get on the boat, amazing weather and spectacular view, once on the island, park rangers organizes very well our time to spend there, we visited every single thing in the island, super interesting, the reality in the prison is very sad, but again interesting, you can even get into some cells, view of San Francisco better than anywhere else! Recommended experience!\nShow less"], ["Reviewed 4 days ago", 5.0, "A must see when in San Francisco", "An excellent attraction to see when visiting San Francisco. You will need to book when you book your holiday as you are unlikely to be able to book on arrival as this excursion by boat is booked up way in advance ."], ["Reviewed 4 days ago", 5.0, "Amazing. Superb Guides - But watch the time for your boat !", "Got to be done. This is an amazing place and a must see on my bucket list. So pleased. Its well organised and leaves space for exploring within the tour."], ["Reviewed 4 days ago", 5.0, "Impressif!", "Watch out for pick up times for your tickets! We had reservations for the boat in the afternoon and wanted to pick up the tickets in the early morning in order to spend the rest of the half day otherwise, but that was not possible :/\nBut the expereience was wonderful!\nShow less"], ["Reviewed 5 days ago", 5.0, "Fascinating and Dark", "Fascinating historical icon! Be warned that the tour is expensive and requires weeks, if not months of pre-planning and booking. We went on a Friday morning on a blustery February day. I would not recommend this tour for the kiddies under 10 with the boat trip the biggest, and only highlight for the little ones. The guided audio tour is immersive, but contains particularly dismal and dark stories of the horrors of the prison and the penal system. Alcatraz isn’t an attraction that I would suggest for families, but could be cool for teen students and adventurous backpackers.\nShow less"], ["Reviewed 5 days ago", 5.0, "Audio tour was well done", "Very interesting facility with a very intriguing history. Really really enjoyed the audio tour which used former prisoners and guards to narrate the tales of Alcatraz."], ["Reviewed 5 days ago", 5.0, "A must", "Do not expect to visit if you did not book ahead of time. Well organized, interesting. $37.50/person including audio video. 10:00am Sound show was interesting."], ["Reviewed 5 days ago", 5.0, "Adventures await", "Beyond beyond our wildest dreams...the entire your start to finish was amazing...everyone was helpful and happy to answer all questions...the views are amazing"], ["Reviewed 5 days ago", 5.0, "Bucketlist", "Be sure to get there 30 minutes before departure to get in line to get a seat on the top deck- the view of Alcatraz is really cool when you are coming across the water. Be prepared for lots of walking! Outside of the administration building is fabulous views of the city! You can get amazing pictures! We spent 3 hours on the island. So worth it! A former inmate was in the bookstore signing books which was an amazing bonus to our day!\nShow less"], ["Reviewed 5 days ago", 5.0, "Wonderful day out", "I booked online ahead of our tour date with Alcatraz Cruises, this saved waiting in line and avoided the crowd at the ticket booth. You do need to present your online ticket at a kiosk & get a paper ticket to scan.\nWe arrived about an hour early and sat in the cafe until our cruise boat arrived. The cafe has basic food and great coffee. The day was sunny but very cold so make sure you rug up well with a warm jacket and wear some comfortable walking shoes as there are many steps and a lot of hills to climb. The boat ride over has a small food shop onboard (no booze available until the ride back) You can take food with you but it can only be consumed around the dock area on the island. Park rangers do a great job explaining what you can do on the island and the walking tour with the rangers are great. From there go up and do the audio tour where you walk around yourself and listen to a narrative from former guards and inmates. All in all be prepared to spend at least 3 hours minimum. Well worth it !\nShow less"], ["Reviewed 5 days ago", 5.0, "Fantastic Audio Tour", "This is so well run. From the tickets to the ferry to getting around the island everything was so smooth.\n\nLots of warnings about the hills but I didn't think they were as bad as I was expecting.\n\nThe audio tour is the star though and the best I've ever done. Genuinely interesting but without waffle to hear from those voices who had lived and worked there was incredible.\n\nAlso as a bonus incredible pictures of the City from the island.\n\nDefinitely a must see.\nShow less"], ["Reviewed 5 days ago", 5.0, "Wonderful tour", "If you want to go on the night tour which gives you more information, make sure to book your tickets well in advance. We booked 3 months before going and had a wonderful tour on Alcatraz. Very well run tour."], ["Reviewed 5 days ago", 5.0, "Dont' Miss the Behind the Scenes/Night Tour!", "Our tour guides, a 30+ year NPS Park Ranger and an engaging Alcatraz Conservancy guide, did an amazing job telling us the stories not only of prisoners but in detail of the history of the island, buildings, families that lived there and some of the political issues surrounding the use of the island over the past century.\n\nOn this new tour, we were given access to a few hours that are \"off limits\" during the standard tour and also we were the only group left on the island after public hours. This left us with such a unique experience seeing the prison in low light, hearing the circling birds and feeling the cold set in after dark.\n\nDress for cool air and some wind, lots of walking along paths and through the buildings. Also, included was time for the audio tour and some talks by guides that were well researched and also not available without the Behind the Scenes tour access.\n\nOverall, I would recommend this experience for anyone looking for a unique visit, lots of new information and some intimate time with tour guides and the space itself.\n\nGreat work by the NPS and the Conservancy to bring this amazing historic site to life!\nShow less"], ["Reviewed 6 days ago", 5.0, "Family holiday", "What an amazing place the history it’s was spectacular\nThe tour guide audio was brilliant very interesting to hear what was claimed to be actually stories of inmates\nThe feeling of what actually happened there was felt and seeing inside the cells was very interesting the conditions you could only but imagine\nShow less"], ["Reviewed 6 days ago", 5.0, "Fun day", "Fun tour on a beautiful day. All the tour guides were knowledgeable and helpful. Make sure to do the audio tour"], ["Reviewed 6 days ago", 5.0, "Superb!", "Tickets must be easier to come by in Winter as we turned up the day before we wanted to go and got them no problem. Excellent ferry ride over - drinks, food and toilets at the terminal and on board the ferry. Guides on the island run a short tour every hour with some great info. Fifteen minute film in the theatre provides an excellent summary of the history of the island and worth the short stop to watch. Cell block audio tour is superb - good timing, interactive and lots of real life experiences as told by the prisoners. Loads of purchases to be made in the gift shop - something for everyone - including ex cons and prison staff meeting and greeting people. At $45, best value for money activity in San Fran.\nShow less"], ["Reviewed 6 days ago", 5.0, "Best thing we did in San Francisco", "At last moment we booked a trip to Alcatraz. Advice no 1. Book in good time.\n\nWe booked for the night tour on a Friday Feb 23. It was awesome. It was such a super experience.\n\nFirst you go around by your self on an audio tour. You can have it in the most common languages.\n\nAnd after the audio you could choose between some different tours. We had the ‘escape’ tour.\nDidnt get the name of the guide. But he was fantastic. Had great humour and was an awesome story teller.\n\nTomorrow we return to Denmark. Alcatraz was the best end of our visit to San Francisco. Thank you.\nShow less"], ["Reviewed 6 days ago", 5.0, "Enjoyed this a lot more than I thought I would", "I did the Alcatraz Island tour as it is one of the tourist attractions in San Francisco. I did not expect to enjoy this tour as much as I did. The audio tour was fascinating and quite well done. My only regret was that I didn't allow enough time to enjoy the tour\nShow less"], ["Reviewed 6 days ago", 5.0, "Alcatraz experience", "What a wonderful outing. Try to meet up with one of the park rangers who offer tours of the island. They give a personal reflection of what went on in the history of Alcatraz. The audio tour of the cells is awesome - in several languages, and gives a unique experience to the penitentiary life! What is nice is that you can take as long as you want on the island - no set time to leave based on the time you arrive. Catch an early ferry to the island and then you have plenty of time to explore.\nShow less"], ["Reviewed 6 days ago", 3.0, "Alcatraz", "Great day out, and very interesting tour! Although island was infested with flies, which I HATE also the ferry across couldn’t wait for it to be over. Apparently I was there in the wrong season"], ["Reviewed 6 days ago", 5.0, "$37.25 well spent!", "We did the day tour, and loved it!\nInitially I thought that it was a pretty expensive price for per person, but if it includes the 15 minute boat ride to and from Pier 33, along with the 45 minute audio set/presentation which is by the way provided in 11 different languages (Dutch, English, French, German, Italian, Japanese, Korean, Mandarin, Portuguese, Russian, and Spanish) that you can choose & listen to and walk around at your own pace, I think it was worth it. We ended up staying on the island for 2 hours, good thing that you can hop on any boatride back with space allowing.\n\nTIPS: 1) Wiser to book ahead online, especially for the weekends.\n2) Be sure to PRINT OUT YOUR TICKETS in advance, if you booked online.(Saw a couple lined in front of us that thought showing the confirmation email on their smartphones were good enough but were unfortunately sent back to the will-call window)\n3) Don't come on an empty stomach- no restaurants, food sold on the island, but CAN be purchased on the boat.\n4) Better to line up early for your boatride back on a busy day.\n5) Don't forget to bring a warm jacket! Can get cold both on the boat, especially if you are outside, and also on the island!\nShow less"], ["Reviewed 6 days ago", 5.0, "Favorite day of our trip", "our kids 7,10 and 12 LOVED this place! We did the self guided tour and although some details were a little graphic for our 7 year old, all kids agreedAlcatraz was the most interesting and memorable day of the week long vacation."], ["Reviewed 6 days ago", 5.0, "A piece of interesting history", "You may have to order tickets ahead online if you are here at busy season. It was so interesting. The audio tour was full of information and sound effects. I am so glad we went. I learned so much about life at the prison and the life of families of the workers who grew up on the island.\nShow less"], ["Reviewed 6 days ago", 5.0, "Amazing", "Had an amazing time on the Alcatraz trip. Would definitely recommend booking tickets in advance as it was super busy so glad we did. Amazing everyone was helpful and knew so much great once in a lifetime experience"], ["Reviewed 6 days ago", 5.0, "Excellent Insight into History", "This tour can be self guided or you can follow some of the programs they have scheduled for the day. The ferry runs every 30 minutes. There are adequate bathrooms. They have trams for those with accessibility issues. Excellent 360 views. Very good audio tour (time consuming but well worth it.) Plan about 3 hours to fully experience this. Very well done.\nShow less"], ["Reviewed 6 days ago", 5.0, "Definitely donthis", "The trip over to Alcatraz is a must do. Boat over is about 20 mins. The island tour offers three options: self audio tour which is what we choose. A guided tour w a park ranger and a self guided tour where you just walk around by yourself.\n\nThe audio tour was perfect. It guides you from entrance of penitentiary to the closing of its doors in 1963. Extremely detailed and very accessible for kids to adults.\n\nThe island has beautiful plants, even in Feb when we were there. This is a good time to visit because it isn’t as crowded.\nShow less"], ["Reviewed 6 days ago", 5.0, "Well arranged and delivered", "Pre book in advanc. The trip management was good. The trip time approx 3h - 6 h depending on how long you wish to stay. Guided audio your is excellent, gift shop was good. View of the island and Goldern Gate Bridge from ferry was cool\nShow less"], ["Reviewed 1 week ago", 5.0, "Excellent attraction", "Visited here recently and loved every minute.. The self guided tour of the prison itself was very well done and so informative ..nice to be able to walk round the island after too..a must visit if in San Francisco"], ["Reviewed 1 week ago", 5.0, "Vacation", "What a great time. This is my third time here and for it being February the weather was perfect. Skies were clear it was a little windy and cool but perfect. I just love the audio tour. And a previous inmate was there signing a book he wrote so she talked to him.\nShow less"], ["Reviewed 1 week ago", 4.0, "MUST SEE VERY INTERESTING!", "It can get cold over there depending on season , but definitely worth it to go on this tourist attraction at least once."], ["Reviewed 1 week ago", 5.0, "Must do in San Francisco", "Wasn't overly fussed about visiting, but its historical and people said we should so I booked the first boat over and took the trip to Alcatraz. WOW. This place is amazing. Could not believe how interesting it was. So glad we made the effort. Both adults and our children all loved it. The audio tour through the jail was particularly interesting. Piece of advice though, make sure you book in advance as can get really busy and often you can't just walk up to take the boat over.\nShow less"], ["Reviewed 1 week ago", 5.0, "Views from the Rock", "Alcatraz Island is a unique place in the San Francisco Bay. It has a deeper history than just being a prison for escape-prone prisoners. Fascinating. The views from Alcatraz are beautiful, especially if you are there for a sunset. Walking through the prison is thought provoking as you imagine prisoners looking out through the barred windows. So close, yet so far away. Well worth a visit.\nShow less"], ["Reviewed 1 week ago", 5.0, "What an amazing experience", "Wow! From the moment we hopped on the ferry to finishing the self guided tour it was amazing. My 8 year old loved the headphone commentary and information shared. Every space was easily accessible and the views from around the grounds were stunning. I will do it again on my next visit.\nShow less"], ["Reviewed 1 week ago", 5.0, "Not to be missed", "A historic look into the past. Plan on spending the day, there is a lot to see and often a special art or social ehibit."], ["Reviewed 1 week ago", 5.0, "Highlight of the trip", "This was the absolute best part of the trip to San Fransico. My wife hates anything that seems like a museum or anything history related. She loved it too! The audio tour that was narrated by former guards and inmates really made the whole experience."], ["Reviewed 1 week ago", 5.0, "Amazing", "This was probably the best part of our trip to San fransisco. We done the night tour which was amazing and the views from the island as the sun was setting were amazing. I would definitely recommend booking in advance as it was sold out whilst we were there.\nShow less"], ["Reviewed 1 week ago", 4.0, "So much more than a prison!!", "One of the must see attractions. We have all heard about Al Capone and Ned Kelly being held here, but there is so much more to the place. We booked online in advance, which is a good thing as even on a cold February day it was sold out a couple of days in advance. The boat ride was quick and efficient. There is a mandatory briefing before you can explore which basically tells you where not to go and not to eat and drink. The workshops were full of interesting information, a shame none of the old equipment could still be there though. The audio tour of the cell block was very informative and given by ex prison officers and inmates. Unfortunately, there were areas not open to the public, which is a shame, but conservation takes preference in these places, understandably. Alcatraz island was also a fort and military prison before becoming famous. it was also home to many Indians during a takeover, all stuff I never knew before.\nShow less"], ["Reviewed 1 week ago", 5.0, "What a day! Educational and exhilarating!", "Definitely a bucket list trip for us. We’ve talked and talked about bringing the kids to San Francisco and specifically Alcatraz for years and are sooooo glad we did.\nThe self guided tour was so interesting and educational that this was a highlight of our trip. To learn of the history and mystery of this place was so much fun and frankly amazing.\nKnowing you were standing and walking where prisoners once were while learning of life on the ‘Rock’ was everything we thought it would be and more!\nWe were chilled by the details and educated on what this place really was!\nPlease take the time and enjoy for yourself - you will NOT be disappointed.\nShow less"], ["Reviewed 1 week ago", 5.0, "Rediscovered Alcatraz", "Last time I was here was in the 70s. I’ve been wanting to come back as my original experience visiting Alcatraz as a preteen with my parents left such a lasting impression. It was a great experience once again. Do the audio tour and you learn so much. It’s very well done and you can go at your own pace. My teenage daughters really enjoyed it as did their 50 year old escorts.\nShow less"], ["Reviewed 1 week ago", 5.0, "A bucket list must!", "This is a definite must when visiting San Francisco! The audio tour is great, everything is so well organised from start to finish. The views of Golden Gate Bridge & San Francisco are breathtaking."], ["Reviewed 1 week ago", 4.0, "Very interesting and well worth it", "We had a beautiful sunny day when we visited the The Rock but the sun disappears quickly so wear warm clothes. Very interesting and the head phone system that talks you through the entire prison is just fabulous. The gift shop is quite good and not too pricey so you can grab yourself a souvenir aswell on the way out!\nShow less"], ["Reviewed 1 week ago", 5.0, "It is a must", "If you’ve watch TV movies such as the rock or escape (Clint Eastwood ), this is a perfect experience. Very well planned for tourists."], ["Reviewed 1 week ago", 5.0, "Brilliant!", "Awesome place to visit. Audio tour is excellent; entertaining and informative. Book tours well in advance, we booked at least three weeks prior to arriving in San Francisco."], ["Reviewed 1 week ago", 5.0, "Fantastic tour, a must see in SF!", "Very well executed audio tour. Alcatraz is a really fascinating place. The history of the workers families who lived on the island was really interesting!"], ["Reviewed 1 week ago", 5.0, "Fun and Interesting!", "It seemed like it was going to be kind of boring but it was actually very interesting! Maybe not for too young of kids. (12+) Should book in advance always! And be at LEAST 15 minutes early. To start the tour you have to hike to the top if the hill. (Equivalent to 13 floors). We had a really great time though. Not only was the audio tour really cool and interesting, but the views were wonderful and the island itself was pretty green and a sight to see. I thought it was worth the money!\nShow less"], ["Reviewed 1 week ago", 5.0, "Highlight of our visit", "If you are a history buff... this is the place for you to visit! You will need to buy your tickets months in advance. Be sure to pack a jacket for the boat ride over and wear comfortable walking shoes. I have to say that the Alcatraz boarding is very organized and quick. I wish there had been more park rangers to ask questions. The audio tour, however was excellent!\nShow less"], ["Reviewed 1 week ago", 5.0, "Interesting piece of history", "Flew from Memphis w my 2 children (8 & 11) to visit family. Took ferry over to the island & did audiotour. We really enjoyed the tour. My son (11) was particularly amazed at all the escapades of the prisoners. As soon as we got home, he couldn’t wait to watch some movies about Alcatraz. A must see if ur in the SF area.\nShow less"], ["Reviewed 1 week ago", 5.0, "WOW! Can't believe we've done it!!", "We travelled thousands of miles to come and see Alcatraz, and had booked the day AND night tour, as it appealed to us to see Alcatraz in the daylight as well as the being eerie etc. in the evening! We took the tour with a guide, and had our usual headphones, once it got slightly 'dusky'...we got to a point in the tour when we went 'underground' to the tunnels. This area was where the 'baddest' prisoners got sent. It was so interesting to learn from a Park Ranger - Christina, she was the most helpful, professional and knowledgeable person. Hat off to her to dealing with our 'norty friend'...who kept wandering. Even though i've done this tour, if I came back to San Fran, I would do this again in the Summer. It was just amazing, do it.\nShow less"], ["Reviewed 1 week ago", 5.0, "as interesting as expected", "make sure you are in the queue well before departure-time- we missed our boat by a few seconds but got on next boat. it was very cold so make sure you take a hooded jacket. the tour starts with a introduction then you walk through places and get your headsets. being inside ws incredible. afterwards make time to walk around outside and look at gardens and the areas.\nthe origin barracks is out of bounds sadly. no food on island.\nwe took about 3 hours to do everything.\nShow less"], ["Reviewed 1 week ago", 4.0, "Audio Tour makes the trip", "The Audio Tour makes it a worthwhile adventure. It was slightly disappointing till I got to the Audio Tour and got into the history - very well done and definitely worth the trip. Slightly irritating that you cant get a beer till you head back but I understand the reasoning. Weather was perfect for October but you better book ahead.\nShow less"], ["Reviewed 1 week ago", 5.0, "Brilliant", "The whole experience was well worth the price. We took the day time trip as it was a lovely day. We booked the day before but would book a week or so in advance if you're fussy on time slots. The ferry was great and the organisation excellent. We took the audio tour and strongly recommend this part . It was full of information and an emotional experience I will never forget.\nShow less"], ["Reviewed 1 week ago", 4.0, "Excellent island", "Audio tour was great. It was nice to know the history of Alcatraz and actually see it in person!!!!!"], ["Reviewed 1 week ago", 5.0, "Step back in time!", "This is a captivating step back in history. Starting with a beautiful sunny day, the smooth ferry ride across from San Francisco and Trooper Wendy we were stepping into rich history of dangerous criminals.\nThe landscaping was chock full of beautiful flowers including geraniums, calalilies, and fragrances eucalyptus trees.\nThe trooper shared the stories of the guards lifestyle, logistics to manage this community and escorted us to the Slammer. After an interesting demo, the audio tour was chilling!\nShow less"], ["Reviewed 1 week ago", 5.0, "THE prison with a lot of history", "Visiting Alcatraz Island is really great if you are interested in history and want to know more about popular myths. Be sure to book your tour early enough, especially in the main season it is difficult to get tickets for your preferred tour of you haven’t book some time in advance.\nYou get to the island easily and only by the ferries of Alcatraz cruises. On the island you are free to go to different places and explore the prison, the gardens etc. on your own. Don’t be shy to take the audio guide: this one is made very well and made me feel like being part of an interactive audiobook. There are also guided tours and tours with „historic“ persons and meetings\nFor a first impression you can watch a short film about the development of the island before the notorious jail has been built and after it has been closed.\nAdditionally, you can visit the sessions with guides regarding special topics, e.g. myths about the island.\nSo these are some hours well spent and enjoyed!\n\n\n\nShow less"], ["Reviewed 1 week ago", 5.0, "Must Visit this Notorious Prison", "Without a doubt, a visit to San Francisco cannot be complete without visiting the infamous and notorious Alcatraz Penitentiary. From the moment the ferry pulls up, you can still see the the prison signs, the battle-scarred grounds, and an island that has been frozen in time, and been fairly well-preserved for all the experience. The chilling prison cells that once housed Machine Gun Kelly and Al Capone, will certainly give you an experience you will not forget. This is a \"Must\" for anyone visiting or passing by San Francisco. Also, I would recommend bringing a jacket: the ferry ride and the island can get chilly. It will also give you some of the best views of San Francisco and the Golden Gate Bridge.\nShow less"], ["Reviewed 1 week ago", 5.0, "Interesting part of US history", "We did the audio tour that was offered for the inside of the prison. Very good and informative. Somewhat haunting place to walk around. One of the must-sees."], ["Reviewed 1 week ago", 5.0, "Book direct with Alcatraz Cruises", "Don't be fooled, make sure you look at Alcatraz cruises website and book direct with the official tour. Be warned that they sell out, you can book three months ahead and I booked as soon as I was able... do not leave it until the last minute. I went for the \"behind the scenes\" tour which was awesome... Basically about 4.5-5 hours over there. It included a two-hour tour with a park ranger and went into areas which are not available on the normal tour. It was well worth the extra but I wouldn't take children on the longer tour unless they are used to plenty of walking and lots of information to digest. It was about $90 but that is really helping the restoration and conservation of the site. It would not really be suitable for those with mobility issues. Amazing place to visit, I was surprised how run down it was but it was absolutely fascinating. Great cruise across the bay as well.\nShow less"], ["Reviewed 1 week ago", 5.0, "Interesting tour but pack warm clothes", "The tour was interesting but the island is always 40-50 degrees so pack warm clothes. The grounds are gorgeous and we learned so much- worth the money and time. We did the night tour which was nice to have less people on the island than other tours- book ahead if possible\nShow less"], ["Reviewed 1 week ago", 4.0, "Interesting", "Alcatraz is an interesting trip at a decent price. The night tour is good.\n\nI seem to have costed a number of ex prisons on my travels (Fremantle jail in Oz, Robin Island in Cape Town). Alcatraz doesn’t quite reach the heights of Robin Island but is a decent enough trip\nShow less"], ["Reviewed 1 week ago", 5.0, "Don’t miss this one!", "It was one of the best experience on my United States trip. The audio tour through the prison is totally awesome! It’s an immersive tour that makes us all shiver. The best part: There are many different languages, so everybody gets to understand the audio and know the prison.\nShow less"], ["Reviewed 1 week ago", 5.0, "Loved it.", "Obviously very touristy but thought the whole experience and audio tour was excellent. A must do when visiting sf, imo."], ["Reviewed 1 week ago", 5.0, "Bucket List Must", "Learned so much in a short amount of time. You can go around on your own, but the audio/self guided tour gives you a ton of info. You can always pause it and take your time. The only thing I wish I could have done differently would have been to have gone as early as possible! I on the 10AM tour and it was already pretty packed. Overall a great experience!\nShow less"], ["Reviewed 1 week ago", 5.0, "Very interesting tour and grounds", "We went on a Thursday in February. Didn't make our reservations until early that morning but were able to get on a tour. The audio tour inside the prison was very interesting and historical. Lots of local history about the grounds when it was a fort and when it was a prison. A must do tour when in San Francisco.\nShow less"], ["Reviewed 1 week ago", 5.0, "Must See", "This is a must see, well worth your time. Book early, they sell out fast...I was able to book a package deal with another company to get my tickets, when I waited too late. You really need to listen to the audio while you’re on the tour...It added so much to the experience. The audio is from former inmates, guards, and even some of the children that lived there...with the added background sounds, I felt like I was part of it all. You are dropped off and everything is at your own pace, you decide how long you want to stay.\nShow less"], ["Reviewed 1 week ago", 4.0, "excellent tour!!!", "Take the cheapest tour you can find. I bought the night one for USD 40 per person. Although it was mentioned in my ticket that there was no tour or anything else provided for the kind of ticket I bought, there was actually a small tour from the staff there and you get audio tour inside prison. So don't spend hundreds of dollars buying the most expensive Alcatraz tour because everyone gets audio tour. The audio tour was narrated by the actors who played in the movies about Alcatraz and by inmates who spend time there. Their descriptions are amazing and you learn details about this so known place that you don't know. I found it very interesting but a bit tiring at the end because it lasts around 3,5 hours. We waited for the last ferry to go back and the weather was windy enough. It worth the visit though. Staff in the Alcatraz is very rude and not helpful at all. So if you are lost during the audio tour just ask another visitor to help you.\nShow less"], ["Reviewed 1 week ago", 4.0, "Excellent Experience", "Visiting Alcatraz island is definitely one to add to the to do list if you and are in San Francisco.\nA short ferry ride from Pier 33 all included in the price of the tickets which are reasonably priced and you can get them directly via the website.\n\nThe audio tours was good and you get an insight into life in Alcatraz and the history that comes with it. There was also an additional/optional tour about the escapes attempts and the much talked about escape. The tour guide (Justin) was engaging, funny and knowledgeable with some extras about the history of the island and surrounding SF Bay thrown in.\n\nI will definitely recommend visiting. Next time, I might try the night time tour - imagine that would be quite chilling in parts.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fantastic Historical Site", "Besides all of the interesting history about Alcatraz itself, there are some stunning views of the City Skyline and the Golden Gate Bridge as well."], ["Reviewed 1 week ago", 4.0, "Feeling inmates’s nightmares", "It was a great experience through all Alcatraz, the rock. The audio guide is very impressive and you have it in many languages. It is even best if you watch an Alcatraz movie, like the one with Clint Eastwood, you will start looking at cells in a peculiar way imagining what they did to escape.\nShow less"], ["Reviewed 1 week ago", 4.0, "Worth a visit!", "Visit Alcatraz Island when in San Francisco to hear more on the mysteries surrounding the island prison.\nLovely flora and fauna on the island.\nDo sign up for audio guided tour or join the guided tour if keen to hear more.\nBe prepared to spend more than 1/2 a day if keen to explore everything on the island.\nHowever, i would recommend a 1/2 day visit.\nShow less"], ["Reviewed 1 week ago", 5.0, "MUST SEE", "This tour was incredible and a must see if visiting San Fransisco! Getting to the pier was easy, and the boat ride was only 10 minutes and included an INCREDIBLE view of the city"], ["Reviewed 1 week ago", 5.0, "A must if you visit San fransico", "You need to book this in advance, I did it through Expedia before I left Uk and about two months before our visit. Be prepare to queue even though you have tickets, although they do timed departures. Plesant boat trip across to the island , every informative guides when you get offf boat. There is a free audio tour that’s really good, but it does set the scenes well. For any one less able there is a train that will take you up to the top free of charge. Boats back are on a timetable on the dockside when you arrive and you can get any boat back.\nShow less"], ["Reviewed 1 week ago", 5.0, "A must visit", "A day long trip, it offers amazing view of the city by the bay from the waters while going off shore. The island offers snippets into the past of prisoners of the US and can be completed in 2-3 hours"], ["Reviewed 1 week ago", 5.0, "Excellent Tour", "Touring Alcatraz Island was a highlight of our San Francisco visit. The audio tour was excellent, bringing life on the island to life for the visitor. It was extremely interesting and gave perspectives from the inmates, guards & families who lived on the island.\n\nA couple things of note if you decide to visit:\n\n1) Book in advance if you can. We booked about eight weeks in advance to make sure we could go. Not sure if this is required, but did hear that it sells out frequently.\n2) Dress in layers. It was cool on the ferry ride, even in August.\n3) Take your own EarPods/headphones if you want - they have them available, but I appreciated having my own\n4) There are stairs & fairly steep walkways up to the cell-block, but please don’t let that stop you - they do have a little people-mover to take you up & back if you need\n\nOne of the things that stuck in my mind was a warning/recommendation from the warden to those brought to Alcatraz - that they would choose how their time was spent there (i.e. hard time or not). Soak in the history & make the most of your visit!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great tour - Go for the night tour", "This is a really great tour, audio portion stories told by corrections officers and prisoners that were there. The night tour is cool - gives the place a different feel, and seeing the lights of San Francisco(and the bridge) from Alcatraz is pretty amazing."], ["Reviewed 1 week ago", 5.0, "Alcatraz!!!!", "A must see! The best thing I've done for a while. Such an interesting tour and there was a talk from one of the staff members about The Birdman of Alcatraz which was also very interesting."], ["Reviewed 1 week ago", 5.0, "2nd time!!!", "2nd time here, taking family. Not as interesting as first time, but it’s still pretty fun here. 10 minute ride each way from landing."], ["Reviewed 1 week ago", 5.0, "Visit the rock .", "Visited the rock for around 3 hours and would totally recommend it , got a guided tour with head phones and was really informative about it all . You can walk around on your own if you wish ."], ["Reviewed 1 week ago", 5.0, "A must visit", "We booked this online before our cruise as it can get very busy and you might miss out if you try on the day.\nFrom the crossing by ferry to the audio guide everything was brilliant and you have plenty of time to look around the whole complex.\nSF has some amazing places to see.We were there for 4 days as this was our final port before leaving our cruise boat so we stayed on for a long weekend but if you have only a short time then put this high on your list of things to do.\nShow less"], ["Reviewed 1 week ago", 5.0, "Such an interesting day!", "We really enjoyed all aspects of our visit to Alcatraz Island. The ferry trip out was well organised with lovely views along the way. The absolutely stand out was the self guided audio tour of the cell block which was so well done and interesting. We would highly recommend a visit!\nShow less"], ["Reviewed 1 week ago", 5.0, "Excellent insight to a place we have all heard of", "To me, Alcatraz is history from my life time. This tour was all that it was made out to be. The audio tour is the best of many that I have ever used. Plenty of other information and staff around to ask. It brought the place to life. Definitely best to book in advance.\nShow less"], ["Reviewed 1 week ago", 5.0, "Wow", "The guided tour was so amazing and overall the trip was a great day out. The ride over on the boat was a little cold but to be expected. All staff were helpful and even changed our ticket times to a more suitable time for us at no charge. Highly recommend.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing experience", "Weird to say I enjoyed my visit to prison, but it was fascinating to be there. The audio tour is excellent- particularly the English version as you hear voices of prisoners and guards.\n\nLife on the island was bleak, for sure.\n\nI would definitely recommend a visit to Alcatraz. We went with Alcatraz cruises from Pier 33. Everyone very helpful.\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome tour at Alcatraz", "I really enjoyed my trip to Alcatraz. The boat ride alone was fun as heck. Touring the famous prison was interesting to me. Highly reccomend this"], ["Reviewed 1 week ago", 5.0, "Amazing experience", "Insightful trip that had us entranced for a long morning. We took advantage of the video, myth buster ranger talk and audio tour. All were really high quality and added to the experience. The island and its history were brought to life and the gardens were a pleasure to experience. The boat trip across the bay was an added bonus.\nShow less"], ["Reviewed 1 week ago", 5.0, "Need to see", "Well what can I say about Alcatraz. First the ride and view from the boat is outstanding, very picturesque. Once you get to the island you need to do the headset guided tour. This is a great place to visit since it’s embedded in our history.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fascinating!", "Walking & touring on Alcatraz, the home of hardened prisoners in years gone by & the setting of several movies, can best be described in one word: FASCINATING! Go see it, it is FASCINATING!"], ["Reviewed 1 week ago", 5.0, "Amazing!", "Having wanted to visit here for years I have to say I was not disappointed! Incredible place, so interesting, the audio tour was brilliant and all the staff were so enthusiastic and helpful!"], ["Reviewed 1 week ago", 4.0, "Crime doesn't pay!!", "Very interesting to see some real history in the area. I would highly recommend this tour! Thank you for a great day!"], ["Reviewed 1 week ago", 5.0, "Must-see", "Definitely a place to visit in San Francisco! Second time I went there and it still impressed me! We took the last boat to go there (15:30 pm) and the Island was not so overcrowed as I rememberd (last time I went there in the morning). Also the timeframe allow us to watch the sunset there and the city lights, very recommended!!\n\nThe audioguide is free and very informative, with guards and inmates voices telling their experience there. There are some extra activities to do after the audioguide tour. Cell doors demostration was cool, but almost everyone was there and it was difficult to hear the guy speaking.\nShow less"], ["Reviewed 1 week ago", 4.0, "Creepy! In a good way ;)", "Alcatraz was great. The self guided tour was just under an hour and I honestly wish it had lasted longer! We happened to go when it was sunny and 75 so we got to enjoy the outside area and THAT VIEW! The view was incredible. We could see the Golden Gate Bridge and all of San Francisco. WOW it was special. My only complaint is that I wish they would have warned us that once the self guided tour was over we weren't allowed to go back in and explore. I wish I would have known that because I would have paused the tour and really taken my time and explored more.\n\nAlso the boat kind of made me boat sick, but it wasn't very long so it was bearable.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A great trip", "We weren't sure if we would do the Alcatraz trip as it is quite expensive with 4 adult priced tickets (our teenagers cost the same as adults) but we are glad we did. As it is February we didn't need to book in advance and got straight onto the 9.10am trip. The boat trip takes about 15 minutes but gives great views of the city. The audio tour in the prison block was really interesting and we all enjoyed it. We then had time to wander round the grounds and other areas and as it was a sunny day it was lovely - maybe not so fun in the rain! We ended up staying till about 1pm.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Going back in history", "This is a national park now. From the boat ride, to the rangers, to the audio tour this is truly a one of a kind experience. I highly recommend this if you are in San Francisco. Book early and plan on 2 or more hours experiencing what a convict must have felt like. Terrific\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Possibly the only reason to visit San Francisco", "Had a great time visiting the island and getting a feel of just what it might have been like to have seen the island when it was in use. Took part in the headphone guides tour and found it to be very informative and relevant to a place steeped in history. A must see if you visit San Francisco.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Obsessed", "We took the Alcatraz Tours Ferry. An excellent and informative tour to \"The Rock\". We did the 6pm night tour. Recommended as you see the sunset! Easy to book, easy to find. The audio tour they provide is exceptional - moving and a little eery. They have certain activities on the island once you've completed the audio tour. We saw them demonstrate the cell doors. The debate about if the Anglin brothers made it off alive was very good. 100% recommend. I have since become completely obsessed with the history of Alcatraz. No sea sickness either ;)\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Exceeded my expectations", "My favourite day out of our whole trip and so inexpensive. Everyone was so helpful and friendly and the audio tour was fantastic, given individual headsets you can stop/start the tape and go at your own pace. Such an eerie place you get a real feel for everything, we absolutely loved it. It’s an absolute must for a day out. Just to add, we saw in all the literature to book at least 3 days in advance, we walked down to the pier to enquire and go on the next ferry which left in 20 minutes\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great visit to Alcatraz", "This is a must do in San Francisco. Self guided tour was great as you could walk the prison at your own pace. The ferry ride was also very enjoyable."], ["Reviewed 2 weeks ago", 5.0, "Amazing", "This is the 2nd time I’ve come to Alcatraz island and it never fails to impress, there was different places to see this time, we were able to walk all the way down to the sea this time. The views are always incredible.\nWe met an ex inmate who was book signing, he seemed very interesting and currently reading his book.\nDefinitely a recommendation to come here, all ages an amazing piece of history!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A Must Do!", "If you are visiting San Francisco this attraction is a must. I suggest that you pre purchase your tickets. I’d also allow 2-3 hours to see the whole island properly. The audio tour tour was amazing and very informative. The staff at the park were excellent as to the team on the boat ride over. There is quite a lot of walking involved and up hill. I would also do this again on my next visit to San Francisco. Make your your camera is fully charged and try and pick a day of good weather as the view from Alcatraz to San Francisco is amazing.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must go", "Alcatraz was so fun !! I would also recommend the night tour so you can see the cool views of the city at night!!!"], ["Reviewed 2 weeks ago", 5.0, "Alcatraz tour must do", "Tour was excellent. Could go at your own pace and see whatever you wanted. Make sure you go on audio tour and use headphones. Getting on and off boat well organized and quick"], ["Reviewed 2 weeks ago", 5.0, "Must see and do in San Francisco", "A tour of the infamous Alcatraz is a must do while in San Francisco. You need to get tickets well in advance for this attraction. You should also get to the boat dock a half an hour before your departure time in order to get a good place in line and choice spot on the boat ride over. The boats are full and the good seats/ standing spots get taken quickly. Allow three hours for a leisurely visit. Start with the short overview film and proceed to the cell house audio tour, which takes about an hour and a half to two hours depending on the crowds and if you need to pause the narrative to look around more. The gardens and re-purposed wild life habitat and other points of history concerning Alcatraz are fascinating and well worth your time while you are on site.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Never Dissappoints", "Trip to San Francisco cannot be deemed complete without experiencing at least once the Alcatraz story and island.\nIf you haven’t any knowledge of the history, the tour pits that to rest. Very good value for the trip on the ferry which provide a great view of the bay and SAN Francisco as well as the Holden Gate Bridge.\nThe Alcatraz tour requires walking but is worth every penny taking you back to the chilling and cold days allowing you to experience what if must have been like when it was operational.\nDo not miss it!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Cold and atmospheric", "We and our kids (10 and 12) loved the ferry ride and audio tour. It was windy, gray and a bit spooky the day we went."], ["Reviewed 2 weeks ago", 5.0, "A Must Do if in San Fran", "We went to Alcatraz in Feb. We took a 10 min (or so) boat ride over to Alcatraz. You first meet with a Park Ranger and they give you some back ground on Alcatraz. They will tell you areas you are allowed to go to and not go to. Then you are on your own (they did mention a guided tour but not sure how to do that). When you head up to the prison you have the option of getting the audio headset. I recommend getting this- there is no cost to get it and your tour will be narrated and will guide you where to go. On the audio its narrated by for former prison guards and inmates and tells the history of Alcatraz. You get the opportunity to roam the prison yard, can go into different cells, and see the hole where the prisoners escaped. This is self paced and you can pause your audio at anytime. Depending you maybe on Alcatraz for two hours. The are Souvenir shops on the grounds to purchase all sorts of memorabilia. Defiantly glad we had an opportunity to do this.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "excellent", "Great trip, wonderful view and site visit. It was a good experiance on the history and the way people used to lived ."], ["Reviewed 2 weeks ago", 5.0, "Obligatory when in SF", "Everyone does this - but everyone should. This is a memorable excursion to a justifiably famous and very interesting tourist attraction."], ["Reviewed 2 weeks ago", 5.0, "Great history ! It’s a must in SF", "I went with my wife for a half day trip to “the rock”. This is as important as Golden Gate Bridge if you want to know about sf history."], ["Reviewed 2 weeks ago", 5.0, "We saw if from Berkeley, from San Francisco, from Golden Gate Bridge but did not have enough time to visit.", "Alcatraz Island, famous for housing the nation's first military prison and home to the most notorious prisoners in the country, is seen from all over city of San Francisco, from the Golden Gate Bridge and Berkeley where were we stayed for nearly two weeks. I could see the island in the Bay from my room in Berkeley, took many photographs of it but while in the city of San Francisco had to miss physically going there, had a distant view from the shore and the Bridge. Given a chance would like to come back and be there where the most notorious criminals were housed for long. A-list criminals doing time on Alcatraz included Chicago crime boss Al ‘Scarface’ Capone, dapper kidnapper George ‘Machine Gun’ Kelly, hot-headed Harlem mafioso and sometime poet ‘Bumpy’ Johnson, and Morton Sobell, the military contractor found guilty of Soviet espionage along with Julius and Ethel Rosenberg and it would be good to go there and visualise them being here. Even a view from the city shore was a good experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Visit! One of the best tours ever done!", "Completely highly recommend! Really impressive tour! Great value for money. Ranger guides are top class and so knowledgeable. Really well organised. One if the best tours ever done!"], ["Reviewed 2 weeks ago", 3.0, "Good", "Really nice morning out. Not loads to do on the island. I thought we'd have been told a lot more on the audio tour so I wish I had done more research on it's history before I went but apart from that it was a really good experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Day tour with a little extra", "Our previous visit to Alcatraz was a night tour, so we did it during they day and got to see a little more.\nThe first thing which was different was as we got off the boat we were told we could turn left and walk around the Agave trail and up the steps as an alternative to going up the ramps. This was a really nice walk with some great views of the city and the bay. We saw the old fog signal building and various other ruins. This area is closed a good portion of the year due to it being a nesting ground. We also had a look around the new industries building which is now an exhibition with some compelling photos.\nWe did the audio tour which, even though we had done it previously, was really enjoyable.\nAs it was a pleasant day, we had picked up some food en-route and had a picnic on the dock while we waited for the return ferry.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must do", "We were always going to visit Alcatraz but we didn't realise just how much we would enjoy it. The transfer is easy and the bay was beautifully calm. The audio tour is really special and gives a flavour of the history of the place. It's one of those places you just have to experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wow", "Before going I recommend watching The Rock and Escape From Alcatraz. Both will give you a great idea of what to expect. The place is simply haunting. So famous and so much history. What a location for a prison"], ["Reviewed 2 weeks ago", 5.0, "Amazing", "Such an iconic place to visit. We booked the evening tour. The visit was informative and interesting. Our guild told us interested things on the wslknup to the prison. Few steps/stairs then you turn your headphones on and off you go. I really enjoyed it."], ["Reviewed 2 weeks ago", 5.0, "A must see!", "An experience for people of all ages. Take a trip and become one of the \"prisoners\" as you are guided through the entire prison, and experience what Alcatraz felt like back when it was fully operational."], ["Reviewed 2 weeks ago", 5.0, "Must do day trip", "This is a fantastic little day trip! We spent about 3 hours on the island, starting with a mandatory talk by a park ranger. We attended a screening of a movie about Alcatraz's history, before exploring the New Industries building and gardens. The audio tour (included in the price) of the cell block was both informative and entertaining.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Interesting", "A short ferry trip, then a long introductory talk, skip it, get an audio tour, well worth it. Cell area very good the rest is okay. No food on island. Well worth a visit, make sure you book in advance"], ["Reviewed 2 weeks ago", 5.0, "An amazing experience", "Alcatraz Island blew us away. The experience is fantastic and delivered so professionally. We could have spent hours more on the island! Steeped in history, there is so much to soak up."], ["Reviewed 2 weeks ago", 5.0, "Great for all ages", "Nice ferry ride (assuming good weather) to Alcatraz. The recorded guided tour is very interesting. Make sure you wander the grounds as well. Such a fascinating place"], ["Reviewed 2 weeks ago", 5.0, "Beautiful views of the city", "I have visited San Francisco many times in my life but never had the chance to visit Alcatraz. Bought tickets online through their website, keep in mind they sell out quick. The tickets prompted us to go to pier 33 to pick up the boat that would take us to the island. Once we arrived on the island the tour guides were very friendly and knowledgeable about the history of Alcatraz. Definitely a spot to visit if you love skylines as well!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Tour of Alcatraz", "This experience is unlike any other that I have ever had. It was fantastic learning about the history of the island before it was known as a prison. The tour of the cell block and the narration, which is done by past guards and prisoners, really gave it everything that I had hoped for. It really takes you back to the time and allows you to visualize what being a prisoner or guard may have been like. The trip over to the island itself was amazing as you could see the Golden Gate Bridge and also the Oakland Bay Bridge and they were also incredible sites. If you're going in the busy season, make sure you buy tickets well in advance.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "We enjoyed it but it wouldn't hurt to have an extra ferry late in the day", "We went on the Behind the Scenes Tour with Night Tour and it ran for 4 hours - while it was interesting, it came at the end of a long day and it would have been nice to have the option to \"escape from Alcatraz\" a bit earlier. However, the tour is very interesting and atmospheric - a must see!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Anniversary", "We really enjoyed this outing. It is a great place to visit if you are a history nut like myself. The customer service was great. When you get off the ferry there is a ranger guiding you through what to expect. The views from the island are breathtaking. Go early as it gets very busy. Also buy your tickets in advance. The self guided audio tour is very good.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "a must do", "You have to do Alcatraz when visiting this fabulous city. We bought our tickets before we arrived and we were not disappointed. The ferry trip is short and although slightly hilly Alcatraz has the wow factor. Ear sets are used to guide you around and it is absolutely fascinating hearing all the stories about the prisoners and the people who lived there. Worth ever penny\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Worth a Visit", "This was one of the highlights of our recent visit to San Fransisco. The Island is well presented and the audio tour brings the whole history to life. I really enjoyed my time at Alcatraz (perhaps a bit more than some of its earlier residents!)"], ["Reviewed 2 weeks ago", 4.0, "Prison history at its finest.", "You need to come and take the tour at least once in your life. A well guided tour with alot of interesting history. The prison has been well maintained and it's bigger than you would think so wear comfortable shoes because there is alot to see.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great day trip but book with the ferry port not a supplier!", "Visited Alcatraz whilst on a 5 day tour of San Francisco. Paid 36$ direct at the port rather than through a booking agent.\n\nGreat trip and would highly recommend for all the family.\n\nAudio tour guide was excellent and really made the prison tour as realistic as being there. Great stories and well put together. Well worth a big TICK from me!\n\nTop Tip - visit the Tix stand in Union Square. She will tell you the daily availability for buying tickets at the dock.\n\nAlso in high season, book direct with them online as there’s someone’s a 3/5 day waiting list.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "At least go once", "This is a cool spot to go at least once. Definitely order your tickets ahead of time. Especially if you want to go on the weekend or have a specific day planned, as they do sell out. Lots of history to learn. I watched “Escape for Alcatraz” before going which made it more interesting to me.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Must do", "This is a must do when you are in San Francisco. It's usually booked out especially in the summer months so it's highly recommend to buy tickets in advance. The audio guide was one of the best we have done and was extremely informative about the prison and the prisoners. One of its former prisoners were even present signing his book! Would highly recommend.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Impressive", "We were impressed by the set-up of the self-guided tour and the guides at the various locations. Very well preserved and everything but romantic!"], ["Reviewed 2 weeks ago", 5.0, "2nd visit... still fascinating!", "This was the second time I visited the rock. Both times I took the self-guided tour which is well worth the price ($45).\nThere is so much information available and so many great stories and history about the island. The self-guided tour is fascinating to hear. I love how you travel around the cellblock learning about some of the prisoners and life as a prisoner.\nThe ferry ride to and from was smooth. The depart the island every 30 minutes so you can leave whenever you’re done. It was a cold day, this time of year make sure to bundle up. The sun happened to be out so it was enjoyable to walk around the island and take pictures...there are views of the Golden Gate bridge that are stunning. This is a must do when visiting San Francisco.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "One of the must-see attractions in SF", "Big island to explore and follow the audio tour, plenty of places to explore and photos. Plenty of wildlife and nature flowers in the well maintain island."], ["Reviewed 2 weeks ago", 5.0, "What a Great Afternoon", "You absolutely must book to visit this place as it is very very busy !! Had such an amazing time exploring and hearing the stories and seeing what went on here an absolute must !! Fab from start to finish A big thumbs up."], ["Reviewed 2 weeks ago", 4.0, "Interesting", "Alcatraz was part of our vacation because my husband wanted to go there. I wasn’t that interested in it.It was not what I expected.It is a lot larger than I thought it would be .There is the history of Alcatraz beyond the prison,there are the stories of the people who lived there and there are beautiful gardens outside.I am glad we made it part of our vacation.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Be sure and book early!", "Excellent. Would like to do a night tour next time. Must-see for visitors. Be prepared for quite a hike up to the prison and bring warm clothes."], ["Reviewed 2 weeks ago", 5.0, "Easy To Do and Informative", "Went on 10:30 charter and left island to return about 2 hours later. Would not be good for children under 10, they wouldn’t find the history as amazing as it is. After getting a free headset you go on a walking tour. It will move to slowly with children. Lots of hills. Be prepared to walk steep hills and some distance. No food allowed on tour. Lovely view of SF from the boat. Enjoy.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great audio tour", "Fantastic audio tour and the whole ticket process was easy. Ferry ride was comfortable and then the Alcatraz island staff were very helpful. Watch the video in the exhibits hall, it gives great context for. One who don’t know much about Alcatraz!"], ["Reviewed 2 weeks ago", 5.0, "Great experience", "Yes, it’s a very touristy thing to do, but it’s something you need to do if in San Fran if for nothing else but the historical perspective of the island. There are tour boats available daily and the ferry ride takes about 20 minutes. We went in winter and it was bitterly cold so would suggest dressing warmly. Also, there is limited food available, so would suggest eating before you go. On arrival, one of the guides shares some information about the island and then you are free to roam around. Terrain is a bit hilly in parts and can be uneven, so suggest flat comfortable shoes. You can watch a short film on the island in the theatre if interested, and the audio tour is free and well worth it. If it’s a clear day you will get a great view back to San Fran. Returning is easy. You can jump on any returning ferry and they leave approx every 30 minutes. Great experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "behind the scene tour of Alcatraz", "Did this twice in one year. You get a park ranger telling you all the details of the prison as well as getting to see parts of Alcatraz most don't get to visit. Amazing and sobering place to visit."], ["Reviewed 2 weeks ago", 4.0, "Was exciting after twenty years to see Alcatraz again", "We were in SF about twenty years ago. It was very nice to come back! Just a beautiful view! Great people Perfect!!!! We will definitely come back to San Francisco: -))"], ["Reviewed 2 weeks ago", 5.0, "Alcatraz visit", "Worth every penny. A excellent boat ride. The NPS does a great job with this park. Worth a visit if you have time."], ["Reviewed 2 weeks ago", 5.0, "Must do.", "We visited in January so a little breeding but a brilliant trip. The audio guide is a excellent and well planned out. Although we didn't do any of the danger led stuff they all appeared to be friendly and very knowledgeable."], ["Reviewed 2 weeks ago", 5.0, "A MUST DO", "Been there twice. Always amazing me. It surprises me every time the history behind Alcatraz and what prisoners and officers went through. The prison is well taken care off and it’s something that a visitor has to see in SF."], ["Reviewed 2 weeks ago", 5.0, "Sumer of 2017", "After I watch the movie “Escape from Alcatraz” in 1979 with Clint Eastwood, and all the other film of the Rock during the years it have become a big dream to get there one day. In 2017 the dream came through, but off Couse when you have waited so long your expectations have become huge over the years. Nevertheless, relaxed it was no problem my expectations was fulfill fare above my imagen. To get out there and walk on historic ground and with the guided tour with all the stories it was an adventure. A memory for life Thanks a lot Alcatraz for the moment we had.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Alcatraz trip...amazing history", "This was in a long time “gotta see” list. It was amazing. The ferry ride was short (15 min) and beautiful. The history you learn is absolutely amazing. If doing a day tour...do the audio Cellhouse tour. Sends chills and is VERY informative. Plan 2-3 hours.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Alcatraz On the Rocks", "We did it! We went to Alcatraz! I surprised my fiancé with a trip to San Francisco for his birthday and of course, you can't visit San Fran without a trip to Alcatraz.\n\nLuckily, Alcatraz welcomes everyone and I mean everyone. My fiancé injured his leg prior to our trip and had to be put in a full leg cast which resulted in us using a wheelchair throughout the trip. From beginning to end, the employees at Alcatraz Cruises were helpful and thoughtful during our visit. They knew he wanted to capture beautiful images of the bridge, so they told us about the secret spot to catch views with a wheelchair.\n\nUpon arrival at the island, we took the tram up to the very top. Again, every employee we encountered was friendly and helpful. We started our tour and long story short, he loved it. The tour is a little confusing, to say the least. It makes you go in circles rather than simply going in one direction the entire time which was a little irritating to me. After my visit to Eastern State Penitentiary last year, I personally wasn't too impressed with Alcatraz. It's beautiful with great views of the city and bridges, but the tour felt messy and it was \"too\" touristy.\n\nOverall, I do think everyone visiting San Fran should make the trip to Alcatraz. If not for the prison, do it for the views!\n\nProTip: Wear comfortable walking shoes! You are walking up a giant hill. Also, bring snacks and water. They do not sell anything on the island.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Take the nighttime tour!", "Reserve early! Don't turn down the audio tour. Bring a sweater. The boat on the night tour goes around the island, which is something you don't usually get to see."], ["Reviewed 3 weeks ago", 5.0, "Alcatraz island", "Great tour very impressive The audio was outstanding 5stars I am disabled and the accommodations for me were great with the tram going all the way up the hill"], ["Reviewed 3 weeks ago", 5.0, "Such a great tour - would highly recommend!", "We did the guided tour this past January and couldn't have better things to say about it! Our tour guide was amazing and so passionate about the island and it's history. The 4 hours flew by and was totally worth the money. You get to see places on the island that are typically closed off to the public on the normal tours, like the dungeons.\n\nIf you are considering it, but aren't sure I encourage that you try it - you won't regret it!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Alcatraz tour", "Worth heading over to see the prison. It’s a great view from the island of San Fran and must have been torture to see the world but not be part of it. Worth a few hours to take a look."], ["Reviewed 3 weeks ago", 5.0, "So informative", "Fantastic day out , so much information the ranger talks are very good and the self guided tour is also excellent, if you wanted to you could spend all day .Boats leave every half hour back to the mainland so you can choose how long you spend there.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Classic \"must see\" when in SF", "The famous \"Alcatraz\" prison island is truly a \"Must see\" when in San Francisco. Regardless of your interest, it's highly recommended even though it is the definicion of \"tourist trap\"."], ["Reviewed 3 weeks ago", 5.0, "Iconic Visit", "I think it would be a complete disservice to the city of you didn’t at least visit Alcatraz once on you visit to the city. Get there early (0830) and search online for deals and you’ll both pay less and avoid the crowds! The audio tour is a must and has won awards for good reason! I was lucky enough to meet a former guard who worked there and who kindly signed my book! This place is full of history! An amazing view of a place with such a dramatic story.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Have to see it", "You just HAVE to go see this ..during tour of jail, you get earphones to guide you through ever cell sound affects are amazing very REAL as to how jail was run .... OMG GO SEE IT"], ["Reviewed 3 weeks ago", 4.0, "Fun", "Going to Alcatraz was something I had to do before leaving San Francisco. I booked my ticket online, and unfortunately missed my boat but luckily they keep some space for people like me who are late or buy tickets last minute. It wasn't a guarantee that I would be able to get on the next boat but it was a slower day. It was a fun short boat ride, and certainly, when you get to the island you have the option to do a guided headphone tour or freestyle. I freestyled and kinda breezed through it, it was fun to see and experience however it isn't something you do twice. I would recommend passing by the gift shop for some fun mugs.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazingly Atmospheric.", "We booked this trip before we arrived in SF. It was big on our to do list.\nWe had an early time slot and was going to grab a coffee and breakfast once we got to the island but this is not allowed, no foods are sold on the island, which makes perfect sense once you get there. So we had a coffee and pastry on the boat which was very nice.\nThe island and buildings are well explained on the landing briefing and then it’s up to you where you go and how long you stay. The audio set is great with some interesting facts pointed out as you walk around the blocks.\nOnce outside the main buildings there is still lots to wander up to and see.\nAfter hearing about Alcatraz stories on films and old Crime Shows to see it and walk through the place was so interesting and there is a real sense of history and lives lived there.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Gotta love Alcatraz", "Book a long time ahead. The tickets sell out weeks in advance. We booked from Australia and were glad we did. A good morning and a great tour by headphones"], ["Reviewed 3 weeks ago", 4.0, "A Classic SF Experience", "If I was ever to serve hard time, The Rock would be high on the list. Take away the shanking, prison yard riots and general state of chaos and you're left with spectacular water views. Well good news, since it's no longer a functional prison, you can experience those views without doing your Zodiac impersonation. Not much needs to be said about Alcatraz at this point, it's a California tourist staple and if you're visiting you'll be checking in here. Lucky for you, you'll be able to check out whenever you like.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "So interesting!", "This was the first thing we did in San Francisco. Loved it. It was very well organized. The radio headsets were perfect. Gave you so much information and you could go at your own speed. Had we just walked through the place it would not have been near as interesting. But hearing the stories made it very enjoyable. The employees on the island were all very nice. And I had NO idea that families lived there when the prison was open. Even children! Wow. Our only regret was that we didn't stop to take a picture inside a cell. But that was our fault!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Book early as this is an essential place to visit", "I managed to get a ticket for this last minute which I am really grateful for (tip: go to the actual website as they continuously release tickets) as this a great monument to see. They offer a guided walking tour which I would say miss as it does not offer that much insight as well as a audio tour as part of the experience which is pretty good. Shame that the weather on the day was overcast as could not get the best view of the city on the boat trip there and back but all in all glad I can say that I have been to this place.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Seems strange to rate a PRISON 4-stars...haha!", "Alcatraz is enmeshed in San Francisco lore. It is interesting to see and learn the history behind it, and see how sparse and dank the cells were. Everyone visiting SF should visit Alcatraz, it's like not visiting the Statue of Liberty on a visit to NYC\nShow less"], ["Reviewed 3 weeks ago", 5.0, "So much fun!!", "This was a really neat adventure! We took the night time tour with our 8 month old, and we had a blast! When you get on the island they give you these head phones for a audio tour which I loved because not everyone is huddled over the same thing at the same time. Everyone is going at their own pace! Really cool, I would recommend doing this little adventure if your in San Francisco!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great visit to Alcatraz", "This is the second time we have visited and it was again a very interesting time. The included headsets with commentary from ex-prisoners added an extra dimension. Super time."], ["Reviewed 3 weeks ago", 5.0, "A MUST!", "DO NOT MISS YOUR BOAT!!!!!! I did. =( Take the night tour as opposed to the day tour, pay the extra $7 for it. The view of the sunset of the Bay Bridge, Golden Gate Bridge, and the city skyline is a sight to see."], ["Reviewed 3 weeks ago", 5.0, "Great Customer Service", "We bought our tickets in advance for the 11:30AM boat, unfortunately the traffic was heavy on our way to San Francisco, I called customer service and they told me that since it was January and the boats do not fill up as in other busy months, we could just go to the ticket window and change our tickets for a later time. We were able to change them to the 12:00PM boat with no problem.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "AN ABSOLUTE MUST!", "I've visited Alcatraz a few times at different stages in my life from child to young adult and as an older adult and this last time, I really found a total new appreciation for this place. The views, the history, the feel of the island. Just so incredible. Purchased a book and couldn't put it down on the way home. Highly recommend.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Pleasantly Suprised!", "We were pleasantly surprised ... we had heard mixed reviews, but wanted to see Alcatraz for ourselves. We thought it was amazing! The audio tour was great!! The headsets worked perfectly.\n\nThe grounds on Alcatraz Island are beautiful ... so many flowers, shrubs, birds ... Not at all what we expected.\n\nThe views of San Francisco are stunning - you can literally see the streets going up and down the hill.\n\nHIGHLY RECOMMENDED!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A really interesting tour", "We went to Alcatraz in the second boat in the morning,what is better because the Island is not so crowded, and it was a cold and rainy day.\nAlcatraz is really interesting, but grab your coat, it freezes in there. They have audio guides with which you can understand everything that happened in there and it makes the tour better appreciable.\nI am not sure if it is the best place to take small kids, they can´t understand what is happening and you have to walk a little bit over the Island.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Make sure you book with the official website if booking online", "I pre booked for my family of four to visit the island recently. I thought I had booked through the official website but when we arrived for the trip I realized I had paid $8 more per person than the price on the ticket we were given at the gate. Please be sure to book through the official website. Check around on the websites prices and you will see the saving if doing it on the official website.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fascinating tour", "This was an audio tour but it was very well done. The in person presentation about the escape from Alcatraz was very engaging.\nThe bathrooms at the dock were clean and well equipped (real toilets :). We enjoyed the museum store also.\nThis is a fun way to spend an afternoon.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great day trip", "Great day trip going here then to the pier for a late lunch. The ride over on the ferries is great. Go out the front of the ferries to get some great pictures. There is a bit of walking once there. the headset self guided tour is excellent no need to pay extra.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Worth it!", "Loved the visit, this was my second time to visit and what a difference 10 years make! The audio tour is so interesting and well done and the view once the fog clears is amazing!"], ["Reviewed 3 weeks ago", 5.0, "Such a unique and unforgettable experience!", "Alcatraz was well worth the money, and was such a great historical experience. The audio tour was excellent and felt very very real! The boat ride out was so fun and gave a great view of the bay!"], ["Reviewed 3 weeks ago", 5.0, "So interesting!", "Our flight was delayed and so we were going to miss our tour! However the customer service was awesome and she was able to reschedule our tour date with no penalty!! So glad I got to learn about the history of Alcatraz and take in the view of San Francisco at the same time!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Spooky evening tour!", "Alcatraz is a must - though admittedly not for everyone. The average person doesn’t have a lot of experience with a maximum security prison (we hope) but the audio tour of Alcatraz humanises the demon rock with stories from guards, inmates and even children who lived there when their fathers worked in the prison! If prisons aren’t necessary your thing it’s worth it for the view alone - beyond incredibly on a beautiful day! We did the evening tour which added a particularly spooky element to the tour. Also after the standard tour they have various guards giving ad hoc discussions. Very interesting! I wouldn’t recommend bringing children - it’s creepy!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Behind the scenes and night tour", "A lot of fun, we learned so much from our tour guide Sarah she is a Park ranger and has a lot of knowledge. Got to get inside some of the buildings and rooms you do not have access to on the normal tour. The audio tour was fantastic and the speaker we had about Al Capone was really good. Really good time and highly educational. Strongly recommend. Make sure you book in advance.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Interesting experience", "This is a must-do in San Francisco. But buy your tickets in advance, to avoid disappointments and waiting lines. Take also warm clothing with you, because the trip to Alcatraz can be cold.\n\nWhen entering the island, go directly to the audio tour desk, don’t wait for the welcoming speech. You will learn everything while you walk through Alcatraz. And be the first of the big group that’s behind you. No waiting then.\n\nBe aware that you can’t eat at the island, so bring some water with you and eat before you leave.\n\nParking will be a problem too, but there are a lot op paid parking places nearby.\n\nEnjoy !\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Walk across the Golden Gate", "Easy walk across the bridge, 30ish minutes each direction. Very windy no matter the day. Scarf to cover your ears is a good idea. Start at the golden gate park end. Not much to see, eat, do at the other end. Use the bathrooms before embarking!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Do it", "A must-do in San Francisco. Plan on spending a few hours. Fascinating place with a lot of history. I would love to come back and do the night tour. Dress a little warm. as it's 10-20 degrees cooler than the mainland."], ["Reviewed 3 weeks ago", 5.0, "The Prison Tour", "We have been to San Francisco several times but had never gone to Alcatraz. We had a wonderful day. The National Park Service goes out of their way to make information available. I’m so glad we did this!"], ["Reviewed 3 weeks ago", 5.0, "Very good tour", "Big crowds, but well-controlled by the no-nonsense staff. The walk to the cellblock is rather steep, but there is a ride available which we took advantage of. The audio tour is excellent. Make sure you reserve in advance!"], ["Reviewed 3 weeks ago", 5.0, "A great way to spend an afternoon", "The trip to Alcatraz was informative and interesting. The ride over and back was pleasant the Audi jail house tour was extremely interesting. Lots to see and explore."], ["Reviewed 3 weeks ago", 4.0, "Took the boyfriend for his dream tourist experience", "I always thought I would live in San Francisco, and my brother moved to San Jose after college, so I’ve had my fair share of visits to the rock. But the new boyfriend wanted to go, and I wanted him to have the experience. The ferry ride over was perfectly pleasant, the self-guided tour was good. It’s the stories and the aesthetics that make the trip. People who are willing to do a little bit of research before going will enjoy feeling that history come to life for them as they walk down Broadway, face the same windows overlooking the city, and deeply sniff the wind to see if today is one of those days that the smell of chocolate or the bread is carried to the island. When we went we were blessed to find out one of the former inmates was signing books in the bookstore. It was overall a lovely experience, and my middle-aged, blue-collar, East Coast boyfriend had a fantastic time. He poured over the details of the cells, he was completely absorbed with the escape stories. It was a very manly visit for a very manly man. He had A blast. I will add a weird aside in that I am a heart patient. Having a golf cart be able to take me from the dock up to the prison, and back again made the tour possible for me. Having a park ranger remember that I rode the golf cart and pluck me out of the long, long line for the ferry to go sit on a bench and then cut the line to board the ferry Meant I did not go home completely wiped out from the physical exertion. It was a sweet and unexpected bonus to have a park ranger pay so much attention. It’s not an act of kindness I will forget anytime soon.\nShow less"]]}}