{"Angel Stadium of Anaheim": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Angel Stadium of Anaheim", "url": "/Attraction_Review-g29092-d630476-Reviews-Angel_Stadium_of_Anaheim-Anaheim_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/15/ed/08/angel-stadium.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1408"}, "address": {"@type": "PostalAddress", "streetAddress": "2000 E Gene Autry Way", "addressLocality": "Anaheim", "addressRegion": "California", "postalCode": "92806-6143", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 3.0, "Just a Really Big Food Court", "We had some extra time, so we stopped by. Not really impressed, but you could probably find something good to eat here. It really didn't live up to it's hype."], ["Reviewed 3 weeks ago", 3.0, "I have been to 11 major league parks. This one is average", "The food options are lame compared to most stadiums. There are sight blocked seats which is just ridiculous. The overall view of the field is pretty nice."], ["Reviewed 4 weeks ago", 4.0, "Enjoyable Baseball Park", "Fun place to catch a baseball game or a special event. They have a decent selection of food and drinks; better than many other ball parks. The place is comfortable for seating and viewing. Nice vibe overall."], ["Reviewed 4 weeks ago", 4.0, "600", "I always try to catch a game any time I'm visiting LA and this year got to two games, the second of which was the occasion of Albert Pujols HR number 600. Great atmosphere, I love Angel Stadium. Got to watch the Saturday night Fireworks as well as get my free Shark Rally Monkey\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great place!", "Anaheim Stadium is one of the best and possibly the cleanest stadiums to see any event. The seating is comfortable and the food is great."], ["Reviewed January 14, 2018", 5.0, "Awesome", "Monster jam 2018 was awesome. First time being here my son love it and his only 2. I highly recommend you get here 1 hour early for parking and not standing in line. We got lucky found a great parking space and we only waited 20 minutes in line. We had great seats for $80 and I was able to take great pictures and enjoy the show. If you don't have time to get food don't worry the have people walking around selling food and drinks. Is very loud so I was able to buy some head phones for my son $20. I ready to come back for the finals.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Angel's Baseball baby", "Great stadium and very friendly staff. They work very hard to make the event enjoyable & family friendly. I enjoy going to a game during my business travels so I can unwind and relax."], ["Reviewed January 9, 2018", 4.0, "A great day for a game", "It was nice to arrive in LA and take in a game before we hit Disneyland for the next 3 days. Seats were reasonably priced and something great to do."], ["Reviewed January 9, 2018", 2.0, "Dumpy Old Stadium", "We attended the A1 Supercross Race here last weekend. After watching so many of these races on TV, we had high expectations of the park and surrounding areas. We quickly realized that TV makes it look nice. The concourses are very dark, very narrow and just seemed dirty. The concession prices are beyond obscene. We bought 4 beers and it cost $52.00. Plus, even though the place was sold out, not every stand was opened meaning you had to really search for what you wanted. The bathroom trash was overflowing and was never cleaned. The process to get into the pit party was a bit underwhelming as there were really no lines and you had to bump around to get to the gates. The same process held true leaving the pit party. So, high concession prices, high Feld Supercross ticket prices were at least countered by a great race. Fortunately we attend most of our baseball games at Busch Stadium which has no comparison.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Great experience", "Really enjoyed experiencing my first ball game against NY Yankees. The stadium was good but the prices are outrageous. Still a good experience to do though."], ["Reviewed January 4, 2018", 5.0, "Nice Stadium", "Not one of the newer stadiums, but good place to watch a game from. Many good concession stands with a lot of food choices."], ["Reviewed January 4, 2018", 5.0, "Outstanding!", "The Angel Stadium holds many memories of mine. Will always go there for a family vacation, and I recommend you visit at least once, or twice."], ["Reviewed November 15, 2017", 5.0, "$16 OF seats 10 rows from the field", "Angel Stadium was a great place to visit. Saw the Angels play the Tigers on MothersDay. Got a decent parking spot. Parking price was not crazy, about half the cost of Toronto.Walked right up to the window and got tickets. The staff were friendly at every spot we went to in the park. I asked at the main gate which direction was the quickest route to our section and once we headed that way it was really easy to find our seats.\nSat at Center Field about 10 rows from the field and just a few seats from the waterfall. We could see everything just fine. The snacks were a little expensive but that happens at every sports venue. We had to buy a couple rounds of water or lemonade cause the sun was beating down on us.\nA couple other cool things were guest relations offered a small gift to kids as first time visitors. And the Angels Centerfielder tossed a souvenir ball in the stands every inning before the inning would start.\nIf we come back here we will definitely take in another game.\n\nShow less"], ["Reviewed November 14, 2017", 4.0, "Nice Stadium and Surprisingly Clean.", "This is a great stadium for those who enjoy primarily baseball, but they also have concerts and other events here as well. It's centrally located near the freeway and not too far from the block if you're looking to eat or drink before or after the event.\n\nTraveler Tip: It is a really fun time especially during the summer when the weather is nice. I'd recommend to always bring a jacket or sweatshirt for the evening.\n\nAll in all, it is a surprisingly clean venue with plenty of parking. The area is not very dangerous compared to some of the LA venues, but still I'd look around and observe your surroundings. Enjoy!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great staff, great venue", "We were lucky to catch the last game before play offs. For a couple of Aussies excited to see the game, the staff were friendly and helpful. Well done Angels for looking after your fans"], ["Reviewed October 24, 2017", 5.0, "A cool experience", "On holiday from NZ with an 11 year old son and 9 year old daughter. So different to anything we experience back home. Loved the size of the stadium, the atmosphere, the game, the food, the fireworks."], ["Reviewed October 18, 2017", 3.0, "Needs Serious Upgrades", "Nice old statium but greatly lacking modern amedities .... Sight lines and armopsphere is ok providided that the Angels are winning but the stadium is too old and shows it's age."], ["Reviewed October 16, 2017", 5.0, "Go Angels!!!", "What a great night. We love this Baseball Stadium and the game against Seattle Mariners was sooooo exciting, Angels turning a 5-2 deficit into an 8th innings 6-5 win. Rally Monkey really did his job tonight!! We came away on a real high"], ["Reviewed October 10, 2017", 5.0, "First baseball game", "Great day for the family. Our first time at a baseball game so we didnt really know what to expect. It was a fantastic experience from the start. We were given free parking as we drove in. Parking wasnt a problem and was only a 2 min walk to the entrance. We bought our tickets there and the lady at the booth was very helpful with what seats we should get. The game was enjoyable and we got a huge popcorn in a souvenir container \"expensive but worth it\". The entertainment between innings kept everyone interested. The Angels won which was a great ending to a fantastic afternoon :) And no problem exiting the stadium either.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Great times", "First time at the ballpark since 2010 ,great to see the staff still are friendly and care and the food offerings are much improved from our last visit . The late 90s refurb is a long time gone and things are looking a bit tired . Also what's with the stores being so highly priced now , is Arte trying to tick off the fan base to soften the blow when he gets his move away from Anaheim ?\nShow less"], ["Reviewed October 3, 2017", 5.0, "Great time", "What a great time at this ball field. Watched the angels game with diamond club access and it was fantastic. For a guy who never watched or played baseball much I am a convert."], ["Reviewed October 2, 2017", 4.0, "Angels game", "We came here for an Angels vs Indians game on a Wednesday night. With the wildcard race still in play (at that time) it was a fun crowd. The stadium feels newer then it actually is. The only exception is the scoreboard - it was very dated and didn't have great image. Ah well, small potatoes since I was there to watch the game and not the screen! There are plenty of concessions, and in the loge level (200's) you can order beer and food from your seat! Beer and food are typical stadium prices ($$$$$)\n\nBe sure to check out the giant helmets at the front entrance - they are very cool!\nShow less"], ["Reviewed September 29, 2017", 1.0, "Booted Unfairly", "I love the Angels, but certainly won't be returning here. We bought particularly expensive seats for a game, only to be harassed by a local drunk. He ended up coming to our seats, throwing some of our stuff into the field of play (yes, really!), and then continuing to threaten us with violence.\n\nStaff and security ended up booting both our groups without listening to a single bit of the story, despite multiple witnesses nearby vouching for us. I MAY have been okay with returning to the park, but I didn't even get a single response when I tried to reach out to the stadium and ask about the incident.\n\nIt's sad that our tickets/money were essentially stolen by the park, and our experience stolen by this drunk man. I'm sure you can have a great experience at this park 99% of the time, but I can't personally return knowing how slighted I was. Sorry Angels, I'll see you on TV or on the road. I had a much better time watching you at the Athletics game recently.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Great experience", "It was my first baseball experience and I'm sold!\nAlthough the Angels don't have their best season this season a night out at the ballgame is simply relaxing.\nYou can go to the stadium, buy a ticket at the stadium and you can find your best seat. Buy a beer, buy a bag of peanuts sit back and relax and enjoy the game!!\nWish I could come back every game!\nShow less"], ["Reviewed September 28, 2017", 5.0, "Great stadium,Great eats", "Watched the angels vs the Astro's.It was a low scoring game but that didn't matter to me,the atmosphere was great even though the crowd was quite small.The food was yum as well I love the fact you can get a nacho helmet.That is classic american baseball i.m.o\nShow less"], ["Reviewed September 25, 2017", 5.0, "Family Fun", "Our 3 children attended their first major league baseball game in this stadium. They had a blast! Awesome family environment. Be sure to order the \"nacho helmet!\""], ["Reviewed September 24, 2017", 5.0, "Great ballpark", "Our 16th ballpark. One of the best! Much better than Dodger Stadium. Parking was convenient and the entrance gates are really cool with the giant Angels hats and bats. We went while our hometown Rangers were playing there. We both had on Rangers shirts and caps and were well received by the local fans. Even though the Rangers won that day, we had a blast with the Angels fans in our section and they were good sports about it all. We had excellent seats on the first base side with a great view. We saw a great ballgame. A 2-0 pitcher's duel. I would have been disappointed if the Rangers had lost, but I would have still had a great time. Great park with great fans!!!\nShow less"], ["Reviewed September 22, 2017", 5.0, "Still a great ball park", "We attended a night game and then a day game the following day. The park is clean, you feel safe, the sightlines are good, and there are plenty of restrooms and concessions. This is becoming one of the older ball parks in the American League, but it's still a great place to go see a baseball game. Parking was easy and there were plenty of exits out of the parking lot.\nShow less"], ["Reviewed September 21, 2017", 4.0, "Enjoyable", "Nice stadium with good views. Plenty of food and drink vending at the usual stadium prices. Seemed to be family friendly and although up in the cheap seats the people around us were enjoying themselves without being too raucous. Was plenty of parking around the stadium but we chose to walk the mile from our hotel, it was safe and we had no issues.\nShow less"], ["Reviewed September 21, 2017", 5.0, "What a great stadium", "We went to see the Angels against the Indians on a Tuesday night. The stadium staff and the facilities are great. Food and drinks are good and they even have an Ubur pick up point."], ["Reviewed September 20, 2017", 4.0, "Last Minute Decision", "While having a late lunch and no plans for our first night in town we decided to grab some cheap tickets and check out a game. The stadium, while not new, was clean and inviting. It was beanie night which was a plus. The staff was very friendly and helpful. The Angels offer lots of concessions and the prices are reasonable.\nShow less"], ["Reviewed September 17, 2017", 4.0, "A nice place to see a game", "While traffic can make getting to this venue difficult, there is plenty of parking onsite. I did not see much tailgaiting going on before either game we attended. Getting in the stadium was secure and easy. So was getting to our seats. There are adequate amount of restrooms and places to get food and beverage. I was impressed at the different types of food and drink you could get onsite but you have to explore a little to find them. Prices are in line with other ballparks. The seats are set up in a way that first and second level seating provides an enjoyable way to watch the game. We had perfect weather both nights so that was a plus. Leaving the venue was also easier than many other ballparks I've visited. There is little to nothing around the ballpark to go to after the game.\nShow less"], ["Reviewed September 17, 2017", 4.0, "First MLB game", "Was keen to go to a baseball game as part of our USA holiday so was happy to see that there was a game on the day we arrived - and it was Star Wars night! The stadium was pretty spectacular. Food wise, we had a Angels hotdog, and it was okay, but way too many condiments! The nacho's in a helmet was a nice idea. Beer costs $4.50 for a small (which is still a good size) and approx $9 for a large. Check your beer before you leave the counter. First beer I got was flat. My mate picked up a couple of craft beers and they were great! All in all, a great night out, the game was exciting and the Angels won!\nShow less"], ["Reviewed September 15, 2017", 5.0, "Baseball Suite is the way to go!!", "Enjoyed a suite at the stadium to see the Angels and the Asros. Great way to watch the game with the food right there and a great view for the game between home and third base. And Pujols hit a Home run!!"], ["Reviewed September 8, 2017", 5.0, "Blessed to Enjoy a Taste of the Suites Life at Angel Stadium", "We were fortunate to be given a friend's suite, for a recent Angel game v The Oakland A's. The suite was nice and cool on a very hot Orange County Summer night. The attendant was helpful, friendly, fun and very attentive. She was a breath of fresh air on this warm August night.\nFood and drinks were just what we expected and the only missing in the suite was a restroom!\nThe stadium is always clean and fun and makes for a good old fashioned night out!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Out with the boys!", "It was a great time watching the Angels play at home! Also we had great seats on the third base side with shade! It was awesome to have a night out with my sons! With the tickets on the phone, it was so easy! Also we all received a bobble head!\nShow less"], ["Reviewed September 5, 2017", 4.0, "Great first experience", "Our family enjoyed a great night at the stadium. Employees were friendly and the seats were great. Too bad the angels didn't win."], ["Reviewed September 3, 2017", 4.0, "Never Quit Win & Great Food", "Angels comeback from 8-2 deficit to win 10-8 for 30+ come from behind victory. St Archers Brewery (formerly Knothole & ?) has brought back great food that has been missing since Management change. Recommend Wings, Philly Cheesesteak , Burgers with large cut fries. Also several new and tasty items for varying taste. Made game more enjoyable.\nShow less"], ["Reviewed August 30, 2017", 5.0, "California Dreamin'", "The Angels v The Texas Rangers was our first ever baseball game. As a family we all thoroughly enjoyed ourselves and though the stadium and view we had were fantastic. Pity the Angels lost but can't win 'em all!! Good food, good beer and good company. Got the caps and the t shirts and would love to go again.\nGood luck Angels!!\nShow less"], ["Reviewed August 28, 2017", 1.0, "Diamond Club", "Spent a nice Sunday at the baseball game enjoying everything the Diamond Club had to offer. The service was great until I checked my bill the next day and noticed they double charged me on my order. What's weird is I saw the person taking my order run my card through twice (me thinking that it just didn't work the first time) but I should have realized something was wrong when he took one of the receipts and put it in his pocket and had me sign the second receipt. Now I have to waste my precious time going through my bank to clear up the fake charge. And to think I gave him a 25% tip. Live and learn.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Sesh, couple or family it's great", "Never been to a baseball\nGame before and really wanted to when we visited the US and was originally disappointed that we were never in LA when there was a major league game on but when we got to the stadium I thought it looked awesome from the outside and great on the inside. Love the water feature in the background and the home run celebration is top knotch. A season ticket holder helped us with the rules of the game and once it gets going they're easy to follow. If you're taking the family to Disney then look out for game at the Angels!!\nShow less"], ["Reviewed August 25, 2017", 3.0, "Baseball trip stop", "This was one of our 5 stadium tour through California. We went to this stadium the first time in mid 1990's.\nThe park has some nice features and a lot of Mickey Mouse statutes as well as a unique gate.\nOverall an average ballpark. Food predictable, seats were nice and park was clean.\nShow less"], ["Reviewed August 25, 2017", 4.0, "Nice Stadium", "We are Ranger fans from Texas but we enjoy visiting other stadiums. Very pleasant crowd and the stadium is very Modern."], ["Reviewed August 21, 2017", 4.0, "Fun stadium", "First tip, bring sun screen if you are going to a day game, or sit in a shady spot if you can find one. The interior corridors of the park is outdated, but the stadium itself is fun to see and has some cool unique things to it. The homerun celebration is top notch.\n\nAdvice for the Angels. Teach your team where the ART buses are. We stopped to ask 5 different people inside and outside of the stadium where the ART shuttles were. NONE of them knew for sure, and we were pointed in all different directions. We circled the entire stadium and never found them. Very disappointing\nShow less"], ["Reviewed August 19, 2017", 4.0, "Decent time", "Pretty good time. Stadium was good and overall a good time. Food was okay and parking situation was a little screwy."], ["Reviewed August 15, 2017", 5.0, "AWESOME!!!!!", "WOW!!! What a stadium!!! Now I know die-hard baseball fans of other teams may thing that I'm a bit crazy, but this was my 1ST game - I thought the place was brilliant.\n\nIf I ever lived in America, I think you would always find me at a baseball game. We got \"nose-bleed section\" tickets for $16.00 per person, money well spent as we still could see the game but had plenty of space around us and there were waaaay higher seats so I think we got a great deal!!!\n\nIf you get the chance to go to a game - any game - DO IT!!!!!\nShow less"], ["Reviewed August 13, 2017", 4.0, "Great, fun park for an evening", "Angels Stadium is a great place to enjoy a summer evening. Good views of the game, easy access from the highway and easy parking. The fast food options are expensive and typically low quality."], ["Reviewed August 11, 2017", 5.0, "Better Experience then other local MLB Stadium", "We went to both Dodger and Angel stadiums on this trip. If you aren't committed to either local team & can only go to only one park. Make it Angel Stadium. The whole experience is better. Its easy access and exiting for parking. You are made to feel more welcome. The main entrance is well done and picture worthy. Inside the feel is more inviting. Your welcome to move freely around the park. There seemed to more food choices or repeated options. The wifi works if your using your MLB app. At least on the night we went the local team played like world beaters winning 7 - 0. They just need a local flavored 2nd 7th inning stretch song to play.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Good for a day game", "With So Cal traffic, im very selective on what events I go to and when I go. We did a midday weekday game and getting out was pretty easy. You need to carefully choose your spot, so you can get out easily without being stuck for 30 minutes plus. We sat under the overhang so we were out of the sun. $25 for field level made for a fun afternoon.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Must see", "It's a nice stadium. There is nothing to do around it before or after the game. There are great hotels close. Food was a positive. Chronic Taco is a wonderful place to eat."], ["Reviewed August 8, 2017", 3.0, "Ok Stadium", "Parking was confusing with random blocking all over.\nThe spacing in front of the seat made it hard to go get food.\nThe BBQ pulled pork was Amazing. Every thing else was unimpressive. Service was extremely slow.\nElevator had a very nice attendant which is a nice touch.\nOverall its not the best, its not the worst.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Very Nice Ballpark", "Beautiful ballpark. There is plenty of onsite parking, $10 for regular or $20 for VIP. No bus stops near the stadium that I am aware of. Ticket prices and concession prices are expensive compared to other ballparks that I've been to. Overall, a very pleasant place to watch a game.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Great Ballpark", "We went to two ballgames at this stadium and had a great time. There is a huge parking lot so getting in & out were super easy. The food was very good and the employees were exceedingly friendly. It was pretty hot in the sun. The fireworks on Saturday night were amazing and started right after the game ended. Beautiful show. My home team beat the Angels, so that was a plus. But it was a great game. Thrilling until the end.\nShow less"], ["Reviewed August 7, 2017", 3.0, "below average vs. the other MLB stadiums", "We do our yearly baseball stadium tour and so far have seen 26 of the 30 in MLB. Angel Stadium was convenient to get to and it's ok for a renovated stadium, but given what all the other teams have done, they should've just torn down the place and built from scratch.\n\nThe one feature is their rock with the water cascading down. It's not nearly as nice as the fountains in Kansas City and the park doesn't have the charm of Fenway or Wrigley nor does it offer the modern features of say PNC (Pittsburgh) or AT&T (SF).\n\nThey should be kissing the ground that they have Mike Trout, because I'm not sure what reason there is to go to this stadium other than him.\nShow less"], ["Reviewed August 6, 2017", 4.0, "Fun", "Fun times. Parking was 10 bucks, or 20 bucks for preferred. Game tickets are pretty pricy, and it's their own lot, so charging for parking is kinda crappy, but, what can you do.\n\nThe stadium is pretty nice. But, when you first walk up, you are houded by people wanting donations, and time shares, and what not. Kind of annoying.\n\nSo, they check inside your purses, and you go through a medtal detector, give your tickets, and you are finally in. There are ramps to get to the upper levels. And escalators.\n\nThe ushers are less than helpful. I spilled a full soda, and it went all over the walkway. We told the usher, and he stood there confused as to what to do. Said, ok, I'll find someone to take care of it, but I can't leave this post. (Why don't they have a way to communicate???) My husband ended up going to find someone. 15 minutes later, someone finally came. By now, soda is all over the place. 20 minutes after someone cleaned it, that same usher came over, and said he would go get someone. We're like, ya, um, it's done.\n\nAnyway, they had vendors selling dippin dots, hot dogs, pizza, churros, popcorn, peanuts, ice cream, cotton candy, and lemonade. Or you can get nachos in a baseball hat at a concession stand. As well as alcohol. But, you're gonna pay. Lol. An 8 oz cocktail is like 12 bucks. Hot dog was 4.75. Dippin dots were 8.50. Pretty pricy.\n\nWe had fun. Game started about 6:05 and after Saturday night fireworks, we got out of there about 10:30. Fun times. Too expensive to do often, but it's a nice once in awhile treat.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Tour of 4th Oldest Baseball Stadium", "We took a detour driving from San Jose to San Diego to take a photo of the Angel's Stadium in Anaheim. We arrived minutes before the next baseball tour and the tour guide allowed us to join the group. The tour cost is only $8 for adults/teens and the tour lasted about an hour and a half. We got to see the Gene Autry family suite and take photos in the press room. After Fenway, Wrigley, and Dodger Stadium, Anaheim is the 4th oldest baseball stadium. In the outfield is a rock formation from Disneyland's Thunder Mountain ride donated back when Walt Disney was on the board. The tour guides are very knowledgeable and willing to answer questions.Nice tour for baseball lovers if you happen to be in Anaheim.\nShow less"], ["Reviewed August 4, 2017", 2.0, "Older stadium that hasn't been updated!", "Went recently from out of town to 2 games. This is the 3rd oldest stadium in MLB and looks it. Rigley, Fenway and Dodger stadiums all look far better and are older. A friend of mine and I are touring all MLB stadiums in US and found this very disappointing. It's almost scary when looking for food with exposed (not in the modern way) old pipes and wires.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Great venue; our team lost", "The stadium was very close to our hotel so we could walk. I enjoyed walking around the second level and looking at the wall murals and the Hall of Fame."], ["Reviewed August 2, 2017", 1.0, "Closing party for convention", "This stadium is one of the worst I've been at. Food is terrible! Asked if hot dogs were all beef as that's all we eat. Was told yes. They are not all beef. Cheese for nachos and pretzels was disgusting!! Plus food is super expensive, it should taste good for that price!!\nShow less"], ["Reviewed August 1, 2017", 5.0, "Concert venue", "We attended a concert here and the staff were professional and on their game. Even when there were technical difficulties with the metal detectors, they were Swift to correct the problem so no one had to stand in line longer than necessary."], ["Reviewed July 31, 2017", 5.0, "Fantastic Family Fun", "This park is great for catching a family friendly baseball game. I would, however, investigate the seats you choose. Ours were right field but there was a wall that obstructed any view of most of the outfield. We enjoyed the game, nonetheless, and the fireworks after the game were great!\nShow less"], ["Reviewed July 28, 2017", 5.0, "Great, unique stadium", "We loved this stadium! It was one of the stops on our ballpark tour this summer. The outside is gorgeous, and the field is nice as well. We love MLB games and had a really great time. Our seats were behind home plate on the upper deck which offered an unobstructed view of the game without feeling too far away. Expect typical ballpark concession prices.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Good times at the ballpark!", "Had a great time at a game with hubby who loves his baseball. This park is big on parking ($10 or $20 for closer parking) and quick to exit after the game. Well managed by the staff, the washrooms are clean and accessible and vendors are readily available if you don't want to leave your seat. It ain't cheap tho so bring lots of snacks in if you don't want to pay a bundle. Section 134 is a great (near obstructed view) area to get great long ball outfield views for cheap.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Awesome park", "This really is one of the nicest stadiums. I hadn't been in awhile but got some Diamond Club seats on StubHub. Talk about making you feel like a VIP. But even without this premium seating, this is a clean, safe, family friendly park with very friendly fans\nShow less"], ["Reviewed July 24, 2017", 5.0, "Always a Great Time!", "A friend and I went to a game this past weekend. The stadium is a good blend of the older stadiums and updates to make it more modern and like the newer ones. Tons of parking, good seats regardless of where you are, reasonable prices on food and drinks.\nWill for sure go again.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Kids 1st time", "We had some awesome seats out in right field front row in section 238. Boys were so excited to see the players up close. Both boys did get a ball during batting practice. Food was great and of course expensive but we expect it. Cant wait to bring them back to were i spent alot of my time as a kid and teenager.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Great Ball Park", "First time to this ball park and had a wonderful experience. Very clean and the fans were great. My wife and I are trying to get to as many parks that we can and, this one is one of our fav's."], ["Reviewed July 23, 2017", 4.0, "Solid place to see a game", "You can tell it was built in the 60s, but given the sun and warmth, it's a good place to see a game. Food was fine; beers were expensive but large. Team is mediocre. Parking was plentiful and easy to get in and out of."], ["Reviewed July 23, 2017", 4.0, "Very nice remodel", "Angels did a very nice job remodeling this completely enclosed stadium and making it open in the outfield. Good concession choices and fairly inexpensive parking at $10."], ["Reviewed July 23, 2017", 4.0, "Really enjoyable, an underrated stadium.", "My son and husband and I are visiting all 30 MLB parks. We didn't have high expectations for Angel Stadium, but we were pleasantly surprised. It was really enjoyable. Clean, comfortable, well-designed. The only problem was that we walked from our hotel and there isn't a sidewalk once we got to stadium property. We ended up walking between about eight lanes of traffic both going to the game and leaving. It was quite unsafe.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Great park to visit...located near Disney...prices very reasonable", "We took in an Angels game on a quest to visit all 30 MLB parks; this was our 24th. We thoroughly enjoyed ourselves because we bought great tickets located in the shade on a sunny, hot Sunday afternoon in the Terrace MVP 212 section. The seats were located directly underneath a section above, which shielded the sun but allowed us to see the entire field, even high pop ups.\n\nThe overall impression of Angels Field is that its in the lower third...not near the bottom...but definately not one of the MLB's best. Parking was extremely easy and cost only $10, which is remarkable given the fact we live in Boston where it would have cost $30 to $40. Ticket itself was relatively cheap as compared to Fenway or NY. Food offerings were just ok...not great. And although there were games and attractions located around the field, there are not as many as some newer parks offer. The facility is extremely clean, well cared for, and beautiful. However, it doesn't come close to Camden Yards (which was the first back in '92) or others.\n\nThe game itself was fun to watch. So overall, we were very glad to have visited the stadium, thoroughly enjoyed ourselves, but don't give the ballpark as compared to hother high marks.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Group trip", "We were a group of 30 high school students and chaperones and we had a great time. I had called up the group department about 3 weeks before our trip and was able to get group rates. We all had a good time"], ["Reviewed July 19, 2017", 5.0, "Perfect", "Just back from a watching a game . If you are visiting Southern California , try and make a game . I took my family and everyone enjoyed it although I am not sure we all fully understood what was going on !"], ["Reviewed July 19, 2017", 5.0, "Great Team in an old park", "LOVE the Angels - its a traditional park without the fancy, but a ton of fun. Spring for decent seats - particularly day games as it will be super hot in the sun. There are several great spots if you spring for really good seats such as the diamond club level, or my favorite, the Ketle One Suites and seats (comes with a rock star buffet and an amazing view of the field). The cheaper seats are still fun. ask at the gate if there are any upgrade specials that day\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great piece of American culture", "As overseas visitors we decided we wanted to experience part of American culture by means of a baseball game. We were in Anaheim anyway so we decided to book tickets to the Angel's. It's a great experience, what I really like is how everybody is so full of spirit and there's not animosity at all (what a difference with European soccer matches). The game baseball at sometimes is a little slow, but it's a great experience. Only the food part did not appear so nice, looked all very greasy and sometimes the smell of the food was also not very nice, we did not eat at the stadium as such. We selected level 5 seats (they were the best in price, still very good view) behind the pitching area. We were very happy with these seats, no sunshine in your eyes and a great view.\nShow less"], ["Reviewed July 18, 2017", 4.0, "Great park", "One of the more modern stadiums in the league. Sight lines are great and parking is inexpensive (10.00) and close to the stadium. Good food options and souvenir stores."], ["Reviewed July 18, 2017", 5.0, "First time visit and it was the best!!!", "I've been to a lot of Stadiums, this one is probably the best. I highly recommend you go on fireworks night, they put Disneyland fireworks to shame. Prices on food is a lot higher than most other stadiums. $17 dollars for nachos is a bit ridiculous to me. But overall It was a great experience and I hope there's a game next time I go to California.\nShow less"], ["Reviewed July 15, 2017", 4.0, "Fun experience", "Being in town for the Freeway Series was a fun experience at the park. I was not overly impressed with the park itself. It seemed to be lacking in character compared to other parks I've visited. Still, the food was good and the game atmosphere was fantastic.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Angels Game", "Great place to enjoy baseball!! The ticket price are good the parking price is only 10.00 dollars a steal for California prices and the atmosphere is awesome!!!"], ["Reviewed July 9, 2017", 4.0, "Good fun! But Expensive..", "Personally I don't really like baseball, but the atmosphere, the people watching and the overall experience is really fun and makes it worth a visit. The food is excellent (hot dogs are yummo!), and there are lots of drinks available (including cocktails for people that don't like beer). The only negative is that it is quite expensive for food and drink (but that's to be expected for all sporting games).\n\nThere is heaps of paid parking nearby if you have a car. We were told there is a big walk from the parking to the stadium, so we were a bit worried. But we honestly didn't find it too much of an issue at all (only a 5 minute walk or so).\n\nBathrooms are clean, and close by wherever you are sitting, and overall it's very clean and the staff are very friendly. Would definitely recommend (regardless of whether or not like you like baseball!).\nShow less"], ["Reviewed July 8, 2017", 5.0, "My favorite place to be", "I love the Angels. The only way I know to truly appreciate then is to go to an Angel game. The stadium is fairly nice given how old it is. There are very few bad spots to sit in. The food changes from year to year but you'll always have your hotdogs, nachos, and peanuts.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Angel Dog, beer, and a ballgame", "We checked out the Angels baseball game against the Seattle mariners last Sunday. Sunday matinee games are cool as the kids can run the bases at the end of the game. Very easy to get to the stadium, and parking was simple. Ballpark was clean and the staff was friendly. Prices were expensive but I fully expected that. Overall, nice place to watch a ballgame\nShow less"], ["Reviewed July 6, 2017", 4.0, "Awesome amenities- Meh ballpark", "The inside amenities of Angels Stadium have probably been the best of all the ballparks my wife and I have been to so far. The had the cleans stores and eateries. The biggest downfall was the ballpark itself. Nothing distinguished it from the rest of the pack. The fans weren't really into the game even though it was the freeway series. The dodger fans drowned out the angels fans at every moment of the game. The best part was the outside if the stadium. The giant hats and the baseball bats crossing over the entrance was awesome.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Angels Baseball Game and Metrolink Train", "First experience on MetroLink Train to attend first Angels Baseball game. Travel from Expo Line via 7th Metro Station via Union Station to board the Angel Express to attend their special law enforcement game. We received a beautiful red/white/blue cowboy hat.also for the July 4th. The crowd looked so great. We allowed enough time to arrive at Union Station and arrive early to the ballpark. Very nice ballpark and the variety of foods were excellent. It was a long day traveling from Los Angeles to Anaheim via the train but the experience was great if you like riding the train. Lots of passengers going and returning. The last train leaves 30 minutes after the game is over. We sit on the first base side and seat location V427. As a senior, you get a discounted fair also. Enjoy the train and the ballgame.\nShow less"], ["Reviewed July 3, 2017", 5.0, "A great way to spend the afternoon!", "Awesome parking, awesome team, awesome freebies, awesome time! I went with my fiance to see the baseball game, the parking was very easy and we had a great time. If you don't want to spend a lot, and depending on what game it is... just get tickets to higher seats and move down to lower seats if there are open sections.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Christmas in June", "Went like always to the Christmas in June event the Angels hold. Once again in was great fun. The people are great at this ballpark unlike Dodger Stadium. There is no ugly fan stupidity here. Root for the other team there is no fan violence. Everyone is there to enjoy the game. We saw Santa and had a great time. This is baseball the WAY ITS MEANT TO BE. Best ballpark in Southern California by far..\nShow less"], ["Reviewed July 2, 2017", 4.0, "Good Job Anaheim", "We busted up to Anaheim for a Dodger game with the rival Angels. Now I don't think of Anaheim as a great baseball stadium, and I've been to most. But it isn't terrible. The traffic folks in the stadium and police outside the park get masses in and out better than I would have thought. Five dot all the way! It was a sellout. And parking was $10! Many parks charge at least twice that. The fans are good and it's an easy place to have a great time watching a game.\nShow less"], ["Reviewed July 1, 2017", 3.0, "Always love going to a game, but his place has no personality", "I have been here many times over the last 30 plus years, and as a baseball fan, I always love going to a game. However, when I am paying $175 face for a ticket and thus $350 for my wife and I to walk in to the stadium, I just expect a bit more. I get the concept of a hot dog and a beer at a game, but if that is the genre, I should be paying more like $30 a ticket. My wife had a Tuna Poke Bowl, which was certainly a step-up from the old days, but when people are paying $350 to walk in, they need a place to sit and eat---that is pleasant. I have never quite understood the waterfall in the outfield--I think it is a Disney holdover. I have traveled the country going to various stadiums---this place has amazing weather, and if you can ever get invited, the seats at dugout level are over the moon. High priced seats without access to the sitting dining area are just not worth it---way overpriced.\nShow less"], ["Reviewed June 30, 2017", 5.0, "Diamond Club is Awesome", "I got free tickets from work in the Diamond Club, which are Field Level seats right behind home plate. They came with premium parking, which is insanely close, and waiter service at your seats. It was an amazing experience.\n\nThe stadium is beautiful and clean. The staff I dealt with were very friendly. And the weather is usually great for sitting out in the evening. It's really a wonderful place to watch a game.\nShow less"], ["Reviewed June 30, 2017", 4.0, "Very nice", "Nice stadium that was 2 miles from our hotel. Nothing to do around the area before the game but an expensive brew pub. Seen a nice close game with the Dodgers that was a full house with tons of energy. $75/ ticket on upper level seats, yikes. Cheapest beer was a bud light for 10 bucks, poor guys are hardly making a profit. I didnt see any unique food offerings but might have been where we were sitting. It.was easy to get in and out of and the view was excellent.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Really great stadium!", "My husband and I were recently in Anaheim to visit Disneyworld and decided to catch a ball game. We are originally from Baltimore and were missing the Orioles, so it was awesome to be able to get a ticket to the Angels game for $10! Although we were in the upper tier, the view was great and we could easily see all of the action. As well, the stadium was easy to get in and out of and was within (safe) walking distance from our hotel. I was very impressed with the stadium and had a great time!\nShow less"], ["Reviewed June 24, 2017", 4.0, "Baseball Game", "We had a free day so decided to go to a baseball game. The stadium is very good and clean. We were seated really close to the field but it was very hot as there was no shade. Food was very expensive but you have to experience the whole package when you do these things. There is so much choice and you find it is just as busy under the stands as in them. The place was just buzzing and had a great atmosphere.\nShow less"], ["Reviewed June 24, 2017", 5.0, "Nice ballpark", "Were in town as part of a baseball park tour. Easy to get to if you're driving yourself, not sure about public transport. Good food and beverages, including some veggie options. However, some of the concessions weren't open until after the game started, and some didn't open at all. Easy to navigate inside the stadium, comfortable seats.\nShow less"], ["Reviewed June 24, 2017", 4.0, "GOOD TIME WAS HAD BY ALL", "We went down to meet friends and take in a couple of Yankee games and we had a very nice time. We stayed near the stadium, so did not have to drive. Appeared to be plenty of parking available. Vendors and security were all very personable as were the ushers. Good selection of food vendors. Crowd was very polite although there was no fight several sections but it was taken care of quickly. Very nice stadium to catch a game.\nShow less"], ["Reviewed June 22, 2017", 4.0, "Angels v. Yankees!", "If you're in LA and you're a baseball fan, definitely make the trip to Anaheim. It's a 45 minute train ride from Union Station, and the rail line offers special pricing ($7 round trip) from Union Station to the station in Anaheim that stops in the parking lot of the stadium. The stadium itself is nicely maintained (even though it's on the older side of things) and everyone was super friendly. They have some food options I haven't seen at other parks (I've made it to 5 over the last year, one being Dodgers Stadium in LA) such as a BBQ Stand (The hotdog covered in BBQ brisket is amaze-balls) and a nachos stand (sponsored by Tostitos). We had some really great seats (Sect. 125, row W) right on the first base line. I'm more of a fan of sitting behind home plate, but these seats were awesome. The only downside to the stadium was that the concourse is a little on the small side. They've made upgrades to improve the stadium itself and what they can offer, but definitely lost some real estate for foot traffic. They did make up for it though by offering an outdoor seating area to be able to eat your snacks. It's super nicely done and spacious.\nShow less"], ["Reviewed June 22, 2017", 5.0, "Always a Good Time", "1st class venue for Angel games and concerts. The area is safe and beautiful. We live on the same property as the stadium and have for years. There are a lot of great places for pre party games and after party games. You can tailgate! The seats are cozy and the walk around is filled with different and fun places to visit. I'd try the BBQ or nacho helmet; my fav is the tri-tip grilled cheese & Carmel corn. Love to get the seats where they have servers. Always go on giveaway games. Fun freebies! Great offerings for kids. Go Angels!\nShow less"], ["Reviewed June 22, 2017", 4.0, "Angels Vs Royals", "On our California Baseball Park Tour of all 5 in 12 days -\nWhile this is an older park from an era most have already demolished, the Angels have truly made this a home. The prices are less than the Dodgers and the fans are amazing. Did not expect this sort of enthusiasm (we are partial to the National League and find most AL games much more subdued). Everyone wears red and is into every pitch. This is not a corporate setting. They also included fireworks night and a free showing of Elf (it was Christmas in June night)...\n\nParking is easy and so is Uber.\n\nOne thing they do need to do is upgrade and enlarge the outfield video screens. This is where the park shows its age. The technology seems low res and small. Especially right field which was hit by the setting sun shine and very hard to read.\n\nStill don't understand the whole Los Angeles part of their name. The team should be proud to call Anaheim home. Even better a return to the California Angels of Anaheim would make more sense to us. Own the city and the state at the same time and leave LA to the Dodgers.\nWe left as Angels fans and they won!\nShow less"], ["Reviewed June 21, 2017", 5.0, "Had a blast", "The stadium is beautiful. Very spacious and clean. The stadium staff were kind and very helpful. Great family friendly activity."], ["Reviewed June 21, 2017", 5.0, "Wonderful California style stadium", "From the big A that can be seen from afar to the calming and relaxing interior of the stadium, you can hardly tell this facility is as old as it is.\nEasy access to all levels of the stadium as its versatility to host sporting and non-sporting events is outstanding.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Fun, inexpensive diversion to round out a trip", "If you're not from the States, you should catch a major league baseball game if you can, to experience some classic Americana.\n\nYou can get very inexpensive tickets, from $6-$55, so great for the whole family. It's easy to get to and cheap by Uber if you're staying in the Disney area (approx $8). They even have a convenient Uber waiting area after the event.\n\nThe arena is a clean modern facility that's easy to navigate. The food selection is excellent (at least compared to Canadian NHL arenas), but it is overpriced; though most stadium food is. The best bang for your $ is the \"Legend Dog\" at the Smoke Ring. It is a jumbo juicy hot dog topped with a generous amount of chopped brisket. The garlic fries sound great but don't waste you're $.\n\nA nice way to cool off and spend an evening. I recommend paying a little extra for the shaded seats.\nShow less"], ["Reviewed June 17, 2017", 3.0, "Old but good", "While in town for work I stopped for a ballgame. In an age where a 25 year old stadium is old, Angel Stadium shows it's age. This never distracted from the play but it didn't add to it. Sure the nostalgia is there but not like the famous old ballparks.\nShow less"], ["Reviewed June 17, 2017", 4.0, "Nice stadium but nothing around!", "It was my first visit at this stadium and it was for an Angel's game. This building is old but still in very good condition. We had a very nice baseball night. Everything inside the stadium was perfect. The seats are a little tight for 2 big guys sitting next to each other but it is the same in most stadium or arena. The only down side is that there is nothing around the stadium. No restaurant or bar. I'll be back for another game soon!\nShow less"], ["Reviewed June 13, 2017", 5.0, "Fun Times...", "Angle Stadium is such a awesome stadium. The minute you walk in you get caught up in the excitement. It's a great place to take the family and watch a ball game. Go Angles!!!"], ["Reviewed June 6, 2017", 4.0, "night at the ballpark", "was in Anaheim for a few nights and made last minute plans to take a in a ball game , it was on memorial day and although they lost they had a great firework display after the game , good night out even if you aren't the biggest baseball fan\nShow less"], ["Reviewed June 5, 2017", 4.0, "Better Than Expected!!", "Being one of the lowest ranked stadiums in the nation I was surprised how nice it actually was. Being an older stadium it doesn't have the open corridors like the newer stadiums, but the field was nice and it had a great choice of craft beersl!!!\nShow less"], ["Reviewed June 5, 2017", 5.0, "Awesome stadium", "We got tickets to watch the Angels play and from the moment we walked in we got caught up in the excitement with free bubbleheads of the popular player to big beers and hot dogs. Staff were very friendly and helpful with we're we needed to be. Great place to visit\nOh and it gets cold in here so rug up\nShow less"], ["Reviewed June 3, 2017", 5.0, "Wow!", "The Big A was much better than expected for an older park. I've been to marlins stadium, comerica park, the trop, and petco and this park has its own feel.\n\nWent on a rally monkey night! The park was half full but the in game experiences was good and stadium experience was great!\nShow less"], ["Reviewed June 1, 2017", 4.0, "Getaway", "Very nice ballpark. Friendly staff. Good food selections. Great fans. Would definitely go back for another game."], ["Reviewed May 31, 2017", 3.0, "Worth a Visit", ".........but a little dated at this point. We enjoyed our time here, but found the sight lines lacking and the common areas tight. Still an excellent evening out. Maybe it really is about the baseball (and not the facility)."], ["Reviewed May 31, 2017", 5.0, "Suite was Sweet", "We were invited to an Angel game on Memorial Day by new friends. I was impressed with how friendly the staff was and how quickly and thoroughly they checked us in through security. Very nice, not rushing us, but professional, which was reassuring. We were fortunate to be inviting to a Suite on the fourth floor which was amazing!!! The food was above average and of course the seats were great!!! Our private wait staff was pleasant, always had a smile, and she did a super job!!! This is our first and probably last time to watch a game from a suite, and it was a wonderful evening even though the Angels lost :-( The Firework show after the game was fabulous!!!!! A special night to remember. Go Angels!!!\nShow less"], ["Reviewed May 31, 2017", 4.0, "Good Ballpark", "I have.been to 17 of the 30 major league ballparks and give this one an 8/10. PNC and AT&T get the only 10s. One entire point added because you get to see Mike Trout play here. Food selections are better this year and a lot of specialty beer and wine available. Prices are average for MLB and it is a safe place to see a game.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Cozy ballpark", "Intimate setting, the layout means almost everyone has a good seat. The usual variety of concessions with a SoCal touch they also have a local brewery outlet serving up suds as well as better known favorites. Parking is very convenient and it's less than 3 miles from the convention center where we were having a meeting.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Angels Baseball and more!", "Great place to visit. Love the Angels Games. A large variety of food and shopping. Is also used for concerts and other Entertainment venues. Nice facility, plenty of parking etc."], ["Reviewed May 23, 2017", 4.0, "LA Angles vs white sox", "Such a great place. All the staff were very friendly and helpful. Parking was very close to the stadium. The LA Angles really know how to keep you entertained from the first ball to the last."], ["Reviewed May 22, 2017", 5.0, "First baseball game", "Was an amazing experience, the merchandise shops are at another level, anything and everything you can buy to support the home team! Was stoked that you could buy frozen cocktails as don't drink wine or beer. Great atmosphere also."], ["Reviewed May 22, 2017", 5.0, "Angels in the Outfield", "Loved this Stadium. I got there early and asked one of the attendants where theist food was. He sent me to the BBQ stand - one outside the lower level and one on the second level. Might have been one of the priciest choices, but a great pulled pork sandwich.\n\nAlso of note id the clarity of the lighting for night games. Awesome,\n\nShow less"], ["Reviewed May 19, 2017", 5.0, "Organized stadium", "Clean safe and organized. Good box seats with televisions. Fun adventures always. Gang urinals kinda outdated. 3 away joints to handle eartquakes."], ["Reviewed May 19, 2017", 4.0, "Cheap tickets, friendly staff but expensive food", "I came to Angel Stadium to watch a Angels game mid week in May and overall I was impressed, the tickets were cheap and there was a laid back atmosphere. The downside is the food and drinks prices were extortionate so it's probably best to eat before.\nShow less"], ["Reviewed May 17, 2017", 5.0, "A field Trip with California Academy School", "It had been a while since I'd been to a game, and it was great. We went with a group for my daughter's school. The parking was right there within walking distance to the entrance and ticket pick up. There were no lines that we had to wait in. All of the staff were friendly and very helpful. We ate there as they have several places in the inside corridors to choose from at reasonable prices, so of course, we purchased hot dogs with fries and a drink. They have sections where you can purchase alcohol and beer as well, and nice tables and areas specifically for drinking and smoking in designated areas if that's what you like, where there is a gathering of people you can chat with while enjoying the sunshine and the game at the same time. Overall, we had a great time. The only thing I thought was kind of strange is when the game is going on, there is no announcements being made. They announce the names of the hitters as they come up to bat, but that's it. Where I'm used to hearing the announcements of each play, (i.e.- hit a double, or that was a fly ball, etc), so it seemed a little quiet and think it would make it a bit more exciting if they would make the announcements. I'm not quite sure why they didn't unless it has to do with cutting costs and maybe they used a \"pre-recording\" of the batters coming up to bat and had no announcer there. It was also a day game, so that could've been the reason, I'm not sure. It was a great day and we had fun.\nShow less"], ["Reviewed May 17, 2017", 4.0, "Great Stadium", "Since I moved to Vegas I have made 4 trips to this ballpark. The seating is very good with good leg room and good observation. We were five rows back from the dugout which made the tickets price but, since this is every three year trip we wanted to have good seats. There are plenty of food option around the lower and upper deck the only draw back and I expected it is the 7.oo lemonade and the 14.00 beer. Food at the park is on the high side and priced to tip the sellers.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Always a fun time!", "The stadium is very well maintained. There are lots of different food choices. And the workers there definitely love their jobs! It's a great place to catch a game. Go Angels!"], ["Reviewed May 17, 2017", 3.0, "Catch a game if you can.", "Location is great, but I dont like the stadium compared to some of the newer ones in baseball. Lots of wasted space, and some outfield seats even have obstacles blocking your sight lines."], ["Reviewed May 15, 2017", 5.0, "family vacation", "It's always great to go to Angels Stadium. My family and I had a great time. I hope to go back soon."], ["Reviewed May 15, 2017", 5.0, "Beautiful Ballpark", "Beautiful Ballpark. Had a great time watching the Angels play the Houston Astros. This was my first time to Angels Stadium. Had some great seats for around $26 each."], ["Reviewed May 14, 2017", 5.0, "Sponsored a group of high school seniors", "What a great time! We took 25 high school seniors to a game in April. We sat in the Trout section and had so much fun."], ["Reviewed May 7, 2017", 5.0, "Baseball a must if your there at the right time of year", "Went to an Angels game mid week, atmosphere was fantastic, seating purchased from 714 Tickets was almost on the fence for twenty bucks each. Food options were plentiful but you really have to have a hot dog and a beer if you're at the baseball.\n\nParking is easy, lots of staff to direct you. General facilities were very good and cleaner than most sporting grounds in Australia.\nShow less"], ["Reviewed May 4, 2017", 3.0, "Another Ballpark", "So this place is no better than the Oakland A stadium. Its old but they do keep it clean. I was in the upper deck and you have no leg room, its very steep and if you have bad knees forget it Would not go back very uncomfortable.\nShow less"], ["Reviewed May 3, 2017", 5.0, "Great fun night out", "We were travelling throughout California in April and got Angel's tickets. We got to the venue by Uber, and went and found our seats.\nThe view to the pitch was really good, and the big screens were also easy to read.\nIt was a really good game which went to 11 innings, with the Angel's winning, so well worth the visit.\nWe got 4 coke zero's and a bag of peanuts, and a hot dog which was about $30US, so not that bad for venue prices.\nUber back home was also easy to locate.\nWould go again if we visited.\nShow less"], ["Reviewed May 3, 2017", 5.0, "MLB Paradise", "What a fantastic stadium! Great atmosphere and easy to get to. Excellent viewing from any angle and place within the stadium. A good variety of supporters gear available for purchase. Good food although the beverages are a little pricey! Worth a look if you want to experience MLB in the city of angels.\nShow less"], ["Reviewed May 2, 2017", 4.0, "Caught 4 Jays games", "The Jays split the series, great fans with a few loud mouths guess every park has them. bring your own water and peanuts as eating and drinking at the park eats your money fast."], ["Reviewed May 1, 2017", 4.0, "Cheap seats are great", "Took my son, 13, to his first baseball game, I purchased the tickets online, from NZ, and took a risk, we paid about 25 US and were sitting very high and just to the left of the umpire, what a great view, you see everything, the big screen is right in front of you and it was just a wonderful evening. It is a great stadium with good food, not cheap, but ok\nShow less"], ["Reviewed April 30, 2017", 4.0, "Always fun", "Other than $14 beers, its always fun to come to the stadium..... easy parking outside the the main parking lot makes it a breeze to get on the road after the game, and what's not to like about an evening at the ballpark!"], ["Reviewed April 28, 2017", 5.0, "Great stadium", "I went here in 2012 with my family and I must say that this is one of the best ballparks I've been to. I really liked the big baseball hats outside the park. This ballpark has a great layout and I can't recommend this place enough. If you're planning to visit Anaheim I would recommend going to a game here.\nShow less"], ["Reviewed April 26, 2017", 4.0, "A fantastic night", "We hadn't planned to visit but really enjoyed the experience. Booking seats was easy online. A baseball match is a must do when you visit Anaheim."], ["Reviewed April 26, 2017", 5.0, "Baseball was a highlight of our trip", "Very cool stadium, we went and watched a night time game and they had a massive fireworks display after the game followed but a movie on their big screen.\nThe food has something for everyone with lots of choices along with the drinks although you do need ID to buy beer even at our ages of 45, but I loved the game and atmosphere at the stadium so much we when back to watch another game, buy your tickets online and the start from around $10 up to $300 depending on where you want to sit...\nShow less"], ["Reviewed April 25, 2017", 5.0, "Baseball fun!!", "Our group had a great time at the Angels game. Not a bad seat in the house! The facilities are clean and well taken care of."], ["Reviewed April 24, 2017", 5.0, "Great Night Out", "We went to see the Angels play the Blue Jays in an evening game. A great venue to watch baseball and have a hotdog.\n\nTickets started at $10 or $15 each, and we paid $24. But all the seats are probably fine to take in the spectacle.\n\nEven the kids (6 and 8) lasted until the bottom of the 5th innings before getting too restless. After all even when we left only three runs had been scored.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Great Game...even better Food! Grilled Cheese Short Rib Sandwich!!!", "Went to my first Angels baseball game this past Saturday...the game started at 6pm so we decided to eat at the stadium. Many food choices...after walking around for awhile and not finding anything appealing to eat we saw the yellow sign for \"The Big Cheese\". They had several different types of grilled cheese sandwiches: Short Rib, veggie, regular and more. I ordered the Grilled Cheese Short Rib Sandwich. The meat was cooked to perfection and combine that with the melted cheese and this sandwich is a must have for any sports fan going to the Angel Stadium.\nShow less"], ["Reviewed April 24, 2017", 5.0, "First Anaheim Angels Game", "I enjoy seeing new baseball stadium's each year, and Angels stadium was on the list of parks I wanted to visit in 2017.\n\nIt's a great stadium, the people are very friendly, and the crowd really gets into the game, which for me, makes it a lot of fun.\n\nThe team store was cool, I think it had a great selection of Angels gear. There is a really great place called the Art Of The Game. It is located in section 113, and you can pick up a game used baseball from the game you attend for as low as $20 (some game used baseball are higher because of the player who hit a single, double, etc. A Pujols baseball from a single sells for $300).\n\nThe food selection was good, but the beer selection is one of the best I have seen at any stadium I have visited.\n\nIf you are a baseball fan, this place is worth checking out. One tip I recommend is to get seats in the 200 section for any games where the weather is warm (I did that for a game I attended with my friend and we were in the shade)\nShow less"], ["Reviewed April 22, 2017", 5.0, "Nice Park", "Had opportunity to check out ball park on trip to Anaheim. It is an exciting place on a Friday night.\nGot to see a good game and a wacky promotion. They got the Guinness World record for number of people wearing capes. Kids of all ages had a wonderful time.\n\nConcession and ticket prices not bad. Was an enjoyable evening.\nShow less"], ["Reviewed April 19, 2017", 4.0, "Very Cool", "An awesome experience for adults and kids I'd say over 5. My little guy got very bored but my husband and I loved it. Great atmosphere"], ["Reviewed April 19, 2017", 4.0, "our first time", "we were out to visit the mouse and the kids have never been to a big league game so we looked into tickets. We have the Angels AAA team at home (the Bees) so wanted to see their big brother. Found great tickets at field level for a great price. Rangers beat them pretty bad that day, so that part wasn't so great, but the stadium was really nice and we enjoyed the experience.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Great day out", "We had a great day here last Thursday. Finally I got to see a baseball game in America. Fans helped us with the rules. My wife felt flattered she had to show Id to buy alcohol. At 58 that doesn't happen so much these days. Only down side was the Angeles lost 8-3 to Texas\nShow less"], ["Reviewed April 17, 2017", 5.0, "Girls night out", "I love coming to Angel Stadium for a game when I'm in town. Everyone is so friendly and I love the different sections for different age groups. There's adult hangout areas which is nice, but there's also family fun as well. And I like there's a lot of beer selections around the whole stadium.\nShow less"], ["Reviewed April 14, 2017", 5.0, "Great Stadium!", "We bought tickets when we arrived at the game because we were coming from out of town, and didn't know if we would make it. The lines were so long as it was opening weekend. However, the lines moved quickly, and we were inside the park in no time at all. Great place to take the family!\nShow less"], ["Reviewed April 13, 2017", 5.0, "always a great time, GO ANGELS!", "First, parking is easy! I've been to other ballparks and nothing is easier that sat the Big A. Next, getting in to the stadium is easy, it's always clean, and the people are nice. The food is expensive and lines can be long, but it's do-able.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Fireworks are very worth it", "Went on fireworks night and it was a little chilly, but are so glad we stayed to watch the fireworks. What an awesome show. The nice thing about baseball is that you don't have to \"break the bank\" to attend. We had excellent $20 seats. Having Mike Trout hit a two run homer to win the game makes for a perfect time.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Let's Go Angels", "I'm a little bias because I love the Angels but I love this park! I have been to a bunch of baseball stadiums but this is my favorite, simply because its the Angels. The park is old but has been remodeled nicely and it is very clean.\nI hate the sun so during day games get seats in 200 section which is the first base side under the overhang. The sun will be to your back and you will be in 100% shade which is great for me and you won't fry in the CA summer sun. Night games you can sit just about anywhere and have a good seat. Center/right field seats are hard to get because they are best and everyone wants to be close to Mike Trout in centerfield.\nA must is a nacho mama served in an Angels helmet.\nGreat place to catch a game.\nShow less"], ["Reviewed April 11, 2017", 4.0, "my bartender job", "Is a nice family place to go s see a baseball game m from January to February for 6 weeks we have monster trucks n motocross, home n garden shows. very clean n we all are friendly, good food s right next to train station\nand Honda center and Honda employee park here and sometimes convention center n Disneyland employees park here to. during baseball season I do bartender here for Angels and when season is over I do bartender at Honda Center for Anaheim Ducks is another nice place I recommend to visit,\nShow less"], ["Reviewed April 11, 2017", 4.0, "Great place for a game, but bring sunscreen for sure.", "We traveled to see our hometown star, Mike Trout play. My wife even got his attention with her sign mentioning Millville, NJ."], ["Reviewed April 11, 2017", 4.0, "Take the Angels Express Train BUT", "The Angels Express Amtrak train to/from the Stadium from/to Union Station in Los Angeles only cost $7 \"all in\", making the trip from Los Angeles easy sightseeing and inexpensive. The walk in to the ball park is a bit of a hike. The biggest issue is making sure you are getting on the train going in the Los Angeles direction on the way back. At night one can become confused as the ingress/egress paths to the Amtrak train twist and turn.\n\nThe ballpark itself is clean and well maintained, with all the bells and whistles of a modern stadium. Food prices are high, and waiting lines long. Buy good seats and enjoy the game!\nShow less"], ["Reviewed April 11, 2017", 5.0, "Fun for a spring game", "Great to visit for a spring game since summer games can get very hot. Make sure to get a seat in the shade since it can be a harsh sitting in the sun for the entire game. If you end up in the sun leave your seat and hang out at the bud bar.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Professional Baseball need i say more", "Angels, monster trucks, Honda center employee park here too. Very clean, upscaled stadium. I love it when the money gets put back into is location."], ["Reviewed April 9, 2017", 5.0, "Early Fathers Day Gift", "Fantastic evening with our daughter. Grand stadium. Angels beat the Dodgers. Great value. Loved that the ushers were retired women & men. Big smiles from everyone."], ["Reviewed April 8, 2017", 5.0, "Family trip to Angels Stadium", "Well my relations in LA recommended this stadium for our first trip to a baseball match, they said more family friendly than Dogers stadium.\nWell was not disappointed lovely area and clean stadium and great atmosphere at the Friday night match great first visit to the baseball game, kids liked it as well\nShow less"], ["Reviewed April 6, 2017", 5.0, "Better than Dodgers", "Everyone in LA seems to love the Dodgers, and don't get me wrong, if I'm rooting for a west coast team, it would probably be the Dodgers! But, Angel Stadium is not a stadium to be passed up if you are hitting up baseball games in the area. Beautiful park all around and park number six for us.\n\nWalking up to the park, they have two gigantic Era hats, both providing shade and actual measurements of the hats. Even if you have a big head, you will most definitely be able to fit under these hats! Staff at the park was super nice and friendly. Tickets seems to be on the cheaper side, but food and beer will run you \"normal\" ball park prices.\n\nWhile the stadium is one of the older stadiums, it is still a beautiful stadium, with a waterfall in centerfield. West coaster also LOVE the wave, so be prepared to stand up like ten times in a row. And don't forget about the rally monkey! The little movie bits they put up with the rally monkey? Loved those!\n\nWe went on memorial day, the usual giant flag being spread out on the field before the game. After the game, the Angels had fireworks. That was really awesome. ALL the lights turned off, completely dark stadium, an experience in itself. But then the field lit up by a really awesome display of fireworks? incredible!\n\nWould love to come back here! If you know the weather is going to be on the chillier side, definitely bring some warm clothes. It felt much colder than 65 degrees when we went.\nShow less"], ["Reviewed April 1, 2017", 5.0, "Angel Dodger Freeway Series", "What a great way to spend a Friday night with friends. We all took the Angels train in from Corona. A group of 9 people didn't have to fight the crowds. We walked through the parking lot to Gate 8 and took the elevator for the first time at the stadium to our seats in level 4 section 409. We had a good view of the game and a good time was had by all.\nShow less"], ["Reviewed March 31, 2017", 5.0, "For a old stadium , it's great !!!", "Caught the Freeway Series game with the Dodgers. I must say every staff and users was very nice and polite and ready to help. Our first time and boy do I wish every stadium looked this good and had great staff. A must see when in Anaheim !!\nShow less"], ["Reviewed March 15, 2017", 5.0, "Great stadium to visit for first timers", "Our first time to actually visit the stadium - very nice. Off season, no crowd to deal with. Had a great time taking pictures esp at the home plate area. Surprised that team memorabilia store is having 1/2 price sale. Hurry."], ["Reviewed March 14, 2017", 5.0, "First Time to Baseball.", "Had a fantastic evening at the Baseball. Was our first time ever at a baseball match & it was a great night, I would highly recommend this as a fun night out for the whole family to enjoy."], ["Reviewed March 14, 2017", 4.0, "Great stadium-only saw from outside", "We stayed close to stadium so we went to see stadium. It wasn't open, but we went around. Big parking lots next to stadium, right of hiway. They had monster cars event next day, so gate was open and were able to see inside. Big stadium.\nShow less"], ["Reviewed March 4, 2017", 5.0, "Amazing time, beautiful stadium, wonderful workers!", "We went and saw Anaheim Angels vs Seattle Mariners in September 2016. AMAZING day. The stadium is very nice, everyone working there was surprisingly friendly. There were a few sales-y people trying to sell us a timeshare (lol, do we look like we have money?!) which you don't see at too many baseball stadiums, but it was fine and they took our no thank you. Beautiful evening! Would go back!\nShow less"], ["Reviewed March 1, 2017", 4.0, "Bring the family!", "Too many venues are having problems with ugly fans. Not the case here! Bring your family for a good game of baseball, hot dogs, and fun. I always feel comfortable/safe at Angel Stadium. Good food and great staff. I only wish the Angels would bring the rally monkey back!\nShow less"], ["Reviewed February 25, 2017", 4.0, "Massive", "Massive stadium, very good upkeep .. clean. We were staying close by and chose to visit the stadium. There is a san diego brewery right across which was good and we had parked there and walked to the stadium."], ["Reviewed February 23, 2017", 5.0, "Monster jam show", "I m from Indiana and was at the stadium with the monster jam show. Very nice stadium, large arena with lots of close facilities, food concessions and great security. Great venue"], ["Reviewed February 8, 2017", 5.0, "Baseball in Anaheim", "One of the cleanest and best Baseball stadiums I have ever been too. Love the Angeles. They have many give away games, and on Friday nights if you sit in Trout area, the children get a free Trout hat."], ["Reviewed February 7, 2017", 3.0, "Eat at the bar", "Bartender was very entertaining, wine was good. Burgers were huge and sharable. Went twice in 5 days. Good overall value."], ["Reviewed January 28, 2017", 5.0, "Great place", "We went to Super cross 2017. It was my first time there and I think it was an amazing place. Here in Chile we don't have baseball stadiums. Super cross was a spectacular show. I can imagine that it must be awesome enjoy a baseball game!\nShow less"], ["Reviewed January 19, 2017", 5.0, "Family fun", "Well-maintained stadium with a good variety of food vendors and souvenirs. Field is immaculate. Fireworks Fridays are great - they put on a really good fireworks show."], ["Reviewed January 16, 2017", 5.0, "Best team in town.", "If your are looking to watch a baseball game no matter what team you are rooting for Angel stadium is a good place to go. The crowd is not routy and the angels usually put on a good show."], ["Reviewed January 14, 2017", 5.0, "One of my favorite stadiums.", "Easy to get to off the highway and you can see the fireworks at Disneyland from the stadium. I made the mistake or purchasing parking online and parked at a hotel that was quite a walk away. Since the game was not sold • One of my favorite stadiums. Easy to get to off the highway and you can see the fireworks at Disneyland from the stadium. I made the mistake or purchasing parking online and parked at a hotel that was quite a walk away. Since the game was not sold out, it would have been SOOO much easier just paying a little more and parking on the stadium grounds. Once inside the stadium, the outfield view is so beautiful. There are several food options. My favorite was the Hot dog with Brisket on it….definitely a heart attack maker, but it tasted great. I also purchased the Garlic fries, and they too were VERY yummy. Overall, it was a great stop, and I would definitely go back the next time I am in the area. out, it would have been SOOO much easier just paying a little more and parking on the stadium grounds. Once inside the stadium, the outfield view is so beautiful. There are several food options. My favorite was the Hot dog with Brisket on it….definitely a heart attack maker, but it tasted great. I also purchased the Garlic fries, and they too were VERY yummy. Overall, it was a great stop, and I would definitely go back the next time I am in the area.\nShow less"], ["Reviewed January 11, 2017", 4.0, "Amazing atmosphere!", "Such a huge venue plenty of restrooms and lots of food! Great atmosphere, parking was a little steep at $20 but at least we were not too much of a walk from the stadium"], ["Reviewed January 4, 2017", 4.0, "Nice stadium", "We visited a day game and it was a hot one! The park has plenty of vendors to choose from, they had activities for the little ones. Also if you forget the sunscreen they do have that for sale as well, which was nice since we did forget ours!\nShow less"], ["Reviewed January 4, 2017", 3.0, "Nice ballpark but could use some updating", "Angels Stadium in Anaheim is a nice stadium to visit, but could really use some updating! I believe it was originally built in the 60's, and has been updated since then, but could still use quite an overhaul. Although I don't think payments for any major renovations would be approved until the team improves and ultimately does better in the playoffs :)\nShow less"], ["Reviewed January 1, 2017", 4.0, "Nice stadium", "I was at this stadium many years ago and my son and I went this year - the next to last game. We were driving from LA, got stuck in traffic, by the time we got to the stadium it was game time. We pulled right in and got a great parking spot. We took some photos outside - love the giant helmets! We were in line to get in when the National Anthem was being sung - they stopped the line until it was completed - that was pretty neat. We got inside - got up to our level - and the helmet nacho stand was closed. Back downstairs got the nachos and back upstairs only to find there was a kiosk selling the nachos - so irritated. Why wouldn't they have the concession stand open, but man a kiosk? Anyway - the stadium is nice - we didn't get there in time to walk around a lot like we wanted, but at least he has been to the stadium. We got seats in the 3rd level for about 10.00 piece. Everyone working was very nice. We would definitely go to a game here again - very nice!\nShow less"], ["Reviewed December 26, 2016", 5.0, "The Gigantic Feel", "A great structure, flashy colors, eye catching. In first glance you just want to have a complete look of the place. ideally designed to hold good games for huge crowds."], ["Reviewed December 25, 2016", 4.0, "Great Baseball stadium", "The Angel Stadium in Anaheim, is one of the best stadiums in Baseball! It is a good venue for all families. The stadium was remodeled several years ago so as to offer better seating. The park f fairly easy to get to, and they offer adequate parking. they have many different food stands to offer food and drinks. Nearby area RESTAURANTS ARE A PLUS. They have several of the best players in baseball on the team, and if some solid starting and relief pitching is added this season, they could be contenders.\nShow less"], ["Reviewed December 12, 2016", 5.0, "Baseball Stadium", "I came here in May 2016 for 2 baseball games (Angels vs Astros). It was some time off from a conference. The stadium was easy to get to and parking was no worries. The stadium itself is a fantastic viewing platform for baseball. I really enjoyed my time here.\nShow less"], ["Reviewed December 10, 2016", 4.0, "Came here for an Angels and orioles games", "Decent stadium had a good time with old buddy's had some beer hot dogs great time with the guys NOT AN ANGELS FAN .... but was fun"], ["Reviewed November 22, 2016", 5.0, "Ran Right Through It!", "We got the opportunity to visit Angel Stadium by running through it as part of the Disneyland Half Marathon. Talk about a treat! The Angel's announcer was there, announcing our entrance as we ran out to the crowd cheering us on in the stands. What a treat! The stadium is unique and fun to see!\nShow less"], ["Reviewed November 20, 2016", 4.0, "Beautiful stadium!", "This is a really neat baseball stadium located extremely close to Disneyland. I love the baseball Mickey at the stadium and the giant caps"], ["Reviewed November 19, 2016", 5.0, "Love baseball in the USA.", "Went to see a couple of games here while we were in Anaheim. The atmosphere was so cool. Everything you would expect and a game."], ["Reviewed November 15, 2016", 5.0, "The Angels home and was the Rams home", "The Stadium located 5 miles from disneyland, it is a safe area day or night ,no matter where your seat located you will have good view, for next year baseball season look for special packages they offer , we went in september we got 4 upper view tickets for 39.00 include 4 hotdogs and 4 soft drinks not too bad for a night out. I hope the Angels will do better next year, also this stadium host many other events like Monster Jam. Also there are restaurants across the street , also the Ducks Pawn next to it.\nShow less"], ["Reviewed November 8, 2016", 4.0, "Great experience", "My family and I enjoyed our first ever MLB game. We loved eating all the junk food on order while watching the game although the whole experience is quite expensive."], ["Reviewed October 31, 2016", 4.0, "Nice stadium even if it's old", "I have been coming to the Angel Stadium since 1977. The stadium is nice, but old. They did remodels to the stadium, but not really that much to make it as nice as other stadiums. Food prices are a bit high, but that's to be expected at sporting events. Parking and traffic can be a hassle when popular teams like the New York Yankees or L.A. Dodgers visit, but it's still relatively safe to visit this stadium compared to Dodger stadium. Seating is pretty good.\nShow less"], ["Reviewed October 27, 2016", 3.0, "Sorry, Californians, I Took The 405 To The 10 To The 5 For THIS?", "Angel Stadium was Park #33 on my quest to see all of the current MLB parks (#23 of the current stadia... plus 10 now-retired parks).\n\nThe facade at the entry to the stadium is nicer than at most parks. Two large Angels batting helmets on either side of six enormous player portrait panels and six baseball bats. Nice!\n\nAnd this year, in celebration of the parks 50th anniversary, there was an oversized Mickey Mouse character statue in front of the stadium. That was okay, too.\n\nBut the inside the stadium was pretty boring, except for the rock outcropping in left-center field. By that I mean, boring design. Boring food option. Average scoreboards.\n\nAfter reading Angels fans review of the stadium I expected SO much more. Honestly, it was a major league letdown.\n\nMy friends and I did enjoy the Jersey Mike's cheese steak. Other than that, there was nothing that appeared even remotely enticing as far as ballpark fare, so it was just an Angel Dog in the 6th inning... and a couple of cokes.\n\nThere are quite a few stadiums I'd gladly return to in the future. Angel Stadium didn't give me a single reason to want to return. Of the 26 current stadiums, this one would rate somewhere in the bottom half I have visited. It's ahead of Arizona, Chicago (A), Cleveland, Milwaukee, NY (N), Oakland, Philly, Tampa, Toronto and Washington. I am anticipating it will rank ahead of Miami. So that means it is near the bottom of the middle group of ten parks.\n\nThat's not saying very much...\nShow less"], ["Reviewed October 19, 2016", 4.0, "great evening out", "Went to a Tuesday evening game... great atmosphere and a super stadium with plenty of bars, food outlets etc. Only issue is the public transport... we didn't want to drive as I fancied a drink and its a nightmare to get to and from by train... it took us almost 3 hours to get home after to Sunset Boulevard!!\nWould go again though - a great value for money evening out.\n\nShow less"], ["Reviewed October 15, 2016", 4.0, "Wonderful area", "This is a fun place to watch a game as you can get tickets for really cheap. There are so many things to do in this area it is actually overwhelming at times. You want to watch good baseball and be able to relax for a few hours then this is the place to go.\nShow less"], ["Reviewed October 14, 2016", 5.0, "go to a game", "Tickets start at $6. No reason not to go to a real MLB game! About $7 Uber/Lyft ride to the game, so very convenient."], ["Reviewed October 13, 2016", 4.0, "Fun place", "If you're in town when the Angels are on the road, you can take a behind the scenes tour of Angels Stadium. It's a fun thing to do, especially if your a baseball fanatic. The tour is about an hour and a half. You walk a good bit, but it's not too far. I'd definitely recommend it!!\nShow less"], ["Reviewed October 13, 2016", 3.0, "One more off the MLB Bucket list, needs up grades. Showing her age.", "Was there for Texas Rangers and Star Wars Night. We sat down the right field line, good seats for about $65.00 each. Walking the concourse trying to see the action on the field is impossible, there are limited views. I like to walk around and observe the game from different vantage points, tough to do here. Anyway, off the bucket list.\nShow less"], ["Reviewed October 13, 2016", 4.0, "Great tour!", "We went on a tour of the stadium and very much enjoyed it and $8 is a cheap way to spend the afternoon."], ["Reviewed October 12, 2016", 4.0, "Great Fun", "Saw the last game of the season for 2016.\n\nHad a great Chilli dog and a Nachos Helmet which was fantastic.\n\nThe entertainment kept us happy even though we are not big baseball fans.\n\nthe fire works at the end of the game are one of the best that I have seen.\n\nnot sure if they do this after every home game or just the last of the year but it was great.\nShow less"], ["Reviewed October 12, 2016", 3.0, "Great Ball Park.....but.......", "The seating is pretty decent anywhere in the park. The day we went, however, we had to ask an usher on more than one occasion to please wipe off the bird poop on our seats!! They assured us it would be taken care of and we had to wait several more minutes for it to happen. Food and beer prices are expensive so be prepared with a walletful of cash!!!\nShow less"], ["Reviewed October 9, 2016", 5.0, "Fantastic stadium.", "We love this stadium so much!!! The drinks and food are a bit pricey but the staff are so incredibly helpful and very friendly from the ticket staff through to the guest relations. The ground it's self was so well taken care of."], ["Reviewed October 8, 2016", 3.0, "another baseball stadium visited", "Typical newer baseball stadium. Doesn't have the class of the older stadium. Good choices of food but overpriced like all staduims"], ["Reviewed October 5, 2016", 5.0, "We Love Angel Stadium!!!", "This Stadium is awesome. My husband and I are big baseball fans and it is on our bucket list to visit every stadium...so we have seen quite a few...\nFriendly vendors...great chicken tenders and fries...good ice cream in an angels souvenir hat cup...the fans were great, the vendors were friendly...and the park and bathrooms were clean....\nWe had a great time and are new fans of the Angels!!!\nWe loved the rally monkey mascot...\nParking was very close to the stadium and only 10 dollars.\nShow less"], ["Reviewed October 5, 2016", 2.0, "Everything costs too much!", "Everything here at this stadium costs too much! From the tickets to the food and drinks, it is way too costly to take your family here. Especially for a losing team like the Angels."], ["Reviewed October 3, 2016", 5.0, "More Jays Fans", "What a great old fashioned stadium. We had seats in the lower section for each of the games with great sight lines from both dugouts. All the staff/hosts we spoke with and had interactions were so welcoming and kind and all know their stuff. We found it had great food selections as well as great beer options. Prices were not cheap but pretty typical of Stadiums at $12 and up for a beer. As the stadium was not sold out during the dates when we were attending we found it very easy to walk around the concourses and the lines were minimal for food and beer. Even entering and leaving the stadium is quick and easy. The washrooms are a bit dated but again, no lines.\nHope when they do build a new stadium they can keep the charm of this 50 year old classic stadium.\nShow less"], ["Reviewed October 2, 2016", 4.0, "Great stadium", "Great stadium, great eats......rock formation and waterfall in the outfield was pretty. And fireworks went off for player intros and home runs and end of game. Parking was cheap too ($10). Easy to leave stadium (took us only five minutes from the time we got in the car until we were on the main street).\nShow less"]]}}