{"Aquarium of the Pacific": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Aquarium of the Pacific", "url": "/Attraction_Review-g32648-d104231-Reviews-Aquarium_of_the_Pacific-Long_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/64/15/80/the-aquarium-of-the-pacific.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2649"}, "address": {"@type": "PostalAddress", "streetAddress": "100 Aquarium Way", "addressLocality": "Long Beach", "addressRegion": "California", "postalCode": "90802-8126", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Amazing Place... Caring Staff.", "I never get tired of coming here. The aquariums are amazing and the staff is as good as can be!!! Extremely enjoyable on a week day during the day... as it tends to be less crowded."], ["Reviewed 4 days ago", 4.0, "Sunday visit", "If not for a coupon we had for a reduced fee out visit for a family of four would have been almost $100. Despite the price, a great educational experience for kids and adults alike. Great exhibits both indoor and outdoor exhibits. A good investment for the family.\nShow less"], ["Reviewed 4 days ago", 3.0, "Quick visit", "As out Day was packed with other events we did a quick visit to the aquarium. Very busy as it was a Saturday.\nWe had day passed so did have to pay the $30.00 to get in!!\nA little disappointing with the large mammals but under the water displays were brilliant.\nA couple of hours and it was all done. Brilliant for young families not fab for adult parties.\nShow less"], ["Reviewed 5 days ago", 4.0, "Small but good", "They're expanding which is good, they need to. Lots of places offer a combo ticket here which is good. The aquarium itself can be done in an hour or so, so plan to do something with it."], ["Reviewed 5 days ago", 5.0, "One of the best Aquaria", "Ttoally interactive. Lots of animals to touch, exhibits are big and give above and below water views. Ocean exhibits have wave currents! Visit the lorikeets for a special interactive treat!."], ["Reviewed 1 week ago", 5.0, "Great day out.", "Came here on a Saturday which was very busy. The staff was very nice. I went around twice and got my book stamped that I was given at the beginning. Unfortunately I couldn't catch the shows as I entered a bit late. I enjoyed touching the different things that were on display.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great place for family event.", "I walked to the Aquarium and along the walk watching dolphins in bay. What a beautiful area to make the day of it."], ["Reviewed 1 week ago", 5.0, "Fantastic", "Bought harbor cruise combo ticket. The aquarium is smaller than I expected and we went through in a little over an hour. We were neither overwhelmed nor rushed so things were just about right. I ended up taking a lot of pictures because the exhibits were so well done. I really liked the jellyfish. There was a decent variety of species and the aquarium made good use of space. There are both indoor and outdoor areas. Staff and volunteers were great ... knowledgeable and friendly.\n\nMinor detail ... Can’t put my finger on it but the map pamphlet was not very helpful. Ended up sticking it in my backpack and navigated on my own. Maybe there could be better directional signs.\n\nOverall a wonderful time.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Enjoyable afternoon", "The aquarium was very good, lots of different sealife to see. The cost was average price. would go back again"], ["Reviewed 2 weeks ago", 5.0, "Fabulous aquarium with a must see behind the scenes tour!", "Such a good aquarium! The behind the scenes tour is a must! You learn all about how the aquarium runs and how and what they feed the animals. You get to see holding tanks where they keep animals/fish for things! We saw a pregnant male seahorse and very tiny baby seahorses and so many other things! We also fed the Lorikeets and that was awesome--they were adorable birds! We got to pet rays and sharks! And I saw a sea dragon for the first time--that was my favorite! Very well put together aquarium! I recommend it highly!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great visit", "Taking a break from a business function at the convention center we explored the aquarium. Amazing displays of all varieties of see life in different environments. The aquarium is under going a large expansion but the open areas are clean up to date and interesting. Well worth the trip especially if you’re from the East Coast!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great Visit", "Had nothing better to do for an afternoon so went on a date to the aquarium. It was the most I've ever spent to look at fish, but well worth the visit. We were busy for hours looking at everything - I can only imagine what this would be like for a child. I'd definitely return!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best Aquarium I've toured", "Huge number of fish and animals, both inside and outside. Well organized and laid out so that you can flow through the exhibits without backtracking and everything is easy to see. If you like Jelly Fish this is your place."], ["Reviewed 3 weeks ago", 4.0, "Great family spot or a good date location.", "If you have kids, they'll love all the interactive parts of the aquarium. Getting to touch sharks and sting rays in the lagoon is really cool. Good times for a couple as well. If your into this type of thing. But come on.... who isn't.. ha.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun for a few hours", "We had half a day with nothing to do so we went here. It was priced a bit high at $30 but in the end I felt it was worth the money spent. Friendly volunteers are everywhere and dont hesitate to tell you about the fish and critters. The penguins and sea otters steal the show!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun While Learning", "The Aquarium has a wide array of species and a fun and interactive learning environment. Staff is friendly and professional and finding parking in the structure adjacent to the Aquarium is very easy to do."], ["Reviewed 3 weeks ago", 3.0, "Hard to navigate and follow", "It was a decent aquarium.. It was hard to follow each exhibit since it wasn't as organized as other aquariums I've been to. The exit/entrances to each section was not clearly labeled and we walked in a circle a couple of times. Since it was somewhat disorganized, it made it hard to walk around when there are a lot of people visiting. IF you go, visit on a not so busy day. Parking was decent and the marina view was great.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Purchase a combo ticket", "Thoroughly enjoyed this lovely aquarium. I would set aside 3-5 hours maximum to enjoy all they have to offer. There are many, many educational opportunities available. I suggest purchasing a combo ticket with an afternoon whale watching tour. A team of aquarium employees join the whale watching cruise. Their knowledge enhances the tour greatly. Bring a sweater for the aquarium and a mid weight jacket for the whale watch. It gets chilly.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fabulous, mind blowing sights", "A friend & I went here for the day! It’s huge, clean, well planned out, & full of interesting information and sea creatures! We liked the sea horses, leaf dragons, many kinds of jelly fish, otters, sharks, seals, poisonous frogs; & the puffins were hilarious to watch take deep dives! They would pop out of the water, then shake their wings! It’s always fun to watch the penguins “fly” under the water! The price was very reasonable, too!The touch tanks were also a delight!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Perfect Family's Day Out", "It was a hot day and we wanted to cool down a little bit in the Aquarium of the Pacific, located in Long beach downtown.\nIt is a must see for anyone passing through the area, particularly if accompanying young ones. It has something for everyone, toddlers to the very old. The varieties and wonders of life in the Ocean are bound to create waves in our heart.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "ok no dolphins or whales", "no great shows no whales or dolphins the exhibits were nice and many fish from all over the world shark petting for the kids"], ["Reviewed 4 weeks ago", 4.0, "Great place to spend a few hours", "We took our almost 3 year old daughter here one day while we were visiting LAX/Disneyland for a week. We spent about 2 hours here and checking out all the sea creatures. We love the interactive actives (moon jelly touch tank, sharks and sting ray touch tank, touch tank for anemones and sea stars, feeding Lorikeet, live feedings and puppet story time). We also saw puffins, which is kind of hard to find at the zoo/aquariums in Chicago.\nThis place is stroller friendly, most paths are wide enough and there are elevators throughout. Plenty of parking at the parking garage across the main entrance but it wasn't free. You can get the parking ticket validated for $8 all day but if you only spent less than 2.5 hours at the aqurium, it's actually cheaper to pay the standard rate of $6. There is a small cafe located in the atrium and had some tables. Tickets are a little bit on the high side, but you can search online for coupons. There are plenty of things to see and do for a few hours.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice aquarium, Interesting behind the scenes tour", "This is a nice aquarium with a lot of exhibits with a good variety of marine life. The exhibits are spread out, with some inside and some outside. There were a lot of elementary school children there the day we visited, which made some areas both crowded and noisy. (We were spoiled by the Georgia Aquarium in Atlanta where school groups are separated from other visitors.) There are several touch tanks for visitors who want to get up close and personal with the sea life.\n\nWe took the Behind the Scenes tour and thoroughly enjoyed it. The tour lasted about an hour and covered a lot of territory. We learned about the food preparation, the divers who both feed the fish and clean the aquarium, how animals are quarantined when they are brought into the aquarium and how the exhibits are maintained. We were given seaweed to feed the fish at the tropical reef exhibit. The tour group was small enough (about 10 people) that we were able to get all of our questions answered and everybody was able to see and hear everything.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Best Kept Secret", "Went to Aquarium of the Pacific about a month ago and was absolutely shocked. After living in the bay area near Monterey this Aquarium is by far the best. Sea Animals are by far more exciting to look at, larger and filled with beautiful colors. All of the exhibits are nicely done and arranged with a balance of outside and inside galleries. The price is the best and we were able to use a local visitors guide to get additional discounts on the admission price. I'm going back as soon as I have a chance. I would recommend going around 1pm and doing all of the outside venues first, and then end up in the main gallery area where the lights come on at night and it seems more magical. I'm ashamed at myself for not going to this Aquarium earlier out of all the times we've traveled to the LA area.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Educational exhibits", "I took my 8 year old grand-daughter for a day of fun and fish she was so excited and the Aquarium did not disappoint! Although the venue is not very big they have many interactive things for kids and several talks and animal shows going on throughout the day as well as educational short films. Our favourite was the California sea lion show, get there early to get a seat, the trainers put on quite a show! There are also numerous tanks with fish, frogs and the most amazing variety of seahorses I’ve ever seen.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun Visit", "We were in LBC for a dance competition and we visited the aquarium during some down time. The girls (and mom's ) had a lot of fun!"], ["Reviewed 4 weeks ago", 5.0, "Quick Visit prior to Whale Watch", "Great hands-on experiences for children. We ran through before going on the whale watch sponsored by the aquarium because the entrance tickets were included in the whale watch. Loved the jellies, octopus, rainbow trout, frogs and shark tank. Wish we had more time."], ["Reviewed 4 weeks ago", 5.0, "A nice mid-size aquarium - well worth a visit", "My wife and I visited the Aquaruim of the Pacific while in Long Beach, and were quite satrisfied with the experience. Located in Long Beach, it is near many restaurants and also shopping and other attractions.\nThe focus of the aquarium is the Pacific, so there are perhaps fewer displays than are in some other aquariums, but all the displays were terrific. The facility was extremely clean and the staff and volunteers were knowledgeable and helpful. There are touch tanks and displays which offer an opportunity to experience something out of the ordinary.\nThge only downside to our visit was that it was a field trip day and the Aquarium had 900 elementary students expected that day. The result was that the facility was a bit crowded and noisy, making it difficult to linger at some of the displays.\nBonus tip. We purchased a whale watching combo ticket for $49.95 which gave us a 3 hour cruise into the Pacific where we saw a few Gray Whales. The whale watching tour by itself was $45 from the vendor, so we saved approximately $20 per person.\nWe recommend visiting the Aqarium of the Pacific without reservation, although I might check to see how many school children were expected that day.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A nice afternoon visit", "We used the free bus from the Queen Mary to the Aquarium. Spent several hours enjoying the exhibits. The only downside to our visit was the huge amount of school children. It was apparently “field trip day” for local schools."], ["Reviewed 4 weeks ago", 5.0, "Really great aquarium!!!", "We traveled with our 14 and 17 year olds and they thought it was great too! You get to touch jelly fish, sting rays, sharks, sea urchins, etc. I think it is likely the best aquarium I have ever been to (been to Boston, Mystic, Camden that I can recall). The layout is a little tough to navigate even with the map, but we made it to all the exhibits. We got to see the sea otters being fed and performing tricks which was adorable! Only waste of time was the shark-feeding - they literally drag fish corpses in and out of the water trying to get them to eat - sometimes they do, but you don't really get to see in action. There are probably special shows and other activities that we didn't see/do, but we loved our experience.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Not really what we expected- kind of diappointing", "Our adult son wanted to visit an aquarium on our California visit and based on reviews we chose the Aquarium of the Pacific. After driving an hour and a half one way, we were surprised we only spent one hour and 15 minutes here. Granted we were three adults and did not spend a lot of time in the touch/petting areas but we did take time to view all the exhibits, see the scuba diver and talk to volunteers. Other than the identifying plaque, there is very little additional information given about the animals. The cost seemed a little high for the size of the aquarium and variety of animals present. $30 adults $17 kids 3 to 12 and $27 for seniors 62 and older. We did get a AAA discount and I understand if you go directly to a California AAA office ahead of time, the discount is greater. Aquarium is open 9 to 6. We went a little after 1 PM due to everyone stating that school groups were there ahead of this time. We still had several groups in the aquarium with us but they were leaving rather than arriving. Complimentary wheelchairs are available but you must present a credit card. Complimentary strollers or not but they do have what they call baby back packs you can use (credit card deposit). Since one of the focuses of the trip was to see jellyfish we were not disappointed here. There were more varieties them we’ve seen in many other aquariums very interesting to watch. They also do a great job with the horses. While few in numbers the sea lions and seals were fun to watch. The sea otters were very playful with the kids. There were also no large sharks but they did have a few impressive stingrays. Penguins were hard to see except when they were in the water. The staff is knowledgeable and the place was clean however $90 for an hour to 15 minutes of entertainment, didn’t seem worth it to us. I’m sure families with young kids would love the place.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Very nice aquarium", "A very nice aquarium with indoor and outdoor exhibits. Knowledgable and friendly staff. Pleasant touch tank opportunities for kids and adults.\n\nI was a little disappointed with the penguin exhibit compared with others I’ve seen but the overall layout was very good and visitor friendly.\n\nMy visit was on a slow day and movement was very manageable. Not sure what it might be like on a very busy summer day with lots of strollers and little kids. Glad I didn’t have to experience that.\n\nI liked the Aquarium and recommend it.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Enjoyed our visit here", "Family has been to numerous aquariums across North America. This one is excellent and we enjoyed the closeness you feel with the animals and fish. Very closeup experience with most of the creatures. We were able to take in two shows with the mammologists and found them very informative. Lots of opportunities to touch and feel species. Another bonus was the short walk from the Catalina Ferry along the boardwalk. After our visit there were lots of close by food options. We planned for 2 hours here and our visit extended past 3. Highly recommend a visit to this tremendous facility\nShow less"], ["Reviewed January 23, 2018", 3.0, "Sea Creatures Up Close!", "We anticipated that it would take 4 hours to tour the Aquarium. In reality we were finished in about 2 hours. Considering the price we paid I feel we were over charged. Most of the exhibits were interesting and well presented."], ["Reviewed January 22, 2018", 5.0, "AWESOME!", "We,(my daughter, son-in-law, 3 yr & 9 month old granddaughters) visited last week. The aquarium is absolutely gorgeous. Both granddaughters were fascinated by the fish which you could get nose to nose with and just glass in between. They had moon jellyfish to touch and little rays and sharks. They were staff everywhere to make sure that the touching was done gently and correctly, but this allowed the two girls to experience something that they would never otherwise been able to.\n\nThere were exhibits with sea otters swimming with other fish, tanks with big fish, little fish, exhibits of sea horses, sea anemones, corals, examples of different coastal waters, and lorikeets....\n\nBoth girls were fascinated the whole time we were there, we didn't get to see everything because they needed their naps. (We had lunch at Roscoe's, but that's another review!) (And be prepared for the school kids excursions, but it's all very well organized.)\nShow less"], ["Reviewed January 21, 2018", 5.0, "Fun Fish", "It was great to see the different fish. There was a person swimming with the fish that was fun to watch."], ["Reviewed January 21, 2018", 5.0, "Fun place for families!", "I love visiting the Aquarium. The exhibits are interactive and nicely layer out. It’s a fun place for families and kids. During the summer they have Night Dive for 18+ they serve alcohol and have a dozen food trucks outside. They also have DJ’s, dancing and activities.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great visit", "This is a great aquarium with lots of different exhibits. There are tons of fun restaurants nearby in Shoreline Village. And there's great shopping in the outlet mall across the street. Enjoy the views, ocean education, and shopping here!"], ["Reviewed January 21, 2018", 4.0, "An inviting family experience!", "If you want to be astounded and wowed (and you have deep pockets for the hefty price), take your family to this gem of an attraction. Instead of you going to the ocean, the ocean comes to you! Aquarium of the Pacific rivals a similar attraction in the Bahamas, although the former is a smaller version of the latter. Aside from size, all such attractions are not equal. Each has its own flavor. Although not an attraction, the Red Sea (yes, of Biblical fame) has sea creatures found nowhere else in the world. The multifaceted beauty of our oceans, seas, and other bodies of water and waterworks (such as breath-taking waterfalls) are simply indescribable. Going full circle, if you want to taste the California flavor of our watery planet, Aquarium of the Pacific is a good place to start!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Birthday visit with Behind the Scenes Tour", "I have a high appreciation for my hobby keeping a large reef tank so going behind the scenes was very special to learn how they maintain the systems.\nThis is a special place with really well maintained and beautiful exhibits of fish, mammals and even some birds.\nYou get to see mostly those fish that are from the pacific area but you will not be disappointed! Highly recommend!\nShow less"], ["Reviewed January 15, 2018", 4.0, "Enjoyable experience", "Wonderful exhibits, plenty of available staff for questions and frequent schedule for feedings. Especially nice “hands on” exhibits for children. Butterfly area closed unavailable, but otherwise plenty to see and learn. Lovely gift shop. Discount entrance coupons are readily available through hotels."], ["Reviewed January 15, 2018", 4.0, "Pet the manta rays!", "This was a great aquarium, but it is pricey and not as big as I thought it would be. If you have a AAA card, you can get a bigger discount if you purchase your tickets through AAA prior to going. We saw everything in about an hour and a half. However, they have probably 6 different areas to be able to pet some type of jelly fish, manta rays, starfish, sharks and they have a penguin exhibit and seals. Things to do for the kids and some small shows.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Fun and educational", "Thoroughly enjoyed the aquarium. Lot of unique displays and very informative. Highly recommend doing the Behind the Scene Tour."], ["Reviewed January 4, 2018", 5.0, "Highly recommend", "Centrally located on the Long Beach waterfront this is an excellent aquarium with wonderful exhibits. We spent 2 1/2 hours touring the main exhibit's (shark lagoon, lorikeets, sea otters, sea lions and seals, as well as the big tank displays. Then we took a Behind the Scenes tour which was superbly guided by Lannice. You go through the food preparations areas, the diver equipment area and then tour above the big 350,000 gallon tropical display. The quarantine areas, where animals are housed for observation and treatment are fascinating, and the tour through the water treatment and filtration areas is overwhelming. Highly recommend spending the extra money ($12 per adult) to do this.\nShow less"], ["Reviewed January 3, 2018", 5.0, "An aquarium with birds", "I wanted to see the Queen Mary and ended up getting a combo ticket for the aquarium. Lucky I did. The Queen Mary was pretty disappointing with few places to see before paying more. The aquarium was really well done and even had bird feeding. Parking was close by. I’ll be back.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Outstanding facility", "We took our 10 year old and was very surprised and how many hands on things you could do. He especially liked petting the jelly fish and sting rays."], ["Reviewed January 3, 2018", 3.0, "Very expensive for what you get", "We had a coupon but couldn’t use it at the kiosk so instead of standing in extremely long line we just paid full price. For an aquarium on the ocean we expected much more. It was crowed, not from a lot of people but from the lack of space. It’s a small aquarium. We spent about an hour there and left disappointed. The highlights were petting the sharks and the jelly fish, every other exhibit was average.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Great day trip out for all ages", "Learn all about the sea life of the Pacific Ocean at this large aquarium. Huge tanks of fish and other creatures that live in the Pacific region. This aquarium has lots for kids to look at and touch at close range, such as rays, small sharks and anenome. They will also love watching the sea lions and sea otters play. The interpretations and explanations are written for all ages. There are also touch screen displays our tech savvy kids will love. During peak periods, the aquarium gets very busy, so come early. Parking is easy across the street in a dedicated parking garage. Be sure to remember to get your parking ticket validated for a lower parking rate. Also walk around the beautiful Long Beach waterfront. A view of the Queen Mary can be seen as well as several shops and restaurants. To truly enjoy the location, budget a day or at least entire afternoon. Look for late closing hours during peak holiday weeks.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Sea Life Up Close & Personal", "A great place to take a small kid or teenager. I do recommend a guided tour that will take you around this big aquarium. I feel like you appreciate marine life much more with a guided tour."], ["Reviewed December 31, 2017", 5.0, "Get there EARLY ...it gets crowded around 12", "it's a really fun place. They have fun interactive presentations going on around the clock. The young kids shows with animal puppets are hilarious my 3 year old had a blast.\nTwo things I would recommend\n1-Download the aquarium app it helps with show times and locations\n2- Arrive early if you want to enjoy it, it gets really crowded you can barely look at anything or enjoy it.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Aquarium of the Pacific Long Beach", "Enjoyed taking my granddaughter to the aquarium of the Pacific. Disappointed in the frog exhibit they were so tiny you could hardly see them on TV they looked bigger.\nParking is rather expensive and it’s unclear that you can get an eight dollar voucher when you walk in so parking actually cost eight dollars for the day not $16.\nShow less"], ["Reviewed December 27, 2017", 4.0, "Good but nothing that's stands out!", "Decided to do a quick morning trip before leaving LA. Long Beach and the area around the aquarium itself feels clean and nice. The aquarium I found to be good. Comparable to the Two Oceans Aquarium in Cape Town South Africa where I live with the following exceptions... Two Oceans has a large shark exhibit that is well presented. Aquarium of Pacific has many touch displays which Town Oceans doesn't. I think it is difficult to really stand out an an Aquarium as many now have sharks on display which I imagine is a big draw card. Aquarium of the Pacific has many jellies on display which was both interesting and visually pleasing. Small shark and ray touch tank was nice but not too sure how great that is from and animal welfare point of view. I caught a bit of a talk at the main display tank when you walk in and based on that together with the general theme throughout I felt that the aquarium was ethically responsible and did have a conservationist priority.\nShow less"], ["Reviewed December 27, 2017", 4.0, "Very clean and enjoyable", "Great place to take the family. Very clean and friendly. A lot of exhibits to enjoy and learn about marine life."], ["Reviewed December 25, 2017", 4.0, "Better than shopping", "Went with my husband to have a,relaxing afternoon. We had such a good time. The frog exhibit was interesting. I loved feeding the lorakeets. They were very hungry and I had 8 sitting on me. Luck was with me and I got out without beeing pooped on. The penguins were entertaining as were the sea otters, sea lions and seals.\nShow less"], ["Reviewed December 23, 2017", 5.0, "A Wonderful Way to Spend Part of Your Day", "This is a wonderful way to spend the da,y for families, couples and everyone else who likes marine biology! One of the neat things about the aquarium are the interactive stations throughout the facility where individuals can engage in learning. An example is sticking your hand in a simulated example of blubber to see how bubbler insulates and keeps whales warm. It is a wonderful learning environment!\nShow less"], ["Reviewed December 22, 2017", 5.0, "Incredible education for children and adults.", "Greater appreciation for God's creation. The exhibits, shows and events are well worth the fee and small extras paid."], ["Reviewed December 22, 2017", 5.0, "Aquarium of the Pacific", "Really cool place. great for kids and us ole one's. Great educational oppertunies. Really Cool Fish, Otters Crabs and a ton of other stuff"], ["Reviewed December 21, 2017", 5.0, "Should be part of sites to see in Long Beach", "Explored this aquarium by myself while waiting for my friend. They have a wide variety of marine species to admire and look at. I observed the kids visiting were having the most fun, some of them seeing the animals live for the first time. Not too big a place, size was just about right to be able to see everything it has to offer. I would suggest this as a place to go to especially if traveling with kids.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Kid space is fun for the young ones", "We took our out of town grandson (4) to this and he enjoyed it very much. We did the lorikeet bird house that was fun, although he was nervous about landing birds. I took off a star for the cost of the entry fee and for the cost of a teeny cup of bird nectar. There is a movie and a decent cafeteria.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Beautiful", "I brought my 14-month daughter to see this beautiful display. She was in awe of all the different fish, frogs, sharks, etc. so many children here. But the place is beautifully maintained. A must for children."], ["Reviewed December 21, 2017", 5.0, "great place", "love this place there always updating this place so its up to date with fun things to do and see. all the area is perfect hotels restaurants bars etc..."], ["Reviewed December 21, 2017", 5.0, "Tourism", "It was a great attraction. The whole family - 8 of us - enjoyed the facility and sights to be seen. It is family friendly & even the small kids enjoyed it as did us older folks."], ["Reviewed December 21, 2017", 5.0, "Checking out what’s new", "My family visits Aquarium of the Pacific at least once a year or so. It’s a nice place to hangout and relax. It has a good amount of fish and aquatic animals to watch and enjoy. Great to bring visitors from out of state or from Northern California. Perfect for kids/toddlers. They love it and the price is very affordable compared to many other options especially if you get their local discounts like AAA and a few others. Summer gets a bit busy than usual but still manageable. Usually very low wait times even at its busiest.\nShow less"], ["Reviewed December 19, 2017", 3.0, "Interesting Exhibits", "The sea life exhibits are diverse and interesting.I liked the sea horses exhibit in particular. The restaurant was little pricey,but overall it’s a good experience,especially for young children."], ["Reviewed December 16, 2017", 5.0, "Nice Visit", "There are quite a few sea creatures to see at this place, more than I expected. There were quite a few seahorses and jellyfishes. Visitors have the opportunity to touch the sting rays swimming in a shallow pool. The souvenir shop was nice too."], ["Reviewed November 28, 2017", 3.0, "Good for a Short Visit", "A little pricey ($30) for the size of the aquarium and what it has to offer. Good exhibits, very crowded on the weekend. The shark tank was nice. Nice place for families with young children and school field trips."], ["Reviewed November 28, 2017", 5.0, "Super cool for our 10-month-old", "Visited with our 10-month-old son. He doesn't care much for the zoo at home, but this was neat because he could get up pretty close and see what was going on in the tanks. He enjoyed watching the jellyfish (there are tons and tons of different species of jellyfish! I had no idea how many!) and the sea lions. The touch tanks would be awesome for an older child. We opted to check the stroller at the door, and it was good because 1) it allowed him to get closer to the displays, and 2) the crowd was huge on a Sunday and would have made maneuvering the stroller a bit difficult. The gift shop is beautiful and full of interesting and unique things, but expensive (as expected).\nShow less"], ["Reviewed November 23, 2017", 4.0, "Jelly fish, sharks and otters", "Super-duper fun. The exhibits are very well-thought out. They are very large with a lot of fish and other animals to see. We enjoyed the touch pools and the petting a jelly-fish. The otters are cute and you can pet a shark. There is even a zebra shark! (a cool shark). It is close to lots of restaurants and shops so you can do something else after visiting. You can get your hand stamped to come and go for the day.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Very enjoyable visit", "Our visit to the Aquarium was part of our return journey following a cruise and I found it the perfect end of 17 days away from home. The staff are welcoming and friendly with a wealth of subject knowledge and judging by the number of families enjoying the day we were not the only ones to think so.\nA very fitting end to our holiday\nShow less"], ["Reviewed November 22, 2017", 4.0, "Great fun", "While in long beach we took in the aquarium was a fun and interesting time. There was lots to see and do. With tanks set up so you could feel the exhibits.\nThey had seal and sea-lion shows and divers feeding the fish.\nWe have been to a few aquarium but thought this one was a must see.\nYou can go on their web site and get a coupon for reduced admission.\nSo in closing we really enjoyed ourselves and it would be a great place to take the family.\nShow less"], ["Reviewed November 20, 2017", 5.0, "We had a blast", "When your 6 year old breaks down in tears after going to the aquarium because they are exhausted, I would say you had a good time! My family of five (mom, dad, 6,14, and 12) loved it. The exhibits were great. We especially loved the jellyfish, the seal lions, the otters, and the frogs. It seemed like the front of the building was going through a remodel, but it wasn’t an issue. We will definitely be back!\nShow less"], ["Reviewed November 20, 2017", 3.0, "Very confusing layout", "I had been here way back when it first opened and remembered it fondly. Our return trip was not so wonderful. We absolutely enjoyed seeing all the specimens but the floor plan is so confusing we were never sure if we saw everything we wanted to see or not. The main areas were also so cluttered with stuff it made it difficult to navigate especially as it got more crowded.\nShow less"], ["Reviewed November 18, 2017", 3.0, "Quick visit to the Aquarium of the Pacific", "It is a small aquarium so when 10 buses of school kids show up it gets very crowded very quickly. So, our party of 4 decided to take the Behind the Scene tour. That was very worthwhile, seeing all of the operation that goes on to keep the aquarium going. Our guide was very knowledgeable. When we met some of the divers back stage, they also took their time to answer our questions.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Classy aquarium but not as good as Monterey's", "Place does not show it's 18 yr old age and in fact will be adding on with an new auditorium. I found the free brochure to be a little confusing until after I roamed around a bit. If there was a suggested path way I did not notice it.Displays are quite nice and good variety of ocean life.\nParking is across the street and only $8 for the day with validation before leaving the aquarium. If the hungries hit go to the cafe on the 2nd floor. Food was good and priced fairly. Avoid the 1st floor snack bar unless money is no object.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Beautiful", "Huge variety of sea life, easy to see, very well taken care of. Plan to spend about three hours, try to catch the shows, especially the seal/sea lion expo. Fun for kids, interesting for adults, amazing beauty for everyone."], ["Reviewed November 12, 2017", 3.0, "animals very well taken care of", "not very big....disappointing that there were no large sharks. That said everything is well maintained, employees are very nice and knowledgeable and the animals are well cared for"], ["Reviewed November 11, 2017", 3.0, "Very nice", "This was a great aquarium. So many species of fish and the sea horses and sea dragons exhibit was going on as well. It was immaculate, you can tell it’s very well taken care of. But there wasn’t really anything out of the ordinary here."], ["Reviewed November 10, 2017", 3.0, "Nothing spectacular", "I love my aquariums and this was the first American aquarium. It was ok but nothing spectacular. Not sure where the lorikeet enclosure fits in with an aquarium though??? Gift shop has nice stuff."], ["Reviewed November 10, 2017", 5.0, "Jellyfish Galore", "This aquarium is very well organized, the staff is very helpful and knowledgeable, and the variety of sea life is excellent. I you like jellyfish and seahorses this is the place for you, what strange and wonderful varieties they had on display."], ["Reviewed November 10, 2017", 4.0, "Certainly worth a visit", "Excellent for children. The aquariums are set out in a very nice, interactive, way. A pleasant stroll through the place with both underwater and surface viewing."], ["Reviewed November 10, 2017", 2.0, "Not worth the money", "Sorry. Not worth the money. Does serve alcohol which we found funny but $9 for 2 bottles of water is stupid"], ["Reviewed November 10, 2017", 5.0, "Amazing Aquarium!!!", "Always had a fascination with the sea and marine life and have been to some impressive venues but this has to be the best so far!!!\nSomething to enthral all ages, particularly liked the jelly fish exhibit!\nThe staff were very helpful and found the cheapest way possible for us to visit, so much so we went back a week later a second time!\n\nWe'll be back again!!!\nShow less"], ["Reviewed November 9, 2017", 4.0, "plenty to do but pricey.", "Took my son, his wife and my two grandsons. Seemed a bit high priced for the amount of time we spent seeing the exhibits. All done in 3 hours."], ["Reviewed November 9, 2017", 4.0, "Good and getting better", "Took my 20-month-old grandson to the aquarium and he had a blast! The attraction is small in size but perfect for a young child and a tired grandpa. They are currently redoing the theater and this will be a great addition. Hope they allow entry to the theater as part of the entrance cost or allow patrons the ability to go to the shows at the theater separately without having to pay the entry fee for the aquarium. But overall a great place for an active little one.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Amazing Adventure", "I have been to the Aquarium before and everything I have gone there is something new. It is a great experience for children. The Aquarium is located where many restaurants are right outside when you leave. It's best you get there early because the parking structure fills up fast. It's is a great outing for a family anytime.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Wonderful jellies!", "I could spend hours watching all the different jellyfish. Amazing variety, the otters are a close second."], ["Reviewed November 8, 2017", 5.0, "Great local aquarium for the fam", "If you haven’t been here, go give it a try. It’s not the biggest or fanciest of aquariums, however they have a little bit of everything and some very cool attractions. I think you can bring in food which i recommend."], ["Reviewed November 8, 2017", 4.0, "Beautiful Aquarium", "Love the location of the Aquarium you have a beautiful view of the Light House, the Queen Mary & Restaurants walking distance. It's a small Aquarium you can be done within 3 hours. Which is perfect for us."], ["Reviewed November 8, 2017", 4.0, "Great attraction for adults and children", "Enjoyed this for years, first going with my wife and children; now with the grandchildren. It is great to see the wonder in my grandchildren's eyes as they enjoy the many aquariums and learning opportunities"], ["Reviewed November 7, 2017", 3.0, "Not the best example.", "Having visited many other, similar aquariums, we found this one a little tired. Many of the tanks just didn't have enough information about the inhabitants. We were disappointed by this. I think we managed to see everything within an hour..... which is unusual for an aquarium of this nature.\nShow less"], ["Reviewed November 4, 2017", 5.0, "COULD SPEND HOURS", "Visited the Aquarium of the Pacific for photographer's night. Very interesting facility. The photography was so impressive that we spent two hours in one room. I will return during daylight hours to experience the displays outside."], ["Reviewed November 4, 2017", 4.0, "Family fun", "First check the internet for coupons! Second plan on an all day event with outdoor dining and surrounding location walks. Smaller venue but with lots of info for the whole family. Great location by the water. recommended meutermedia"], ["Reviewed November 2, 2017", 4.0, "Small but with a good touch pool", "We visited the aquarium with our young boy who loves aquariums. The entrance is a bit pricey for its size. The aquarium is not a big one. Our boy enjoyed the outdoor touch pool the most, where you could touch the bat rays. Surprisingly, the gift shop was quite big with many varieties of stuffed animals.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Nice for a Short Visit", "We visited the aquarium on a Saturday afternoon. The aquarium makes a good effort towards educating their visitors. The building seemed dated, but the displays were beautiful."], ["Reviewed October 27, 2017", 5.0, "Educational aquarium", "We thoroughly enjoyed our visit to the aquarium. It was not busy on the day we went and the exhibits are very good. The jelly fish are the stars of the show. Great colors. We liked the fact that the touch pools had staff or volunteers explaining what was being seen.\nOur age range was from 6 to 64 and we all had fun.\nThe Long Beach waterfront is also very pretty and worth a stroll.\nAdmission is pretty expensive but the aquarium must cost a fortune to operate so it seemed OK to us.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Great family spot !", "We had a great time here. Right smack dab in LBC and on the water. Our older teens liked it too. It's busy on the weekend though."], ["Reviewed October 24, 2017", 5.0, "After hour party", "Attended an after hour party on business and thoroughly enjoyed myself! The only comment would be that some of the exhibits were closed or poorly lit in the dark, likely for the animal's sake but also because it was after hours. All in all great location and design!\nShow less"], ["Reviewed October 23, 2017", 4.0, "Fun visit", "Located right on the harbor, the aquarium is a nice stop for about 2 hours. Our visit included both interactive exhibits (with the divers) as well as multiple tanks with salt water fish, seals and sea lions, jelly fish, sharks, penguins, rays, and shorebirds. Unfortunately, we visited on a day when many schools had tours so the kids were loud and very active. But, the visit was fun.\nShow less"], ["Reviewed October 22, 2017", 5.0, "A fun and enjoyable experience for the whole family!", "We went to the aquarium in October and spent about 3-4 hours there. It was very interactive because it allowed us to touch sharks, stingrays, jellyfish and starfish. They have an indoor and outdoor area which also has a little area for kids to play. We watched a short video on radiation from Fukushima in our oceans. It was a nice spot for us to park the stroller while my son napped. They had people giving information at all of the interactive exhibits and they had several presentations while we were there. We watched one with scuba divers cleaning the main large tank that is in the lobby and we viewed the presentation on otters. My son that is only 2 had so much fun. He loved viewing all the different animals. It was one of the highlights of our trip. There is tons to see and learn. They sold some food and drinks but we didn’t try any. There was also a bird exhibit outside but they closed it due to the fires. I definitely recommend this place if you love aquariums. This was the first aquarium my son ever visited and he definitely loved it. My mom, aunt and husband also enjoyed the visit.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Love it", "Come here all the time it's a very fun place to go for people of all ages and it's for a good cause."], ["Reviewed October 21, 2017", 5.0, "Nice experience", "It was fun experience. The jelly fishes were the best exhibits followed by the \"tide pool\" life, not certain what to call it."], ["Reviewed October 19, 2017", 5.0, "Great time to be had here.", "We had a great time here. Lots of touch pools. Staff was great and we took the time to wait for the scuba divers to feed the fish. This was well worth it. When you pay for the parrot food make sure you buy two lots of it. You will love the experience and only one container of food will not last long.\nShow less"], ["Reviewed October 19, 2017", 4.0, "Nice....", "I found this to be a great aquarium with a lot to see and experience in a short period of time. I would recommend that you check for specials they may be running at the time....I say this because I was there this past Saturday and I would expect it to be busy on a weekend. It happened to be costume day and any child wearing a costume was allowed free entrance. The place was jam packed and so the overall experience for me was less than desirable, however I did imagine myself there on a day when such an event was not taking place and thought it would be an excellent time. I can see why the kids are so drawn to it, the activities and events they hold are top notch! If only I were 10......\nShow less"], ["Reviewed October 18, 2017", 5.0, "A great visit", "I have been here many times, in the daytime and and night for fundraisers. It is wonderful at any time of the day. The outside pools are awesome!"], ["Reviewed October 18, 2017", 5.0, "One of the best aquariums", "This is such an amazing aquarium and set up so well. I have visited many aquariums and the set up being part outside and the two stories of tanks is just perfect without being too overwhelming for kids. The variety of animals/fish on display is quite substantial and I think greater than most aquariums. And I love the ability to be able to touch the moon jellies.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Great aquarium", "Great aquarium. Many types of animals. Lots of touch pools and shows. Very active sea otters; I could have watched them all day. Many types of jelly fish and seahorses."], ["Reviewed October 17, 2017", 4.0, "Nice aquarium", "Has beautiful displays with large variety of fish and pet tanks. They are currently remodeling the outside. Easy to find coupons/discounted tickets online. They have many events throughout the year so it is a good idea to check their calendar online before going. They also offer a 3D cartoon movie or King Penguin movie for an a small additional fee. Not as crowded after 2:00 or 3:00 on a week day.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Fishy Fishy Fishy", "If you want to avoid a weekend crowd take heed ongoing in the morning or after 3 pm. don't go when they are having a special event. You will be bomb barded with every kid in the family and an overabundance of baby strollers. When I say it was crowded I mean not even room to walk thru people looking at exhibits. The displays are nice and well organized by fish and oceans. I was disappointed by the new frog exhibit. I had seen one at another aquarium that was excellent. This was not at the caliber that the hype was advertised. The displays only had one or two frogs and most were babies, and when you are seeing a poison dart frog exhibit the frogs are small, to begin with. So add some frogs they can be seen. The food was good at the cafe but very pricey for fast food. They keep the cafe very clean with all of the coming and going of people. This aquarium was very cool but do yourself a favor and go during slower times, you will have a much better time and less frustration.\nShow less"], ["Reviewed October 16, 2017", 5.0, "One of the highlights of our trip!", "My wife and two young kids (age 6 and 3) visited the Aquarium as part of our week-long vacation in the LA area. Easy to see why this is #1 in Long Beach. We thoroughly enjoyed our visit. The Aquarium has excellent exhibits and sits on a very nice location next to the water. After our visit we took time to stroll around outside and enjoy the views of the marina and the ocean. Highly recommend this venue as a place to visit. We'd love to come back and do it again.\nShow less"], ["Reviewed October 15, 2017", 4.0, "Fun visit!", "Came to visit with a group of friends before returning back to school. Us college kids had a great time so I feel like this is a place any aged person can enjoy. They have sections where you can learn & touch the animals. Overall it was a fun trip. After you can walk to the nearby restaurants or shop at the outlets too so that's cool.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Great Visit. Excellent Exhibits", "I visited here as Part of the Los Angeles Pass. I was with my Other Half and we came in after a Whale watching tour nearby. Very Glad we did. There are lots of great exhibits to see.\nWe saw, sharks, jellyfish, otters, Penguins and literally a hundred other fish whose names I can't remember. There was a great Frog exhibit too and place where you could go and feed Lorikeet Birds. Several touch tanks as well. Various Rays and a few different eating stops too. I really enjoyed my visit here. There was plenty of people here when we went in but it never felt too busy or too crowded. .\nShow less"], ["Reviewed October 11, 2017", 4.0, "Great spot for a few hours", "Maybe a little pricey for the size of the aquarium, BUT our family had a great time. Something for everyone! They have a great collection of things you don't see just everywhere. We were most impressed with the collection of jellyfish. It was quite crowded on the Saturday we were there, but we still enjoyed ourselves.\nShow less"], ["Reviewed October 9, 2017", 4.0, "Small but Good", "We enjoyed taking our two year old grandsons here. It was a Saturday and quite busy, but exhibits are spread out and it was still enjoyable. There are interactive displays and outside areas as well that help."], ["Reviewed October 7, 2017", 4.0, "Pre-Honeymoon", "Very family friendly. A little spendy but was very cool. Had a lot of different marine life. Staff was kind."], ["Reviewed October 7, 2017", 4.0, "Smaller than expected", "Smaller than expected but still an enjoyable hour or so. Would recommend for families. Nice location for a little walk afterwards."], ["Reviewed October 6, 2017", 4.0, "Visit", "This was my second visit to the aquarium of the pacific. I really enjoyed the aquarium with the colorful fish. Also liked the sea otter tank and seal/sea lion tank. For friend and myself it best to go on their senior citizen promotion day. We're planning on coming next year.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Special Day Everyday", "I'm a local to Long Beach, and we are pass holders. I never get tired of going to the Aquarium of the Pacific. It's always clean, staff are so nice, extremely kid friendly. They do a great deal of rescue-rehabilitate-release for sea-life. I feel it's important to financially support these types of organizations. <3\nShow less"], ["Reviewed October 4, 2017", 4.0, "Very nice / clean / interesting", "Lots of jellyfish. Very interesting and interactive - great for kids. They are expanding, which is needed. Parking lot across the street - $8.00 with validation"], ["Reviewed October 4, 2017", 4.0, "Not a big aquarium goer, but I do like this one", "I have been to this aquarium 10 times in 20+ years. Always clean, great exhibits, large pools, and the kids section outside is well run and organized."], ["Reviewed October 3, 2017", 5.0, "Beauty and nature galore", "The Aquarium is so clean, as are all the fish tanks. One can truly see what's behind the glass and make this a fun and educational experience.\nAlso the outdoors areas with touching the starfish, little sharks, all under supervision is amazing! Love everything about it as so much beauty, love, nature and learning has been put into one amazing place.\nTake your time when there. Don't rush it. You want to see it all, unless you want to divide your experience into two days, one outside when the weather is gorgeous which is most of the time, and one indoors, when it's overcast or raining, not so often.\nThis is an outing I can recommend for anyone, including children, elderly, handicapped people as it's wheelchair accessible.\nHave a fun day there, just as I did!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Happy place to be", "Always loved marine life. From fishes to otters to jellies, always fun to watch. The place wasn’t that big but big enough to have interesting and not so big marine animals in one roof."], ["Reviewed October 2, 2017", 4.0, "Family fun", "Also, good place to bring your nice camera. Lot's of challenging environments and beautiful fish to capture pictures of."], ["Reviewed September 30, 2017", 5.0, "Super cool!!!", "This place was great! One of the better aquariums I have been to, and really fun to see what’s along the pacific coast and ocean! This is my first time to California, let alone Long Beach, and it definitely lived up to the hype."], ["Reviewed September 29, 2017", 5.0, "Packed with Information and Experiences", "Great way to spend the day indoors! Lots of interactive exhibits and interesting live shows. Staff were enthusiastic and generous with handing out information and interesting facts.\n\nDisplays are laid out very well. Bonus points for the accompanying passport that children can stamp at each exhibit. I love that they emphasize sustainability and conservation wherever they can.\n\nBring your own food if you are not into the typical American diet. They don't allow any outside food in the Aquarium which is such a bummer -there are slim to none healthy choices in the cafe/eatery. I just munched on my own food (discreetly) as I went along but you can use the picnic tables outside.\nShow less"], ["Reviewed September 29, 2017", 3.0, "Kids love it", "Very popular with families and kids seem to love it. Excited kids create noise so avoid visiting if you are looking for a quiet time. Maybe during term time is quieter. Not a huge amount of information about the various species on display. Nonetheless some of the tanks have some really beautiful fish in them. Didn't see many big fish.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Reunion on the Queen Mary", "There is a free city bus that took us from the Queen Mary to the Aquarium. This Aquarium is fantastic. It is very educational and the staff are very helpful and professional. There is so much to see there."], ["Reviewed September 27, 2017", 5.0, "Vacation", "The Aquarium of the Pacific is a must see while you're in Long Beach have a great lunch at Bubba Gump's and then take a harbor to her"], ["Reviewed September 25, 2017", 4.0, "Great place Very crowded on Sunday..", "Nice place to visit but very crowded during our Sunday visit. The kids enjoyed all the exhibits (especially feeding the birds and touching the sting rays)"], ["Reviewed September 24, 2017", 4.0, "Nice selection of sea life", "Nice aquarium and good selection of animals on display. A lot of interactive petting pools for the kids. Aquarium can be very busy during the summer. Recommend getting there early during the summer months to get parking near by."], ["Reviewed September 24, 2017", 5.0, "Lots of fun for the family", "We have enjoyed going to the aquarium for about two now. Our son loves watching the fish and we always have a good time."], ["Reviewed September 24, 2017", 5.0, "Nice place!", "Excellent aquarium. Quite large. Lots of exhibits. Kind of pricey, but they do have a military discount. Overall, a nice place."], ["Reviewed September 24, 2017", 5.0, "Really nice for adults as well", "Visited the Aquarium with a friend. We just loved it, and only hoped we would have had more time to spend there, unfortunately we were only passing through LA. It was definitely still worth a visit. The only thing we would hope to be better is the signs, sometimes we found it a bit confusing to figure out where we should be going next. We visited in the morning during a week which also seemingly was a good time for a visit as there were not too big crowds to get in the way of seeing things. Lots to see there.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Wonderful Selection!", "My husband and I love to visit aquariums when traveling. This is now one of our favorites. We loved the range of animals and sea life and the hands-on experiences. My favorite part was feeding the lorikeets. We did find the map a bit confusing and the photo that was taken of us was not good - it showed all the renovations in the background, so we did not purchase it. They might want to consider using a backdrop for future pictures.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Seahorses and Sea Dragons!", "I went to this aquarium, because I saw that they had a seahorse and sea dragon promotion. I have never seen seahorses or sea dragons, and I was pleasantly surprised with the quantities that they had at this aquarium. It was a magical experience! I probably would go to this aquarium again if I was in Long Beach.\nShow less"], ["Reviewed September 20, 2017", 3.0, "Good for kids but otherwise disappointing", "I was looking forward to visiting this aquarium but was left feeling disappointed. It did not have the wow factor that I was expecting. However, kids would love it.\n\nThere were plenty of staff on hand to explain and answer questions. Also several interactive areas where you could touch live creatures.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Interactive Too!", "Mi Familia And I also got a kick out of getting to actually pet the sea life. We try to visit this expansive learning aquarium at least every quarter, when time allows, during our many trips to Long Beach."], ["Reviewed September 17, 2017", 4.0, "Big aquarium", "This is definitely the biggest aquarium I think I've ever been to. It was a bit confusing walking around inside as a lot of the entrances looked similar. I'm unsure if a map was available but we weren't given one, this probably would've helped. Was really good for kids & we really enjoyed it, just found it a little pricey.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Best aquarium we have been to...", "My son is a teen so it's not always easy to entertain or get him excited...we decided (I actually decided) to check out the LB aquarium and I was so impressed! There is so many interactive stations and a lovely mixture of exhibits...any age will surely enjoy this aquarium...\nShow less"], ["Reviewed September 15, 2017", 5.0, "The best aquarium I have been to!", "This is the best aquarium I have been to! It is enormous with both outdoor and indoor sections. I love that the tanks are split up into zones so you learn what species are found where. We watched the sea lion show which was very popular - we were unable to get a seat! So we watched from an upper viewing area and the show was fantastic! We saw a sea lion painting! It's so good to see that keepers are making sure their animals are kept stimulated since they are kept in a captive environment. There are a few interactive areas for kids and adults alike. I particularly liked the shark touch pool outside and my niece and nephew liked that too. There are water filling stations located around the aquarium for hot days like the day we went and I like the fact the aquarium is encouraging visitors to reuse bottles. The gift shop is vast and there are so many lovely things in there! Will definitely be returning when I am next in Long Beach!\nShow less"], ["Reviewed September 14, 2017", 4.0, "Nice Aquarium", "It was insanely hot outside and the aquarium was a great break from the heat. Of course in comparison with Atlanta it pales but still a nice reprieve. The sea lions were fun to watch and the shark tanks were neat to explore."], ["Reviewed September 14, 2017", 5.0, "What a Day!", "Went with extended family from San Francisco and thoroughly enjoyed it. There were 14 of us (8 adults & 6 kiddos ages 1 1/2 to 6 years old) Everyone had a blast! Will definitely do this again!"], ["Reviewed September 13, 2017", 5.0, "Fun on a Rainy Day", "GREAT for kids of all ages. I've taken five year olds and 90-year-olds, and plenty of children, teens and adults in between. All loved the experience.\nWe were members for several years and now go 2-3 times a year, if we see discounts. This was a winter visit, but we also enjoy going into the chilly Northern Pacific on a hot day. The Aquarium keeps expanding and getting better every year. We most enjoy the otters, the puffins, and large aquariums with sea lions or sharks swimming overhead. Fun to go when the divers are feeding or cleaning, so when you first get there, ask for times of that and other feedings/special events when you go. The outdoor tide pools are fascinating, too, if it's sunny out.\nShow less"], ["Reviewed September 13, 2017", 4.0, "1/2 Day Trip", "Nice place, with great tanks and touch tanks for kids. Whole place can comfortably be seen in. 1/2 day."], ["Reviewed September 8, 2017", 4.0, "A Nice Aquarium", "We visited this place with our toddler daughter. Its a nice aquarium. There is a show going on at time we entered in which divers were in water and fishes were moving around them and we sat and watched it. There are penguins, sea lion and other sea life to be seen. There is a section for birds also. You can touch jelly fish in the pond. We liked it.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Great for Toddlers", "I visited the aquarium during Labor Day weekend and it was wasn't what I expected. For starters, the parking sucks. They have a shared parking lots with the Pike Outlets and it's pretty hectic getting in and unless you score a spot from someone that is leaving, expect to park on the top level. I don't usually mind parking at the top but the elevators are very small and they get very full very fast. So that was annoying especially because we have a stroller.\n\nIt was insanely hot and humid and very crowded (holiday weekend) so upon arriving it was very stuffy from everyone trying to cool off in the auditorium.\n\nThere weren't as many exhibits as I thought there would be but the ones we did go to were pretty awesome. There were two reefs you could touch the fish and small sharks as well other sea life.\n\nThe shark tank was our favorite! Mostly black tip reef sharks and sting rays, but still very cool.\n\nWe also went into the \"bird cage\" and fed nectar to the parakeets (I think that's what they were), penguin exhibit and the seals & sea lion exhibit. All very fun and cute to see them swim. The sea otters were very playful and my daughter had a great time watching them.\n\nThere is a splash zone that my toddler loved and had a great time. So we let her play as we watched and had a beer and cooled off.\n\nI would recommend coming on a weekday or early on the weekend to beat the crowds (especially parking) and the heat if you plan to visit during a southern California heatwave.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Night Dives are the BEST", "I love the Aquarium, it's so relaxing, very clean and beautiful exhibits. I go as often as I can to escape the heat and just watch the fishies swim. The jelly fish and sting ray exhibits are my absolute favorite, I have to visit these every single time I am here.\nMy favorite nights to come are the night dives, adults only 18+, there's live music, bars set up throughout the Aquarium and outside, food trucks outside with lots to choose from and great speakers and lectures to listen in on. They even have live artists. Such a beautiful place and it doesn't take the entire day to explore or break the bank.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Small but beautiful aquarium with wonderful exhibits.", "Though it's not a large aquarium and can be crowded on weekends and holidays, the Aquarium of the Pacific is beautiful and has terrific indoor and outdoor exhibits, many of which are interactive or allow touching. There is a children's play area with some water play, and there is a lot of staff on hand to answer questions and explain exhibits. The rescued sea lions, harbor seals, and sea otters are special favorites, as is the large kelp forest exhibit, the sharks, the penguins, and the jellies. Life-size models of blue and gray whales hang overhead on the main floor. There are puppet shows, films, and talks –for the compact size of the aquarium, there is a lot to do. Visitors will need at least 2-3 hours to see and do it all . The location on Rainbow Harbor is beautiful, and boats are available a very short walk away for harbor cruises and whale watch cruises. Note: the aquarium is currently building a new wing which will substantially increase its size. Definitely a must-see if you are in the Long Beach area.\nShow less"], ["Reviewed September 6, 2017", 4.0, "We enjoyed ourselves!", "Several reviewers make comparisons to the Monterey Bay Aquarium, which is a world-class aquatic museum in our neck of the woods. The Aquarium of the Pacific is much smaller, but does a good job with what it has. The touching ponds were great, there are several of them, with a decent variety of sea life to experience. We loved the lorikeets, the seahorses, and the penguins! Because it's a aquatic park, you won't need to spend an entire day there, but it's worth a visit. If you have a young child who's interested in aquatic life, it's a must. You won't be disappointed!\nShow less"], ["Reviewed September 6, 2017", 3.0, "average at best", "the good\n------------\nthe gift shop is amazing\nplenty of benches around the facility\nsome displays are interesting to watch for long periods\n\nthe bad\n----------\nnoisy from so many shrieking children\nthe displays are disjointed and don't flow from one to the next\nexpensive\nnot as big as you might think. I saw all i needed to in ~20 minutes.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Incredible place.", "Outstanding aquarium with wonderful educational programs. Very clean, good food in the cafeteria, fabulous exhibits. This is really a world-class aquarium for a very reasonable price."], ["Reviewed September 6, 2017", 5.0, "Jellies and Otters and Sharks, Oh My! All in Long Beach at the Aquarium of the Pacific!", "The stated mission of the Aquarium of the Pacific is to focus on the animals found in (and on) the beautiful waters of the great Pacific Ocean. The facility is modern and comfortable and well-designed to allow visitors to get a fuller appreciation of the great variety of life found in the Pacific. There are also exhibits focusing on efforts to preserve and protect these fragile ecosystems. Since its opening it has grown in scope and popularity, and it is being expanded to offer even more education concerning Pacific marine life. Well worth a visit to lovely downtown Long Beach!\nShow less"], ["Reviewed September 6, 2017", 4.0, "Enjoyable day at the Aquarium!", "We had an awesome day at the aquarium. I've been there several times, but this was the first time with my 2 year old granddaughter.\nShe absolutely loved it and I got to see the aquarium through the eyes of a 2 year old and it's amazing.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Great for my 2 year old", "We bought a family membership and my 2 year old is loving it so far. The staff are really great with the kids, especially on weekdays when it's less busy. There is so much to see and do, our experience is different every time! The aquarium is a nice large, clean facility with restaurants and plenty of bathrooms on site. The shoreline is also a great place to spend the day afterwards.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Fun for all!", "It's a great place to go with kids and adults! It gets quite crowded, but what attraction in So Cal isn't. Very informative and enjoyable for all!"], ["Reviewed September 6, 2017", 5.0, "Get close to the sea creatures!", "This is a large site. The tanks are huge and there are a diverse range of fish. You can touch the ray fish, sharks, and even jelly fish. The otters are beautiful and if you catch sight of them whilst they are swimming, you may be lucky to see them do tumble rolls in the water. You can buy a ticket to this attraction alone or there are joint tickets available for the Queen Anne cruise ship and IOWA battleship at a discount.\nShow less"], ["Reviewed September 5, 2017", 3.0, "Average aquarium- very busy", "This aquarium has some neat aspects to it, and it also has some shortfalls. The ticket price for general admission is a bit high. We went on labor day weekend and it was PACKED. We could barely walk through most of the aquarium. Strollers, wagons, inpatient people (and kids) everywhere!\nWe enjoyed the visit and walked through most of it within 2 hours. It was undergoing some renovation so it was a bit unoragnized. It was a very hot day but that didn't stop people from showing up. There is a lot to see and it was pretty neat to see many of the jellifish they had on display.\nThe giftshop is HUGE and has a lot of neat things. Leave yourself some time to browse.\nParking was right across from the aquarium and it was $8 for 8 hours. If you go a minute over 8 hours you will pay $16 upto 24 hours.\nIf you do the whale watching or harbor tour offered next door by harbor breeze, get your tickets from them directly as they offer some discounts that the aquairum combined pass doesnt.\nWe enjoyed the aquarium but probably wont visit agan.\nShow less"], ["Reviewed September 4, 2017", 4.0, "The Behind the Scenes tour rocks!", "Please take the Behind the Scenes tour! It really changes your visit from just viewing sea life (and hopefully reading something about it) to a new level. To see and understand how the aquarium functions was a true highlight for our group. All adults and teens in our group were engaged. The teens are even considering volunteer work there when they are a little older.\nThe only downside of the visit was food service. The food service staff was overwhelmed with the needs of visitors on a busy holiday weekend.\nShow less"], ["Reviewed September 3, 2017", 5.0, "A world class aquarium that is getting better every year.", "I am from the Monterey Bay area and we are absolutely spoiled by the Monterey Bay Aquarium. But if you are near Long Beach do not miss the Aquarium of the Pacific. It is very very different from MBA and has many things to see that are not at MBA.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Great Aqaruim!", "Best Aquruim so far . Lots to do & see very educational .Totally recommend for small families.Keep the kids busy for hrs😃"], ["Reviewed August 31, 2017", 4.0, "Small but lots of hands on", "This aquarium isn't huge but its got lots of interactive options. You can pet the stingrays sharks jelly fish crabs anenomes etc"], ["Reviewed August 30, 2017", 5.0, "Great Family Fun!", "We went with the grandsons and everyone had a great time. It's especially fun to follow the kids map and collect the stamps at the various stations throughout the aquarium. I would do that even if I went alone; it was such a great way to make sure to see everything.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Super way to spend a few hours!!", "We live in Boston and have been to quite a few east coast aquariums but believe this is the best aquarium we've ever been to. The sea horse and jellyfish exhibits alone are worth the trip - absolutely FANTASTIC! We spent over 30 minutes at the touch tanks and another 30 minutes feeding the lorikeets. Just really a great place and we will definitely be back.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Great date place", "Went on Sunday afternoon, not an optimal time for a date, but enjoyed it. Lots of families.The lorikeet exhibit was neat. Seals, sea lions, penguins, sharks, rays, jelly fish, frogs, etc. Hands on exhibits for the kids.\n\nStop by the information booth on the way to the Aquarium ticket counter and ask for any discount coupons. We scored ones worth $8 off admission!\nShow less"], ["Reviewed August 26, 2017", 4.0, "Neat little place", "Took the grandchild to the aquarium and had a good time. Its not the biggest but it did offer alot of interactivity for the little ones. The price for admission was reasonable and the food court offered a pretty decent menu that wasn't too bad at all although the prices were what you might expect but not absurd. Overall, a nice day spent! Also, the surrounding area offered great sights and scenery with several eating options.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Very good, not quite New England, but great day out", "We spent nearly a full Friday at the aquarium, the exhibits are splendid and the staff very friendly. It lacks the scale of the New England equivalent, but is redeveloping itself. But really worth a day out, strongly recommended."], ["Reviewed August 25, 2017", 5.0, "Plenty of toddler friendly activities!", "Our toddler loves our aquarium in South Carolina so we were excited to take her to the aquarium of the pacific - she went NUTS watching the sea lions and during the sea lion show! It was very toddler friendly with areas she could climb on with soft flooring underneath, big open spaces from exhibit to exhibit, and not too many stairs she had to climb - it was all in all a really great day and this aquarium is top-notch. Easy parking too.\nShow less"], ["Reviewed August 23, 2017", 5.0, "making a memory", "We love sea life. This is one of our favorite spots because I love the birds...locknees (?) of course all of the park."], ["Reviewed August 23, 2017", 5.0, "Long Beach Aquarium of the Pacific", "We love the aquarium and have been members for many years. We now have a \"grandparents\" membership that allows us to take our grandchildren as often as we want. With young children it is nice to go for a couple of hours on several days (rather that a one day pass where you need to see it all) The variety of marine animals is amazing and there are numerous special events throughout the year.\nShow less"], ["Reviewed August 21, 2017", 5.0, "One of the best Aquariums we have been too!", "We had a great time here - really top Aquarium with lots to see and do; Staff were knowledgeable and we had a good time."], ["Reviewed August 20, 2017", 5.0, "Exhibits were very educational and exceptional", "Very cool to be able to touch the jellyfish. Sharks. And stingray. A very clean facility and employees were always around to help."], ["Reviewed August 20, 2017", 3.0, "Aquarium", "We were a little disappointed with this aquarium. I expected it to be on a far larger scale. It was quite nice but more of a place for schools to visit, this is only my opinion. They are carrying out work to extend so hopefully it will hold more in the future.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Great Aquarium", "This is a great aquarium. My favorites were the ever popular jelly fish and the sea horses. They also have otters but there were so many children and their parents next to the exhibit that we just caught a glimpse of them. There is also an aviary which we enjoyed. Beautiful fish and sea life in pristine tanks. Nice gift shop. There are also touch pools for rays and sharks which was fun.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Enjoyable and educational experience", "This is a great place to take children. Entry is $30 per person. But check for deals on Exoedia. Also package tickets for the aquarium and the zoo or the harbor cruise. It is an interactive aquarium and kids can pet some of the sharks and starfish. Half of the aquarium is outside so bring a hat, sunglasses and sunblock. The shark tank is very impressive. The puffins are very cute. All in all, a very enjoyable time. Parking is eight dollars if validated at the aquarium.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Great spot to learn about the ocean", "The Aquarium of the Pacific is a very nice place to learn about the ocean and the creatures that inhabit it. It is easy to get to and a fun and educational place to spend much of a day."], ["Reviewed August 16, 2017", 5.0, "Summer Visit", "My family and I visited the Aquarium of the Pacific twice in three days. We tried to go on Sunday after buying a joint ticket with admission for USS Iowa and the Aquarium of the Pacific. Unfortunately, the parking in Long Beach is an absolute nightmare. There was no parking in the area at all thanks to a concert or festival. Since we were unable to park and attend the aquarium, we called and were happily told that the tickets we had could be used any day within a certain period of time. So we were able to come back on Tuesday. If you go, I highly recommend that you go as early as possible in the day and go earlier than you think to allow for time to park.\n\nNow, the aquarium itself was really well done. We thoroughly enjoyed both indoor and outdoor exhibits. We were even lucky enough to be chosen for a free behind the scenes tour. On that tour we got some insight on the exhibits, feeding of the animals, and speaking with some of the volunteer divers that help feed the fish.\n\nOverall, good experience without the parking mishap.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Also for adults", "Took my brothers family there and we had a great time. There is so much to do and and see. I was very impressed with the layout and architecture. Made me very proud of my home town."], ["Reviewed August 16, 2017", 3.0, "good place to visit", "It's not as good as other aquariums I have been but you won't waste your time specially worth it when they have an exhibitions. I think once per moth they have free admissions but not sure when"], ["Reviewed August 16, 2017", 5.0, "Worth a visit!", "What an impressive aquarium...one of the best we've seen! Very well done and maintained with plenty to do and see for all ages. The staff is knowledgeable, friendly and informative. You won't be disappointed and you get your money's worth with a 2-3 hour visit. Highly recommended!\nShow less"], ["Reviewed August 16, 2017", 3.0, "Disappointing", "My kids took me here as part of my Mothers Day present in 2016. I was astonished at how expensive it was on a week day! While the exhibits inside were interesting, the outside exhibits were very disappointing. We didn't see all of the penguins and other creatures you see advertised on the television and overall, didn't see value in the $100+ they spent on our 3 tickets and parking. There were a ton of kids there and I know it's probably normal, but it made it difficult to enjoy the inside exhibits especially. Won't go back.\nShow less"], ["Reviewed August 16, 2017", 5.0, "MY FAVORITE AQUARIUM BY FAR!", "SO AMAZING! I love visiting aquariums when in different cities. The staff and the whole set up of the aquarium was spectacular!"], ["Reviewed August 14, 2017", 5.0, "Best family aquarium", "Perfect size and exhibits for our 5yo's. Lots of touch tanks and small exhibits. Follow it up with a whale watching tour to Make it a perfect day!"], ["Reviewed August 14, 2017", 5.0, "Fascinating place, visit with small children or teens", "Something for everyone here. Just a cool fascinating place for an afternoon. The indoor exhibits are interesting, some are mesmerizing where you can just watch for a long time. There are many hands-on things too where kids can touch many types of sea creatures. Jellyfish, sea horses, sharks, crabs, rays and so many more fascinating things to learn about. If you're AAA members you can get tickets at a discount.\nShow less"], ["Reviewed August 13, 2017", 5.0, "The best aquarium!", "I will make this review straight to the point...Aquarium of the Pacific is the best Aquarium hands down. APOP continues to update itself and we enjoy it every time we come down to LB."], ["Reviewed August 12, 2017", 5.0, "Loved this", "In Melbourne Australia we have a huge aquarium so any other seems small.\n\nHowever we did the behind the scenes tour which was great. Our tour guide was friendly and smiled the whole time. She was genuine and gave us great insight into the programs they run and how the aquarium operates.\n\nWe fed the fish from above. And had an amazing time.\n\nI felt however that the seal and otter enclosures were small. Too small. But they seemed to be having a good time goofing around and the animals are all rehabilitated if possible so they are living a good life.\n\nIt was a great day! Well worth a look.\n\nShow less"], ["Reviewed August 12, 2017", 4.0, "Interesting aquarium", "A lot of different species :sea otter, seal , all kind of fishes, birds A lot of Little annimations Good place to visit with children"], ["Reviewed August 12, 2017", 5.0, "Conference diacount", "We got a significant discount on admission thanks to a deal offered through a conference we were attending at one of the nearby hotels. I'm not sure this place is really worth the full admission, which as of this writing, was around $30/adult. They have a good variety of marine and wildlife, including penguins, birds, sharks, and seals. Great time to go, too, on a weekend at evening and when the weather was beautiful -- it wasn't crowded at all. But compared to other, big city Aquariums that charge the same admission (think: Atlanta, Baltimore, etc.), this one was a bit underwhelming. Also, it's a nice setting, out near the marina, which made for a nice stroll afterwards.\n\nWord to the wise: go to directly to the website when checking operating hours; Google maps had it wrong.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Great Aquarium", "A very nice Aquarium with two levels in the main building divided into specific Pacific gallery areas. A large outdoor exhibit area includes a shark lagoon, otter, penguin, and seal exhibits as well as other marine life.\n\nCurrently they are adding a large addition to the front of the building, this construction does not interfere with visiting the Aquarium.\n\nThere is also a good sized gift store with a very good selection of aquatic oriented items.\n\nReduced parking fee is available for the parking structure across from the Aquarium.\n\nFrom the front of the Aquarium you have a nice view of the Queen Mary moored across the harbor.\nShow less"], ["Reviewed August 10, 2017", 4.0, "It is worth it!", "The Aquarium of the Pacific, at Long Beach, California, is very interesting, and it is different from other aquariums. There are many show rooms, with exhibitions, and there are \"shows\" scheduled at certain times of the day in certain areas around the tanks. The shows are not to put animals to do stunts. The \"shows\" are to teach for instance, how to feed, and how to take care of the different animals. The shows around the tanks are \"interactive\", and when the scuba diver is in the tank, s/he speaks with the audience/public, and answers the questions, especially from the children. There is an area where the public can \"touch\" the animals, supervised by the personnel of the aquarium. I was visiting the aquarium between 11am and 4pm, it was crowded but people flow from exhibition to exhibition, and you do not feel \"stuck\". There were many children and they speak loud, they yell, they get excited with the animals, and their moms too. So, if you do not like the \"noise\", you can bring your earphones with your favorite music, and put them on. Also there is a cafeteria if you want to eat a snack (or you can bring your own snack/food). And if you need to sit for a while, in between the exhibitions, there are comfortable chairs to rest. For us, the best part of the visit, was the \"Backstage Tour\" which you have to pay in addition to the general ticket. There are many \"Backstage Tours\" available, depending on your interests, and you need to make a reservation (time and day). With the purchase of any of the \"tours\" you can get a discount at the gift shop. We took the tour called \"Behind the Scenes Tour\" and it was very educational and exciting, because our guide took us through the backstage of the aquarium (through all those doors with a sign \"Only authorized personnel can enter\") and showed us most of the \"secrets\", and installations of the aquarium. We also could \"feed\" some of the animals (with the food that the guide gave us), we saw the \"clinic\" where the animals are taken care, the \"kitchen\" where the experts prepare the food for the animals, and many other very interesting places, that you do not even imagine, when you are visiting the aquarium from \"the other side\". The aquarium has bilingual guides (in many languages), if you need to. The staff of the aquarium is very friendly, and they are ready to help you at any time to make your visit very enjoyable. I highly recommend to visit this Aquarium of the Pacific at Long Beach, California. It is worth it!\nShow less"], ["Reviewed August 10, 2017", 5.0, "Under the Sea", "This was a lovely, well laid out aquarium...some of exhibits were inside and also outside. The Lorakeet birds were amazing...an outside room where you could feed them a sugar syrup...the would land on you and eat. They were beautiful colors...a fascinating exhibit."], ["Reviewed August 10, 2017", 2.0, "Glad that I used my City Pass", "We expected more from this aquarium! We enjoyed long beach, but did not enjoy this aquarium at all. It was way too packed and there weren't many exhibits. We covered this place in an hour or less. We never plan to visit again. The only way that I would recommend others to visit is if they have the City Pass. I would have been mad had I paid additional money for admission.\nShow less"], ["Reviewed August 9, 2017", 5.0, "In Love with the aquarium 💓", "Had an amazing time with my children and hubby we come here every year and it always feels like first visit love it!"], ["Reviewed August 8, 2017", 5.0, "Great family time", "This place is a great teaching environment for our kids. The tour the kids can go on and emboss the booklet for each animal or species is fundamentally needed for them to learn about these precious ecosystems of our planet and how important it is to preserve them. The hands on learning stations are great for learning and exploring of all ages. Then when you done with the Aquarium you can enjoy the pier and light house.\nShow less"], ["Reviewed August 7, 2017", 3.0, "Great hands on", "We bought a Go Card LA, so we spent a day in Long Beach to get the biggest bang for our buck. We stamped our hands and took a bus to Queen Mary, no problems getting back in!\nI would say an hour is all you need here. Some construction but nothing too annoying. Save your trip for the afternoon. Lots of school age kids on buses in morning and early afternoon.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Awesome Aquarium", "We went with a group of teens. They had a great time exploring the exhibits and the shows. This is definitely a great change from theme parks for teens if you have several days in the area. It is busy with lots of little kids but cool and shady for hot sunny days.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Excellent", "One of the best aquariums I've been too . Great value too as done as a combo ticket with the queen mary . One tip try to avoid all the school trips as this can be a pain with hundreds of kids with no manners"], ["Reviewed August 7, 2017", 4.0, "Exterior under rennovation, go after 5 pm for discounted tickets", "during summer, the aquarium is open late (8pm) and has discounted tickets. Great deal, given the size of the family crowds here. The exterior is under construction but doesn't impact the displays inside. Highlights are the \"touch labs\" where you can pet the moon jellies, crabs, anemones, and more. Easy parking in the garage across the street and validation inside the aquarium can help with the cost. We spent about 90 minutes here and saw everything.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Must See for Kids if in Long Beach!", "Recently went here with the family during a trip, and was really surprised. We have been the The Shedd in Chicago, which we consider to be the benchmark for aquariums, and the Aquarium of the Pacific does not disappoint, even compared to that standard. There is plenty to see, and for a reasonable price (can easily find deals at $20 or less per person and combos with other museums/attractions).\n\nThe staff was very friendly and knowledgeable. They have plenty of educational volunteers that talk to the kids about the animals as well.\n\nThe aquarium is currently undergoing a major construction project adding on the the facility, so be prepared for some inconvenience and some noise. It is minimal though. After seeing the models and reading about what they are building...we will definitely be back!!\n\nParking is about $8 with a validation from the Museum.\n\nFor people that are not familiar with the area, it is located right at the harbor. There are Harbor and Catalina tour bouts right outside the doors and plenty of shopping and restaurants nearby.\n\nGive yourself about 6 hours with kids to get through it all.\n\nThey have a gift shop that is really large, with fair prices.\n\nOverall, a great experience that I highly recommend to ANYONE, not just folks with kids.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Nice place to understand underwater species!!!", "We went with a kid.. and she enjoyed it a lot.. There is a trampoline outside the aquarium.. which is kid's favorite too😊"], ["Reviewed August 3, 2017", 4.0, "Nice visit", "This is a very good aquarium in our backyard. It's a nice day with plenty of exhibits. We took the Behind the Scenes Tour and really enjoyed seeing what it takes to keep the aquarium functional. Worthwhile area attraction to visit. Plenty of restaurants within walking distance.\nShow less"], ["Reviewed August 3, 2017", 3.0, "A Great Place to go to see a sea of strollers and hear the sound of screaming children. Skip the cafe.", "NOISY AND CHAOTIC!\nI had seen the Aquarium of the Pacific advertised for years and finally made the trip to Long Beach for a visit.\n\nOur first mistake was going on a Saturday in the summer. The aquarium was really crowded -- mostly with families with lots and lots of strollers and young kids. (I'm not sure why people take kids that are under 5). It was not the peaceful, serene experience I'd imagined, staring into tranquil aquariums with gurgling peaceful music playing in the background, with educational talks by scientist types. No, it was a noisy, bustling, chaotic, bordering on unpleasant experience with smart phones in your face. The educators were either volunteers or under-25s in skinny jeans, their talks clearly aimed at the 4-12 year olds.\n\nGOING THROUGH A RENOVATION (SUMMER 2017)\nThe outside is currently being renovated, so there are temporary porta-kiosks where you pay. Fortunately, we had a coupon for $8 off that we found in the Long Beach Visitor Guide, which took some of the sting out of the expensive admission. ($29.95 in 2017).\n\nGO ELSEWHERE FOR FOOD - SKIP THE SCUBA CAFE\nI would skip the 'Scuba Cafe' as it was just as chaotic with mediocre food. It was difficult to find a table and then we waited for our food to the sound of more screaming kids. The overly-fishy smelling fish tacos were something to put in our stomachs, but nothing to write home about. On reflection, we should have had our hands stamped and gone somewhere else.\n\nMORE RESTROOMS NEEDED\nThere should be more restroom stalls for ladies as there were continuous lines outside the door. When I did finally get in a stall, (one of those with huge gaps around the edge so everyone can see in while you're doing your thing!) a yellow pool of liquid was rapidly rolling towards my feet from the stall next to me. A mother used a paper towel under her foot to mop it up, luckily right before it reached me. Ugh!\n\nTHE SEA LIFE\nIf you can see past all the strollers and smart phones, you may enjoy the sea life. We did enjoy seeing the different exhibits about sharks, penguins, frogs, sea lions, seahorses, tropical fish, etc. Our favorites were probably the different varieties of jelly fish, especially the ones that 'light up'.\n\nEXIT THROUGH THE GIFT SHOP\nThere is a large gift shop with all things sea-themed, toys, books, housewares, T-shirts, key-rings, the usual touristy trinkets.\n\nGO WHILE SCHOOL IS IN SESSION\nWe left the aquarium having spent about 5 hours there including time for lunch. I would recommend other child-free adults to go on a weekday during the off-season. To be honest, we were kind of glad to leave.\n\nIf you found this review useful, please click the 'thank' button. Happy travels.\nShow less"]]}}