{"Aquarium of the Bay": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Aquarium of the Bay", "url": "/Attraction_Review-g60713-d527436-Reviews-Aquarium_of_the_Bay-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/14/1d/77/moon-jelly.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "reviewCount": "1373"}, "address": {"@type": "PostalAddress", "streetAddress": "Embarcadero & Beach St Pier 39", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94133", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 3.0, "modestly Interesting exhibits but WAY over priced", "$26.30 per person and you will see everything in less than an hour if you really milk it. The river otters playing are the best part. The glass tunnel through the fish tank though the curved plexiglass distorts depth perception and size. Lots of local fish including large sturgeon and a variety of bay sharks. Some of the exhibits missed the mark. I didn't visit to see South American tortoises or pet-store chinchillas or an interactive dinosaur animation. I was looking for all local aquatic and riparian critters. The ray petting pools and tide pool mock-up are cool. On the down-side, the exhibit plaques are written to uphold Eco-extremism ideals, painting fishermen as villains. So when you finish the exhibit, go to any local diner & have a big fish dinner, without which Fisherman's Wharf would not exist.\nShow less"], ["Reviewed 1 week ago", 3.0, "Not that great....", "If I had a do-over, I would have skipped this aquarium. It is relatively small and pretty dated in my opinion. I'm not sure we spent more than a half hour here (and I'm generally a fan of aquariums)."], ["Reviewed 3 weeks ago", 5.0, "Fascinating", "We used our GoCard for our admission. This isn't the largest aquarium, but it has fascinating sea life to see. Children would live it."], ["Reviewed 4 weeks ago", 4.0, "The otter was awesome", "This is a cute little aquarium that has a fun staff and a good location. The juvenile otter was the best. My Son took off his hat and waved it my the water tank and the otter followed the hats movement.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fabulous", "We got into this place free,due to our bus hop on hop off ticket,BONUS It was lovely,we got to gently feel a sting ray.We saw beautiful,playfull otters,they were just gorgeous.Loads of fish as well,and sharks and rays.Very interesting and staff very friendly and welcoming\nShow less"], ["Reviewed January 23, 2018", 5.0, "Worth the Money", "Very inexpensive and simply amazing. Great staff, knowledgeable and friendly. The aquarium will amaze you with each step.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Do the behind the scenes tour", "Great variety of Bay creatures. We were the only people on the behind the scenes tour ($17 each). It was interesting to see how the Aquarium works. You get a view above the tanks looking down (the fish are larger then they look in the tunnel). Afterwards we went into the exhibits and were impressed. The otters are very cute and watching the feeding was entertaining. We love the augmented reality feature and they email photos to you (free ). Gift shop had reasonable prices and variety.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Quite small, but interesting and for a cause", "Compared with other aquariums, the Aquarium of the Bay in Pier 39 of San Francisco is quite small and has a limited collection of sea animals on display. This may result a bit disappointing when admission ticket costs $27. Console yourself knowing that every time you visit this aquarium, you donate a small amount for the conservation and protection of the San Francisco Bay and of the animals that thrive in it. In fact, 88 cents of every $1 you pay go to such a program.\n\nThe area is divided into two levels ... the Entrance Level (where you'll meet Tahoe, an otter; have a chance to touch some sea animals, like star fish, small rays and sharks; etc.) and the Bottom Floor (with tunnels and glass containers for jelly fish, octopuses, and so forth).\n\nPerhaps the interesting part of the visit to this aquarium is the feeding time of the animals. Be sure to check the schedule as you enter the place. On your way out of the museum, on the same Entrance Level, you'll find a gift shop. Now be sure to keep you ticket, because it also entitles you to visit the EcoCenter at Heron's Head Park and the Bay Model Alliance in Sausalito. Also visit the Sea Lion Center at K dock for free to observe the sea lions of the Bay.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Otherwordly....", "If you want to be amazed and frightened at the same time. Go to the Aquarium of the Bay. So many beautiful ocean species to ponder over. There are also many otherworldly and strange creatures to run away from. Fun for the family for the whole day. It never felt overcrowded and very easy to navigate. Enjoy your trip to another world.\nShow less"], ["Reviewed December 15, 2017", 2.0, "Overpriced", "This would be a cute thing to do if it was half the price. And on top of it, they actually have the nerve to change the ticket prices whenever they want for no reason. I had gone on the website to look at tickets on a Monday or Tuesday. The family pass was $70 (for 4 people). When I went back on the website 2 days later, I thought I was going crazy or something...it was $80. The only reason I went is because I promised my daughter many times. From what I hear, there are much better aquariums.\nShow less"], ["Reviewed November 28, 2017", 4.0, "Fab place to bring young kids", "This wonderful aquarium, located in Embarcadero and Beach Street, is a lively place and ideal to bring young kids. Should visit while in San Francisco. Beauty of this place is they display local aquatic animals which tourists won't find back in their countries.\nThey have different pricing packages depending on your age & group sizes.\nShow less"], ["Reviewed November 19, 2017", 3.0, "Looks a bit tired and run down", "Glad it was included on our 3 day Go San Fran card, as normally it would have been expensive for what it was. But still interesting and fun. Good place for the kids on a rainy day. Looks tired and run down compared to other aquariums we have visited\nShow less"], ["Reviewed November 16, 2017", 3.0, "Good visit", "This aquarium was pretty small compared to the other aquariums I have visited in other countries/places. There was only 1 \"tunnel\" where you can see underwater creatures. There's a place with otters that was practically the highlight of my visit. Other than that, it was just ok. You'll be able to kill time, but nothing that special about it.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Nice little Aquarium with gorgeous otters", "The Aquarium of the Bay is not huge, but there are a few interesting exhibits. I loved the colorful fishes and the touch pool with the baby bat rays. It is really special to touch the soft skin of them. The tunnel tank with the sharks and fishes is cool. The various types of Jellyfishes are beautiful and don’t miss the little Pacific Tree Frogs. My highlight was the gorgeous otters. They were in a playing mood and I could watch them a long time. I enjoyed the visit and spent almost two hours there.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Great interactive visit", "The visit is about 1.5 hours and you can see lots of fishes and sharks. There are 2 tunnels which are absolutely great. Check the timetable for fish/shark feeding, it's really interesting. It's interactive too, you can touch fishes !\nThe personnel is great and it's a sustainable place, environnemental friendly!\nGo there and you'll be amazed :)\nShow less"], ["Reviewed November 12, 2017", 1.0, "Wouldn’t spend another 70.00", "Family of 4 did the 70.00 family pass. I️t was worth about half that. Cool walking in the tunnel and seeing a few small sharks\nShow less"], ["Reviewed November 1, 2017", 4.0, "Local aquarium for the area", "Relatively small aquarium concentrating on local marine life- but very well done. 2 walk ways with mainly fish from the Bay, touch pools were you can stroke rays sharks anemones and star fish. Amazing variety of jelly fish. Everyone is very helpfyl. Two very busy otters farewell visitors.\nShow less"], ["Reviewed October 29, 2017", 3.0, "Aquarium", "Considering the location and the tourist crowds I would have expected something a bit larger here. I figure that a good visit would consume about 2 hours time. While initially I found it to be a bit pricy they do honour other museum memberships and offer discounts - ask.\n\nThe exhibits were nice and educational. And a few even provide interaction: you can touch sharks, rays, etc. The under water tunnel is also nice albeit the moving walkway was not functional. There is an otter exhibit but you need to be there at certain times (check) otherwise they are dormant.\nShow less"], ["Reviewed October 23, 2017", 3.0, "Mediocre", "I try to visit the aquariums of every city that I visit and felt rather underwhelmed by the Aquarium by the Bay. It's a bit small and my husband and toddler viewed the entire thing in less than an hour. Good for a research/ educational facility but couldn't help but feel that something was missing.\nShow less"], ["Reviewed October 14, 2017", 3.0, "Not worth the price", "It cost $50 for my husband and I to visit and we saw everything in 30 minutes. The otters were adorable and definitely the highlight. The underwater tunnel was underwhelming. Would not recommend wasting your money."], ["Reviewed October 11, 2017", 2.0, "Not worth the price of admission & rude, disinterested employees", "My husband and I are big aquarium geeks. We love us a good aquarium. We had such high hopes for the Aquarium of the Bay, but our expectations were definitely not met. From the employees who have personalities of coiled rattlesnakes or a dead fish (really depended on who you encountered) to the run-down atmosphere to the ridiculously high prices for essentially nothing - it was disappointing all the way around. We will not be back.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Very enjoyable", "A good place especially for families with young children, as there is a lot to see and gives a fascinating overview over wildlife native to the area and also more exotic species."], ["Reviewed October 9, 2017", 4.0, "Enjoyable displays of sealife", "Took two year old grandson to tour this aquarium. The two level site was staffed with friendly staff. You can avoid the nearby ticket booths and go direct to the ticket booth at the aquarium.\n\nThe top level has a few tanks to check out and then an elevator ride down one level takes you to two walk through glass tunnels. Sharks and fish glide by as you walk through\n\nOne display had an octopus plus they had displays where you can touch starfish and bat rays with a finger under the watchful eyes of staff\n\nThere is an adjacent gift shop. Just down the street from Pier 39\nShow less"], ["Reviewed October 6, 2017", 5.0, "Take the behind the scenes tour !", "This was a nice aquarium to learn about the bay area marine life. What really made the visit worth it, was the behind the scenes tour. It was so informative, It really helped you appreciate all the knowledge required to take care of these animals. So cool to see the aquarium from a different perspective. Literally, you walk above the tanks and the people that are walking thru the aquarium. definitely recommended if your are into marine life at all.\nShow less"], ["Reviewed October 5, 2017", 5.0, "So much better than expected!", "We only went to the aquarium to get some extra value from an under-used Go card, but this aquarium is really well laid out and has an excellent jelly fish display, great 'under bay' tunnel and a fabulous river otter display. Staff were really passionate and helpful and it was a fairly good price, most of which goes into sea life conservation. Highly recommend.\nShow less"], ["Reviewed October 2, 2017", 2.0, "Not worth the money.", "I let myself be convinced to join my 2 friends but this was a nice reminder of why I've stopped going to places like these. 26 Dollars is a lot of money for this..\nAlso the animals were in aquaria that were too small imo.. makes me sad.\nThat said.. the staff was nice.\nShow less"], ["Reviewed September 26, 2017", 3.0, "ok", "i love aquariums and tend to visit them when i come across one. this one is nice but nothing fantastic. it is quite small so was done very quickly\nthere is free wifi and the password is given to you when you buy your entrance ticket as printed on the ticket but was not told it was.\nShow less"], ["Reviewed September 22, 2017", 4.0, "Nothing Stunning but Decent", "Didn't had any plans but they were selling combos and it was only $10 extra for Aquarium to combine with Boat tours and we Did not regret.\nNot very big but well maintained area. Make sure to see the stunning Jellyfish of various types here.\nPretty much same as what I saw in Singapore.\nGood idea to combine with some combo package.\nShow less"], ["Reviewed September 19, 2017", 3.0, "Spur of the Moment Visit", "My family visited the Aquarium of the Bay, while we were on Fisherman's Wharf. It was one of the attractions included in the City Pass. It is a small aquarium with 3 floors accessed by elevator. Staff members operate the elevator and provide narration of what you are going to see. The exhibits highlight marine life in San Francisco Bay. It was an enjoyable way to spend an hour and a half. We especially liked the touch tank, the jellyfish exhibit and the sea otters. There is the opportunity to purchase photos taken during your visit. At the end of the tour you exit via a small gift shop.\nShow less"], ["Reviewed September 19, 2017", 3.0, "Just ok", "We went here because we had a free admission. We thought it was ok and saw some pretty cool tanks of fish."], ["Reviewed September 19, 2017", 4.0, "Small but entertaining", "Added this to our San Francisco pass mainly because my kids loved all things related to nature. Did this after a trip to Alcatraz in the morning. Nothing really special as we have visitied a lot of other aquariums round the world but kids really enjoyed it.\nShow less"], ["Reviewed September 17, 2017", 3.0, "Small Aquarium But Something to Do", "We had a large family group and were able to go through the aquarium together with no problems. This attraction was not very impressive, but gave us all something to do together. The glass tunnel is cool."], ["Reviewed September 13, 2017", 1.0, "Don't waste your time", "This is a truly lackluster aquarium. Very few exhibits. The entire thing can be done in 30 minutes going at a slow rate. There isn't much to see and feels like they haven't kept up with maintenance. Some of the tanks weren't well lit, they had a person working their taking on a $20 speaker/boombox, and portable AC units everywhere. It was about 80 degrees in there and muggy. Don't waste your time here. Your time is better spent taking in the scenery around the piers.\nShow less"], ["Reviewed September 10, 2017", 3.0, "Helpful staff, boring exhibits", "The staff was great in helping with CityPass disorganization, they will help you print out your pass and make suggestions on what's best value.\n\nFor an adult the exhibit can be boring and it is small. The elevator is super slow when they only have one available but they have staff operating it telling you what floor has what so that was nice though stairs would have been great option to.\n\nExpensive souvenirs shop.\nShow less"], ["Reviewed August 31, 2017", 2.0, "Friendly staff but I would pass it up next time", "We decided to go here because it's right on the wharf and I thought there would be a lot of educational hands-on displays. It was $25 each for my husband and I - which I assumed meant they had a lot to teach. The level we entered in had no really interesting displays. Things weren't labeled very well. I guess I was expecting something like a zoo aquarium.\nWe went to the floor with the overhead tank. There were many types of interesting fish, but only one decent sized shark. I will say it was very clean.\nWe were in and out in 30 minutes. I was really disappointed.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Well organized exhibits", "We enjoyed our visit here. The glass tunnels were quite good exhibits. Fun to see the fish schooling. The jellyfish were amazingly beautiful. The river otters were fun to watch too. This is a small facility that would likely have to charge lower admission fees were it not for its location on one of the busiest piers in the city. Still, a nice break from the maddening crowds on Pier 39.\nShow less"], ["Reviewed August 26, 2017", 4.0, "I loved the otters", "My husband and I visited recently, it was quite expensive to get in and it is on the smaller side.\nHowever we enjoyed our visit to the aquarium. We loved the talks that the staff gave,we saw the baby bat ray and otter talks.They were informative and everybody enjoyed it.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Small but all you need", "We got there early and got a discount. Once you pay you are welcomed to come back during the day. Which in fact we did. With a 3 year old this aquarium had so much to offer. The two giant tunnel tanks were amazing! Just for that is worth the trip. Very cute and the staff was very friendly and welcoming.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Small but well done", "We went as two adults and enjoyed this aquarium. It's definitely small, but there is a lot packed in there. Great displays with a nice focus on conservation. We particularly enjoyed the exceptionally long underwater viewing tunnel. The aquarium is a bit overpriced, although, it costs less than worse aquariums (Ripley's in Gatlinburg comes to mind), but most things in San Francisco are overpriced...\nShow less"], ["Reviewed August 21, 2017", 3.0, "Only good for very young kids", "I already knew this place was small and might disappoint, but I went anyway because we were in Pier 39 and it's part of the CityPass which I bought.\n\nOne of the first staff members we ran into was the guy who took the family photo when you entered. He's kind of annoying and rude. What's worse, the photos he took sucked.\n\nThen we got into the elevator that took you to the main floor of the aquarium. The operator was like a robot, spitting out the scripted intro and offering zero interaction.\n\nThe only highlight was the touch pools where you could touch the stingray and the star fish etc. The staff there seemed much more into their job.\n\nAll in all, we spent less than an hour in here, and only my 7-year-old twins enjoyed this stop. I definitely wouldn't pay full admission to enter this aquarium.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Nice Aquarium but Quite Small", "We arrived early, before 10am and they tickets were each $10 which I would advise taking advantage of since this quite small and doesn't take more than an hour to walk thru. We parked in the garage across the street which costs $10 an hour but it's great because you can walk around the pier and wharf easily. The aquarium had a good array of animals and the staff were all friendly and well informed. Tunnels to walk through and lots of information on the animals. Definitely take advantage of the touch tanks!\nShow less"], ["Reviewed August 14, 2017", 2.0, "Tourist trap", "We should have known better but the day was chilly and we wanted to get insiders warm up. $100 later we enter the aquarium. 3 small floors of mediocre displays. The anchovy tank was the highlight and downhill from there. Where were the 'sharks of Alcatraz'? Where was the touted octopus? We're we're the playful otters? ( sleeping) in less than a hour you are out the door unless you make a purchase in the gift shop. Save your money and take the 2 hour drive south to the Monterey Bay Aquarium.\nShow less"], ["Reviewed August 11, 2017", 3.0, "Quick Visit", "We got tickets to do this with the City Pass. It was fun for a quick walk through, and there are opportunities to touch a few of the creatures. I felt a little dizzy going through the under water tunnels so I probably went through a little faster than most. Lots of varieties of fish. My favorite was the different jelly fish. I think this would be more fun for a family with young children. Your ticket does let you come and go all day.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Very nice but small", "THis is a great aquarium and it is very educational. The staff is very informative and helpful. This is a small aquarium though and do not expect the visit to last more than 45-60 minutes."], ["Reviewed August 10, 2017", 5.0, "SF Go Pass", "First of all the go pass is a must. It gives you so many options of things to do. When we visited the aquarium the staff was very helpful. We happened to be there at shark feeding time which was pretty cool. You can have your hand stamped, go in and see a few exhibits and leave and come back as you please. Definitely a must whether you're with young children, teenage children or just yourself.\nShow less"], ["Reviewed August 9, 2017", 3.0, "Disappointing", "We bought tickets to go around here, like others hoping to pass some time away. Unfortunately, the experience was over in well under an hour.\n\nDon't get me wrong, there are some excellent things here (the tunnel, being able to touch fish and the brilliant otters at the end) but taking into account the time it takes to get around in relation to the cost, it is extremely poor value for money.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Great variety and good educational content", "You can see everything in a little over an hour here, so it's not a huge aquarium, but there's a lot of variety of Marine life to see and learn about. We really enjoyed the underwater tunnel aquarium and the touch pools."], ["Reviewed August 7, 2017", 3.0, "Not a big aquarium", "It's not a big aquarium like I am used to but it was a nice visit. I like the sharks and chinchilla."], ["Reviewed August 3, 2017", 5.0, "Nice, easy and not too long", "OK, it's not Monterey Bay Aquarium, but it's actually really well made. And you'll probably pass it anyway. It only takes an hour or so. Don't miss the feeding of the otters. And the touch bassins are really nice"], ["Reviewed August 2, 2017", 2.0, "Small aquarium, fun otters", "We had a few hours between visiting Alcatraz and a late whale watching your, so we went to the aquarium. As a young couple we thought it would pass an hour or two, we were round the exhibit in half an hour. The tunnels seemed small habitats for the animals. On the plus side the sea otters were cool and very playful. A lot of money for a short visit\nShow less"], ["Reviewed July 30, 2017", 3.0, "Meh", "This is a very small aquarium and just a quick diversion. I don't feel it was worth the money we spent on it--at all. If you do go, I don't think you won't get anything out of it though."], ["Reviewed July 30, 2017", 2.0, "Blink and you've missed it", "Having just been to the Monterey aquarium which we considered one of the best we've ever seen, this one was absolutely abyssal. Run down, cheap and nasty feel about it and you're done in around 15-20 mins. Don't do it. 100% tourist trap rip off joint at $70 for 2 adults and 1 child\nShow less"], ["Reviewed July 27, 2017", 3.0, "Very average aquarium but a quick diversion", "We visited the aquarium because it was included on the Citypass that we had purchased. I'm glad we didn't pay extra for the visit, because this really doesn't even compare to other Aquariums in major tourist cities (Seattle, Atlanta). It didn't take long to go through the aquarium, and the highlights were probably the Sharks of Alcatraz, and the touch tanks. Small kids will enjoy it, but if you've been to any really great aquariums, you'll be disappointed with this one.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Great for a 4 year old", "The tunnels were very entertaining for my 4 year old. He loved running through them & seeing everything! It was one of the best activities we did while in San Francisco!"], ["Reviewed July 25, 2017", 3.0, "Something quick to do", "As we had young kids (9&5) it was great for them. As for us, been to many aquariums & pretty muh the same as others, just some different fish etc.\nIf you want to do something that doesn't take that long & still a good visit, then this is perfect. We had this as part of a voucher package, so was a plus, as kept the kids happy for about 40 minutes.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Small but nice", "This small aquarium in San Fran is worth the price for admission and the behind the scenes. The entire aquarium took us a little over an hour and then the behind the scenes another hour. Our guide was knowledgeable and the kids loved it. Don't expect an aquarium like Georgia or San Diego, but this little place serves to teach people about conservation and the local fish and wildlife.\nShow less"], ["Reviewed July 24, 2017", 3.0, "Nice Aquarium, knowledgeable staff", "Enjoyed our tour through the aquarium. Very informative place. Loved walking through the tunnel, experiencing the fish swim beside and above us.\nYou get to touch baby fish; shark, ray, starfish.\nBrief in terms of content, but still this is a great stop to bring the family when visiting the Pier.\nShow less"], ["Reviewed July 23, 2017", 2.0, "Disappointed", "Went thru the whole thing in less than 1/2 an hour. Probably good for very small children that haven't had much exposure to aquariums. They did have a nice touch pool for little kids"], ["Reviewed July 22, 2017", 3.0, "Small aquarium, but still fun to visit; especially enjoyable for youths", "The Aquarium of the Bay on San Francisco's Pier 39 is focused on marine life in the bay and neighboring waters. This aquarium comprises two levels; visitor start their tour in the \"Discover the Bay\" exhibit on level 3, then take an elevator down to the \"Under the Bay\" exhibit on level 1, where they walk through two underwater glass tunnels. Finally, via the elevator, they return to level 3, where there are few more exhibits such as \"Touch the Bay\" and the river otters.\nThere is no \"main hall\" to this aquarium, just three passageways separated by the elevator. The walkthrough of the entire aquarium ends as quickly as it has begun so enjoy while it lasts! Plus, young children will especially enjoy the \"Touch the Bay\" exhibit as they get to lay their hands on the living creatures.\nThe main highlight of my visit was walking through the tunnels, as various sea creatures of swam along and above me as I walked past. I also thought the river otters were quite adorable. Sadly, my tour through the aquarium ended in less than half an hour. Prior to the tunnels, I got a cameraman to snap photos of myself to highlight my visit; however, when I reached the gift shop to purchase the photos, the clerk told me that I can only obtain hard copies, not digital copies.\nFor a better aquarium in San Francisco, I would suggest the one in California Academy of Sciences in Golden Gate Park.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Nice!", "Nice and fun for kids. 100% non for profit and most of their collection goes directly to conservation work."], ["Reviewed July 22, 2017", 5.0, "Stunning Exhibits", "We were visiting in California for a family reunion, and had our 12 year old granddaughter with us who had never been to San Francisco. We only had one day to visit SF and were debating where to go.\n\nWe settled on the Pier 39 area/Fisherman's Warf area, a cable car ride and China Town. Although the traffic was challenging, we were able to drive to the Pier 39 parking garage with relatively little trouble and walked across the street to Pier 39.\n\nMy granddaughter wanted to go in every shop, be we herded her over to the aquarium, paid the admission and began the tour. The first exhibits were very nicely done with a wide variety of sea life, and very helpful staff who would answer your questions.\n\nThe next exhibit was down an elevator where we entered the aquarium section which included an very neat exhibit of jellie fish, an underwater walk through tunnel of shallow water animals such as rock fish, then an exhibit of abalone and octopi, finally the deep water creatures of the bay, including a number of sharks.\n\nWe entered the elevator again to go up to the second floor where they museum had exhibits where you could touch sea creatures (under supervision) including a shark, rays, turtles, tide pool animals and others. These animals had all been rescued and would be dead if they were not her. The staff helped people and answered questions about the animals\n\nThe final display were a pair of twin river otters that had been rescued, which appeared to appreciate the audience by performing constantly when people came to watch, and reclined when there was not audience!!!\n\nThere was, of course, a gift shop...and the really neat thing was that over 80% of the revenue from the gift shop and admissions went back into conservation work!\n\nWe spent about 1.5 hours in the aquarium, and could have come back an watched some more (the give you a stamp on your arm for admission for the day) if we didn't have some other things to see and do. My granddaughter loved it, especially the exhibit where one could touch the animals. She particularly liked the rays which would come by and raise a \"wing\" for you to touch....\n\nThe Academy of Sciences also has a large aquarium and planetarium, as well as other very interesting exhibits, but would have consumed the entire day, and has an understandably higher admission fee\n\n\nhas an interest in animals and debated wher\nShow less"], ["Reviewed July 18, 2017", 4.0, "A must see if you're travelling with children", "We didn't, and still enjoyed it, but I see that children (of all ages) would love this place.\nYou walk through aquarium tunnels with marine life around you including small sharks, see smaller tanks with different animals and a few land creatures as well. They have a petting pond, where you can touch a shark and other exciting species. We loved our visit, the only drawback was that it was a bit expensive and a bit small.... Would've loved to have seen more....\n\nThe river otters was our favorites.\nShow less"], ["Reviewed July 17, 2017", 3.0, "Just ok", "This was one option with our city pass. I wish we would've used it on the DeYoung museum instead. It's not bad, just very underwhelming. The otters were cute and the walk through tunnel was cool but that's about it. The California Academy of Science had more sea life than the aquarium.\nShow less"], ["Reviewed July 16, 2017", 5.0, "Definitely recommend!", "Great for the kids, very interactive and interesting Went on a Sunday evening, lots of people but not too crowded. Tunnels were amazing!! 🐟🐟🐟"], ["Reviewed July 14, 2017", 5.0, "Must see!", "San Francisco's Bay Aquarium\nThis aquarium is in the small side, BUT it contained SEVERAL WORTHWHILE EXHIBITS!\n\nThere are four main components of the aquarium: discover the bay, under the bay, touch the bay, and highlighting animals.\n\nFor us the clear tunnels where you can view see marine animals such as fish, shark, starfish, etc was a highlight for us. I suggested if you want to feel like you have the aquarium to yourself, go very early, when it first opens. We were able to see much of the aquarium without crowds. The tunnels were just phenomenal!\n\nThere were two sets of tunnels. One displayed the marine life that would be seen in the Bay Area at 20 feet below the surface of the water. The next tunnel shows the animals that would be living at 90 ft below the surface of the water in the Bay.\n\nThe Touch the Bay Area was also very good. You could touch a stingray, sea anenome, sea stars and anything else there. The staff were great help.\n\nAnother Bay Area was the river otters exhibit. They were so much fun to watch. Very lively creatures.\n\nI felt felt the prices were very reasonable. For adults it was $24.99 per ticket. As I said before, if you go early you'll get a better feel and be able to take your time and really enjoy it.\nShow less"], ["Reviewed July 14, 2017", 3.0, "Interesting, great for the teens", "My granddaughter loves aquariums, so we check this one out. The only exhibits worth seeing are the underwater tubes.and the otters. If you have smaller kids and young teens they will love the touch and feel section. Touching a stingray is so exciting for them, and the stingrays love to be petted. Again, as an adult, I been to much better, but for kids it is fun and something special for them when many things seem boring for them. We spent a lot of time trying to get good photos for my granddaughter in the tubes.\nShow less"], ["Reviewed July 12, 2017", 3.0, "Cute Aquarium", "This is a smaller aquarium, but it has some great features. The underwater tunnels are fascinating and their giant octopus is very cool. The river otters were cute and the touch pools were nice. The staff was kind and I liked that your stamp allowed you to leave and return the same day.\nShow less"], ["Reviewed July 8, 2017", 5.0, "great activity to see", "the place is magnificent !\nlarge selection of marine life and the aquairum iteslf is magnifisent !\nwhen you step outeide you can actual \"pet\" some of the creatures.\n\nthe only down side is the toilet - I would accpect that when you paying so much money the leaset they can do is to clean it up more often....\nShow less"], ["Reviewed July 5, 2017", 4.0, "Touristy area but still worth of it for the kids", "The kids enjoyed the visit and we spent about 90-110 minutes there. It isn't that huge but still has decent amount of sea life to look at and touch. Used the city pass for our tickets."], ["Reviewed July 4, 2017", 4.0, "Good aquarium", "This place is not so big but enough for discovering sea's life. The most important that with your visiting, they can have money to continue protect ocean."], ["Reviewed July 4, 2017", 3.0, "Very quick visit", "The aquarium is really quite small and it was a quick visit. The touch pool, which I thought the children would love based on visits to a Swedish aquarium was just a quick pass by for them."], ["Reviewed July 4, 2017", 3.0, "Good but quite small.", "Nothing wrong with what is there, however the place is very small. It probably only takes an hour to see everything. The baby stingrays were a highlight, very amusing creatures."], ["Reviewed July 4, 2017", 2.0, "Pricey for the size", "While this aquarium was nicely done, it was very small and we got through it in under an hour. $69 for three people was a bit pricey in my book and we felt a bit cheated. Unless you get a really good discount, I would not waste your money on this stop.\nShow less"], ["Reviewed July 3, 2017", 3.0, "Small, Average for Aquarium", "You will be able to visit the attraction in under an hour. I think the price is reasonable. A portion of the aquarium is situated in a tunnel so you can see the marine life swim around you, which was nice. The touch tank was nice as well.\n\nCompared to other aquariums I would not rank it highly due to its size, but it is fun to see at least once.\nShow less"], ["Reviewed July 1, 2017", 2.0, "Nice try, but average at beat", "We realize the Aquarium is a non-profit, but it is badly in need for updating and improvements. We had a City Pass, but if we had paid the admission, we would have been very disappointed. The moving sidewalk doesn't work in the tunnel. Several of the electronic screens explaining the exhibits don't work. There isn't much staff. This could be an excellent place, but needs some TLC.\nShow less"], ["Reviewed July 1, 2017", 2.0, "Pricey for what you get", "Spend over 30 dollars per person to see like 10 tanks? It is the tiniest aquarium I have ever been to. The only reason to go is if you want to pet a stingray (bat ray), or starfish and sea cucumbers. No large sharks or anything, just the small fish you would find off the coast of San Francisco.\nShow less"], ["Reviewed June 29, 2017", 4.0, "Good stop on our trip", "From looking at the other reviews, it seems the two biggest complaints are that it costs too much and it’s not that big. From a cost standpoint, it is $25 for adults and $15 for children. While I would say it may be slightly overpriced, but then again it would be much faster to list places in that area that are NOT overpriced so it didn’t bother me.\n\nAs for the size, I can understand where they are coming from as it’s definitely not a big as other aquarium’s like The Shedd Aquarium in Chicago. I think we pretty much saw everything in 90+ minutes. However, that was fine with me because there are so many entertainment options in the area, I don’t think we would have stopped by if it would have taken all afternoon to hit all of the exhibits since our time in the area was limited.\n\nThe highlights from our daughter was going through the two tunnels with a fish tank on both sides and overhead, being able to touch the stingrays, and seeing the baby otter and shark. The bottom line is we had a good time and glad we came.\nShow less"], ["Reviewed June 25, 2017", 2.0, "Disappointing and expensive", "Really understaffed, very underwhelming, out-dated and over before you knew it.\n\nWould recommend people to skip this and visit the Academy of Science instead - well worth it.\nShow less"], ["Reviewed June 19, 2017", 3.0, "Only go if you have kids", "Normally I really enjoy Aquariums, but there wasn't much to see at this one. There are a couple exhibits, and the river otters were cute, but it is quite small. There were a lot of kids around, and they all seemed to enjoy it, so if you need to fill 30 minutes with your family, this is an option.\n\nThe best part about this experience was knowing that a large part of the admission fee goes towards their conservation initiatives. That made it better.\nShow less"], ["Reviewed June 18, 2017", 2.0, "Go with your children if you can't go to Monterey", "This is an outdated aquarium. Decades outdated. I would not recommend it for adults at all. Young children may enjoy it.\n\nOnce you have been to the Monterey aquarium, you need better and more than this small aquarium. It will always be a disappointment.\n\nIncluded in the CityPass.\nShow less"], ["Reviewed June 16, 2017", 2.0, "Not much to see here", "We paid nearly $50 each to see the exhibits at this aquarium, and from start to finish we were in there for less than 90 minutes.......I've seen more variety in my local pet shop."], ["Reviewed June 14, 2017", 3.0, "Overpriced", "Very nice aquarium, but also a small aquarium. From the outside you really shouldn't be that surprised though. Not a large selection to see, the tunnels are average for the size. Very nice staff and clean. Gift shop there. Great for small children."], ["Reviewed June 12, 2017", 3.0, "Average aquarium and really overpriced", "While the glass tunnels here are decent, this aquarium has less sharks and rays than other, more moderately priced aquariums we have visited. The staff is very friendly, but this should not cost around $100 for a family of four. It's worth around half that. It's actually a tiny aquarium. The petting section is teeny, with very few creatures you can touch. Most of the animals in this part of the attraction are not in touching station. There are two random chinchillas. On the second floor, there are two otters. I've been to several otter exhibits with many more animals.\nShow less"], ["Reviewed June 8, 2017", 2.0, "Super Small", "The aquarium is really small, the lookout below is cool but for the price it was a really quick activity.\nShow less"], ["Reviewed June 5, 2017", 3.0, "Enjoyable but overpriced", "My husband and I went with our daughter, son in law and grandchildren and enjoyed the visit. The aquarium is nicely laid out for a quick visit. We particularly enjoyed the touch pools and underwater tunnels. It's a good place for younger kids but I don't think I would recommend it highly for teens or just adults.\nShow less"], ["Reviewed June 3, 2017", 3.0, "Not worth the cost", "I went with my family when they were visiting me in SF. I live in San Francisco but had never been there . The aquarium was very small and the amount of different species were very limited . I personally think $22.95 for a ticket is too highly for this very small aquarium. It should be more like $12.00. I would recommend you skip this attraction and spend your money on something more worthwhile .\nShow less"], ["Reviewed May 30, 2017", 4.0, "Well done Interactive, nice lay out", "If you do a lot of aquariums then you will like this one. It is quick and easy, well laid out. The Otter exhibit is active, they have touch pools, and a very large underground tunnel water exhibit. 95% of the fish and sea life are local.\n\nNote: best time to go is between 6 and 8pm, not crowded, and you can spend your time looking at the exhibits\nNote: get a city pass, then you do not feel like you are paying an arm and leg for various small exhibits that the kids want to go to\nNote: when you are done, go see the seals at the end of Pier 39\nShow less"], ["Reviewed May 30, 2017", 4.0, "Nice little visit", "While a bit pricey, and it is small I enjoyed the short little adventure through the aquarium. Interesting displays and touch pools. Great place for younger kids."], ["Reviewed May 29, 2017", 4.0, "Nice- but I've seen better", "Had a good time- interesting to see. But I've been to much nicer aquariums. Give yourself about 45 minutes to get through. You're able to go back and forth to the aquarium until it closes."], ["Reviewed May 29, 2017", 1.0, "The aquarium sucks!", "Worst aquarium ever! Overpriced! Save your money! Dingey! Small and disappointing. More life a death trap the way they move you thru elevators! No real sharks, dirty water, nothing to see. Go to Baltimore and see a real aquarium!! Trust me- don't go!!!!!\nShow less"], ["Reviewed May 26, 2017", 3.0, "Small and disapointing", "I was so disappointed in this attraction. We were in and out in 25 minutes. Had we purchased the City Pass I wouldn't have been disappointed so much, but to think that I paid out $65 for a family.\n\nThen there was the $35 for the obligatory entry photos - though I had the good sense not to ruin these with my presence and just shoved the kids in - which turned out well and I was happy enough paying out for the two large prints and the two small framed prints.\nShow less"], ["Reviewed May 26, 2017", 2.0, "Interesting not wildly exciting though", "Yes it was interesting. Like looking into a giant underground aquarium. A bit like the one in Jaws. Fascinating to see the sharks and jellyfish close up. And s whole variety of other fish. Family enjoyed the visit. We found our Alcatraz visit more exciting."], ["Reviewed May 22, 2017", 4.0, "Great for families", "Took our 3 year old grandson and his parents here. This is a great little aquarium with very interesting and interactive exhibits. It is nothing like the Steinhart Aquarium which is very large and very comprehensive. But for families, especially with children this one is better suited. Also great if visiting Pier 39 and have an extra hour or two.\nBTW\nLocals, which included us from the East Bay, get a significant discount. It is relatively expensive so the discount is great.\nShow less"], ["Reviewed May 17, 2017", 4.0, "Disappointingly small", "As aquariums go it was ok, it was however very small, it look less than an hour to go round the whole place and stop to take several pictures .... and no octopus even though it had been advertised and there were lots of plastics models of one\nShow less"], ["Reviewed May 17, 2017", 3.0, "I've seen better", "It was OK, I don't begrudge paying towards conservation (by purchasing entry) but it was pretty average. Having seen Aquariums around the world (Cape Town, Dubai, throughout Europe and Asia) it let me down in the small size, limited diversity and layout. Undoubtedly doing a great job in the local area but the exhibits were disjointed.\nShow less"], ["Reviewed May 15, 2017", 2.0, "one of the weaker aquariums i've been to", "I've been to Monterey Bay, Aquarium of the Pacific, and Georgia aquarium and I really enjoyed those but this one, even though my hopes were not high was just not very good. Pricy for what you get and not very much to see, your better off going to the Academy of the sciences which is really neat. On the positive side the Shark tunnel is very nice, the touch tank is actually pretty good, and the staff are nice and have good information so the aquarium isn't completely awful but very lackluster.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Super awesome staff!", "We spur of the moment decided to go to the Aquarium. The walk through tunnel is amazing! It was not over crowed or crazy busy. Gabriella was absolutely wonderful!! We asked her loads of questions and she answered them all and then some. She gave us facts on the sharks and other various fish. We looked forward to seeing her come by us so we could ask her more questions. We also saw her up by the touch pool. She was fantastic with children and adults. She was patient and approachable! Gabriella is a definite asset to your staff!!!! She made our experience above and beyond wonderful!\nShow less"], ["Reviewed May 11, 2017", 3.0, "kids love it", "Brought my 3 year old granddaughter here and she loved it. I found it to be very clean, the employees are very knowledgeable and friendly. You literally walk through the tunnels of fish, they are swimming above you and around you. They have a hands on tide pool that was little kid perfect.I love that everything you see is what is found right here in our bay. The tickets good all day long with in and out privileges. The only con, I found it very pricey for what they offer you see everything in 30 minutes or less depending if you linger or not. they offer a family special of $70. 2 adults 2 kids. The offer a military discount and a discount if you live in the surrounding counties. If you park in the Pier 39 parking don't forget to validate your ticket at a sit down restaurant, that runs you $9.00 an hour weekdays, 10 weekend, unless you find street parking good luck with that. I gave it 3 stars because of the price.\nShow less"], ["Reviewed May 5, 2017", 5.0, "Loved it!", "Really nice aquarium. Seeing the large grouper, jellyfish and sharks was really special. Walking through the tubes was great as the fish and sharks swam all around you."], ["Reviewed May 5, 2017", 3.0, "Something to do to past the time", "Me and Becky went there yesterday and it was pleasant. You saw lots of varieties of creatures that live in the water. My highlight was touching some creatures especially the rays"], ["Reviewed May 4, 2017", 4.0, "Good aquarium", "Aquarium is worth a visit, especially if the weather is bad. You can easily spend a 2 - 3 hours there if you like watching the feeding and 'touch' areas."], ["Reviewed May 2, 2017", 4.0, "Great for the kids", "A god aquarium with the ultimate walk through underwater walkway. Guides on site to fill the kids full of knowledge and fun. The interactive section is particularly good for the children. You can re-enter at your leisure so get a stamp."], ["Reviewed April 23, 2017", 3.0, "Cute place and a nice visit", "The aquarium is small, but it does have some great things to see. The jellyfish and the underground aquarium are great. Come during feeding time! I'm glad we came but don't expect to spend much time here"], ["Reviewed April 17, 2017", 3.0, "Cool jellyfish", "Nice aquarium, not best one in world but has lots of interesting local marine life and good explanations of how life cycles work and threats to it. Staff is friendly & helpful. Several cool jellyfish displays. Allow an hour, tops, here unless you have someone who's really into this. We enjoyed the aquarium at CA Academy of Sciences just as much.\nShow less"], ["Reviewed April 16, 2017", 3.0, "Small but good for a couple of hours.", "We got tickets as part of a 3 day pass. My 19 month old son loves fish. The upstairs is a small, typical aquarium. The downstairs has a nice jellyfish display and 2 large walk through tunnels, that are really the highlight. We went through the tunnels twice because my son loved them so much. At the end is a rive4 otter exhibit, but they were sleeping while we were there. Good way to pass an hour ir so, but you won't be there much longer than that.\nShow less"], ["Reviewed April 10, 2017", 2.0, "What's there is nice. But there's not much there.", "This is the smallest and least interesting aquarium I've been to, and it wasn't that cheap. There is an initial room with some local fishes that looks like 1/10th of the similar exhibit at Monterey Bay. Then there is a room with a few jelly fish. Then a tunnel through the big tank where they have sharks (Leopard and maybe a sand or two). Then there is a touch-tide-pool (ONE FINGER ONLY) and then some cute river otters, which was the highlight. All told, five rooms and it costs $25 for adults give or take. I would take and give my money to another attraction.\nShow less"], ["Reviewed April 8, 2017", 3.0, "Glimpse of Sealife", "My grown son wanted to visit the Aquarium. You enter and see some of it then take an elevator down and then an elevator up. It was fun to walk under the overhead aquarium. There was a touch and feel area. This is one of the many Aquarium's I have been to. I think I heard them say it was non-profit... but not sure. Otherwise comparing others this one was a little disappointing. But they did make good use of their space and maybe because of the crowd of people couldn't get to some of the things they offer. If you have never been to an Aquarium of this sort ..... THEN IT IS A MUST !!\nShow less"], ["Reviewed April 7, 2017", 3.0, "Hmmmm - Kind of Average", "I’ve been to several different aquariums. This ranks as kind of average. It’s got some cool stuff. I love the ocean and its creatures so I’m always intrigued. However, it’s not a place I would spend several hours. You can basically see it in an hour. It’s worth a stop but it’s certainly not a destination and wouldn’t be something you would write home about.\nShow less"], ["Reviewed April 5, 2017", 2.0, "Just not worth the money or effort.", "We literally saw this in 30 mins. Was so disappointed. Very little to see and with it being so expensive I would say definitely NOT worth going!\nShow less"], ["Reviewed April 5, 2017", 4.0, "Good Aquarium , Great place for families to go.", "Aquarium has a good diverse group of sea creatures. Kids are especially focused on the exhibits. Therefore this aquarium is a place for families. They have a long tunnel under the water that is a very nice attraction. Reserve at least an hour."], ["Reviewed April 5, 2017", 1.0, "Save your money!", "We spent a few days in San Fransisco while journeying through California. Our boys wanted to see the Aquarium while we were at Pier 39. It was almost $100 for four of us and it was literally the worst Aquarium that we have ever been to. Price is definitely not worth the limited amount of experience. Save your money and enjoy the seals at the end of the Pier!\nShow less"], ["Reviewed April 2, 2017", 3.0, "Nothing special.", "We spent a couple of hours visiting the Bay Aquarium and it was a pleasant visit however there isn't much wow factor to it. I think the most interesting parts were having the ability to touch some rays and starfish and watching the otter training. I've been to several aquariums and this is not one of the best.\nShow less"], ["Reviewed March 29, 2017", 4.0, "Wonderful non-profit aquarium", "This aquarium is not in the same league as Atlanta or Baltimore so don't expect too much. It is however a wonderful experience that teaches you about the local ecosystem in a very hands on way. I'm always happy to contribute to local causes that will teach our children the importance of the the environment. If you have 1-2 hours to kill or just want to get out of the cold this is a perfect spot. We could have spent another hour watching the otters play. Remember, every dollar you spend goes toward keeping this place running so make sure you visit the souvenir shop afterwards.\nShow less"], ["Reviewed March 24, 2017", 3.0, "Pretty good, but not great", "We had high hopes for this place, given that it represents the bay's rich marine life, but it was surprisingly small and underwhelming. The large tank you can walk through was fairly good, featuring seven gill sharks, sturgeon, and rays. But we've seen better and larger tanks in Toronto and Chicago. The interactive tank for the rays was also quite small. We did enjoy the otters, as we happened to be there in time to see the training and feeding time, which was great. I'd skip this and just go to the California Academy of Science. Their aquarium doesn't have sharks, but it's bigger and much better.\nShow less"], ["Reviewed March 19, 2017", 1.0, "Terrible", "Worst aquarium I have ever been to and I went to one in Thailand that cost me 50cents to get into so that's saying something. Very disappointed especially with the cost of entry.\nShow less"], ["Reviewed March 14, 2017", 3.0, "It was okay, but nothing special", "As far as aquariums go, this one was pretty mediocre, which is unfortunate because it's right on Pier39. It was cool that your paid admission is good for 24 hours, but there's not that much stuff to see, so it's not really an effective perk. If you've been to ANY aquarium, anywhere else, then there's no reason to visit this one.\nShow less"], ["Reviewed March 11, 2017", 4.0, "Beautiful aquarium.", "The aquarium is very nice with lots of attractions. The varieties of species of water animals is a pleasent to see. The aquarium is situated on the banks of ocean which makes us feel happy to spend an hour or two. It's not a big one but kids truly enjoy. But the entry fee is more which is a minus point. Many in the Bay Area are unaware of this aquarium as I feel. The management has to reduce the entry fee to make middle class people to afford the fee. Nice one and a weekend jaunt to enjoy the place.\nShow less"], ["Reviewed March 10, 2017", 3.0, "It was O-K", "We thought we could kill some time in the afternoon before dinner and check out the aquarium. In and out in less then an hour wish there were more things to see and do there. I realize that it's non profit but I did feel it was a little pricey for what you get. Loved that we could touch the stingrays, shark, and star fish. The kids really enjoyed that part.\nShow less"], ["Reviewed February 28, 2017", 4.0, "small but lovely", "Title says it all really. It is not big (which baffles me, with it being in the US), but there are some tanks with lovely creatures, like lit up jelly fish. There is also a touch-pond or whatever you call it. The enclosure for the otters seemed a touch on the small side, so that would be my only complaint.\nShow less"], ["Reviewed February 24, 2017", 4.0, "Great small aquarium in the heart of the Wharf!", "When you come to Fisherman's Wharf, you're probably not thinking that there's an aquarium here for you to visit. For you aquarium connoisseurs, you're missing out if you don't stop by this place. I think I came here for the first time after I left the bay area which is a pity because this is probably my second favorite aquarium here in California. Yes it is located on the pier and you think from all their advertisements that it's just a tourist trap but it's a good one!\n\nIf you parked at the Pier 39 garage you get $2 off a general adult ticket so be sure to use it. You take an escalator upstairs and prepare for a several level experience of all the bay's sea creatures. You start off with some of the more tropical fish that you don't get too much here in California but as you go deeper and deeper you'll see displays of jellyfish, kelp forest fish and many others. Take a trip downstairs and your adventure continues with more local fish and then the shark tunnel.\n\nEven the shark tunnel features fish from the local area including the 7 gill shark which is the largest shark that is endemic to the area. Yes, there are great whites too in SF bay but not all that common. They had large sturgeons, rays and guitarfish which are always fun to see. Your trip ends with a lot of reptile and amphibian displays followed by 3 playful male otters that are a hoot.\n\nPark at Pier 39 for all your Fisherman's Wharf shenanigans. While the price is initially startling, your discounts make up for it and also the headache of trying to find somewhere cheaper to park would offset it as well.\nShow less"], ["Reviewed February 21, 2017", 3.0, "O.K., but nothing special compared to other aquariums", "For the entrance fee, I expected a lot more. It was the usual assortment of smaller tanks with a variety of tropic fish, a few local small mammals and reptiles, and of course, the walk through tanks with rays and sharks as well a a number of other fairly large fish. At the end, there is a tank with otters, which they staff was feeding when we were there. I wasn't happy that they made the otters do tricks for food!\nShow less"], ["Reviewed February 20, 2017", 3.0, "It was ok", "The staff was very friendly, but It was a tiny aquarium. It's a convenient location if you're already on the piers."], ["Reviewed February 18, 2017", 5.0, "Great fun for the family", "Nice little venue. We went as a family of four and experienced the walk through tunnel and got to touch a snake, starfish and sea anemones. Friendly staff and easily accessible. We purchased our tickets in advance through Groupon (much cheaper deal)."], ["Reviewed February 2, 2017", 5.0, "Amazing", "This trip was so amazing how everything is set up to view. Being able to touch curtains sea animals was amazing and the jellyfish and shark tanks were so awesome with them swimming over you. They had huge fish to exhibit and they had the tiniest fish. Great place to experience and to take the family we will be going back very soon with our children. Great learning experience.\nShow less"], ["Reviewed January 24, 2017", 4.0, "Great Place to Get Out of the Rain", "We were planning on spending a touristy day at Pier 39, but it started to downpour. So instead, we walked over to the aquarium of the bay and spent a very enjoyable few hours exploring. The best part of the aquarium are the 2 glass tunnels. We must've spent at least an hour walking through the tunnels and observing the fish, the rays and the sharks. I felt like a young kid on a school field trip. As an aside, I was a little disappointed about two things. First, despite advertising all over town with pictures of an octopus, there was no octopus at the aquarium. Apparently, the last one was there four or five months earlier. And secondly, near the end, there is a large sea otter display, but not much to see. In fact, we could only see one, way in the distance and only its head popping out of a rock. But otherwise, it was a very fun activity.\nShow less"], ["Reviewed January 22, 2017", 3.0, "An aquarium on Pier 39", "Tiny little aquarium. Most exhibits were commonly found in other aquariums. Kids would find it fun as they could gently touch the sting rays. Did not take much time to go through. Barely spent a couple of hours there. Good that it was part of the San Fran city pass.\nShow less"], ["Reviewed January 22, 2017", 3.0, "Meh", "I rated this as average - average for an attraction. It's interesting with what it has. However, as an aquarium, I would have to rate it below all the aquariums I've been to (including the one in Albuquerque). This wouldn't be as bad if not for the price; $25 a person is a lot for something that will only take about an hour to go through, even if you go slowly. (The Albuquerque aquarium costs half that.) And you're forced to go in a certain order and really can't go back. Save your money and see the sea lions in the wild for free.\nShow less"], ["Reviewed January 17, 2017", 3.0, "Been to better Aquariums", "We bought the SF city Pass and it included entry to this. I would choose to go to the aquarium portion of the CA academy of science or the Monterrey Bay Aquarium. It was worth visiting as part of a package though. The location is very convenient on Pier 39 since we were right there. It was extremely crowded when we went over Christmas break. My husband liked the table were they dissected a squid. My daughter liked the touching table where you could hold and feel some creatures. They have a stingray exhibit where you can reach in and feel them. It is deeper than it appears and I saw many kids get their sleeves and even coats very wet. Also a fun exhibit was the otters. They have a glass wall so you can see them swim under the water and come up on top and see them too. I think I would have been more impressed if I had gone here BEFORE going to the CA academy of science museum. It was fun enough though if you can't get to another aquarium.\nShow less"], ["Reviewed January 11, 2017", 3.0, "This is Not your Monterrey Bay Aquarium", "We spent a little while visiting the Aquarium by the Bay. It is definitely NOT your Monterrey Bay Aquarium. But if you have little children they might enjoy the visit. And we supported the Bay conservation, I guess, by our visit."], ["Reviewed January 9, 2017", 4.0, "Very interesting!!!", "I loved it! sharks tank and sea otters are so cute! You can touch mantas and starfish and shark`s tank is amazing!"], ["Reviewed January 6, 2017", 5.0, "Great aquarium , good way to spend a couple hours with the kids", "This small aquarium really packs a punch in a small place , we had a wonderful time and we walked through the tunnels twice because the kids enjoyed it so much , if you are a member of a reciprocal zoo you can get in for half price , check your zoo to see who they are members with , most are\nShow less"], ["Reviewed January 4, 2017", 5.0, "Great little aquarium on the pier", "What a nice little aquarium right on the pier. Very cool seven gill sharks and rays. Staff is very knowledgeable and helpful. Otters were cute."], ["Reviewed January 2, 2017", 3.0, "It's fine", "Cute, small aquarium. It took us just over two hours to walk through and we were going pretty slowly. The highlight is the tunnel, we happened along while divers were feeding rays and anemones. Something to do for a bit if the cost isn't an issue.\nShow less"], ["Reviewed December 30, 2016", 5.0, "Awesome!!", "This is a must see aquarium. There is an aquarium tunnel that you walk through, a see lion observatory, and a 'petting station' for many kinds of sea life. We were able to touch sea cucumbers, star fish, a small shark, and some sting rays, among other things. So cool!!\nShow less"], ["Reviewed December 27, 2016", 4.0, "Otter feeding time was the highlight", "We bought City Passes which included the aquarium. It would have been expensive for the short time you would stay there. There are jellies, a touch pool, a walk through glass tunnel that was a bit murky and other interesting animals. Our highlight was seeing the otters being fed. They could do more tricks than our dog! Every staff member was very friendly and knowledgeable. We stayed about 1 1/2 hours\nShow less"], ["Reviewed December 26, 2016", 3.0, "Not enough sea-life variety for us", "We come from Vancouver, BC, and there we have an aquarium with endless sea life - including whales, dolphin shows, 4-D shows, endless fish of all sizes, etc. Here in San Fran, the only neat things we saw were the large shark tube tank (where it feels like you're walking under water watching all the sharks swim by & over top of you), and the few otters we saw playing in the snow. Other than that, the variety of sea life was quite lacking at this aquarium. For the expensive price we paid, we weren't too impressed.\nShow less"], ["Reviewed December 21, 2016", 1.0, "Limited exhibits", "The aquarium is a small privately funded aquarium with rather limited exhibits. We visited the aquarium as it was included in the CityPass package which we had purchased. There are 2 floors of exhibit and we went through them in about 20 minutes. I would suggest to give it a miss especially if you are buying tickets separately.\nShow less"], ["Reviewed December 21, 2016", 4.0, "Evening at thw aquarium", "So not as instructional as other aquariums I've been too. But given the touristy location still a learning experience. Definitely has a cool factor that i did not expect. The guides/workers were super nice & friendly. My family loved the jellies & sharks. I had a City Go SF Pass so waa happy with being covered attraction in the pass.\nShow less"], ["Reviewed December 12, 2016", 5.0, "If you're in San Francisco add this to your list of things to do.", "I really enjoyed my trip to the aquarium. Friendly staff, some great exhibits and I love love love the otters!nteresting reading the information that is up. There is an exhibit where you can touch things in the tank too.\nOn Pier 39 so can be incorporated into a day trip with other things. If I'd had more free time I would have booked the backstage tour.\nShow less"], ["Reviewed December 5, 2016", 4.0, "Nice acquarium with excellent information", "So glad we made this a stop! Not a very large aquarium, but very nicely done with a lot of great information. Located at Pier 39 (also part of the Citygo pass) it was easy to get to and we learned a lot. Especially about the sea lions that hang out at the pier 39 harbor! There is also another portion separate from the aquarium at the top end of the pier with more info which we would never have known about. Very worthwhile and great walk under the sea to see the sharks\nShow less"], ["Reviewed December 4, 2016", 3.0, "Meh", "We just didn't feel like this had enough bag for the buck. Apparently there is an octopus exhibit, but that was all down while we were there. We did enjoy the otters at the end, but otherwise this was kind of ho hum. We had been at another aquarium in Crescent City that had much better exhibits and was much cheaper. Spend your money on something else, like the Exploratorium!\nShow less"], ["Reviewed November 28, 2016", 3.0, "A decent attractions but not as good as other aquariums", "It was a decent attraction.I've been to other aquariums before and this one was ok.It has touchtanks and a tunnel into a aquarium where sharks and other fish would swim above you and around you..They had other cool exhibts.Its just a decent aquarium because its not as good as other aquarium I've been to.I liked this aquarium but it wasnt worth the price to get into the aquarium..It was just decent..If this was my first time goting to an aquarium If probably rate it better.I was expecting something better or just as good as other aquarium I've been to into the past.The Omaha,Nebraska Zoo has an Aquarium bigger than this one.Shedd Aquarium in Chicago,il is huge.Even the aquarium here my hometown of Kansas City..has a better aquarium in the Crown Center area in Kansas City.I still liked this aquarium its just that it wasnt as big as the other aquariums and all that interesting as the others I've been to.\nShow less"], ["Reviewed November 21, 2016", 3.0, "Super pricey for very little.", "The price would have you believe that the aquarium would offer a few hours of viewing pleasure; however it's so small you can be done in 30 minutes even if you wonder slowly."], ["Reviewed November 19, 2016", 2.0, "Disappointed", "We have been to many aquariums around the US,this was one of the lower on the Totem poles. If was just Bay fish, nothing exciting at all. For 25 bucks a person, stay home. Cool jelly fish .. but that's about all. A bummer"], ["Reviewed November 18, 2016", 4.0, "Lovely Fish Eye View", "There are some great views to be had from the upper levels of the aquarium- both of the city and the bay. The aquarium hosted a \"Fish Eye View\" of Bay Area waters, including how the ocean dwellers have adapted to the litter left behind by those of us on land. The exhibits were well done and most were hands on interactive a for kids. More than a few tourists let their kids run wild, but it actually made it kind of fun- they were really excited to see sharks and an octopus and the jellies. If you're at the pier it's a great place to spend a little time and learn something besides shopping for knickknacks on the boardwalk!\nShow less"], ["Reviewed November 18, 2016", 5.0, "Awesome", "I enjoyed the layout of the different levels to view. I especially enjoyed the touching room, I was able to touch and feed the stingrays and baby sharks as well as the starfish. The tunnel of marine life was also breathtaking also."], ["Reviewed November 10, 2016", 5.0, "Nice exhibit!", "Good place for the entire family! I especially loved seeing the otters! There's a nice gift shop located inside the aquarium. I found a lot of reasonable priced souvenirs!"], ["Reviewed November 9, 2016", 2.0, "Disappointing", "My wife and I visited the Aquarium of the Bay in SF while on vacation. My wife is an aquarium fanatic so we have visited many across the country. I have to say that this one was one of the biggest disappointments of our trip. Our City Pass ticket booklet offered a visit to either this aquarium or the Monterey Bay Aquarium. We opted for the Aquarium of the Bay due to convenience of it being located in SF so we wouldn't have to rent a car to get to Monterey, bad choice. The aquarium is small, difficult to access, dark, dirty and has very limited options. To me it seemed like a little more than a glorified pet store. The highlights of the visit was the walkway through the main tanks (the moving walkway was broken) and the sea otters which my wife loved. The otters were very active and playful which was the only saving grace from a 1 star review here. Children may enjoy this aquarium but they may also be disappointed due to the lack of exhibits. I would save your money or rent a car and visit the Monterey Bay Aquarium.\nShow less"], ["Reviewed November 7, 2016", 5.0, "Wonderful exhibits!", "Great place for all ages! I loved looking at all of the jellyfish! An impressive underground tank has all of the local sea life (sting rays & leopard sharks were my favorites) that you are completely surrounded by. You also get to touch baby sting rays & starfish. My kids loved it!\nShow less"], ["Reviewed October 26, 2016", 2.0, "That's it?", "I have to say, I was disappointed. This aquarium is more like a house with a few bath tubs. There is not much to see here."], ["Reviewed October 23, 2016", 4.0, "Great Little Aquarium", "Got a voucher for the Aquarium with my City Pass and I'm glad I paid a visit. All the sea life is local to the Bay so it's interesting to see what's under the sea you're looking over. There was a huge sea bass that was being fed by divers, not the sort of thing you normally get to see. The psychedelic jellies were great and there was some otters too. Definitely worth a visit, you only need a couple of hours in there so can combine it with plenty of other things to make a full day.\nShow less"], ["Reviewed October 21, 2016", 4.0, "Interesting aquarium", "The aquarium is worth a visit to once again walk through a glass tunnel and see sharks, sturgeon, rock fish etc. swimming around. The touch pool is interesting to let you feel the surface of the marine animals (sea cucumbers were the strangest). The attendant on duty made quite sure that touching was with one finger only - and was policing that. It was also nice to see a couple of otters swimming furiously around.\nShow less"], ["Reviewed October 19, 2016", 4.0, "What could a grandmother do?", "I took the ferry from Tiberon (highly recommended, but that is another review) across the bay with my 8 year old granddaughter. We were walking around when she saw the aquarium sign at Pier 39 and begged me to take her. What could a grandmother do? We went in, of course! This is a non-profit organization that highlights the wildlife living in the San Francisco Bay, for the most part. That is why it isn't as large as other aquariums, but it is still interesting and educational. We watched the seven-gill sharks being fed and learned facts about them from the guide. My granddaughter got to look a moray eel in the eye by way of a plexiglass bubble in the eel's exhibit. We touched bat rays and other creatures in the touch tanks (and yes, there are staff members watching). I am all about learning experiences with my children and grandchildren, and this fit the bill for an afternoon.\nShow less"], ["Reviewed October 18, 2016", 1.0, "They put animals lives in danger!", "EXTREMELY DISAPPOINTED AND ANGRY!!! I am a 16 year old girl who went to this aquarium expecting it to be really fun. Despite it being incredibly dull, the staff were not doing their jobs! When my mother and I were viewing the touch tank, 4 girls (around my age) were picking up and relocating starfish, sea cucumbers, and various other creatures. Not only were they moving them (and breaking the two-finger touch rule!) they were picking them up out of the water and kissing them and taking several pictures with them. You might be asking yourselves, why didn't the staff put them in their place? Oh well it's because they staff weren't there. There was no one watching the touch tank where LIVING ANIMALS could have been stolen, hurt, and even KILLED! My mom and I brought this to the attention of one worker, but all she did was call for some one to come to that post. When someone finally arrived, the girls had left. When we were ending out trip, we stopped in the gift shop and while I was filling out their surveys, my stepdad overheard a worker telling someone the price of the pictures you can buy. We had gone earlier and they had told us it was $5 more expensive than what they had been selling it as now. Sounds like some stupid teens trying to make some extra cash if you ask me. After we returned to out hotel I called the aquarium ready to tell them about all of the things that they had done wrong. No one answered. I left a voicemail and it has several months later. No one ever called me back. This trip made me extremely angry and I can promise you that I am never going back to this aquarium again.\nShow less"], ["Reviewed October 15, 2016", 4.0, "A fun time on the Pier", "We were visiting Pier 39 and noticed the Aquarium. Everyone wanted to go inside. This a a not for profit that benefits the local sea life conservation. It is small but there are a lot of fun exhibits. You start in the area seeing sea life in tanks and the walk thru area where the fish are swimming all around you is great and fun. Then you get to the area you can touch the sea life. There are Sting Rays, star fish, Sea Anemones and more. After this you get into an area with otters playing and they are fun to watch. The kids really enjoy this. This if fun for an hour or 2. Especially with young kids.\nShow less"], ["Reviewed October 9, 2016", 5.0, "Fun to do with kids", "I took my 2yo here & she loved it. Cool little exhibits as we walked in including Nemo & Dory then downstairs to underwater tunnels to see big fish & sharks. Nice finish with some reptiles & otters."], ["Reviewed October 7, 2016", 3.0, "Acquarium", "Small aquarium, ideal when pressed for time. Interesting jellyfish and otters exhibitions. Fun for all age groups."], ["Reviewed October 5, 2016", 4.0, "Do Enjoy!", "Purchased the San Fran Go Card, I highly recommend that. This was one of the attractions included. We spent may be 1.5 hours there while we took advantage of the other sites on Pier 39. Great for children and adults as well."], ["Reviewed October 1, 2016", 4.0, "Nice Afternoon Visit", "Visited the Aquarium of the Bay for an afternoon spent at Pier 39. Found the aquarium a enjoyable experience. Love the underwater tunnel and it was really nice to have staff members close by to answer any questions. They were very knowledgable and friendly. Also loved the river otters, fell in love with their cute faces. We even saw \"Dory\" from Finding Nemo which was a nice treat. I really enjoyed the jellyfish also. Everything was layed out nicely and the time to get through it at a managed pace took about 2 hours which was just perfect. Two minor recommendations: 1. There should be more benches inside the aquarium for those with disabilities to sit down. We found that to be a little lacking and 2. Please reduce the prices of the picture that they take of you and then offer to purchase. I did buy the picture (although not the complete package) and for 1 4X7 picture was $26.00 which I felt was sort of a bit of a rip off. If the prices were lowered slightly, you would probably have more people that would purchase them. I would visit here again and would recommend anyone visiting to check it out as its well worth it. Also, the ticket prices are very reasonable.\nShow less"], ["Reviewed September 30, 2016", 3.0, "Probably best for kids", "My husband and I had a few hours to kill on our last day and decided to visit here. Tickets are $25 ... a lot in my opinion for what you actually see inside. We were done in about 45 minutes and probably would have been through sooner except we had to dodge a lot of kids and babies in strollers. The shark tunnel is good and they do have several small tanks of exotic fish. The poor sea otters looked so stressed out. One had OCD swimming back and forth in a small space and another was gnawing on some bark and spitting it out.\nShow less"], ["Reviewed September 27, 2016", 4.0, "Nice way to spend an hour", "I visited the San Fransisco bay aquarium with my partner. We were just walking passed and decided to stop by the ticket booth on the footpath. They lady in the booth was friendly and welcoming. It was not to expensive but also not cheap. It was not the biggest aquarium I have ever been too but it was a nice way to spent a hour walking in the under water tunnels looking at all the Sharks and Rays swimming around.\nShow less"], ["Reviewed September 26, 2016", 5.0, "Worth visiting", "Got discount coupon online when I googled the aquarium. Small but excellent aquarium. Loved the jellyfish on display. Staff were very knowledgeable and helpful. Glad we visited."], ["Reviewed September 26, 2016", 4.0, "Enjoyable couple of hours", "We didn't visit the Monterey aquarium as it was $50 a person, so this one seemed a bargain at $25 each! But of course, it is much smaller and with less exhibits.\nThe emphasis is on conservation, and education as to what can be found in local waters (with a tank of exotics thrown in for good measure)\nThe tank of anchovies is a lovely sight, but really, is that a big enough tank for so many??\nWe liked the tunnels and spent a long time waling back and forth identifying the fish, The giant Sea Bass is a bit of a scene stealer. Until you get to the shark tunnel, where sharks and rays float alongside or above you.\nThe jelly fish displays are visually stunning and the video of the octopus unscrewing the lid of a jar to get his lunch is strangely hypnotic.\nIts worth mentioning that you will NOT see sea otters here. They hey have 3 river otters as the last exhibit. We noticed repetitive swimming action here, a bit like when a tiger treads the same route over and over and over again in his zoo enclosure.The staff did mention how they try to keep the otters mentally stimulated, but I can't help wondering if its really necessary to keep any of these creatures in captivity for our amusement? We went to learn about the fish but the otter exhibit left us feeling a bit uneasy.\nThe touch pools are a big draw for the children.\nShow less"], ["Reviewed September 18, 2016", 5.0, "super cool", "staff was awesome, there is a shark section, otter section and more. I got to touch baby stingrays and baby sharks.\n\nThis is right on the pier 39 area. They took a pic of us which was cool you had the option to buy at the end of your time there\n\nI took a ton of pics\nShow less"], ["Reviewed September 17, 2016", 3.0, "A bit underwhelming", "I agree with others: the place is so small (basically two -very cool- tunnels and a few exhibits and sea otters) and not cheap. Kids will probably like the pools where you can touch different fish and the staff were very friendly and told little stories. However, I wouldn't go again (and could have lived without going at all :/ )\nShow less"], ["Reviewed September 16, 2016", 2.0, "Small boring and overpriced.", "If you have been to aquariums before this one has to rate as one of the most boring and lacking in substance. It's quite small and does not have a very big variety of sea life. The underwater tank you walk through is very limited in the volume of sea life and its dark and dim. I guess it won't surprise that the fish and sea life from San Francisco Bay are lacking in colour so its not a very exciting viewing experience. The jellyfish exhibit is good but there's not a lot of information available to read on them and the touch pools are small and not exciting. It's not a cheap place to visit and overall I recommend giving it a miss, I want that 45mins I lost back......\nShow less"], ["Reviewed September 13, 2016", 4.0, "Better for Kids", "This is better for kids than adults - although a bit pricey at $25 for adults. It's a small aquarium with a limited number of exhibits. Need to take an elevator to get to different floors.\nAlthough staff tried hard, the shark feeding was poorly done. People were bailing on that after a few minutes.\nBig focus on protecting environment and marine life. If that offends you, don't go.\nShow less"], ["Reviewed September 13, 2016", 4.0, "Stop The Complaining, Does Take Time See", "Wow wow wow! So many complaints, many people saying so expensive, takes under hour to see! Hint or advice, if you have a Zoo Membership to your home town, your home state, it is reciprocal! For Los Angeles Zoo Members think is half price, for us in Oakland and San Francisco, is free! The last few times me or I been here, takes good three so hours! Maybe people/guests are not listening to the docent talks, maybe they not staying for the feeding of the different animals!\n\nOne docent, I was reading how in October 2011, Governor Jerry Brown, (YES OUR FORMER MAYOR IN OAKLAND) signed into act a bill banning the cutting of fins on the sharks! I also learned there really a species of shark call SOUP FIN SHARK! Okay, so the docent say yes the bill was signed, as of January 2013 the restaurants and the stores can or could only sell remainder! Once all that sold, no more of the divers going into oceans, cutting the fins, throwing back the sharks! They will die, just think, if someone cut off your hand, your arm, threw you back into wherever, eventually you also die! Glad he signed this! Yes shark fin soup popular at sixtieth birthday parties and at weddings, I just glad he signed this! There were also musk rats, otters, sea stars! I even saw froggies (ribbit ribbit)!\n\nThis a great place! Not sure the entire admission fee, as say, Oakland Zoo members are reciprocal! Have not yet purchased post cards, maybe one day! The aquarium is smart, to get to necessary rooms, have go through gift shop, as say so far have not yet, but may one day purchase post cards!\nShow less"], ["Reviewed September 12, 2016", 4.0, "Small and compact", "As it comes with City Pass; I went. You might not feel that it is of good value if you are not bringing children and the place is small. Smaller than the aquarium at Seattle. I spent 40 minutes in it. Come early!"], ["Reviewed September 9, 2016", 3.0, "Overpriced for it's size", "Coming from Omaha, with a beautiful Aquarium included in the admission price at the Henry Doorly Zoo, the Aquarium of the Bay is an over-priced, under-sized tourist trap. While there are some nice features overall, it's just not worth the price of admission for this one small place. Several of the attractions were unstaffed (touch tanks), so nothing to see there! It was nice, but disappointing. My opinion is that it was added just to put something else on Pier 39 to suck in your bucks! We got sucked in -\nShow less"], ["Reviewed September 1, 2016", 3.0, "Small Aquarium but nice", "We were walking along the pier, and decided to see the aquarium. We were expecting a bit more but it turns out to be a fairly small aquarium. Also expected more animals. Finished the tour around the place pretty quick. Nice but not so great."], ["Reviewed August 28, 2016", 5.0, "Don't Expect Seaworld and You'll Be Happy", "Nice little aquarium. Not really that much in it but it's not too expensive. Definitely check out the jellyfish, they were the best part."], ["Reviewed August 22, 2016", 4.0, "Cool", "My wife was so cute enjoying looking at all the critters. We saw some scuba divers too and that was neat. The double door elevator confuses everyone, don't worry! We got to pet a ray, a shark, a cucumber and an anemone!"], ["Reviewed August 20, 2016", 3.0, "Was Nice", "The Aquarium is nicely set out. It was ok, but honestly we were in and out in 30mins. Obviously, you can spent longer in there, as you can come and go all day, we didn't need to.\nYounger kids would enjoy it more. Still a nice place to visit though.\nShow less"], ["Reviewed August 19, 2016", 4.0, "Great little aquarium!", "My 11 y/o and I loved this aquarium. The underwater experience with sharks and other fish and the hands on pools to pet and feed sharks were our biggest highlights. Loved the jellyfish as well. Beware parents, there are fun things in the gift shop!"], ["Reviewed August 17, 2016", 1.0, "Go to Academy of Sciences instead!", "Do not waste your money and time here. It is not a good aquarium. Decent jellyfish exhibit, but that's about it. Seems worn. Touch pool is only 2 rays, one who stayed where you couldn't touch him. Go instead to the California academy of science. Way way better aquarium with penguins, coral reef colorful fish, \"twilight\" dark dwelling fish, albino alligator, etc. Plus it also has an indoor rainforest, planetarium, and earthquake simulator. Much better experience and value for your money and time.\nShow less"], ["Reviewed August 16, 2016", 4.0, "Great visit and worth it", "Enjoyed our visit to the aquarium today. Very busy and a bit crowded but staff Verbally educating was a joy. Several exhibits I've not seen before. Touch exhibits was a nice touch for the children."], ["Reviewed August 16, 2016", 5.0, "Beaultiful place", "Its a beaultiful place to spend some time with family and mostly with kids. There you can pet little sharks and see the amazing jellyfish show."], ["Reviewed August 15, 2016", 4.0, "Come and Go all day", "The river otters were so fun to watch. The entire aquarium is set up nicely. The \"petting\" area is fun with sting rays, a shark and some star fish. One of the nice attractions is that you can come and go all day. This was the only attraction like that. This activity was included with our Go Card (San Francisco). Highly recommend for families.\nShow less"], ["Reviewed August 15, 2016", 5.0, "Fun Family Activity atbFisherman's Wharf", "This little underwater aquarium is actually quite nice. It is situated at Pier 39 where all the touristy stuff takes place so I expected it time a bit cheesie. It turned out to be very informative, relaxing and like a mini Montary Bay Aquarium."], ["Reviewed August 15, 2016", 3.0, "Aquarium of the Bay - SFO", "Small Aquarium located at Pier 39. Great for kids. Being at SFO Bay we kind of expected more after having been to the Long Bch & Monterey ones, but still a nice diversion from all the shops."], ["Reviewed August 13, 2016", 3.0, "a mixed bag", "The positives about the visit to the aquarium are the tunnels that you walk through and you can see so many of the sea creatures there, up close and personal! And the touching ponds where you can use one finger to touch a starfish or skate. The less than positive are the confusing way to make your way around - you see one floor and then go on an elevator, etc. The first exhibits to the left when you come in could you better signage. (It's great that the signage is in English and Spanish and some Chinese.) The river otters have a very small location to swim around in. Overall, it is a small aquarium with a relatively high price.\nShow less"], ["Reviewed August 13, 2016", 3.0, "Fine Thing To Do At Fisherman's Wharf", "If you are tired of looking at the repetitive shops on Fisherman's Wharf, this is a fine enough alternative. Kind of expensive for what it is, but that's on par for a high tourist area. Small, but the underwater tunnels were definitely a highlight. Depending on how many people are in there, it takes 30-40 minutes to go through.\nShow less"], ["Reviewed August 11, 2016", 5.0, "Truly Mesmerizing Place", "Enjoyed the visit to Aquarium of the bay. Watched the various species of fishes and other creatures of the sea at a single place. Enjoyed our visit"], ["Reviewed August 10, 2016", 4.0, "Small but fun with good info", "This aquarium is small but has lots of info about the local area and marine life. There are shows throughout the day and they stamp your hand so you can return later if you would like. We were only there about 1 hour or so. Did this as part of our City Pass.\nShow less"], ["Reviewed August 9, 2016", 4.0, "A great attraction", "When my wife and I visited San Fran we went here and thoroughly enjoyed our visit. It was very interesting seeing all the creatures that live in the bay. I thought it was really well put together with really helpful staff. Ideal for visitors of all ages.\nShow less"], ["Reviewed August 8, 2016", 4.0, "I love this place", "We visit every time we are in San Fran. It's small but very well done, with a new otter exhibit to entertain too.\nI do think it's bordering on being too expensive - but I love it so much I'll keep paying - only two of us however, for a family it would really add up.\nFish, shark tunnel and otters - can't beat it for me\nShow less"], ["Reviewed August 6, 2016", 4.0, "Worth a visist", "We were in San Fran and saw the aquarium. Our 10 yr old loves anything to do with fish so we had to go in. Not a massive place but what is there is good and well presented. There is a small rock pool area where you can touch star fish and sea urchins and also a small pool where you can touch baby sharks and Rays.\nShow less"], ["Reviewed August 6, 2016", 5.0, "Worth it! Must go!", "Worth the time spent there. I recommend any travellers with children as they will love it. My daughter along with 100 other kids did not leave the sight the fish tank which had Nemo and Dori. They screamed with excitement probably expecting these fishes to chat with them. These fishes are bigger than any celebrity. Children also get to touch some fishes including baby shark and also feed them, which is very exiting. The next wonderful attraction in this place are the Sharks of Alcatraz and as the aquarium is over head children love the fact that the Sharks are all around them.\n\nThis is not expensive at all and strongly recommend families with children to visit! The best part is that you can buy the ticket early in the morning and keep visiting any number of times whenever you want the whole day!\nShow less"], ["Reviewed August 5, 2016", 4.0, "Lovely Fish Eye View", "There are some great views to be had from the upper levels of the aquarium- both of the city and the bay. The aquarium hosted a \"Fish Eye View\" of Bay Area waters, including how the ocean dwellers have adapted to the litter left behind by those of us on land. The exhibits were well done and most were hands on interactive a for kids. More than a few tourists let their kids run wild, but it actually made it kind of fun- they were really excited to see sharks and an octopus and the jellies. If you're at the pier it's a great place to spend a little time and learn something besides shopping for knickknacks on the boardwalk!\nShow less"], ["Reviewed August 3, 2016", 3.0, "Average aquarium", "It was nice, but small. A little pricey for what it is, espwcially for a family of 5, but the displays they do have were nice. Definitely a tourist trap, but was worth doing once."], ["Reviewed July 30, 2016", 4.0, "Worth a visit without being totally awesome", "We were in two minds as to whether to visit the Aquarium as some reviews had not been great but we were glad we went.\n\nThe staff were engaging throughout and in the aquarium itself, there were several staff explaining about the sealife and the Bay area, which we found to be quite helpful.\n\nYou can skip through the whole thing in about 30 minutes if you want to, or take a little longer to look at the various fish, listen to the guides and read the display texts - but you would be hard pressed to make your visit last more than an hour or so.\n\nThe real treat is the underwater walkway where you can see all the larger fish (and some small sharks) although a firm favourite of the family was the pool immediately after, where small rays were swimming around and bobbing out of the water as if to say hello to you.\n\nThere are other, more impressive aquarium, but the bias to the Bay makes this a worthwhile place to visit and we were glad not to be put off.\nShow less"], ["Reviewed July 29, 2016", 4.0, "Small but interesting Aquarium", "The Aquarium takes about an hour to go around. Very clean and well laid out. With time precious it is a good place to go you have limited time. Worth the visit"], ["Reviewed July 27, 2016", 3.0, "A Decent Replacement For Monterey Bay Aquarium", "Though this place does not have the same grandeur ambiance of the Monterey Bay Aquarium 2 hours south of San Francisco, it is a decent substitution if you need to visit an aquarium. It has many of the same exhibits as Monterey Bay Aquarium except in a lot smaller scale. They have a decent jellyfish exhibit, a very small anchovy round-about swim tank, a hands-on touch tank and a very good glass observation tunnel. The first tunnel displays many of the local rock fish which is ok but nothing to rave about. However, the second tunnel includes large bat rays, sharks and bass fish, and it is a very strange feeling having a large bat ray swim directly at you as if it's going to ram you only to be stopped by the glass. If you cannot get to Monterey and need to go to an aquarium, this could be a good substitution, especially if you have young children...\nShow less"], ["Reviewed July 27, 2016", 2.0, "OK if you have the right expectations", "It took me about 30 min. to see everything. It's a nice and very small aquarium, so go in with this expectation. Look online for a discount coupon rather than paying full price. It's also kind of funny that all of the marketing materials talk about the 'Sharks of Alcatraz' showing a big set of jaws, and you learn that the most common shark in the bay is actually pretty small and not very ferocious. Kids will like the walk through tunnels.\nShow less"], ["Reviewed July 24, 2016", 3.0, "Average", "Went to aquarium after Alcatraz. It was small and pretty average. It seemed expensive for the size of the aquarium ($25). Three small floors. A couple of long tunnels with sting rays and a shark."], ["Reviewed July 24, 2016", 5.0, "Great observation tunnel", "We visited the aquarium one afternoon and it took a couple of hours to walk around. The observation tunnel is amazing, really long and lots of interesting sea life all from the local area. Staff seemed very knowledgeable and friendly too."], ["Reviewed July 23, 2016", 3.0, "Average not great", "I've been to a few aquariums. This was ok but definitely not my favorite aquarium. It just seemed kind of boring. There were 2 long tunnels to walk through. There were a few interesting fish to see but it didn't seem like a lot of variety. Definitely did not see more than a couple of sharks and rays. It was crowded and just not really enjoyable for me.\nShow less"], ["Reviewed July 23, 2016", 3.0, "Okay but expensive and too small", "There are so many better aquariums in the world, it is hard to keep up with the others. I think the sting ray exhibit was good, and that was about it. They have one of those transparent walkways, which is good, but the type of fish is limited. Far too expensive however.\nShow less"], ["Reviewed July 23, 2016", 5.0, "Amazing", "We love this place! Every time we go to San Francisco we visit. It is like having a peaceful moment in a very busy city. The jellyfish are my favorite as I can watch them fluff about for hours. It is clean and very family friendly! The tunnel of sea life is a treat not to be missed!\nShow less"]]}}