{"Armstrong Redwood State Reserve": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Armstrong Redwood State Reserve", "url": "/Attraction_Review-g32465-d116914-Reviews-Armstrong_Redwood_State_Reserve-Guerneville_Sonoma_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/19/db/23/filling-our-view-towards.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1184"}, "address": {"@type": "PostalAddress", "streetAddress": "17020 Armstrong Woods Rd", "addressLocality": "Guerneville", "addressRegion": "California", "postalCode": "95446-9587", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Tranquil and easy hike/walk", "Beautiful place. Lots of paths that fit various fitness levels. educational signs on certain trees/paths. Bathrooms/ picnic places available. Usually pay a small parking fee ($5-7) Visit the amphitheater. Make sure to bring a sweater/ light jacket even on the hottest days the shade from the trees keeps you cool.\nShow less"], ["Reviewed yesterday", 5.0, "Great variety of trains through the Redwoods", "Great place for some light to midrange hiking or walking. Upon entering, one can choose an outer lot that has free parking or drive in and park for $8.00. From what I could tell most trails are accessible from the outer lot. I am fond of loop walks and I found this place had a few. You have options for a flat 1-2 mile walk that is stroller and ADA accessible, 2-3 mile loops or connected trails for longer hikes and loops. This location is good for all levels.\nIt is all under a canopy of Redwoods, allowing sun to peak through. Worth a visit, if just to wonder.\nShow less"], ["Reviewed 3 days ago", 5.0, "Take your time to take it all in!", "The drive to Guerneville was an eye-opener as we saw the devastation from the enormous Thomas fires first hand with over 281 thousand acres burned and oh the homes it destroyed. Once you reach the entrance to the reserve it reminds you of the cycle of life...as you stare straight up at the giant redwoods. We did not have near near enough time to see as much as we wanted but the trails are well defined for hiking and it is literally a slice of heaven!\nShow less"], ["Reviewed 3 days ago", 4.0, "A great day among the giants", "A great day, it was cooler and a small rain that made the forest smell wonderful. nicely laid out, easy to walk or drive and the tree's are just amazing."], ["Reviewed 1 week ago", 5.0, "Stunning.", "Beautiful park, it felt like we were the only people there. The redwoods were amazing, v easy walking path."], ["Reviewed 2 weeks ago", 5.0, "You will be amazed", "My husband and I visited here while we were in Sonoma County. The Redwoods were just amazing to look at- They are so enormous and they seem to go in forever. Some of the trees are as old as 1300 years. There are trails after trails and you will just continue to be amazed by the trees. Trails are from beginner to advance\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful walk and ride!", "Lovely redwoods! Easy to get to with lots of hiking or strolling options. We drove up the windy narrow road to the Bullfrog Pond lookout. Excellent views!"], ["Reviewed 2 weeks ago", 5.0, "One os the best easy walks in the area", "Amazingly beautiful, really nice trails and lunch area, truly inspiring trees, beautiful drive to and from, great history. The winter/early spring is the best time. And pay the money and drive to the parking lot..don’t be a cheapskate and miss out on the best of the park...and leave the dog at home, only allowed on the roads, not in the nature reserve.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Nice Redwood Stroll", "We went here one beautiful morning and did not have to stop in Muir Woods because of it. Muir is bigger and better mind you but Armstrong was calm and tranquil with some big trees and a quiet forest floor..."], ["Reviewed 3 weeks ago", 5.0, "Quiet, serene, uncrowded", "We noted that Muir Woods had just imposed a new parking protocol to limit the number of visitors. So based on a friend's recommendation, we decided to visit the Armstrong Redwoods instead. What a great choice! The redwoods and physical environment were spectacular - 300 foot tall trees over 1300 years old, lots of mosses, lichens and banana slugs! Yet, at the same time, there were relatively few visitors. We walked on several trails and enjoyed the 2 hours we spent there.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful Redwood grove", "This awesome attraction is just outside the funky town of Gurneville, CA. The trees are majestic, and unlike other redwood groves this one is not as crowded. Bring a picnic and mosquito spray, sit back and enjoy being among 1400 year old trees."], ["Reviewed 4 weeks ago", 5.0, "if you;ve never been here, you're missing something . . .", "this is a special place, a beautiful spot to enjoy and savor the redwoods . . . you can spend an hour or a day . . . hiking trails make it a good place to walk and explore . . ."], ["Reviewed January 21, 2018", 5.0, "Majestic Redwoods", "A special place to hike and appreciate the majestic beauty of a Redwood forest, dog friendly with easy parking and modern restrooms."], ["Reviewed January 18, 2018", 5.0, "A gem!", "We did a longer hike and ended up on the shorter loop through the redwoods. The shorter loop would have been just fine. So amazing. Great history about the trees and it's preservation."], ["Reviewed January 6, 2018", 5.0, "Skip the crowds at Muirwood, Come here instead!!", "This place is a gorgeous destination to see the Redwoods!! The drive from San Francisco was spectacular. Checkout the neighboring cities near this and make it an overnight trip. Definitely wear hiking shoes if you plan on venturing further than just the main trees. My friends and I did a 2 mile loop with a 500 ft elevation, definitely wore us out but it was worth it! If you’re up for it, go on a longer one. Give yourself plenty of time so you’re not stuck trying to get back quickly at the end of the day before the sun sets\nShow less"], ["Reviewed December 29, 2017", 5.0, "Towering FIRno", "Best park ever! So peaceful and magical. The redwoods are absolutely gorgeous. Ferns, moss, and trees galore. You can drive into the park, park, and walk the many trails. Completely different weather system inside the Forrest, with temperatures 15 degrees cooler."], ["Reviewed December 29, 2017", 5.0, "Just Go Silly it's Gorgeous", "They're giant amazing thousand year old trees. Go, there is absolutely no way you could be disappointed. You can even drive through if you're not the walking type. Stop reading this review and go see the pretty nature!!"], ["Reviewed December 21, 2017", 5.0, "Excellent", "Very fresh air, reserved very well.\nHave picnic area with Water. Well arranged trails with signs.\nThe park is Easy to find even with an old gps. Free parking space and\nAffordable parking space inside the park.\nAfter paying, you can get a colorful map which can be returned after your trip- a very nice arrangement!\nClean toilet for both Male n Female.\nHighly recommend!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Armstrong Reserve", "The Armstrong Redwood park is amazing! Lots of cool trails to hike and the trees are HUGE!! We didn't have any problems finding a good parking spot right close to the trail heads."], ["Reviewed December 21, 2017", 5.0, "Great place worth going", "This park is set up really nice.very informative signs,well marked trails etc.you can walk in or drive the park.its a easy access place as well"], ["Reviewed December 8, 2017", 5.0, "Stunning!", "We don't have the words to adequately describe how beautiful this redwood reserve is. Every 10 steps provides another photo opportunity or reason to just stop and take in the natural beauty around you. There is a parking lot and a small visitors center where you can get a map. There is no charge if you choose to walk in, which we recommend. There were very few cars in the reserve when we were there. There are multiple very well groomed trails that are easy to walk, many of which would accommodate a stroller or a wheel chair. If you love natural settings there is no better place to spend an hour or two.\nShow less"], ["Reviewed December 8, 2017", 5.0, "Go see the redwoods without the crowds.", "We went for an early-afternoon walk here on the recommendation that it gave us all the redwoods you could want without the crowds of Muir Woods. We were not disappointed. From a simple walk on flat trails to more moderate hiking, you can't go wrong. There are signs along the trail that explain about the region and its history (the sort of think that may have bored you as a child, but you find interesting as an adult). The redwoods themselves are simply impressive - you can't help but be amazed by their size and age.\n\nBe sure and stop at the gift shop on the way in. The staff there were pleasant and helpful. We also encountered a volunteer guide while on the walk - he was equally as nice to speak with.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Fun place to visit", "Took a quick trip to the park, glad we did! Fun place to see the Redwoods. Great story behind the Armstrong’s. Went on a Saturday, not too crowded. Finished our trip in downtown Guerneville walking around the shops."], ["Reviewed November 26, 2017", 5.0, "Natural wonder not to be missed!", "Free parking right outside the gate. Many levels of trails, ranging from level & paved to more strenuous. I was a solo visitor yet felt very safe. The Redwoods are absolutely majestic. This is a magical place that will inspire visitors of any age!"], ["Reviewed November 24, 2017", 5.0, "More than a walk in the woods", "More than a walk in the woods. Moss. Lichen. Banana slugs. Think Star Wars and perhaps an Ewok or two. Just a place to hike with imagination. Carry water and a snack."], ["Reviewed November 18, 2017", 5.0, "Beautiful Nature", "After discovering the beauty of the Grape at Korbel, drive toward Guerneville and you will discover Armstrong Woods on the right (entrance to). A short drive down the side road will deliver you to spectacular, old growth redwoods. Well maintained walking paths, with appropriate signage along the way. Stories of the old logging industry will give you a hint at why Guernville is nicknamed “Stumpown” Keep your eyes open for the strangely beautiful Banana slug.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Armstrong Redwoods is an impressive grove of coast redwoods considering it is only about 50 miles north of San Francisco", "Armstrong Redwoods state park has several nice hiking trails and the Colonel Armstrong tree is over 300 feet tall! This grove is very close to Guerneville which previously was called Stump Town for good reason so it is amazing that this grove still has some great old growth trees.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Beautiful and serene", "An excellent stop to enjoy nature at its finest. WE spent about an hour walking the trails and observing nature. The Redwoods are OLD and tall. Interesting facts are posted along the way. Multiple ways to tour the forest, by vehicle or walking, so accessible to all.\nShow less"], ["Reviewed November 10, 2017", 4.0, "A wonderful place to relax", "Armstrong Redwoods is a place to sit and look up or slowly wander or HIKE up a hill or all of the above depending on your mood"], ["Reviewed November 10, 2017", 5.0, "Amazing Hike", "We had spent the night at the Russian River Autocamp and were heading towards the coast. Luckily the helpful staff told us about Armstrong Redwood State Reserve. Being from Ohio, we never tire of being in the majestic space of the redwoods. We were thrilled with this park. The trails looked amazing. Due to a hip issue, we were relegated to the paved trail, which, in spite of being accessible, was truly astounding. I️ am so grateful for our brief visit and will definitely return.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A Must See!", "Armstrong Woods is one of my favorite places on earth. It has breathtaking beauty and serenity all its own. I so enjoy watching others taking it all in, occasionally, I point out things that might be missed. What's sad are the folks who walk through this amazing place chatting away & not even looking around. If they could take in all this magnificent beauty, their troubles might just melt away. A great place to meditate, pray or just be still for a few minutes. For an extra special experience, visit the morning after a rain when the moss looks florescent in the morning light. It's proximity to Korbel Champagne Cellars and the Pacific Ocean creates the perfect trifecta for visitors. A not-to-be-missed opportunity for free (if one parks in the parking lot and walk into the Woods). There is a small fee for driving a vehicle into the Park. The pathways are wheel chair accessible for most.\nShow less"], ["Reviewed November 6, 2017", 5.0, "This place is Awesome!", "What a wonderful addition to a day of wineries. The redwoods are literally awesome & absolutely worth a visit. We did a short walk that covered all the main trees/areas & it was perfect. Make sure to read all the history info, very cool."], ["Reviewed October 24, 2017", 5.0, "Secret Redwood Grove", "Who knew this beautiful park was outside of Guerneville and so easy to get to? Between wine tasting, rafting the river, we stopped in at this park and took the most beautiful easy, flat trail through a valley filled with Redwood trees, ferns, deer, and shaded cool benches where you can sit and enjoy the peacefull environment. They even allow dogs on leash along the road trails. will definitly go back again.\nShow less"], ["Reviewed October 22, 2017", 5.0, "A quiet respite...from the smoke.", "We were in Guerneville, CA two weeks ago when the fires broke out, this grove of redwoods was the first that I've visited and it was spectacular, easily accessible trails wind through the forest and give you a great experience, while small in acreage the trees more than make up for it, as an added benefit they seemed to filter out some of the smoke.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Awe Inspiring", "Awe inspiring is overused, but this is truly an awe inspiring location. We went on a fall morning with few other visitors and were amazed by the redwoods and calmed by the tranquility. The main trail with the Redwoods is wheelchair accessible and is an easy under two mile flat loop trail. There are plenty more trails that are advertised as moderate to strenuous, and our experience with the Pool Ridge Trail is that it just went steeply up until we turned around and went back down. The restrooms are located at the visitor center and the picnic area which is at the far end of the main trail so you are never far from the facilities. You can park for free at the visitor center and go for the shorter hikes, but you probably should pay to drive in and park if you want to hike the longer trails in the Austin Creek Recreation area (which we did not visit).\nShow less"], ["Reviewed October 21, 2017", 4.0, "Awe inspiring", "There is parking near to the start of the trails with a visitor centre. There are trails of approx mile return which are largely flat with easy walking. These are Redwoods that survived the great logging era and some are indeed very large, tall (300 feet) and old (over 1000 years). There is one cut trunk showing its rings with an interesting time line showing the tree as a sapling in 949 AD.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Beautiful walk amongst the tall redwoods", "It's free! Like being in a cathedral! I highly recommend stopping here. It's only a few miles from downtown."], ["Reviewed October 16, 2017", 5.0, "take a restorative walk through this park", "Few places on earth are as calm and quiet as in this stand of coastal redwoods. There were many people in the park, judging by the number of cars in the lot, but we could hear no one while walking through. I mean, not a sound! It was a supremely beautiful place.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Worthy of a visit", "Of course, there are other redwood forests and parks but this is truly a fine place to visit. It has an interesting history and is so walkable, so calm and peaceful, one does not want to miss it if visiting anywhere in the area. All the staff and volunteers are very nice and eager to tell you more. Truly worth a visit.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Stunning walk to the top", "I did the 8 mile loop up to the top via the East Ridge track. It was equal parts stunning and exhausting. It's steep and an awesome workout. The good news is once you hit the top it's downhill all the way home. Enjoy!"], ["Reviewed October 4, 2017", 5.0, "Beautiful", "The walk through this park is breathtaking. I have spent many hours there since I was a teenager . 50 years later I still see new things as I walk through the trails. One of my favorite places to go just to feel at peace and close to nature.\nShow less"], ["Reviewed October 4, 2017", 5.0, "So Peaceful", "This is a must see. The park is beautiful. You can drive right up into the trees. The walks are flat and paved in a lot of places."], ["Reviewed October 3, 2017", 5.0, "Sacred Ancient Redwood Tree Grove", "Church in nature... breathtaking trees and easy hikes or more challenging ones if you'd like. The smell and the air so fresh, and the forest floor is cushioned with redwood needles."], ["Reviewed October 3, 2017", 5.0, "Not the largest redwoods, but very impressive and a pleasant place to walk", "A trip to the Armstrong Redwoods Reserve is well worth it. The trees are majestic. Hard to believe that the ones in Humboldt are even bigger. Well-marked trails, friendly rangers. Only about $7 per car, depending on your age. Parking probably gets pretty tight on busy days. Probably best to go on a weekday. Very pleasant place for a walk.\nShow less"], ["Reviewed October 2, 2017", 5.0, "More than we expected", "An absolutely beautiful shorter walk in the Redwoods that rivaled Muir Woods. All this, and in the morning, no crowds"], ["Reviewed October 2, 2017", 4.0, "Lazy day stroll", "Massive beautiful trees made for a leisurely cool stroll. There is a picnic area, and the paths are pretty well marked. Doesn’t take long to do the main path."], ["Reviewed October 2, 2017", 5.0, "Amazing redwoods!", "This redwood reserve is the Muir Woods of Sonoma. The park is exceptional with beautiful trails and redwoods that are 1400 years old. If you are in Sonoma, do not miss this spectacular area!"], ["Reviewed October 1, 2017", 5.0, "Beautiful, small park away from the crowds!", "This park is an hour-ish north of the famous Muir forest, and is a small park that offers walking trails and camping. It receives much less traffic than Muir, and is just as gorgeous. It's an escape for people who want to see the redwoods but not deal with the crazy crowds and parking of Muir.\n\nIt is also dog friendly as long as the dogs stay on the paved roads and are leashed. We didn't know what to expect (walking on the roads?) but there are two roads that go through the little forest part, one stems off and goes to the campsites - the other branch gets much less traffic. We walked along that branch of the road and encountered just a couple of cars, which move slowly and you can move over and wait for the car to pass (but it's wide enough that you don't have to)\n\nThe park is arranged like this:\nAs you approach the ranger station, you see a parking lot and the information center on the right (BEFORE you enter the park). You will also likely see lots of cars parked along the road leading up to the parking lot. You can easily park out there and walk in (no fee, cars have to pay a fee, in cash, to enter). If you're heading to the camping area, I can't say whether that is walkable since we didn't head up there. It seemed like a lot of people were making the drive up that way, though. But the walking paths of the park, in total is probably less than a mile around, so it's an easy walk along the road, I think it is wheelchair friendly, too, along the paved road.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Roaming through the Redwoods", "The Armstrong Redwood State Reserve is just a short drive away from Russian River Autocamp. If you enjoy being in nature and hiking through the woods this is a great place to explore. The Reserve has trails of various difficulty so you can choose an easy walk through the woods or challenge yourself with uphill hikes of varying elevations.\nThe various trails offer you an opportunity to see as much of the Reserve as you would like or as little depending on how much time you want to spend there .\nThere are some amazing trees and it's something that just about any one can do and enjoy.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Beautiful Park - great for a nice walk", "Visited an old friend who took us to this beautiful park. Wonderful sites, not too crowded, well-kept paths and trails. A nice interaction with Nature!"], ["Reviewed September 26, 2017", 5.0, "No crowds, plenty of hiking trails", "My wife loves the redwoods. We had went to Muir Woods last year and it was overcrowded. This year we decided to visit Armstrong Redwood State Reserve. We got there around 10am and it only had a few people. We visited the visitors center and the nice lady there recommended what hiking trail we should take. It was a great trail. Flat and easy to walk. Took us through the redwoods, gave us lots of picture opportunities. Well worth the time to drive there from where we were staying in Petaluma.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Incredible!", "It's nearly impossible not to stand in awe of these giants. We've been in redwoods many times and we never take these beauties for granted. There is camping in the park and several trails, some are very easy and take about an hour if you have a time constraint. On a recent hike through the park, we met just a few fellow hikers. We essentially had the place to ourselves. Amazing! It is easy spend a couple of hours savoring the sights and smells in the forest. This park is definitely worth a visit.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Amazing clean air, tall trees", "Beautiful location for a quick walk in among the redwoods or go further afield if you have time. Love the smell of the forest and can't get over how tall some of these trees are"], ["Reviewed September 21, 2017", 5.0, "Awesome redwoods! Great short hike!", "Stopped off here as part of a drive up the Coast Highway from the San Francisco area, to Jenner, through Guernville, over to 101 and back to the bay area. This reserve was a great stop to stretch the legs. A couple of good, though short, hikes through the incredible redwoods. The paths are easy to navigate. And signage is good describing the trees and the history. Worth a quick visit and a 15-30 minute hike.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Rode our bikes in, so No Charge entry!", "Beautiful, peaceful stand of old Redwoods. Not as fancy as Muir Woods but a whole lot less people than it is there. Conveniently close to downtown Guernville so lunch and a walk in the park can easily happen in the same day."], ["Reviewed September 20, 2017", 5.0, "Amazing", "We visited this park on the same day that we visited the Korbel wine cellars, which are close by. Information was given by the innkeeper at our accommodation.\n\nParking is free in the lot by the visitor centre, where you can get a map for the paths through the park. Donations can be made here.\n\nWe took a short route, but this was amazing. Walking through these ancient trees is humbling, and it is a great embarrassment that so many have been cut down. The weather was damp when we visited, which accentuated the heady and unforgettable scent.\n\nThis park is worth a visit for everyone.\n\nShow less"], ["Reviewed September 18, 2017", 5.0, "Excellent walk/hike", "Park in the visitor parking or outside the gate for free and walk into the park. If you want to drive in the per car cost is $8.\nStop at the visitor center as the volunteers are friendly and knowledgable.\nIf you just want a walk you can stay on the paved paths.\nFor a slight hike (500 ft elevation) take the paved paths towards the Armstrong tree and follow the Pool Ridge Trail. The path is not paved but easy to follow. There are switchbacks up the ridge. Can be done with running shoes. Beautiful and lightly travelled. The trail back down to the paved paths is a steep fire road.\nFor a longer hike you can continue up to Bullfrog Pond campground. This longer hike is a total of 1,000 ft elevation.\nWhether you stay on the paved trails or take an additional hike the trees are amazing and well worth the visit.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Inspiration Plus", "The ancient coastal redwoods near Guerneville should not be missed. What an inspiring experience, just being in their presence. The visitor center is worth some time. The hiking trails are well marked and offer an approximate two-mile loop among the grove to the Colonel Armstrong and Icicle Trees. Unless you wish to do some serious hiking of the nine miles of trails, one can have a valuable experience at the Reserve in about two hours.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Wow", "The redwoods are amazing. Lots of great hikes to do. Park in the lot outside the park. The staff at the visitors center was very helpful. It is breathtaking and should not be missed"], ["Reviewed September 16, 2017", 5.0, "Great time", "Took the walking tour of this redwood reserve today. It was one of the best walking tours we ever took the weather was cool in the trees were spectacular I highly recommend this to anybody especially if they have children."], ["Reviewed September 16, 2017", 5.0, "Unbelievable Trees", "First time in the park. I was blown away by the beauty and majesty of these trees.\n\nJust a short drive off 116. If you are nearby make sure to stop and check it out. I wish we had more time but unfortunately, the sun was going down.\n\nIf I ever get a chance to go again, I will.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Beautiful Park; mostly off the beaten path.", "Nothing on earth can compare with a walk amongst the coastal redwoods; and the Armstrong Redwood Reserve is a great place to do it."], ["Reviewed September 9, 2017", 5.0, "Quiet place to see some big trees", "Tried to get into Muir Woods the day before and couldn't even get in the parking lot. Went to this place the following morning and we were able to park and walk into the reserve for free. Beautiful and quiet and able to enjoy the large redwoods without the crowds.\nShow less"], ["Reviewed September 8, 2017", 4.0, "Inspired by nature's majesty", "There was a simple reverence felt here. We spent 90 minutes slowly walking, pausing and pondering on the Majesty of our surroundings.\nParking at the Visitors Center is free. The path is an easy walk, sandals ok. The path crosses a paved one-lane road a few times.\nThe is a small fee if you drive past the VC.\nCell phone coverage is AWFUL here.\nI am grateful I did not miss this treasure.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Majestic Redwoods", "Armstrong Woods is one of our favorite places. You can drive in or walk in, but, either way you are surrounded by beautiful, tall redwoods. There are some easy walking paths that take you among hundreds of years old trees that will dazzle everyone."], ["Reviewed September 4, 2017", 5.0, "Awesome trees", "It's almost impossible to describe the sense of awe and wonder that redwoods evoke, and the Armstrong Redwoods are magnificent. We spent well over an hour walking various trails amid the trees, and would have stayed longer if we hadn't had a deadline elsewhere. The reserve is well maintained, there are multiple interesting signs that explain various aspects of the natural environment and also some history of the farsighted people who helped preserve it. Good clean restrooms, too, and water fountains. Well worth a visit.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Incredible, Easy Walks Through the Redwoods", "This incredible natural wonder of a park is a welcome, peaceful break from the hubbub of Sonoma wine country. Easily accessible on a good paved road north out of downtown Guerneville, the park is magnificent. Easy trails connect into a route of only about 1.5 miles, all flat and well marked, through breathtaking stands of Douglas Fir and redwoods, many exceeding 14 feet in diameter. The fragrance of the firs and the silence were soothing. Impossible to capture the scale and beauty in photos. Must be experienced to be believed. Before or after, be sure to stop by Korbel Cellars just east of Guerneville for the excellent free tour of their champagne winery and sit a bit in their outstanding and inexpensive terrace deli/cafe.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Fantastic sites and hiking!", "Husband and I love hiking and have been here before when it was cooler and there was a drizzly rain falling. This time being a very unseasonably hot day we chose to walk the trails below. It was a popular day to hike and the free parking was filled while cars lined the approaching roadway for about 1/4 mile on both sides. The campgrounds were full and the picnic areas were being utilized. Lots of families and dogs (the barking by some was annoying). The trails are easy walking below and well marked. We enjoy this area. No service for cell phones so don't plan on calling or communicating with outside while you are there.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Awe inspiring", "So beautiful and peaceful, it's truly a gift to be here in the redwoods. Just an incredible experience, even for a short visit. We had our dogs with us so we couldn't hike the trails but there is a lot of ground to cover regarless. Lots of picnic tables too.\nShow less"], ["Reviewed August 27, 2017", 5.0, "You can't go wrong...", "...if you visit a park full of redwoods!\n\nMy wife and I woke up in Petaluma and were looking for a place to go hiking. My daughter had heard of Armstrong woods but didn't know anything about it. I checked on the internet, took a look at one of the pics and I knew we had to drive there.\n\nIt wasn't a problem driving from Petaluma. We took the back roads (highway 116) through Sebastopol, Guerneville and Forestville (50 minutes total). We arrived to the park around noon on a Sunday, parked, checked the map at the entrance and started our hike. You can do easily 3 miles just in the main loop in a very easy, flat surface.\n\nThe day was very hot but it was very pleasant walking under the canopy. I would recommend the drive (passed to several vineyards on our way north). Coming back we drove straight to Highway 101 and from there south to Petaluma.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Easy To Miss This", "We always try to walk through the Redwoods. There is no bad time of year. In the winter, it is wet and a river runs through it. In the summer, it is like being transported to another, quieter world. The trees are truly awe inspiring."], ["Reviewed August 26, 2017", 5.0, "Quick stop", "The woods were awe inspiring. To think these trees were hundreds of years old is fascinating. Can't miss stop"], ["Reviewed August 20, 2017", 5.0, "Truly amazing - must do", "The park is so peaceful and you are blown away by the beauty of these old redwoods standing for years and years. I called ahead and was told it gets so crowded here so we visited bright and early. Arrived just before 8 am and booth wasn't open yet but we used the honor system - filled out the form and put our money in the slot. We drove through the park and stopped at several parking locations to walk around and take pictures. It was so quiet - we really enjoyed the beauty of the forest before any crowds. We spent about an hour here. When we got out the visitor parking lot was only half full. This is a must do visit!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Peaceful forest walks through awesome trees", "This was possibly our 5th visit over the years and we are never disappointed. Lots of photo opportunities. The paths are easily walked by young and old alike. If nature is what you want this place does not disappoint."], ["Reviewed August 19, 2017", 5.0, "First visit ever to a redwood forest", "I have seen pictures of redwoods before but they do not prepare you for the emotions of seeing them in person. These huge ancient trees are beautiful to walk through. Stopping to read the placards on the trail provides insight to growth and development of these trees. It is a popular area, so I recommend getting there when they open otherwise parking gets full. A two hour hike in the woods really leaves you with a sense of awe about the natural beauty of Northern California!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Great Park", "Huge beautiful trees and no crowds! I visited Muir Woods probably 30 years ago and wanted to take my family during our visit to northern California. Then I heard you need to get there before 8:30 and how many tour buses visit on a daily basis. Not for me or my family! We love the peace and quiet. Fortunately we heard about Armstrong and came here instead. Came during the week. No issue with parking our crowds. It was quite pleasant and my family was blown away by the redwoods.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Must see!", "This place is just amazing! We arrived a bit late about 45 min before sunset and there was nobody here. It was almost eerie how quiet it was walking among these mighty trees. It was so beautiful, calm and peaceful. If you want to see stunning red woods stop here, you won't regret it.\nShow less"], ["Reviewed August 16, 2017", 5.0, "No Crowds - A blessing", "Grandson came with us and experienced a fun visit with no long lines or crowded trails. 1400 year old trees can make you feel very young and vertically challenging.\nEasy times - don't rush.\nBring lunch and enjoy at the picnic area.\nYes it is worth the extra mileage.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Fantastic Visit", "On this visit, you'll see how aggressive a species the redwood is--it readily sends ups new growth from the base of the tree, it is unusual to see one trunk without an accompanying shoot--and the views are inspiring, comparable to Muir Woods."], ["Reviewed August 14, 2017", 5.0, "In the Midst of God's Beauty", "My girlfriend Carol and I went on a venture hike and it was amazing I love the beauty and presence of the Redwoods."], ["Reviewed August 12, 2017", 5.0, "Great Short Visit!", "We were in the area and don't want to visit the chance to see these famous trees. I would suggest to park outside of visitor center and walk in free as there are some trees along the trail to see. If you drive in, you will miss these trail. The area is small. It only took us about1.5 hours to complete the visit. It was a pleasant visit!\nShow less"], ["Reviewed August 12, 2017", 5.0, "This should be on everyone's bucket list", "We did the 2.4 mile hike. The first 1.2 miles pretty much up hill but the path is good. Sign at the bottom says steep climb but not as bad as we thought. The redwoods are absolutely unbelievable. No one can believe until you send them pics with you standing in front of these monsters, how big they are. Give yourself about 2 1/2 hours for the hike. There are also shorter hikes that are flat and wheelchair accessible. Plenty of picnic places.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Perfect walk and picnic!", "Traveling with 2 small kids and 6 adults is an adventure. This lovely park is free unless you want to drive your vehicle all the way to the picnic area.\nWe took advantage of the manicured trails-- they were perfect for the 3 year old and the 70 year old. Trees and areas are highlighted on the map so that there were a number of educational opportunities for all.\nClean picnic area and clean flushing toilets were a plus.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Majestic!", "It was like walking back in time. We arrived early and it seemed as though we had the entire forest to ourselves. The tree's are just amazing compared to what we have on the East coast some as high as 310+ feet. The deer come within 20' of you with no fear. Located in the Russian river valley made it all that much better. The Russian River valley has some of, if not the best Pinot Nior's in the world. Also a very quaint little town to walk through and eat or shop. We stayed in Yountville in the Napa valley and it was only about an hours drive. Well worth the trip.\nShow less"], ["Reviewed August 10, 2017", 4.0, "A gorgeous place to visit", "An excellent afternoon outing. If you opt to go for the longer hike--past the star attraction redwoods, be prepared for a long hike that is mostly uphil!"], ["Reviewed August 8, 2017", 5.0, "Forest of dreams!", "Loved our morning walk in the Armstrong Redwood preserve. It's the perfect thing to do in the morning when you are in this area, before doing some wine-tastings in the afternoon!"], ["Reviewed August 7, 2017", 5.0, "Wonderful!!", "This place was recommended to us by a campsite we stayed at. If you want to see redwoods then this is a better and quieter place to visit. It has lovely walks set out which are easily accessible. The weekends at other redwood sites have been really busy and packed full of people so depending on your time of visit I would definitely visit here instead.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Awe inspiring. Majestic redwoods.", "Don't miss this if you are in the area. Take a break from the wineries, especially on hot days. There are may hikes, some short and some long. We took the East Ridge Trail and circled back to the Visitor Center. This is about 3.5 miles. A moderate hike with some elevation. It will take you past a small waterfall, the Icicle Tree, the Colonel Armstrong Tree (1400 years old!) and the Parson Jones Tree, the tallest at 310 feet tall. You will enjoy the serenity, the majestic trees and the perspective this magnificent place provides.\nShow less"], ["Reviewed August 6, 2017", 4.0, "Up Up and Away!", "Wow! Took my 14 year old on a father son weekend and this was our trips highlight. Staff was amazing! Entertaining and educational - we took home some great memories and better understanding of our state's treasures. Super safe, super fun!"], ["Reviewed August 5, 2017", 5.0, "Not to be missed, wonderful for hiking in a redwood forest", "Many trails, several were easy, and all well maintained and well marked. Restrooms are in parking area although we arrived via bike and received a free map in the information area"], ["Reviewed August 3, 2017", 5.0, "Wow - big trees", "We didn't have time or inclination to go further north for the redwoods so made do with this forest. It was great - a lovely easy walk amongst the giants. Awe-inspiring. Beautiful. Grand. And we saw two deer."], ["Reviewed August 3, 2017", 5.0, "majestic trees", "Great trip to the forrest. First time seeing redwoods and they were impressive. 300' tall and so wide. Nice easy walk, Park at the visitor center if you can then walk in. It's free and you won't regret going"], ["Reviewed August 3, 2017", 5.0, "A little something for everyone", "Beautiful spot. Changes with the seasons. Easy strolls on flat paths with signs about what you're seeing. Or longer more strenuous hikes if you're into that sort of thing, and things in between. Parking can be tough if it's busy, but a magical little place right outside of Guerneville.\nShow less"], ["Reviewed August 2, 2017", 5.0, "So peaceful", "This is a wonderful park that caters to so many different people. It's quiet and peaceful, very tranquil to walk through, but offers a variety of different paths. The main loop is a very easy mile or so circle through the redwoods but there are also longer hikes and more challenging ones. The picnic area is a little over run with bees buzzing around at times, but it is a nice, quiet, cool way to escape the heat of CA.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Absolutely worth the visit!", "This tucked-away park is one of our favorite destinations in all of Northern California. Armstrong Woods is the perfect size to stroll around for an hour and take in the majesty of this isolated old-growth redwood forest. We go every day when vacationing in the area and it never fails to uplift and renew our spirits.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Not Your Ordinary Walk In The Park", "Words or pictures do not do this park justice. If you are in the area you must stop .You don't have to take a major hike to enjoy it. The simpler trails are clearly marked. We went in the morning and it wasn't very crowded. Just seeing these majestic trees and learning their history I found myself reexamining some of life's priorities\nShow less"], ["Reviewed July 31, 2017", 5.0, "Worth it!", "Beautiful, my boyfriend still talks about the trees. Easy hiking paths and a friendly visitor center."], ["Reviewed July 30, 2017", 5.0, "Wonderful!", "A little out of the way, but well worth it. You can get a map at the Visitor Center, which you may need, as some of the paths are not clearly marked and you may not get a signal on your cell phone navigation. There are some flat paths, as well as more strenuous ones, so choose wisely! Beautiful redwoods and some nice views.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Northern CA Trip", "If you want to see Red Wood Trees the tallest living species this is one the parks to visit. The access is great and trails are easily accessible. These majestic being have been around for thousands of years.\nArmstrong Redwood State Park is well maintained and has different trails with various difficulty. The trail head have very good information on the grades and steepness of the trails. There are ample trails for all levels of expertise. If you are in the Russian River area don't miss this stop. You can spend min one hour to an entire day exploring this beautiful park. There is an entry fee if you drive in, some folks park outside of the gate and walk in.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Life is but a Dream", "Once a year, my wife and I rent a canoe down the Russian River. It's not Raging Waters and there are no thrilling rapids, but it is fun. My wife likes to steer, and I love to paddle. We're always told that it's a 4 hour trip, but we cut the time in half. We are not kids; we're in our late 60s, so it's not that strenuous. If we start early, we stop off at Korbel and drink champagne. Life is but a dream.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Gorgeous", "Beautiful huge trees. Go early. Gorgeous silence and the presence of the place is overwhelming. The sheer scale of the trees is striking, and the sun high in the canopy with shade below creates beautiful light."], ["Reviewed July 20, 2017", 5.0, "Awe inspiring", "HUGE trees. Its nice and peaceful under the canopy of redwoods. Nice quiet meandering trails that wind through the trees. It can get very busy and crowded, so go early."], ["Reviewed July 17, 2017", 5.0, "Beautiful Redwoods", "Took a stroll here with the family. Very beautiful walking path with amazing Redwoods. Definitely family friendly. Swing by if you're in the area and want to see Redwoods. Highly recommended."], ["Reviewed July 16, 2017", 5.0, "Awe-some redwoods", "While other areas had lost trees for rebuilding SF after 1906 earthquake, this reserve did not, so there were trees hundreds of years old. So very tall and stately. Three of us, touching fingers, could not stretch around a typical tree at a picnic area. Very spiritual and quiet.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Magnificent redwoods, up close", "It is a real privilege to walk amongst the redwoods at this well maintained park. There are many trails, and several are an easy walk. The Pioneer Nature Trail, for example, takes you on a wandering journey right through the redwoods. You will be communing with nature in a unique and special way in a cool, shaded forest. These fabulous trees are not to be missed.\n\nIt is particularly nice that the state park provides a free parking lot right outside the gate, so you do not have to pay the state park admission price -- you can just walk in for free. If the lot is full, just park along the side of the road.\n\nThis was an unforgettable experience. Don't miss it!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Great Hike and Redwoods", "Hikes the East Ridge Trail to the Pioneer and Discovery Trails. Got there early to beat the hustle and bustle. Well worth the trip and would recommend to anyone. Tons of picnic areas for families or a day trip."], ["Reviewed July 10, 2017", 5.0, "Ahh, the redwoods!!", "The redwoods are so majestic! There are great hiking trails, picnic benches for picnics. Great place to go."], ["Reviewed July 10, 2017", 5.0, "Behold the mighty trees", "If you're an amateur biologist wowed by the teeming diversity of the forest floor, a conservationist, tree-hugger, or someone just wanting to catch his breath amid these giant wise trees, you're going to be moved in some way by this pristine and well-maintained park. This place is not just a must-do in Guerneville - but in the world! I recommend it highly!\nShow less"], ["Reviewed July 7, 2017", 5.0, "Peaceful, majestic", "Gorgeous and peaceful. There are marked trails throughout the park and they are easily walkable. We were there on a Wednesday afternoon and it was not crowded. It was very quiet and peaceful and the trees are majestic. Highly recommend making the trip if in the area.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Incredible Redwoods.....Don't miss this experience", "The Armstrong Redwood State Reserve was absolutely beautiful. Easy to navigate, great signage and well groomed trails! The trees are awe inspiring. The rangers were really helpful. Some of the trails off the beaten path were very nice and quieter with less visitors. Go early in the day to avoid the larger crowds.\nDefinitely worth your time!!\nShow less"], ["Reviewed July 4, 2017", 5.0, "Who knew this peaceful and tranquil treasure was so close to Wine Country?", "The magnificent redwoods cannot be described by words. The $8 entry fee is a bargain for such amazing views and trials. A must see in Sonoma County!"], ["Reviewed July 2, 2017", 5.0, "A Mystical Haven", "The day, time of year, and even the hour will influence your experience of the \"Woods\". My favorite time is just before darkness falls, yet with enough light to still follow the path that is very close to the entry. With darkness falling being within the forest 's atmosphere elicits a feeling of serenity and sacredness.\nThe redwood is one of the most successful living organisms on the planet, many over 1,000 years old.\nThere are numerous hiking trails with wonderful views. And if one does not want to camp or spend the whole day the Pacific coast is only 13 miles away via the scenic Route 116.\nShow less"], ["Reviewed June 30, 2017", 5.0, "Great Hike!", "Great hiking options through the redwoods! There are multiple trails to take depending on the length of hike you would like or how strenuous you would like your hike to be. We did a couple of trails. While the trails were a little crowded for my taste, everyone we encountered was very friendly. I have been to Muir Woods and enjoyed Armstrong more.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Easy hike options through gorgeous redwoods", "Peaceful redwood forests, informational signs along the way, and a great couple of hours enjoying this beautiful reserve . What a way to spend an afternoon! Parking is free and close to the trail entrances."], ["Reviewed June 25, 2017", 5.0, "Amazing trees and nice walk", "Spent a wonderful afternoon walking around the nature trails and visiting the spectacular trees! Worth the trip from anywhere in the Bay"], ["Reviewed June 24, 2017", 5.0, "Amazing sites", "We hiked the trail and checked out the amazing redwood trees. It was free and a good way to spend the morning. You defensive need good shoes with traction because there are some area which are steep and slippery. Make sure you have bug spray as well. Nice activity.\nShow less"], ["Reviewed June 21, 2017", 5.0, "See redwoods up close", "A state reserve for these unique trees some of which are huge. Camping is available in the reserve. Walking the trails from the parking lot at the entrance is free. Driving through the park bears a fee."], ["Reviewed June 20, 2017", 5.0, "Amazing Redwoods", "Absolutely stunning redwood trees. Ideal short trails to choose from. We started on one but carried on to another. Easy walking for all ages and abilities.\nFabulous trees. One being 1400 years old. Very tranquil too.\nFree to enter on foot and free to park. I think you could pay to drive thru.\nShow less"], ["Reviewed June 16, 2017", 5.0, "A Walk in the (Red)woods", "The trees are spectacular. If you've never been in a redwood forest you will be awed by this one. There are many trails--some easy; some challenging. Signage is very helpful, but because trails crisscross each other and are bisected by a road it is wise to take a map with you as well. Tips: (1) If it is cool and damp in town it is cooler and damper deep in the forest where little sunlight penetrates even on the best of days. Be prepared. (2) In June, at least, mosquitoes are numerous. Be prepared for them, too.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Big trees and great views", "The trees are amazing however if you feel more adventurous do the the east ridge trail (can be steep in places so good walking shoes, take enough water if hot). This will take you up through the tress and out above them. When you come out of the trees near the top of the trail and into the meadow grass areas, on a clear sunning day you can see for miles over the Sonoma hills. Well worth the effort. On the way down watch the buzzards taking the thermals and keep an eye out for deer. When you get into the valley floor again, follow the trails mapped and signed to see some of the biggest and health redwoods. Great round trip.\nShow less"], ["Reviewed June 12, 2017", 4.0, "We can smell the trees on the drive up!", "We missed our last ziplining tour but they recommended we take a visit to the Armstrong Redwoods in the area, Along the way we can smell the trees and plants on the drive up. I found (free) parking on the outside parking lot, and walked to the station desk and the ranger gave me a self guided map of the Redwoods. This place is aweseome! They also had camping and picnic areas. They have a short and long hike (free) when you walk in.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Pure Bliss", "It was a bucket list item to see the great redwoods of the west coast, and this checked all the boxes. There is a beautiful winding trail through the redwoods that is a very easy walk. If you're looking for something more challenging, go on the loop trail which is about 2.5 miles.\nShow less"], ["Reviewed June 9, 2017", 5.0, "So peaceful!", "So quiet and peaceful. We were here fairly early, maybe around 9:00 or so? The office wasn't even open yet. This was a far cry from Muir Woods, which we visited last year. There were WAY less people and most were respectful of their surroundings and weren't shouting at each other.\n\nTrail maps are available near the office and everything is well marked. There are both easy paths to follow or longer, more difficult trails.\n\nHighly recommend for a peaceful walk.\nShow less"], ["Reviewed June 7, 2017", 5.0, "No picture could ever capture the beauty of this place", "Truly awe-inspiring! Followed the advice here and arrived a little after 8am. The kiosk and visitors center were not yet open so we parked there and walked in via the Pioneer Trail. It was very peaceful. We saw very few people until about 10. It was great to hear the forest wake up. Restrooms available at both the visitor's center and the picnic grove. Definitely take water and a jacket. Looped back out on Discovery, etc and saw all the named trees. People were waiting for parking in that first lot by 10:30 but the drive in lot had parking available. We had packed a picnic and ate it outside the visitor's center at the picnic tables. After lunch we did the East Ridge Trail. MUCH more strenuous. Not for anyone with mobility issues or small children unless they are experienced hikers. The waterfall was still running and was beautiful. East runs into the back of the parking lot at the picnic area so you could get to the waterfall that way but it is still a decent climb and not clearly marked. A great, inexpensive way to spend 5-6 hours. The Safeway in town had great picnic supplies available so stop there the night before to load up your cooler (they had those also).\nShow less"], ["Reviewed June 6, 2017", 4.0, "Pleasant trails but poorly signed", "This is a lovely redwood park akin to Muir Woods. The main trail is an easy walk that takes only an hour or so, although it has a lot of confusing signage that could be improved. It was also surprisingly buggy. I recommend visiting if you're in the Russian River area, but no need to make a special trip if you're further away.\nShow less"], ["Reviewed June 1, 2017", 4.0, "Beautiful examples of redwood trees", "A number of hikes for different abilities and not nearly as crowded as many parks featuring the beautiful coastal mountain landscape."], ["Reviewed May 31, 2017", 5.0, "Beautiful and easy to get to.", "Just down the street from AutoCamp you can even ride bikes into the forest. Beautiful forest with a dense forest of very old trees and memorial forest."], ["Reviewed May 25, 2017", 5.0, "Lovely Spot", "This is an easy, worthwhile and charming place to visit. The trees are impressive, the interpretive signs are interesting, and it is all so easy to see and appreciate.\n\nOne can see from a car much of what there is to see, so it is accessible to everyone. We could have driven but opted to walk the wide, level trail .7 miles to the picnic area for a pleasant lunch and enjoyed the interpretive information about what we were seeing and the history. I think some of that information would be missed by car.\n\nNot many attractions of this grandeur are as easy to see and enjoy, or as impressive.\nShow less"], ["Reviewed May 25, 2017", 5.0, "WOW!!", "This is one of the most significant little forests in the US. It's a small widow into the timelessness of nature. This short walk is long on beauty."], ["Reviewed May 23, 2017", 5.0, "Redwoods!! Everywhere!!", "This drive thru park is a must see if your in the area. The trees are so majestic. There is a option to drive,ride a bike ,or hike.\nThere are plenty of spots to have a picnic, or even campout.\nIv been horseback riding and hiked all over this park. There is also a lot of history if your interested in that.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Feeding the Soul", "I'm a tree person. When I need to feed my soul via nature, it's almost always trees/mountains. Redwoods are some of my most favorite and I try to get out to this particular redwood reserve at least once a year.\n\nThe good: It's small and not overwhelming. You can make your hike as short or as long as you wish. Restrooms, gift shop, parking are all relatively easy to navigate. You might see a banana slug (this experience cannot be oversold). The redwood forest is exactly as stately, reverent, and as spiritually nourishing as you might want or need.\n\nThings to remember: Do not go when you are hungry. Plan meals for Guerneville proper, either before or after the trip. Have bottled water in the car for after, too. Bring your camera. Learn how to use the panorama option before you go.\n\nIf you love redwoods, this is a great option. It is often exactly what I need and is a day trip from Sacramento.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Beautiful redwoods", "Right outside guerneville. Worth the trip even if just to drive thru. We hiked 7 mikes to bullfrog lake and back. Really steep. But pretty."], ["Reviewed May 21, 2017", 5.0, "Beautiful", "Great place for a walk and a picnic. You can park outside without paying and then walk in. Definitely a great place to spend the afternkkn"], ["Reviewed May 19, 2017", 5.0, "Hike", "Surprisingly long drive from American Canyon given the 77km distance but well worth it. Many hiking/walking options for all skill levels."], ["Reviewed May 18, 2017", 5.0, "Beautiful walk", "Beautiful, peaceful walk through the Redwoods. A must-see if you are in the area! However, be sure to wear bug spray😀"], ["Reviewed May 15, 2017", 5.0, "Beautiful and breath-taking", "Fantastic walk (even with a sore leg) not too long - can stop anywhere along and turn around to go back. Saw a woman with a walker as well so those with mobility issues can still enjoy this reserve!"], ["Reviewed May 13, 2017", 5.0, "Great visit", "My husband and I took the East Ridge Trail. Very glad we did, because it was amazing. Some of the inclines were pretty steep."], ["Reviewed May 13, 2017", 5.0, "Majestic!", "A must see in Guerneville. The trees are majestic and the walk easy! Also educational due to the placards along the path."], ["Reviewed May 12, 2017", 4.0, "Great Park and living History", "We have been hiking Armstrong Forest for many years and always notice new nature all about. Some of the trails are harder than others and it's always a great workout. Make sure to bring water because the only water fountain is at the vehicle entrance gate.\n\nThe mountains surprisingly have great cell phone coverage as well, God forbid you have an emergency while on a hike.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Beautiful and not crowded!", "I love Muir Woods, in Marin, but Armstrong is also beautiful, and without the parking nightmare and big crowds. Definitely worth a visit!"], ["Reviewed May 9, 2017", 5.0, "A mind altering experience", "Being among redwoods will change your life. This is a fact. Somehow, being among them lets you shed the detritus of daily life in a way equal to and perhaps superior to walking a deserted beach. Portions of these woods are accessible to anyone. I used to bring my mom here in a wheelchair. Getting there takes you through beautiful country, preparing you for the tranquility that awaits.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Great visit.", "We visited while the was a 50/30/17 km run happening, which was kinda fun to be a part of. We parked and walked to Armstrong's tree, and returned via discovery trail. After, we went to the waterfall via East Ridge Trail. It was a great but not big AT ALL.\nThe park was very well maintained and the drive was nice. There were a lot of places we wanted to stop along the way but we made sure to stop at farmers stand!\nShow less"], ["Reviewed May 6, 2017", 5.0, "Do not miss the Armstrong Redwood State Reserve", "We were staying in the Russian River Valley, and my travel partner wanted to visit the reserve in the morning before returning to wine tasting. There is no entry fee to enjoy the reserve.\nWe elected to take the Pioneer and Discovery trails. The trails are clearly marked, and you can obtain a map.\nThe reserve is magnificent, and I was truly awestruck by the redwoods. The sheer beauty of the redwoods is mindboggling, let alone their size and age. I enjoyed the helpful markers and historical plaques.\nThe trails are not rigorous, and for the most part they are flat. You can drive close in. There is ample parking on the road for overflow.\nTip: Go earlier in the morning in order to avoid the crowds. The reserve opens at 8am. We visited on a weekday, and there were several large tours with school children.\nShow less"], ["Reviewed May 4, 2017", 5.0, "Redwoods", "Drive thru for $8 or walk for free. Visitor center has map, directions and restrooms. Two giant redwoods along trail. Parking available at visitor center."], ["Reviewed May 4, 2017", 5.0, "Great biking and hiking trails. Nice cool respite.", "We enjoyed a nice bike ride through the woods here. It was quiet and pleasant and trails are well maintained."], ["Reviewed May 1, 2017", 4.0, "Redwoods are always amazing", "This is close to town and offers a great opportunity for everyone to hike among the redwoods. you can hike a ridge, which is a little more challenging, or hike the basin, which is not challenging at all, but still beautiful"], ["Reviewed May 1, 2017", 5.0, "Beautiful place, manageable in short visit", "Beautiful trees, small enough park to enjoy in just a couple of hours if you have a busy sightseeing schedule. Parking is a little bit of a hassle as it was busy when we were there, but the walk wasn't bad at all."], ["Reviewed April 26, 2017", 5.0, "Peaceful walk among the redwoods", "This is a great place to get up close and personal with the redwoods without a bunch of crowds like in the National parks. The trails are well laid out and there are picnic areas and bathroom facilities. Highly recommended if you want a change of pace from the wine tasting!\nShow less"], ["Reviewed April 25, 2017", 4.0, "Walk in the redwoods", "A very pleasant forest with some magnificent trees. This is a great place to get in a good walk or perhaps a run before (or after) visiting the local wineries which are the main draw of the area."], ["Reviewed April 24, 2017", 5.0, "A beautiful and interesting stroll or a hike!", "Armstrong Woods is a beautiful little Redwood Park with HUGE redwoods without leaving Guerneville! There is a nice paved walk or drive where you see the basics or you can take off on your own on various short or long routes for a more vigorous outing.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Surreal.", "Gorgeous park. Helpful staff. Well marked trails. The trees are, of course, amazing. Very picturesque and so beautiful."], ["Reviewed April 13, 2017", 4.0, "Great Stop", "Having only been to Muir Woods I was excited to visit another redwood forest. Many massive redwoods. This has nice trails marked for hikes several different distances. The natural amphitheater is worth checking out. Its a bit of a drive to get to, but its a pretty drive.\nShow less"], ["Reviewed April 13, 2017", 5.0, "Easy pretty hike", "Nice manicured paths-a little muddy after a rain-easy to follow. The trees!!! So grateful that we have access to ancient and quiet beauty such as this."], ["Reviewed April 11, 2017", 5.0, "Awesome Hiking", "Armstrong has many different options for hiking, from walking paved paths on the forest floor, to steep climbs and single track trails. We did about 5 miles on a basic loop and it was gorgeous. Thanks to a wet winter (yay!), the meadows were spectacular and lush green, and the creeks were rushing.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Wonderful place to wander", "Just a few miles from the center of Guerneville is the Armstrong Redwood State Reserve. There are a number of trails, including paved roads for cars and wheelchairs. It's a great place,that I imagine stays pretty cool in summer because of all the shade. There are streams, bridges, and wonderful trees.\nShow less"], ["Reviewed April 9, 2017", 4.0, "Nice easy trails and a wonder to behold!", "We stepped into another world under the giant redwoods. Easy trails, great directions and lots of world travelers to share the experience with."], ["Reviewed April 9, 2017", 5.0, "Absoultly Beautiful!", "After several days of wine tasting a few of us opted for a change of scenery. Wow! We picked the right place! The lady in the Visitor Center and the the gentleman in the park were wonderful to talk with. Both were very informative and enthusiastic about sharing their knowledge of the park. The hike/stroll was easy and peaceful. Be aware there are only a few paved paths. Because of recent rain, most of the paths were very muddy and there was a lot of standing water. So glad we took a break from wine and enjoyed the beautiful Redwoods.\nShow less"], ["Reviewed April 5, 2017", 4.0, "Beautiful and serene", "There are several hikes in the park - in the interest of time we did the short loop to the Parson Jones and Colonel Armstrong trees. Those giant trees are so awe-inspiring! The employees/volunteers in the Visitor Center and on the trail were very friendly and helpful.\nShow less"], ["Reviewed April 5, 2017", 5.0, "Very Accessible Redwoods - Awesome Setting for Picnics or Hikes", "We drove right up to a picnic area and ate lunch under the Redwoods. We walked up a short trail to see a waterfall. It was a memorable visit and terrific for 3 generations to share."], ["Reviewed April 4, 2017", 5.0, "Great place to hike and enjoy the woods", "This is my favorite place to hike when I'm in the area. Nicely maintained trails and beautiful woods!"], ["Reviewed April 3, 2017", 5.0, "In Awe! A must See!", "Majestic Redwoods! This is a must see. Redwoods so big there are not words to describe or photos to capture. The trail is easy for families to hike as there is not a lot of steepness, etc.."], ["Reviewed April 3, 2017", 5.0, "Stunning Redwood and Sequoia forest hike, easy enough for beginners or elderly", "What a gem of a state park! This easy and approachable forest will leave you with awe as you gaze upon a tree estimated to be 1400 years old. The hiking trails have some very easy options that allow folks with some physical limitations still have access. There are some steeper trail options, and longer routes for those who wish to avoid the crowds. There are large picnic areas and restrooms, and decent parking both just outside the park and further inside. I enjoyed my day immensely, and encountered people from Japan and Australia. Lovely place to visit. You might want to bring some water along, I didn't see many places to drink there.\nShow less"], ["Reviewed March 31, 2017", 5.0, "Must see!", "What a beautiful park in the Sonoma Valley. While on vacation wine tasting, we knew we had to stop and see the majestic Redwood trees. We were in awe of their size and height and are so glad we made the trip to the reserve. It was misting during our visit and I think that made it even more picturesque - it was very quiet and peaceful and we felt like we were the only ones around. You must make time to stop here if possible.\nShow less"], ["Reviewed March 31, 2017", 4.0, "Easy hike/walk", "Beautiful redwoods, well maintained, easy to walk. We went the morning after a rainy afternoon. Some muddy spots to navigate but manageable. A variety of trail. Go early-avoid the crowds!"], ["Reviewed March 30, 2017", 5.0, "Walking Among Giants", "Such a peaceful walk through the redwoods. Seeing Colonel Armstrong is amazing. A visit to the theatre is lovely. We always make a point to visit the supernatural Armstrong Woods. It is such a treasured place."], ["Reviewed March 30, 2017", 5.0, "Magical Redwood Grove", "I live locally and walk here often. It's beauty never fades. Free parking in the parking lot outside the park. Fee to drive in."], ["Reviewed March 30, 2017", 5.0, "Quiet and peacefull", "My husband and I visited the park two times in the last couple of days. It's a great place to relax, breath fresh air and be amazed by the greatness of the surrounding nature. It's definetly a place to visit if you are in the neighbourhood.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Majestic Redwoods", "Delightful walk through good size (but not giant) Redwoods. A few significant trees. Easy 1-2 mile walk. Takes about an hour, free parking just outside the gate."], ["Reviewed March 25, 2017", 5.0, "WOW, this reserve is amazing!", "We had an amazing visit seeing the giant redwood trees! If you want to drive through there is a $7.00 fee to the state park but you can park your car in the lot just before the entrance to the park and walk the path! It is an easy walk and you get to see the gigantic trees up close! Make sure you take pictures with people and cars in them for perspective!!\nShow less"], ["Reviewed March 22, 2017", 5.0, "A must see", "Just stunning. We went twice and walked in silence most of the time. The Redwoods are breathtaking. Take yourself there."], ["Reviewed March 19, 2017", 5.0, "Beautiful trees", "I'm so glad we made the trip to Armstrong Redwood State Reserve. There were nice trails to walk on and quite a few signs with lots of information. The trees are just gorgeous."], ["Reviewed March 18, 2017", 4.0, "Amazing park with redwoods over 300 feet tall.", "This amazing park, has lots of walking trails, picnic areas and ample parking. You can also choose to just drive through from one end to the other. It is located just a few minutes from town. There are a ton of birds, cool temperatures and many interesting trees to view. You can go on walks in lengths from 1 mile to 7 plus.\nShow less"], ["Reviewed March 16, 2017", 5.0, "Beautiful Visit", "My wife and I had a great visit to Armstrong Redwood State Park while in Sonoma County (March 2017). Park is located right between wine country and the beautiful Pacific Coast. Had a very nice 2 mile hike on the East Pioneer Trail & got to see the Fife Waterfall. Would visit again if ever in the area. :)\nShow less"], ["Reviewed March 12, 2017", 5.0, "Great Stop", "We wanted to see the redwood trees on this visit to California and were glad to see we didn't have to into Muir Woods.The trees are absolutely breathtaking! It was a little muddy after all the rain but everything was beautifully green!"], ["Reviewed March 11, 2017", 3.0, "Big trees!", "My wife and I stopped here on our way to the coast. This is literally right around the corner from Korbel.\n\nIt is free if you park at the information center right inside the park. Go inside and the rangers will give you a map and tell you where to go to see the huge redwoods at over 300 feet and more than a thousand years old.\n\nMy wife and I enjoyed the park but cut our visit short due to the rain when we were there. Would be a great place to walk around and explore on a sunny day.\nShow less"], ["Reviewed March 8, 2017", 5.0, "Redwood treasure forest", "The trees here are so beautiful and bold. It was raining real hard when we visited, so we were glad we were able to drive through and see the splendor of the Redwoods. We walked on a trail to see one of the oldest trees and it was amazing. It would be a great place to enjoy the trails on a sunny day.\nShow less"], ["Reviewed March 8, 2017", 5.0, "A Walk in theWood", "As a alumni of Sonoma State, I make routine pilgrimage several times a year to Sonoma County. It is a short drive from downtown Guerneville to the parking lot at Armstrong Woods, it could easily be overlooked. Make a little time and treat yourself to the splendor of Northern California.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Beautiful Redwood Park", "We enjoyed a beautiful and peaceful walk through this park early one morning. There were no crowds, just the early morning sounds of nature. We had never seen redwoods before and were amazed at their size and the history of the park. It was a very enjoyable experience for us.\nShow less"], ["Reviewed March 1, 2017", 5.0, "Camping at Bullfrog Pond Campground", "We visited in late February after a couple days of heavy rain and wind. The road was a bit washed out but we still found it easy enough to drive up (one lane, no guardrails, some people will refuse to drive them-type-of-road- beautiful vistas at the top!) we were one of two groups camping those days and practically had the place to ourselves. The bullfrogs at night were loud but nice white noise for sleep once you're used to it. Trevor who checked us in was awesome and thorough. Campfire wood was reasonably priced and dry compared to other places. Bathrooms were clean and there are plenty of trails to hike while you camp. Be aware, once you enter the woods and go up the mountain, temps will be about 10 degrees lower than they are in town easily- plus no direct sunshine to warm you- look up weather for Austin creek versus Guerneville when planning your gear for an overnight. We woke up to a 25 degree morning when the forecast said 35!\n\nThe trails through the redwoods at the bottom are flat, informative and nice. I would say they are definitely on par with Muir Woods, although less crowded! Picnic areas also available.\nShow less"], ["Reviewed February 25, 2017", 5.0, "So beautiful I kept tearing up", "These redwood trees are the best. So tall and peaceful and old. Gorgeous groves of trees. Well maintained paths. Truly a pleasure and privilege to be there. Many paths are wheelchair accessible. Helpful friendly volunteers. Go if you can."], ["Reviewed February 25, 2017", 5.0, "Big Trees!!", "Always a treat to see the giants!! A wonderful grove a majestic Redwood trees with an creek and so many trails to walk!!"], ["Reviewed February 25, 2017", 5.0, "Beautiful taste of the redwoods", "Stunning little walk in the morning. Took us about an hour and then we were ready to leave. There was not a fee, which was a nice surprise. The help desk was very helpful."], ["Reviewed February 16, 2017", 4.0, "Awesome", "We spent a couple of hours in the reserve. The Redwoods are awesome. It's not crowded like Muir, that's the reason we chose to go here. Parking is hit or miss but you can park down the road a bit and walk in. We enjoyed our afternoon here. The only down side is the restroom, not clean.\nShow less"], ["Reviewed February 15, 2017", 5.0, "Stunning", "Make sure if you are visiting Sonoma County,go to Armstrong woods, Beautiful ! Great hiking, Dogs welcome"], ["Reviewed February 13, 2017", 5.0, "Wow!!!", "Please make sure to visit this reserve. This is awesome. It's only about 20 to 30 minutes north of most vineyards and winery's and it's free if you take the walking tour. Two dollars if you drive. But to see a 1400 year old living tree, 14 feet in diameter is well worth the drive.\nShow less"], ["Reviewed February 12, 2017", 5.0, "Close to town, millions of years in the making!!!", "About a 10 min ride from Russian River, this amazing forest, it's just amazing. Beautiful giant trees, and peaceful nature all within minutes from the Russian River. Go and spend a day breathing fresh air and enjoying this amazing giants! They are amazing!"], ["Reviewed February 10, 2017", 5.0, "Armstrong Woods", "I enjoy hiking & meditating in Armstrong Woods, it is beautiful with steep or level ground trails to accommodate everyone's needs. It is beautiful & the Armstrong Woods Church in the Woods is a beautiful place for a wedding ceremony, I have been planning on having my wedding ceremony in Armstrong Woods.\nShow less"], ["Reviewed February 4, 2017", 4.0, "Trails needed more signage", "Loved our hike in the redwoods. We chose a hike that looked \"rigorous\" 2.2 miles East Ridge Trail, and I wasn't feeling well so that probably wasn't the best choice, but as we went along, the trail forked twice and we were not sure we were taking the correct way. It was well maintained and beautiful, but quite steep, and as I was sick and we couldn't tell exactly where we were or how much further we had to go, I eventually had to ask my family to turn back...and all that uphill was now down.\nMore signage would have reassured us that we were on the correct path and showed us how much further we had to go, helping make the decision earlier and with less frustration.\nShow less"], ["Reviewed January 24, 2017", 5.0, "Some old growth redwoods Remain", "Wonderful opportunity to hike for hours close in to the Russian River. Magnificent. Be careful that you don't get lost. It's much larger than you will realize, and it's cold under these big trees, so take jackets."], ["Reviewed January 20, 2017", 5.0, "A Special Place", "Hard to believe I haven't reviewed this place, we have been coming here for the past 10 years. If you enjoy beautiful scenery, majestic redwood trees and peaceful tranquility you will love Armstrong Redwoods State Reserve.\nIf you park in the lot just outside the park and walk in there is no admission. If you want to drive in there is a fee. Walking in and walking among the towering redwoods is easy and invigorating. There are not any hills or steep declines to navigate. We recently took visitors who have trouble getting around and they had no problem walking the paths at Armstrong Redwoods.\n\nThere is a small but nice visitor with lots of good information and also maps to help guide your visit. There are also many picnic areas located throughout the park.\nFor the more active and fit there are several moderate to strenuous hikes that are available. Some with over a 1000 ft climb!\n\nBe sure to have a camera with you and take lots of pictures. Armstrong Redwoods State Reserve is a treasure and you will want to take the memories with you!\nShow less"], ["Reviewed January 19, 2017", 5.0, "gorgeous woods and trails", "just a beautiful walk through amazing old redwoods. quiet, smells incredible, refreshes the soul. picnic areas, although i never saw them....."], ["Reviewed January 17, 2017", 5.0, "Wonderful For Wedding Photos!", "Our daughter and son-in-law were married at Highland Dell Lodge in November. The wedding party also went to Armstrong Woods for the \"first look\" as well as additional photos."], ["Reviewed January 14, 2017", 4.0, "Simply Amazing", "A short drive from our B&B, this state forest is located just outside Guerneville and definitely worth a visit if you're in the area. The tall, majestic redwoods, some over 300 feet tall, are truly amazing. We paid $8.00 to drive in as it was raining but was told we could park outside and walk in. Coming from the east coast, I've never seen such massive trees and cannot envision how the Korbel winery brothers brought them down with hand tools to build their winery a short distance away.\nTruly remarkable.\nShow less"], ["Reviewed January 10, 2017", 5.0, "Absolutely beautiful!", "What a great stop. The park is beautiful and well kept. Great bathroom facilities. No charge parking too."], ["Reviewed January 3, 2017", 4.0, "With dog", "It is beautiful and quiet. It is pay for parking inside the park and outside parking can get busy. Even with parking hard to find it was still peaceful. Walking in is free. Dogs are allowed but only on paved areas. The stop was worth the time\nShow less"], ["Reviewed January 2, 2017", 5.0, "Amazing must see spot", "We visited on a chilly day after camping on the coast in December. It was slightly overcasts and so peaceful there. It is a little off the beaten path so it doesn't get as crowded but is certainly worth the visit if you are in the area. Parking may be a struggle in the busy summer months but was a breeze in December. Gift shop was great for souvenirs, The trail was a nice walk through the trees and leads you in a loop to the big sights.\nShow less"], ["Reviewed December 31, 2016", 5.0, "Lovely walk, not so crowded", "We visited in December, so might explain it not being crowded... but everywhere else we went on this trip was jam packed so maybe this gem is just not well known?\n\nWe parked just outside the reserve and walked in, so fee was basically donation based. We did the very easy trail loop from the visitor center and saw some very impressive trees and scenery. Well worth the stop on our way to the coast.\nShow less"], ["Reviewed December 30, 2016", 5.0, "Nature's Chapel", "The first people to see the Redwood forests in their natural state must have been overwhelmed by their majesty. Now reduced to mere tatters of their former range (over much of North America) they STILL feel like holy places. The Armstrong reserve is at least as wonderful as -- and far less mobbed than -- Muir Woods. 2-5 miles of trails (depending on how much time & energy you have) offer an easy, mostly flat path through the quiet, dappled sunlight and glory of the woods. I use a seated Segway for mobility, and the Pioneer and Discovery trails were the IDEAL Segway path: soft, firm, mostly flat, and unhurried. Everyone there is having a wonderful time, so it's a happy place, too. There's a small ranger station (friendly and helpful guy!) with a gift shop of shirts, sweatshirts, knick knacks and more. A great spot to visit while in or near Guerneville, CA.\nShow less"], ["Reviewed December 29, 2016", 5.0, "A Most Enchanting Forest - Its magic is irresistible", "Spectacular redwood forest, hiking trails, info center, driveable (at a fee - walk-ins are free), creeks, mushrooms, and camping at bullfrog pond in the high country. Arguably the most frequently-visit and spectacular destination in Sonoma County"], ["Reviewed December 20, 2016", 5.0, "Amazing Trees", "Even though I was here in the rain, I loved this place. It is so tranquil, and the trees are majestic. While they are not as big as some other redwoods, they are still amazing."]]}}