{"Artist's Drive": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Artist's Drive", "url": "/Attraction_Review-g143021-d504748-Reviews-Artist_s_Drive-Death_Valley_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/30/03/3a/artist-s-drive.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1361"}, "address": {"@type": "PostalAddress", "streetAddress": "Badwater Road", "addressLocality": "", "addressRegion": "California", "postalCode": "92328", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Great Drive thru scenic canyon", "Great place for spotting the amazing natural different color formations in the rock. Easy twisty paved road accessible to any vehicle under 25 feet long."], ["Reviewed 2 days ago", 5.0, "Warrants Your Time...", "We enjoyed this quick drive that provided yet another example of the geological diversity of Death Valley!"], ["Reviewed 3 days ago", 4.0, "Not the most amazing but worth 30 minutes of your time", "We weren't completely wowed by Artists Drive. That being said, you can drive the whole thing in 30 minutes. Stop to take a couple pictures and it'll take 45 minutes. It's worth the time if your in the area but if there's any site you should skip, it would be this.\nShow less"], ["Reviewed 4 days ago", 5.0, "Great drive after visiting Artist's Palette", "We loved this scenic drive of beauty with winding roads and hills. We were in a jeep and my husband loved driving it. Combine it with your visit to the Artists Palette."], ["Reviewed 6 days ago", 5.0, "Absolutely beautiful", "Absolutely beautiful. Make sure to stop at some of the parking areas as they are worth the short hike."], ["Reviewed 1 week ago", 4.0, "Enjoyable Drive", "This was a really interesting drive among a wide range of Hues and Backdrops. There are many pull off areas if you wanted to stop and take some great pictures."], ["Reviewed 3 weeks ago", 5.0, "A beautiful drive thru ever-changing mountain landscape", "A joy to visit. Nice 9-mile paved drive. Take ur time and give urself distance from cars in front of you - so as to not spoil ur pictures. Lots of places to get out and take pics. WInter is perfect because temperature stays between 70-80 during the day, and crowds/traffic arent a problem.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Brilliant experience", "I love driving, and I have to say this was probably my favourite part of our 3000 mile dash across the West. Awesome views and a real fun ride, definitely worth the D-Tour! It's like being in the roadrunner cartoon :P"], ["Reviewed 3 weeks ago", 4.0, "Beautiful drive", "Artist's Drive is a 9 mi/14 km one-way scenic drive off Badwater Road. The paved road, heading north towards Furnace Creek, winds through colourful volcanic and sedimentary hills. It is best seen in the afternoon as the setting sun enhances the colours. RV's and trailers are not allowed on the road. There are several pull-offs along the road, as well as a small parking lot at the main attraction - Artist's Palette.\n\nWe did the drive around 2pm on a Friday in November, and it was not crowded. After driving on dirt roads to 20 Mule Team Canyon, Natural Bridge Canyon and Devil's Golf Course, the paved road felt easy and pleasant. Views of the canyon were great.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Loved it.", "Just go! It's a natural wonder! such a great idea to do this road! Loved everything about it, the drive the views..."], ["Reviewed 3 weeks ago", 5.0, "Beautiful drive", "This is well worth taking. It is a one way drive through a beautiful area. The lane can be pretty narrow at some points but it is fully paved and an easy drive. It states that a vehicle longer then 25 feet is prohibited. Believe this statement. In fact I'm not sure I would take a vehicle even 25 feet long up the road because there are a few narrow spots.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Winding narrow road with Fascinating views", "Well worth the drive. Winding narrow one way road. Might be a bit hair raising for larger suvs. Really neat rock formations. Ridges, gullies, boulders, cliffs."], ["Reviewed 3 weeks ago", 5.0, "Fun Drive", "This was a good side road (one way) to take as you head back toward Furnace Creek from Badwater Basin. Lots of rocks but scenic and it leads you to Artists Palette, an amazing place."], ["Reviewed 3 weeks ago", 5.0, "A beautiful drive!", "This drive is just incredible! The mountains vary with differing color shades at various points ( thus the name artists drive and palette). Every bend and turn is just incredible- every so often there is a shoulder where you can stop on this one way road. The artist's palette is a stop ( a turn right) where there is a restroom and you can get out of the car to capture yet another beautiful view.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Family Trip", "Artist's Drive in Death Valley National Park CA, is very beautiful rout, nice view, worth to go there"], ["Reviewed 3 weeks ago", 5.0, "A gem to drive & walk", "We have been to death valley NP numerous times when artists drive was closed for construction or floods. It paid to wait. On this visit we were able to drive on the nicely paved and very scenic and colorful road. We made a few picture stops tsking in the mountsains and colorful rocks and took a short hike from the artists palette parking area which is along the road.\n\nthe drive is magnificent year round but like most 'attractions' in the furnace creek area of death valley, hiking will be limited during the summer months.\n\nArtists drive is a one way road heading predominantly north. You can head down Badwater road from route 190 (about a mile east of the furnace creek visitors center), visit the other attractions in the area including 'badwater' and then turn onto artists drive as you head back up north.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Make time to drive this road", "This is the road to Artist's Pallette- and it is beautiful in its own right. This area highlights the colors that are so amazing in Death Valley, chocolate browns, tans, greens, reds. Amazing striations of color."], ["Reviewed 4 weeks ago", 5.0, "on our bike trip", "The colors are just amazing! I wonder if Georgia O'Keefe ever saw this place in her early travels? When the air is clear is best."], ["Reviewed 4 weeks ago", 5.0, "B-e-a-utiful", "A fantastic drive through a colorful palette of rock formations. The dips and tight corners we encountered added to the enjoyment"], ["Reviewed 5 weeks ago", 4.0, "A loop road to view colorful mountain walls", "The views from the road are pretty, showcasing mineral colored rock formations. Good Drive if you cannot get out of your car to hike."], ["Reviewed January 20, 2018", 4.0, "Easy drive, great views", "There are a few places you can stop along the drive but the main stop is at the Artist’s Palette. We pulled over before the main stop where there’s a pullover and the view was pretty great. So if it’s a busy day, stop there first for your photos just in case you can’t get parked in the main parking spot. The car parks seem to fill up fast and it wasn’t especially busy today.\nShow less"], ["Reviewed January 19, 2018", 4.0, "Easy Drive and Worth the Time", "We only stayed in Death Valley for two days, so time was limited - there's so much to see. The Artist's Drive is an easy drive, it's all paved but with some twisty turns. The views are nice, not necessarily spectacular, but it's a matter of opinion. There are turn-outs in case you want to venture out of the car and see things closeup. We were done with the drive in 15 minutes without stopping, so you can make this drive as quick or long as you'd like.\nShow less"], ["Reviewed January 13, 2018", 5.0, "A neat side track", "As you drive through Death Valley you will see this little turnoff. It’s a winding road with beautiful scenery all around. There are a few places to stop and hike a bit. Wether you just drive through or stop and hike it’s definitely worth the detour.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Mothre Nature is amazing", "This side trip through Death Valley is not to be missed. Worth every minute of the drive and something new around every corner. You can spend as much time as you want and take tons of pictures. If there, take this side trip!"], ["Reviewed January 9, 2018", 5.0, "Super amazing road", "Take an easy drive on this road and you will be astonished by the views arround. Definetelly recommend to drive it if you are in Death Valley NP."], ["Reviewed January 4, 2018", 5.0, "Unbelievably beautiful! Don’t skip it.", "The Drive was spectacular. Each curve offered another view of the multi-colored rocks. We almost skipped it and would have missed yet another remarkable sight in Death Valley."], ["Reviewed January 4, 2018", 5.0, "Colors are amazing", "This is a must do drive. Be sure to pull off at the palette. The best colors are here. Don't skip it."], ["Reviewed January 3, 2018", 5.0, "Amazing Drive", "A one way drive that was really scenic and nice. Definitely recommend for those coming into Death Valley."], ["Reviewed January 1, 2018", 5.0, "Pleasant one way scenic drive", "This short drive is worthwhile, scenic and relaxing. There is space for a few pull outs for photos. There is a point you can hike up to for an overlook early on, and after that simply driving through"], ["Reviewed December 31, 2017", 4.0, "Lovely drive", "This is a one way drive. It offers lovely view of rocks. It has a stop for pictures and some climbing at Artist’s Pallet. This is a must go if you visit Death Valley NP."], ["Reviewed December 27, 2017", 4.0, "One Way Street", "Use this road as an alternative when driving towards Furnace Creek from the south. It’s a spectacular ride though take care navigating the dips, on of them has blind right turn."], ["Reviewed December 24, 2017", 5.0, "Mesmerizing rock formations", "This is a must if you visit Death Valley. The road meanders through narrow canyons filled with rocks that look like melted ice cream. The road pavement is excellent. There is a parking at the Artist's Palette, which provides for a beautiful view on the amazing colourful rock formations. It is also possible to hike in the wash and through the rocks.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Pretty palate.", "Take the drive it is paved, but be sure to get out of the car for a hike and take in the full beauty of the canyon."], ["Reviewed December 17, 2017", 4.0, "rock formations", "one way road , lots of different rock formations . Think it would be best not to go early or at dusk, light would be poor"], ["Reviewed December 15, 2017", 5.0, "Amazing! Amazing Drive!", "No where in this drive will your eyes be bored. It's truly remarkable to see all the rock formations and nice to drive on a one way road."], ["Reviewed December 1, 2017", 5.0, "Beautiful one-way loop", "This one-lane loop passing \"Artist's Palette\" has amazing eye-candy. The \"Artist's Palette\" area itself is worth a stop, but there are so many beautiful views of so many different things, it's impossible to give just one highlight. Note: this is a narrow, winding road - no vehicles over 25' allowed. Also note: the scenery heading out, away from \"Artist's Palette\" is absolutely stunning, but the curves make it impossible to drive & take photos - make sure passenger(s) have their cameras out!\nShow less"], ["Reviewed November 30, 2017", 4.0, "Beautiful 9 Mile Drive", "Very picturesque one way drive through ravines and colorful rock formations. Road dips and curves with picture taking scenery. A must see!"], ["Reviewed November 29, 2017", 5.0, "Well laid out loop providing access to stunning rock colourations", "Visited one day in mid Nov 2017. Have been once before 9 years ago, now back with b/f. Well laid out and maintained. One way road, 9 miles long, asphalt all the way. Stops along the way, some with toilets. Artists Palette is probably main attraction. Observe warning sign at beginning, length/width restriction because road v narrow and twisty at certain points. Would consider visiting again if returning to the area.\nShow less"], ["Reviewed November 29, 2017", 5.0, "Beautiful drive", "This one-way road is really great. The different colors in this scenery are beautiful. It's a pleasure to ride and you have some amazing views. A must do place in Death Valley"], ["Reviewed November 24, 2017", 4.0, "Peaceful 9-mile scenic drive", "It is about 9-mile oneway drive. The road is well paved. Many pullover spots for photographing including the Artists Palette. There was one spot having a breath-taking view, which appears when I made a sharp right turn. But, no pullover space is available and I had to briefly stop and take a photo from inside my car through the windshield - Still beautiful.\nShow less"], ["Reviewed November 24, 2017", 5.0, "BEAUTIFUL ONE WAY DRIVE!!", "Must do in Death Valley. Loved that the drive was one way as it was relaxing and one could enjoy the scenery. I think the road was paved the entire way (I went on so many roads I can't remember). Artist's Pallette is a great stop for pictures and the colors are stunning.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Great for Motorcycles!", "This road is one-way so you don't have to worry about on-coming traffic. It's also super clean and well maintained. Worth a visit just for the pleasure of sweeping through the turns."], ["Reviewed November 15, 2017", 4.0, "Paved Colorful Canyon Drive", "The drive is paved, so it's an easy do for all. Watch the dips, though, and some quick s-type turns. Hiker can park anywhere off the roadway and explore more fully. There is one developed parking area where you can walk up an outcrop to a high point and gain great colorful views back toward Badwater. Then turn-off and stop at Artist's Palette. The condensed coloring here is amazing. And, yes, you can walk down the slope into the wash here. Go left and it will come out on the road. But, better still, try slipping up the lanes through the boulders.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Amazing Sites around Every Corner", "I think what amazed me the most besides the incredible formations and colors was the fact that we were able to enjoy this because of all the manpower that went in to the building of these access roads!"], ["Reviewed November 9, 2017", 5.0, "One of the most wonderful drives you will ever take.", "Death Valley is huge and you will never see all of it in a day or a month. The scenery is amazing, the quiet is calming and the sky is ever so blue.\n\nArtist's Drive on Badwater Road is a drive you don't want to miss. It is part of the National Park and the road is beautiful and perfectly maintained. The drive is maybe 30 minutes if you do not stop. There are many pull offs to take a walk or some photos. It is just fantastic.\n\nThe road has some twists and turns and I have noticed some thinking that is a good time to try using their car as a sports car. Don't do that. If you get stopped the ticket is very expensive and even if you don't see the police there are other drivers and those of us that go here often will call the police on you in a second. It is just stupid and dangerous.\n\nThe best time to go is in the Fall or Winter because of the heat of the summer. There are colorful rocks and small animals. Before you know it the drive will be over. So slow down and enjoy all the beauty of Death Valley.\nShow less"], ["Reviewed November 8, 2017", 5.0, "fun for the dads", "beautiful drive with steep dips. I did notice none of the men obeyed the speed limit but i think they just like the turns, lol it was fun seeing my husband love the drive."], ["Reviewed November 6, 2017", 5.0, "Must see on your Death Valley trip!", "We made several stops while in Death Valley National Park - all beautiful - but this one was well worth the drive. It is a one way 5 mile drive off a main road. There are several opportunities for overviews and photo opportunities. It was nice that the road was one way, because traffic coming in the opposite direction was not an issue. We visited in November so tourist traffic was very light.\nShow less"], ["Reviewed October 31, 2017", 5.0, "The best road we have ever driven on.", "We have just done a road trip from Nevada across California in a mustang. This road is remarkable. You will probably never drive a road like this again think a sandy dusty Monte Carlo F1 route. Truly truly remarkable."], ["Reviewed October 30, 2017", 5.0, "Perhaps the most beautiful drive I've ever taken", "Words won't do this 1/2 hour drive justice. Amazing views, narrow canyons, crazy deep dips (fun) in the road, made for a true highlight of our visit."], ["Reviewed October 25, 2017", 4.0, "Nice short drive", "You can easily drive this one cause it's a proper road and doesn't take much time. Make sure to be there with sunlight (best midday or afternoon) so that the rocks' different colours shine bright!"], ["Reviewed October 23, 2017", 5.0, "Impressive drive", "For me, it was pretty much the highlight of the death valley national park. I waited in order not to have any cars in front and I enjoyed the drive and the scenary!"], ["Reviewed October 20, 2017", 4.0, "So much to see", "A lovely one way loop drive with so much to see and do. The drive out was also lovely going through the narrow road. Did not see the big buses so perhaps they do t do this loop which was a bonus."], ["Reviewed October 16, 2017", 5.0, "Beautiful!!!", "This Drive is so worth a detour when in the park. Absolutely breathtaking and scenic. Really just amazing!!!"], ["Reviewed October 16, 2017", 3.0, "OK drive", "The artist's drive is a 1 way road in DV. The main point is to see the Artist's Palate, an area of multicoloured rocks. Probably OK early or late in the day, but when the sun is on it, the colours appear washed out. The drive itself was a bit of a procession of cars. Worth seeing if you have time, but don't do it instead of something else.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Definitely worth the drive", "If you have to choose from all the places and/or stops in DV, be sure to add this one. It is a short drive but simply gorgeous."], ["Reviewed October 13, 2017", 5.0, "Very cool detour, worth the extra time!", "The different colors in the rock due to volcanic activity are just fascinating as well as beautiful."], ["Reviewed October 12, 2017", 5.0, "Beautiful drive", "This was a beautiful easy drive, we were quite surprised didnt realised it was quite so amazing the colours in the rocks were amazing photos dont do it justice you need to see for yourselves."], ["Reviewed October 7, 2017", 5.0, "An Unexpected Surprise!", "This drive has some of the best scenery in the park. We arrived at the parking area and walked up the hill to Artists Palette. It is a gorgeous colorful display later in the day with the play of sun and shade. Then we got back in our car to drive through Artists Drive. Little did we know what fantastic scenery we would see. It is a one way 9 mile road that took us about 20 minutes to drive through. Take your time driving through the hills on this winding bumpy road. We stopped several times to take pictures. The colors and landscape is exhilarating. If we would have had more time, we would have driven through again. If you like this drive, you will also like the lesser known Twenty Mule Team loop. It has more subdued colors, mostly whites and tans, but has the same fun windy road driving experience.\nShow less"], ["Reviewed October 4, 2017", 5.0, "45 feet long won't work.", "If you've got a car this is a great little driving tour. I loved doing this until somebody after being warned got a 45 foot long bus stuck in there. It is now prohibited to drive a 40 footer which I did all the time, and I miss doing it.\nShow less"], ["Reviewed October 1, 2017", 5.0, "A worth while ride", "The mountains truly look like someone painted them with different colors. It's a loop and a pleasant drive"], ["Reviewed September 25, 2017", 5.0, "Artists drive", "The colour in the rock formations here was breathtaking , there was a storm in the distance and the change in lighting made it extra special the walk to the look out area is easy and makes for a great view loved it and the drive out is really cool very curvy and great texture\nShow less"], ["Reviewed September 24, 2017", 5.0, "Striking Colours", "You can imagine a giant artist splashing the paint around giving reds, yellows, greens, blues - just fantastic - single one-way road with good surface."], ["Reviewed September 24, 2017", 5.0, "A off shoot worth taking off of main road", "Beautiful drive- stop and look at the colors- narrow, sharp curves and one way. Made for cars. We saved this detour for last."], ["Reviewed September 23, 2017", 5.0, "Artist's Drive", "I saved this drive for last. The sun was starting to go down but there was still light out so was still able to see things clearly that this was so cool to drive through. Throughout the drive, you can see the turquoise mineral in some areas. The drive is one way and I can see why as some parts are very narrow. Take your time enjoying the winding drive. Worth the last part of my trip to Death Valley.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Must see", "Beautiful drive must see colors are great. I know you cant take really long campers in has some really sharp turns but its on your path so don't miss it."], ["Reviewed September 21, 2017", 5.0, "Amazing!", "The purpose of the drive is to take you to the Artist Palette, but the drive itself is astonishing. The best after the AP spot!."], ["Reviewed September 6, 2017", 4.0, "Great drive", "Wonderful colors! A short and easy drive, just make sure you enter at the right point since it's a one-way drive."], ["Reviewed September 4, 2017", 5.0, "Super fun drive and amazing colors", "The one-way drive is really fun with all the twists and turns and overhangs, etc. Then, you get the amazing colors on the mountain and you just can't believe they are all naturally occurring. A fantastic short side trip off the main road and definitely a must-see.\nShow less"], ["Reviewed August 28, 2017", 5.0, "One of the best views I've ever seen", "The Artist's Drive in Death Valley is definately a place to see. It is a beautiful road with amazing formations and colorful rocks on both sides. We actually enjoyed these views so much that we took this road twice! Although it was awfully hot and we didn't get out of the car so much it was wonderful to see all these amazing views from the windows of our SUV.\nShow less"], ["Reviewed August 26, 2017", 4.0, "Relax and Enjoy the Colors", "This is a short relaxing one-way drive through colorful mineral deposits and mini canyons. It's best viewed when the sun is low so that shadows are long and the colors are accentuated. Stop at Artist's Palette about half way through to view the greatest variation in color at any one spot.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Like driving on the moon", "Beautiful rockformations and several 'dips' which gave an extra dimension to the ride. Easy to drive and excellent for making pictures and film."], ["Reviewed August 24, 2017", 5.0, "We felt like we were in a coloring book", "Slow down and take it all in is what I can tell you. Some person behind us was driving like a maniac while we were going the speed limit and they almost lost control of their car. In any case, relax and just enjoy the scenery. The contrasting colors are a sight to see. While we were driving I asked my wife if she felt like if she was in a coloring book and she said that’s the way he was thinking about the experience. It is certainly a must see and it is awesome!\nShow less"], ["Reviewed August 23, 2017", 3.0, "Only if you have nothing else to do in Death Valley", "Most of the tourists will be on their way to Las Vegas, crossing Death Valley. If you have more than enough time to spend, drive this route. it will cost you maybe 15 minutes. If you have better things to do, ignore just it."], ["Reviewed August 23, 2017", 5.0, "Must see", "Spectacular landscape. Well worth the drive to see the dramatic colors of the surrounding hills of mineral deposits."], ["Reviewed August 22, 2017", 5.0, "Amazing Drive", "This is an amazing drive taking you thru some really beatific area of the park and the colours you will see along this drive is just beautiful. The road is all tarmac, very smooth and some up and down and zig zag bends."], ["Reviewed August 22, 2017", 4.0, "Recommended at sunset", "Artist's Drive towards sunset gives a very good comprised impression of Death Valley. You can see and feel the heat and draught while within 30 minutes."], ["Reviewed August 22, 2017", 5.0, "loved it", "Amazing colours and therefore nice photo opportunities. We really enjoyed it! You see this, when you are driving the artis's drive anyway and the loop is very much worth seeing (and driving)."], ["Reviewed August 20, 2017", 5.0, "Beautiful textures and colors", "This drive off the main park highway is a one-way road tour which offers a variety of settings and colors in Death Valley National Park. The highlight of the drive is the Artist's Palette. We always find ample parking to have a chance for great photos and a short hike to viewpoints. The colors are created through the presence of minerals within the soil. Well worth the time to drive through.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Scenic Drive on a Nicely Paved Road - Artist's Drive, Death Valley National Park", "We drove scenic Artist's Drive while in Death Valley National Park. Its a one way road drive. There are many beautiful views. One can also access Artist Palette on this road."], ["Reviewed August 18, 2017", 5.0, "Very colorful and scenic", "This is a one way road going south to north. The color of the rock formations is great. Lots of changes as you go through the drive. If you have seen rock formations with a large variety of mineral deposits and colors, then this Drive may be boring for you. If you've not seen this type of geology before, then it is well worth the drive.\nShow less"], ["Reviewed August 17, 2017", 5.0, "My favorite adventure in the Death Valley", "I've visited the Death Valley National Park with my 12 y.o. and 5 y.o. and all of us have enjoyed the Artist's Drive and the Palette probably more than the other attractions. It was 115 degrees on the day of our visit, but we're dressed appropriately which allowed us to hike through the Palette. As you climb from the color to color, you try to believe your eyes. The drive itself was very interesting and totally worth it. A tip: you can fairly comfortably go where most won't if you are dressed for the place. Wide brim hat, long sleeve cotton shirt, long cotton pants and comfy shoes (we also wore shemaghs, the best decision ever!) are a must in the desert.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Stunning colours and a Star Wars film scene", "This is a \"must do\" detour if visiting Death Valley - a 9 mile one-way road through hills with stunning pink, green, black and yellow colours.\n\nThe road is in excellent tarmaced condition so no no worries about tyres and there are a couple of safe stopping points on the first half (second half is narrow and windy so get photos in early).\n\nAfter a couple of miles there is a car park to the right above a small canyon that was used to shoot an R2-D2 scene in Star Wars ANH (stand by the toilet and look down to the left) and you can safely get down to it for a photo!\nShow less"], ["Reviewed August 14, 2017", 5.0, "So Beautiful I Waxed Poetic About It on Facebook", "Here's what I said: What a lovely peaceful afternoon and evening! I traveled down Artist's Drive, which is a one-way, 9-mile trip through colorful rock formations, stopping occasionally for short hikes. Perhaps you can tell by the pictures already posted of Zabriskie Point, but the sky was such a vivid blue, almost electric, against the nearly barren land. As the sun set, the rock formations changed colors. At times I was the only vehicle on long stretches of road, driving through hilly ravines of pink, orange, blue, green, and yellow. It was magical. One of the best days I've had in a long time. I'm moved and inspired by the beauty of this planet.\nShow less"], ["Reviewed August 2, 2017", 5.0, "A must if you have the time", "This is a one way road that takes you threw the beautiful hills and the great colors that the mountains have. Good roads and viewpoints ( and toilets) make this a drive threw that you can enjoy while staying in the car ( necessary at 122f) Jump out of the car for a quick photo of the artist palette!\nShow less"], ["Reviewed July 31, 2017", 4.0, "Pleasant detour", "This is a nice detour and whilst not sensational, certainly has more to offer than Zabriskie point. The clarity of the different colours on some of the rocks will depend on the quality of the light at the time."], ["Reviewed July 30, 2017", 5.0, "Twister", "Unique little drive that you will come across on the main road that leads to Badwater..take this on your way back because of how it's a one way and loops you back towards your way out. On the way in you will see a pull off with a viewing are this is not worth stopping for in my opinion if you already stopped at zabriskie point or Dantes view. The drive is cool but pretty steep and many twists and turns. To your left you will see the colors of the peaks greens and purples which look really awesome.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Nice side road.", "It was so hot when we drove this out car started to overheat so we had to turn the air conditioner off and let the car cool down. It is a nice drive. One way winding road. Able to see the different colors."], ["Reviewed July 19, 2017", 5.0, "Great drive--take it!", "It's about a 9-mile trek through some gorgeous terrain. It's one-way and doesn't take too long. There are a few turn-offs which are worth a quick stop. It was 127 degrees when we were there, so we didn't stop long, but it is gorgeous to see the various shades of colors in the stone.\nShow less"], ["Reviewed July 19, 2017", 2.0, "Nothing special", "With so many other amazing places in Death Valley I didn't see what is do special about the Artist drive. Yes the rocks have different colours but nothing else."], ["Reviewed July 17, 2017", 3.0, "Not that great, but a fun drive thru", "Whenever you visit areas like Death Valley, you should try to take detours of the main road. We tok the detour, stopped and walked around in numerous places, like Artists Palette. The drive was quite fun, as the winding roads were in quite a good condition. If I remember correctly, vehicles over 25 ft are not allowed, because of the twists and turns, so do keep that in mind.\nShow less"], ["Reviewed July 14, 2017", 4.0, "A lovely drive-- and fun too", "Take a detour off the main drag. You can stop and walk out at various points, including Artists Palette, but it was too hot for us to do that. We enjoyed the drive itself as the road was in excellent condition and went through some interesting twists and turns. No vehicle over 25 feet is allowed on the road, and we can see why.\nShow less"], ["Reviewed July 13, 2017", 4.0, "Beautiful during sunset", "Looking for a nice view of the sunset, go to Artist's Drive and head over to Artist's palette. If you come before sunset, you'll see the colors changing of all rocks. Just beautiful."], ["Reviewed July 13, 2017", 5.0, "Never seen such mountains!", "I was amazed by seeing the mountains, the colorful mountains. Despite the challenging hot climate of July we were blissfully enjoying the drive and the mountains. We had an awesome drive among the lovely mountains. Caution: As we entered the drive our car's engine started heating up, we were really scared and tried to switch off the AC etc. to avoid break down. I would recommend to visit this place in the winters.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Artist's Drive with Artist's Palette", "The spectacular colors of the surrounding rock formations and mountains give a unique feel for this area. Bands of brown, red, yellow, green, and purple are seen throughout the area. There are 2 overlook areas... the first is over a valley (Hold onto your hat! It can be very windy!). The second at the Artist's Palette. The Palette has a trail where you can explore the area further. As with anytime you plan to hike in DVNP, bring water and your camera!\nShow less"], ["Reviewed July 7, 2017", 4.0, "Lovely drive", "This is situated in between furnace creek and badwater. It's about 17 miles long and it's a great way to see the different colour in the rock formations. It's also a fair few degrees cooler than the basin. It's a very nice detour to undertake."], ["Reviewed July 7, 2017", 5.0, "Incredible scenery", "Beautiful landscape, and the short drive allows you to see it without getting out of the car when the temps are 120*F. Must do for photos, or just to enjoy the views"], ["Reviewed June 27, 2017", 3.0, "Over-hyped", "The Artist's Drive is over-hyped, in my opinion. First of all, if you compare this to some of the other points such as Zabriskie Point, Dante's View, Badwater Basin or the Devil's Golf Course, it's just about average. You can easily skip this if you're on a tight schedule like we were. It's a nine mile one-way road so there's no going back in case you regret it, which we did. It's the biggest mistake we made at Death Valley. We ended up having to skip Badwater Basin because of this. It was getting dark, and we had to drive home. If you do have enough time (e.g. an entire day at Death Valley), then you might as well see this. Artist's Pallette is supposed to be really beautiful in the late afternoon because of all the different colours, but we didn't really see anything special, to be honest. The colour green was about the only one that stood out.\n\nA few general tips for Death Valley:\n- Death Valley holds the record for the highest reliably recorded air temperature in the world (134°F / 56.7°C). Therefore, make sure you have lots of food and especially water. Wear breathable clothes.\n- If your car doesn't have a GPS, use real maps or offline Google maps since you won't be able to connect to the internet. We used offline Google maps.\n- Bring a nice camera so you get some unforgettable photos!\n\nAbout our road trip:\n- 3 friends, 8 days, 14 states, and over 5000 miles.\n- Since we knew our trip would be very hectic, we only visited what we thought were the best places at each location.\nShow less"], ["Reviewed June 25, 2017", 4.0, "Green Color Was the Most Interesting", "There were multiple colors, but wasn't as vibrant or colorful as I had expected. Thought the green was most interesting. Worth it."], ["Reviewed June 23, 2017", 5.0, "Fascinating drive", "Unbelievable views. Star wars were filmed here. And we felt as if we were a part of a interstellar movie that is being filmed on Earth. Definately worth having a drive there. See my photos made with Relonch camera for a better impression."], ["Reviewed June 21, 2017", 3.0, "You need to time your visit", "This drive is best seen at or near sunset to see all the colors. Of course that is when it is busiest, so you will be there with plenty of other people. I did not see the colors all that distinctly, but other people may have better color vision or imagination. If you are in Death Valley, might as well check it out.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Beautiful drive on repaved road", "I was there last MArch, the day the new and repaved road was opened, the road had been washed out by all the rains we had last winter and was just reopened. Here is what it is like if you've ever been to Disneyland. They...More"], ["Reviewed June 12, 2017", 5.0, "Nice drive while you're there", "It's a oneway road with lots of twists and turns. You can bring large vehicles such as RVs through the drive, but in a car, it's worth it. You get to see colorful rock up close and get a nice turnoff to take photos. It's...More"], ["Reviewed June 8, 2017", 4.0, "Nice place to visit", "A good scenic drive takes you through the coloured mountains, best visited when the sun is shining so you can see the blues, reds and golds of the mountains Definitely worth visiting"], ["Reviewed June 5, 2017", 5.0, "Beautiful Drive", "This is a one way paved road through some very beautiful scenery on the way to Artist's Palette. The view at each turn is really breathtaking. You most stop at the Artist's Palette view area."], ["Reviewed June 5, 2017", 4.0, "Worth the side trip off the main road", "Well worth the side trip off the main road as you drive towards Badwater...it allows you to see Artists Palette."], ["Reviewed June 3, 2017", 5.0, "Lovely rock formations and colours", "Again a surprise viewing offered by mother nature. She is very expressive in the massive hills and boulders arranged in intricate patterns and shaped over millons of years of weathering, in the hot desert environment."], ["Reviewed June 2, 2017", 5.0, "An amazing drive!", "This one way drive in Death Valley National Park is a must do. You can just stay in the car and enjoy the views, or you can pop out and do short or long hikes to take in more of the gorgeous rock formations. Bring...More"], ["Reviewed May 31, 2017", 5.0, "Nice little detour", "The road is newly paved and nice and smooth. Pay attention though! There are some dangerous blind curves and people pulling out of turnoffs."], ["Reviewed May 30, 2017", 5.0, "Great Light", "This is a beautiful site and changes as the light changes. The colors in the rocks are beautiful and this is a good place for great photos ."], ["Reviewed May 28, 2017", 4.0, "Short impressive drive", "Took this short drive returning from Badwater. It's one way on a very narrow but nicely paved road. View rock formations laden with various elements creating a colorful display. We enjoyed it and would recommend it to friends"], ["Reviewed May 26, 2017", 5.0, "Drive thru", "Drive thru, amazing view's, great photo opportunity, curwy one-way road, about 5miles. The rocks are amazing colorful. Must see."], ["Reviewed May 25, 2017", 4.0, "Very beautiful", "It looks like a giant painting of mountains! Literally! The beginning is the best. After you get in there it's more just mountains though."], ["Reviewed May 25, 2017", 5.0, "Colourful", "Great idea, especially for those who can't hike. One of the highlights of the park. Ask what time of the day is best to see most colours."], ["Reviewed May 22, 2017", 5.0, "Easy drive with interesting views", "This week paved, one way road is a great, easy view of the beautiful mountains of Death Valley. The colors change throughout the day so morning views will differ from late afternoon views. Most views are easily seen from your vehicle without getting out but climbing the hills gives you an even better view.\nHighly recommend for an easy drive with scenic views!\nShow less"], ["Reviewed May 21, 2017", 5.0, "Beautiful colours and changing rock formations", "It is worth to take this detour from or to Badwater. The changing rock formations and beautiful colours are a mist when you are in this area."], ["Reviewed May 18, 2017", 5.0, "Great colors", "This is easily accessible by auto. One way only. Great variety and mixtures of colors. Beautiful. Don't miss"], ["Reviewed May 18, 2017", 4.0, "Dramatic views", "This is a one way road, but well worth spending the time as it provides wonderful views. We drove it in the evening as the sun set and had it all to ourselves. The road is narrow and I don't think it would have been suitable for large camper vans.\nShow less"], ["Reviewed May 17, 2017", 3.0, "Just OK", "It is a pretty drive especially at the beginning. It is a one way so make sure to stop early and often if you want pics because you cant turn around."], ["Reviewed May 17, 2017", 5.0, "Absolutely the Best of Death Valley", "My wife and I actually cycled this route in 25-35 MPH winds BUT the ride was spectacular. The colors were outstanding and the newly paved route was very, VERY welcomed. DO NOT MISS THIS DRIVE--it's stunning."], ["Reviewed May 12, 2017", 5.0, "Fun drive and great views", "The ride was on paved roadways. Easy to get around. Beautiful natural landscapes and colors. A small parking lot a mile in leads to a good hill for a great view."], ["Reviewed May 12, 2017", 5.0, "Definitely worth the quick-side road detour to visit", "This 9 mile drive had incredible desert views, colors, and rock formations all clustered together in a relatively short distance. Definitely a must-see and I suggest you visit it on the way BACK from Badwater (the lowest point in the park), since Artist's drive is a one-way road which is most efficiently accessed returning (e.g. on the road out to Badwater you pass the exit of Artist's drive first, then the entrance to the road second, just a few minutes before reaching Badwater.\nShow less"], ["Reviewed May 8, 2017", 4.0, "Quite the sight", "Good way of getting into the colors of the area. There is an un-named intermediate stop that offers a worthwhile view in return for a one-kilometer (uphill) walk. Artist Pallet is just a car park. You can see it all without getting out. Late afternoon to sunset is best for photographers, and no hiking required. In fact, sundown has rapid changes in light quality and you can miss the full range of effects at the pallet while you are hiking that kilometer.\nShow less"], ["Reviewed May 7, 2017", 5.0, "Experience the Beauty of Death Valley's Spectrum of Colors", "An easily accessible drive off of Badwater Road that presents the varied colors from the minerals in Death Valley. There are also some amazing \"beddings\" of deposits that washed down in the piedmonts of the Amargosa Mountain Range."], ["Reviewed May 6, 2017", 3.0, "Overrated", "It's something that every guide and an activity that is advised to do. If you like to hike, you won't probably be amazed because there is way more beautiful things to do in death valley if you are ready to put some effort.\nIf you plan on doing death valley by staying in your car, you should definitely do it. Otherwise go hiking in this huge park.\nShow less"], ["Reviewed May 2, 2017", 5.0, "Favorite!", "So many colors . We did midday . Very cool drive . Amazing variety of colors . The walk in the canyon is nice ."], ["Reviewed April 30, 2017", 5.0, "Beautiful beyond words", "This is one of the most picturesque and beautiful mountains I've ever seen. Nice 9 mile drive with an easy access to the scenic overlook."], ["Reviewed April 29, 2017", 4.0, "Scenery Drive-Thru", "This one-way road was freshly paved. There were a lot of cars in sight but no one was tailgating or rushing through the drive. There were several pull-out spots to get out of the car and for a view. The colors, especially the amethyst, we saw right up close was beautiful! We very much enjoyed the drive, the curves and hills, and even though we're all going slow to enjoy the view the wildside of me would love to do this drive when no one is around and fly right through it (haha). Site took us about 45 minutes.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Amazing drive", "This was, by far, the highlight of the trip for us. We were lucky enough to do this late in the afternoon and the lighting brought out the incredible colors of the rocks, and the formations of those rocks. If you do anything, take this drive!\nShow less"], ["Reviewed April 26, 2017", 5.0, "Well worth an hour", "Great scenic drive and can easily be done as a detour going to/coming back from one of the other sites in the Furnace Creek area. Does get a bit bumpy, but saw plenty of road cars along the way (our hire car was a 'soft roader' which easily handled the bumps!)\nShow less"], ["Reviewed April 23, 2017", 5.0, "Fantastic Road Trip Through Amazing Scenery", "The Artists Drive us pretty spectacular when it comes to scenery. There are a number of viewing points near the road, all very well signposted. Death Valley N.P is full of incredible sights and this drive is a really good option. Great views of the valley and mountains as you go along and there was jaw dropping beauty at every turn.\nCheck out Badwater Bason, Dante View,Devil's Golf course and Artists Palette while you are in the area. Amazing place and a wonderful drive this one!\nShow less"], ["Reviewed April 22, 2017", 5.0, "Spectacular", "We visited Artist's Drive during our recent trip to Death Valley National Park. I must say that this is one of the most beautiful mountain ranges that I have ever seen. The natural colors are spectacular. I highly recommend a drive through this area to everyone who is visiting Death Valley.\nShow less"], ["Reviewed April 17, 2017", 4.0, "The Dips were mode fun than the mountains", "Loved the drive especially the Dips. felt like roller coaster. Went around twice :) Other than the artist palette there wasn't anything else to stop there but the drive through the mountains was neat."], ["Reviewed April 14, 2017", 5.0, "Beautiful drive", "Although short one, the sights are amazing. Volcanic eruptures gave the landscape so many different colors and shapes. Don't miss"], ["Reviewed April 13, 2017", 5.0, "National park tourist attraction", "Beautiful naturally painted hills, colors are amazing, from salts in the soil. Driving tour, nice road"], ["Reviewed April 11, 2017", 5.0, "Easy to do this attractiin", "We drove through this one way loop road on our way back to Furnace Creek after a hike in Golden Canyon and a visit to Badwater Basin. All can be done in one morning and we had ranger tours at Golden C and Badwater. It's an easy drive and worthwhile trip. We had the place to ourselves and my husband enjoyed driving on the curves:) The colors of the rocks are a sight however we did not stop at Artists Palette which I regret!\nShow less"], ["Reviewed April 11, 2017", 5.0, "Beautiful Colors", "The variety of colors in the rock formations are astounding. This drive has just reopened following extensive road repairs after the road was washed out. Easy drive and walk."], ["Reviewed April 10, 2017", 5.0, "Just Beautiful, But HOT", "Artist's Drive is a paved side road, off of the Badwater Road in the center of Death Valley National Park. It is a one-way road that cuts off to the east, about ten miles south of Furnace Creek, and made five or so miles north of Badwater. The road then circles back to the north, to Badwater Road, The colors are amazing in places, and there are many interesting road cuts and rock formations. One thing we noticed was that while the April temperature at Badwater Basin was 97 degrees, we hit one small isolated valley on the Artist's Drive where it was a reliable 111 F degrees (44 C).\nI'd love to go back. This is a great place to take photographs, but be warned, it's HOT and you need to take water with you (there are no services).\nShow less"], ["Reviewed April 10, 2017", 5.0, "Dazzling without leaving the car", "As part of our four-days in DV, we drove Artist's Drive at high noon. The colors were spectacular and we didn't need to leave our car. But we did, at Artist's Palette. And that was worth enduring a little bit of Death Valley to get really close to the colorful rock formations. This drive is a necessity for anyone coming to Death Valley.\nShow less"], ["Reviewed April 5, 2017", 4.0, "A great ride by bike for sure", "We travelled from Vegas to Death Valley on motorbikes. If you have time. Do it. Wow. What a thrill. Not only are the roads awesome by bike, the the scenery is just awesome. A must for sure."], ["Reviewed April 4, 2017", 5.0, "Beautiful. Great rally track too", "I visited in the evening and had a great drive round it with no one else around. Along with almost everywhere else in the area, this is a place of stunning natural beauty."], ["Reviewed April 4, 2017", 5.0, "Beautiful Drive", "This drive is a loop road and is one way and has amazing landscapes at every turn. A very pretty drive that you must do."], ["Reviewed April 3, 2017", 4.0, "Love the new road", "New road was recently opened, very nice and being one way makes it so safe and easy to slow down and enjoy. New pavement makes it look so good"], ["Reviewed April 1, 2017", 4.0, "Nice drive through interesting Geology", "This is a nice scenic drive of about 8 miles through great geology and views of multi-colored rocks."], ["Reviewed March 27, 2017", 5.0, "Beautiful drive, worth the 9 mile trip", "We took this lovely side road today, a nice drive with 2 good stops, one near the beginning of the drive and one half-way through (the second stop is Artists Palette). Multiple colors and patterns, very nice!"], ["Reviewed March 26, 2017", 4.0, "Easy drive", "Easy drive on pavement with a large number of places to stop for pictures or walks. Could be trouble if rain but then this is death valley and rain is rare."], ["Reviewed March 26, 2017", 5.0, "Worth the drive", "Amazing rock formations and colors. You can stop along the way and walk around. Take a chair and enjoy lunch."], ["Reviewed March 25, 2017", 4.0, "easy drive with very nice views", "This one-lane, one-way road offers a number of very pretty views of pastel-hued rock formations. There is parking at two sites (one is Artist's Palette) and several pull-outs at scenic spots along the road. On a sunny day, late afternoon offers the best illumination for photos.\nShow less"], ["Reviewed March 22, 2017", 5.0, "Great drive :)", "The road was very smooth and the drive was amazing :) the views were beautiful. Plenty of places to stop off to the side to soak in views and capture your favorite photograph. The colors were incredible."], ["Reviewed March 22, 2017", 4.0, "Interesting Drive Which is Newly Opened", "Took the drive in late afternoon when it was hot and sunny, but was told by a Ranger that it is especially good on a cloudy day when the colors are more vibrant."], ["Reviewed March 21, 2017", 5.0, "Road now open!", "After closure due to the 2017 floods, this beautiful drive is again accessible and sports new pavement. The entire loop is but a half-hour, so take your time and enjoy it at 15-25 mph."], ["Reviewed March 19, 2017", 5.0, "Awesome Loop Drive - Go Slow and Enjoy the View in Every Direction", "This is a great loop drive, be sure to take your time and get out of the car at each pull out so that you can enjoy the view in all directions. Watch for the colors formed by all the natural minerals in the rocks and soil as you drive. Be sure to stop at Artist's Palette and read the information display, it's great. And don't forget to admire the view of Telescope Peak across the valley\nShow less"], ["Reviewed March 18, 2017", 5.0, "Wonderful drive", "Lovely drive with lots to see and take in along the way. It's a loop drive so easy to make your way around and stop at all the sights."], ["Reviewed March 18, 2017", 5.0, "New Road to color", "The paved road has just been completed follow damage from the rains. The colors of the hills are amazing and the drive moves through many interesting areas with views."], ["Reviewed March 17, 2017", 4.0, "Just a short drive back for some spectacular views.", "Beautiful surroundings, a must see when you're travel through Death Valley just south of Furnace Creek."], ["Reviewed March 4, 2017", 5.0, "Worth the drive.", "Take in beautiful rock formations on this one-way drive - take your time and enjoy the breathtaking vistas."], ["Reviewed February 25, 2017", 5.0, "Unexpectedly Beautiful", "Don't miss this one-way drive through amazing scenery in the valley. An easy drive from furnace creek."], ["Reviewed February 20, 2017", 5.0, "One of the nicest vistas.", "Amazing is a word that only begins to explain the beauty of this drive. The colors of the minerals in this diverse geography is as if it is a rainbow of mountains. If you make it to Death Valley do not miss this."], ["Reviewed February 19, 2017", 4.0, "Scenic drive", "Scenic drive is really what it is. Beautiful rock formations and colors everywhere. And it's fun to drive too."], ["Reviewed January 19, 2017", 5.0, "Do it do it do it", "When I was planning my tour through death valley I didn't realise how close a lot of things are. Most attractions are off the same road so you easily go from one to the other.\nThe artist drive is a single Lane road around 6 miles long through the colourful rocks. An absolute must. So pretty. Slow and take your time. One of my highlights in death valley\nShow less"], ["Reviewed January 16, 2017", 5.0, "Interesting geology visible from the car", "This short, one-way drive takes you through some very intriguing changes in the hills, washes and canyons, including color changes in the rocks and soils."], ["Reviewed January 12, 2017", 5.0, "Fantastic For Passengers, Exciting For The Driver", "The drive is about 4 KM long but you will be driving for around 20 min due to the slower speed.\n\nThere are a couple of places along the drive for you to park your car and take pictures, but there really is no need. The entire scenery is great and there really isn't 1 or 2 defining places.\n\nAs the driver, this is absolute fun. It's like taking a driving test and be prepared to take hard turns and shifting gears!\n\nI love it!\nShow less"], ["Reviewed January 11, 2017", 5.0, "June 2014: Worth your time", "It's a small loop with beautifully multi-coloured rocks. It's a short drive and you don't need to go too far away from your car. Death Valley is a big park so make sure you include this part on your trip."], ["Reviewed January 11, 2017", 5.0, "Terrific way to see the scenery in the car", "No need to get out of the car. The scenery surrounds the car. The road is paved. Awesome views. Colors and cliffs are terrific."], ["Reviewed January 10, 2017", 5.0, "A unique experience", "The artistic drive gave us a unique and thrilling driving experience. We could enjoy the scenic views with different colours of mountain stones side-by-side. Had never seen such a scenic spot. A Must Visit Place."], ["Reviewed January 10, 2017", 5.0, "rollecoaster drive", "take the loop road off the main road and you will be well rewarded. The road heads into the mountains for a closer view of the astounding colours; around each corner is another surprise."], ["Reviewed January 9, 2017", 5.0, "Sunset hue and picture perfect drives", "The curves and turns are picture perfect and Nature gives you pure thrill as you drive. Watching the hue and color and shades and contours in this part of death Valley is just awesome."], ["Reviewed January 8, 2017", 5.0, "Seriously artistic", "We were lucky to view this beautiful drive in different lights. As we entered the drive, it was raining and cloudy. The different rock colors at the artist palette were mesmerizing. As the showers stopped and the sky cleared, the sun rays gave it a very different feel. Highly highly recommend this place if you are visiting Death Valley.\nShow less"], ["Reviewed January 7, 2017", 5.0, "Great drive", "Lots of places to park and take pictures. Guaranteed you won't see anything like this elsewhere. There are so many different variations at each corner. Beautiful colors"], ["Reviewed January 5, 2017", 5.0, "Even better than expected!", "We were not expecting it to be quite so interesting. We pulled over a few times to take photos and hike around a canyon where several Star Wars episodes were filmed."], ["Reviewed January 5, 2017", 5.0, "do this drive if you can only do one", "if you can, go late afternoon when the shadows contrasting with the colours add to your drive. Always stop where people are gathered...there is always a good vista."], ["Reviewed January 5, 2017", 5.0, "Scenic and Unique Drive", "Artist’s Drive is a one way scenic loop from South to North that brings you through vast volcanic and sedimentary mountains. Various metals that have oxidized give these mountains their distinct color pigment. The spectrum of colors make this stop worthwhile."], ["Reviewed January 4, 2017", 5.0, "Looked like Neopolitan ice cream", "Enjoyed this short drive through multi-colored hillsides.Very nice paved drive. There were a couple of turn-outs for viewing. The visitors center did say that this drive would be closed for repairs until March 2017."], ["Reviewed January 2, 2017", 5.0, "Beautifu drive", "A very beautiful drive, but you have to calculate your timing to catch the sun that illuminates all these lovely colours on the rocks"], ["Reviewed December 31, 2016", 5.0, "Beautiful", "Nice one way loop road with breathing vistas and colors of natural minerals. A few special areas to stop for more breathtakingly vistas of this natural area."], ["Reviewed December 31, 2016", 4.0, "Great views on winding roads", "Great drive on the way to Artists Palette, don't be fooled by the cars which have pulled over on the right well before the turn off for Artists Palette, it's one way so no need to worry about on coming traffic. That said the roads are very winding so drive carefully.\nShow less"], ["Reviewed December 29, 2016", 5.0, "Worth the side trip", "Great spot for a drive with many pull-outs for photos ops. Really enjoyed the scenery. Does not take that long to drive so totally worth doing."], ["Reviewed December 29, 2016", 5.0, "What a trip!", "This road is one way and once you begin the trek, you can see why. It winds and dips through the area. Great views and picture stops."], ["Reviewed December 28, 2016", 5.0, "Unusual colors that change with lighting and time of day", "Pastel-colored hills with contrasting shades similar to sidewalk chalk. Great views down the canyon where R2D2 was filmed for Star Wars. Easy access from parking lot. The one-way drive to and from has hidden gems of scenic shots if you stop at the bottom of the dips and take a picture out the window.\nShow less"], ["Reviewed December 28, 2016", 4.0, "Name says it all", "We took this side road on the way back from Badwater. It is very scenic. It is all paved.\nBe sure to go up artist palette for a closer view of some of the more colorful area's as well as a bathroom stop.\nIt is all one way with the exception of artist palette. Road is just wider than a car but many places to pull over and take it all in.\nShow less"], ["Reviewed December 27, 2016", 5.0, "You will never experience anything like this", "Amazing landscapes and mind-blowing vistas and canyons on your drive. Very picturesque!! Please dont miss it. It is worth every minute of the drive"], ["Reviewed December 27, 2016", 5.0, "super", "great fun and experience! Not only the views but the trip was like rollercoaster. It was super and it took about 30 minutes by car"], ["Reviewed December 26, 2016", 5.0, "5. I thought it would be about the colors but it was the landscapes.", "Vehicles more than 25 feet not allowed but this was an interstate compared to 20 Mule Canyon. Spectacular pastels, oxymoron aside. Views of peaks above and a few cuts to lower levels. About half way around the 4 mile loop, is Artist Palette with the greatest array of colors. There are some pull offs so you can get out and explore.\nShow less"], ["Reviewed December 21, 2016", 4.0, "Pretty drive", "Easy drive to see some different colored mountain formations. The kids were able to get out of the car and hike around a little bit"], ["Reviewed December 17, 2016", 5.0, "So many different colors beside each other!", "We love the scenic drives and this was amazing that you had a different color mountains beside each other. You would view a beige color, a black, a brown, a tan, a whitish, all next to one another. The green color in the mountains was beautiful!\nShow less"], ["Reviewed December 16, 2016", 5.0, "Beautiful fun desert drive. Any vehicle can make the drive", "Multi colored mineral hills. Found a great place to park and hike. Beautiful close up of the hills that make up death valley. Totally ejoyed this drive. Took us more than 3 hours, including hike and 2 other photo stops."], ["Reviewed December 15, 2016", 5.0, "A lovely drive on paved road", "The drive is beautiful. Many colors in the geology. Many vistas around each corner. Pull outs for pictures and a parking lot and bathrooms if needed."], ["Reviewed December 12, 2016", 5.0, "Great One-way Drive", "Artists Drive is a great place to stop on your way to or from Badwater Basin. This one way drive is a great addition to your time in Death Valley."], ["Reviewed December 12, 2016", 5.0, "Great cycling route", "My husband rode his bike on this route on a thanksgiving day afternoon and the road was not that busy so I was able to take great shots while he was cycling on this amazing view"], ["Reviewed December 9, 2016", 5.0, "A Monet in Death Valley", "Make sure you get here before sunset with enough sunlight to see the spectacular colors. Not to miss when you visit Death Valley!"], ["Reviewed December 7, 2016", 4.0, "Kinda fun", "This is actually a nice drive, and when you get to the place, you can snap a few pictures and off you go to the other attractions. There is really nothing else here. Personally not my high point but worth the drive. It's just a skip away from the Devil's Golf Course, etc.\nShow less"], ["Reviewed December 7, 2016", 5.0, "Artists Drive", "Take artists drive which includes Artists Pallette really great windy drive that is about 5 mi long great places to get out and take pictures easy access for all"], ["Reviewed December 4, 2016", 4.0, "Pleasant drive through colorful formations in the Badlands off of Badwater Road", "This is a very nice drive through some canyons off of the floor of Death Valley and the Badwater Basin. You will see the bedding of the rocks that have been uplifted and sometimes tilted and contorted. There are various colors that are very striking along the drive. Well worth the detour. Fortunately, the drive was still open when we visited as the brochures stated the drive was closed for repairs (Nov. 2016). Now we understand the repairs will not begin until 2017. Enjoy in the meantime.\nShow less"], ["Reviewed December 1, 2016", 5.0, "Interesting place", "Just a detour off the main route - interesting colours and formations and well worth a visit. However, the WC's were a bit challenging - be prepared to hold your breath for the duration!"], ["Reviewed November 30, 2016", 5.0, "fantastic", "grateful the park made this drive and the views possible. Be sure and check out the artist's side road - the colors are even more amazing and there is a toilet."], ["Reviewed November 29, 2016", 5.0, "7 mile round trip scenic drive.", "Drive through this 7 mile round trip road. Lots of places where you see very varied colors in the rocks which gives an impression of an artists palate. This is a one-way road and the southern point on Badwater Road is the point of entry."], ["Reviewed November 29, 2016", 5.0, "Color of rock mountains is good for pics", "Drive there is beautiful, and when you turn to that road sights around make you WOW. We did several short trials there, one of the best walks."], ["Reviewed November 27, 2016", 5.0, "The journey is as great as the view", "Very interesting features on the rocks making this look like an Artist Palete (My wife is one so I know)...Great ride up from the main road on the twisty loop, we were lats afternoon when the super moon was just rising over the hill tops, amazing scenery...worth the short trip here\nShow less"], ["Reviewed November 27, 2016", 4.0, "Scenic drive - loved it", "It's a one way drive. Good to start with Badwater basin, Devil's Golf course and then artist's drive. The latter half of this drive was very scenic with good rock formations on both the sides (often with different colors) on a winding road. Definitely one of the best spots in DV. Pretty safe, good road and no 4WD needed.\nShow less"], ["Reviewed November 24, 2016", 5.0, "Amazing Drive - Beautiful Colors", "Amazing drive which is convenient on way when driving from visiting Badwater. Amazing colors of all present minerals, beautiful natural formations. Another must see when visiting DVNP."], ["Reviewed November 23, 2016", 5.0, "A Palette of Colors", "Artist’s Drive is one of my favorite sights in Death Valley. Anyone can enjoy the colors from the comfort of a car. If you are up for it, I recommend a colorful walk through Artist’s Palette. Near the end of the drive, you can hike to heights or amble through narrow channels and gaze up at the colors.\n\nThe NPS map marked the road as closed for repairs starting in November, but the drive was still open as of November 19.\nShow less"]]}}