{"Asian Art Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Asian Art Museum", "url": "/Attraction_Review-g60713-d103857-Reviews-Asian_Art_Museum-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/4c/86/f7/front-of-the-museum.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1367"}, "address": {"@type": "PostalAddress", "streetAddress": "200 Larkin St", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94102-4734", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Well worth a visit", "There is so much to see in this museum that it is hard to take it in in one trip.It is a wonderful collction and a learning expereince."], ["Reviewed 1 week ago", 5.0, "amazing collecetion", "Amazing collection of Asian art. A great look at history of Asia. Beautiful culture. Many many budhas"], ["Reviewed 1 week ago", 5.0, "Quality collections, extraordinary special exhibition (Tomb Treasures), beautiful building", "We decided to go to this museum not really knowing anything more about it than that they had an Asian art collection that was well rated in a guide book we had. We had no idea that they were hosting the special exhibition \"Tomb Treasures.\" We really lucked out although we did not see all of the permanent collection. We decided to take out a membership to the museum and group of affiliated museums. We haven't regretted it.\n\nWe REALLY enjoyed the exhibition of \"Tomb Treasures\" from China's Han Dynasty which included taking a guided tour with a docent. Very very interesting. We saw a jade burial suit for a Queen and a large solid jade sarcophagus. I had never heard of either.\n\nAfter the special exhibition, we went through the Japanese and Chinese collections, as well as touring the porcelain collections housed on an upper floor around the very large stairwell.\n\nWe also enjoyed the architecture of the building. A beautiful old building with quite a stairway.\n\nWould love to go back.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "An average exhibition housed in a great building", "Based in a great city famed for its East Asian populations, the museum underwhelms a bit. It has some good collections but no major surprises. Perhaps it has more in the storage than meets the eye; so it is more a matter of how to curate the exhibitions. It does have a free admissions day on the first Sunday of the month.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "An amazing Asian Art Museum", "San Francisco's Asian Art Museum is one of the best in the United States and definitely worth a visit. Their comprehensive collections include fabulous masterpieces from China, Japan, India, and Southeast Asia."], ["Reviewed 3 weeks ago", 3.0, "Small Museum with a Beautiful Interior", "The Asian Art museum in San Francisco is housed in the old library. It is beautiful inside! They have some really pretty textiles on display; kimono, tapestries, and other garments."], ["Reviewed 3 weeks ago", 5.0, "To the origins of immigrants", "Splendid museum with clear explanations. Start at the 3rd floor, visiting Azian cultures and arrive then at the ground floor.\n\nVery special was the Philippine department . In the past the Philippines were neglected by Americans in general, so also by the Museum. They are one of the biggest community in SF, so the museum changed their mind.\n\nIt is interesting to note, that Americans of the West coast emphasis the importance of Asians by dedicating a Museum to them.\n\nThe atmosphere was Southern-Calfoprnian easy style.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing Art and venue for a wedding", "This is an amazing museum of Asian art. It is located across from San Francisco City Hall. We went to a wedding at this museum, perfect venue with its amazing architecture of long staircase, balcony area and private room for ceremony. The whole area was transformed and it was stunning!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great permanent collection and amazing special exhibits", "The Asian Art Museum is welcoming and well organized. The docent tours are great. the interactive map to direct you to the display in which you have most interest is very helpful. The current special exhibit is leaving soon -"], ["Reviewed 4 weeks ago", 5.0, "Beautiful & unusual antiquities", "Beautiful silk screens and kimonos. Tiny ceramics and wood carvings. Although we were on a tight schedule, we hit all the floors. We'll come back another time to absorb more of the descriptions of the individual pieces. I loved the way it was organized by dynasty and ethnicity.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Always Finding New Objects (and sometimes buying)", "The AAM is always a delight. Not only does the featured exhibit usually spread across 4 galleries on the main floor spark interest, such as the current Korean Couture, but you can explore the permanent collections for new exhibits and items, such as Collecting Philippine small show and the spacecraft piece (see photos). I love to browse their well-stocked gift shop and find it hard to leave without buying a memory. There is underground civic parking across the street.\nShow less"], ["Reviewed 5 weeks ago", 3.0, "AAM cafe, not as good as the recommendation", "i think the Asian Art Museum is a little interesting. Perhaps most interesting in that it was the public library and the 1989 Earth quake made them fix it and build the one next door,\nthe AAM cafe was lauded , so great but , i did not find it that impressive\nShow less"], ["Reviewed January 22, 2018", 5.0, "Nicely curated Asian artifacts", "This museum is excellent for those interested in Asian art and artifacts. Each piece is nicely displayed. This is more for those interested in art history and culture than fine art appreciation. Smaller museum, intimate, and informative.\n\nWe went on a Friday, it was uncrowded and we could take our time. We didn't take the guided group tour, but overheard parts of it. Interesting, I would recommend it. We checked out a wheelchair for me, it was easy and pleasant.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Highlight of my first trip to San Francisco", "Loved this museum. The collection is gorgeous. Highly recommend a visit. I only had two hours, but was able to see everything (although I did not read all the descriptions)."], ["Reviewed January 19, 2018", 5.0, "Great collection", "The Asian Art Museum in San Francisco is one of my favorites of any I've seen in the US. The permanent collection is excellent. They also presents very good temporary exhibits. Well worth a visit or two. (First Sunday each month is free)"], ["Reviewed January 9, 2018", 5.0, "First Sunday of the month FREE", "My husband and I went tot he museum on the first Sunday of the months when the general admission is free. We had a great time! Lots of art pieces that you will not see at a typical art museum including works from China, Korea, Japan, Thailand and Philippines. It took us about two hours to walk through all the Flores and admire some rare pieces. I would definitely recommend visiting plus if you go on the first Sunday of the month you don’t even have to pay.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Tomb Treasures exhibit spectacular and enjoyed permanent collections too!", "I have enjoyed visiting the Asian Art Museum on two previous occasions but I couldn't resist another trip there when I received a notice of the \"Tomb Treasures\" exhibit featuring artifacts from the Han Dynasty. As a Roman history enthusiast I am always thrilled to explore an exhibit about another culture from the same time period so I can compare their arts and technological development.\n\nSan Francisco is just a little over an hour's flight from my home in Oregon so I decided to make a day trip out of it. I caught an early morning flight then walked over to the BART station adjacent to the international terminal at the airport. In about forty minutes i was climbing out of the underground train station downtown and had just a short 3-minute walk to the museum. It was a little foggy but warm enough I only needed a sweater.\n\nAs I entered the exhibit I spotted a beautiful gilded bronze lamp in the shape of a deer from the Western Han period (2nd century BCE). It was just the first of many amazing objects I would see that day. I was also excited to see an assembled jade burial suit that had once encased the body of a queen of the Jiangdu kingdom. These suits are rare since they have been the prime targets of tomb robbers over the centuries. A jade coffin reassembled from about 1500 jade tiles remaining in the looted tomb of the King of Chu was also on display. I enjoyed examining a lot of small gold figurines many shaped like stylized tigers that I learned were used as mat weights. People in the Han dynasty did not use chairs, sitting instead on the floor on carpets secured at four corners by mat weights. Most of the weights on display were recovered from royal tombs so many were made of gold or gilded bronze and some of them were also inlaid with silver. Music was very important in Han society and there was an ornate set of bells on display. I learned that these specially-crafted bells actually produced different tones if tapped on different sides. I actually got a chance to try this out with a smaller replica in the children's education center that visitors are encouraged to play.\n\nNon-flash photography was allowed in this exhibit and I took several hundred photographs in the two hours I spent in the galleries. Then I took a break for lunch and enjoyed a marvelous bowl of Fujian coconut pork stew in the museum's cafe. I always enjoy eating there as they have a nice selection of ethnic entrees to choose from. If you prefer more traditional fare they also have sandwiches, salads, and soups. The museum also has a large gift shop stocked with apparel, jewelry, books, and folk art.\n\nAfter lunch, I took the escalator to the third floor and revisited their permanent collections. I was pleased to see not only old favorites but items I had not yet seen before in previous visits. I was particularly interested in a silver ceremonial bowl with Zoroastrian symbols and an intricate relief depicting scenes of the Persian emperor Darius and another scene of the Persian emperor Shapur I humbling the Roman emperor Valerian. I was really surprised when I discovered the object was actually crafted in Burma in the late 19th century. I am always astonished by the variety of objects in the Museum's permanent collections.\n\nBy four o'clock I was getting pretty tired so I made my way back to the train station and was soon back at the airport ready to wing my way home.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Jammed with fascinating art", "SOOO much to see in this museum, both permanent and revolving. If you are visiting San Francisco, you should include this museum in your tour"], ["Reviewed January 3, 2018", 5.0, "Asian art , wonderful museum", "I've passed by this museum multiple times. Asian\nart is usually not my preference . If you are a library\nmember they have a program called 'Discover\nAnd Go'. This program allows free entrance to\ntwo people and occasionally a family.\nWe we're pleasantly surprised at how beautiful\nand well organized and presented this museum is.\nBeautiful Buddhas that are centuries old, pottery,\nsome jewelry. They had a special Buddhist gong\nthat you could welcome in the New Year.\nArt from all areas of Asia : China, Thailand,\nJapan, Korea,Philippines and much more.\nThere is a gift shop and a cafe that serves\nAsian food .\nEnjoyable visit.\nShow less"], ["Reviewed December 26, 2017", 4.0, "Great range of Asian Cultures Represented", "This was probably the best museum experience I had in San Francisco. Displays well presented and many unique items. Interesting to see local ethnic groups exploring their backgrounds."], ["Reviewed December 22, 2017", 4.0, "a good collection", "The Asian has a very good collection of art from India, China, and Korea. They apparently have one of the best collections of Chinese bronzes outside of Asia. The arrangement of the collection is (from the top floor) roughly the order of the founding and spread of Buddhism in Asia. Except for Thailand, they are weak in art from SE Asia and Central Asia. They have a room of exquisite Persian artifacts.\n\nFind out if they have any special exhibits going on. They're often very good and sometimes completely amazing.\nShow less"], ["Reviewed December 14, 2017", 5.0, "A fabulous afternoon", "We went for the Korean Couture Exhibit, and it was exquisite. It is divided into three sections....traditional and historical, couture a la Chanel, and modern. Fabulous! The upstairs permanent exhibits are displayed by country and are a treat. Plan at least a couple of hours to see most of the exhibits. Also, the cafe is a great place to have lunch or a coffee. FYI: There are multiple parking garages nearby.\nShow less"], ["Reviewed December 14, 2017", 5.0, "One of the best Asian Art collections", "Easily one of the most amazing collection of Asian art. The audio guides are also worth getting. The place is huge and you can easily spend at least 3 hours here."], ["Reviewed December 13, 2017", 5.0, "Always worth a visit, but plan your time .. you can spend all day here.", "The collections here - both visiting and permanent - are always stunning. However, the place is HUGE!! You can easily spend hours and hours here. Let's face it, there are only so many incarnations of Buddhas you can view in a compressed time frame. Look at what's there ahead of time and plan accordingly. But definitely go!\nShow less"], ["Reviewed December 6, 2017", 5.0, "Better than any museum I've been to in Asia", "This place has it all, Korean, Indian, Sri Lankan, Indonesian, and more, it also tells the history of how religion and colonization shaped modern culture"], ["Reviewed November 30, 2017", 3.0, "BEWARE- In one of the worst areas", "The Asia Art museum is amazing and the museum is much larger that it appears . Give yourself at least 2 hours to see everything. They have a nice cafe inside as well. The problem with this place is it is smack in the middle of the worst areas in San Francisco. There are homeless beggars and strung out a drug addicts surrounding the building which makes it uncomfortable to go in and out of this museum. People are passed out on the sidewalk , sitting around the building and layed our across the street on the lawn by City Hall. I definitely would make sure to be out of this area before nightfall.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Wonderful Korean fashion exhibit", "We enjoy this museum when we come to San Francisco and this time was special with the Korean Fashion exhibit. It was very interesting with the contrast of old and new patterns while maintaining the historical interactions of fabric, design and symbolism."], ["Reviewed November 23, 2017", 5.0, "How can't you love Museum whose entryway statue SHOULD be titled \"Yellow Submarine meets pre-sushi tuna?\"", "This jewel of a museum has it all. Though religious themes predominate, especially of the Buddha, their expressions vary based on their country of origin. And that's the point: so many nations are represented: India, China, Tibet, Iran, Japan, and of course Southeast Asia. The varieties of work provide a feast of artistic expression. I cannot think of a better introduction to Asian visual-art than can be found at his Museum.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Well worth a half day", "Very comphrehensive collection of the varied aspects of what is commonly lumped together as Asian. Very good audio/visual display guides.Interesting special exhibits"], ["Reviewed November 12, 2017", 5.0, "Great museum!", "Love going to this museum---beautiful collection and well worth it. The museum is quite central so it's easy to stop in for a quick visit."], ["Reviewed November 9, 2017", 5.0, "A supberb city museum, with some of the best works of modern and period arts you will ever see..", "The Asian Art Museum is another \"must see\" in San Francisco, with extrodinary exhibits and cultural events that the art enthusiust will not find anywhere else. A fantastic impressive structure itself, the Asian Art Museum is centrally located in the city, easily accessible to public transportation, and less than a $5 Uber Pool ride from many hotel in Union Square and the down town area.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Best Asian Art ever!", "It was so great to visit SF Art. The master piece was awesome, I highly recommend this Asian Art Museum!!!!"], ["Reviewed November 8, 2017", 5.0, "Excellent", "The exhibition is well set-up, both chronologically and geographically. Wonderful museum for anyonw interested in Asian culture and art and absolutely worth a visit, rich and impressive collection."], ["Reviewed November 8, 2017", 5.0, "Beautiful museum of SFO", "One must visit this museum to see beautiful paintings, artifacts created or developed by Asian artists. Its quite big museum."], ["Reviewed November 8, 2017", 5.0, "Beautiful museum, great for a rainy day", "I have been to this museum a couple of times and have been impressed with the quality of the pieces and exhibits they offer. I would highly recommend visiting if you are in San Francisco, esp. if you need to find something to do on a rainy day. It's a short walk from many hotels.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Beautiful Museum", "I enjoy coming here to enjoy the different exhibits they have throughout the year. The kids enjoy coming here also."], ["Reviewed November 8, 2017", 5.0, "WOW", "This was a highlight of our trip. It was incredible as I expected. We spent over 2 hours and could've spent 2 hours additional. We loved it!!"], ["Reviewed November 6, 2017", 5.0, "best collection of Asian art in the US", "their collection is one of the best. Special event are also very well done. Best to take public transportation or a taxi--parking is hard."], ["Reviewed November 1, 2017", 5.0, "Well Worth the Visit", "I was initially daunted at the prospect of a collection of 18,000 items but the number of exhibits is much smaller, carefully chosen and quite manageable. The range of geographic areas is large so it is ‘Asia’ in its wider sense of the word.\nExtra thought and care has gone into how the works are presented and displayed. The lighting and the backdrop to various pieces attracts engaged attention and flatters one’s photographic skills. The explanatory notes were of reasonable length and detail making them very helpful. Additional briefings on background subjects often contained excellent visuals that repaid the attentive reader.\nI think the Museum Shop had some interesting items but much of it could be found elsewhere. I would have been interested in more items that reflected or were more closely connected to the exhibits upstairs and been willing to pay accordingly.\nLet me finish by praising the on-site cafe; the chicken salad was especially tasty. Do go!\nShow less"], ["Reviewed October 28, 2017", 5.0, "Loved every bit", "From the dragon on the plaza in front of the Asian Art Museum, to the clever branding, to the intelligent and tempting merchandising in the shop to the delicious salads we had in the dining room, this Museum delivers even before you get to the collection. And the collection? Hold on to your hat. It is not a wide collection, but narrow and deep....so what is there is magnificent and is curated in a way that compliments the collection while bringing the viewer along—teaching, showing, encouraging. The spaces are designed to showcase the objects while has lots of design clues to help the viewer see the spaces for what they are, and their history. Painted beams throughout is amazing. Plan this into your trip.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Extensive collection well displayed", "Very impressive and certainly worth a visit. Ancient carvings in wood, stone, jade amazed us with their intricate designs."], ["Reviewed October 23, 2017", 4.0, "Beautiful peaceful setting, lovely cafe , great exhibits", "located in the former SF Public library building, the Asian museum is impressive from outside. Inside, all kinds of wonders await. Changing exhibits, permanent collection, modern Asian art, classic art , this museum has it all plus a fabulous cafe."], ["Reviewed October 17, 2017", 5.0, "Don´t miss", "I like museums and the Asian Art Museum surprised me. It is precious with very good art collections. The cafeteria is very special with a precious menu. I strongly recomend visiting this museum."], ["Reviewed October 15, 2017", 4.0, "Incredible history", "This museum is great value for money and has an incredible history of Asian Art which dates all the way back to BC. A pity when I arrived there was nobody as the audio desk for headphones and nobody to replace them? But despite that I enjoyed the museum and all it had to offer. The current exhibition Flower Power is worth paying the additional entrance fee for too. Great bookshop, clean rest rooms and nice cafe to eat too. I had an Asian chicken salad which was fresh even though I thought slightly over priced.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Wonderful Museum - Surrounded by Urban Realities", "The Asian Art Museum is a great museum - wonderful ongoing and traveling exhibits, both. It's in a building which was once the old main San Francisco Public Library - with the sort of architecture you'd expect to see in such a building. (The new main library is nearby - if you want to see it - but go knowing that it is also a place where many homeless seek refuge in the daytime.)\n\nIf you are traveling from parts of the country - or out of the country - which don't have museums with a focus on Asian art and you are interested in Asian art, I definitely recommend. Or if you simply like museums, yes, go - it's a good museum. Not gigantically huge but good - with art from a range of styles, epochs, locations, cultures in Asia.\n\nPretty good café also. My experience there has varied but in general, it's good and you can eat inside or outside. Nice gift shop, too.\n\nOne thing to be aware of if this is a first time visit to San Francisco: All the stuff folks like in SF comes with a price - and that price is a lot of suffering. We have huge income inequality, lots of homeless folks, and a big opioid problem. Many parts of the country and the world do but we REALLY do. People are shocked by it. If this is \"too much\" for you, go somewhere else with beautiful vistas, both an ocean and a bay, a famous bridge, a culture known for its diversity and creativity, etc.\n\nIf you do choose to go, understand that there are many challenges here... we are working on them... and they aren't problems we can solve overnight. Everyone likes the tech \"stuff\" - like platform you're reading right now, Trip Advisor. But who likes what happens to a community when a massive economic change comes over it and pushes out many folks, creates deep divides, etc.? Even the folks at the top of that phenomenon don't like some of the results which include horrendous traffic, lots of homelessness, exhausted mega-commuters, and increasing addiction rates.\n\nThat is part of the \"deal\" we all make living or visiting here.\n\nSo come - and enjoy all we have to offer. Also, be prepared for things you might not see in your own hometown. Or maybe you do.\n\nWhat's happening here is not disconnected from other parts of the US or the world. This is one part of the story. Other parts can be seen elsewhere.\n\nMuch of the art inside of the museum was created by cultures which also had a lot of income inequality and tremendous suffering. We like the art. We probably wouldn't want to live in the conditions the average person endured in those cultures.\n\nSomething to think about... as we enjoy the arts of today's culture, including technology.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Gorgeous, large and...not many people around", "I accessed this place with my Visit SF pass which I purchased via Groupon and after having my printed paper scanned I decided to start with the top of the building, moving after to the lower floor. The ground floor had only paid exhibitions and a large cafe so nothing to visit there for me.\n\nHowever those 2 upper floors were packed with amazing art from India, Japan, Korea, China etc.\n\nI simply loved everything: statues, paintings etc as they are all so gorgeous and unique.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Small Collection but Fascinating.", "This museum is housed in the former San Francisco public library. As you would expect, the light is perfect for an art museum. The collection is ambitious and houses some excellent pieces. It is growing and is one of the best in the Western Hemisphere.\n\nThe restaurant is one of the better museum restaurants. We will sometimes have lunch there before we go elsewhere such as the theater or opera.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Tremendous Variety of Asian Art and Statuary", "This museum, easily reached on BART from the Embarcadero, is jam-packed with an extremely rich array of work. It may be a little too much to see for younger children. But someone with a particular era and country of interest will find rare depth in this collection.\nShow less"], ["Reviewed October 2, 2017", 3.0, "Compelling art collection that deserves better spaces to feature them", "While the collections and prog ramming are interesting, the physical spaces are very challenging for the visitor. Many recent exhibits were forced to spread out -- not always logically -- across 3 separate rooms on the ground floor. And way-finding continues to be difficult across the upper floors as well. A capital campaign seems to be under way, but that can be years to resolve these issues that impact the story-telling potential for this institution, and ultimately affecting negatively the overall visitor experience. Too bad, as this can be a real gem of a cultural space for SF.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Gorgeous Venue with Amazing Displays", "The Asian Art Museum is in the old Public Library building which is beautiful to visit for its own sake. The gorgeous staircase and painted ceilings are still intact. We attended the temporary exhibition Flower Power which was a wonderful take on this theme celebrated by multiple museums throughout the city. We had a wonderful, knowledgeable docent (Gail) for a memorable tour of these artifacts. The permanent collection holds artifacts from a variety of Asian countries and cultures and from periods throughout history. Spectacular individual pieces (the oldest dated Buddha) throughout the museum.\nShow less"], ["Reviewed September 30, 2017", 4.0, "Very interesting", "The collection is extensive, covering all the countries of 'Asia' with items both modern and truly ancient. I found it both informative and very interesting. Covering three floors the venue is very central with easy access for this with a disability or strollers."], ["Reviewed September 29, 2017", 3.0, "Interesting and welcoming", "This is a great museum for an introduction to asian art, someone who is familiar with the cultures and has been to museums in Asia may find the collections a bit lacking. The museum is not massive - which is something I see as a plus, in two hours I managed to see everything I wanted to without being rushed.\nFlower Power exhibit was nice.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Incredibly rich cultural experience", "If you are interested in art, religion, history or other aspects of Asian culture, this museum will not disappoint. Thrilling collection of Buddhist artifacts from every country where Buddhism is practiced on the Asian continent. Cafe is also pleasant for Dim Sum or a light meal.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Beautiful art, well curated and displayed, in a Zen-like atmosphere", "This museum, in the Civic center, is much different from SF MOMA or the DeYoung, because it does not have the same sensibility and definitely not the same crowds. The art is beautifully chosen and displayed. The baskets in the Japanese section on the third floor adjacent to the tea house are spectacular, and the ceramic pieces a few steps away are breathtaking.\nThe art is arranged by country - separate sections for Japanese, Indian, Korean, Chinese, etc. art, and each piece carefully chosen and well labeled. You can spend a lot of time, for example, just wondering at the beautiful Netsuke.\nRight now, there is a \"flower power\" exhibit on the main floor, and we saw it with a docent, which added an extra layer to the experience. There is a wonderful digital art work in that exhibit, and we spent quite a bit of time just enjoying the play of images - birds, branches, butterflies...\nAdmission to the museum includes a free Acoustiguide - be sure to pick it up at the coat check desk, because it will help you learn so much more about the art you are seeing.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Wonderful permanent exhibition", "We were short on time so didn't see the special exhibition however the permanent exhibition that is housed over two floors takes an hour or two to see. The range of art is fantastic- I have never seen such an excellent display of Asian art from all of asai\nShow less"], ["Reviewed September 15, 2017", 4.0, "Up to date and always changing exhibits", "Interesting collection and exhibition display here. As an asian, I honestly gave a second thought about paying this museum a visit.However it was worth visiting. THe museum is consist of 3 (or 4 storeys) so if you want to take your time, come here early."], ["Reviewed September 14, 2017", 5.0, "A must for Asian Art fans", "The largest collection of Asian art in the world. Lots of audio-visual and placard-type information in the exhibits, so you get historical and artistic perspective with all that loveliness."], ["Reviewed September 13, 2017", 5.0, "Amazing Asian Art Museum", "This was our first visit to the Asian Art Museum. We were pleasantly surprised at how efficiently everything was placed. There was so much to see in the area allotted. Halfway through, I noticed they had these handy cane-like chairs you could borrow when entering an exhibit. If you got tired along the way you could unfold it and have a seat. When you were done with the exhibits in that area you could return the cane-like chairs to the holder. There was seating along the way but not everywhere.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Great Asian Art Collection", "This is a great Asian Museum to visit while in town. Their collection is pretty extensive with everything from Asian to the Middle East. There is an entrance fee. But look on their website once a month they have free admission."], ["Reviewed September 8, 2017", 5.0, "One of the world's best museums", "The Asian Art Museum in San Francisco is one of the world's best museum and the pre-eminent place for Asian Art. Its foundation is the amazing collection of the former head of the Olympic Committee Avery Brundage. It is very large and comprehensive with excellent explanations (in English only). The highlights are China (including priceless bronzes) and India (amazing stone sculptures). Japan and Korean art are also well represented.\nI spent five hours there without seeing absolutely everything. If you have a particular interest in this field, I suggest allocating a full day to absorb it all. If you want to focus on highlights, allow at least two hours and probably take the audioguide to help you pick out the best.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Worth Seeing", "Wonderful museum. Enjoyed it very much. Three floors of exhibits. They have escalators, stairs or elevators to move you from floor to floor, plus plenty of seating if you need to rest. I did not try the restaurant there, but it was full of people. Maybe next time.\nShow less"], ["Reviewed September 6, 2017", 2.0, "Wonderful museum", "Stop by for lunch and see the exhibits. Easy to get too, they sometimes have early morning yoga, enjoy!"], ["Reviewed September 6, 2017", 5.0, "August 2017", "Extremely educational journey into the Asian culture. Wonderfully displayed art. I highly recommend a trip to this amazing museum."], ["Reviewed September 6, 2017", 5.0, "The world-class Asian Art Museum", "The Asian Art Museum is a well-curated world class collection in a fabulous building, the old historic San Francisco Library. Carefully check out each delicate treasure to see how the installers protect it from earthquake shaking. The restaurant offers great food and a welcome mid-visit break.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Wonderful Expereince", "Amazing collection. They have an amazing South Asian art collection, which should not be missed. The gentleman at the front desk was very personable and friendly, even offering great suggestions for restaurants in the neighborhood."], ["Reviewed September 3, 2017", 4.0, "Interesting museum", "Tired and jet-lagged we got off our bus just outsidethe door and went in. And enjoyed our visit! Good shop, too. The building used to be the town library, which explains some inscriptions."], ["Reviewed September 1, 2017", 5.0, "Stunning collection", "You could easily spend a day here. Amazing breadth to the collection and all of it is beautiful and beautifully displayed. I wanted to buy everything in the gift shop! Sorry we were not here at lunch time -- I'm sure the food would be good.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Great Museum for all things Asian", "I've been to the museum several times since I have a friend who is a docent. I highly recommend taking a docent tour as you will get so much more out of it. Give yourself plenty of time to soak up the riches of the artifacts and art then stroll over to City Hall where you will witness many brides and grooms before or after their ceremonies.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Starts with India--ends with Japan", "And in the middle is my favorite art: Korean. This museum is beautifully curated; spend time looking at each detail or simply walk the rooms feeling the ambience of each featured country's art. There is a surprise around every corner."], ["Reviewed August 24, 2017", 5.0, "Magnificent Collection!", "The Asian Art Museum is a major attraction, when in the city! I have seen the collection and have been here during the Black and White Ball! A MUST SEE!!"], ["Reviewed August 17, 2017", 1.0, "A real disappointment", "Large museum that contains many articles BUT - it is organized for - maybe- research , not for visitors . Explanations are limited and very difficult to follow - too much focus on China"], ["Reviewed August 11, 2017", 5.0, "A mysterious Asian art experience", "It was a wonderful experience.\nActually, I am Asian, but I did not have a chance to experience other cultures other than South Korea.\nI have found many things in common here.\n\nAnd the museum is neatly organized as a whole.\n\nEveryone is a place worth visiting.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Almost missed this little artist gem", "We walked by and saw this was open and spent well over an hour strolling through this extravaganza of oriental art. The pictures were huge, colourful and talented. There were delicate colour wash prints and vivid in your face pictures. The sculptures and other works of art were equally amazing. We thoroughly recommend a visit\nShow less"], ["Reviewed August 9, 2017", 5.0, "A hub for thousand of years of Asian Art in a fresh display", "The Asian Art Museum is a delightful visit for all Asian. It encompasses the antique and the modern. Generally there is a wonderful moving exhibit on the first floor. San Francisco si my home and I don't ever miss any of their temporary exhibits. Then I go to the upper floors and walk through several of the rooms they have with the permanent collection. I end with a Asian-infused snack or a green tea in the café. The latest exhibit, Flower Power had an interactive portion in which you picked a flower and would give it to someone out in the street. A beautiful gesture of compassion and generosity and something odd to do.... this is the kind of forward-thinking of curators in this museum. You will enjoy it! OH! and include time for the store.... it is very curious and entertaining as well.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Interesting and intense!", "The Asian Art Museum has been one of my favorites for many years. It houses an incredible collection of Asian Art from graphics, ceramics, clothing, paintings ... you name it they probably have it! Also free docent tours throughout the day. Visitors are advised to check their website in advance.\nShow less"], ["Reviewed August 8, 2017", 5.0, "time at the asian art museum", "i have been doing volunteet work at the gift shop for about 8 years. that is a wonderful eexperience. of course. the main attraction is the permanent collection as well as the different shows that they have deom different countries all over the world. even if you are not a big fan of asian art , it is still\nworth visiting, holly huebel.\nShow less"], ["Reviewed August 8, 2017", 5.0, "The best in Asian Art", "Since the Asian Art Museum moved into its current building in San Francisco's Civic Center in 2003, the breadth and quality of its exhibitions and collection have risen to new heights. In addition to centuries of great classical Asian art, a strong emphasis on contemporary art is present in all of the Asian countries it represents. With top docents who give stimulating tours all the time plus special programs for young children and young adults, this museum is no longer in the shadow of San Francisco's other museums. A visit here is a must for everyone.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Stunning!", "The second and third floors exhibits are marvellous and in many respects quite overwhelming. What is really impressive is how the museum has laid out different countries of Asia, and moving from one to another really shows the difference in their art and culture. I was pleasantly surprised by some unique and rare pieces that I had never seen in any other American or Asian museums. The Asian Flowers exhibition on the ground floor was underwhelming, especially after having spent the last couple of hours gazing at the most amazing Asian art work!\nShow less"], ["Reviewed August 1, 2017", 5.0, "Must see for Asian art lovers", "Spectacular collection of which a third came from the private collection of Avery Brundage. Well organized and labeled. I like that the museum notes that culturally speaking, there is no Asia. It's a term used to describe a geographic area, but the countries of Asia have distinct and unique cultures. The galleries are on the third and second floors of the building with special exhibits, the cafe, and museum store on the first floor. There are portable chairs available at various locations. One could spend hours here, but I do recommend a minimum of two hours for a visit. Pity about the neighborhood; there are lots of homeless people around and the streets reek of urine.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Beautiful and fascinating museum", "This was an excellent museum! Our family just let ourselves immersed in time here at the museum.\nMay be I liked here better then MOMA.\nMuch cheaper but excellently kept up.\nMust go museum!\nParked at Civic center garage which was underground parking across the park. We went on Saturday around 10 am. No problem parking. Then took Lyft to go to MOMA and came back with Lyft again.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Cultural gem", "Go just to look at their collection from different asian civilizations. Beautiful and moving, carefully collected and documented. Priceless."], ["Reviewed July 28, 2017", 3.0, "A fascinating selection of art - mostly Asian", "A fascinating selection of art - mostly Asian, yet a surprising amount of western European art. Loved the jade collection."], ["Reviewed July 26, 2017", 5.0, "A Pacific Rim Treasure you'll want to enjoy.", "This museum is a visual reminder of all the treasures which come from our neighbors across the Pacific Rim. The exhibits are visually stunning."], ["Reviewed July 26, 2017", 4.0, "Asian culture", "A big museum that has a lot of collections of east Asian artifacts. They are grouped by country and there are three stories in total. If you like history and east Asian culture this might be for you."], ["Reviewed July 24, 2017", 5.0, "Terrific Collection and Helpful Explanations", "Very interesting museum that does a better job than other museums in explaining Asian art, history, and symbolism. Describes how the various cultural heritages are related through art."], ["Reviewed July 22, 2017", 5.0, "Terrific place if you like Asian art", "This is in the old post office building right near city hall. Beautiful old building and a terrific museum. I have been here several times. There are some really great things here - jade, pottery, Chinese brush paintings, sculpture, etc. The Indian sculpture is a favorite of mine. I wouldn't take any kids younger than teenagers - they will be bored quickly. Take note that this is the edge of the Tenderloin district in SF. There are A LOT of homeless people around. Stay on big streets when you are walking. These are what I call \"active homeless people\" - they are up moving around, waving their hands, etc.\nShow less"], ["Reviewed July 20, 2017", 5.0, "A good window in to the Far East", "Both permanent and temporary exhibits here are impressive. The museum is an architectural icon, located in the same vicinity as the SF opera house, Davies Symphony Hall, the City Hall, etc., and it holds its own with these other great buildings. The little cafe offers delightful cafeteria-style service of Asian cuisine, freshly and artfully prepared, and there is indoor and heated outdoor seating. We saw the Terracotta Warriors exhibit - breathtaking display. Gift shop is nice, too.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Fantastic collection of art!", "This museum has a fantastic collection of Asian art with pieces that date back 2000 years. Displays are beautiful with easy-to-read descriptions. Highly recommended visitors take 1-1/2 to 2 hours to thoroughly appreciate the exhibits."], ["Reviewed July 18, 2017", 5.0, "Four Hours Well Spent in a Unique Collection", "We had had several strong recommendations for this museum and were pleased to find them all accurate, leading us to visit just about every room in the place. It is in East and South Asia that their collection is the strongest. A surprise delight was a special exhibit about the Sikh culture, about which we knew little despite both of us have Sikh-American friends. Our only disappointment was that some of the labeling of the exhibits was sketchy and not as informative as we would have liked.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Wonderful Collection", "Besides Chinese and Japanese art. There are pieces from Southeast asia, India, Korea. There are also special exhibitions for additional price too."], ["Reviewed July 13, 2017", 5.0, "Heritage for Generations", "Situated across the street from City Hall of San Francisco, the Asian Art Museum would be a great place to visit for anybody interested in the world's history. The building is magnificent with columns and stairs underlining architectural style. Once you are in, please be prepared to discover many interesting facts about culture and traditions of this region of the world. I would strongly recommend \"Tours of the Collection\" or tours for a specific region (Korea, China or along the famous Silk and Spice Routes). At the end, you certainly will feel satisfied and enriched with amusing knowledge!!!\nShow less"], ["Reviewed July 11, 2017", 5.0, "best asian museum in the count", "this beautiful museum is home to three floors of asian artifacts from India, China , Korea and Japan exquisite old before eBC in many cases The exhibits are well displayed with plenty of room to wander in wonder"], ["Reviewed July 11, 2017", 5.0, "Convenient", "The coat check takes luggage which is convenient for a traveler to visit the museum and explore the neighborhood by foot. Not a huge collection but there are some gems in the pottery section."], ["Reviewed July 10, 2017", 5.0, "If Asian Art is of interest, this is the place -- all types, lots!", "I loved my visit to the museum. It was fascinating in its variety and breadth from ancient to contemporary. All of Asia is covered and it is definitely thought provoking to see all of the collections there. It rivals those I've seen in NYC and Washington, DC. Worth a visit if you love art and cultural artifacts. The markers on the wall were well done -- clearly written and interesting.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Doing the Tourist Thing", "I actually live in San Francisco. I've never visit the museum until last month. I pretty much spent the whole day there. Lots of interesting artifacts dealing with Asian culture and the history that accompanies each artifact. If you're a history enthusiast especially the asian culture, this is for you\nShow less"], ["Reviewed July 10, 2017", 5.0, "Beautiful museum", "If you are an art lower, treat yourself to this beautiful experience. The museum is very extensive and you will need quite some time to explore its many exhibits."], ["Reviewed July 10, 2017", 5.0, "WOW WOW WOW", "This is a must see in SF. It was actually our favorite event of the entire trip. Try to go early when they first open to get to see everything."], ["Reviewed July 10, 2017", 5.0, "Impressive collection of Asian Art", "This museum has one of the best collections that we have seen outside the Asian continent. Well organized and easy to navigate. Finish your visit with a cup of tea at the cafe."], ["Reviewed July 10, 2017", 5.0, "Underappreciated Gem in the Heart of the City", "Don't be deceived by the name: this place is great for history buffs as well as art enthusiasts. When I was a high school history teacher, I made two field trips with students to the Asian Art Museum: one during the Maharaja exhibit and one during the Terracotta Warriors exhibit. Both exhibits were visually stunning and were presented with rich historical details and context. The docents that led our tours were outstanding as well. On both occasions, we had a bit of extra time to look around the rest of the museum, and both times I was left wishing we could stay longer. There is so much to see among the regular exhibits alone, not to mention the wonderful special exhibits. The building itself is also beautiful. It used to house the main branch of the city's library (now around the corner) and was remodeled by an Italian architect before the museum, formerly part of the de Young Museum in Golden Gate Park, moved in. The end result is exquisite. I would highly recommend the Asian Art Museum as one of the better museums in San Francisco.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Excellent art museum", "Being an artist myself i had to go see it. The art displayed was beautiful. Some ancient pieces in there. A beautiful exhibition."], ["Reviewed June 28, 2017", 4.0, "What a wonderful place to see", "This was an amazing experience. It has an extensive collection. We took one of the guided tours. It was 1.5 hours long and only covered one of the floors of the museum. I did not go into the special exhibit on \"Flower Power\" but those who did said it was definitely worth the extra price. I was amazed at the collections of Buddhas and as this was a group tour of \"All things Buddhist in the Bay\" it was perfect for our tour. I will definitely go back to see parts of the collection I did not get to see. Give yourself at least 2-3 hours for this place.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Great Collection!", "It has a nice collection of Chinese artwork as well as many other Asian countries. There is also a farmers market next to the museum on Sunday noon time which has many local produces as well as food vendors. Combine the two will easily give you a nice afternoon.\nShow less"], ["Reviewed June 27, 2017", 4.0, "Many good exhibits", "They often do not have enough items for display so they do fill-ins with videos or posters. This is a bit disappointing at times."], ["Reviewed June 26, 2017", 5.0, "Premiere Asian Art", "Located near Civic Center, this collection is one of the premier collections of Asian art in the world. The museum is spacious and quite accessible. As an added bonus, it is easily accessible via BART or Muni via the City Center station and there are street markets with very fresh products several times a week.\nShow less"], ["Reviewed June 24, 2017", 5.0, "GORGEOUS", "I was able to check out \"A Billion Buddhas: The Awakened Cosmos of Himalayan Buddhism.\" What an informative and inspired exhibit. I received a visually stunning education. I also thoroughly enjoyed the ceramics."], ["Reviewed June 14, 2017", 5.0, "Love Chinese Cermaics", "The museum features magnificent Asian art. My favorites are the Chinese ceramics. It also hosts special exhibitions that are always worth seeing."], ["Reviewed June 14, 2017", 5.0, "Beautiful museum!", "Love the displays of Asian art - Japanese, Korean, Chinese. Plus we had a nice snack in their cafe and loved the gift shop."], ["Reviewed June 9, 2017", 4.0, "Very good museum", "We stumbled across this one but we're glad we did. As usual with museums, we ran out of time. It's not free, unlike excellent museums in London and it's not the British Museum but it's a little gem and worth a visit (and more time than we could give it). There are some fascinating exhibits and a media/audio guide is included. The way the place is set up is also very good and it flows. There is a cafe and restroom and a shop. There are also exhibitions at various times.\nShow less"], ["Reviewed June 1, 2017", 5.0, "One visit probably not enough.", "A well laid out selection of Asian Art which frankly is too much to take in on one visit. There are some exquisite pieces. The location is handy and the building - a former library - is rather special. Take a break in the modest cafe which offered good food.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Fantastic museum with an interesting permenant collection and excellent exhibits", "I love visiting art museums, but I have to admit to being somewhat ethnocentric in my tastes. However, I decided in San Francisco to explore the Asian Art Museum on a recent trip, and I feel that I really learned a lot as it relates to \"Asian\" art in the Buddhist tradition. The museum was quick to explain that \"Asia\" is not one, but many diverse, cultures, and the collections walk the visitor through different regions and eras. There were so many carvings from stone of Buddha and other divinities that they began to blend together for me. Please don't read that to mean that this was not impressive - they were the most interesting, unique art pieces I have seen. The exhibit when I was there was about Tombs of China's Han Dynasty, and it took up three exhibit halls - it was well organized and the placards were all informative without imposing clear ideological judgement. I really enjoyed our time here, and I estimate that we took about 3 hours to complete the entire museum at a slow pace, reading most of the exhibits until we hit a saturation point on the second floor. However, the special exhibit renewed our interest, and we were happy to have chosen this attraction for our one day in San Francisco.\nShow less"], ["Reviewed May 31, 2017", 4.0, "The Art Variety of Asia", "I love that there was art from India and other countries and indigenous cultures of Asia. There are multiple floors with a wide variety of art. There is a hall for live performances."], ["Reviewed May 31, 2017", 5.0, "Great Place To Spend Some Time", "We went there to see their Japanese basket exhibition which was quite amazing and stayed to see their extensive collection of porcelain. Lots of other interesting exhibits."], ["Reviewed May 31, 2017", 5.0, "Beautiful collection.", "Look for the Chinese snuff bottles. The museum store is a gem. New location next to the Civic Center."], ["Reviewed May 30, 2017", 5.0, "Excellent permanent exhibits and great visiting shows", "We mainly went to see the special exhibition \"Tomb Treasures: New discoveries from China's Han dynasty.\" We had previously seen a similar show at the Fitzwilliam Museum in Cambridge, UK, and were delighted to note that most of the objects on display were different. It was an excellent show, After seeing it we wandered for short while in the Chinese galleries to see related objects.\nShow less"], ["Reviewed May 29, 2017", 4.0, "Educational and interesting", "Good museum, interesting exhibits, okay priced. Definitely a good fit for San Francisco. Allocate 2-3 hours. Good value."], ["Reviewed May 24, 2017", 5.0, "INTERESTING, EDUCATIONAL AND VERY ENJOYABLE", "This museum is exceptional with terrific pieces to see and learn about. The place is clean with a great friendly staff an outstanding art work."], ["Reviewed May 23, 2017", 4.0, "Very Nice Collection", "Very nice museum to learn about Asian history, religion, and art. We did it at a medium pace in about 3 hours but one could certainly spend more time."], ["Reviewed May 22, 2017", 5.0, "A must see", "I'm fortunate enough to have been able to see their permanent collection frequently enough that I now only visit for their special, temporary, exhibitions.\n\nBut if you haven't been before, you can spend the better part of a calm, peace-filled, day browsing the inspiring permanent collection and hanging out in the many zen spaces of this great smaller museum.\n\nFun fact, this building was SF's original public library.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Quality and Art Combo", "I really enjoyed this wonderful museum and would recommend it to all people who live or visit San Francisco. Try to time your visit for a guided tour since the volunteers guides are both knowledgeable and approachable."], ["Reviewed May 20, 2017", 4.0, "Pretty museum", "I used to hang out here on weekends to study because it was our former main library and I loved the wide, big staircases. It's now a museum with Asian arts and we come here periodically when they have special exhibits. As DeYoung Museum members, we have reciprocity to the Asian Arts Museum but special exhibits will cost extra.\n\nWe came for the Chinese exhibit in January and it was pretty good.I liked that they decorated the front of the museum for the Lunar New Year. Some of the older collections upstairs used to be housed at the old DeYoung Museum as I recognize many of the pieces when our parents or school field trips would take us to the DeYoung, especially the Avery Brundage collection. Sadly, as I got older, I learned that altho' Avery Brundage was an Asian Art collector, he was also a Nazi sympathizer and womanizer with kids out of wedlock.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Comprehensive", "The common word in many reviews is comprehensive, and that really captures the essence of this museum. It is moderate in floor space but densely packed with exhibits. It is old-style curatorship with small lettered panels and numbered artifacts, 1960's in appearance. But a vast collection with insightful explanations. I learned the differences in religious beliefs, practices, and artistic expression amongst Hindu, Buddhist, Sihk and others religions, as well as regional variations such as Buddhism in Japan compared to Cambodia. I learned Asian history. I appreciated diversity in cultural values. No other museum I have seen has this extensive and diverse a collection of Asian art - including my trips to Japan and China. Plan on 2-3 hours minimum and don't miss the café. A must-see museum for aficionados.\nShow less"], ["Reviewed May 18, 2017", 5.0, "World-class collection of art from the Asian world", "To this newcomer to San Francisco, the city’s Civic Center Plaza came as a magnificent spacious surprise, dominated as it is by the imposing white Grecian façade and golden dome of the City Hall along its west side. Other grand buildings front onto the Plaza – the Civic Center Auditorium to the south, the San Francisco Public Library on the southwest, and opposite it, on the northwest side, the Asian Art Museum. The building – the former city library – looks all of a piece with the others, but in fact the century-old façade is a mere shell, everything behind it being designed and opened within the last 20 years, the museum contents having been relocated from former premises shared with the De Young Museum in Golden Gate Park. There’s something curiously appropriate in the reticence of the interior design. Very little art is immediately visible as one enters the broad reception area. To seek it out you have to pass down the right-hand side of the foyer and then either visit the special exhibition area tucked behind the extensive gift shop or head on up an escalator to the permanent galleries. These are U-shaped on plan, with the arts of Japan (including a reconstructed tea-house that sadly doesn’t actually function as such), leading to Korea and the last thousand years of China on the second floor, and then on the third floor sequentially the older treasures of China, South Asia, the Persian World and West Asia, Southeast Asia, and finally the Himalayas and the Tibetan Buddhist World. Of course many visits would be needed to really soak up the Asian Art Museum’s treasures, but even one visit is sufficient to grasp the vast range of visual styles, uses of materials, and aesthetic, temporal and spiritual preoccupations of the myriad artists from this great swathe of the world over the last six millennia. And the museum layout helps so much in keeping at bay any feeling of cultural overkill, leading you tranquilly from room to room to room, with plenty of occasional benches to stop and gather breath. There are no grandiloquent spaces to overwhelm and confuse, just a signal case of sensitive architecture serving its purpose. A model museum.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Outstanding", "Three floors of exhibits and the most comprehensive collection of Asian art.\nIt will take two to three hours if you are interested in reading and seeing the entire exhibits throughout the museum.\nThere is a wonderful cafe, too to sit back have lunch, snack, beverage and relax.\nThe staff are very helpful.\nShow less"], ["Reviewed May 17, 2017", 5.0, "A TOUR OF ASIAN HISTORY IN SAN FRANCISCO", "This museam is a priceless treasure of the City of San Francisco, that display Asian cultures/history and primariy art, that lies across the Pacific pond.\nNot to be missed if you wish to see some great Art and learn more history of these interesting cultures. .\nShow less"], ["Reviewed May 16, 2017", 4.0, "Amazing small museum", "A quick visit with a lot of content beautiful pieces but still at a small size so that you can enjoy other nice things within the same day. The only sad part is the homeless people around the building and in general area of the civic center\nShow less"], ["Reviewed May 14, 2017", 5.0, "Impressive", "Great museum. We have been to many art museums but never seen such an extensive collection of Asian art. The special Han Tomb exhibit was especially interesting."], ["Reviewed May 14, 2017", 4.0, "Asian ArtcMuseum", "We especially enjoyed the Han Dynasty Tomb Treasures special exhibit. The approach to ensuring immortality was reminiscent of the ancient Egyptians."], ["Reviewed May 11, 2017", 5.0, "wonderful comprehensive collections in a stunning building", "Asian always has something we are interested in- and the space itself is spectacular. Saw a very fine exhibit of contemporary Japanese ceramics from some of the new generation of female and male potters, in galleries surrounding by superb older japanese arts. Restaurant has fresh and very good food in a nice setting.\nShow less"], ["Reviewed May 4, 2017", 5.0, "Fantastic museum", "I loved this museum. It had great artifacts from all over Asia! The gift shop had beautiful things too."], ["Reviewed May 3, 2017", 3.0, "Impressive but Quite Dry", "This museum has amazing exhibits. However I found the presentation dry and hard to get into. This is a good place to visit if you have a specialist artistic or cultural interest."], ["Reviewed May 3, 2017", 5.0, "Some beautiful art", "There was some beautiful art in this museum, and I spent hours going through the various exhibits. It would have been worth it for me just to see the pottery exhibits--breathtaking!"], ["Reviewed May 2, 2017", 5.0, "The New World Meets the Old One", "Geographically, we Americans inhabit the New World. Culturally, we benefit from an introduction to those older ones when we travel west to the Far East. Asia, whether China, India, or Malaysia and beyond, has much to teach. San Francisco's Asian Art Museum is a beautiful and exciting place to begin. Year after year, exhibition following exhibition, it introduces us to a wider world while teaching us new ways of contemplating our own. Every time I visit, I come away reborn.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Always a Wow Factor", "A favorite for decades, this museum never fails to impress or inspire with wonderfully curated works of ancient arts (this time around, works from the Han Dynasty, China). Even the gift shop is a delight of artifacts and even books to behold."], ["Reviewed April 28, 2017", 5.0, "Hidden gem", "Over $100 million USD was spent to open this Asian Museum. Have all the Asian culture arts. Huge seminar halls. Once a month there is a free day, and sometimes sponsors have a free day. No free parking. Homeless people is a problem all around."], ["Reviewed April 28, 2017", 4.0, "Good Overview of Asian Culture and History", "I highly recommend this for people who intend to visit Asia. The exhibit gives a good overview of Asian culture and history."], ["Reviewed April 28, 2017", 5.0, "Wonderful Exhibits from all over Asia", "Along with the numerous exhibits, the architecture is wonderful. Sometimes I wonder what I enjoy more, the exhibits or the architecture."], ["Reviewed April 24, 2017", 5.0, "Great museum", "This is a great museum of Asian art. It is well organized so that you can see all of the exhibits. Exhibits are well displayed with informational postings. Each item is a gem. I loved that the ancient was displayed with the modern. After all art is throughout the ages!!! A really fun museum.\nShow less"], ["Reviewed April 19, 2017", 5.0, "Great exhibition of Chinese tomb treasures", "In addition to its vast and magnificent collection of artefacts from all parts of Asia, which is superbly organized, during my visit there was a very interesting exhibition of the treasures from the tombs of Chinese emperors."], ["Reviewed April 16, 2017", 5.0, "The Most Impressive Asian Art Museum Outside of Asia!", "I love this museum and I go back time after time! They usually have an interesting special exhibit, memorable ones include the Ramayana told in multimedia and the Emperor's Treasurers. You get the chance to see things that are normally never taken out of Asia.\nI also like to walk around the general exhibits and see thousand year old sculptures of gods in the Indian and South East Asian rooms, and great porcelain and statues in the Chinese rooms. I have yet to have enough time to go through the special exhibit and all of the regular galleries. It's that big.\nThey also have a great gift shop with hard to find books, great crafts, and toys for kids. Great place for buying gifts as well as books for yourself to learn more about cultures from different parts of Asia.\nFree days once per month on the first Sunday, and free entrance for anyone with an american express card every weekend (I think).\nIt's also in a great location. You can walk outside and see city hall, and the large open grounds in front of it, where there are often festivals and fairs happening. Then walk up the hill to eat Vietnamese food in little saigon and grab some bubble tea!\nShow less"], ["Reviewed April 14, 2017", 5.0, "Beautiful museum", "Visited this museum with college students. It is a lovely building with fantastic exhibits and often has shows."], ["Reviewed April 14, 2017", 4.0, "Where else are you going to find this kind of stuff?!?!?", "Did you know the idea of Asia is a European notion? You will learn so much and be so dazzled by this collection it could well be the highlight of your visit. The building is the old Main Library which has a new(er) place on the next block. And, this museum has one of the more imaginative gift stores, second only the SF Modern Museum of Modern Art.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Amazing Asian Art Oipportunity!!!", "Avery Brundage of Chicago donated his entire Asian Art collection to San Francisco for a standalone art museum! It is an amazing collection and the only one of its type in the United States. A must see in San Francisco! While the special exhibits are always interesting, the Brundage collection is amazing and one that will amaze on any day!\nShow less"], ["Reviewed April 11, 2017", 5.0, "Fascinating collection", "The collections are interesting and beautifully laid out. The docent tours (we have been on two) were entertaining and informative. The building itself (the old SF public library) was very nicely retrofitted, creating light filled, dramatic- but inviting- main spaces. [Exhibit areas have very controlled lighting to protect the pieces on display.] The cafe has a small, but interesting menu and, of course, exit through the gift shop!\nShow less"], ["Reviewed April 9, 2017", 5.0, "1st Sunday of the month Free Entry!", "We were lucky to have been visiting on the 1st Sunday of the month which meant free admission except the special exhibit! Japanese, Chinese, Korean, Persian and more... If you enjoy the Asian culture you will truly enjoy this museum. Need about 2 hours to do it justice and there is an Asian restaurant inside which we didn't try but looked nice. Great gift shop as well. Highly recommend.\nShow less"], ["Reviewed April 9, 2017", 4.0, "Ai Yah! Remarks re Han Dynasty Special Exhibit", "Our family of 1 tween, 1 teen, and 3 adults visited the museum today to view the \"Tomb Treasures\" from the Han Dynasty (on view through May). Overall, it was a spectacular exhibit and featured exquisite jade, gold, and bronze figurines and common items (like cooking vessels and lamps) that the nobility used. There were also short videos explaining and demonstrating the types of weaponry and forms of entertainment during the Han dynasty. It was mind-boggling to realize that for an ancient civilization existing before AD even began, the nobility had intricate musical instruments and even wine containers. The reason I'm giving this exhibit 4 stars instead of 5 stars is because in the third room, I inwardly screamed \"Ai Yah!\" (Yikes in Chinese). I was SHOCKED that they had sexual toys on display. Shocked that they used these sort of things back then but SHOCKED that I had to think about whether I wanted my children to view such things and ask me questions about them. Instead I chose to tell them the third room was off limits. So parents, I just want to warn you so you won't be shocked like me.\nShow less"], ["Reviewed April 8, 2017", 5.0, "Incredible! Kicking myself for not visiting sooner", "Took two college students here. I am a Bay Area native and was kicking myself for not visiting here ever. Incredible place. Loved the current exhibit. Done beautifully. Convenient parking at moscone center underground parking garage. Lots of homeless around so don't recommend at night. Restaurant in museum had delicious food. Make sure you visit if in San Francisco.\nShow less"], ["Reviewed April 6, 2017", 5.0, "Rainy afternoon at the Asian Art Museum", "The weather outside is dreary. Today is the perfect day to spend in a museum. I started with lunch in the museum cafe. Today I ordered crispy orange chicken with rice, Thai ice tea and (unable to resist dessert), a slice of apple crumb pie. As always, the food was delicious . I have eaten here often and have never been disappointed. I've already seen the tomb treasures exhibit so my plan is to just wander through the other galleries and enjoy various exhibits.\nShow less"], ["Reviewed April 3, 2017", 5.0, "I could have spent all weekend here", "I loved every little detail here. Would love to visit again someday. It was breath taking and beautiful."], ["Reviewed April 1, 2017", 5.0, "A new Chinese exhibition", "An interesting exhibition of burial accessories of the Den Dynasty from 200 BC. Enjoyed it very much. The Japanese exhibition is interesting as well."], ["Reviewed March 29, 2017", 5.0, "This gem is often overlooked by tourists", "This museum touts an array of antiquities, housed in our old stunning public library. Don't miss the jade snuff jars and sculpture, so small and intricately detailed!"], ["Reviewed March 29, 2017", 5.0, "S.F. Significant Asian Art through History", "Originally located in Golden Gate Park as part of the de Young Museum, the Asian Art Museum is now housed in the old San Francisco Library building, part of Civic Center and right across the courtyard from the new library. Beautiful asian art and artifacts, many pieces from the collection of Chicago millionaire Avery Brundage, housing one of the most comprehensive Asian art collections in the world. Some pieces (part of the Museum's permanent collection) are as much as 6,000 years old. A must see if you're in S.F., along with the Library!\nShow less"], ["Reviewed March 26, 2017", 5.0, "Chinese, Japanese, Korean and South Asian art and Great visiting exhibits", "The San Francisco Asian Art Museum is a great museum in a convenient location right downtown, near the Civic Center public transport and City Hall buildings. They have a great permanent collection and exciting visiting exhibits. We had a light lunch from a food truck on sitting on the steps right in front of the museum.\nShow less"], ["Reviewed March 21, 2017", 5.0, "Magnificent museum with gorgeous Asian sculpture, painting and artifacts", "I stop in here every time I am in San Francisco and it never disappoints. This time I struck the jackpot with a travelling exhibit displaying the bounty from a Chinese royal tomb. The cafe is delightful and open late - until 8:00 - Thursdays."], ["Reviewed March 21, 2017", 5.0, "A gem!", "SF's Asian Art Museum houses treasures from all over Asia, beautifully presented and thoughtfully curated. The building uses natural light, when appropriate, giving it an open, spacious feel. Many of the collections are truly breathtaking--I especially enjoyed some of the Chinese sculpture, Japanese textiles and bamboo weaving, and the art of the Himalayas. We visited on a weekday, sharing the space with several school groups; even with all that 'traffic,' it had a serene feel. I would allow at least several hours to get a quick review of the major offerings; more careful study would take repeated visits. Of note: we walked from our SOMA-area hotel, but I would recommend taking a cab--the area a few blocks past the museum is less than savory.\nShow less"], ["Reviewed March 19, 2017", 5.0, "Wonderful collection", "The museum is in a former SF city library which was converted to host the collection. It's best to take either escalator or elevator to the top and view the collection from top floor down. First floor consists of a cafe, a museum shop, and temporary exhibitions. The museum is on the smaller size thus an easy stroll through for one afternoon. Nice collection. Wish they have more space to exhibit more of the collection.\nShow less"], ["Reviewed March 18, 2017", 5.0, "One of my favorite museums in the world", "I go here every time I visit. Wonderful exhibits- always changing- and one of the best gift shops every, anywhere. Very tempting and always at least partly synced with whatever the main exhibit is. Often they have artizans and spontaneous programs in the halls- a wonderful place- always aesthetically inspiring.\nShow less"], ["Reviewed March 14, 2017", 5.0, "Visit to see treasures from Asia", "This museum contains many beautiful & treasured museum pieces from different countries in Asia. There is always a special exhibit that comes with admission price; no separate fee to see these exhibits. My last visit was to view the Emperor's treasures, with famous pork belly stone. The museum was the original SF Main Library until the current SF Main library was built a block away. This building allows more exhibit space=more pieces to be viewed and enjoyed. The gift shop is brightly lit and nice to browse thru. Restrooms are clean. There is a small cafe on the first floor. Tip: on Thursday's at 5pm, the admission is $5.00, allows one to enjoy the museum until closing at 9pm. What a deal!\nShow less"], ["Reviewed March 9, 2017", 5.0, "A must see!", "The Asian Art Museum was fantastic. They currently have a spectacular exhibit on Chinese Tomb Art. Make sure that you take a guided tour (free with admission) to ge the most of the display. We enjoyed it so much we reviewed the exhibit again on our own before taking a lunch break in the cafe. The food was fantastic and reasonably priced. We spent the next few hours exploring the museum collection. It was an incredible day out of the rain.\nShow less"], ["Reviewed March 4, 2017", 5.0, "Great Collection", "Among all art museums I visited in SF, Asian Art Museum is the most iconic and has the most comprehensive collection. I am just wondering, how they manage to have so many ancient collections from foreign countries."], ["Reviewed March 3, 2017", 5.0, "A gem in a rough neighbourhood", "Although the area we had to walk through to get to the museum was scary, the museum itself felt safe. There were many exhibits, all fantastic. My 15 year old got a bit restless. We took many photos( no flash)."], ["Reviewed March 1, 2017", 5.0, "Great Exhibits", "My husband and I have been members since the opening of the Asian. We love the special exhibits, such as the treasures from the Taiwan Museum, the Larry Ellison on loan of his Japanese art. The permanent collection also represents the art and history of many Asian cultures. The museum store reflects the Asian treasures and has a nice collection of art books and music. The museum restaurant has a very efficient service. The food is delicious.\nShow less"], ["Reviewed February 25, 2017", 4.0, "Relaxing and beautiful", "Nice place for 3-4 hours. Three big floors with good representation of art styles and artifacts of different regions. Special exhibit was the tombs of china and was fascinating. Use your KQED membership to get in free when it's offered."], ["Reviewed February 24, 2017", 5.0, "Excellent and extensive collection", "This museum does a wonderful job displaying beautiful art from all over Asia. Works from Iran to Japan are showcased. We enjoyed the Tomb Treasures exhibit from the Han dynasty in China. Well worth spending a couple of hours here."], ["Reviewed February 23, 2017", 5.0, "Very Unique Museum", "This is a very different collection. Would definitely recommend visiting and paying the extra $ to see the Tomb Treasures exhibit if it is still available."], ["Reviewed February 22, 2017", 5.0, "asian art", "Wonderful art from China, Japan, and all over Asia including India. I would got back, a must see. Great place to see art from modern to ancient times."], ["Reviewed February 18, 2017", 5.0, "Great Museum!", "My wife and I visited on a whim while we were in San Francisco. We were floored by how large, varied and impressive the collection was. There was no special exhibit at the time of our visit. We just went through the main collection. It was well laid out and fascinating. It really gave us an appreciation for the variety and beauty of Asian art. We plan to visit again.\nShow less"], ["Reviewed February 17, 2017", 5.0, "Attended preview exhibit \"TOMB TREASURES", "As usual, the exhibition was well curated, a manageable size and interestingly displayed. Asian Art Museum Staff are quite knowledgeable and eager to share their passion for Asian Art. A jewel!"], ["Reviewed February 16, 2017", 5.0, "A great specialty museum!", "As always, it was a pleasure to visit San Francisco's Asian Art Museum at the Civic Center Plaza. The museum has a very complete and diverse collection of art from China, Japan, India, Korea, Indonesia, Pakistan, the Himalayas, and other Asian countries, including stone works and bronzes, large and small, ceramics, textiles, jade, glass, puppets, and other art forms. The museum's special exhibitions are always top notch. I attended the opening of the excellent new Tomb Treasures exhibition from the Han Dynasty of China, over 2,000 years ago. The building itself is beautiful, the former Public Library, I believe. There is also a fine cafe at the museum, featuring Asian dishes, which is a nice place for a tasty lunch or snack. If you have any interest at all in Asian arts, this museum is a winner!\nShow less"], ["Reviewed February 15, 2017", 5.0, "Big museum lots variety", "Pros: Big museum (3 floors) across plaza from city hall. Variety of statues, pottery, paintings, armor, etc. Many over 1000 years old, all from Asia (India, China, Japan, Korea). Public restrooms. Free admission 1st Sunday of the month. Con: must pay to park."], ["Reviewed February 15, 2017", 5.0, "Awesome place to take a date", "They have Thursday night $5 special entrance for the younger crowd. Really awesome collection of asian artifacts. I live right next to it and often take friends who visit me there."], ["Reviewed February 14, 2017", 5.0, "Right up there with the Musee Guimet in Paris.", "Internationally known, this museum is welcoming and user-friendly. The encyclopedic collection encompasses Southeast Asia, India, China, Japan,a little of the Middle East, and Korea, spread across three levels, beautifully displayed. It used to be housed in a wing of the de Young Museum in Golden Gate Park, but about ten years ago moved to the city's former main public library, a Beaux Arts building across from the Civic Center. You can still see the grand staircase of the old library with wonderful art-related quotes high on the walls. A delightful contemporary Chinese sculpture, \"Suspended Letters,\" at the top of the staircase takes its inspiration from some of the quotes. The audio guides as well as the written material in the museum gives a lot of helpful and engaging information, including legends and history. We thought we knew the \"basics\" yet got a lot of Hindu gods sorted out and are now much better readers of Buddhist symbols! We took a break from the galleries and had lunch at the Cafe Asia on the first floor. Despite being a \"cafeteria,\" the room is serene and a pleasant place to recharge. The menu is limited but everything looked good. I had an excellent chicken coconut soup and my husband had a sweet pumpkin curry--although both were delicious and beautifully presented, they were enormous portions we couldn't finish. Each black molded table had one or two fresh yellow calla lilies in a gourd-shaped vase and small potted palm trees created separate seating spaces in the room, making it feel more intimate. Had we been in San Francisco longer, we would have returned a second day; the museum isn't huge, but the collection was too much for us to absorb in one visit.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Fine art in a fine setting", "The Asian Art Museum's collections are amazing, refined, and beautiful to behold. You cannot miss with this experience, so take your time and truly savor all the galleries. Then take time for tea, snack or lunch in the cafe."], ["Reviewed February 13, 2017", 3.0, "Place to visit if you are into Asian art", "It exhibits various items from Asian countries, and sometimes, hosts special exhibits from some Asian countries. If you are into Asian Art, and into Art History, this is worth the visit"], ["Reviewed February 13, 2017", 4.0, "A Gem of a Museum", "Formerly the San Francisco Main Library, the building houses (for several years now) the Asian Art Museum, which had been located in Golden Gate Park, next to the deYoung Museum. While convenient to the other attractions in the Park, the old museum was in need of extensive upgrades, and took advantage of the library's move to a new home. It's helped revitalize the City Hall neighborhood.\n\nThe building itself is beautiful and has a lot of natural light, especially on the upper floors. The special exhibits are usually on the ground floor, and are usually very good and well-curated. For children, there are storytellers who will delight them with tales from the Silk Road, Chinese mythology, or a number of other subjects (check their website for the schedule). The permanent collection is extensive; I wish the museum were bigger so more could be on display. At the top of the central stairway is a large hall for concerts and other performances. It's beautiful, but the acoustics are terrible (lots of echo). It could do with some hanging tapestries to make the room a little less live. All in all, I highly recommend a visit.\nShow less"], ["Reviewed February 6, 2017", 5.0, "Good introduction to Asia", "This Museum has collected some of the most important pieces of Asia and created a space where we can learn a lot more about Asia in one building. Well laid out. I also appreciated the folded chairs that are available near exhibits. This definitely provided comfort for those of us who wanted to sit with an exhibit for a longer time.\n\nI visited the Museum with a group of students from Hong Kong and they all appreciated the beauty of the Museum. We did present a gift to the Museum from Asia and very much hope that it can become part of the learning experience for the many young patrons of the Museum. I very much believe that Museums like this open our eyes to different cultures which I hope can bring better understanding, mutual respect and ultimately peace.\nShow less"], ["Reviewed February 1, 2017", 5.0, "if asian art is your cup of tea", "this is a great option. the building itself is beautiful, because it once was the principal san francisco library. the collection is extensive. the cafe presents a good dining option."], ["Reviewed February 1, 2017", 5.0, "amazing collection!!", "to find a museum that focuses on non western art is hard enough, so travelling to this museum was a must for me. it really captures the complete artistic history of all of Asia. also, the cafe has great tea & sandwiches!"], ["Reviewed February 1, 2017", 5.0, "Expect Surprise", "I visit the AAM only about once a year - for about 8 years. It is always a new delight. Great art and culture."], ["Reviewed January 25, 2017", 4.0, "A Grand Survey of Asian Art", "Because I had not visited San Francisco in 18 years I had a lot of catching up to do. At the top of my list was a visit to the Asian Art Museum of San Francisco. The collection had long been housed in a wing of the de Young Museum in Golden Gate park. The collection which I remember as being primarily Chinese was formed by Avery Brundage, a philanthropist, world traveler, and notably an avid supporter and promoter of the Olympic Games. The collection was notable but was also thought to be not a true survey. Nor was it thought to be of the best quality. But it formed a beginning and a core from which to build. As space was limited in the de Young the collection was never seen to broadest or best effect. After the 1989 earthquake, the de Young was closed and the Asian collection found itself without a home. This presented a grand opportunity to rethink the collection and its display and to rethink its importance to the cultural life of the city. The museum trustees and city officials came to the decision to move the museum to the Civic Center into the former public library a very fine and grand beaux art building which is a part of the great ensemble of beaux arts buildings that surround the Civic Center Park. The idea of displaying Asian art in a French beaux arts environment met with vociferous complaint from the art world and from local activists. But the project went forward. After bringing the building up to earthquake proof standards the non-landmarked interiors were redesigned and now offer a sweeping and beautiful survey of Asian art. The result is magnificent and brilliantly realized. The circuit begins with the theme of the rise of Buddhist art in Gandhara and moves on to Hinduism and the spread of both religions to the countries of southeast Asia, notably Kymer Cambodia and Indonesian kingdoms. There are also rich galleries devoted to Japanese and especially to Korean art, of great importance and rarity. The core of the museum consists of galleries dedicated to the arts of China which are shown in a series of wonderful rooms displaying archaic jades, snuff bottles, temple and funerary goods, decorative arts and some paintings. The cases and displays are both dramatic and entertaining and logical in their progression. These galleries end with a survey of Buddhist sculpture, of which are the examples are very fine. I have a special interest in Chinese porcelain, one of the signal achievements of Chinese manufactures, and highly recommend visiting the great central staircase upper hall where thematic essays on Chinese porcelain are displayed with simplicity and clarity. The explanatory texts are particularly well-written as are all the texts in the museum. The curators have worked assiduously to build a great collection on the foundation of the Brundage Collection. The results of this effort are evident at every turn and the collections now present a fuller, richer history of East Asia through art. The effort to do this has been considerable and dedicated. The museum represents one of the finest of a very few museums dedicated to Asian art. Because San Francisco is an Asian-Pacific Rim city with a large population of citizens coming from Asia, it has a special importance in the cultural life of San Francisco. I highly recommend it to the interested visitor, even if the visitor has no expertise in Asian art. The important aspect for me is that the Asian Art Museum speaks to San Francisco as an international, cosmopolitan and sophisticated city with abroad and diverse population. Practically I would suggest a 1 1/2 block of time for a visit. There is a cafe in the museum. It must be very fine because at 1:30 the line was long and I could not get near it and because I had much to accomplish I pushed on. From the Asian Art Museum I walked down market to SFMoMA where I spent the remainder of the afternoon. For the interested art lover the Asian Art Museum is a \"must\" on a short list of very fine museums in San Francisco.\nShow less"], ["Reviewed January 23, 2017", 5.0, "If interested in Asian arts and cultures, a museum not be missed!", "Easily accessible by public transportation near the Civic Center stop and San Francisco Library, the Asian Art Museum hosts a number of beautiful artworks and displays from all over Asian and the Middle East both in their permanent collections as well as their visiting exhibitions. We recently visited San Francisco during the first ten days in January 2017 and we visited this museum three times. We enjoyed revisiting the permanent collections as well as the Rama Epic: Hero, Heroine, Ally and Foe temporary exhibit from southeast Asia, and of course we used the audioguides during each visit. We enjoyed delightful lunches in the cafe, shopped in the museum store, and even made an origami bird at a mini workshop which was offered one afternoon.\n\nAlso, on December 31st, 2016, we attended and participated in the 31st Annual Japanese New Year's Bell-Ringing Ceremony. The ceremony included a purification ritual, chanting of the Buddhist Heart Sutra, and ringing of the museum's 16th century Japanese bronze bell. Symbolically, the ringing of the bell represents the discarding of bad experiences, misdeeds, and ill luck of the old year so that you can begin the new year fresh and without blemishes. If you have the opportunity to attend this special ceremony, I highly recommend it.\n\nDespite living on the east coast, and after multiple visits to this museum, we became members of the Asian Art Museum. We greatly appreciate this museum and are happy to support its efforts to educate people about the arts, cultures, and peoples of Asia.\nShow less"], ["Reviewed January 17, 2017", 3.0, "If you like Asian art, you have to visit.", "The collection is quite small and not comparable to the NYC Metropolitan Museum or even the Norton Simon for the quality of the collection, IMHO, but it is nevertheless enjoyable. Don't skip lunch - they have a very good restaurant on the ground floor that serves an excellent cafeteria style lunch.\nShow less"], ["Reviewed January 14, 2017", 5.0, "Doesn't get the attention it deserves!", "A stones throw from City Hall and steps to the Civic Center BART entrance, yet the Asian Art Museum doesn't get near the attention it deserves. Wonderfully curated. Allot double the time you think you'll need and make sure you take the stellar docent tour. The Rama Epic exhibit, which unfortunately ends on January 15th, is fantastic. Eat lunch a the cafe, which is a delight in itself. If it's nice out, sit out on the patio for a perfect view of City Hall. Tip - Free passes available at when you sign up at a Northern California library (including the SF library, which is right next door); as your librarian. One of may favorite museums in SF.\nShow less"], ["Reviewed January 12, 2017", 5.0, "Excellent museum of Asian Art. Worth many visits", "This is probably San Francisco's most comprehensive museum. We love San Francisco's Legion of Honour museum, but the level of detail provided by the Asian Art Museum's free audioguides (with ticket or membership) comes closer to the museum audioguides that we experienced in Europe. This museum displays beautiful, rare pieces from East Asia, Southeast Asia, South Asia, and the Middle East. The permanent and visiting exhibitions are always outstanding. The museum cafe food is pretty good too. Truly worth a visit. We always recommend this museum to visiting friends and family. The beautiful museum is conveniently located near the BART station (Civic Center stop) and San Francisco's Main Public Library.\nShow less"], ["Reviewed January 8, 2017", 5.0, "East in the West", "Both permanent collections and evolving presentations. Listed activities. A pleasant, tasty cafe to sit and regain your energy; there is a lot to see and take in."], ["Reviewed January 7, 2017", 4.0, "Amazing and beautiful artifacts", "It is always a treat to see what is new, and review the permanent collections here. The galleries are large and numerous, so be prepared to walk. The flooring is not the most user friendly if you have foot problems; but on the plus side, they do have wheelchairs available for those who need them.\nShow less"], ["Reviewed January 7, 2017", 5.0, "Enjoyed so much beyond the Rama Exhibit", "We started at the top floor, and worked our way down to the ground floor (Rama Epic). The extensive collection encompasses India, China, Korea, Persia (Iran), and other regions in Southeast Asia and Central Asia. It is interesting to see how much trade and cultural exchanges across various regions of Asia since ancient times have influenced art and society all over Asia and beyond. The interplay of religion and culture is also evident throughout the history of the various regions' displays, and gives one hope that mankind can thrive despite religious distinctions and national feuds.\nShow less"], ["Reviewed January 7, 2017", 4.0, "They have art from ALL of Asia", "The Asian Art Museum had a special display of the Rama Epic. It is a story told and retold 100s of times. The display included painted art as well as clips from Indian movies. It is best to hook up with one of the guides who will explain the story and what you are viewing. It is fantastic. We did not have time to view other areas but will the next time I am in San Francisco.\nI was in a wheel chair and have a small problem getting close to the guide to hear everything. The doors between the galleries are big enough for wheel chairs but do not open automatically. At most there was someone to assist me.\nShow less"], ["Reviewed January 6, 2017", 4.0, "Great museum showcasing asian art", "Having one of the most extensive jade collections in the USA, this museum really does a great job showcasing asian art and talent. Some of the most interesting pieces are in the polynesian south pacific exhibits with the crazy looking masks."], ["Reviewed January 5, 2017", 5.0, "Sorry I missed this place for so long!", "The Rama exhibit was quite informative and a tour de force. The depth and diversity as well as clarity of message put forward by the exhibit made it possible to better understand some of the resident exhibits. In some cases I think exhibits that are part of the SF Asian Art Museum could be better described in light of experiencing the visiting exhibit.\nSaw much, but feel I need to go back and fill in the missing parts of the experience!\nWonder what's on the 4th floor?!\nShow less"], ["Reviewed January 4, 2017", 5.0, "WHAT A GREAT MUSEUM!", "Wonderful collection - well organized. two floors of permanent collection plus temporary exhibits.\n\nwe opted not to see the current Rama/Epic show as we wanted to focus on the permanent collection - despite arriving at 10:35, we joined the docent's 10:30 tour and thoroughly enjoyed her showing us highlights of the collection... We had the audio guides (free) as well and when we finished the tour, we went back up to the third level and started again.\n\nThere are great works and great exhibitry and explanatory panels - I learned much about some buddhist concepts which I have been familiar with but was happy for clarification!\n\ngood gift shoppe too!\nShow less"], ["Reviewed December 31, 2016", 5.0, "Wow!", "Run to see the Rama, the Epic, the current special exhibit on the ground floor before it closes on Jan. 15. This spectacular show brings together pieces from the British Museum, East Coast museums, the San Diego Museum of Art (the Binney collection) as well as the Asian Art Museum. There's a good mix of types, periods (traditional and modern), and places (India and Southeast Asia). Don't wait as this stunning show will not tour to other venues. The museum shop also and always has fresh and interesting pieces that complement their collection -- books, textiles, jewelry, and prints.\nShow less"], ["Reviewed December 30, 2016", 5.0, "Great Museum - NOT just for Asian art", "This is a great museum, and I go back just to revisit the basket exhibit as often as possible. They have some of the most unique, and rare collections. Take in all the floors, and make sure you don't rush - wall art is even some of the finest in SF.\nShow less"], ["Reviewed December 28, 2016", 5.0, "WOW (in every sense of the word)", "We came intending to see the entire museum in one go, but ended up just barely finishing the third floor (India and a bit of Iran, Nepal/Tibet and China). A FEAST for the eyes, and one that left us both over-stuffed and ezhausted. Lots of beautiful items, but there are so many! My work takes me to Saudi Arabia a lot, and it was a great pleasure to see a culture (India's) that embraces female sexual it and it's power.\nShow less"], ["Reviewed December 26, 2016", 5.0, "The Rama Epic", "The Rama Epic at the San Francisco Asian Art Museum is a must see. Plan your time to take both the docent tour and the audio headphone tour. ( Spoiler alert, but good to know, the galleries present from the view of the epics major characters.) The art work on display is outstanding. A highlight are the video presentations from popular culture performances of the Rama Epic. You will leave with a warm understanding of the epic but still processing everything you have seen and heard. I have visited twice to appreciate the complexity of the story and the breath of the collection presented for the exhibit. Ends January 15, 2017\nShow less"], ["Reviewed December 23, 2016", 3.0, "Wanted to see the ROC exhibit.", "It was very crowded and the visitors were not friendly or polite. Maybe they were trying to protect the objects from light damage, but the room were so dark that we could not appreciate many of the small objects or read the signs near the art. Some of the signs were not near the objects. The many items on display were too crowded together and only a few could get near the cases. Wanted a flashlight at times. Maybe binoculars would have helped. Maybe we were there at a very, very busy time.\nShow less"], ["Reviewed December 16, 2016", 4.0, "Great Museum!", "What a great museum, went here for the Epic Rama exhibit, great exhibits in four different exhibit halls. Well curated with easy to follow notes. Highly recommend this place. Exhibits change, a must for your next visit to the city. There is a nice cafe on main floor!\nShow less"], ["Reviewed December 11, 2016", 4.0, "Best Examples of Asian Art", "This gem of a museum has a wide variety of S. Asian and Asian Art that is unparalled in many of the other museums I have seen on my travels. One room is better than the next."], ["Reviewed December 7, 2016", 5.0, "Great Museum", "The museum has a really interesting variety of Asian art. It's laid out really well and each piece is more intriguing than the next! I especially liked the contemporary Asian art.\n\nWe went at 4 pm and the entry fee was discounted. We spent about an hour or so in the Museum. You can definitely spend longer if you listen to each segment of the audio tour. The audio tour is included in the admission price and you can choose which portions to listen to. It was definitely value added!\nShow less"], ["Reviewed December 5, 2016", 5.0, "Great Museum", "I heard that the Asian Art Museum in SF was wonderful and a recent trip there confirmed it! What a great collection ofr art from all over Asia (China, Japan, Korea, India, the Himalayan regions, Pakistan, Indonesia, Persia, etc.). I downloaded a free app to my phone which provided excellent narration when I wanted it and highlighted the masterpieces. I highly recommend a visit. I also greatly enjoyed the restaurant and the gift shop.\nShow less"], ["Reviewed December 5, 2016", 4.0, "Go on Free Entry Day", "I enjoyed the museum mostly because I went on free admission day. I don't think the constant collections warrant the price of a ticket. History is shown most through artifacts like pots/pans, many many pots and pans. The layout of the museum is odd so do not be fooled by the giant staircase that takes you to the upstairs exhibits, there are more exhibits reached by entry near the cafeteria.\nShow less"]]}}