{"AT&T Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "AT&T Park", "url": "/Attraction_Review-g60713-d557330-Reviews-AT_T_Park-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/2c/e1/4d/view-of-scoreboard-from.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "6180"}, "address": {"@type": "PostalAddress", "streetAddress": "24 Willie Mays Plz", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94107-2134", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "An Awesome Park", "This is one of the most friendly parks I've been to. The fans and the ushers are great. The seats are awesome and the view and weather was perfect. It's fun to watch someone hit a ball over the right field wall. The boaters outside the park race for the ball.\nShow less"], ["Reviewed 3 days ago", 5.0, "Awesome!!", "Was taken to a Giants game by my Airbnb host back in August last year. The field is a great venue and gives off an awesome vibe. Loved the caramel corn!"], ["Reviewed 6 days ago", 5.0, "Great Park", "I didn't get to go outside of it, but the walk down by the water was beautiful with all the sailboats and the Bay Bridge in sight. You can peek through the gates and see the field, so that was pretty cool!"], ["Reviewed 1 week ago", 5.0, "Dodger fan but I love AT&T Park", "Still amazes me how they squeezed a ballpark into this location. Great design. One of the, if not the, best parks in MLB.\n\nLove going here. Giants fans aren’t accommodating, but either are Dodger fans at Dodger Stadium. As a North Bay resident, I still make the best of my visits as I go to games for the entertainment value and not to belittle the other teams fans.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great for Baseball Fans", "If you love baseball you need to see this park. It is one of the newer parks in the league so it has a lot of modern features and comforts. Seats aren't bad even if you are in an upper section. Be aware that you are on the bay and it does get cold especially if the wind is blowing.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful ballpark", "I've been to 10 plus baseball stadiums in my life and this place is top 3, right up there with Wrigley and Fenway. Being compact, it has the atmosphere of an older, smaller park but with all the amenities of the newer ones. Must see for a baseball fan.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Ball Park With a View", "Locals love this place. Accessible by transit, good restaurants nearby. And from many seats one can see the game and the Bay. Prices are high, cost of food and beer is high. But this place is special."], ["Reviewed 2 weeks ago", 5.0, "Too bad the game was rained out!", "We came here because my husband really wanted to see this park. Not disappointed at all. Stunning bay view and great park hands down. Our game was rained out but the experience was awesome! So glad we made it to this stadium to add to our list of baseball stadiums to see!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful and fun!", "I would say our visit was one of the best parts of our trip! The park was beautiful, clean, fun, and the food was fantastic."], ["Reviewed 2 weeks ago", 5.0, "A Highlight of our West Coast Trip!", "My daughters (12 and 15) and I took an afternoon to go see a game at AT&T Park during our visit to San Francisco as kind of a birthday present for me. We all ended up having a great time! It's a beautiful park, with nice sight lines to the field and nice views of the bay. The food is very good with a wide variety of selections. If you are a fan of baseball and visiting baseball parks, this is one not to miss!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best park in baseball!!!", "Whether you're seeing a Giants game or a concert, this stadium is amazing. Right on the water with a great view. Not a bad seat in the entire place. Plus there are TONS of food and drink options in the area."], ["Reviewed 3 weeks ago", 4.0, "Great Baseball Venue", "One of my favorite baseball stadiums anywhere in the country. You don't even have to be a Giants fan to enjoy a game here. Killer views all around and a really nice selection of food and drinks. If you're considering taking in an away game of your favorite team, I highly recommend doing so when they play in San Francisco. AT&T Park is a staple on the greatest professional parks regardless of sport, and with one trip here, you'll see why!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazingly pretty", "Not just during baseball games, this ballpark is gorgeous! Things to see from every seat. Lots of food options (though pricey for a ballpark) and even a play area for kids. The giant baseball mitt and Coke bottle slide leaves kids wide-eyed, but the view of the East Bay hills across the bay is awesome. Every opportunity to look outside has either water views, city vistas or ball park color. There is parking for games and events, but you are better off using public transit. You can even take a ferry to games.Spend some time just walking around the park.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Great views!", "Was one of the more average ball park tours I have done around the country. No access to the home team dugout or home team change rooms. You spend enough time walking around the park and the views from the top level are really cool."], ["Reviewed 3 weeks ago", 5.0, "One of the Best in Baseball", "This is my 2nd favorite ballpark in the MLB next to PNC Park in Pittsburgh (in terms of views from your seats). However, everything about this stadium is amazing. Great food, great views, great people. Hands down some of the best fans in baseball. As long as you are respectful you will be fine and welcomed. The views of the field and the bay are magnificent. Mccovey cove is another highlight that should not be missed.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Old and New combined", "What a great place to see a ball game, new stadium that has a nostalgic feel. Great site lines and you can see the field from very seat. Price on concessions are high but hey, it’s San Francisco."], ["Reviewed 4 weeks ago", 5.0, "Bring a jacket, blanket, and a hat", "The View of Oakland and the bay is spectacular; My favorite section is the Club Level and on the 3rd base line. Day games the sun can be brutal and night games it quickly goes from comfortable to freezing."], ["Reviewed 4 weeks ago", 5.0, "\"Take Me Out to the...Park\"", "One of the prettiest ball parks we've seen around the country. Seats in the Stadium are all really good and the Park offers great food selections including, Garlic Fries (oh yeah!) and Boudin's Sourdough Bread Sandwiches & Clam Chowder in Bread Bowls. Definitely bring a warm jacket, even on hot days, as the afternoons & evenings cool down very fast! If you get a chance, take the Larkspur Ferry to the ball game. It's a fun & easy trip; but arrive a little earlier than expected cause boarding tickets sell out quickly. A variety of Food Trucks are often parked as you board too and you can pick up a great dinner to eat on the way to the Park's landing area on the Bay.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Its a ball park and I'm not into baseball.", "I'm not into baseball so . . . . what can I say? It's a state of the art baseball stadium. Like baseball or the SF Giants? then it's a winner for you.baseball"], ["Reviewed January 24, 2018", 5.0, "Home of the SF Giants", "This is a great intimate ballpark with great views from any seat. Good ballpark restaurants- but pricey like all ballparks. Parking is limited but good public transportation available."], ["Reviewed January 24, 2018", 5.0, "\"Awesome Park!\"", "AT&T Park is an amazing baseball stadium. Located in a great area and amazing views of the bay and Alcatraz! There is really no bad seats, they are all good! Have a great time and enjoy the game!"], ["Reviewed January 22, 2018", 5.0, "There wasn't even a game!!", "Off Season Saturdays and Sundays are open to the public. There's a tour at 10:30 and 12:30 on the weekends.\n\nWe came just to look at it, but they were letting people in to the back part of the field. The Coke Bottle is a Slide for kids!! Entrance is free. Just bring your kids here. All ages will enjoy this place even when there's no game. The water is beautiful, the stadium is beautiful, the staff is great. On the weekends you can park behind the stadium where there is a business lot.. its not monitored and its free, rather than pay for parking $18 or meters.\n\nA MUST FOR FAMILIES!!!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Giants Game", "What an amazing experience! The game was fabulous and we won! Food excellent and even nearly caught a ball!"], ["Reviewed January 21, 2018", 5.0, "Cards game", "Absolutely beautiful ballpark. You have to go see a game here. Very family friendly and they usually field a great team."], ["Reviewed January 18, 2018", 5.0, "One of the best Ballparks on the Planet", "Saw a Giants game here against the Diamondbacks. Am originally from Cleveland, and am very found of Jacobs Field (will always be it’s name) This Park is better. The view and setting are terrific, and even though the team was terrible, the fans still came out in large numbers to watch. Great atmosphere.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Nice park", "I liked the park location. There could have been a little more variety of food to buy. While the seats were good, the person sitting next to me was quite big and I was sort of squished into my seat. He also kept throwing peanut shells all over the place, and was smelly. That ruined the experience for me a little.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Giants game and 5k run", "My sister and I did a 5k run/walk that began outside the stadium and ended on the field itself. It was awesome to sit on the outfield and take pictures, but we got to go into the dugout and sit on the benches. The stadium is beautiful and comfortable for visitors with plenty of things to do. We went to a game that same night and felt very welcomed by the staff and other fans. I went to a second game during the day because I enjoyed it so much.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Fun tour for the family", "We took a tour of the stadium and it was fantastic! It’s a beautiful stadium and the tour guide made it fun and interesting. I have an 8yr old son and a husband that are both baseball fans. They truly enjoyed it! I highly recommend the tour.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Baseball game", "Had great fun even though we didn't totally understand the game, the atmosphere is exciting and its a great stadium to visit, the views over the bay are lovely."], ["Reviewed January 7, 2018", 5.0, "The most picturesque ground in MLB", "I am slightly biased as a Giants fan, but my husband is not and he agrees that you cant beat the location and view from this stadium. This is only my second time at the ground and we sat high up this time in particular to enjoy the view. On a warm sunny San Francisco evening, the view over the water is amazing.\n\nWith easy access, heaps of food and beverage options, a great merchandise store and overall great facilities; this is a great ball park to visit especially if you are not too familiar with the game.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Not a bad seat in the house!!", "Wonderful sports venue! All of the seats are great, from the open bench area under the \"BIG COKE\" bottle to the upper crust seats where you can place orders from your seat, and all the way to the skyboxes!"], ["Reviewed January 1, 2018", 5.0, "One of the best places to see an MLB game", "AT&T Park ranks among my three favorite places to see an MLB game in the country. For starters, it's easily accessible and is located in one of the most picturesque locales in all of San Francisco. The fan experience is topnotch, with great views at all angles of the stadium overlooking the water. Everything is easy to get to, and all of the little details; noise, between inning entertainment, vendors, and staff are all there with one goal in mind - to make it as pleasant as possible to enjoy a baseball game.\n\nTickets weren't cheap, but with the recent decline of the club I imagine they will be easier to come by (we had the dubious distinction of being there the night their sellout streak broke.) Food selection is good but not great - the beer selection is the same. I remember the gift shop being better the first time I was there eight years earlier, but it's still pretty good.\n\nWe were there in July, and it got chilly as the game wore on through the evening - do prepare accordingly. That being said, AT&T Park is one of the best places to catch a game and a fine way to spend an evening in San Francisco. Recommended to all, and a must-see for baseball fans.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Insiders view!", "The tour of the stadium is well presented! I would highly recommend this if you love baseball! Impressed with the Tiffany World Series trophies and all the history!"], ["Reviewed December 29, 2017", 5.0, "Freaking Cold BUT AMAZING Experience", "We were warned that it'd be cold and the day was a glorious day so we didn't think it'd get too cold there. Husband had to go buy another jumper from the merchandise stand.\n\nWe were there in May and they had an unusually warm week when we were there and it was still freezing at night in the stand.\n\nLoved that there were people walking the stands with food and hot chocolate!\n\nOnly downside was trying to leave the place and get back to our hotel. I'm sure there was an easier option but we ended up taking an Uber/Lyft but that still took forever. (Next time we'll research best way to leave the place)\nShow less"], ["Reviewed December 25, 2017", 5.0, "One of The Best Ballparks in the Country", "The views are tremendous and the park is well laid out making for a comfy experience while watching the Giants. Last time everyone seemed to have garlic parmesan fries except me (yes get the violins playing). It's right in the city and where else can you kayak to a baseball game?\nShow less"], ["Reviewed December 25, 2017", 5.0, "Very cool place for a game.", "Watching a game on a sunny day, on The Bay is just plain Awesome.\n\nIt's one of the best parks I've been to for fan experience with stuff for the kids to do, pretty good food and it's fun to watch the boaters and kayakers trying to grab a home run ball in McCovey Cove,\n\nIt's a short walk to the happenings at the Ferry Building and nice hotels and it's surrounded by lots of great little bars and eateries.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Amazing location", "I remember when they were talking about building the stadium at that location and thinking it was a bad idea.\nBoy was I wrong! Excellent access by public transportation, great views, Coca Cola slide, great food choices and you can visit for a walk when there is no game.\nThere is also Street parking if there is a late game, San Francisco job well done.\nShow less"], ["Reviewed December 22, 2017", 5.0, "A Must for Any Baseball Fan", "You will never appreciate going to a ball game as much as going to a game a ATandT. The fans, the staff, the food booths, the fun opportunities for children and child like adults, and the Giants. Go once or go 81 times a year, it is always fun and fresh. It is the best San Francisco has to offer. The views are spectacular. Transportation is easy. It is a can't miss and a must see.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Best ball park in the US", "This is the home of the SF Giants and is one of the best ballparks I’ve been to. Great location with lots to do around it. Go to a game if it’s baseball season"], ["Reviewed December 21, 2017", 5.0, "Great Baseball Park", "Lots of good seats. I recommend a day game to see the place at its best. You can walk around see views of the Bay, the food is acceptable but pricey. The crowd tends to be friendly and baseball knowledgeable. There is a nice walk to the Park along the Embarcadero, a longish walk from BART. Lots of good eating nearby\nShow less"], ["Reviewed December 21, 2017", 4.0, "If you are fortunate enough to be somewhere behind home plate, the excitement is palpable - bring your glove.", "Fast moving foul balls, interesting people and cuisine, keep it all fun. The Giants Museum dates back to the old NY Giants (Leo Durocher era). If you are able and if you love baseball history, set some time aside to really see the displays."], ["Reviewed December 21, 2017", 5.0, "A wonderful traditional style ball park", "Great food, wonderful views of San Francisco Bay. A first rate baseball experience whether the Giants win or lose."], ["Reviewed December 15, 2017", 5.0, "Best Ballpark in the States - what a view from your seats", "Have visited many ballparks but this is truly the most spectacular. The views are worth the price of admission alone - if you are in tour do yourself a favour and do the tour of AT&T park. Enjoy the pics!"], ["Reviewed December 15, 2017", 4.0, "Great Tour", "Went on the stadium tour in October and had a great time. Our tour guide had a great sense of humour and was very knowledgeable about the stadium and the team/sport. The views from the stadium are really good on a clear day, and it's very easy to spend too many $'s in the Dugout store! I don't follow baseball, but the tour is a good half a day trip to experience a ballpark and catch a glimpse of behind the scenes. Would definitely visit again.\nShow less"], ["Reviewed December 13, 2017", 4.0, "AT&T Concert", "Loved this venue, toilets for men had a huge queue, which is very unusual coming from Australia it's always the other way around. Food was ok, stairs getting down onto the pitch was a nightmare, so if it's a concert your attending, get there early if you want to stand on the grass.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Best Ball Park in the Unites States", "We have travelled and explored Baseball parks. AT&T is the most beautiful, well run and best by far. Even without a winning year, it is filled with spectators. The staff are helpful and go out of their way to ensure your experience is great."], ["Reviewed December 12, 2017", 5.0, "crab sandwich", "What a view and don't miss the hot fudge sundae! Oh, the game was fun too-- just too cold and windy. Maybe install heaters??? LOL"], ["Reviewed December 12, 2017", 5.0, "Great ball park.", "Great ball park RIGHT on the edge of San Francisco bay. A modern, compact baseball park. Plus you get the pleasure of seeing the Giants. Wonderful statues of Willie Mays and other famous ball players. Great public transportation to the park."], ["Reviewed December 10, 2017", 5.0, "No more Timmy....", "Tim Lincecum may have left the San Francisco Giants but AT&T Park can still hold its own. Wonderful modern park in the city by the bay. Every seat is the best view in the house. Although it does get chilly during the evening games as the fog along with the birds roll in, it just adds to the charm that is AT&T Park. Try the crab sandwich.\nShow less"], ["Reviewed December 1, 2017", 4.0, "Great ballpark", "I was here a couple times for a Giants game and once for a concert. Enjoyed all events. It's a really nice park. Warning though..prices for food and drinks are ridiculous. Beer over $10. Just really crazy prices. Some guy in front of us gave his son $35 and he spent it all (churro, ice cream, soda, hit dog, etc.) and was asking for more. I suppose that's the way it is, but don't count on an affordable trip to the park. If the Giants don't improve though, maybe they'll be giving away the tickets and your money will then only be needed for the food.\nShow less"], ["Reviewed November 29, 2017", 4.0, "what a great view!", "We loved watching a game here, and you cannot beat the bay view as you walk around the park. Plus, we took a tour and the kids got to run the bases. Fun time."], ["Reviewed November 24, 2017", 5.0, "AT&T Park", "Awesome Stadium we did a Spartan Race here. Gorgeous brick exterior, very beautiful inside the stadium with views of the bay towards the outfield."], ["Reviewed November 20, 2017", 5.0, "Buy Buy Baby", "This is the nicest ball field not to mention the view. The food is a good variety. Nice people go to games too."], ["Reviewed November 20, 2017", 4.0, "Beautiful Stadium", "Walked around AT&T park last week and really enjoyed the atmosphere all around. The architectural design is beautiful and the location on the cove really cool."], ["Reviewed November 19, 2017", 5.0, "Very nice ball park", "Feels very safe - easy to get to from many kinds of public transportation. Tickets have been a bit expensive the last few years, and you tend to see a lot of middle aged couples (not as many families). It is also clear many of these couples know little about baseball. If you can deal with this, you will enjoy the beautiful,park.\nShow less"], ["Reviewed November 19, 2017", 5.0, "AT&T", "Absolutely stunning! This is one of the places that had won me over and makes me want more! The Giants playing here are the luckiest team ever!!!! GREAT FOOD GREAT PEOPLE overall fantastic environment! Best of all access to this location by public transportation is ideal! SF has definately plotted the stadium in an ideal location! Can't wait for our next event!\nShow less"], ["Reviewed November 18, 2017", 5.0, "Enjoyed my first baseball game here", "great stadium with great atmosphere. excellent view on the field and a wonderful first time baseball experience."], ["Reviewed November 18, 2017", 4.0, "Baseball", "The stadium was just a short walk from our hotel , which was nice. We actually never went in, we just walked around the outside and vowed the game from the opening on the Bay side of the stadium. It seemed like a nice ballpark. The atmosphere was electric.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Field of dreams", "We bought personal seat licenses at this ballpark on faith - before the park's groundbreaking. Seventeen seasons (and three World Series victories) later, we can definitely say that this is one of the nicest venues in sports. Spotless, comfortable, great food choices, cheerful and competent attendants, and incredible views of San Francisco Bay. Choose a game - day games are especially good - and go.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Amazed that it was downtown", "I love baseball! I did not realize that the ballpark was close to downtown. There were a lot of people in the area getting a tour sadly baseball is over at the moment."], ["Reviewed November 11, 2017", 5.0, "Great Venue to Watch a Ball Game (or see a concert)", "We watched Lady Gaga perform at this fun venue. It was simply awesome! seats were comfortable and we were lucky to find street parking. Make sure to bring a jacket!"], ["Reviewed November 11, 2017", 3.0, "Typical Baseball Park", "This is your typical baseball park with the usual type of set up. However, it is really easy to find and within walking distance from the shopping district (Market Street). Traffic can be VERY heavy so be prepared."], ["Reviewed November 10, 2017", 5.0, "Amazing ball park", "Buy sro tickets and roam around. Lots of great places to watch the game. Great food and beverage options."], ["Reviewed November 10, 2017", 5.0, "Attended dreamfest with Lenny Kravitz and Alicia Keys", "I attended the Salesforce Dreamfest 2017 in AT&T Park where Lanny Kravitz and Alicia Keys rocked the stage. Its ag great place to be with a stunning View on the Bay."], ["Reviewed November 9, 2017", 4.0, "Great Place for a Baseball Game", "While one of the more expensive venues,and the Giants were not very good this year, beautiful stadium. Good food and views. Gets cold for night games!"], ["Reviewed November 9, 2017", 5.0, "Huge park in the middle of SFO", "We enjoyed visiting this huge park which has several small lawns & gardens for taking a stroll although not like a conventional park."], ["Reviewed November 8, 2017", 4.0, "Ballpark tour", "We joined the ballpark tour cuz it's out of game season. I think the tour it's just ok but under my expectation(compare to safeco field and yankee stadium). I m not a fan of giants but the ballpark just around the Bay Area and it's worth to see it!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great Ballpark Tour", "Tour lasted approximately 90 minutes but was quite thorough.\n\nSitting on the waterfront gives the ballpark a great view of the bay and plenty to look at around the outside.\n\nThough the park may feel more compact than other stadiums around the league, the stadium is well maintained for being 17 years old at the time of this review.\nShow less"], ["Reviewed November 8, 2017", 4.0, "beautiful view", "So much fun to come here to watch the Giants play. It is a beautiful park. Lots of different foods to choose from. Although it is very expensive to eat and drink."], ["Reviewed November 8, 2017", 5.0, "Don't miss any sports event here!", "First time visitor and first Baseball Game, it was a fantastic experience, this Park has it all. Food and Beverage Outlets have a great variety and well priced."], ["Reviewed November 8, 2017", 4.0, "Great Park!", "I've been to a number of baseball games and concerts at this park. While it can get cold at night, the views, food, and quality are amazing. Even just a quick walk around the stadium on the water is well worth the time if your visiting.\n\nDownside is that it's not cheap, but it's a stadium and no stadium food or beverage are ever cheap. If you happen to go to a baseball game, take your ticket to the concession stand with you since most offer a $5 voucher on any food or drink items. It makes a difference!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Fantastic!", "I love ATT park. The layout is great, food options are fantastic, and the fans are great. They didn't do so well this season but always fun to go watch a game!"], ["Reviewed November 7, 2017", 5.0, "Wow!", "We had never been to baseball until we came here and we loved it! The view was amazing even in the “cheap seats” and the stewards helpful and friendly."], ["Reviewed November 6, 2017", 4.0, "Great ball park!", "We loved AT&T Park. One of the prettiest ball parks I have visited. Concession stand prices are some of the most ridiculous I have ever experienced however. Don't go hungry!"], ["Reviewed November 6, 2017", 5.0, "What an amazing experience!", "Our first Baseball game and we were amazed and astounded! It was so much fun and just a really special experience. It took us a while to understand the rules of the game but once we got it we really enjoyed the whole experience - a great stadium, with loads of food and drink outlets and lots of help from the stewards.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Great Park!", "We do a company visit here once a year and it’s an amazing experience. What a great place to watch a game and have a beer. The cool breeze blows on you and you get to watch one of the most iconic teams in baseball."], ["Reviewed November 3, 2017", 5.0, "Sister trip", "My goal is to visit all the baseball stadiums. This is a nice stadium. Enjoyable game, even though they lost."], ["Reviewed November 2, 2017", 5.0, "Just WOW!", "This place has everything! I'm from FL so we dont see this much enthusiasm at baseball games. BUT, even if you hate basseball there is so much to do. I only wish I hadn't eaten before going to the game because there are soooooo many food options. Unreal. So, if your spouse loves baseball and you hate it... I say bite the bullet and go because this place is about as good as it gets!\nShow less"], ["Reviewed November 1, 2017", 5.0, "Prettiest Baseball Stadium in America", "It really is. Its freezing during night games and actually most of the season but no matter what weather, sitting in that stadium is my favorite place to be. If you are up high in the third level its ok because you have a beautiful view of the bay with cargo ships and sailboats, which is nice during innings that are a little slow. The bleachers feel close. And the good seats give you access to even better food stands. The food is amazing. The crab sandwhich you can get by the baseball glove is worth every bit of the 17 dollars it cost. If you don't have a ticket go to the yard across the water. Grab a beer there and pretend you have a ticket!\nShow less"], ["Reviewed October 30, 2017", 4.0, "Cubs at Giants", "A beautiful park. A beautiful location. A great selection of foods available.\nWe had tickets left of home plate at the very top of the stadium (I don't like heights but, I did acclimate to the steep stairs).\nWe look forward to next season to attend another game.\nBy the way...you can bring in food and drinks from the outside. Maybe stop at one of the city's great eateries...order to GO...enjoy at the park. Just NO glass containers. Simple enough.\nThe screening to enter the park was thorough and quick. It did take some time to locate our seats, but there are staff members that will assist if you need, and can find them.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Fun Ballpark", "Just a fun ballpark - even if you're not a huge baseball fan, go for the experience - the views, food, people watching. Great excursion."], ["Reviewed October 29, 2017", 5.0, "Beautiful Ballpark Tour!", "Our family vacation this year to San Francisco included some must-see items, a ballpark tour was my husband's choice. Being from Boston, we've done the Fenway Park tour so seeing a newer park was really delightful. Our tour guide was great and the ballpark is just gorgeous. It's an affordable option and its nice to see a place you might not otherwise see (baseball season was over when we were in town). Some really cool facts about the park and the team too- perfect if you just enjoy America's favorite past time. We had a stroller and about 95% of the tour is stroller friendly, but a carrier might be easier if your little one isn't walking yet (ours was not).\nShow less"], ["Reviewed October 28, 2017", 5.0, "An Fun Stadium Tour with Baseball History Thrown In", "We took the tour of AT&T Park because we enjoy touring stadiums if there is one in the city we are visiting. We were shown many areas of the ballpark from the visitors dugout to one of the suites. The tour guide did a great job during the tour presenting facts about the history of the Giants baseball team. She also answered any questions she was asked by the people on the tour. The views of the Bay were spectacular. The tour is definitely worth your time.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Best Ball Park", "I may be a little biased but this Ball Park may be the best one out here. With an amazing view AT&T park is located in a lively neighborhood full of bars and restaurants to pregame at.\n\nThe stadium itself is gorgeous. It is clean, safe and well maintained. It helps create the perfect game day vibe.\nThe food is great to my favorite is the Chicken strips with garlic fries paired with a chilled glass of bear.\n\nTip: It gets super cold out here so make sure to carry a jacket if not a blanket.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Giants vs. Padres", "Doesn't really feel fare that I'm rating a baseball game and stadium, without being a fan of baseball. But why not :) Very cheap tickets if you compare to the NFL, NBA or the NHL.\n\nStaff was calm and friendly.\n\nWe went to one of the last games of the season and neither the Giants nor the Padres was going to the playoff, so neither of the teams had anything to play for. Kind of low attendance and people didn't really seem that interested in the game. A lot of \"youngsters\" in the crowd who rather sat with their phones giggling the entire game.\n\nFantastic location of the stadium. Even though we went on an evening game and couldn't really enjoy the views of the bay, it was nice. Very cold, but nice :)\nShow less"], ["Reviewed October 23, 2017", 5.0, "Take me to the Ballpark", "ATT Park is easy access by many means - walking, CalTrain, Muni T line and Uber/Lyft if you want to. Forget about parking since on game day the lots double the prices.\n\nWith Muni get a round trip ahead so you can leave on return without delay back into downtown. If you walk, take either Third Street all the way down or go along the Embarcadero for a view of the Bay.\n\nFor those with FitBit you will get your steps in!\n\nAll seats in ATT are great and amazing to take in a game. Have fun!\nShow less"], ["Reviewed October 21, 2017", 5.0, "informative and interesting tour", "I have done a few stadium tours before and haven't loved them, but this blew me away. There was a great mix of information, and entertaining stories, and the tour guide was very engaging. I was amazed at the variety of food available in the food court. The gift shop is huge so I recommend avoiding it if you have little self control for buying memorabilia!\nShow less"], ["Reviewed October 21, 2017", 4.0, "Fun time", "AT&T park is a great baseball park. Facilities were fantastic and the ballpark food was good. The field looked like it was in great shape."], ["Reviewed October 19, 2017", 5.0, "Has to be the prettiest park in baseball!", "The views of the bay surrounding the park are amazing! It was definitely worth a stop to see, I doubt any other ballpark we will visit will be as beautiful. I loved that they had wine taps in the concessions to boot. The garlic fries gave me a horrible sour stomach a few hours later, so I'd recommend avoiding those, but everything else was great!\nShow less"], ["Reviewed October 19, 2017", 5.0, "Went to a Concert!", "I went to the closing concert of the Oracle's open world 2017. The stadium was magnificent, firt time in a ballpark. Amazing atmosphere."], ["Reviewed October 19, 2017", 5.0, "My first live baseball game - I am hooked - June 2013", "I watched 2 games here. Amazing atmosphere. Great location. Great views. Great food choices, and a merchandise store within the park. Plenty of toilets."], ["Reviewed October 16, 2017", 4.0, "Giants Game", "Nice stadium. We had great seats but the sun was baking even on Oct 1st...last game of season. We had food service brought to our seats but it was very slow. Tater Tots are awesome. We have been to a lot of ballparks and the food and drink choices around this stadium are fantastic. Great view of the water if you walk around. Playground for kids too. Hard to get a taxi if you leave before game is over.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Very nice ballpark", "We went to see our home team, the Colorado Rockies, play the Giants. The staff at the ballpark were so nice, they welcomed us and even gave us a first time attendee certificate."], ["Reviewed October 16, 2017", 5.0, "One of the best Baseball Parks in America", "AT&T park located in the South Beach district of San Francisco, at the south end of the Embarcadero, is easily accessible by public transport, either the N street car line or the 10,30 or 45 bus. Memories of freezing at the windy Candlestick Park Stadium are now replaced by the happy experience of looking out to San Francisco Bay and McCovey Cove during the Giant's Games. The stadium is comfortable, with more intimate seating a maximum of40,800 and has some of the most diverse, tasty food and beverage choices of any Major League Baseball venue. The garlic fries, the fresh sushi, the California wines and bar services are outstanding. Even if the Giants didn't have a great season, this ballpark is a joy to visit. Can't get to a game or if the season in over, take one of the tours that run on non game days and see the dugout, the press box, the visitors' clubhouse and more.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Every seat has a view", "The San Francisco GIANTS may have had a lousy season this year but they played in one of the outstanding parks in country. Very seat has a million dollar view; the food is outstanding with New England Clam Chowder and Garlic Fries; the vendors are nice and enough in numbers to make the lines move fast. It is by far my favorite ball park.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Loved it", "As Brits we don’t get a lot of opportunity to see live baseball so knowing we were in San Francisco, tickets had been bought well in advance. Just loved the stadium and the atmosphere, our seats were not the best (my fault) as we were underneath the top tier so could not see the big screen or high balls but despite this we loved the game. To top it off Giants won 4-0 and we made friends with the American lady sat in the next seat. The whole trip was completed when, as we were leaving, “I Left My Heart” rang out around the stadium - serene!!\nShow less"], ["Reviewed October 15, 2017", 5.0, "Go Giants!", "A can't miss if you're a Giants fan. Great location (not to far from Fishman's wharf) with great view of the Pacific Ocean. Didn't visit thI last time to San Francisco, but have been here many times,"], ["Reviewed October 14, 2017", 4.0, "SF sports", "New stadium after many years at COLD Candlestick Park. Was tops when first opened years ago. When entering, only going one direction. Very hard going backwards... All the BEST food SF has to offer! Perfect stadium on a warm summer day."], ["Reviewed October 13, 2017", 5.0, "Walking in is like going to church", "The park has a hysterical vibe when the Giants are playing. If you can get tickets to a Dodgers game, do it!!"], ["Reviewed October 11, 2017", 4.0, "Incredible Tour", "This tour is a must see! We took the kids out & even they thoroughly enjoyed this. Our guide gave us some great information & some fun stories. This is great for any baseball fan. An opportunity to see \"the triplets\" & hear about the incredible history behind this team & the coming up of this stadium.\n\nIf you're just going to a game, there's not a bad seat in the house! Go Giants!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Great Place for A Concert or a Match!", "Huge Stadium with ample seating capacity as well as good management of the park. Went to the Park as part of a concert organized during a business tour and enjoyed my time there!"], ["Reviewed October 11, 2017", 5.0, "Great night at the ball game!", "One of the best stadiums I have visited and nice to take in a game.\n\nWe did find the concessions very expensive when compared to prices that you may pay for events in the UK, so be prepared to pay for drinks!\n\nWe also did the stadium tour the next day which I would definitely recommend.\nShow less"], ["Reviewed October 11, 2017", 5.0, "One of the most beautiful", "It is located not far from the Bay bridge and even before seeing it, looking at it from the google satellite view I admired it and thought it must be the most scenic park in all of the USA.\n\nMy partner, who is a huge fan even attended a game here during this visit as he saw all these locations except the new one which was just build in Atlanta......... is he a fan or what?\n\nThe entry to the AT&T park is also part of the SF visitor pass (I got mine via Groupon for 2 day passes being priced some 85 dollars including all the other things to visit in SF) so this is a great way to save money\nShow less"], ["Reviewed October 9, 2017", 5.0, "Awesome tour", "Did the public tour, about 1.5 hours. Larry was our guide, he was awesome. Very cool experience, especially for any baseball fan."], ["Reviewed October 9, 2017", 5.0, "Giants game - wow!", "What a great US experience. Our first baseball game and the whole family loved it! The atmosphere is fantastic. The park is very easy to get around, plenty of food options and merchandise shops."], ["Reviewed October 9, 2017", 4.0, "Nice stadium", "Went to watch a baseball game whilst in SF. Wanted to get a glimpse of US sports event. Lots of fast food stalls within the stadium itself, making sure you do not go hungry. The stadium itself is cool, well connected, within walking distance of downtown and it was great to see it quite full despite Giants having had a terrible season. Worth a visit, be it to tour the place or see a game.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Best Baseball Park in America", "I'm early September I took my son to a weekday night game at AT&T Park. We road the metro (BART) to the game but you have to do a transfer onto the SF city muni rail system. If coming from Oakland get off at the first station in SF.\n\nThe baseball stadium is right on the bay. All seats but the those in the outfield have a bay view. My son enjoyed the soda straw slides and play area in the outfield. The outfield also has a beer garden. As for food, it is expensive but may be one of the few ball parks were the food is great. The stadium hosts a number of local restaurants, brewers, and confectionary makers.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Went to baseball. A great USA sport experience in a stunning location.", "No better way to get a taste of real USA than going to the ball game. Went to see SF Giants as luckily we were in town when they were - very family friendly and welcoming environment with views of the bay and bridges in addition to the field.\n\nWent late evening in summer so saw the transition from day to nighttime which was a bonus as a visitor. Food and beer were on point and coupled with a well-stocked merchandising operation came away (after a notable win) having had a great time all round.\n\nNote, if you are a first-time visitor you can go to the Customer Services and they will print you off a free commemorative certificate - nice touch. Also, make sure you take warm clothes even in the summer as when the sun goes down you get cool breeze and temps wind etc. as literally right on the waterfront.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Beautiful Ballpark", "I had a blast at this ballpark. I've been to almost every stadium but this one is the best one so far. Beautiful view of the water and my ticket only cost $4 on Vivid Seats. The concourses are nice and wide with plenty of restrooms. If you visit San Francisco don't forget to catch a Giants game.\nShow less"], ["Reviewed October 7, 2017", 4.0, "One of the most beautiful venues for Giants Baseball or concerts", "Beautiful park, definitely a \"go see,\" if you're from out of the area. Take a walk around the inside of the park, gardens, aquariums, great views, so many bars and restaurants, nooks and crannies, to explore, don't miss the Cove.\n\nTook her Ladyship here for her . . .ahem . . . not sure if I should mention this, but her 64th birthday. Paul McCartney concert, we thought he would surely play \"When I'm 64.\" No luck, but the place, of course was packed. even the field was covered with seats. The staff was just amazing, making sure you found your seat. Looking the other way, when some of the smokers had a couple.\n\nI had as much fun chatting with the vendors, as watching the concert. Food and drink always a small fortune, I got a small home equity loan, before we went, so could afford to eat and drink, whatever we wished.\n\nMuni buses, stop right in front the park, and Cal Trans train station, right across the street, so don't drive if you don't need too.\n\nHopefully, the GIANTS, will make some trades, and field a better team than this year. They were miserable to watch, and watched, just about all of their 162 games. Ugh.\nShow less"], ["Reviewed October 7, 2017", 5.0, "A must do activity", "Went here to watch a baseball game- sadly though the Giants didn't win. A great experience. Expensive to eat and drink but we sat in the bleachers and had great views. Wonderful atmosphere."], ["Reviewed October 6, 2017", 5.0, "Take me down to the ballpark", "We attended a game at AT&T park late in September and had a great time. We booked tickets in advance through StubHub and had great seats. Atmosphere was fantastic and weather perfect. An easy park to navigate and also very easy to get to via public transport.\nShow less"], ["Reviewed October 6, 2017", 4.0, "Concert in a Baseball stadium", "Something different this time - concert in a baseball stadium. Sceptical at first if that would work it turned out great - fun night. Next time, I'd do the stadium tour first though!"], ["Reviewed October 6, 2017", 4.0, "Great Experience", "We visited the Tourist Office in Macy's when we were visiting San Francisco and the very helpful lady there told us we should visit the AT&T Park for a baseball game.\nIt so happened there were 3 games on that week, Monday - Wednesday, so we decided to go to the game on the Tuesday night.\nThe stadium is very large and it was very easy to purchase a ticket for the game that evening, even though there was a big crowd.\nSeats were comfortable and we had a great view. The only thing I would suggest is to take layers of clothing with you, as it is an open stadium, very close to the bay and does get wet and misty.\nOn the night we visited, 'Dave' did a great job of retrieving a ball from the San Francisco Bay!\nShow less"], ["Reviewed October 5, 2017", 5.0, "Great view", "A great ballpark with a view of the water. There is also a fun kids area with slide. Make sure you try the garlic fries!"], ["Reviewed October 5, 2017", 5.0, "Fantastic stadium", "Highly recommend a trip to the stadium even if you only book the cheap seats just to experience this amazing venue."], ["Reviewed October 4, 2017", 5.0, "Take me out to the ball game", "Bought club seats, think bay 218 on vivid. Awesome night out watching the Giants play the Padres. Club seating has chair service which is great, you pay, but you don’t have to leave your seat if you don’t want too. The club level also has plenty of history on display as well re Giants baseball. Giants won 8 nil as well.\n\nGreat way to spend a night.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Great experience but far too expensive", "I knew SFO is quite expensive but I always thought they made sport events accessible to the crowds. But everything from ticket prices to food and drinks is absolutely ridiculously expensive. Simple tickets in the upper ring for a practice match were 39$ but prices easily went up to 99-139$ for better seats. Basically everything from a simple soda to an ice cream was over 8$ each. Perhaps the lonely single strand of churos was cheap at 6ish dollar.\n\nOther then that it's simply amazing to experience an US sport event. The atmosphere is so much more fun than that at a random Dutch sport event. Everybody is dressed up, the crowd is enthusiastic, there's tailgating, there's someone sweeping up the crowds during the game and there's the national anthem, which I guess some will dislike but I really thing it brings some sense of bonding.\nShow less"], ["Reviewed October 3, 2017", 3.0, "House of San Francisco Giants", "Beisbl House of San Francisco Giants, close to bay with store of souveniers for all ages with lot of clothers of Giants"], ["Reviewed October 3, 2017", 5.0, "Baseball game", "Very fun place and great view of the ocean. Best food I’d say is the crab sandwhiches or even the shrimp sandwhich."], ["Reviewed October 3, 2017", 5.0, "Good Experience", "People are nice, location is nice, and I don't mind the stadium. However,the Churros are terrible. friendly staff, awesome food/drink choices and a beautiful view!!"], ["Reviewed October 3, 2017", 4.0, "Octoberfest at AT&T park", "Had the chance to see the Giants play during our recent family vacation in SF. Nice ballpark and smaller than I had envisioned from TV. Good place to watch a game with all of the seats providing a good view. We went for the Octoberfest game and were'nt disappointed. $1 hot dogs all night and while a beer is $10 we didn't break the bank to enjoy the evening there.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Going to the baseball at AT&T Park was a buzz", "Never having been to a baseball match in America it was a fantastic experience to see the Giants play at AT&T Park. Surprisingly, this Park has incredible views of the bay from several directions. The Park is well arranged, fantastic seating and views of the game from all locations and the food and drink options were excellent. Plenty of facilities and clean and safe.\nBelieve it or not, you can buy a hot dog for $1.00 and then help yourself to the lettuce, tomato, sauce and mustard!!!\nShow less"], ["Reviewed October 2, 2017", 5.0, "What a great place to see baseball", "I love baseball and this has to be one of the best ballparks to view a game. Can see the bay and good views from all seats. If you love baseball do not miss this park."], ["Reviewed October 2, 2017", 5.0, "First Rate Ballpark", "I'm not a huge baseball fan, but I really enjoyed the tour of this top notch ballpark with awesome views."], ["Reviewed October 2, 2017", 5.0, "Last game of the season - great!", "Managed to get a ticket to the last game of the season. Having never been to a baseball game I was unsure what to expect, but it was brilliant! If your in town, and there is a game on, go!"], ["Reviewed October 2, 2017", 4.0, "Must see major league park", "This is one of the best ballparks in the country. And probably one of the most expensive for food and drink. But what a great selection (too many to list). When the Giants are killing it the tickets are pretty expensive, but not this season! Find a nice day to sit in the bleachers or even secure club level tix. Make sure you arrive early to take a walk all around the park, inside and out, all levels. Pro Tip - for good quality beer in large format, visit Great House of Brews on Promenade level, section 114 - expensive but worth it.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great way to spend the evening", "Whatever team you are cheering for baseball there's no park as beautiful as the giants stadium in San Francisco. Only thing better is another World Series ring!"], ["Reviewed October 2, 2017", 5.0, "Excellent Ballpark", "This is the best baseball park I've ever seen. Good food, good drinks, and stunning views of San Francisco Bay. If only the Giants had played better this year..."], ["Reviewed October 2, 2017", 5.0, "The best baseball park in the USA", "Easy to walk to this excellent baseball venue from Union Square. Even if baseball isn't your thing you can watch the boats in the bay from the stands. Excellent facilities, lots of food & plenty of merchandise."], ["Reviewed October 2, 2017", 4.0, "Worth a visit if you have never seen a baseball game or even if you have", "Terrific stadium with plenty of seating. Great kids area and plenty of food and drink facilities. Easy to get to and great transport links."], ["Reviewed October 2, 2017", 5.0, "Our first Ball Park Game", "Prior to arriving in SF, I booked tickets to watch the Giants v the Colarado Rockies online. The tickets were very reasonable in price. I did my homework beforehand a paid a little extra to reserve seats in the Premium Lower Box (109). Great choice as we were close to all the action. The stadium was lovely. Great atmosphere and the view was amazing. Although the food and drinks are pricey, it was worth it for the experience. Bonus for us was €1 dollar hotdogs that evening. We got an E directly to the ball park from the Ferry Building which cost $2.75 each. The staff were very friendly in directing us to our seats. There were plenty of taxi's outside when the game had finished. Just walk accross the road and you'll see them all. It cost €15 back to our hotel on Fisherman's wharf. What a fab evening and to top it off, the Giants won.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Great day out to experience American Culture", "We visiting SF for first time and pleased to have pre-booked tickets to the last game of the season\nStaying in Union Square and we decided to walk - was a comfortable 30 mins\nReally impressed with the ease of entry and well oiled machine that coped with the 38k supporters. Hardly any queue time for food/ drink, and toilets clean. Food etc standard higher price as per any stadium anywhere around the world.\n11 year old daughter purchased giants shirt and got into the spirit of the game with all the others in supportive orange.\nGame a good 3 hours and an exciting end in the last inning with SF hitting a home run into the Harbor awarding them the winning run agains San Diego\nA must if visiting SF - AT&T park accessible and amazing outlook over the harbor\nShow less"], ["Reviewed October 1, 2017", 5.0, "Giants game", "Fabulous venue for a game. Great variety of food and drinks. By far the best that I have experienced in going to games. Go giants."], ["Reviewed October 1, 2017", 5.0, "Stunning Stadium", "We loved this stadium! It's amazing to be able to see the sea. The atmosphere of the ball game is so much fun - enjoy!"], ["Reviewed September 30, 2017", 5.0, "Great night at the ball park", "It's the end of a season which quite frankly has been a stinker for the Giants and I'm sure most fans would rather forget. How do you go from being World Series winners to first draft contenders in 4 years?\nAs a Brit I don't get to baseball that often so this was just a great opportunity to go watch a game at one of the iconic ball parks. Not many stadium can boast the setting of the AT&T.\nStub hub gave me plenty of ticket choices and is fully integrated with the Giants. Why would you buy from the box office when you can get such a great deal on the reseller market? It's the first time I've used them but will not be the last.\nThe staff were friendly, the food in the club section was a step up from the usual ball game food. The Giants won 8-0 and in doing so avoided all possibility of losing 100 games this season.\nWell done Nick Hundley on winning the Willie Mac this year and standing alongside some illustrious Giants.\nOn nights like this you can see why baseball has such a special place in the American phsychy.\nGo watch a game at the ball park. It may not be as great a night as mine but you'll still have a fab time\nOh and no matter what the day time temperature don't forget to wrap up with layers. Hardcore Giants fans turn up with club colour blankets...\nShow less"], ["Reviewed September 30, 2017", 4.0, "Amazing view", "We try to go to a ball game whenever we are on vacation so of course we got lucky the Giants were in town. I was not impressed when I entered the park but the view from the stadium was amazing. You can see the skyline and the bay. Glad we made the trip.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Beautiful Ballpark", "If you are visiting San Francisco during baseball season, this is a must! Beautiful park with great views. Checked another park off the list"], ["Reviewed September 29, 2017", 5.0, "This place is a gem!", "We visited AT&T Park a few weeks ago to watch the Giants play a few night games. This ballpark is amazing. The views of the bay and the architecture of the ballpark make this place very unique.\n\nMost seats are great, but be advised that on the first level there is an overhang after row 29, and you can’t see the entire scoreboard or how high the ball goes after it is hit. Otherwise all the other seats are unobstructed view. When you walk in the ballpark, opt for the escalator or you’ll be walking up a winding ramp for a while. Also, the foggy, breezy air does get cold at night, so wear a jacket.\n\nOnce you get to the main concourse, you’ll be greeted will many tempting food options. At our first game we had the Mission Street burrito and burrito bowl, and they were both a huge portion and excellent flavor at a total cost of $25. Later in the game we walked out to the Ghirardelli ice cream stand in left field and had the hot fudge sundae. They tasted great, but it cost $24 for two sundaes, so enjoy them as much as you can.\n\nOn the second night we had chicken tenders and garlic fries. Everyone says that you have to eat the garlic fries, but a chicken tender basket with garlic fries costs $15, and I can say that they did have a lot of garlic, oil, and parsley, but I didn’t think it was very spectacular or worth that amount of money. The garlic was kind of bitter and overpowering, and seemed to just be the kind you get in a jar rather than fresh garlic. Also, a soda in a collector cup costs $8. You really need to have about $100 if you and your date want to eat and drink well at this ballpark. Otherwise they do allow outside food and sealed beverages if you are on a budget.\n\nOverall, this ballpark provides a great baseball experience that every MLB fan should see and enjoy.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Great bay views!", "Arrived using the E streetcar which drops you off right outside the ball park. Lots of people milling about but didn't take too long to go through security checks & inside.\n\nOur seats were great for a view over the water in section 311, although you did tend to watch the boats more than the game!! We purchased tickets through Stubhub a month or so before the game & had a great price.\n\nOur only disappointment was the lack of atmosphere we had previously felt at other games (NY Mets) There it seemed more was going on in the down time regarding audience participation & giveaways etc, which we felt the Giants game lacked.This is what I think US baseball games excel at, good family days out.\n\nHighly recommend a baseball game for any tourist to experience how friendly a US sporting event can be.\nShow less"], ["Reviewed September 28, 2017", 5.0, "The best ballpark", "This is the best ballpark in the country. The location tucked into the bay is genius. I recommend 1st base 2nd deck so you can see into the bay and watch baseball. The food is stupid good with fabulous wine selections. My favorite was oysters on the half shell! Baseball going Foody paradise.\nShow less"], ["Reviewed September 27, 2017", 4.0, "Fun!", "Fun night out with my partner to see the game, stadium is looking out over the ocean, during special games the boats come and park outside the stadium to listen and hope to catch a home run."], ["Reviewed September 27, 2017", 4.0, "Beautiful stadium", "Go... even if you aren't a baseball fan. You can walk a 360 around the entire stadium. Look out at the Bay and see the kayaks ready for foul balls. Good food... not the best stadium food I've ever had but good. Crowd was not as raucous as I'm used to at Citi Field but Cali is just generally more subdued.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Friday night game", "Game was boring but great atmosphere. The food was also good and you could chose from a variety of foods."], ["Reviewed September 25, 2017", 4.0, "Giants baseball", "Great place to catch a game. Get there early and walk around the stadium. McCovey Cove has the kayaks. Be sure to try the garlic fries!"], ["Reviewed September 24, 2017", 5.0, "Great Introduction to Baseball", "We went to visit the park and coincidentally the San Francisco Giants were playing against the Colorado Rockies. My son wanted to watch the game so we bought tickets. The staff were friendly, welcoming and helpful. We received first game certificates. It was fantastic to see the underdogs San Francisco win 4 to 3 in the 9th innings. The hotdogs were awesome, we were lucky to get them for $1.00 each.\nShow less"], ["Reviewed September 24, 2017", 5.0, "If you like baseball, then this park is a must-see", "This is one of the nicest parks in the world. After the Baltimore Orioles started the trend of homey stadiums, others went and built on that legacy. This place adds to it all. Seats are great, views are super, and the food is interesting (expensive). Made a special trip across the country to go to this place for my birthday, and it delivered. So, go. Simple as that.\nShow less"], ["Reviewed September 23, 2017", 5.0, "S.F. Giants VS. Dodgers", "Great Views! Great Food! ALL-AMERICAN Experience! Plenty employees, numerous food/drink options particularly at the very top (most options)."], ["Reviewed September 23, 2017", 4.0, "One off the \"Bucket List\"....", "Since AT&T park opened in San Francisco opened, I've wanted to see a game there, and I did...9/13/17 Dodgers-Giants, two old NYC city teams. The Park is beautiful, easy to enter (with ticket of course!!!), wide, inclined walkways, etc. I had great seats, row 5, seat 7, section 126. I was sitting next to two mothers and their young children. About 2nd inning 5 young and drunk people decided to move down to empty seats behind us and preceded to use foul and nasty language toward Dodger players and 3rd base coach...on numerous occasions, I and others would turn and tell these nitwits to watch the language...they would quiet down for a few minutes, then start up again. They even told their friends that they had strangers buy more for them...cut off? Finally around the 7th inning they were tossed out of our area and out of the park, but it was too late for me and the moms/kids, we left. Giants should do better crown control of drunk, obnoxious \"fans\" (???). It didn't ruin my experience but sure put a dent into my enjoyment, I gave a \"very good\" rating for the park, seats, but please try to control the \"nitwit\" factor, and have ushers patrol the area more to spot unruly behavior.\nShow less"], ["Reviewed September 22, 2017", 5.0, "1st ball game", "Attended a ball game for the experience and really enjoyed the experience. A very well organised sporting facility . Awesome selection of food and an amazing view ! We made sure our seats were facing the bay and we weren't disappointed ! I would recommend somewhere between home plate & 3rd base at view level . We got our tickets on stubhub would highly recommend them too . AT&T sent me updates and reminders about transport and the game . Will go there again when next on SF\nShow less"], ["Reviewed September 22, 2017", 5.0, "ABOUT THE BEST B BALL PARK IN THE MAJORS", "wow and did I say wow,, have been there 4 times and no other park can compare to the giants park ,,food is awesome ,views are beyond awesome ,just a great experiance all around ,I would highly recommend att to any b ball fan ,grade 10 out of 10\nShow less"], ["Reviewed September 22, 2017", 5.0, "Best Ball Park in MLB", "Great park - neat site lines . First class park gotta see it . I walked around before the game and saw The Willie Mays statue in front and Mccovey cove ."], ["Reviewed September 22, 2017", 4.0, "Real family atmosphere", "was lucky to be given tickets in the club level so had awesome seats. Great friendly atmosphere. easily accessible from the center of San Francisco\nPlenty of food options, I had a delicious chicken burger $12 so fairly comparable to prices in the city but drinks are expensive even soft drinks; $12 for draft beer.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Always fun to visit", "Great place to watch a game, drink beer and cheer for the home team! The brat was okay this time, under cooked. Someone stole my wife new Giants hat, not cool. I have a higher opinion of Giants fans, maybe I'm wrong."], ["Reviewed September 21, 2017", 4.0, "and if the game is not a great one, the food and refreshments are better than you would expect", "it should be about the game, but the Giants are so poor this season that you should not expect a win. I would go as far as to say as poor a team as there is to watch currently - ah well, every dog has it's day and the Giants had theres a few years back\nBig money machine - the team and coaches need a hard look\nShow less"], ["Reviewed September 21, 2017", 5.0, "Great experience", "We went to watch the Giants play the Rockies and loved it - was a great game but the whole experience was awesome. Easy to get in and out of stadium - we walked from Union Square which took about half an hour. Food & entertainment good\nShow less"], ["Reviewed September 20, 2017", 5.0, "Great Game", "Watched the Giants beat the Rockies in the bottom of the 9th. This stadium is great, very clean and friendly staff. We took an Uber to and from the game. We were dropped off and picked up right in front of the doors (no need to worry about parking).\nShow less"], ["Reviewed September 20, 2017", 5.0, "Loved it!", "If you're a baseball fan you MUST attend a Giants game in this beautiful park! Great food and an intimate feel. Friendly staff who were quite helpful. The tour was so-so--it will not impart the same feel as spending a few hours watching a game. Great restaurants and bars surrounding the park as well. Spend the day!\nShow less"], ["Reviewed September 20, 2017", 5.0, "What a fun place!", "Being from St Louis (Go Cardinals!) we were a bit skeptical about visiting the enemy's home turf but the experience could not have been better. This is a fun place, to say the least.\nThe only mistake that we made is that we had eaten a meal a couple of hours earlier. There are so many quality vendors with more than the usual ballpark fare that we couldn't begin to try them all. If you go, consider the $18.00 Crab Sandwich and the garlic fries. Ghirardelli Chocolate has a great selection of desserts.\nThe atmosphere is very \"up\" and the displays of the players and teams are first-class.\nMcCovey Cove is a real treat.\nIf you are in the Bay Area during the baseball season, this is a must.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Top Notch", "We hadn't eaten dinner yet. So I ordered Polish Sausage, and my wife ordered a Bratt. When we got them from the vendor, we promptly switched. Don't skip the garlic fries. We settled into our seats in the Club Level ($100) along the 3rd base line. Joe Motana threw out the first pitch, and that was the highlight for the Giants as Clayton Kershaw took the mound.\nShow less"], ["Reviewed September 20, 2017", 5.0, "A Giant experience by the bay", "If you are visiting a city in the states as a tourist during the baseball season you really have to take in a game. America's game, a real experience. Sport, razz-a-ma-tazz, fun, food, spectacle, great. Where better to have this experience than at AT&T Park with the San Francisco Giants, eating a hot dog and garlic fries with a beer while watching the game in the stadium always voted as the country's most spectacular. Go. Enjoy (and for UK sports fans, it's surprisingly cheap compared to what you will be used to!)\nShow less"], ["Reviewed September 20, 2017", 5.0, "Awesome stadium!", "Seriously what an amazing stadium. I'm not even a huge baseball fan but the setting is in incredible. Overlooking the bay while watching a game is perfect. Be prepared for insanely expensive food and drink prices though (16 dollars for a beer and 18 for a crab sandwich)\nShow less"], ["Reviewed September 19, 2017", 4.0, "Gotta See This Place", "While visiting our two ten year old grandsons their mom suggested we see a Giants game on a Friday night. What a fun place. They did a beautiful job with this venue. Even if you weren't interested in baseball or football visiting the ball park is a must.\nWe got there early and did a walk through of the park. Our grandsons couldn't wait to show us their favorite spots. The food choices are amazing...everything from hotdogs to Mediterranean. The seats were great and the fans were enjoyable and well behaved. The location is excellent for all modes of travel...Bart, ferry, parking = plus we understand that the area around the park has benefited greatly. Nice way to spend either an evening or afternoon.\nShow less"], ["Reviewed September 19, 2017", 5.0, "First Time watching Baseball at the stadium 😄", "I met a new American friend and he invited me for a Baseball Game at AT&T ball park. It's very exciting and enjoyed the game there."], ["Reviewed September 19, 2017", 4.0, "Nice tour", "We took a tour here and had a great time. The tour was led by a nice guy (can't remember his name). We had a nice time and took great pics. We learned a lot as well. Go Giants!"], ["Reviewed September 19, 2017", 4.0, "Giants game fun", "Sent the guys to a Giants game when staying in the City. Ubering was a challenge due to the traffic, but it is walkable and felt safe if you're staying downtown. They enjoyed the game and loved the park."], ["Reviewed September 18, 2017", 4.0, "Giants played the Diomondbacks!", "We are from Arizona and happened to be in San Francisco when our home team was playing there! We are used to an indoor ballpark and came prepared for cooler weather: we brought a blanket. It was fun to be in a different ballpark. We had heard that the garlic fries were a must and we really enjoyed them. The Ghiradelli ice cream was a real treat also. And to top it all off, the Diamondbacks won!!\nShow less"], ["Reviewed September 18, 2017", 5.0, "Love this ballpark!", "As a Boston Red Sox fan, I find it hard to live any park more than Fenway, though AT&T is almost right up there. The setting on the Bay is fabulous. Great selection of ballpark food and drink. Good fans too!"], ["Reviewed September 18, 2017", 5.0, "Mama/Daughter Trip", "The top of my daughter's bucket list was to see her beloved Giants at home. Just wish they could have won. We still had a great time despite losing to the Dodgers #rollinmyeyes"], ["Reviewed September 18, 2017", 4.0, "One of the Best", "Went to a Giants-Dbacks baseball game...Giants won. If you are new to baseball, AT&T is a great venue to visit because the Giants' fans are really supportive of their team and make the experience fun. Food/drink vendors are numerous but be prepared for sticker shock. Don't waste your money on lower level seats. Second/upper level decks are fine and with the increased height of the rows versus most of the lower level, you probably won't have the big guy in front of you blocking the view. Walk or take public transportation because parking and post game traffic can be challenging.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Amazing views", "We first went for a tour of the ballpark before the game which was awesome. Then the game that night. Great area friendly people great views inside and out. Clean accomadating fantastic ballpark"], ["Reviewed September 17, 2017", 5.0, "One of the best parks in the country", "Great food and great fans and usually great weather (though always bring your layers), this is a great place to see a baseball game. There's also a place to view the game from behind the outfield for free - great if you only have a little time but still get some of the experience.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Let's go giatns", "We went here to watch the giants, the atmosphere was really fun! The stadium got packed, the staff were helpful and the park is well organised. We love coming the baseball when visiting the US."], ["Reviewed September 16, 2017", 4.0, "Great time", "We were on a motorbike trip from Canada and were able to take in a Giants game at AT&T Park, fun to watch the crews scramble to cover the field when it rains a bit, uncover it and then cover it again. After 2 hours they finally got going. The park is beautiful, the amenities are fantastic, had a great time.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great place, lots of fun....", "My first time in a baseball and I had a nice time, great facilities, environment, food, drinks and central location."], ["Reviewed September 15, 2017", 4.0, "Love the ocean front location and the layout", "We went there for a ball game. Really liked the relaxing feeling inside. In the home run zone, the park has slides for kids. You can walk around easily to see the ocean."], ["Reviewed September 15, 2017", 3.0, "Great Ballpark !", "Great ballpark to watch the game and see the bay. We encountered a very rude worker while their that made our stay uncomfortable but as far as the ballpark it was amazing."], ["Reviewed September 15, 2017", 5.0, "Giants Game", "Attended a Thursday night game. Weather was great, which helps. Were seated first row of the 200 section behind third base. Walked to Stadium from Union Square, which was doable, but a bit hot (during heatwave). Beautiful stadium with very nice view of the bay. Concessions fairly expensive, but not unusual for a stadium. A must visit for baseball stadium fans, and pretty enjoyable for those who do not particularly care about baseball.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great park; Too bad the Giants can't win", "This is a terrific ball park with good food at all levels, but the best food is at the Club level where the variety is excellent."], ["Reviewed September 15, 2017", 4.0, "For Everyone", "AT&T Park has focused on entertainment value for everyone since its inception. Built near the water so when baseballs are hit over the right field arcade they splash in McCovey Cove. There are areas for children entertainment. Enough visuals (banners, pictures, food boards, etc.) to keep you spinning as you walk around the park. The Park was built to see the action on the field. You can walk the perimeter without missing any on field action. Food stops are a must. Maybe the most eclectic food selections of any professional sports park in America. However, be prepared to spend $$$. The experience is worth the price of admission, but you'll continue spending until you leave.\nShow less"], ["Reviewed September 14, 2017", 5.0, "My Happy Place", "LOVE, love, love this place! Every single employee you encounter is happy, the park is gorgeous and so many options for food and drinks! I will actually be going back this Friday night, and will be smiling the whole time!! You have to go experience this place....:)\nShow less"], ["Reviewed September 14, 2017", 5.0, "It's a Hit!", "Haven't been to a ballpark in many years, so it was a treat when my son took me here during my San Francisco visit. Great seats along the first base side and in the shade. Definitely a plus since it was close to 100 degrees the day we went. Enjoyed watching a home run into he bay and see a kayaker turn over trying to retrieve it. Skipped the street parking by using Uber.\nShow less"], ["Reviewed September 14, 2017", 5.0, "BASEBALL!!!", "An evening baseball game when out of town is always a fun way to catch up with old friends. We used Uber to get there so I cannot speak to the parking. I can speak to the overall friendliness of every worker we came in contact with. Our seats were in section 117 ---very nice view!! And ...we had THE most amazing Lobster sandwiches EVER and iced cold beer. Not going to lie -- it was an awesome night.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Great park and lots of employee assistance everywhere!", "Get there early and walk around the promminade deck. Lots to see and do! Great views of the bay and city."], ["Reviewed September 14, 2017", 5.0, "Beautiful Park!", "My family very much enjoyed watching the Giants vs. Brewers at AT&T Park. It is very beautiful and clean, although very expensive, as are all baseball parks, although this one seemed more expensive than other MLB parks we have visited. Still worth the trip if you're a baseball fan.\nShow less"], ["Reviewed September 14, 2017", 4.0, "Baseball Stadium", "This park situated on the southern beach area of San Francisco Bay has a base ball stadium..We witnessed one match on a Sunday being played between San Francisco Giants and another team.Outside the stadium the statue of a Baseball player attracts the visitors. Location of the park is nice .However I am not a connoisseur of baseball\nShow less"], ["Reviewed September 13, 2017", 5.0, "First Time at AT&T Park", "Big Giants fan - first time seeing them at home. TV does not do the stadium justice! This is an awesome stadium and lots of fun!\nOur security guard 'Righty' was the best - so friendly and helpful!\nFood was awesome and since it was so hot, the stadium provided cooling stations and the bars had free ice water.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Love AT&T Park", "Everything here is great! Parking lot down the street is $30.00 a water bottle is $5.00 If you have children going to a game, try to go on one of the nights with fireworks."], ["Reviewed September 13, 2017", 5.0, "Beautiful location for baseball fans", "ATT Park is such a wonderful experience whether or not you are a baseball fan. The view of the Bay, the huge selection of local food, and the friendly fans makes this a must visit."], ["Reviewed September 13, 2017", 5.0, "Baseball", "AT&T park is a beautiful venue, it has spectacular views of the bay no matter where you sit. Always so much fun to go there weather it is a baseball game or a concert. My favorite level is the club level."], ["Reviewed September 13, 2017", 5.0, "UBER UBER UBER UBER", "You guessed it guys UBER here from anywhere in the city and it will most likely be cheaper than parking in there over priced lots!\nGetting dropped off and picked up is pretty easy once you get it all figured out. The Park its self is AMAZING!!! Super clean and what seems like one employee for every guest. There friendly and very helpful! The price to watch a ball game is going to cost you big bucks for any kind of decent seating. How ever they do have cheap seat tickets available. Nose bleed section were $6.00\nThe night we were there. Our tickets second level behind home plate $111.00 ea. So do your home work!! Absolutely beautiful Baseball Park! With gorgeous views. Super fun to walk around the park and take it all in.\nHAVE FUN!!!\nNOTE: AT&T park has many several disabled employees, that are hard working and very helpful. This was pleasing to see, some with severe life altering disabilities doing jobs such as hosting and greeting guests and giving them directions to seating!! GREAT JOB AT&T PARK!!\nAMERICA LIVES HERE!!!!\nShow less"], ["Reviewed September 12, 2017", 5.0, "Giants Game", "This park has a great location right by the water. It takes a while to get down there on a week night, due to traffic and pedestrians, but the trip home was very quick."], ["Reviewed September 10, 2017", 5.0, "Best view in all sports?", "I love it here. I have been to many games and sat in nearly every part of the stadium and there isn't a bad view. The tour is highly recommended and the tour guides are very friendly and incredibly knowledgeable. You won't be disappointed. Ball park food and beer are as always, over-priced for stadium food, but if it's a one off, treat yourself! At least to Garlic Fries and a local brew!\nShow less"], ["Reviewed September 10, 2017", 4.0, "One of the best venues in the Major Leagues", "AT&T Park was the 53rd stadium that I've visited to see Major League baseball. I had heard that it was a great venue and was not disappointed and would rank it near the very top of those 53 stadiums.\n\nA couple of friends and I walked around the outside of the stadium before the game and then after entering, walked around the inside. A couple of negatives - the concourses are not as wide as in some stadiums and can be crowded and there are several rows of seats in the rear of the lower level sections that are far under the overhang and therefore do not offer a clear view of fly balls.\n\nOur seats were in the 200 (club) level between home plate and third base and offered clear views of the entire field. This section has an enclosed area behind in case the weather outside becomes disagreeable. In our case, the weather was beautiful. There is also in-seat wait service for those that don't want to miss any of the game action.\n\nAlthough the Giants have had a very disappointing season, the crowd for the late season game that we attended with still large and enthusiastic. All in all, a great experience. Would love to go back some time in the future.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Ball game", "The Ball Park is the best . Another game on Tuesday night. Can wait to get back to the ball park!!!!"], ["Reviewed September 9, 2017", 4.0, "Definitely go to a game!", "We enjoyed a great evening here watching the Giants play! The Stadium is easy to get here - we actually walked to it from our hotel. They even have vegan hotdogs for those who don't eat meat. I did feel like there was not great food and snacks here. We visited Dodger Stadium and they offered lots of unique foods and snacks and also had some really tasty and healthy options. I had to walk quite a ways just to find pickle relish for my hotdog! For some reason it wasn't put out with the other condiments. I also felt like the staff at the stadium and food venders were not all that nice. But we do enjoy watching a game and I do think it is a fun thing to do when you are in SF.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Catch a baseball game", "AT&T Park is a beautiful/comfortable place to catch a San Francisco Giants baseball game. We splurged on expensive tickets. The club seats are ideal - place a food order and they deliver to your seat. Do this once for a true slice of America."], ["Reviewed September 7, 2017", 5.0, "Great ballpark", "Great ballpark, food was amazing definitely best hotdog I have ever had!!! Seats have great views of the field and bay. Atmosphere as fantastic!!!"], ["Reviewed September 7, 2017", 4.0, "Very nice", "I saw the S.F. Giants play the St. Louis Cards during the Labor day weekend. I was very impressed with the stadium. I sat in the 200 level section. It offered a great view of the game and it being a very hot day, I could go in the enclosed concourse and cool off. They had a very large selctions of food and drink, if you are a baseball fan and are in town you must see a ballgame here.\nShow less"], ["Reviewed September 7, 2017", 4.0, "A great day out", "This place is a great visit if you are in town and they are playing. I have to be honest I am very far from a baseball fan- there is just not enough happening BUT that said the day out at the ball game is amazing. We caught a September game and the weather was scorching hot. Our tickets where in the bleachers looking out over the whole bay with amazing views. You can also freely walk around the stadium and catch different angles and there are some standing room only spots over by the water which is a great spot. Lots of people actually rent kayaks outside the stadium and are in the bay waiting on home runs I guess and just chilling(I would recommend this for sure if the weather was good)\nThe downside to the whole experience was the cost. The tickets we got where not expensive at 25 bucks each, but the snacks and drinks on the stadium are very expensive - 12 dollar beers and hot dogs the same - but it really is all part of the experience.\nEasy to get to by Caltrain and cable car both stop right nearby.\nTIP: don't over spend on the tickets as you can get lots of different vantage points from around the stadium and unless an avid baseball fan you likely won't be following too much of the game.\nShow less"]]}}