{"Badwater": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Badwater", "url": "/Attraction_Review-g143021-d116979-Reviews-Badwater-Death_Valley_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/e5/98/53/badwater-basin.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2288"}, "address": {"@type": "PostalAddress", "streetAddress": "Badwater Rd. 19 mi south of Furnace Creek", "addressLocality": "", "addressRegion": "California", "postalCode": "92328", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Awesome spot to visit in Death Valley", "Great views walk out onto the salt flats for awesome pictures. Lowest spot in North America. Hike up to a narrow canyon in the side of the mountain on the opposite side of the highway from the parking lot."], ["Reviewed 2 days ago", 4.0, "Beautiful and very historic movie location in Death Valley National Park. Great photo opportunities and salt findings al", "Absolutely beautiful area that once hosted numerous movie settings, slat production, Borax source and much more. This is a must see if one visits Death Valley National Park."], ["Reviewed 2 days ago", 5.0, "Another Interesting DV Walk at the Badlands!", "While visiting the Badlands below-sea-level sign provides a cool photo op, the best photos are achieved by walking about a mile to mile and a half out where you see the salt crystals has created some amazing patterns!\n\nAnother unique geological wonder of DV that shouldn't be missed!\nShow less"], ["Reviewed 3 days ago", 5.0, "Great site. Doesn't take a long time to visit.", "My husband and I walked waaay out, past all the tourists to get pictures without other people in them. The salt crystals get bigger and bigger the farther you wander. Being a rare site, it's worth seeing. I think we stayed less than an hour and got some fantastic pictures.\nShow less"], ["Reviewed 3 days ago", 4.0, "Nice drive", "A cool way to experience the salt flats. Several places to stop and take pictures and walk around for a closer look. Just a cool and interesting part of nature."], ["Reviewed 5 days ago", 4.0, "Lowest Point !", "We love doing extremes - this is the location of the lowest point in the United States at - 281 feet below sea level ! Down on the salt flats - we get to check it off our bucket list !"], ["Reviewed 6 days ago", 5.0, "Easy walk. Interesting", "Interesting area way below sea level. Be sure to look around and note the \"sea level\" sign high above on the mountain!"], ["Reviewed 6 days ago", 5.0, "Hidden Gem", "tThis was my second trip to Badwater. The first time, I was part of a photo workshop and the instructor knew exactly where to go to shoot the most stunning images of the salt crystals. As you walk down the salt path, the crystals to the left and right are unimpressive. But, if you are willing to walk further and about 1-1.5 miles, the crystals get whiter and more impressive. Still, they are not as impressive as the spot where the photo tour took us. That spot was about ½ way in between.\n\nAlso, sunset at Death Valley in late February is around 5:30pm. But if you want to get a nice sunset shot, you need to be at the park around 4:30pm since there is a mountain range to the west which will block the sun rays at 5:30pm\nShow less"], ["Reviewed 1 week ago", 5.0, "Salty landscape", "The blurry whiteness of the salty landscape is the first thing you will notice coming to the Badwater Basin, noted as the lowest point in North America (282 ft or 86 m below sea level). The entire place looks like snowy tracks but the temperatures can be really high here. That place is simply magical and beautiful. Taking a walk on the salt flats is like no other experience. I wish I could see that place during sunset!\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth to see it for a quick look", "I definitely recommend to see this, but I think that just quick look on this, experience the heat and take some pictures is enough. I don`t think it is worth to walk and follow the path in the middle of the valley. But that`s just my opinion :-)\nShow less"], ["Reviewed 1 week ago", 5.0, "A walk “under the sea” level", "This is it! The lowest place in North America. In fact 282 ft below sea level. As a proof take a look at the sign up on the mountain across the parking lot to remind yourself how deep you are. We were here in Feb and weather was perfect. Blue sky, sun and about 60 F. Take a walk into the lowland (for about half a mile out) to be right in the middle of the flats and enjoy the beautiful scenery and patterns created by the salt rocks. Feels out of this world...\nShow less"], ["Reviewed 1 week ago", 4.0, "interesant place", "the badwater basin is a interesant place for location and cultural interest. from other point of view, is a place un the middle of the desert, very hot without nothing interesting to see. you only have a parking place and a mark for a level sea. badwaters is really this two points of view.\nShow less"], ["Reviewed 1 week ago", 5.0, "Hottest Driest Lowest", "No visit to death Valley is complete without visiting the lowest spot in the Northern hemisphere. Really cool to see way up on the cliff above your head a sign indicating sea level. Definitely worth visiting in February, probably wouldn’t want to be there in the middle of summer.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Short walk to salt flats", "Badwater Basin, at 282 ft/86 m, is the lowest point in North America. There is a 1 mi/1.6 km trail to the edge of the salt flats, as well as a 5 mi/8 km walk to the other side of the salt flats. There is a decent-sized parking lot at the basin.\n\nWe visited the basin around noon on a Friday in November. Although it was crowded at the Badwater Basin sign with people snapping photos, not everyone takes the trail. We really enjoyed the peaceful walk to the salt flats and would have walked more had it not been so hot (86 deg F/30 deg C). At the salt flats, there are incredible panoramic views of the valley.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Lowest point in the Western Hemisphere", "Well worth taking the drive here so you could take a picture with that iconic sign. It was interesting to see the little bit of water still out there."], ["Reviewed 3 weeks ago", 5.0, "Badwater Basin", "The real reason we traveled to Death Valley: to reach the lowest place in North America. Good boardwalk to lead you onto the basin. Be sure to look up at the high rocks along the road to see the sign showing sea level."], ["Reviewed 3 weeks ago", 4.0, "Eerie, vast view!", "This area is so big and flat in comparison to the surrounding vantage points of Death Valley. This is at sea level and appears white in spots ( which almost looks like water in the distance, it's very dry as it is full of salt flats. The landscape is incredible. You can walk out a distance to get various views.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Second badwater visit - great winter wealk", "On our numerous trips to death valley NP, we reserve the badwater stop for our winter visits. It is a great feeling walking on the salt and knowing that you are in the lowest area in the U.S. Incredible 360 degree views of the above. Felt great to be able to take a nice warm walk in shorts in DV on a cold Vegas day. We made it halfway across the 'five mile trek' which we hope to allow enough time to complete on our next visit.\n\nWarning - Be prepared for salt stains you may get on your shoes.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Neat Place", "A place you must visit if your touring Death Valley NP.\nthe lowest point in North America and a nice place to get out and take a walk.\nlots of people but not too crowded or hot in January.\nMake sure to clean the salt off of your shoes!!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Come walk on the salt flats", "What I thought was a paved walk out to what must have been badwater was in fact a walkway of salt! There are interpretive signs describing badwater as you leave the parking lot for the salty walk- make sure you clean off your shoes because they will have salt on them after this walk. The salt formations to the side are amazing- narrow super white salt lines outline the geometric shapes. Very different from anything I'd seen before.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "280 feet below sea level", "Not what I would call beautiful scenery, but very interesting, especially if you read the signs explaining the history and why it is called Bad Water. You can go out and walk on the salt flats."], ["Reviewed 4 weeks ago", 5.0, "cool!", "Great stop to take a look around. If you are in the area I highly recommend you take the time to stop here for a little."], ["Reviewed 5 weeks ago", 5.0, "Special place", "Last stop on our dessert trip easy to walk and such an amazing place to absorb the diversity of this corner of the us"], ["Reviewed 5 weeks ago", 5.0, "as low as you can go in North America", "Cool place to see. Very desolate and eerie. Glad we stopped. The marker for sea level was very cool. Well worth the drive to get here."], ["Reviewed January 21, 2018", 5.0, "Worth walking far out to see the most unspoiled formations", "The lowest point on the continent is quite a sight, if you’re interested in collecting superlatives. Don’t forget to turn around while in the parking lot and look for the “sea level” sign high up on the cliff behind you. To see the hexagonal salt formations at their best, it is worth walking far out onto the basin to where they are less disturbed (the closer ones are rather trampled). Early morning and late evening/sunset can produce some dramatic lighting, especially if there is a thin layer of water over the salt crystals (not to mention that being a cooler time of day in the summer months, when the sun reflecting off the white salt can be very intense at midday.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Go to say you’ve been", "We walked out quite a long way to get photos but honestly if you’re not up for a long walk or you’re short on time, walking 100m out from the car park gives you as good a view as walking 500m out!"], ["Reviewed January 17, 2018", 5.0, "A must see!", "We enjoyed walking out on the salt flat. Very interesting. Make sure you turn and look back for the sea level sign placed above on the rocks. Went in late November so the temp was perfect."], ["Reviewed January 14, 2018", 4.0, "Prepare to walk", "Neat experience...be prepared to walk. Gets dark fast, so don't make the same mistake we did and get a late start."], ["Reviewed January 14, 2018", 3.0, "Not that great. Much better places in DV", "This was probably my least favorite DV sight. It was crowded, it's somewhat out of the way (30 mins by car?), and there's not much to see except a desert flat. Sure, it's interesting to know you're at the lowest point in the USA, but other than that you can spare yourself a 1 hour drive and see the exact same terrain farther north near town.\n\nTip: look up at the rock wall above the parking lot. There's a little sign 282 feet up that indicates sea level. It's hard to spot and is pretty cool.\nShow less"], ["Reviewed January 13, 2018", 5.0, "The lowest point in the USA", "If you want to know what it’s like to be cooked in a confection oven then Badwater is a must. This is the lowest point below sea level in the USA. 114 degrees with a 20 mile per hour wind is a unique feeling. The desert landscapes are awesome and this is a must see.\nShow less"], ["Reviewed January 12, 2018", 5.0, "No snorkeling gear needed even though you are 282 ft below sea level", "Although it seems like a deserted, lifeless salt flat, there is life at Badwater. Surrounded by mountains, this flat salt plain is a fun place to play football, take a long walk and, best of all, join a ranger hike to hear about how this area has evolved. No place like it!\nShow less"], ["Reviewed January 9, 2018", 5.0, "Like on another planet", "That's the Death Valley, the lowest and hotest point and most famous spot in this NP. Must see attraction."], ["Reviewed January 5, 2018", 5.0, "Lowest point in Northern Hemisphere!", "Badwater is an imposing and low key sort of place all in one. Having a good understanding of the geologic forces at work adds to how impressive the location is. So stop and read the signage. Understand what you are looking at and walking across. A few tricks, get there early. The crowd won’t be there yet. You won’t be alone, but there will be a few people, not dozens. Look up for the sea level sign. Stroll out far enough that you are the furthest out. It is worth the effort.\nShow less"], ["Reviewed January 2, 2018", 3.0, "Just to see it since we are in Death Valley", "Was it impressive? Not very much. And this is the place we saw most people in Death Valley so it was really popular. Honestly the view is better from Dante's view. Should you take a picture with that below-sea-level sign? If you were lucky to have no one in the background. There was a restroom nearby and it wasn't the worst in a National Park.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Definitely a Must Visit in Death Valley!", "The afternoon before, we got to see the sunset over Badwater Basin from Dante’s View and it was amazing. The next morning we drove to the Badwater Basin around 9:00am. The shadows were covering .25 mile into the basin (note for pictures), but the shade was almost completely gone by 9:45am.\n\nThe attraction is the lowest point in both North and South America. It’s cool just to visit a landmark with that distinction. The signage throughout gave a good description of the history and how the Basin formed. When you walk out on to the Basin, you’re walking on salt which accumulated there over the thousands of years earlier.\n\nThe Basin along with the mountains and blue sky offer the perfect picture opportunities. There were so many photographers with DSLR cameras there. The path goes about .6-.7 miles out but you can walk out further. There will be a lot of people out there, so it’s always good to get out early or during an off peak time.\n\nThere was a lot of parking in the parking lot along with bathrooms. It’s a 17 mile drive off the main highway to get there, but it’s mostly flat and not windy (unlike the drive to Dante’s View). This attraction is a must visit when at Death Valley!\nShow less"], ["Reviewed December 30, 2017", 5.0, "Impressive white salt desert", "Badwater is like a Russian doll - a white salt desert inside a gray rock salt desert inside the Death Valley. It is somewhat surreal place. The farther towards \"white stuff\" you walk, the more impressive it gets. However, the distance looks deceptive - the main white area is about 30+ mins away from the parking lot. Also, Badwater might be crowded and finding a parking spot could be a challenge.\nShow less"], ["Reviewed December 27, 2017", 4.0, "Saltwater", "At almost 90 meters below sea level this is a spot not to miss in Death NP. Walking out on the salt flat brings you another half meter lower to the lowest point (on land) in the Western Hemisphere."], ["Reviewed December 26, 2017", 5.0, "A Must-See", "You cannot go to the Grand Canyon without going to Las Vegas, and you cannot go to Las Vegas without going to Death Valley, of course. Needless to say we made these 3 stops in a week. Death Valley came in a close second against the Grand Canyon. Being able to stand on the point of the lowest elevation in North America was way too cool to pass up. In the summertime, it is one of the hottest places on Earth, so we decided on the winter, which was perfect in the mid 70s.\n\nI, highly, recommend that you just not take a photo by the sign, but actually go and stand on the salt flats. The experience of walking on almost 200 square miles of salt on the lowest point in North America is not an opportunity that comes up every day, unless you live close by, of course. You will be 282 feet below sea level. If you look up at the mountain by the parking area, you can see the sea level point, which is marked by a sign.\n\nThe experience was amazing, to the say the least. I just wish we would have gone to the highest point in the contiguous United States, Mt. Whitney, but we could not make it in the little time we were there, since it is a two and a half hour drive just to get there. On our next trip to California, we will make it a point to, not only go to Mt. Whitney, but continue exploring the rest of Death Valley, which is huge.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Must see", "At night if feels like you are in another planet, maybe the - not sure, because I have only visited Earth.\nThe sunset at Badwater is great and the sky gets colorful and it is very nice to take pictures and just hang with your soulmate or buddies.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Salty", "This is a frequently visited place in Death Valley, expect lots of people but be sure to stop and walk out on the salt flat."], ["Reviewed December 21, 2017", 5.0, "At the bottom!", "Hitting Badwater Basin and Dantes View is a good time. It's right around a mile vertical difference. Fun to look down to the bottom, and from the bottom up."], ["Reviewed December 18, 2017", 5.0, "A must see!", "It's an amazing place! From the basin, a marker on an adjacent mountain indicates where sea level is, adding perspective to what it means being 282 feet below sea level."], ["Reviewed December 17, 2017", 5.0, "walk out to the salt flats", "It is very flat, easy walk, (December2017). I am guessing I walked more than a mile roundtrip Might be too hot on a summer day. Walking on white salt flats. keep going, you will see Polygons in the salt."], ["Reviewed December 17, 2017", 5.0, "So Cool", "This was one of my favorite spots while visiting Death Valley. It was the most busiest too. We went to Death Valley during the week so not as many people as usual. Great for panoramic views and pics"], ["Reviewed December 15, 2017", 5.0, "A Below Sea Level Beauty", "This is truly one of a kind experience to be standing on salt flats. We had traveled to Death Valley during winter where days were warm and not extreme. With that being said, I couldn't imagine how unpleasant it must be during summer. Nonetheless, this one beautiful landscape!\nShow less"], ["Reviewed December 6, 2017", 5.0, "A place of extremes", "What can be said that has not been said about the lowest place in North America. Badwater is one of the most popular sites in Death Valley. The walk area is flat and photo opportunity is not far off the path. This is just one of the many locations off Badwater Road. If you go here, don't forget to make plans to see Artists Palette, Natural Bridge, Golden Canyon, Devil's Golf Course, and the elusive Alien Head rock formation. Sunset and night photograph is the best time for photos. Bring a rubber/foam pad or plastic tarp if you plan to sit out on the salt flats to spend the day or night, it's often wet and abrasive.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Hottest Point in North America??", "This is the lowest point in north america. I was wondering if it was the hottest too because i was totally fried up by the sun."], ["Reviewed December 1, 2017", 4.0, "Cool!", "This is the lowest point in North America, so it's certainly worth a look. The walk out from the parking lot is an easy 1/2 mile. Also, if you stop at the visitor center at Furnace Creek, you can check the times for the daily guided narration from a National Park Ranger. I LOVED that, on the face of the mountain (across the street!) there's a sign marking sea level! Really puts the place in perspective. Note: dogs, drones, & lots of other things are prohibited.\nShow less"], ["Reviewed November 30, 2017", 4.0, "Lowest Point in North America", "The basin is approximately 282 feet below sea level and is home to a vast expanse of white table salt. There is a boardwalk in place to avoid destruction of the many snails that live beneath the salt crust. There is a designated area for visitors to walk and view the salt basin. Quite impressive.\nShow less"], ["Reviewed November 29, 2017", 4.0, "Still impressive", "Visited one day in mid Nov 2017. Have been here once before 9 years ago and came back now with b/f. Salt flats seem more eroded since then due to tourism, need to walk further out now to get to larger, whiter salt expanse. Limited parking, toilet, pay station for DV passes, signs with information. Take water and sunscreen if out for any length of time, sun reflecting off salt makes area v hot. Look out for \"Sea Level\" sign up on cliff. Definitely worth visiting when in DV. Would considering visiting again if returning to the area.\nShow less"], ["Reviewed November 29, 2017", 3.0, "Interesting, nice place", "It's an interesting place but there were other places in Death valley I liked more. It's nice to stand so low under the sea level. teh salt plain was nice to see."], ["Reviewed November 27, 2017", 5.0, "Impressive natural phenomenom", "The size of the salt flats is impressive. After walking quite a distance along the salt you can find yourself completely surrounded by giant plains of salt, a spectacular view."], ["Reviewed November 24, 2017", 5.0, "Must See!!", "Loved Badwater. Walking out into the salt flats was a breathtaking site. make sure to turn around and see the sea level sign as you are 282 feet below sea level and in the lowest point of the contiguous United States."], ["Reviewed November 21, 2017", 5.0, "A must see", "A must see! Beatiful views, amazing paths. Pretty crazy to be standing so low undet sea level. Easy walk. Kids loved looking at salt cristals."], ["Reviewed November 19, 2017", 5.0, "My favourite spot in Death Valley", "Badwater Basin was probably my favourite part of one and a half days spent visiting various sights in Death Valley.\nI travelled in November and it wasn't overly busy. There was plenty of spaces in the car park.\n\nIt was an amazing place to visit. You can walk out into the salt flat and it's worth taking a good ten/fifteen minute walk away from the car park as you see the scenery change rapidly. A beautiful and awe inspiring place where you can catch some great photos.\n\nThere are toilets at the car park (holes in the floor pretty much) however if it is a bit too stinky for you - the main toilets in Furnace Creek are only about half hour away.\n\nMust visit if in Death Valley.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Will Be Hot Even In Winter", "OK, The valley does get cold during winter nights. But Badwater Basin is a couple of hundred feet below sea level and probably still actively dropping. But it's really the surrounding mountains that trap the daytime heat from escaping and keep it so warm. I suspect a violent earthquake someday might completely alter the weather pattern here. Meanwhile, this day, it's a treat to be able to hike all the way out onto the salt flats and explore. Like traveling to another planet. You'll see a special terrain here that you won't necessarily find in your surroundings back home. But when you arrive here, just don't snap some pics and go. Spend the day, carry lots of water, and keep walking. Bring binocs to take in the full landscape.\nShow less"], ["Reviewed November 13, 2017", 5.0, "A must, just a must.", "Badwater, which is part of Death Valley National Park is a spot everyone can and should go. If you can't walk far, no problem, parking is a breeze and there is an actual walk way.\n\nMost of Death Valley is not easy to get to. The heat can be all consuming and if your car breaks down in the middle of no where, that can be a real drag. Badwater is patrolled, and your car will get you there, but always take water into the desert.\n\nIf you go in the summer it can get up to 115 degrees with no problem and no warning. I usually go in the Fall or Winter. But Badwater is a place I am happy to travel to in June. The heat is all encompassing, but you are safe, your car is near, you have sunscreen on and a hat and a short walk will leave you hot, but amazed at the beauty that is Death Valley.\n\nThis is the lowest point in the United States, it is about 282 feet below sea level at points. The salt flats are pretty easy to walk on and there are more colors than you would think in this hot, unforgiving place. Reds and greens and an orange you have never seen before (unless you have been to Australia) or some parts of Utah. It is just beautiful and it is a must see, at least once in your life.\nShow less"], ["Reviewed November 9, 2017", 5.0, "One off the bucket list!", "The desert holds a strange, eerie beauty of its own and one that constantly calls me. To stand in this place and experience the heat, isolation and changing colours is something that everyone should do at least once!"], ["Reviewed November 9, 2017", 5.0, "Incredible Feeling!", "Wow, to think we stood on the lowest spot in North America, 282 feet below sea level! I was in awe to walk out on the salt flats and look up at the mountain behind me and see the ‘sea level’ sign!"], ["Reviewed November 8, 2017", 5.0, "bad water cause the donkey wouldn't drink it.", "AMAZING! I want to come back asap. its like being in a snow globe of a foreign World. lol I just want to come back already"], ["Reviewed November 6, 2017", 5.0, "Below sea level!", "This was a great stop while in the Death Valley National Park. There is a ranger to answer questions, and you can walk out for many miles on the salt flat. Be sure to take a picture of the sign far above the road marking \"sea level\"\nShow less"], ["Reviewed November 5, 2017", 5.0, "One of a kind spot", "Right on the highway is the parking for seeing the lowest spot in America. Take a stroll out onto the salt flats for a unique experience only found here. Look back at the rock face on the other side of the road and you will see a sign high up indicating sea level.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Beautiful Landscape", "We visited Badwater and Dante's view on the same day and were not disappointed. The sheer scale is awe inspiring and the heat at Badwater compared to the slight chill at Dante's View just added to the whole experience.\n\nWe loved the desert and the scenery was amazing. We are already talking about a possible return trip to Death Valley for a longer stay.\nShow less"], ["Reviewed October 31, 2017", 5.0, "DO NOT OVERLOOK THIS", "1 word - stunning. You park up and walk across the salt flats which are way below sea level. Amazing scenery. Points to remember. You must remember water and sun lotion. And try to avoid the public toilet."], ["Reviewed October 30, 2017", 5.0, "Lowest Point in North America", "To get to the actual lowest point, which varies according to wind & weather, you have to walk out about 3-4 miles at a 10 degree angle NW from the parking lot and salt walkway. This is not advised when the ground is soft but can be done without damaging the flats and so this I did. Amazing to stand at the bottom of North America in complete isolation and dead silence. Having visited all 7 continents, sailed across the Atlantic, swam in 4 of the earth's 5 oceans, and circumnavigated the planet twice I add this as as important a location or \"milestone\" as any of the others.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Interesting place to visit", "We always travel down the Badwater Road from Furnace Creek when we visit the park. It's still interesting to see the Sea Level sign high above the valley when you look up from the valley. Most visitors are taking pictures of themselves at the Badwater sign. You can walk out onto the salt flats if you wish. We visited in October and it was still quiet warm.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Salt flats", "Badwater are salt flats, it’s a 0.5 mile walk out on the salt flats, which is interesting but not a lot to see. The salt flats are below sea level at 282 feet below and the lowest point in the Western Hemisphere. Hot!"], ["Reviewed October 25, 2017", 5.0, "Salt and sweat", "It is very hot even in October so don't forget to take some water with you. The path to the salty valley is easy accessible and you decide yourself how far you wanna walk to the salty field. Funny sidekick is the sign above the parking lot with \"sea level\" on it.\nShow less"], ["Reviewed October 20, 2017", 3.0, "Too crowded", "The tour buses stop here so it was crowded. We preferred devils golf course.\n\nMany walk a little way out but if you have time you can walk further. It was hot so we didn't walk too far as we had already been out to the middle at devils golf course.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Excellent!", "It is worth to spent an extra hour at the National Park. It is a little bit hot, but very exciting. It looks like the Moon :)"], ["Reviewed October 16, 2017", 5.0, "Worth It", "Amazing spot to stop off and check out. Blows my mind to realize that people actually traveled through and lived in this area. Awesome!!"], ["Reviewed October 13, 2017", 5.0, "Lowest point in the western hemisphere!", "Although most of the nearby salt crystals are trodden upon by previous tourists, still a very cool salt flat. Even better if you visit Dante's Point as well, to see the same view from several thousand feet up!"], ["Reviewed October 12, 2017", 4.0, "Lowest Point in US", "The spot is the lowest point in the US but walking out into the salt flat isn't worth the trip. Nice to have a photo of you there but Devil's Golf Course is much better for viewing the salt flat."], ["Reviewed October 12, 2017", 5.0, "Hot!!!", "l walked out on to the salt flats as it was something l have always wanted to do, my other half has high blood presure so he went back to the car and ran the air conditioning which l was very grateful for when l got back, could not believe how hot it was!! take plenty of water, this was our second visit to Death Valley and could not do this on the 1st as the temps were 117 degrees getting out of the car was like getting into the oven!! this time it was about 105 degrees still extremely hot to us brits but a must do so glad l did.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Very interesting stop for a view and short hike of the Salt Flats", "This location is a couple hundred feet below sea level, and the major feature are the salt flats, which you don't encounter every day. Worth a short drive and a short hike."], ["Reviewed October 9, 2017", 5.0, "A place below sea level!", "This place lays below the sea level, i guess not many places like that exists. The Badwater basin is just a beautiful creation of mother nature and definitly worth a visit! Be sure to take water with you since the walk from the parking lot looks shorter than it is!\nShow less"], ["Reviewed October 5, 2017", 5.0, "Don't miss this", "This is the heart of Death Valley, so don't miss it, and bring your camera. It takes about 30 minutes each way from the visitors center. Once there you can walk out onto the salt flat as far as you want to go, just allow at least 30 extra minutes. Watch the temperature forecast; morning might be the best time to visit\nShow less"], ["Reviewed October 3, 2017", 4.0, "LOWEST, DRIEST, HOTTEST!!", "Death Valley was on my dad's bucket list but not, necessarily, on mine. However, I am sooo glad I took him and I would like to visit it, again, in cooler weather!\nBadwater Basin was amazing--I didn't expect the area to be so expansive. In fact, the whole area is waaay larger than I ever imagined!\nThere are toilets available at the parking lot. You can content yourself to just look out over the area from the railings at the parking lot OR you may walk down the stairs or ramp to read the informative signings and take a few photos. You may also walk out quite a ways on the area itself. Just pay attention to the heat and distance as what length you walk out, you must also walk back.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Absolutely Incredible!", "You must to stop here just to say you’ve walked on the lowest point in North America, and walk on the expansive salt flats 282 feet below sea level! Pretty impressive!\n\nBadwater Basin also used to have the highest recorded temperature on earth at one time measured at 134°F. Some place in Kuwait now claims a higher temp, but heck 2nd hottest is still pretty darn hot! We were there in the afternoon, and it was ONLY 108°F. Felt like a furnace! We only walked a short way past the boardwalk on to the salt flats, but many brave souls walked pretty far out. Just listen to everyone’s advice to drink and bring lots of water with you to stay hydrated. Temperatures like this can be deadly.\n\nWe visited later in September, but this park would be a great place to visit in winter when the temperatures aren’t as extreme. Death Valley is such an incredible place and is so different from any other national park. Highly recommend visiting!\nShow less"], ["Reviewed October 2, 2017", 4.0, "Definitely a bucket list item for me", "I grew up in the southwest but never had a chance to visit Death Valley, all though I had always wanted to. I took a spontaneous trip in July of this year when it was hottest, since that was also when I wanted to experience it most. No matter what time of year you go there are always going to be other tourists, and I was surprised to see as many as I did when I went. July is the hottest time of year down there; it was 124° when I went.\nIf you go, plan ahead and visit the park after dark to take photos of the stars. Bring plenty of water and be prepared for any contingencies; Death Valley is a very hostile environment.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Home to the lowest toilets in the Western Hemisphere - FACT!", "Yes that's right - Here you will find the lowest toilets in the Western Hemisphere - FACT! ha ha . It was 50deg c here about 2pm - took water and walked out on to the salt flats . HEAT! Loved It! Posed in front of the sign. Amazing sight. Oh and yes I went to the Loo .... well you have to - next one not until Furnace Creek Visitors Center.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Just Wow", "Just the fact you are walking on a salt flat is a Wow Factor on its own. Plus this is the location of the lowest point in the US. Its also the brightest part of the Park with Sun Hitting the Salt. The light shines so bright. In my opinion, it was the most visited site of the park. I would love to re-visit this site asap.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Amazing", "Great experience even for a pasty European loved the big skies and light definitely a memorable one combined with a good sound track ticked all the boxes"], ["Reviewed September 24, 2017", 5.0, "Walk as far as you'd like on Badwater", "I wish we had more time to walk further out than we did. Very interesting signs explaining Badwater. Interesting part of Death Valley and hard to believe that once there was so much undrinkable water. A great place to take a picture of your shadow."], ["Reviewed September 24, 2017", 5.0, "The lowest place in the US- what more is there to say", "Beautiful drive- the walk along the river bed is awesome. A definite place to see if you are at Death Valley."], ["Reviewed September 23, 2017", 5.0, "Badwater Death Valley", "Badwater is such a cool place to wander on the salt. I got there late evening but the light was still good that I got in some great pictures. It was still hot out even in the late evening. You are truly at the lowest sea level. The parking is free. Even in the late evening there are still a bunch of people walking around. When you are walking back to your car, look up at the mountains next to parking lot and you will see a sign that says sea level which really puts things into prospective on how low to the ground you really are. Take in the scenery, it really is such a cool place to see.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Long shadows over polished brilliant surface at sunset", "Walk as far as you can over the polished pathway heading to the river bed. There will be beautiful long shadows behind you. Do not wait until the start of sunset if you want to visit Artist's Palette."], ["Reviewed September 20, 2017", 5.0, "Must see in DVNP", "This is one of those things that you have to see you if you're at death Valley. You will be sorry later if you miss this one."], ["Reviewed September 20, 2017", 5.0, "High point in a low place!", "Easy flat drive to the lowest point in the USA. Good free car park. Walk out at last 400 meters and you will leave the crowds and coach parties behind. Take plenty of water. Although the walk is flat the heat really hits you. Well worth a visit.\nShow less"], ["Reviewed September 16, 2017", 5.0, "So hot!!", "An amazing experience at the lowest point in Northern America. 282ft below sea level and when you look up into the mountain it's marked. Scorching hot at 46c so we're delighted for our air con in the car!"], ["Reviewed September 10, 2017", 5.0, "How hot?", "Well if you go to Death Valley you've got to do the Badwater walk. It was 118degrees F when we arrived. It is a dry heat, though, so you can walk quite comfortably in it - for a short while. Cover up though and particularly wear a hat. Wanted to do the David Attenbrough 'frying eggs on a rock in the desert' bit but forgot my eggs! Lowest point in the USA.\nShow less"], ["Reviewed September 9, 2017", 4.0, "A \"must do\"", "THere isn´t really much to see expect a flat sea with solid salt. But, do your reading and the place will fascinate. When you see the mountains around the big \"sea\" - it becomes even more interesting.Extremely hot but close to parking."], ["Reviewed September 8, 2017", 5.0, "Great place", "Good place to visit here at Death Valley. People were walking on the sand which looked like water. On the rocks there is a sign saying Sea Level. So this place is well worth a trip"], ["Reviewed September 8, 2017", 3.0, "Long drive scenic road", "Visited in late August and it was still very hot. Didn't find the basin all that great considering it was a 10-15 mile detour one way. The long empty roads were a sight to see though. Lots of viewpoints along the way including a couple of trails but it was too hot to hike. Did I say it was extremely hot!!\nShow less"], ["Reviewed September 7, 2017", 5.0, "It was hot in Summer but anyway nice to be there though for some minutes taking pictures and enjoying the scenic view.", "Carry plenty of water, winged hat, clear clothing, skin protection. Walking on the salt pan can be a temptation but all that heat reflected upwards can be a hazard. Be alert to any sign of heat stroke."], ["Reviewed September 6, 2017", 5.0, "Hot!", "Very nice place to visit! Don't forget to look for the water level-mark on the mountainside. Bring your own water - there's no place to buy some. Extremely hot in the summer, 122 when we were her in July."], ["Reviewed September 4, 2017", 5.0, "Must-see and fun to say you've been to the lowest spot in North America", "It's amazing to see the white salt flats stretching out for miles and to turn around and see the \"Sea Level\" sign up on the hill behind you. It's just such a different kind of beautiful - so stark and forbidding - and well worth walking out onto the flats for as far as you can (depending on the heat).\nShow less"], ["Reviewed August 26, 2017", 4.0, "Lowest of the Low", "At 282 feet below sea level - the lowest elevation in North America - this is a must see spot. But, in my opinion, it's not the most scenic spot in the park. There's a short boardwalk that gives way to a tourist-trodden trail out toward the middle of Badwater Basin. We were there in November when temperatures were not too hot. But, with no protection from the sun whatsoever, you'll want a hat, sunglasses, and sunscreen if you walk out into the basin. Unfortunately, visitors are able to venture off the edges of the trail to such an extent that you won't find any pristine salt formations here. Nevertheless, it's a unique place worth seeing.\nShow less"], ["Reviewed August 25, 2017", 4.0, "Be prepared", "The thought is cool, it was cool, but in hindsight it’s a little foolish. It was 120+ and I thought I was going to melt. My wife was having immense trouble with her contacts and it was just too hot. Take a quick peak to say you were there and then you need to leave.\nShow less"], ["Reviewed August 23, 2017", 3.0, "Lowest part of the Americas", "I'm Dutch, so I know how it is to live below sea level. This point is about 85 metres below sea level. You can't find that in the Netherlands.\nPark your car, walk a little on the salt, take a selfie with the sign and move on.\nShow less"], ["Reviewed August 23, 2017", 5.0, "What an experience!!", "Really interesting to walk trough Badwater with 50 degrees Celsius outside & the wind feels like someone just opened the oven door and didn't close it.\n\nPlease bring lots of water with you and do not walk to far!! Even though you think it is not far away, in that heat, it is far!\n\nPs. We drove their ourselves and there are small parking spaces available.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Amazing!", "If you can bear the heat, this would be the place to walk on the salt rocks. It was boiling hot couple of days ago and it was 115°F when we were there. The scenery is out of this world. We had a friendly bird whilst we were there!\nShow less"], ["Reviewed August 22, 2017", 5.0, "Nice to see!", "This is a must do when you are nearby and exploring the Death Valley. It is amazing to walk it (be careful, very hot!!) and to be \"blinded\" by the sheer white plains."], ["Reviewed August 21, 2017", 5.0, "Don't walk too far!!!", "Visit this place early in the morning, you can walk out on the salt flat as far as the eye can see, not advisable however, an amazing place, turn round and you can see the sign on the cliff that shows you where the sea level is amazing views, don't forget your flask of water your sweat just evaporates!\nShow less"], ["Reviewed August 18, 2017", 5.0, "Awesome", "The history of the area is interesting. And how the area got its name is interesting.....due to a mule that would not drink the water. You can get close to the salt formations on the ground. You will see water despite the desert conditions. You can also walk into the dry lake bed if you want to take on the high temperatures. This is one of the scenic stops within Death Valley that you see pictures in advertising.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Go very early in the day!", "At 282 feet below sea level Badwater is the lowest point in the USA, making it also the hottest place. Located 85 miles away from here is Mt Whitney, the highest point in the continental US. Directly above Badwater you will find Dante's View.\nThere's an interesting display of educational signs. The marker informing you of sea level is located is behind Badwater on a cliff. You can walk across the salt flats. However, much more spectacular scenery can be found along the same road at Artist's Palette Drive, Golden Canyon, and Natural Bridge.\nThis attraction is best visited early in the day, before excessive heat can make this a rather miserable place to experience.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Lowest point in North America", "At 282ft below sea level this is the lowest point in North America. A very flat, very hot (115F when we visited) salt flat, which you can walk right up on. Interesting stop."], ["Reviewed August 15, 2017", 5.0, "So hot!", "Worth going to as you are 85 metres below sea level be ware it's as hot as it gets here when we arrived it was 120F"], ["Reviewed August 15, 2017", 5.0, "Return Visit to Badwater - Its 280 feet Below Sea Level", "We did a return visit to Badwater in August. We circled the parking lot twice to find our parking spot. There is the large walk way which one takes to gets to Badwater. There are some information signs as well. Also close to the parking lot is the salt flats and a badwater pool to take photos of.\nShow less"], ["Reviewed August 14, 2017", 5.0, "It's hot!", "Always wanted to go here. It's worth the drive. Looks amazing and really is very hot. Beautiful scenery."], ["Reviewed August 14, 2017", 5.0, "Must Visit on Your Trip to Death Valley", "Come visit the lowest point in North American. Recommend early in the morning or the evening when it's cooler and not so many people are around."], ["Reviewed August 13, 2017", 5.0, "Hot, hot, hot!", "I was there when it was 126F, which is by far the hottest temperature I have ever been in. I had planned on going out into the middle, but the heat and sun were almost unbearable and I was literally out of the car for a few mins to walk down to the sign and then back to the car!\n\nA cool spot. Really enjoyed it. Felt like being Mars\nShow less"], ["Reviewed August 12, 2017", 5.0, "Low and Dry!!!", "Parking can be a big of a challenge here at the lowest point in North America. Fascinating salt flats spread across the dry lake bed. We hiked out nearly a mile to examine the fresh salt crystals that had not been stepped on."], ["Reviewed August 10, 2017", 4.0, "Interesting", "Interesting enough spot, some 280 feet below sea level. Very busy so the trac out ot hte salt flats is a bit like a motorway."], ["Reviewed August 10, 2017", 5.0, "THIS IS DEATH VALLEY!", "Badwater was our first stop on a day of adventure in Death Valley It did not disappoint. Nice boardwalk for easy viewing and then get off the boardwalk and get out on the salt flats. The mountain views are spectacular. It all depends on the time of day as to the colors you see in the mountains. We were there in Jan. The weather was perfect for hiking. Cannot imagine being there in the Summer. Death Valley is a beautiful spot. Never expected the amount of color we experienced. No matter the time of day the mountain color is wonderful\nShow less"], ["Reviewed August 9, 2017", 3.0, "Welcome to the 9th gate of hell", "This is seriously the hottest place on earth. This is also one of the lowest places on earth. It's really neat to say that you've been there an experienced it but take all of the necessary precautions to survive the car ride. Have at least 1 gallon of water and a full tank of gas. There is no where to stop and there is no cell phone service for hours. A car can overheat very quickly and the air is so hot and dry it sucks all of the moisture out of your soul instantly. I recommend a big Sunbrella or hat, Chapstick, sunscreen, and please be very careful if you have small children or pets. There is a reason only rattlesnakes, scorpions and black widow spiders survive here. Stay on the road or a marked trail!!!\nShow less"], ["Reviewed August 9, 2017", 5.0, "Very popular spot", "This was a great stop on our tour of Death Valley. It is a cool place to visit, but keep in mind that a lot of people stop at this location. You can walk out on the basin and explore the stagnant water (if there is any) to try to find wildlife. The overall park is fantastic to visit!\nShow less"], ["Reviewed August 7, 2017", 4.0, "Salty", "There was some water left when we visited but the shores were wide flat and white and the bit of water left in the middle was quite turquoise suggesting it was not going to be there for long before evaporation.\nAnother amazing view in a beautiful and spectacular landscape\nShow less"], ["Reviewed August 6, 2017", 5.0, "Extreme to the EXTREME!", "This is a place history was made...the highest ever recored temparature...134 deg. f!!!\nJust standing in the Basin ( 119 deg.f when we were there) makes you feel part of history. And if you stay too long you will be. When you park you actually see the \"Badwater\" that simmers near the ramp that takes you to the lowest point below sea level in all of North America. Try to walk as far as you can into the boiling haze never forgetting you have to walk that far to get back to the comfort of the A/C. We had my service dog Pierre with us and if you put your hand down on the baked mud you could barely keep it there until your had was burned, but on the baked salt on each side of the path you felt very little heat and as such was where my dog was very comfortable walking and even laying down.\nDefinately a bucket list spot, don't miss it.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Beautiful - Avoid Walking on the Basin (To protect Snails), Please Check it from Ramp.", "Hello All,\n\nBadWater Basin is beautiful. The white color mesmerizes you with its beauty. You don't realize you are below sea level, until you spot the sign which says \"Sea Level\".\n\nThere is a plank which clearly says \" Avoid Walking on the Basin. The basin is the home for Death Valleys Rarest animals the \"BadWater Snail\". To protect this animals watch the Basin from the plank.\n\nThe water is not poisonous but salty as a plank reads. We awe at the views we get from mountain tops. This one is below sea level. Worship Mother Nature at its best from Mountain top to below Sea Level. Awesome.\nShow less"], ["Reviewed August 4, 2017", 5.0, "A day in the Death...", "I am a 68 year old, male, solo traveller from the UK who always wanted to visit Death Valley. My base was Las Vegas and I decided to fit in whatever I could in one day.\nMy visit was in mid-July therefore making it the hottest time of the year but also the least populated.\nI had pre-hired a car from the UK (recommended) and rented a compact. A more powerful car would be useful as this was ostensibly a driving visit with a little hiking.\nPREPARATION:\n1 ALWAYS take plenty of water.\n* TIP I bought a styrofoam cooler box and bag of ice for less than $10 from a gas station. Break up the ice and fill the box with as many 500ml bottles of water you can and take spares to replace used ones. Fewer bigger bottles tend to be too big for the box.\nAs signs often said \"Don't just take water, DRINK it.\"\n2 Wear a hat. For someone who doesn't normally, I soon appreciated why!\n3 Put on, and take, plenty of sunscreen. Don't be a sun god/goddess, use the highest factor available. This day isn't about getting a tan.\n4 Sunglasses. Again, I rarely wear them but the dry heat and oven-like winds tend to dry your eyes.\n* TIP I took a \"man-bag\" that could hold two 500ml bottles of water, base-ball cap, sunglasses, sun lotion and although I didn't use them, eye drops.\n5 Camera. I used my phone camera on many occasions but took my SLR for all the \"big\" photos.\n* TIP Always remember to leave your phone/camera batteries on charge the night before you go.\n6 Fill up with petrol (gas) before you set off and any food/snacks you may want for the day.\n7 Go to the loo! There are several toilets along the way but often miles apart.\n\nAfter a hearty breakfast, I set SatNav (GPS to the locals) for Shoshone (note the big, white DV set on the hill nearby) and thoroughly enjoyed the journey. From Shoshone I took SR 178 west for about 25 miles or so to the point where the road makes a right angled turn to the right.\nThis, effectively, is the start of my DV adventure; Badwater Road. This road is metalled and the only man-made imposition on this fabulous environment. This is a 2-way road with incredibly few other vehicles throughout the 45 mile run to Furnace Creek. THERE ARE NO SERVICES ON THIS ROAD.\nAfter a couple of miles Ashford Mill is highlighted and I had a 10 minute walk around the remains of the mill experiencing the 110oF temperatures! There are toilets here.\nAnother 10 miles to Mormon Point which is effectively a viewing point and is where the valley starts to drop below sea-level.\nI can't remember how many times I stopped to get out and take photos as the area is a geologists dream. The imposing Black mountains to the right and sprawling valley floor are awe-inspiring.\nAbout 30 miles in and I reached Badwater Basin, the lowest point in the western hemisphere - and sooooooo hot. There is a designated parking area and toilets. This was quite populated with tourists and we all made our way out over the boardwalk and out across the salt pan for about 400 yards.\nA few miles further and a chip-stone road cuts off to the right towards Natural Bridge Canyon. The road goes for a couple of miles before a further few miles hike to the bridge. Sadly, I realised the car was not quite up to the terrain and I did a U-turn after about a half mile. The views on the way back down were stunning though.\nA further few miles and the sign for the Devils Golf Course took me off on a road to the left. The track ends in a sweeping turning point/parking area for a view of an amazing geological feature which stretches as far as the eye can see.\nYet another couple of miles ahead brings one of the highlights of the trip; Artists Drive. A one-way road through some fabulous terrain and incorporating Artists Palate and Ventifract Ridge. The loop brings you back to Badwater Road.\nJust a few miles before reaching Furnace Creek is a short road up to Golden Canyon trailhead where there are toilets and a parking area. There was an opportunity for me to walk about a half mile up this picturesque canyon before the heat told me to return. I believe the hike is about 3 miles.\nI inadvertently missed a few key POIs but did not feel cheated.\nAt Furnace Creek, Badwater Road meets SR 190 where I turned right to head back to Vegas feeling somewhat fulfilled. However, my adventure had not finished. A short way along the 190 was Zabriskie Point where more stunning views overwhelm the senses.\nTo top off my day's delights, I turned off on the right on a Disneyesque journey along the one-way 20 Mule Team Road.\nWell, traveller, if you have bothered to read this far, you deserve to enjoy the delights of Death Valley.\nSo go and do it!!!\nShow less"], ["Reviewed August 2, 2017", 5.0, "Hot flat and salty", "Super hot, 52 degrees centigrade when we were there. Worth a walk well out onto the flat to avoid the crowd and feel the heat and desolation."], ["Reviewed July 31, 2017", 5.0, "A unique experience", "Because of the heat it is not wise to spend too much time here. But it is the lowest point in the States and one of the lowest in the world, and it is just an extraordinary environment. The view from the parking area is great, but you really need to walk out some distance onto the salt lake to fully appreciate the harshness of the environment.\n\nWith such a dry heat, it does not feel as hot as it actually is so it is important not to go too far. What brings it home as to how hot it is, is when you have been out on the lake for 20 minutes and take a drink from your previously chilled bottle of water and discover it is decidedly warm.\nShow less"], ["Reviewed July 30, 2017", 3.0, "Salty", "I guess I was expecting this to be more interesting from the reviews... I was anticipating this to be my fav spot at death valley, but zabriskie point and gold canyon ended up being my favs. To get to the salt flats there is a fairly long walk..and we made it half way before turning around because of how hot it was. I took a couple peices of rock with salt on them from the beginning of the walk which was neat. You are over 200 feet below sea level which is also interesting. Wish we could've made it further out to see the actual cracks in the foundation.\nShow less"], ["Reviewed July 29, 2017", 4.0, "Great Perspective", "Of all the great locations and sights in DV, Badwater and Ubehebe offer best best sense of perspective when it comes to the vastness of this park and how small we really are in the big picture of things."], ["Reviewed July 29, 2017", 5.0, "Awesomme", "Don't care how hot it is you need to see this part of America. WOW. Being from a different part of the country this is a wonder to see. Just really neat to think of those that discovered the area. Amazing place wonderful sights."], ["Reviewed July 28, 2017", 4.0, "Super hot day!", "Drove through Death Valley on our way from California to Grand Canyon. It was 118 at the visitor center. When we got to badwater it was so hot. Wish we could have gone out and explored more but it was just to hot. It was really interesting though to be at the lowest point.\nShow less"], ["Reviewed July 27, 2017", 4.0, "Extreme", "Almost 100 meters below sea levet. Water is rare and precious in Death Valley. Imagine the disappointment when a surveyor mapping this area could not get his mule to drink from this pool. He wrote on his map that the spring had \"bad water\" and the name stuck.\n\nTake a look up the mountain just beside and find the sign \"Sea Level\" which tells a lot about this extreme place on earth\nShow less"], ["Reviewed July 21, 2017", 5.0, "Salty hell on earth", "The lowest point in North America is also likely to be one of the hottest. A summertime visit is unique. Shimmering salt spreads far its unlike any place on earth I've seen. Beware there are no services! Water is a must and a full gas tank is a good idea.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Fun place to explore", "Bad water is an amazing place when the weather has been dry and the salt rings form. Our last visit took place during a wet spell so most of the salt rings were not easily seen. It's still a great place to spend some time at 282 feet below sea level.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Low and beautiful and hot!", "What an experience to walk along the salt flats (and yes, we tasted them! Salty.). Gorgeous, in a desolate kind of way. It was 127 degrees when we were there, so I didn't get to see as much as I would have enjoyed, but you also have to be safe. Look up to the sea level sign see how far below you are. Amazing!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Amazing - out of this world", "Interesting read about the geology of this place - information points at the car park. Great place for interesting pictures. I was happy it wasn't too hot - just 32 degrees."], ["Reviewed July 18, 2017", 5.0, "So cool!", "Def worth the visit!!! It has its own unique beauty. Don't miss this stop while in Death Valley National Park!"], ["Reviewed July 18, 2017", 5.0, "Amazing views of the Valley", "Quite unbelievable landscape. The salty earth is walkable yet is soft enough to leave your fingerprint in. You can see the prehistoric value in the once full lake. This is the lowest point in the western hemisphere which is cool in itself but the fact it was a scorching 128 degrees fahrenheit made it quite the life experience. If you love the dessert, you'll be amazed with the views!\nShow less"], ["Reviewed July 15, 2017", 5.0, "Lowest Point in N. America", "This is one of the coolest (not temperature wise) places that I have ever been. The drive out was incredible and the experience is one that I will never forget. Make sure that you look back at the cliff and see where they have marked where sea level is. It is breathtaking! It was only 118 F when we went, but water is a necessity.\nShow less"], ["Reviewed July 14, 2017", 5.0, "must see at Death Valley!", "Lowest point in the continental U.S.! The day we were there the sun was beating down at 114 degrees and a hot wind was blowing almost continuously. It felt like an oven door was open and someone was blasting air from it right into your face. It was a surreal experience to stand at Badwater Basin and to see the \"sea level\" sign across the street so far above on the cliff. Our family felt so bad imagining pioneers seeing the pool of water and coming to drink, only to discover that it wasn't drinkable! There is a nice boardwalk viewing area and a path to walk out onto the salt flat area. Also a restroom near the parking lot.\nShow less"], ["Reviewed July 14, 2017", 5.0, "High point of DV was the Low Point in North America", "We were there when it was over the top hot, so parked and dashed over to the sign, took some pictures, and fled back to the car. Wow. Never been in heat that large before. But what an amazing and evocative spot! Hope to go in the winter when we can actually enjoy the scenery.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Never experienced such hot climate", "We visited Death Valley in the month of July. The reason was to experience the extreme climate. The temperature was too high to come out of the car. As soon as we came out we started sweating and our skin kind of started giving us burning sensation. The temperature was 130 F. The view of the Basin is unique and very beautiful. One could see the small piles of salt and water accumulated at some places. This again came as surprise against the hot climate. We took few photographs and jumped back into the car. I would recommend to visit this place only in winters to enjoy the beauty and view comfortably.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Flat as the globe used to be", "This sight is the lowest point in North America and is covered with white salt offering a really flat ground surrounded by rugged hills. The Badwater parking lot is right next to the sight and around 17 minutes from the 190 road. During our visit, this place was the most touristy one and due the the wind, the air didn't seem to hot. There is plenty of space to walk around and take cool photos. Really a must in Death Valley.\nShow less"], ["Reviewed July 10, 2017", 5.0, "No DV trip is complete without a stop at Badwater", "If you're coming to Death Valley, be sure to stop at Badwater Basin, the lowest point in the park and the continental US. There is a path out to the salt pan, but don't forget water (and your camera)! The flat hike is deceiving and may seem easy, but like most of Death Valley, it is unbelievably hot out there. On your return to the car, don't forget to look up and find the \"sea level\" sign way overhead! It certainly puts things in perspective!\nShow less"], ["Reviewed July 7, 2017", 5.0, "Must do!", "This is the highlight of Death Valley and is truly incredible. The heat and the sight are something to behold. There is nothing else around. We had a convertible car but the roof had to be up and they warn you about the AC in the car. Be careful your car doesn't overheat in summer.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Very interesting", "Lowest accessible point at 282 feet below sea level. Salt flats you can walk out on. Good stop. Bring a lot of water"], ["Reviewed July 5, 2017", 5.0, "A special experience", "We took a motorcycle trip through Death Valley during November. It was not too hot, so we were able to focus on the scenery instead of the temperature. The trip through Badwater was an amazing experience and one that I will never forget. It is the lowest elevation in the United States and has some amazing geography. I highly recommend adding this to your bucket list.\nShow less"], ["Reviewed June 30, 2017", 5.0, "There is a reason for the name.", "This place is the closest thing to death on this earth. The water is bad as the story goes as the burro would not even drink it. Nothing here but dirt, salt and heat. Nice view and one of those places you can say \"been there...seen that.\"\nShow less"], ["Reviewed June 29, 2017", 4.0, "Hottest Pit On Earth", "Badwater Basin was our last stop in Death Valley and even though it was getting into the late evening, it was still amazingly hot - adding to the heat was a blazing, constant wind that stung the eyes.\n\nBadwater Basin is 86 meters below sea level, the lowest point in North America, and is a sparse, flat and open landscape wrapped in distant mountains. It's not the most picturesque place in the world during the day but we did luck out with a fantastic sunset.\n\nStill, an interesting and unique place to visit.\nShow less"], ["Reviewed June 29, 2017", 4.0, "HOT!", "A very interesting spot. Be warned it's hot, very HOT! Our car was showing 46C on the day we visited in mid-June. So hot, in fact, that you can feel the heat coming up through your shoes, and you're barely able to open your eyes. Worth seeing - just don't expect to spend more than 15 minutes or so there.\nShow less"], ["Reviewed June 26, 2017", 5.0, "You can't get any lower...", "If you thought the Vegas was low..this place is even lower ;-D A giant salt-flat..hot....you can walk forever,but I wouldn't recommend it...easy parking and toilets available."], ["Reviewed June 25, 2017", 5.0, "Neat", "Nice stop to walk out on the salt flats. Nice photo op by the sign showing how far below sea level you are."], ["Reviewed June 25, 2017", 5.0, "Scorcher", "The salt flats were very interesting and this is the place you really feel out on death valley. You have the valley stretching out in both directions and it feels very barren and remote (except for all the others standing there with you)"], ["Reviewed June 23, 2017", 5.0, "Wow, ancient Sea beds..", "It is a 17 mile drive there and back from the \"main road\", but it's worth the drive. Just reading about Badwater Basin was amazing and makes one reflect how small we actually are in the whole universe.."], ["Reviewed June 23, 2017", 5.0, "Walk", "It is a bit of a walk from parking, but definately worth it. Great salt lake, fantastic views and unbelievable surroundings. You get an impression of being on anohter planet."], ["Reviewed June 21, 2017", 4.0, "A good place to get low", "A real low point in Death Valley. 282 feet below sea level. It is hot, it is desolate, it is dry, but it is the lowest place in North America,so you need to visit it."], ["Reviewed June 21, 2017", 5.0, "Amazing views!", "By far some of the best views Death Valley has to offer. Badwater is a must for any Death Valley trip but be warned it's very hot so bring a lot of drinking water."], ["Reviewed June 18, 2017", 5.0, "Yes, you must go!", "This is really an amazing view. Lowest point in USA and worth looking up to see where sea level is on the high cliff opposite. Nice walk (best to do in the morning or early evening due to the heat). Bring Water!"], ["Reviewed June 14, 2017", 5.0, "Lowest Point in U.S.", "The title says it all. It is a must visit spot if you are in the area. There really is not much more to say. The day we were there it was hot, naturally. The high was 118 degrees. I am sure it gets hotter but that was plenty for us.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Super hot but cool", "This is a bizarre thing worth visiting. It's super hot of course, but it's a rather short walk to get your picture by the sign and to walk out onto the basin.\nIt's really the must see attraction of Death Valley. You just have to brave the heat.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Hot", "Cool to go to the lowest point in North America, but it is very hot to walk out into the salt and I wouldn't do it but if you are ok with the heat then go for it."], ["Reviewed June 12, 2017", 5.0, "A wonder", "An awesome place to visit. The austere beauty of Death Valley is a sight to behold. And you can't get lower in elevation!"], ["Reviewed June 10, 2017", 4.0, "Worth a Visit", "The lowest point in America and worth seeing for that fact alone.\n\nAn immense plain stretching to the horizon of salt flats shimmering in the sun and heat. Blisteringly hot during the day so hat, sun cream and water are absolute essentials.\n\nWalking out onto the plain there is huge a sense of isolation and peace. Well worth a visit.\nShow less"], ["Reviewed June 9, 2017", 5.0, "Must See Landmark", "Badwater is a partially dry salt lake that is the lowest elevation in North America. You can walk out a good way from the parking area. Be sure to take an adequate supply of water with you if you plan to hike. You will get dry quickly! Another must see is Salt Creek just to the north. An incredible species of pupfish survive in these conditions, sometimes becoming dormant until enough water returns.\nShow less"], ["Reviewed June 8, 2017", 4.0, "Badwater", "Great place but quite touristy, drive further down the road and you can see better views of the flats and the mountains"], ["Reviewed June 5, 2017", 5.0, "Wow!", "This was an amazing experience. Scorching hot! DO NOT FORGET TO BRING WATER!!! Startlingly beautiful and kind of epic. You'll never see a longer shadow."], ["Reviewed June 5, 2017", 4.0, "Interesting sight to see", "We stopped here and took the time to walk the trail out to the middle of badwater basin, which can be quite hot in the sun! It's interesting to see because just below the salt, you can see how much water is underground and why they warn about the dangers of sudden floods\nShow less"], ["Reviewed June 4, 2017", 5.0, "Don't Miss Badwater", "As the lowest point in North American, one must visit just for that reason alone. It is a beautiful area with 11,000 foot mountains on the other side of the valley. The salt flats are interesting too. You can see water just below the surface. If you look back up the mountain behind the parking lot, you will see a Sea Level sign. Really gives you a great perspective of where you are. The highest recorded temperature here is? You will have come and visit to get the answer (No Googling for the answer :) )\nShow less"], ["Reviewed June 3, 2017", 4.0, "Surprise elemnts offered by nature", "The basin is the lowest point in the USA, around 285 feet below sea level. There are salt pans formed by nature and water oozing out of the caked muddy plane. Even in end May, the heat was dry and oppressive. We could not hear the salt crystals crackling in the heat as indicated.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Nothing else like it on earth!", "I have been to a lot of places, but I have never seen anything like Badwater! It is amazing how someplace so hot and barren can have such beauty. Take time to walk out onto the salt flats and enjoy the unique scenery!"], ["Reviewed June 1, 2017", 4.0, "Looks like snow", "This is one of the most interesting places that I have ever been. From a distance the salt looks like a lake frozen over and covered with snow. Make sure you go out far enough to where it opens up more to all white rather than the mix of brown, it is very neat. Also look up on the cliff behind you to see where sea level actually is, it is marked with a sign on the rocks.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Lowest point in U.S.", "Neat thing to see. Walk out on the salt flat. Too hot in summer. Dress cool and drink lots of water!"], ["Reviewed May 31, 2017", 4.0, "Hot doesn't do it justice", "This place is almost impossible to believe.\n\nSeconds from getting out of the car the level of the heat takes hold of you. When we visited it was 120 Fahrenheit which was unthinkable.\n\nThe long walk out across the salt flats feels a lot longer than it is because within minutes you are melting.\n\nThis is one of those experiences that you can't find anywhere else in the world.\nShow less"], ["Reviewed May 29, 2017", 3.0, "Hot hot hoy", "If you must go to Death Valley then check it out. Hot, barren and nothing looks to be alive. I've been now and don't need to go back!!"], ["Reviewed May 28, 2017", 5.0, "Hot spot", "Lowest point in USA. Was also very hot. It was 106 degrees here, almost 30 degrees hotter than it was when we viewed from Dante's just an hour earlier. Walked the salt flat, very unique. Recommend to stop here when visiting the park"], ["Reviewed May 26, 2017", 5.0, "Must see", "A must see when visitng at Death Valley national Park. The lowest point of North America. Stay at markde area, but walk furher - there are not so many people around."], ["Reviewed May 25, 2017", 5.0, "Badwater Basin a must see if you visit Death Valley National Park", "We recently visited Death Valley National Park - the whole thing was spectacular! Only one sight of many, Badwater Basin is a hugh salt flat that you can walk on. The parking there is good and there are restrooms. The park has built a small boardwalk so you can get close to some of the swampy areas of the salt flats. Also, you can walk out on the salt a far as you want to go. Amazing and interesting and educational.\nShow less"], ["Reviewed May 25, 2017", 3.0, "Popular", "A popular site and offers an easy accessible location to the lowlands. We have been fortunate to visit many other salt flats and so this wasn't all that spectacular for us."], ["Reviewed May 25, 2017", 5.0, "Slight trek to get to but well worth it! Amazing views and incredibly hot!", "One of the most intense places on the planet, the basin is a must-see if you're passing through Death Valley. The heat and the wind were overwhelming so you don't want to be out of the car for more than 20 minutes or so. The salt plain surface is really interesting and as the lowest point below sea level in the US it's a great place to visit.\nShow less"], ["Reviewed May 24, 2017", 5.0, "DO NOT TRY To ENTER OR EXIT DEATH VALLEY NP USING CA 178 (Jubilee Pass Rd)", "No map is going to tell you this, but we made the HUGE mistake of leaving Badwater (a must-see!) by heading towards Golden Canyon. Unless you're a geologist, TURN AROUND, no later than Golden Canyon, and GO BACK to the Furnace Creek Visitor Center so you can get back on CA 190!!!\n\nThe winding CA 178 route is one of the worst drives I've ever taken! There is NOTHING new to see, and you will add AT LEAST one hour to your commute! The road is very up-and-down HILLY, which will make your kids sick. The speed limit isn't posted, but it's 35 mph!!! The entire ride was 55 miles of misery! You'll drive up and down through 3 mountain passes. Uggggh!!!\n\nTURN AROUND, go back to CA 190!!!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Amazing place to walk on salt", "It was a great place to visit, walking out across the salt plains, but it was damm hot at 36 degrees Celsius, and kind of fun to think you are walking on the lowest point of the USA at minus 297 feet. A must go see adventure.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Easy hike", "Lowest spot in North America is easily accessible to everyone. Just drive up to the parking lot & hike the flat trail as far as you want to go.\nSeveral informational signs along the way describe how this became the low point & why the salt is there. It definitely is salt, we tried it. Be sure to look at the mountain across from the parking lot for the sea level sign.\nI recommend going early in the day if it is hot because the sun is very strong & reflects off the salt. Wear sunglasses! And sunscreen!\nHighly recommend this site.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Who would have thought there was water here", "The lowest point in North America, with an elevation of 282 ft (86 m) below sea level.[1] Mount Whitney, the highest point in the contiguous 48 United States, is only 84.6 miles (136 km) to the north west.[2]\n\nThe site itself consists of a small spring-fed pool of \"bad water\" next to the road in a sink; the accumulated salts of the surrounding basin make it undrinkable, thus giving it the name.\nShow less"], ["Reviewed May 20, 2017", 5.0, "A lot of salt Below sea level", "It is a fantastic salt desert below sea level. We walked several hundred meters along the salt. When you look back to the hill behind the parking lot you see the mark for the sea level above. Amazing that this is the lowest point in Northamerica with -86 meters. As we visited Badwater in Ocotber the temperature was fine, not too hot.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Salt Flat", "This is easily accessible. Great view of the salt flats. Lowest spot in USA . Has sign on hill - says - 282 feet BELOW sea level. Yes it's salt. I tasted it. Don't miss"], ["Reviewed May 15, 2017", 5.0, "high point of the trip", "Lowest elevation in North America! If you're able to hang out here long enough, you just might be lucky to experience this alone with no traffic. It's so different to have absolutely no sounds all around you. It was a feeling that's hard to describe,...More"], ["Reviewed May 12, 2017", 5.0, "Awesome", "It is a must to say you need to experience this. Words can't truly describe this. It's an experience. Plenty of parking and bathrooms. Can get crowded since it's popular."], ["Reviewed May 12, 2017", 5.0, "One of the most interesting places in Death Valley", "The lowest point in North America was a HIGHlight of our trip. An evaporated sea which left behind a desert of salt. Handicap accessible and definitely a must see."], ["Reviewed May 12, 2017", 5.0, "Badwater / Ubehebe / Artist Loop / Sand Dunes", "Bad water was nice and open and liked walking on the crystals the further away you get from the dock and liked to turn around and see the below sea level marker on the hill. Ubehebe Crater was amazing, it is so beautiful and scary...More"], ["Reviewed May 8, 2017", 4.0, "Only time you'll ever see this!", "Death Valley gets a bad rap but Badwater is one example of why it shouldn't. Although it's not necessary to stay a long time at Badwater, it is fascinating to be 282 ft below sea level and see a HUGE flat of salt brickets unlike...More"], ["Reviewed May 8, 2017", 4.0, "Iconic location", "You are over 200 feet under sea level, which is impressive to be sure. The day we walked, there was a nice blowing breeze, so the high temperatures were comfortable, and it is a straight flat trek. Do what you can because its not a...More"], ["Reviewed May 7, 2017", 5.0, "An Artful Presentation of the Lowest Point in America", "The National Park Service has done an excellent job of presenting this National site. Looking up to the marking of sea level across the parking lot is sobering. The site is informative and well cared for. A must stop and investigate while in Death Valley."], ["Reviewed May 5, 2017", 5.0, "It was the low point of our trip...but that's a good thing!", "OK, it's a salt flat, so how exciting is that? Well, it's the lowest point in North America, so that alone makes it a tourist must do. And it is pretty impressive, especially looking out to the cliff across the street, with the \"Sea Level\"...More"], ["Reviewed May 3, 2017", 5.0, "Awesome", "A great experience to the lowest geographic point in North America. Well developed tourist attraction with good parking, boardwalk , interpretive signs and access to the big salt flat."], ["Reviewed May 2, 2017", 4.0, "Cool to see sea level sign", "Cool to see the below sea level compared to the sea level sin above . You have to walk far to see cracked salt . It's hot ! Look for the shrimp"], ["Reviewed May 1, 2017", 5.0, "under the sea", "what a thrill. 85m below sealevel. Amazing and............ incredibly hot. We left Vegas in the morning at an adorable 22°. Arriving at Furace Creek and later on in Badwater, thermometer was over 40°. Some ater, but mainly salt crusted tart. How did ancestors ever get the idea to make their fortun ein this abondened landscape? A must. Excellent road and superb off road conditions. Do not leave road if rain in the mouintains is previsted, danger of flash floods.\nShow less"], ["Reviewed April 29, 2017", 4.0, "Hot, Windy, Salty, Unlike no other", "It took us a while to walk to the salt flats as it was extremely windy on this day and also the reason why we didn't walk out further than where we were. I felt I was getting pushed back by the wind and my nose got salty (haha). All that said I'm not saying this to discourage the visit because I certainly think it's a must, especially after seeing the basin from the top (Dante's View), you just need to see it up-close. But again, the wind restrained us from enjoying it and really taking in the view from this point.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Amazing", "This has to be on anyone's list of must sees - amazing scenery with incredible temperatures. Take plenty of water and air conditioning essential...."], ["Reviewed April 27, 2017", 5.0, "Nice quick stop", "I brought my daughters to Death Valley for spring break and they were not as interested in hiking as I was. This was a great place to stop, easily accessible, with stunning views!"], ["Reviewed April 26, 2017", 5.0, "Well worth the drive", "We fitted this into the end of one of our days staying at Furnace Creek. It's a little drive away (approx 30-45 mins) but has such stunning views of the salt flats and surrounding mountains."], ["Reviewed April 26, 2017", 5.0, "Amazing!", "Like most like locations in Death Valley, Badwater gets a \"5\" just because of what/where it is and there's a great story as to how the name came about. Make sure to look for the \"sea level\" sign on the adjacent hill to appreciate how far below it you are.\nShow less"], ["Reviewed April 25, 2017", 5.0, "Extreme heat in April - get out the sunscreen", "And sunglasses... and the water.... and more water! Pretty good hike from the main parking lot to the salt flats. You become encrusted in the salt that is in the air. Burning your nostrils and stinging your eyes, Badwater is spectacular and hot. Very interesting to photograph the white salt and the white mountain peaks in the distance.\nShow less"], ["Reviewed April 25, 2017", 4.0, "Part of Death Valley Experience", "This is an excellent example of how tourist trample a pristine site. Although there is a walkway there are folks that can't contain themselves and have to wander into areas that will take years to recover! Overall this is a nice relaxing area and easy walk to the water. The pictured mosaic formations were not readily noted. Interesting being so far below sea level with tall mountains all around. Worth the trip.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Looks like the ocean", "Badwater Basin looks like a frothy ocean from a distance - a great white shining expanse. As you get closer, it starts to resemble snow, crystalized and sparkling. When you finally start walking on the flats, it looks like blinding white sand. That's when you really realize that you're walking on a huge lakebed of salt. Bring water and a hat and make the trek out a ways towards the middle of the bed. There are fewer people there, and you really get to see the pristine white areas. Fair warning - it's hot. And just because it's a dry heat doesn't mean it's any better. Stay hydrated! There are restrooms at just about every tourist area in the valley, which is good, because you'll be downing the H2O all day.\nShow less"]]}}