{"Balboa Island": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Balboa Island", "url": "/Attraction_Review-g32780-d269454-Reviews-Balboa_Island-Newport_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/73/68/d9/balboa-island.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1178"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Just like old times", "My Dad worked at the Post Office here during my childhood. My sister and I spent many happy days exploring the island and visiting my Dad's friends. It seems pretty much the same, although many of the businesses have turned over. And many beach cottages have been upgraded to something much grander. But yet, the quaint vibe of luxury (not trying too hard) seems to have survived.\nShow less"], ["Reviewed yesterday", 4.0, "Fun walk around town", "We enjoyed a lovely time walking around this adorable town. No problem finding on-steet parking with some interesting shops and restaurants. And don't forget the frozen bananas! Take some time and stop by."], ["Reviewed 2 days ago", 5.0, "Best time of the year to visit!", "This is the quintessential walk to take on a sparkling winter day. We left from the RV park at the Back Bay and walked over the bridge to Balboa Island in a group of about 23 people. we stopped and snapped pictures,as we entered the island,of the lovely boats and houses.\n\nWe enjoyed peeking in the windows of the businesses along the main street and proceeded to the end of that main street. We turned right and viewed all the beautiful Bayside houses with their colorful flowers. After eight blocks we took the ferry over to the peninsula and enjoyed the long walk towards the wedge to view the surfers. Don’t miss this in the fall or winter. I suspect during the summer there’s hardly room for anyone to walk on the sidewalks. Not to be missed.\nShow less"], ["Reviewed 5 days ago", 4.0, "Fun shopping", "Stop at one of the great restaurants for wine, grab a frozen banana and poke into the shops. Too many of the clothing stores have cheap items but the olive oil store and Art for the Soul shouldn’t be missed."], ["Reviewed 2 weeks ago", 5.0, "Beautiful Island", "Balboa Island is a beautiful, relaxing, fun, active place to visit. Finding the island was very easy and parking was no big deal either. A cute place with lots to do like shopping, or picking your favorite restaurant to eat at. There are coastal tours where you can go out on a boat looking for whales and dolphins, piers to go out on and you can even ride a ferry across the peninsula. ( whether you just sit and ride, take your automobiles, or bikes across) The cost for my husband and I to take our vehicle across was only $3 so very reasonable. It was a wonderful place to spend the day!\nShow less"], ["Reviewed 2 weeks ago", 1.0, "One bad apple....please do something about this abusive owner...", "Please read all of the Yelp reviews (including the \"not recommended\"...equally disturbing) about Olive Oil and Beyond.\n\nI've owned properties in Newport Beach for over 25 years. I've been going to Balboa Island for over 30 years. The owner of Olive Oil and Beyond is a very small & petty man. I just stopped in to look for some pasta and a serving bowl. As I was looking around the owner came right up to me and asked if he could help me. I said \"I'm just looking.\" He continued to follow me around while I was looking at the products. He told me, \"Let me make this easy for you...get out of my store.\" When I asked why, he said, \"You're an illegitimate customer!\"\n\nMy husband went in to the store to question him after that. Another owner nearby said that she'd received many complaints about his rude and childish behavior. This city doesn't need an unprofessional owner like this. I'm writing to the Chamber of Commerce next. Avoid.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful!", "This was our second visit here in twelve months: the weather, first time, was damp and pretty miserable but we couldn’t fail to see how gorgeous it would be in the sunshine and, in the recent heatwave, it sure was!!\nPedal bikes for rent and (the reason we were there) a good choice of seagoing activities. Plenty of parking.\nThere is a nice selection of gift shops, restaurants and bars and the whole area was spotlessly clean. It has a really chilled, laidback vibe about it though I’m guessing that midsummer is probably a different story.\nWell worth a visit . . we’ll certainly be back when next in LA!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Magical place", "Don’t miss this place if you’re coming to Southern California. You can drive onto the island and take the ferry across to the peninsula or just drive out onto the peninsula.\n\nThere are harbor tours, whale watching tours and beautiful beaches. There are two great piers and very inviting sidewalks.\n\nEnjoy.\n\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Very relaxing...", "This area is very relaxing and fun to go walking or biking. The area has a lot of little shops and restaurants."], ["Reviewed 3 weeks ago", 4.0, "Quaint little trip", "This is a very cute place to visit. Quaint and chill. A perfect place to spend a Sunday morning for early breakfast, brunch or coffee. Great photo opps too!"], ["Reviewed 3 weeks ago", 5.0, "Awesome beach!", "This is by far the best sand beach we’ve visited in California when it comes to swimming and sitting by the ocean. We’ve been to the beautiful cliffs overlooking the ocean and those were awesome as well, but some of the other Southern California sand beaches have been less than the best. We are from Florida, so our standards are pretty high.\nWe found it to be clean and beautiful. It wasn’t overly crowded on a weekday and parking was easy to access. We crossed over to it in our Jeep on the Balboa ferry which as quick and easy.\nDogs were welcome throughout the island and also on the beach during specific hours.\nPlenty of restaurants and shopping within an easy walking distance if you’re in the village shopping district. Driving back out on the Pacific Hwy takes you past beautiful bungalows and colorful homes as well as the Marina.\nLots of things to do to fill up a day.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Quaint Seaside Neighborhood", "Quaint neighborhood with bay views and cute luxury homes. Several shops and some restaurants are on the main street as well as public restrooms. Strolling on the walkways along the canals day or night is very relaxing. Holiday season here is especially beautiful with lots of lights and decorations. Parking is very difficult so get here very early. Recommended.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A wonderful place to go for a stroll", "If you want to spend a day wandering the waterfront, admiring old houses and visiting the shops and restaurants then Balboa Island is the place for you. We spent all day there and then came back the next day to see if we missed anything. If you walk the Island in one direction try to walk it in the opposite direction and you will be amazed at what you missed the first time.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun walk.", "I felt like the whole island was a movie set. The houses are close together, the streets are narrow and everything is clean. The main street was cute, quaint and friendly."], ["Reviewed 4 weeks ago", 5.0, "A must-stop when in the area", "I ran through this area on a business trip and then went back to enjoy. It's very charming, authentic CA beach town. Lots of places to eat, shop, and a nice path along the water. Highly recommend stopping and strolling on your way through."], ["Reviewed January 23, 2018", 4.0, "Great walking", "The island has great walking with views of the bay. The Main Street has lots of interesting place to eat and explore. Also don’t forget the iconic Frozen Bananas. Finding a parking place can always be a little difficult, so don’t arrive in your motor home!\nShow less"], ["Reviewed January 23, 2018", 5.0, "Great place to spend a day", "Very friendly. Beautiful waterfront paths to walk along. Good restaurants and local shops. Enjoyed the atmosphere."], ["Reviewed January 22, 2018", 5.0, "Side trip", "Great place for a side trip during a business meeting. Great shops and places to eat. Laid back and relaxed area with great people."], ["Reviewed January 22, 2018", 5.0, "From the inside", "I live on Balboa Island and have for nearly 30 years. I always marvel at the view it is other than a wonderful place to live. However, it is exactly that. Balboa Island is an amazing destination. There are so many things to do, including just having a seat and relaxing on one of the many benches available on the walkway around the Island between the Boats and the Homes. I have traveled a good bit of the World and I am always glad to come home to Balboa Island. Enjoy your walk.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Balboa island", "Great restaurants Fun variety of stores Great balboa bar ice cream Must have one Fun to just walk down marine streetb"], ["Reviewed January 21, 2018", 5.0, "fun", "We took a nice boat nice over there. Then, we saw many beautiful houses. It was fun shopping too. It took all day but went fast."], ["Reviewed January 21, 2018", 3.0, "Relaxed California Vibe", "Balboa island is really more of an expensive residential area than a tourist attraction. Yes, there is a very short car ferry, and you do get a nice ocean view. But, this is California, you get nice ocean view everywhere."], ["Reviewed January 21, 2018", 5.0, "Very nice", "If you are into walking it is great. Not much parking, we walked down from Marriott and Uber back. Quaint shops and restaurants. If you do not like to walk, recommend skipping this venue"], ["Reviewed January 21, 2018", 5.0, "Classic slice if SoCal", "Grab a coffee or OJ on the main street, then walk around the island's perimeter on the public walkway. The views of the bay, boats and home as you walk are very relaxing."], ["Reviewed January 20, 2018", 4.0, "Beautiful and quaint", "We had a nice afternoon walking around balboa island. The car ferry is a great experience and the little Village is great with some great stores. The chocolate banana is a balboa island essential."], ["Reviewed January 17, 2018", 3.0, "Funky little shopping street.", "My family is from the east coast so our view of beach towns is shapped around the east coast. After visiting Balboa Island I'm not quite sure that it compares to our beach town because there is no beach. It does have a shopping street that is very charming and reminds me somewhat of a beach shopping area on the east coast. I wouldn't recommend going out of your way to visit Balboa Island if you're just a visitor to the area, I think it's a local thing.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Check out the real area", "This is where the term \"Beach House\" came from. Although very pricey, the main street is fun to walk through, funky little touristy shops, bars. Parking is hard but use it as an excuse to tour the neighborhoods. It only takes an hour or so and after that, you will be ready to leave but a fun experience. I lived here when I was going to college, only rode a bike around. You will find the climate very low key and fun. Do just that!!\nShow less"], ["Reviewed January 7, 2018", 4.0, "Busy place as usual", "I love walking among the shops and restaurants. The community is full of boats and water loving people"], ["Reviewed January 6, 2018", 5.0, "Very Charming", "Spent a morning here in November. Originally planned just breakfast, but quickly realized what a jewel I found. Take a walk along the waterfront with the houses facing the ocean. Viewing the houses is even better than viewing the water."], ["Reviewed January 5, 2018", 5.0, "Balboa Island", "Beautiful homes and neighborhoods. Lots of boutiques. Multiple great places to eat. Parking is somewhat of a problem. Advice for parking. There is a medical building before the bridge. Parking in there and walk over the bridge.If you find a place on the island, time is limited to 2 hrs. Must see, Catholic chapel. It is about 300 years old. Beautiful!\nShow less"], ["Reviewed January 5, 2018", 5.0, "A lovely spot", "A real great day out. We all loved it. Sunset amazing. Bilboa has a great street with restaurants on. It a very affluent area so standards are reflected."], ["Reviewed January 4, 2018", 5.0, "key west", "We stay in the keys quite ab it and Balboa island is very close with its small shops and great restaurants"], ["Reviewed January 3, 2018", 4.0, "Quaint Beach Town", "Winter is the best time to go and walk the streets of this charming beach community. Lots of fun shops, eateries with a couple of carnival rides."], ["Reviewed December 27, 2017", 2.0, "Balboa Fun Zone", "Balboa Island is beautiful. The Fun Zone is not fun. It is old, ran down. Hard to find anything exciting about it. We had visitors from Minnesota who had a pre-teen and a teenager. We had 3 teenagers (16/17). Nothing there for those guys. They did try the Ferris wheel but it was a joke. I guess you get what you pay for. Balboa Island can do better that this.\nShow less"], ["Reviewed December 26, 2017", 3.0, "Touristy hard to park town", "Other than too many frozen banana stands, and a pretty good juice bar, this place would be better skipped. I'd stop along the coast highway at any of the beaches or up to the top of the hills and hike alta laguna park (not that far down the road).\nShow less"], ["Reviewed December 22, 2017", 4.0, "Cute city", "a cute city that deserves a visit! its not a posh location but should have some charming shops because the shops are very poor ."], ["Reviewed December 21, 2017", 5.0, "Take a walk around Balboa Island", "Great place to walk, exercise and get to visit local shops and restaurants. Don't forget to visit adjacent Little balboa Island while you are there."], ["Reviewed December 19, 2017", 4.0, "Great Christmas Lights", "Walked around the island looking at the awesome light displays and watching the Christmas boat parade. We had a frozen banana, ate ice cream and took in the scenery."], ["Reviewed December 17, 2017", 5.0, "2017 Boat Parade and Holiday Lights.... AWESOME!", "Enjoyed the annual Holiday Boat parade, watching the boats from the bridge that leads to the island as that is their turn around point so you see them from both sides of the bridge. So fun and amazing how much people really go ALL OUT for the boat decorations. Equally as enjoyable is walking around the island and seeing the beautifully decorated homes.... They are incredible.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Pristine and delightful!", "This place is pure heaven! The shops, restaurants and beach are perfect is every way! The locals are friendly and helpful. Whether you want a nice day trip or to spend some nights on vacation, I highly recommend this area. Take the ferry over for the day and enjoy all this spot has to offer! You can rent bikes and they also ha e Segway tours. We ate at Ruby’s at the end of the pier and it was great!\nShow less"], ["Reviewed December 15, 2017", 5.0, "Great little town", "What a wonderful town to stroll around and enjoy visiting the small quaint shops where you can find great unique items. Grab an ice cream and enjoy the day. Parking available on the street."], ["Reviewed December 14, 2017", 5.0, "Beautiful", "This time of year there are hardly any people, which is just wonderful because it’s so warm still! It’s a beautiful walk if you want to just wander."], ["Reviewed December 14, 2017", 3.0, "Quaint island", "I enjoyed walking around the island. Most of the shops and restaurants were grouped in one area so it made it easy to look around in half a day."], ["Reviewed December 8, 2017", 4.0, "A great place to visit", "drive across the little bridge and your on Balboa Island, a community of tightly packed small and very expensive houses which are all interesting in their own right but very impressive as a collection. Whether on the waterside or 2 blocks inward the houses are worth seeing, as is the ambiance and the way people have adapted to a small, expensive island with wonderful views of the harbor and adjacent cliffs.\nShow less"], ["Reviewed December 6, 2017", 5.0, "a sunset not to miss - Balboa Island", "Whilst in LA head to Newport and take the short (car, peddled & peops) ferry ride across to Balboa Island. It’s too cute. Grab a sundae or shake and take a leisurely stroll , checking out the quaint waterfront (holiday rental) homes. The small sandy beaches are ideal for water traffic watching or catch the rowers training. Make sure you head back over to the fun park at the wharf and ride the Ferris wheel at sunset. View from the top is a winner; off to the right is the ocean to the left to Balboa Is.\nThe waters took on a soft salmon colour, pink hues of the sun dropping and the telling of a bumper day coming tomorrow.\nEnjoy!\nShow less"], ["Reviewed December 6, 2017", 3.0, "It is a family crowd place", "just walk through. you can spend some good time with kids there. I would have liked to see more restaurants a shops there."], ["Reviewed December 3, 2017", 5.0, "Holiday Lights on the Water", "I was really impressed with the organization of Davey’s Locker harbor cruises to see the holiday lights. It is a well run operation and the staff, crew and vessels are all top notch.\n\nI appreciated their advice via my email confirmation regarding parking. We parked at the Edgewater Garage which has valet and is covered. I was worried they would be full by our late afternoon arrival, but they weren’t. They are very close to Davey’s Locker and were very helpful in telling me how to get there. So thanks to Davey’s Locker for that small tidbit of advice, as it made our visit much easier.\n\nOur cruise was on the Ocean Explorer and the max amount of guests per cruise is 102 for that vessel per a crew member I asked. It’s a big boat and had a comfortable crowd. We met both really nice people and people who need lessons in politeness during our cruise. The crew was great at all times...I’m referring to my fellow passengers. Some were out and out rude. Really, no one is more entitled than any one else, but some people sure acted like it.\n\nThe only suggestion I would have for Davey’s is a new playlist of Christmas songs that plays as you cruise. It’s a nice idea and one I wasn’t expecting, but includes way too many Country selections and some songs that were downright sad and close to depressing. With all the Christmas music out there I think they should revamp it a bit.\n\nOverall this was a fun experience and one I would do again snd encourage others to experience. If you go, the best views will be on the right side facing the front of the boat. You are free to move around during the cruise, but I noticed this side seemed to have the best views throughout. Also, don’t forget to put money in their tip bowl as you disembark!\nShow less"], ["Reviewed November 26, 2017", 5.0, "Cute little island - have the frozen banana", "Visit the stores then take the Gerri and go to the island for a ride on the longest ferries wheel while you take pictures. Then have dinner and try a frozen banana dipped in chocolate and toppings. Yummy. A nice place to stop."], ["Reviewed November 23, 2017", 4.0, "Balboa Island", "First time to visit this place, sad to say the shops are closed bec its thanksgiving day. Its a quaint little island with small boutiques. Nice place to just walk leisurely and enjoy the peaceful environment. Highly recommended for family vacation."], ["Reviewed November 21, 2017", 4.0, "Step back in time", "Took the ferry from Newport Beach to Balboa with our cruisers. Super quaint main shopping and food strip next to the bridge over to the mainland. It felt like we stepped back in time. Although there was one coffee chain there, most of the boutiques and food/restaurant offerings were unique and local. Definitely an older crowd on this island. Cruised around on our cruisers. Architecture is very different than that of Newport Beach. A different world altogether. No other people on bicycles but lots of cars with older drivers. We would probably just take the ferry next time and walk around the island. A lovely way to spend a few hours.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Bring your credit card", "Balboa Island has amazingly cheap yet good quality clothing, including shops where all items cost $14 or $16. The shopping strip opens till about 9pm in summer, and you'll find an abundance of bars and restaurants to satisfy your hunger and thirst when you finish shopping. Make the effort - you won't be disappointed\nShow less"], ["Reviewed November 9, 2017", 5.0, "Most Beautiful area in the OC", "Balboa Island is one of my favorite places in all of Orange County! The boardwalk is the perfect walk for young ones (it’s about 1.5 miles from start to finish) and has so much natural beauty. You may see seals perched on a boat sunning their brown bodies and different wildlife in the sea. There are an abundance of shops and restaurants on the Main Street for all ages. Take the ferry across to the Balboa Fun Zone or even one of the many restaurants. Great Mex has some of the BEST Mexican in the area too! The beaches on balboa aren’t as expansive as across the ferry, but Ruby beach is the place to be if you have small children!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Always enjoy a walk around Balboa Island", "Balboa Island is unique as there is a sidewalk that goes all of the way around the island so you can see boats, docks, water, beach and friendly people walking with you. It’s about a mile to walk around Balboa Island. And it’s always enjoyable to be accompanied by a Frozen Banana dipped in chocolate and nuts! It can be purchased on Main Street!\nShow less"], ["Reviewed November 8, 2017", 5.0, "A Charming and Amazing Place to visit!", "This island and part of LA is absolutely amazing and charming. We were in the area to go whale watching and got here early to explore and also head across the ferry to go to the beach. The Balboa Island area is just great! The style of the housing and shops just look fantastic and being waterside is great too! Plenty to see and do! You are just minutes from the beach and there are plenty of nice restaurants and shops to visit and eat/shop at. Walking around here is just peaceful and relaxing too! This is probably one of my favorite places I have ever visited as a community goes. Newport Coastal Adventures which is located on the island is fantastic for a good whale watching and boating experience. The ferry which only cost 1 dollar to ride will get you to the other side of the harbor and within walking distance of the beach in addition to more shops and eating options. The only thing to keep in mind is parking can be a bit problematic so keep that in mind and get there early just in case you have to hunt for a spot to park. Once you get parked though, everything can be done on foot including making your way to the beach or any of the area attractions for that matter. Overall, will definitely visit again and highly recommend this nice area!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Strolling Balboa Island is Heavenly", "We were staying nearby and walked to Balboa Island to stroll around after dinner. It was quiet and gorgeous. Walking the boardwalk in the evening was relaxing and a pleasant way to extend our day. A few shops were open for snacks, wine, mementoes. We saw many beautiful and exotic dogs strolling with their owners! We enjoyed it so much we came back in the morning to tour again. Much more crowded but still lovely. Many shops open as well as restaurants. A truly lovely place on earth.\nShow less"], ["Reviewed October 30, 2017", 4.0, "What a really cute island", "Absolutely loved my visit to Balboa Island as it was really cute, easily walkable, and lots of restaurants to pick from. You also have the beach, the pier, and the Wedge, so you can't go wrong. I also went to Davey's Locker and did a whale watching tour, so there is plenty to do on Balboa Island. The beach is clean, there are plenty of bathrooms, and overall the people you encounter are friendly. I didn't drive in, but took a tour, but I can see that it is very, very crowded and parking can be crazy tough. I did see a lot of people on bikes and that seems to be the way to go since it's a popular place. I really enjoyed the island and just wish I would've had more time to explore it more than I actually did.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Balboa Island", "We enjoyed walking down Marine Ave, going through the shops and having the famous Balboa Bar (ice cream treat)! Enjoyed dinner at the Village Inn."], ["Reviewed October 25, 2017", 5.0, "Balboa island", "Lovely island to visit for a wander round, look at the shops, grab a coffee or have lunch. Nice walk along the water with beautiful beach houses and yachts/boats parked. Definitely worth a visit if you are in the area. Parking a little difficult on busy days.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Character place.", "Drove through one evening after dinner. This is a place that said come back and walk around. The car ferry is something different to experience."], ["Reviewed October 22, 2017", 5.0, "Quirky little town area", "The houses along Balboa Island are beautiful and unique, but also has a small arcade of attractions with small rides for children and tourist shops. You can also hire small boats and go out into the water for the afternoon"], ["Reviewed October 17, 2017", 2.0, "No where to park!", "We drove around and around with no luck finding a parking space for our car. As a result\nWe weren't able to try any of their restaurants! We saw very few shops and decided to go drive our car onto the ferry and go over to the peninsula. I won't be back. Parking is too big a hassle.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Slow, peaceful day on the island.", "Enjoyed lunch and a leisurely stroll around. Very quiet today without large crowds. Beautiful ocean views from the pier."], ["Reviewed October 16, 2017", 5.0, "Charming afternoon entertainment", "This is a lovely way to spend an afternoon. Nice restaurants, beautiful views, lovely beaches and quaint shops to visit. Definitely worth checking out"], ["Reviewed October 15, 2017", 4.0, "Place where to want to move.....", "everuthing is so smooth, you have a feeling of being so far away but you are still in California, , This is a fresh atmosphere.....full of slow moving action and good entertaiment"], ["Reviewed October 13, 2017", 5.0, "Beautiful quaint Island", "We had a wonderful visit to Balboa Island yesterday and it is a beautiful place to see. Took the short ferry ride to the Peninsula and took in the fun zone. Also walked around Balboa Village. Wonderful afternoon."], ["Reviewed October 11, 2017", 5.0, "Really cool island. Great way to spend the day!", "We stumbled across the ferry and were surprised we could jump on it with our car! Really fun! We spent $3.50 total each way. We asked a city employee about parking. There are 2 big lots. One is $18 a day. The other is $20 a day. We were heading to the cheaper one and saw a sign in a bar parking lot for $10 a day. Don't know if that's a regular thing, probably not, it was pretty quiet on the island. So we found a bargain for parking\n\nWe rented bikes and had an attachment for our 6 year old. We ate pizza and Mexican food and ride the bikes all the way to the edge I believe it's called. A beautiful lookout spot over an inlet and the ocean. We rode through the beautiful neighborhoods with the story book houses. It's a very charming place.\n\nWe went to the beach for an hour and played in the sand and waves. The waves here are huge! Fun to watch! Serious under toe though!\n\nLastly, we rode the ferris wheel! There is a lot to do here. Lots of different little rides for the kids, boat rentals and boat excursions. Lots of food and shops. We loved it. It was the perfect spot for the last day of our trip!\nShow less"], ["Reviewed October 4, 2017", 5.0, "Island visit", "very cozy and friendly place, You have to try the Frozen banana....lovely to visit if it a first time...a small island worth putting on a map"], ["Reviewed October 2, 2017", 4.0, "Relaxing walk by the ocean and bay", "It was a great day for walking and window shopping. Parking is a little tough to find. Don't forget to bring a towel in case you want to sit on the beach and people watch."], ["Reviewed October 2, 2017", 5.0, "Wonderful site to visit", "My wife and I visited Balboa Island..came over on the 2 minute ferry rid and went home by the bridge. We met friends, had an ice cream and then dinner. We looked into the shops and walked around. It was like going back 50 years to a simpler time. It was wonderful. The frozen banana ice cream treat we had on the street was great. Dinner was fun...all in all, a delightful way to spend an afternoon...\nShow less"], ["Reviewed September 22, 2017", 5.0, "Balboa Island Attractions", "Balboa Island is just across the bridge from Newport Beach. It provides shopping, restaurants and ice cream shops, Marina views and a small downtown feel!"], ["Reviewed September 22, 2017", 3.0, "Not much there except restaurants", "We didn't see a lot of shops on the island. The only thing was restaurants. We ate in the area twice and they were both good. We had a difficult time finding it at first because we were told to different directions. Newport Blvd seem to be the n quicker way.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Quaint and fun", "Balboa Island, which is about a 5 minute drive off the coastal highway in Newport Beach, is a quaint, man-made island with some fun shops and attractions. Stroll the island to view the pretty and well-maintained homes while enjoying local treats like the Balboa bar. Check out the shops on Balboa's main street for some cute vacation swag. Don't forget to enjoy the waterfront attractions! Parking is on-street, the only real detraction from driving to the island, but you can always park on the peninsula and take the ferry as well.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Vacation", "What a great gem at Newport Beach. We enjoyed taking the car on the short ferry ride to the island. Plenty of shops and restaurants to explore. Activities along the boardwalk as well"], ["Reviewed September 13, 2017", 5.0, "Great place.", "My family and myself had a wonderful time here. The people were friendly . Had such a wonderful time. I do recommend this place. I can't wait to go back. This will for sure be on my list of places to go back to!"], ["Reviewed September 7, 2017", 5.0, "Little piece of Heaven", "Great small town vibe, great shops & resturants (Royal Hen), delicious ! Loads of interesting little shops, great ice cream place (Dad's Donuts). Friendly people, great weather!"], ["Reviewed September 7, 2017", 4.0, "Views, Food & Shopping!", "Balboa is a great place to take a walk around the Island and enjoy the views of the harbor, along with the specialty shops and eateries on Main Street. It is a quant island town that the whole family can enjoy wether it's a day on the beach, or just grabbing a famous frozen banana in town.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great Place to Walk Around", "A walk around Balboa Island is great fun and great exercise. The people watching and seeing the homes and boats is really a fantastic experience."], ["Reviewed September 6, 2017", 5.0, "Shops and food and sights", "We stayed at the Hyatt Regency Newport Beach which was in walking distance to Balboa Island. There are many shops and restaurants. We ate at Wilmas patio twice. Multimillion dollar homes. Clean streets. A must see. And during Christmas time you can walk along the water and watch the yachts go by with their decorations or see the houses lit up with lights. Take the short ride ferry to the other side for more sights and carnival rides.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Take a short stroll", "Small Seaside Island with a main street that has shops and restaurants. The shops are standard seaside fair. It is pretty to walk down the main drag. I would not plan to spend too much time here. Maybe grab a bite and head to the beach.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Balboa Island - Fun Destination", "Balboa Island is always a fun place to visit with fun shops & restaurants and just strolling around the Island by foot or on bicycle. There is a bridge to cross over or a ferry to take you across to the Newport peninsula. A fun experience to enjoy !\nShow less"], ["Reviewed September 3, 2017", 5.0, "A wonderful and fun filled place", "I had a chance to visit Balboa Islands with few friends. It is just a Ferry Ride away from the mainland Newport Beach city,Southern California, in the Pacific Ocean. On a sunny afternoon, we drove down about ten miles from our hotel and reached the FERRY. I have earlier experienced drive-thru restaurant, drive-thru car wash, but here was a DRIVE-THRU FERRY. It can ferry three cars at a time covering a short distance of about a mile or so.\nThe island has a beautiful Beach with a Fishing Pier. Most of the adventurous young were enjoying swimming, surfing, challenging the gusty sea waves. Few people were strolling along the beach and still many more seated far away from the lashing waves on a beach chair gazing at the wild sea, lost in their own world. One can find little ones busy making sand castles with their own play way tools.At a short distance was a Fishing Pier.It is basically a long wooden platform jutting into the sea. There are many joints,shops, restaurants,bars all around.\n\nThe sea was boisterous, huge waves were hitting the shore, may be because of high tide.All of a sudden a SEAL appeared along with the waves.It remained on the shore, for a short while, too perplexed to watch so many human beings, none resembling creatures of its own sea world. It gave a photogenic pose to many peoples delight and vanished in the sea along with the receding waves.For me it was once in a lifetime, memorable experience, watching a SEAL in its natural habitat.\nAll in all this place is a best way to spend an afternoon if you are around New Port Beach,CA.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Create unique shops and food.", "We come here every trip to California. We have to get a Balboa bar and we also like to eat at the Italian restaurant Ciao's. There are candy shops and unique little stores as well as real estate offices that show you how much everything is around this awesome Island.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Cool place to walk around", "Good place to visit when in Newport Beach. Marine Avenue has some nice shops and the frozen bananas are well worth trying.\nWell worth taking time to walk on the boardwalk as the views are great and we also saw sea lions which was good.\nMy son and I rented a double kayak and paddled round the islands which was really good fun\nShow less"], ["Reviewed August 30, 2017", 5.0, "What character", "Love wandering the streets on Balboa looking at shops, restaurants, bars and especially the houses. What great character And style this place has. Great eating places too."], ["Reviewed August 27, 2017", 4.0, "Fabulous homes", "Once you find a parking spot this is a great place to walk around. The sidewalk between the spectacular houses and beaches is perfect for a leisurely stroll on a nice day"], ["Reviewed August 19, 2017", 5.0, "CHARMING", "The Island is charming and quaint. It has a lovely walking path around the perimeter of the island. We ate frozen bananas there and they were delicious! Just a relaxing, sweet place to visit surrounded by the calm bay waters. Delightful!"], ["Reviewed August 16, 2017", 4.0, "Fun afternoon day trip", "Unique homes along the bay and a fun downtown walk for food, clothes and whatnots. Cute children's book store, Island Tales Bookshop tucked up along the Main Street."], ["Reviewed August 15, 2017", 5.0, "Fantastic place to relax", "We loved this island. We got an Airbnb and it was perfect. I like to vacation without feeling like I'm right in the middle of a tourist zone. The only tourist area is the main street - Marine Street but it's a short walk to see everything so it wasn't overly crowded like the pier. This island was quiet, charming, and perfect for a getaway for my husband and myself. Walking away from the main street you get to see all the cute houses and it's got such a peaceful feeling. Exactly what you want when you go away. Probably what you'd want even living there full time.\nShow less"], ["Reviewed August 12, 2017", 5.0, "I would love to stay there in winter!", "If I owned a property here, I think that I'd stay for most of the year - the houses are pretty, the walk around the island is always interesting and the views are great from many of the homes. However, I would certainly clear out in summer and probably rent out the house as the island gets really overrun with tourist and holiday renters.\n\nBut for a short visit, you can drive on, catch the car ferry with your car, or park on the peninsula and just see it on foot. We drove on and found a parking spot straight away, but I think that we were very lucky to do so. If we have time there again we'll definitely go over by ferry and just walk around the island.\n\nWe didn't check out the shops as we really just went over to see the homes, the boats and the view. We grabbed an overpriced but tasty ice cream and did a circuit of the island. With lots of stops and photo taking, we were on and off the island in less than two hours.\n\nWhen we're in the area again we'll undoubtedly return, and I'll be looking into holiday letting, but in the winter months.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Great fun!", "Must see spot. Lots of shopping restaurants and fun for all ages. My kids loved the Ferris wheel and the arcade."], ["Reviewed August 10, 2017", 5.0, "Lovely neighborhood", "All the tiny streets with their cottage-style houses seem like a combination of Cornwall and Nordic towns."], ["Reviewed August 9, 2017", 3.0, "Very crowded place...", "A tourist little island which can be accessed by a ferry. The ferry was fun. We had problem with parking. There are many little \"tourist trap\" stores and also some nice restaurants all over. Its a great place to walk around, have a snack and chat and laugh and get back home.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Great place", "Visited a couple of times, went on the ferry to get there. Walked down the pier and chilled out. Some lovely beachside homes, would love to stay here every summer. Restaurants not up to much though from what we saw 😕"], ["Reviewed August 8, 2017", 5.0, "Balboa Island", "A great to walk completely around and then go stroll down Main Street to see the shops and maybe enjoy a Starbucks or a meal and one of many diverse restaurants or just a donut!"], ["Reviewed August 7, 2017", 5.0, "Wedding", "Beautiful place. Would love to spend a week here. Nice small beach town. Loads of things to do for everyone"], ["Reviewed August 5, 2017", 5.0, "Nice old town", "The island frequently gets mentioned in national rankings for being quaint.\n\nThe area still has a small town feel except for it being very crowded in the summer. City gets 100,000 visitors a day in summer so this place gets crowded.\n\nLots of boutique stores, local artists, and the best frozen bananas on earth.\n\nYou can drive down or ride the ferry for a $1 per person from balboa penninsula.enjoy the fancy homes. John wayne lived here before he died.\n\nNo real beach but great views\nShow less"], ["Reviewed July 31, 2017", 4.0, "Very Pleasant for a Walk, Don't Go if you Like Diversity", "We live on the Peninsula, and travel by ferry to the Island occasionally, but had never walked around the whole island, although we had kayaked around it. A pamphlet we came across listed the X number of things one must do in Balboa, and a 2.6 mile walk around the island was included. We went on 4th of July weekend, and it was very patriotic. Many houses were decorated. One house even has a permanent bust of Ronald Reagan in the front yard. Walking on the boardwalk is very nice, and going by all the bay front houses is an experience. Is there a flower competition going on? Almost every house had beautiful flowers in front. It's better than going to Descanso Gardens. The Island is almost all residential, but there is one business street, where all the restaurants, art galleries, bakeries and stores are. Be sure to stop at Dad's, the home of the Original Frozen Banana, or is it the place half a block down that also claims to be the home of the Original Frozen Banana? If you like diversity, this is not the place. In the hour we were there, we did not see one non-Caucasian face.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Sad News Just Released", "The 70-year-old Bay Arcade lost its lease & is closing on August 20. Locals are very upset over the change. The building has a new owner. The space will be converted into a Cafe & Doughnut Shop.\n\nThe Fun Zone is an old-fashioned Amusement Park dating from 1936 with Ferris Wheel & Kiddie Rides. The experience wouldn't be complete without Corn Dogs, Cotton Candy, Chocolate-covered Banana Bars, Funnel Cakes, Fried Twinkies.\n\nI enjoyed walking around Balboa Island & admiring the Architecture in this quaint town that has a long & storied 101-year history. The population doubles during the Summer months as thousands of Renters arrive. This is the best all-around beach venue in the area, IMO.\n\n\n\n\n\n\n- [ ]\nShow less"], ["Reviewed July 30, 2017", 4.0, "Shops", "Island is pretty. My mom loves shopping there every time we go to Southern California. There's a pub and a few drinks/snack shops too."], ["Reviewed July 28, 2017", 5.0, "wonderful stroll", "Need to unwind? Take a late evening walk along the boardwalk.. no parking fees, just a search for parking, but then walk in the peace of the bay.. it is safe, beautiful, and a level easy stroll. construction on the east end complicates access now, so plane the western side only.. it really is beautiful.\nShow less"], ["Reviewed July 27, 2017", 4.0, "parked car to travel to Catalina", "Took Ferry to Catalina Island. Parked our car on Balboa island. Cute place. very nice vibe. Wish we could have spent more time here."], ["Reviewed July 26, 2017", 5.0, "Love this little Island, Best \"Beach Bars\" are here", "We usually go here, get a \"Balboa Beach Bar\" and walk around the Island. Fun to do anytime, romantic at night with all the lights."], ["Reviewed July 25, 2017", 5.0, "Fun", "With daughter and grandkids for the day. Nice walk. Friendly people. Fun building sand castle. Taking the ferry was a first for our 4 year old grandaughter."], ["Reviewed July 24, 2017", 4.0, "Get a chocolate covered Banana", "We love balboa it is very close to CDM and Newport Beach. Great spot to get a paddle board rental or chocolate covered banana. Sometimes during the day it can get very crowded so go when it is not summer because then it can be very crowded. We also love balboa candy with all types of candy. Great spot here!!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Cheesecake on a stick, dipped in chocolate? YES!", "Fun, relaxing commercial center... cute boutiques, restaurants and dessert stands. Walk to the end and then along the water to enjoy amazing homes and boats. Then take the ferry over to the peninsula and enjoy a ride on a Ferris wheel. Quaint and relaxing."], ["Reviewed July 17, 2017", 5.0, "Spent a week with the family on this charming island", "We visited friend living in Newport, and stayed in a rented home on the island. Plenty to do and lots to see. Took my son sailing, went fishing off the pier, ate at some great restaurants and had an all round great time. The island is very easy t get around and has a real small town feel about ti.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Come Here in December, Santa Parade", "We come over here when visiting over Christmas Holiday. The island is small and the parking is tight but there is a yearly Christmas eve (I think) Santa motorcycle parade. They dress in Santa suits and drive through the town in a group and the kids loved it. After the parade walk around and shop and eat taffy or other items. You can even use the ferry with your car to another part of the island.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Balboa Island is a must see!", "Not only have I lived on the Island in the past for 3 years, I still visit quite frequently. There are cute little shops and new restaurants. I do wish they would update the yogurt shop. This is a great place to see. Walking the island is a great experience.\n\nThe cons: There is a lot of traffic during holidays and weekends. To the point of frustration.\n\nThe pros: It is very charming and sweet. You are sure to get in the holiday spirit all year long.\n\nLove it!\nShow less"], ["Reviewed July 10, 2017", 3.0, "Not really worth the hassle to get there", "In my opinion this little island is cute but certainly not worth battling the traffic or parking hassles. I enjoyed my frozen banana a beer and a few shops then needed to escape the crowds."], ["Reviewed July 10, 2017", 5.0, "Take the Ferry!", "Our kids, 7,8,9 and 18 loved the ferry ride. It was neat to drive on and float across the bay. There are cute shops and restaurants available. We enjoyed our trip."], ["Reviewed July 10, 2017", 5.0, "Loved It _ Must Go Back", "We didn't spend near enough time here. Came around 4.30-7pm. It was perfect for a late day stroll. The town is too cute. I want to go back and rent a house for sure. The downtown is so neat!"], ["Reviewed July 10, 2017", 5.0, "TAKE A STROLL", "Walk around the entire island, not only the main shopping street. The entire walk is very easy, with benches along the way. Takes about an hour of casual walking. Great views from both sides of the island. Parking on the island can be challenging, especially if you want to park close to the main shopping street.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Fun and unique for everyone", "A small but intriguing island--homes on the sea to rent, small good venues to eat, little shops to wander, and the ferry to the end of Newport Beach and Newport Beach Peninsula. Enjoyable for couples and families."], ["Reviewed July 10, 2017", 5.0, "Even as local, I enjoy the ferry!", "Even as local, I enjoy the ferry! As a native in orange county, and living in the Newport area for the last 25 years, even I will jump on the ferry once a month or so if I am already on the island and needing to get to the peninsula to go home, or vice versa if I just want to go for fun ferry ride across the harbor. If you're visiting as a tourist, the ferry ride is a must and a short five minute ride an opportunity to view Newport Harbor! But beware, if you were going during prime time summer days and hours, you will encounter oh wait, and possibly up to 30 minutes or so.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Balboa island", "Great place to take a stroll alongside the sea walkway and take in the different architecture and views. Lots of shops and galleries. Ate at Ciao, great Italian restaurant."], ["Reviewed July 8, 2017", 5.0, "Beautiful place to walk/explore", "A friend who lives in the area introduced me to Balboa Island. We took the ferry across. I enjoyed walking along the water in front of the beautiful homes, admiring the unique style of each one. The island has a lot to offer, and I will return for a longer stay. Beautiful place!\nShow less"], ["Reviewed July 7, 2017", 4.0, "Beautiful island", "It's a beautiful area, although small and the parking is very hard to find. If you are in the area, you should check it out. Has some nice shops & dining options"], ["Reviewed June 26, 2017", 5.0, "Quaint Little Island", "I drove over to Balboa Island by myself while my husband was at a work conference. The downtown is so cute with lots of little shops and little places to eat. I was there a couple hours, was able to buy some souveniers for my kids who were back at home in Kansas. I loved being over there. Parking is a little difficult but if you don't mind walking, you can park a few blocks from the main street and walk to the downtown. The staff in the shops were very friendly and helpful.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Fun place", "The ferry to the island tames 5 minutes. It has a beautiful view and many cute places to shop for women's clothes at great prices"], ["Reviewed June 24, 2017", 5.0, "Family fun", "We've been coming here since we were teenagers, it's a family fun spot!!\nThe beaches are clean, the sand is soft and clean! There's so much to do, play in the water, shop and dining for every budget!\nWe love renting bikes or a surrey bike for extra family fun! Paddle boarding is a must try, or even rent a water craft!\nShow less"], ["Reviewed June 24, 2017", 3.0, "A typical beach neighborhood, albeit more expensive", "I visited the area due to reviews. there are better places to visit the beach without the number of people. However, if you like to people watch or to see how the well off live this is probably the place to go."], ["Reviewed June 23, 2017", 4.0, "Nice walk", "My son and I walked the island while my husband was in a conference. We ate at a good restaurant and had a nice walk together We enjoyed looking at all the beach homes and the ocean views."], ["Reviewed June 22, 2017", 4.0, "Walkabout a beach town neighborhood", "If you take the Balboa Island ferry, it will drop you off in the middle of this town. Veer to the right and take a lovely walk along Bayfront Street. You will pass by beautiful homes and gardens. When you get to Marine Street, turn left and walk straight to the little downtown/business area with shops, restaurants, a post office and fire station. It's a great way to spend a few hours if you are in Newport Beach.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Day trip to Balboa Island and peninsula", "My friend was visiting from New Zealand and likes to be outdoors. I took her to Balboa Island next door to Newport Beach. This is a great place to walk around the island, eat a chocolate covered frozen banana rolled in nuts or eat at several great restaurants like Emilia's. We took the ferry across (in my car) or take your bike or walk on to the ferry. We took a harbor boat ride after that at a low price of $14. For an hour. She said that was her favorite thing to do on this visit as the whole day was fun. She also had fun shopping on the Island.\nShow less"], ["Reviewed June 21, 2017", 5.0, "cheap historical and beneficial transportation", "Visit to Newport Beach is not the same without using or even walking on the Balboa ferry! It's like a $1 boat ride! It's a short cut to the tourist attractions on the peninsula, restaurants and beach! Worth a trip just for the experience of the bay and the picturesque surroundings! I live here and whether I', riding a bike, walking or even in a car, I love the short 5 minute trip to the other side of the bay!\nShow less"], ["Reviewed June 20, 2017", 5.0, "Coming back HOME", "Travelled from Destin, FL to visit the Island of my youth. Many things have changed but many great things remain. Definitely the best place to visit and stay on the West Coast."], ["Reviewed June 19, 2017", 4.0, "Small island!", "You can go their by ferry or driving, the ferry ride about 2 minutes.\nThere are some rides for kids and arcades, it is full of small old shops. And few restaurants overlooking the ocean, you can spend a good couple of hours there, you can also rent a boat or bicycles and spend your day their\nShow less"], ["Reviewed June 14, 2017", 5.0, "Fantastic", "I keep coming here for the Barbour/island tours and for a relaxing vacation. Learn about the owners of the gorgeous waterside mansions as you take the \"Fun Company\" boat cruise. Such fun!!you might even see some sea lions! Great place!"], ["Reviewed June 11, 2017", 4.0, "Segway ride", "We rode around this cute and quaint island and it's beautiful but not a lot to do otherwise. Used the ferry to get to the island and that was kinda unique."], ["Reviewed June 6, 2017", 4.0, "Pleasure island", "You know the story, Pinnochio. Boardwalks, beaches, restaurants and typical tourist shops. Plenty for everyone in the family to do. Rent a bike for the day, with a lock. It's a great way around the crowded streets."], ["Reviewed June 3, 2017", 5.0, "Bucket List! Must do!", "Go back in time any day of the week. A darling, little, character driven island that takes you back in time. Frozen bananas, small post office, little shops with cool clothing, market, awesome cafes and a delightful way to spend a gloomy afternoon. Loved it."], ["Reviewed May 25, 2017", 5.0, "Such a fun afternoon", "Very cute place to walk around and visit shops. Quaint location with adorable houses. Well worth the visit."], ["Reviewed May 24, 2017", 3.0, "Balboa Island", "A small shopping area in an interesting area of older homes. Enjoyed the historic signs on some of the homes."], ["Reviewed May 23, 2017", 4.0, "Enjoy a leisure stroll", "Stop by to enjoy the sights of the island, a fun place to enjoy a few hours of sightseeing in the New Port Beach area."], ["Reviewed May 23, 2017", 2.0, "IT NEED TO BE REMODEL", "THE BUIlding struCtures r falling apart. it not pretTy like it use to be. it neEd morE restauRants or snAck bar places. parKing is a nightMare. great plAce to walk your dog or jog. it get veRY colD at NighT"], ["Reviewed May 22, 2017", 5.0, "Just fun and accessible! But the food there will send your arteries to intensive care. Yum!", "Taking the ferry is cheap and fun; walking or driving. Sitting out on the deck of the fun zone watching and noshing is real SoCal experience you shouldn't miss. Go inside through the museum."], ["Reviewed May 22, 2017", 5.0, "Quaint & adorable", "I loved everything about it. Adorable! Nothing more to say then you should go if possible! Lunch was delicious and the shops were so cute."], ["Reviewed May 18, 2017", 5.0, "Great place for a stroll", "Magnificent setting. Luxury yachts fronting bayside homes. Great an after dinner walk...especially at sunset"], ["Reviewed May 17, 2017", 5.0, "Bravo Balboa", "We visited Balboa Island for the first time on May 13 and just loved it. It has some great shops, nice restaurants, and the walk along the water was gorgeous. So many of the homes facing the water had gorgeous gardens. I highly recommend seeing this charming island.\nShow less"], ["Reviewed May 14, 2017", 5.0, "Charming Island", "Balboa Island is a charming island off the coast of Newport Beach. We love to walk around and look at the interesting architecture of each home. There is one main street with plenty of shopping to please everyone. I especially enjoyed the adorable store Toss which had many unique items. I purchased a beautiful tote and some sorority things for my daughter. I also loved the home decor store Island Home where I purchased a beautiful piece of art for my home.\nShow less"], ["Reviewed May 14, 2017", 4.0, "Loved the island", "We enjoyed all the cool stores, restaurants and especially the beach. Wished we would have stayed on the island for more of a beach stay. Next time!"], ["Reviewed May 13, 2017", 5.0, "Nice island to walk around...", "It was easy to park in mid day. We walked around the island, all with sidewalk and great view of the harbor with the yachts ...it take about 45 - 55 minutes of walking... then there are small stores, restaurants and shops to enjoy."], ["Reviewed May 9, 2017", 4.0, "Nice !", "Very nice large parking ! And beach is nice also very less people not like Santa Monica very relax place !"], ["Reviewed May 9, 2017", 3.0, "Average", "Took the ferry across($1.00 per person each way). Walked around the shops, beach and pier. Saw dolphins at the end of the pier. Weather was rainy so, couldn't get in the water. Looks like a great place to surf. Typical southern California beach town."], ["Reviewed May 9, 2017", 5.0, "Cute shops", "Loved the ambiance of the island. Unlike many other touristy places, the prices in the shops are fantastic!"], ["Reviewed May 8, 2017", 4.0, "Take the Ferry", "Fun to just walk around and see the beach and cute, small, expensive beachfront properties. You can even rent pedal bikes to go down the boardwalk. Lots of eateries on the main streets and colorful little houses around."], ["Reviewed May 4, 2017", 5.0, "Still one of our favorite things to do ...", "We love Balboa Island. It is just a bit off the beaten path but is so fun to walk the bay fronts or explore the back streets. We most enjoy walking around the Island, checking out the eclectic (and many times extremely expensive) homes, and the incredible selection of watercraft and bird life.\n\nYou'll see just about everything. Take your camera and enjoy.\nShow less"], ["Reviewed May 3, 2017", 4.0, "Fun Visit", "The Peninsula is a Great Day trip. Enjoy the Beach, the shops, and the tour of the Bay. Take time to visit the Homes on the tour."], ["Reviewed May 3, 2017", 5.0, "Balboa Island", "We spent a couple of hours shopping and had lunch. The locals were very nice and hospitable. Wish we had more time there, will definitely go back again."], ["Reviewed April 27, 2017", 5.0, "Walkable Island", "Balboa Island has a sidewalk around the island that provides great scenery of the bay, boats and houses. It also has great shopping and restaurants."], ["Reviewed April 27, 2017", 4.0, "Small Americana in the OC", "Balboa Island is very walkable and charming. It's easily accessed by ferry or bridge. Slow down your day by taking a relaxing stroll through the streets to enjoy the character of the neighborhood as you make your way to Marine Ave. Browse the small businesses that line this Main Street. Everything you could need will be here: a post office, a market, several places to eat, drink & shop, there is even a cute place to get pampered at Rosey Toes. I wonder if these islanders constantly pinch themselves to be living in such a unique & lovely place!\nShow less"], ["Reviewed April 21, 2017", 5.0, "Interesting Little Village", "Shopping district has lots of stores and food available but hard to find any parking. Pretty cool. A must see just not in prime travel time."], ["Reviewed April 14, 2017", 5.0, "Fun Adventure", "Great restaurants, shops of all kind, lovely homes with beautiful plantings to walk by and enjoy. The BEST thing is all the outdoor and water activities"], ["Reviewed April 11, 2017", 4.0, "Dont miss the boat tour.", "The Island was quaint and a great detour for a nice walk through the waterfront neighborrhood. The boat tour around the entire island was the highlight that brought the history of the island neighborhood alive."], ["Reviewed April 5, 2017", 5.0, "walkable little town", "It is a little walkable town in a peninsula. One side has the beach and one side is for boat. For the end of the March, the water is still too cold, but it's ok to play in the sand."], ["Reviewed April 3, 2017", 5.0, "Great places to eat or stroll", "Great place for the whole family to enjoy, Candy shops, Pizza, Coffee and baked goods and a variety of restaurants from Italian to Chinese to Mediterranean"], ["Reviewed April 2, 2017", 4.0, "A Fun Day", "This is a quaint little area to visit. Cute shops and little cafes line the street leading down to the beach. Must try the frozen banana at Dad's. A classic!"], ["Reviewed April 1, 2017", 4.0, "Great Family Fun", "Really cool little island with a lot of fun shops. Surf shop, toy store and various other stores to keep your attention. We saw Kevin Costner at the toy store. The frozen bananas were great!"], ["Reviewed March 31, 2017", 5.0, "Just big enough.", "Very cute little island. You can easily walk the whole island and there is plenty to look at along the way. There are cute shops and restaurants. Island time feel in the heart of the city. Frozen bananas and Balboa bars are a must!"], ["Reviewed March 31, 2017", 5.0, "Great shopping!", "A Mecca for food and shopping! Clothing boutiques, restaurants and art galleries. A great place to visit. And don't forget the chocolate covered frozen bananas!"], ["Reviewed March 30, 2017", 5.0, "Fun ride", "Got on and off smoothly, loved the view. The teenagers loved getting off the vehicle and sitting as we crossed to the other side. Fun day"], ["Reviewed March 28, 2017", 5.0, "Super fun evening with the family", "Great time with 4 preteens, walked the island and marveled at the real estate and fun shops. Only spent 4 hours but it was still fabulous."], ["Reviewed March 22, 2017", 2.0, "SKIP if you have teens", "We didn't pay enough attention to what KIND of family Balboa Island works for as a \"family destination\". Probably nice to rent a vacation home here, but don't waste your time visiting the village if you have teenagers. We lasted 5 minutes and wished we hadn't wasted the time. Tacky, tacky, tacky.\nShow less"], ["Reviewed March 14, 2017", 5.0, "Best mini vacation ever", "The people are friendly, the food is great, and the location is perfect for visiting this section of the coastline."], ["Reviewed March 13, 2017", 5.0, "Cheap thrills, looking doesn't cost a thing!", "The sun was out and the walk to the business district was beautiful. The little town has cute shops and a great bakery."], ["Reviewed March 12, 2017", 4.0, "Balboa", "Balboa lost its zip code and was placed under the wing of Newport Beach. Not enough residence to support a continued zip code of its own, the little hamlet of Balboa, including the island, still holds its individuality. Its neighboring community to the north whose zip code it shares … 92662, has not gobbled it up … though is a draw for locals and tourists, alike.\nBalboa in December was a bit cold due to the Santa Anna’s that blew in our first night. They blew in and we blew out the power, though that is another story. Luckily, my friend’s relative lived close (just 20 minutes away) and we moved in with her for our weeklong stay in the area. This made it easy to return to Balboa.\nWe spent two separate days in the Balboa area. One day we took a walk along the ocean side of the area – Newport Beach. Being December, there were no crowds. Several bicyclists and other walkers enjoying the area. There were surfers, as well, waiting for a wave, which were few and far between. To my surprise, my friend who has had access to a beach house in this area all of her life never had ventured over to the ocean side. This made it more enjoyable to see her reactions along our walk.\nIt isn’t that I had never seen the ocean before; I have touched my toe in several. Simply, I enjoy experiencing new areas. This stretch of beach had several high chair units for lifeguards (none during this time of year). In addition, of course, there is the Newport Beach Pier. Balboa has that charm of old, being a small beach community. There are several condominiums for rent along this stretch of beach, which I imagine enjoy some fabulous sunsets facing west to the Pacific. A bit pricey though could be worth it.\nOur second day in Balboa concentrated on the island. We took a ferry over, enjoyed a lunch, and walked the circumference. The ferry costs only $1, holds a few cars and passengers, and comes often. Another evening, we returned to see the Christmas lights. Being December, again, there were no crowds, except the locals. This community pulls all the plugs for their decorations. There may be a competition for all the displays, for all I know. It was well worth the second trip over to the island.\nAccording to my friend, summer is an entirely different story – LOTS of people. I think I prefer December.\nShow less"], ["Reviewed March 10, 2017", 4.0, "FUN LITTLE ISLAND..good to explore.", "WITH DOG IN TOW, We walked the beautiful Balboa Island, admiring some extravagant bayside homes. We also strolled down the main shopping area. We approached by ferry from fun zone, only $1 for a crossing, more for cars. It is a quick crossing, less than five minutes.\nShow less"], ["Reviewed March 10, 2017", 5.0, "Unique", "Balboa Island and Balboa Peninsula are a great place to people watch, see beautiful houses, look at boats and see some wildlife. There are plenty of activities and boutique shops. Great place to spend an afternoon."], ["Reviewed March 8, 2017", 5.0, "Sight seeing", "Nice unique shops. Beautiful homes to see. Some shops expensive others affordable 50/50. It is free to walk and enjoy the experience and sunshine."], ["Reviewed March 7, 2017", 5.0, "Fun Morning Exploring", "What a fun little place. We were here with our girls, ages 8 & 6. We walked all around the island checking out the shops and sights. Lots of cool places to shop and eat. The beach is amazing. We came first thing in the morning and it was not crowded at all.\nShow less"], ["Reviewed March 7, 2017", 4.0, "Quaint Island,", "This is a must see side trip if you are staying in the area. We drove across but there is a ferry to also use to access the island. We enjoyed walking out on the pier, even though it was foggy, many people fishing, fun to watch. We walked among the many shops, drove around to see some beautiful homes.\nShow less"], ["Reviewed March 6, 2017", 5.0, "Cozy State Fair feel", "Beautiful island with lots of antique shops, great homy restaurants, beautiful people, and amazing beach. Very walkable & kid friendly."], ["Reviewed March 1, 2017", 5.0, "Small Beachtown feel", "Balboa Island is a very small and quick place to get your beach town fix. Only one street has any significant businesses, but it is loaded with clothing shops and great restaurants, ESPECIALLY BALBOA BARS and FROZEN BANANAS! Grab a sweet treat and talk a walk around the island. Great views on all sides.\nShow less"], ["Reviewed February 28, 2017", 3.0, "shops close early at night", "frozen bananas and the balboa bar is a must try! the one with the newspaper cut out is the one i tried. there's no outdoor seating but it's mostly a to-go treat so you can munch while walking around the island."], ["Reviewed February 24, 2017", 5.0, "Unique Place with Great History", "We thoroughly enjoyed our numerous visits and walks to the Balboa Island; the unique homes (many with heritage designation) make for interesting walking and sight-seeing.\nThe place is very clean, safe to walk and all locals we met were very welcoming and friendly.\nWe very much enjoyed Sunday Mass at the small, yet very beautiful St. John Vianney Chapel on the Island.\nShow less"], ["Reviewed February 18, 2017", 5.0, "Cutest little town", "I spent many, many summer days on Balboa Island. It still has most of the charms from years ago. I love just walking down the main street and walking over a couple of blocks and walking along the water. Prices are much steeper than they should be and I think sales would be brisker if they gave some thought to that. But is still very charming.\nShow less"], ["Reviewed February 13, 2017", 5.0, "A \"MUST DO\" while on Balboa Island", "Cheapest boat ride you'll ever take. When I was a kid the fare was 10 cents. We'd never have the money, so if the guy collecting the fare caught us sneaking around the ferry, we'd jump overboard and swim to shore. By the way. those ferries where all built in the '50's and are all wood.\nShow less"], ["Reviewed February 12, 2017", 4.0, "Cute place to walk around - feels almost like the northeast with a California flare", "I was lucky enough to walk and drive through the Island with a local so got to see all the best places, ride the ferry and enjoy the unique atmosphere only Balboa Island can offer. Great for walking on a sunny day (2-3 hours is probably ideal but could certainly be longer or shorter).\nShow less"], ["Reviewed February 7, 2017", 5.0, "Great place to walk around", "Attractive island community. Nice place to walk around, see the neat houses and the sea. Wonderful little restaurants."], ["Reviewed February 1, 2017", 5.0, "Fantastic Day at the Beach", "Went recently with a friend for lunch on the Island. Even though I have lived all my life in Southern California, I had never been to Balboa Island. I am so glad I decided to finally go. We parked at the Balboa Pier (only $1.20/hr.) and took the ferry across for $1. It took about 2 min. to cross. There are clean restrooms available as soon as you exit the ferry. We walked to the main street with the shops and restaurants. Being January, I had expected the streets to be empty, but it was a nice sunny day and there were plenty of people. The shops are quaint, as are the restaurants. The Island is very dog friendly and I will be taking mine with me the next time I visit. We spent about 4 hours there, but could have easily spent 6 if we looked in all the shops. Its an excellent place to take a leisurely walk and breathe in the sea air.\nShow less"], ["Reviewed January 17, 2017", 5.0, "Balboa Island--one of a kind-- picturesque and charming", "Balboa Island--one of a kind-- picturesque and charming. Look for the “dutch” doors. Spend a couple of hours walking through the mini-downtown and around the island. Great on a sunny day and not too bad on a rainy day."], ["Reviewed January 16, 2017", 5.0, "Love the island", "When in Newport , one must stop at Balboa Island. It is so lovely. The Main Street is full of lovely little shops , restaurants and rather old fashioned in a nice way. The frozen banana and ice cream parlour is a must. All the streets are lined by very cute and beautiful beach homes. There is 'must do' walk path all around the island which is well worth doing for beautiful views of the bay and the various inlets of water and all the boats anchored and also all the activity on the water . Then take the cute three car ferry across to the Peninsula. The fun zone will be good for kids and from there walk across the huge beach on the Balboa Peninsula. Rent a bicycle and follow the bicycle trail along the sand all the way to Newport pier. A great day out !\nShow less"], ["Reviewed January 12, 2017", 4.0, "Pretty houses, interesting shopping", "We liked walking along the harbor and the neighborhoods to see the beautiful houses. There is one street of shopping but nothing exceptional. A few nice restaurants but no real bars."], ["Reviewed January 9, 2017", 5.0, "Best Xmas Lights around", "There is nothing like walking around Balboa Island during holiday time (ANY holiday time). The festive atmosphere can only bring a smile to one's face and the walk along the waterfront is always lovely."], ["Reviewed January 7, 2017", 4.0, "Poetic and charming Island: quintessential American charm", "Balboa Island is one of my favorite places to visit. The walk around the island offers the most charming and poetic impressions of yachts, boats in the Marina while offering a perfect excercise. During holidays the residents of the island go all out in competing with each other in creating amazing seasonal displays. A peaceful, safe and most charming place to visit. I am lucky being able to visit several times a week, and it never ceases to impress me. Marine street is a charming Mainstreet with quantity small shops and restaurants. Small ferries can take you and your car across to Balboa Peninsula with endless long wide beaches. Balboa Island is famous for frozen bananas and Balboa Bars: a chocolate dipped ice cream\nShow less"], ["Reviewed January 6, 2017", 4.0, "Very cute neighborhoods and shops", "Balboa Island is certainly unlike many neighborhoods! As you enter the island, you will immediately be plunged into crowded streets with shops on both sides. I recently visited to buy a chocolate dipped banana- a Balboa Island tradition. As I parked on a narrow street of neighborhood. A five minute walk through the island landed me on the Main Street. As the sun set, the mood turned pleasant and the light grew dim as many of the streets were only lit by small lamps on the sidewalks. Overall, Balboa island offers a fun, but quick sightseeing opportunity. Rated four stars because of difficult parking and limited dining/shopping options.\nShow less"], ["Reviewed January 5, 2017", 3.0, "It's ok", "There's nothing much to see on Balboa Island. It's mainly residences with a couple of shops and restaurants."], ["Reviewed January 4, 2017", 4.0, "Great fun", "This is a fun place to visit and has something for everyone. Walk along the pier for a great ocean view, stroll the beach if you want the feel of sand between your toes or wander through town for food and shopping.\n\nWe really enjoyed walking to the east side of the island where we enjoyed a walk along the boardwalk in front of beautiful homes on one side and the harbor full of luxury boats on the other.\nShow less"], ["Reviewed January 4, 2017", 5.0, "Balboa island all dressed for Christmas Holidays", "Balboa island has two islands together and you park on street and walk perimeter of both-lots of cute shops and sights to see-relaxing walk- fabulous weather even in winter! And some of the furry residents are quite friendly and irresistable! We went to see the lights at night and had a lovely stroll.\nShow less"], ["Reviewed January 1, 2017", 4.0, "Loved this place in the past", "Visited with my almost 9 year old son. I had told him about Balboa Bars to get him psyched up to want to visit. We parked and walked around, he did get his Balboa bar, which he did enjoy, but it didn't seem to have the same charm this time as it did before. Quite possibly it is because my mom and I loved visiting here and she wasn't with me and that made the difference - she now has dementia and wouldn't remember anything about it, so I couldn't share with her that I had gone back and taken my son. Anyway, some of the stores are different that we went to before and it was just a different vibe. Still a quaint little place with beautiful houses on streets named after gem stones. Haven't eaten on the island, but there are a couple of restaurants that I think would be really good.\nShow less"], ["Reviewed December 31, 2016", 4.0, "Kitsch but Cool!", "You can take your car over to Balboa Island on a very interesting, small ferry. You can also drive there from a different direction, but be forewarned that parking is hard to come by. The island itself is packed full of picturesque cottages and carefully maintained landscaping, even on the streets. The main street is full of cute, unusual shops. Local small business abound, restaurants can either be tourist traps or very good places that the locals have frequented for years. At holiday time, the lights and decorations can be over the top! Best way to come here is on a bike. Have the obligatory frozen banana on a stick!\nShow less"], ["Reviewed December 28, 2016", 2.0, "Skip it", "Not worth the time or drive if you are a family with small children. The houses were neat to pass by but not a lot to see or do."], ["Reviewed December 24, 2016", 5.0, "Must see", "This is a must see island, very tranquil and has a homely feeling We will be back that's for sure Don't forget the canal cruise"], ["Reviewed December 22, 2016", 5.0, "Christmas decorations", "We went for a late afternoon walk about. Both the non iluuminated and lit decorations were fantastic. A bit crowded but not uncomfortably so. Beautiful."], ["Reviewed December 13, 2016", 5.0, "Nice place for a stroll", "Follow the broad walk for a stroll between homes and the beach. Many homes were decorated for the Christmas season and were beautiful. There are some shops and restaurants to enjoy on your visit."], ["Reviewed December 10, 2016", 5.0, "Quaint & Pretty", "At a conference all week we were lucky enough to tag a couple of days on to our stay & we wondered down to this quaint area & being December there was some of the most beautifully decorated house on the water front.\n\nThe shops were ok... nothing special; avoid Starbucks, the rudest Starbucks staff I have ever come arcoss\nShow less"], ["Reviewed December 4, 2016", 5.0, "Quaint must see", "We have very limited time in the Newport Beach area and are very happy that we spent the first half day off the plane on Balboa Island. We walked along the path by the water and thoroughly enjoyed the million dollar homes that were decorated for Christmas while watching sailboat racing. We then walked up and down the streets, window shopping. We should've taken the ferry over to the peninsula from there but opted for the long way around to Newport Beach to spend our evening. Don't miss Balboa Island if in the area.\nShow less"], ["Reviewed December 4, 2016", 4.0, "Cute little island for a quick stroll", "Its a cute place, some shopping and fun place to grab a quick lunch and to see the houses by the shore. However the shopping is quite limited and repetitive. All the shops started to carry very similar things."], ["Reviewed November 30, 2016", 4.0, "Locals doing it for locals", "This is a street of shops set up by locals and run by them\nThe shops are quaint and worth a stroll\nYou access the island by ferry\nWe visited at the same time as taking a whale watching tour so same morning activity possible\nOn street parking available\nRecommended\nShow less"], ["Reviewed November 27, 2016", 5.0, "Balboa Island fun", "We love going to the Island and walk around. Look at the darling homes, walk to the Shops that are really neat. Get some coffee or a bite to eat. It's a wonderful place to go to."]]}}