{"Balboa Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Balboa Park", "url": "/Attraction_Review-g60750-d102782-Reviews-Balboa_Park-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/07/ba/51/15/photo4jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "10315"}, "address": {"@type": "PostalAddress", "streetAddress": "1549 El Prado", "addressLocality": "", "addressRegion": "California", "postalCode": "92101-1660", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "You just can’t get enough!", "Today was our 3rd visit to the park and we still have not seen it all. We did the National History museum our first day of this vacation and returned today for the Museum of Man. We’re already talking about a return to San Diego in the near future. We haven’t done the museum of cars, the air and space museum or the Japanese tea gardens. Put on your walking shoes and plan on several days, and that doesn’t count the zoo!\nShow less"], ["Reviewed yesterday", 5.0, "Great Mix of Beauty and History.", "Walked here from our Hillcrest B&B. Locating the center/park entrance was challenging due to lack of signage. The architecture and gardens are amazing."], ["Reviewed yesterday", 5.0, "So much to see", "There are so many attractions to visit here that one day simply isn't enough time, even if you just visit the highlights. It's an extraordinary place."], ["Reviewed 2 days ago", 5.0, "What a fabulous park.", "This park is wonderful, so much to see and do. Plenty to keep us entertained for a full afternoon ((and more but we were just here an afternoon)). Food options aren't vast and we wished we'd taken a picnic but an enjoyable afternoon on the carousel, pottering and just enjoying the park none the less. Some quite good street artists too.\nShow less"], ["Reviewed 2 days ago", 3.0, "Not super impressed", "Maybe it's because we're used to museums in Washington DC, but we weren't super impressed by Balboa park. We've seen a lot of botanical gardens much nicer than this one. Photography museum was kinda neat."], ["Reviewed 2 days ago", 5.0, "Just a wonderful place", "There is so much to do here, and it's sooooo pretty. There are a number of museums, park areas and the zoo. We could have spent days here."], ["Reviewed 3 days ago", 5.0, "Beautiful", "Simply stated this is an extraordinarily beautiful urban park. It’s beauty and the multiple museum attractions, restaurant choices, vistas and venues beckon you to stroll and from time to time tarry awhile. Don’t miss it."], ["Reviewed 3 days ago", 5.0, "Quick walk through after trip to zoo.", "Our family spent a couple of hours walking through the park after seeing the zoo. We have two teenagers, 13 and 14. We enjoyed looking at the beautiful architecture. We did not have time to go into any museums and can see how you could spend a whole day in the park and not see everything. Enjoyable afternoon for free!\nShow less"], ["Reviewed 4 days ago", 4.0, "Fun place to visit...really spread out!", "We enjoyed walking around this huge area with alot of local flavor. Wonderful architecture and interesting arts throughout. You do have to pay at most of the museums but you could spend days there and still not touch it all! They have walking paths, stores to shop in, museums and general beauty. It was fairly cool when we were there and we just walked and walked and stayed pretty warm!\nShow less"], ["Reviewed 4 days ago", 4.0, "Lovely", "We went there in the morning by a public bus- an easy commute. Great place to enjoy outdoors. Loved the Spanish village and old globe theatre."], ["Reviewed 4 days ago", 4.0, "Nice afternoon", "Spent the afternoon here with my family and boyfriend. Beautiful, and free, walk in the park. There are several museums around that you must pay to get in, and we checked out the “museum of men,” as it happened to be where we were walking. Unfortunately, I was disappointed because they let us in without letting us know they were just about to close, and it felt like a waste of money. Be sure to check what time they are open until, as it was only 5 pm when our museum was closing. The botanical garden a beautiful, and free of admission. I would recommend, but quite honestly, it wasn’t my most memorable stop in San Diego. It wasn’t a “must see” for me.\nShow less"], ["Reviewed 5 days ago", 4.0, "Lots to see", "There's so much to see in the park! We parked near the Air and Space Museum and took the free trolley around the park. It's hop on, hop off, and helps you avoid the hills around the park. The Prado area is lovely, as is the Air and Space Museum.\nShow less"], ["Reviewed 5 days ago", 5.0, "Do NOT miss this gem", "Beautiful buildings, museums, tram ride, gardens....lots of open places to go and see beautiful things..the grounds are lovely."], ["Reviewed 6 days ago", 5.0, "Superb architecture and lovely gardens", "This is a great park to observe the gardens and architecture. There is also some good art museums and a great model railway. Easy local bus from downtown. The architecture is very Spanish orientated."], ["Reviewed 6 days ago", 4.0, "Free walk in the park.", "This park has a lot to see. Outdoor Market is usually setup. Plenty of indoor and outdoor things to see."], ["Reviewed 6 days ago", 5.0, "A real gem!", "A visit to this park is a must when visiting San Diego. I can’t say enough great things about this park, which is larger than New York’s Central Park. The museums are wonderful to take in as are the grounds. Time permitting, take in a show at the Old Globe theater and take in the free Sunday afternoon pipe organ concert. Leave plenty of time for your visit. The people mover shuttle is free and is helpful in getting around to the various parking areas\n.\nShow less"], ["Reviewed 6 days ago", 5.0, "Great to while away time -", "We went twice in a week - once to kill some time. Loved the free parking. The free movie on the history of Balboa Park was really interesting - recommend seeing it. Lots of free stuff to take in. Tons of people there, but lots of space so not feeling overwhelmingly crowded.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful rose garden and plenty to do and see!", "I visited Balboa Park last year with my sister. We walked around the shops. We walked through the Rose Gardens. I took lots of pictures of all the things. Great place to spend the entire day with plenty to do and plenty to see. It is always great to be outside in beautiful weather. I will return and experience other fun things to do in the park some day.\nShow less"], ["Reviewed 1 week ago", 5.0, "No need to spend more $$", "Feeling $ tapped out with theme parks?! Come here for a relaxing and free stroll. The walk Way is beautiful and fountains and flowers are delightful. We didn’t go into any of the attractions here and yet had a wonderful quiet 3 h with our kids (Age 6,8,10). I feel like we saw only 1/10th of the park, but it was soothing for my soul.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun place to visit and get your Art On.", "This place has several things to offer, a beautiful arboretum, Rose garden, art museums, train rides, a carousel. There were even having an art and craft fair. So much more to do and see. Conveniently located near the San Diego Zoo."], ["Reviewed 1 week ago", 5.0, "Quaint", "Came here in past with just wife and this time with our young kids. Diverse and enchanting area. Fun to walk through and truly gorgeous Worth the time."], ["Reviewed 1 week ago", 5.0, "A great escape!", "Wonderful museums, restaurants, palm trees, & weather! It’s like it’s own oasis amongst the city. Highly recommended for all."], ["Reviewed 1 week ago", 4.0, "Museums Galor", "This a very good park. It has a shuttle that you can Hop on and Hop off to the different Museums.If you purchase an Explorer Pas this allows you to enter 5 different Museums and saves a bunch of money."], ["Reviewed 1 week ago", 4.0, "Good for all day or less", "We took a ride share from the gaslight district to the park. Lots of people there and families. Our main goal was the art museum which took several hours. We also visited the local history museum. Lots of museums in one park. Also gardens and walking paths. We were lucky to hear a rehearsal for the Sunday recital on the organ. There is a free shuttle in the park. Lots to do indoors and outdoors there.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful places for a Sunday excursion", "Lovely park with Japanese and cactus gardens. 6 museums and the Old Globe Theater where we saw The importance of Being Earnest. Today the art Museum. Take an Uber and get away from the tourist area for a day"], ["Reviewed 1 week ago", 5.0, "A San Diego Must Visit!", "Absolutely beautiful park!!! You just have to experience it for yourself!!! And for a real treat, be sure to eat at the Prado Restaurant!!"], ["Reviewed 1 week ago", 5.0, "BIG, relaxing, walking and learning", "It is very confusing at first, but take a couple of minutes and walk over to the visitors guide. It is well worth the explanation. Please visit the AIR MUSEUM, and the flower garden, and Lilly ponds"], ["Reviewed 1 week ago", 5.0, "Go card allowed us to check all offerings out", "We started at the zoo and walked to all other museums: natural history, artist village with small gem museum, art museum, automobile museum, air and space. Uber was readily available to return us to our hotel. Sunny day so many on blankets with picnic baskets. Pretty courtyards with fountains.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful-especially at night", "Make time to see this area of San Diego. Even more beautiful at night, and it really comes alive! Colorful and vibrant."], ["Reviewed 1 week ago", 5.0, "Plan on at least a day full day here.", "An absolutely fantastic way to spend a San Diego day. The myriad of cultural activities is sure to capture the attention of any one. Museums, art, theater and a melting pot of people make this a must see site in San Diego."], ["Reviewed 1 week ago", 5.0, "Lovely urban park with much to offer!", "We spent a day here while in San Diego and could have gone back another day! There is so much to see and experience! 16-17 museums, all on one site. We just did the Photographic Art one which was well worth our time, especially with the current Boundaries exhibit. The grounds are lovely and peaceful, and the Spanish Colonial buildings remaining from the Exhibition and World's Fair are remarkable and beautiful - kudos to those who saved them! My only disappointment was the Spanish Village - which was fun to explore, but the literature led me to believe there would be artisans actually at work, which we did not see. This park is a lovely way to spend time in San Diego, a true gem. We had lunch on the patio at the Prado Restaurant - wonderful setting and delicious food!\nShow less"], ["Reviewed 1 week ago", 5.0, "Something for everyone!", "This is a unique, fun place. You will find everything from museums to street entertainers, to events going on. Sit in the sun in the central court area, or take the main street down to the events quarter. Plan a day to see it all. It is a huge park!\nShow less"], ["Reviewed 1 week ago", 2.0, "Very underwhelmed!!!", "My overall impression was how unkempt the park is. Dead branches hanging off trees, flower beds full of winter leaves, unswept parking lots, actually made me sad. I come from a state that has much lower taxes in every way and our parks are cleaned up!\nThe 4 museums we went into were very BORING. Nothing very informative or educational.\nThe outside of the buildings were beautiful but some really needed repair / paint.\nVery sad to see how unloved so much looked like.\nShow less"], ["Reviewed 1 week ago", 5.0, "Culture and Creativity", "We walked around the grounds of the park and felt the inspiration and creativity energy! Museums, gardens, water features,artists- so much to see!"], ["Reviewed 1 week ago", 4.0, "Free and lots to see", "We didn’t go into the museums but still enjoyed a wonder around the park. Easy to get to with public transport the number 7bus."], ["Reviewed 1 week ago", 5.0, "Interesting Visit", "Lots of things to see - museums, garden, and restaurant. Impressive historic structure in the center. Need a week to experience the whole place."], ["Reviewed 1 week ago", 5.0, "A must", "If visiting San Diego, this place is a must. The Fleet Science Center is great for kids and the IMAX theatre is fantastic. I love to walk around and see the arboretum if it's open. I was disappointed it wasn't open. The Japanese Garden is beautiful and the Photo museum is fun, too. The zoo is a must.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing - so much to do and see!", "I only had half a day here but I wish I could come back a few more times - so much to see!\n\nThe old buildings are amazing. One of the museums has a half hour film with a history of the park and it's well worth seeing (and it's free). It all makes more sense when you know where it came from.\n\nThe art museum was good, and I had a great lunch at the restaurant nearby.\nShow less"], ["Reviewed 1 week ago", 5.0, "Always something new to enjoy", "I’ve been to the park only several times but I love the size, layout and variety of activities, many of which are free. There’s something for all ages.\n\nOn this day the temperatures were in the 70’s and we had a great walk through the main area and a relaxing lunch. It’s great to go on a weekday if possible but weekends are fun too (earlier is less crowded).\n\nThe Balboa app is location aware and helped us navigate quickly.\n\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun, Fun, Fun", "Lots to do. You can spend several days exploring the entire park. Bring confortable shoes, sunglasses and sunblock. Kids love walking around and the evening atmosphere is great."], ["Reviewed 1 week ago", 4.0, "Beautiful, large park with lots to see and do.", "We enjoyed the Spanish Village Arts center and some of the museums. Beautiful architecture and landscaping."], ["Reviewed 2 weeks ago", 5.0, "Cultural Wonderland", "Well worth more than one day to take in everything that this park has to offer. We greatly underestimated how much time we would want to spend here (and were only able to visit one of the museums), so we definitely need to return to San Diego soon.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Huge open space in the center of the city with plenty to do", "Free and plentiful parking. Plenty of interesting museums / cafes / places to picnic / walk. A great place to spend a day if you’re visiting. Choose the museums you want to visit and enjoy."], ["Reviewed 2 weeks ago", 4.0, "Diverse & unusually strange vegetation", "Beautiful park setting with many museums, a rose and Japanese garden, as well as old historic outdoor organ music which plays on Sundays! Diverse horticultural plants and botanical green house! A must see!"], ["Reviewed 2 weeks ago", 4.0, "Be sure to allow for plenty of time!", "Only had a part of the day to spend here and this is the type of place that you could spend several days at. Staff at the Visitors Center was awesome and i would highly recommend starting there. We then saw a botantical garden and the Timken Art Musuem. Wish we had more time to spend there but from what we saw, there were plenty of options for a family to enjoy and spend an entire day there. Definitely should be a consideration if you are visiting San Diego\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great fun day in the park!", "So much to go and see here. If you have never been here before, take a tour first and then decide what you want to see. Too much for one day. Highly recommended for families and lovers!! Have a great lunch at the Prado while you are there.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful day", "We spent 4-5 hours at Balboa walking around, checking out the International little homes, the Spanish Art Village, the small free art gallery, the artists selling beautiful and unique items and listening to the organ music on a Sunday afternoon. If I lived in SD, this would become one of my places to visit often.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Evening stroll at sunset", "Wandered around after a dance recital in the theatre, and before dinner in the park. This entire park is unbelievably beautiful. We only saw a small corner of it. It would take days to cover all the grounds, not to mention all the museums."], ["Reviewed 2 weeks ago", 5.0, "What a Fun Place to Explore", "I wouldn't pay for a tour of Balboa Park but instead review ahead of time the spots you might want to explore and then just wander around. We skipped some of the museums because they seemed expensive but still had a lot of fun exploring the free opportunities. We could have spent another day there too. Places we highly recommend include the old Botanical Building, Japanese Garden, Old Globe Theater, old fig trees and country houses.\n\nThere's a free shuttle bus you can take that goes around the park all day. It's very handy to get your bearings, and relax for a bit.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Lovely afternoon in San Diego!", "Like most places in San Diego, parking can be rather difficult to find. Once you find a spot, you'll LOVE this place. So much to do. Plan for lots of walking, but everywhere you go, you'll be in awe at how beautiful it is. Make sure to stop by the artist village and see all the wonderful creations. We loved this place!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Take a look around", "On our trip to San Diego we visited Balboa park. It was just a quick afternoon walk around. The sites were very cool. unfortunately the largest organ was not open for view to the public when we went. From what we saw though it looked like it would be amazing. If you are interested I would look up when they have it open. Nice walking area. If you are into museums there are also a ton in the area to choose from.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wow!!! Amazing place", "This park is amazing. You can purchase a pass that will allow you into five of the 17 museums in a day. In eight hours we managed to get through three.\nWell designed and well laid out, the park has something for everyone. You could easily spend two or three days here.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Spend a quality afternoon here in the park", "The buildings, park and surrounding area are a vibrant part of San Diego. We had a great time exploring the park and buildings along with all of the other sights. There's so much to see and do here it requires more than 1 trip so we ended up coming back again a few days later. Something for everyone here and a must experience area for all.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "One of the largest urban cultural parks in the US", "This is a huge park! You need to check the map and park near your museum, or attraction of your choice. There is a long list of things to see here so parking near each building is helpful there is also a free tram tour you can take to initially take it all in. Most things on this list are day trips on their own. My favorites are the botanical building with lily pond, the world renowned zoo, planetarium at the Fleet Science museum, the Japanese friendship garden where you can get close to priceless bonsai trees and koi fish. There are also always special events occurring at the various attractions, for Christmas they filed a hall with poinsettias another time there was a reptile expo with countless baby turtles. The international cottages are another favorite, they are houses representing world cultures and they take turns with monthly celebrations this month, February, the Chinese cottage had it’s yearly celebration in conjunction with the year of the dog celebration. Check their website, plan ahead, it’s too large to accomplish in one day! With downtown minutes away you’ll have great access to all the trendy eateries.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fabulous Park", "Thoroughly enjoy the wonderful buildings and sights at Balboa Park. We had a taster when we took the hop on/off trolley and knew we had to go back and take our time. Clean and beautiful!"], ["Reviewed 2 weeks ago", 5.0, "An extensive park with museums for everyone", "Extensive park with maicured gardens, cafes and a host of museaums to suit most peoples interests. The architecture is both impressive and quirky! Excellent free parking facilities with free shuttles to the park's ammenities. Well worth a visit but allow at least half a day, ideally more!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Visit the Japanese Friendship Garden", "There is so much to see and do in this park. It is beautiful even if all you do is walk through it.\nMany museums to see in the park but check the days they are open.\nWe went to see the Botanical Gardens but they are closed on Thursday. We did not check in advance.\n\nWe did pay the $10 entrance fee to the Japanese Garden and took the tour of the Upper Garden. The guides pointed out so much that we would have missed on our own.\nAfterward we strolled the lower Garden.\nIt too was beautiful.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "For museum lovers", "I couldn't believe there are 16 museums at this park! Besides that, just walking and enjoying the architecture and the flowers justifies a visit"], ["Reviewed 2 weeks ago", 5.0, "America’s Finest?", "San Diego should be proud of this gem. So much of the space is open and free - gardens, museums, art - paired with some wonderful museums and galleries of fine art, history, and more. The rose garden is among the finest. The architecture is stunning and the entire park is well-cared for and clean. Places to eat and lots to explore. With all Balboa Park has to offer it may America’s finest park - located within America’s Finest City!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Visit and be inspired.", "Balboa park is as place to enjoy the outdoors and fabulous museums.... plus a world famous zoo. A great choice for all ages. Plenty of free parking. Easy access for visitors using wheelchairs, scooters or walkers. An excellent place for picnics. The Prado restaurant is charming and beautiful. Discount ticket packages for the various museums can be purchased. The UN cottages are open on Sundays. Spend an hour or spend a day....a must when visiting San Diego.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Nice", "Great place to take a walk and see how beautiful is this place, you must visit the museums. It's crowded on weekends."], ["Reviewed 3 weeks ago", 5.0, "June, 2006. Bright sunshine, and perfect temperature.", "Balboa Park is a beautiful park of many different sections, and adventures. Museum, Art, outdoor amphitheater. San Diego is a beautiful city, with many places to eat, and just walk around. I loved walking on the water front. When I was there they had a \"tattoo\" art showing at Balboa. And if the beach is your thing, go to La Jolla. Beautiful, peaceful and amazing.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Pleasant, calm, quiet", "A nice break from the hustle and bustle of downtown. I've rated a few places within the park already, but I'll say the park overall as a whole is beautiful and quiet. A very relaxing atmosphere. The architecture is fantastic and most things inside are free (you had to pay for the museum of Man and the Japanese gardens for example)\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Balboa Park", "Balboa park is nice. We did the tour of the different houses/cultures which was interesting because we talked to a lot of the people. We didn’t have a chance to tour any of the museums. This place could get very expensive if you wanted to tour more than one museu . There is enough to do for a couple of hours if you want to do the free things.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Come and stay the day!", "This is really a must-see location with something for everyone. At this historic Expo site you will find an Arboretum, a Model Railroad, a Zoo, Japanese Garden, Art Center, museums just to mention a few of the outstanding attractions. We spent most of the day there and still didn't see half of the sites. Don't miss this San Diego gem!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Can't Miss on your trip to San Diego", "This is a great park - lots of gardens, museums, shops. No matter what your interests, you'll find something to like here. I went to the Japanese Friendship Garden, the Model Train Museum, the cactus and succulent garden, and the Artists market. Could have definitely spent more time and done more! The buildings are also beautiful. Stop by the Visitors' Information Center to find out what's going on. If you;re interested in visiting several of the museums, it would be worth purchasing the pass for entry into most, as most of the museums/buildings have admissions costs.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "If you love museums, Balboa Park is a MUST", "Balboa Park has wonderful educational museums for any age and interest. The photography opportunities are numerous and wonderful. Hiking or walking is available through some wonderful desert scenery. The Japanese Gardens are harmonious and peaceful. Parking can be difficult during the summer months - give yourself time to find parking.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Museums Gallore!", "Many museums for diferetn types of interes. from Natural Science, Modern Art, Classic Art, Sports, Aviation, Photographic arts, Anthropology, Trains, cool temporary exhibits and some outstanding permanent ones. Interesting \"Houses of the World\", small cottages with specific info about countries with typical food (check schedules), dances and stories.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A really nice afternoon.", "Went there to explore, had a lovely lunch, and enjoyed a number of the exhibits. A couple of the restaurants were closed when I went, but most were open."], ["Reviewed 3 weeks ago", 5.0, "Expansive park with \"something for everyone.\"", "Balboa Park near the center of San Diego covers about two square miles, with a Zoo, Art Museums, History and Natural History Museums, several restaurants, free organ concerts, theaters for live plays, about 40 \"watch the artist work\" artist studios, a unique \"Alcazar Garden\" based on the world-famous 15th Century Alcazar Garden in Seville, Spain; a Japanese Garden, and many more interesting venues. When we go there, we generally spend several hours. Places we visit again and again are the Art Museum, Japanese Garden, Alcazar Garden, the artists' studios, and one of the restaurants. For those not so inclined to walk from end to end, you can take the \"trolly\" from the Zoo near the north end to other attractions farther south. Well worth at least one visit.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice Afternoon", "We had a nice afternoon at this attraction. There were street performers one of which was blowing HUGE bubbles with was great for the kids and adults too. Cute show! We also stopped in the senior room which was very quaint with very nice people offering free coffee and just a relax! The couches that are available for rent were alot of fun and saved alot of foot pain. You can actually park them and get off and on as you wish! Oh and the old style Carousel although we caught their last ride of the evening and did not get to enjoy the gold ring game! Maybe start with that first and then enter the promenade area. Happy Travels!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Always love this place", "I've had a Love Affair with this Park Since I First Saw It! LOVE IT!\n\nWhat can be better than a great place to walk, see museums, dine at the Prada Restaurant, take your dogs for a walk, enjoy a hike, and enjoy nature.\n\nTuesday, they have museum discounts - and Free Museum showings with a San Diego driver's license. I highly recommend this.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful park", "Lots of museums with a minimal amount of stuff in them but I'm comparing them against the Smithsonians in DC. Air and space was the most interesting and the art museums. Most just didn't have that much to see. The park in gwneral is a gem for families. Its just beautiful outdoor space with food, museums, the zoo, fountains and gardens. I would say a must visit when in San Diego. It's also great for strolling andwalking. Organ concert on Sundays at 1pm.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Balboa park", "More for residents I’d say than tourists .. very nice.. enjoyed the museum of art, but if I didn’t have a week to see San Diego .. I don’t know that this would have been a priority.."], ["Reviewed 3 weeks ago", 5.0, "Don't Miss", "What a beautiful and peaceful atmosphere. Plenty of parking. Lots of garden areas - don't miss the Japanese Tea Garden. Several museums but if you don't want to spend +/- $20, for each museum, it's not necessary. The grounds & buildings are beautiful with lots of seating areas, music playing and enjoyment to be had.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A full days visit.", "We stopped here on our way out of town and were really disappointed that we only had a few hours to stay and look around.\nIt is free to walk around the park and gardens but I believe that you have to pay to visit the museums. We went to the botanical house and surrounding gardens, which were stunning. In England we just have poinsettia for Christmas, here they grow outside, presumably all year around!!! If you go here allow a whole day as there is plenty to do. We would definitely like to return.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great experiences - Lots to See", "We got the 7-day explorer pass and visited 3 separate times.\n\nSo much to see here that it’s worth getting the 7-day pass if you’re going to be in the area for a while.\n\nEnjoy some art, a car museum, a flight museum, a natural history museum, a Japanese Garden, a decent restaurant for lunch, free bus rides around the park, buskers, etc.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great place to walk around - lots to see", "Tons of little museums and places to walk around and enjoy. Got this as part of San Diego go card. It was great!"], ["Reviewed 3 weeks ago", 5.0, "Beautiful", "We were expecting a typical park with a lot of beautiful green areas. What blow us away was the amazing Spanish influence buildings that were there, The art area where local artist have places. Enjoy Have fun"], ["Reviewed 3 weeks ago", 5.0, "Green oasis", "This is a city that seems thin onparks so this huge one is the place to go. There are a dozen small museums. The art museum is pretty good as is the (free) Timken Museum, but the photography museum is disappointing if the temporary show is not great. The Japanese garden is a pretty, tranquil place. A park docent leads a good walking tour at 11\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Stunning and distinctive", "With sweeping vistas, Spanish colonial architecture and a rich array of museums, Balboa Park rewards sightseeing, just rambling about, or any combination of the two. And don't let me forget the abundance of free parking! It's easy to see why San Diegans never tire of this vast urban retreat. Tip: there's also a large and lovely fenced dog park.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A very interesting place to visit. There is a wonderful botanical building to explore with many different varieties of", "I will definitely return here sometime. There was so much we missed. Entertainment was awesome. Music, art, dancing too!!"], ["Reviewed 4 weeks ago", 5.0, "Beautiful place", "Very relaxing to just walk around and take it all in!! So much to do I could easily spend all day here. Great sights!"], ["Reviewed 4 weeks ago", 5.0, "So many things to see and do!", "On the day of our visit there was a festival with street vendors, arts and crafts and many food options. Also in this area are several museums and City facilities and the grounds are beautiful!"], ["Reviewed 4 weeks ago", 5.0, "Lots to do", "Museums, walking trails, street performers, restaurants, people watching - lots to do, especially on a warm, sunny day..."], ["Reviewed 4 weeks ago", 4.0, "Beautiful park", "A great park with beautiful Spanish architecture and plazas. Also check out the Globe Theater for live performances."], ["Reviewed 4 weeks ago", 3.0, "So So", "I was a little disappointed not that big of a verity of stores to shop in. I live in Santa Barbara so i’m Use to a beautiful ocean view. If it’s your first time to San Deigo you might find Balboa Park interesting."], ["Reviewed 4 weeks ago", 5.0, "A San Diego Must-See", "Museums, gardens, great food, reflecting pond, a majestic fountain, street performers and gorgeous 200 year old buildings from 1917. Free! The world class museums require an admission fee, but the park and gardens are completely free. If you're going to spend a half day at the zoo, you can spend the other half exploring Balboa Park- it's right next door. Great place for a picnic, too. Let the kids run wild on a grassy hill while you recover from the walking or the zoo.\n\nPS- Go to the Timken Art Museum- it's free!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "So much to do.", "This place is an absolute must do. So many museums and amazing buildings to visit. Allow plenty of time to take it all in.\nAll museums are within easy walking distance to each other, but there is a tram that provides transport around the park.\nWe had one day, but needed more.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fantastic", "This place is absolutely great, lots of free areas, lovely reasonably priced restaurant. A not to be missed location in San Diego.. Spanish Village, Botanical Gardens .. brilliant."], ["Reviewed 4 weeks ago", 4.0, "Beautiful park!", "This is a must see for first timers to San Diego! Beautiful park with museums, cafe and play area. We walked from out hotel in downtown San Diego - being new to the SD area we did not know it was an uphill walk the entire way! However, we were rewarded with gorgeous views of downtown SD when we arrived. Lots to do here.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun vacation", "Balboa Park was awesome. So many things to see and do. The pipe organ was amazing!! You need at least two days to go through the park!!"], ["Reviewed 4 weeks ago", 4.0, "Big, beautiful park!", "I spent a whole Sunday at Balboa park. The spanish architecture is beautilful. There is the museum of man and the museum of art if you want to check them out. There are trails you can explore around but also streets if you dont feel too adventurous. If you are there on a Sunday, like us, you will have the chance to attend an outdoor organ concert. This was great!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful!", "Balboa Park is most likely one of the most special parts of San Diego. Walking around the parka to look at the gardens and the architecture is stunning. Theatre, art, music, festivals, museums...it’s stunning!!! During the day or in the evening, it’s easy to get lost in its beauty!!! Make sure to see a show at The Old Globe!!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Balboa Park", "Beautiful park, great for walking my dog. I come here several times a week. The atmosphere is wonderful, nature, open spaces, bocce ball, dog park."], ["Reviewed 4 weeks ago", 5.0, "Wow - What A Surprise!", "We set out to visit the San Diego Zoo and wound up spending most of our time in this beautiful and interesting park."], ["Reviewed 5 weeks ago", 2.0, "Seven Bridges route needs tweaking", "The initial route was good but if for those who actually prefer hard copy maps, we could not find a accurate and suitable copy of a map of the route. The directions we were able to download were not bad but could they could use a better description of the bridges and their history. BUT when we got to University Ave, we were more that a bit concerned. There are lots of homeless and less than savory characters in the area. We had to cut the tour short and leave the area. Also, there are no public washrooms along the route outside of Balboa Park. Just a warning to anyone who over-hydrates - it will get very uncomfortable.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Lots to Do", "The Park is very large with many museums spread throughout. To start I wish there was a better means of navigating within the park. We did the pass online that allowed us to visit three of the museums within the park. The large gardens and fountains were picturesque to walk around in. Make sure to have water to walk around with.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "We love this magnificent park. Zoo, museums, everything.", "Balboa Park is the best park I've ever visited. The Zoo is tremendous, the museums are interesting and well worth visiting. The Old Globe Theatre is great, the Aerospace Museum is wonderful. The automotive museum, the Reuben E. Fleet Science Museum, the Museum of Man, the Natural History Museum, and much, much more. A must do for all visitors.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Great place for a stroll", "Balboa Park is where I do the Alzheimer's Walk each Oct. and I can't think of a better place. Beautiful view, lots of people coming together for a great cause, can't think of a better way to spend a Sat,"], ["Reviewed January 24, 2018", 5.0, "Balboa Park", "A must see in San Diego Feels like your in Europe Architecture is amazing. Landscaping is out of this world. Art District has something for everyone. Plan on spending the day and wear your walking shoes. Nice place for outdoor lunch!"], ["Reviewed January 24, 2018", 4.0, "We Need to Return", "We walked to the park from the Gaslamp district, so we did not have as much time as we would have liked to visit different museums. A lot of homeless people hang around the park so be careful."], ["Reviewed January 24, 2018", 5.0, "Early morning walk", "On a business trip and staying on seventh street a short half mile to the promenade which leads to the park. Great place to stroll and enjoy the weather and view the water. A number of homeless people in the park who are friendly. A must visit place.\nShow less"], ["Reviewed January 23, 2018", 5.0, "great place", "beautiful park . nice to spend the day or a couple of hours just walking around the old buildings and museums left from the 1915 exposition were beautiful . best of all its free to walk arround"], ["Reviewed January 23, 2018", 5.0, "Just Great!!", "This park is massive, it has nice places, parks, gardens and sculptures. You will really enjoy your visit!"], ["Reviewed January 23, 2018", 5.0, "Great place to walk around during the day or at night", "I was traveling with my teenage son and even he loved the Park! Great place to walk and sight see. We walked at night and felt safe. There were plenty of people around."], ["Reviewed January 23, 2018", 4.0, "Scenic but overpriced", "At visitors info area you can get information on the museums\nThere is a charge for just about all of them San Diego natives get discounts but I’m from out of town. There is a team that goes around some of the place it felt like a bumpy ride at an amusement park Museums are so so. The grounds are beautiful and loved a tree near the visitor area which had tremendous roots\nShow less"], ["Reviewed January 22, 2018", 4.0, "One day may not be enough!", "I've been coming to Balboa Park since I was a kid and it even now it continues to provide fun and new beauty with every trip. There's an awful lot to do and see depending on who you're with, what you want to spend and how long you plan to stay. Some of my favorites include the grassy parks and children's playground, the beautiful old carousel (my favorite), so many spectacular museums (some with various discounts), a butterfly garden (totally free), a Japanese friendship garden, the zoo, fish ponds and botanical garden, plenty of fountains if you're there on a hot day, and special seasonal events. Whether you're taking a whirlwind family tour of all the best museums, or just want to walk around and play PokemonGo, you'll have a wonderful time. Two cautions: first, some of the attractions are a bit expensive and can take a lot of time so plan well. Second, parking is generally hard to find on the popular days, so get there early on weekends or carpool to the events.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Cheap Date!", "The best attraction in Balboa Park is strolling. Splurge on The Prado for dinner! But it is a splurge!"], ["Reviewed January 22, 2018", 5.0, "Went during December Nights - fantastic time!", "So many people made for a very festive environment. Craft booths, concerts, food, art museums, and the buildings in the park itself were all such a special event!"], ["Reviewed January 22, 2018", 5.0, "Leisurely Visit", "We came to Balboa Park before but at that time it was late to visit any of the many museums within the park.\nWe visited the Japanese friendship garden then headed off to the Timken Museum of Art this time around. With time being limited we also wanted to head to Old Town San Diego\nShow less"], ["Reviewed January 22, 2018", 5.0, "2nd largest park in the USA", "Plan to spend some time walking around this beautiful park. There are little gardens, cultural centers and a dozen museums to visit at this gem. The Prado Restaurant has a outdoor area that's perfect to end your visit with a cold drink."], ["Reviewed January 22, 2018", 5.0, "Must visitbin san diego", "I visit Balboa every time I am in san Diego. It is fun to just walk Around and look at buildings and flowers. I also enjoy the shops at Spanish village and eating at the Prado restaurant"], ["Reviewed January 22, 2018", 4.0, "Beautiful Architecture but if you want to take a peek inside it cost $57 for adults + $30 for children", "The balboa pass cost $57 for a multi day day pass or $47 for a day pass. There are 16 museums in balboa’s garnished with beautiful flower gardens, tourist, and families. Balboa is a very nostalgic park nestled in the heart of San Diego. It is a great escape from the hustle and bustle of the city but it’s not free.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Nice park", "In 2000 Balboa Park was host to San Diego's millennium celebration with Expo 2000 (harkening back to the two Expositions held in the Park). In 2001 the San Diego Natural History Museum opened its doors after a major reconstruction to the original building—with The Spreckels Organ Pavilion from the Plaza de Panama at Balboa Parka 90,000 square foot addition more than doubling the facility's size. In 2003 Balboa Park was ranked as one of the Best Parks in the World by the Project for Public Spaces. The World Federation of Rose Societies (WFRS) voted the Inez Grant Parker Memorial Rose Garden as one of the top 12 rose gardens in the world-The Award of Garden Excellence recognizes exceptional rose gardens throughout the world. The most recent formal Balboa Park garden dedication took place as the new Veterans Memorial Garden was opened to the public. The Veterans Memorial Garden is situated on a one-acre parcel of land in the Park honoring all veterans.\nShow less"], ["Reviewed January 22, 2018", 5.0, "it is not one park but a zone of parks", "a great adventure and touring for all ages , kids enjoy it , adults enjoy it , with this number of mediums and ancient history it is worth the visit , you will get tired enjoying the walk and the different attractions in it"], ["Reviewed January 22, 2018", 5.0, "BALBOA PARK MAKES CENTRAL PARK IN NEW YORK LOOK SMALL", "You won't believe how great this park is until you see it! Flowers, Beautiful trees,miles of grass multiple museums (Art, Natural History, Aerospace San Diego History, Photography and more). Don't miss the Merry-Go-Round and Miniature railway for kids. The park also Includes the world famous San Diego Zoo. The buildings have been completely restored from the early 1900's World Exposition.\nAll located just minutes from Downtown and the International Airport.\nOnce each week the museums offer free entry. Call ahead to discover which day to visit.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Beautiful", "Just chilled here the other weekend with my buddy and we long boarded though the park. Can’t believe I waited so long to see this place. It’s gorgeous and has many old Spanish mission looking buildings. Many great views. Quite a few homeless on the outskirts of the park.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Time to get away", "My family and friends have been going to Balboa Park for years. It’s a huge park with tons of museums and a lot of fun activities. The Spanish village is ideal if you are into the arts and if you love the theater well the world famous old globe theater is tucked into a unique location next to a large bell tower. If you are into Spanish architecture, museums, open spaces, art, beautiful landscape, the theater, a huge Japanese friendship garden to walk through and explore and so much more... I whole heartedly recommend visiting Balboa Park.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Simply WONDERFUL!", "Best place for everybody, so much to do. It is a giant park with unlimited activities. Great for families with kids all ages."], ["Reviewed January 22, 2018", 5.0, "Stay classy San Diego :)", "Touring San Diego by night with friends from San Francisco. Lovely city, lots of free parking and a variety things to do with family or solo. The landscape is like no other, Central Park in New York does not compare to the acreage in Balboa Park :)\nShow less"], ["Reviewed January 22, 2018", 5.0, "A well preserved piece of the past, built for the 1915 California Exposition. A visual and educational delight.", "I have been visiting this park, since 1971 and it is always a joy. My kids who are adults now hold fond memories of Balboa Park. You can experience stepping back in time to 1915, but with modern conveniences, such as bathrooms, computer access, security and such. Set in a beautiful part of San Diego, adjacent to the World Famous San Diego, you would never know you are in the center city. Lush vegetation, flowers in abundance year round, beautiful well preserved buildings, restaurant and food vendors. No cars are allowed only pedestrian walk ways. All parking is free, except for valet, so wear comfortable shoes and attire. Shuttles run throughout the park area, but the majority of venues are easily reached by walking. Wheelchair, or strollers have good access around the park, very flat terrain. A few inclines exist in some of the parking lots. Plenty to see in the park, such as science interactive center, air and space museum, art center omni max theatre, natural history museum, botanical garden, train museum and a wonderful plaza with a fountain. Perfect spot for people watching.\nShow less"], ["Reviewed January 22, 2018", 4.0, "An exquisite place to spend some time.", "The park was different from any other park I have visited. It was very artsy and full of botany. There were many artists painting the seen there. The flowers and plants were amazing."], ["Reviewed January 21, 2018", 5.0, "Beautiful architecture and history", "Spend the day in a variety of museums, many of which are free, enjoy delicious food at the Prada Cafe and ramble amongst fountains, musicians and entertainers. A must for Those visiting San Diego."], ["Reviewed January 21, 2018", 5.0, "Fun and Educational", "Street performers were entertaining. Can go for free if you just want to be outside in a beautiful setting. Or somedays the exhibits are free. Free parking and free tram. Something to appeal to everyone. Daily passes avaiable."], ["Reviewed January 21, 2018", 5.0, "Taking a walk in Balboa Park", "The park is beautiful with Spanish Architecture and easily walkable to any of the many museums. There are colorful flower beds throughout, green lawns and a pond with benches nearby. For me one of the best things is the Old Globe Theater where I have season tickets. Clearly this park is the Jewel of San Diego!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Balboa park San Diego", "Great place to visit whether you are a tourist or a local Outdoor and indoor adventures abound! Museums, parks ,water features ,people watching musicians, and gardens all are in one place!"], ["Reviewed January 21, 2018", 5.0, "Wonderful treat in San Diego: Balboa Park", "Balboa Park has art museums, open spaces, gardens, The Japanese Garden, Aerospace Museum, International Houses, concerts and plays, and restaurants. The San Diego Zoo is nearby. Plenty of experiences. In December it has December Nights. All of the International Houses open up and they serve food from their native countries. They have entertainment from around the world.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Balboa Park", "Balboa Park is my favorite spot in all of San Diego. I have visited the park as a child, teen, with my child as a young adult and now I enjoy it in my 60s. There truly has been enjoyment at every phase of my life. When I have visitors from out of town it is high on my list of places to visit.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Balboa Park perfect for EVERYONE", "Couples, children, families, business partners, Balboa Park is the gem of San Diego. Be sure to visit the Museum of Art, the Timken and the Mingei! Have lunch or happy hour at Panama 66 next to the Museum of Art. The Prado restaurant is also excellent. There are so many great museums in the park as well as beautiful gardens especially the Japanese Friendship Garden.\nOf course the San Diego Zoo in the Park is one of the very best in the USA.\nVisit! Take a day or two!\nShow less"], ["Reviewed January 21, 2018", 4.0, "Here every day", "I live less than a mile from here. Am here every day I am home. It’s a very good park. Every major city has one. Is it Central Park in NYC? No. It does not have the flow or the world class museums. But it has arguably the best Zoo in America. Is it Golden Gate Park in San Francisco? No it’s not that remote. It’s a middle zone between the two. It’s not as connected as NYC or a secluded as SF. But it works for me and many many others.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Phenomenal Park", "San Diego should be proud of this amazing asset. Wonderful museums, great architecture and landscape, good food. We spent 3 days there hitting almost every attraction and taking a bunch of photos. Don't miss the organ concert on Sunday and with small kids, the puppet show was a hoot. Great place to spend any amount of time.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Must see in San Diego", "When in San Diego this is a must see. So much to do. The art gallery has so many wonderful pictures from the greats that brought tears of joy to my eyes.\nThere is a great area with local artists selling their creations. Everything from jewelry to pottery.\nLots of places to eat.\nWhen I visited at Christmas time they had a display of Victorian Christmas ornaments. Fabulous!\nThis park has so much!\nShow less"], ["Reviewed January 21, 2018", 5.0, "A San Diego must see", "There is so much here. I won’t even get into the museums. The palm canyon was wonderful as was the desert garden. I wish we’d had more time on the artists’ village. Go early as parking fills up and leave a lot of time."], ["Reviewed January 21, 2018", 5.0, "On A Scale of 1-10, Balboa Park is a 25!!!!", "This is one of the most unique attractions my husband and I ever visited! We think one would need a WEEK to actually visit every museum and gallery within the park; there are SIXTEEN!\nMost charge for admission; some are free on Tuesdays, and one (The Timkin) is always free! First stop should be The Visitors Center (and Gift Shop) - extremely knowledgeable and helpful staff. If you travel to the Park by cab, they will even call a cab for your return trip!\nIf museums and galleries are not your \"thing\", you will be bowled over by the arcticture of the buildings, the formal gardens, the Japanese Friendship Garden, and the world's largest outdoor organ (free concerts on Sundays only)! In addition, there are both indoor and outdoor theaters offering Shakespeare plays and new plays, 13 of which have already gone on to Broadway in NYC! Admission to the park is free; there are trams available to take to and from the parking lots - be sure to stop by for lunch at The Prado Restaurant; you won't be disappointed! Be sure to wear sneakers or sturdy walking shoes - and bring a camera!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Must See", "Even if you spend all day in the park you will not see everything, so much to see and do.It has everything for everyone in you family just start walking and you will see something that interest's you. Balboa Park is a must."], ["Reviewed January 21, 2018", 5.0, "Unexpected Gem!", "We had heard from friends that Balboa Park was great but had no idea what to expect. We honestly thought, how fun could a park with some museums be. Well what a pleasant surprise. We absolutely loved it! From the amazing architecture to the street performers to the multicultural areas, it was just awesome. We went on a Saturday in the middle of January and it was pretty busy. I couldn’t imagine what it would be like in Summer.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Interesting museums", "We saw about 5 museums today and liked them all. All the exhibits are small so it gives you the chance to see more than one in a day. We have a pass that we purchased for a 7 day period so will go another day.\n\nMy fav so far was the Photographic Arts- which featured some really great photography done by students from local schools on their perception of “Boundaries”. I was impressed by the way they are thinking and how they presented their ideas!\nShow less"], ["Reviewed January 20, 2018", 5.0, "Historic place", "Balboa park has been a great park to visit just to relax and get some family time together. Balboa has great museums and lots of San Diego history. You can easily spend a full day filled with activities if that’s what you want or like my family just relax and enjoy the surroundings\nShow less"], ["Reviewed January 20, 2018", 5.0, "Nice afternoon", "Went there for a afternoon, we clearly had a great moment there. It’s very nice to chill but not much restaurants and also no ice cream shop which can easily make this place greater and work there."], ["Reviewed January 20, 2018", 5.0, "19 museums in one 100 acre park.", "How come I'd never heard of this park before? I knew of the famous zoo, but not this amazing park. With its 19 museums. We may of stayed an extra day in SD if we knew. Its beauty I that virtually no cars drive through the park its mostly magnificent buildings built for the work fair in 1915. The buildings were actually used as the home for Rosen wells portrayed of Hearst in CITIZEN KANE. Spend two days here\nWe went to the railway and the aeronautical museum. We wish we had more energy and time. There are also good places to eat in the park, as in peeper restaurants not just snack bars.\nShow less"], ["Reviewed January 19, 2018", 5.0, "A classic", "Balboa park is a rare gem with great history and a myriad of museums and experiences. Wonderful for families and anyone with a thirst for knowledge. Timken gallery with old masters is free! All of it a must for San Diego."], ["Reviewed January 19, 2018", 5.0, "Afternoon visit", "Great place. Clean beautiful. We walked by the museum's and lots of open spaces and fountains. The park has lots of walking trails"], ["Reviewed January 19, 2018", 5.0, "Beautiful Park", "While in San Diego, you must visit this park. It is an amazing attraction, and has lots of interesting things. The family really loved visiting this location, and wants to come back in the future.\n\nEven during this time of year, the park is in excellent shape.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Spanish Village Art Center is a Must See", "After the zoo we ended up at the Spanish Village Art Center. It is AMAZING! The prices are very fair. All are local artists. It's definitely a Must See at Balboa Park!"], ["Reviewed January 18, 2018", 5.0, "Fabulous asset for a great city!", "Spent just a couple of hours here but was very impressed with all the cultural attractions. Will definitely return on s future visit."], ["Reviewed January 18, 2018", 5.0, "Our Queen Jewel", "My family & I are always visitors in our beautiful city what ever chance we can. Balboa is a favorite spot for the Arts, a picnic, to take a hike or bring visitors to. It is our Queen Jewel of SoCal. Next door the the San Diego Zoo, this is an awesome destination spot:)\nShow less"], ["Reviewed January 18, 2018", 5.0, "Amazing Place to Visit - Way More Than It Appears At First", "I visited here while in San Diego on business a couple of weeks ago. When you first park it doesn't really seem like anything special...but as you start to walk around you see SO much amazing buildings and history!\n\nFrom the gardens to the amphitheater to the architecture and the international village, this really is a gem of a place in the heart of San Diego!\n\nWe never even went into any of the paid museums, and there was still way more to see than we had time for. Highly recommended, especially for people who love to take pictures!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Amazing Park with so much to do and see!", "There are many museums within the park. They is also an area called Spanish village with houses many artist studios. The fountains are beautiful and the walking bridge across the 163 is cool. My favorite museum is the San Diego Aerospace museum. There is a rose garden and a cactus garden across the bridge over Park Blvd. A couple of places to grab a bite to eat as well.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Architectually varied structures mixed with beautiful gardens and fountains!", "We read that Balboa Park was a top place to visit during our planning phase of our trip but didn't really understand what it was until we actually visited. When we visited the zoo and saw signs for Balboa park next door we assumed we had already seen the park by driving to the zoo, that was not the case. We visited Balboa park on another day and realized it was a collections of many different museums, fountains, squares and gardens. All of the museums do charge admissions and we were not in the mood that day to go inside a museum but just walking around the area is a must see.\nShow less"], ["Reviewed January 16, 2018", 3.0, "Lots to see", "Museums and the zoo dominate the park, its not the most scenic and there are jets buzzing overhead as they land at SDA."], ["Reviewed January 15, 2018", 5.0, "Fill your senses", "Balboa Park is a jewel in the midst of a great city. Fill your senses with classical music or hip-hop by street performers. From botanical gardens to panarametic views of the city this park fills your day with unique shopping, dining and attractions. This is a large family venue with many pleasing activities for all people to enjoy. I would advise you arrive early and plan to spend most of the day.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Oasis in the city", "Balboa Park is gigantic and has a huge variety of museum and gardens. Every building is beautiful just to walk around and look at. Parts of the park are hilly and you will do a lot of walking but it's worth it."], ["Reviewed January 14, 2018", 5.0, "Need a few days to see everything!", "Plan on checking out the Organ and it's new conductor on Sundays at 2 PM. Our visit was mostly at the Zoo and a quick trolley tour through the park. We walked through the Village, there were many street performers and lots of child-approved entertainment."], ["Reviewed January 14, 2018", 5.0, "December Nights!!", "Fortunate enough to be in town for business during the Balboa December Nights celebration.\nAbsolutely amazing. Great for couples, families, singles, etc.\nThe food selections at the International Village were awesome. Well over 25 different native foods to try from many different countries.\nIt does get very busy at night so I would recommend what we did, get there mid-afternoon, check out the vendors and then just enjoy the lights when it gets dark.\nWe walked there from the Gas Lamp district. Wasn’t really that far and avoided all the traffic.\nShow less"], ["Reviewed January 13, 2018", 2.0, "Ok. Too many aggressive homeless", "Hiked around near the 163.\nIt was pretty. Good to get some outside time while close to the city.\n\nToo many homeless guys and gals asking for money. Public bathrooms were in shambles dirty and nasty! It was terrifying!\n\nDo not go here with your family if you are hiking around.\n\nIf you want to go to a specific place it may be better but my experience was negative.\nTrash everywhere.\nShow less"], ["Reviewed January 13, 2018", 5.0, "So much to see!", "I bought the multi-day pass so I could go to any museums I wanted plus the zoo. I highly recommend doing this. There is so much to see in Balboa Park. I didn’t even get to do half of it but it was well worth the time and money.\nShow less"], ["Reviewed January 13, 2018", 5.0, "So big, so beautiful, so much!!!", "You can come here any time and enjoy - stay for a few minutes and have a coffee or lunch, or stay all day and see more of it. The place is so big you won't see it all in one day, but what you do experience is beauty\nShow less"], ["Reviewed January 13, 2018", 5.0, "Wonderful architecture", "We enjoyed strolling through the grounds which were beautiful and well maintained. Loved the open plazas and the unhurried nature of the park. The museums were fee based but we didn't visit any because we wanted to enjoy the outdoors. (It was minus 26 degrees in ND and 65 in San Diego -- that's a no brainer).\nShow less"], ["Reviewed January 12, 2018", 5.0, "Great California old buildings and landscape", "This is an amazing place. Just the grounds are wonderful to walk through and admire the architecture and landscape. Just plain fun! In addition there are many museums to visit - though at $$."], ["Reviewed January 12, 2018", 4.0, "Beautiful park and buildings, but pay attention for cars", "My daughter and I spent the better part of a day at Balboa Park. It is a beautiful area with many activities to choose from. It can get pricey with admission fees to the varying museums, etc, so check prices before you go! Also check the hours, as the botanical building is closed on Thursdays.\n\nWe enjoyed the musicians playing in the park, as it certainly added to the ambiance. We could have done without the nitwits blaring junk music on their stereos, though!\n\nWe did find it odd that in some areas, cars were allowed. For example between the Museum of Man and their special exhibit building. There is no clear marking that this area is a “street”. The cobblestones are the same color across the entire way. Guests may be preoccupied with looking around the courtyard and at the tower....and not actively looking for cars while crossing. There are two pedestrian crosswalks near this museum...but they are far off to the sides between the museum and the special exhibit (far away from where people naturally cross from one side to the other), which made zero sense! In another area of the park, we saw a car come to a screeching halt and nearly hit a pedestrian walking with a cane. The man was clearly in a crosswalk but the car driver obviously wasn’t paying attention. Luckily the pedestrian was ok. So BE CAREFUL when walking around this park...you can’t assume that cars are prohibited throughout the entire campus.\nShow less"], ["Reviewed January 11, 2018", 5.0, "One of Caifornia’s Best", "Balboa Park in San Diego should be a must visit when in San Diego. With many different museum’s and things to explore. Lots of grassy area to have a picnic. Ample parking."], ["Reviewed January 11, 2018", 5.0, "Winter visit", "I've always heard about beautiful Balboa Park. Wasn't sure what to expect in winter but it did not disappoint. Spent the day in the museums and walking around the Japanese gardens. Ended the day with an open-air jazz concert at an outdoor restaurant. Looking forward to coming back in the spring to see the flowers.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Great place", "Beautiful place to walk around. This is where all the museums are so you can easily see a few in a day. Would recommend coming here!"], ["Reviewed January 11, 2018", 5.0, "Walked the Park", "Always a beautiful day in Balboa Park. So much to do. Trail walking, bocce ball, disc golfing as well as good ol people watching."], ["Reviewed January 11, 2018", 5.0, "visited twice", "Interesting park in a big city with a healthy collection of museums and points of interest. Good people watching, good art, easily reached by public transportation ."], ["Reviewed January 10, 2018", 4.0, "Take your camera!", "Beautiful, well designed, with tons of culture & also places to walk for eons. Just got back from my 1st ever trip to San Diego & am already begging my husband to plan a trip there together. Overall, my new (a tie with Monterey) favorite city in California.\nSo clean, so well-manicured. From the airport (beautiful, with interesting art & Sci-fi book displays) to the Coronado bridge(a bit scary), I loved it. Oh, right this review is about Balboa. Well, parking is difficult & tricky -- it helps if you're with someone who knows the Main part of Balboa she wants to see, & how to park close (the term is relative here) to it. In our case, of course, The Globe.\nWhile flying in, I looked out the window, saw what I thought was the dome of a church, & asked my young seat mate (a very friendly & polite native) what it was. To which he replied,\" that's Balboa park & you have to go. Its got everything.\" Imagine my joy when my BFF, whom I was visiting with 7 other of her BFFs, took us there the next day!!! And the 'church' dome actually IS \"the Globe\"\nAnd the light is so special, all my pix came great. I took them there w/Iphone 7. (Hey, I SAID 'take your camera' and Iphone IS the camera for most of us!)\nShow less"], ["Reviewed January 10, 2018", 4.0, "Night stroll", "This is very busy during the day. We came back at night too look around and avoid crowds. It's a remarkable place. At night the buildings were lit up and so was the fountain."], ["Reviewed January 10, 2018", 4.0, "Great way to spend the day!", "Walking around, visiting Museums and seeing all the different things going on is a perfect way to spend a day with family and friends. I think there are even free visiting days for some of the museums. ( Tuesdays I believe)"], ["Reviewed January 10, 2018", 5.0, "So much to do for young and old", "The founding fathers of this city were quick to recognize the need to preserve this beautiful part of the city and fill it with museums and exhibits which would educate and excite for generations. Starting with the exterior which includes beautiful gardens and grounds as well as early examples of Spanish influenced exterior, the Park provides an all day experience. Or the visitor can select one of the many museums and exhibits to immerse themselves in for the whole day. There are also many special events. And lots of outdoor open space, picnic grounds, and peaceful spaces for reflection. It is free to enter, but many museums have individual entry fees.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Something for everyone!", "My wife and I first went through the park on the Old Town Trolley and heard about the history of the park from the driver. We were impressed and came back the next day on our own.\nWe enjoyed the gardens and fabulous architecture but for us there is one thing that will stay with us forever!\nWe were told there would be a free concert at the Spreckles pipe organ and that this was the new city organist’s first concert.\nUNBELIEVABLE music that brought the huge crowd to their feet cheering. You didn’t just hear the music, you felt it!\nA highlight for our stay in San Diego. And the beauty of it is he will play every Sunday and it’s free!!!\nShow less"], ["Reviewed January 9, 2018", 5.0, "Must-see", "This is really the cultural heart of San Diego - offering history, art, botanical beauty, and striking architecture. I don’t think any visit to San Diego would be complete without it."], ["Reviewed January 9, 2018", 5.0, "Truely one of America's greatest city parks", "So much to see and do at this wonderful city park that rivials NYC's Central Park. There's omething there for most anyone. Truely a must-see in Sna Diego!"], ["Reviewed January 9, 2018", 4.0, "Not really a museum person, but I had a good time.", "Enjoyed the Automotive Museum a lot, but the weather kept us from doing a lot of walking around to see much else. the fountains are beautiful and the palm trees were fun to see for someone who's from Tennessee and doesn't see them back home."], ["Reviewed January 9, 2018", 5.0, "Gorgeous - Go spend the day", "A stunning park. Really opens up once you get inside and so much to do from museums to cable cars, cafes to a zoo. We sadly left this until the last day and raj out of time. Give yourself the full day to explore. You won’t be disappointed.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Wonderful place to visit", "We went here on New Years day 2018, just a gorgeous day in San Diego to walk around.\n\nThis park is absolutely wonderful. Get there early for parking (free). There is so much to do and see. A lot was closed on the holiday so we just walked and looked at the different architecture. We did not do the zoo but I would like to at some point.\n\nThe setting is so peaceful and restful, even if you walk a lot (which you will do). Deep canyons, tall trees, hiking trails, artists, painters, souvenir and artsy stores, and outdoor entertainers. It's more than enough to fill a whole day. Appropriate for families and kids of all ages.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Beautiful park!", "Visited Balboa Park after wondering around San Diego all morning and what a welcome relief! It was the Christmas period so super busy, but it was awesome seeing so many locals and tourists enjoying this huge outdoor space! We loved all the different gardens and even spotted a wild great horned owl roosting high up in a tree...our best bird spot of the whole trip!! Loads of outdoor food options and just lovely maintained gardens! Didn’t make it into the science museum, but that looked great!\nShow less"], ["Reviewed January 8, 2018", 5.0, "Simply a JEWEL of a park!", "No trip is complete without a trip to this park. I have been to many different parks over the years. This urban park remains my favorite.\n\nThere is so much to see/do in this park. The park is intensely popular. If you plan to go, I suggest starting early (if visiting during the Summer). The park has a bit of something for everyone!\n\nYou can walk, run, bike, scoot...or just drive your car through the park. It is a huge park with several museums and the BEST ZOO in the entire region of the country.\n\nMy January trip was just a walking tour of the park. This was my first visit in the off season. So much beauty here. If you have a chance to visit San Diego, do visit this park!\n\nShow less"], ["Reviewed January 7, 2018", 4.0, "What Can I Say But This Ss A Must-See In San Diego", "Balboa Park is home to 15 major museums, several performing arts venues, lovely gardens and many other cultural and recreational activities. Balboa Park is the nation's largest urban cultural park so enjoy exploring it!"], ["Reviewed January 7, 2018", 5.0, "A great spot to visit", "When visiting San Diego you have to go to Balboa Park, the “Rose garden” is just so beautiful , colourful, enchanting. If you love flowers and particularly roses this is place to see. That is only the beginning of the Park, then, you cross the bridge and come across a nice fountain before heading for the rest of the Park. Historic buildings brought by the Spaniards many years ago remind us of the people who left their cultural mark for us to enjoy. You can spend many hours here just enjoying the area. This was a great stop.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Lovely day at the park", "So much to see and do, but we just enjoyed a stroll through the park with mom. Recommend 20 min video on history of park at the photography museum, really good overview of all the hidden gems and museums at the park. Street performers and tons of photo opportunities! Great spot for a picnic too.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Beautiful area", "There is something for everyone who visits Balboa Park. Museums, restaurants, outdoor markets, and it is next to the zoo. If you want to glimpse San Diego of a century ago, take a walk through this area. You won't be disappointed."], ["Reviewed January 6, 2018", 5.0, "Wonderful hidden gem", "Wish I could have stayed longer, beautiful place with so many things to see. Beautiful plantings and wonderful walk ways"], ["Reviewed January 6, 2018", 5.0, "Very nice place to spend the day", "Big and nice park to visit, you can use the tour bus that will go throw the park or you can just and go and explore by yourself . A lot of museums and gardens as far as I know many of the museums will be free entrance on Tuesdays morning, they have a nice restaurant called “The Prado at Balboa Park” but my favorite spot to drink and eat is “Panama 66” it’s an open space area you can also grab your drink and go to the lil garden next to it, not mention Banker Hills, little Italy and Hillcrest are couple minutes away from the park that is full of restaurants and are nice neighborhoods to visit.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Fun!", "Great place to take your kids while visiting San Diego !!!! Kids can run around fly kites and have a blast!!!"], ["Reviewed January 5, 2018", 3.0, "Interesting at Night", "Visited at night around the Holidays so the lights, musicians and food truck festival made this quite amusing for my 1.5 year old, unfortunately hard to summarize how it might engage my child during the day. My guess is that it is actually best to visit during the day.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Great city park", "A place to spend a day or two if you’re visiting the Zoo.lots of space to walk great museum to visit and a bijou artists colony With some extremely attractive jewellery at a price to make it suitable for presents."], ["Reviewed January 4, 2018", 5.0, "Quite stunning", "We spent some time in the park after a very full morning at the zoo. A ton of different museums available. We chose to wander and it was still a very nice afternoon. Lots of beautiful gardens and green spaces. Would be great for some down time after the zoo, especially with children. The buildings are mostly from the early 1900's and have all been beautifully preserved and restored. A dream park for a photographer. Wear good walking shoes. Be sure to check out the Spanish Art Village. It's a large collective of artists and their wares.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Great place to spend the day!", "Not as big as Golden Gate Park, but similar. The Zoo and all the major museums are here in one place. If you like history and art, this is an excellent place to spend the day. Get the GoCard and you can do it cheaply."], ["Reviewed January 4, 2018", 4.0, "something for everyone", "We travelled to many different beaches and park - each with something unique. You can have a great time exploring."], ["Reviewed January 4, 2018", 5.0, "Food Truck Bonanza", "We chose another Beautiful San Diego day to visit Balboa Park...obviously on a FOOD TRUCK Mission and to visit the botanical gardens. We were pleasantly surprised by the amount of options to choose from, approximately 20+ trucks. The Lobster Cousins did not DISAPPOINT!! #YUMMMY #bestlobsterrollever"], ["Reviewed January 4, 2018", 5.0, "What an oasis from the outside world", "This park is absolutely amazing. To think that we missed it the last time we came to San Diego! It’s right next to the San Diego Zoo. There are about 15 museums throughout the park - all showing interesting exhibitions. There’s several cafes and restaurants so you won’t go hungry or thirsty. There’s even free wifi. The buildings are all so immaculately restored and looked after. This is the perfect spot to just stop and relax and take time out of your day. Bring a picnic blanket and get a book and just relax and breathe it all in.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Go, You Will Enjoy", "16 museums, 11 gardens, outdoor concerts, street performers and several majestic buildings offered me a wonderful educational experience and provided me with entertainment. It was also a beautiful venue for simply taking a walk. I believe that no matter what your interest you will be pleased to visit Balboa Park. Some of the museums are free, but not all. There is a discounted pass that can be purchased at the Park's Visitor Center. You could even include the San Diego Zoo on the Explorer Pass.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Beautiful", "Beautiful cactus and Rose garden loved the art area . Beautiful old buildings with great architecture. Nice place to spend a afternoon only down fall is took awhile to park"], ["Reviewed January 3, 2018", 5.0, "Free Rose and Cactus Gardens", "FUN place , family friendly , awesome day ! just GO ! Loved it, want to go agin, loved it so much ! Tell family and friends, parking can be hard , be patience ."], ["Reviewed January 3, 2018", 5.0, "Great Day OUt", "Museums, events, people watching, open space, restaurants, shops, artisan stalls - something for evrybody"], ["Reviewed January 3, 2018", 5.0, "Fun for all of the family", "Make sure to check out the train museum, really cool for the family. Over 12 places to visit, with food and awesome architecture."], ["Reviewed January 3, 2018", 2.0, "A bit of a disappointment", "Started in the aircraft museum and found so much crammed in some exhibits could not be seen. And as for photos almost impossible. This museum needs a theme and should stick to it. As for the rest of the park it’s poorly signposted and seems past it’s sell by date. First thing it was it was almost impossible to get a coffee with the museum cafe not opening to 11am. Someone needs to drag this place into this century\nShow less"], ["Reviewed January 3, 2018", 5.0, "Fantastic park with many things to do, see", "Balboa Park is a unique place for residents and tourists alike with a broad range of museums, the Zoo, gardens and playgrounds. Definitely a great place for kids."], ["Reviewed January 3, 2018", 5.0, "Great place for a stroll", "We went to Balboa Park for a walk but there is much more to do, from museums to music performance. Great place to spend a morning/afternoon while enjoying the nice weather."]]}}