{"Balboa Island Ferry": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Balboa Island Ferry", "url": "/Attraction_Review-g32780-d2081137-Reviews-Balboa_Island_Ferry-Newport_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/66/ae/40/filename-ferry2-jpg-thumbnail0.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1566"}, "address": {"@type": "PostalAddress", "streetAddress": "410 S Bay Front", "addressLocality": "", "addressRegion": "California", "postalCode": "92662-1042", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "The LITTLE 3 car ferry lives!", "If you find yourself on either Bslboa Island or the Balboa Peninsula, you HAVE to take the ferry across. It seems like you never have to wait, as there are 2 or 3 running all day. Inexpensive little thrill, walk on, bicycle, or drive your car.\nShow less"], ["Reviewed 2 days ago", 5.0, "Nostalgic ride you gotta try", "A few bucks to have your car taken over to the pennesula, a ride back in time when we used to rent a house on the island for the summer..."], ["Reviewed 5 days ago", 5.0, "$1 for pedestrian to cross Bay", "Walked from hotel to Balboa Island for shops/restaurant then took the ferry across ($1 for pedestrians) to Balboa Peninsula where we continued walking (0.5 mile) to The Wedge to soak in the beach sun and relax on the beach."], ["Reviewed 6 days ago", 5.0, "Long Time Favorite", "My family has been riding this ferry a long time. Since the 50's for me. Always fun and cool. Once when my dad was working on Balboa Island my brother and myself went with him to work and took the ferry over to fish off the pier. Back then in the 60's it was 10 cents for me and a nickle for my brother.\nShow less"], ["Reviewed 1 week ago", 5.0, "Quick and Easy", "We took the Island Ferry with our Car from Balboa Island to the Balboa Peninsula. It's a quick trip, only a few minutes! But kinda fun. The Ferry only takes 3 cars at a time. We were lucky and were able to drive on with only a couple of minutes wait. One pays on the Ferry, so no need to get tickets ahead of time. There are clean public restrooms right by the loading dock, very convenient.\nShow less"], ["Reviewed 1 week ago", 5.0, "Quick but fun crossing", "Love that you can bike, float, or take your car across in quicktime! A perfect way to get inexpensively from shore to shore!"], ["Reviewed 1 week ago", 5.0, "A piece of Americana ...", "Apple pie, the girl you left behind, and the Balboa Island Ferry. All are good. All are fond memories. And all are wonderful ... all in their own right.\n\nHow can anybody rate it at less than wonderful? It's not the ride as much as the experience. Enjoy one of the simplest of real life treasures reflecting a bit of a time long lost.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun way to cross Newport Bay", "After renting beach cruiser bicycles at Newport Cruisers near the beginning of the Newport Peninsula, we took the boardwalk along the beach to the fun zone and the ferry to Balboa Island. The ferry is a fun, inexpensive way to cross the water ($1.25 per bike). Though the ride is short, it affords the opportunity to see boats of all sizes on the bay.\nWe had to walk our bikes (no riding) on the narrower boardwalk on Balboa but the scenic views are worth the walk. It’s not hard to find a small street to bike back to the ferry. Another exhilarating bike ride back to Newport Cruisers on comfortable bikes with baskets (and at $5 an hour) didn’t take long on the Newport Peninsula boardwalk.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Attraction!", "You can't beat driving right onto the ferry and taking it over to Balboa Island. The price is cheap and it is something fun to say that you have done. Yes, you can drive right over the bridge, but what fun is that when there is an auto ferry you can take.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Who Says you Can't Have Fun for $1.00?!", "On my trip to Orange County in April, 2017, I visited Balboa Island and was completely taken in by how charming it was! We took the ferry ride to the other side of the island just so we could stroll around and drool looking at the beautiful homes which line the water way...The trip across only takes about five minutes and only cost $1.00 each!! Who says you can't have fun for a small amount of money?! :0)\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun way to the island without driving around on the bridge", "$2-$3 dollars for each person but fun way to get to island like it was a long time ago. You can take car, bikes or just walk onto the ferry."], ["Reviewed 3 weeks ago", 5.0, "If you're in the area ....", "If you're in the area this is one of those fun things to do and whichever direction you're going in there are good restaurants on the other side!"], ["Reviewed 3 weeks ago", 5.0, "Convenient, Fast, Local Color", "This small ferry carries cars (up to three at a time), bikes, and pedestrians; runs continuously; and provides a great views. Parking tip: if on Balboa Island, go north on Park to Agate, park on one of the side streets, and walk to the ferry."], ["Reviewed 3 weeks ago", 5.0, "Convenient! Friendly staff!", "Rented bikes on 20th St. and road to Balboa Pier, got on the ferry, and road down to Marine St. Lovely day!"], ["Reviewed 3 weeks ago", 5.0, "Wow, that was fast!", "Super quick service. No waiting- when you pull on, they pull out. $3.00 for our Jeep, 2 passengers and our dog. A great quick way to cross over to the ocean side of Balboa Island."], ["Reviewed 4 weeks ago", 5.0, "A great way to travel", "I've taken this ferry since I was a kid. Love taking the car on the short cut or just riding it from Newport to Balboa. Just love seeing the boats and the price is so reasonable. A must for tourists and local alike"], ["Reviewed 4 weeks ago", 5.0, "One Dollar Boat Ride", "It only costs a dollar per person to walk on the ferry and get a quick boat ride. The ferry is small, holds three cars and about forty people and the trip last about five minutes. The crew of two is very laid back and friendly and really appreciate it if you have the correct change.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Always there and reliable", "We went over to Balboa Island to just see what there was to do. Easy decision for $1...the staff was nice, efficient and didn't crash the ferry into anything...so I think that's success."], ["Reviewed 4 weeks ago", 5.0, "Quickest Way to The Island!", "Our family love Balboa Island and if you have younger children, they will love the Balboa Island Ferry! You can walk on it, take your bike, or take your car for a small fee. During the summer months, it does get backed up with traffic. Wait til after the morning rush or get up really early. It takes about 10 minutes to cross. Once you get over on the Island try a frozen banana or stroll on the beach! You can rent an electric boat to tour the bay area.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Handy mode of transportation", "The ferry transports in a very efficient manor. They transport vehicles as well as passengers. There was a very minimal weight time in line."], ["Reviewed 5 weeks ago", 5.0, "Fun ferry", "we live on balboa island and love to take the ferry over to the peninsula. since we live here we don't take our can just walk on with out dog."], ["Reviewed January 22, 2018", 5.0, "A bargin at a $1.00 a ride !", "I remember when it was a quarter to cross the bay on the ferry. But at $1.00 a ride it is still a bargain."], ["Reviewed January 22, 2018", 5.0, "Fun Water Ride", "With its three-car limit, it wouldn't pay to wait in a long line -- otherwise, at $ 5 for a car and for the time savings with a bike, it's a fun way to get across between Newport Beach and Balboa Island. Fast, efficient, well-organized -- and a fun and scenic way to see the bay.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Enjoy the ride!", "Even though it is a quick ride on the Balboa Ferry, take the time to get out of your car and enjoy the breeze and the fresh air. This is a fun moment to share with your kids and grandkids on the way to get a frozen banana or Balboa bar and then head back home. The shopping and restaurants are also great on Balboa Island. We often take the ferry to avoid the traffic on Newport Blvd. on our way back home.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Great view of the harbor", "The ferry is a great way to get Balboa island to the heart of the peninsula & see the harbor! Trip is too short but worth it!"], ["Reviewed January 22, 2018", 5.0, "Fun ride with great view", "Easy walk on and walk off and great way to walk all around balboa island for an afternoon. Get a balboa bar and park at the pier pretty early as the lot fills up after about 10."], ["Reviewed January 21, 2018", 5.0, "on the water", "Only a three minute ride but fun for the whole family as you are on the water and can see all the boats and the fun zone"], ["Reviewed January 21, 2018", 5.0, "Historic ferry across the bay from Balboa Island to the peninsula.", "The historic Balboa ferry is short on distance, but long on laid-back beach fun. The three-car ferry transports cars, pedestrians, and bikes across the bay, a nostalgic shortcut from Balboa Island and the Balboa peninsula and pier. There's fun and good food to be had on both sides. We love sharing this experience whenever we have visitors stay with us.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Fast and Easy!", "Even though this isn't the only way to get to the island, it is fast, easy and places you right in the middle of everything. The attendants are friendly and efficient. We have never had much of a wait and enjoy the scenery on the water. Try it!\nShow less"], ["Reviewed January 15, 2018", 5.0, "Very easy!", "Great service...fast ride to Balboa Island...foot traffic is quik anx easy...carz are at a time...no issues"], ["Reviewed January 11, 2018", 5.0, "Always a nice view", "We always enjoy taking the ferry in Newport. No matter what time of the day it is, the view is great and very relaxing. Definitely recommend to anyone who has never tried it."], ["Reviewed January 10, 2018", 5.0, "a must for getting to the beach", "We hired Bikes to ride along Newport beach, without using the ferry it would have taken a long time to get there. the ferry allows only 3 cars at a time so there is plenty of room for foot passengers, price with a bike was $1.25 each way each person.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Convenient ferry to/from", "Always enjoy taking the ferry across as a walk on. Not too expensive only a couple of bucks per person. The ferry runs often. Very easy to use"], ["Reviewed December 28, 2017", 5.0, "Always a treat", "After the Christmas boat parade it took us an hour to get off Balboa island. However any other time I love taking the ferry for the fun of crossing the harbor and enjoying the view - day or night."], ["Reviewed December 22, 2017", 5.0, "Fun little trip for family that didn't know it existed", "As busy as the night was it was a breeze to get on and family loved every minute of it even getting out of the car and walking around on the short trip across."], ["Reviewed December 22, 2017", 4.0, "Must visit,", "a cute city can be reached by the ferry, a very fast one and cheap option of transport! perfect for kids"], ["Reviewed December 21, 2017", 4.0, "Good Service", "The Ferry charges people $1 to take them to Balboa Island. You sit next to the cars (max 3) and enjoy the nice, super short trip. Employees are nice. There is almost no waiting time, a ferry is always there for you!\n(there is a gasoline smell)\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great way to see the Harbor and take in some sights!", "Short lines this time of year .. a quick ride on the water as you travel to the Newport Peninsula.. Very scenic and great to take out of town guests."], ["Reviewed December 21, 2017", 5.0, "Slow Down and Enjoy the Ride!", "Locals use this ferry to short cut the drive but I use to get a fun view of the water and Newport Bay. Taking your car on the ferry during rush hour or during summer months will cost you some time, but it is a blast.\n\nGood option is that you can walk on or bring your bike. Always a fun time!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Relive original Cenarama sight", "Great ride across bay on foot, by car or bike. Fastest way to Balboa peninsula and Balboa pier,(grab a meal at Ruby's at the end of Balboa pier)."], ["Reviewed December 15, 2017", 5.0, "Easy, fun and inexpensive!", "Super fun and easy way to get across the bay, rather than driving on the road....it’s just a few dollars and a quick ride, but so fun!"], ["Reviewed December 15, 2017", 4.0, "Handy and cute", "Took the ferry over to Balboa island. Small ferry which accommodates about 2 or 3 cars. Very reasonable and very scenic as you cross over. Walkers are also accommodated."], ["Reviewed December 14, 2017", 4.0, "Cheap and fast aetbice", "We went in the off season but we didn’t have to wait to take our car on the ferry. Plus is was reasonably priced ($2 one way)."], ["Reviewed December 14, 2017", 4.0, "Couldn't be easier", "Hop on the ferry, pay your dollar and go across. Minimal wait time since there are two going back and forth. You can take your car or your bike on board for a little extra."], ["Reviewed December 6, 2017", 5.0, "Balboa Island Ferry is my 2 minute daily vacation.", "When living on Balboa Peninsula Point - my preference is to take the ferry to Balboa Island to connect to Pacific Coast Hwy - Newport Beaches main artery. The alternative would be to drive 8 miles around the peninsula to connect at the same intersection of Pacific Coast Hwy and Jamboree.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Love Crossing to Balboa Island", "It's cheap and a fast way to get across. it's especially nice right now at Christmas time to see the lights"], ["Reviewed December 3, 2017", 5.0, "Old time fun!! cured our kid of his fear of boats!!", "$4, for a car 2 adults a teen and a kid who DID NOT want to go on it. Its short, fun, saves on the traffic on the peninsula and its been there forever. Boat ride on history. The kid loved it, loved seeing the harbor seals and can not wait to go again!!!!! It really gets you into the spirit of things even if it is just 5 min.\nShow less"], ["Reviewed November 26, 2017", 4.0, "Balboa Island Ferry - short trip to the Island", "Very short trip across the water but well worth it. Don't bother with the car you won't need it. Park the car and ride across."], ["Reviewed November 26, 2017", 4.0, "Walking tour", "Neat experience to ferry between sections of the beach. Certainly worth the $1 return fare. The views of the bay were fantastic from the ferry deck."], ["Reviewed November 14, 2017", 4.0, "Not Rocky at all", "This ferry is the quickest and cheapest link from Newport Beach to the shops and restaurants of Balboa Island. It runs back and forth every 10 minutes or so and even in peak periods the wait isn't long. Cars and pedestrians are all welcome and the trip to the island is well worthwhile.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Bikes on the Ferry", "This is a great way to see Balboa Island. Ride to the Ferry and cross over to the strand... so much fun people watching And a fun way to see the beach."], ["Reviewed November 10, 2017", 5.0, "Fun and easy", "At first I questioned why we were taking a ferry such a short distance and then I understood. It’s easy! It’s quick! It’s cheap! And it got me on the water!!! Instead of driving around through traffic, take the ferry ."], ["Reviewed November 10, 2017", 5.0, "Feels like boating!", "A convenient, inexpensive and fun way to get to the peninsula. The ferry gives you the opportunity to see Newport from the water, see local color and feel like you’ve been boating. It goes from the peninsula to Balboa island too."], ["Reviewed November 9, 2017", 4.0, "Best deal!", "I️ live near the Balboa Island Ferry...it cost $3.00 to cross the Balboa Bay! A great deal! There are ferries until midnight...a great way to party!"], ["Reviewed November 8, 2017", 5.0, "Cheap & Fun Way to get to Balboa Beach/Balboa Peninsula from Balboa Island.", "After getting done with a whale watching tour on Balboa Island, we wanted to get across the harbor to go to the beach for a few hours. Instead of driving all the way around again, we walked and used the ferry instead which is great! It is $1 each way per person for pedestrians and once you get across, you are only a few blocks from the beach. Cheap and fast way to make your way around the area and a fun way to do it too! The \"Captain\" of the ferry was nice to talk to as well! A must use if you are in the area.\nShow less"], ["Reviewed November 8, 2017", 4.0, "The cheapest 'cruise' you can take", "This little ferry is a fun way to get on the water (even if it's only for 6 minutes). It's inexpensive for a car, bike of pedestrian. If you have kids or are on your way to the Fun Zone, include a ride on the ferry.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great FUN", "Took the ferry going to a whale watching expedition and it was really fun. It was a weekday morning so there was virtually no waiting. It only cost $5 for our car and four adults and was the most pleasant 5 minute trip I can recall. On a summer weekend, expect a longer wait.\nShow less"], ["Reviewed November 6, 2017", 5.0, "$3 for driver, passenger and car", "fun to walk down memory lane- only takes a few minutes if there is not a line. John Wayne once gave me a ride in his sailboat when I could not afford the ferry fee and was swimming across, probably 47 years ago."], ["Reviewed November 5, 2017", 5.0, "Fun crossing", "Quaint ferry crossing from island to peninsula. Small ferry and very efficient. Nice way to arrive on peninsula with coastal parking directly opposite."], ["Reviewed November 5, 2017", 4.0, "Best sight seeing bargain in Newport", "I love taking guests across the harbor channel on the Balboa Island Ferry. Great views of the Newport Bay. Autos are $2 with driver, $1 for adult passengers. You can park on the Island, then take the ferry for $1 to the peninsula and look around and return for $1. Best views for te money.\nShow less"], ["Reviewed October 29, 2017", 5.0, "The Best 90 Seconds Money Can Buy!", "I LOVE the Ferry!!!! On foot, on a bike, or in a car, it’s absolutely a blast to cruise across the harbor on these classic boats!! Not sure why I think it’s so cool, but it is! Something about being on the water and watching the boats go by. Who knows?!? Suffice to say, it is one of my favorite things to do in NB.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Ferry Ride", "So much fun to ride the Ferry in Newport Beach, my friends from MN loved it! I highly recommend this to everyone who visits."], ["Reviewed October 25, 2017", 5.0, "Feery", "Very efficient service. No wait we drive straight on. But think this was because we were out of high season. Nice little journey with nice views of the bay. Only took a couple of minutes."], ["Reviewed October 24, 2017", 5.0, "this is so fun", "The ferry is cheap - $3 with car - and it takes 3 cars and a nice number of people. This is something we do not to get from one side to the other but just for giggles!\nJust do it!!!!\nIf you read my reviews, please give them a thumbs up. thanks\nShow less"], ["Reviewed October 24, 2017", 5.0, "After all the crossings over 60 years...", "I still think this is the best 3 minutes that Newport Beach has to offer. I do enjoy one way over the other, the Balboa Peninsula to Balboa Island is the better half for me. Just that quick getaway from land out into the bay, always enjoy it more when the three ferry’s are all working. That time of the year is usually the most crowded and you might get to stop in mid transit for an additional minute or two. I do like to see all the street lights at sunset on the island, when they come together in a single row. Just that moment of perspective is wonderfully beautiful. To watch the Seagulls float by on the soft wind, to hear the Sea Lions bark, Pelicans diving into the water trying to catch their dinner or sitting on a buoy. All these sights and sounds never do I tire of.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Something different.", "We used the ferry one night after driving round the island. This is something different to experience in the city of the automobile."], ["Reviewed October 22, 2017", 5.0, "Quick river trip", "We went across here to get to a restaurant and it's a quick trip for only $1 per person. We were treated to lovely views as we went across and even the company of some seals who were swimming around the nearby boats"], ["Reviewed October 17, 2017", 5.0, "Best part of going to Balboa!", "We loved driving onto this little ferry that carries 3 vehicles at a time from the island over to the peninsula or visa versa. It cost $2 for the car and driver and $1 for each extra passenger. I was the first car to drive on and must admit that I worried about my car going into the water but everything was fine.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Fun fun fun", "Only cost $1.00 and quick as a blink you're on the other side. Definitely worth checking out. Ferry holds three cars and plenty of room for non driving passengers."], ["Reviewed October 15, 2017", 5.0, "Just a \"Gotta do\" thing.", "I have been riding this ferry my whole life. I lived on Balboa Island, took in the culture and enjoyed. to get there, traffic is a mess, which just makes it more the experience . Once there, get out of your car and enjoy the view that John Wayne loved and did every Sunday. Parking is what it is, going by bike is even better. Do this. So many great memories.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Great Ferry Ride", "We took the little ferry from the Village to the Peninsula and it is a wonderful 5 minuet ride. A must if you go to Balboa Island."], ["Reviewed October 8, 2017", 5.0, "A great time saving", "The ferry people are very efficient at getting people on and off. It's a fun way to save time for a low coast, especially if you're walking or riding your bike. Does get backed up on holiday weekends."], ["Reviewed October 3, 2017", 4.0, "A Really Nice Ride!", "If you want to see a part of the great OC coast at a very reasonable price; try this! We've taken this ferry many times just to \"get off the mainland\"! It only lasts about 10 minutes to cross but it provides a great view; weather is usually very clear and it gives one the feeling of really escaping land and breathing \"fresh air\"! The service is prompt and friendly! It's fun!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Scenic sunrise/sunset stillness on the bay", "Anytime activity not to be missed when in the area, especially early in the morning with smooth water or in the evening for a ride pausing to take in a sunset."], ["Reviewed September 30, 2017", 4.0, "Quick trip, very inexpensive.", "It's the best way to get back & forth between the mainland and Balboa Island whether you are taking your car or not."], ["Reviewed September 27, 2017", 5.0, "Super quick ride!", "You will be on Balboa Island in like, two minutes. Pleasant ride that leaves every few minutes so it's super convenient."], ["Reviewed September 23, 2017", 4.0, "Novel way to see balboa island", "It's a quick ride across the bay from either direction (balboa side or PCH) it's an open air ride of about 5 mins. you will wait longer in the summer just to get on the ferry as it only holds 4 cars. When on the ferry You can get out of your car and chat with others or stay in if it's cool out. We used to rollerblade on to the ferry and just hop on to cruise around the island. Enjoy!\nShow less"], ["Reviewed September 19, 2017", 5.0, "A \"Must\" when visiting Newport Beach!", "This is a very inexpensive thing to enjoy while in Newport Beach by car, bike, walking with great destinations at both ends of the ride."], ["Reviewed September 16, 2017", 5.0, "Great ride", "Took the ferry to Balboa; quick ride with great views; ferryman provided good options for lunch; best to park in neighborhoods and just ride the ferry - it only holds 3 cars"], ["Reviewed September 15, 2017", 5.0, "An unexpected treat", "My wife and I went to Balboa Island for a boat tour and on the way the directions on our GPS led us to the ferry. We drove right on and were on the island in 5 minutes. No waiting. Can't beat the $3 charge each way.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Day at the beach", "Anytime I visit the area I make sure to stop by the Balboa Islands Ferry and take a ride across. U can ride with or without your car for a small fee. My family and I always visit the area during the Newport Beach Holiday Boat Parade. It's a family outing we do every year. We take the Ferry across to enjoy hot cocoa and play games at the local arcade. Lots of great childhood memories made here and now memories I make with my kids. If your haven't been on the Balboa Ferry it's a must. It's only $1 per person to cross and a little more if you decide to drive your car across.\nShow less"], ["Reviewed September 13, 2017", 4.0, "Love taking this short ferry", "Whenever I can I love taking this short ferry trip in Newport Beach. The ride is quite short but a nice little change that takes you from Balboa island to Balboa peninsula. The drive across Balboa island is a bit slow and takes you through the little main street there. Always fun when to do when I have people in town or just feel like taking the longer way. The wait for the ferry is usually quite short so don't be put off by the line as it move quickly. Don't blink though as the actual trip is only a couple minutes. Make sure to enjoy the boats coming and going along Newport Beach harbor.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Fun and fast", "For less than five bucks you can bring your family on a ferry ride across the bay. The ferry only holds three cars at a time, so there may be a short wait but the ride is fairly quick, under 10 minutes. Kids loved it. On the mainland side you will be in a cool shopping area with a Starbucks. Pro tip: kids 5 and under ride free.\nShow less"], ["Reviewed September 7, 2017", 5.0, "TOTALLY COOL", "My daughter and I were cruising around in Balboa and she had just gotten home from school. I thought I would take her on the Ferry. The smile on both of our faces were priceless, we had a great safe fun trip across the channel. Then we ventured into a fantastic neighborhood and stopped at a few stores.\nShow less"], ["Reviewed September 6, 2017", 5.0, "A Must Experience", "I lived on Balboa Island for years and the Ferry was always an inexpensive treat and something I'd take visitors to experience all the time. Do it!"], ["Reviewed September 6, 2017", 5.0, "Ruff life", "Ruff life for the dog on the ferry. I think it was only $1.25 per person. Not sure how much it cost for a car to cross."], ["Reviewed September 6, 2017", 5.0, "BALBOA ISLAND FERRY", "This ferry connects Balboa Island to the Balboa Peninsula. It's a cute little ride across the bay. I ride it regularly. Crew is nice. Price is nominal. And it saves a big drive around the bay."], ["Reviewed September 6, 2017", 4.0, "Scenic Transportation on the cheap!", "This ferry runs so often that the wait is extremely minimal, once we just walked right on. It's a beautiful quick trip. Balboa Island has some fun things to do, quirky shops and great food."], ["Reviewed September 6, 2017", 5.0, "The best tourist spot in CdM", "I have been riding on the Balboa Ferry for 40 years. It is a spot I take all my family and visitors to see \"old Newport.\" Don't miss it."], ["Reviewed September 6, 2017", 5.0, "MUST DO Newport Beach attraction", "AWESOME views of Newport Harbor and the quickest way from Balboa Island to the Newport Peninsula. Only takes a couple if minutes for the crossing but awesome whether you're walking, driving, or on a bicycle."], ["Reviewed September 6, 2017", 5.0, "$1 per person saves you time and gives you a great view of Newport Beach!", "Everyone loves the ferry! It's a must for all! The short cut across the water to fine dining and the Balboa pier!"], ["Reviewed September 4, 2017", 4.0, "Quick Cheap Ride", "Took the Balboa ride both to and from. The price is right at $1 per person. It runs pretty much continually so there is no wait if you are a passenger. There was a line for cars however. The ride takes about 5-10 minutes. On the ride, you can look at all the boats.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Balboa Ferry A Treat!", "We stayed in Newport Beach in August at the Islands Hotel in Fashion Island and took our friends to Balboa Island to see the sights! We took the Balboa Ferry across Balboa Island to the Newport Peninsula! It's a fun ferry ride across the bay. The charge was $5.00 for 4 of us in my large SUV. You can ride bikes or walk onto the ferry for your fun adventure. Worth the visit!\nShow less"], ["Reviewed September 1, 2017", 5.0, "Fun experience", "If you have the time Balboa island is a great side trip and taking the little ferry is an experience to remember."], ["Reviewed August 31, 2017", 5.0, "Quick access to the Newport Peninsula and the Balboa Pier.", "This is a fun way to go between Balboa Island and Balboa area and the Newport peninsula. There are a lot of great shops on the peninsula side and there is Ruby's restaurant at the end of the Balboa Pier."], ["Reviewed August 31, 2017", 4.0, "Nice way to get across the water", "We were walking round Balboa island and wanted to cross to the beach so rather than drive went as foot passengers on the ferry. Nice short ride and good value for $1"], ["Reviewed August 31, 2017", 4.0, "Short Cut!", "The Ferry is not only a picturesque ride, it is a great short cut to get onto the peninsula where you will find local eateries, shopping, a fun zone for kids and of course the beautiful Newport Beach itself."], ["Reviewed August 29, 2017", 5.0, "Whale watching trip", "Went out on a whale watching trip. Davey's locker offered a two hour trip out in the pacific.We had a blast -we sat in the VIP section with Captain Larry.it was worth the extra money as he answered all of our questions and gave us heads up when the bottle nose porpoises arrived so we could get right down in front of the boat watch them.we also saw sea lions and really enjoyed the experience.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Save a little time driving and take the ferry", "We decided to take the little car ferry over to save some time and with the wait it was about the same as driving around. Price was cheap enough and was fun for the younger ones."], ["Reviewed August 20, 2017", 5.0, "Take a Tour and Don't Break the Bank", "Walking, Biking, or even Driving? It doesn't matter when you want to ride the ferry. Fun in the sun and enjoying the sites for a small fee. Great service and quick trip to Balboa Island. You won't go wrong!"], ["Reviewed August 20, 2017", 5.0, "Cheap Thrill", "Cute little ferry that goes maybe 300 yards -- from Balboa Island to Balboa Peninsula (and vise versa). Left over from years past, but fun cheap thrill (costs like $3 for a car with 2 people). You drive onto a little ferry (think 3 or 4 cars max) and it brings you to the other side (allows people on as well). Alternative is to drive around to the start of the Peninsula. Allows travel in both directions, which is nice if one side is crowded (the island side always seems to have a line, while the Peninsula side has very little to no line). Can get out of your car -- which is what you want to do. Little trip across the water with all the boats to look at is very relaxing & fun. Worth it.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Lots of fun", "When we stay on Balboa Island we park the car, rent bikes and then either walk or ride the bikes everywhere we need to go. The ferry is a hoot and the people watching is terrific."], ["Reviewed August 16, 2017", 5.0, "A Novelty.", "Our large group comes here every year and we have yet to be disappointed. A novelty in which everyone should experience once in their lifetime. It's a pleasant and scenic way to travel to and from Balboa Island and the peninsula."], ["Reviewed August 15, 2017", 5.0, "Fun for kids", "We stayed in an Airbnb on the island and this ferry was a perfect way to head over to the fun zone. Only a $1 per person to ride it over and kids under 2 were free. It was cheap, safe and fast to get over to the beach and pier.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Fun!", "First time on a feery and it was fun to cross over in our car to the other side. We went to the dolphin and whale cruise. Would definitely go back again!"], ["Reviewed August 12, 2017", 5.0, "Quick Access To The Other Side", "I always enjoy taking the Balboa Island Ferry as it is the quickest way to get to the other side. Short ride, but beautiful and worth the few dollars."], ["Reviewed August 12, 2017", 4.0, "Fun for kids", "It's a tiny little Ferry with a very short Crossing but it adds to the experience of visiting the Balboa area. There are no restrooms because it only takes a couple of minutes to cross. If you're a pedestrian or on a bicycle, there are benches. It's $1. 25 to cross with the bicycle. The line for cars can get a little long as busy summertime but the crossing is shorts.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Great and fun ride", "Kids loved it. Great scenery. Cheap price. Quick ride. Watching the cars go on and off was cool. It was easy to get on and off. We have a 1 and 7 year old and it was a Great fun. Lots of room for stroller. Only down side is that the ferry drops you on Balboa Island far from their main street. Quite a hike when you're with young children. Also, I didn't realize until we go to the island that you can actually drive across on a bridge connected to the mainland from the other side. The ferry was nice to take across.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Affordable fun ferry", "This is one of my favorite things to do when in the Newport Balboa area. It's not a long boat ride, its not an expensive boat ride, but it can often be the best 5 minutes of your day. There can be a line, but wait has never been too long for me. It only fits three cars but it makes the short ride every 5 minutes or so and there's two ferry's crossing from each side and passing by your side in the water. You might see a seal or two in the water, you might not. But you will enjoy it. There's not much discussion on the boat and most wont even get out of the car but you can and I advise doing so.\n\nStretch your legs, breath in some air and for 5 minutes you will feel better and forget about that time lost in the SoCal traffic.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Smart way to cut, cheap and a nice experience", "Not much to say, cool ferry that lasts 2 minutes, you cut about 5 insted of going all the way around. Kids love it."], ["Reviewed August 10, 2017", 5.0, "conveni shortcut", "Great way to get to the beach by bike or even by foot, if you don't have time for the detour. Cheap and fast."], ["Reviewed August 9, 2017", 5.0, "Always part of annual trip", "Every year we vacation in Newport at our time share. we have a few things we do every year. The Balboa Island Ferry is one of those things. Our son looks forward to it and we often have a friend of his along who has never been on a ferry who always love it. it is small and quaint and fun and quick and inexpensive. You can ferry out and drive home or the other way around. We ferry both ways. Go and enjoy.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Best few minutes of your life!", "I love driving my \"old\" cars on the ferry. 1914 Model T, 1931 Model A, 1959 Studebaker make such a beautiful site! Most beautiful bay in the world!"], ["Reviewed August 9, 2017", 4.0, "Try one of the last ferries in California", "To get from Balboa Island to the Newport Peninsula, or vice-versa, try the Balboa Island Ferry. This is a nostalgia trip to times past. The ferry has been in existence since Newport Beach was young and still operates. It takes only THREE vehicles per ferry and crosses the narrow channel in a jiffy. You also can be a pedestrian or bicyclist to take the ferry. The ferry circumvents you having to drive your car all the way from Corona del Mar to Newport Pier and then down the long Newport/Balboa Peninsula. It takes you to the fun zone, Balboa Pier, some bayside restaurants, and the nautical museum. Warning: On extremely busy holidays, the automobile line for the ferry can be VEEEEERRRY long; best to avoid on such days unless you have a good book to read and a lot of time to wait.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Fun, fun, fun-great ride", "Enjoy the bay view, the boats, paddle boarding- fun ride! Inexpensive ride, goes quick, must ride again."], ["Reviewed August 8, 2017", 5.0, "Simply Fun", "Fun,Fun, Take a bike ,car or golf cart to the fun zone. Play at the beach, fish, or just enjoy the sun. It's quick, inexpensive, and early a long wait. If you visit Newport Beach, see the real OC from the ferry."], ["Reviewed August 8, 2017", 5.0, "A throw back to fun in times past.", "Balboa Island Ferry is located in one of the most beautiful areas of the California coast. The ferry connects Balboa Island with Balboa Pennisula. You can approach the ferry from either point. The ferry is shared by cars, bikes and walkers, often with their dogs. After a pleasant walk around Balboa Island you can take the ferry across the bay to the Pennisula. A quaint fun zone adjoins the ferry entrance on the Pennisula. There are funky beach shops and lovely bay front restaurants and bars. Locals as well as tourist all enjoy the beach environment. Different water craft can be rented or chartered from this location. Summer months are crowded with visitors. Winner is more peaceful. The ferry ride is a favorite with young children.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Cheap and easy way to venture to the other side", "Nothing to write home about but nice staff and smooth operation. The ferry gets you there quick and easy. My boyfriend and I took the ferry over to Balboa Island for a seafood lunch and back over to walk the beach a bit. Great breeze on the quick ride. I have taken the ferry when it was quite busy and have to say I was impressed by how quickly the line was handled. Smooth.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Fun for the kids", "It's great to take the ferry across to balboa fun zone with the kids. Adults will love it also. Just be prepared to wait in line especially in the busy summer months"], ["Reviewed August 8, 2017", 4.0, "Family Fun!", "The Balboa Ferry and Balboa Fun Zone are great for families. There is so much to do and you can ride the Ferry back and forth to the island either in a car or by just walking on. My kids love hanging out down there."], ["Reviewed August 8, 2017", 4.0, "Locals Secrets", "A fun experience anytime of the year is to drive down Balboa Island to the ferry,but park your car on the street(there will be plenty of parking).Walk to the ferry and take it across to the peninsula.When you get off,check out Newport Landing to thr right.Go upstairs,have a drink and take in the best views in the harbor.They have a great happy hour and the food is really good.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Balboa Ferry", "This is one thing you do not want to miss while in Newport Beach! Drive your car onto the ferry and get out and enjoy the brief ride and the view of the harbor and many boats."], ["Reviewed August 8, 2017", 5.0, "Great experience", "If you are in Orange County, I highly recommend taking the ferry to the island. It's fun for all ages with a great view."], ["Reviewed August 8, 2017", 5.0, "Great way to visit Balboa.", "Try to go early and walk along all the shops. The nautical theme is fun and we buy small items. Free parking on the street if you can find it. Try the side streets for parking also."], ["Reviewed August 6, 2017", 5.0, "Ferry to balboa", "For 1$ (3$ per car) the ferry is a quick trip across the bay to get to the island . My daughter and I went to the island to get oyr \"steps\" in ! A great place to walk around and take in some amazing homes ! Nice get away from the crowded Oceanside !\nShow less"], ["Reviewed August 4, 2017", 4.0, "Nice to give visitors a taste of Balboa", "Shot ride ferry ride for getting you across the peninsula to the island. $3 for your vehicle plus $1 for each passenger. You can come out of your vehicle and enjoy the short ride across the water. I always take my visitors to Balboa and they love this little experience. Beware about weekend rush when you may have to wait in line for 45 minutes during peak times.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Nice experience", "It is a very short trip It works really well You go into tge ferry and durring the trip you pay 1 dollar It only takes 3 cars at a time, but is really quite fast to go and return"], ["Reviewed July 31, 2017", 5.0, "A Classic Experience", "This wonderful ferry has been transporting cars, bikes and people between the Balboa Peninsula and Balboa Island for decades. It costs $1 per person (without car or bike) and is well worth the money. The only other ways to get between the two places are to either drive all the way around, or swim. Car lines get very long at the height of the season. Then on has to calculate whether it makes sense to sit in the line for 15 minutes, or drive around in the same time. The ferry only holds three cars at a time. I usually opt for the ferry because being out on the water is such a pleasant, if short, experience. The crossing takes between one and two minutes.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Take this Novel Boat Tide", "A new experience for many tourists, the Balboa Island Ferry is a novelty not to be missed! Close views of the boats & Harbor for $1 & a few minutes. It dropped me off @ Fun Zone.\n\nThe Ferry Service has been owned & operated by the Beek Family for almost 100 years. Ask the Captain to point out John Wayne's old home that he moved to from his Encino Ranch.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Fun", "Fun way to get from the Balboa amusement park area to the island. Short wait, short ride, long walk when you get to the island to the shops, but scenic, of course."], ["Reviewed July 30, 2017", 5.0, "Fun little ferry to take to the Penninsula!", "I love this little ferry! It is so much fun to see the seals bobbing their heads up as you cross over to the other side!"], ["Reviewed July 28, 2017", 5.0, "Balboa Island Ferry", "Awesome experience. We paid $1 per person and $1 per car getting to the island and you have to pay again to return."], ["Reviewed July 28, 2017", 5.0, "Short but sweet", "two people and a car, three dollars.. what can you do for three bucks? if you are seeing Newport for the first time, or showing a guest, this is simply a must, day or night it is a wonderful change of pace, and provides great views. do not plan on rush hour,\nShow less"], ["Reviewed July 26, 2017", 5.0, "Fun old time ferry across bay to Balboa Island", "Fun ferry ride for car or walking or biking. low price trip across bay to Balboa Island or vs Versa. Starts at \"Fun Zone\" area of Newport peninsula or on Large Island Of Balboa."], ["Reviewed July 23, 2017", 5.0, "Balboa vacation", "Always fun no matter what! Our puppies loved it. Having said this, we used to live in area so not a new experience."], ["Reviewed July 22, 2017", 4.0, "Just a quick visit", "We took the ferry to Balboa Island on a whim while killing time until the fireworks. Not much to do or see...couldn't find a place to grab a glass of wine."], ["Reviewed July 21, 2017", 5.0, "The ferry boat: a great experience", "Based on the suggestions received we went today to explore the Balboa area close to Newport Beach where we are spending our vacation. The Ferry is a very nice and unusual experience. Even if it takes you just few minutes from one side to the other, you still enjoy the environment. You pay the ticket on the ferry and can board without queuing. Good option if you don't want to bother with a car. You can stroll Balboa Island without any problem. Very nice. Worth going there. Nice small shops with many local nice things.\nShow less"], ["Reviewed July 19, 2017", 5.0, "LIFELONG FERRY RIDER..", "I grew up in Newport, have enjoyed the Ferry for the past 55 years! Other than the (obvious) additional summer traffic, always a fun way to return from the Peninsula, Capt Ed, always a great guy to chat with.. Just such a pleasant (albeit a short crossing), after all these decades.. I recall seeing Buddy Ebsen & the Duke-John Wayne on many occasions.. The Beeks sure got it right way back in the early 20's 30's..\nShow less"], ["Reviewed July 19, 2017", 5.0, "What a fun way to travel", "Fun, inexpensive and what a view. Cars, pedestrians and bikes all welcome. Best way to get over to BI."], ["Reviewed July 19, 2017", 5.0, "Cheap, Fun and Great Sightseeing", "We took the ferry to balboa island on a recent trip and it was so much fun. the people who work on it are great, its fun to get on while they are also loading cars on it and enjoyable on the short cruise to the other side looking at the beautiful boats all around you.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Beats sitting in the ohter line of traffic", "In going from Balboa Penninsula to Balboa Island this is something of a unique throwback way to get around. It's just a simple barge and the trip lasts but a few minutes but, it saves lots of traffic hassles and some time (time of day depends on savings if any) it seems. For the fun, as a tourist this is an easy why not.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Quick and easy", "We took our family of 12 over on bikes and it only costs $1.25 per person. It was an easy way to see the island, shop, and get an ice cream. The ferry ride is quick and easy, taking about 5 minutes to get across. The little ones loved it!\nShow less"], ["Reviewed July 18, 2017", 5.0, "Fun way to experience a ferry boat ride", "We brought our grand kids and a few out of town visitors to the Fun Zone in Balboa, a place we used to visit when my kids were little. So nice to let the kids experience what their parents did back in the 70's,80's and 90's. The ferry is clean, with a bench for sitting and is capable of holding 3 cars and a lot of foot traffic per trip. The price is right too! $1 per adult and $.50 per child. Great views of the island and the water. The guys running the ferry are very accommodating, especially with a wheelchair. They have a portable ramp which they gladly brought over for me all 4 times I got on and off the boat.Well done!\nShow less"], ["Reviewed July 18, 2017", 5.0, "First class service", "It's simply there when you need it, and the service is quick, easy and economical. Drive on or walk on, don't hesitate to make the crossing as there's so much more to do over there."], ["Reviewed July 12, 2017", 5.0, "Part of growing up in Orange County", "This attraction has been part of growing up for anyone who frequented Newport Beach in the last six or seven decades. The kids will really get a kick out of being in your car and being on a boat. Very convenient as well as cheap!"], ["Reviewed July 12, 2017", 3.0, "good way to get your car across the bay", "My friend and I were coming late from a party on a dinner cruise and didn't want to drive all the way around so we opted for using the ferry. I was apprehensive about driving the car onto it because it was dark and I couldn't see it as well but the crew were very helpful in guiding on and off the ferry\nShow less"], ["Reviewed July 12, 2017", 5.0, "Easy", "Cost $1.00 for adults and $0.50 for kids under 12. Cars are $5.00. Good, sneaky way to get to balboa."], ["Reviewed July 12, 2017", 5.0, "Better than swimming", "Only way unto the island in less you swim or have a boat. Fun short ride with locals, cars, tourists, bikes, Segways and pedestrians. Fares seem to vary a little depending on which employee collects them."], ["Reviewed July 11, 2017", 5.0, "Cross over from Balboa Island to the mainland", "It is a fun ride for $1. Something you cannot do very often. We went round trip You get to see both sides of the harbor and the many boats that are in the water."], ["Reviewed July 11, 2017", 5.0, "Best deal", "For only a couple of dollars, you can have a boat ride adventure to a great walking area. The Island has a walking path the circumnavigates the island. It also has a downtown for shopping and eating. Lots of fun!"], ["Reviewed July 10, 2017", 4.0, "Balboa Island Ferrry", "Have made this trip many times, sometimes to get from one place to another rather than drive the street around and sometimes \"just for the fun of it\".Short ride includes view of the old home of John Wayne and ferry arrives on Balboa Island which is very quaint and attractive\nShow less"], ["Reviewed July 10, 2017", 4.0, "A lot of fun.", "Bring a camera great views of picture-esq Newport Harbor. Most bang for the Buck fun boat ride in Southern CA."], ["Reviewed July 10, 2017", 4.0, "A SHORT SEA EXCURSION", "It's been a while since I last rode the Balboa Island Ferry, but my memory serves me well as being a few minutes of ocean solitude. When I lived down by the ocean in Newport Beach years ago I would ride my bike to the fun zone where the ferry is located. The trip was about 2.5 miles and relaxing as well. The actual ferry ride across Newport Bay was a short, but very calm and relaxed way to get from one side of the harbor to the other. The entire trip only took about 5-8 minutes with great views of the various boats and water activities usually taking place on a daily basis. The last time I was on the ferry was probably 6-8 years ago but the memories are still lingering. The only other way to get to the other side of the harbor is to drive all the way around or swim. I don't recommend the swimming as there are way too many boats.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Balboa Island History", "If you visit Balboa Island, make sure you take the ferry to or from the island. Drive down to the Wedge and see if the waves are breaking big. $2.00 per car plus $1.00 for each passenger. Usually, a little line (5-15) minutes, but worth the wait. You get a great view of the harbor when crossing.\n\nThe ferry takes 3 cars at a time and you can get out while crossing. The crossing takes about 5 minutes.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Cheap great fun", "Short but enjoyable ride from balboa island to the peninsula for $1 pedestrian or take your car for a bit more to save lots of driving. Just walk on and enjoy the sites! Don't go to balboa island without doing it."], ["Reviewed July 8, 2017", 5.0, "A local institution and tourist favortie", "Talk about a family owned and operated business. The Beek family is one of the founding families of Newport Beach / Balboa Island. They are an integral part of the the community and loved by all."], ["Reviewed July 8, 2017", 5.0, "Quick and Inexpensive", "At the time of this review, the cost per person is $1 (without a vehicle). It is well worth the price for the convenience and novelty of taking a ferry to a beautiful island."], ["Reviewed July 7, 2017", 4.0, "Quick ferry ride out to beautiful beach front walking path", "We took the ferry out to Balboa island and then walked the path along the ocean to the Newport Pier. Great quick way to get from Balboa Island to Balboa Penninsula!"], ["Reviewed July 7, 2017", 5.0, "Not much to say", "Silly little ferry that takes you from Balboa Island to the Balboa Peninsula which is about 300 yards across the water...I guess if youre on the island already it does save you some drive time then going all the way around"], ["Reviewed July 2, 2017", 5.0, "Smooth ride", "On my visit last week, the place was quite busy, however the wait wasn't long at all...the operator and conductor are friendly and effecient.... The cost per person was US$1.00 and the ride was short and sweet. Within a few minutes you were on the other side!\nShow less"], ["Reviewed June 28, 2017", 5.0, "Balboa ferry", "I've been taking this very my whole life, sometimes there's a little line to get on, I recommend getting a balboa bar and taking it with a bicycle."], ["Reviewed June 27, 2017", 5.0, "Balboa Ferry", "I love the Balboa Ferry...\n\nI remember my folks taking me as a kid. We would take the Ferry and enjoy the island.\n\nToday, I never miss a chance to Drive or ride bikes on the Ferry.\n\nI would recommend that you take it as a walker. You can explore both sides and enjoy the Beauty!\nShow less"], ["Reviewed June 27, 2017", 5.0, "Fun Ferry Ride!!", "Balboa has always been a favorite spot for me and my family to go walk and shop. The ferry ride is definitely a must to get to the island. Taking your car on the ferry is fun for everyone. Don't forget to get a frozen banana when you are on Balboa!\nShow less"], ["Reviewed June 26, 2017", 4.0, "Great for walking or biking to island, not as good for cars", "We (a couple families) stay down on the peninsula just south of the Balboa Pier. We all love hopping on the ferry and either walking or biking along the seawall facing the peninsula or down Main St on the Island. It's $2 R/T ($2.50 if you're on a bike). They can have 2-3 ferries running when they're busy, and even late at night (open til 11) the one ferry doesn't take too long for a round trip. During rush hour, cars can be lined up a bit and it can take a while to cross since it's only three at a time (but if you need to get to lower peninsula, sometimes not worse than coming all the way down Newport).\nShow less"], ["Reviewed June 24, 2017", 5.0, "Family fun", "We've been coming here for many years and it's always a pleasure! Our children grew up enjoying it, now we take our grandchildren. Our most recent trip was with 3 of our granddaughters, they loved watching the sea lions following us!"], ["Reviewed June 23, 2017", 4.0, "Good experience", "My husband was in a conference and my son and I were on our own. We walked to Balboa Island and took the ferry to Balboa Peninsula. We enjoyed the ferry ride and the walk on Peninsula."], ["Reviewed June 22, 2017", 5.0, "Cheapest Boat Ride Ever!", "We took the ferry as pedestrians and it only cost us $1 per person! If you are taking a car, it is $3 (2 passengers). It is a quick, low cost and efficient way to get from one side of the bay, to the other."], ["Reviewed June 22, 2017", 5.0, "Rite of passage", "Great three car plus passenger service. Friendly and professional. Both my grandfather and my dad piloted them back in the day."], ["Reviewed June 21, 2017", 5.0, "So much fun!", "Whenever we visit Newport Beach we take the car ferry to Balboa Island. It is so entertaining and cheap. You drive your car onto the ferry and it takes you across. You can get out of your car and sit on the side. It is a great time to take pictures. The ferry runs continuously so there is never a really long wait. My family loves it and even though my kids are older now they are still entertained by the ferry.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Convenient cheap ride!", "One of the ways to get to balboa island, you can go by your car or as a pedestrian.\nThe boat leaves every couple of minutes, it can and hold 3 cars.\nThe staff are super nice, the fare is $1 for pedestrians and $3 for a car with 2 people.\nShow less"], ["Reviewed June 19, 2017", 4.0, "Quick and painless", "Was it luck? Maybe. We pulled up to the ferry, they waved our car on and within one minute we were crossing. My kiddos enjoyed the ride and I enjoyed cutting quite a bit of time off the drive. Balboa island is pretty cute :) and boasts the worlds \"first chocolate covered banana\"\nShow less"], ["Reviewed June 17, 2017", 5.0, "The kids loved taking our SUV across to Balboa Island!", "It's a short trip but so neat for the kids to travel from the Fun center over to the island. A must do for the area!"], ["Reviewed June 14, 2017", 5.0, "Easy and on time.", "Well run very friendly fun operation. Very short ride and safe. Super convenient and unique. Passengers can ride to over to Balboa are Newport Beach."], ["Reviewed June 13, 2017", 5.0, "Must ride....car bike or walk on", "Cheap 5 minute ride between Island and fun zone. Great homes to walk by on Island. If lucky enough to be there on halloween thousand go and they give Huge candy bars not bites. Fun Zone has a range of restaurants and rides for the kids. A must see...\nShow less"], ["Reviewed June 13, 2017", 5.0, "Always Fun", "Its always fun, to ride the Balboa Island Ferry, whether you are on foot, bike, or car. The employees are always friendly and kind . Its a longstanding service and if you are in the area, take a short ride across !!"], ["Reviewed June 11, 2017", 5.0, "Simple, quickest way to Balboa Island", "Rode bikes to Balboa from Newport Pier and wanted to shop at the Island. This is the easiest most convenient way to hop over with your bicycle."], ["Reviewed June 7, 2017", 5.0, "Across the harbor.", "I and my wife took the ferry across the harbor on our way home. It is a fun way to get across and was a great way to end our vacation. It is fun, does not cost a lost of money and it feels like an amusement ride. Fun time. You should do when you are at Balboa Island.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Fantastico!", "Fast, very reasonable price and super friendly. Great service. Will certainly use again and highly recommend!"], ["Reviewed June 3, 2017", 5.0, "Go back in time for a moment.", "When the ferry is a part of your childhood, going back in time for a few minutes is good for the soul. I took an old friend who had never been and by luck, some Fleetwood Mac came on the radio - taking us back to our high school days on the Island. Perfect way to spend our afternoon. Going to the island, having late lunch and leaving. Just wonderful.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Cheap, easy", "Quick 2 minute trip across, easy on, easy off and $3 for our car with 2 people :). You pull up to a boat that leaves every couple minutes. Some people sit on the side (pedestrians) about 2 to 3 cars per ferry."], ["Reviewed June 2, 2017", 5.0, "Take the Ferry!", "Quick, fun and cheap way to get to Balboa Island! Small ferry ride with room for 3 cars, and bikes and pedestrians and even dogs! Well worth the $1 per person fee."], ["Reviewed June 1, 2017", 5.0, "why 5 stars for short ferry? Read on", "Be a part of Balboa history and ride the short way from Balboa Island to Newport Peninsula. It is a car ferry with loads of room for walkers and bikers. You get a wonderful view of the busy bay. Young children love it and can go to the fun zone on the peninsula side for more fun. Also this is a great way to get to the pier on the ocean side.\nShow less"], ["Reviewed May 30, 2017", 5.0, "A short ride across the harbor", "This Ferry Service has been there for ever it seems. Just a simple and continuous service across Newport harbor to Balboa Island. It gives you a cheap way to get out on the water for a different view of the area. Take your car, bike or just walk. It is worth it!\nShow less"], ["Reviewed May 28, 2017", 5.0, "Great experience!", "Kids loved the short 5 min ride on the ferry over to the balboa island and the fun zone! It's only $1 per adult, kids under 5 are free."], ["Reviewed May 25, 2017", 5.0, "So much fun", "The ferry is only $1 dollar and runs all day. It was so much fun to see and highly recommend it if you have never been to the area."], ["Reviewed May 24, 2017", 5.0, "Great", "The ferry is very inexpensive. Just $1 per person. It is a short crossing so they run all the time. If you miss a ferry, don't fret. there will be another one in just a couple minutes."], ["Reviewed May 23, 2017", 5.0, "Fun little adventure", "What a fun way to spend the day - a ferry ride and then venturing around the Island. And the fact that I am a desert-dweller made the ferry even more exciting for our group. The ferry itself is pretty slow moving and the cars are packed in, but the idea of taking your car over and being able to drive back was so cool to the kids. The cost was low and the \"worth it\" factor was high!\nShow less"], ["Reviewed May 22, 2017", 4.0, "A Short Trip that is worth it", "The Balboa Island Ferry has been around for at least 60 years shuttling people, bikes, and cars to and from Balboa island. It is inexpensive and highly efficient. The wait is worth it for a family adventure. Most kids will not forget driving onto a boat in the family car.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Great Deal", "Cost is $2 for car and driver. Walk on and pay $1. 2 minute ride to Balboa island. Ferry goes each direction every few minutes. Very nice."], ["Reviewed May 22, 2017", 5.0, "Wonderful trip", "We felt that the ferry ride gave us time to appreciate the view of Catalina island going and the California coast coming back. It is clean and comfortable. It was a good way to also see some of the beautiful homes,wildlife and boats along the canal.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Fun little rid", "This is a cool little trip across the water. and it's only a dollar for ppl and 2 bucks for a car. Great way to get back and fourth"], ["Reviewed May 18, 2017", 5.0, "So Cute and Fun!", "The Balboa Ferry is a lifesaver in the summer and really is convenient when you need to get across! Located on Balboa Island, it takes you across the water to the Balboa Fun Zone, where there is tons of entertainment for children and great restaurants! Grab a Corn Dog at the Fun Zone, or walk a couple of short blocks to any number of wonderful finds! Great Mex is seriously underrated as they have some of the most delicious delicious Mexican Food. You can also grab the Catalina Flyer from this location if you want to spend the day 27 miles across the sea!\nShow less"], ["Reviewed May 14, 2017", 4.0, "Great way to get to the island", "We took Uber from our hotel to Balboa where we took the ferry. It was quick and very easy. Ferry goes back and forth only taking a few minutes. You can walk or drive on."], ["Reviewed May 13, 2017", 5.0, "Fast and cheap.", "Whether you are on the peninsula or the island, this is a quick and easy way to cross the bay. It is only a dollar per person if you walk on. They can accommodate cars too, but depending on the time, you may have a long wait. Better to park on one side and just ferry back and across to see everything you want.\nShow less"], ["Reviewed May 9, 2017", 4.0, "Nice !", "It's nice to see ferry to ride ! 3 cars and some people, just couple minutes to ride cross water ! Very nice !"], ["Reviewed May 8, 2017", 5.0, "Ride on the ferry", "We wanted to take our friends on the famous ferry as part of the whole Newport Beach experience. It was really quiet so we didn't wait long, it's $5 for 4 people and a car. It only lasts 5 mins however its such fun! I would definitely recommend.\nShow less"], ["Reviewed May 8, 2017", 4.0, "Fun Short Hop", "This little ferry is fun for kids especially and gets you to a place where you can easily enjoy the quaintness of the island. Parking for the ferry can be difficult at popular times."], ["Reviewed May 6, 2017", 5.0, "A cheap way to get to Balboa Island", "As a pedestrian, it's a buck each way. The day we travelled, there were three ferries in operation, so no waiting around. Much better to park in Newport Beach and catch the ferry across"], ["Reviewed May 4, 2017", 5.0, "Awesome", "Super efficient and well run. The ferries come every few minutes so you don't have to wait. Great price. Friendly staff."], ["Reviewed May 3, 2017", 5.0, "Inexpensive, efficient and fun way to cross to Balboa Island", "Constantly running so there is no wait. Young friendly staff. Just a fun quick ride. 3 Car maximum with plenty of room for pedestrians."]]}}