{"Battleship USS Iowa BB-61": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Battleship USS Iowa BB-61", "url": "/Attraction_Review-g32655-d2440929-Reviews-Battleship_USS_Iowa_BB_61-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/14/2f/0e/battleship-uss-iowa-bb.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1386"}, "address": {"@type": "PostalAddress", "streetAddress": "250 S Harbor Blvd San Pedro", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90731-2830", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Battleship History", "Very good tour just to see how huge and powerful these vessels are had to pay a visit as my visit last year to Pearl Harbour and going on the USS Missouri BB-63 had me amazed at the size and capability these things have. Will be going down to San Diego next time as well to check out the one down there.\nCheers Brett from Hastings Point Australia.\nShow less"], ["Reviewed 2 days ago", 5.0, "liked", "My brother who served in the Korean War enjoyed it. Even with bad knees he managed all the stairs. He said it brought back many memories."], ["Reviewed 2 days ago", 5.0, "Battleship review", "I loved the intimacy of getting to know the ship on your own. The staff is also very friendly and fun to talk to. I’m grateful for the experience"], ["Reviewed 2 days ago", 3.0, "Great Ship", "The ship is of great historical significance but I was disappointed because the audio tour was unavailable that day."], ["Reviewed 2 days ago", 5.0, "USS Iowa Battleship", "We visited the USS Battleship Iowa on February 20, 2018. We were impressed with the warm welcome we received as veterans of the U.S. Air Force. They took our military information and announced our rank, name, and branch of service that we had entered the ship. All the volunteers were friendly and informative. The route to visit the ship is nicely laid out and easy to follow. Very informative, history tour of the ship.\nShow less"], ["Reviewed 2 days ago", 5.0, "Fantastic!", "Loved the Iowa and it’s historical significance and learning about battle ships and their workings. Will visit again!"], ["Reviewed 2 days ago", 5.0, "It gets better every time I visit", "I've been a Plank Owner and supporting member of the USS Iowa since it first arrived in San Pedro. I saw it in Richmond, CA when it looked like an old WWII ship. Over the years, the Iowa Team has transformed the ship into one of SoCal's premier museum sites. The hard work the volunteers have put in has resulted in a fantastic tribute to one of the greatest ships to ever fly the US Flag. And, it just keeps getting better. Every time I visit, there is something new to see.\nShow less"], ["Reviewed 2 days ago", 5.0, "Christmas gift first visit, followed by 2nd visit escorting visiting Brother-in-law", "My first visit was a gift from my eldest Daughter and her Son. I was so impressed with the knowledge and attention received by ships Docents that I decided to escort my Brother-in-law visiting from Iowa. He of course boarded free and being an Army veteran and lover of WWII history, was thrilled to see and feel the honor we fellow IOWANS have for saving this ship for posterity.\nShow less"], ["Reviewed 4 days ago", 5.0, "Great old lady", "Beautiful ship; illustrious history; we were a group of 22 and had a great guide. He was very knowledgeable and patient."], ["Reviewed 4 days ago", 3.0, "Fabulous for history buffs", "Besides the massive ship and the history surrounding it there are not actual activities except walking and climbing. My husband and adult son loved it for the history and their fascination with the munition and naval power and design. I enjoyed being able to see the inside and the living facilities.\n\nCan’t imagine how intimidated a young 18 year must have been if he left his small town and boarded the ship for the first time to go to war. Bless their souls for their sacrifices-every one of them.\n\nA word of caution : If you have any disabilities or are an older person with walking issues (knee, hip, etc ) this might not be the tour for you. There are almost totally vertical stairs with very small steps on every level that you have to climb up or down. You have to place your foot sideways and hang on to bars, ropes or chains. No outlet once you start as you are basically climbing up and down the ship as the sailors did.\n\nA very worthwhile couple of hours.\nShow less"], ["Reviewed 5 days ago", 4.0, "A nice find", "Had no idea the Iowa was hidden along the LA Waterfront. Glad we found it. My little one is a military history buff and my older one (who hates history) learned a thing or two too. Just walking on deck and seeing the size of the guns is amazing. Seeing how small the ship is compared to the cruise ships of today is also eye opening. Looking forward to going back if/when they can open up the inside of one of the turrets to the public. A must if you are a history buff.\nShow less"], ["Reviewed 5 days ago", 5.0, "The beautiful USS Iowa, I living piece of History.", "I had a great time visiting the USS Iowa. I'm a sucker for military history, as a military member myself, I enjoyed the whole tour. I got to meet a WW2 veteran, a great man from the greatest generation with amazing stories. The whole ship and knowledgeable guides to tell you about the ship's history and capabilities, as well as how the sailors lived. I plan on going again next time I'm in the area.\nShow less"], ["Reviewed 6 days ago", 5.0, "Fantastic ship", "What a pleasure walking the deck of the USS Iowa. A trip into history. Can't wait to come back. Plenty of information everywhere. Ship is in great shape."], ["Reviewed 6 days ago", 4.0, "Third time now. Getting better. Still room to improve", "My third trip there now. Better than the last two trips but still some room for improvement. A lot of things can be improved but I know that there are limitations that they can only do so much with 75 year old ship.\n\nStill not a lot of volunteers on board to answer your questions. We were there on a Monday. Saw just two guys that could answer questions for us. One of them was a bit too eager to show us pictures on his phone: Pictures of IOWA from Wikipedia. We did see a third guy in the Wardroom talking to guests. His story just went on and on and on. We came in after he had started, stayed ten minutes, and then left. No idea how long he talked but it sure took away a lot of your time to see other parts of the ship. Also we got trapped by two guys near the signal flag box. Instead of answering questions, they just started talking about flags and after a while we politely excused ourselves. Again, too long for one exhibit.\n\nThe little \"museum\" that has recently been built down near the gift shop is very good. Lots of history about USN and Iowa. Very good displays and video shows. You could almost spend as much time there as you did throughout the rest of the ship.\n\nMore exhibits have opened in the ship. Things like officer bunks, crew living spaces, mess deck, kitchen, etc. It sure would have been nice to have a tour guy in some of these rooms to talk about what's up.\n\nThe free download for your phone was just OK. It worked most of the time and gave you some information. Still would have been better to talk to a real person.\n\nOverall a very good trip. Shop on-line for tickets. They often have discount tickets (a few dollars off, buy one get one free, etc.). I'll come back again in a year or so. Always having friends in town that want to see a battleship.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Experience", "For those who like history is a excellent option and very cheaper. All staff is very friendly and explain everything about the history of the ship that is super conserved."], ["Reviewed 1 week ago", 5.0, "Iowa Visit", "Very interesting. Docents were knowledgeable and enthusiastic. Great self guided tour. Ticket booth was very helpful in assisting us find our tickets in their email. Ship is well maintained."], ["Reviewed 1 week ago", 5.0, "Thank You 2018", "Thank you for all the efforts to save the ship from the mothball fleet in Suisun Bay and the continued efforts to maintain the ship for the public to see it. This was my second visit to the ship and the docents were very knowledgeable and helpful on sharing information of the history of the ship. It is amazing to think how 2700 sailors could all work together on this ship (and quickly go up & down those steps!). My curiosity yearns for more access to more areas of the ship. I will be visiting again.\nShow less"], ["Reviewed 1 week ago", 5.0, "William Burford", "We had wonderful tome. we were there for the Black History Month program. It was very enlightining, We learned a lot"], ["Reviewed 1 week ago", 5.0, "Great historic place", "Nice option to those who love wars history and warfare in general. It also has options to have fun for young children. Prices are afordable and gift shop is plenty of options."], ["Reviewed 1 week ago", 5.0, "USS Iowa", "Anyone who has any interest in U.S. history should take the opportunity to visit this magnificant ship. The displays onboard give you a fantastic look at the U.S. Navy and shipboard life from before WWII to the time the Iowa was retired. Simply outstanding!"], ["Reviewed 1 week ago", 5.0, "VADM Gravely Event. Spectacular night!", "Your VADM Gravely Event was nothing short of spectacular. Honoring MGEN Gravett was outstanding. I sat next to CAPT George Thompson, USN (Ret.), who knew and served with VADM Gravely."], ["Reviewed 1 week ago", 5.0, "Fantastic", "This visit made me aware of the dedication, hard work, skills, and heroism and of the navy personnel who served aboard the Iowa."], ["Reviewed 1 week ago", 5.0, "The time flew", "We went here intending to spend about an hour or so exploring the museum. We were here 4 hours! I didn't feel the time passing. It was all so interesting, and the self guided tour had a nice mix of signs and videos sprinkled throughout, along with live volunteers waiting to share anecdotes of the war. Wonderful, wonderful attraction.\nShow less"], ["Reviewed 1 week ago", 4.0, "Battle ship tour", "I served as a EM 2 on a destroyer. So it was interesting to your this much bigger ship. My work was below decks so would rather have seen the engine and boiler rooms."], ["Reviewed 1 week ago", 5.0, "navy hero", "my wife and I had a great day visiting with shipmates, the past and the enjoyable stories of days gone by and the history of a great war lady standing tall for our country,"], ["Reviewed 1 week ago", 5.0, "Excellent event", "I attended the event honoring MG Peter Gravett. All was well done. Volunteers helpful and well informed. Thank you."], ["Reviewed 1 week ago", 5.0, "Amazing history", "This was one of the best museum visits I have ever had. I would recommend this to anyone interested in any sort of military history. Amazing and knowledgeable volunteers were there to answer any questions and explain how things worked. Great experience."], ["Reviewed 1 week ago", 5.0, "Battleship Boy Scouts", "Don was terrific at showing the Iowa to our Scout Troop. So interesting to show Scouts history from WWII to Desert Storm. A good combination of exhibits, talking and walking keeps the attention spans focused. I would highly recommend this tour for any Cub Scout or Boy Scout Troop.\nShow less"], ["Reviewed 1 week ago", 5.0, "Awards presentation Ceremony", "The USS Iowa was the perfect venue for an important award ceremony honoring a high ranking military officer for his service to the country, state and the community. The staff organized the event and they were responsive to everyone’s request. Great support."], ["Reviewed 1 week ago", 5.0, "Great experience!", "We had a great experience in the battleship. The staff was helpful, courteous, and knowledgeable. Everything about the experience was great. Will go again!"], ["Reviewed 1 week ago", 5.0, "Glad we went", "Good opportunity to see and feel naval history. Worth the fees and time. A must see while in the area."], ["Reviewed 1 week ago", 3.0, "First time", "I wss expecting more for the money i paid. They guides were very knowledgeable and friendly. The boat was boring and not very accessible."], ["Reviewed 1 week ago", 5.0, "LA Gem", "I recently visited the USS Iowa with my 12-year old son. We took the basic, self-guided tour and spent a little over two hours walking through the battleship. Both my son and I found the ship very interesting. A highlight was meeting two WWII U.S. Navy veterans who showed us pictures and told stories of their time on battleships like the USS Iowa. We highly recommend visiting this battleship.\nShow less"], ["Reviewed 1 week ago", 5.0, "Battleship USS Iowa", "It's an exciting experience to see this giant battleship with tons of history. This ship is well kept through the efforts of the volunteers"], ["Reviewed 1 week ago", 5.0, "USS Iowa", "We really enjoyed our visit to the USS Iowa. The staff that was on hand to help inform us about various parts of the ship were very informative and friendly. We went away from the ship with a great deal of knowledge and respect for those that served on this ship.\nShow less"], ["Reviewed 1 week ago", 5.0, "Must see", "Went with husband and young daughter, very much enjoyed. All staff was very knowledgeable and friendly, willing to chat and give explanations whenever we asked questions. Also had a cute game for little kids to play which my daughter enjoyed finding clues for that."], ["Reviewed 1 week ago", 5.0, "A must see", "As a naval history buff and a resident of Iowa this is always a must-see for me. I get in for free for the unguided tour being a resident of Iowa but I would be more than happy to pay admittance to get in. This past weekend I took the guided tour called the Full Steam tour, it's only done on weekends and it's not cheap for the average person, $49.95, but I would be happy to have paid more for this tour. If you're not capable of climbing stairs and crawling through bulkheads with limited overhead clearance, it might not be for you but if you can do that it's a must do in my opinion. The two gentlemen that guided the tour were very knowledgeable, very friendly and made the tour very enjoyable.\nAnd if you take the tour, don't miss the gift shop on the on the way out, plenty of stuff that's priced reasonably and very cool. Rest assured the next time I'm in Long Beach I will be doing it again.\nShow less"], ["Reviewed 1 week ago", 5.0, "Well-run, lots to see", "There are plenty of people around to answer questions and provide information. The experience is great to learn about things specific to the battleship and to have lots of great photo opportunities. You can rush through or take at least a few hours to read the signs and take everything in.\n\nI would have bought the local \"passport\" option if I had known about it, but I had already gone to most of the San Pedro attractions lumped into the offer. As it is, you can find deals online; I think I got one from Goldstar.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Battleship history", "Interesting and educational. We did the self guided tour and they do a good job of directing you with arrows on the floor of the ship so that you see it all."], ["Reviewed 2 weeks ago", 5.0, "Fascinating & Very Educational", "We absolutely loved our trip here. It's amazing how well this battleship has been restored.\n\nThere are places where you can sit down and watch short documentaries about the ship's history, and there is plentiful information to read next to almost every artefact.\n\nMe and my boyfriend truly loved it. Such a unique experience & really gives you an appreciation of how hard it must have been to keep the ship operational.\n\nMy boyfriend is a mechanical engineer, and was thrilled with how much detail the tour had about the operational mechanisms of the tactical weapons.\n\nIt would have been such a shame to leave this ship to ruin. What a fantastic job the community has done.\n\nPlease be advised that this tour is not wheelchair accessible.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Piece of history", "This was on my friend's list of things to see but I enjoyed it as well. They did an excellent job of restoring the ship and it was wonderful to see that it didn't just rot away. We have been on many battleships and other ships and this one was organized better than the others. The self guided tour was easy to follow so that you were able to get a good sense of the ship and the many men who manned her. Definitely recommended\nShow less"], ["Reviewed 3 weeks ago", 4.0, "History afloat", "We arrived before they opened and were able to take it the Iowa from the dock from several vantage points. We bought our tickets online, so the check in process was painless. We skipped through photo op and went on board.\n\nWe tried using their app without success. The volunteers on hand did a great job answering questions and relating facts and tidbits about life on board. Kudos to the volunteers as they made our tour!!!\n\nThis is great for all ages. There are steps and some steep ladders to go up and down. Wear comfortable walking shoes.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great self-guided tour of amazing warship", "I kept on saying to myself: I cant believe it. From the size, weight and throw-distance of the shells to the small cramped quarters. Helpful volunteers man key locations along the way and are full of vignettes and factoids making it all the more interesting. If you're a vet or have one in the family, make sure to visit. If you have kids learning about WWII and Korea, make sure to visit.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "WWII Vets are treated to special ceremony", "Warships of yesteryear are fascinating, and we'd seen this one several times when we left on Princess Cruises out of San Pedro. We made it part of our itinerary on our most recent trip and brought along my grandfather, a WWII veteran.\n\nLittle did we know there is a special ceremony for veterans. Most veterans are announced ship-wide over the pa system. For WWII vets, they perform a special ceremony with sideboys lining the gangway, make a special announcement over the PA talking about all the action, rank, and everything associated with the veteran. My grandpa was quite happy to take part in the ceremony.\n\nWe loved the self tour of the ship, but it can be a little challenging for those with limited mobility as there are a lot of up and down ladder climbing that are quite steep in some places. You get to visit many areas of the ship, including the bridge, captain's quarters, and mess hall.\n\nMy favorite part of the trip was listening to my grandpa recount stories from WWII, which is not something he opens up about much.\n\nMy daughter and I also took part in the simulator at the end of the tour for a little extra money. It was fun.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "EXCELLENT TOUR", "i served on the BB61 back in the 80's it was great to see her again. Excellent engineering, a must see for all military and history buffs."], ["Reviewed 3 weeks ago", 5.0, "Sailing in History", "What an experience to board the lead ship in the most powerful class of battleship our nation has ever built. All 890 feet is impressive. Whether going along topside or going down below, visitors get a real sense of what it is like living aboard a battleship.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Inspiring", "Located in LA harbor this battleship is a part of history not to be missed. It is an excellent tour at a reasonable price. Overall, it is a beautiful ship with many missile launchers, grand artillary, captains quarters, and beautiful views from the ship. We walked around all the accessible areas of the ship including various rooms and saw many guns and missile launchers. Many of the displays were informative and provided a history of the ship. The volunteers located along the route of the tour are extremely helpful and in many cases speak from first-hand experience. To be on a battleship that fought for our country so many times and still looks powerful is amazing. Touring the ship kept our interest the whole time. Enjoy your visit, and keep in mind what you pay in admission is going toward to improving and maintaining the ship for the future.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Impressive self guided tour of WWII Battleship", "This battleship was one of four “Iowa” class battleships that saw action in WWII, Korean and Cold Wars. While you don’t go below the waterline, you get to experience FDR’s stateroom, command center, bridge, mess halls, sailors quarters, turrets and more. There is a great app you can download to give you more information and interesting facts about what you’re seeing on your self guided tour. The docents are amazing. So much information and stories to tell. Ask questions/act interested and they will share but if you want to be left alone, they do that as well. We spent about 1 1/2 hours touring. We went on a Tuesday morning at 10:30 and felt like we were alone on the ship most of the time. There were a couple of school groups but they didn’t cause any concern. The ship is open every day (except Thanksgiving and Christmas) from 10 to 5 pm with the last admission at 4 pm. Due to the financial support the museum receives from the State of Iowa, we got in free. A nice perk but we still feel it’s worth the admission and the contribution to preserving history (we gave a donation in lieu of our free admission). Adults (12-61) $19.95/$17.95 online, children 6 to 11: $11.95/$9.95 online, seniors 62+: $16.95/$14.95 online. Under five are free but still require a ticket. Parking is $2 for the first 1 hour 59 minutes, then $2 an hour after that. There are ladders that go up and down as well as the need to step over 8 inch door heights. I found on the steep downhill ladders that if I just turned around and went down backwards it was easier for me. Our 6’3” son had to watch his head from time to time.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Interesting Stay!", "My husband and I participated in a sleepover event on the Iowa during Veteran's Day weekend. Very unique experience. Interesting and fun, but also very uncomfortable. We were grateful to have experienced what life aboard a battleship is/was like, but were also very grateful for our spacious bedroom and soft bed when we went home!\n\nAs far just visiting the ship itself, I found it really fascinating. It's a great opportunity to get an up close and in depth look at these engineering beasts!\nShow less"], ["Reviewed January 23, 2018", 2.0, "Impressive but beware of closures for special events", "My son and I travelled to the Iowa during a recent visit to LA, hoping to spend a few hours on the ship. When we arrived at lunchtime they were about to close the ship to visitors ready for a special event that afternoon - we and a couple from Florida pleaded to be allowed onboard as we were all visitors from some distance away. It was a firm no and then as I walked away the Florida couple were allowed on! I was really not impressed with this but didn't see any point in arguing with the staff at the entry booth.\nAs an alternative we visited the nearby LA Maritime Museum...\nShow less"], ["Reviewed January 22, 2018", 5.0, "USS IOWA an excellent museum for WW2 buffs.", "The USS IOWA is an excellent WW2 museum for nautical buffs. Large parts of it are open to the public which gives a real insight to its workings. Along with the dedicated and knowledgable volunteers stationed along the self guided tour route, if you are in to this type of thing there will be no complaints at all.\nShow less"], ["Reviewed January 21, 2018", 5.0, "A massive relic of WWII!", "This is one of the few remaining intact Battleships left from WWII, but still active into the 1970s. The self guided tour from top to bottom takes you through all aspects of the ships functions as a war machine, and wittness to history."], ["Reviewed January 15, 2018", 5.0, "Big Guns Blazing", "This is a great floating museum and a fantastic bit of WWll history. This is one of four \"Iowa\" class battleships and they have done a magnificent job restoring her to her former glory. Benn twice and going again real soon. The docents are really knowledgeable and have severed time aboard the Iowa.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Great way to experience history", "I really enjoyed this historical ship so much I became a volunteer. Be aware there is some high stepping (raising your foot up and over 8 inch doorways and going up and down ladders). Well worth it if you can do that."], ["Reviewed January 11, 2018", 5.0, "A walk through history", "I truly enjoyed my self-guided tour through the battleship. It was interesting finding out about life aboard and the tragedy that occurred in 1989. This ship has a rich military history and was supposed to be the ship on which the surrender of Japan was signed, but the USS Missouri won out because Harry Truman was from there. There are a lot of stairs to climb, so put on some good shoes.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Great part of our country's history", "The USS Iowa was involved in so much of our country's Naval history. My father and I toured the Iowa during some down time waiting for a red-eye flight. I'm so glad we did. It's a self-guided tour by following the yellow arrows on the deck. There are numerous staff wandering around the ship with great information and background on the history of the ship. The tour is well set up and has the option of using an app to tell you things as you make your way through. We took our time and rested on the deck overlooking the water. It was a great experience, so glad we did this!! Also, you can save a couple of dollars per person by buying the tickets online, ahead of time.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Wonderful self guided tour.", "My family toured the USS Iowa while we were in town for the Rose Bowl and we had a great time. My three young boys especially loved learning about Vicky and her time on the USS Iowa. Thanks for all the hard work your crew puts into making this tour well worth the visit.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Living History!", "My 11 year-old son and I visited the USS Iowa recently and had a wonderful experience. You don't get to go below decks, but you have extensive access to everything else, including the battle bridge where the fleet admiral stood in WW II, and FDR's personal stateroom custom-fitted for his needs. There's a great gift shop to top it off.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Awesome tour", "Nice n awesome family experience, very informative, fully self guided experience....fun filled 3 hrs tour,we enjoyed fully"], ["Reviewed January 8, 2018", 5.0, "USS Iowa Visit", "The staff couldn't have been more accommodating and friendly. The self guided tour on our iphones was so easy and amazing! We had an Army Veteran with us and he was treated with great respect. The 18 year old with us is a WWII enthusiast and was totally impressed with everything.\n\nThank you!!\nShow less"], ["Reviewed January 8, 2018", 5.0, "A Marvel!", "It's amazing the magnitude of how big this ship is and the engineering behind it for it's time. Definitely worth the experience!"], ["Reviewed January 8, 2018", 4.0, "Christmas Boat Parade", "We took our 4 grandchildren to the Iowa to watch the Christmas boat parade in San Pedro. Wonderful venue although more chairs and access to more of the harborside of the ship would have allowed the large crowd to have more comfort and better sight lines.\nShow less"], ["Reviewed January 8, 2018", 5.0, "An Impactful Day", "We went to the Iowa in celebration of my dad's 95th birthday...he didn't serve on it, he helped build it in the Brooklyn Navy Yard many years ago. Surrounded by his children and grandchildren, he climbed throughout the many levels of the ship with our amazing and knowledgeable guide. Beyond being informative, education and inspiring it did something near impossible--he said it \"made him feel young again\". Bring your family. Learn how this ship contributed to transporting, battles and peace. And hope that we never have to go to war again.\nShow less"], ["Reviewed January 8, 2018", 5.0, "WONDERFUL", "I took my husband for his birthday & we had a fantastic day. We took the tour of the engine room and he has so much fun that he is considering becoming a voulnteer."], ["Reviewed January 8, 2018", 5.0, "AMazing for kids and adults", "Took both my boys (ages 10 and 12) and they both had an amazing time as did I. You can spend as little as an hour but we took our time and spent 3 hrs. They have an amazing app for the phone that you can listen to while you walk the ship and it is free. We bought the membership and visited the victory too on the same day, which is only 1 mile away from this ship.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Great tour!", "The Battleship is an overwhelming sight and the history shown there is so thrilling. Tottaly recomended for military history enthusiasts."], ["Reviewed January 8, 2018", 4.0, "Very impressive.", "We had an interesting visit on this ship. It reminds us of the heroic past that the ship and its screw has experienced."], ["Reviewed January 8, 2018", 5.0, "very cool", "loved the tour , have been on the self guided tour in the past and that was great but the guided tour was the best"], ["Reviewed January 8, 2018", 5.0, "First visit to USS Iowa", "Visiting a military ship has been the first time. A very instructive trip to the past. Recommended for all ages."], ["Reviewed January 8, 2018", 4.0, "Pre cruise visit", "Aside from the fact that the ladders were somewhat steep for the lady we were traveling with it was a very interesting tour. It felt very special to be on a vessel that was such a part of history."], ["Reviewed January 7, 2018", 5.0, "Family visit", "It was a great experience, educational and interesting. It was obvious how much the people who work there love their job."], ["Reviewed January 7, 2018", 3.0, "Good place for our 8 yr old grandsons", "Our grandsons liked the scavenger hunt, or finding Vicky. They have been to the USS Midway and liked it better only because there were more knobs and dials to work with. More touchable stuff would have been better. Loved the fact that there were not that many people on board, so you could take your time and really look at the guns and absorb the importance of this wartime vessel.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Full Steam Ahead Tour", "Excellent tour taking you to the aiming system for the big guns and into the engineering compartments of the ship. The tour ended in the Combat Engagement Center. Docent was a wealth of information and said that \"he likes to hear himself talk\". It was a great and informative tour.\nShow less"], ["Reviewed January 7, 2018", 5.0, "A fun experience", "Very well set up tour. Interesting and felt well worth the $. The volunteers all have amazing attitudes."], ["Reviewed January 7, 2018", 5.0, "Awesome", "The tour was spectacular, my three young children really enjoyed it. It was also very educational for them."], ["Reviewed January 7, 2018", 5.0, "Time for the Big Guns!", "If you like WWll and naval history this is a must see. There are four Iowa class battleships and this one has some amazing history. The docents do a fantastic job giving you so much of the Iowas past. This is a great place for families, and folks of all ages. I've been twice and still want to go again.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Educational", "The ship has a long history extending back to World War II. The self guided tour does a great job showing you the ship and teaching you about the history of the ship, it’s crew, and US naval history in general. The volunteers are knowledgeable and friendly and include navy veterans.\nShow less"], ["Reviewed January 7, 2018", 5.0, "The beauty and power was overwhelming. Understanding the historical underpinnings of this Battleship class of ship.", "The Power & Aesthetics of this Battleship and its class is a source of pride for all Americans and an eye-opening experience for anyone else"], ["Reviewed January 7, 2018", 5.0, "Perfect for the family", "We have visited the Iowa three times. Every time we go, we see something new. Highly recommend it for the entire family. It is a great piece of American history and tribute to our soldiers."], ["Reviewed January 7, 2018", 5.0, "Great day!!", "Staff were friendly and helpful. Ship was not overly large and well mapped out for tour on your own."], ["Reviewed January 7, 2018", 5.0, "A trip through History", "The tour of the Battleship Iowa was amazing. We had a blast and got our workout in climbing all over the ship. We appreciate the history and the blood, sweat, and tears shed on its decks. I would highly recommend this to everyone!"], ["Reviewed January 7, 2018", 4.0, "Very Good", "If you are a history buff and like WWII, this is a must. Great for children to get an idea of what life was like on a destroyer. Very enlightening and self guided."], ["Reviewed January 7, 2018", 5.0, "Never gets boring.", "This is probably the sixth time I've toured this floating museum and amazing piece of wartime naval history, and it never gets old. It was my girlfriend's first time on the tour, and she too was blown away (bad pun intended). The meetup with WWII veteran Dr. Howard Rogers (Electronics Technician 2nd Class, 1944-46) was especially worthwhile.\nShow less"], ["Reviewed January 5, 2018", 4.0, "A excellent attraction", "We drove down from LA to visit the USS Iowa and glad we did. It is a self paced tour, which gives you a great insight to the living conditions but also the power the ship had when it was operational. There is parking available for a small fee, and it took us about one and half hours to look around the ship.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Great Tour", "Very interesting self conducted tour of a great piece of US naval history. The ship has been lovingly restored and the attention to detail is spectacular."], ["Reviewed January 3, 2018", 5.0, "Ship Ahoy!", "Fantastic visit and different everytime we go. I have been here 3 times in the last 5 years and it is fun and informative. Relatives, especially my older generations enjoy and can remember back to the times that took place on this ship."], ["Reviewed January 3, 2018", 5.0, "Never knew this was here! Great for families and historians", "Historic huge battleship in Los Angeles Harbor. Still in the process of being renovated, but you can tour the decks, some of the guns, and inside. The ship was decked out just as it was when decomissioned in the 1980's, with cruise missile launchers and Gatling guns. The kids can do a scavenger hunt. Learn about President Roosevelt's trip to the Yalta Conference and other historic events the ship was involved. Easy to get to at the end of the 710 Freeway and you can save money if you combine your ticket with the Aquarium of the Pacific in Long Beach. Recommended for families with older kids, veterans, or any history buffs. Don't believe the reviews that say that 1.5 hours is enough, we stayed 3 hours, but could have stayed longer. There is an app you can download with explanations of the ship and historic events. I highly recommend you install it and use it.\nShow less"], ["Reviewed December 31, 2017", 5.0, "A true gem", "Wow, it’s only as you walk towards this epic battleship do you truly appreciate the authority and presence of this extraordinary vessel. I love ships, that I declare, but this says everything about American maritime expertise. Everything about the ship is impressive. Everyone will be impressed.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Good stop before cruise.", "Had a cruise leaving at 4 next door. Stopped and dropped bags around 10 with cruise ship and walked to the Iowa. Cool self guided tour. Appreciate what our service people do and did. Hard to fathom life on board. Show cruise ship docs and get half price admission.\nShow less"], ["Reviewed December 26, 2017", 5.0, "We spent the night", "We booked a tour and overnight for our scout troop and it was amazing! Our tour was after dark, once the museum closed. We were guided through the entire ship, stopping at several locations. We were fed in the mess hall (galley is the correct verbiage I think.) and got to sleep in the bunks. As an adult I spent a lot of time imagining what it must have been like as a sailor serving during the war. My grandfather served in both WW1 and 2 on a sub. My father, on a carrier during the Korean conflict. I thought of them as we made our way through the barber shop, the mess hall and the outside decks. This battleship is extra special because it carried President Roosevelt to meetings with Churchill and Stalin. If you have the opportunity to either visit for a traditional daytime tour or an overnight, this is well worth the time. The guides are amazing.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Great time", "I was there with my 12 year old son and we really enjoyed. It is a self guided tour throughout the battleship with lots of self explanatory things to see. Maybe not so interesting for women and girls, but for men definitely a recommendation."], ["Reviewed December 22, 2017", 5.0, "Puts you in the history of our nations wars", "Lots of access to many places on board and you don't really grasp the enormity of the ship until you are on board. Tough though for anyone who can't walk a lot, climb steep stairs (aka: ladders) and get around in tight spaces. Plan on a long visit. Plenty of places to eat in nearby San Pedro. Lots of parking. Think about going to the liberty ship as well right next door.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Gets better each trip", "Think of this as a living battleship, that allows one to experience history. I've been with a veteran and slept on board the boat with a cub scout troop having breakfast on deck the following morning. The trip is a moving one depending on your company. No book or film can adequately enable one to feel what being on board a battleship is like. You have to experience it for yourself.\n\nWear comfy shoes with non slip soles as you will be doing some walking. If you've dodgy knees take your time as there are some steps to climb up and down but you also can choose what you want to see.\n\nI recommend it for families and if you can swing a night sleeping on board you will have a hoot. The boat is different each time as it's in a constant state of renovation. Get to see the engine room if you can.\nShow less"], ["Reviewed December 20, 2017", 4.0, "Interesting.", "We enjoyed visiting this battleship and learning its rich history from wonderful volunteers. The ship is in great shape with great memorabilia. We spent a couple of hours exploring the lower and upper decks. I highly recommend touring this historic ship."], ["Reviewed December 20, 2017", 5.0, "Interesting look back at history", "A very interesting self-guided tour exploring one of the U.S. famous battleships. In addition to several short videos there are numerous photos and stories of those who served on the ship. There are a lot of stairs so limited mobility might be an issue."], ["Reviewed December 20, 2017", 4.0, "Visit Before Cruise", "My 7 year old son was super excited to visit the Iowa, in between our visit to Disneyland and boarding a cruise. We dropped our luggage at the cruise terminal then a quick 5 minute walk to the Iowa. With my wife and 4 year old daughter, we all really enjoyed the Iowa and each liked it for different reasons. I felt the tour was very well done, as you get to explore a lot of the ship on your own time. A few more stories or poster boards might enhance the visit, but at the same time, the time my son got to spend asking questions and listening to the ex-sailor (sorry, I'm not sure what his official title would be) was incredible. This sailor took the time to answer all the questions and tell stories, and in a way that the kids really appreciated.\nBy far the best part, at least for the kids and parents, was the hunt for VICKY, the ships dog! All around the ship there are posters of Vicky that the kids could hunt for, and were rewarded with a small but rewarding gift at the end. I can't remember what the gift was but I sure remember how excited they were every time the found a new Vicky. I think we ended up staying on the ship about 1.5 hours, though I imagine you could spend a lot more time if you wished.\nOnce we were done we walked back to the cruise terminal, checked in, and once on board, got to see an amazing view of the Iowa from our cabin.\nA real treat and we are very appreciative of all the work and effort everyone is doing to restore such an amazing ship! Thank you!\nShow less"], ["Reviewed December 20, 2017", 5.0, "Amazing restoration of an American Icon", "If you like WW2 history, or ships, you will love visiting the USS Iowa. You can visit many parts of the ship with a basic entrance fee - lots of interesting things to look at and shorts films to watch. We spent about 90 minutes and were moving pretty fast. The volunteers are helpful and courteous. Wish I would've had time for the engine room tour. If you love history, this is a must-see attraction when in LA\nShow less"], ["Reviewed December 18, 2017", 5.0, "A must for the History", "This is like a spiritual trip for history buffs. The ship is huge and you cant tell that till your crawling through it. It is confronting to see how sailors lived on the floating fortress. The kids loved the history and I got a kick out of it too.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Great ship, good tour.", "I went on the Full Steam Ahead tour. The tour takes about 2 hours. You go below decks and see places not part of the regular self guided tour. Engine room, CIC, sick bay. The guide was very knowledgeable and answered lots of my questions in great detail. I went on the self guided tour afterward.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Awesome", "Awesome tour of the USS Iowa. Great piece of history. Just amazing what our sailors went through to protect us. Did not get to see as much of ship as I’d liked as we visited during the week. Call or book ahead to get a more in depth tour. Definitely be back.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Great piece of history!", "USS Iowa is such an important piece of world history, it was a privilege to walk on the decks of a Battleship so steeped in tradition and history and played such an important role in multiple conflicts. It was fascinating to learn more of the history of the ship and speak with the knowledgeable ‘crew’. I also think the piping on board of servicemen and women was a very nice touch. No to mention it was just great to see some big guns!\nShow less"], ["Reviewed December 10, 2017", 5.0, "Great time with my father who is a World War 2 vet.", "My father who is a World War 2 vet enjoyed visiting the Iowa ship. We were able to talk about the war and his remembrance of that era in time. We spent 5 quality hours on the Iowa ship exploring and bonding. Thank you so much for allowing us to do that. The time was priceless.\nShow less"], ["Reviewed December 8, 2017", 4.0, "Battleship USS Iowa", "I took my son and his friend to visit the battleship a month ago and they really enjoyed it. But both are also very interested in military history. The curators are knowledgeable and eager to share special stories related to the ship (no spoilers here). The parking is easy and navigating your way through is pretty intuitive. If you are fan of history you'll enjoy this special attraction.\nShow less"], ["Reviewed December 8, 2017", 3.0, "It is a battleship with a super boring tour. Moving on.", "The Battleship USS Iowa is located in San Pedro. The harbor is nice. The area is awful and I did not feel safe as soon as the sun began to set.\nI took my grandson to see the ship. It was expensive and parking was outrageous. They have a tour you take and they do have some interesting information about the ship, but for the most part the tour guide seemed so bored and could not answer questions.\nGo somewhere else. Really.\nShow less"], ["Reviewed December 7, 2017", 4.0, "Worth visiting", "Great place to visit. Very interesting. The kids enjoyed every moment. Congratulations for everything!!"], ["Reviewed December 7, 2017", 5.0, "Back again", "6 years since I was here last and there is must more to see around even it is not finish. The entrance fee is the same so it is good and here is never crowed. all in all a nice trip again and good luck to the staff on USS IOWA as the do a great work\nShow less"], ["Reviewed December 7, 2017", 5.0, "Touch History", "I have seen many WWII war machines and, with the Iowa, I again wonder, \"How did they do it\"? Touching and seeing the history of this grand old boat was an incredible history. It isn't until you see the actual machine that you realize just how exposed our sailors were and come to appreciate their honor and bravery. The self-guided tour reveals the essential infrastructure and is a project under continuing development. This is a tour for youngsters and old Vets alike. Just a great glimpse into our past history. Can't recommend it enough.\nShow less"], ["Reviewed December 7, 2017", 4.0, "Fact and fun filled day", "The trip was informative and nice. Would have been better if more areas of the battleship were accessible."], ["Reviewed December 7, 2017", 5.0, "Full steam ahead tour", "Excellent tour given by several older veterans. Lots of ladders to climb so you must be somewhat nimble. Many interesting stories about life on the battleship and how all the engines work"], ["Reviewed December 7, 2017", 4.0, "USD Iowa", "We visited to watch a local event in the area. The battleship is a unique environment with lots of historical significance ranging back to World War II e. The staff were friendly and helpful. I would recommend this location for people who like history or military equipment. It is also well located if you are visiting other things along the coastline in the area. It is clearly a work in progress, as are portions of the ship that have yet to be refurbished. But it was enjoyed by everyone\nShow less"], ["Reviewed December 7, 2017", 4.0, "Very informative and getting better every year", "I have been a member since the opening, and enjoy touring a couple of times a year. As the visits, and funding, increase, they are able to do so much. This is a wonderful historical resource."], ["Reviewed December 7, 2017", 5.0, "Veterans Day", "It was an excellent experience. My kids and I love every minute we spent onboard the ship. Can’t wait to go back!"], ["Reviewed December 7, 2017", 4.0, "US Navy battleship", "Great self guided tour. Very informative plaques displayed. Props made you feel like you were part of the crew and the experience."], ["Reviewed December 7, 2017", 5.0, "Great Visit", "I took self-guided tour. The information available is excellent. There are video presentations along the tour. There were some people on hand to answer questions as well at various points in the tour. I enjoyed the experience. To improve the experience, I would suggest opening some areas in lower decks of the ship like engine room and munitions storage areas.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Worth a visit", "Always interesting to visit old warships that have been turned into museums, and this is no different. You get a good feel for what life was like aboard these ships as lived by the sailors who served on them. We had a very good visit, and we highly recommend this.\nShow less"], ["Reviewed December 7, 2017", 5.0, "USS Iowa (BB-61) Floating Museum", "As a former Navy Man (QM2), every time I've visited BB-61, it is a trip down memory lane. The docent/volunteers have done a fantastic job restoring the old battle wagon. The \"Big Stick\" is a glaring reminder of what made our country great."], ["Reviewed December 7, 2017", 5.0, "Great place to visit!", "This battleship is so neat to visit. Its very large and takes at least an hour or so to walk through and check out everything. There were veterans along the way to talk to who worked on the ship when it was active, so it was interesting to get first hand stories. A must see for any war buff!\nShow less"], ["Reviewed December 5, 2017", 5.0, "Self guided tour of USS Iowa", "The experience was great and my 11 year old grandson really enjoyed the ship, even though he was not educated on the Navy, let alone the military. I would visit other Navy Ships and Aircraft that have some significance to our history."], ["Reviewed December 4, 2017", 5.0, "Keith Waldie's Review.", "Well done. No complaints. Extremely interesting, customer oriented and very friendly. Keep up the good work."], ["Reviewed December 4, 2017", 4.0, "Great for kids over 5 years old and history buffs!", "We had a group of 6 adults & 3 boys over 5 y.o. We all found many things to enjoy and the volunteer guides are great. Recommend you use the app to buy your tickets and skip the line (easy/fast).\n\nWe started out using the self-guided audio app, but with such a large group - found we wanted to talk about different things and go indifferent directions. All exhibits are well documented, so was easier to read about them as we went. The kids had fun with the scavanger hunt (and kept them busy).\n\nPlan on 2+ hours and wear comfortable shoes. You will be climbing up and down very narrow ladder style steps! The ladies in our group had sandles on and we were fine - but if you need assitance pulling yourself up a steep ladder - you may want to pass on this attraction. NO WAY can you use a stroller or wheelchair and enjoy all the sights.\n\nHighly recommend as a family event with the above warnings (Kids >4 or 5 y.o., no strollers, no walkers, no wheelchairs, no high-heels, extremely overweight, etc.)\nShow less"], ["Reviewed December 3, 2017", 5.0, "Historical Battleship", "This attraction is a self-paced tour of a WW II battleship which saw service in conflicts after the World War. There are guided tours available if you wish but the self guide tour has knowledgeable personnel stationed along the self tour to answer question. The displays and videos along the tour are informative. If a veteran, your visit will be announced over the P.A. was you are on tour. The admission is reasonable, parking is extra depending on length of stay.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Very fun", "Its very fun for those who have not gone on board one of these gaint beast of the seas . you will see how big the rounds that can be shot from there a distance of 21 miles . If your really lucky on Cruise ship day you will see just how big those cruise ships are .\nShow less"], ["Reviewed December 1, 2017", 5.0, "Battleship Iowa docked in San Pedro, CA", "Brought my dad (he’s 80) on a tour as a surprise. He’s a former Navy guy and had an amazing time! I liked it too."], ["Reviewed November 30, 2017", 5.0, "Battleship Bonanza.", "Very reasonably priced self tour that allowed access to much of the ship. Displays and stewards on-board were very informative. We spent 3 hours on-board and it could have been longer except we were getting hungry!!!"], ["Reviewed November 30, 2017", 5.0, "Wonderful to experience this great piece of American history", "I had a wonderful time touring this ship. It is a great value for the money. The staff could not have been nicer and the tour was really interesting. It is fascinating to walk though this ship that served our country so long."], ["Reviewed November 30, 2017", 5.0, "The Greatest most well-rounded battlship", "The Iowa class were built for both escorting and firepower to counter all others. They accomplished both jobs excellently, and lasted till the late 1980s. They are the pride and soul of American-born naval lovers."], ["Reviewed November 30, 2017", 5.0, "A museum that makes you go \"WOW\"", "There's not many museums out there that give you a \"WOW\" factor like the Iowa. The ability to walk around the ship, touch the foot+ thick steel, and look all around you and see an amazing and powerful weapon built do defend America and her interests - it's a great experience for kids and adults alike.\n\nThe kids will mostly enjoy just walking about and taking in the size and power of the ship, and more mature audiences will enjoy the wealth of information provided about the ship, her combat capabilities, and significant historical events that she was part of.\n\nThe staff were kind, and even without asking anything they approached my younger brother and I with a smile and explained the significance of her tasks, what made her special, and why she was important throughout the wars she participated in.\n\nThe exhibits usually consist of information plaques around significant places of the ship, such as the bridge citadel, turrets, secondary armaments, missile launchers, etc. There are several informative videos along the way explaining in detail the mechanical functions of the ship (such as how the guns are loaded and fired).\n\nIf you walk through and look at everything in detail, expect a 1-2 hour experience. If you watch the videos and read all the plaques, you're probably looking at a 4 hour experience at most.\n\nIt's worth noting a fair amount of the ship is outdoors, so choosing good weather might be in your interest.\n\nIt's certainly a museum worth visiting, it's one of only 4 Iowa-class battleships, and not many people alive can claim to have walked upon a vessel as powerful as she is!\n\nThe ladders take some getting used to, so be cautious with them around kids. When going down, have the adult go down first and the kid follow behind. When going up, have the kid go up first and you behind. Face the ladder and use the handlebars/cables! They're pretty steep.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Awesome family excursion!", "My 11 year-old daughter has been wanting to go. So we went when my sister visited with her family. Went also with a 3 and 5 year-old. There was something for everybody, very fun. A wonderful piece of history that every American should visit."], ["Reviewed November 30, 2017", 4.0, "Iowa Review", "Had a great time visiting the Iowa Battleship. The Room were very clean and organize. The Staff there were nice and friendly. I liked looking at the Front Cannons in the front of the ship. I disliked the museum at the end."], ["Reviewed November 30, 2017", 5.0, "Educational and Fascinating", "We learned a lot about the history of this ship and how officers and enlisted sailors lived. Since this was a flagship we saw the admiral's as well as President Wilson's quarters (a bathtub was installed for him). It was a real treat to have veterans of the ship (in their nineties) present to talk to in the officers' mess hall. We spent a good three hours there; it was great to go at our own pace. If you have a disability the steep stairs may be a problem.\nShow less"], ["Reviewed November 30, 2017", 5.0, "USS Iowa BB-61 is History at its Finest!", "Visiting the USS Iowa on Veterans Day (11/11/2017) was a very exciting and fun experience. My wife and I decided to attend the festivities held at the Iowa’s dock and then spend the rest of the day doing the self-guided tour. Just seeing the immense outline of the Battleship as we approached pier was just as humbling as when we visited the Iowa’s sister ship the USS Missouri, BB-63 and the USS Arizona Memorial in Honolulu, Hawaii years earlier. We purchased our tour pass online and printed out our boarding pass before heading to the USS Iowa, which saved us time waiting in a long-long-line of people who were trying to purchase their boarding pass. I highly recommend you purchased your boarding pass before visiting the Iowa, it also saves you a few buck per pass.\n\nSeeing the Gadsden flag as the First Navy Jack waving on the bow of the USS Iowa is visually interesting and prideful. Since 9/11/2001, the Gadsden flag – Navy Jack has flown on the bow of every active and selected decommissioned US Naval Warships.\n\nThe self-guided tour is about 2 hours long. Each section of the ship you pass through is well documented and visually interesting. You can almost feel the presence of those sailors and officers who manned the USS Iowa in past years. Although the USS Iowa last configuration was with modern weapons, the sheer size of the 16” and 5” turrets and displayed shells still on board is awesome. Walking through the crew and officer quarters, armory, and galley, and the command control deck is fascinating.\n\nWhen we last visited the USS Missouri in Honolulu, Hawaii, we did the VIP tour, which is over 4 hours long. It takes you to areas of the ship that the self-guided tour does not. The next time we visit the USS Iowa, we plan on doing the VIP tour.\n\nWe highly encourage everyone to pass the word to all of your relatives and friends to visit the USS Iowa. It is a testament to the quality and strength of what the United States ship building industry is, and the strength of United States Navy protecting our Great Nation. To think, that the USS Iowa and the USS Missouri sailed into Tokyo Bay and presented the symbol of power of the United States when WWII ended with the Japanese formal capitulation!\nShow less"], ["Reviewed November 30, 2017", 5.0, "Battleship USS Iowa BB-61", "We took the engine room and below decks tour and was well worth the time and price. Excellent tour guides and volunteers that are very knowledgeable about the ship."], ["Reviewed November 30, 2017", 5.0, "A must see", "I have to say must see the employees they help out a lot they where closing the ship down early due to concert and let me an other group in as we all both from out of town and would not be back."], ["Reviewed November 30, 2017", 5.0, "awesome experience!", "our family had a such a great time exploring this WW2-era battleship... even my 9-year old daughter who had no prior interest started watching youtube videos about these might ships after the tour."], ["Reviewed November 30, 2017", 3.0, "Great experience but the App did not work", "Been wanting to see the USS Iowa with my son who is 8 for a couple years now and finally made the drive to do so. The ship itself is well worth the drive and the entry fee but I was disappointed that the App for the tour did not work. I even asked one of the staff for help and he could not figure out why it wasn't working. I had a friend tell me the App didn't work when he went either. Still great to be walking around on and through a battleship but I can only feel that a lot of information was missed due to the App not working. The purchase of food would have been nice too since it is remote with no food establishments around. We arrived at 1:00 due to traffic and completed the walk thru by 3:00 and we were hungry.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Fantastic Museum Ship", "My friend and I visited the ship during the Veterans Day event. The ship is being fully restored beautifully. What a fantastic tour! The displays are well presented and the displays are top notch. I heartily recommend visiting the USS Iowa."], ["Reviewed November 30, 2017", 5.0, "A historically important vessel within reach!", "I managed to surprise my husband, a naval/history buff, with a visit to the Battleship USS Iowa. I also love history so both of us were in awe of the detail of restoration, the displays and videos that highlighted the various parts of the long history of the USS Iowa. It is so great that this important vessel is now open to us, the public, that we can get closer to the history we cannot afford to forget.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Engine room tour", "The tour was excellent. What an amazing piece of history. The tour guides were fantastic. Their knowledge of the vessel really added to the enjoyment of the tour."], ["Reviewed November 30, 2017", 5.0, "AWESOME, It is one of the best tours everyone should do while in Long Beach Ca!", "A must see! I took my my children and there spouses. They were fascinated with this ship as I was! 👍 V.LaForgia"], ["Reviewed November 30, 2017", 5.0, "Great experience with my 10 year old!", "My son loved the experience he had on the battleship. The staff was knowledgeable and friendly. Definitely will visit again."], ["Reviewed November 30, 2017", 5.0, "Awesome ship", "It is a place where history comes alive. I love the ship and the ww2 vet that was there. You get a good amount of info on the history of the ship."], ["Reviewed November 30, 2017", 5.0, "What a wonderful experience!", "Learning the history of this magnificent ship was such a fantastic experience. My husband and I felt such an intense sense of pride and patriotism that we will be taking our daughter, son-in-law, and grandkids next month to share the experience!\nI do have one request, though....our daughter is deaf, and although will will have a personal guide, she will not be able to hear the audio portion of the videos. Closed captioning is inexpensive and easy now, have you considered CCing your guided tour???\nShow less"], ["Reviewed November 30, 2017", 5.0, "IOWA Review", "Superb museum and making great progress towards a complete ship tour. While not as advanced as he USS MIDWAY Museum in San Diego, they are different historic events. OUTSTANDING!"], ["Reviewed November 30, 2017", 5.0, "Remembering the greatest generation", "Seeing the history of the ship and the experiences of those who served aboard fills me with awe. That was a different time, a hard time."], ["Reviewed November 30, 2017", 5.0, "Luc & I to the USS Iowa", "I took my 6 yr old grandson to see the great ship. I was impressed as was my gransdon. He could not waite to get back to school to tell his classmates about it. Highest accolades to those who volunteered their time to bring this great icon back into a wonderful memorial to those served on her and to those who lost their lives serving on her.\nShow less"], ["Reviewed November 29, 2017", 5.0, "Great Views of the Harbor & Wonderful Ship / Tour", "This is a must-see for history buffs and a great activity to do with friends and family. Ticket prices are reasonable and sometimes you can find a deal on Groupon. You can see the Presidential Stateroom onboard and explore the chow hall. You will be impressed by the massive size of its deck guns and there will be tons of places for fun pics and selfies!\nShow less"], ["Reviewed November 29, 2017", 5.0, "Excellent & beautifully retored", "This is a must-see; it's definitely worth braving the LA traffic to enjoy this wonderful museum. The ship has been rescued from deterioration, restored and staffed by volunteers. The exhibits inside the ship are well put together and modern, and the staffers are very friendly, helpful and knowledgable. The ship was especially interesting to me as I've also seen the USS Missouri, one of her four sisters.\nAs a bonus, you will get to see the container ships arriving at Terminal Island in the Port of Los Angeles, right across the channel from the USS Iowa.\nShow less"], ["Reviewed November 29, 2017", 3.0, "If its your first one , ok", "Big battleship . A lot of history behind . Not much to see inside . Its more a curiosity . I wouldn't recommended it unless you've seen everything else in LA"], ["Reviewed November 28, 2017", 4.0, "Living History", "A chance to see living US History. The ship is inspriring and gives a real chance to see and touch Naval history. I love this and the USS New Jersey."], ["Reviewed November 22, 2017", 5.0, "Awesome Tour!", "This was an awesome experience! Very informative and helpful tour guides. Such an unique experience, highly recommend! FYI - there are alot of narrow and steep ladders/stairs to climb, might not be good for older people. Also, young children could easily get bored, this self guided tour is geared more for young adults/adults.\nShow less"], ["Reviewed November 16, 2017", 3.0, "Not Sure Target Audience", "This seemed too light for adults, especially military buffs, yet also not geared toward kids. It’s current state of rehabilitation is an awkward mix."], ["Reviewed November 14, 2017", 5.0, "freedom fighters", "we are in love with this place unique experience history in every counter ,please don't think twice THIS battleship is the only in the navy visit for more than one president."], ["Reviewed November 11, 2017", 4.0, "A fun afternoon", "Had a great afternoon exploring the USS Iowa on the self guided tour. There is an abundance of information to read, military vets to talk to and explain information to you which also provides a great atmosphere. You get to walk thru alomost the whole ship on the self guided tour. There are a few steep ladders to climb, but this is still easily done by all ages and fitness levels.\nShow less"], ["Reviewed November 11, 2017", 5.0, "One of 4 ships in the Iowa Class", "Touring the ship we suddenly reaiized we had be here before. That is because it is in the same class as the Uss Missouri at Pearl Harbour.Still we enjoyed the ship and you should visit the ship to , well worth it."], ["Reviewed November 10, 2017", 5.0, "Great experience.", "Definitely a cardio workout. Enjoyed the experience. Recommend if you’ve always wondered what’s life like on a Carrier or Battleship. Learned a great deal from the volunteer who took us into the restricted areas."], ["Reviewed November 10, 2017", 5.0, "Unique visit", "This is a great way to spend half of a day, exploring a once vital part of the military, and seeing the ship"], ["Reviewed November 9, 2017", 5.0, "Welcome aboard the historic USS Iowa!", "The history on-board this WWII battleship is incredible, with military vet docents bringing the ship to life. The number of Presidents who have been on the ship and the number of critical battles reflect the importance of this ship in US history. Fascinating and moving!"], ["Reviewed November 5, 2017", 4.0, "Great experience for those interested in naval defence history", "This battleship has a lot of history and is well worth a visit for defence history buffs. Be aware however, it is not suitable for people with walking difficulties and definitely not wheelchair accessible.\n\nThe volunteers are very knowledgeable and helpful. Some areas are accessible for you to gain an understanding of the way of life aboard the ship, however many of the areas are only accessible by looking into a room\nShow less"], ["Reviewed November 3, 2017", 5.0, "See it!", "It's easy to get to and the parking is cheap. It's an important part of our history that should not be missed! Interestingly, right next door is a cruise terminal. Compare the cruise ships to this largest-ever battleship and it looks puny!"], ["Reviewed October 31, 2017", 5.0, "A very educational experience", "This piece of history let's you experience history as the sailors did back in the day. You visit the galley and the officers quarters as well as the crews quarters. You learn all about the battles and loss of crew members. You visit many of the deck compartments and the Bridge\nShow less"], ["Reviewed October 29, 2017", 5.0, "great thing to do", "Had a great time visiting the Iowa, found it very interesting and very user friendly even my wife enjoyed it. The guys on the ship were very helpful and friendly even the gift shop was good. Love the way the volunteers take a huge pride in her.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Great tour of history.", "My husband has a bucket list to visit all the battleships and carriers. He was in the navy for a few years back in the '60s. When we boarded they asked they asked about us and when they found out he had been in the navy they welcomed him aboard by announcing his service. In all our tours this is the only ship to do this. It meant so much to him. They have worked hard to preserve this ship. Fascinating experience that even I enjoyed. When you are in the LA area I suggest you take time to visit.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Really excellent, even my wife enjoyed it! It’s a must visit attraction in LA.", "We spent 2 hours exploring the ship and listening to the fascinating docents tell stories about the ship and its deployment - its really important historically and it comes alive through these stories. Guys are expected to enjoy battleships and I did, but my wife also loved it much to my surprise. Parking was only $2 and no line on a saturday either. Would also be excellent with children as long as they can handle steep stairs.\nShow less"], ["Reviewed October 28, 2017", 5.0, "USS Iowa tour", "Thought the tour was great. First time my husband and I where on an U.S. battleship. The tour helped both of us understand what the sailors went though during the Second World War."], ["Reviewed October 26, 2017", 5.0, "Everything you thought and more", "We went there a couple of months back and the tour starts with a video of the history of the USS Iowa. The pace continues and it is nice to be able to tour on your own and at your own pace. We are looking forward to going again and seeing things that we may have missed this time. It is a great opportunity to learn and experience history.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Blast from the Past", "This is a great representation of t a battle ship. It has a great history that you can enjoy on your own self paced tour. We also purchased the combo pack to visit the Queen Mary which made it a great savings. Both of these ships are close to the cruise ship terminals so a small taxi ride makes for a fun day or if you are lucky the USS Iowa will be only a short walk\nShow less"], ["Reviewed October 25, 2017", 5.0, "Pleasant Surprise", "An awesome trip back to the past. If you are or have been a member of the military, the ship's crew calls out your name and rank and any action you may have been involved with."], ["Reviewed October 25, 2017", 5.0, "Great experience!", "The staff was very friendly and super knowledgeable. The layout was great, everything was labeled and made it really easy to navigate through the ship. Which also allowed us to see everything"], ["Reviewed October 25, 2017", 4.0, "Tom's Review", "Iowa offers a great experience and the self guiding tour lets you move at your own pace to adsorb the atmosphere around. The only note I have is that it would be nice if there were more guides around the various exhibits to help you understand their importance to the ship. While the app does offer great information, computers can't answer your questions the way a human can.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Great Experience", "We love the history of the ship.\n\nwe love the volunteer retired soldiers attitude. we really respect what they did and what they are doing for our country.\nWe also appreciate that we have the chance to see this navy ship and understand more about our country.\nShow less"], ["Reviewed October 25, 2017", 5.0, "A Young Boy's Delight", "We were two grandma's with a seven year old and he loved it!!! The self-guided tour allowed him to interact with crew and become an enlisted sailor for several hours of enjoyment."], ["Reviewed October 23, 2017", 5.0, "Wonderful experience", "I worked in the defense business all my career so seeing a highly engineered weapon like the Iowa was a great experience for me, I found it fascinating to see history in front of my eyes. Well worth a visit."], ["Reviewed October 22, 2017", 5.0, "Military (naval) history", "Top attraction near San Pedro. You must be interested in ships and world war 2 history to enjoy this visit"], ["Reviewed October 22, 2017", 4.0, "Self guided tour with plenty of explanation plaques and people.", "We loved this tour on the ship. We could see and do everything on our own pace. The ship has lots of steep stairs and is therefor not so suitable for people with an mobility handicap like me...but I managed because we could make our own tempo and there were plenty of opportunities to sit and rest. We really enjoyed the very personal photo's an senior navy men showed us. He had great stories to tell ! The shop had nice items for everyone, from kid to collector. We missed some possibilities to sit and eat or drink some soda. The parkingprice was reasonable here as well\nShow less"], ["Reviewed October 20, 2017", 5.0, "Lower Comaprtment of shiop with lunch", "Had the guided tour thru the lower compartment of the ship - Excellent and informative - never felt rushed"], ["Reviewed October 19, 2017", 5.0, "Very exciting", "It is amazing to think that this ship was to so many places and fought to give us all here in the United States the freedom to live our lives without worry...My uncle, John Megliss was stationed on the USS Iowa. I just bought him a hat with \"scrambled eggs\" on it. He lives is Pennsylvania and will not be able to come to Calif. to actually visit this magnificent ship.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Fun For All Ages", "Visiting the Battleship USS Iowa was both an exciting and educational experience. The tour guides were helpful and friendly and made the visit unforgettable. I would go back and tour again since the ship is so big, I don't feel like you can take it all in during one visit.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Battleship School Visit", "This was a remarkable tour! Our students were absolutely impressed with their visit. Our tour guides were professional and very knowledgeable. The ship is huge! We highly recommend visiting this awesome ship!"], ["Reviewed October 19, 2017", 5.0, "A great afternoon", "Really enjoyed being on the old war horse,The ship is absolutely amazing and the history moving. Would like to see in the engine room. Maybe next time it will be open"], ["Reviewed October 19, 2017", 5.0, "Battleship USS Iowa", "Recommend a tour as all of the docents are extremely knowledgeable on the history of the ship, and the worlds political situation during battle and peace time. My father was a 1st class radioman on the hornet during WW2 and after the tour was over, the docent took us to the radio room which was NOT part of the tour and we got to speak to another person who was working to restore some of the equipment. The tour was fabulous!!! We are planning to go again!\nShow less"], ["Reviewed October 18, 2017", 5.0, "Great Ship", "I had wanted to see the Battleship for some time but had trouble convincing the family that it would be fun. I went on my own over the long weekend and was glad that I did. The people that take care of it do an excellent job keeping her up. I even found a charging spot for my Chevy Volt within easy walking distance of the museum.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Fun for the entire family", "Really interesting tour. We appreciated the fact there was a scavenger hunt throughout the ship that motivated the kids. I would highly recommend to anyone in the area."], ["Reviewed October 18, 2017", 5.0, "Would be good to have more decks open to tour", "A lot of ship is open, I have seen other WW Il ships with even more which would have made visit that much better."], ["Reviewed October 18, 2017", 5.0, "fun day", "The weaponry was an awesome sight. The boat itself was just the coolest thing. My brother served on the Albert David ."], ["Reviewed October 18, 2017", 4.0, "USS Iowa", "I am former Navy and I found the stories the crew told very interesting. the ship is in good shape as well"], ["Reviewed October 18, 2017", 5.0, "good review", "the tour was very good. the people were very helpful. the ideas on the ship were very good to see and touch."], ["Reviewed October 18, 2017", 4.0, "August 10, 2017 Visit", "I enjoyed the tour very much. There is a wealth of information provided, that is worth seeing. Unfortunately, the tour map provided, the self guided head sets, and the path followed through the ship were not coordinated very well and it was difficult at times to be in the right place. Do not waste your time our money on the flight simulation package available on the pier.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Great history", "We took our three boys to see this wonderful peace of our American history (ages 15, 11, and three). All 3 boys definitely enjoyed climbing in and out of the different gangways and stairwells and nooks and crannies but it was difficult keeping up with the three-year-old to make sure that he didn't go anywhere he wasn't supposed to so maybe not the easiest trip with children under 5. However even with those challenges we thoroughly enjoyed learning about this great piece of History and were amazed and how wonderfully restored and up kept this ship is\nShow less"], ["Reviewed October 18, 2017", 5.0, "Awesome!", "Great place to take the kids. I may have actually enjoyed it more than the kids. To stand on a living historical monument that was actually in the service of our great country was awe inspiring!"], ["Reviewed October 15, 2017", 5.0, "WW2 History Buffs Must Do", "I love history, especially WW2. We have been on a number of subs around the country and this was my first battleship. It was included in my Go LA pass, so it was worth the drive out to Long Beach to knock a few of those attractions down.\n\nThe ship is down by the docks, so it is a bit of madhouse to get down there. But there is plenty of parking, and it is easy to find with the signage. We went on a Saturday, so there were plenty of vets around telling you stories and such.\n\nYou board the boat and follow a tour from the front to the back, climbing up the different levels all of the way up to the conning tower. There are bits of history along the way with plenty of selfie opportunities should you be so inclined.\n\nI find all of this stuff very interesting. There was not as much signage as I have seen on similar kinds of exhibits, but that is not always a bad thing. It was a very interesting tour, and to see it from this perspective considering what I have seen in the movies like \"Under Siege\" or \"Navy Seals\".\n\nThey did offer an audio tour. This was the first time we had come across one where you download and app and listen as you walk versus them giving you headsets, or having buttons to push along the way. Not necessarily good or bad, just different than other WW2 exhibits.\n\nBecause of the location, if it were not in my Go LA Pass, I do not know that I would have made the trip out there to see it despite being a History buff. However, since it was included in my pass, that eliminated the excuses for me NOT to go out and take advantage making it a solid value.\nShow less"], ["Reviewed October 11, 2017", 4.0, "WORLD WAR 2 FLOATING HISTORY!", "Being able to view this floating history lesson about World War II was eye opening for me. I wasn't good with history in school, so visiting this Battleship put things into better prospective for me. Knowing that our country stood together, our men and women proudly serving so that we could be safe on our home ground, and giving our President a secure home, even though it was just temporary, gave me an incredible feeling. The USS IOWA is an experience that leaves a person with a lasting impression of how our country united during a horrible time in history. Don't miss this opportunity, as you have all the time you want to look about! Experience the huge cannons on deck and try to imagine what they sounded like. Shop the museum store. I was looking for a patch that was Army/Air Force before they were separated, and the young man in the store took time to look up the symbol and locate a patch that stood for both branches of the service during a time when my mother served as a nurse flying the wounded back from the battlefields. That was GREATLY appreciated, as most Americans don't know these 2 branches were one until after the war. Side note, if you take pictures on-board and purchase them, they tell you that you can download your pictures to view with family at home (supposed to be included with the price of the picture purchase). But they don't tell you that when you download them at home, you still have to purchase the picture/s from them. That's not cool. I have an issue with being misled.\nShow less"], ["Reviewed October 9, 2017", 4.0, "Must see.", "An amazing experience and great place to visit. Self pace guided tour and many areas to take pictures. Educational experience and would recommend to all families of all ages."], ["Reviewed October 6, 2017", 5.0, "Amazing Piece of History, A must See Museum Ship!", "If you are a military buff, naval buff, or interested in history, this is a must see if you are in the area! Make sure to give yourself a couple of hours to fully enjoy it at least. Amazing how much of the ship you get to see on this self guided tour! Lots of information to read and see about the amazing history of this ships and naval warfare in general. The ship is in great shape but does require some climbing of steep ladders so beware if you have physically issues that prevent you from doing such. Well worth the time and cost of admission. Also located across from the container terminal so it is cool to see the container ships sail by and all the action going on across the channel. Would visit again! 10/10 stars.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Camp Battleship", "Toured the ship, had dinner, and stayed overnight on the USS IOWA in a sailor's rack, then had breakfast.\nWe went as a group for a Boy Scout troop.\nThis was an amazing and memorable experience especially for the boys. There are very knowledgeable navy veteran volunteers and paid staff who share all they know about this powerful, iconic, American warship.\nEven if you cannot do an overnighter, take the tour its,well worth it to step onto the deck of history where so many sailors served.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Not just for Iowan's", "If you are from Iowa, it is free with identification. It is just amazing and huge. Next door is the Queen Elizabeth, too."], ["Reviewed October 1, 2017", 4.0, "Nice piece of history!", "This is a self guided tour, but there are staff around who are delighted to share information and the history of this battleship. Be aware there are quite a few ladders, but this is well worth it."], ["Reviewed September 29, 2017", 5.0, "A fantastic piece of history", "Missed the USS Iowa the last time we were in Long Beach -- We just did not know that it was there. So we made it a point to go see the USS Iowa this time. What a great attraction -- it is a must to see this great battleship. You ascend a gang plank and are welcomed aboard by a staff member. Once on board you can take as long as you want on a self guided tour (following arrows painted to lead you). There is plenty of helpful staff to answer your questions for you. This piece of history will not disappoint you.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Excellent, better than many nearby attractions", "This place is awesome, located at a pier at San Pedro and drive to there is scenic.\nThey were kind enough to let us inside as we reached Little after 4pm , cutoff time for last visitor.\nThe battleship is huge with many decks and you got to see the weaponry, cabins, pantry, galleys and various decks along with rich and proud history of the war this ship had fought.\nMust visit when in LA.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Really located near Long Beach", "This is about 40 mins from LA but worth the trip if you or your kids are interested in seeing a battleship. We were leaving for a cruise from San Pedro so had a chance to visit. Seeing the inside and the close quarters sailors endure is a reality check. And if I recall there is parking because of the cruise lines and the Iowa. If your are lucky you will see one of the cruise ships too.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Great History Tour!", "I have been here twice once with a friend and once with family. Both times have been a treat. The best part of the tour is speaking to the volunteers that either served on this specific boat or a similar battleship.\n\nTake the time and listen to their stories, you will find that the history is amazing and to get it first hand is a once in a life time experience. This isn't a guided tour so feel free to explore, but again, do take the time to chat our veterans up!\n\nThere is plenty of parking, it is not too expensive, they offer discounts and there are plenty of restaurants and other attractions near by. If you have nothing to do on a weekend afternoon swing by and you might learn something! Even better bring the kids.\n\nDon't forget to visit the gift shop, it does have some cool stuff.\nShow less"]]}}