{"Birch Aquarium at Scripps": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Birch Aquarium at Scripps", "url": "/Attraction_Review-g32578-d128465-Reviews-Birch_Aquarium_at_Scripps-La_Jolla_San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/23/2a/05/smile-fella-you-re-on.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1594"}, "address": {"@type": "PostalAddress", "streetAddress": "2300 Expedition Way Scripps Institute", "addressLocality": "La Jolla", "addressRegion": "California", "postalCode": "92037", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 4.0, "Nice little aquarium for little kids", "Nice place on the small side. Good if you want something for 11/2 to 2 hours with little kids. Not as big as the Monterey aquarium. But nicely done"], ["Reviewed 5 days ago", 1.0, "Waste of time", "This is an aquarium I would take my young children to, maybe. Older children, definately not. As far as going as a couple, it was a waste of time and money to seek out the aquarium."], ["Reviewed 6 days ago", 4.0, "Great for toddlers.", "We went here with a 2.5 year old and an eight month old. It was about the right size and mixture of hands on to 'looking at' stuff for him. The aquarium part was great, some lovely displays. I was also impressed with the kinetic sand, well more the topography overlay that even colour graded the sand too - pretty cool.\nShow less"], ["Reviewed 1 week ago", 4.0, "Seahorses are best", "The Birch Aquarium is great for families. There are plenty of hands on exhibits and it's not so big as to be overwhelming. We went on President's Day because Macy's offers half price admission during February. It was windy and chilly outside, but the tanks indoors were very informative. The seahorse tanks were especially great. You'll see all kinds of species you have never heard of before. There is also a small café outdoors if you get thirsty or hungry.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Family FieldTrip", "We visited the Aquarium on a trip to San Diego because our grandson is interested in marine animals. He absolutely loved the aquarium and learned a lot. We did too:). We also loved the ocean and coastline views. We did pick up a San Diego coupon book which had a coupon for lowering the admission but after the fact so check it out ahead of time, most hotels probably have it.\nShow less"], ["Reviewed 1 week ago", 4.0, "February is Macy's half-price Museum Month, including Birch Aquarium!", "Macy's is currently offering a Museum pass good for up to 4 half-price admissions to 45 participating museums and cultural attractions, including Birch Aquarium through February 28th. Take advantage of the savings now to enjoy all the Aquarium has to offer, including a great view of the bay. The colorful fish and seahorses are my favorite but I enjoyed seeing it all. They also provide an opportunity outside to touch some of the sea life, including starfish, anemones, etc. To save money on your admissions here and to 44 other attractions, just stop by Macy's and ask a sales associate for a Museum Pass and visit as many as you can by February 28th.\nShow less"], ["Reviewed 1 week ago", 4.0, "Birch Aquarium", "Birch is a wonderful aquarium!! We spent a wonderful couple of hours here looking at all the fish tanks. LOTS OF FISH!! Plus seahorses, and sharks and jellies, too. (no mammals). Free parking."], ["Reviewed 1 week ago", 3.0, "Great for kids", "My husband and I recently visited here as part of a package so it was quite inexpensive. It's a good thing, because we wouldn't have gotten our money's worth for full price.\nThe aquarium has a number of indoor tanks with a huge variety of creatures, many of which we had never seen. The sea horse exhibits are amazing. There is also a large exhibit outside with leopard sharks and a variety of rays.\nThe morning we were there it was quite busy mostly with families with small children. The aquarium has a number of interactive activities for small children related not just to sea life, but wind, ecology, etc.\nThis was fun, but we were pretty leisurely and were done in about an hour.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very impressed, great for kids", "I came here with my friend and her 3 kids (under 4 years old). The exhibits themselves were beautiful to see and I was impressed with the little walk way they have for the kids which lifts them up a little so they can see inside the ranks! They also had an exhibit gallery which was filled with various hands on interactive displays which allowed the kids to be kids while learning too. Then we made it outside... Between the touch tanks (which were fun for both kids and adults!) and then the kids play area (which had water activities for the kids to splash around in and learn, like the current boat races and the musical water fountain), we had an absolutely amazing time! Would go back in a heartbeat!\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautifully located aquarium you can get through quickly", "This aquarium is small enough to enjoy in an hour or two and not feel like you missed a thing. There is a wide variety of species. The parts my kids like most are all of the interactive exhibits like the touch pools and the plastic boats. Reasonably priced as well.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Aquarium spots!", "The 2 best spots in the entire aquarium are the 2 distinct views of the ocean from within and then above. There is a central seating area, with low lighting, and carpeted stairs to take in the view of the large tank, it’s a wall of water you can stare at forever with a large grouper dominating the scene (I think that’s then the type of super larger fish they have on display) it’s the largest one you won’t miss it! The swaying seaweed is also mesmerizing, I could sit and watch this scene for hours. Outside off their breathtaking balcony you can view the ocean from above, this is a great spot to take a photo!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "One of the best!", "Set in a beautiful location with ocean views this is one of the best Aquariums we have seen. Decided to buy the year pass that included four gust passes. Took visiting family members there and we all enjoyed several hours at the aquarium. Plan more visits before we return home. Very good value. The displays were really good, enjoyed watching the staff feed the sharks and the turtle.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best Show in Town", "Great for everyone, Young and old alike you'll see fish creatures and be able to hold and touch some of the sea crustations from the bottom of the sea.. several hands on exhibits, a sure delight for kids. A snack bar makes for a nice lunch during showtime.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Very Educational", "Not a typical aquarium but more of a facility to highlight the research. Love the sea horse and pipefish exhibits. Amazing views of the Pacific as well. Kind of far out to get to but well worth it. Not huge so wont take a lot of tie but worth it.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Very informative", "A good place to spend the afternoon. I wish there was more to make a days worth but there is enough for 2-3hours in my opinion but also depending the pace you go."], ["Reviewed 4 weeks ago", 4.0, "Pleasant Surprise", "We went here not really knowing what to expect and ended up being pleasantly surprised. The volunteers are super friendly and very knowledgeable. We went to see the tide pool feeding and were kind of expecting more. The aquariums and tide pools were great. The scientific side was a little boring for our 5 year old.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "It was very interesting", "My brother kept saying I needed to see this place so when he spent a day with us I relented. He was right it was very interesting. We saw lots of species of fish and other sea life. The seahorses really we’re charismatic as advertised as were the sea dragons. We found most of the animals listed on each exhibit which was sometimes quite challenging. We experienced the tidal pool exhibit. It was more interesting than I expected. Well worth the cost and time.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Good For Kids, But Lacks Fish", "We love aquariums and have gone to them all over the world; however, this one was pretty small and lacked much in the way of of cool live fish exhibits. Lots of interactive exhibits for kids, but not worth the money for us adults. Could have saved a lot of money renting snorkel gear and looking for fish in the ocean. Sorry, I wanted to like it, but cannot encourage others to go.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Nice Suprise", "We arrived just before opening time and we almost had the aquarium to ourselves. As a result we were able to take a very nice tour in just over an hour. The staff was very cordial and helpful, the exhibits are really good. I am a lifelong lover of marine biology and some of the displays that Birch offers are truly unique and very engaging. If I lived in the area I would purchase a membership and visit monthly.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Who knew male fish could get pregnant?", "I really enjoyed this aquarium. It was a nice size so you could see everything in around an hour. The displays were beautiful. The highlights for me were all of the jellyfish, some of the fish names (sarcastic fringehead) and the seahorses where I learned that the male carries the impregnated eggs in a sac in his abdomen till the babies are ready to be born.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Small, Friendly, Interesting", "The Birch is small enough to do in an hours but interesting enough to spend 3 or 4 hours. Interactive exhibits were fun and informative."], ["Reviewed January 23, 2018", 5.0, "Great collection of Sea Horses & a great tank simulating the ocean floor off San Diego.", "We had a great couple of hours touring the aquarium displays and tanks. An excellent collection of sea horses and unusual fish from all along the western coast of the US. We were there as they fed the fish and sharks in large tank containing a selection of the sea life right off the San Diego coast. High quality display!\nShow less"], ["Reviewed January 23, 2018", 5.0, "MUST SEE", "Great experience , good for all ages. Great view at it's La Jolla location. Their research is helping to save some of the most beautiful things in the seas to see."], ["Reviewed January 22, 2018", 5.0, "Worth a visit", "Took our grandchildren age 6 and 9 for a visit. They were enchanted by the many exhibits and hand on experiences. The variety of sea life is huge and the information on each thorough and well presented."], ["Reviewed January 22, 2018", 4.0, "Great place for an event", "We had our company Christmas party her and it was the perfect venue. So much fun! The catering was excellent and the folks at the aquarium were great. I recommend the aquarium for your next company event!"], ["Reviewed January 22, 2018", 5.0, "Good combination of exhibits, education and touching- doing", "Very impressed on how the aquarium had so much to do in order to learn about energy, climate change and how this affect our oceans. Great for kids, but as an old woman, I had fun and was engaged in so much more than most museums.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Educational and beautiful Views", "This is a great place for the kids to learn and view ocean species. It is right on the ocean and has a hands on pool for the kids to learn. They also have a video the kids can watch before the viewing. They do have an outside area as well as a small shop for the kids.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great experience and educational for everyone", "This aquarium has an amazing variety of exhibits for all ages and I guarantee anyone who visits will learn something. The facility is clean (very nice women's restroom) and seems quite new. There are interactive activities for little kids, amazing creatures to view close up (nice ledge in front of most exhibits for little ones to see up close), and very educational, detailed signage. The gift shop is worth this trip on its own - extensive stock of books for all ages, plus nice ocean/beach related gift items. There is a tidepool installation on the patio overlooking the LaJolla coastline - you can't find that any where else!\nShow less"], ["Reviewed January 21, 2018", 4.0, "Great little aquarium", "I truly enjoyed this aquarium because of the educational approach to the displays. The food, drinks, and gift shop were more reasonable than most attractions, which was a bonus as well. Very accommodating for our large group."], ["Reviewed January 21, 2018", 4.0, "Cute aquarium but little", "A nice enough aquarium but a bit small for the price. The jellyfish and octopus are cool. Better for smaller children."], ["Reviewed January 20, 2018", 4.0, "Worth stopping by but small and expensive", "For the size of it it was spendy - $51 for 2 adults and a child (although there is a discount for students and military). It offers great views of La Jolla. The aquarium is divided into two indoor sections as well as some tide pools displays outside and another outdoor play area/display. Interesting to learn about sea life you can do it about an hour and children with short attention may get board quickly.\nShow less"], ["Reviewed January 19, 2018", 4.0, "Nice aquarium!", "Nice aquarium. Great size for little kids and seniors, in that it's not too big. They also have a nice little outdoor play area for the littles. Much enjoyed just sitting and observing the large saltwater tank."], ["Reviewed January 19, 2018", 5.0, "Fun and educational", "Easily accessible and educational displays. Small but enough to see to make it worthwhile. Spectacular view from the outdoor exhibit. Friendly staff. Well stocked gift shop."], ["Reviewed January 11, 2018", 5.0, "Twas Wonderful, Great for the Whole Family", "We visited the aquarium over the holidays. It is easily accessable off of the freeway in the very pretty La Jolla area. There are some interactive opportunities. However, this is not a huge park. You do not need to allow for a whole day to visit. We saw the feeding clean show which was entertaining and informational. Wonderful views of the ocean. Price was about $18 per person. I recommend giving this a try if you have a half day to spend.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Very good for a small Aquarium", "We were there during xmas break, lots of young children, designers/architects forgot to acoustically treat to ceilings like the Monterey Aquarium, why do these educated people forget an important item like this......to treat it now would cost five times more, still a great stop."], ["Reviewed December 28, 2017", 3.0, "Small and More for Kids", "Really small aquarium and leans more towards young children. After going to many other aquariums, this was a disappointment. Would skip unless you have young children."], ["Reviewed December 26, 2017", 5.0, "Great Aquarium", "We will definitely visit again soon. There are quite a few exhibits. My toddler loved all of the sea horses and sea dragons. It was very clean and the play/exploring area was nice."], ["Reviewed December 22, 2017", 5.0, "Family time for teens", "My kids (ages 15 and 12) enjoyed this aquarium, a good way to spend a couple of hours. The holiday 'scavenger hunt' activity was a great way to encourage my 12 year old to stop and learn, while having fun. Favorites included the sea horses and jellies.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Well worth the price", "Lots and lots of tanks which were well labled. I particularly liked the sea horses. Excellent exhibit on climate change. Afterwards we walked down to the beach; lots of benches on the slight bluff to watch the surf. Much easier than trying to find a parking spot at the beach!\nShow less"], ["Reviewed December 17, 2017", 5.0, "Nice Aquarium", "While you are in La Jolla consider heading to the Birch Aquarium at Scripps. It makes for a good visit. The displays are interesting and they have a variety of marine life in their collection."], ["Reviewed December 7, 2017", 5.0, "Small but wonderful aquarium", "I was very surprised at how nice and interesting this aquarium was especially after reading other reviews. It was small but they had lots of interesting thing to see. They had a floor to ceiling Aquarium with leopard shark, sea bass and kelp. They had jellyfish that glow in the dark. The seahorse were beautiful and one I had never seen, like the seadragons. They also had a tidal pool with people explaining the function of the different creatures. Spend an hour and half here. This place is worth a visit if you enjoy interesting sea life. Parking is free for 3 hr. Little food bar out the entrance and it was a nice place to get a quick bite.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Memories", "We visited here in 1987 when it was in a much smaller building. Good value and lots of great information."], ["Reviewed December 3, 2017", 4.0, "Compact Aquarium", "Yes Birch is small but is a very nice aquarium. Well worth the admission price. They have samples of all local species well displayed and a lot of good information about the marine life. It was a nice drive up from the Mission Bay area. Add it to your day trip to Del Mar, take a a little over an hour for a great educational stop.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Great aquarium on a smaller scale than Sea World", "If you enjoy looking at animals more than all of the touristy shows at Sea World, check out this place. It has a great combination of tanks as well as outside touch pools that are staffed with knowledgeable guides. The tanks looked clean and well cared for. They are doing research on coral and have a small nursery where they are growing it. They have a number of tanks focused on sea horses which are fascinating animals. Also don't miss the sea dragons! They are truly amazing. The admission is only $18, about 1/4th the price of Sea World! It's not an all day activity but you can easily spend a couple of hours there.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Great Camp for Kids", "This place is great for kids! Very educational and informative not just for kids but for adults as well. Outside is a tide pool and view of the ocean. Beautiful aquarium in La Jolla and well maintained. The aquarium has a well put exhibit. Cost is reasonable and a good 2-3 hr hang out for families on vacation as well. Check it out!\nShow less"], ["Reviewed November 24, 2017", 4.0, "Beautiful", "Not a full day trip but you can spend a couple hours there. Mostly for little kids. Nice views. Seahorses were neat. Stingray exhibit. Tiger sharks. Clean. Free parking."], ["Reviewed November 21, 2017", 5.0, "great", "great for the family, plan 2 hours, great ocean views from the cliff. a large variety of yelly fish and more, reasonable priced. recommended meutermedia"], ["Reviewed November 21, 2017", 5.0, "Always Illuminating", "My girlfriend and I have been to the Birch Aquarium several times and always find something new to awe. The exhibits are attractive and informative. The exhibit of sea horses is particularly interesting. We will certainly go there again and again."], ["Reviewed November 20, 2017", 5.0, "Lot more there than you think", "You can spend at least 3 hrs there and still miss something - make sure you hit every single exhibit including outside, and don't just look and move on. This is worth the money!! Lots of cool fish, exhibits and history and stuff you never knew. Take your time, take some lunch with you - relax and enjoy a half day there. I see reviews some people took a half hr - no way, you need to really hang out and check it all out. maybe not for real little kids (like the zoo), but i recommend this place!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Family Visit", "Visited the Birch Aquarium with my two cousins (9yo and 7yo) and had a great time. A good variety of fish and marine life to see. Beautiful view of the ocean from outside and some great interactive pools and activities for the kids. Would definitely recommend.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Small but powerful", "We were there for only an hour. I would recommend to the staff that after a certain time, ticket prices be reduced. But the collection is outstanding and well maintained. Very educational. Good for kids, good for all."], ["Reviewed November 13, 2017", 5.0, "Quick Side Trip to Aquarium", "Driving around La Jolla we decided to make a quick stop to the Aquarium. It's quite nice, not over crowded nor over priced. Spent about an hour in a half looking around."], ["Reviewed November 12, 2017", 5.0, "Great place to see", "Love this place; always so much to learn and see. Can't beat the location and the value. I would not miss this on your visit.;"], ["Reviewed November 12, 2017", 3.0, "Nothing Special about the Aquarium", "We love to visit aquariums in whatever city we stay. This was a a relatively small aquarium with about half the number of exhibits we usually find in major city aquariums. Unfortunately, we visited in October, when children can visit for free. The place was mobbed with moms and strollers. Kids were screaming and running all over. The noise level was dreadful and it made the peaceful experience of watching the many sea creatures totally disrupted.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Birch Aq. La Jolla,CA", "Great Aq. It’s not huge, very interesting and lots of variety. Known especially for it’s Octopus who just had babies. They all sorts of live tanks and a great outside tide pools for the geeky touchy and a kids play area with boats and energy producing educational interactive machine toys careful they’ll get wet so bring another T-shirt lunch can be had there. Great views of La Jilla and the ocean towards Xmas Time they have Santa Clause in a wet suit feed the fish in their huge in door tank. So call or go on line and find out when that happens in December great whale statue fountains at entrance\nDoes great for a fun day and a great gift shop all the gift shops here and at Balboa Park the kids toys are priced really great!!’ Have fun\nShow less"], ["Reviewed November 8, 2017", 4.0, "Lots of fish", "We liked the huge turtle best. Lots of hands on educational displays for kids. We spent about 1 1/2 hours there."], ["Reviewed November 6, 2017", 4.0, "A Great View of the Pacific Ocean and the animals that Live There", "There's plenty of free parking and if you give yourself two hours you'll have plenty of time to see all the exhibits. One side has several aquariums that display the animals and plants in the Pacific Ocean. My favorite animals were the seahorses and the sea turtle. The sea turtle was injured in New Jersey so its hind flippers are unusable. But it's the most adorable turtle. Outside, overlooking a great view of the Pacific Ocean, there are tide pools where you can touch the animals if they have not been put to bed.\n\nWhen you return inside there is another section that has many exhibits about climate change and issues about our environment. There is another small aquarium that has two cool seahorses that look like branches of a tree.\n\nDon't forget to checkout the outside patio because there are exhibits that children can interact with. Kids can use solar power or muscle power to make machines perform. Or they can compete with boat races.There is one more aquarium in this area that hold leopard sharks and other rays and fish. You can obsess fish that hide themselves in the bottom of the ocean floor.\nShow less"], ["Reviewed October 30, 2017", 4.0, "Not bad", "Had a meeting recently here, why my company chose to have a meeting here is beyond me but still nonetheless there we were. I must say it really is beautiful in there."], ["Reviewed October 30, 2017", 5.0, "Understated and classy...", "Not trying to be all things to all men - but succeeding BRILLIANTLY at what it does try and do. You can pass a thoroughly engrossing and enjoyable hour or two here among hundreds of marine species from our exotic oceans. Loadsa background information & thought provoking displays - all conveying the huge amount of commitment and work involved; and that feeling is so gently reinforced by the friendly, approachable volunteers and the dedicated fulltime staff (who made feeding time such interesting fun!). Everybody happy to explain and chat with us all day in the relaxing Autumn sunshine. For my money, a really great relaxing experience!\nShow less"], ["Reviewed October 28, 2017", 2.0, "Over Hyped", "I have mixed feelings about how to rate this. From a strictly tourist perspective I was a little disappointed all around. Far smaller with way fewer exhibits than I thought and I saw everything in about 30 minutes. That being said the facility does amazing work and the employees are very smart and kind.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Parents weekend at UCSD", "The Aquarium is a must see! It's truly a gem in an Amazing location! The views are breathtaking! We enjoyed all the hands on interaction! The displays of the sea life was incredible! It's a Smaller version of the Monterey Bay Aquarium!! We especially enjoyed the sea horses and sea dragons! We were lucky to have the staff feeding the sea horses and she was able to give us more information about them! This is a place to enjoy for all ages!\nShow less"], ["Reviewed October 16, 2017", 4.0, "Educational", "We spent about 1 1/2 hours going through the exhibits and found them well done and very educational."], ["Reviewed October 12, 2017", 3.0, "Interactive for young kids!", "Love this place. Even though it’s not as big as say Monterrey it’s just a gorgeous location FILLED with things for young kids to learn about aquatic life. Definitely a must see for young families."], ["Reviewed October 7, 2017", 5.0, "First time visit!", "Both my teenage girls had a great time at the aquarium. The staff was very knowledge and gave the great recommendations for snorkeling in the area."], ["Reviewed October 4, 2017", 5.0, "Educational, relevant and great addition to San Diego trip", "We learned a great deal about the Pacific Ocean, sea life, and oceanography--a great way to enhance our understanding of what we enjoyed on the San Diego beaches during our vacation. It's quite a bit smaller than the aquariums we are used to in Southwest Florida, but we would definitely recommend a visit.\n\nResearch was the star, with signage describing how world-class scientists from Scripps have been leading impactful biological and oceanographic discoveries for many years. We especially enjoyed the excellent exhibit on climate change. It was also nice to see so many young adults at the aquarium.\n\nWould love to come back during the time of year when we could participate in one of their boat tours.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Fantastic!", "Birch Aquarium is a great place for all ages! I took my 6 month old grandson recently and he was absolutely fascinated watching the fish and other animals in the tanks. For older kids and adults there are myriad exhibits, learning opportunities and experiences. This is a really gorgeous place with fantastic views out over the ocean, and this is where the tide pool is located - another wonderful, experiential aspect of the Birch. Parking is ample and free. If you’re planning to go more than a couple times a year, it’s worth investing in a membership. Fun facts: Birch Aquarium is part of Scripps Institution of Oceanography (SIO) and University of California, San Diego, and there has been an aquarium at SIO for over 100 years; the Birch is currently celebrating its 25th birthday. It is an educational and research institution and you are the beneficiary as a visitor. If you’re visiting San Diego, don’t miss it.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Educational", "A small facility but definitely worth a visit if you are at all interested in marine science. Be prepared for an amazing view of the Pacific!"], ["Reviewed October 2, 2017", 5.0, "Best Aquarium and at a great price", "I try to visit Birch Aquarium at least twice a year. They have new things going on and there are so many beautiful tanks to see. Plus the large center tank has changing shows that are educational as well as entertaining!"], ["Reviewed September 30, 2017", 5.0, "Sea Horses", "Visiting La Jolla, we went to see theSea Horses. A wonderful aquarium for all ages, lots of hands on things for kids. Highly recommend."], ["Reviewed September 28, 2017", 4.0, "Fun for the kids", "A very nice aquarium. The views of the ocean are amazing out at the tide pools. The kids loved looking at all the displays and trying to find all the fish listed. The big tank inside was really cool. The eels were huge! The kids spent the most time outside in the energy area, playing with everything. They loved the kinetic sand exhibit. It's kind of a small place. We saw everything easily within the complimentary 3 hour parking. Price was fair, maybe a little on the high side for what you see. But free parking makes up for it.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Great aquarium and very educational", "This is a small but very interesting aquarium. It is a bit out of the way from downtown San Diego in La Jolla. My favourite exhibits were the sea horses. Apart from fishes there are several displays that talks about oceanography and also touches on climate change. Although small it is one of the more informative aquariums that i have ever visited. The volunteers were friendly and helpful.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Small pricey but some cool dosplayd", "We read the reviews before we came do we knew most people thought it was small for the price and we would agree. That being said the tanks were for the most part very clean and interesting. Cool to see fish including sharks collected near the beaches we had been swimming at all week.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Annual membership is only way to go", "Great fun and seeing through child's eyes makes it outstanding. Clean, educational and fun for halls. Includes hands on, rubbing fish, getting wet and see great gift shopping."], ["Reviewed September 21, 2017", 5.0, "Educational and Entertaining", "Set on the cliffs when you walk in your eye is immediately drawn to the tide pool exhibit overlooking the cliffs. Beautiful view of the Pacific. Staff was engaging and enthusiastic. Kid focused exhibits were fun for an adult. Loved the step up in front of tanks for better viewing. The infinity cube was amazing!! Went back multiple times.\nShow less"], ["Reviewed September 18, 2017", 4.0, "Something fishy", "Took the kids through the exhibits when they were asleep (so we could read and learn) and then ran around when they woke. Spent about 4 hours here with plenty of interactive learning and play! Bring some snacks for the little ones (maybe some goldfish crackers)...\nShow less"], ["Reviewed September 14, 2017", 4.0, "visit to the aquarium", "Although this is not a world class aquarium, it is quine ingenious in parts and fun for a relatively short visit."], ["Reviewed September 14, 2017", 4.0, "Great Education !", "This museum is on a very high level in regards to display and explain you what's going on in the water of the pacific (and elsewhere for that matter) in a partially interactive or playful way. You won't be bored ! It's suitable for kids/teens as well, however, if there are too many people in there (e.g. on weekends where Bank of America customers are offered free/reduced admissions, it could be too crowded for smaller kids)\nShow less"], ["Reviewed September 8, 2017", 4.0, "Good for young/newbies", "I love aquariums and thought being so close to the ocean this one would top them all.... but this one lacked big aquariums. With that being said, if you have small children or have never been to an aquarium this place will amuse you. They have a number of educational sections to the aquarium and they also have an area the kiddos can touch some sea creatures.\nShow less"], ["Reviewed September 8, 2017", 3.0, "Small aquarium", "I was rather disappointed in the aquarium. It's a small aquarium with a few exhibits displaying the local fish. The seahorse exhibit was nice. For the size of the aquarium I felt the ticket price was a little on the high side."], ["Reviewed September 7, 2017", 4.0, "Great fun", "Birch aquarium is a great afternoon out while in La Jolla. Staff were exceptionally knowledgeable and willing to help with any questions. Maybe a little pricing but they do have a facility to run."], ["Reviewed September 3, 2017", 5.0, "GREAT family activity.", "This is a wonderful place to visit for ALL ages. Can go rain or shine. So many inter -active stations for the kids to be hands on. Even as adults we found it interesting. Well worth the time spent and admission charge."], ["Reviewed August 30, 2017", 5.0, "Family loved it !!", "We went back several times as the kids thought it was great. Educational and entertaining !! Sea horses were mesmerizing !"], ["Reviewed August 26, 2017", 5.0, "Nice small aquarium.", "This is a small education based aquarium. It's not a showy aquarium but has several small nice educational tanks, some outdoor touch tanks, and a good sized kelp tank with some larger fish. We enjoyed about 1.5 hours here. Free convenient parking. There was a school group visiting while we were there, and it would've been more fun without the extra kids but glad they got to experience it as well.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Small With Excellent Exhibits", "As someone with a deep interest in marine life, I never miss a chance to check out aquariums worldwide. When I heard about Birch, which is an extension of Scripps Institute of Oceanography, I had to go when I was recently in the San Diego area. At first surprised at the aquarium's small size, I quickly became fascinated with the nicely designed exhibits, from a giant kelp forest to tide pools. But my favorite, which I could barely tear myself away from, focused on seahorses.\n\nAt least a dozen species swim in tanks here. Their coloring ranges from bright yellow to electric blue. My nose almost pressed against the glass as I watched each propel through the water with a small fluttering fin. The piece de resistance, however, proved to be a short film about mating and birth. That's because the male bears the unborn young. The female deposits her eggs into the male's pouch, where he fertilizes them internally. I could almost see relief on the male's face after labor and strong contractions led to a host of newborns bursting from his pouch.\n\nA large global warming exhibit also beckoned with its graphs and other scientific indicators. It provided educational moments for many families as parents explained to their children what the information meant. I also especially liked a small marine photography exhibition with exceptional works. The highlight for me was a photograph of a Munk's Devil Ray jumping many feet out of the water during its courtship ritual.\n\nThe aquarium has an outside concession stand -- Splash Cafe -- where drinks and light fare are sold. There are tables with shade umbrellas where people can sit but purchases can also be taken into the aquarium.\n\nA large parking lot offers free parking for up to three hours, which is more than enough time to see the aquarium. There is also bus and shuttle service with information given on the aquarium's website.\n\nIn a nutshell, I enjoyed my visit, but there is not the wow factor that many may expect from an aquarium.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Great educational stop for young and old", "Lots to experience here although some have remarked on the small size of it including our Uber driver who delivered us here from the hotel. Found it manageable - good for a half day trip and probably more than adequate for anyone taking younger children. Extensive sea horse exhibit - honestly had forgotten these creatures even existed until seeing this display. The male sea horses carry the babies and give birth to them - that's what I call equality. Fantastic exhibit on carbon in the atmosphere and it's consequences for climate change. Loved this. Younger children may not fully absorb these displays but 10 and up who take the time to read the displays will get the full picture. Lots of hands on exhibits. I enjoyed seeing the survival suit that is used on sea-going expeditions but there were plenty more hands-on exhibits including those where you could touch the sea creatures supervised by aquarium staff. This made me a bit nervous for these creatures which had to be a bit stressed by all the attention? Shark feedings in the morning 10:30 and 10:45 - tiger sharks are handed pieces of fish on a stick. The tank seemed on the small side for the tiger sharks and their fellow sea creatures. Neat bioluminescence display with informative staff. Tidal pool exhibit with all kinds of creatures and a staff member with an exhibit on reproduction of fish of different sizes. Lots to see. You can get your hand stamped and exit for the food concession at the entrance. Beware sitting on the retaining wall - signs alert you to the possibility of snakes - I moved on once I saw that.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Brilliant", "Go for the sea horses if nothing else. It's a great place for adults and children. We really enjoyed it."], ["Reviewed August 18, 2017", 4.0, "Nice aquarium, kinda small.", "The aquarium is not that big, but it still had some cool stuff. My 3 year old was a little small to do some of the interactive exhibits, but she still had a great time seeing the fish. There is one tank that had fish that resembled Nemo and Marlin with a fish like Dory in the same tank, so she really liked that. I thought the sea dragons were cool. The outdoor tide pool could be a little better. It was a nice stop in beautiful La Jolla.\nShow less"], ["Reviewed August 17, 2017", 3.0, "Birch Aquarium", "Not a great aquarium, well presented,interesting but very limited. Outside views, very nice. Not interesting enough for a young croud."], ["Reviewed August 16, 2017", 4.0, "Neat Take on Aquarium", "Scripps obviously has a huge reputation as being leaders in exploration and development of marine sciences. Their aquarium is small, but also intensely science focused, not necessarily \"look how many fish we have\" focused. That is slightly different for us as we've typically been to more of the latter, so my 3 y.o was a little bored, but my 12 y.o. who is keenly interested in marine sciences was very interested.\n\nBeautiful location above La Jolla and well worth a visit.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Excellent Aquarium and Fantastic Views", "The aquarium is small, but has some great exhibits. There is a fun, educational outdoor area for kids. We were a little disappointed with the tide pools exhibit this time. We visited a few years back and the tide pools were filled with so many animals, including starfish, that you could touch. This time, there were only a couple of urchins. The views from their outdoor decks of La Jolla are incredible. Fun place to spend a little time with the kids.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Great aquarium", "This aquarium was really nice. It's a little small, but has interesting exhibits. I really enjoyed the jellyfish and seahorses. It also offers a great view of La Jolla. This is a good attraction for families or anyone interested in sea-life. Within walking distance to UCSD.\nShow less"], ["Reviewed August 14, 2017", 4.0, "A treasure!", "Honestly all of the half-hearted quasi negative reviews really grind my gears. Birch is an amazing place to visit whether it be as an adult, a child, a student of life, whatever you want to call yourself. It has interactive and rotating exhibits, amazing fish of all types, and great pieces of knowledge for all who attend. Guess how that happens? Care and funding from people who love the place and what it represents. That being said, sorry it costs about $15 to get in, but it is well worth it!!\nShow less"], ["Reviewed August 12, 2017", 5.0, "Wonderful for families and anyone with curiosity", "The Birch Aquarium is part of the University of California, San Diego, and is a great place to see aquatic life while learning a little about what you are seeing. There are many interactive stations for kids that also adults will enjoy. The facility itself is beautiful with great views. Parking is easy although it is a bit of a walk from the far ends of the parking lot. We recently had a birthday party there for 5 year olds that was a tremendous hit. It started in a classroom with lots of activities and then proceeded into the aquarium on a scavenger hunt. The kids were both entertained and enlightened- the instructors provided by the aquarium couldn't have been nicer. The kids then gathered for cake afterward outdoors in a private area. If you are a visitor to San Diego, spending an afternoon there will be worthwhile. If you live in San Diego and haven't been, you are missing something.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Family fun", "Very friendly staff and volunteers. Very interesting information and the tide pools were a must do. Takes 2 hours tops. Beatific views also!"], ["Reviewed August 10, 2017", 5.0, "Excellent Teaching Aquarium", "This is not just a beautiful small aquarium it also teaches with hands on activities. A must see if you are in the area."], ["Reviewed August 9, 2017", 4.0, "Nice Afternoon", "The Aquarium is a nice thing to do for a shorter period of time (couple hours). It is a bit smaller than some others I have visited, but full of information. There were some really good areas of education for the kids, which is always nice. They show that climate change is real...\nThey have a nice ginormous tank with a huge sea bass, amongst many other fish.\nOutside they have an area that you can put your hands in the water and touch different items. The kids really loved it and overlooks the ocean. The pictures are from that area. There is also a shark tank and play area for the kids.\nThere is a cafe outside to grab some food/drinks.\nAll in all, a great afternoon excursion for the kids and adults!\nShow less"], ["Reviewed August 8, 2017", 4.0, "Great family time.", "We visited the Aquarium about 7 years ago when our kids were in grade school. They loved it. Now they are in college but they still enjoyed it. The interactive information is excellent. If you get tired of the exhibits you can relax on the patio and enjoy the view of the Pacific.\nShow less"], ["Reviewed August 7, 2017", 2.0, "Seen better", "I've been to better and bigger Aquariums for that price. It's pretty small and not worth the money in my opinion. Would not go again. If you have free admission then go but not worth the price."], ["Reviewed August 5, 2017", 3.0, "Relativey smalll but with pricey admission", "A facility in the heart of the city with modest displays geared more for the older kids and adults. Although the admission is pricey, the money apparently goes to support the research. OK place to visit if you have time to kill."], ["Reviewed August 4, 2017", 5.0, "Small but well worth it", "This aquarium is small, but it's one that I would come back and visit. The staff was friendly and I learned a great deal from the interactive activities that I participated in. I especially enjoyed the sea dragons, sea horses and the large kelp forest."], ["Reviewed August 2, 2017", 3.0, "Expensive for such a small place", "I thought it was a nice little place but it is very small and not exactly what I expected. lots of Jellyfish but not much else....only a few fish. I definitely expected more for the price. Everyone was very nice though and we got to meet a lot of students who were volunteering there. The gift shop was very nice though! Its also a bit difficult to find if you are not familiar with the area....make sure you get directions.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Great for all ages", "We went there with our 2 young sons and we're very pleased. Lots of exhibits with great variety. Good learning opportunities as the aquarium has an exhibit dedicated to global warming. Tide pools outside that allow for hands on learning. Friendly staff situated throughout the facility to answer any questions. We arrived after 3 and it was perfect - not too crowded and room to enjoy the views. Expect to spend 2-3 hrs here.\nShow less"], ["Reviewed July 29, 2017", 3.0, "Small and aversge", "Visited here during week long trip to San Diego with twin 5 yr olds and 7 yr old. We have an aquarium near where we live and this was an avg aquarium compared to the one we have. It has nice location (overlooks the ocean) but otherwise is sort of small and has avg variety of fish. It was included in our go San Diego card so we put it on the list and my kids like aquariums. The highlight of the trip was this 'kinetic sand' table near back of place. You could build the sand up and a projector overhead would repaint a map overhead. My kids spent a good 10-15 mins here. Rest of exhibits were ok. If you are in area then it's not a bad way to spend a few hours (free parking for 3 hrs). It was busy by 11:30 and crowded and parking was running out. But it wasn't something I would put on my 'must see' list. I've been to better aquariums in other cities.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Small and interesting", "We enjoyed our visit very much. The staff were friendly and informative. The exhibits were interesting. Just big enough to hold the interest of our whole party (aged 2-70!). Plan for a two hour or so visit."], ["Reviewed July 22, 2017", 5.0, "Awesome aquarium", "Birch Aquarium at UCSD's Scripps Institute of Oceanography houses a vast diversity of marine life from various habitats. The Hall of Fishes on the building's north side showcases the sea creatures from the Northwest Coast, Southern California, Mexico, and the tropical seas. This part of the aquarium contains a massive, marvelous Kelp Forest, where a huge diversity of species is housed in a huge tank. Every Tuesday, Thursday, and Sunday, there are live feeding shows taking place inside the Kelp Forest.\nThe outdoor Tide Pool Plaza on the west side of the building is where visitors can reach into the tide pools to touch and feel the creatures inside. The plaza also acts like a balcony, from where visitors can take in panoramic views of Pacific Ocean and La Jolla, which is a plus.\nThe exhibits on the south side of the building range from climate change (Feeling the Heat) to seahorses (There's Something about Seahorses). In these exhibits, visitors can utilize interactive devices for some added fun and learning experience.\nAmong the things I liked about this aquarium are the Kelp Forest, views from the Tide Pool Plaza, and observing how the sea creatures react when touched. Overall, with a vast array of marine life, educational exhibits, and a stunning outdoor plaza, I find this aquarium to be highly enjoyable for each and every visitor.\nShow less"], ["Reviewed July 22, 2017", 4.0, "Small & Fun", "Just the right size. Not too big. The visitors are well behaved. The docents/guides are wonderful. A genuinely peaceful setting where you can learn a lot."], ["Reviewed July 20, 2017", 3.0, "Reasonably priced", "Most reasonably priced attraction we went to in San Diego. Pleasant way to spend a couple of hours with the kids."], ["Reviewed July 20, 2017", 5.0, "Oh my! So many things to see", "I love this place every time I go back I just enjoy being there so much. People who work there are charming and friendly. Seahorses and Jellies my favorites. Places to sit and tours if you choose. And then go outside and there is the ocean in all of its glory.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Great venue for a wedding reception", "The aquarium can be booked for events, and we attended a wedding reception. Staff and catering were excellent, and who can object to seeing fish when the reception gets dull?"], ["Reviewed July 18, 2017", 5.0, "Stunning sea life exhibits", "The aquarium has a wonderful array of live and educational exhibits. The guides are so helpful in pointing out creatures that have come out of hiding or are camouflaged. The outside terrace is a relaxing place to sit and enjoy the view."], ["Reviewed July 16, 2017", 3.0, "Nice For young kids", "I spent a couple of hours touring this aquarium with my daughter and grandson the other day. It was great for him because of the smaller size of it. If you have older kids mid teens and above your time and money would be better spent at one of California's larger aquariums. What was offered here was interesting to view. Plan for about 2 hours here. I didn't eat here but I did see they had a small basic cafe that serves food.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Awesome", "This is an awesome place to visit. I can't believe I have been to the area so many times and never visited the aquarium before. We had a great time. Admission is not too expensive so it makes this an affordable outing for the family. So much great aquatic life to see and so much to learn. The view out near the tide pools is out of this world. I would go again and do recommend it.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Stunning fish! Amazing species!", "The overall visit was great. However, when it's 90o outside, it's difficult to see some of the fish displayed without a paper towel to remove the condensation from the outsides of the tanks. Visited once before several years ago - difficult to do in the Summer. Overall though, gorgeous!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Small but amazing", "It was small compared to the Monterey bay aquarium in central California but It was great! I love loved the baby seahorses, was my favorite exhibit. There were also some great interactive displays outside for kids. Even though it was a small aquarium there was a great variation:) There was even a tank with little sharks and stingrays.\nShow less"], ["Reviewed July 12, 2017", 3.0, "Great view but", "I was disappointed by the size of the place and exhibits. I felt like I was looking at people's personal home tanks. The seahorses were good but that's about all. Our aquarium in Galveston is 150% better and I thought Birch would rival that. Great view however as it is built on a hill and you can watch the beachgoers\nShow less"], ["Reviewed July 9, 2017", 4.0, "Family trip", "Nothing fancy but we had a good time and saw some cool animals. It's really not bad considering the price and comparing it to other things to do in San Diego."], ["Reviewed July 7, 2017", 5.0, "Vacation", "This is my second time here and I truly love this Aquarium! The location is stunning. Easy to get to. Admission is reasonable, gift shop is lovely, staff very informative and friendly and the exhibits are stunning!"], ["Reviewed July 5, 2017", 5.0, "Nice aquarium", "Took about an hour to go through the aquarium. Nice stop before hitting the airport. Go when they open to miss the crowds"], ["Reviewed July 4, 2017", 3.0, "Cute little aquarium", "This aquarium is in the smaller side and it was very hard to find parking. My youngest daughter is 6 and she enjoyed it a great deal but was still hoping there was more after seeing it all. I will still come back with her as it seems they have special activities here and there. They did a fun Easter egg hunt where they put Easter eggs in the tanks for kids to spot and at the end they get a sal prize.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Cool place!", "This is probably one of the best places to take kids that isn't overly expensive. We don't have kids, but we still loved the experience. Admission was a good price (there are plenty of coupons in brochures you can find at your hotel), and for the awesome view off the tide pools, you can't beat it! There's lots of interactive things for everyone, and don't miss the rescued sea turtle!\nShow less"], ["Reviewed June 30, 2017", 4.0, "Good place to spend an hour", "This is a good, not great aquarium. It's pretty small, but very clean and good exhibits. It's a good indoor activity for a couple hours. I wouldn't make a special trip to come here, but combine it with a trip to see the seals or a hike at Torrey Pines and makes for a good day.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Great afternoon visiting an excellent aquarium", "My wife, son, and I wanted to see a great aquarium in San Diego and found this excellent gem in La Jolla. Very enjoyable and educational. Not too big or too small but just right. Each exhibit had great explanations and detail about the fish and it's habitat. My wife also found some excellent gifts in the giftshop for friends and family. An exceptional value in La Jolla, CA.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Wonderful!", "A must see if you have kiddos who are enamored by the sea. Beautiful visuals, and an amazing large tank full of fish, sharks, sea turtles and beautiful kelp. The view from their tide pool deck is amazing!"], ["Reviewed June 24, 2017", 5.0, "Seahorse haven!", "This aquarium is small but there are lots of interesting fish to see, we especially loved the seahorse exhibit and the beautiful up close pictures of fish and other sea creatures. It was interactive and interesting, great way to spend a few hours, plus the outdoor area has touch pools and beautiful views!\nShow less"], ["Reviewed June 22, 2017", 5.0, "really enjoyable", "This aquarium is not very big but it is really enjoyable. There is a variety of sea life to enjoy. The layout is really nice as well. You can leisurely walk around. Outside there are touch tanks. The staff were very knowledgeable and really enjoyed answering our questions. The best part though was the view. The view alone is worth the visit. There are benches outside to sit at and just admire the view. We spend a couple of hours here and it was awesome.\nShow less"], ["Reviewed June 21, 2017", 4.0, "Birch Aquarium", "Small but very nice aquarium at the UCSD campus overlooking the ocean. Traffic in La Jolla is heavy, but worth the trip."], ["Reviewed June 21, 2017", 5.0, "Well worth a visit", "Enjoyed a couple of hours here as there was lots to see - a variety of fish in the aquariums, touch tanks, displays on ocean research and renewable technology, and presentations"], ["Reviewed June 21, 2017", 5.0, "Great Aquarium", "My husband and I thoroughly enjoyed our time at the Birch Aquarium. It is a very well laid out set of exhibits that can be of interest to both children and adults. The ocean views are most beautiful."], ["Reviewed June 21, 2017", 5.0, "Engaging expierence-Beautiful Views", "Birch Aquarium was a fun stop for 2 adult sisters, their mother, and 3 children under 10. What was a lovely thing is that the students are spread throughout the aquarium and provide real insight to the exhibits and what we were seeing. They engaged the kids and by the end our 2 little girls (9) were wanting to attend Scripps Institute when they graduated high school! They had interactive water features for our little one (5) and everyone got to spend some cash in the very reasonably priced gift shop. I would estimate probably 3 hours max would be enough time to spend here. Thanks again to the students who really did turn an aquarium visit into something special.\nShow less"], ["Reviewed June 21, 2017", 3.0, "Okay but i gave seen better", "Okay but I have seen better, I guess I was expecting too much! We have soon great aquariums in Arizona so I guess I was expecting great things!"], ["Reviewed June 19, 2017", 5.0, "Fabulous seahorse exhibit", "The Birch Aquarium is open daily except for major holidays. People of all ages would have a great time and learn a fact or two. For example, male seahorses give birth! The dragon and leafy seahorses were so unique and interesting.\nDon't miss the leopard shark pool located outside. The giant kelp forest was interesting.\nThis museum is smaller but worth a visit.\nShow less"], ["Reviewed June 16, 2017", 5.0, "a variety of sea exhibits", "This is a wonderful place to take the whole family. The exhibits have some hands on places. Lots to learn & see. Always interesting.."], ["Reviewed June 10, 2017", 5.0, "Wonderful Learning Spot For Children and Adults", "It's fascinating to learn about all the different types of fish and marine life. I would take my grandsons often and they never got bored. They can touch a starfish or a crab its a lot of fun."], ["Reviewed June 9, 2017", 5.0, "A Kelp Forest and Leafy Sea Dragons and More!", "Our family recently enjoyed a visit to the lively Birch Aquarium and we all had a fabulous time. The exhibits are great and the staff is friendly and helpful. The displays are very well designed. You can learn about the oceans and sea life or you can just enjoy seeing strange and pretty creatures. We borrowed a wheelchair so that the eldest member of our group could more easily enjoy the displays and presentations along with the rest of us. The view of the La Jolla beaches from the plaza is spectacular. The gift shop has a terrific variety of items in all price ranges-- the youngest member of our group was delighted to get a little sticker book that kept her entertained during the drive home. This was a highlight of our visit to southern California.\nShow less"], ["Reviewed June 6, 2017", 4.0, "Fun place to visit and learn about sea life!", "The Birch Aquarium is very clean, well lit, and well labeled with the various sea life and how they evolved. It is amazing to learn about all of the explorations going on at the bottom of the sea, mapping the sea floor, and learning about the weird creatures that live there.\n\nThe aquarium staff can handle a lot of school children and tours, and not affect the general public in an adverse way. It is a bit expensive to visit, $15.50 for a senior citizen 60+ years of age, and $18.50 for an adult. They do not charge for parking, and the scenic view on the trip there is excellent. The greeter that takes your tickets at the very beginning and sees you at the end should NOT be canvassing his cell phone while he is at work. How about, \"thank you for coming!\" as people exit?\n\nShow less"], ["Reviewed June 4, 2017", 4.0, "Small, But Well Done", "We enjoyed touring the Birch Aquarium; it's a smaller facility, but still has some great exhibits. Our favorites were the variety of beautiful jellyfish on display and the huge kelp forest exhibit that contained the larger fish and sharks. There are some neat touch tanks outside and beautiful views of the ocean from the terrace. They also currently have an Infinity Cube exhibit that allows you to enter a glass box full of bioluminescent light - we went in the late afternoon, and it wasn't very crowded. The staff were friendly and helpful; there's a snack bar outside if you need to grab something. All in all the aquarium is a nice place to spend a couple of hours and learn a little more about our oceans and environment.\nShow less"], ["Reviewed June 2, 2017", 3.0, "OK but no more...", "It's an aquarium. The institution is very respected worldwide but if you are a tourist and not a scientist, rather go to Sea World or Long Beach aquarium. The view from the terrace is spectacular, though."], ["Reviewed May 29, 2017", 5.0, "Fabulous aquarium along the coast with great tide-pools & science exhibits", "I love taking friends and family to the Birch Aquarium in La Jolla Shores. It's vest to go right when it opens or about an hour before it closes.... quieter and smaller crowds with easier parking.\n\nGreat aquaria exhibits and one huge kelp forest with tons of different fish all together as they would be in the ocean.\n\nOutside are tide-pools with artificial waves mimicking the tidal changes that creatures know as their habitat.\n\nBe sure to see the leafy seahorses, they're my favorite!\n\n\nEnjoy!\nShow less"], ["Reviewed May 26, 2017", 5.0, "For all seasons and ages", "The Birch Acquarium, an active place, is great for all seasons and ages. You can schedule a tour to see grunion run. Visit the museum with good labels; if you're without grandkids, a good quiet time to go is in the mid-afternoon. On site is a well-stocked gift shop and for food, Splashes that the French Gourmet operates. Parking for handicap is adjacent to the cafe/entrance and for others across the street is a nearby free (for 3 hours) lot. So do enjoy large, small, tropical and nearby fish at this scenic spot that overlooks the Pacific Ocean and La Jolla Cove.\nShow less"], ["Reviewed May 24, 2017", 3.0, "Interesting", "Small but interesting. We were there with out young grandson coinciding with two elementary school visits. This made the display areas very crowded and confusing for us. Also seemed a bit expensive in comparison to others we had been to."], ["Reviewed May 24, 2017", 4.0, "Nice visit with kids", "It's a a very nice little aquarium - the kids had fun. I just wish there was a bit more, but on the other hand, the prices are quite moderate. We particularly liked the sea horses and the sea dragons - beautiful creatures."], ["Reviewed May 24, 2017", 4.0, "Great place!", "If your interested in Marine life and aquariums then don't hesitate to visit this attraction. Price is a bit steep."], ["Reviewed May 21, 2017", 5.0, "Amazing and passionate people", "The place is mainly run by volunteers, who are all passionate about what they do. The Aquarium itself is amazing with three different experiences one with a huge tropical fish biome.\n\nI also got to see a 300kg Salt water Bass he's as big as a speed boat and a Sea turtle who at 30 years old is still considered an infant and learn about all the different types of seahorses.\n\nA must see\nShow less"], ["Reviewed May 20, 2017", 4.0, "Perfect to take little kids too", "This is the perfect aquarium to take small children to. Not too big and not too small. They have a small hands on pool with a docent explaining stuff. Also a couple areas inside where you can touch sea creatures. All the tanks have a step in front of them so little ones can get up close and personal. Very neat. Free parking.\nShow less"], ["Reviewed May 20, 2017", 3.0, "It's interesting", "Went to accompany a school expedition. My 10 year old was with his school group and among other things dissected a squid. For the rest of the family, (three adults and one kid) we paid roughly $60. It's a lot of money for about 1 and a half hours of fun. It's interesting but really expensive.\nShow less"], ["Reviewed May 18, 2017", 4.0, "Not as expansive as I had remembered from about 20 yrs ago", "Easy access for slow walkers but likely mosquitoes lurking in those woods by the parking lot. Not really crowded on a Sat. & the exhibits were well-cared for and interesting. For adults touring alone about 2 hours is enough time."], ["Reviewed May 13, 2017", 4.0, "Mesmerizing underwater world", "One of our favorite stops in San Diego, the aquarium had a wonderful variety of fish, sea horses and touch exhibits for small children."], ["Reviewed May 8, 2017", 5.0, "Very interesting", "It was raining very hard so we didn't spend much time at the outdoor displays. We truly enjoyed the indoor displays especially the ones that were relevant to the San Diego coastal waters and the San Diego Bay. Nice place to visit and reasonably priced."], ["Reviewed May 7, 2017", 4.0, "Nice spot for the rare rainy day", "We visited in the pouring rain. Plenty to do indoors. We did the outdoor touch pond quickly but enjoyed the indoor exhibits. Not many other places in the San Diego area to entertain tourists when it is raining. This is a good choice."], ["Reviewed May 7, 2017", 5.0, "Must see", "A visit to Birch Aquarium is a lovely, peaceful way to pass an hour or two. Quiet location with wonderful views. Not too big, not too small. Interactive exhibits. indoor/outdoor."], ["Reviewed May 6, 2017", 5.0, "Small but beautiful", "The view from the aquarium is gorgeous. For the price it is a great deal with a lot to see. The tanks are clean and well maintained"], ["Reviewed May 5, 2017", 5.0, "Sea horses, and gift shop, are amazing!", "This was my second visit to Scripps Birch Aquarium. My favorite part is the sea horses exhibit/s. They are such fantastical creatures. I also love the colorful live coral, and the more vibrantly colored fish, things not seen even at Sea World."], ["Reviewed May 4, 2017", 5.0, "Great aquarium!", "I have been to a large number of them across the U.S. and found this one to be the perfect mix of stuff oriented towards children and towards adults. There is a wide variety of fish species, jellyfish, invertebrates, small sharks, and the like - the jellyfish are particularly amazing. The tidepools outside are wonderful, and interesting to both children and adults, there are amazing views of La Jolla outside, and you can possibly view whales in the ocean below with the view finders. Easily worth a visit and highly recommended!\nShow less"], ["Reviewed May 2, 2017", 5.0, "A perfect cloudy day adventure!", "Popped in here for a couple hours on a cloudy morning with our 1 & 3 yr old. This is a super cool aquarium for the younger crowd, easily accessible with a stroller, and some amazing tanks. We loved their seahorse exhibits!"], ["Reviewed May 2, 2017", 4.0, "Educational & fun....", "I liked the displays on the Oceanographic research and the kelp forest aquarium display - our grand daughter liked the jelly fish. The displays were very good, the tidal pools were good too. The only negative (if you can consider it that) was the presence of what seemed like hundreds of unruly screaming 5-6 year olds on field trips....it definitely would have been better without that... :)\nShow less"], ["Reviewed April 30, 2017", 4.0, "Fabulous views, bring sunscreen", "We went with a party of nine, including three kids. Wonderful place to explore the indoor exhibits. Perched high above the Pacific and Scripps Institute of Oceanography - the views from the outdoor patio \"tide pools\" is wonderful. One thing to remember is that although the majority of the Aquarium is indoors, the tide pool area is outside, as well as the \"Splash Cafe\". Today it was very sunny and warm - more shade is needed for outdoor dining areas. You will be sitting outside in the sun. Worthwhile for all ages.\nShow less"], ["Reviewed April 27, 2017", 4.0, "Interesting attraction", "Situated in a unique location this aquarium is a fun place to visit as a family or with friends. As aquariums go it is small compared to big city ones but has some interesting s facts and exhibits you won't see elsewhere."], ["Reviewed April 26, 2017", 5.0, "Small but extremely nice aquarium", "My husband, 15 year old nephew and myself visited the Birch Aquarium. We all had a great time at the aquarium. We saw a lot of unique fish that we haven't seen at other aquariums -- yes we have been to a lot. It doesn't take a long time to go through the aquarium but it is worth the trip.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Beautiful \"fish zoo\"", "One of the highlights of our trip to San Diego. The whale fountain in front is really great, and the exhibits were beautiful. This is a great place to visit. I appreciated the helpful staff and ready availability of a wheelchair."], ["Reviewed April 25, 2017", 5.0, "Stop over", "A very good aquarium. Not to large and overwhelming. Fantastic views of the pacific ocean and scripps."], ["Reviewed April 24, 2017", 4.0, "Kid Friendly", "I was truly surprised by the visit at Birch Aquarium. It was very informative, got the attention of a five year old child, and had kids activities also. It's well set up, not price gouging like all other kids attractions in the area. The price you pay at the gate is all you pay. They do have a gift shop but the prices are reasonable . Families will enjoy this attraction.\nShow less"], ["Reviewed April 23, 2017", 5.0, "A must stop for anyone who like the sea", "Beautiful grounds over looking the ocean. The aquarium is spotless and has a large variety of tanks displaying fish from the Pacific. I was so happy I stopped. It is a must visit if in the area."], ["Reviewed April 21, 2017", 5.0, "Nice Aquarium", "My son and I visited early on Saturday. While the aquarium is on the smaller side, it is packed with exhibits, knowledgeable staff, interactive exhibits and a couple touch pools. Saw a few things I've never seen before. Would definitely recommend!"], ["Reviewed April 19, 2017", 5.0, "Magical Place for Families and Romantic for Couples - How is That Possible?", "This beautiful, intimate aquarium has world class views outside, truly unique creatures, displayed in small aquariums, and a wonderful collection of seahorses and weedy sea dragons that will take your breath away. There are \"petting\" pools outside where children can touch sea anemones. There is one story-high aquarium inside that allows the children to get right up next to the glass. The entire venue can be toured in as little as an hour for those in a hurry, or you can linger and spend several hours, both inside and outside. The atmosphere is very relaxed, and when you leave, the little shops and restaurants on Avenida de la Playa are a five minute drive away. Be sure to take a stroll on La Jolla Shores beach, steps from the restaurants. (Try Piatti's for a romantic ($$) Italian dinner, steps from the beach.)\nShow less"], ["Reviewed April 19, 2017", 5.0, "Fun for the while family", "We came with our 3.5 year old grandson and we all had a wonderful time. The fish are well displayed and descriptions are easy to read and understand. There are seats so you can sit and just watch the fish float by. There are unusual sea creatures as well as fish you will recognize. There is an outside tide pool which was particularly fun for the kids.\nBut you don't have to be a child to enjoy a few hours here.\nShow less"], ["Reviewed April 18, 2017", 5.0, "Windows Under The Ocean", "Birch Aquarium Is My Go To Place When I Want To Experience Ocean Life In Captivity.My Children And Grandchildren Have Grown To Appreciate Sea Life In Part From Our Multiple Visits To ThIs Aquarium.I Love All The Upgrades. Breathtaking Views Of La Jolla Beaches Below."], ["Reviewed April 15, 2017", 3.0, "It's a small aquarium", "If you are thinking this might be like the Monterey Bay Aquarium, you would be wrong. It's a little aquarium. It does have very nice little displays and one very large tank display. There are tidal pools and other activities for the kids."], ["Reviewed April 14, 2017", 5.0, "Amazing AND educational!", "kids of all ages enjoy this Aquarium... its setting by the sea adds bonus views of la jolla. The dedicated staff will wow you with findings & features of the aquarium... a world class aquarium, for sure! allow 2-3 hours and don't rush!"], ["Reviewed April 13, 2017", 4.0, "Great exhibit", "Relaxing day at this aquarium. Recommend a visit later in the day to avoid the classroom kids. Great sealife exhibits and a nice tide pool outside with an excellent view of La Jolla.\nToo bad the seahorse exhibit was under construction. A much smaller version was available on the day of our visit.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Nice, small aquarium", "This is a very well done, if somewhat small aquarium (compared to others we've been to, particularly some of the famous ones such as the Sheds). The fish are well kept and there's some variety. There is a wealth of information about local sea life and the current states of the ocean. I would say the average adult couple interested in aquariums could happily spend between 1 and 3 hours here, depending on whether you are interested in the environmental education materials or just the fish. Shark and ray feeding time was crowded, but interesting and worth making it to.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Fun and learning for the entire family", "Not only is the aquarium in a great location overlooking the ocean but there is also something to check out for everybody. During our visit the grown ups learned about climate change and its environmental impact and admired the incredible types of sea horses, the kids about tide pools and the many species of fish, and the little ones had so much fun playing with water. There is a picnic area inside the museum so it makes it easy to spend there many hours.\nShow less"], ["Reviewed April 12, 2017", 2.0, "Disappointing", "I expected so much more. This place is really out of the way and for those who don't live in La Jolla, a garmin is required to find it. Once there you expect so much more than is there. The display is very small and doesn't, to me, justify the trip.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Spring break", "Great interactive aquarium with views that's can't be beat. Our children (9 and 11) both enjoyed exploring the aquarium. The staff was wonderful and answered all our questions and even recommended exhibits not to miss."], ["Reviewed April 10, 2017", 5.0, "A wonderful array of sealife of all types!", "This is a highlight of indoor viewing of all types of sea life from the smallest to large sharks and octopi. There are areas where there is hands on exhibits besides the big glass view windows."], ["Reviewed April 10, 2017", 5.0, "Marvelous Information Packed Aquarium", "This is a marine feast of multiple hues for the eyes, from tiny seahorses to magnificent tropical fish, as well as offering instructive exhibits about climate change and the effect it is having on the oceans."], ["Reviewed April 10, 2017", 5.0, "My Mother's Favorite Activity", "I didn't go through the aquarium myself, but my mother did during our trip to SoCal--and she loved it! She said it was her favorite activity of our 10-day trip (and we did a lot). I waited for her on the large patio outside the back of the building, where I watched boats go by in the ocean below. Lovely views. We both purchased souvenirs in the nice gift shop at very decent prices.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Great for little kids", "This is a smaller aquarium that does everything right. The aquarium fish displays are beautiful and there was an interactive outside area, where kids can play with various exhibits. It's on the small side, but that shouldn't deter you from visiting. I spent 2 hours here and thoroughly enjoyed it.\nShow less"], ["Reviewed April 9, 2017", 5.0, "Great aquarium with lovely exhibits", "As you walk towards the aquarium you are greeted with impressive whale sculptures , and a remarkable mural painted by Wyland that set the tone for the quality experience you will find here. The exhibits were stunning, and well maintained. The outdoor areas were nice as well, with plenty of activities for kids and amazing views of the beach.\n\nIt was a little smaller than expected, but there is a lot to see.\nShow less"], ["Reviewed April 9, 2017", 5.0, "Very neat experience", "Loved seeing all the seahorses. We did go when it was high time for field trips. I thought it was very pricey for a family of four was $65 and we walked through in less than two hours."], ["Reviewed April 8, 2017", 5.0, "There is a lot to see", "The exibits are very educational. There are indoor and out door exibits. You can see a tidal pool. Dont miss the beautiful aquariums.There is a lot to see. Great place."], ["Reviewed April 8, 2017", 5.0, "Great aquarium, beautiful site, good for kids", "Lots of tanks with fish, sea horses, sharks and jellies. Nice presentation and movies on ocean pollution. Play ground for the kiddies and \"Dory\" in several tanks. Fish feeding by underwater guide, including sharks. Spectacular views from rear terraces. If you liked this review, please check \"helpful\".\nShow less"], ["Reviewed April 7, 2017", 5.0, "Lovely afternoon for the family!", "This is a small, educational aquarium which delivers on its promise to teach. Do not come here expecting Sea World and you won't be disappointed.\n\nCome here expecting a small, well run aquarium with plenty to do and enjoy for a few hours in a nice afternoon and you will leave satisfied. Yes they do have groups of children that visit but wait 15 minutes till the kids clear out and enjoy the lovely exhibits, including the kelp forrest and sea horse aquarium, in their glorious serenity. The touch ponds overlooking the Pacific were a big hit with my boys ages 6 and 2... all about touching a giant sea slug. Enjoy!\nShow less"], ["Reviewed April 6, 2017", 4.0, "Nice little aquarium", "This is worth a few hour visit particularly if you like aquariums. It's small but very well kept and you can get close looks at lots of interesting sea fauna. Very interesting collection of sea horses (best I've seen anywhere!) and jellies in addition to the beautiful fish. Touch pool is nice, some sharks to be seen in the larger tanks. Staff are very enthusiastic and friendly. View of the ocean from the aquarium is gorgeous! Only drawback: rest rooms are limited! There are some outdoors but only TWO stalls inside!\nShow less"], ["Reviewed April 5, 2017", 4.0, "Nice aquarium", "We spend three hours there and taught it was nice. A lot of history and the \"development\" of CO2- useful information. A nice view of the beach in La Jolla"], ["Reviewed April 3, 2017", 5.0, "Fun, educational trip", "Took two teenagers while on spring break and they had a great time. Volunteers were engaging and helped us learn a lot about the tide pools in the area. Highly recommend!"], ["Reviewed April 3, 2017", 5.0, "Great opportunity to see sea life", "You'll see sea life in their original habitat, without any \"fluff\" from a normal aquarium. Be prepared, it smells just like the sea!"], ["Reviewed April 2, 2017", 5.0, "A totally Wow! acquarium with interactive exibits for children and lots of educational stuff as well.", "I always try to make time to go to the Scripps with my daughter when we visit San Diego. We love the aquarium and the beach views as well from the terrace. The touch and learn tide pools are a big hit with all the children. Take a change of clothes as they are sure to get wet. Besides the fascinating tanks and displays big and small, the aquarium includes a number of interactive exhibits that teach children about the special aspects of the California coast and the pacific. The gift shop is also very nice and has cool things for friends and family back home.\nShow less"], ["Reviewed April 2, 2017", 5.0, "Excellent Aquarium!", "We have been members on and off for a decade and we just did a visit in March especially to visit the sea dragons. This is a gem of an aquarium...fantastic exhibits, just the right size to enjoy in a day. Beautiful views outside and really helpful staff. There really is something for everyone no matter what age. My youngest, 9 years old, has always enjoyed the huge kelp tank and could sit watching it forever. My eldest (now 18, yikes) is a shark-lover and always enjoyed the sharks and all the special programs. We've done summer camps, nighttime concerts and talks throughout the years and been happy with all our experiences. And I buy a lot of my Christmas presents for friends and family each year at their excellent store. All-around great place...don't miss it!\nShow less"], ["Reviewed April 2, 2017", 4.0, "great aquarium", "Visited with a 5 year old. she loved the tanks, i especially loved the huge octopus. The outside rockpools were good too, and the volunteer who allowed her to touch a sea cucumber and talked about it. The ecology exhibits were too boring for a none-reading child although good for older ones. cafe on site rubbish - serves cold coffee!! but good ice lollies.\nShow less"], ["Reviewed March 28, 2017", 4.0, "Nice but small aquarium", "Had a very nice visit at this aquarium. The view of the ocean from the outside tide pool area was spectacular. The visit to see everything took a little over an hour. Would take a little longer for those with younger kids who would want to play in interactive area.\nShow less"], ["Reviewed March 27, 2017", 3.0, "Lots of school groups", "Thank heavens we got here shortly after the aquarium opened at 9 because by 10 the place was overrun with groups of kids, pushing and shoving around the display windows. I understand that this is an important educational opportunity but most places set limits on how many school groups can be there at a time. If the aquarium does that perhaps they need to re-evaluate it. That said, the information about what was in the exhibits, and the extent of the exhibits was not especially impressive. For instance, though there are several seahorse collections, the information about them is pretty superficial. The same could be said about the discussion of the deep seas exploration. There are many more impressive aquariums in the country such as those in Monterey and Baltimore.\nShow less"], ["Reviewed March 27, 2017", 4.0, "Great Exhibit of Seahorses", "You'll spend a couple of hours enjoying various tropical fish and sharks. The sea horses exhibit is really quite interesting. There are very tiny seahorses to those that have mutated to mask themselves in plain sight. There is also a cafe is you need something to eat.\nShow less"], ["Reviewed March 24, 2017", 5.0, "Must go!", "I LOVE this aqarium. My first time going was in a big group back when I was studing marine biology. Its a decent size and they have recycles benches and stuff."], ["Reviewed March 24, 2017", 4.0, "Educational and fun", "One of my kids' favorite places to visit when we vacation in San Diego. Go when there us a shark feeding if possible, that's always fun for the kids!"], ["Reviewed March 22, 2017", 5.0, "Totally amazing", "An incredible collection of sea horses and jelly fish and a wonderful view of the ocean from the terrace."], ["Reviewed March 21, 2017", 4.0, "Educational and fun!", "The aquarium has lots of things for people of all ages. Huge touch aquarium, large aquariums to watch all kinds of fish, special programs like shark feedings to watch. Best part is the lovely view of the ocean from the back of the aquarium by the touch aquarium. Reasonably priced with free parking.\nShow less"], ["Reviewed March 21, 2017", 4.0, "Nice Way to Spend a Few Hours", "We took our 23 month old daughter and she loved it. The view from the balcony on the backside of the aquarium is amazing. There is a nice kids area that she really enjoyed. Lots of California native marine life and the large glass aquarium in the back of the building is a highlight.\nShow less"], ["Reviewed March 21, 2017", 5.0, "Underwater world of amazement", "The Birch Aquarium is a relaxing way to spend a couple of hours. Located on the bluffs of La Jolla the view off the back patio tidepools is priceless! You could sit with a book for hours enjoying that gaze. Inside consists of numerous tanks of colorful fish. Additionally, there are two very large room sized tanks that are breath-taking. All of the exhibits are well documented and there are lots of educational activities for children included in the science center located within. The patio tidepool is hands on and lots of fun. The front entry offers food services and a place to picnic before or after entry to the aquarium. The gift shop has reasonably priced souvenirs and collectibles. Seniors get discounted entry. I love spending time at the Birch. For special events, parts of the aquarium can be rented out.\nShow less"], ["Reviewed March 18, 2017", 4.0, "Kelp Tank Show", "While the kelp tank show is a special event, the museum has a series of large and small tanks full of exotic fish. If you had to pick one group, the seahorse no bigger than a dime to the one that looks like a floating ballerina is a striking image.\nShow less"], ["Reviewed March 18, 2017", 4.0, "Nice place", "This is a nice visit in a beautiful part of SD. This place is great for teens, kids and adults. Great place to go on a tourist visit of SD. Admission is reasonable"]]}}