{"Bixby Bridge": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Bixby Bridge", "url": "/Attraction_Review-g240329-d116836-Reviews-Bixby_Bridge-Big_Sur_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/13/9e/c8/bixby-bridge-another.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1026"}, "address": {"@type": "PostalAddress", "streetAddress": "Highway 1", "addressLocality": "Big Sur", "addressRegion": "California", "postalCode": "93920", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "a picturesque bridge", "A very popular spot to photograph an iconic bridge. I was very lucky to get a parking spot. There is a dirt road off the north bound side. If you drive down( 2 wheel drive is fine ) the road , you can get a much better view. You will be perpendicular to the bridge so you get the ocean in the background\nShow less"], ["Reviewed 1 week ago", 5.0, "Spectacular Views", "This is an amazing bridge, built in 1932, with amazing views of the Big Sur coastline. Careful crossing the road and careful standing at the cliff's edge, but you can get beautiful photos from here."], ["Reviewed 1 week ago", 4.0, "amazing", "this bridge is amazing in person . a very big historic iconic bridge overlooking the beautiful coastline with amazing scenery . definitely worth the visit"], ["Reviewed 2 weeks ago", 5.0, "So cool", "I have always wanted to see this bridge, and finally got to see it in January. What a cool bridge, the size, the height, and the views from the bridge!!"], ["Reviewed 2 weeks ago", 5.0, "Worth Backtracking For", "I was super excited for this drive on our Honeymoon. Sadly a massive landslide had closed the road just south of Bixby so we had to come by the inland highway to Carmel-by-the-sea and then head south from there missing the section from Santa Barbra to Bixby which was heartbreaking. The 50 miles or so we could explore was worth it all the same with almost uninterrupted views the whole way. It was a little hazy but that couldn't spoil the grandeur of the drive. It is right up there with the Great Ocean Road and Captain Cook Hwy in Australia, the Kaikoura Hwy in New Zealand or even the North Scottish coast for awesome coastal touring. The only good part about missing it is now we have to return and spend more time exploring the area.\n\nA visit to Bixby Bridge would be worth the backtracking on its own, but with the spectacular scenery, it is must do!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Cool view!", "What an amazing architectural accomplishment. It's inspiring what man can do. Beautiful area and bridge, cool spot."], ["Reviewed 4 weeks ago", 4.0, "Beautiful view", "We went way out our way to get back to highway one at the other side of the roadblock and it was worth the 4 hour drive. The scenery is unmatched any where I’ve been and the view from this bridge is extraordinary."], ["Reviewed 4 weeks ago", 4.0, "Great engineering", "Worth stopping, most do, so parking an issue on winding road. Was very misty in morning but cleared midday"], ["Reviewed 5 weeks ago", 4.0, "road trip", "great photo spot parking is sometimes hard walking to best photo spots can be difficult but lots of spots on the road to get pics coast line is beautiful"], ["Reviewed January 23, 2018", 4.0, "Photography destination", "Having just moved to the Bay Area, Bixby Bridge was one of the first places I wanted to visit. I spent a few hours after dark taking light trail photos of cars in the light of the moon. The bridge is definitely a unique and interesting location to photograph and visit.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Must visit for Big Sur, maybe hard to park", "Must visit spot for Big Sur just because it's on the way anyway, so why not make a stop? Good views of the ocean. May have issue parking."], ["Reviewed January 19, 2018", 5.0, "Popular Picture Stop", "This bridge is a hot stop for tourists. The bridge is amazing but the overall coastline here is beautiful. There's limited parking and be careful approaching the cliff area for pictures?it's very steep. It's a must stop on the way down the coast."], ["Reviewed January 18, 2018", 5.0, "Easy to miss if going south", "Totally missed this heading south from Carmel. Turned around and headed back north. You must park on the northbound side of the road. There is some parking, but that side gives you the full view of this manmade wonder."], ["Reviewed January 17, 2018", 5.0, "Iconic picture spot", "Was debating which bridge makes a better picture background the golden gate bridge or this bixby bridge. I have to lean towards this one. With the cliffs, the water, the waves, and the canyon, this makes for a pretty damn nice photo. The parking can be a bit dangerous as it's a small parking lot just beside the highway on the north end of the bridge.\nShow less"], ["Reviewed January 2, 2018", 4.0, "The grand entrance to Big Sur", "Definitely a great place for photo ops. Easy to get a decent photo even with crowds of people, of which there are many, throughout all seasons. I recommend taking your photos here in the afternoon and going on to Pfeiffer Beach for sunset photo ops."], ["Reviewed January 2, 2018", 3.0, "Not sure what all the fuss is about - try a photo up higher", "OK, it's a bridge along the coast but it's a hotspot for taking pictures. Honestly, I think the best photo spot is up the narrow dirt road behind it. From the top, you get a nice view of the bridge and ocean. I recommend coming at first light or dusk and taking pictures from this point. Parking is very limited.\nShow less"], ["Reviewed December 7, 2017", 5.0, "You have to see it to believe it", "Simply takes your breath away. Raw natural beauty that keeps going on for miles and miles. This drive along the Pacific Coast Highway is well worth the trip - it will stay etched in your memory forever."], ["Reviewed November 27, 2017", 5.0, "Very Photogenic", "The more southerly of the two famous landmarks this bridge is larger than Rocky Creek (360 feet vs 239 feet) and opened the same year - 1932. Fun to photograph 2066"], ["Reviewed November 25, 2017", 5.0, "Nice spot", "So we stopped at this beautiful spot to find an American riding his bike around America playing his guitar we spent ages singing and chilling out here before parting ways"], ["Reviewed November 24, 2017", 5.0, "Iconic Drive", "Be sure you dont do this drive alone. Every mile, every bridge (especially Bixby) is a photographers dream. As a passenger you can see it all, my poor driver had to look at the 700 odd photos I took to see some ot the things he missed.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Great, but crowded", "Good place to visit. We parked in the main vista point, but good luck trying to get a picture without anyone else in it. Just overcrowded the time we went. I saw people going to the dirt road across the highway which looks like you can get better pictures, but my family was just done with it.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Beautiful", "Great day we chose to do the drive and see these great bridges that were constructed not just for function, but beauty as well"], ["Reviewed November 20, 2017", 5.0, "Don't miss this one", "Just a dozen miles or so south of Carmel is the Bixby Creek Bridge. There are two vantage points for viewing. It is rustic, but if you want to take the best shots of your like, please don't miss this."], ["Reviewed November 17, 2017", 5.0, "Spectacular!!", "Finally got to see this famous bridge when we drove Big Sur. there is only a stop on the north side. We were originally told there were stops on both sides but we drove it both ways as the highway is closed at Gorda until at least the spring so we had to turn around and retrace our steps. Did not see a stop on the south but the one on the north had great photo ops and lots of room to stop. Well worth it.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Unbelievable beauty", "During my trip on the PCH I was most looking forward to seeing the view of Bixby Bridge. I️t absolutely did not disappoint. Looking at the pictures now it all looks fake. I️t was the most beautiful place."], ["Reviewed November 9, 2017", 4.0, "An iconic bridge is a spectacular coastal setting", "Just 13 miles south of Carmel is Bixby Bridge built in 1932 over Bixby Creek. This is the entry to Big Sur and the wild and scenic California Coast. This bridge was also made famous in movies including Play Misty for Me. The views before and after the bridge are spectacular. This part of Hwy 1 is wild and looks like it did 50 years ago. Don't miss this section of the California Coast if you are in the area.\nShow less"], ["Reviewed November 7, 2017", 5.0, "A Gem!!!", "Highway 1 drive highlight for sure! A must see when driving from Monterey or Carmel to Big Sur or further south. The bridge is truly incredible and makes for amazing photos!!!"], ["Reviewed November 7, 2017", 5.0, "Awesome Bridge with an Ocean View!", "Love this bridge! While in Big Sur I crossed it multiple times and each time enjoyed the experience and view.\n\nTravel Tip: If looking for the best photo opportunity, I would recommend taking it on the north side of the bridge. There is a small area to pull over and some open land to take a picture from.\n\nTip #2: The winds do get rather strong so please be careful if trying to get near the cliff for that perfect shot. Safety and your life is more important that a photo on social media. You'll plenty of professional photographers in a safe distance still capturing wonderful shots.\n\nOverview: a great place to stop by if driving up OR down the coast of California. Stop, enjoy a prepacked meal alone or with friends/family, then continue to your destination.\n\nLet me know if these tips are helpful by clicking the like button so I know I'm helping someone. Even if this review helps one person then it is worth the time to me.\n\nAlso feel free to follow along on here or IG (@neonorth) for more travel tips & inspiration to hopefully make your upcoming trip better.\n\nSafe Travels!\nShow less"], ["Reviewed November 7, 2017", 4.0, "Nice view", "Not only for the bridge but also for the view along the costs, it's worth to visit. It would be better if the weather is good.\n\n다리 뿐만 아니라, 다리까지 가는 동안의 풍경도 멋있어서 가볼 만 한 곳이라고 생각한다. 다만, 날씨가 좋아야 한다는 게 흠. 흐리면 잘 안 보일 것 같다.\nShow less"], ["Reviewed November 3, 2017", 5.0, "A modern wonder!", "A must stop on your travels along Highway No. 1. Be careful pulling over because plenty of other people are doing the same thing. Nonetheless, it worth some time to study this architectural wonder. How in heavens name was it built so many years ago?"], ["Reviewed November 1, 2017", 5.0, "Nice to see", "Very beautiful bridge, great photo location. From the north you have a spot where you easily can stop with your car. You also have another stop from the south, a bit further away."], ["Reviewed November 1, 2017", 4.0, "Foggy on Friday in October", "It is always a beautiful sight to see the Bixby Bridge when traveling from Carmel to Big Sur, even when the fog comes in."], ["Reviewed October 30, 2017", 4.0, "Nice view!", "We stopped by the bridge and were glad we did. The bridge itself is impressive but the scenery is just spectacular. The whole area of Big Sur is a must see."], ["Reviewed October 26, 2017", 5.0, "Amazing in person!", "I have seen pictures of this place and really wanted to go. It was so much more in person! Beautiful views from all over there! A true must see!"], ["Reviewed October 24, 2017", 5.0, "Breath taking!", "The Bixby Bridge was built in 1932 and is an engineering marvel for the 1930’s. Stop and enjoy the scenery from the north as you travel to Big Sur."], ["Reviewed October 24, 2017", 4.0, "Big Sur Coastal Drive", "We were driving across the big sur and stopped at a few viewpoints. When we got to Bixby Bridge we stopped, saw the lovely structure and the beautiful bays a drop from where we stood.\n\nThe bridge itself is a historical bridge that we had as one of our places to stop. When stopping before the bridge there was not a lot of room to stand before being on the cliffs edge. There was different levels to stand. The lower level was a bit risky as you literally are on the cliffs edge.\n\nOverall beautiful views with a bit of history. Get your camera out!!\nShow less"], ["Reviewed October 12, 2017", 5.0, "Gotta see it", "Not far past Carmel just about 20 minutes south, this is a spectacular must see, giving you a whole appreciation of the landscape and beats the commercialization of Carmel streets!"], ["Reviewed October 9, 2017", 4.0, "Scenic Spot!", "This Bixby Bridge is one of the most beautiful spots to stop at on the Pacific Coast Highway drive!\n\nI lived in SoCal & NorCal, so I've driven a lot on various sections of the PCH-1. Want to know a secret? I don't think you need to drive the whole thing to get a good feel for this iconic roadway.\n\nMy favorite parts of this famous highway are:\n1. Santa Monica to a bit north of Malibu\n2. Carmel to Bixby Bridge\n\nSince I'm talking about Bixby Bridge, I'll just focus on some tips regarding the second choice.\n\nI did a bunch of short trips from Carmel and Monterey down the PCH-1 to Bixby. This is a great spot to take out of town visitors if they want to get a taste of the PCH-1 drive without having to commit to the long drive down to San Simeon. At the moment, I don't think you can go TOO far past Bixby anyway due to the situation with one of the other bridges.\n\nIf your time in California is short, you can drive from Carmel to Bixby in a mere 15-30 minutes (depending on traffic). The rugged coastline is jaw dropping! I recommend continuing on for another 10-20 minutes south just to take in more of the gorgeous views. I promise, you will have a TON of photo ops along the way!\n\nTraffic does move slowly at times on this road as it's very curvy and there are a lot of tourists driving slowly along the road. There are many pull offs along the side of the road where you can stop to take photos, as always be cautious when crossing the road and look both ways since you do have a lot of dazed tourists driving around while gawking at the views.\n\nI've done the PCH-1 drive from Hearst Castle to Carmel twice, which is south to north. The views are probably a bit more impressive going in the other direction, but you will also be on the side with the drop off.\n\nThe highway suffered some damage this past winter due to storms. One of the bridges further down is currently being rebuilt, so you can't currently do the popular Carmel to Hearst Castle drive, you would have to take an alternate route.\n\nThe other thing to consider when timing your trip to Bixby is the marine layer, this is basically a fog that seems to often burn off by noon most days. If you are opting to head out first thing in the morning to take photos by the bridge, it may not be clear and sunny yet. Ask about this at your hotel if you prefer to go when it's less foggy, they can probably give you a better idea on timing. Time of year also plays into this, so I recommend doing more research to find out the ideal time to do visit if this is your main purpose of coming to CA.\n\nCell phone reception is not the greatest down by Bixby, but that depends on your carrier too. Also, be sure to get gas before heading down the PCH-1 as there aren't a ton of businesses.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Grab your camera!", "As we crossed the bridge, we realised this is a truly stunning view and even my partner said to me 'grab your camera'. It is something you have to take pictures or film if you love nature and unique sights.\n\nWe crossed it both ways as the drive was closed down further the road due to land fall.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Amazing!", "I had seen photos of this bridge months ago when I was planning our California trip and really wanted to see it for myself. The view from the bridge is stunning. When you think about how long ago this bridge was built it is so incredible to think of the people who actually built this marvel. We drove over it going both north and south. The only thing even remotely close to this bridge I have seen is Deception Pass in northwest Washington State. Really beautiful, highly recommend!\nShow less"], ["Reviewed October 3, 2017", 5.0, "Big Sur and Big Bixby Bridge", "Vast, expansive and stunning, the views are endless. There is a great pullout so you can make the most of this phenomenal engineering feat."], ["Reviewed October 2, 2017", 5.0, "The bridge of wonder", "I drove over the bridge multiple times and every time was an unforgettable experience. To see the ocean from such a vantage point is unprecedented. The sunrises to sunsets, the people all staring in wonder. I recommend stopping for just a glimpse and everything else will seem to just call into place.\nShow less"], ["Reviewed September 28, 2017", 5.0, "17 mile drive", "The California coast on this drive was spectacular. Waves, cliffs, rocks, wind surfers - it had it all. The colors of the ocean were beautiful."], ["Reviewed September 22, 2017", 5.0, "Worth the Drive", "Stunning scenery. I'm so glad that our tour guide made it as far as Bixby Bridge. It was well worth hurrying some parts of our journey so that we made it to this spectacular place."], ["Reviewed September 21, 2017", 5.0, "Beautiful Architecture", "Beautiful drive on Hwy 1. Once there the bride is worth the drive. Drive safe once there, tourists can be all over the road"], ["Reviewed September 20, 2017", 5.0, "Must See", "Great place to take the perfect vacation photo. Don't forget to take in the view on both sides of HIghway 1. This is a must see stop on the way to Big Sur and will be recognized as the scene in so many car ads. It can be difficult to park, but parking is available on both sides of the road.\nShow less"], ["Reviewed September 19, 2017", 5.0, "You have to stop and take photos!!!", "Personally as someone scared of heights this makes my stomach churn but it is a must see if on Highway 1. We crossed it twice yesterday; once on our way down from Monterey to the closure just beyond Big Sur and then again on our way back up to take the 101 diversion. There are stopping points both sides of the bridge but it can get a bit hectic midday.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Vacation", "Good place to stop and take pictures of this very famous bridge while driving on Hwy 1. Parking can be a problem."], ["Reviewed September 15, 2017", 5.0, "So pretty", "Wow...the views fro this place! The bridge, the ocean and the mountains. Pictures can't grasp how pretty all of this is!"], ["Reviewed September 14, 2017", 5.0, "Nice view", "Stopped to take a picture of the bridge and the coastline. A lot of people around but you can get a nice shot as long as the fog is gone."], ["Reviewed September 9, 2017", 4.0, "Beautiful Landscape", "Bixby Bridge is on California highway 1 south of Monterey.\nIt's probably one of the most picturescue sightseeing on the CA-1.\nthere is limited amount of parking places, can be crowded on summer. The CA-1 is currently closed about 20 miles south from Bixby so the traffic is lower than usually.\nDrive about 1 mile south from the bridge and you can get stunning pics of the coast line including the bridge\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great photos", "Best view of the bridge and ocean is just before the bridge. There are 2 bridges so make sure you don't just stop at the first one if you are headed south."], ["Reviewed September 6, 2017", 5.0, "Impressive structure on highway 1 in Monterey county", "Located south of Carmel and Carmel valley in Monterey county lies this impressive bridge off highway 1. Amazing it was not damaged from all the rain and rock slides. Unfortunately the highway is closed 5 miles south so you can't get to big sur anymore. It is still worth the drive if you are in the Monterey/ Carmel area. The view is breathtaking and a very. Ice scenic drive.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Great photo opportunity.", "If you are driving along the Pacific Coast Highway, I would recommended you take a moment to stop and take a photo with one of the most photographed photos in the area. If possible, aim to be there for sunrise or early morning as it gets busy as the day goes on.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great photo op", "Beautiful photo op. Saw bridge on tv. There really is not much more to say as it is a bridge over the beautiful Pacific ocean."], ["Reviewed August 27, 2017", 4.0, "Beautiful bridge", "This is a very beautiful bridge along the Pacific Coast Highway. It is about 20 minutes drive from Carmel.\n\nThere are some parking spots before the bridge, if you are coming from Carmel.\n\nThe bridge is next to the coast and the Pacific Ocean. The architecture of the bridge is very grand too. Very scenic and great for taking photography.\n\nShow less"], ["Reviewed August 24, 2017", 5.0, "Most Photographed", "This bridge is the most photographed one along the Big Sur Coast. It's also one of the easiest to photograph because of the pull offs north of it where the land juts out a bit making it a natural to photograph."], ["Reviewed August 23, 2017", 5.0, "A must-do drive", "I'm no engineer, just a lover of beautiful sights / landscapes and Big Sur is one of these. The coastline, the bridge, everything here is wonderful. Unfortunately, because of this winter and spring's landslides most of the highway is closed to traffic. Still, if you're traveling from Carmel-by-the-Sea, you can enjoy the bridge and the sights. One of those trips you should take in your life!\nShow less"], ["Reviewed August 20, 2017", 3.0, "Beautiful bridge on a beautiful coast", "The Bixby Creek bridge is a wonderful, curving piece of architecture and it's set on one of the most beautiful coastlines on the planet. It's worth stopping for a photo, but it really isn't much of an attraction. Watch for cars...the road can get busy."], ["Reviewed August 20, 2017", 4.0, "Not \"just\" a bridge!", "The Bixby Bridge has long been an icon on the Pacific Coast Highway, a marvelous piece of engineering. The designer picked a graceful design to complement the beautiful location. Those who think it's \"just a bridge\" don't properly appreciate all that went into building this bridge in this particular location.\n\nI have to agree with some people who don't find this to be a safe stopping location. The small parking area fills up fast and many visitors are careless and inconsiderate. The better photos of the bridge can be taken from a distance at pull-out points to the North and South.\n\nThe best appreciation for the immense size of the bridge can be gained from its north east location across from Highway 1.\n\n\n\n\n\n\n\n\nShow less"], ["Reviewed August 14, 2017", 4.0, "Beautiful bridge", "Bixby bridge is on highway 1 in the Big Sur area of California. It is an older bridge that is quite attractive. With the Pacific Ocean and beach it is a nice place to stop, enjoy the view, take photos and relax."], ["Reviewed August 14, 2017", 5.0, "Great Vista", "An iconic vista. You can stop on the north side of the bridge as you drive along Route 1. Beware of the crowds."], ["Reviewed August 13, 2017", 2.0, "Wow, a concrete bridge", "Hey its a bridge. Wow, big deal- must be all of 80 years old. You would think by the number of cars parked that this was something fantastic. We stopped for a gander and thought, well not much actually. It is a concrete bridge.\nYou can get some good photos of the landscape if you stand on the bridge though..\nShow less"], ["Reviewed August 13, 2017", 4.0, "Misty in the morning", "What an amazing structure! We drive to Big Sur in the morning and were looking forward to the Bixby Bridge but when we arrived the mist or low cloud almost covered it. After a drive north for a bit returned and it was clear and we managed to get some fab photos. Be aware of the low clouds/fog/mist in the area until about midday.\nShow less"], ["Reviewed August 13, 2017", 5.0, "One of the best spots on Highway 1", "A beautiful spot, a little busy with people (clearly others think so too!) and well worth stopping if driving along highway 1 north or south. It was a sunny day and so the cove and hills were alive with colour and the bridge looked magnificent. We also got to see the fog rolling down the hills which was also incredible.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Impressive", "If one is doing highway number 1, you will not miss it. Be aware that it's normally very crowded and there are not that many parking spaces. But for taking photo's you don't need more than 10 to 15 minutes."], ["Reviewed August 11, 2017", 5.0, "Wow", "Having seen this on to shows and films it is definitely somewhere that you want to see in person. This is a truly spectacular experience that you must must do."], ["Reviewed August 9, 2017", 5.0, "Amazing location for a classical bridge", "Drove down towards Big Sur and passed Bixby Bridge - a MUST to stop on the way. Totally stunning location and great structure - slim bridge piers look almost to weak when a bus goes over it . Great 1932 engineering !!!"], ["Reviewed August 7, 2017", 4.0, "Iconic Bridge", "We visited this place after visiting the various view points in 17 miles drive.Half an hour drive from the Pacific coast view points in 17 miles area this bridge is an architectural ,designing marvel..It looks beautiful and must have cost the Govt. millions to construct it.The rocky bay in front adds beauty to this bridge.\nTourists in their enthusiasm try to snap photos of the area and go Up to the edge of the sea which is very dangerous.Authorities should erect fences there to protect such visitors from falling in to the sea .\nShow less"], ["Reviewed August 4, 2017", 5.0, "Worth the site", "There are areas to pull off and the scene of the coastline is breathtaking. It's a must see if you're out that way already."], ["Reviewed August 1, 2017", 5.0, "Iconic and beautiful site", "My family (wife with two kids aged 10 and 12) visited here in July 2017.\n\nI knew we had to visit this bridge while staying in nearby Pacific Grove.\n\nWe visited in the afternoon just after lunch on a weekday. There were a few parking spots left on the west side of the highway when we arrived. There were lots of people climbing all over the cliff trying to get that perfect picture. They really should put up a barrier there - some people were taking some very serious risks. That said, it's all safe if you're sensible.\n\nAs for the bridge, it is iconic and beautiful with the mountains, clouds, and beach below - just stunning really.\nShow less"], ["Reviewed July 30, 2017", 4.0, "Beautiful Photo Op", "Glad we got out here - lovely views! Road is closed further south due to slides. Nice end to the day's drive."], ["Reviewed July 30, 2017", 5.0, "Amazing bridge on an amazing coast", "If you visit San Francisco then take a drive south down to Monteray and then a further 20 miles down to Bixby Bridge."], ["Reviewed July 29, 2017", 5.0, "Beautiful Vista", "We had completed 17 miles drive and carried on down from Monterey and Carmel to get to LA.\nWhat a beautiful bridge, we had no idea to expect it, its just part of the highway down the coast, we stopped and took photos as you can see there is a string cliff line at the Pacific edge\nShow less"], ["Reviewed July 29, 2017", 5.0, "Iconic bridge - a must stop for a photo opp", "This is a total must stop for the famous post card iconic photo! It gets quite crowded there so go early to avoid the crowds. We were there before 10:30am and didn't have any issue with parking. I was scared that it was going to be closed due to the weather storm earlier this year - thank goodness it remained opened!\nShow less"], ["Reviewed July 28, 2017", 5.0, "Amazing views.", "Due to recent heavy rain part of the drive along the coastal road from LA to SanFran was closed. We were able to scoot inland for a bit, then head back to the coast to still see this beautiful, historic landmark. Gorgeous views made the travel worthwhile.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Beautiful!!", "It is not marked on the road, so make sure you know you are coming up to it. Nice areas to get out and take pictures"], ["Reviewed July 28, 2017", 5.0, "Well known sight on Tour of California", "Worth stopping and taking in the view of the Bixby Creek Bridge; cross the road and get a different perspective!"], ["Reviewed July 27, 2017", 5.0, "Amazing view", "Driving through the route 1, the section called \"Big Sur\" is the main attraction in this area. You can take pictures before pass through it, there are lots of vista points with amazing views of the coastline."], ["Reviewed July 26, 2017", 5.0, "Nice views!", "Worth the stop, especially if you're familiar with the Death Cab for Cutie song. We stopped on the west side for a view of both the bridge and the ocean."], ["Reviewed July 26, 2017", 5.0, "Highlight of our Cali road trip! BEAUTIFUL !!!", "So, we hired a Mustang GT Convertible, this was all part of our 2.5 week Cali road trip starting in Vegas and ending in San Fran\nThis drive along the South Pacific Coast is a must do. This drive on Route 1 you HAVE to put on the bucket list.\nIt was everything I expected, just one beach after another, with spectacular views of this rugged, stunning coastline. I am afraid I have toadmit, its a coincidence I am a fan of the tv drama \"Big Little Lies\" so to drive this route and see the Bixby bridge was truly amazing. The bridge itself is wonderful. You can stop in the car both sides for great photos. I will not forget it.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Stunning views on the way there and at the bridge", "My daughter and I drove as far into big sur as we could with the road closed from a landslide just past Bixby bridge. This was some of the most beautiful country I have seen and a highlight of our trip."], ["Reviewed July 25, 2017", 5.0, "Loved the place", "It was a planned highlight on our drive up Big Sur and the view when we got here was stunning. We parked relatively easily on the right hand side shoulder of the bridge going north, and spent a good half hour taking photos from all angles. Worth a brief stop.\nShow less"], ["Reviewed July 23, 2017", 4.0, "A must....", "Myself and my wife (From Wales, UK) were coming through the BIG SUR as part of a 28 day road trip from Seattle to San Diego and it didn't disappoint. Even with the fact you couldn't go all the way through as there had been a land slide we entered from the Carmel side and I think you can get about 25 miles in before they turn you around which to be honest gives you more than enough of Big Sur beauty.\n\nThe Bixby bridge is a very beautiful iconic spot on the Big Sur and a must stop on the route. There's easy access for photo ops on both sides so be sure to get out and explore safely. We actually phones the photos on the left hand side of the bridge we're better but do both.\n\nIt really is very nice part of the world so make sure you take your time on this and don't rush. Give yourself a good half a day.\n\nEnjoy.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Great place for photos", "Stop on the North side of the bridge to get your iconic photos. This is a spectacular old bridge from the 1930's. Be ready to search for a parking spot, this is a tourist destination."], ["Reviewed July 20, 2017", 5.0, "Beautiful Stop", "We drove to this part of the highway just to see this bridge. It is a beautiful bridge. The scenery is lovely and the engineering amazing. We stopped at the view point on the North side and were able to get many pictures."], ["Reviewed July 19, 2017", 5.0, "Iconic Bridge, like a post card", "This bridge is so beautiful, the sea roaring behind it, the height of the bridge- just stunning. You will want to stop and take pictures of the bridge. We did a day trip from north of San Francisco just to see this bridge and it was well worth it. Along the way we were able to see the San Andreas Fault and for an East Coast person, that was really neat. The entire drive was wonderful.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Beautiful.......", "Traveled down the coast from Monterey and this view with the bridge was breathtaking to say the least......everyone needs to make the drive !"], ["Reviewed July 12, 2017", 5.0, "An Engineering Marvel", "Check out this bridge if you are driving through Big Sur. There are viewpoints both before and after the bridge. Stop at both!"], ["Reviewed July 9, 2017", 4.0, "Stunning Engineering in a Beautiful Setting", "This was a 'must stop' point, traveling down Highway One, particularly as the Pfeiffer Canyon bridge was inaccessible due to rock slides."], ["Reviewed July 7, 2017", 4.0, "Beautiful...", "The drive to the bridge is amazing! There's lots of people at the viewpoint & parking is difficult. Worth the drive up to Big Sur, even if most of the area is closed due to The the massive land slide awhile back.\nThere's also road work going on, so expect delays. Enjoy the view...\nShow less"], ["Reviewed July 6, 2017", 4.0, "Amazing view", "Beautiful bridge with amazing scenery. There is a large parking section here so more cars can stop. There are no guard rails so you have to be carful walking around to take your pictures. We stopped on the north side of the bridge and on the south side. The north side has the better close up views of the bridge. The best view from the south side is a mile or so down the road as your going around a curve. It was very windy at this point so be careful.\nShow less"], ["Reviewed July 4, 2017", 5.0, "You'll see it....you'll stop...you'll be in awe!", "Pull over. Get out and check it out. Bring your tripod and put it on one of the large rocks. Great photo opportunities. The best views!"], ["Reviewed July 2, 2017", 4.0, "A photo op - everyone stops, makes for a nice photo. Historic!", "We visited Bixby Bridge a few weeks ago and as you know, the road (Hwy 1) down Big Sur is closed not far after the bridge. It's quite a drive (about an hour) from Carmel to Bixby Bridge, but we wanted to say we saw at least one of the famous spots in Big Sur since 95% of it was closed to the landslides. We weren't the only ones... the road was full of those hoping to catch a glimpse before being made to turn around before you reach Pfeifer State Park. (then you ave to go back to Carmel and take Hwy 101 all the way around; about a 3 hour drive). Bixby Bridge was beautiful and looked just like the photos (see attached). A bit foggy when we visited, but still photo worthy.\nShow less"], ["Reviewed July 1, 2017", 5.0, "So Exciting!", "I was so excited to see the iconic bridge. It's a must stop view point while exploring The Big Sur. Breathtaking views and great photo ops of bridge looking west to the Pacific and looking east towards the mountains. Be careful crossing the road to get pictures of the bridge with the Pacific on the other side of the bridge!\nShow less"], ["Reviewed June 28, 2017", 3.0, "It's a bridge...", "The Bixby bridge has history, which is good to learn. But ultimately, it's a bridge. There isn't much parking and\nThe limited space parking area comes up on you relatively quickly and a lot of people stop so be careful of sudden brake lights.\nYou can stop just before or just after the bridge and still get pretty good pictures.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Picturesque", "We enjoyed the view of the bridge from the road. There are a couple of good places to pull off and take pictures. This is an iconic part of 101."], ["Reviewed June 23, 2017", 5.0, "You must stop to see this.", "If you are taking a drive down the highway 1 then you will pass over this bridge and it is worthwhile stopping to have a closer look.\nThere are limited places to stop so you need to be ready to pull in once you spot a space.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Iconic landmark worth a stop", "We couldn't resist stopping to snap a few photos of this famous bridge. Ok, maybe not as famous as Golden Gate... or Brooklyn Bridge... or Tower Bridge, but still. It's a cool landmark with limited parking on both sides. Windy and cold when we were there, but totally worth 10-15 minutes of your time.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Got to stop and see the bridge.", "We managed to drive down from Carmel to see part of highway 1 and this was without doubt the highlight. Well worth the visit. When we went it was very windy and cold but that didn't deter ourselves. It's only about 30 minutes drive from Carmel so don't let the opportunity slip by if you are in the area.\nShow less"], ["Reviewed June 17, 2017", 5.0, "Stop there", "A must stop place on the PCH to take few pictures and enjoy the views. It was very windy. A great spot."], ["Reviewed June 16, 2017", 5.0, "Enroute to the Big Sur", "A breathtaking view of the Pacific below and the drive to the Big Sur, the bridge itself is an engineering wonder attracting thousands of tourists daily"], ["Reviewed June 16, 2017", 5.0, "Cool bridge!", "It's a must see :) I'm a professional photographer, so I got pretty excited about this one (awesome composition points). It's also just nice to see by driving over too. Parking is limited (and a little scary off the side of a road) and this is a BIG DROP. Be careful!! Don't get to close to the edge. Some people were standing right on the edge for photos. Take a few steps away from the edge - your photo will look just as good. Just be safe here. The day we went had CRAZY strong winds and I saw a few people slipping on loose stones. It's a very pretty stop - or just a nice place to see while driving past.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Stunning!", "Very beautiful and stunning. Our guide stopped us at a lovely spot before the bridge for photos and for us to experience the strong winds along Highway 1."], ["Reviewed June 5, 2017", 5.0, "Gorgeous!", "We loved walking around and getting pictures of the bridge. It was a beautiful sunny day when we were here in late April. Worth the drive down from Monterey!"], ["Reviewed June 1, 2017", 5.0, "Stunning view", "After 17 miles drive, we continued our Journey along scenic route 1. It is gorgeous view of bridge, mountain, ocean.... We stopped twice here. (Have to drive back to Monterey in order to go to Cambria)"], ["Reviewed May 31, 2017", 5.0, "Do not miss this drive", "It's only a 45 minute drive from Monterey, it's free and it's far more breathtaking than the 17 mile drive. You have to see this view. Incredible!"], ["Reviewed May 30, 2017", 5.0, "Iconic Brixby Bridge", "The graceful architecture of the bridge is an attraction itself. The coastal view is equally amazing."], ["Reviewed May 29, 2017", 5.0, "Gorgeous view", "make sure you slow down, stop and take pictures. We just blew over it (in awe) the first time but were lucky enough to come back up Rte 1 for a second look."], ["Reviewed May 28, 2017", 4.0, "Great looking bridge !", "Epic looking bridge with views of the ocean. Stop over at the vista point located 5 mins before the bridge (while driving from Monterey to BigSur) for some great shots. Limited parking. Hope for a clear day. The mountain, the creek, the bridge, the ocean - all make for a memorable scene !\nShow less"], ["Reviewed May 26, 2017", 5.0, "Historical", "What a great view. Really neat to see in person a bridge that has been in so many automakers television commercials."], ["Reviewed May 25, 2017", 5.0, "Definitely a Must See for tourists as well as Californians", "The Bixby Creek bridge is my favorite scenic view. The view is different and beautiful, changing not only with the season and the rainfall, but also with the time of day. Best when the background is lush green, which occurs during the growing season in spring each year. Living in So. Calif., I have driven Hwy 1 at least 15 times, and crossed this bridge. Great scenery continues all down coastal Hwy 1 all the way to Morro Bay.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Driving up the Pacific Route 1", "We had lunch at Nepenthe and drove toward the direction of San Francisco. And then we came across this historic bridge. Once we crossed this bridge, we couldn't help but stop our car and gape at the wondrous vista of the cliffs of the Big Sur, the rocks and the pristine beaches below framed by the cliff and the ocean. There is enough place to park your car and enjoy the scenery. A good camera with depth of field is required. Memorable place to visit and the bridge itself as seen from the viewing /parking place is very aesthetically pleasing and an engineering marvel.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Road Trip", "I am sure it has been said before but awesome view. Fantastic spot. Plenty of room to pull off road and take pictures from either side of the road"], ["Reviewed May 13, 2017", 4.0, "Worth a stop to admire this iconic bridge!", "Worth a quick stop to admire and photograph the iconic Bixby Bridge.\nWe stopped here on our drive from Carmel to Pismo in June 2016.\nWe arrived early morning about 09:00 and, although the parking area on the north side was not too busy, the bridge was enveloped in fog.\nStill a good photo opportunity even in the fog!\nShow less"], ["Reviewed May 6, 2017", 5.0, "Amazing", "Drove here on a day trip from San Francisco. The nature and scenery is amazing. Very nice views. Highly recommended."], ["Reviewed May 6, 2017", 5.0, "Beautiful Bixby Bridge", "This bridge is an architectural wonder to look at. It is pure beauty. Parking is limited in the area, so try to go early as you really need to get out of your car to appreciate its true wonder before you drive across it. There is also an access road that you can park on, if all the spots are not taken. Try to visit this area when the sun is out, and not on a weekend. Since part of Hwy 1 is currently closed to thru traffic due to severe storm damage, it is a good time to go South from the Carmel side as it is less crowded!!\nShow less"], ["Reviewed April 28, 2017", 5.0, "Incredible views", "This was the final stop on our drive from San Francisco along Hwy 1. The views are breathtaking and iconic. Make sure you stop further along up the hill and look back at the bridge too!"], ["Reviewed April 27, 2017", 5.0, "Gorgeous", "This is an amazing part o Highway 1. If you're doing the drive you must stop see! The bridge is so pretty eighths ocean hitting the rocks underneath. You might have a hard time parking because so many people stop here so just be patient."], ["Reviewed April 26, 2017", 4.0, "Loved it...", "The views are amazing from this place... entire pacific coast highway is such an awesome place for sightseeing...."], ["Reviewed April 21, 2017", 5.0, "very scenic", "loved passing over this bridge and great photo opportunities a real must see in big sur.loved it...."], ["Reviewed April 19, 2017", 5.0, "Gorgeous crossing", "Wow, what a wonder this bridge is. Quite an occasion to cross it. The view of the ocean is spectacular!"], ["Reviewed April 18, 2017", 5.0, "Stunning views", "Bixby bridge was a \"must go\" for me having seen beautiful images of it online and the real thing didn't disappoint.\n\nTry driving southward from Monterey and there will be a number of beautiful vantage points from as far as the car park of Rocky Point Restaurant.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Breathtaking", "In the short 26 years I've had the great pleasure of living in the Monterey area, i have never found peace like I have, and still do find at bixby. It, much like its surroundings is iconic of this beautiful area."], ["Reviewed April 10, 2017", 4.0, "bixby bridge at sundown", "The road along the Big Sur was largely closed due to the storms and the bridge at Pfieffer Creek collapsing, so we could not drive along Highway 1 as we had intended. we did however go south as far as Bixby Creek, which gives a really good impression of the way that the road clings to the edge of the cliff. Only about 10 miles south from Carmel so worth a detour.\nShow less"], ["Reviewed March 31, 2017", 5.0, "Great bridge", "This is a fantastic bridge about 30 minutes south of Carmel. The drive to the bridge is great and the whole area is great."], ["Reviewed March 28, 2017", 4.0, "Outstanding Vier of the California Coast", "Easy to stop and look North or South at this most incredible view of the bridge and the coast. We were there on a very windy day so the white caps added to the dramatic and stunning view."], ["Reviewed March 26, 2017", 4.0, "one of the best coastal drives", "While the bridge is an engineering marvel, the main attraction is the coastal highway and the rolling hils/mountains along the shore. You will enjoy this drive. take your time, get out of the car at the vista points and do a bit of hiking. And if you go in the very late afternoon, you'll treat yourself to a nice sunset. We did drive all the way south to Big Sur,. then u-turn and returned. to Monterey.\nShow less"], ["Reviewed March 22, 2017", 5.0, "Beautiful historic bridge is impressive", "One of the best views along the Big Sur coastline. Get out of your car and take pictures of this gorgeous historic bridge."], ["Reviewed March 19, 2017", 4.0, "It's worth a visit!", "Historic bridge with a vista point from where you can enjoy the view of the bridge and the ocean. If you're driving coming from Carmel the Bixby Bridge is the second one (the first one is also historic but not as impressive as the Bixby). It's worth a stop for a couple of minutes!\nShow less"], ["Reviewed March 9, 2017", 4.0, "Highlights of Big Sur", "Bixby Bridge and the ocean views around it are the highlights of the Hwy 1 in Big Sur. Get your camera ready!"], ["Reviewed March 5, 2017", 5.0, "Impressive Views", "Lots of cars slowing down and trying to find parking spaces. The rocky coastline here is gorgeous in any type of weather - just different moods. Take time to enjoy the views."], ["Reviewed March 4, 2017", 4.0, "Truly impressive", "This part of the coastal highway 1 is a gem. We found ourselves stopping every mile or so to take photos and short walks.\nThe Bixby bridge is a great photo opportunity. You can see it in the new HBO series, Big Little Lies. They show the moms driving over it on the way to the kids' school.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Inspiring every visit!", "I've been here plenty of times and will never tire of stopping at this bridge and taking all the beautiful views!"], ["Reviewed February 25, 2017", 5.0, "Breathtaking!", "Amazing feat of human engineering went into creating this breathtaking bridge. Must see! Park of to the side on a dirt road to get the best view"], ["Reviewed February 24, 2017", 5.0, "Amazing views at pull-offs", "The Bixby bridge is a great place to pull-off and see some amazing views of Big Sur with the bridge in the foreground or from the bridge itself. Highly recommended stop on Hwy 1."], ["Reviewed February 21, 2017", 5.0, "God's nature channel", "This was the highlight of the trip. As simple as it may be a sunset in this place can take your breath away. My wife and I drove down from Carmel, CA after a wine tasting at Talbot to catch the sunset at Bixby Bridge. This is something I have wanted to do for a long time now.\n\nIt is amazing to think how all of this was created and I just thought to myself; if God were to watch a nature channel. this is probably what he would be watching right now. Just amazing!\nShow less"], ["Reviewed February 20, 2017", 5.0, "Amazing view!", "We drove from San Francisco to LA on the PCH in May 2016 and crossed Big Sur and the Bixby Bridge. Amazing vistas, scenic drive but very, very few places to eat at one point. We ended up stopping at a road side hotel that had a restaurant. Memories and stories to tell! I held on to the door handle most of the drive because of the height of the cliffs. I think the drive is best done going south, but haven't driven it north. We were able to see seals on the beach and cows along the road. Such an awesome adventure!\nShow less"], ["Reviewed February 18, 2017", 5.0, "Great photo opportunity if you have time to stop", "Was really looking forward to going over Bixby Bridge as part of our road trip on Pacific Coast Highway and it was well worth the wait. Unfortunately we were running late so couldn't stop and take pictures looking back after crossing the bridge, but would recommend that you do.\nShow less"], ["Reviewed February 14, 2017", 5.0, "Photo stop", "You cannot drive along this road without stopping for a photo opportunity and this is a great spot for one."], ["Reviewed February 11, 2017", 4.0, "Nice photo stop", "It's worth pulling over for a photo. Don't forget about the view behind the bridge depending on the time of day offers a great view and lighting for a pic."], ["Reviewed February 3, 2017", 5.0, "Greatest vistapoint along the Highway 1", "Legendary place with a lot of cinematic memories with this place. Few spots for great cliff-shots but remember to be careful on the edge!"], ["Reviewed February 2, 2017", 4.0, "Definitely a stop", "This is definitely a stop everyone needs to make. The views are fabulous and it is a great photo spot."], ["Reviewed January 30, 2017", 5.0, "A beautiful vista", "Whilst driving down The Pacific Coastal highway this is a place you must spend sometime. Many would say its only a bridge but what a bridge thats has been photographed millions of times and has guest starred in many a film or tv series. There is limited stopping places north of it and these get filled up quickly by passing traffic. South of it there are many places to get that great picture which will include of course that great californian coastline. Worth the time to stop and imbibe in the views and take the odd one or a hundred pictures.\nShow less"], ["Reviewed January 28, 2017", 5.0, "Iconic", "Hwy 1 is just a breathtaking drive. I'm so pleased I've had the opportunity to travel here and do this. Bixby bridge is so lovely and fits perfectly within its surroundings. Unfortunately for us, we could not pull over and enjoy it to its fullest. There had been major fires in the area and a lot of the pull over lanes had been coned off. The ones that were free were filled to the brim with other cars. It's a tourist haven for sure which means proceed with caution as there are so many people taking snapshots and not looking at how close they are to the road / as well as parking miles away on the other turn offs and walking down. A little disappointed we had nowhere to stop but this means we'll have to come back and check it out another time ;)\nShow less"], ["Reviewed January 28, 2017", 4.0, "Beautiful, iconic view - see it in person (since you've seen it on TV a million times)", "The Pacific Coast Highway - and Big Sur specifically - is a national gem that allows each travel to take in the experience at his/her own pace. Motorcycles, convertibles, sedans, bicycles...this is the place to drink it in.\n\nBixby Bridge is a wonderfully photogenic spot that captures the quintessential rugged California coast. There are no amenities nearby, only you, the bridge and the steep cliffs descending to the sea. Worth a 15 minute stop for pictures and perspective.\nShow less"], ["Reviewed January 22, 2017", 4.0, "Breathtaking", "There are places to park near the bridge on the north side and a few overlook spots from the south to capture either the bridge or a greater shore shot and bridge."], ["Reviewed January 20, 2017", 4.0, "Nice view, good photo stop", "We've probably all seen the Bixby Bridge on TV, in commercials. It is very scenic with the steep cliffs on each side, and potential for photos is great. The bridge is remarkable, given the year it was built, considering the equipment and technology that was NOT available at the time. My best photos were from a closed, partially dirt road on the east side of Hwy 1. Go, enjoy the view, but proceed with caution - this seemed to be the most dangerous area of Hwy 1. Tourists from all over the world, parking haphazardly on the sides of the road, stopping abruptly, and jumping out of their cars for photos. Several cars were parked with parts of the car hanging out into the highway.\nShow less"], ["Reviewed January 19, 2017", 5.0, "Geologic - Scenic - Magnificient", "This bridge is a Structural feature among Geological formations. The scenery is cool and the site is magnificent. The whole drive to this bridge is full of excitement. you can park nearby parking lot (avoid parking at road side) and enjoy stunning view."], ["Reviewed January 17, 2017", 4.0, "Wonderful drive", "The views are stunning and the drive is exhilarating along this fabulous coastline. The Bixby Bridge is elegant and photogenic. Unfortunately as well as being famous for its looks, it also has gained fame for the deaths of people falling to their death."], ["Reviewed January 15, 2017", 5.0, "Big Sur - Scenic Drive", "The twisting ride along the rugged coastline of Big Sur offers eighty-five miles of absolutely spectacular scenery. Be prepared to stop and admire the landscape along the numerous scenic overlooks. The region offers scenic Beaches, California Redwoods, rolling Mountains and amazing Rocky Cliffs. Take your time, take many photographs, and watch the sunset over the beautiful blue Pacific Ocean.\nShow less"], ["Reviewed January 9, 2017", 5.0, "Stunning views and magnificent drive", "We drove along Big Sur and the Bixby Bridge. The drive was filled with magnificent scenery and the bridge structure is unique and fantastic in its own right. A thoroughly worthwhile journey and adventure"], ["Reviewed January 6, 2017", 5.0, "Best when the Sun is Setting", "Bixby Bridge is pretty impressive. It's massive - over 200 metres tall, it's almost impossible to see the bottom of it. There is plenty of parking on either side of the road as you approach the bridge. The best view is from the west side, as the sun illuminates this side, and especially close to sunset, the warm glow on the bridge is just breathtaking. Unless you're here to watch the sunset, expect to stay less than 30 minutes - it's enough time to ogle the bridge and take some pictures. Must-see on PCH.\nShow less"], ["Reviewed December 30, 2016", 5.0, "Highway 1 must!", "This bridge is iconic and beautiful to stop and take pictures with the family. I will say this was my favorite view while driving up the 1."], ["Reviewed December 25, 2016", 5.0, "Awesome bridge", "Big Sur is a beautiful, awe inspiring simply breathtaking piece of terrain. Every time you think you can't be wowed again you see another stunning sight....no exaggeration it's that good. And if you're lucky on a clear night you'll see the galaxy"], ["Reviewed December 23, 2016", 4.0, "Breathtaking", "I stopped at Bixby Bridge while on a roadtrip down the 1. The whole area of Big Sur is gorgeous – whether you’re camping, driving through, or visiting for a weekend to hike and explore. The towns surrounding the area are also very quaint."], ["Reviewed December 22, 2016", 5.0, "Highway 1 landmark !!", "a short stop on the picturesque highway 1.. like so many ... but this is different.. its built around 1929 & if you see it carefully, you will notice its beauty & architectural brilliance.\nNice views of bridge, & sea shore..\nIf you are coming from north, there is small parking area before the bridge..\nShow less"], ["Reviewed December 22, 2016", 5.0, "Its a bridge", "This bridge has a world record to it for something, highest or longest I can't remember, but its worth a look and there are laybys on either end to stop your car or bike"], ["Reviewed December 21, 2016", 5.0, "Always thrilling", "Anytime we Drive Highway 1 South it's always a thrill to see Bixby Bridge stretching out ahead of us and marvel at the structure that has held together for so many years!!"], ["Reviewed December 20, 2016", 5.0, "Amazing vistas", "The views from this bridge are fantastic! Approaching the bridge, it looks like something from a movie. Savor the drive across and stop along the way for photos!"], ["Reviewed December 18, 2016", 5.0, "Amazing sunset", "I thought this area would be much busier but there were only a few people there. The sunset and changes of colour over the bridge and surrounding are were amazing."], ["Reviewed December 13, 2016", 4.0, "Amazing view", "Nice to spend some time here. You will need a jacket in July. It has a breathtaking view and clean and fresh air. Good outdoor trip."], ["Reviewed December 4, 2016", 5.0, "WOW", "this is such an amazing experience visiting the famous Bixby Bridge. words can not discribe the incredible view. It is so breathe taking. something I will remember for ever. Make sure you visit both sides of the road as the view is totally different from both sides.\nShow less"], ["Reviewed December 1, 2016", 5.0, "wow", "Incredible experience driving over this bridge, views are amazing! You almost feel like you're in a movie"], ["Reviewed November 25, 2016", 4.0, "photographic", "This is what you will find if you look at images of Big Sur. Driving from the north you come acroos it very quick and can be driving on it before you know it. There is a small turn off that gets very busy, so if its full try the other side of the road. There is also a very good view of the bridge from the south which is well work taking.\nShow less"], ["Reviewed November 24, 2016", 4.0, "Experience first hand the place represented in Big Sur photos", "The drive from Simeon to Carmel is one of the most awe inspiring in the world. Shockingly beautiful vistas of the Pacific. Amazing hairpin turns and up and down. I wouldn't want to do it at night and you have to be careful, but it is an unbelievable drive and Bixby Bridge is one landmark that has been on every postcard.\nShow less"], ["Reviewed November 22, 2016", 5.0, "A road trip attraction.", "Driving on the bridge, it lasts a few seconds. But when I'm looking at it from short distance, it feels like it should last longer. Off to the side of the road after the bridge is a nice vista point that gets pretty busy. Some people will have to park on the dirt road on the other side of the vista point. But READ the signs. Parking is not allowed on one of the side of the road. There was highway patrol telling people that if they do not move, they will be getting tickets.\n\nAnyways, the bridge and the view from the vista point itself makes the entire attraction worth it. Definitely a nice spot to stop and stretch the legs.\nShow less"], ["Reviewed November 19, 2016", 5.0, "Beautiful bridge", "Made the drive up the coast and this was one of the spectacular views along the drive. Nice no cost thing to do in the area. Just watch up for the bikers that are sure to be sharing the road with you along the way."], ["Reviewed November 17, 2016", 4.0, "Worth a stop", "The view on the bridge was clear, but everything behind was covered in fog. Nevertheless, it was still pretty impressive and worth a short stop to take some pictures."], ["Reviewed November 15, 2016", 5.0, "Whoa, what a view", "Bixby bridge is a beautiful reminder of why the central coast is a majestic place. I always find time out of the year to spend quality time in the central coast. So thankful for the beauty that I witness when I'm here. I bring my family of 6 every year camping to Big Sur and I plan a camp out with friends next year. I can't wait to bring them up to see the Central Coast and all it's beauty.\nShow less"], ["Reviewed November 14, 2016", 3.0, "Bit of a let down", "With all the hype I had expected this bridge to be more dramatic and larger.\nIt is certainly iconic but, from the North it wasn't even signed as coming up soon and so we had to pull up and go back to have a proper look.\nShow less"], ["Reviewed November 14, 2016", 5.0, "Iconic bridge", "Travelling up Highway 1 we missed the pull in area before the bridge, but we pulled into the area after the bridge to take some photos. It’s amazing sight. Plenty of room to park up and scramble down the rocks to get some great photos."], ["Reviewed November 13, 2016", 4.0, "Great View", "The bridge is a reinforced concrete open-spandrel arch bridge. has an aesthetic design and graceful architecture and a magnificent view."], ["Reviewed November 11, 2016", 3.0, "One of many bridges on hwy 1...but may be the best viewed", "The Bixby Bridge is an icon on the coast highway and will be there for many years to come. Built in 1932 and retrofitted in 2000, it still maintains the original look and feel. Driving over the bridge which is only 24 feet wide gives you a sense of vertigo if you can look over the edge. Best photo opportunity is from the north side but don't miss a chance to photo from about 1/2 mile south.\nShow less"], ["Reviewed November 8, 2016", 5.0, "Great site on Highway 1", "A have to stop and look on Highway 1. Cannot imagine how they built it! Be sure to look up, down, east, west, north and south!"], ["Reviewed November 6, 2016", 5.0, "Just Appears", "From the North this just appears around a bend. You then have to quickly decide where to stop. This is, as has been said, the first iconic view of the Big Sur area and as such deserves a short stop to view it. Constuction is quite interesting as it appears to just grow out of the cliffs - certainly on the southern side. Take care if you are wanting a photo from the seaward side and it is busy. Too many self-stick wanderers clambering about fairly loose slopes. Great photos from both angles despite busy traffic.\nShow less"], ["Reviewed November 2, 2016", 4.0, "An Iconic View", "We had of course seen all the photos before arriving in Big Sur. The view was lovely. I would recommend viewing it from the northern side with the mountains in the background."], ["Reviewed November 1, 2016", 5.0, "One of the scenic highlights of the West Coast", "Absolutely loved spending some time with the view here. It is engrained in my mind as being one of the key moments from our trip. The best views are from the northern side, and parking seemed to be just by pulling off to the side of the road - wasn't a problem.\n\nStanding there, staring at the scene, it is the most dramatic meeting of land and sea that I could imagine; the Pacific power of the largest ocean on Earth meeting the mighty North American continent. This was one of the primary reasons for choosing this route up the West Coast. This view alone confirms why this the PCH is always such a compelling drive to take.\n\nThe high cliff faces rise, like soaring defensive sea walls, from royal blue waters below, and Highway One clings to the top of it, winding across it like a tarmac ribbon that has been dropped from the sky.\n\nA wonderful, wonderful sight.\nShow less"], ["Reviewed October 29, 2016", 4.0, "out of nowhere", "We came around the bend and there it was. I can't say the bridge itself is the attraction, rather getting there and the excitement of the drive and view."], ["Reviewed October 28, 2016", 4.0, "Essential Big Sur", "Perhaps the most recognizable site in Big Sur, and the most photographed spot along Highway 1. There is a large turnout/parking area where you can hop out to get your selfie, and you will definitely not be alone if you want to ask someone to take your pic. I was surprised by how lax people were about wandering onto the steep cliff or out on the highway, this is a place where I think you should pay attention to your safety as well as the surroundings because of the crowds and the traffic.\nShow less"], ["Reviewed October 27, 2016", 3.0, "Wow a bridge!", "If your coming from the north its the second bridge.\n\nGot to see the Bixby Bridge, wow a bridge. Yes, a very pretty bridge at that. The vista point was packed and I failed to see any info boards with a good story of history here and as to why its famous...\nShow less"], ["Reviewed October 27, 2016", 4.0, "Impressive engineering work", "The Bixby Bridge is on the CA 1 Highway, not very far from the Rocky Creek Bridge. It shows the impressive engineering work done. People go there for the sake of sight seeing. A good place for the photographers."], ["Reviewed October 26, 2016", 4.0, "Awesome place!", "Been there just for the sake of sight seeing, was a fun experience! Enjoyed the views from the cliffs of the bridge as well as the ocean! If you're a photographer, you'll probably be amazed by the sheer design of this marvel.\n\nMust visit and stop by for the views!!\nShow less"], ["Reviewed October 25, 2016", 5.0, "Great views", "Great place to stop and take some awesome pictures. You have the bridge which is a great structure against the mountains and water, it's absolutely beautiful. Definitely stop to take in this beautiful scenery."], ["Reviewed October 24, 2016", 5.0, "The Views are Spectacular!", "It is one of California's Must See places. Plenty of parking, but for the best picture, you must be careful not to slip over the side. It is real."], ["Reviewed October 23, 2016", 5.0, "Visit toBigSur", "The Bixby bridge is an iconic symbol of California that you see on commercials over and over again. It was great to see it in in person and it is as cool as the ads make it seem. The turn outs before and after were crowed but well worth the wait to take some great photos. This is a must see when traveling Big Sur!\nShow less"], ["Reviewed October 22, 2016", 4.0, "Impressive", "While driving down CA-1 S, you come to the Bixby Bridge. It's a very impressive structure dating from 1932. Is you travel south, there is a turnout just before the bridge to allow for photographs."], ["Reviewed October 17, 2016", 5.0, "Picture Perfect", "You can't drive the PCH without stopping and grabbing a picture of this bridge! Especially great at sunset"], ["Reviewed October 17, 2016", 5.0, "Dangerous selfie shots", "Please be careful when stopping here as it has become a virtual nightmare for the locals to navigate around the unrelenting stream of selfie takers. we have lieterally almost run over half a dozen tourists who dash out in front of on coming cars. If you have children? I would highly advise against making this a stop...you run a very real risk of one or more of you getting run over. Very sad never thought it would come to this but. we never stop there when we have guest visiting because its just a circus of people.\nShow less"], ["Reviewed October 17, 2016", 5.0, "Bixby Bridge", "If you're anywhere near Monterey or Carmel, do yourself a favor and take the 30 min drive down HWY 1 to the Bixby Bridge. It's exceptionally beautiful! Worth the stop - even if there is a crowd."], ["Reviewed October 14, 2016", 4.0, "Interesting bridge along the coast.", "Considering the year in which the bridge was built, it was quite an achievement to get it built. Interesting considering all the earth quake activity in California that after 84 years this bridge is still standing ! Suggest that the best place to take a photo of this bridge is at the turn out at the top if the hill located about one mile south of the bridge...maybe a little longer than one mile.\nShow less"], ["Reviewed October 11, 2016", 4.0, "Gorgeous vista point on Highway 1", "Fight the rest of the world to take a snap here....beautiful spot on the north side. Don't go too close to the edge though!"], ["Reviewed October 8, 2016", 5.0, "Great Views", "A Great Place to Stop for some great views up along the coast and to see an incredible bridge, Walk across the road for a better camera angle. also when approaching along the road go slow as there is not a lot of parking, well worth stopping.\nShow less"], ["Reviewed October 8, 2016", 5.0, "Brilliant!", "Had always wanted to see this bridge and the stunning countryside it sits in. We had a clear sunny day and spent an hour or so walking around admiring the view and the bridge. Ahead of its time, in its day!!!"], ["Reviewed October 5, 2016", 3.0, "Not as impressive as billed.", "I was expecting a lot more but this bridge is the same concrete design as loads of others in Western America. They come in all sizes big and not so big but all basically look the same. Bixby was shrouded in fog every time we went over it so photos were pretty pointless. Nothing to get over excited about.\nShow less"], ["Reviewed October 1, 2016", 4.0, "Jammed Out With Tourists But Still Exciting", "This bridge is a wonder and if you have a fear of heights, you should stay in your car. This iconic bridge is on many people bucket list and is worth it to walk around and soak in the views. The California wildflower were stunning all around when we drove this road in April. Find a way to go late in the day during sundown.\nShow less"], ["Reviewed September 28, 2016", 5.0, "you've all seen this", "Almost every car commercial has to have their cars crossing the Bixby bridge. Not the first bridge built, but the one built to last."], ["Reviewed September 26, 2016", 5.0, "Awesome sight", "Can't miss this! Really just the tip of the ice burg heading south. Indescribable. The coastal highway is breathtaking, even for an adrenaline junky."], ["Reviewed September 26, 2016", 4.0, "Always amazing", "Built in 1932 for under 200k, retrofitted against earthquakes in 1998 for 20 million, an art deco wonder and icon. Large parking area on the north side. There are concrete benches at the points where the towers meet the roadway, but there is almost no shoulder and it would be dangerous to walk there unless traffic was nil. There is a large turn out on the north side for parking.\n\nIf you wish to drive PCH1 through Big Sur I would strongly recommend doing it midweek and leaving very early. Many people with no experience driving curvy roads that hang on cliffs that drop into the sea, attempt to do so in rental motor homes. Getting out early also cuts the sun glare if you are attempting to record your drive. Put your camera on the outside, not through the windshield and enjoy your drive.\nShow less"], ["Reviewed September 26, 2016", 5.0, "What do you have to say?", "An iconic bridge along the iconic Big Sur coast. Stop and take a picture along with everyone else! We also got a great picture from the Rocky Point Restaurant about a mile north. Great place to stop and have drinks and food BTW"]]}}