{"Bridalveil Falls": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Bridalveil Falls", "url": "/Attraction_Review-g61000-d139181-Reviews-Bridalveil_Falls-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/39/b8/99/bridalveil-falls.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1224"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Beautiful!", "We were lucky when traveling through Yosemite in February. The weather was in the 60's and sunny. We stopped and took the short hike to the falls. It is well worth it. Beautiful view from the viewing area. Highly recommended!"], ["Reviewed 2 days ago", 5.0, "So beautiful!", "This is a great little walk for smaller children or those that cant do the longer, steeper hikes. The waterfall is beautiful! We were lucky enough to be there when the spray had frozen to the surrounding rocks to make gorgeous ice falls..."], ["Reviewed 3 weeks ago", 5.0, "Best waterfall picture spot", "We visited in June of 2017, when the waterfalls were full and active. Bridalveil fall had a double rainbow and made for amazing photos that looked like it was a backdrop not a real location."], ["Reviewed January 21, 2018", 5.0, "An Awe-inspiring Experience!!", "Bridalveil Fall is one of the most prominent waterfalls in the Yosemite Valley in California, seen yearly by millions of visitors to Yosemite National Park.[1] The waterfall is 188 metres (617 ft) in height and flows year round.[2]\n\nThe Ahwahneechee tribe believed that Bridalveil Fall was home to a vengeful spirit named Pohono who guarded the entrance to the valley and that those leaving the valley must not look directly into the waterfall lest they be cursed. They also believed that inhaling the mist of Bridalveil Fall would improve one's chances of marriage.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Beautiful but you are going to get wet!", "There is a trail that takes you to the base of the falls. The trail is pretty short but it is uphill. Be prepared for a lot of mist!"], ["Reviewed January 14, 2018", 5.0, "Short Hike", "This is a short hike along a paved path that takes you to the base of the falls. It is always enjoyable to take this short hike to see the falls and enjoy the sights along the creek that it forms. During the winter you may be able to hear the ice crack and fall during the day as it thaws. Keep your eyes open and look around the woods. I often see wildlife in the area.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Most famous NP waterfall", "The most visited and most famous waterfall of Yosemite NP. Really huge and amazing, easy accesible and simply enjoyable"], ["Reviewed January 3, 2018", 5.0, "Picturesque waterfall that is easily accessible.", "I suggest going off season, or at least, mid-week. Otherwise, a parking lot. The falls are an easy 5 minute paved walk from the parking lot. Once you reach the viewing area, large boulders and cold water await the thrill-seekers. We navigated the rocks and climbed to the top, to see the best view at the base of the falls, which was exhilarating. Be careful. There are many warnings about tourists being injured/killed climbing these rocks. Saw many tourists taking a quick tumble down the rocks into the shallow but cold water. The rocks are quite slippery so, wear boots or rugged footwear. I would still do it, again. :)\nShow less"], ["Reviewed December 24, 2017", 5.0, "Awsome Beauty & Serinity", "The falls were beautiful with the wisps of water floating down the face of the cliff. Moving from side to side By the wind, revealing interesting shapes in the icy formations. Plenty of people on this Saturday afternoon. Can't imagine the crowds in the summer months. Parking was available as we stopped at other sights. Unbelievable sights.\nShow less"], ["Reviewed December 19, 2017", 5.0, "In a good year it’s awesome, today just ok", "In a good year it’s awesome today just ok. Actually nothing in Yosemite is just ok. It’s a frame of mind. I try to visit each season in the Valley. Light snow in the winter, rushing stream in the spring. Warm days in the summer. And receding waterfalls in the fall. Just a frame of mind on what is superior.\n\nI enjoy Bridalveil Falls perhaps because it is the first fall visible from the overlook. Provides a sense of arrival in a mystical place.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Waterfalls are always nice", "There wasn't much water falling when I visited in September but it was still nice to see and only a short walk from the parking. I would strongly advise anyone not to go near the toilets, I have never gagged so hard."], ["Reviewed November 30, 2017", 3.0, "Nice Falls", "Nice little stroll to the falls. Water flow was a little weak, it probably flows strongest during the spring."], ["Reviewed November 23, 2017", 5.0, "Beautiful, tall water fall!", "Make sure you take the time to visit the falls when you are in Yosemite! You will not regret it! Beautiful, tall falls!"], ["Reviewed November 17, 2017", 5.0, "Beautiful and easy to get to", "This was the most touristy of all of the things we saw in the 3 days we were there. It is an easy walk (albeit uphill) to the Falls. Some people climbed up the rocks to get closer but the view from the end of the trail is very nice.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Incredible Waterfall in Yosemite", "These waterfalls are very famous. The flow this day was rather sparse, although the views and vistas are stunning. Better waterflow in the spring months when the snow melt has it running hard. Awesome place."], ["Reviewed November 13, 2017", 4.0, "One of the best parts of YNP", "The walks are all signed and graded, you would struggle to get lost! Amazing views. Best in spring - look on web for volume of flow. Scamble to base or steep long walk to top."], ["Reviewed November 10, 2017", 5.0, "Fall 2017", "The falls were almost dry when we went but there was a little water coming down. The scenery was beautiful!!! Walking paths were great!!"], ["Reviewed November 10, 2017", 5.0, "Bridal Veil Falls", "This waterfall has more water flowing in fall than Yosemite Falls. You can walk up to the falls for an closer photos."], ["Reviewed November 9, 2017", 5.0, "Another really tall set of falls just after you enter the valley", "These falls are nearly as iconic as Yosemite Falls. Sometimes they dry up late in the year; so spring and early summer are the best times to see Bridalveil. There is a short and easy hike to the base of the falls."], ["Reviewed November 7, 2017", 5.0, "Lovely falls with easy access", "This waterfall is close to the road with a nice paved trail so it's nicely accessible. The water fall is most dramatic in the spring with melting snow, but it was still going in October."], ["Reviewed November 6, 2017", 5.0, "Good adventure", "Really good adventure. As a family we climbed the rocks up to the fall. Fantastic! I am so glad I came here. This is something I will remember the rest of my life"], ["Reviewed October 29, 2017", 5.0, "Super easy", "Super easy short trail. You could drive and park in a lot or take a bus then a short walk and a well paved trial to the base. Great views and a beautiful fall."], ["Reviewed October 29, 2017", 5.0, "An impressive waterfall", "This is huge! You can see it from many places in the park or you can walk to the base from a parking spot in the valley."], ["Reviewed October 28, 2017", 5.0, "Good view and cooling mist", "This was one of the things I really wanted to see in Yosemite. I had read that this year was a good year to view it because of the rain and snow. When we visited in June, there was plenty of water cascading down. When we got closer, there was a cooling mist. The falls and the whole park expected my expectations.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Easy walk, nice views of the waterfall", "It is a short and easy walk to the base of the falls. If you are adventurous, there are some large rocks at the bottom that you can climb on to get even closer to the falls, although it seems that most people stop when the path ends. The falls are scenic and it is a quick stop and definitely worth a look.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Easy walk from car park", "Less than 10 mins easy walk on paved path. You can also see the falls. From the road but the path takes you closer. Some climb onto the rocks but the signs do not recommend you do this."], ["Reviewed October 23, 2017", 4.0, "Easy walk", "Bridal veil Falls, a short easy walk, not much water at this time of the year but still worth walking up there"], ["Reviewed October 21, 2017", 5.0, "Easily Accessible, Beautiful Waterfall", "We took the shuttle to El Capitan, and the trail to Bridalveil Falls was just a short walk across the street. The trail was moderately easy with a few rocks to climb over, and we actually walked back along the paved road, although you have to be careful because of the vehicles using the road. There was parking available if you chose to drive your car to the Falls, but since we were staying at Yosemite Valley Lodge, we used the shuttles to get around whenever possible to avoid the traffic and parking hassles. This was a very pretty waterfall that you could get very close to for pictures. Signs posted warning people not to climb on the slippery rocks up near the Falls, but of course, many people ignored them. We were able to get plenty of great pictures without taking any risky chances.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Bridleveil Falls", "Saw the falls as part of our journey up to Glacier Point. The bus driver stopped the bus as a bride and groom where actually having their photo taken in front of the falls. An amazing sight"], ["Reviewed October 19, 2017", 4.0, "A magical mist", "I'd recommend going in the Spring if possible - we went in August and (as our guide book indicated), there really wasn't that much water cascading down - it was more like a magical mist dancing in the wind.You can scramble your way up and over boulders, which is fun. Some people were also taking a dip in the pool at the very bottom of the falls. Make sure you're wearing proper footwear here though – not to be attempted in flip flops!\nShow less"], ["Reviewed October 15, 2017", 4.0, "Nice views, easy hike, busy parking lot", "Another must visit spot in Yosemite. The hike to the waterfall base is easy and short. The views are beautiful and very popular. Parking is a bit tough with lots of cars looking for a shortage of spots."], ["Reviewed October 14, 2017", 4.0, "Another popular attraction in Yosemite", "We had a nice walk up near the Falls. Not recommended for wheelchairs or people with difficulty walking, although one or two people with walkers were able to go to the view point."], ["Reviewed October 13, 2017", 5.0, "Very easy to get to", "There is ample parking here, and a short walk up to the base of the falls. Plenty of great spots to stop and take pictures. The rocks at the base of the falls are easily climbed to get a closer view of the falls. It was a bit crowded, but it was still very easy to get great pictures.\nShow less"], ["Reviewed October 12, 2017", 2.0, "busy place, better see it from far", "very busy place, not as good as the view from distance. it is a short walk though. you can skip it if you are tight on time."], ["Reviewed October 12, 2017", 4.0, "Easy walk, Scenic Stop", "Pulled over here on our way to our stay at Yosemite Valley Lodge. It was a very refreshing stop after a arduous but scenic drive through El Portal. This was a nice way to introduce ourselves to Yosemite Valley. There seemed to be fairly ample parking and the walk to the falls was pleasant and easy. It really is a beautiful waterfall and most tourists are pretty good about making room for you along the way so you can take it in as you approach. Lots of good angles for taking photos. I won't say it is breathtaking, but definitely worth the visit.\nShow less"], ["Reviewed October 11, 2017", 4.0, "One of the highest waterfalls in the world", "This falls can be easily viewed from various places within the valley or viewed up close and personal by hiking up a short trail to the base of the falls. Not a big flow in the fall when we visited but, based on some pictures that we saw, it is really magnificent in the spring / early summer. Certainly it is one of the easiest falls to view up close and, even at a relatively reduced fall rate of flow, is a beautiful waterfall.\nShow less"], ["Reviewed October 10, 2017", 4.0, "A very pretty waterfall", "After a nice short walk you end up at the pretty waterfall. The \"bridalveil\" is quite noticeable as a thin mist reaches a long way from the waterfall. We were there early April so the snow had started melting and the falls were very nice this time of year.\nShow less"], ["Reviewed October 9, 2017", 4.0, "Another easy hike to the base of a waterfall", "The trail to the falls is one of the first things you encounter once you are in the valley. Easy paved hike but crowded"], ["Reviewed October 8, 2017", 5.0, "Worth a visit", "Only ever visited the falls in October and so there isn't a lot of water. But it's still worth a visit. How many waterfalls do you get to see so definitely view this one. When the snow melts in the Spring this waterfall is gushing water but still lovely in the autumn\nShow less"], ["Reviewed October 6, 2017", 5.0, "Nice waterfall", "Not as big as Yosemite falls but it is pretty. You can walk a short distance and get close. Or you can get closer by walking on wet rocks- too dangerous for us. Can get some great photos of the waterfall."], ["Reviewed October 4, 2017", 5.0, "The closest to the road", "These falls were to closest to our road, imagine how many falls we have missed due to not doing any hiking. On a gorgeous day like ours, they appeared simply beautiful, majestic and elegant."], ["Reviewed October 3, 2017", 4.0, "An easy walk on a well paved path", "These falls are an easy walk from the parking lot of the same name, where there are limited rest room facilities. When we were there in late August there were a lot of visitors in the immediate area and the queues for the rest rooms were very long with many people holding handkerchiefs to their faces to avoid the unpleasant smell .\nThe falls themselves are spectacular even in August, earlier in the year the sight must be truly magnificent. Access to the base of the falls is by a well paved path for most of the way with a final scramble over rocks if you really want to get close, but the sheer number of visitors there at the time of our visit would present difficulties to any disabled visitors.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Got great photos of it", "From tunnel view we got a picture of a rainbow in the falls. It's just another amazing thing to see in Yosemite"], ["Reviewed October 2, 2017", 4.0, "Wispy and beautiful", "In early fall, Bridalveil has a wispy fall--not a thunderous gusher as in the spring. The water would go from side to side as the wind blew, just like a veil. A short, easy walk."], ["Reviewed October 2, 2017", 5.0, "Beautiful view", "WOW!! The Bridalveiw Falls is really a great trip! The falls are so great! It does not take very long to get there. Good turn-outs. No problem!"], ["Reviewed September 29, 2017", 5.0, "Beautiful. Short walk too", "We didn't have a long stay in Yosemite on our trip so we opted to see the sights that were easy to get to do we could see as much as possible. Nice little walk up rocky steps and path to the falls. It was very cool watching the mist since we went in September. Really did look like a veil on the rocks. Love it!\nShow less"], ["Reviewed September 24, 2017", 4.0, "Beautiful falls and close to the car park!", "Beautiful falls and only about 500 meters from the car park. A nice easy walk with a beautiful fall at the end!"], ["Reviewed September 24, 2017", 5.0, "Another amazing site", "I especially loved the way the mist moved to the winds truly making this look like a bride's veil on a windy day."], ["Reviewed September 18, 2017", 5.0, "Bridalveil Falls - Unbelievable!", "Bridalveil Falls was the main attraction we went to see. It was magnificent. We actually captured a beautiful photo we wanted to share with this review. All-in-all, the park itself is an astounding adventure; however, one should not miss stopping at the parking area for the best view. With a good camera and just a bit of magnification, one can see the entire falls including part of the basin where the water lands. Yosemite rocks!\nShow less"], ["Reviewed September 17, 2017", 5.0, "Short easy walk", "This was a short, easy hike to the viewing area of waterfall. Lots of people continued beyond the viewing area to climb up boulders and rocks."], ["Reviewed September 16, 2017", 4.0, "Wonder's of Nature", "We came here in September and will say that the falls were not at it's peak. I'm going to assume that it would be spring time as there is more rainfall during that time. When we were here there hadn't been a lot of rain over the past months.\nThis is still a busy area and beautiful to see. There were people climbing the falls, so I'm assuming it is accessible from some point. I'm not sure how comfortable I would be doing it. If you want to attempt it and can do it. Take the opportunity.\nShow less"], ["Reviewed September 14, 2017", 5.0, "fun to climb rocks", "easy to get to bottom of falls. fun to climb rocks to get closer (i was there sept. low flow season) but could be dangerous for kids and adults."], ["Reviewed September 13, 2017", 5.0, "A true wonder!", "Hopefully there will be plenty of rain if you go. This one is a must and great view from the lookout."], ["Reviewed September 13, 2017", 5.0, "Short walk from the footpath", "Absolutely stunning waterfall and an excellent example of a hanging valley. People were climbing on the rocks even though there were warning signs, they were very slippery. Just walk to the bottom and enjoy the view."], ["Reviewed September 13, 2017", 5.0, "Majestic beauty", "Majestic beauty . If you've been wanting to go here what are you waiting for ? Unless there's fires or are the roads are closed . I wish I want to braid it so long such a gorgeous place . I went in august . Drove up on a Sunday later in day when park started to clear out some which was nice because I did not experience any excessive traffic or crowds . First day was perfect , only disappointment was wildfires in the distant .\nShow less"], ["Reviewed September 12, 2017", 5.0, "Beautiful", "This is a very short hike worth doing, even in September when falls are not at their best. Climb the rocks at your own risk and be amazed by the beauty of Nature."], ["Reviewed September 11, 2017", 5.0, "another beautiful view", "There is a short but steep walk to the bottom of the falls. They are stunning but it can get crowded with people and your pictures are toast because of people getting off the trail and climbing the rocks around and to the falls. Still beautiful to look at.\nShow less"], ["Reviewed September 10, 2017", 4.0, "Pretty place, and easy to get to", "Pretty water fall and very easy to walk to. You have to be ready to get wet here, because the water sprays everywhere, but it's enjoyable in the hot weather."], ["Reviewed September 6, 2017", 5.0, "Great Falls", "Short pave walkway to view the falls. Take your time and anyone can enjoy the views. Because it is a short distance be prepared for crowds but stll worth the stroll."], ["Reviewed September 4, 2017", 4.0, "Good climb", "We climbed the rocks to reach the bottom portion of the falls. Challenging enough for a non-rock climber with slippery rocks. But worth it."], ["Reviewed September 4, 2017", 5.0, "Rainbows in the Air!", "The falls are gushing this year kicking up amazing mists and rainbows on sunny days. It's hard to get close to the falls themselves without getting totally soaked, so get as close as you can to feel the mist and hear the roar of the crashing waves of water. The day we were there Bridalveil Creek was a rushing river of whitewater rumbling down the hillside on its way to the Merced River in the valley. After visiting the falls, take the Wawona Road another mile and a half south for an amazing view of the complete falls from the Tunnel View overlook.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Beautiful", "Bridalveiw Falls is a beautiful place and Vista. When we were there the wind blew the waterfall from side to side. It was magical. It's accessible to strollers and wheel chairs. Great Place for pictures."], ["Reviewed September 2, 2017", 4.0, "Easy to get to, busy", "This is one of easiest places to park and a very short hike which means lots of people do it but you can climb the very steep rocks a little bit to get away from crowd. very pretty falls just floats down never touching the rocks\nShow less"], ["Reviewed August 31, 2017", 5.0, "Our favourite", "The Bridalveil falls are our favourite in the park, simply because they are beautiful to watch (especially when the wind picks up at the top and the watr does not even fall down but gets pulled upwards) and the many walking and climbing (be careful!) opportunities around it. A must-do when in the park!!!\nShow less"], ["Reviewed August 30, 2017", 5.0, "Spectacular Falls!! Love the misty spray the Falls create while on it's way down!", "when the falls are running it's one of the most attractive places to visit within the park!!There's been times in the past when the water level was low and the water fall wasn't that good but this year it's been awesome!! like some of the more popular attractions within the Park it does get crowded but with a little patience one can snag a parking spot close by and see this natural treasure!\nShow less"], ["Reviewed August 29, 2017", 5.0, "Water is high and it's been worth the wait; go quickly and see", "Breathtaking. To hear and feel the energy from the falls it really beautiful. Go early or late to try and avoid the crowds and get some solitary pictures. Having said that, the crowds give a wonderful party atmosphere to the place. Nobody is in any hurry to move on to their next photo op. Everyone is happy to help you get a great shot and it gives perspective to the intensity and fall of the falls. When you get the light right, it captures a rainbow through it's mist.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Excellent!!!!", "One of the best places in Yosemite... 5 minites easy walking from the parking... It is amazing to walk through the \"rain\" from the waterfall... You will be able to see a rainbow!!!!"], ["Reviewed August 28, 2017", 5.0, "Easy walk to beautiful falls", "Inside Yosemite National Park, you can park close to this falls, which can be visited after an easy 5 minute walk to them.\n\nOnce there, depending of the wind, you can be splashed by the water.\n\nCar park with WC.\n\nEasy access with stroller.\n\nI did not expect to find water because my visit was in August, but just check the photo.\n\nDon't miss it, it's a quick but a beautiful visit.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Gorgeous From Any Vantage Point", "One of the most amazing water falls in the West. Probably the most photographed Falls in the West. When you see it in person you will understand why, if you have never seen it before."], ["Reviewed August 26, 2017", 4.0, "Thundering spray of water", "You can walk up a paved path of the falls and stand in the cooling spray of water and listen to to roar. Good year for waterfalls after many years of drought."], ["Reviewed August 22, 2017", 5.0, "Great waterfall!", "It is spectacular when there is a lot of water. A short trail takes you to the bottom of the falls. There is a viewing area to enjoy the waterfall."], ["Reviewed August 22, 2017", 5.0, "May is a good time", "The water fall was in full stream apparently due to late snow and some rains. There were bits of snow in sheltered crevices on the tops of some of the peaks.\nIt is a gentle walk to the falls from the car park, even for a partially disabled visitor but not wheelchair accessible.\nYou could feel the mist from quite a way off and if you wanted you could get very wet at the top of the path. Nice warm day so no problem\nShow less"], ["Reviewed August 17, 2017", 4.0, "So easy and so beautiful!", "Such an easy hike in and such a beautiful waterfall. We did this at the end of the day and just laid back on a rock and watched variations in fall patterns with the wind changes...like it was dancing!"], ["Reviewed August 16, 2017", 5.0, "Continually Changing", "A short hike to see this amazing falls. The wind was really blowing and the falls continued to change shape and flow. Such a beautiful site."], ["Reviewed August 16, 2017", 5.0, "I'm a sucker for lovely waterfalls -- this one included", "It may not be Iguazu or even Victoria Falls but it is most impressive and clearly one of the highpoints of a visit to Yosemite. Well worth the 5-7 minute walk from the parking area (assuming you can find a parking place!). After walking up the hill to see it, upon your return down hill and walk to the third bridge (a few minutes away) for another fine vantage point.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Nice waterfall", "Did a 21km return walk from half dome village..beautiful place...no transport system other than by car in the off season...worth visiting though can be quite crowded"], ["Reviewed August 15, 2017", 5.0, "Worth the Short Hike - Gorgeous View", "BUT PLEASE BE CAREFUL PEOPLE.\n\nThe hike is an easy one. Parking, either in front on the Loop road or in the small lot on the road to Wawona is available.\n\nAs you will see in my pics, its an easy walk to the viewing point, but then you have people who climb the rocks and get closer to the falls.\n\nAs the sign at the bottom says....IT's DANGEROUS. I saw one person slip on the last step coming down and I have no idea how he didnt break three ribs or puncture a lung.\n\nIt is not a hard climb, but the rocks are wet, VERY SLIPPERY and there is not a flat stable path to the base of the falls.\nShow less"], ["Reviewed August 15, 2017", 3.0, "Not the best waterfall in the Park", "Not the best waterfall in the park but interesting none the less. The wind was blowing the falls nicely when we visited but it was all a bit underwhelming."], ["Reviewed August 15, 2017", 5.0, "Amazing", "This waterfall you can see from one of the main roads in Yosemite. It is most spectacular in the spring but always a beautiful sight to see."], ["Reviewed August 14, 2017", 5.0, "A short walk to a beautiful waterfall", "This is the longest fall in the US and quite spectacular. There are two paths, one to the base and the other to the upper part. The good news is that the lower part is a short walk. Wear Good hiking shoes because the rocks can be slippery.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Great Stopping Spot", "We went to the falls around 6:00 pm one afternoon. Much of the crowd had departed so we were easily able to find a close in parking spot. The hike to the falls was pretty easy and relatively level.\n\nStanding at the viewing site, you could hear and feel the falls. The spray was refreshing!\n\nWould recommend this to anyone - especially if you go when the crowds have left for the day.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Loved it. Best view.", "Got too closed to the waterfalls. We stayed for an hour and enjoyed the view and the sound of water falling. It was rocky and those big rocks were slippery but it's all worth it."], ["Reviewed August 11, 2017", 5.0, "Most beautiful waterfall", "We visited at the end of the day on the way back from Glacier Point, Sentinel Dome and Taft Point. It's a very short paved walk from the parking lot. The fall is truly beautiful and really looked like veils as the descending water hits the rocks in a way that spreads it out and creates layers and laced edges. A most mesmerizing sight.\n\nBeing one of the most visited places in the park, parking could be stressful and impossible mid day so go early or late to avoid crowds. We had no trouble finding parking around 5 pm.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Beautiful Waterfall", "We started by heading up Hwy 41 to Bridalveil Fall. The viewing area is about ¼ mile up a paved path to the base of the 620 ft waterfall. The path is a bit up & down, but is not difficult for the average person. This year was a high water year at Yosemite, so standing at the base of the falls was a bit exhilarating as the mist blowing off the falls made us run for cover after a few minutes. Since it’s so easy to access, the viewing platform was quite crowded making it difficult to enjoy. Fortunately, our next stop provided an overall better view of this waterfall from a distance.\nShow less"], ["Reviewed August 7, 2017", 4.0, "EASY ACCESS/STROLL TO THE BASE OF THE FALLS", "Definitely stop and enjoy along the road into Yosemite Valley - note: you will get wet (lots of spray from the falls)"], ["Reviewed August 7, 2017", 5.0, "Beautifull waterfall", "The valley is full of water falls . this is one of them. It is easy to get to and well worth the visit for some spectaculat scenery."], ["Reviewed August 7, 2017", 3.0, "Beautiful!!!", "Stopped in for the day. We were headed to Lake Tahoe from San Francisco. It was a busy area. The falls were seriously beautiful. But, as a 'no trace' camper and hiker, I was sad to see people walking off the paths, leaving garbage and carving into trees. I would have loved to see a Park Ranger there to discourage such behaviors.\nShow less"], ["Reviewed August 6, 2017", 4.0, "Beautiful", "Great place to visit. Absolutely beautiful. Lots of rocks to climb on. Easy walk from the car park (which gets very busy). Toilets are grim."], ["Reviewed August 5, 2017", 5.0, "Tallest Falls in the US", "The falls area was a lot of fun. Not only was the falls beautiful and majestic but there is a place among the rocks where the kids can walk in the water and rocks, making the area more interesting. Great photo opportunities."], ["Reviewed August 3, 2017", 5.0, "Beautiful!!", "What a beautiful sight!! You can see the falls from the parking lot (which was full, we had to park down the road a bit) but then there is an easy, short trail to get closer to it. Lots of picture opportunities along the way, and a few spots that you can even get close to the stream. A good place to stop on your drive through Yosemite to stretch your legs and check out the sights!!\nShow less"], ["Reviewed July 31, 2017", 5.0, "Easy hike", "You're not going to find an easier hike in Yosemite. Park your car and look up and you're practically there. Follow a very short path and you'll come upon the base of the trail. Be careful walking along the rocks but you'll get great views of this beautiful waterfall. Go early as the parking lot gets packed around lunchtime and stays that way through the afternoon (with traffic spilling out toward tunnel view).\nShow less"], ["Reviewed July 30, 2017", 5.0, "One of the many beautiful falls in Yosemite. Short and easy.", "Perfect hike for the non-experienced hiker, i.e., great for a senior, although one can continue to make this hike more strenuous. We met people from all over the world."], ["Reviewed July 29, 2017", 5.0, "Short easy walk to a beautiful falls", "This was a short walk to the falls. Some people were up on the rocks getting closer. There are signs advising against that. It was crowded but not as bad as Yosemite falls was. Pretty waterfall."], ["Reviewed July 28, 2017", 4.0, "short, up hill hike", "Bridalveil is a beautiful waterfall.\nIt can be reached by a reasonable hike, but it does go up a grade.\nIn July, a number of people took time to dip their feet or wade in the creek that flows quickly down hill next to the path to the falls. There are shallow, safe pools of water where a person is not at risk. The water is very cold.\nShow less"], ["Reviewed July 27, 2017", 4.0, "Short and sweet", "We had a packed itinerary, so we only left a few minutes for this part, but we are glad we did stop. Parking later on in the day can be hectic but manageable if you are patient enough. Like all these other places bring water and sunscreen if a hot day.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Picture perfect!", "Our family took a picture in front of the falls and everyone thought we were in front of a fake backdrop! It is just that beautiful. We sat off a trail with a beautiful open field in front of us."], ["Reviewed July 26, 2017", 5.0, "Beautiful and a \"must see\" in Yosemite!", "When visiting Yosemite, you must stop to just see the falls as they are really spectacular as are many of the other features of this national park."], ["Reviewed July 25, 2017", 5.0, "The rainbow was transfixing", "We got there around 5:30 pm and the crowd had thinned out. The sun was in a right position to make a huge beautiful rainbow."], ["Reviewed July 21, 2017", 4.0, "they say if a single woman", "Approach the fall and the water falls near her she will get married. Old lovely Indian story. But we did see some women surround it... i guess they were looking for it to be truth"], ["Reviewed July 20, 2017", 4.0, "Best Seen from the Road or from Valley View", "You can't help but see Bridalveil Fall on any trip to Vosemite Valley as it can also be seen from most areas of the Valley aswell as Tunnel View. It is a beautiful Fall but it is best seen from the road rather than walking the short trail towards it.\nShow less"], ["Reviewed July 19, 2017", 4.0, "In the postcard I have to see it", "This is the waterfall that is on the right when you see The postcards and magnets in souvenir shops! Google how to get here and watch out for a small parking lot. Very easy to get to and wheelchair accessible. Pet friendly. Adventurers can 'rock scramble' close to the base of the falls at their own risk. Read the signs and know that people do get seriously hurt when they take these risks. The parking lot bathrooms are less than desirable. Great picture area and naturally cool place to hike on a summer day!\nShow less"], ["Reviewed July 19, 2017", 4.0, "Beautiful", "If you like catching waterfalls, this is a great stopping point. The trail was least crowded of most the hikes, and the hike is simple and quick."], ["Reviewed July 18, 2017", 5.0, "So refreshing", "Come on a hot day and enjoy the cool mist raining down on you as a reward for the small hike to view it. Slather your face like a veil of coolness"], ["Reviewed July 17, 2017", 5.0, "Easy to access, epic waterfall", "This waterfall was by far the easiest to access in Yosemite. It's just a short 5 minute walk from the parking lot. The waterfall is pretty epic (it's reallllly tall).\n\nYou will get soaked if you want decent pictures of the falls. The mist rains down pretty hard on the main observation area. So be prepared with a towel and swimsuit.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Beautiful tall falls", "Stopped here on our way out of the valley for a quick peek. Lovely tall falls with plenty of water coming down. Paved but steep at the end."], ["Reviewed July 13, 2017", 5.0, "Stunning place!", "The Yosemite valley is beautiful,and these falls are vast.....it is well worth the short trekfrom the car park to the base of them and immersing youself in the spray...take a picnic and literally soak up the atmosphere!"], ["Reviewed July 12, 2017", 5.0, "Simply Beautiful", "Went to Yosemite with my wife two days ago. The park is beautiful and very busy on a weekend a must see stop would be Bridalveil Falls. We had a good winter this year so there is plenty of water coming down. If you haven't been before it's a must you will love it.\nShow less"], ["Reviewed July 11, 2017", 4.0, "An easy waterfall", "This place is crowded and finding a parking slot might take a while but as it is on your way to Yosemite Valley and this waterfall is right next to the road, you should visit it.\n\nWe came here around 11.30 AM and were lucky enough to get a spot for our car as the parking lot was packed. This sight is a pretty fast stop as the waterfall is less than 5 minutes walk away from the parking lot which also meant that people were both coming in and leaving out in a pretty fast pace.\n\nIt's a beautiful waterfall with a nice river and you can get right on bottom of it. The road has a pavement so you can reach it with a wheelchair too. Remember to take a rainjacket with you because you'll get wet at the bottom of the fall. In May, there was also a lot of water on the parking lot.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Beautiful falls", "Heavy snow melt provided for a fantastic display of the falls. Didn't want to leave and will definitely return."], ["Reviewed July 10, 2017", 5.0, "Wonderful!!", "The falls were in full force. Just wonderful!! The only issue was the amount of people. It can be difficult finding a parking spot during the peak season."], ["Reviewed July 7, 2017", 5.0, "Breathtaking", "The falls this year are amazing. I was told it is because of the massive snow they had during winter. When you get closer up to the falls, you can feel the coolness and mist from the falls. The river running along down below the falls is so peaceful and serene. Great place to stop and soak it all in. There is no better sound than that if a running river and seeing Nature at its finest. Even saw a blue woodpecker hopping around the rocks. Truly awesome sites here\nShow less"], ["Reviewed July 7, 2017", 5.0, "Just amazing!", "This area is a must see. Park your car and make sure you bring a very good raincoat and umbrella or you will get soaked! Also fantastic waterfalls and walking."], ["Reviewed July 7, 2017", 4.0, "Stop on your way in", "We had driven from Wawona, driven Glacier Point Road and stopped at Tunnel View and then we hit a traffic jam. It turns out it was due to people lining up to turn in to the parking lot for Bridalveil Falls. We decided to go ahead and stop, too; the parking lot was full so we just had to patiently wait for a parking spot to open up. Our entire stop only took about 45 minutes so turnover in the parking lot is steady.\n\nYou can walk up a sidewalk to a viewing platform at the bottom of the Falls; however, you will get wet if you are visiting in May as we did. OR you can walk up a wide path and view it from a bridge and only get a light mist.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Truly amazing", "Everyone visits these falls and you would be mad to miss them, just amazing and worth getting wet for!!"], ["Reviewed July 5, 2017", 5.0, "Beautiful, beautiful, beautiful!", "This fall was so full that the runoff was in the parking structure and you had to wade through it to get to the trail. Totally worth it! Walked up the trails on both sides of the stream and just loved the photo ops (not to mention the heavy, heavy waterfall mist)!\nShow less"], ["Reviewed July 5, 2017", 5.0, "To easy way or the hard way?", "You pick how you want to experience them but I will go for the hard way, unless you can't really get through crazy rocks along the way but if you can definitely try to see them up close!! Over all this is a great stop when coming to Yosemite! I mean being in Yosemite is enough but visiting the popular spots is even better! Over all I enjoy coming here and I will continue to come as long as I can!\nShow less"], ["Reviewed July 4, 2017", 4.0, "Beautiful Waterfall", "Hubby and I walked around the area before going up to the falls. Lots of squirrels running around the rocks. Not a difficult walk but a slow rise up to the falls. We stopped and sat a few times to take in the view of the streams and watch kids climb the rocks across the water. Great place for a picnic. Shade along the way and a nice cool mist when you reach the falls. Very enjoyable.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Wow!", "When we visited in June the falls were probably at their peak. You can see them from many view points and the sheer size is probably appreciated best from tunnel view. The falls are nature at its finest. Sheer beauty!"], ["Reviewed July 2, 2017", 5.0, "LAKE TAHOE, YOSEMITE, SEQUOIA TRIP", "Beautiful waterfalls in June of 2017, with heavy water flow. There are several views from Yosemite Valley, and a great view from Tunnel View. We have been here 3 times: 2011 great water flow, 2015 not enough water flow to take a shower and 2017, all trips made in June. Best time to come is after heavy winter snowfall. Hiked to falls from Yosemite Valley Loop Road, 0.4 miles each way, it was hot day mist from falls very refreashing. This is a good way to hike to falls, as parking lot is almost always full.\nShow less"], ["Reviewed June 30, 2017", 4.0, "Nice view", "It's an easy walk (less than 30 minutes with 50+ parents) from the car park to the fall. But there are some notice signs saying it's dangerous to walk too close to the fall as some people broke their legs before. Be safe!"], ["Reviewed June 30, 2017", 5.0, "Wow", "Just a short walk to these falls and Wow! This is one of the most beautiful places in the world. After seeing the falls, take time to hike the creek below it."], ["Reviewed June 29, 2017", 5.0, "Lots of water in late Spring / early Summer.", "Short hike and wonderful view below the falls. It took a few minutes to find parking on the Wednesday we went. So, I would suggest visiting early or late."], ["Reviewed June 28, 2017", 5.0, "Sight seeing", "This is a must see if you go to Yosemite national park,there are many falls in Yosemite depending on the time of year,(June being the best)there are more with the melting of the snow,any time is a good time to see Yosemite."], ["Reviewed June 27, 2017", 5.0, "Record Snowpack, Plus 100+ Heatwave,.= Go Now if You Can!", "The record snow/rain fall the Sierra Nevada range got this winter, combined with the 100+ heatwave makes ALL of Yosemite a amazing experience right now, that if you have the opportunity you absolutely should brave the crowds to experience it.. . We had been in San Diego for weeks with family and my beloved uncle who were losing to stage 4 pancreatic cancer. and on the way home we felt we needed to stop in to our favorite spiritual temple Yosemite. We really didnt even think about the heat,.. or the snowpack or that its summer peak season.\nBut when we got to Briaveil........The wind. that waterfall.\nWe got SOAKED!\nWe got what we came for.\nWe got what we needed from Yosemite.\nWe got kissed by GOD!\nShow less"], ["Reviewed June 26, 2017", 5.0, "Near perfect like a veil", "How these falls look at the top. An elegant granite slope with water rushing over in a near flat stream. Yet crushes on rocks like any other so the sounds are tremendous nearby and you get wet.\nDon't mind the idiots that still get on the rocks. Even the normal path can be a trip hazard and medical assistance is not nearby. One calls that stupid as most are kids with parents nearby??\nThe falls are also visible from Capitan meadow and the veil reference is even more pronounced.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Marvelous Bridalveil Falls", "Bridalveil Falls can be viewed from afar, the street or close by. It's very high, beautiful from wherever you see it."], ["Reviewed June 23, 2017", 5.0, "Bridalveil in all its Glory", "Last time we were here, Bridalveil was nothing more than a trickle, but with this years above average Snow Pack it has returned to all its glory and was showing off. Only downside was when we arrived, so did two tour busses bull of (non-english speaking) tourists\nShow less"], ["Reviewed June 20, 2017", 5.0, "Mist mist mist...", "It's 0.5 miles walk mostly from road and easily reach there. Feel the mist of the water. Wonderful place. Everyone loves the falls due to the accessibility. Kids will enjoy the lot."], ["Reviewed June 19, 2017", 5.0, "Beautiful falls - short walk up!", "Very nice to be able to go upfront and view the falls. It's not a big space up there to stand for a long time - you get a bit of mist and wet if you stay to long and get too close.But it was beautiful.\nShow less"], ["Reviewed June 16, 2017", 4.0, "Beautiful location but don't forget that waterfalls are seasonal", "We visited Yosemite in August 2016...beautiful time of year to visit the national park but sadly the waterfalls were pretty much non-existent, and all I saw here was a small spray, which was a bit of an anti-climax, however the trail to the falls was very pretty with lots of birdlife around , such as the beautiful Stella's Jay. It's well worth stopping and doing the short trail to the falls (around 10-15 minutes walk) but I suspect that spring is the best time to visit if you want to see the waterfall in all its glory.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Worth the trip even if this is all you see.", "It is a short hike and the view is magnificent. Stay on the trails! Be safe, don't leave on a stretcher.\n\nThere will be a crowd. Parking is an issue. Get to the park as early in the day as possible. This is a VERY short hike to see a magnificent fall.\nShow less"], ["Reviewed June 16, 2017", 5.0, "How many times can you say beautiful", "So much water this year. Very short walk. Parking can be difficult at this spot. Even in midmay weekday we were waiting. Worth the short walk. Mist was great."], ["Reviewed June 14, 2017", 5.0, "Short trail to a pretty waterfall", "The walk to bridalveil falls is very easy and good for families. You get wet at the end of the trail, but it's not bad. There are also many angles for pictures of the falls to be taken."], ["Reviewed June 14, 2017", 5.0, "Short walk", "The falls were super cool and you can go up to the bottom of the falls and it is not a far walk. I definitely recommend the short walk from the road to go see the falls."], ["Reviewed June 13, 2017", 5.0, "Can't miss the falls in Yosemite!", "After a 6 year drought in California and heavy rains this past winter the falls are fantastic this year due to late snow melt. Not to be missed!"], ["Reviewed June 12, 2017", 4.0, "Crowded and flooded but rainbow at the falls", "Bridalveil Falls is 0.5 mi/0.8 km roundtrip from the parking lot to the base of the waterfall. The trail is paved and flat and is rated easy.\n\nWe visited Bridalveil Falls around 6PM on the Saturday of the extremely busy Memorial Day weekend. The tiny and insufficient parking lot was completely full, and we parked on the side of Wawona Road. Due to the record amount of snow and rainfall in the winter, the snow melt caused the parking lot to flood. We wore waterproof hiking shoes and had no problem getting to the waterfall, but many people had to walk barefoot or simply turn around. Watch out for flood warning.\n\nAlthough it was very crowded at the base of the waterfall, the rainbow over the falls made it worthwhile. There is so much water and spray this year that a rain jacket or poncho might be a good investment. You will need it on the Lower Yosemite Falls Trail and the Mist Trail as well.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Beautiful falls", "When you are in Yosemite, this is another experience to have. Walking through the slope, you will experience the Falling water from the mountain"], ["Reviewed June 12, 2017", 4.0, "Go Early", "This is one of those attractions you need to get to either very early (before 0800) Or later in the afternoon (after 1700).\nThe falls are beautiful & definitely worth a stop.\nWe got there about 1430, but it happened to be raining pretty hard & everyone was leaving. We got a parking place pretty easily.\nThe pit toilets are foul. Hold it until you get to your next stop.\n\nIf you want a picture of the falls from a distance : as you're leaving the valley on Northside Drive. Past El Capitan, past El Capitan bridge. There's a pull out directly across from Bridleveil Falls. It's a long one, but can fill up. We stopped there & got some nice pics of the falls & of El Capitan. We also pulled out our lawn chairs & chilled by the river for a while. It was a good afternoon!\nShow less"], ["Reviewed June 11, 2017", 5.0, "Rare fullness this year", "Usually trickling, Brideveil is best I have every seen it during the summer. Usually by mid summer it is just a minimal falls."], ["Reviewed June 10, 2017", 5.0, "spectacular water fall", "can be seen from a distance and the more you near the place the more it looks spectacular. even in the dead of winter the water still flows and the white snowy water was captivating to watch. nice to take plenty of phots"], ["Reviewed June 10, 2017", 5.0, "well worth getting wet.", "Our tour guide got us here in no time at all. We had a large group with different level of hiking skills. Our guide was patient and took the time to get a few up to the nearest view of the falls. Kids enjoyed getting wet!\nShow less"], ["Reviewed June 7, 2017", 5.0, "Particularly Spectacular This Year", "The heavy snowfall has made the falls truly spectacular this spring. The walk to the base is not too long and is a lovely walk all in itself. Because of all the water, even the creek running from the base is full and exciting. If you want to get very close, bring rain wear or plan to get wet, but the fall is truly awesome.\nShow less"], ["Reviewed June 7, 2017", 4.0, "One of many good waterfall options in Yosemite", "Very short paved path to get to the waterfalls. We went early in the morning and almost had it to ourselves. Good quick stop before heading to your next destination."], ["Reviewed June 4, 2017", 5.0, "Wet and Wild", "Late afternoon is the best time to visit this site; i.e. when it is full lit by the western sun. An easy walk from the parking lot takes you up to the base of the falls, where you will get drenched. Definitely a must-see."], ["Reviewed June 4, 2017", 5.0, "Viewed", "From differing parts of the Valley floor this was a constant source of wonderment. Most photographs simply don't do it justice."], ["Reviewed June 4, 2017", 3.0, "Short hike, very little falls (Sep 2016)", "A short, easy hike - paved, though some steeper areas that may require a little effort if pushing a stroller or in a wheelchair. Unfortunately, very little water in late September of 2016."], ["Reviewed June 3, 2017", 5.0, "Perfect photo spot!", "Visited with the family in May and this was one of our favorite photo stops! Quintessential Yosemite!"], ["Reviewed June 3, 2017", 5.0, "Gorgeous under the right conditions!", "We were very fortunate to visit in spring of a year when snow pack is 177% of normal and they have had a wet winter. Bridal Veil Falls was spectacular! Not just the Falls itself but the springs at the base going under the bridges were rushing and gorgeous! We took lots of photos just in this part of the site. The walk up to the Falls is a little steep so may be hard for older folks or those with bad knees. When we got to this part of the trail the mist from the Falls was much more like actual rain. As we made it to the top it was like standing in a storm on the Oregon coast! Phenomenal! Bring a poncho or parka or at least be prepared to get wet if you go during good conditions. I'm sure it is disappointing if it is dry but just plan accordingly.\nShow less"], ["Reviewed June 1, 2017", 4.0, "You will get wet", "The falls are thunderous in late May due to the melting snow. You can view them from the lower path but if you go up to the viewpoint right below the falls, you will get very wet. A combination of wind created by the water and the spray from the full hitting the rocks guarantees you will get soaked in a short space of time.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Great flow and easy and beautiful walk from lodge", "The falls were a highlight and the walk back and forth was fantastic. Enjoyed the streams and birds along the way. Rain poncho is needed for closeup views. Did not walk to the top but stayed on the paved trail"], ["Reviewed May 30, 2017", 4.0, "The abundance of rain caused the waterfalls to be amazing", "We saw lots of waterfalls and they were all amazing because of all the rain. Bridalveil Falls was no exception."], ["Reviewed May 28, 2017", 5.0, "wear a parka", "the trail is very short but pretty walk up the creek and when you get there the mist is very heavy and you will get wet"], ["Reviewed May 27, 2017", 5.0, "Bring a poncho", "This waterfall is almost nicer to see from a distance because up close it is very wet and cold! Still worth the short walk up."], ["Reviewed May 27, 2017", 3.0, "Outstanding Attraction but Poor Transit Options", "Outstanding waterfall and white capped rivers. This was the most amazing spectacle of scenic beauty I had seen in years. It was great to take videos of the rushing waters. This has been the best year to visit Yosemite in years thanks to the heavy rains and the end of the drought. Transit from the park boundary is not the best. We were misled by locals who directed us to a YARTS stop that was only served by request. We called to request service but we're unable to get through to either a live person or an automated stop request. We ended up waiting for hours to get into the park and access attractions. The National Park service really needs to add large parking lots 2 miles in advance of the park entrances with convenient and logical access to YARTS to incentivize transit use and significantly reduce private automobile traffic into the park. We also need passenger rail between the Fresno and Merced Amtrak Stations and the YARTS facilities near the park entrances.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Be ready to get wet on this trail", "This is a short, but great hike. You can do it in just a few minutes - less than 20 anyway. Go up and stand by the rushing waters of the falls, then backtrack and go down by the bridges and take some shots of the water in the creek below. Worth the stop.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Great falls with parking in central Yosemite", "Located on the road between Tunnel View and Yosemite Village, the falls are breathtaking but not quite as impressive as Yosemite Falls. If you're driving through the parking is right next to them however and then it's a short walk up to the base for some stunning views.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Short walk on blacktop to huge falls.", "Due to all the extra snow and melting the falls are all flowing with lots of volume this year. We went in early May and there was at least an inch of water flowing over the parking lot and sidewalk to get you to the falls. Prior to even getting to the end of the trail near the falls there was a heavy mist and then it was like a shower. Very impressive falls! Easy walk, if its not flowing over the path, and short distance from the paved lot.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Like Never Before", "I have seen Bridalveil Falls many times and it was always true to its name - wispy and light like a veil. This trip - during high snow melt, it was totally different - a full blast of a waterfall in all its glory. Go soon!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Accessible a back way (not via the parking lot)!", "We always go to Bridalveil falls because it is such a short hike, but I only recently discovered you can park alongside the road and there's a back way (not through the chaotic parking lot). Winning! There are also multiple shady spots around this area that are fun to picnic on.\nShow less"], ["Reviewed May 22, 2017", 5.0, "This is the Year to View Waterfalls!", "Every waterfall in Yosemite was emptying water like never before. What a perfect time to visit this May. We waited 16 years to see the waterfalls and were not disappointed. A great stop indeed with mist on your face for much of the trail."], ["Reviewed May 21, 2017", 5.0, "Wet and worth every second", "A fantastic water fall. An easy walk to get close, but then it gets very wet. It is worth every second. Yosemite is a must see location."], ["Reviewed May 19, 2017", 3.0, "Just another fall", "It is similar to most other falls you might see. But luckily you don't need to visit\nit by going out of the way. It is enroute to Yosemite valley. The place is not\nvery well marked, so you better ask or read a few boards to confirm what you are\nlooking at.\nShow less"], ["Reviewed May 19, 2017", 5.0, "Bridalveil Falls", "Another beautiful falls. Come prepared to get wet. The mist is beautiful, surrounded by huge Ponderosa pine, Cedar, and for trees. A nice path leading to the falls."], ["Reviewed May 18, 2017", 5.0, "Awesome", "This was one of the most beautiful spots that I have ever seen. You can see it from the tunnel view in the distance. And you can pull in the lot and walk a short path up. Right up to the base of the falls. I was there in the spring and there was a lot of water. So much that the path and parking lot were soaked. It's really awesome.\nShow less"], ["Reviewed May 18, 2017", 5.0, "A sparkling jewel", "Always awe inspiring and beautiful. Bridalveil is my favorite of all the Yosemite waterfalls. I have visited many times in all seasons and except for the driest of years, even in the fall there is always some water flowing. Great little hike to the base. For best photos take the hike or go past the parking area for the falls.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Stands to its name :)", "This waterfall welcomes you on your trip through the Yosemite walley. It is beautiful in the morning mist, nevertheless, we liked it the best together with El CApitan and Half dome in one sight."], ["Reviewed May 17, 2017", 5.0, "Great spot", "Even though it is tough to view this upclose, I loved the small trail that goes near it. The sense of rain the sound of rushing water is all serenity... Parking can be horrible, but it is worth the wait."], ["Reviewed May 17, 2017", 5.0, "Outstanding water flow in April", "Due to the high amount of rain and snow, the waterfalls were magnificent. We were told that after July 4th, the water flow may be down to a trickle. Much of the park was closed due to snow but I highly recommend a Spring visit if you interest is in the waterfalls .My pictures are better than this one.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Beautiful and Easy", "This trail is a short easy walk to the viewing points. Very misty in spring, so be prepared to get wet!"], ["Reviewed May 16, 2017", 5.0, "Gorgeous falls!", "We walked right up to the falls in only a few minutes, but we got soaking wet from the spray in the falls. The parking lot was also a bit flooded from all the recent melting. Beautiful walk and view! Wear your waterproof boots!"], ["Reviewed May 14, 2017", 5.0, "Excellent now that the drought is over", "The hike there was well worth it. The spray from the falls is very refreshing. They are really following at this time."], ["Reviewed May 13, 2017", 5.0, "beautiful!", "It was spectacular! the spray from the falls could be felt a far distance from the actual falls. Be sure to bring along/ wear a waterproof layer (for the head as well) as you are bound to be soaked!"], ["Reviewed May 8, 2017", 4.0, "Park on the main road right now", "Water is great, parked on the main road to walk in. Easy little walk to a good view of the falls. People of all ages were enjoying this."], ["Reviewed May 7, 2017", 5.0, "Mesmerizing", "Beautiful,beautiful place to visit in your trip to Yosemite! We went to the lookout by the falls, got soaked but it was so worth it!"], ["Reviewed May 2, 2017", 5.0, "Stunning view", "Interesting to see why it was called Bridal Veil Falls, got some great photos and the board explaining its name and how it was formed."], ["Reviewed May 1, 2017", 5.0, "Running Fast and Furious", "We have been here before. We have never seen the flow we saw this time. Almost impossible to get up close and personal as we got soaked and our camera lenses was useless. Even part of the parking lot was flooded. Having said that, we loved it. What an experience.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Stunning!", "Get prepared to get wet as when the waterfall crashes at the bottom, spray and mist go flying. I was lucky enough to see the falls light up with a rainbow as the sun hit it. One of nature's most impressive places."], ["Reviewed April 30, 2017", 5.0, "Water Wonderland at Yosemite", "Never before the recent strong spring rains this year 2017, have I seen the impact of water on the park. The Merced River was a torrent of white rapids, no kayaks, or other craft seen. Mirror lake full of water, a first for us. Yosemite Falls and Bridalveil were spectacular in full throated display. Who knew that Yosemite had so much glorious water?\nShow less"], ["Reviewed April 30, 2017", 5.0, "Impressive falls.", "Just park your car and walk the train to this impressive fall. It will only take half a mile. It is one of the most beautiful falls in the park."], ["Reviewed April 29, 2017", 5.0, "Soaked in The Mist but an Amazing View!", "We visited in late May and walked up to the viewpoint from the car park.\nIt was very busy but we were lucky to be able to appreciate the falls at the height of their power!\nWe got soaked in the mist but it was an amazing perspective and well worth seeing close up!\nShow less"], ["Reviewed April 28, 2017", 5.0, "Wet trip", "This is a short walk up an asphalt trail to the base of Bridalveil Falls but it is beyond wet. Make sure you have waterproof boots & a rain jacket. It is really wet this year. When you get to the base it will be hard to see anything since it is so wet & misty. Better views of the falls are available in other areas of the park.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Prepare to get wet!", "Granted, we were there on a cold rainy day but once you took the short walk to the falls, you need to be prepared to be drenched - we were all wearing raincoats and still got soaked. Worth it though!!"], ["Reviewed April 27, 2017", 5.0, "Oh My Word!", "Wear shoes that can get wet and even a light rain jacket. You are going to get wet if you go like we did after they received a lot of rain in California. After a 5 year drought, we went at exactly the right time. The falls were billowing just like a bridal veil.\nShow less"], ["Reviewed April 25, 2017", 5.0, "Beautiful, Accessible Falls", "Bridalveil Falls is an easy hike from the parking lot. There are views from all around the park of this waterfall. Be aware that as you get close to the bottom, the spray is heavy. It's next to impossible to get a shot here without getting mist on your lens. I was soaked & loved it!\nShow less"], ["Reviewed April 24, 2017", 5.0, "Be prepared to get a little wet", "The walk is short and pram friendly. The falls are beautiful, but the spray comes into the path which can get you a bit wet. We'll. Worth it."], ["Reviewed April 23, 2017", 5.0, "Stunningly Beautiful", "Really pretty falls and we'll worth a visit. Like almost everywhere you stop in Yosemite National Park you will be wowed by the incredible views of the peaks, water and forests . Bridalveil Falls was one of the first places we were to on the advice of the visitors centre and how right they were!\nBeautiful, peaceful and majestic it truly was a wonderful place to behold and we'd recommend it to anyone without hesitation.\nShow less"], ["Reviewed April 22, 2017", 4.0, "Running HIGH!", "The water in April 2017 is running very high. Expect to get WET. As in pouring rain before you even get to the falls. Bring a poncho and stand under the spray. The view from just pas the parking area is dry, but fantastic too. Super short.\nShow less"], ["Reviewed April 22, 2017", 4.0, "Beautiful falls", "The falls look so stunningly beautiful it makes you want to walk to the base and dive in! I imagine the water is very cold though.\nThe whole of Yosemite is so beautiful and so easy to access and not expensive for what you can do there all day\nShow less"], ["Reviewed April 22, 2017", 5.0, "Loved it", "It was the spur of the moment. We went completely unprepared and still managed to enjoy everything Yosemite had to offer.\nIt is amazing, the nature, the waterfalls, the views, the sunsets....everything was beautiful.\nIt should be a must on your list.\nI'd do it again.\nShow less"], ["Reviewed April 19, 2017", 5.0, "Breathtaking", "So strong, so mighty, and I have seen my share of waterfalls. Because of the floods the road was hard to pass and most of the path was closed, but still, the part open was amaxing. Do not miss"], ["Reviewed April 18, 2017", 5.0, "Fun Falls Visit", "Parking may be an issue, but we lucked out. The falls are easily accessed and you will get wet! Much fun!"], ["Reviewed April 16, 2017", 5.0, "Another beautiful waterfall that is readily accessible.", "This falls can be seen from the valley and is easily accessible on a paved trail. There are good views at the base of the falls, but be prepared to get wet in the heavy mist."], ["Reviewed April 15, 2017", 5.0, "Water Water Everywhere", "If you have ever been to Bridalveil, you know that once the path ends, you can boulder up to the edge of the falls. Today that bouldering was part of the falls as the water was flowing all over those rocks. And you will get pretty wet if you go all the way to the end of the trail - that is how massive the flow is coming out. Best time of the day to see the falls is late afternoon when the sun is shining on it. Parking was tough, but not to impossible. And only 4 bathrooms to serve the hundreds/thousands that come through there made for a 15-20 minute wait to relieve myself. Not sure why they couldn't add 8 more bathrooms to make the wait time 1/3 of what it was.\nShow less"], ["Reviewed April 15, 2017", 4.0, "Amazing falls, bring wet gear, and put your mobile in a ziplock bag!", "Amazing, stunning, the roar and view!! Short walk to see the falls from parking lot. Got very wet, so don't forget your rain coat, umbrella, and put your mobile for selfie in a ziplock bag! Lovely rainbow, but didnt get pictures cos it was so wet. One of the best Bridalveil falls I have seen!\nShow less"], ["Reviewed April 13, 2017", 5.0, "Be prepared to get wet.", "Lovely lovely falls, parking lot is small but the turn over is very quick. It really is about a three minute walk up to the falls, because of all the rain we have had, it wasn't just a veil, it was literally rain. We walked up and stayed just to take two or three pictures and were were soaked........ it was really fun and I would do it again, a very beautiful fall. If you like to hike it would be worth parking a little further away and taking the valley floor hike to the falls.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Too wet to see, actually", "Bridalveil from Tunnel View is beautiful, and it's even prettier from Southside Drive (or even Northside Drive). But up-close there are actually too many trees in the way so you can't even see the falls (unlike Yosemite Falls where the trail offers you amazing views walking up to it). The only way you could see the falls would be to get to the top of the trail past all the trees, and in early springtime the water is so massive and thick and the spray is so huge that we got soaked and couldn't see a thing through all the spray. If I recall, in summer the water dies down low enough that you can get to the top of the trail without having your eyes blasted by the water. But not in early April, not this year.\nShow less"], ["Reviewed April 10, 2017", 2.0, "Beautiful but crowds out of control", "Yes, the falls are beautiful. You don't want to miss Bridalveil. However the crowds were not being managed at all. Total chaos. Please NPS you need to do better. We waited 20+ minutes just to park and another 20 to use the toilets. We didn't see a single NPS employee in this area. This was 10:00 am on a Monday in April - I cannot imagine a Saturday in July!\nShow less"], ["Reviewed April 10, 2017", 4.0, "You WILL get wet!", "Parking here was crazy, and we were there mid season! But if you can find a place to park or use the shuttle, this is an easy trail that winds upward to face the falls, if you can look up into falling mist! We got soaked (thank you to the prior reviews advising rain gear!) but an extra pair of dry socks wouldn't have hurt;)\nGorgeous and fantastic sound!\nShow less"], ["Reviewed April 5, 2017", 5.0, "Easy to get to and worth it!", "We came in 2015 with the drought and it was beautiful, but in 2017 after a full winter of snow, we got the full experience. We were sprinkled on, like nature's shower, so bring something for cover (April 2017).\n\nWe were able to see a double rainbow at the foot of the fall, which was amazing.\n\nOur, 10 and 6 year olds enjoyed getting sprayed on. It was an experience they won't forget.\nShow less"], ["Reviewed March 23, 2017", 4.0, "One of the best among many", "There are many waterfalls in Yosemite especially between winter and spring, this is one waterfall you may want to visit. You need not search for it, it is on the hwy on the way to tunnel view/glacier point etc."]]}}