{"Cable Cars": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Cable Cars", "url": "/Attraction_Review-g60713-d104821-Reviews-Cable_Cars-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/d9/60/84/cable-car.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "19200"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Fun", "Riding the cable car is a must in San Fran!! It gives you an amazing view of the city.. take the Hyde Powell cable from union square .Also don’t sit on the cable car if you don’t have to. Holding on to the side makes it more adventurous, plus you can get better photos!\nShow less"], ["Reviewed 2 days ago", 4.0, "What is San Francisco without Cable Cars?", "There is something so iconic and fun about the cable cars of San Francisco. They are a little pricey but if you come to San Francisco you HAVE to take a ride. We like picking up the car at Powell and Market going to Fisherman’s wharf. Always exciting if you are on The outside.\nYou won’t find a ride like it anywhere else in the world.\nShow less"], ["Reviewed 2 days ago", 3.0, "okay to do once but not worth the long lines", "It's $7 each way, so we bought a day pass but didn't use it; the lines are up to an hour long to ride it; and it's basically a tightly packed small open air bus up a congested street. It's an iconic part of San Francisco, but might not be worth the long waits in line.\nShow less"], ["Reviewed 2 days ago", 5.0, "old expirience", "the cable car is the must sightseeing. the first station is near to a mall and the end is near to the fisherman warth."], ["Reviewed 2 days ago", 4.0, "Old School", "My husband & I bought the day pass so we could use any of the cable cars as much as we wanted at $22.00 per person per day. We rode to Lombard Street & got off - wonderful to not walk the hill streets to get there. Riding the cable cars are a great way to get around & see the city. I highly recommend it!\nShow less"], ["Reviewed 2 days ago", 5.0, "Worth the ride", "Take the cable car to the Cable Car museum. So interesting and historic! The ride is fun and nostalgic. They cram you in there because they pick up and drop off along the way, but we lucked out and got to stand in the back with the other operator. The views from the car are a different perspective.\nShow less"], ["Reviewed 3 days ago", 4.0, "Nice but not more than that", "Nice experience but not more than this. Has stop near Lombard Street,and can be take to get to the ocean. The ticket price is quite high.. so I think no really worth the money"], ["Reviewed 3 days ago", 5.0, "Must do!", "The cable cars a must do attraction while in the city. It’s easy to pay and jump on to sightsee or to get around town. The most interesting part is watching the cars get to the end of the track and be manually turned around."], ["Reviewed 3 days ago", 3.0, "Don't Buy the Day Pass", "It's worth at least one ride, so pay the $7 and take it one way. The line-ups downtown are far too long and they don't tell you that you can walk up to the next stop and get on much quicker. This was a HUGE disappointment for us.\nShow less"], ["Reviewed 3 days ago", 5.0, "Have to do it just once!", "I have wanted to take the SF cable cars since I was a small kid and finally did at age 63. It's just a rather short ride and the transportation workers straddle the border line of angry to mean, but we did it. At 20 something a pop I am one and done but still glad I did.\nShow less"], ["Reviewed 3 days ago", 4.0, "Cute fun ride", "Defiantly a must do, but kinda pricy for the the short trip and waited almost 20 min for the car when online said 8 min. The live tracking is not correct. But super cute fun ride."], ["Reviewed 3 days ago", 5.0, "Like the movies", "We took the cable car from Fisherman’s wharf down to union square. It’s exactly like you’d see in the movies. The hills are unbelievable and great views."], ["Reviewed 3 days ago", 5.0, "Really fun, worth the wait", "Really enjoyed riding the cable car. We did find it hard to get on because of the amount of people riding, so we just walked to a stop where less people were waiting."], ["Reviewed 3 days ago", 4.0, "You just have to do it", "Its iconic and so you should not miss out on it even though it might not be all that exhilarating but it is fascinating to see how the forethought of the designers all those years ago still works so well today. Definitely stand up if you can in the forward section of the car to see how much the brakeman has to do. He has quite a workout!! We got off at Lombard Street - The Crookedest Street in the World - and walked down; don't try to walk up!!\nShow less"], ["Reviewed 3 days ago", 5.0, "A must do in San Fran", "This is one form of transport you must do in San Fran, we sat inside, outside and rode the sides what great fun. Staff on board all friendly but on a couple of evening trips when its less busy staff really interact with you and make the ride even more fun.\nShow less"], ["Reviewed 4 days ago", 5.0, "Market to Fisherman's wharf", "We learned 2 valuable lessons from a wise street person.\n1. Do not wait in line @ Market...walk up a block and jump on. They dont fill the Cable cars, bacause they need to stop & pick others up along the way.\n2. There are 2 routes down to the Bay...1-Yellow & 1- Red...indicated by the signage on the TOP of the Trolley car. RED =most scenic route. It takes you past Chinatown & to the top of Lombard street. However, it takes you to the Maritime museum...Fisherman's wharf is about a 2 min walk. YELLOW =not as scenic, through the financial district & drops you directly in front of Fisherman's wharf. Enjoy your ride!\nShow less"], ["Reviewed 4 days ago", 5.0, "Must do in SF", "Just do it. Costs $7 each way or get a day pass. We got on the Powell Hyde St car from Fishermans Wharf to Union Square."], ["Reviewed 4 days ago", 5.0, "We got a free ride!", "Not sure how, but we didn't have to pay. We got on at the top of Lombard St (oh my what a climb!). We got to ride on the outside (see picture) - if you are going to ride, this is the only way to go. We stayed on several stops till Chinatown and they didn't charge us. Not sure if it's cause we were standing, or cause we only rode a few stops. Lots of fun and a great way to see the city and avoid the hills.\nShow less"], ["Reviewed 4 days ago", 5.0, "Expensive but a must-do", "The cable cars are quintessentially San Francisco. Don't try to get on at the crowded turn arounds in Fishermans Wharf. Consult a guide book or concierge about the best place to catch one."], ["Reviewed 4 days ago", 5.0, "Such fun", "These cable cars were great, up and down the hills of San Francisco. Very regular service and a great way to get around."], ["Reviewed 5 days ago", 4.0, "Fun, must do activity", "You can take a single ride for $7. But I suggest a round trip to get the full experience. You must ride standing and holding on for the full experience."], ["Reviewed 5 days ago", 5.0, "Awesome", "Going on the cable cars is a must do when visiting San Fransisco! They are so much fun & a great way to see the city. I highly recommend."], ["Reviewed 5 days ago", 5.0, "Adventures await", "So thrilling...terrific experience and the cable car museum added to the adventure ..thr sights and staff were super amazing and helpful"], ["Reviewed 5 days ago", 5.0, "Famous Cable Car", "Cable Cars in SF at Powell station are fun as well as tourist attraction. Its wooden made long years old transport system. Children as well as elder's love it. Its rememberable experience"], ["Reviewed 5 days ago", 5.0, "Must do this...", "The cable car is the symbol of the city and is a very enjoyable way to travel. I was a bit worried at first thinking the ride would be very slow but the cable car moved pretty quick so no problems there. At $7/ride it's a bit pricey but if you get a day (or 3 or 4 day) pass for transportation than you ride as much as you want for one price. We did a three day pass which cost us $33/person but it was a bargain based on the number of times we took cable cars plus the other modes of transportation. There are 4-5 cable car lines running thru the city and we learned you never wanted to get on at the beginning or end of the line as that's where the largest crowds were.\nShow less"], ["Reviewed 5 days ago", 4.0, "Un seatbelt fun", "Grab hold. No seatbelt, don’t fall off. Its fun to take it from the wharf to downtown via lombert hill."], ["Reviewed 5 days ago", 5.0, "So much fun, but can be crowded", "Riding the cable cars in San Francisco was so much fun. People hang off of them and take pictures. It was $7.00 pp for 1 ride so it can be priceyer then taking an Uber or cab perhaps, but you need to go for at least 1 ride to get the experience. Bring you back to the days of our grandparents.\nShow less"], ["Reviewed 5 days ago", 3.0, "Fun but unfriendly", "Might have been unlucky but we got a really unfriendly guy on our car who wasn't keen on tourists and made it vocally clear!\n\nThey go a long way so you get a decent trip for your $7 but the best pictures are when you are off them. Definitely worth watching them at the turning point.\n\nWe went early morning and it wasn't too busy.\nShow less"], ["Reviewed 6 days ago", 5.0, "Family holiday", "These cable cars were fun just like you see on the TV with the bell being rung and funny cable car drivers. The experience was great\nThey were so easy to use & get from one point to another\nThey were clean and very well maintained\nShow less"], ["Reviewed 6 days ago", 3.0, "San Francisco favorite", "We have always loved riding the cable cars while visiting San Francisco. On this visit, however we found long lines to get onto the cars. We were unable to get back onto cars midway on their lines. And the cost of rides now are $7 each --- making it very expensive for a family of 4.\nShow less"], ["Reviewed 6 days ago", 4.0, "Fun for both locals and tourists", "You have to know the tricks...like catching the car a few blocks away from the turnarounds and getting an all day pass which is cheaper than two one way tix. (All Walgreens sell them in the city and there's practically a store every two blocks!)"], ["Reviewed 6 days ago", 5.0, "Great ride, but long line!", "Everything about this experience was perfect other than the 1-2 hour wait on the weekend! During the week there was no wait and we hopped right on. You won't regret taking the ride, but go at an off peak time!"], ["Reviewed 6 days ago", 4.0, "Long wait short ride", "But if you are visiting the cable car is a must. Hold on tight. up and down those hills can be a wild ride."], ["Reviewed 6 days ago", 3.0, "Tick it of the list buy dont get excited", "Its another must do. Nothing fantastic other then it offers photo opps and great street views. Catch it from Fishermans Wharf. Cost is per trip so there and back will cost you double."], ["Reviewed 1 week ago", 5.0, "Powell Hyde line.", "Started at the bottom buy the day pass on the APP. Drivers were cheerful with 5 Kids. Always a tradition"], ["Reviewed 1 week ago", 5.0, "Worth it.", "Taking a ride on the cable cars is San Francisco. Hang off the side and enjoy!!!\n$7 US one way or $22 US for the whole day of all public transport. I suggest getting $22 pass - getting on at the wharf (you will have to line up) - go all the way to the end - just past Union Square. Line up again and take it back but get off at Lombard Street (see the crooked street). Catch the cable car going the other direction.\nShow less"], ["Reviewed 1 week ago", 4.0, "A Tourist Must Do", "Its iconically San Francisco. You have to ride a cable car and hang out the sides down the hills. Lots of fun. Kids loved it. Fun watching the driver manoeuvre the controls too. A bit pricey (USD7 per person) but worth it."], ["Reviewed 1 week ago", 5.0, "A San Francisco tradition", "If you go to the start of the line, be prepared to wait in line to get on. Cars run every 10 minutes and there are only a limited number of seats. The good news is, if you walk to the next stop the lines are shorter, but they will only let on the first 4 people at a time.\nShow less"], ["Reviewed 1 week ago", 5.0, "So much fun", "We loved the cable cars so much we went on them three times over our stay. We were also lucky enough to have the funniest cable car driver that kept us all entertained. The cable cars allowed us to see so much of the history of the town from homes streets and beautiful views. A must for every visitor to San Fransisco.\nShow less"], ["Reviewed 1 week ago", 4.0, "Always a unique ride", "Where else can you hop on a public transport vehicle while it is still moving and hang on the side of it at 30 miles per hour. Don't sit. It's as comfortable as a nail bed.\n\nTip: ride in the morning with the commuters on California Street. Better photo ops\nShow less"], ["Reviewed 1 week ago", 5.0, "Best part of San Francisco", "This was by far my family's favorite part of San Francisco. We rode the cable car from Fisherman's Eharf to Union Square. The kids loved standing along the side. It is a must-do when in San Francisco"], ["Reviewed 1 week ago", 4.0, "Great way to see just how hilly San Francisco is.", "We joined the trip at fishermans wharf, and went the complete journey to union square. There are various stops on the way where you can join the trip, but it’s not hop on hop off. Single journey was 7dollars per person. Be prepared to queue. When we decided to use our return from union square we queued for an hour, a hint may be to walk back one or two stops and jump on as they do send empty trolleys up. Worth the wait.\nShow less"], ["Reviewed 1 week ago", 2.0, "Over-rated and over priced", "We took cable cars back and forth to our hotel, because like everyone else, we wanted the experience. We saw online that it was $13 for a day pass, and we could purchase them from the conductors. This was not true. The conductors told us to buy them from Walgreens for $22. (This was after we had already boarded.) If you don't buy an all day pass, you pay $7 per trip, which means that if you have to transfer to a different cable car, you pay that $7 again! All told -- over $50! And this was for a slow, bumpy ride that constantly stops. At certain stations you have to wait to get on -- we waited over 30 minutes near Fisherman's Wharf. It took an hour to get back to the hotel (only 3-4 miles away). Will never ride them again!\nShow less"], ["Reviewed 1 week ago", 5.0, "great way to see some of San Fransisco", "Great to ride the hills in these old cable cars and enjoy the views as you go up and down the hills. I would recommend a night time ride too as the city changes as the lights come on!"], ["Reviewed 1 week ago", 5.0, "Interesting trips with cabelcars", "We had to weit 30 minutes to get on. The Journey up and down at San Fransisco hills are thrilling. Brave people are hanging outside from the Cabel cars!"], ["Reviewed 1 week ago", 4.0, "An itch you just have to scratch", "Everyone has seen them, they're on the telly, in films and everybody talks about them. At $7 for a single journey, it isn't cheap, but if you buy a day pass you can use all the local transport for a day. The queues can be long and there seems to be no timetable as to when they run, but they are great fun and boy, do they have some acceleration!!! Watching the operators manually spin the turntable at the end of the line and push the tram back onto the line opened my eyes!\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun for the Whole Family", "I highly recommend that you ride the cable cars while visiting SFO. The ticket prices are beginning to creep up. I remember when a ride was $1. Now it's $7! Ouch! Still, you might want to purchase a day pass which gives unlimited rides. The cars are pretty crowded at times, to try to plan your ride when crowds are low.\nShow less"], ["Reviewed 1 week ago", 5.0, "Crazy Mode of Transportation", "It's a crazy mode of transportation that everyone loves to ride. It's clunky, and slow and uncomfortable .... and a wonderful experience that should not be missed! Go to the Cable Car Museum too!"], ["Reviewed 1 week ago", 5.0, "Who wouldn't ride a Cable Car if you went to San Francisco!", "By all means... do this! Even if the wait is a little long at the various loading areas... it's worth it, just to people watch and enjoy the city."], ["Reviewed 1 week ago", 5.0, "Hang off the side (but not small children!)", "We (four of us) took a car from Union Square near our hotel, to the port, then we alighted and went back up to Chinatown. The cable cars run top to bottom (uphill to downhill) in busy San Fran. We took the car and hung outside, we were in hysterics! It was safe as the operatives were constantly watching you. We also 'hung out' on the way back UP. We'd alighted at the bottom, where the cable car actually 'plugs in' almost and turns around, then you pay another $7 to go back uphill. There is no commentary on this, I am a bit sad, I like a narrator wherever I go, giving me a bit of history. Sadly, you had to read up first, and then note things yourself. It would be good if they decided to add some recordings with interesting facts? Is it $15 worth? No, i'd not do it again, but I was in SF, and it was a 'given' that I do it...at least once!\nShow less"], ["Reviewed 1 week ago", 4.0, "A nice look back in history", "Each of the cable cars were restored from different locations around the world. Excellent to travel inside of them."], ["Reviewed 1 week ago", 5.0, "Hang tight!", "Oh my gosh! Watch the dedicated, friendly service people spin the cable car before stepping on board for an exciting ride! Ding, ding, ding! Each grip has their own style. Don't miss it Hang tight!"], ["Reviewed 1 week ago", 5.0, "A San Francisco Classic", "Everyone must experience this tradition at least once. Try the off hours and even one of the lesser used by tourist routes. The clanging of the bell, the hills of San Francisco along with great views of the city makes for a wonderful experience."], ["Reviewed 1 week ago", 5.0, "Must do", "You have not visited San Francisco if you havent tried the cable cars. It was very funny and worth the waiting time."], ["Reviewed 1 week ago", 5.0, "DING DING Rice-A-Roni The San Francisco Treat!", "When I was a kid we always associated the cable cars with Rice-A-Roni (clever marketing). The actual experience of riding the cable cars is just so much fun. Most of the time they are packed, but it is a unique way to experience a piece of history. To me, it is a \"must do\" if you are visiting San Francisco, especially if the car is crowded and you have to brave standing up on the side while hanging onto the poles! It's especially fun at night with the cool winds coming off the San Fran Bay and blowing in your face while the conductor rings the bell.\nShow less"], ["Reviewed 1 week ago", 5.0, "The San Francisco tourist thing", "Finally got a chance to ride the cable car yesterday at the end of a four-day trip to the Bay Area. Found out you could buy tickets at the Walgreens near Market Square. We took the cable car down to the wharf and then back to our hotel. I highly recommend you take one trip at night because it has a totally different feel to it. You cannot visit San Francisco without hopping on one of these things!\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun!", "Great way to see the city. We really want to ride the cable cars but also used it as a way to get to the top of the very steep streets. The cable car took us up and we made the easier downhill walk back! Took the Hyde car so we could walk past Lombard street which was fun. I wish the driver of the cable car was a little more interactive. I know people use this as every day transportation but my son really wanted to learn more about how the car worked.\nShow less"], ["Reviewed 1 week ago", 4.0, "Memorable Ride", "Took the cable car from Taylor Street to Mason Line downtown and back. $7 per person each way. A good way to see a small part of SF, Chinatown and Union Sure"], ["Reviewed 1 week ago", 5.0, "A must for San Francisco!", "A definite must for San Francisco. A great way to see this great city! Reasonably priced at $7 each way. Was initially a bit nervous about hanging off the side but glad we did-great fun riding something iconic! Ride early to avoid large queues."], ["Reviewed 1 week ago", 5.0, "Can't miss it", "I can't visit SF without taking the ride. It's $7 per ride, thus it's best to get a day pass or get a Clipper.\nI enjoyed be ride a lot, just like what I see in the movie. Not only tourist take the ride, many locals use this ride as the mode of transport !\nShow less"], ["Reviewed 1 week ago", 4.0, "Worth doing, but the timing and schedules are limited", "I found the San Francisco mass transit options a bit hard to understand, and the timings a bit inconvenient. There were long waits and crowded cable cars, but of course it's more fun than a train/subway or a bus. One of those things you have to do at least once while here, but overall not always the easiest option.\nShow less"], ["Reviewed 1 week ago", 5.0, "If you go to San Francisco riding a cable car is a must", "We got a 7 day muni pass which allowed us to ride the cable cars and the muni bus. After walking so much around hilly San Francisco, catching a cable car is a treat."], ["Reviewed 1 week ago", 3.0, "Need to do once", "This is one of the things that people will always ask you if you did it, and if you say no, they'll treat you like you really missed out. It's actually nothing spectacular and tickets are high. The long lines are annoying and the drivers are really rude. We saw drivers yelling at passengers several times. But, if you can manage to get on at an off time, enjoy.\nShow less"], ["Reviewed 1 week ago", 5.0, "A San Francisco treat", "A must on every visitors list. Get a muni day pass not only for cable cars but trolley and bus. The cable grip (operators) are as much a part of the ride as the cable car. Fun for the whole family but be patient it's about 10 to 15 minutes between cars\nShow less"], ["Reviewed 1 week ago", 5.0, "You just have to try these", "On our first day we made sure we got the chance to ride these.\nWe bought single trip tickets each way as there were no return fares but I believe you can get an extended pass but we hadn’t organised these.☹️\nAt 7 dollars each way ,28 in total, it seemed a bit expensive but if you are only ever going to get one chance to do it then you have to go for it and the trips were great fun and an experience.\nShow less"], ["Reviewed 1 week ago", 5.0, "Iconic Symbol of San Francisco.", "Cable cars are icons symbol of San Francisco city and visit to the city is not complete without a ride in Cable Car. Of course, the ride costs a bit but do experience it."], ["Reviewed 1 week ago", 5.0, "A fantastic way to see the city", "Cable cars were our main form of transport during a recent visit and we highly recommend purchasing a three day pass that will pay for itself in no time. It was a fantastic way to immerse ourselves in the local area and the employees were always friendly and informative. The stops at the main tourist attractions can get very busy with long queues but just walk for one or two stops along the route to avoid this problem.\nShow less"], ["Reviewed 1 week ago", 4.0, "Iconic must do in SF", "You've seen it so many times in movies and on TV, this is one of the things you have to do in San Francisco. The ride up and down the hills of the city is scenic and informative. For the best views sit on the side seats facing the street. Cost is $7, whether you go one stop or the entire route. Loved it\nShow less"], ["Reviewed 1 week ago", 1.0, "Long Queues...disappointing", "Waited over an hour and half to get on a Cable Car, so many people squeezed in couldn’t see anything or appreciate the steepness of the streets. Waste of $14. Staff rude and they are in no rush to get the carts going."], ["Reviewed 1 week ago", 5.0, "Great fun", "I’m not sure I could ever get bored of riding the cable cars. It’s great fun and an excellent mode of transport. We’d bought 3 day muni passports and so instead of €7 we found the more we rode it the better value the car was! A must do for all SF visitors.\nShow less"], ["Reviewed 1 week ago", 5.0, "Original Cable Cars", "This was a must do for us while visiting San Fran. We took a long ride on the cable car and ended up at the waterfront near our hotel"], ["Reviewed 2 weeks ago", 4.0, "A Must Do While in San Francisco", "If you have never ridden a cable car before it is quite the experience. If you don't want to climb the Powell Street hill it is a must. It is a little pricie now days, $7."], ["Reviewed 2 weeks ago", 4.0, "Weekend Trip", "This is really a touristy thing. We purchased a Visitor Passport which justified taking this thing. Included unlimited rides on the cable car as well as all public transport, excluding BART. Note it costs $7 each time you get on, no transferring, so beware!\n\nBest thing is you can hang off the side which means you're most likely blocking the person sitting on the side. But that's what it is so don't be shy about it if you want the experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "San Francisco Bus Transit", "Classic and clean. The view from the window is pretty and if you sit out in the outdoor seats, you can feel the streets and air of San Francisco! It is very romantic transportation. I love this ♥️"], ["Reviewed 2 weeks ago", 4.0, "A SF experience", "This should be an experience if you’re visiting. To buy a ticket is a bit confusing because we were unsure where the box office was at. It was $7 for one way. Make sure you scope the area for the line you choose to take. We had some foreign group ride the wrong one and realized it after the first two stops. The operators were nice enough to give them their tickets back and have them catch the correct car. If you’re brave enough you can stand on the cable car instead of sitting!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Such an Ikon of San Francisco.", "Not only are these an ikon of San Francisco but a also much needed to get up those steep hills. We jumped on at Market & Powell Street. It was about 7:30pm and quite a line to get on. It’s $7.00 per person for a one way ride, which is a little expensive if your only going a few blocks however worth it not to walk up those hills. I’d say you have to give this a go once or twice.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun!", "The San Francisco Cable Car ride for us was just a way to get back to our hotel (mostly up hill from the Wharf area) and take a fun ride. It cost $7.00 each and as such was not a good value for the transportation by itself. However, we rode it purely to experience the iconic San Francisco form of travel. My college age daughter hung onto the outside rail while I sat safely inside by a window. Going up and down those wonderful hills via the old fashioned cable car was worth the money. If you really want to use it for transportation - you need to purchase a one or three day pass with unlimited rides / on and off. If you just want the experience to say you rode the cable car, pay the $7.00 for one ride. It is worth it!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Must see in SF", "This is a fun event for couples, families, and business outings. You can catch the cable cars on many locations on Powell Street. Rides are $5 Cash and can be purchased from the Conductor on board. Hop on and take a seat and the Conductor will come by to collect the cash. Great photo ops too.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Kids LOVED the ride.", "Went early (9am) to the Union Square turnabout, and got on within 10 minutes. Powel and Market from end to end is a rollercoaster ride!"], ["Reviewed 2 weeks ago", 5.0, "Must do", "A cable car trip is a must, it is very exciting and if you buy a three or seven day muni travel pass the cable car is included as it is quite expensive on its own. Great photos."], ["Reviewed 2 weeks ago", 4.0, "When in San Francisco...you must ride the Cable Car", "One of the main things we wanted to do was ride a Cable Car. My husband and I remember as kids watching the Rice a Roni commercials and seeing the cable cars in San Fran. Be prepared you may not get on right away, and if you are at the turn around you can figure on a wait. It cost $7 one way to ride- if you will be in town for a few days purchase a SF City Pass. City Pass has multi vouchers for SF transportation including the Trolleys/Cable Cars- so all you have to do is flash your City Pass when you get on. Plus it gets you into other attractions for free in the area. The Cable car goes through China Town, pass by Lombard Street and ends at the Buena Vista Cafe.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Completely overrated!!!", "The ONLY reason to ride the cable cars is to say you've done it! The longggg waits, irritable conductors and confusing routes are NOT worth it! But if you've never done it...once should cure you!"], ["Reviewed 2 weeks ago", 5.0, "Night ride", "Hopped on after a twenty five minute wait at Hyde street between Fisherman’s Warf and Ghirardelli Square. First time with my teenage daughters; they loved it. Full car so I rode side saddle hanging on to vertical pole and solid platform. Seeing the city at night and all the lights was amazing. My daughters made sure Dad hung on. Honestly easy ride.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "San Francisco Cable Cars", "These are historical and just so much fun! Our one-way ticket cost $7 and it is so wonderful to travel in San Francisco this way."], ["Reviewed 2 weeks ago", 4.0, "Great ride", "Well worth it to experience it and see how they work. Help you to appreciate the steepness of the streets. Sit at the front looking out the side or hang on the poles"], ["Reviewed 2 weeks ago", 5.0, "Nearly missed this!", "I've been to SF 3 times now, but on our ladt day we thought we'd try a Cable Car. So glad we did!! It's a wonderful experience and the staff are so friendly."], ["Reviewed 2 weeks ago", 5.0, "Must Ride the Cable Cars!!", "What an incredible experience riding the cable cars and learning the history! This is a must do if ever visiting the city. The engineers onboard are very friendly and enjoy sharing the history about the cable cars and the city and go out of their way to ensure people are on the right path to their destinations. We rode the cable cars three different times had a blast each and every time!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Cable Car Tripping across SF from Powell to Fisherman’s Wharf", "First you either need to grab a ticket from the booth at the bottom of Powell Street or have a fist full of dollies. It’s $7 one way. We took the car from Powell turning station to Fishermen’s Wharf where we found the Hollywood Cafe (see other review)\n\nGreat trip over the dips and hills of SF.\n\nDare you to hang onto the side (great for selfies too)\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Anniversary", "We rode the cars from Hyde Park to Powell St downtown. The ride and view is just awesome. Only have a plan for the return trip as this is a one was ride."], ["Reviewed 2 weeks ago", 5.0, "A San Francisco Icon", "A must do part of a non-work visit to SF. Quickest way on to a cable car is at California Street directly across from the Hyatt. You will go up some hills and see Chinatown. You will need to change routes to go to Fisherman's Wharf. If you are local, be sure to carry your Clipper card to use on the cable car.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must-do during your San Francisco visit!!", "Cable cars are iconic for San Francisco and luckily, the city has restored each car for tourists to experience what it was like back in the day when this was THE mode of transportation. So fun to take from Giardelli's Square or Union Square! What a treat!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So awesome, the small kinks don’t matter!", "I live for cable cars! While their were some unpleasant drivers, long rides, delayed pickups, and long waits, it was all worth it for the convenience and the ride."], ["Reviewed 2 weeks ago", 5.0, "A Tourist Must - not the fastest way around, but you have to try them once!", "Yes, they are a tourist thing for the most part, and no, they will generally not be the fastest way to get from place to place. They can be crowded and they aren't really cheap. But we got a several day pass and we used them frequently and we're glad we did. They're fun! Hanging on to the outside was fun for the kids. You get good views from them. And they are uniquely a part of San Francisco.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "No trip is complete until you ride the cable car down to Fishermans Wharf", "There was very little wait in line and the ride was lovely. The only drawback is it was difficult to look straight ahead because the car was so full of people standing I could not see anything (I was sitting down) except directly out the side window.\n.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Gotta Try It Once", "If you have heard the Rice-A-Roni jingle, you have to try the cable car. We started outside the Buena Vista Cafe and took the Powell/Hyde cable car. We went to the end, not sure where we were going and ended up in Downtown SanFrancisco where it was hopping with action. Lots of shopping, pan handling and places to sit and have coffee. We walked awhile and ended up having coffee at Peetes Coffee at an outdoor table. Great people watching! Here is a tip we learned on a tour. Worked great. Everyone stands in a LONG line waiting to board at the beginning loop. You should walk up the street to the first cable car stop (past the Buena Vista Cafe for the way up). The cable car stops like a bus would along a route. Stand at the first stop and you can hop right on, often getting that famous standing spot people want. No waiting at all, piece of cake!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun experience", "Having seen them on TV, it was a great experience to ride on the cable cars. There are a number of different lines you can catch and it gives you a great opportunity to see the streets and just how steep they are! There is a small inside seating area and then some outside seating. If you miss out on a seat, then you can stand but hang on tight! Try and have the right money for the fare ($7) as this makes it easier for you and the conductor.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Why aren't they everywhere!", "Probably one of the most shameful, senseless tragedies of American History. There should be street cars everywhere! Literally, and there used to be a great many in a great many towns. Like the advent of international architecture and Walmart, the rise of the automobiles and hog ugly metro buses has killed yet another meaningful and beautiful attribute in urban living. Oh the mistakes we've made as a people!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Beautiful Experience", "Just a lovely ride around the the city and a nice way to get around. It’s a beautiful way to experience an old fashioned way to travel. Lovely sounds and very immersive."], ["Reviewed 2 weeks ago", 5.0, "Fun to ride", "We rode the cars from end to end on all 3 lines it was really fun (although 2 of the lines start in the same spot). We really enjoyed it. A Day pass is worth it if you want to do multiple rides. Go early in the day if you just want to get a ride in before it gets lined up.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "That's the other SF monument", "This historic transportation system is as important as Henry Ford's tin lizzy as well as Stevenson's rocket. Without them we would miss something. The feeling when sitting on one of the open benches during a ride is simply great"], ["Reviewed 3 weeks ago", 5.0, "A world class adventure!", "Oh, this has to be on everyone's bucket list, it is absolutely amazing! The conductor and grip man are up close and you can see everything. How long does it take to master this job?"], ["Reviewed 3 weeks ago", 5.0, "Worth the $22 all day fare", "We totally touristed it up in SF! After biking the day before we thought Cable Cars would be a fun way to see other parts of the city. We purchased the $22 all day fare. It was worth it. We started at Union Square where they manually push the cars around. The line looked super long, but it went really fast. After strategically planning our line placement so that we could get seats on the part of the car that we could stand up on, we took off up the hill. We had plenty of time to take pictures during drop off/pick ups. We enjoyed heckling the drivers and talking to people from all over the world. They have a free Cable Car museum along the tracks and will let you know where it is as you travel. Yes this is a tourist trap, but it was definitely worth it!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "San Francisco Cables Cars", "An iconic part of the city, the cable car is a living historical monument. We had to queue for around 15 minutes to get the seats we wanted, upfront in the open sided section. $7 buys you a ticket from close to Fisherman’s Wharf to the end of the line right in the heart of the city close to Bloomingdales and all the other big stores. Better than any fairground ride I have been on and it lasts for almost 20 minutes.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great", "Always wanted to do this , had a fantastic trip on the cable cars we had a great driver who made it really good fun $7 dollars for a one way trip."], ["Reviewed 3 weeks ago", 5.0, "Fantastic to see", "First time sitting onto a cablecar it was great way to see streets of San Francisco stopping at each crossing the hill it had to climb watching driver with the way he work lever pedal and ringing bell you have to try it $7 great way to see the city\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Don't just ride it", "Make sure you talk to the person running the breaks at the rear of the car - they're really happy to describe the system, which makes the subsequent trip to the museum even better."], ["Reviewed 3 weeks ago", 4.0, "Great experience", "Nothin fashion. Really old. But it gives you a great experience about San Francisco and it’s hills, arquitecture and views. I really liked it."], ["Reviewed 3 weeks ago", 5.0, "Simply you must take a ride", "A must do while in San Francisco. Pick up at Union Square at the bottom of the hill at the start of the line. 7 dollar’s a fare paid on board. Take the ride to Fisherman’s Wharf. Enjoy the experience."], ["Reviewed 3 weeks ago", 5.0, "Summer holliday 2017", "I made a round trip one nice evening from the start at our hotel Holliday Inn Powell-Hyde Station Cable turnaround cross to California street and Front Street and back again to Powell/Mason Cable turnaround at Fisherman Warf, it was fantastic roundtrip a memory for life. The train driver was very friendly and helpful I stayed together with him, and he told me all I want to know and even more. Thanks\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Be ready for bumping and holding on tightly,so worth it.", "As all tourists and non tourists do we hopped onto a cable car going to and coming back from many places. It is not an easy City to walk around if you have a time slot to keep.\nThe safety rule for the riders is common sense. The drivers will keep you aware of what you are doing wrong, cheekily and some times not so cheekily. But generally they are a great friendly bunch of guys.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great Fun But Cranky Operator", "Really enjoyed our ride on the Cable Car. The lineup was long and took about 45 minutes to board. Our driver was replaced half way through with a new driver who didn't look or act as though he really wanted to be there. Anyway, everyone should ride a cable car in San Francisco.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Jump on a cable car", "So glad I did! After a big day riding and walking around up and down hills we got on a cable car at union square and rode back to fisherman’s wharf. We were lucky enough to get a spot standing outside. Hang on, pay attention to the parked cars and passing traffic and you’ll have the time of your life. What a ride!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A wonderful experience everyone needs to do it", "After being a big fan of the tv show streets of San Francisco a trip on a cable car is a necessity be brave and ride on the open seats for the thrill of the ride all I can say is it’s amazing . Seeing is be.ie ing it made my stay in San Francisco soooo much. Ore the best 7 dollars I spent\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun ride", "When in SF don't pass this ride up. I usually Catch the California line when I ride them Go to Nob Hill and walk!!"], ["Reviewed 3 weeks ago", 4.0, "Interesting and enjoyable", "We booked one way cable car tickets from the booth located next to the start on the corner of Market Street. The tram has an inner cabin as well as an open section. There are multiple stops along the journey to Fisherman’s Wharf (final stop is a short walk to Tye Wharf). The trams moves slowly along the undulating roads of San Francisco and a slow and steady pace enabling you to appreciate the experience and enable lots of photo opportunities\n\nIt’s worth noting a single pass ticket is only valid for exactly that despite how far that may be so if you want a hop on hop off experience you are better off buying a multiple use pass but we found the one off experience to be enough as it’s not the cheapest option of travel but was well worth the experience\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Spectacular fun going up and down the hills on a cable car in San Francisco!", "My friends who visited us in San Francisco, had to ride the cable cars before returning to their hometown, and they had a wonderful time going up and down the steep hills before arriving close to Fisherman's wharf. A few of the conductors also enjoy making music with the bell ringing to alert cars and pedestrians that the cable car is on its way. They enjoyed the ride immensely! This is a must \"see\" and \"do\" while in S. F.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Nothing very spectacular !!", "First of all, it's a short trip and the whole experience is pedestrian. Never wait in the long queue, if you see one."], ["Reviewed 3 weeks ago", 5.0, "Great Fun", "Just returned to Fisherman’s Wharf following a return trip to Union Square on the cable cars! Unique to San Fran! Must be done! These would never be allowed in the UK on health & safety grounds! So a must in order to see the fantastic architecture & sights! $7 each way\nShow less"], ["Reviewed 3 weeks ago", 5.0, "HISTORIC FUN", "Enjoy the history of SF on a cable car ride. It's so fun to experience the city in this way. Feel the open air on your face and bundle up for a nice ride to a new stop - You can even take it to the stop at Buena Vista where you can get an iconic Irish coffee to warm yourself back up after the cool ride.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Gotta do it at least once! The California Line has a shorter wait time.", "Standing in line can be a painful experience. The California Line has less of a wait, but a less exciting view. The cost is $7 every time you board, so ride the whole line before disembarking and find a different way back."], ["Reviewed 3 weeks ago", 5.0, "Great fun", "A stay in San Francisco would not be complete without a ride on the cable cars . a good way to see the area and great fun stepping back in time"], ["Reviewed 3 weeks ago", 4.0, "Yes, a bit touristy, but why not try a Cable Car when a \"tourist\" in SF??", "Fun experience as a tourist in SF. Cheap fun and a San Francisco must do to get a feel of the city. Connects to many parts of the city. Try it at least once when in San Fran."], ["Reviewed 3 weeks ago", 4.0, "Great experience", "Nice view of the city! Reasonably priced so if you want to hop at Union Square and go to Fisherman’s wharf for dinner, it’s cheaper than a taxi."], ["Reviewed 3 weeks ago", 5.0, "Love it!", "Standing on the outside is so fun! They are beautiful and watching the driver is fascinating.\n\nFor people who like science, it is a very ingenious invention, it is operated by making the car either hold or let go of a cable to make it move or stop and the cable is constantly moving. It is historical and beautiful and the breeze on it is great not to mention it tackles the hills really well.\n\nMake sure you visit the cable car museum to see how it operates and where the cables are rotated.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Ride down memory lane", "A must for every visit to SF. A classic ride in the Cable Cars, with the drivers manually handling everything right in the middle of it, is perfect to carry you down the memory lane to the bygone eras, right in the heart of San Francisco.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Love the Cable Cars", "Great experience for myself and my young grandsons! A bit expensive if you are going to go both ways with a family. $7.00 each way. A great tip is to purchase your tickets at a Walgreens store, then catch the car one or two blocks from the start! This avoids huge lineups and makes life easier and quicker. The tickets are non transferable and work one time only. But it may be a once in a life time experience so do it and don’t regret spending your money! Ask the driver and the brakeman lots of questions they are mostly happy to answer. We had a bit of a grumpy driver but the fellow on the back brake was informative, funny and great with the kids!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "How can you not take a Cable Car ride in SF?", "A must tic off. Try some other embarkation point than Powell and Market too long a line. Not cheap but it cost you a lot to get here."], ["Reviewed 3 weeks ago", 5.0, "You just have to ride one!", "My son and I felt compelled to ride the cable cars. The lines can be very long so we opted to get out early the day of our departure to take our ride. It was cold and damp but we really enjoyed the ride!!!"], ["Reviewed 3 weeks ago", 5.0, "Time travel", "The best way to see San Francisco.It connects the most important parts of the city.The one way ticket costs $7.it is better to buy a 3/5 day ticket."], ["Reviewed 3 weeks ago", 5.0, "Fun, rickety and, well, you're a bit daft if you don't want have a go", "A moving museum but part of the face of this city. And if you don't want to at least go two stops standing or sitting on one, then what's wrong? Read about them first - the horses dragging them up those hills and their suffering which led to the underground cables being installed. It's a bit of a Victorian marvel, and they're cute. The Powell-Hyde line is the prettiest journey. The Powell-Mason line is further into Fisherman's Wharf, but a couple of blocks south, so you don't save much in walking time. It's all a fairly compact walk anyway.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun fun fun", "This tourist thing is fun. Take it for the extra cheese on a sunny day trip to the center of the city. The 20m 7 dollars ride worth it all."], ["Reviewed 3 weeks ago", 3.0, "A must when in San Francisco", "A fun experience and a must do when in San Francisco. Though we had to wait awhile to board, my children thought is was well worth the wait."], ["Reviewed 3 weeks ago", 4.0, "An interesting ride", "We rode the Hyde-Powell line from the Cannery to Powell Market and back. It was an interesting ride for these tourists. The cable car drivers work very hard and stay out of their control area!\n\nWe understand some people rely on the cable cars as their transportation but as tourists, we did really enjoy the ride.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "You can do it if you wish but", "Nothing to write home about. Although it’s one of San Francisco must, I didn’t find it attractive. It’s not a complete waste of time and doesn’t cost much and yet again a bit disappointing."], ["Reviewed 3 weeks ago", 5.0, "The San Francisco treat", "I remember the Rice a Roni commercial and always wanted to ride a cable car.\nThis was a childhood memory and it was fun to be able to enjoy the experience.\nVery much something you need to do. I like that they still print a ticket that you can save.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Typical SF", "Of cause it is very touristic but it’s fun to take a ride with the cable car. You can see a lot of the City and it is interesting how the Gripman is driving the train. Also recommendable: the cable car museum - with free entrance!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Nice Ride", "If you go to SF, you can not miss the Cable cars. We walked a lot, but also decided to take a ride it is worth it."], ["Reviewed 3 weeks ago", 5.0, "Ding ding ding! Fun", "This is a must do when visiting San Francisco. We got the day pass and it was well worth it. In fact we realized too late that we should have gotten the 3 day pass. The passes are good for other public transportation too."], ["Reviewed 4 weeks ago", 5.0, "So much fun", "When you’re in San Fran make sure you jump on a cable car. We took a ride from the top of Lombard Street through to Union Square on one of the historic ones, $7 each and you just pay the guy on board. Well worth going to the end and watching the cable car turn round\nShow less"], ["Reviewed 4 weeks ago", 3.0, "You have to try it", "After reading and hearing all about it a trip on the famous cable cars is a must do. It’s nostalgic and something every tourist should try. In the end it’s not much different then a bus but he, it’s San Francisco!!"], ["Reviewed 4 weeks ago", 5.0, "Enjoy the ride but go to the museum also", "The cable car system is a very fun way to get around some streets in San Francisco, but look up the cable car museum, definitely worth it."], ["Reviewed 4 weeks ago", 5.0, "Insider Secret for Riding the Cable Cars.....", "We stayed at the Orchard Hotel near Union Square for the Symphony Weekend mini vacation and the Cable Car was just outside the front entrance of the Hotel. The secret that few visitors know is that you can jump on the Cable Cars in the middle of the trip instead of waiting in the long lines at the beginning and end of the ride. This particular starts at Market Street and ends in Fisherman's Warf at the other end. Unparalleled views, and a must do experience when in San Francisco.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Don't take them from the city at prime time", "The cars are fun to travel but beware the queues. Some people line up at the terminus for over an hour. We never lined up and still took the cars half a dozen times. Avoid the queues by going at off peak times or taking them from the wharf back into the city in the evening.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Classic Fun San Francisco Style", "A trip to San Francisco isn't complete without a ride on a historic cable car. The cost of a ticket is offset by the thrill of traveling up and down the hills of this famous city with the bell ringing and the wind whipping your hair. OK, the cars don't really go that fast. In fact, the ride is what could be considered leisurely, but that just means you get to enjoy the experience longer. You'll get incredible views of the city from your car, including the exciting drop down to Fisherman's Wharf on the Powell and Market line. The turnaround at the foot of the line on Market Street is fun to watch, but if you want to avoid the crowds, you can walk up Market to the next stop and catch a cable car there. Be prepared to wait a bit though. The cars fill up fast, and those that are full will chug on by. Not to worry. The cars come by every few minutes.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Cable car ride", "You cannot visit San Francisco without riding on the cable car. It goes into the city and back shoring you great views as you ascend and descend the beautiful streets of the town"], ["Reviewed 4 weeks ago", 5.0, "Richard", "Did the cable car thing as a child 40 years ago and now revisiting with my wife. Was pretty priceless!!"], ["Reviewed 4 weeks ago", 5.0, "Love it but it’s too costly", "I think that seven dollars for two minutes rides it’s too much , however I loved the ride . I asked if I can stop in china town and go up the hill later . No dice. A pity ."], ["Reviewed 4 weeks ago", 5.0, "A must do!!!!!", "If you are visiting San Francisco then you have to ride the cable cars!!!! It was so much fun going up and down the streets in them!!!! I am so glad we rode them!!!! We really felt like we were part of the city!!!!! I would do it again in a heartbeat!!!!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Try it and you'll like it !", "I enjoyed this attraction so much!\nYou see the panorama on another point of view and you can speak with people during the trip.\nI personally remembered funny films like Roger rabbit or felt as an actor like Bogart or Cary Grant. Who knows how they or Keaton or Woody Allen felt when they went on it for the first time?\nIt belongs to SF 's spirit...\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A must do", "You can't go to San Francisco and not experience the cable cars! It's certainly a unique way to travel the city. My only complaint is we rode the cable car from the Wharf to downtown, but on the way back had a difficult time getting back on. If you hate waiting in lines, you are in for a disappointment. We saw lines that were 1 1/2 blocks long just to get on So many people were getting on downtown to go to the wharf we couldn't find a car that wasn't already full! So we would just keep walking hoping to catch a car along the way...not a lot of fun unless you like walking up steep hills! I'm sure the exercise did me good, but I wasn't appreciating it after we bought unlimited riding passes for the day! Once you're on though it’s a lot of fun. The cars are really old and quaint and have an operator in the middle and a brakeman in the back. The views you see as you ride and look down the hills are amazing.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Have to experience this in San Francisco", "We rode the cable car to the top of Nob Hill and enjoyed every minute of it. Interesting to see the old manual levers that stop and start the cable car. Nice friendly drivers too and not expensive."], ["Reviewed 4 weeks ago", 5.0, "So much fun!", "For me, one of the best attractions, plus you get to see important landmarks. I loved it, I love SF. One of the best cities in the US."], ["Reviewed 4 weeks ago", 3.0, "Over priced and rude staff", "I was in San Francisco during an off season and we still had to wait a long time for a car, even though there were 3+ of them just sitting idle. Frustrating to waste time. Also I believe $7 each way is a bit steep, just my personal opinion. The worst part was the staff, constantly yelling at riders about where to stand. It would have been easier if before the car left to just go over the safety rules. If you explain to people where they can’t stand, maybe it would save us all the headache of hearing people get told off. Overall it’s something you should do when visiting, take some cute photos!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Love them", "Their a bit more bone ratteling than i thought,but amazing just the same,to see san fran. So iconic,you really need to ride one gor yourself"], ["Reviewed 4 weeks ago", 4.0, "Something you have to try", "The $7 one way trip will take you from the fisherman’s wharf area to Shopping destination of Union Square. Along the way you get a real taste of the crazy inclines that SanFran has to offer. Be prepared for the lineup at the turnarounds."], ["Reviewed 4 weeks ago", 5.0, "Mother daughter weekend", "You have to do the cable cars when you visit San Francisco- they are just fun. Some times you have a wait to get on at the starting points but there always seems to be music by local entertainers to pass the time."], ["Reviewed 4 weeks ago", 5.0, "A must do!", "We had a car while in SF, but you have to experience the Cable Cars! It was such fun and the conductors were very friendly and shared various information about the cars and history of them."], ["Reviewed 4 weeks ago", 5.0, "Long wait but cool", "You can’t go to San Francisco without trying the cable cars but word to the wise try to get on mid route so you don’t have to wait in the long lines"], ["Reviewed 4 weeks ago", 5.0, "Always an outstanding experience .", "Try to get on it outside the rush hours. Absolutely worth it. Visit the powerhouse first. Stay outside if possible."], ["Reviewed 4 weeks ago", 5.0, "Great old fashioned ride", "Hop on a cable car to explore San Francisco. I would suggest that you sit inside however if the car gets busy there could be people standing which could block your view. It is quite expensive to ride so chose where and when - but well worth the trip.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "A must!!!", "It was an experience that one can ever dream off. If you can experience riding the cable cars by standing on the outside, hang on tight though. If you can purchase a Citipass from Walgreens, which allows you to ride the cable cars, bus and street cars for a day. A single ride is $7.00. Be prepared to wait in line from both ends of the journey. It has multiple stops along the route to allow you to explore other areas along the way.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "So cool to ride one!", "This is such an iconic thing to do while in San Fran. We had such a great views during the night when we rode it and it stops along so many scenic attractions such as the crooked street and Chinatown."], ["Reviewed January 24, 2018", 5.0, "Awesome", "You get an awesome view of city with cable cars. From Powell station to fisherman wharf & other parts of city."], ["Reviewed January 24, 2018", 5.0, "When in SF you have to do this", "We hadn’t been to San Fran for years and always remembered riding the cable cars. This is a must do when you are here. It is such a thrilling ride going up and down the streets of San Francisco. Great viewing to see all the beautiful homes around Nob Hill and Russian Hill. Beautiful photo opportunities too. The drivers of these cable cars are very talented. It’s almost an art form watching them drive.\nShow less"], ["Reviewed January 24, 2018", 1.0, "Not Handicap Accessible", "Riding on a cable car was one of the things on my handicapped sons bucket list. He was so disappointed. I had no idea that at least a few of the cable cars would not be accessible for wheelchairs. I think they need to get with the program?\nShow less"], ["Reviewed January 24, 2018", 5.0, "It has to be done!", "You can’t visit San Francisco and not go on a cable car. Plus they are really useful in such a hilly city! The close proximity of passengers also makes it conducive to chatting to other tourists and even some locals. You do need the photo of the cable cars for your Instagram.\nShow less"], ["Reviewed January 24, 2018", 5.0, "A must ride experience", "A visit to San Fran without a cable car ride? Never! I had to give it a try. It’s $7 a ride and you can sit down or hang on the side if you wish. I definitely recommend it at least once!"], ["Reviewed January 24, 2018", 5.0, "Cable Cars", "Don't miss a ride on the cable cars of San Francisco, they are an iconic part of a trip to this friendly city. There are three lines running basically north - south and east - west and sail up incredibly steep inclines. They are manned by helpful crew, one brakeman we talked to had operated the line for over 29 years. It's not the cheapest ride compared to the bus system but worth every cent.\nShow less"], ["Reviewed January 23, 2018", 2.0, "Good way of getting around.", "This was a cool/ convenient way of getting around San Francisco. But make sure you take a map with you. Because the staff working on the cable cars are extremely rude. They don't tell you what stops are next. Nor do they answer any questions. They hate their jobs and are not afraid of showing it. To the point that my sister attempted to take a selfie on the cable car and the man driving the cable car pushed her arm. That was rude. She's a tourist and excited to be on such an amazing transportation obviously she's going to take a photograph.\n\nWhile in San Fran ride the cable cars but know that the two guys operating the car will be rude, not tell you what's the next stop, roll there eyes at you, and curse at individuals that don't speak English.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Get a day pass at least!", "One way fare is $7 which you can pay as you get on the car, or at lots of places around town you can buy a day pass or 3-day pass or 7-day pass. Day passes also get you access to the Muni buses which can be helpful getting around.\n\nThere were a few locals grabbing these, but it was mostly tourists. Just be aware you need to take off backpacks if you're sitting, and you can't stand behind the brakeman. Also be sure to communicate well when you want to get off, don't dither. It's also nice to be able to ride the cable cars to the museum and then get back on for more rides around town. If you get a day pass, you can prevent getting a bad seat by being able to ride again after you figure out how the whole thing works.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Fun", "This is enjoyable as long as the conductor interacts with you. I had a few questions and the guy was pretty knowledgeable"], ["Reviewed January 23, 2018", 5.0, "Great views", "Great experience everybody was very nice. The views are great. We went from market to Lombard Street."], ["Reviewed January 23, 2018", 5.0, "You're not a tourist if you don't ride one", "$7USD per adult per ride is overpriced but hey, you're a tourist and riding one of these is a MUST. The cashiers on the Cable Cars can provide change up to about $20 but get organised before so you can sit or stand quickly for your ride.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Must do in San Francisco", "Hold on to the side and enjoy the roller coaster ride! A must do when in San Francisco... don’t let the price (7.50$/person) or long line ups discourage you.\n\nTickets can be bought at the booths or on board.\n\nIf you start at union station on a nice sunny weekend day, be prepared to wait an hour to get on... a better option is to hop on along the way! :)\nShow less"], ["Reviewed January 23, 2018", 5.0, "Worth the ride!", "It is really fun taking the tram to have a taste of SFO. $7 a ride but I am sure you will find it worth while."], ["Reviewed January 23, 2018", 5.0, "Great experience", "When in San Fran you have to ride a cable car... and if you are lucky enough you will get the hang of the sides and video it like we did."], ["Reviewed January 22, 2018", 3.0, "Good ride", "When in San Francisco you have to take a Cable car ride. It was shorter than we expected - expensive!"], ["Reviewed January 22, 2018", 5.0, "A must see/experience in SF", "Highly recommended experience when visiting San Francisco, the ride is enjoyable and fun riding in different parts of SF. The driver is always very funny. We suggest that you take the ride back and forth to experience it in full. This way next time you watch a movie made in SF you’ll recognize the cars that in so many cases take part in disaster movies and more\nShow less"], ["Reviewed January 22, 2018", 4.0, "An interesting historic experience", "Despite the very long wait and the short ride, the experience was interesting. It shows the way early americans thought about city planning and transportation.\n\nTip: Don't take it at the first stop where there is a long queue. From the second stop, its a short wait.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Really interesting and helpful driverd", "Loved riding the trams. Drivers happy to share their knowledge and great views of the city. Day pass gives best value."], ["Reviewed January 22, 2018", 5.0, "Ding ding ding", "Fun form of transportation which runs frequently. Be sure to follow the safety rules. The cable went down shortly after we boarded, but hey, it's an old system. We were patient, they were polite, and soon we were on our way.\n\nYou know you want to. Do it.\nShow less"], ["Reviewed January 22, 2018", 5.0, "A piece of San Francisco's History", "If you visit San francisco you have to ride the cable car. The drivers\\conductors are very humorous and add to the experience. You really feel you are going back in the past and you are experiencing something shown on all those films and tv programmes."], ["Reviewed January 22, 2018", 4.0, "Unusual experience", "We bought a 3-days card for use at cable cars, trams and buses, and used it full out. Great experience thinking of Bullitt and Steve McQueen."], ["Reviewed January 22, 2018", 5.0, "Admirable experience of cable car", "It was an admirable experience of the cable car. Its just unbelievable to see how a cable car is still running on the busy roads of San Francisco. On the same wiggling road one can see cars, trains, cable cars, buses and many more vehicles."], ["Reviewed January 22, 2018", 5.0, "Bucket List Item", "Ding, Ding, Ding goes the trolley........\nI always wanted to jump on and ride a cable car through San Francisco. I did just that, several times in fact. It did take a little to figure out the system and how not to look like a tourist, but in end I was hopping on and off like a pro.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Good way to get about", "One thing you have to do while here but it can get pricey i think depending how much you use it but very good service the chap on board was very friendly and helpful"], ["Reviewed January 21, 2018", 5.0, "The “Heart of San Francisco”!", "I love riding the cable cars in San Francisco! If you do nothing else in this beautiful city by the bay, you must ride the cable car! They are so much fun and many of the drivers are very friendly and make everyone smile and tell about some of the history of the city and the famous cable cars. A must do in my book!\nShow less"], ["Reviewed January 21, 2018", 5.0, "A Must Do While Visiting San Fran !!", "What a fun experience. Make sure you take in the whole experience and hang on the outside ledge if so inclined :-) . Also, take the time and watch the operators turn the streetcars around at the bottom of the hill. Amazing to see how they pivot around and head back up the hill.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Is a most", "Yes is something you always have to do in SF because if you don’t have the experience is like you don’t visit SF, my son enjoy a lot on this trip because know they allowed him to be in the outside part!!!"], ["Reviewed January 21, 2018", 4.0, "Cool", "It was great to see the cable cars around the city. I had been on them as a child and I remember enjoying it but on this trip we decided that we would ride one on our last day. Unluckily for us the line wasn’t running when we wanted to ride one so that was a little disappointing, especially since there was no one around to tell us about that when we visited the cable car museum.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Cool experience but pricey and adds up quickly", "Hubby and I decided to experience the cable cars during a mini trip to SF. We wanted to go to Union Square but the cars were only going to China Town for some reason, something traffic problem related. So we took it anyway thinking it'd still get us pretty far. They still charged us $7 per person even though they only took us half way and they dropped us off at the worst part of China Town, not where we wanted to go. Literally 10 mins later we were back on paying another $14 to go back to the piers because were were too far from the part of China Town we wanted (and it was raining and not worth walking). The experience was cool but it's really not worth the money, especially not if you're taking a short trip. Make sure they are running the whole route before taking a ride. Knowing what I know now I'd plan on taking Uber or the bus back.\nShow less"], ["Reviewed January 21, 2018", 4.0, "But, of course!", "How can you visit SF and not ride a cable car? Not our 1st time here. Not our first ride. $7 each way. Still fun and some great views of the city and out over the Bay. This time, there was a rainbow over the Golden Gate Bridge! The wait for a return trip from the turn-around near Ghirardelli Square was longer than we would have liked.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Fun way to get around the city", "I recommend buying a Muni day pass and taking a couple of rides. Can be crowded but the history and experience is worth it. Try sitting facing the bay."], ["Reviewed January 21, 2018", 5.0, "Perfect tourist attraction.", "Make sure you stand on the outside ledge and hang on if you can, the experience is much more authentic."], ["Reviewed January 20, 2018", 5.0, "A fun little activity, but also pretty handy transport", "It’s a bit of fun. Make sure you buy a return or day ticket if you plan to return to where you get on. Don’t wait at the terminal to get on board unless you need a seat or want to see the cars getting turned around. The queue is horrendous. Walk a stop towards your destination from the terminal and get on when it passes.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Must do number 2", "Seven dollars buys you a one way ticket on the cable car. Ours took us down to Fishermans Wharf. The staff went out of their way to make it a great experience"], ["Reviewed January 20, 2018", 4.0, "A must", "Great experience but long queues. which is expected. we travelled in August when the weather was not that warm so wrap up"], ["Reviewed January 20, 2018", 4.0, "$7 seemed pricy until..", "I thought that it was a little pricey but it's one of those things yo just have to do. After that thing climbed those hills, $7 seemed like a bargain."], ["Reviewed January 19, 2018", 3.0, "Fun experience with nice view", "The car ride experience was really fun but I have to say that it could be nicer if a conductor was not rude."], ["Reviewed January 19, 2018", 5.0, "Cable Cars!", "They go halfway to the stars.This is a fun ride if you don't live here. For us, it's another mode of transportation. You simply cannot visit San Francisco having never ridden on a cable car. What's wrong with you? Why would you even consider missing this? I believe that the Stockton line is far less\nShow less"]]}}