{"Cable Car Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Cable Car Museum", "url": "/Attraction_Review-g60713-d104939-Reviews-Cable_Car_Museum-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/f8/d8/6e/cc-museum-2.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "3196"}, "address": {"@type": "PostalAddress", "streetAddress": "1201 Mason St", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94108-1071", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "An Engineer's Delight", "This place is so interesting. You can see the cables drawing the cars on the different streets that they run. This is free, yet they do appreciate donations, so leave one to keep things like this free for us to see and visit. So much history in this building, from original cable cars, to historic photos and informational movies.\nShow less"], ["Reviewed 4 days ago", 4.0, "Really Interesting", "I lived in the Bay Area for many years and never visited this little gem. On a recent vist to San Francisco we decided to take a look. We found it very interesting to see the giant reels of cable that pull the cable cars throughout the city. There are many displays, some antique cable cars and a great gift shop. Don't forget to go downstairs so that you can actually see the cables underground.\nShow less"], ["Reviewed 4 days ago", 5.0, "Really fascinating", "Well worth the visit, loved seeing and hearing all about the cable cars. Really pleased we visited, a definite must see."], ["Reviewed 4 days ago", 5.0, "Fascinating and it's Free of Charge", "It was totally fascinated to see the cables that run under the city of San Francisco and read the placards of the history. The gift ship was pretty cool too."], ["Reviewed 4 days ago", 5.0, "Well worth a visit", "We thoroughly enjoyed our time at this museum and it was wonderful to see how the cable cars worked for real."], ["Reviewed 5 days ago", 5.0, "Really, really cool...", "This is a small, but very interesting museum where you can see the history of the cable car along with how the cars actually work. The museum is located at a spot where several cable cars pass by so very easy to get to. Museum is free, can't beat it!\nShow less"], ["Reviewed 5 days ago", 5.0, "Amazing to see, well worth the stop and it’s free", "The cable car museum is well worth the stop. It’s very informative and you get to see how the cable ropes get pulled to move the actual cable cars. And there’s some old cars there and parts etc. Well worth checking out"], ["Reviewed 6 days ago", 4.0, "For all the engineer geeks and curious people", "Definitely a cool tucked away gem for understanding and seeing what makes the cable cars work. If you read every poster/caption it will take you an hour...30 minutes is doable. Free. Nice gift shop. You can ride some of the cable cars to the museum...they make a stop.\nShow less"], ["Reviewed 1 week ago", 5.0, "Don't Miss This One", "One of the best souvenir shops is located inside this museum. If you have any interest in understanding how this engineering marvel works visit this place. Great for transportation lovers, kids and anyone with an engineering interest."], ["Reviewed 1 week ago", 4.0, "Hubby’s Treat 😆 Surprisingly Intersting", "After riding the Cable Cars it seemed a logical trip to see how it all works, this Museum is a little treat, in an original building there is a simple and fascinating method to how the cars run. But I was not expecting it to be out in the open to look down on and instantly understand the incredible way the cars are pulled around the City.\nI loved the history aspect of the Museum with old pics and original car on show. hubby loved the mechanics.\nNo fee to enter but donations very welcome..\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Worth a visit", "The cable cars are such an integral part of the city that to have this free entry museum telling you more about them is really interesting. Don't expect to spend a morning here but in half an hour you can learn a lot about this institution.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Very interesting and free", "If you’re at all mechanically inclined or like to see how things work, the Cable Car Museum is very interesting. You can see the actual “guts” of the San Francisco cable car network in action. Well done exhibits provide the history of the system as well. Free access,too.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Good thing to do free in SF (there are not many)", "Free admission. This is the working hub of the cable car system. You can see it operate up close. Some interesting displays contain a lot of history about cable car systems, SF and the 1906 earthquake and fire."], ["Reviewed 2 weeks ago", 5.0, "Interesting and fascinating museum", "It is perfect for all who like to know more about the history of the Cable Cars and are interested in the mechanical operations how it still works today. It is a small museum with informative historical exhibitions. I can highly recommend it. The museum is free, donations are appreciated. It is easy to get there by Cable Car, either by Mason or Powell line which stops near the museum or you can skip the long waiting lines and use the less frequented Californian line and walk a few steps from Grace Cathedral to the museum.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Everything’s Great When It’s Free! ;)", "We decided to check it out because of the fact that it’s free (donations encouraged). It’s a small museum but filled with all the information you’d want to know about the cable car system - both its history and how it works! We really really did enjoy this museum; it’s so cool! You even get a glimpse at the huge cable system that runs underground, under all the streets. There are restrooms and a gift shop! In my opinion, this is a must-see, and why not if it’s free right? Oh, there’s also a really awesome cafe across from the museum - Gallery Cafe ...everything under $10 there. They have sandwiches, bagels, (even breakfast sandwiches that are sooo good), coffee, tea, pastries, etc. WiFi, lots of seating both indoor and outdoor.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fascinating", "Take the time to visit this museum.\nIt’s not only a museum which gives you the history of the cable cars through the years and a guide to how they work but it’s also the place where all the cables come together which are running under the streets of San Francisco.\nThere is no admission charge, but they do accept donations and there is a shop on site for authentic souvenirs.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Cute museum frequently overlooked", "My husband and friends were enchanted by soaking in the history and mechanics of the Cable Car museum. Riding a cable car is a must for visitors, but the museum if a good place to spend an hour or so and really learning to appreciate the operation of cable cars. While not a fancy, shiny exhibit it is impressive. Cute souvenirs at the shop and take a few photos. You won't see this anywhere else in the world.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Very interesting", "Visiting from Australia and heard about the museum prior. Really informative displays of the history of the cable cars and great to be able to view the actual cables and workshop from an elevated position. Pleased that these cars were saved from replacement by buses. We used to have cable trams many years ago in Melbourne, so that added interest for me. Spent about 90 mins here. Free admission: but there is a box for donations which keeps the museum going for future generations, so please drop a couple of dollars in the box. My family bought a couple of souvenirs from the shop also.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun visit", "The place is free. It will take about 1 hour to go thru it. Fascinating history. Worthwhile and recommended."], ["Reviewed 4 weeks ago", 4.0, "Fun place to see SF history", "This is a hands on History Museum the kids and grand kids love to climb sound on the cable cars plus it give them a real chance to feel the history of San Francisco. Gets em away from there phones to get a taste of history\nShow less"], ["Reviewed January 24, 2018", 5.0, "Don't miss this!!", "Riding a cable car is an experience but seeing the museum is not too be missed. Unlike other museums, in this one you see the actual working cables that drive the cars. There is signage that explains this engineering marvel. And a short film that explains even more. Driving these cars is an art! And best of all, IT'S FREE!!!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Want to see the cable drive for all the 🚃?", "Such an interesting place giving history as well as a comprehensive understanding of cable car invention and subsequent history. Really inspiring place."], ["Reviewed January 21, 2018", 5.0, "Well worth the visit", "We visited the Cable Car Museum as part of Premium City tour and I'll openly admit before we went in I thought it would be a quick look around and leave; how wrong could I be. It was really interesting to see the see how the cable cars are still powered today as this is not just a museum, it is also still the powerhouse that winds the cables beneath the streets to pull the cable cars around San Francisco today.\nYou can stand on the mezzanine level and look down at the engines and enormous wheels which power the Powell-Hyde; Powell-Mason and California lines all in action. You can also go down the stairs to below the junction of Washington and mason St to see the huge cables going out into the street via the sheave room.\nIn the museum we saw the world's oldest surviving cable car - the Clay Street Hill grip car no. 8.\nThere's also a good merchandise store for good quality souvenirs inside the museum.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Fascinating & informative", "Loved this museum. Everything from the technical details of how they run, their development & destruction. Fantastic watching the cogs turn to move trolleys outside blocks away"], ["Reviewed January 15, 2018", 4.0, "Excellent free museum", "I can highly recommend this small museum. Two cable car lines (Powell-Mason and Powell-Hyde) go right past the museum so it is worth getting off and visiting.\nThe museum is in the same historic building as the power house that drives the cables and the car barn. Th museum is on several floors. The main display floor have a series of interesting exhibits charting the history of the cable cars, how the system works and a bit on the 1906 earthquake and its effect on the transport system. This floor overlooks the large electric motors and gears that continually drive the cables that continually move. Go down to a lower floor to see great wheels divert the cables out under the streets.\nOn a higher floor is the car barn which you cannot enter but you can look into from the street entrance (either Washington or Jackson). Unfortunately, during the day, there are more workers autos using the car barn as a parking lot, than there are cable cars.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Good museum for a quick stop", "We visited this museum with our son and it was really good to see and understand how the cable cars work and some of the history of the cable cars. We really liked seeing the cables and motors constantly running to pull the cable cars.\n\nThis museum while free is small and we were done in less than 30 minutes. I would recommend it if you are nearby and want to understand a bit more about the cable cars.\nShow less"], ["Reviewed January 12, 2018", 5.0, "A Great Way to Spend an Hour While Visiting Frisco", "This is a must-see if you're interested in the mechanical operation of the city's cable car system. It's very informative and you can view the actual cables and power house that runs everything, as well as various displays of old cable cars and the history of these iconic cars. You can take a cable car to get there, and there is no cost to visit! There's a cute gift shop that sells cable car memorabilia, and a penny-pressing machine. I also loved viewing the machine shop area.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Great place to visit - FREE", "We had only a few hours left in town and decided to stop at this place. We are so glad we did. It is much more than a museum. It is the actually behind the scenes operation on the current cable cars. You can watch the cables turn as it runs all 4 of the routes in San Francisco. This is a must see.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Interesting and Free", "Most touristy things cost money, however this museum is completely free and very interesting. Beware, young children might find it boring as there are many signs to read and not many interactive things to play with. This building is where the actual cable cars are run out of though, so that was impressive to begin with. The staff was friendly, I even bought a little souvenir and had no problems. Definitely check this out and make sure to ride one of the cars!\nShow less"], ["Reviewed January 4, 2018", 5.0, "Great Historical Attraction", "The cables that drive the cars run from here, so there is an incessant \"din\" which adds to the authenticity. A great way to spend an hour immersing yourself in the history of an original public transportation system."], ["Reviewed January 4, 2018", 5.0, "One of the absolute coolest places in town - Must see", "If yu want a history of the Cable Cars in SF and see how they truly operate then this plae will answer all your questions. Amazing Historic place!"], ["Reviewed January 4, 2018", 5.0, "Free!", "It's free, it's dry when it's raining, it's near decent, cheap food in Chinatown, and it is fascinating. I'm not much for riding the cable cars, I'd rather be on my bike, but the grandkids like it. And the machinery is so ancient, it's a wonder\nShow less"], ["Reviewed January 3, 2018", 5.0, "Must see in the City", "Who wants to go to a museum when your in SF. You do! If you've ever ridden the cable cars, you have to go this museum to learn how they work, and to see this hub in action. It's pretty great, and the smell of the hydraulic fluid and grease is pretty darn real. Cool place. And if I'm not mistake, this is the one place where you can get off the cable car and get back on without having to pay again.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Fun free museum that explains a lot in a few minutes!", "This is a quick walk through, unlike a typical museum, it’s actually a part of the cable car system that they’ve opened up to the public. You can see mechanics working on repairs, and the internal workings of the pulley system and gears. One of the most fascinating parts is how the fire and earthquakes affected the cable cars, displayed in photographs. Plus there are public restrooms. You can spend a few minutes or an hour learning about the historic cable cars.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Short, sweet, fascinating", "This free museum is really only a few rooms and also houses the guts of the cable car system in San Francisco. This is really a great place spend about an hour to discover the amazing feat of engineering the cable cars represent. When you've finished the tour step out side this old building and hop on the car to take a ride down the hill.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Well worth the visit!", "The Cable Car Museum not only houses memorabilia of years gone by, but also the workings of the entire cable car system. It is amazing to see the huge wheels, cables, and cogs that move the cars through the streets of San Francisco, even today! Worth the stop, no admittance, other than a donation. We enjoyed our visit there.\nShow less"], ["Reviewed December 27, 2017", 4.0, "A fascinating story well displayed", "The museum is free to the public; and shows the history and operation of the cable cars. It cannot be easy to show the complex engineering feats of 150 plus years ago but this display does it very well. It makes riding the cable cars all the more enjoyable.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Pleasant surprise", "This place is so interesting, just learning about how the cable cart system works and how it's been working all these years. It's all very fascinating. Check it out, it's free."], ["Reviewed December 21, 2017", 5.0, "History and the Working Machinery Together", "The real working motors and cables of the cable car system and maintenance shop are on display surrounded by historical documents, example mechanisms, and old cable cars. Totally authentic in all respects. Don't miss looking into the car barn on the sides of the building. View both from the Jackson and the Washington street sides.\nShow less"], ["Reviewed December 17, 2017", 5.0, "It is live!", "Maybe I was so captivated by this place because I love old technics. But have you ever been wondered how the famous SF cable cars work? Yes? And do you know it? This museum isn't a classical museum, it is real and live engine house with two stages for visitors. You will find there a lot of illustrative drawings with detailed explanations, some historical pieces of machines, cars etc., but above all, you will see, what exactly drives the cable cars outside, just now, just in real. No computers, no modern equipment, almost the same mechanical principle as a lot of years ago. Wow, amazing. And it is free of charge!\nShow less"], ["Reviewed December 16, 2017", 5.0, "World beneath us", "Not to be missed. We walk the streets & enjoy seeing/riding the cable cars & until we went to the museum we had no idea of what goes on below us. A definite must see."], ["Reviewed December 13, 2017", 5.0, "Great way to learn about the cable cars - recommend going after riding one of these cars", "It is a great way to understand the history and how these work. I always recommend that you should go to this museum after you have ridden one of these cars. That way you get to learn about how they operate and have seen how much the operators have to work to make sure your trip is fun and safe.\nShow less"], ["Reviewed December 12, 2017", 5.0, "Don't miss the Cable Car Museum - a piece of working history with free admission.", "So let's face it, any serious visitor to San Francisco is going to ride the cable car during their visit and if like me, you really need to know how these things ride the hills at a pretty impressive speed this is where you'll get all the answers - and it's free admission!\n\nDuring a recent trip to San Francisco prior to a cruise to Mexico we decided to buy a 3 day MUNI passport - excellent value at just $32 because one ride on the cable car will cost you $7! This gives you unlimited travel on all MUNI transport including the cable cars, buses & streetcars.\n\nArriving on a Saturday evening we bought our passports from a supermarket, scratched off the first day of use and set off to ride one of the iconic cable cars. We headed along Hyde from our hotel and as we reached Jackson just a few blocks down we saw the cable car heading for Fisherman's Wharf. We hopped on and like typical tourists decided to ride the reverse journey and at the Washington / Powell junction the Gripman announced the stop for the Cable Car museum and recommended that we visit one of San Francisco's only free addmission attractions at least once during our stay. We did and were so glad as this is an excellent piece of working history and even if you are not mechanically minded you can't help but be impressed by the huge machines that keep the cables running throughout the city. From an elevated position in the museum you get a birdseye view of the machinery and workshop which although a little noisy is a very orderly and 'well oiled' powerhouse.\n\nThere are some interesting relics from the days gone by on the upper floor, a pictorial history of the cable car, accounts of damage caused to system during the earthquake which devastated the city in 1906 and several displays showing the engineering involved in driving and stopping these wonderful machines. A film show with seating inside an old Cable Car chassis provides an excellent overview of the USA's only surviving Cable Car service and there is a shop selling books and souveniers.\n\nThis is a great place to spend an hour or more and when you are finished, stand at the stop directly outside and ride the Cable Car to Union Square, safe in the knowledge that you now know how these things work!\n\nEnjoy....\nShow less"], ["Reviewed December 11, 2017", 5.0, "Litte gem", "This is a little gem of a museum. It is free, and you get to see the ends of the cables from all 4 cable car lines. It doesn't take long to see the whole museum, but seeing the actual cables is worth a stop"], ["Reviewed December 11, 2017", 5.0, "The price is right", "This place was great. I learned so much. It is free. I had to leave a donation because I felt it was really deserved. They have an area with pictures and incredible film of the 1906 earthquake and fire. You can watch the cables actually being used to pull the cars. Great stop. I would go again.\nShow less"], ["Reviewed December 10, 2017", 5.0, "the perfect visit for every engineer and engineer at heart", "All that neat old machinery still working away after 100 years is amazing - and loads of fun for those of us who will go out of our way for a steam museum, a railroad museum or the ship museum at Fisherman's Wharf..."], ["Reviewed December 9, 2017", 5.0, "A worthwhile visit", "This is a cool free museum at the powerhouse for the SF cable cars. You can stand and watch the geared motors control the cables for all 4 active cable car lines. There is a simple gift shop on site and many old photos of the 1906 SF earthquake and fire.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Now we understand the cars!", "If you really want to understand what happens under the street to keep the cable cars running, the museum is the perfect place. Conveniently located, itʻs a great place to learn the history and current status of the cars."], ["Reviewed November 29, 2017", 5.0, "A must see freebie", "If you ever wondered how a cable car works this is the place to go. We spent about 3 hours looking at everything. Great Free Attraction"], ["Reviewed November 29, 2017", 5.0, "Great for Engineers and History Buffs", "Great little free museum with tidbits on how the cable cars work and the history of the cars. There are bathrooms in the back of the museum behind the gift shop. Anyone into cars or engineering will love this place. Everyone else will think it is ok.\nShow less"], ["Reviewed November 27, 2017", 4.0, "An essential place to visit in San Francisco", "I'm not a museum enthusiast but I enjoyed our visit to the Cable Car Museum. Very focussed with some great old photographs and exhibits. It's quite small and needs only 1-2 hours maximum. And its free!"], ["Reviewed November 26, 2017", 4.0, "Visit to see how the cable cars work", "This museum not only tells the history of the cable cars but is the operation centre for all the cable car routes. Well worth a visit and it's free!!,"], ["Reviewed November 26, 2017", 4.0, "Good Overview", "This FREE attraction is worth checking out if you enjoy riding the cable cars and want to get a behind the scenes glimpse of how they operate. It is amazing mechanisms that have been in place for SO long are still an integral part of transportation in modern day. In the museum you get to see the real hub of the lines moving the cable cars across the city. There are very well preserved cable cars and plenty of informative displays. It is worth popping in for 30 minutes or so.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Amazing behind the scenes look", "Stop here early during your visit to SF. It is amazing to learn about the history of the cable cars system and how it operates and is maintained today. You can see this nowhere else in the world. and best of all it is free. Not surprisingly the cable car line passes right by.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Very Informative & Free", "The museum can be easily accessed from the PH or PM cable car lines. The museum itself is free, and you don't need much more than an hour to see everything. Here you can see the cable system that powers the cable cars throughout the city as well as learn about the history of the cable car in San Francisco.\nShow less"], ["Reviewed November 22, 2017", 4.0, "Fun", "Nice break on the legs after shopping. Esp up those hills. Drivers are really friendly and playful and they will advise you of good photo points."], ["Reviewed November 18, 2017", 5.0, "Fascinating and educational.", "If you've ever wondered what makes them go, this is the place to find out. And you can watch the actual mechanism that drives the cables. Worth a visit."], ["Reviewed November 17, 2017", 5.0, "Do this after riding one of the cars", "Well worth a stop at the Cable Car Museum to understand how the cars work and their history. Besides - it is free!"], ["Reviewed November 14, 2017", 5.0, "Great for the money (£free(**$)", "A free museum with lost of nice little trinket and history about the cable Cars. You even get to see the working mechanics of the cable Cars and learn all about how they run and how they affect the city. Nice gift shop too."], ["Reviewed November 14, 2017", 3.0, "An interesting display, but a little basic and dated", "You must certainly visit this attraction while visiting SF. We visited here eight years ago with our newborn and wanted to return for her to see. Nothing had changed including old washed out videos from the 1980's. It's very cool to see the cable car drive systems and all the mechanics in action, but the museum is very basic. It's worth a 30 minute visit and it's free.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Its a must for every traveller to ride on cable cart", "We enjoyed a ride on this cable cart which is more than 100 years old & still well preserved & maintained. Its made up of wood & has nice sitting arrangements. Its being run on engine like a tram."], ["Reviewed November 8, 2017", 4.0, "Fascinating.", "This is free and such a historic and interesting place -- you really do not want to miss it!! I was astounded at the cleverness of how the cable cars worked."], ["Reviewed November 7, 2017", 5.0, "It's a cool museum!", "It's a cool museum to visit. We went and find out more about how the cable car works and shows different sets of wheels and cables for the different lines serving the city!"], ["Reviewed November 5, 2017", 5.0, "Very interesting and free", "Thought I knew about the San Francisco Cable Cars until I went to this Museum! So much more to the history, the mechanics of how they work, and how close they came to being closed down. Well worth a visit and I would think suitable for young children as well.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Free entrance and a fascinating insight", "We stopped here on our walk to Lombard Street and were surprised to find the museum was free entry. We’re so glad we decided to go inside because it gives you a great insight into the history of the wonderful cable cars and you can see the cables working in action!\nShow less"], ["Reviewed November 2, 2017", 5.0, "You gotta know how the system works!", "This museum was wonderful! A must see if you want to understand how the whole cable car system works throughout the city. Lots of nostalgia to read about, We spent more time in there than we thought we would!"], ["Reviewed October 31, 2017", 5.0, "Check this place out!!", "After riding the cable cars, check out this free museum. And it is also where the cable cars are serviced, stored at night, and cable maintained. This is their working \"garage\" full of interesting facts for the whole family and a nice break from walking the hills. They have a little movie about start of the cable cars as well, very informative.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Fascinating!", "Convenient location and really interesting to see the machinery that moves the cable cars around the city."], ["Reviewed October 30, 2017", 5.0, "Excellent free museum!", "A fascinating insiders view to how the cable cars work! I really enjoyed it, and the people were very friendly and nice. Worth stopping in BEFORE you ride to appreciate how the cable cars work, and the history behind them."], ["Reviewed October 30, 2017", 4.0, "Far more interesting that I expected...", "As we were spending the day walking around the city we stopped at the Museum. It was very interesting to read how the cable cars first came into prominence and the changes made over the years. It was especially interesting to watch the actual cables that run constantly. I never really thought about how the cable cars move and this was an eye opener. The Museum is free admission and there is a place for donations.\nThe only little complaint was that it was very hot and stuffy. It wasn't an overly hot day outside. But that shouldn't stop you from spending time at the Museum.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Facinating place to visit", "Our cable car brakeman recommended this as an interesting place to see. We love to ride the cable cars whenever we are in town so we decided to give it a try. He was right, it was very interesting. This is also the power station for all the cables. It was fascinating to watch the cables as they spun and twisted there way in and out of the building. The history of San Francisco and the cable car are so connected making it a great place to learn about both.\nShow less"], ["Reviewed October 30, 2017", 5.0, "How could we have missed this great place on our previous visits?", "San Francisco is one of, if not, our favourite place to visit. There is so much to see and do although even to date we have hardly scratched the service. In planning yet another visit to see our Grand-daughter my research suggested, what turned out to be a fascinating, visit to a museum that has been there since 1974.\nImagine something that has been around for seemingly ever still fully working opening it's door and providing a marvellous insight into its every day workings. The best has to be the city's cable cars. Its history has been pleasantly laid out all on one floor, even overlooking a birds eye view of its workings and the men who keep it in running order. DO GO SEE FOR YOUR SELF.\nI am writing this report wearing a tasteful t-shirt I purchased in their well stocked souvenir shop. Slightly over the odds price wise but abundant in taste and style!\nThey happily have a huge collection of details of many other places visitors should see in San Fran. Thanks to them was where we learnt of the American Bookbinding Museum, the subject of another of my reports.\nLong may we keep discovering gems like the CCM.\nShow less"], ["Reviewed October 29, 2017", 5.0, "interesting museum", "made a change not to be charged for visiting such a great small museum. Very interesting plenty of historical info and easy to get to."], ["Reviewed October 26, 2017", 4.0, "Mechanical Delight", "The San Francisco Cable Car Museum Is located in the Main Drive house for the entire system. Its engines serve the four cable car lines throughout the city. The motors drive large bull wheels and there are numerous plaques describing the mechanics and history of the technology employed. Included are two older cars and sections which can be used for photos. There is an extensive cable car gift shop. Visitors with a mechanical bent will love this museum. The longest cable is 21,500 feet long and moves at 9.5 mph.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Great Free Museum", "This was a very interesting museum. Learned a lot about the cable cars and their history in San Francisco. Was neat to see the working cables. It is a must see. Unfortunately parking is a bit tricky. We ended up parking in Chinatown and walking to the museum so plan on a bit of a hike if you are driving yourself.\nShow less"], ["Reviewed October 26, 2017", 5.0, "A great free museum", "A great little museum free to enter with a fascinating history of the famous San Francisco cable cars . In US a 'cable car' is actually a tram with a cable set in the ground between the wheels. The museum shows the development if the cable cars and also some great photos of the devastating earthquake and its effect on the city. You can see all the machinery running which drives the cables. There is a nice gift shop\nShow less"], ["Reviewed October 25, 2017", 5.0, "Fascinating!", "A small museum but packed with information and history about the iconic SF Cable Cars. The building also houses the cables and engines powering all four active cable car lines in the city. It's amazing to think that the science and technology hasn't changed since the cable was laid in the middle of the nineteenth century. Finish the tour by catching a cable car outside the museum and riding it up and down the hills.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Very impressive", "We loved seeing how the cable car system works & so efficiently still. Watching which system works the different routes with the pulleys in action was great. Then catching a cablecar to Fishermans Wharf & knowing what the driver was doing when different markers showed on the road. Makes the ride so much more interesting\nShow less"], ["Reviewed October 21, 2017", 5.0, "Combine with a cable car ride", "Great for a free entry and to understand the workings, its very clever.. little bit thin on the ground for things to see here but worth 30mins of your time and ideal to combine with a cable car ride .\nP.s. I’m not going to rate a free museum less that 5 star, you get what you pay for and this is decent!\nShow less"], ["Reviewed October 19, 2017", 5.0, "Excellent museum", "We stumbled across this museum and we're very impressed. It's free and doesn't take too long although all the exhibits are very interesting. It's where they power the cable cars so that adds to the level of interest. Definitely worth going to."], ["Reviewed October 19, 2017", 5.0, "FUN AND NO ADMISSION!", "The best bargain in San Francisco. This is the actual powerhouse for the cables themselves,all viewed from a balcony above the actual works. There is a good bit of other cable car memorabilia as well as lots of informative signs explaining how it all works. Go here before you ride a cable car and then you will understand all the things the car operator is doing as they drive up and down the hills. Don't forget to go downstairs to see the rest of the cable drive mechanism as it starts to go under the streets.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Great History", "The cable car museum is great for learning about the history of cable cars. I learned so much. My husband loved seeing how the cables are pulled through the streets and how it all works. It does smell like grease in the museum because it is a working building, so if you are sensitive you might want to do it quickly or avoid the inside. They have a little video you can watch that tells about how cable cars were nearly dropped, but the people of the city really fought for it. I would highly suggest this for kids who love machines.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Museum Nerd--I Loved It!", "Very interesting to see how the cable cars actually work. The history presented was very interesting to me. I really enjoyed this attraction. It was free but I did make a donation since I liked it so much. Even took pictures and video to send to my kids. Couldn't wait to tell my husband about it. Enjoyed the cable car ride to and from the wharf to the museum so I could experience a piece of history for myself. And yes, I am a museum nerd!\nShow less"], ["Reviewed October 17, 2017", 5.0, "Interesting plave", "If you like able cars and are interested to learn how they work you should visit. You can see the cables that are running under the lines. Also you learn how they work"], ["Reviewed October 17, 2017", 5.0, "how it works", "This free museum gives an overview of the history of cable cars, how they work and views of the running cables."], ["Reviewed October 16, 2017", 5.0, "Free and interesting!", "I didn't realize that the cable car museum was also the place that housed the cables that ran the cable cars around the city. Very interesting to see and read about the history. Worth checking out plus it's free!"], ["Reviewed October 16, 2017", 5.0, "A real insight into how the remarkable cable car system", "A real must for anyone visiting San Francisco and riding the famous cable cars. The museum is sited in the actual building where the cables are driven under the streets. Answered many of my questions about the engineering and logistics of such a complex system that just seems to work so well. Loved it and a very well stocked little shop as well.\nShow less"], ["Reviewed October 13, 2017", 4.0, "worth a visit", "Enjoyed learning all about the history of the cable cars in San Francisco . Free entry but does not open until 10.am ...so no rush .\n\nSpent and interesting hour examining the exhibits. love history and this was a very good\ninsight into an iconic San Francisco just see\nShow less"], ["Reviewed October 11, 2017", 5.0, "a must", "cable car is so unique and this is the place to learn everything about it. mt teen girl spent quite bit time to read all display. it was fun!"], ["Reviewed October 11, 2017", 5.0, "Fun Museum", "My husband and I purchased round trip cable car tickets. As a tourist, I loved the cable cars. It was interesting to watch the 2 on board operators manage the car while it's moving. It was especially interesting watching them turn the car around at the end of the line. Wimps need not apply.\nWe enjoyed the museum. Old historical cars are there. You also have the opportunity to see the giant spools with the\ncable wrapped around them. There are 4, one for each line. The cables actually run underground along the routes. Alot to see!\nShow less"], ["Reviewed October 10, 2017", 3.0, "A nice place to really learn about how the cable cars really work!", "IT a free place and not special needs equiped! BUT you can move quixckly or slowly and see all you want to see..go down stairs and see the wheels really working, very nice and worth a short visit!"], ["Reviewed October 9, 2017", 4.0, "Intrersting to see how the cable cars are moved around the city", "The museum has carriages from by gone years but also you can see the winders which provide the motive power to kove the trams up and down the steep hills."], ["Reviewed October 8, 2017", 4.0, "Make a point to stop by", "The Cable Car Museum tells the history of the cable car in San Francisco, but more importantly, it's the operational hub of the system. Here you can see the cables in action and really get an appreciation for how the system works. It's free and right on the cable car line so it's easy to get to. Not a place you'll spend a ton of time at, but it is both a fun and educational stop.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Great little place", "Well worth a quick stop. You can see and hear the actual cable tracks working and learn how it all works. You'll only need 15 minutes so make sure to pack it in to your tour."], ["Reviewed October 6, 2017", 4.0, "Excellent free museum of the Cable Car inSan Francisco", "This free museum traces the history and development of the Cable Car while providing an up close and personal look at the working of the mighty, antique machines that power the entire system. Open daily from 10am-6pm from April-Sept. and 10am-5pm Oct.-Mar. The location at the corner of Mason and Washington Street is easily reached by either Powell Street Cable Car lines. Do take the opportunity to visit the downstairs where the whirling There is a nice gift shop selling cable car souvenirs\nShow less"], ["Reviewed October 5, 2017", 5.0, "Well Worth a Visit", "Definitely worth stopping in on your way past. Fascinating to see the workings of the cable car system, and learn about the history."], ["Reviewed October 4, 2017", 4.0, "Must-visit free museum", "Rich history of SF cable cars on full display. A fascinating inside look at how cables operate ( then and now). Throwback cable cars are on display, and this is great museum for kids and adults alike. Expect to spend at least an hour or so ( even if you take tons of selfies). A must-visit historical landmark in SF.\nShow less"], ["Reviewed October 3, 2017", 3.0, "Nice look at history", "This is a free location with a little shop - but you can see the cable cars inner workings are it is fascinating to see how it all works"], ["Reviewed October 3, 2017", 5.0, "What to say!!", "It's pretty cool to see how the cable cars work in SF.This small museum details how they work & they are still operational! You can check everything out in less than 15-20 minutes.Overall, the next time you find yourself over cable car tracks, look between the crack to see the cable & you'll know how it works.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Interesting", "Catch the cable car from Powell and visit the cable car museum it's well worth it to see how this iconic cable car runs .its free with maybe a donation. One disappointing thing was that in the museum gift shop we couldn't find souvenirs made in America again only china . The cable car is American buy American made products !\nShow less"], ["Reviewed September 30, 2017", 5.0, "brilliant", "recommended by cable car guy. it is free and bigger than i expexted you can see old cable cars and also watch it in action. well worth a visit"], ["Reviewed September 29, 2017", 5.0, "very interesting", "If you're riding the cable cars, you should really stop by this museum and learn a little about their history. You can make a brief visit or linger to learn all the details, either works."], ["Reviewed September 29, 2017", 5.0, "Pleasantly Surprised", "I wasn't sure what to expect of this museum. And was really happy to see that this is not only a (small) museum, but is actually where the REAL workings of the cable cars are. So you can see all the cogs and cables working away pulling the cars through the city. That was very cool!\n\nThe museum part, very small and it doesn't take long. But still some interesting things there. The first cable car from way back in the day is there and a few interesting facts about the cables etc.\n\nIt's worth popping in! The cable cars are such an iconic part of the city. It's excellent to have seen them functioning in real time.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Great to see the actual mechanics of the underground cable system", "Great place to see the actually working cable, pulley system, and drive mechanism ,if you like that sort of thing We spent a few hours here watching and reading about its history"], ["Reviewed September 25, 2017", 4.0, "Interesting place to see how the Cable Cars Work", "It's a little hard to get to, but if you are nearby certainly stop in! Interesting and doesn't cost anything. Takes only a few minutes."], ["Reviewed September 25, 2017", 4.0, "Great little museum.", "Great little museum which is also the base and work shop for the whole cable car operation. You'll only spend an hour or two here but there is also a great little café opposite which is quite quirky."], ["Reviewed September 24, 2017", 5.0, "Mechanical wonder", "The cable car museum is a free attraction and allows you to see the actual workings of the cable cars as it is the cable car station also. Very interesting if you are mechanically inclined or just love cable cars."], ["Reviewed September 22, 2017", 4.0, "Great little place", "A very good little museum, showing the history of the citys most famous and popular attraction the Cable Car. As its relatively small this doesn't take a huge amount of time out of your day so stop by and enjoy"], ["Reviewed September 19, 2017", 4.0, "stop midway on your ride to see what drives the cars", "If you ride the cable car stop about halfway up at the museum which also houses the motors and huge wheels that drive the cables which run under the streets pulling the cars along.\nAsk the conductor where to get off - well worth spending a half hour there if you like mechanics or history (and it is free).\nShow less"], ["Reviewed September 19, 2017", 3.0, "A touch of San Francisci history", "As we were walking by the Cable Car Museum we thought we may as well enter. The visit was worthwhile but needed only to be 10 to 15 minutes."], ["Reviewed September 19, 2017", 5.0, "Worth your time!!", "Very interesting museum to visit.Loved learning all about the Cable Car system and how it works! Self tour with lots of information."], ["Reviewed September 17, 2017", 5.0, "grate viset", "we has a ride on the car like it part of what you do it still has all the old fation ways and it history is grate i had chat with few of the people fond good place to go it small just 30 min look\nShow less"], ["Reviewed September 17, 2017", 2.0, "San Francisco way", "Basically, you gotta ride the cable car- but take it only one way. Get your pictures BEFORE you the car gets going! Otherwise hands in and at your sides. the wait isn't as bad as it looks. The attendants work hard."], ["Reviewed September 14, 2017", 3.0, "Quick Visit/ Must See", "This is near Chinatown, so it is worth a quick visit here.\nCable Cars are a quintessential landmark in San Francisco. In here you can see the actual workings of the lines that run the 3 cable cars.\nThere is obviously information on the history of how they started and how they were saved.\nIt wont take you long to go thru here. Approximately 30mins is sufficient.\nIf you ever have a chance to just look at a cable car as it is stopping you will notice that the brakes are just wood! If you look in the tracks they have sand in them to help with the friction to stop the cable car. It really was fascinating to see the operational side of this.\nThere is a small gift shop here and yes as everyone has stated it is free.\nAfterward catch the Hyde cable car it will stop right at the top of Lombard St, another must when in San Francisco.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Fascinating peek into the history on how the cars work", "I had no idea of the rich history of cable cars in San Francisco. I love the city saved them from instruction. I recommend leaving a donation for this free museum."], ["Reviewed September 13, 2017", 5.0, "Fascinating Trip into History", "We ended up going to the Cable Car Museum to obtain a pass for the day for rides all over San Francisco, and there we learned all about the differences between the Cable Cars and the Trolley, and their development and use in San Francisco. It was a lot of fun! They have an interactive display for kids and a gift shop, as well. If you have a few minutes to spare (and it won't take you more than half an hour to go through the whole place), I think you'd enjoy going there!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Interesting!", "Was really good to see how Cable Cars work. It was very well done. We had taken rides on the cable cars during our visit and enjoyed them very much."], ["Reviewed September 7, 2017", 5.0, "Hidden Gem", "My wife and kids, ages 8 and 11, recently visited and were lucky enough to stumble upon this museum. We had not heard of it and can't believe we hadn't. It is a small, free museum that gives the history of cable cars and shows how they work. You even get to see the cables working as this is the hub and maintenance area for the city's cable cars.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Fabulous little treasure", "Visited in March 2015, but can't go back further than 2016 on Tripadvisor. Very interesting to learn about the mechanics and the history of the cable car system in San Francisco. A wonderful little addition to the San Francisco cable car experience and all for free too!\nShow less"], ["Reviewed September 6, 2017", 4.0, "Gears in Motion", "We stopped here at the end of our cable car ride and learned so much about the invention and history of the legendary cable cars. The best: watch the cables actually working with easy-to-understand explanations. An enriching experience. My husband was engrossed with the mechanics and stayed more than an hour. I stayed about 25 minutes then waited at a coffee shop across the street. Warning: because this is a working site, the noise volume is high\nShow less"], ["Reviewed September 6, 2017", 5.0, "Small .........but a MUST SEE if you are in San Francisco", "Ever wonder how exactly the cable cars work? Here you will see it in real time. Yes its a small museum about the history of cable cars, but its also the main hub of the cable cars today. You can see the enormous motors spinning the cables that carry the cars throughout the city. Its also the maintenance shop for the cable lines. The entrance is free and there is a reasonably priced gift shop.Average visit is about a half an hour.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Ride the cable cars, but don't skip this.", "Super, super interesting. This is the hub of the cable system and after riding the cars a few times it was so much fun to see the inner workings and heart of this wonderful system.\n\nCan't say enough good things about this place and it is right on the cable car line. So many interesting facts and exhibits, like which particular wood they use for the braking system and how often they need to change them (every 2-4 days!).\n\nLoved it.\nShow less"], ["Reviewed September 3, 2017", 5.0, "If you love cable cars, a must visit to learn how the work", "Very comprehensive and free museum to learn and appreciate how the cable cars work, why and when they were kept, and why cable cars are so important to San Francisco lore and attraction."], ["Reviewed September 3, 2017", 5.0, "Worth a drop by", "It takes about ten minutes and it is free -- kind of cool to see the inner workings of the cable lines -- you learn a little -- some nice clever souvenirs too"], ["Reviewed September 3, 2017", 5.0, "History and Machinery Under One Roof", "It would be a waste to not visit this free museum, particularly if you had the chance to ride a cable car. In fact, if you rode a cable car route end-to-end, it meant you went right by here.\n\nThere are several historic displays of San Francisco's famed cable cars and other city transportation, along with a gift shop. However, the real reason to go (in our opinion) is the opportunity to see live and in-person the active operations behind the cable car system. Specifically, you can see the actual cables for the four cable car lines in operation, both from an overhead platform, and in the basement with a viewing window. Because this is an active industrial site, it can get noisy and conversation may be difficult at times; the smells of oil and other lubricants are also present.\nShow less"], ["Reviewed September 1, 2017", 5.0, "Very interesting", "Lots of informative, easy to understand boards. Fascinating story behind the cable cars and great to see the workings. Recommended."], ["Reviewed August 30, 2017", 5.0, "FREE attraction", "The museum is super cool and you get to see the cables of the cable cars in motion plus view a variety of incarnations of the famous San Francisco Cable Car."], ["Reviewed August 28, 2017", 5.0, "See How the System Works!", "Smell the oil, see the cables being pulled around huge wheels! Feel the history of this wonderful, old system."], ["Reviewed August 26, 2017", 4.0, "So that's how they work!", "This was an interesting stop for us. I had not known much of San Francisco's cable car history, but coming here changed that. For those of you who like to understand how things work, this is a good stop for you. Best of all... it's free!\nShow less"], ["Reviewed August 24, 2017", 5.0, "The heart of the cable car", "Mind blowing to think that the Cable Car is been run from here.\nA must see exspecially if you have already been for a ride when you ask the question - how on earth can it go up and down the hills with just a brake and no engine?\nShow less"], ["Reviewed August 22, 2017", 5.0, "See and understand how the cable cars work", "It was a pleasant surprise to get off the cable car to find this museum. For anyone who is curious about how the cable cars work, who invented it when and why, and to see the inner workings of the cable cars, this is the place. It was fascinating to see pictures of what it was like then.....and to know that the city once had so many cable cars. Glad someone had to foresight to make sure these are preserved and that they kept a couple of the lines. San Francisco can't possibly be as charming as it is now without the cable car to the sky and the wonderful Victorians (some of which, at one time fell victim to the wrecking ball).\n\nBest of all, it's free!\nShow less"], ["Reviewed August 22, 2017", 5.0, "SO interesting.", "Learn all about this unique city transport system. You don't need to be an expert in engineering.\nGift shop should also stock a smaller book about the history and workings of the trams. The existing one is too heavy for tourist visitors to pack in their suitcases.\nShow less"], ["Reviewed August 21, 2017", 5.0, "The power house...here is how it works", "For the kids and Engineers among us who like to understand how things work this is the place. The cars themselves have no power, wonder how they move? by latching into these cables running under the street and all pulled by these huge wheels moved by powerful electric motors all housed here. Well...you will learn it here. Jump on a Cable Car after you are done. And the museum is free!!\nShow less"], ["Reviewed August 20, 2017", 4.0, "See how the run!", "This is FREE. See the cables that move these beasts around town. Very cool if you like to see how things work. Makes you appreciate all the hard work that went into getting these things started."], ["Reviewed August 17, 2017", 4.0, "cable car museum - Interesting!", "nice to visit this free museum BEFORE you take a ride on the cable cars, it helps you appreciate the ride. Allow at 45 mins to tour this museum."], ["Reviewed August 17, 2017", 3.0, "History of Cable Cars -San Francisco", "I found the Cable Car Museum to be very educational. It provided great history as there was a great change in time from horse & buggy, automobiles and, in infamous cable cars of San Francisco.\n\nThe museum displays many components of different cable cars, engines to designing of cables that make them run.\n\nLots of reading history, movie clips, artifacts, souvenirs, photos, and live cable viewing functions on the basement floor.\n\nI found the history of the San Francisco earthquake educational, too. It was a devastating time of food rations, many deaths, society moving to other destinations, employment, to the redevelopment of a new San Francisco.\n\nI loved it. AND it was free!\nShow less"], ["Reviewed August 16, 2017", 4.0, "Amazing view of the cable car system", "You can't really believe that the cable cars work on this system but they do! Interesting for all and a must for engineering geeks"], ["Reviewed August 15, 2017", 5.0, "Free and neat!", "Cool place to see - right on the cable car route - and you can see the actual working cables of the street cars!"], ["Reviewed August 15, 2017", 5.0, "What a nice treat", "Excellent museum and it's free.\n\nOur family stopped in after having ridden the cable cars for a couple of days. I am glad we did. The inner workings of the actual cable cars are on display both out in the open as well as some of the subterranean gears behind glass. The museum part has lots of interesting placards and self-guided tour pieces which were excellent. While we only sampled a small amount of the vast information, it was clear that a lot of thought had been put into the museum. I am so happy we checked it out.\n\nWe stayed about an hour and that was great though you could pop in for 20 minutes or easily spend 2-3 hours there depending on your level of interest and age of your audience. Great that it's free to the public. Really nice gift shop with books, patches, stickers, trinkets, little cable cars, etc. as well.\nShow less"], ["Reviewed August 15, 2017", 5.0, "A Pleasant (and Free!) Surprise", "My fiance had visited here previously and wanted to take me there. I was thrilled that he did. This is a fascinating place that gives you everything you could want to know to know about cable cars and San Fran history during the cable car heyday and the major earthquake. We went first thing in the morning when it opened so it was not crowded and we could spend plenty of time. If you like to read all of the information provided like I do, you could easily spend a couple of hours. Do yourself a favor and don't skip a visit even if you can only spend a half hour or so.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Definitely Stop Here - It is FREE!", "Great little museum that gives you an appreciation for all that makes the cable cars unique! Definitely recommend stopping in when doing a tour of the San Francisco!"], ["Reviewed August 12, 2017", 5.0, "Historic Museum Worth A Visit", "I loved the Cable Car Museum. It has lots of displays and is still in use. I've attached some of my photos I took when I first visited in 2010 or so. My other photos I recently took are a bit better but they are photos I sell so I don't want to use those here. I hope the photos, taken with a consumer-grade DSLR can give you an idea of what it's like there. You will learn a lot about cable cars and how vital they were. It's a great place for old and young. I believe it is wheelchair- and stroller-friendly. You could spend an hour or two there and that would be sufficient. Nearby, you can catch a real cable car.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Great and it's free", "Rather than make guesses about how the cable cars operate, why not go to the cable car museum and find out. Absolutely fascinating. You can see the cables for all four lines and find out what happens if one of the cables breaks. Nice gift shop and the museum is free! It’s even on a cable car line!\nShow less"], ["Reviewed August 11, 2017", 4.0, "Cool spot if you have the time", "Only spent about 15 mins here but it was neat seeing the history of the Cable Cars and watching how they work"], ["Reviewed August 10, 2017", 5.0, "INTERESTING", "Such an interesting museum. Kind of accidentally stumbled upon it but man it was worth it! It's free to get in and lots of cool stuff to see! So much history behind it."], ["Reviewed August 9, 2017", 5.0, "NZ Family Holiday", "Jumping off the Cable Car to vist this place made the vist even more fun! Miss 6 was fascinated by the cables and how they worked. Seeing the street names on the cables, seeing them work and realising we had just been on that Cable Car she thought was just the coolest thing in the world.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Learn all about cable cars", "This is a great stop during a trip to San Francisco. It is free and takes about 30 minutes. You get to see the workings of the cable car system and learn how it operates. There is also a gift shop that has some good, inexpensive souvenirs of your trip..\nShow less"], ["Reviewed August 7, 2017", 3.0, "A museum for a local icon", "If you are interested in the San Francisco cable cars, this is a nice place to visit and won’t take much of you time. You can view the the big wheels that actually keep the cable moving in the tracks throughout the cable car routes. You can learn how the grip on the car latches on and off of the cable. There are also a couple of historic cable cars to see. The museum is very informative, but not exciting. It is easy to reach by cable car or on foot, but don’t even think about trying to find a parking place nearby.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Nice for a quick visit", "It's a free museum/exposition on top of the mechanical installation which keeps the cable cars running. Very impressive and a nice souvenirshop."], ["Reviewed August 4, 2017", 4.0, "It's free.", "Everyone should ride the cable car and then go to this museum to see how they work. Very interesting."], ["Reviewed August 4, 2017", 5.0, "Must be done", "What a great experience ,you can actually see the workings of the cable cars with explanations of how it all works with a great video of times gone by"], ["Reviewed August 4, 2017", 5.0, "Family loved it- Must Stop!", "A great SF museum to learn about the history of the cable cars and see the actual pulleys in action. Nice display of items, little movie clips and gift shop. A must stop!!!"], ["Reviewed August 2, 2017", 5.0, "what a treat and little gem", "this was a bit of a walk up and down from pier 39 but worth the walk and history of the trams and city. great visit. great little gem."], ["Reviewed August 1, 2017", 5.0, "Absolutely fascinating", "It really is worth seeking out this fascinating and free museum. The cable car is synonymous with San Francisco and the story of the cable car is central to the development of the city. Not only is the history of the cable car a fascinating one, but the museum is housed within the building which houses the engines which power the cars today. You can stand above these magnificent engines and watch the cables being driven.\n\nWhat is astonishing to reflect upon is that the engines which are pulling the cable cars today, are the same engines which were pulling the cable cars before the 1906 earthquake. It is all fascinating stuff and makes one appreciate the ride on the cable car all the more.\nShow less"], ["Reviewed July 31, 2017", 5.0, "My husband was fasinated!", "After about 2 hours I had to remind him it was lunchtime to get him out of there. He loved it. It is very interested to see how it all comes together."], ["Reviewed July 29, 2017", 5.0, "Hidden Gem that is worth the visit -- Oh, and it's free!", "We had heard about the San Francisco Cable Car Museum and, quite frankly, hadn't even considered going to it; heck, we had never even ridden a cable car even though we'd been to San Francsico on maybe 20 occasions! Fortunately, we happened upon the museum one day when we were wandering the hilly streets trying to burn off lunch calories. My wife and I looked at each other, grinned, and plunged right in because there was neither a line to get in, nor was there an entrance fee to pay. Wow, what a marvelous experience! Our visit of about 90 minutes included meandering through the various galleries with historical pictures and accounts of the design and growth of the cable car system in San Francisco since its inception. But the highlight for me was seeing the confluence of all the cables that run under the streets finally converging in this single location. The powerful wheels spinning with the cables were an amazing sight. It was an awe inspiring experience to watch the cables zipping by knowing that they were flowing under the concrete streets to points miles away. San Francisco is an expensive city to visit; it has lots to see and do, and this is one attraction that positively adds to the value factor.\nShow less"], ["Reviewed July 29, 2017", 5.0, "A Great Stop for 1/2 Hour or So", "In addition to interesting historical exhibits and displays, this place contains the main workings (huge pulleys, wheels, motors, workshops, etc.) for the cable car lines. This is a must visit if you are touring SF for fun. They have a really good gift shop as well...\nShow less"], ["Reviewed July 28, 2017", 5.0, "fantastic free museum", "went here with no real expectation and it blew my mind, the workings of the cable car system are just fantastic, the museum isnt too large and full of really interesting stuff a must visit for me!"], ["Reviewed July 27, 2017", 5.0, "Cable Car Museum", "It was fun to see the history of Cable Cars in SF. We road the cable cars and it is well worth it. If you buy a MUNI pass the cable car is included. Cable car ride was a highlight of the trip."], ["Reviewed July 27, 2017", 5.0, "Fascinating!", "Loved seeing the cables in action and learning about how the cable cars operate. I'm no engineer, but I could definitely appreciate the engineering that it took to create the cable car system. The information at this free museum is simply fascinating!"], ["Reviewed July 27, 2017", 4.0, "45 minutes", "This is a working museum and tells the story of the trams from early days to present, it's a free museum to read and look around about 45 minutes. At the back that's connected to the museum is where they store all the trams about 44 overnight.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Excellent free working museum", "This museum was excellent because it is actually the cables that are pulling the cable cars through the city. Plus it had the history of the cable cars in San Francisco. They also have some old cable cars there and a nice gift shop."], ["Reviewed July 26, 2017", 4.0, "Cool insight to the history of the cable cars", "This museum is free and gives an interesting insight to the history of the cable cars in San Francisco. What you might not know is that this museum is also the actual place where the cables are run from. Four big wheels that spin can be seen on the first floor, while the museum and gift shop is up on the second floor. Worth a visit\n\nTwo of the cable car lines go past this museum so you can hop on or off here.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Interesting and unique working museum", "My family (wife and two kids, age 10 and 12) visited SF in July 2017.\n\nI wanted to see and show the kids how the cable car system worked. This is a working museum after all, with the gears that move the cables under the city streets.\n\nOur visit lasted less than an hour, but it was interesting nonetheless. The fact that it is free is a real bonus. Plus, it is easily accessible via cable car!\nShow less"], ["Reviewed July 24, 2017", 4.0, "Very interesting", "The museum was far more interesting than the ride on the cable car. It was amazing to watch how the cables actually ran the cable cars which were above the ground."], ["Reviewed July 22, 2017", 4.0, "A good free museum to visit", "We visited on our last morning in San Francisco. The museum is free to enter. Its also the winding house for the whole cable car system so you can see the cables running round enormous wheels. There are old cable cars there to look at and lots of information about the history of cable cars in San Francisco. A really good visit/\nShow less"], ["Reviewed July 22, 2017", 5.0, "Watch the System Work", "This museum is actually part of the cable car system as the cables are driven continuously under streets. You can see it work in real-time. The museum is also a historical record place, but to see and hear the system work is simple amazing."], ["Reviewed July 21, 2017", 4.0, "Informative and interesting excursion", "While on our Segway tour, we took a break and visited the Cable Car Museum on Mason Street. It was fascinating to see the actual cables in use for the cable car system. If you walk downstairs you will see the huge sheaves operating the cables under ground and upstairs you see powerhouse and the winding wheels.\n\nThey have a gift shop and lots of displays of equipment and full sized cable cars.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Living Museum Is a Time Travel Experience", "It is exciting to see the giant Victorian wheels that direct the cables that run the cable cars on their routes, just as they did in the beginning. It is time travel at its best. And there is also a museum with information about the cable car history and changes over time. Fun for all ages\nShow less"], ["Reviewed July 19, 2017", 5.0, "Free!!! Worth a visit", "It's definitely worth a visit and it's free!! It's really interesting. Doesn't take longer than an hour but it gives a great overview of this system."], ["Reviewed July 18, 2017", 5.0, "Fascinating mechanism", "This museum is also a display of the still-in-use mechanism that runs all the cable cars in San Francisco. It was really cool to see! Since the machines are in operation they produce quite a bit of noise. Had I known this beforehand I would have brought some ear plugs since we ended up staying for about 1-1.5 hours. The displays were informative, with content ranging from interesting base facts to detailed drawings surely aimed at interested engineers - something for everyone.\n\nEntrance was free. I would recommend a visit. A good way to get there is by cable car, two different lines pass by right outside.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Favorite Museum in San Fran", "What better than to take the cable car to the cable car museum. The technology and history behind the cars is all there. Plush it's a working junction point. Great for all ages"], ["Reviewed July 16, 2017", 4.0, "Interesting", "Free museum situated in the Nob Hill district of San Franscisco. See the historical workings of the cable cars and read the Explanations of the workings. Souvenir shop on site."], ["Reviewed July 15, 2017", 4.0, "My 4 year old son enjoyed it!", "Stopped by the museum because it was recommended by a friend. My son loves trains and all forms of transportation and he was excited to see how the cable cars work."], ["Reviewed July 14, 2017", 4.0, "Great stop to learn more about this great system", "There are old cable cars and equipment on display. Maps of the four cable runs, samples of new cable and worn cable. Examples of how the operator grabs the cable and releases it. There are several photo op locations. Really interesting is that you can view the actual cabled for each of the four streets in operation in the power house from overhead as well as below in the basement. Finally, there is a gift shop with neat items and clothing. Allow 30 minutes or so. There are also bathrooms, so this is a great place to break.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Free museum", "In the city of San Francisco, not much is free. This museum was. It was smaller than I had expected. But viewing the cables that are currently running the 3 lines of cable cars was good enough for the entire trip. It is one the cable car line, however, if you pay per trip for the cable car. You would be better off getting the full day fare - 3 on/off trips equals the full day fare.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Do you like to know how things work?", "If you like to know how things work, see mechanical things in operation, marvel at magnificent design and engineering, are you grateful for the preservation of amazing unique historical treasures? You will like this place. See how the cables that are actually driving the cars in real time are maintained and move through the city. See underground and above ground too.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Very interesting", "Off the beaten track , and only small, but if you pass it, it's worth half an hour of your day, a fascinating insight to such a big operation."], ["Reviewed July 10, 2017", 4.0, "Very interesting spot to visit", "We stopped by the Cable Car Museum and was impressed with the historical items on display. Also we got to see how the cable car system works with the view of the cable pulley system. Some really great photos from the earthquake and subsequent fires in the area and the rebuilding effort. Plan around 1-2 hours for your visit.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Interesting for all ages", "The San Francisco cable cars are iconic and riding them has become a tourist attraction rather than a mode of transport, but fun. However, it's not just about the ride on the cable car - what's really interesting is the history behind them and how they work. This museum provides a lot of the history surrounding the cable cars and has some of the very oldest cable cars on display. Definitely worth a stop. The only issue is that while it's a stop from two of the cable car routes, the cost of the cable car ride is $7 (unless you purchase a day-pass) and if you get off at the museum you will need to pay a full fare to get back on the cable car. Unless you have a lot of time (which we didn't) consider getting a day-pass ($21 I believe gives you unlimited rides in one calendar day), ride the cable car to the museum, then use the pass to get back on to go to Lombard Street, the wharf or Ghirardelli.\nShow less"], ["Reviewed July 10, 2017", 5.0, "So very interesting and FREE.", "We looked around the museum and saw the actual workings of the cars and how it all began and the gift shop has many unusual gifts as well as the usual magnets and picture frames. Very reasonably priced as well."], ["Reviewed July 10, 2017", 5.0, "Everything You Ever Wanted to Know about Cable Cars and Free", "Found the museum really interesting. Totally explains the evolution and history of cable cars as well as their workings. The museum actually is the machines running the cities cable cars so really demonstrates how it all works. I learned a whole lot as I thought I knew it all but found I did not. Not to be missed is the museum talks and has numerous pictures and displays of the great San Francisco earthquake of 1906. Also very informative and not to be missed the pictures and information is great and a really learning experience. If you ride a cable car you must visit the museum to understand it all. Again it is also free so the price can't be beat.\nShow less"], ["Reviewed July 7, 2017", 5.0, "How Everything Works", "If you are at all interested in how the Cable Cars work and also the history of them, this is the place for you. It is a really interesting museum and is for all ages. It is free and is for all ages. The history of the Cable Cars and how it was saved for posterity, is particularly interesting.\nShow less"], ["Reviewed July 5, 2017", 5.0, "A San Francisco Treasure", "Remarkable history combined with real life in action of the city's Cable Cars, their history, heritage and importance. Simply amazing to see in action. Must visit! Easy to access, something for all in the family."], ["Reviewed July 5, 2017", 4.0, "Worth a stop", "Very brief (one hour) visit, but worthwhile. A great opportunity to see the machinery and engineering behind the SF's cable cars, and learn about the history behind them. Easy to get to by cable car, and not a terrible walk to Fisherman's Wharf and Lombard Street.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Do not miss this one.", "Informative, interesting and free. Gives information on how the cable cars run and allows you to see the actual huge wheels and cables that make the cars run. Also heaps of information about the earthquake and fire of 1906"], ["Reviewed July 4, 2017", 5.0, "Worth popping in to", "If you are doing the cable cars in San Fran, it is worth jumping off and popping into this free attraction - you may only spend 20 mins, however it is mechanically fascinating"], ["Reviewed July 1, 2017", 4.0, "Very interesting", "Very interesting and informative museum of San Francisco's unique mode of transport. Admission is free and photos are allowed inside the museum. It's not the biggest museum and you could easily do it in an hour or less, depending on how detailed you are in viewing the exhibits. I especially liked looking at the entire thing from the top of the balcony. Seeing the motors running underneath the road was cool too. A good visit for history buffs and transport enthusiasts.\nShow less"], ["Reviewed June 29, 2017", 5.0, "well worth a look", "very interesting and informative - cable car stop right out front - staff and volunteers helpful and its free !!!"], ["Reviewed June 28, 2017", 3.0, "Good way to kill some time", "I went to the museum one afternoon while in SF since it was a few blocks from my hotel. It was not a spectacular museum but it is free so you can't really complain. It was cool to see the cables going for the various lines. The information and artifacts they have are interesting. Honestly, it will take less than an hour to look at everything. Like I said, it's something to do and wasn't crowded.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Fascinating insight", "Firstly for a free attraction this is top notch, great to learn the full story from how the cars just grip on to a continuously running cable, to the giant motors the pull the cable around the city. Many historic trams too plus a great gift shop.\nShow less"], ["Reviewed June 27, 2017", 3.0, "Expected more", "Okay, it is free but there is very little to see and do. If you have kids do not expect to have them be allowed to climb on anything! Can't they gave an old car for kids to climb on? Everything is roped off. You can go to the basement to see how the cable system works underground which is interesting. Adults may find this interesting but expect a 15 minute visit for kids\nShow less"], ["Reviewed June 27, 2017", 5.0, "Free, and very cool", "Awesome place, very cool seeing the cable mechanisms that run the city's cable cars. Loved it - nice building and cool old cable car displays inside."], ["Reviewed June 26, 2017", 5.0, "Free but good", "There isn't too much free in San Francisco but the Cable Car Museum is among them. It's a working Museum where visitors can see the cables being pulled under the streets by giant wheels. There are also interesting exhibits and a nice gift store. You can't go wrong.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Fantastic piece of SF history", "Great place to discover the story of the San Francisco Cable Cars and especially great to see the mechanical equipment that powers the cars still in full working order. Well worth a visit."], ["Reviewed June 25, 2017", 5.0, "Fascinating to see how they work!", "Really interesting, and free entry - good way to spend 90 minutes, particularly if it is raining. Very interesting both in terms of the history of cable cars in San Fran, and in terms of seeing how they work now - it is more than a museum - it is the working hub of the machinery to move all the cable cars\nShow less"], ["Reviewed June 25, 2017", 5.0, "See how everything works", "The cable car museum is a must see for those that want to know how these things work! The museum is free and housed below the cable car barn and above the mechanical barn. You can see how they work in real time. We got to see how they adjusted the tension while we were there. There is also some history of the cable car. If you want a unique souvenir, you can get a piece of a used cable!\nShow less"], ["Reviewed June 25, 2017", 4.0, "interesting perspective!", "Loved seeing the underground working of the cables and all the pictures of the earthquake and early SF cable cars. Fun but very hot and stuffy in there."], ["Reviewed June 24, 2017", 4.0, "Fun place to visit", "Was recommended by an Uber driver. Really enjoyed our visit. Learned a lot about cable cars and San Francisco history. This is the actual place where the cable is pulled to move the cable cars around the city. It's a noisy place for that reason. If you are interested in engineering or technology this is for you. Not a large museum so you can fully take advantage of it in a couple of hours\nShow less"], ["Reviewed June 24, 2017", 5.0, "SEE HOW THE CABLE CAR OPERATES - INCREDIBLE", "You MUST include a brief stop at the Cable Car Museum (free) while visiting San Francisco. My wife and I took the Powell Street Cable Car from the turn-around at Bay Street/Fisherman's Wharf to Union Square. Passing the Cable Car Museum en-route, we walked back to Mason Street to see just how the cable car operates. The museum actually houses the original motors, manufactured in Philadelphia, that STILL power the cable car system. Diagrams explain the inner workings of this fascinating San Francisco icon.\nShow less"]]}}