{"Cabrillo National Monument": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Cabrillo National Monument", "url": "/Attraction_Review-g60750-d116565-Reviews-Cabrillo_National_Monument-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/d9/35/1d/photo0jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "4086"}, "address": {"@type": "PostalAddress", "streetAddress": "1800 Cabrillo Memorial Dr", "addressLocality": "", "addressRegion": "California", "postalCode": "92106-3601", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 4.0, "The tidal pools", "The tidal pools were interesting saw lots of hermit crabs and sea anemones not much else. It is always chilly here when the wind is coming off the water."], ["Reviewed yesterday", 5.0, "A National Park at the tip of Point Loma.", "The drive takes you past the Rosecrans National Cemetery and you are humbled by the uniform headstones on both sides of the road. At the end of the road there are look out areas and a visitors’ center. A short walk leads to the light house and another quick takes you to the tidal pools. Plan several hours at the point. It’s possible it see whales, but we did not.the picture is of San Diego as seen from the top of the point.\nShow less"], ["Reviewed yesterday", 4.0, "Don't Miss.", "Ventured out to the Monument on a VERY cold and windy February Day. Exhibits were well done and walk to lighthouse was pleasant."], ["Reviewed 2 days ago", 4.0, "Beautifully situated above it all", "What a fantastic view. Really has a panoramic view the San Diego area and down into Mexico. I brought my breakfast and enjoyed it near the whale overlook. It was a beautiful sunny day but a bit windy. Tried to enjoy the tidepools but it's a younger, fitter person's venue. But I lived to tell. The paths are nice. Parking can be tough. The facility is very nice.\nShow less"], ["Reviewed 3 days ago", 5.0, "Nice place to visit.", "Very interesting and worthwhile to visit. Amazing views of the San Diego Harbor and Pacific Ocean. Lighthouse was very interesting and a great piece of history. Whale watching on the Pacific side was wonderful."], ["Reviewed 4 days ago", 3.0, "Good views", "This place offers good view of San Diego from above. It was interesting to check out the living quarters of the light house keeper in past."], ["Reviewed 5 days ago", 4.0, "Afternoon sun", "We spent about an hour here, which wasn't enough. We spent most of our time at the lookout, which looks towards the city. We had a super quick look through the visitor centre, but it was closing time by then so didn't really get to enjoy it.\nShow less"], ["Reviewed 6 days ago", 5.0, "BREATHTAKING VIEWS", "Just amazing spot to enjoy views of San Diego and surrounding areas. Also very interesting to tour the lighthouse and see the Pacific side."], ["Reviewed 6 days ago", 5.0, "Beautiful way to see San Diego and the Pacific Ocean", "Just beautiful!! I would definitely recommend taking the short drive to visit this scenic spot. Active duty military and those with a National Parks pass, get in free. Be sure to check there hours out online, as they close earlier than other national sites. Must sees are the lighthouse, tidal pools, and whale observation area.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful light house", "This is a beautifull lighthouse and interpative centre. There's also a nice trail for walking abd the tide pools are fun."], ["Reviewed 1 week ago", 5.0, "Photo opportunities in all directions", "The monument sits atop San Diego's famous promontory, Point Loma. From there, I viewed the Pacific Ocean, and the beautiful city of San Diego. Not far away is the Navy airbase on Coronado so I could see aircraft take off and land and also watch fishing boats, Navy vessels, container ships, and cruise ships coming and going. It's about a half-hour drive from the airport, but worth the trip. There is a moderate museum on-site as well as a generous parking lot. Alow approximately one hour for your visit.\nShow less"], ["Reviewed 1 week ago", 5.0, "Gem of the West", "The Cabrillo Monument has stunning views including downtown, Mexico, The Islands, Naval Base w a great observatory and Lighthouse."], ["Reviewed 1 week ago", 4.0, "Scenic view of San Diego with a good historical perspective", "Offers a great scenic view of the harbor area of San Diego. Downtown SD can be seen and the museum building has a knowledgeable docent to explain the military connection."], ["Reviewed 1 week ago", 3.0, "Nice view of San Diego", "This is a national park that charges entrance fee unless you have a park pass. Nice visitor center with different educational films. Good view of city, easy walk to lighthouse. Few military remnants. We did not go down to beach area. Go on a clear day.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful view", "Worth the trip to see the view of the bay and beautiful Pacific Ocean. There are many hiking trails and viewing sites. You can walk into and up the lighthouse. Nice to get fresh air and enjoy the expansive view."], ["Reviewed 1 week ago", 4.0, "Worth Seeing", "This was quite interesting as a historical site, but the beauty of the area was worthwhile. It's also worth parking just below the entry (you still pay full price) and walking 1/4-1/2 mile past the cemetery. Beautiful area. We also walked to several viewing areas where we were able to see quite a few whales-- about every 2-3 minutes (mid-end February). Worth seeing.\nShow less"], ["Reviewed 1 week ago", 5.0, "Majestic", "The view of the water, the base, the airport and city is etched in my memory. It is beautiful and noteworthy in my opinion."], ["Reviewed 1 week ago", 5.0, "Wonderful Vista of San Diego", "If you don’t have a lot of time and what to get a quick overview of San Diego and Pacific Ocean, this place is a must. Driving to monument through Rosencrance National Cementary set a respectful tone. Remember, National Park so it costs $$$ to enter unless you have a Senior National Park pass.\nShow less"], ["Reviewed 1 week ago", 5.0, "School visit", "Great place to visit and get a little bit of California history. Be sure to visit the light tower and try to catch the movie on Cabrillo. Go during a sunny day so you can look out over the water. If you go early enough, you can visit the tide pools as well.\nShow less"], ["Reviewed 1 week ago", 5.0, "Point Loma Tide Pools Only", "My 2 kids (19 & 21) and I visited the tide pools on a Sunday afternoon. Entrance fee for a day’s visit is $15 that includes a brochure of the entire site. Parking is limited and close to the cliffs. You must walk down and climb down the cliffs/rocks to get to the tide pools, which are abundant. Be warned: It’s just you and the ocean. Bring sunblock, towels, take off shoes to fully explore. Extremely slippery from algae/rocks. We observed anemones, fish, crabs, shells, and a rare nudibranch!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great start to the week", "We came here on a weekday late morning pretty much straight from the airport. We used our national park pass to get in. There are a number of parking areas and it was busy but not crowded.\nSince this was our first trip to San Diego this was a wonderful first activity. We could see the harbor, Coronado, Mexico, and the open Pacific. We saw migrating gray whales spouting off the coast. We enjoyed the great weather and learning some San Diego history.\nOn the grounds are several buildings with exhibits, some related to Cabrillo and also the lighthouse. A school group was visiting and they were being guided by a man in sailor character.\nWe hiked down the Bayside trail which was more like a road. Round trip about two miles. Very enjoyable to see the views and all the different water crafts as well as the flyovers of the military helicopters and jets.\nBefore we left we drove to the tide pools. Several different lots and cars were coming and going. They did have staff there to make sure people were abiding by the rules. We took a laminated card of critter pictures and tried to see what we could find.\nAll in all we spent over three hours and felt it was very worthwhile.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great view", "The monument is accessed via a military base so pay attention to posted hours. The view is great. There is a story about the Spanish expedition that led to Europe discovering this part of the new world. There is a good video about tide pools. Also there is a lighthouse to see and the tide pools.\nShow less"], ["Reviewed 1 week ago", 5.0, "Don't Miss This!", "Skip the tourist venues in downtown San Diego and treat yourself to some of the most beautiful vistas you'll ever experience, a painless dose of important history, and all the usual high-quality interpretation and organization you'd expect from our National Park Service. Our visit was the highlight of our 5 day trip to the area.\n\nWe spent most fo the day here; there was plenty to see and do. Try to catch one of the Ranger-led walks. Whenever we take one we always learn amazing things.\n\nBring a picnic; there are no food services other than a couple of vending machines. Enjoy your lunch on a comfortable bench with unbeatable views.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Lots to Do", "History, nature and great views can all be found at Cabrillo National Monument. If you are there at low tide it is well worth it to drive down the west side of the point to the tide pools. The entrance is located just past the fee shack. We spent over an hour looking at the variety of sea life in the pools. There are also well maintained hiking trails that go west along the point.\nThis is also a great spot for history buffs, You can spend time in a light house used during the late 1800's, visit gun batteries from WWII, or learn about Juan Cabrillo, the Spanish navigator who \"discovered\" San Diego Bay.\nThen there are the views! You can see the entire bay and surrounding areas all the way to Mexico.\nBe advised that this area is part of the National Park system so there is a $15 per car fee. They have made some excellent improvements to the area so I feel that it is worth the fee.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "On a clear day you can see way done the coast of Mexico", "A very nice place to visit and won't break your bank account too. I highly recommend it. A specially if its cristal clear day out. There's a museum there and its very good for the whole family. You can walk around on numous trails."], ["Reviewed 2 weeks ago", 5.0, "Pleasureful", "We stayed in San Diego for 3 days and we did so much that I cannot exhibit everything on here. If you are in Southern California theb stay longer in San Diego. There is just so much to do. This minument was golden. Beatiful and very clean. It make park goers visit way more enjoyable when the atmosphere is clean!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "AMAZING VIEWS!", "Go here for the views! Beyond seeing the harbor and navy yard, you can see migrating whales and dolphins out at sea. If you have one of the National Parks Discovery Passes you can get in for free - otherwise it's $15 but good for a week. Make the most of it and plan some walks around the trails and a visit to the lighthouse and visitors center.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Excellent views- Must see!", "Great location, awesome views, a little bit of history as well. Part of the National Park system. Be sure to stop at the military cemetery on the way out, very peaceful."], ["Reviewed 2 weeks ago", 4.0, "Great views", "The monument is a short drive from the downtown area. It offers some outstanding views and a short hike to a lighthouse as well.\n\nStaff is well-versed on the monument there's a small Museum and a short movie about the monument.\n\nA nice place to visit on days with great weather.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Great Views of San Diego", "After driving through Point Loma Naval base, and the military cemetery, you get to this park. There are great views on both sides of the point over downtown San Diego, Halsey Field, and the ocean.\n\nGreat place for ship spotting and plane spotting. Displays for the founding of San Diego, the light house, WWII history and more. Lots of hiking trails.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A visit to the Cabrillo NM", "What fantastic views of the ocean, bay and San Diego from CBM. The drive up and back is an embellishment to the trip. Great views everywhere.\nParking is easy as is entrance to the viewing areas, museum, and overview movie. Besides the great views at the top, it is also good to drive down to the tidal pools. There is an interesting hike at the sea level area.\nThis visit is a must do when in the San Diego area.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Gorgeous", "The area is amazing! There are tide pools that take your breath away and the views are outstanding. You can see the city of San Diego and Mexico and the coast line is Sweet!"], ["Reviewed 2 weeks ago", 5.0, "Beautiful lighthouse!", "If you want to see some amazing views of San Diego and the ocean, definitely make the trek out to the monument. I was pleasantly surprised to see the military cemetery near the monument entrance. What a gorgeous setting!"], ["Reviewed 2 weeks ago", 5.0, "Tide pools, awesome rock formations and a view just a few great things about this place", "Wow. Natural beauty. An escape from the crowds and cars. This place has an awesome walking trail along the cliffs with tide pools and much more. A fantastic view and museum at the top and more trails we did not have time to hike."], ["Reviewed 2 weeks ago", 5.0, "This is very historic and has very detailed historical videos and exhibits", "A beautiful setting and historical story. The drive up is spectacular and the memorial cemetary is very sobering. The tidepools offer nature at its finest. A beautiful place to visit and stroll the pathways."], ["Reviewed 3 weeks ago", 5.0, "Great visit and hike", "Visited on a cool afternoon. We hiked over to the tide pools, but due to rough surf it was hard to really get down into them even at low tide. It was a really cool place to hike and see. Not as gorgeous as Point Lobos or Point Reyes imo, but, still really cool.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Don't miss a trip up to Cabrillo!", "The drive up to Cabrillo National Monument goes past Fort Rosecrans Cemetery and the road to the tide pools. The view from Cabrillo is unlike any other in the San Diego area. You can watch from a bird's eye view, the Navy ships, cargo ships, and others, move in and out of the harbor. We make the trip up to the Monument every time we visit San Diego!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Catch a whale!", "We were lucky enough to see a number of grey whales heading south while at the light house and surrounding beach locations. There is a good visitors center and the lighthouse is well preserved. There are excellent views back towards San Diego from this location as well as views of the nearby islands out to sea. There are plenty of walks for those in search of hiking as well as car access for those who'd rather drive. Great place to visit.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wow!!", "Recommended for breathtaking views of the Pacific Ocean. Also check out the tidal pools even if there is a high tide."], ["Reviewed 3 weeks ago", 5.0, "Great history and beautiful views", "There are some great views from Cabrillo National Monument! It's worth a walk up the hill to see the old lighthouse, which is open to the public. Don't miss the drive down by the Coast Guard Base and the tide pools. There are some great coast and ocean views.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Excellent views of San Diego", "Beautiful day and great views of San Diego and into Mexico. The museum offers an interactive history of the area."], ["Reviewed 3 weeks ago", 5.0, "Amazing history, and views!", "This site has always been one of the most beautiful in San Diego. The tip of the peninsula affords visitors a beautiful vantage point of the ocean from three sides, and has a great view of downtown. It's absolutely gorgeous! In the last few years, the site has also been upgraded to include a really nice Visitor Center with a lot of interesting history and information. You can tour the lighthouse, the grounds, and some of the bunkers. We stayed for quite a while and found it fascinating. There is a lot of information on the early settlement days of CA, the lighthouse and also the strategic military significance of the area. I highly recommend this site for visitors and San Diegans alike.\n\nPS. During whale migration season (usually the winter months) you can do some whale-watching from this site!\nPPS. This site also has phenomenal tide pools on the west side. You can park close to that side if you want you walk down. Worth it!\n\nRestrooms: yes\nVisitor center: yes\nAmazing views: yes\nFood: No, but sometimes a food cart\nExhibits and history: yes\nGrounds to walk: yes\nParking: yes, sometimes quite full. I think it was $15/car to park last time we were there. If you have a National Park Service pass it's free.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wonderful scenery!", "One of my favorite national parks in the nation. On a clear day you can see the coastline of Mexico, whales (particular times of year), all of San Diego downtown and surrounding areas. Beautiful, tranquil place with some nice history lessons to learn. Going back again for sure\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Awesome views", "Cabrillo National Monument is historically interesting and the views are phenomenal. The hike is relatively easy and the bay and ocean views are outstanding. Great place to picnic and enjoy the San Diego weather. Also an awesome place to view the San Diego Bay fireworks on the fourth of July.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Interesting history and great views of the ocean and San Diego Bay.", "Cabrillo National Monument includes the Old Point Loma Lighthouse. It also has a statue of Cabrillo, the first Spanish explorer to set foot here. Displays of artifacts and placards of information give details of the life and times of Cabrillo. The Lighthouse is also well worth a visit, even though you can no longer climb to the top.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must see in San Diego", "What a beautiful place! Take the time to go and see it. Trails are pretty, good history and if you go during the week, a good place to get away from the crowd."], ["Reviewed 4 weeks ago", 5.0, "Closed - Thanks Washington!!!", "We went to Cabrillo Monument last Sunday i=only to find it closed by our wonderful boys & girls in Washington. Took the chance and went back this week. Glad we did. It is beautiful. I had forgotten how nice of an afternoon t can be out there. A bit of a line to get in. I guess a non-football Sunday got everyone out of the house. Breathtaking views along the coast form the very top to the low tide shore. This should be a must-see for everyone coming to San Diego. $15 for a car is well worth the price. Way too far of a walk in to save the price and walkers still get charged $7.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "One Place Not to Miss", "After you park walk out to the statue of Cabrillo and take in the view! Spend some time indoors then walk to the Light House. There is also an easy hike, well worth the effort."], ["Reviewed 4 weeks ago", 5.0, "Beautiful place", "It is so peaceful here. My sister and I found this by accident while just driving along the coast. The beach is nearby and there are benches to sit on. The day we visited it was nearly empty. Just perfect."], ["Reviewed 4 weeks ago", 2.0, "Not worth the money", "Unless you are really into lighthouses, the Cabrillo Monument is not worth the money you are charged to get in, especially since they just raised the rate. Yes, the view is great but you can get the same view at a dozen other places. There are too many other wonderful things to do and see in San Diego.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great View of The San Diego Bay and Some History Too", "This was not the first time we had driven out to the Carrillo National Monument, but it was as enjoyable this time as it had been every time before. Why? Because it is here that you have the best view of the San Diego Bay, the downtown, Coronado Island and the naval facilities. Plus it is also a place to gain a bit of understanding about the history of the area and the Spanish exploration of Carrillo and others. The Visitor Center has an display that offers an excellent review of the history of Southern California including the indigenous peoples. Unfortunately many seem to not be willing to devote the time to these displays and instead opt for the gift shop. The hiking paths are good but not for anyone who has problems walking inclines.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Worth the Drive- Give yourself a couple of hours", "Was sitting on Coranado beach and wondering, \"what's that up there?\" Looked it up on the map, and made the drive. Make sure you check the hours, they close at 5, and some of the trails close earlier. Decent little exhibits. Beautiful views all around. Wish I would have had more time to walk the lower trails near the coast.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Military Appreciation and History as well as spectacular views", "Before you even reach the park either side of the highway is lined with white crosses that make you realize what we have lost to get what we have today. Once in the park on the right are the tide pools which invoked a bit of walking and climbing so take comfortable shoes. On the other side you can visit the lighthouse, an inside bunker which shows pictures of hidden artillery from WWII as well as an s hope. There is also a re-enactment inside the hall. There are only snack machines for drink and food so if you plan on staying long you may want to bring snacks and water because they also have trails to walk as well. Makes for a beautiful view of the city and shore\nShow less"], ["Reviewed January 24, 2018", 4.0, "A nice self-guided walking tour!", "You can easily spent a few hours walking about the cliffs and through the historic lighthouse keepers home, displays and park center. A nice view of the city from up high!"], ["Reviewed January 23, 2018", 5.0, "Really interesting, beautiful views", "Really interesting place with beautiful views of San Diego. Had never heard of this place before and was glad I went. The tide pools are very cool but if you take Uber have a plan for getting back up the hill..no cell service so pre order Uber. The cemetery is also very impressive as is the light house.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Beautiful views, interesting museum", "The lighthouse has several beautiful Fresnel lenses on display. It is set on a high cliff and the winds are chilly--bring a jacket! But a very nice stop."], ["Reviewed January 23, 2018", 5.0, "What A View", "We spent a few hours scouring the hills of the monument site. There were educational displays explaining the significance of the lighthouse which is a main attraction. There are also breathtaking views of the harbor / ocean and surrounding landmarks."], ["Reviewed January 22, 2018", 4.0, "Driving thru San Diego", "I had a car full of teenagers. I enjoyed looking around. It was 10 dollars to get in. You can drive to the different stops along the way. It’s very pretty. It was a nice day."], ["Reviewed January 22, 2018", 1.0, "Government shutdown :(", "On vacation with our 9 and 11 your old daughters. We enjoy doing natural attractions as much as the big amusement parks. I packed a picnic lunch and my daughter's 4th grade pass and Cabrillo National Monument. Only to get there and find out it was closed because of the government shutdown. Sad. They could afford to pay a ranger to sit at the entrance station and keep us from going in however. Not the parks fault. But still sad.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Gotta love this place!", "In the old days, you could see abalone here at low tide- there are tide pools and this is one place things in the pools are protected! But overall the view from the visitors center and every hill are amazing on a clear day and not bad even when it isn't clear. It can be chilly so take a hoodie and prepare to do some walking, if so inclined!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Skyline of San Diego", "I always enjoy the view from here. You can see so much of the skyline of San Diego. And to honor our veterans that gave all when you drive through Rosecrans cemetary."], ["Reviewed January 22, 2018", 4.0, "Nice quiet place to go", "This is a quieter place to take in, but it has beautiful views and the drive here is spectacular! The old Point Loma Lighthouse is a memorial with historical information and a great view. Plus, it's close to the tide pools and be sure to stop first at the Visitor Center to pick up a Junior Ranger activity if you have kids with you.\nThe drive past the Fort Rosecrans National Cemetery is awe inspiring and give you a feeling of tranquility and sadness at the same time. Well worth the trip!\nShow less"], ["Reviewed January 22, 2018", 5.0, "A coastal \"must see\"", "One of the best coastal views in California..this light house is a must see. You have a panorama of San Diego Bay, the Pacific and Coronado island. In Jan or Feb..you can see grey whales as they migrate to their Baja peninsula birthing grounds. You will need to be a strong biker or take vehicle transport as tere is a climb to and then up the entrance road. Small inclines within the park itself are walkable to the lighthouse and views. There are other moderate walking paths and a well equipped visitor center.. Of course, it will be closed until the Government shut down is resolved!!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Nice view of the Pacific ocean", "Easy to walk and interesting photo spots overlooking Pacific Ocean and San Diego Bay. Easy to park (cost a few dollars) and restaurant and restroom in short distance. Also visit the museum (light house)."], ["Reviewed January 21, 2018", 5.0, "Beautiful Cabrillo", "One of San Diego's top attractions. Sits atop a cliff on Point Loma over looking the bay where ships enter the port of San Diego. Monument to Cabrillo, historical museum and a very nice gift shop. Also adjoins Rosencrans Veterans Cemetery."], ["Reviewed January 21, 2018", 4.0, "Lighthouse and a stiff walk", "We went on a holiday and sadly couldn’t see the tide pools as the lot was full. You can still see the visitors center and lighthouse. We did the 1.86 mile walk. It is a steep up and back trail but was fun and had nice views.\nShow less"], ["Reviewed January 19, 2018", 4.0, "Nice park with great views", "As stated in the title, nice park with great views. There is a parking fee which was waived the day that we were there. Worth a visit."], ["Reviewed January 18, 2018", 4.0, "Nice to see...", "We happened to come on the holiday when the entrance fees were waived. That was a super bonus.... This monument has some interesting history around it and is a good way to spend a bit of time. We ended up walking the tidepools, which was a fun little walk, although we were not there at the right time to actually see the tidepools... In any case, we had a good time watching the nearby surfers and just enjoying the scenery.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Beautiful scenery", "Plenty of parking and much more to see! Bring you're walking shoes and camera. A short walk from the lighthouse and more historical sites. You can also opt for a very informative guided tour! Which I would recommend, unless you have small children because they might get bored and want to keep moving lol\nShow less"], ["Reviewed January 17, 2018", 5.0, "Amazing Views!", "The drive up to this monument is fascinating as you go past a huge military cemetery. There are several different walking paths with view of San Diego and Coronado. You can walk as much as you like or just a little if that is all you feel like doing. Very neat place!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Awesome scenery", "Worth the drive from downtown, some awesome unspoiled coastal scenery and great vista of San Diego from the point."], ["Reviewed January 15, 2018", 5.0, "Cabrillo Monument, Point Loma lighthouse, Visitors Center, Coast Defense Exh, Military Reserve, Ecological Conservation", "There is a lot to see here, and its especially if your into lighthouses. It can be windy so wearing layers is helpful, use sunscreen if you go hiking. You pay $15 to get in and then drive past military cemeteries on your way in. You get panoramic views looking out over Coronado and the San Diego bay (go on a clear day), there are displays to see and read at the Visitor's Center, Lighthouse, Coast Defense, Assistant Keeper's Quarters, and Statue of Cabrillo. You get to walk through the old point loma light house and assistant keeper's quarters and see how they lived back then and see the light used. There is information on the native americans the Spaniards met when they were there. There is a two mile Bayside trail to hike. Right around the entrance there is a road taking you to the tide pools but you can't see any sea life unless it is low tide.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Historic Lighthouse, Views, Museums", "Historic Lighthouse & Museum; visitor center with museum; statue of Cabrillo; great views of San Diego Bay and the ocean; hiking trail to tidal pools if water is not rough (at which time the tidal pools access is closed); lots of walking so wear comfortable shoes.\n\nAwesome site!\nShow less"], ["Reviewed January 14, 2018", 5.0, "Beautiful", "We got here late in the afternoon which was disappointing. There is a lot to do and see and we couldn’t do it all. Wish we had gotten there early in the day to enjoy everything. Highly recommend going, but be ready to walk a lot on hills.\nShow less"], ["Reviewed January 13, 2018", 3.0, "Good hike", "Good hike. Beautiful scenes. Watch the drop off. Little worrisome if you got children on the hoof. If you put them in the stroller it is relaxing and wonderful. Highly recommended. Bring water and some sun screen."], ["Reviewed January 13, 2018", 4.0, "nice afternoon", "We went here one afternoon. NIce view of the bay. The light house is interesting. we walked along the sea as well. Kind of a long drive through a lot of surburbia to get there."], ["Reviewed January 13, 2018", 5.0, "One of the nost beautiful views in all of San Diego!", "The title is not easily sais as San Diego is filled with beautiful views, that being said, this might top them all! You feel like you're in a helicopter tour here, with the height and clear views in every direction, you really get a birds eye perspective of Coronado, San Diego Bay and the Pacific Ocean. If ypu go during whale migrations, you can see plenty from here!\nShow less"], ["Reviewed January 12, 2018", 5.0, "Beautiful bay views and Oceanside trails", "Wonderful outdoor gem with amazing views of the city and bay. Nice walking trails (be ready for some steady uphill climbs). Nice little visitor center. Also, can drive down to the ocean side area. Great trail down to the surf side. There are tide pools to see if the tides are right (unfortunately we're we're there at high tide). A great way to spend a few hours outdoors.\n.\nShow less"], ["Reviewed January 11, 2018", 5.0, "From great views to tide pools", "A long peninsula protects San Diego harbor and this monument is located at Point Loma at the very end of the peninsula. You enter at a high point, where the peninsula rises more than 200 above sea level. To the east is the visitor’s center where there’s a small museum, a film, a gift shop, and the actual monument to Juan Rodriguez Cabrillo (more on him in a minute), as well as an amazing view across the naval air station and San Diego Bay to downtown San Diego. On the late afternoon we were here, there were a lot sailboats headed back into the bay at the end of the day. You can walk up another 20 feet in elevation to the Old Point Loma Lighthouse, which is open for exploring. This lighthouse served the area from 1854 to 1891, when they moved the light to a lower spot at the end of the point, where it can been seen better by ships. There’s also an assistant keepers quarters, which now displays lighthouse artifacts. You can walk over to the west where there’s interpretive signs about the kelp forest off the coast and the whales and wildlife which are frequently seen passing by. You can take another road down by the water where you can park and explore tidepools in the Rocky Intertidal Zone of the ocean side of the peninsula. We got here late in the day and didn’t have much time before they herded us out, but this was a fun place to explore and look for critters. I liked the place a lot, but wasn’t thrilled about honoring Cabrillo, an early Spanish explorer and conqueror. He was exploring north from what would become Mexico about 50 years after Christopher Columbus, and he also commanded three ships. He was the first European to set foot on the west coast of North America, but he also brought enslavement, death, and misery to the native Kumeyaay Indians who were here.\nShow less"], ["Reviewed January 9, 2018", 5.0, "go here first", "If you have just one day and a car when you're in San Diego, this is the place to go. It's a gentle walk from the parking lot to the monument, the visitors center, and lighthouse. Or you can make more of a hike of it on additional trails. You will get a good sense of the geography and history of the area. The views are excellent.\n\nGo to the tidal pools during low tide; wear clothes that can get wet. We happened to be there during a full moon that was a super moon, so the low tide was unusually low, perfect for seeing the tidal pools. We got there early, but parking near the tidal pools was tight, and by the time we left, there was a long line even to enter the park. So pay attention to which day is the full moon.\n\nBe prepared for a lot of sun and also wind. If you plan to make even half a day of it, bring water and snacks.\n\nIf you have a national parks pass bring it, so you don't have to pay for parking.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Breathtaking View!", "My husband's aunt and uncle took us on a road trip up to the monument on our first day exploring San Diego. This was a great place to start! The drive up there from Point Loma was gorgeous, and the view from the monument was beautiful. The monument itself was just right for the location. San Diego in all is a beautiful sight, but to see it from this point was fantastic!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Never Tire of The Experience", "I have visited this lighthouse since a child. The history is fascinating and it is near Rosecrans National Cemetery which is awe inspiring. Make sure to check opening and closing hours as they are somewhat limited. Definitely worth seeing as a good representation of San Diego.\nShow less"], ["Reviewed January 7, 2018", 4.0, "A must see", "Beautiful views from here. Very interesting history of the lighthouse. Nice restroom, gift shop and auditorium. It costs $15 per car to enter. Pass is good for 7 days. Be sure to also visit the one of the military cemeteries. They are similar to the ones at Arlington National Cemetery.\nShow less"], ["Reviewed January 7, 2018", 4.0, "History With An Amazing View...", "Visit this expansive park and enjoy a history lesson and nature expedition at the same time. Learn about Juan Rodriguez Cabrillo's historic 16th-century landing, tour the Old Point Loma lighthouse and keeper's quarters, see sweeping harbor views along Bayside Trail."], ["Reviewed January 7, 2018", 4.0, "A must visit", "Breath taking view to San Diego and to Pacific. You can also learn a lot about this area and even visit inside the old lighthouse. Lot of visitors during holidays."], ["Reviewed January 6, 2018", 5.0, "Overlooking San Diego", "The area is worth the visit. If you have the National Park annual pass, it is free to get in. They have look out area where you can see San Diego. They also have mini museums for those who like to learn how San Diego was discovered and how the area was used during the war.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Nice place to visit to learn history", "Learn a little history at his monument. I highly recommend visiting the lighthouse up on the hill, to miss the lighthouse is to really miss the entire experience."], ["Reviewed January 5, 2018", 5.0, "Always a Treat", "Carrillo National Monument has been a go-to place for me and my family for years-no matater the weather or even if it is ope, we love the drive and the views."], ["Reviewed January 4, 2018", 5.0, "Beautiful view of the bay that you cannot get anywhere else", "We were trying to find the sea cave here, which is closed off right now. But we enjoyed the beautiful views this place had to offer! Best view of the Bay that you cannot get anywhere else!"], ["Reviewed January 3, 2018", 5.0, "I'M IN LOVEEEEEEEEEEEEEEE", "Wow, this place is amazing!!! If you love to explore new areas in San Diego, this is the place for you! This park is spectacular! The 360 views are amazing! You can hike in the mountains on one side and explore the ocean views and wade pool on the opposite side. There is a $10 fee which is good for 7 days if you drive in. If you walk or bike in, it's a $5 fee. The fees are to help preserve the park. You can also take the Metro bus in. Not sure of the cost and times the bus arrives and departs but I did see it frequent while on my visit. I chose to purchase a annual membership since I live in San Diego. The fee is $20 and an investment I am proud of. I can come with my guest in my car or in their car. As long as I show my card, I am good to go! I enjoy starting at the wade pools on the west end of the park and working my way up and over to the east end. The lighthouse is one of my favorite stops as it just shows a glimpse into a time from long ago. You can explore the lighthouse as long as you like. It is a tight fit and when it is busy, you do have to wait your turn. The staircase leading to the lighthouse is a tight fit and can be uncomfortable if you aren't used to a spiral staircase from the 1800's. Anyway, there is a well-kept men and women bathroom with several stalls. The roads are paved and there are museum-like exhibits housed along your walk throughout the park. The park does close at 4pm. So I would advise you get an early start. Also, bring a lunch, as they do allow food and drinks. There are vending machines by the visitor center and great volunteers all around the park to help guide you as you explore. This is a MUST SEE!!! Happy hiking!!!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Fantastic views & ancient tidepools", "This park has something for everyone -- the historian, the marine biologist, the beach bum, the hiker, and the person who's just content to sit & absorb the stunning views. The Lighthouse has a small museum (or a couple of small museums -- including a WW 2 shack), and a meandering trail that with spectacular views. Bring a jacket -- it will be windy! Hike or drive down the hill towards the ocean & check out the tidepools. Make sure to go at low tide so you can climb all over them & check out the marine life you'll find. Bring a lot of snacks & drinks with you, though, as you are in an isolated park without a restaurant or snack bar (there may be a few vending machines at the museum) & it will take you 20-30 min to get to any restaurants from the park.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Easy family hike with great views!", "My family hiked the Bayside Trail - approximately 2 miles Long with some incline on the return. Beautiful views of the city and bay, with some military history mixed in as well."], ["Reviewed January 2, 2018", 5.0, "Views to last a lifetime", "Tide pools , history, a light house, and views to stop you in your tracks . Informative visitors Center . Time right and there be whales as well."], ["Reviewed January 2, 2018", 5.0, "Beautiful view", "This place has beautiful view of the entire bay area. a bit of a climb from the parking lot but it is worth it."], ["Reviewed January 2, 2018", 5.0, "This Should Be on Your Must Do List While In San Diego!", "We came to Cabrillo upon recommendation from a friend and we were not disappointed. We came at sunset---wish we'd made it here a little easier-i'll explain why later. There was a $10/car charge. The best parts of this visit are: #1 the coastal tidal pools and the view of San Diego from the monument.\n\nWhen planning a trip here, be sure to leave enough time at low tide to take advantage of the ability to go down to the tidal pools and explore. At low tide, the park has rangers stationed in the tidal pools to help visitors find some of the hidden animals in the pools. They offer laminate cards for children (and children at heart) to know what to look for. This is not stroller or wheelchair friendly. Be sure to wear sturdy shoes and don't be afraid to get a bit wet...you are at the edge of the ocean.\n\nAfter you leave the tidal pools, continue on to the Juan Rodriguez Cabrillo monument. There is a nice visitor center to explore with a small selection of souvenirs, but it's the views you'll come here for. The views of San Diego at sunset were some of the best we saw during our trip.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Great Sunset", "If you wanna to watch a great sunset, this is it!! There are also beaches and Loma Point to check out all within walking distance."], ["Reviewed December 31, 2017", 5.0, "A National Treasure", "I recently visited this national park for the second time. What a great place to visit. The entrance fee was minimal and the park long on interesting sights and views. With a nearly 360 degree view of the Pacific Ocean, the view does not disappoint. The lighthouse also adds a lot of draw to the site. There’s also a display on fresnel lenses which is interesting to see them up close. Walking the rest of the property you will find views of the tide pools far below and the Channel Islands to the west. One note is that if you’re traveling with handicapped persons then you can drive up to the lighthouse above the gift shop and displays near the main lot.\nShow less"], ["Reviewed December 30, 2017", 4.0, "California dreaming", "Wonderful views of San Diego and surrounding area. That’s it. Nothing else. If you are not into great views, skip this baby."], ["Reviewed December 30, 2017", 5.0, "Beautiful views", "We have been to San Diego several times and had never visited the park.....which was well worth the visit. Bring your National Park card."], ["Reviewed December 30, 2017", 5.0, "Amazing Views!", "Well worth the drive through local neighborhoods and the Navy Base. You get some amazing views of the San Diego Airport, Naval Air Station, the Bay, and the Ocean. We also got to see some large Navy ships heading out to Sea. There is also a history center, bathrooms, and drink and snack machines. You can take a short, somewhat steep hike up to the Lighthouse as well.\nShow less"], ["Reviewed December 30, 2017", 5.0, "National Park Visit", "Fantastic views from up on the point. Highly recommended tide pools... didn't have chance to check on based on time we visited. Great place to watch sunset."], ["Reviewed December 30, 2017", 5.0, "What a view", "Straight out Catalina Blvd, past Fort Rosecrans National Cemetery is a light house, museum, gift shop, walking paths, the Carrillo National Monument and tremendous views all around. There is a shall fee I think per car, to enter the area, but what a view"], ["Reviewed December 29, 2017", 3.0, "Great views", "Excellent views of San Diego & Coronado. It has a very good historical vistors center and tide pools."], ["Reviewed December 29, 2017", 5.0, "Fun day... came for the tide pools and left with great memories", "I’ll be honest... I didn’t do my research... so much to see and hike around here with great views. Low tide wasn’t low enough when we were there... check for a negative tide when visiting the pools but still saw a lot... considering we are from Kansas we are impressed easily!\nShow less"], ["Reviewed December 29, 2017", 5.0, "Cabrillo Monument", "Best view of all of San Diego. You can see the ocean on one side & the Bay on the other side. You can even see all the way to Mexico on a clear day."], ["Reviewed December 29, 2017", 5.0, "Beautiful scenery and interesting history", "We did three things at Cabrillo National Monument ... hiked the paths along the rugged coastline, explored some tide pools (where we saw a small starfish, urchins, seaweed), and toured the visitor's center and monument itself. All were enjoyable. We spent about three hours under an overcast sky. There are excellent views of the bay, with lots of military vessels plying the waters and aircraft in the sky. Photo enthusiasts, make sure you bring all your lenses ... you will use them!\nShow less"], ["Reviewed December 29, 2017", 4.0, "Great place to visit", "This is a really fun place to visit and bring children. They have tide pools that you can look at an explore. There is also a lighthouse that you can walk-in. There is a parking fee to get into the lot."], ["Reviewed December 28, 2017", 4.0, "Great place for hiking and photography", "Beautiful place to see the amazing view of San Diego harbor on the east side; stunning view of the Pacific Ocean on the west side; the rock formation of the coast line is very unique; and a great opportunity for photography."], ["Reviewed December 27, 2017", 4.0, "Cabrillo National", "Beautiful place to watch the sunset. The old lighthouse was interesting. Great photo opportunities. A must."], ["Reviewed December 26, 2017", 5.0, "Exquisite Views of San Diego--A must see every visit!", "Not only do you get to view a lighthouse, but you also have several spots to view the Pacific, whales, bay, Coronado Island, North Island N.A.S., cityscape, etc. You can watch all kinds of planes coming from the Naval Air Station and the airport as well as cargo and Navy ships. We go every time. It does cost $7-10 to enter per carload. We have a National Park Pass, so it was free. If anyone in your car is 62 years old or older, they can purchase a lifetime pass for $10 that includes everyone in your party. We have used it for many other parks, so it's worth your while to purchase one!!!!!\nShow less"], ["Reviewed December 26, 2017", 4.0, "Worth the trip", "Great views of ocean and nice bit of California history . Light House is so so compared to others I've been to."], ["Reviewed December 26, 2017", 4.0, "A Little Bit of History on Point Loma", "Someone suggested before we headed to San Diego that we see Point Loma. On our last day in the area, with a rental car and hours before flying back home, we decided to explore. It was an easy drive from downtown. We drove to the monument area first. We paid a $10 per auto fee. We took lots of pictures of the monument, lighthouse and views across the ocean toward the city and Coronado to the east as well as to the west. There is some walking involved, some uphill. There is a visitors' center with exhibits, films, restrooms, etc.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Marvelous View!", "If you are in San Diego on a clear day you can't beat the view from out there. Bring binoculars and or spotting scope. Whales too!"], ["Reviewed December 25, 2017", 5.0, "Beautiful Walk", "This is a beautiful location for a walk, photos, and just enjoying the ocean. This is a well reviewed location so here's some logistical items to help plan your visit:\n\n1. The drive to the monument is easy but, as of the date of this review, there was some road construction just outside the park that involved some lane closures. Drive slowly and carefully. Much of the route will take you through residential areas so please be considerate.\n\n2. If you visit during the winter months, bring a jacket. It'll be bright and sunny and windy. During our visit, I don't think it got above 65 or so. but it was really breezy making it somewhat chilly.\n\n3. Bring a camera. There is a lot to see here and the views are spectacular.\n\n4. Drinks and snacks. They have (overpriced) drinks and snacks at the visitors center. Bring your own. Water, in particular, if you plan on hiking around.\n\nDefinitely make this part of your trip while you're in San Diego.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Beautiful views", "Easy to get to, nice drive (beautiful cemetery to drive by), easy parking, amazing views, lighthouse was great, educational."], ["Reviewed December 21, 2017", 5.0, "Great views of the whole city and bay", "A must see spot to take any visitors when they are in San Diego. Educational exhibits, great views, great 2 mile walk that takes you close to the bay entrance."], ["Reviewed December 21, 2017", 5.0, "Top of the list if you can make it", "This is one of my favorite places now. The absolute best view of San Diego. Make sure you get to go during low tide for the Tide pools. I got to see hermit crabs, starfish, sea anemones, and other little sea creatures."], ["Reviewed December 21, 2017", 5.0, "Great view", "Nice view from there. you can see for miles. Nice walking park with a mix of good activities. The light house was cool to see."], ["Reviewed December 21, 2017", 5.0, "Grandsons were amazed at the park", "Took my two grandsons to the park the day after Thanksgiving. (7 and 5 years old). After viewing the area where the monument is located and touring the paths by the old light house, we went down the hill to the tide pools. The kids had so much fun running up and down the hills.\nShow less"], ["Reviewed December 20, 2017", 5.0, "A must do!!", "This is must do just $10 to get into this park but it’s has so many breath taking views. The lighthouse is great you actually get to walk through it and get a feel for light house life. There also some educational insight all around. Great for all ages a must do.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Great!", "This great park has an awesome mix of activities including a small museums, a large gift shop, tidepools, a historic lighthouse, whale watching, WWII gun batteries, and hiking trails. Even if you don't want to participate in any activities indoors or out, you can bring a picnic (only vending machines on site) and enjoy the sweeping views of the bay, Shelter Island, Pt. Loma, North Island, and the downtown skyline. Although there's ample parking in the main lot, getting in can be slow, especially on weekends, as there's only one entry lane. Another tip is to bring a sweater as winds create cooler temperatures here.\nShow less"], ["Reviewed December 20, 2017", 4.0, "Top of the world", "Well top of the San Diego area, with sweeping views over the whole bay, if you have a car and some spare time on your hands then worth an look but note: There is a $10 entrance fee."], ["Reviewed December 17, 2017", 3.0, "Quick visit", "We made a quick stop here. Nice little, it is little, Nation Monument. It really consists of a monument to Juan Carrillo (the first European on the American west coast) and the light house. You can easily see everything in an hour or so."], ["Reviewed December 15, 2017", 4.0, "The view is extraordinary.", "A very informative museum, and an interesting lighthouse exhibit. A little history, with a spectacular vista."], ["Reviewed December 13, 2017", 5.0, "A refreshing, beautiful place with amazing views!", "We spent about three hours visiting the park, starting with the visitor center views which were spectacular on the sunny, Sunday afternoon we were there. Walked up to the light house and enjoyed the newer walkway with north western views. We browsed the museums but mostly enjoyed the trails around the point and lighthouse.\nShow less"], ["Reviewed December 12, 2017", 4.0, "Great views of the ciry", "Great place to view the city and the surrounding area. Fun to learn the history of San Diego and this island. Worth the entrance fee for sure"], ["Reviewed December 12, 2017", 4.0, "Beautiful View", "Walked up to the lighthouse, the Juan Rodriguez Cabrillo statue (he landed in this area in 1542). He was the first European to set foot on the west coast of the US. Great view of San Diego Bay and the city especially in late afternoon."], ["Reviewed December 9, 2017", 5.0, "The place you have to visit", "This place is really beautiful. On top of Point Loma you can see the town of San Diego, Coronado from one side, and amazing sunset in the other side!!! Lot of parking lots will allow you to relax and walk around the park"], ["Reviewed December 7, 2017", 5.0, "Rediscovering the Cabrillo Monument", "Our family visited this monument years ago, and recently, when we realize that it's the closest place to get our National Park pass, we went again, and again! There are added view points by the cliffs, shaded, and the breeze and view are just worth sitting there and forgetting that time passes......\nWe also revisited the tide pool area which we have forgotten that the view driving down is just the most gorgeous, right up there with the drive down from Torrey Pines plateau to the State beach....\nWe will be visiting it again very soon....\nShow less"], ["Reviewed December 6, 2017", 5.0, "Beautiful Ocean Views at Kelp Forest and Whale Overlook", "Stunning views of the vast ocean and beautiful surrounding hills at the Kelp Forest and Whale Overlook which is in the park. We went at sunset and it was the highlight of my San Diego trip! You can also go inside the lighthouse which is fun.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Magnificent views!", "My husband and I came here based on a recommendation from a local. We are glad we did! It’s breathtaking! A must visit. It’s on a naval base, but it’s open to the public. There is a $10 fee for entrance."], ["Reviewed December 6, 2017", 4.0, "View from the Top", "You get a great view from the top at Cabrillo National Monument. We had a great time walking around and looking over at San Diego and Cornado Island."], ["Reviewed December 4, 2017", 5.0, "Amazing views and lots of history", "The Cabrillo National Monument should be visited whenever you are in San Diego... this is a very historic spot, with excellent interpretive exhibits and a marvelous view of the city, bay, and Pacific Ocean high atop Point Loma :)). The information presented includes the first Native American inhabitants too... Be sure to also check out the lighthouse (in addition to the main visitor center)... the paved pathways are easy to negotiate by most folks, including young children. Enjoy!\nShow less"], ["Reviewed December 4, 2017", 5.0, "Awesome Vista of City and Ocean", "Point Loma and the Cabrillo Monument are not to be missed. Such an amazing view of the city and also rugged coastline. There is a National Park entrance fee."], ["Reviewed December 3, 2017", 5.0, "Great tucked away spots", "My favorite was the tide pools even though I went on a high tide day and the pools were mostly covered up. I went further down past the first tide pool parking lot and you can do a little hike down to the water where there really weren’t people and with great views\n\nIt’s my new favorite special place\nShow less"], ["Reviewed December 1, 2017", 4.0, "Just a side trip from our visit in San Diego", "We’ve been to San Diego many times before, so we were looking for something we haven’t been to. A local friend recommended going out to Point Loma and visit the Cabrillo National Monument. It was a pleasant visit. Not super exciting, but interesting enough that made the visit worthwhile. There was a small museum and a nice gift-shop/book store. The view of the bay and San Diego was great. We also enjoyed going down to the tide pools.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Trip to San Diego for a wedding", "This park is beautiful and worth the visit. The view of San Diego is spectacular. Passing the military cemetery as you enter the park is humbling. The shoreline is gorgeous. Glad we visited!"], ["Reviewed November 30, 2017", 5.0, "Beautiful Views", "Love the views, especially when the whales are in site. Lovely little bit of hiking and great staff."], ["Reviewed November 30, 2017", 4.0, "Lovely Views", "There are some very pretty views at this monument, although I'm not sure I'd list it as a \"must see.\" There are some mini-museum-like buildings to see including the old lighthouse, a gift shop, and guided tours available by park staff. I was able to see a sail boat race from one of the overlook areas and there are several signs indicating that you might be able to see whales at certain times of year.\n\nThis monument involves a fair amount of walking involved to get from point to point, which might be challenging for some. I went at the beginning of the school year and encountered a few field trip groups, which may also be a deterrent for some.\n\nI think one of the great perks of this visit was that the admission fee is good for 7 days, so you have the ability to go back if you have some extra time on your trip, maybe to look for whales or something.\nShow less"], ["Reviewed November 25, 2017", 4.0, "A San Diego must see!", "Be sure to find low tide when you visit the tide pools at Cabrillo! It's a windy road down to parking, then a dusty, somewhat steep trail hike to the rocks overlooking the pools. Not handicap accessible and needs a few more hand rails. But our toddlers did ok. Altho some cliffs, nooks and crannies, Grandma worried about the potential dangers.\nThe end of the Point Loma peninsula offers great views all around, from the vast Pacific Ocean to the west and San Diego and Coronado Island to the south and east.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Great view of the City and area", "Go here on the first day of your visit to San Diego to get oriented to the layout of the city. Loved watching the activity at the area's military bases which for us included ships coming and going in and out of the bay."], ["Reviewed November 22, 2017", 5.0, "Awesome view", "If you want to get the best view of San Diego head straight to Cabrillo National Monument. Watching sunset from this point was amazing."], ["Reviewed November 22, 2017", 5.0, "Unexpected gem", "Great place to unwind, see spectacular views, historical, get a little exercise too. A little hilly on the walking but enjoyable. Must do this national park. There is a 10.00 fee but it is good for several days"], ["Reviewed November 22, 2017", 5.0, "Fantastic Views!!", "Enjoyed our visit to Cabrillo.\nSobering drive in past the cemetery\nOnce out of the car and a short walk the views are stunning\nInteresting info about the area and first settlers\nWashrooms and visitor centre on site\nWe didn't go to the tide pools as we ran out of time but the area looked very appealing to explore\nWorth a visit\nShow less"], ["Reviewed November 18, 2017", 5.0, "Excellent and great Birds Eye View of San Diego", "See the tide pools just before the Lighthouse. This was built up high, but then they realized their foolishness. There was fog. It rolled in and no ONE could see the light house up on top of the hill. So they built a new one down lower on the rocks near tide pools. We go all the time Great place for kids especially the tide pools.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Cabrillo National Monument", "Cabrillo National Monument is at the end of Point Loma, a 400 ft bluff that is west of downtown San Diego. The park includes a lighthouse, views of downtown, and San Diego bay. There are some military bunkers that are visible, most are open to the public. The is a hiking trail that goes down to the harbor entrance but not to the water. Also you can drive down to the tide pools on the Pacific. The park closes around 5 pm.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Beautiful View and Historic Lighthouse", "If you go to Cabrillo National Monument do checkout the beautiful lighthouse and spend some time learning about the history. Enjoyed the exhibition space."], ["Reviewed November 15, 2017", 4.0, "A worthwhile excursion", "I had visited Cabrillo National Monument principally to pay my respects at the Military Cemetery but there is so much more to see and enjoy here. The visitor centre is well put together and everything is signposted clearly. You can easily while away a couple of hours here and the views across San Diego Bay and the military aircraft activity make for a very interesting trip.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Beautiful!!", "This is a must do when you’re in San Diego! The views are extraordinary and the history is rich. We had a wonderful time in a large group. Many amazing photo opportunities too."], ["Reviewed November 12, 2017", 5.0, "Beautiful views from Cabrillo National Monument", "Being from San Diego and having lived here for 47 years, one of my favorite places to visit is at Cabrillo National Monument . It's a beautiful place with great views of Downtown San Diego, Coronado island, the coastlines, and on a clear day you can see the islands off the coast.\n\nThere are several viewing and sitting areas throughout the park. They also do offer tours but I myself would rather enjoy the park by myself or with my love one.\n\nThe light house is beautiful and yes there is lots of history behind it. The lighthouse is open to the public but is a little tight.\n\nMy favorite thing to do though is just to walk around and enjoy the scenery. It's great just watching the sailboats and occasionally a tall ship will be sailing by. What others don't know is that there is a second lighthouse below as well as the tide pools. Before leaving the Park I would definitely take the drive down to see the second light house and the tide pools.\n\nWhy is this my one my favorite area of San Diego. Well the answer is basically not only views buts it a great place to sit back and relax and enjoy the sea without the hustle and bustle of the beach crowd.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great views", "The views here are fantastic. I loved the rock formations by the tide pools. Great place for pictures( if not crowded) of course up by the light house you get the amazing city views."], ["Reviewed November 11, 2017", 5.0, "Interesting to visit, amazing views", "We enjoyed the visit, it was interesting and informative. The views from various places around the monument are spectacular. To be added on the list for those visiting San Diego."], ["Reviewed November 11, 2017", 5.0, "Veterans Day", "We visited on Veterans Day, which turned out to be free admission for all visitors. Excellent gift shop and light house walk. Good access for disabled visitors."], ["Reviewed November 9, 2017", 5.0, "What a view!", "Don't miss it, bring a date or your spouse and be captured by spectacular views around every corner. A lighthouse, WW II defenses, and an incredible view of Coronado Island, San Diego Bay, and the Pacific Ocean are each worth the trip out the the Park.\nMembers of the military, be sure to ask about military admission, bring a jacket (the breeze can be chilly) and enjoy the visit.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Pretty scenery and awesome vistas", "Cabrillo National Monument is the location of the Point Loma Lighthouse. There are many walks with points of historic interest. The lighthouse is open for visitors to go into. There is an easy access path from the road to the tidepools, several hiking trails, a visitor center and gift shop and a small theater that shows informational flims. The views across tot he city (on a clear day) is incredible. During whale migration seasons, they can be easily seen from several of the viewing areas.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Wonderful view and interesting memorial", "Drive up to the memorial and take in the fantastic view. The best view in the whole area. The memorial is nice, but it was established for families to memorialize their veteran and you have to pay a pretty good fee to have a plaque made and installed. So I assume that many people are not on it due to the way it works.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Beautiful Panoramas of SD, Ocean- See the Tidepool!", "Of course, this is the best place for views in San Diego. From the old lighthouse, to the bay, to the ocean, it's amazing. Good for kids- they can run around, and show them the lighthouse and the big lenses. Also the whale skeleton is cool, on the south path. One thing not to miss is the tide pools- parking can be a pain, so go early and hit the tide pool first. All sorts of sea creatures there- little crabs, octopi, shellfish. Try to go at low-ish tide and you'll see way more.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Point Loma: A great spot to look over San Diego Bay", "This place has two way attraction. One is the museum part and other is the view. The museum tells about the history of San Diego and the light house, its technology etc. And the view is mesmerizing. Point Loma is located at the tip of San Diego. From west side one can enjoy the open Pacific ocean and from the east, one could see the San Diego Bay, Coronado island, Naval Base. Its a really great view. I love it and go back to the place time to time. One need to pay to enter the place as it is the part of National Monument.\nShow less"], ["Reviewed November 8, 2017", 5.0, "A must see in San Diego", "This is one of the most beautiful spots on earth. Be sure to note the national cemetery that overlooks the bay and go down to the tidepools where you can see fish and octopus and all sorts of sea life. If the light houses open be sure to go in as it is spectacular\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great hike", "If you want a great view of all of San Diego then it should be at the top of your list. We hiked several miles and enjoyed the wind derail views. Very relaxing and just a really neat place."], ["Reviewed November 8, 2017", 5.0, "Great way to entertain out of town guests with fantastic views!", "This place has stunning, panoramic views of the city. Cabrillo monument is one of the most beautiful historic sites in San Diego. There is usually plenty of parking available . The drive up takes you through Rosecrans cemetery, one of the most beautiful cemeteries with views of the ocean and bay. I always love coming here.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Awesome Views of San Diego", "We always bring our guests to the Cabrillo Monument! You can see the downtown San Diego skyline, have a panoramic view of the harbor, gaze at the vastness of the Pacific Ocean, visit the Cabrillo lighthouse & take several short hikes. When you stop at the ranger station, you'll receive a map but it's really easy to explore on your own. There's lots of parking, wheelchair accessibility, & restrooms. If you're needing a meal, Point Loma, Shelter Island, Liberty Station & the sports arena areas are close by with every kind of cuisine from great seafood to Mexican to sushi to vegan.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Amazing views and plenty of walking trails", "We only had two hours to explore Cabrillo. I would definitely recommend giving yourself at least four hours to enjoy all Cabrillo has to offer.\n\nFrom the lighthouse there is a trail that we could not walk because the trailhead closes at four. So my guess is it takes an hour from beginning to end. If you don't have time for this trail there are plenty more in which to choose. If you make your first stop the National Park Center, you can grab a map that will allow you to plan your day.\n\nWe arrived at 3 pm on Saturday and we waited in a line to get in(The park closes promptly at five and there's only one lane in and one lane out). There are tide pools (access closes at 4:30) but the parking is limited so if there is no parking DO NOT park creatively or you will be ticketed. Only park in designated spots.\n\nThe views are incredible. If you have binoculars bring them so you can locate The Midway or Coronado Island or whales or boats and ships. I would pack a lunch or snacks although there are vending machines outside the visitor center. A National Park pass will get you in quicker otherwise there is a $10 fee.\nShow less"], ["Reviewed November 6, 2017", 4.0, "Stunning views", "The historic Cabrillo monument at Point Loma is situated at the strategic tip of land with panoramic stunning views. The naval and marine bases lie just across. The downtown area a little ahead, and after a vast stretch of the Pacific islands and mountains of Mexico. The clear blue sea was dotted with yachts and sailboats when we visited.\nAlso worth visiting are the adjacent lighthouse and the tidal pools. Here, at low tide, you can observe a wide variety of marine life.\nThe entry fee is $10 per car.\nShow less"], ["Reviewed November 6, 2017", 4.0, "Great Park", "Beautiful views of San Diego and area. Loved the film on the whales. Need more parking for the Tidal Pools."], ["Reviewed November 5, 2017", 4.0, "A small but interesting National Monument", "The view from this park is great and their movie on the migration of a Grey Whale was very good. The Park is small with not a whole lot to do, so probably not a good attraction for small kids."], ["Reviewed November 5, 2017", 5.0, "One of San Diego's treasures", "As a San Diego resident, I have been going to Cabrillo national Monument since I was a kid. Always a great place to visit, don't forget to also visit the tide pools, but please be respectful of the wildlife."], ["Reviewed November 4, 2017", 5.0, "Gorgeous Views", "We spent a couple hours here seeing the Cabrillo Monument and Lighthouse but most of all was the breathtaking views from east to west. A lot of walking, but definitely worth it. Great look out points and driving points. You can go to an upper level or a lower level closer to the water. Well worth your time!!\nShow less"], ["Reviewed November 3, 2017", 5.0, "Great Scot, What a View of the San Diego/Coronado Island area!!", "We were staying on Coronado Island and decided to go up to the nearby Cabrillo National Monument. This was well worth the trip up there. The view from the Visitor's Area is breathtaking to say the least.\n\nThe ONLY negative we have was the weather which was scorching hot for the area and that time of the year. It was in the mid-90's there while LA was 103 degrees. That was our fault for going then; we should have readjusted our schedule and chosen to travel there on a different day'\n\nI hope the pics I took help do it some justice; this is truly a beautiful place to go and the sight you see from there is priceless. This is California History that has been preserved for generations to come to enjoy.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Great place to spend a day", "Lots of fun activities for all ages. Great hikes, views and history. Could easily spend a whole day in the area with my kids. Only $10 per vehicle."], ["Reviewed November 2, 2017", 4.0, "Great Views of the Bay", "Took a nice morning hike on the Ocean side. It was so nice to walk around and see the ocean from the cliffs.\nThe Lighthouse was enlightening and I recommend checking it out. We were there for a few hours before our schedule dictated that we leave.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Visit for the views!", "A great place to visit, not for the monument, but for the views of the Pacific Ocean and of San Diego."], ["Reviewed October 30, 2017", 5.0, "Spectacular vista", "Beautiful National Monument! Spend several hours with our large family at this beautiful overlook of San Diego and the harbor. The kids loved climbing up the lighthouse and also the well done visitor center."], ["Reviewed October 30, 2017", 5.0, "Great views", "Really nice drive to the national park at the monument and the views of San Diego, Mexico and the by a as well as the Pacific are fabulous. $10 dollar feee to enter the park (as with all national parks) Don't miss the tide pools on the ocean side!!!\nShow less"], ["Reviewed October 29, 2017", 5.0, "Well worth an hour or two visit.", "The light house, the visitors centre and shop were average. The views over the ocean to the Coronado Islands, then the bay and city made the trip worth while. Stunning is the only word to describe them. This place is easily accessible from the city by going out to the Old Town Transit Centre taking the 28 bus and connecting up with the 84.\nWell worth a visit.\nShow less"], ["Reviewed October 28, 2017", 4.0, "On The Edge of the World", "Cabrillo National Monument is a great place to spend a half-day while in the San Diego area, especially if you are staying on, or near, Coronado Island. Hiking around the cliffs and tide pools, watching one of the several informational films about the history/importance of the area, enjoying the sweeping views of the Pacific and touring the picturesque lighthouse make for a wonderful outing.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Must-do for San Diegans and visitors alike", "I grew up in San Diego, but have lived overseas for several years. On my first trip back to SD this summer, I visited Cabrillo National Monument for the first time since I was probably 5 or 6. I honestly don't even remember the last time I was here, except for a vague image of the lighthouse. This time, I was extremely impressed. The view of San Diego is completely stunning, and the lighthouse and accompanying museum is awesome.\n\nThis is definitely something that all San Diegans should visit at some point. It's the perfect place to take friends or family who are visiting San Diego for the first time.\n\nIt's a short hike up to the lighthouse, so wear walking shoes. Also, be aware that you have to pay to get in!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Terrific views", "Terrific views and some interesting history. Also some nice walking trails around the tidal pools. $10 per car load. Worth the trip."], ["Reviewed October 26, 2017", 5.0, "Little Piece of History", "The National Monument is tucked away on the hill top, and if you get a chance you really should visit. There are stunning views of the bay and San Diego from up there and it's worth paying the $10 per car."], ["Reviewed October 25, 2017", 5.0, "Stunning!", "This place took my breath away! The must see views are beyond amazing! Super views from all points, sculpture, a historic lighthouse with glass so old you can see the ripples in the bevels. Lovely afternoon sun and a great place for whale or dolphin watching! This location is very clean and well maintained.They have a great gift shop with super nice people who are eager to assist or inform. An historic and informative museum style location in beautiful San Diego.. Worth the trip, child and handicapped friendly. A great property with many things to walk around and see.Awesome enough for a future 2nd visit.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Amazing views", "Nice side trip to this National Monument. Views are spectacular from the top of the hill. National veterans cemetary is visible along the drive in and awe inspiring. Educational exhibits and there is a tide pool area that can be visited but make sure you check the local tide charts for low tide times or its not accessible.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Best views of San Diego harbor", "Another must visit in San Diego. The views from Cabrillo National Monument are spectacular. Take the time to walk along the various paths around the lighthouse and visitor center. You can view the Pacific Ocean as well as San Diego Harbor and Coronado Naval Air station. We saw 2 submarines, two guided missile ships, and a supply freighter leaving port. The historic lighthouse is there to explore. The visitor center tells the story of Cabrillo's exploits in the late 1500s. Go early in the day to avoid the traffic and crowds.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Great History", "Great place to learn some of the history of San Diego. Walking tour with outstanding views. Walking shoes would be good but not totally necessary. Free parking. Good visitor center with restrooms."], ["Reviewed October 24, 2017", 4.0, "Lots of history and great views of city", "its really a quick drive from down town San Diego or airport area to the point. gravesites and adjoining park is quite striking and though provoking. if weather is nice it makes for wonderful side trip"], ["Reviewed October 23, 2017", 5.0, "Gorgeous views of both the bay and the Pacific", "Wonderful views across from downtown San Diego, nice historical museum, and pretty walks around the lighthouse. Good to combine with a trip to Liberty Station for art and food."], ["Reviewed October 22, 2017", 5.0, "Worth your $10!", "We enjoyed Cabrillo National Monument Immensely. In our party: mom & dad plus 7 & 8 year old boys. They participated in the Junior Ranger program, which I highly recommend. There's plenty to see and to do. We loved the tide pools, which you can walk down into and catch all kinds of living creatures. (Make sure to go at the right time). You could spend all day here just looking around. The views of San Diego are magnificent. I can't say enough good things about it! Friendly staff, great little gift shop, great sights. Very well done!\nShow less"], ["Reviewed October 22, 2017", 5.0, "One of the \"Must See\" Attractions in San Diego", "This historic national monument provides many things to see and do. Come here when the air is clear and you can see long distances, because only then does the true magic of this place come to life. The vistas are awesome from here. You can learn about the history of San Diego in the displays, gift shop, and free movies that play throughout the day. You can go into the old lighthouse and learn what it was like to live in and maintain a lighthouse. There is also a small lighthouse museum. You can also visit the gun bunkers from WWII that protected San Diego, the largest Navy base on the west coast. And don't forget to visit the tide pools if you catch it at low tide.\n\nDepending upon the time of year, there is good whale watching here as well.\n\nNote however, that there is no restaurant or café here.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Beautiful", "Great views. This place is great to visit and just walk around. Close to the city and you can see forever when the weather is good! A must see when visiting San Diego."], ["Reviewed October 20, 2017", 5.0, "Take time to simply enjoy the breeze, the sun and the view.", "Have been to Cabrillo National Monument a number of times. Always enjoy the vista, the breeze and the view of the harbor. Take time to understand the history of the location and the city of San Diego itself. Certainly drive down the hill and enjoy the tide pools at the edge of the park.\nShow less"], ["Reviewed October 20, 2017", 4.0, "Lovely views", "Cabrillo National monument is a great place to spend an hour having a picnic while taking in the fab views of the harbour, ocean and lighthouse. I would say that at $10 its a bit eat to enter but as we had a national parks pass it was free. When we left after 4pm there was no one in the ticket booth taking money. Clean restmans and a small visitor centre with info.\nShow less"], ["Reviewed October 20, 2017", 4.0, "Nice National Monument with Great Views", "This is an informative national monument site with fantastic views of the ocean front, the bay area and San Diego. It takes about two hours to fully appreciate the site."], ["Reviewed October 18, 2017", 4.0, "First landing in New World", "If your into sightseeing with history an nice areas for taking pictures it's a must see. There is a lighthouse and a information center where you can learn about the first settlers and natives of the area."], ["Reviewed October 17, 2017", 5.0, "Beautiful Spot", "Great drive and great vantage point to see the area. We went early and there were no crowds. It was easy walking and a great learning experience. The history and presentation exceeded my expectations. They also had some great little walking paths. This is a must do!\nShow less"], ["Reviewed October 16, 2017", 5.0, "Fab day great views with history", "If you come to San Diego don’t miss this place. If it is a great sunny day you will enjoy fantastic views and learn about Juan G. Cabrillo and it’s great discovery on 16th century!"], ["Reviewed October 16, 2017", 5.0, "Fantastic views!", "Fun place to take a drive and get a little history with your fantastic view of San Diego. There is a very nice gift shop and I think a snack bar, but I'm not sure about that. It's fun to walk around and see the monument and walk up to see the lighthouse. Very interesting place to visit.\nShow less"], ["Reviewed October 16, 2017", 3.0, "Nice walking", "Nice place to go walk around and see San Diego city airport. on a clear day you can see the mountains. Nice and peaceful there."], ["Reviewed October 16, 2017", 5.0, "Nice national monument", "Loved being able to use my new Sr. Lifetime Pass. Interesting to see lighthouse and master's house. Informative on how the lights work."], ["Reviewed October 15, 2017", 5.0, "This is the spot.", "This is an excellent park with an incredible view of the Pacific ocean and San Diego bay. The exhibit center is very engaging and shows the history of the Spanish conquest of the San Diego area. Walk over to the lighthouse to get a different vantage point then go down to the tide pools and enjoy the scenic beauty of the shoreline. I'm glad I put this on my list of places to see.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Lots to See and Do", "Cabrillo National Monument is a must-see place to visit when in San Diego. Located at the far end of the Point Loma Peninsula, the views are unmatched anywhere in the area. There are plenty of look-out spots to enjoy the panoramic views of the ocean and bay, Mexico in the distance, the entire lay-out of the City of San Diego, Coronado Island, ships and Navy planes taking off and landing from the nearby Naval Base. On very clear days you can even see the San Clemente Islands in the distance. In January and February there is a good chance you will spot a whale or two migrating to Baja California, and many people bring their binoculars along, hoping to catch sight of them.\nAnd if that isn't enough for you, there are gorgeous cliffs and tide pools to explore, with park rangers often on hand to answer your questions. There is an old historic lighthouse you can tour, an information center that has educational films playing round the clock, and a nice gift shop. Once a year there is a festival honoring the the explorer Cabrillo, and the local Portuguese Community comes out in festive historical costume to re-enact Cabrillo's first landing here at Ballast Point. There are hiking trails to be enjoyed on both sides of the peninsula so you can enjoy views of the bay or ocean. The beautiful national cemetery here is reserved for local military veterans and their families, but it has to be one of the most gorgeous locations in America--with manicured green lawns, beautiful cypress and pine trees and a view for miles. Every year during the patriotic holidays, miniature U.S. flags are positioned by the Boy Scouts of America at each grave in honor of the military members who served our country, some giving their lives in the process.\nIf you plan to go hiking, wear comfortable walking shoes with good traction, as some of the paths are rocky and fairly steep. There is an entry fee per car to get into park. Bicycles are welcome, and their riders are often seen getting a great workout biking up the steepest hills.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Wow!", "This is a wonderful place to visit. The overlook of San Diego is breathe taking. I would suggest going at low tide so that you can enjoy the tide pools."]]}}