{"California Science Center": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "California Science Center", "url": "/Attraction_Review-g32655-d106164-Reviews-California_Science_Center-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/8b/67/fa/california-science-center.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "3345"}, "address": {"@type": "PostalAddress", "streetAddress": "700 Exposition Park Drive", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90037-1254", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Wonderful Experience", "The space shuttle Endeavor was a highlight of our tour--we were here on a weekday, so not too busy, but you may need a \"timed ticket\" on weekends. Nice collection of space capsules, borrowed from the Smithsonian Air & Space Museum, so don't know how long they'll be here. Interactive displays for the kids were fun and informative.\nShow less"], ["Reviewed 2 days ago", 5.0, "Space Shuttle Endeavour.", "The place is very informative, went there to see the Space Shuttle and could not believe how big it was. Lot's off interactive exhibitions to browse. Would recommend to anybody with interest in science and or space. Cheers Brett from Hastings Point. Australia."], ["Reviewed 3 days ago", 5.0, "Amazing & almost free!", "Last Summer, my boyfriend and I went on a road trip through America. The California Science Center was really amazing & almost free. For a few dollars you have full entrance to the science center. There is so much variety of things and subjects that you can see.\nShow less"], ["Reviewed 4 days ago", 5.0, "Not to be missed", "Seeing the space shuttle is exciting and there are some very knowledgeable volunteers to help you learn about it. . There is other interesting space stuff to see too like old capsules. But the rest of the museum is very interesting too although mainly aimed at children. The museum covers a huge area all clean and modern and convenient and FREE!\nDon't miss the imax show it is a fantastic experience.\nBe aware that if you visit the museum in the week there will be a lot of school kids there but it didn't prove a big problem.\nShow less"], ["Reviewed 5 days ago", 5.0, "Impressive", "Imax here is great. Saw the Amazon movie. Highly recommend for all ages. Well done. Got tix for Endeavor. Very impressive to see in person. Great museum."], ["Reviewed 5 days ago", 4.0, "Good educational visit", "The centre consists of display of latest developments in the field of science and technology. Surely a one-time visit place."], ["Reviewed 6 days ago", 5.0, "An extraordinary museum!", "The space shuttle alone makes this a must visit place. You could spend days here and never get enough. Great for any age group and easily accessible. There are wonderful health and science exhibits and the aquarium area is fabulous. Give this a full day and you can't go wrong\nShow less"], ["Reviewed 1 week ago", 4.0, "Interesting and educating", "The museum is all around pretty interesting for example,the space shuttle,special exhibits,the aquarium,the movie theatre to the sound room. Staff there are really nice and helpful when you need something. Almost everyone who visits the science center will leave the place feeling thinking about the world around them more.\nShow less"], ["Reviewed 1 week ago", 5.0, "Apollo 11", "Apollo 11, Endeavor the shuttle not the Ari Manuel Agency, and some younger kiddie interactions is what makes this a float."], ["Reviewed 1 week ago", 5.0, "Great for families", "Science made accessible. Lots of wonderful exhibits and hands-on activities, from space to the human body to..... The adjoining IMAX theater has amazing huge-screen films on a variety of subjects - from space travel to travelogues."], ["Reviewed 1 week ago", 5.0, "Space Shuttle is Amazing", "This is a phenomenal museum for kids in the heart of Expo Park. While some of the exhibits are worn, its still fun to see the Endeavor and associated exhibits. Its amazing that its free to the public."], ["Reviewed 2 weeks ago", 5.0, "California Science Center and Aerospace Center", "I advise anyone that works there to recognize the fact that I am sueing my boss there for bringing a pack of beer and placing it in the refrigerator."], ["Reviewed 2 weeks ago", 5.0, "IMAX plus", "Went for the IMAX movie about Henry Bates which was educational and enjoyable. Checked out some of the exhibits inside before the movie. Always a good time here and next door at the natural history museum"], ["Reviewed 2 weeks ago", 5.0, "Worth going out of your way to visit", "The museum is great for children of all ages and for adults. Our granddaughters love walking through the aquarium and watching the divers feed the fish. The environmental rooms keep them occupied for hours. And a space shuttle! Also, there are special room for the very young to play and learn. Also, it is free (although we love it so much we belong). Hint: Join the museum and you get free parking.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Star Show", "The narrator and crew did a very nice job of taking us through ideas about space and astronomy. It's always nice to have a pleasant trip."], ["Reviewed 3 weeks ago", 5.0, "Entertaining for the entire family", "The California Science Center is a great place to go by yourself or take the family. They have many different types of exhibits and offer something for every age. Many of the exhibits you can participate or interact with. Fun and educational all at the same time. Bodies in Motion is one of their most exciting exhibits along with the Space Shuttle Endeavor. Highly recommend.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Special", "What a day. We only had a few hours spare but I think I could have spent a full day here. We saw the Ocean. Rivers and Space. Got first hand experience of the space shuttle Endeavour for no cost other than the option of a donation. I would have it in my top 3 to visits in LA.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A great day!", "Between the great exhibits and the IMAX theatre with brilliant nature films, a day here for people of all ages can’t be beat. The African American museum is close by too."], ["Reviewed 4 weeks ago", 5.0, "Bodies", "Besides having a space shuttle we went for the Bodies show. You might think it would be creepy, but it is done tastefully and was very interesting. The Imax always has a good variety of shows. If you want to attend the Imax, figure in the times of the movies and plan accordingly.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Enjoyable and interesting", "My family visited this lovely center. It has many interesting exhibits and you can spend most of the day here. Thank you to those who have made this a free museum so that people from all walks of life can visit and experience science. We gave a donation because these types of facilities need to be available. Lots of area's for children and adults of all ages to enjoy and explore. Great learning center. The kids especially enjoyed the Ecosystems exhibit with the fish and sea life, up close and personal. They even have a kelp garden aquarium! Californians should be proud that they have such a lovely place to take their kids too. In fact, I heard from some people that they visit the park museums every two weeks. The CSC is situated in a park with many other museums nearby and parks for the kids to run around, so it is well-worth visiting.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "must visit", "great for kids. lots of participatory exhibits. some science things I haven't seen before. Entrance by donation without a fixed fee. IMAX attached has good shows (not for free)"], ["Reviewed January 24, 2018", 5.0, "A MUST-SEE Entertaining/Educational Attraction", "Took my mom, 2 sisters and 3 nieces and nephews in September to see Space Shuttle Endeavor. We were on a time limit (about 3 hours) and spent most of that time in the Endeavor exhibit, but we were able to wander around a little afterwards and see some of the other exhibits. We have been to a fair share of science museums; this one was easily the best. The Endeavor exhibit is an extra (nominal) charge--I think we paid $14 for 7 people, but it was completely and utterly fascinating. Not only do they have the shuttle itself on display (that you can completely walk around), but they also have the last remaining External Tank ON EARTH displayed as well! Additional items on display include used Michelin shuttle tires (front and back), a SpaceHab expanded living habitat used in later Shuttle missions, a complete Space Shuttle Main Engine (SSME), Shuttle Galley (\"space kitchen\" for preparing meals), a fuel cell power plant (for generating electricity, heat and water), Waste Collection System (\"Shuttle Potty\"), TONS of pictures, the purchase order for the shuttle, \"Mission 26: The Big Endeavor,\" an amazing video showing how they transported Endeavor 12 miles from LAX through neighborhoods and other tight spaces (sometimes with only inches of clearance on either side of the shuttle's wings), and lots more.\n\nAdmission to the California Science Center is free (parking is not), but a ticket to see Endeavor is in the $2-$3 range per-person. Note that the University of Southern California (USC) is CaliSci's next-door neighbor, and their sporting stadium is built RIGHT NEXT to the Science Center (like mere feet away). We attended on a \"home\" football game day and found traffic to be an absolute NIGHTMARE. Parking was expensive, parking spaces were very difficult to find, traffic was nearly gridlocked, and there were MOBS of people EVERYWHERE. While we tried very hard not to let these things ruin our day, it definitely made getting there and getting home again VERY difficult. I highly recommend checking USC game and event schedules to make sure there are no major sporting events happening on the day you want to attend...and if there are, think VERY hard on whether or not you want to deal with that mess.\n\nOther fascinating exhibits on display deal with space and aviation, ecosystems, science gadgets to play with, as well as much, much more. A new \"King Tut: Treasures of the Golden Pharaoh\" exhibit opens in March, 2018. An IMAX theater, a \"Body Worlds\" (human bodies in various stages of dissection) and other attractions are available for additional cost as well. There are dining options if you get hungry, and at least 2 gift shops that we saw (one devoted exclusively to Space Shuttle Endeavor). Handicapped people should have no difficulty navigating the massive buildings, as everything is completely handicap-friendly.\n\nPeople of all ages will find a day at CaliSci to be utterly entertaining and enjoyable. You will be amazed how fast the time flies! I can't recommend this attraction enough and loved the reminder of just how FUN learning can be!\nShow less"], ["Reviewed January 24, 2018", 4.0, "Endeavor Space Shuttle", "The California Science Museum is the final home for the Endeavor Space Shuttle. We came here as part of a tour group to see it. There's a lot more to the museum than just this, but this is the star attraction. We also rode the Space Mission Simulator, which was an extra charge, but rather fun. It's tame enough for most people.\nThis is a great activity for children as it makes learning fun, but we were all adults in our group and everyone enjoyed it.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Must See attraction especially with kids", "I strongly recommend this attraction which adults miss by incorrectly bucketing it under serious education tour. Educational it is but in a very accessible and fun way. I have seen almost every IMAX film here and traveling exhibition are a delight. They open our eyes to doors and windows about the world we inhabit in exciting ways replete with state of the art audio-visuals.\nShow less"], ["Reviewed January 22, 2018", 5.0, "You won't believe what they have there!", "From historic space capsules to hurricane tunnels, airplanes and the Endeavour space shuttle, every Los Angelean should take a day to go here. Even if you're not into science, you'll experience the magic."], ["Reviewed January 22, 2018", 5.0, "AMAZING PLACE!!!", "We went for the Space Shuttle Endeavor exhibit, but we stayed to see a lot more. AN AMAZING PLACE!!! So fun!!"], ["Reviewed January 21, 2018", 5.0, "Shuttle!", "We visited the museum primarily to see the Endeavor, which is in a temporary location while they build a new exhibit hall for it. It is stellar to see. The rest of the museum we found to be great as well. Many things for kids to do as well as things to entertain adults as well. It's free and there is parking nearby.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Space Shuttle Endeavour", "Great facility which houses many different permanent exhibitions. We particularly loved the Samuel Oschin pavilion and seeing the Space Shuttle Endeavour, up close and personal!"], ["Reviewed January 20, 2018", 5.0, "Nice", "Wow a wonderful science center for all ages. Easy to navigate around alots of signage. Go enjoy, good walking shoes must."], ["Reviewed January 16, 2018", 5.0, "Great space shuttle endeavor...", "Went here to see the live space shuttle for first time in my life...it's great scientific achievement and what a big booster tank it has..awesome Also.loved the 3d.imax movie.in the theater...must visit"], ["Reviewed January 12, 2018", 5.0, "What a blast!", "It was hard to believe that this amazing attraction only cost us US$2 each to experience.\nThe shuttle is right there to see, walk under and learn about, all in a purpose built (temporary) warehouse. There is plenty of info boards to read and around the wall is a date and description of every Space Shuttle mission.\nDon’t leave this off your LA list, it’s a must see.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Experience the Shuttle", "See the Space Shuttle up close and personal. Many interactive science exhibits for children and adults. Full size IMAX, good parking, accessible to all. Adjacent to USC and the Coliseium"], ["Reviewed January 11, 2018", 4.0, "Had to see endeavour", "The main reason for my visit was to see the Space Shutlle Endeavour as I have seen Atlantis and Enterprise and am trying to see them all. The actual science centre is a really nice place to explore with lots of interesting and fun things to see and do.\nWorth a visit for a couple of hours.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Wonderful", "This is a wonderful gem to visit. A day can be easily spent here!! We didn’t visit the body museum but spent all day visiting various areas. My 11 year old daughter enjoyed it as well. Worth a visit"], ["Reviewed January 8, 2018", 5.0, "Good for kids and Adults", "it is a Great place to spend time with family. There is always plenty of parking. The food is not that good. I suggest you eat a good breakfast at a restaurant before you get here."], ["Reviewed January 7, 2018", 4.0, "The endeavour exhibit is cool", "Pay the $2 and see the exhibit on the Endeavour Space Shuttle, great for kids of all ages. Wish we were around for the King Tut exhibit starting March."], ["Reviewed January 3, 2018", 5.0, "Outstanding", "We initially thought we could cover this place in a half day, but you do need to allow for at least 1-2 days if you want to do it all. We pre-reserved the IMAX show and Endeavor viewing time so just those 2 things took a couple of hours. Loved all the simulator type of \"rides\" especially the flight simulator which can go a full 360 degrees.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Top Notch Science Center", "I have visited the Science Center with my children at least 3 or 4 times. My kids, now ages 8 and 10 have loved it since they were 3 and 5 years old and truly enjoy it every time. There is tons to see and multiple interactive exhibits for kids to get there hands into. The rose garden is also beautiful if you have time to walk through it outside.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Great place to bring kids", "If your looking for a full day out with plenty to do for your kids then a visit to the California Science Center is a good choice.\n\nIt is appealing to this generation of kids as there are lots of buttons to push and activities to engage with. Very few static displays. Almost all of the displays require some form of interaction.\n\nHighlights for the kids are the touch tanks for starfish, abalone and assorted snails and sea urchins. The creativity room and earthquake room also highly engaging.\n\nFor adults the Endeavour is awe inspiring along with the Gemini, Mercury and Apollo capsules.\n\nThere is a food hall on site with plenty of options.\n\nThere is no entry fee but there is a cost to see the Endeavour and some of the exhibits. We only paid to see the Endeavour. There are a number of simulators and other activities at a cost.\n\nA good day out, highly recommended.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Excellent day with grandchildren", "We went to the science center to see the IMAX theater and the endeavor. We spent some time at the endeavor before the imax movie. There were many interesting interactive exhibits to play with and enjoy. As always the Endeavor is a special thing to see. Parking is easy in the garage. Plenty of clean restrooms. The imax movies was exciting and informative.\nShow less"], ["Reviewed December 28, 2017", 4.0, "To see the Endeavour!", "Our main purpose was to see the Endeavour so we arrived at 10 am even though we had made 11 am reservations. They told us that we could go in right away so that was great because hardly anyone was there yet. It’s definitely worth going at opening time before the crowds. There were some senior guides near the exhibitions to answer questions.\n\nWe had reservations at 1 pm to watch The Hubble IMAX film. We bought lunch and had it on one of the benches outside. After that we went around to some of the other exhibitions. We could have probably made an earlier reservation for the movie since we weren’t that interested in the other exhibits. If you have younger kids, you could spend the whole day there.\n\nIt’s a great place to go since it is free and you need to only pay for the IMAX movies, special exhibitions, parking and to see the Endeavour.\nShow less"], ["Reviewed December 28, 2017", 5.0, "California Science Center", "This is a wonderful science museum part of the exhibit is a real space shuttle. It is fun for adults and children. I hope you enjoy this as much as I have."], ["Reviewed December 25, 2017", 5.0, "Great Place for family", "One of the most exciting place in Los Angeles, California. Must visit attraction for entire family, Kids.. Great experience of learning new things for students. IMAX theater, Body world, Aquarium.."], ["Reviewed December 22, 2017", 5.0, "What a great place", "What a great place to visit, has a lot of thing to see and experience. I went there to see the Endeavour space shuttle. Great experience. Recommended for families, couples and everybody."], ["Reviewed December 19, 2017", 4.0, "Great place", "Great place with lot of attractions despite the spaceshuttle Endeavour. Many things for kids for exploring by themselves and also IMAX is great. Spend a nice afternoon."], ["Reviewed December 14, 2017", 4.0, "Love this intereting museum", "Many interesting scientific things to see and experience. Including the shuttle Endeavor. Fascinating to think of the number of trips it made to the space shuttle. Throughout the museum there are many interactive displays for both adults and children. This is a musuem you can visit many times and discover new things. They also have special showings like the recent Body World exhibition. To avoid lines and get the best ticket prices, go online. It is also walking distance from the Natural History museum, the African American museum, the Rose Garden and the LA Coliseum. There is also an IMAX theater right next to the museum. They always have interesting shows at reasonable prices. There is a large parking lot very close by. Avoid the area on Game days. The museum is located close to the LA Coliseum. You don't want to go there when the Rams or USC are playing. Luckily that is not very often.\nShow less"], ["Reviewed December 12, 2017", 4.0, "Informative place without the tourists", "We arrived at about 10am. There were some local high school students on the tour for the exhibition-Body Worlds. If the students were not here, I think there is hardly any crowd at all. We took good time to explore the Body Worlds exhibition both on the ground floor as well as on the third floor. Our tickets also cover a visit to the space shuttle Endeavour which is what has drawn us here in the first place. But I think my primary school-going children enjoyed the permanent interactive exhibits the most where they can play and learn.\nShow less"], ["Reviewed December 7, 2017", 5.0, "California Science Museum", "Trip the light fantastic! Space shuttle ENDEAVOR is housed here, and the history of space exploration is mapped out with many interactive experiences [extra $$s] e.g. flight simulators, riding a bicycle above the atrium. This is the tip of the iceberg - the whole museum is full of small miracles!\nShow less"], ["Reviewed December 6, 2017", 5.0, "Great experience and very interesting", "Many interesting things to see and try. The space shuttle is without a doubt the best thing there. But the other exhibits were also good, especially for kids.\n\nAt the space shuttle there were guides that were very engaging and knew just about everything about it.\nShow less"], ["Reviewed December 5, 2017", 4.0, "Body Worlds Exhibit Unique", "Went to the Science Center to see the Body Worlds exhibit which is an anatomy as well as health and wellness lesson through a process called plastination that preserves human bodies and anatomical parts for educational purposes. It was a fun way to get an inside look at the human body. There is genitalia shown and one exhibit with a couple in missionary position, very tasteful and educational but still good to know in case you are not ready to expose children but it is very tasteful and no gore. Tickets were under $20, parking was not a problem on a Friday. It is a traveling exhibit so only in LA until February. There is a nice gift shop, an IMAX, and other exhibits which we did not get to experience.\nShow less"], ["Reviewed December 5, 2017", 5.0, "Fun Place to Go - Kids Love It", "Spent 4 hours walking, looking at the Space Shuttle and watching IMAX movies at this nice Science Museum. Well laid out, nice live exhibits (animals and aquarium) and lots of \"hands on\"."], ["Reviewed December 4, 2017", 4.0, "Loved the Space Shuttle", "This was recommended by a bus driver and we weren't disappointed! It's a great way to spend an afternoon and we had fun exploring the various levels of this museum. The main reason was to see the space shuttle which had been taken through the streets of LA on route to its final destination. There is a fabulous photo montage on the upper level, which to be honest, should have a more prominent place. The kids loved playing with the various water exhibits and touching the different sea creatures; as well as exploring different habitats which featured various animal and bird species.\nThe room which features the Space Shuttle is full of informative information and photo montages showing the history of the Space Shuttle program.\nThis museum is a must see as it's something a bit different for visitors to LA to do on their holiday.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Must venue", "A rare and well done museum. Great new dinosaur exhibit. Classic displays of animals (movie Night at the Museum). Never disappointing. IMAX movies."], ["Reviewed December 2, 2017", 3.0, "dated musuem", "You could tell this museum was great in the 80s.....it really needs an update, could use more interactive areas, better sections for the little ones."], ["Reviewed December 2, 2017", 5.0, "Great for the scientist in your family", "We visited with our family of 5. We have one done who is not interested in science at all and one with enormous interest. This was a fun experience for both - although much more exciting for the scientist in the family. Excellent gift shop and amazing exhibits - a lot of them are interactive as well as informative. There were lots of school groups there but the centre handles lots of visitors. Note - there is a sporting stadium across the road that might be worth visiting - particularly if there is a football game on.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Time well spent", "Great place for kids to explore, learn and have a fun time with all the interactive displays. This place makes learning so enjoyable and I'm not talking about just for kids. The space shuttle Endeavor is a sight to see for only a $2 donation!! Definitely worth coming here when in Los Angeles with or without kids. Best of all admission is free for their permanent exhibits. Parking is $12.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Never bored at the Science Center,,,,even after numerous visits.", "Living in L.A., we've visited the Science Center numerous times. My kiddos (now teens) and I are always enthralled with the interactive exhibits as well as the IMAX movies. If you park in the parking lot, make sure to take your hand to lifting the car with the different pulley rigs. Even though the main parts of the Science Center are FREE, paid membership is worth it as they give you freebies to the IMAX, the climbing wall or bicycle on a wire as well as other benefits.....which balances out the cost.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Great Space and interactive museum", "Entry by donation! A lot of space exhibits including a Shuttle. There are particularly activities for children including inside a hurricane and climbing wall. A balance bike challenges adults as it is many feet from the ground. The interactive nature of this excellent museum is geared to discovery for old and young alike.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Wow", "Such a hit with us and the kids. The Endeavour was incredible to see. There are a lot of things to look at and to interact with. Can get busy with local school groups."], ["Reviewed November 17, 2017", 5.0, "great place to spend some time", "I spent about 3 hours here, this place is great. Very neat place, the shuttle was worth the visit. In a few years when they add the new building this place will be busy."], ["Reviewed November 16, 2017", 5.0, "Body Worlds", "We planned stopping by for 1 night in Los Angeles to see the Body World's exhibit, it is amazing and if you are into learning about anatomy this is a must see place. You can see human body preserved in motion poses. Muscles have been shown in layers and very educational. Entrance is fairly priced at $20 (without the imax movie option).\nShow less"], ["Reviewed November 15, 2017", 5.0, "SPACE -- right in your own back yard", "A very impressive collection of space exploration history. Before my visit I had no idea that the collection would be as expansive as it was. From the tires to the shuttle itself. The whole series of Mercury and Gemini capsules on display.\nSouthern California had a major role in space exploration but few people seem to be aware of it.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Amazing!", "Walking in to see Endeavor was so incredible. Touching the wheels, seeing the gouges from debris, and all of the missions in the room was incredible. Big 10 year old son and I were in awe. We also really enjoyed the river display, kelp beds and touch tanks, saw divers, and the telescopes and suits were so cool. Learning about aerodynamics and earthquakes was fun in interactive displays. Admission was free but we made a donation. We also saw the Amazon 3D IMAX movie. They have treats for purchase as you go in. The movie was about 45 minutes and was really good. We learned a lot and it was interesting and well done in a story. We spent 4 hours and could have spent more time. We would have liked to have gone to the African American museum.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Worth Every Minute", "One of LA's treasures. I first went for the IMAX movies, which are breathtaking. The state of the art theater puts you right in the heart of it. I actually prefer the regular films over the 3-D movies, but they are all so well produced. The permanent exhibitions, like Air & Space, are always a pleasure to revisit. Kids will have their little minds blow. And where many museums are closed on Monday's, this one is open to the public seven days a week. The train lets you off really close. You can also hang out in the beautiful Exposition Park and have a picnic.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Great Place to Learn so Naturally there are A Lot of Children.", "Be warned: This is a heavily populated place for school field trips. There are a lot of kids throughout the day so it's probably best to call ahead and find out what times are the most quiet if you're looking to get a relaxing and educational experience out of your visit.\n\nNothing against kids. I love them and have younger cousins, but when trying to read or wanting to relax as you walk through a museum, it can be pretty distracting when a hundred of them are running around screaming haha.\n\nOverall: I'd recommend checking with the staff via phone or something to find out when the fieldtrips are at a minimum. I don't know what time that is because each time I've gone, kids have been all over haha.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 13, 2017", 5.0, "Awesome!!!", "Every time it’s a wonderful experience!!! My 6 and 7 year olds enjoy and never want to leave when it’s about that time!!!"], ["Reviewed November 10, 2017", 5.0, "Visit this excellent Science Museum", "This is an entertaining and comprehensive Museum with something for everyone. The day we went there were lots of School groups and it was also free to enter. We came to see the Space Shuttle Endeavour but were equally impressed by the rest of the Museum. An emphasis also on looking after the environment, wildlife and the local climate and recycling was very good. I would return any time and really recommend the Museum for great value and a good family day out as well as having something for all ages.\nThe staff were very knowledgeable about the shuttle.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Get ready to science", "I came here after it was suggested from a weird man in a bar. Turns out they have really cool things here and you can learn a whole lot. Definitely a place to go if you want to have fun and be a nerd. 10/10"], ["Reviewed November 9, 2017", 5.0, "SUPER SCIENCE!", "An interesting place to view the Space Shuttle Endeavour and learn about NASA and the space program. Military aircraft are displayed throughout and there are exhibits that are kid-friendly."], ["Reviewed November 9, 2017", 5.0, "Most exciting place for space enthusiasts", "We went to this place & did not what to expect. It was a weekend and there were not a lot of people around but by 10AM it was jam packed. There were a few exhibitions happening, however we were most excited to see the space shuttle Endeavour up-close. Imax cinema that only costs $8.95 for an adult is an amazing experience to have as it was the biggest 3D screen i have ever seen in my whole life. Kids had a great time to explore the wonderful scientific things that were on display. Above all entry to this place is free & IMAX ticket gets you free entry to see the Space shuttle.\nShow less"], ["Reviewed November 9, 2017", 5.0, "See the Space Shuttle Up Close", "The California Science Center has grown into a special venue for special exhibitions for science and culture. But the permanent exhibit that is worth extra time is the Space Shuttle. I found being close and being able to look directly at this incredible spacecraft awe inspiring. The curators planned this exhibit well and have made it worth while educational experience for children and adults. If you followed America's space program you will find this to be an exhibit you won't want to miss.\nShow less"], ["Reviewed November 9, 2017", 5.0, "The Endeavor", "This is a must see place if you are in Los Angeles, there is a lot to see, great for the whole family and only costs $2 to get in, unless you want to see other attractions there."], ["Reviewed November 9, 2017", 3.0, "Too many children :/", "Very difficult to give a review on this place as i was disappointed with a few things and the main thing was the sheer amount of children. I understand this is a good place for school trips but we paid to see the IMAX movie and couldn't hear it all as the screening was 98% children and 2% adults. All around the whole Science Center was children and i just feel there was too many for anyone else to enjoy what was there. Also I was disappointed that we weren't allowed in the shuttle as I thought people had said that they had been on it. Overall probably a good place to go but i think they should limit the amount of children that go from schools.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Worthwhile visit", "Place has a lot to offer. I can easily spend a day in there. We paid for parking and since it was a Saturday, minimal fee of $2 was charged for the Space Shuttle Endeavor exhibit area.It sure was worth it. The gift shop also has lot so stuff being sold at a reasonable price. Overall, it was a fun and educational visit.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great visit", "We made a day of it. Visited the special exhibit, lunch in the gorgeous gardens, IMAX and then to visit Space Shuttle Endeavour. Reservations are recommended."], ["Reviewed November 8, 2017", 4.0, "Space Shuttle Endeavour", "The Shuttle was the primary reason of the visit to the museum and was well worth the visit. A good amount of information was displayed and docents were available to answer any questions. No fee for admission just a donation if you would like. The rest of the museum was what you would expect of a Californian's view of their world. Lots of activity for children as there were field trips from area schools when we visited.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Amazing place", "We had a wonderful day at the Science Centre. Parking was $12 all day and there is no entrance fee. We didn't book in advance to see the Endeavour and were lucky that it was a very quiet day. The shuttle is awe-inspiring and beautifully presented. We also enjoyed the interactive nature of so many of the other exhibits. A really great day out.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Up close and personal with Endeavour", "Had a great afternoon spent at this amazing place , what I loved about ; you got to see some aircrafts outside on displays before entering the science centre. The IMAX theater was not in operational at the time, however general collections of science related items were educative and entertaining. The highlight was the space shuttle Endeavor , great stories on the mission she had carried out , I wished we could go inside and view the cockpit part like the one in Houston, TX. Try biking on the steel rope .. it was fun.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Space Shuttle Endeavour and a whole lot more.", "Obviously the Endeavour speaks for itself. It is an amazing feat of engineering that NASA accomplished. There is a modest fee to view this, which we booked on line to get a timed slot. As it happens, at 10am when the Center opens, there were very few people around. By midday it was a lot busier, but never enough to be called crowded.\n\nThe rest of the exhibits are free and very educational, in a fun way. Our kids are 9 and 11, and have a fantastic time learning about various climates around the world, all sorts of ecosystems, space, kelp and flight. A lot of the exhibits are ‘hands-on’ which makes for easy learning.\n\nTop marks for this science centre.\n\n(Parking is $12)\nShow less"], ["Reviewed November 3, 2017", 5.0, "Worthwhile for the Endeavour alone", "Visited here straight from the airport, we had booked a time for the Endeavour viewing online before leaving home, however the entry times were not strictly enforced and we went in earlier. The size of the shuttle is so overwhelming, for some reason i had not imagined it being so big, very impressive, there is a video of when they moved it into place which was also quite entertaining. Most of the other exhibits are free and the kids (age 5 and 7) would have stayed here for hours looking at interactive type things. Some exhibits were not functioning very well, but overall there was plenty to amuse the kids. Also food options and beautiful gardens next door.\nShow less"], ["Reviewed November 2, 2017", 4.0, "Nice facility and good value!", "Parking is $12.00 entrance is free, or a donation which it does deserve! The space shuttle is much much bigger than you would imagine and well worth seeing, our grandson absolutely loves it! The other areas relating to space exploration, tidal activity and other interesting scientific elements are worth spending some time on if your grandson lets you get away from the shuttle;-)\nShow less"], ["Reviewed October 29, 2017", 5.0, "Always something new and interesting", "I like to pop in every few months to see whats new- I am never disappointed. Exhibitions are good an other opportunities are IMAX Theater, beautiful rose garden an just a great place to hang out and relax."], ["Reviewed October 28, 2017", 5.0, "IMAX movie and Endeavor -- more to see than we had time for!", "I came with my wife and 11 year-old son for a half-day before we needed to head back out of town. It was great, with more than enough to do in the time we had. Since the main exhibits are free, you could do fine just with those and many the modestly priced extra charge for the Endeavor exhibit, though we really enjoyed the IMAX movie on Hurricane! This was a very nice place to visit with a kid.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Simply awesome", "The museum exhibits are mostly geared for children. Many hands-on activities which we bypassed. We did see “Hurricane “ in 3D at the IMAX, which was amazing. The highlight for our group was the exhibit on the spacecraft Endeavor. They have various stations where you can see such things as videos of eating in space and how astronauts go “potty”. Then there’s a film of how they moved the Endeavor from the California coast, through the streets of LA and to the Science Center. Then there’s a short walk down the stairs and into the hangar where they house the Endeavor. Seeing it was an awe inspiring experience and one none of us will forget. Check out the gift shop. Good for the budding scientist or NASA fan.\nShow less"], ["Reviewed October 25, 2017", 4.0, "California Science Center Los Angeles CA", "We have a Space Ship exposition that is over the top great. Every bit as good as Florida. We just have better weather 300+ days a year. If interested in any kind of Science, you will not be disappointed."], ["Reviewed October 25, 2017", 4.0, "Really nice afternoon", "You can have a really good time at the California Science Center. The Endeavor is definitely a sight to see."], ["Reviewed October 25, 2017", 5.0, "A flying visit - but a must see!", "We only had 24 hours in LA and I very much wanted to see the shuttle so we swung by the centre on the way to San Diego. The parking is free and part of the complex, as is entry to the centre.\nThis is a fabulous centre and so staying focused was very hard! There are planes hanging from the ceiling and models of satellites in abundance with excellent information to go with them. We had to walk via other exhibitions without paying attention to them which was hard!\nThe shuttle exhibition is amazing with so much to see - engines, tyres, control panels to name but some, and a film showing how the shuttle came to the centre. The exhibition then leads you through to the star of the show, the shuttle itself. It is really awe inspiring. Huge! You are able to walk under it so can see it in details and get a real sense of its scale.\nOn the same complex are other museums so you could make several visits here - for free - and still discover new things.\nSadly we had to rush off but next time in LA this place will be high on my list.\nI have to applaud America for its centres and museums. I have been to several science and space centres and they have all been outstanding. I teach Physics and I regularly urge my students to go to these places if they are in America. When our children were younger (16, 14 & 11) we visited a science centre in SF intending to stay for at the most 1 hour. We left 4 hours later! So many hands on exhibits for the children & adults.\n\nFantastic!\nShow less"], ["Reviewed October 24, 2017", 4.0, "Hey, it's free", "Love bringing my kids here. Entrance is free, special exhibits have a fee. Kids love the enormous and beautiful aquarium, and Endeavor shuttle! A few good dining options in the lobby, and just next to those gorgeous rose gardens! A great afternoon"], ["Reviewed October 24, 2017", 5.0, "Science galore!", "Went on a week day and had no problem getting to see the Endeavour and associated exhibits. If you read and listen to most of the information, you can easily spend a couple of hours on just that. Ran out of time to see anything else except the Hubble IMAX film - also excellent. Lunch was a very good cheeseburger and fries - seating outside or inside.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Great fun and stimulating museum", "We’ve been to the California Science Center many times. This time to see Body Worlds Pulse. Great exhibit. Educational, stimulating and provocative. Their exhibits both temporary and permanent and wonderful. Interesting for all ages"], ["Reviewed October 21, 2017", 3.0, "Basic", "Offered the minimum amount to view, such as items from Space missions, but costs extra for IMAX, as expected, but also extra to see the Space Shuttle Endeavour."], ["Reviewed October 20, 2017", 5.0, "Wow! One of the highlights of our trip to LA!", "We visited the Calif. Science Center with our 2 kids (age 6 and 3) as part of our week-long spring break vacation in the LA area. This was definitely one of the highlights of our trip. It is a cool science museum with a lot of interesting exhibits, but the one that really stood out was of course the space shuttle exhibit...very very impressive. Reminded us of the U-boat exhibit at the Museum of Science & Industry in Chicago...just massive and very well done. I'm not sure but I think my wife teared up when she saw the shuttle. Kids loved it, we got some great NASA souvenirs, and had a nice healthy lunch on site and got to sit outside. Also walked around the university campus a little bit. We'd definitely come back here, highly recommend!\nShow less"], ["Reviewed October 18, 2017", 5.0, "Hands On", "The science center is an excellent museum for science. There are many hands on displays, simulators, and exhibits that provide answers to the curious child, teen or adult. This place has a Mc Donalds restaurant inside and, is across the Natural History Museum."], ["Reviewed October 17, 2017", 5.0, "Great day of interactive fun for any school-aged kid", "This is one of the \"go-to\" venues that my daughter will pick when we're figuring out what to do on the weekends. We're members at the Aquarium and at another museum, but she really enjoys the \"cool factor\" (for a third grader) of the exhibits. She likes the body works section (especially TESS); the global zones, especially the desert area with the thermal cameras that can be aimed around the exhibit, including back at yourself to see how hot your head is compared to the rest of you; the LA exhibit, especially the television studio set-up where you and your group can see yourself on television. The food isn't bad, but it may seem pricey. That's hard if you have a whole gaggle of kids, but I'd rather have good lunch options and pay for them than bad ones for cheap. The Science Center itself is free, but extra for the movie or special exhibit - right now the exhibit is \"Bodies\". The most expensive aspect, like anywhere in Los Angeles is the parking.\nNote: avoid trying to go here if the Rams or Trojans are playing at the Coliseum. That's next door with 50,000 people on the same street as you trying to access the Science Center and sports venue at the same time... I can't imagine how difficult that would be.\nShow less"], ["Reviewed October 14, 2017", 4.0, "very nice", "there is near by park . we have great experience in the science center, it is very suitable for kids and childreen from age 5 to 16 they will enjoy their time inside"], ["Reviewed October 13, 2017", 4.0, "CA Sci Center", "Good experience. I liked it. I would've liked to see hurricane more than amazon. The cow eye dissection was cool. I liked the sea tunnel. I was bummed not to get into the hurricane simulator. Try to get more."], ["Reviewed October 12, 2017", 5.0, "Cool and historic center.", "This is always a fun place to spend an afternoon. My wife loves it is the center offers enrichment classes for students. The garden is pretty spectacular and the artifacts they have on hand are outstanding. Being able to view the space shuttle and one of its rockets is quite simply awesome!\nShow less"], ["Reviewed October 11, 2017", 4.0, "Interesting few hours with kids", "We visited on a Monday in October. I booked the Endeavour but found the booking wasn't necessary. I also booked and paid for the climbing wall but we were really disappointed - the kids were harnessed up and allowed to do two half climbs/falls before the woman took the harnesses off! There was no-one else waiting so not sure why they couldn't climb for at least a few minutes - we literally would not have had more than two minutes. Complete waste of money and kids were disappointed. Overall a good few hours spent exploring the centre. A lot of the interactive stuff is broken but still a lot to see and experience.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Fascinating. Modern. Clean. Informative. Convenient. What's not to like?", "First, it is easy to get to and parking is great. Second, it is a beautiful structure, modern and clean. Third, even on busy days it is a joy to wander through. Fourth, the exhibits are well laid out, informative and thought provoking. Fifth, it is essentially free. Sixth, with the Space Shuttle, it is a must-see attraction.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Museum before the game", "My husband and I were in town for a USC football game and had time before he game to look around. Most of the museum is free and they accept donations, a few exhibits do charge minimal fees for entrance. The exhibits were well done and great for adults and kids.\n\nI would love to go again and spend more time looking around.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Day tripping", "With the addition of the space shuttle this is excellent half day adventure in Los Angeles. Combine this with a tour of the revitalized Downtown on a Thursday night and take in the art walk or free open Museums. This is LA’s new happening place."], ["Reviewed October 11, 2017", 5.0, "The CSC", "Very important place to see and seeing the treasures of science and not only. Courtesy and professionalism found inside."], ["Reviewed October 10, 2017", 4.0, "Great place for individual and group visits", "This is a great place to bring your family and large groups of people. I came to this place with my family in the past and just recently returned with a group of over 100 people. The reservations for my group were made easy over the phone, and we were received with ease when we arrived. The Science center provides one ticket for the whole group so that we enter together. The staff were very courteous to let us in to extra exhibits that we reserved and paid for even though some of our members were running late (Body Worlds Exhibit). We also placed a large order of boxed lunches for our group through Trimana Grill. The manager of Trimana Grill, Neema, was very kind and helped our group so much. The food was made on time, and the Trimana staff also helped us distribute the order to our members.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Want to see a space shuttle up close?", "They have airplanes, an actual Apollo capsule, Gemini capsule, and a Mercury capsule...but was is the absolute coolest thing...the Space Shuttle Endeavour! This is the highlight of the visit! How can you not be excited to think about where this has gone, how many trips and people did this take up above the Earth! I could sit there for hours just looking at the shuttle. Take some time away from the beach and stop by the California Science Center, you won't regret it!\nShow less"], ["Reviewed October 6, 2017", 4.0, "Bodies exhibition", "We predominantly went here just for The Bodies exhibition and to see Endeavour the space shuttle. Enjoyed both of them and The Bodies is both interesting, fascinating and educational. We didn’t really look at anything else in the centre though. It seems to be aimed at education for children\nShow less"], ["Reviewed October 6, 2017", 5.0, "Two days to check it out", "Incredible exhibits to see especially the space shuttle Endeavor. The displays are excellent. We also saw 'The Body' exhibit and that is both fantastic and somewhat morbid The restaurants offer decent food choices at a fair price"], ["Reviewed October 4, 2017", 4.0, "Fun visit on a weekday", "We visited on a Wednesday. There were a lot of school groups; some were large, loud, and not well supervised. We really enjoyed the volunteers in the Endeavour exhibit; they were informative and friendly. There are lots of exhibits and we enjoyed the desert ecosystem one the most. It’s a very large museum and exhibits seem to be placed all over with very little sense of continuity, but little ones won’t really notice if they’re having lots of fun! We also enjoyed the rose garden. While we did not eat at the cafe, there seemed to be lots of healthy choices and plenty of seating, both inside and outside.\nShow less"], ["Reviewed October 4, 2017", 4.0, "Interesting Time", "My wife and I joined my daughter and son-in-law on a visit to the California Science Center in early October, primarily to see the Body Worlds: Pulse and Endeavor exhibits. A lengthy, insightful review of either exhibit would be overreaching for me, so it will have to suffice to say that I found both exhibits to be interesting, thought provoking, and somewhat humbling. For my tastes, I thought the Body Worlds exhibit was a bit too...theatrical. Perhaps that works for some, but I would have preferred a more reverential atmosphere, considering the exhibits are, after all, the remains of sentient beings.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Wonderful Place for young minds", "This place is amazing. Young children interested in science are thrilled to be here, there is so much to see and learn."], ["Reviewed October 2, 2017", 4.0, "Super! Must See!", "This is an inexpensive event for the family. The Space Shuttle Endeavor is something to see and kids have fun and it is a learning experience too. We went to the IMAX next to the science center and saw Beautiful Planet. An enjoyable stress-free day!"], ["Reviewed October 2, 2017", 5.0, "A lot of things to explore", "Love all excibitions Watching a movie is always a lot of new things to know Rose garden is amazingly beautiful The only problem is parking- may not be available and in my opinion, overprised"], ["Reviewed October 2, 2017", 5.0, "Space Shuttle", "It is amazing to think how many times the shuttle went to space. It is much bigger than it looked on TV."], ["Reviewed September 29, 2017", 5.0, "A must see while in Los Angeles", "Stopped in to see the space shuttle Endeavour . This alone is amazing and worth seeing. To visit the museum , the general admission is free but to see the space shuttle is a $2.00 fee --- well worth it to see this amazing piece of history. It is good for kids as well as adults. Since we were already there we explored the rest of the museum -- there is a lot to see and do . It is a fun , informative place\nShow less"], ["Reviewed September 29, 2017", 5.0, "Good for all ages", "Home of the space shuttle Endeavor, there are many other space-related objects such as space capsules and satellite replicas. You can ride on a spaceship simulator (paid separately). There is an exibition that explains life in diferent ecosystem, among others interesting exibitions"], ["Reviewed September 28, 2017", 5.0, "field trip", "came with my nephew as a chaperone on his school field trip. we mostly toured the space exhibits which were really fun and unique. the best of any space museum you can find down here in Southern California (including San Diego). We got to see the space shuttle. Parking is not too bad as we got there at 10am. You are really close to USC's campus. Overall: very complete space museum with a lot of exhibits to view, probably the largest in Southern California\nShow less"], ["Reviewed September 26, 2017", 4.0, "Endeavour space ship", "We went there just to see the space ship. If you want to see real space ship you should go to California Science Center for sure. We spent there around 1,5 hour. Parking should be cheaper then 12$. Tickets were for free. Its worth to see. Rest not nessesary for me.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Shuttle", "We have been to the Science multiple times to ser the Shuttle up close and view the many exhibits . The Imax movies change often enough to be able to go a few times a year.\n\nThe Rose Garden is beautiful to stroll through as well. So much to see and do at the the LA Science Center.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Last minute visit", "We truly enjoyed looking at some spaceships. Would not plan a trip here but it is fun to do spontaneously."], ["Reviewed September 22, 2017", 5.0, "Endeavor and Beyond", "The California Science Center has become my favorite attraction to take visiting friends and family. The IMAX movies are always a treat - my favorite is the Hubble Telescope movie (mind and heart altering). But my very favorite exhibit is her ladyship- The Endeavor. I have seen her at least a half a dozen times and I feel like I learn something new every time. Don't miss the time-lapse video on moving the shuttle from LAX to the Science Center. It represents the supportive and amazing communities and neighborhoods of LA.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Trip to see Endeavour", "We went primarily to see the space shuttle Endeavour. It was amazing to see this in person as well as some of the other bits like the Apollo shuttle and other related items.\n\nOur experience was made better by the staff one of which came to chat to us and showed us samples of the tiles used on different parts of the shuttle as well as educated us and answered any questions we had. It turns out the lady had worked on the space shuttle program and watched the first launch of Endeavour!!!\n\nThe rest of the Science Centre was also great with lots of educational exhibits and options to get hands on.\n\nHighly recommend especially as the main exhibits are all free to view!\nShow less"], ["Reviewed September 18, 2017", 5.0, "Must see, takes a whole day!", "There are several museums at the CSS. Worth visiting are the science center and the body world expo. The American history museum is only worth it if you have extra time on the day.\n\nParking costs 12 dollars a day. The body world's expo is about 20 dollars per person. The African museum and the science museum are free.\n\nIn the science museum there are basically 3 sections.\n1st is the space craft models and the exploration rooms on the second floor to the right.\n2nd part is the ecosystems tour.\n3rd and most important is the endeavor tour. If you are limited on time do this first. The space shuttle endeavour is the second part of the endeavour tour.\n\nThe body worlds tour is great for people with and without medical background.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Worth it just for the Space Shuttle alone", "I basically went here to see the Space Shuttle Endeavor - was not disappointed. Be sure you take a look at the external fuel tank too. It's the last of its kind. Overall, I had a good experience here, but a majority of the place is for younger kids.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Must See This", "The shuttle is bigger than life in person.I loved this place. Plenty of parking but it not free. It had lots to see and do. Great interesting place for all ages. Plenty of restrooms."], ["Reviewed September 14, 2017", 5.0, "Diverse and Absolutely Worthwhile", "We went to see the Human Body show with a visit to the Endeavour as a bonus. The space and lay-out are conducive to allow you to stop and really experience the exhibits. Videos, great explanations on cards, good flow. Lots to see and learn and experience. First time I have been here and would recommend it to children and adults alike. Wonderful day.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Nasa & spaceshuttle exhibit", "Once again, for me to get about to see the wonders of LA & nearby areas I need out of town to visitors. The California Science Center was no exception. This is a wonderful place to loose yourself for a few hours. I grew up during the beginnings of spaceflight & have always been fascinated by the technology. What really brings it all home is seeing the small size or original capsules that Shepherd, Glen, Cooper & the others had to fly in compared to the shuttle. The big draw of course was seeing the space shuttle right there before me. Seeing the little dings in the outside insulation really brought home the dangers of each flight taken. That, plus the supporting displays made the visit worth while. I did not find parking a problem either or the access to the freeway. The theatre other exhibits on the campus really make for a top day out\nShow less"], ["Reviewed September 13, 2017", 5.0, "Always Interesting - From a Native Angeleno", "Great for families, and something for every age (Very young children will enjoy also). I have been to many science centers around the country. LA's ranks at the top. The exhibits are always really well thought out and worth seeing. If you are visiting LA, definitely a great source of entertainment. You can spend a little time or all day. It is right next door to the Natural History Museum, so you can see that also!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Space shuttle", "you need lots of time so much to do and see. Beautiful area amazing seeing the size of the space shuttle."], ["Reviewed September 10, 2017", 5.0, "Really cool place!", "We came for the space shuttle, which was amazing, but there were lots of other cool exhibits here- all free! Great place to spend a hot day."], ["Reviewed September 10, 2017", 5.0, "Very well run museum", "This place had lots of really interesting exhibits though I think my favourite was seeing the Space Shuttle. Super friendly staff and very good food as well as a nice outdoor seating area. Well worth a visit."], ["Reviewed September 9, 2017", 2.0, "Not impressed!", "Sorry to say, this was a dissapointed visit. You also pay for parking. Some of the things did not work inside. The imax movie was great, pay some extra for this, you will enjoy it."], ["Reviewed September 9, 2017", 4.0, "Cool place for kids", "Definitely aimed more at kids/youth. There are many things for kids to do and see here. I enjoyed it as well.\nMy one nit was that since we went on a Holiday (Labor Day), we had to purchase tickets to see the Endeavour, which is usually free.\nShow less"], ["Reviewed September 7, 2017", 5.0, "An amazing experience. Would go again in an instant!", "I went to California Science Center for one reason- to see Endeavour, and I was not disappointed. Even if you are not that interested in space it is still an incredible sight to see. The exhibition prior to the shuttle itself is interesting and the staff are very knowledgable and friendly. The shuttle itself is absolutely awesome. Will definitely visit again and recommend to anyone going to LA. I was here for ~2 days and it was top of my list (and rightly so). So easy to get to with the metro, just get off at Expo/USC and it's 2 minutes from there (through a gorgeous rose garden too). In addition, I can't believe this incredible exhibit is free! Fantastic!\nShow less"], ["Reviewed September 7, 2017", 5.0, "See the Endeavor", "Crowded but great activity for free! The Endeavor is so worth it and everybody should go see it! Must do with kids."], ["Reviewed September 6, 2017", 5.0, "Body works 2", "Really enjoyed the exhibit, informative and interesting. Always enjoyed the IMAX movies. Good museum store. Lots of different museums in one place."], ["Reviewed September 6, 2017", 5.0, "Love the space musuem", "The science center can provide hours of entertainment for both adults and children. The Space Museum is a must-see section of this museum. Standing ang looking up at the Endevor gives you chills."], ["Reviewed September 6, 2017", 4.0, "Great Family Outing that is FREE", "I take my grandkids to the Science Center often. They can touch live sea creatures and learn about science while having fun. There are many 'hands on\" activities. There is admission to IMAX shows but well worth it."], ["Reviewed September 6, 2017", 5.0, "My favorite free museum in LA", "I love going to this museum and have probably visited many many times. it is enjoyable for adults and children alike. there many things to see and experience. you can also pay a very small fee to see the endeavor which is amazing to see in person! it is also near the rose garden and it is a very good place to take pictures with the family or friends when they are in season. it is also convenient to the los angeles metro train, so you don't have to worry about parking.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Space Shuttle plus", "Visited with our 11 year old son who loved everything about this museum, especially the hands on exhibits.\nWe booked tickets in advance to view Endeavour which like the museum were free. We visited mid week so not very busy when we visited.\nWas good to walk around and close up to Endeavour. There is so much to see and do here that you could spend all day here.\nPlenty of parking outside at $12.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great experience in Body Worlds exhibition and aquarium!", "The Body Worlds exhibition is awesome and the aquarium is so beautiful, love it! The place is suitable for everyone and totally worth the money! Better visit in the morning as there are too many things to see, one whole day might not be enough to see everything.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Very interesting", "There is so much to see here, you need a couple of days to take it all in. A good place to visit for everyone, old and young."], ["Reviewed September 1, 2017", 5.0, "Absolutely fantastic: a must see", "I was blown away: great exhibition, great location, super interesting for everybody from 1 to 100 years old. Convenient parking makes it extra sweet. On top of that the entry is free too ! Highly recommended."], ["Reviewed August 31, 2017", 5.0, "Great place", "Great place. And it's free ((unless you do special exhibits or an IMAX movie)). Seeing the Space Shuttle was awesome but there are a great number of other exhibits there, too. Only problem is the roads in the area are blocked off for stadium use or construction so you have to have a car drop you off or pick you up a few blocks away - but it's worth it.\n\nOther great museums in the area. Check those out, too.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Awesome", "A very well done science center with unique things we have not seen at any other science center, including the biking 43 feet above the front hall! And seeing Endeavour was awesome! Disappointed we couldn't see the inside of it, but they are raising money to place the shuttle vertically and give us more access. We'll definitely return when that happens if we visit California again from Canada. And we had a really great experience with an employee in the Endeavour area who showed us samples of the materials used on the shuttle and provided many interesting facts for our 4 children and my wife and I. He was extremely friendly and made our visit there 10x better than if we hadn't met him. I wish I remembered his name, but I've forgotten. Well done!\nShow less"], ["Reviewed August 29, 2017", 5.0, "Worth your time", "No admission fee but do pay for parking. Park in underground area to avoid the sun. Lots of hands on exhibits for all ages. Food court has good range of selections."], ["Reviewed August 28, 2017", 4.0, "Worth the visit if only to view Endeavour!", "I visited here late August midweek - plenty of parking available and appeared fairly secure - around 12 dollars. I booked tickets in advance to view Endeavour which were free -no queues on the day of our visit.\n\nThe museum was a bit of a drive from where I was staying, but definitely worth the journey to see Endeavour which our teenager found very interesting. How often can you view a space shuttle? Amazing !\n\nThe centre has quite a few interesting interactive activities available which I feel are mostly suited to under 12 years.\n\nWorth the journey even if only taking quick look at Endeavour!\nShow less"], ["Reviewed August 28, 2017", 5.0, "A great free place to visit - Amazing Space Shuttle", "The California Science Centre is a free to visit attraction and is amazing for families and individuals interested in space and science. We primarily visited to see the Space Shuttle which is housed in its own hangar - we were amazed at how few people were visiting given it was peak holiday season. It was fantastic to spend half an hour looking at this amazing craft.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Free to get in. Fun place to visit especially if you have children. There are a lot to learn here.", "This is a Fun place to visit, especially if you have children. There are a lot to learn and see here."], ["Reviewed August 27, 2017", 4.0, "A Science Center like no other!!", "Awesome place to visit with the family.From the space shuttle, Endeavour to the awesome science stuff around.The center has many activitys for everyone.Had a great time,especially when my eyes saw the shuttle,amazing to to witness so close.Also see the shuttles external fuel tank.Yes!!,that Giant orange thing.outside.A must see to beleive.You won't be bored.See the incredible Imax theather,the aquarium also,I did.\nShow less"], ["Reviewed August 27, 2017", 5.0, "What a centre!", "Maybe the most complete science centre I've ever seen! WOW Inside you can find everything you want (obv regarding science!!)"], ["Reviewed August 25, 2017", 5.0, "3 of 4 Space Shuttles", "Spent most of my time checking out the Endeavour displays. I have been fortunate to see the Enterprise at the Intrepid Sea, Air and Space Museum and the Discovery at the Udvar-Hazy Center. It was fascinating to hear the docents speak of the tiles on the space shuttles as well as to witness the tile's weight!\nShow less"], ["Reviewed August 23, 2017", 4.0, "~~ Just seeing the space shuttle Endeavour was worth the effort to get here! ~~", "With not a lot of time to spare we had pre-purchased tickets ($2 per ticket) to see the Endeavour at noon. (Prebooking is required during the summer.) The first portion of the \"tour\" takes you through a \"museum\" educating you about where the Endeavour was made, showing you the tires, toilet, oven etc. In this area there are also two simulators (both the same) that launch you into space along with a video/movie showing the Endeavour coming \"home\" through the streets of LA. This activity costs extra at $6 per person.\n\nFrom the above you then walk out of this area and find your way to an external hangar. As we walked into the hangar we were overwhelmed with the size and imposing presence of the Endeavour. It almost takes your breath away as you look upon something SO large that has been so far. Having undertaken 25 missions from 1992 to 2011 this is truly an epic part of space history staring at you.\n\nIMPORTANT to note that visitors are NOT permitted to touch the Endeavour nor can you go on board.\n\nAround the walls are interesting details of all the space expeditions plus a small version of the newly planned exhibition center/home where the Endeavour and external tank will be housed together. External tank you say? They disintegrate upon entering earth's atmosphere. How come there is one on display? Is it real? Yes! It is the ONLY one left on earth? Why? It was manufactured but never used. Incredible and HUGE! Right now it is on display outside. A gift shop dedicated to all things \"shuttle\" is also in the hangar.\n\nAlthough we spent about an hour looking at some of the other exhibits in the Science Center our main reason for coming was to view the shuttle.\n\nPLEASE NOTE that there was plenty of parking but we did have to pay. Also remember to give yourself plenty of time to get to the museum due to all the traffic!\nShow less"], ["Reviewed August 23, 2017", 5.0, "Great place for kids! See the shuttle Endeavor!", "Easily can spend half a day and also very educative! Loved seeing the space shuttle. They charge for parking. The entrance was free when we visited but when they charge, I think it is only $2 per person. It is really worth visiting!"], ["Reviewed August 22, 2017", 5.0, "Activity for every age child", "You can never get bored here. Little kids' discovery center is fantastic. Live animal and ecosystem exhibit is so educational."], ["Reviewed August 22, 2017", 4.0, "Crowded but fun.", "My boyfriend and I visited last Saturday. Seeing the shuttle Endeavor and bodies exhibit was a lot of fun. Make sure to get your tickets for the IMAX in advance. Try a weekday for smaller crowds. Overall we had a great time."], ["Reviewed August 22, 2017", 4.0, "Very Educational", "This was our first time visiting the California Science Center and we are from Southern California! It's a great place for children and adults. There are a number of \"touch & see\" type of exhibits that would certainly entertain and educate the kids.\nWould definitely recommend that anyone interested in the sciences visit; you are never too old to learn.\nThe space shuttle exhibit was very informative; lots of elements to space travel to see; you'll need to take your time to read all that is presented.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Free and Informative", "Great informative center for anyone interested in science. Be prepared for a full day or half day, carry water and preferably pack your food from home."], ["Reviewed August 21, 2017", 5.0, "Educational Treat", "This hands on, super affordable Science Museum is a Great choice for the family and kiddos on a day outing. It is home to The SPACESHUTTLE VOYAGER, that exhibit alone was beyond impressive. It provides so much stuff to see and learn in a very creative way. Check this one out I rate it-- AA++\nShow less"], ["Reviewed August 19, 2017", 5.0, "You have to go see Space Shuttle Endeavour", "Go see it! It's practically free! One of he most complex things mankind has ever built and you can stand a few feet from it, walk under it. Took my breath away.\n\nIn several years they will have it displayed standing up, which will also be cool, but it was pretty cool to get to walk under it as well. So go see it like this now while you can!\nShow less"], ["Reviewed August 19, 2017", 5.0, "You should definitely go and take your kids! a place for every age grou;.", "This is one of the best places I have visited. Alot of impressive objects that really highlight the golden age of science and space crafts. You should also watch the short movie."], ["Reviewed August 18, 2017", 5.0, "Wonderful and interactive day oit", "We are regulars here and I felt compelled to write. This center is super interactive, offers a number of activities for children and has the added bonus of being free to enter. There are charges for the shuttle and the IMAX but these are reasonable. Seeing the shuttle is so inspiring. Wonderful location and set up.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Great Family Outing", "Enjoyed tremendously playing scientifical games/projects, watching IMAX, space shuttle, and related displays. I want to go there soon to have the grandkids explore its discovery rooms. In addition, it's a beautiful building with nice surrounding environment to stroll on..."], ["Reviewed August 16, 2017", 5.0, "Science and much more all around", "The Science Museum is much more than science...the history in it is worth so much for children and for older folks who have lived through the break throughs of air and space exploration. Memories will be congered here and memories made.\n\nThen there are the surrounding museums, USC, the Coliseum, etc. If it is a one day excursion, make it mid-week day and coordinate tours of the other sights. Also, make sure you get photo opportunities in the Rose Garden, which in ìtself is worth the visit. Of all year August, October, and February are very nice months to visit.\nShow less"], ["Reviewed August 16, 2017", 5.0, "It will Space you out", "The Science Center is a great place to take and show your kids, and even adults can marvel at all that is there. a must see is the space shuttle. what a marvelous piece of engineering. and the sight of the older space capsules are very interesting. It is a must see place to see all the wonderful advances that have been made, plus a lot of history. its a sure bet, must see, place\nShow less"], ["Reviewed August 16, 2017", 4.0, "Cool exhibits, slightly outdated", "my half-day at the Science Center was enjoyable. We went during the Pixar exhibit and luckily got the last entry without booking in advance. I found it very thorough and entertaining. Some of the exhibits are outdated which is to be expected. Seeing the space shuttle is awesome.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Lot's To See, Lot's To Do!", "I visited the California Science Center this summer and it was a fun and educational outing. First of all, there is no entry fee, but you can always make a donation, and there was a lot to see! I enjoyed viewing and peeking inside the astronaut space capsules that were on display. Another interesting exhibition was the giant underwater fish aquarium that could be viewed from outdoors or from the top of the aquarium and also the interior of the aquarium via Science Center.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Incredible surprise", "This FREE museum will blow your mind! Tons to do. Can easily spend a full day there with kids 1-12...1/2 day for sure. Mind blowing surprise with the space shuttle on site...I mean, knew it was there, but really didn't understand the massive scale of the thing. Really a fantastic time here including a hands-on aquatic element. Would definitely return.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Endeavour!", "Such an inspiring place to visit and worth visiting, to be able to see the actual space shuttle was breathtaking and inspiring! Lots of things to do it was relatively busy visiting on a Wednesday afternoon but spacious and plenty time to enjoy the exhibits! Gift shop was good value too\nShow less"], ["Reviewed August 10, 2017", 5.0, "Great for children and adults!", "My grandsons are 9 and 11 and they had a ball. The Imax, space shuttle and hands on science projects kept them busy for hours! It was a real winner!"], ["Reviewed August 9, 2017", 4.0, "Family had a blast.", "So much things to do and learn. Science and engineering really goes a long way. There are so many exhibitions. You have to come experience it for yourself."], ["Reviewed August 9, 2017", 5.0, "Great Free Museum in LA!", "We have made several trips to this museum - usually with kids. It has so many interesting things for them to do and it is free! If you have a large group you do have to pay $25 and make a reservation. The space shuttle may cost a small fee though it came free with our large group tickets. It is so amazing to see up close and the huge fuel tank for the shuttle! I love that this is so accessible to so many people and kids love it!\nShow less"], ["Reviewed August 8, 2017", 5.0, "Chance to see the Space Shuttle up close!", "Great way to spend the day with the kids. Lots of hands on experiences and truly a learning experience day for the entire family."], ["Reviewed August 8, 2017", 4.0, "Science made easy", "Great for all ages. Good 3D shows on all sorts of subjects. Lots to see and do with interactive exhibits everywhere. The visit was worth it for the Space Shuttle alone"], ["Reviewed August 7, 2017", 5.0, "Great exhibits!", "I've been to a few exhibits here now and what a lovely way to spend a weekend wandering through the exhibits and leaning something new."], ["Reviewed August 7, 2017", 3.0, "The 3D movie at the end was the best part", "We went to the California Science Center during our recent visit. It was daycare/ camp kids all over, certaion exhibits were extra but it has some very interesting facts and the sea creature section was nice. The best part was the 3D movie we saw during our visit. Another thing was half of the exhibits didnt work. They need to update the attracttions, it looks a little dated. Parking was $12.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Great for being free!", "It was great for being free. Lots of hands on activities. The one thing that I noticed was there were a handful of exhibits that were broke/needed repair, but overall great for spending a few hours."], ["Reviewed August 7, 2017", 5.0, "What a wonderful place for adults and families", "We were able to view the exhibits with our children (ages 8 - 11). There was a lot of interactive displays which the kids enjoyed, plus adult level displays. Parking was easy."], ["Reviewed August 6, 2017", 5.0, "Free fun, Educational fun!", "We went to see the space shuttle Endeavor. Truly amazing experience seeing a shuttle in person. Perfect place for kids & it's free. We walked the rose garden out back after. Perfect setting for a picnic so if you plan ahead. This is actually my second time. Had to take the husband it was so cool.\nShow less"], ["Reviewed August 4, 2017", 5.0, "WOW", "The California Science Center is an amazing place that anyone can learn about science and see the outstanding exhibits."], ["Reviewed August 3, 2017", 5.0, "Facinating, fun, FREE, educational and plan to spend the entire day!", "We took our two grandkids during our yearly trip to California to see the Endeavour (make sure you book it online as one never knows how busy it will be - busses of kids and senior citizens are quite common. You do not need reservations if you only want to go to the Science Center exhibits, which take all day - however if you have never seen a space-shuttle go see it - they may have opennings later in the day if you forgot to make reservations.) To my surprise there was so much more to see here!! (The last time I was here was 1982 with my son when he was 10, now I had his kids with me.) We came at 10 a.m. and stayed all day. We ate at the cantina and even the fast food was good. The kids loved the drunk driving similators. The boy went on the bike on the highwire. I liked the marine-life exhibit. There is something for everyone. The kids and my brother went on the space-flight simulator for a small few each.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Fantastic way to spend a day.", "We booked the Shuttle Endeavour tour and it was well worth the negligible fee ($2 per person I believe). The rest of the standard exhibits were well curated, maintained and thought out. A great way for a family to easily spend 4 or 5 hours."], ["Reviewed August 2, 2017", 5.0, "Endeavour!", "Just an amazing experience seeing space crafts that actually have been into space. With almost no cover fee, you get to see an apollo, the last space shuttle, the rocket that fueled the space shuttle and so much more! Loved the experience!"], ["Reviewed July 31, 2017", 5.0, "Outstanding, by far the very best presentation \" EVER \"", "This show is for everyone, and I do mean everyone of every age and all walks of life. Thanks to the people who donated their bodies to science, there is much to understand from this presentation !!!"], ["Reviewed July 29, 2017", 3.0, "For the younger kids. Take public transportation.", "Not really designed for teens,..more for the ages of 5-8 yrs. Very clean and there are several ' hands-on ' exhibits. Very easily reached by public transportation,...don't drive if you can help it.\nAdmission is free, though, the ' extra ' exhibits or IMAX features, are extra. Located right near the LA Coliseum and USC campus.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Cool place to visit", "First, the science center is free, which is great, considering all it has to offer. We visited on vacation with kids ages 5 - 13. Everyone enjoyed it and there is plenty to do for a few hours. Not much to eat outside the museum area so plan on eating on the food court. Not bad food and to be expected prices.\n\nMake sure you check out the endeavor exhibit! When you go, ask one of the workers for more information. They love to share info and details that are better as they walk you around than if you just read the displays.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Bring your children", "The admission is free. Some areas such as human body, are not free. 4d movies are about $5. My kids enjoyed the museum and they definitely wanna come back"], ["Reviewed July 26, 2017", 4.0, "Large inexpensive museum", "We drove here from out of town. Parked no problems in the large car park. $12\n\nMuseum is free but there are additional exhibits which you can pay extra to see, depending on your interests. We chose to see Endeavour Shuttle at $2 each and this was well worth it....\nthere are also IMAX films and an exhibition about the body but we had more than enough free stuff to see.\nBuilding itself is large and spacious. Exhibits with lots of touchy things for kids such as about rivers, flight, climates, LA etc. Kids enjoyed the aquarium where a diver did a Q and A from inside the tank.\n\nThere are various things such as a shuttle simulator $6 and wind experience e things at $2 here and there which might explain why previous posters say it's not free, but this is a large public museum requiring a lot of staff and upkeep, you can't blame them for trying to raise extra cash here and there.\n\nLunch in cafe- decent selection of burgers, sandwiches ice cream, bakery etc. Pleasant places to sit outside.\n\nWould return as we didn't cover everything in one day. Good visit for a change of scene, bit of non-Disney and learning.\nShow less"], ["Reviewed July 24, 2017", 3.0, "Not free at all!", "read on tripadvisor it was a free museum but it is not at all! first at entrance you need to pay CASH 12 usd for parking! if you want to see the space shuttle you need to pay again. a few things are indeed free but good for young children but not for teenagers or adults. So it becomes quickly a 50 usd trip ...\nShow less"], ["Reviewed July 24, 2017", 5.0, "Rapid but exciting visit", "As part of a tour, we visited the Endeavour space shuttle (a must-see!) and entered through the aquarium area where many of our group could have stayed for an hour! absolutely great."], ["Reviewed July 23, 2017", 5.0, "Amazing Place", "Went with my daughters and had a great time. There was so much to do, see, learn, touch and experience that one day wasn't enough! And the best of all it was for free. My favorite is the aquarium with the divers that high fived the kids through the window....\nWe have to come back to see the rest.\nShow less"], ["Reviewed July 22, 2017", 4.0, "A good site to visit with the Space Shuttle.", "The California Science Center is a very interesting, yet scientific place to visit. There are many 4 different parts to it to see. They have one section where you learn different ecosystems and what is affecting them. A second section is on different sections of the body and what affects it. A third section is on curiosity and developing methods to use it for scientific progress. The fourth section is on aerospace. It had both planes and space capsules. You can then see the Space Shuttle Endeavor. For an extra fee you can go to the body human and/or see an IMAX movie.\nShow less"], ["Reviewed July 21, 2017", 5.0, "So special.", "So special. Much to see; many spaces in which to linger! Beautiful grounds surrounding. Nice way to spend an afternoon"], ["Reviewed July 21, 2017", 5.0, "Definitely worth checking out", "In addition to the \"normal\" exhibits (a lot of hands-on science stuff), the main attraction here is the space shuttle Endeavor. I was lucky enough to watch it fly overhead (attached to a plane) before it was then taken through the streets of LA on its way to the science center. Pretty cool! Now it just sits in the museum, obviously, but it's still fascinating to see.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Worth it for Endeavour alone", "Visited here with my wife and young child.\nAs a free attraction, this is one of, if not the, best in LA.\nThere are various science sections which look great fun for the kids. But the accompanying attractions, such as the Mercury capsule, space suits and real moon rock, warrant the visit. But the Endeavour shuttle really is impressive and should make this visit top of a list for LA.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great for all ages and very interactive", "The space shuttle was amazing to see. Then all the exhibits were great and interactive for both adults and children. Something of interest for everyone. Wish we would have had more time there. Staff was helpful and informative. Will go again. Parking is easy cost $12.00.\nShow less"], ["Reviewed July 19, 2017", 3.0, "Go see the Space Shuttle Endeavor", "We only have half a day, so we spent most of our time at the Space Shuttle Endeavors. We paid and reserves ticket ahead of time. We took a campus tour of USC in the morning, and then we walk over to the Science Center. It was unique. Before you go down there, you watched a video when it was moved to the Science Center.\nShow less"], ["Reviewed July 19, 2017", 5.0, "A Great Place for the Family Space Nerd", "The Boss & I have been there a while back. I can say it is well worth the effort. As it is well set up and organized, The price of admission is pretty reasonable.\n\nNow for some hints\n\nIts in a bad neighborhood. So do not stay there after sunset.\n\nThere is ample parking\n\nWear comfortable shoes\n\nMake sure to drink fluids during the Hot Season As LA has a dry heat that sneaks up on you, Also wear sun screen.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Endeavor and Blackbird", "Not only is the California Science Center located in Exposition Park (home of the LA Memorial Coliseum) but it has a Blackbird (A-12 version) in the front. Then after walking around the Museum filled with great exhibits you get to see the Endeavor Space Shuttle. Not only were my kids impressed I was too. Seeing how large the space shuttle is, is quite impressive.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Lots for all ages!", "There is lots to see and do, some of it hands-on for kids. However, you might want to check about reservations/tickets ahead of time for shows/events/experiences. The times can fill up quickly."], ["Reviewed July 18, 2017", 5.0, "Grate museum for the family", "You can see the Endeavour, just remember to book your place in advance. Only $2.00 USD per person. Grate part of space history and worth the visit.\n\nThe entrance to the museum is free.\n\nThe museum is very well kept and set up. they have a very nice aquarium showing the local underwater habitat.\n\nConsider a $13.00 USD parking fee.\nShow less"], ["Reviewed July 17, 2017", 5.0, "The Endeavour is incredible!", "We absolutely enjoyed seeing the shuttle up close! So incredible! The docents were also very helpful. We spoke at length to one older guy who worked for NASA. He was FULL of great information."]]}}