{"Calico Ghost Town": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Calico Ghost Town", "url": "/Attraction_Review-g33295-d126686-Reviews-Calico_Ghost_Town-Yermo_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/7b/da/b9/train-rides-at-calico.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "reviewCount": "1526"}, "address": {"@type": "PostalAddress", "streetAddress": "36600 Ghost Town Rd", "addressLocality": "Yermo", "addressRegion": "California", "postalCode": "92398-0406", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Peaceful", "I like how this place gives a old town a historic feel to it. The vibe was totally different from anything else. Although, they do charge a small fee to enter, I would definitely come back because its nothing compared to other parks or museums. This place is just a huge outdoor museum. Make sure to visit when in Barstow.\nShow less"], ["Reviewed 1 week ago", 3.0, "Gift Shops Disguised as an Old Town", "Calico was quaint with wooden sidewalks and mud buildings, but it was mostly shops selling souvenirs. We had lunch at the restaurant, which was a bit costly but the food was tasty. The town “sites” were hokey and visitors were nickeled and dimed to death. It was $16 to get in (no discounts), $3 for the fun house, $3 for the Mine tour (a long walk down a rock tunnel), and more for the train. Old fashioned fortune telling machines dotted the town. Oatman,,AZ right across the border was much better and free.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Very Good!", "We stopped at Calico on the return trip from Vegas as it I s easy to get to and only a couple of miles off the highway. There’s plenty of parking and the entry charge is reasonable.\nWe really enjoyed walking around, looking at the buildings and artefacts while reading about the history of the town. You get a real sense of how it was to live there, originally, in the late 1800’s.\nFor a small charge, we were also able to take a walk through one of the original silver mines!\nThe coffee and cookies we had were delicious and very reasonably priced and the staff we encountered were friendly and helpful.\nWe certainly didn’t feel ripped off in any way.\nI would certainly recommend you take a look!\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Save Your Money!", "This was pretty much a total waste of money. It cost $8 per person to get in with no kind of discounts, neither military nor senior. However once you get in you still have to pay for individual activities inside. The railroad ride is $4.50 and it's only about a quarter-mile, 15-minute ride. It cost $3 to go into the mine shaft. The food is overpriced and all the souvenirs are also, which I guess is to be expected in a place like this. We saw a lot of people visiting but no one spending any money. While I had always wanted to visit a ghost town, this was not what I expected. I regret having spent my money on this tourist rip off and hopefully you can save yours too.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Day trip", "We decided to do day trip to Calico as we had not been there for years. We paid extra for the activities. For $7.50 you were able to pan for gold, do the mining tour and mystery shack. For another $5 you were able to ride the train. The 7.50 was definitely worth it but not sure if I would pay the $ money again for quick train ride. We loved the shops and enjoyed stepping back into the old west. Yes it’s a bit dated, quirky, and a bit corny but we really enjoyed our day. Go when weather is cool as there is no shade.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Great Little Detour", "My wife and I visited on the way out of LA, on the way to Las Vegas. It was a spur of the moment turn off on the highway, and one I’m glad we took.\n\nIt’s a quaint little tourist spot, which a few shops/restaurants, and an interesting history. If you’re passing, it’s worth a quick detour but not necessarily worth planning a whole day to visit; we were there maybe an hour and that was plenty.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Interesting way to spend a couple of hours", "We stopped off on the drive from LA to Vegas. It was interesting for us Brits, haven't seen anything like this before although know it's obviously very touristy. Was quiet when we visited on a November afternoon. Great views, we did the train ride too. Would recommend!\nShow less"], ["Reviewed January 14, 2018", 4.0, "Mini Ghost Town Shopping Mall with Paid Admission", "I remember visiting Calico when I was a kid when the place was owned by Knott's Berry Farm's Walter Knott. Back then it resembled my notion of a ghost town.\n\nNow the place is a very clean roadside attraction with lots of shops and a few rides for the family. Definitely more of an Old West mall than a museum.\n\nWorth visiting? Yes, kind of...\nShow less"], ["Reviewed January 12, 2018", 4.0, "Calico Ghost Town", "Visited Calico today. It was the perfect day to visit. No crowds and pleasant weather. As others have said, each attraction has a separate charge, which can get pricey for families. Many of them are only a couple minutes long, so if you have to pick between some we felt the mystery house was the best attraction and then the train. Inside the mine could get scary for some small kids because of the creepy looking statues. I would not go here on a hot day.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Love this old \" town \"", "My daughter's and I stopped off here in August on our way to LA. I'm a huge history buff and absolutely love these old places...you can actually smell the history here a lol.It was a very interesting and intriging stop, practically half way between the two cities of Vegas and LA... will be coming back when the weather is cooler.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Worth the drive", "This was an enjoyable venture. We arrived mid morning on a Saturday and it wasn’t overly crowded. A group of volunteers performed a couple of Main Street “gun fights”. While not the best acting we’ve seen, it was humorous and family friendly.\nWe’ve visited several other preserved towns and villages and I can’t think of one that has the same ambience of history and unique location that Calico has.\nParking is free and entry into the park was reasonable at $8.00 per person. There is an additional fee to ride the train or go through the mine.\nIt is dog friendly and there are several places that provide drinking stations for them.\nShow less"], ["Reviewed January 2, 2018", 3.0, "Not the Calico I remember.", "I went here twice as a kid and remember having a good time both times. Well, that was 25 years ago. Either my memory is off, it's changed a great deal, or both. Probably both. The location is cool--lots of old mines dotting the hills and lots of history. The shops mostly carry generic modern stuff, much of it cheap. There is handmade stuff at Grandma's and the pottery shop, and the rock/mineral shop has some neat finds, but I wish we saw more local crafts. There is a train ride, a mine tour, and a mystery house, and I think kids would enjoy them, but there are extra charges for these. My favorite part, other than the little mining \"hike,\" was the cemetery. Although it's still in use (or has been used somewhat recently), it also contains quite a bit of history. It's also nice to see the partridges running all over town. I'm glad we went, but we won't return.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Great through back", "Mr. Knott did a very good job restoring this town to its original splendor. Wish every little thing cost money, go early, once the campers and tour buses show up it's crowded. Friendly staff in most of the shops."], ["Reviewed December 21, 2017", 5.0, "A must-see place worth a road trip", "A fun, interesting place for the entire family with plenty of parking and reasonable prices. A dozen little shops, a fun train ride and a visit to the mine are ;musts.,"], ["Reviewed December 19, 2017", 1.0, "The town itself is 5 stars of fun. This review is for the jerk from last night.", "This was our second visit. We stayed last night in the “campgrounds” in our travel trailer. 2 adults and three little kids. I’m typing this on my phone after some wine, so bare with me.\n\nWe love the town. So much fun to explore with the kids. We lucked out. The place was EMPTY yesterday. Campgrounds had maybe 4 other trailers. A change from last year when the place was packed. The weather was great as well.\n\nSo much fun strolling the grounds imagining what it was like 100 years ago.\n\nWhen you arrive (at least when we did) we were not given any paperwork and just told to head to our spot in the campgrounds. We walked the grounds, took the cave tour, spent cash in the general store and just had a good time. We then had dinner in our awesome trailer. Great day. After dinner, we decided to do what any logical family would do at a ghost town, when it was a dark 6pm. Walk the town at night!\n\nWow, the stars are incredible. Just incredible. Not the hollywood actors, I mean the night sky.\n\nOur twin 10 year olds and our 4 year old were in awe (as we were) of not only the night sky, but the town at night. We had a harmless stroll up the street imagining the past, looking into the windows etc.\n\nThen a creeper creeped.\n\nWe were looking at some pay machine designed to steal your $1 for no simple reason other than to steal your $1. (Pay a dollar and a fake mining guy on a toilet makes fun of your for paying the $1). Don’t do it. You have been warned. Anyways, as we left the money grab, a older gentleman, who appeared to be in his 60’s (but was probably in his 50’s) popped out of the shadows and asked us in a gruff tone, “what are you doing here!” At first I thought it was an act so I held back from punching him in his snot locker. Then I realized it wasn’t an act. I still held back.\n\nWe said in our happy friendly voices, “we are staying at the campgrounds and are just walking around”. He glared at us and said, “the town is closed”. He said some other rude and disrespectful things that I will not repeat here because I do not want you to think we are just being too sensitive. And I also forget. But we were pissed as we took the walk of shame back to our $45/night campsite.\n\nThe moral of the story here is we were not given any instructions upon arrive. We did not see any rules and regulations. Nobody said, in a scary voice, “don’t go to the town and walk the street after closing time.” Uh, nobody even told us what the closing time was!\n\nWhy stay overnight if you can’t walk the street when it’s dark!? And we saw people in the restaurant eating. Were they sleeping there? Doubtful.\n\nLook, all this guy had to do is what we saw most the other staff doing. SMILE. BE FRIENDLY.\n\nIf he would have been friendly and told us nicely about the rules that nobody told us about, fine, no problem. But he was what some people call donkeys. And it starts with a huge A.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Oh what fun !!!", "We are a family of 5 including grams- age ranging from 5-65 and all of us loved it. The place was decorated for Christmas and it was so festive!!! There is a little train ride . A mine exploration. A restaurant- we dint eat there but looked nice . 10-12 nice shops.\nI could have spent 2-3 hours easily.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Fun break from the road.", "Nice break from the road. Several interesting shops, and a decent restaurant. Summer is a bit intense out there, so spring/fall are the best times to visit. They have Halloween events during Oct. Lot of fun going there on Halloween day."], ["Reviewed November 27, 2017", 3.0, "Yeaaaah Haaaa!", "We stopped off here on the way back from Vegas to SoCal. It's only a few miles off the road. Friends of ours said there was nothing there... but it's not been all touristed-up and is worth a visit.\nIt's cheap to get in, $8 for an adult I think. They run regular shuttle buses from the main car park up the hill.\nThere are only 5 original buildings, but the other were re-created from pictures etc. It's very authentic feeling. Not a bit like Disneyland or the plastic castles of Vegas!\n\nThere are various places to visit and things to see but a lot of the places are basically gift shops. If you've ever been to the FREE San Diego old town it's pretty similar. There is a restaurant and a couple of snack bars.\nThe low-point of our experience was the restaurant. When we arrived at lunchtime there were uncleared tables which should've set alarm bells ringing. It simply could not cope with the demand. We waited over an hour for food which was pretty basic stuff that a competent kitchen should've been turning out fast. I hope none on them ever try for a job in In-and-Out. They wont cope.\nThe server did not keep us updated and was actually pretty rude so she got zero tip.\n\nThere's a little railway but the tickets were sold out for over an hour, so make sure you get that when you get there. There's also a mine tour but 3-4 hours long, so not really practical for little kids.\nThe views are stunning and you can climb up the hills and rocks. Just be careful you don't fall down a hole.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Passing Through", "This was a great little town to stop at when passing through Barstow. My son's especially loved this place. Though we did not do the attractions (mine cave, train), we have a great time exploring. There are rocks to climb high for a pretty awesome view of the town, and lots of information about the town's history.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Passing through", "Passing through and saw a sign for Calico. On a whim, decided to check it out and it was a great call. Really enjoyed the old west mining town. Loved that they tried to keep it original. Love the Wild West feel to it. Dog friendly which is important. Quaint and unusual- the things we look for when we travel. Unforgettable\nShow less"], ["Reviewed November 23, 2017", 1.0, "Waste Of Time and Money", "In all fairness, the park wasn’t too bad. Very touristy as you might expect. About 3 miles off of I -15 between Vegas and L A...$40 for group of 4 and easy to find. The one reason this was a horrible visit and I will encourage you all to avoid this place is because of 2 of the employees . Tried getting on the little train ride... African American male took our money just fine, then he left us sitting in the desert sun for 15 minutes while he cussed someone on his cell phone. He used the F word at least 20 times and seemed agitated that he had to work til 5 and no motherf....ers had bothered bringing him some motherf...ing McDonalds. After that, some white girl, another employee, approached him and they loudly discussed how f...ing High they were and she explained how she had gotten so high the night before that she was still high and shouldn’t have even come to work for her s..tbag boss. She openly discussed how horny she gets when she’s that high and of course Mr Train Conductor told her he could help her with that. These two degenerates could have cared less how much we heard and that we were sitting in the heat listening to their crap. Finally I approached the male and told him I wanted my money back. He threw the money through the window as my family and 5 or 6 other guests walked off. Was told by another park employee not to bother complaining to the owner because they hired their son as the supervisor and he was too lazy to even show up at the park most days. AVOID\nShow less"], ["Reviewed November 7, 2017", 5.0, "Love the old west mining town", "Very well kept old western ghost town. Check out the railroad and explore a mine. Lots of great little shops with unique items for sale. The restaurant is really good as well."], ["Reviewed November 6, 2017", 4.0, "History Preserved", "This historic silver mining town was mostly a pile of adobe brick rubble and weathered boards when my sisters and I visited it back in the 60's with our history buff father. Thanks to the vision of Walter Knott, best known for Knott's Berry Farm, the remnants were rescued and those buildings beyond repair were reconstructed. He used aerial surveys to find the outlines of the foundations, and historic photos.\n\nMr. Knott gave the town to the County of San Bernardino in 1966 and it is operated as a county regional park. Most people come just for the day to enjoy the old buildings and the quirky shops in them, but there is also a large campground, AND 6 camping cabins and a large bunkhouse for groups. The bunkhouse, amazingly enough, not only has bunk beds, but also heating and air conditioning!\n\nCalico is a mix of open air history museum and shops. The shops are in the restored buildings, and tend to have their own themes, for example, one shop spotlights candy, while another offers something for your favorite dog (or cat -- think \"cat sup\" in a bottle that you put on kitty's kibble to encourage it to eat....).\n\nIn addition to the fee to enter the park,you can pay $3 to walk through the \"Maggie Mine\" and get an idea of what it must have been like to work in one (albeit without the noise and dust that must have been created) and $4 to ride the little train that goes around a short route with commentary about the surrounding hills and mines.\n\nThe school house has been reconstructed and sits prominently at the highest point of the town. From its porch you have a great view of the surrounding dessert, and the dry lake bed below. Unfortunately, the school house was not open the day we visited in November, but you can look in the windows to see the old stove in the center and the rows of desks, arranged by size (little ones to one side, older/bigger kids on the other).\n\nSome tips:\n\nWear sturdy walking shoes.\nWhile the board walks are likely wheelchair accessible, most of the shops are not, AND the Main Street is quite steep if you are pushing a heavy chair.\nThe rest rooms we used were not accessible, but I spotted another set of restrooms closer to the entry that might be - if you are bringing someone who is mobility impaired, it would be worth checking on this!\nIf you are going into the mine, bring a small flashlight - there are lights inside, but some stretches are dark and the floor is uneven. (The little shop sells flashlights as well.)\nThere is a restaurant in the park with a large dining room and also a back porch for seating.\nCalico can be very windy - prepare for dust if you wear contacts! And wear a hat that ties on, or you will find yourself chasing it up the street.\n\nWhile there does not seem to be a docent tour, the shop owners are all very happy to tell you the history of the town, and especially of the structure in which the shop is located, and staff members in the park office are also willing to share their knowledge. The leaflet you are a given when you pay admission gives you a lot of information about the town's history and includes a map and a list of the original buildings.\n\nSo come and get an idea of what it was like to live and work in this high desert town (and buy a couple of souvenirs to help support the concessionaires).\nShow less"], ["Reviewed November 2, 2017", 3.0, "Not as last visit", "This open air museum tries to show how these kinds of short time mining towns looked liked and functioned, which they success to some extent. But during our visit it was transferred into a Halloween event place unfortunately."], ["Reviewed October 27, 2017", 3.0, "Not what I’d call a real ghost town", "First of all, this used to be a silver mine but is now more like a gold mine! Was surprised to have to pay so much to get in, I think it was about $11 per person, then you have to pay more if you want to visit the mines. Unfortunately most of the original buildings have been removed and replaced with fake ones/facades which is a real shame. It’s quite quirky, but not really authentic which is disappointing.\nWe much preferred visiting Rhyolite in Nevada as that’s more what you’d expect if you want to visit a real ghost town.\nWouldn’t come back again, but it was interesting to see briefly.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Occupied everyone well for an hour", "It was $34 for five of us ... for an hour of entertainment. It's done well and a good example of a mining town at the side of a mountain in the middle of no where. Got some good photos ... loved old school house"], ["Reviewed October 22, 2017", 3.0, "Worth the Price of Admission", "Interesting history of an old silver mining town that's now a ghost town. Lots of shops and memorabilia. Several places to eat and a wonderful fudge shop. A couple of hours and you can see everything."], ["Reviewed October 21, 2017", 5.0, "Quick visit", "Our quick visit on Friday Oct 20 turned into 6hours lol. It is 8 dollars to park. It was all decorated in Halloween theme. They really went all out on the decor. Everything was really awesome. It was really windy so it gave so many decorations that extra creepy feel. The train ride had real people dressed up in spooky costumes. Every store had the friendliest people. There was also many things to do: trick or treat for the little ones, shows. They stayed opened later from 5 to 9pm for Halloween things. So much fun and took tons of pictures.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Great daily get away", "Calico is definitely a fun day get away. I habe not had the chance to camp there yet,but i bet that is fun. Calico is small, but they do have a few things to do. There is the Maggie mine, train ride,shops,saloon. Calico has great history,its allways nice to learn about our past. In october they have a halloween haunt from oct 20-22 and oct 27-29th. They also have thier own ghost hunting tours and a boot hill. My son had his first paranormal experience in the maggie mine and boot hill. I experienced these with him. Calico ghost town is a definite place to visit in your life time.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Lots of little shops", "Love the history here, and the shops. Our favorite is the quilting goods shop. Would recommend wearing good walking shoes!"], ["Reviewed October 12, 2017", 3.0, "Interesting place to visit if you are in the area", "An interesting attraction and certainly worth a visit, particularly if you are a history buff. Individual buildings are well presented and restored although on the day of our visit most of the staff appeared to be bored and lacking in enthusiasm. Entry price is $8 per person and parking is conveniently located close by.\nShow less"], ["Reviewed October 11, 2017", 3.0, "Calico Ghost Town( Cowboy Theme Park)", "As planned,we took a detour on our trip from Barstow to Las Vegas to see this place,\nIt is a restored well kept and maintained old mining town,which have been renovated,everything was very modern just made to look authentic,and feature tourist shops,lot of gift stores, eateries and period dioramas in restored buildings describing how life used to be,with a few original buildings.In my opinion it is to much like a Cowboy Theme Park.you have to pay the admission of $8 each,then an Extra Charges for all other attractions,we did the Mystery Shack,also we did the Calico Train Ride which was pretty good to look around .\nthe view from the top of the town overlooking the town and valley is great.also there was a staged shoot-out between a Sheriff and loon in the courtyard outside the saloon which was interesting.\nSo if you are Passing By or Nearby,It is Nice place to visit and spend some time .But if you want to see the old building in their ruined state rather than rebuilt to resemble a ghost town ,Go To Bodie Genuine Ghost Town !!!\n\n\nShow less"], ["Reviewed October 11, 2017", 4.0, "Interesting place", "We were advised to stop here on way to Vegas and it was worth the stop. It costs $8 per adult to get in and then there are some extra charges once inside for example the train ride is $4.50. It is an old mining town and the site has old buildings and equipment from the time it was a functional mine. There is plenty to see and you could spend a few hours here easily. It is uphill and parts are very uneven near the top but with the climb for the views of the area around it there are places to grab a drink and food and peggy sue's diner is very close if you want to combine the 2\nShow less"], ["Reviewed October 9, 2017", 5.0, "Wild West", "How America must have been at one time. Interesting town, fabulous position, ate in the restaurant which was ok , a smile would have been good. Lots of notes about not touching stuff in the stores. All in all, interesting and worth a visit"], ["Reviewed October 3, 2017", 4.0, "Great Stopover", "Great little stop on the way to Vegas, not far from Peggy Sue's diner so you can get some food then visit."], ["Reviewed October 3, 2017", 4.0, "Calico ghost days", "We booked our RV spot just to go somewhere close to home. I noticed that the 51st annual Calico Days were going on that weekend!BONUS!!! I then looked on YouTube for any video of the area and discovered that they have an offroad trail right out of the RV camp. I am so glad we took our little Hammerhead Dune buggy.We discovered mines and could ride right through some of the smaller ones.Just beautiful! The RV park Is a little primitive, but has full hookups.The people are nice,too.\n\nShow less"], ["Reviewed October 2, 2017", 5.0, "An old west town in California", "Charming fully restored little silver mine in California. Just walk around and enjoy the long past era of the past. Imagine what life could have been in the late 1890's!"], ["Reviewed October 2, 2017", 5.0, "Excellent tour and a grey detour off our Route 66 tour", "Very quaint and historical and busy. We were part of a tour and along with many other tourists enjoyed the costumed clad figures the old town and although hot there was a nice breeze. Enjoyed the best fish and chips outside of the UK ! Well done teamand everything was just fun. A real must see. Well done to all\nShow less"], ["Reviewed September 24, 2017", 3.0, "Nice to see but nothing special", "My friend recommended this place but he was there quite a few years ago. I thought that Calico Ghost Town will be alive with people dressed up in wild west style, especially for a price of $8. I also thought there will be many buildings with some old stuff inside, like jail, old houses and so on. And houses were there, but majority of them are just stores with souvenirs. Moreover, if you want something more than walk around - you need to pay for everything additionally. I believe that fair opinion is that: it is worth seeing this place once but that's enough. Maybe there are other places like Calico that offer better attractions.\nShow less"], ["Reviewed September 19, 2017", 5.0, "They must have 30 employees working on site to make your visit nice.", "Some are complaining about $8 admission fee. They have overhead out there!! The one guy bought the whole place up and gave it to the County to run. The train ride was fun $4.50. They told us about the history during the train ride and pointed out many remains in the area. Water had to be brought in back then, expensive as beer.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Interesting", "This is a very interesting place, I'm always super intrigued about how people lived in towns like this. We arrived about 3:45 and they only charged us $8 for both of us, I think because it closes at 5 so was cheaper. (usually $8 each) it's not huge so you can see everything pretty quick but I thought it was great, so educational. There is loads of shops and picture opportunities. Would recommend if you like this kinda thing.\nShow less"], ["Reviewed August 30, 2017", 3.0, "An ok tourist stop", "I had read up on TripAdvisor that this s an attraction in Yermo so decided to visit. Parking was free but it cost $8.00 a person. There was additional cost to go down the mine and to ride the train . We did neither . It is interesting to see this town if you have never been to any other mining town from the past but it was small and did not take long to go through. If we had not stopped to take pictures we could go through it in about an hour and a half..Prices in the shops were high . Very few tourists were buying. It would be a good place to take children for educational purpose.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Great visit", "We visited calico ghost town on the way from Vegas to LA and we had a really good time. My husband really enjoyed himself especially the old mine. We had lunch there and it was quite expensive but very good, it was a very hot day when we were there so only stayed about 2 hours. I would recommend this if you are in the area.\nShow less"], ["Reviewed August 23, 2017", 3.0, "Visited Calico on our way to Death Valley. Look for the words 'Calico' on the mountain. A little pricey for what it was.", "At $8 each person, I thought it was a little pricey to enter Calico -- seems like it should be free -- after all, it's a 'town'! At tops I think they should charge $10 per car. On top of that, they charged for a train ride around the mine! We opted out of that and spent our time wandering through the town and pic-nicking.\n\nFor us, it was a stop-off on the way to Death Valley--a good place to stretch our legs--and somewhere my husband had remembered visiting as a child, so it was nostalgic for him. There are several old buildings, a Town Hall, a school-house, shops, photo opportunities (Head cut-out figures!), restrooms and picnic tables.\n\nThere were several foreign tourists and bus tours when we were there.\n\nIt's about a 1 hour stop, more if you decide to ride the train and picnic.\n\nOverall, I would give it the 'It was Okay'.\n\nSee my photos fro more details.\n\nPlease click the THANK button if this review was helpful to you. Happy Travels. :)\nShow less"], ["Reviewed August 23, 2017", 1.0, "So bad", "Its cost 8$ just to enter the site and then every signal thing cost 3-6$. Not recommended at all. 123456789."], ["Reviewed August 21, 2017", 2.0, "Very little to see or do. Sad how underdeveloped this is.", "More needs to be done with this place, as the way it is right now you can experience everything ($7 per person entrance fee) in about 45 minutes, and that's including the train ride ($4.50 per person for a 5 minute ride around a hill) and the Mine Tour ($3 per person) for a 5 minute walk through two short tunnels. The stores contain nothing interesting or of any real quality or uniqueness, and the Main Street is empty, albeit for a staged gunfight, which was fun. I recall there being much more here 30 years ago, which is sad.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Pretty cool", "Its a cool place to stop by and check out. It can be a little pricey depending on the size of your party. We made the mistake to go around 3ish it was sooo hot and theres basically no shade. I wouldnt go again but its definitely a place to check out if youre nearby.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Interesting if you're around", "This was our way from LAX to the Monument Valley via Las Vegas. It's an interesting stop but certainly not worth a trip by itself.\nCalico is an abandoned silver mining town in the Mojave desert, where a main street has been rebuilt (I believe most of the buildings are not original). Certainly nice to visit with kids, then make sure to take the little train ride. There are several places where you can sit down in the shade for a drink or a bit. I really liked the old school (pity that you cannot enter the building) and the view from the hill.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Step back in time", "Wow, got a good realization how tough a prospectors life was. On our visit it was 100 in the shade, although uncomfortable heat it made the visit more authentic. We were surprised how many other visitors besides us were there. A few of the buildings are original and others reconstructions. Very photogenic location and worth a visit. All the folk who run the stores, restaurants and mining attractions were super polite and friendly.\nShow less"], ["Reviewed August 14, 2017", 4.0, "A step in the past", "For only 8 USD each, you can visit this very old city. It's amazing to spend time there. You can see the school, houses, train, mines... shops are really nice"], ["Reviewed August 14, 2017", 5.0, "Really a ghost town.", "In the middle of the desert, between Vegas and LA you have this really really ghost town. Like in movies from the Wild West , you Will feel yourself back in the 40's. Good souvenir shops . Very Very Very hot , it's desert at ALL!!\nShow less"], ["Reviewed August 13, 2017", 4.0, "A great way to break a long drive", "We stopped at Calico on our way from LA to LV.\nYou have to pay at the entrance, and there are some attractions inside you have to pay extra for, but overall, it was a very nice experience and very good way to break the long drive.\nI highly recommend paying the extra and taking the tour of the mine, mystery shack and gold penning... it adds allot to the experience.\nThe saloon was also nice, and the \"local sheriff\" was playing a game of \"dice\" gambling with the kids (using bottle caps as money) to give them the atmosphere of a saloon in the wild west.\nThere is also some selection of drinks, bear and ice-cream you can buy there and the price is not very high.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Wow. Great time had by all.", "So I didn't know what to expect here but it sounded like it could be fun especially since we liked the Calico area in Knotts Berry Farm. Admission was $21 for 2 adults and 2 kids. Then we paid another $25 for the 3 attractions. We didn't do the train ride as it was too hot for that. Despite the money we paid we found the place very entertaining. If you are just adults you might not find this interesting especially if you don't care about the period otherwise it is very informative and educational for kids and adults. We all had a great time and spent almost 4 hours there. We didn't think the food would be good but it was good with lots of choices. Burger was really good with the jalapeño and cheese roll. Grilled cheese was a hit with the kids. Everything was finished and they also make homemade pies. Great way to break up the ride between Las Vegas and California.\nShow less"], ["Reviewed August 12, 2017", 5.0, "A Great Stop", "I grew up going to Calico, my husband had never been. We decided to stop on our way back to Arizona from San Diego. We got there about 2:30. Everything but the school house was open. There was filming in the school. The town is still a good look into what a historical mining town would look like. Yes everything is extra, but that is stated on every single page on their website.\nMy absolute favorite change is the addition of the upper parking lot. No more hoofing it up those God Awful stairs! If you want an authentic look at history, make the stop.\nYes the buildings have shops selling things. The town was donated to San Bernardino County in 1967. I doubt the county is interested in maintaining the town without income. $8 a person is not going to keep a place like that alive.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Planned it right!", "We arrived about an hour and a half before closing. It was about 104 degrees out and the lady at the gate actually let us in waiving the entrance fee. We drove all the way up and parked. Began walking towards the town. I stopped in the information building and the lady gave me history on the original buildings in town and the must sees! Our time was maximized, toured the town, paid $3 pp to go down a mine tour and took many pictures from scenic points in the town. This isn't a place for everyone, but if you like western history of the US then this is a must see for you. Please ask questions if you have any! Photo shows town in the background!\nShow less"], ["Reviewed August 3, 2017", 5.0, "Coming like a Ghost Town", "It is fun..not perfect..what is?..we stayed in the campground in our motorhome..in fact...we are here now...the history of this mine is interesting...and it is fun to walk around...it is a bit like old Knotts Berry farm was many years ago...Not crowded today...Mr. Knott did a great thing by keeping a bit of history alive..they have many shops to purchase stuff...how else can this place survive..?..all the workers and staff were friendly..the train ride and others things all cost a bit extra...we spent $4.50 each for a ride..that's ok...it was fun..I lost my man card to a wine spritzer. ..instead of a beer...it was 5 bucks well spent...and refreshing..in fact we bought an extra and split it.\n..so...like all tourist spots...the snacks are pricy. ..we came late yesterday and ate down the road at Peggy Sues 50s diner..that was good...we were just driving around like desert rats so we thought we would stop...I just retired. ..so we have the time to hang out a bit...they wanted quarters for the shower...so instead of taking one in the shower place...I took one in my motorhome...campground is quiet...and clean...I am glad they saved this place...it's fun.\nShow less"], ["Reviewed August 3, 2017", 2.0, "waste of time", "paid to get in (although not expensive 40 dollars for the 4 of us ...but when you get in there, everything was extra ! the mine self guided tour, the train ride, and a few other things also had to be paid for ...also the little buildings were ALL selling things ...i did not go to go shopping .... nothing seemed original and staff in the shops were quite unwelcoming it was all based on what they could sell and make more money at ...ended up an expensive day for the 4 of us .....also they were filming so some of it was cut off to us ! would not advise going\nShow less"], ["Reviewed August 3, 2017", 3.0, "Over priced", "We travelled a long way to see this. They charge you to get in and then charge you to see every tour including the small train! I just think they should charge u for breathing then all would be complete. Wouldn't reccomend it, over priced tourist trap with only a small part of history advertised.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Road trip", "Loved it can't wait to go back when we have more time. 1hr is not enough, kids loved it!!!! I loved it"], ["Reviewed July 14, 2017", 2.0, "Expensive and hardly original", "The park harbors several independent freelancers that charge extra on top of the main entrance fee of $8 pp. There does not seem to be a structured organization. There are some attractions such as a self guided mine tour and a train, but they cost extra.\n\nA few buildings have original elements but most are props or \"rebuild\". Many structures have shops with crafts seemingly unrelated to the ghost town. There is a small exhibition that can be visited for free, but it is not too elaborate. Think paper clippings, an old egg beaters and old wooden cabinets.\nShow less"], ["Reviewed July 12, 2017", 1.0, "Skip It", "I came here because I am a fan of older historic places but I got here and not only found myself paying $8 per person but also a put together city that exploits tourists with shops. I mean after all it is owned by knotts berry farm . I just see it as a cash grab, low budget theme park. I would find something else to spend the money on.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great Addition to Itinerary", "Leaving Death Valley we visited a true ghost town! In 2012 Ballarat had only one remaining inhabitant! The jail/morgue doubles as a hotel \"when vacant\".\n\nBallarat was reality. Calico is a historically (to the point practical) accurate restoration undertaken by Walter Knott [yes, of the Berry Farm family] in the 1950s of the mining town.\n\nCalico was very entertaining - be sure to find the Bottle House.\nShow less"], ["Reviewed July 1, 2017", 5.0, "Fun and friendly stop", "We stopped here on the way to Sequoia NP and it was too cute. Lots of friendly people and interesting history of the town. I have 2 boys that ate it up. We went in the,morning so it wasn't terribly hot, but still drank lots of water. You have to pay extra for the activities, but not much-$3 for mine tour, $3 for gold panning, $3 for a mystery shack tour (optical illusions). Cool place to visit and only 3 miles off the interstate. Camping available as well as group tours. Ghost tours at night.\nShow less"], ["Reviewed June 29, 2017", 1.0, "very disappointing", "Visited Calico many years ago and couldn't wait to return with kids - very disappointed - buildings while authentic I think were all just shops selling imported souvenirs - the few displays were very dusty and hard to see due to scratched and dirty windows. Paid to do the three activities gold panning - not bad / mine walk - wast of time discovered booklet that would have explained everything after left not offered on entry - display in mine shop was all broken / the fun house was stupid - all in all I was very disappointed\nShow less"], ["Reviewed June 26, 2017", 4.0, "Calico ghost town", "On route to Las Vegas we did a detour to calico ghost town . We were welcomed by the town sheriff on arrival . This is an old silver mining town and the buildings gives you a feeling of the old Wild West and how they lived . Good for adults and kids alike.\nShow less"], ["Reviewed June 25, 2017", 4.0, "Glad we stopped in to check it out!", "This was a pit stop on our way to Vegas. We went on June 19th, 2017 during one of the hottest days they've experienced. (117 degrees - 1pm) By the time we went in all the little shops and museums, we were fried and had no energy left to do any of the tours. We didn't eat at the restaurant on site because we wanted to try Peggy Sue's Diner down the road. (glad we did!!) For only $8 each adult, it was a nice little bit of history to check out!\nShow less"], ["Reviewed June 24, 2017", 4.0, "Well worth a visit", "Like many other reviews, we used the Calico Ghost Town as a pit stop on the way to Vegas. We were not disappointed. This was the perfect place to wind down for a couple of hours, nice little shops, plenty of history, lots of little places to have a poke around and some stunning views.\nIf you're passing by you really should drop in, and even if it's a couple of hours out of your way I'd say it's worth the trip.\nShow less"], ["Reviewed June 23, 2017", 4.0, "Private after hours Ghost Tour", "A group of friends and I went on a private ghost tour of maggie mine. Our tour guide was Philip. The tour was awesome and Philip was a wonderful host/guide and his knowledge of the town and of the mine and paranormal activity was thoroughly entertaining. He was never boring and always interesting. It was alot of fun seeing the mine. Can't wait to come back for the other ghost tours that are offered (schoolhouse and main street). Haven't been to calico during business hours. But after seeing the town I cannot wait to go back! Thanks guys!\nShow less"], ["Reviewed June 21, 2017", 4.0, "Our favorite Ghost Town", "We've been here many times in the past. And we've gone there once again on June 13,2017. Cute little shops. You do have to pay extra for the train ride or mine tour. It's interesting to see the old buildings & museums. Only problem we had was that there were lots of small annoying flies. I heard that last year they had a problem with bees. One thing I miss that they used to have was the old time theater where they put on cheezy(but fun) plays. The whole place is completely gone. I like the rock & mineral shop.\nShow less"], ["Reviewed June 8, 2017", 5.0, "On the road", "A great stop off on the road, we got meet by the Marshall Okay, very accessible but there's a slope going upwards to the top of the town. This is a old silver town with original building a small mine to visit and a little railway. Plenty of shops with great goods on sale. So glad we paid a visit.\nShow less"], ["Reviewed June 8, 2017", 5.0, "A Great Ghost Town", "When visiting this place you feel like you are back in time, It also has a RailRoad in the town. It has buildings you can walk through that are off the wall"], ["Reviewed June 8, 2017", 3.0, "Trip to CA day 11", "A bit of history, within a small mining town.\nInteresting but a bit of a tourist trap.\nI enjoyed the history and kept wondering how people ended up there. It's in the desert so it can be hot. Be sure to wear good shoes as you walk in uneven trails.\nSome shops selling: sweets, leather, crafts, wood toys and a restaurant and cafe.\nShow less"], ["Reviewed June 6, 2017", 4.0, "worth the side trip for sure!!!", "while driving by countless of times past the Calico Ghost town sign off the 15 fwy we decided to stop by and take a look see and we sure were glad we did!!! It' a cool place to see some of the remaining old buildings and there's some places selling food and refreshments.....there's also 4 wheel driving around the surrounding areas so that's an additional plus!!!\nShow less"], ["Reviewed June 3, 2017", 4.0, "Updated Review", "We had been to Calico in September/October of 2016 during Calico Days, and were less than impressed. A friend of mine suggested we try again today, and I'm glad we decided to go. We arrived at the park at around 9 a.m., or a little after. After looking at the admission prices, it turned out to be cheaper to purchase an annual pass for $50 than to pay the individual admission prices (I think it's $8 for 12 and up, and $5 for 11 and under, but I may be incorrect there). The only issue I have with the season pass is that it is only good for a family of four, and we are a family of 6, so that means we'll still have to pay regular admission prices for two people on any return trips.\nThis time around, there was virtually no one at the park. No crowds, no long staircase climb from the lower parking lot. Fantastic! We were able to wander from building to building and actually go in all of the stores without feeling crowded. I think R&D Fossil and Rock shop is probably my favorite store in the park. They have some really neat rock specimens for those who like those kinds of things. I did notice that most of the shops and buildings are dog friendly, so it's possible to bring your dog along. I should also note that in the high desert it gets brutally hot in the summer months. Make sure you wear appropriate sun attire, sunscreen, etc. Bring water, and if you decide to bring your dog, keep in mind that the pavement here gets extremely hot and can burn your pet's paws.\n\nBecause the park was not overcrowded on this trip, we were able to eat at the main restaurant in the park for lunch. When we came in, there were few other patrons and we were able to pick where we wanted to sit. Our server was quick and attentive. Food here consists of typical burger-type staples, some BBQ, and a few fish items. All of the kids in our party seemed satisfied with their meals. Drinks here are served in HUGE quart-sized mason jars. Overall the food and service were good, and it was great to be able to eat inside out of the heat of the day. As we finished our meal, a large tour group arrived and filled up the restaurant, so keep an eye on the tour groups when planning meals at the park. I did also notice that the restaurant is open an hour before the main park for breakfast, so we may have to give that a try next time.\n\nThis was a much better and more relaxed experience than our first visit. We spent a couple of hours in the park, and will probably return again.\nShow less"], ["Reviewed May 31, 2017", 5.0, "A Must if in the Area", "This was a fun experience. Definitely a must if in the area. We were there for about 3 hours and took the tours. Calico has a similar house like the Mystery Spot in Big Sur, I think in Calico its called the Magic Spot. You have to go in there, very entertaining. We also went into the campground because I heard there are mining tunnels you can go into. We found them and they were fun too. See pic\nShow less"], ["Reviewed May 30, 2017", 5.0, "loved gost town it was the best thing i had the best time", "well it was awsome and great and fun they had great show had a great time with the gost tor our torest was briget"], ["Reviewed May 30, 2017", 5.0, "Loved it", "We loved our day at calico ghost town. We visited in May and so it wasn't too busy. The entry fee to get in (about 15 dollars for a couple) seems reasonable and then you can choose how much you want to spend when you get in depending on what you want to do. We went down the mine and went on the train, which was great fun. Lunch was good too and good value and there are some nice souvenir shops. It's a fab way to spend a few hours and get an insight into what towns like that would have been like.\nShow less"], ["Reviewed May 20, 2017", 5.0, "Awesome", "We enjoyed the day, learning the history of the town. Lots of areas to sit and people watch. Fun for the kids."], ["Reviewed May 17, 2017", 5.0, "Fun time", "Stopped on the way to vagas with 3 grandkids they loved it nice shops selling candles dream catchers train ride worth stopping"], ["Reviewed May 16, 2017", 4.0, "A nice stop on the way to Vegas", "This was a nice afternoon visit. We had lunch here at the main restaurant. There are pots of unshelled peanuts on the tables to eat whilst waiting for food. The floor is strewn with the shells which gives an authentic vibe. The interesting parts for me were the buildings which told the history of the old mining town. The shops I have to say left a lot to be desired and could be full of more interesting things to buy. We may have visited before things opened properly for the summer season (April) and therefore many things were not open (like some drink or food stands along the main thoroughfare....and there were not many staff in period attire. Many years ago it must have been very popular as there is a room full of pictures of past actor/theatre folk that had put on regular shows. There is a train for the kids to do on and other activities that would keep the little ones entertained. All in all a nice relaxing break for an afternoon. There is a mobility car parking area. Also an RV camping area which appeared to be very popular when we visited....a steady stream were going in all the time.\nShow less"], ["Reviewed May 11, 2017", 4.0, "Quick stop from Vegas to California.", "Holidaying with the family from Australia, we stopped here for a quick look on our way back from Vegas going back to California. Won't take you long to see everything and is reasonably priced to get in , $8 per adult and $5 per child. Worth a quick stop and a bite to eat if you are taking this drive.\nShow less"], ["Reviewed May 7, 2017", 5.0, "California and the Golden West Titan Holidays", "We crossed the Mojave Desert and stopped at Calico Ghost Town for a few hours on our 16 day trip around California, it is a very interesting little place, a reconstructed mining town you could board a little train to see the sights, lots of little quaint shops to pop in and out of, and a good restaurant for food and drinks along with a bar, very interesting little place with a lot of history.\nShow less"], ["Reviewed May 4, 2017", 3.0, "Fun Visit", "We finally stopped at Calico Ghost Town on one of our road trips. We had our dogs with us so we were limited on what we could do but it is a cute place. If you have been to Knott's Berry Farm's ghost town, this is a bigger version. Nice little shops and a pretty good lunch. It would be great with kids. Lots of walking in the dirt so be prepared for that.\nShow less"], ["Reviewed May 3, 2017", 4.0, "A great place to visit", "If you are getting to Las Vegas from California then I would suggest you do a pit stop at Calico Ghost town.\nThey have done a marvellous job at restoring this old mining town to it's former glory, it feels like a time warp as you are transported back to the mid 19th century. There are plenty of activities to see and do, including mining and a railroad as well as museums. They have a nice restaurant with a good selection of food and drinks.\nShow less"], ["Reviewed May 2, 2017", 4.0, "Calico Mystery/History", "A mystery 4 sure! Why is this place such a hidden attraction? Location maybe, but there is a lot to learn and a history to share. A nice visit for a few hours to kick of the road dust if you need a break. Very nice people and artifacts with hand-made trinkets for purchase. Interesting for adults and kids if you like non-electronic good ol' days adventure.\nShow less"], ["Reviewed May 1, 2017", 4.0, "One day visit", "Stayed overnight in their RV park. Primitive, but all hookups worked. Fun to visit Ghost town, we did the train & mine tour. Kudos to all that work there & Knott for renovation. Met a sweet girl working at the coffee place."], ["Reviewed April 26, 2017", 4.0, "Touristy but a fun stop", "Traveling from the Bay Area it was a perfect midway stop after driving 6hours. We love camping but didn't camp at Calico this time. Calico is a great place to camp if you like off-roading as the trails are minuets away. Weather was nice in April but a little windy at times. Camping at Calio also provides free admission to the Ghost town otherwise you are paying $5-$8 per person for admission. We spent 2.5 hours at Calico, walked around and read a lot of good history. Purchased a light lunch and shopped a little. Overall the stop was fun, learned a little history and had a great time. The stop was worth it but don't really have a need to stop again unless taking people who haven't been there.\nShow less"], ["Reviewed April 21, 2017", 4.0, "Not really a ghost town.... bit of a theme park but does give you an idea of what it must have been like.....", "We got here just as the park opened - which must help you get an idea of what the town must have been like in it's heyday before the masses of tourists arived to change the ambiance.\n\nThe town is supposedly the same layout as the original mioning town - restored buildings and so on - so one can get a real idea of what the original town was like. One can walk into an old (heavily sanitised) mineshaft which is great. The original stores have been rennovated and sell, as one would imagine, period replicas and souvenirs.\n\nOK its a bit tacky and a bit disneyfied but its interesting and does give one a valuable insight into the difficult life for the miners of yesteryear.\nShow less"], ["Reviewed April 19, 2017", 4.0, "Knott's True Vision", "It was great to finally see the real town envisioned when Walter Knott created Ghost Town at Knott's Berry Farm! A lot to history to learn and fun activities, including the Mine Train, Mine Tour, Mystery House and Panning for Gold.\n\nThe restaurants have good food, but avoid non-bottled water or unsweetened iced tea. The water tastes a bit unfiltered to this spoiled city kid.\nShow less"], ["Reviewed April 19, 2017", 4.0, "Windy!", "On a breezy April day, it gets very windy in the exposed town. Loads of parking. Your entrance fee allows you to walk around the town and hillsides but you need to pay extra for any of the shops or attractions. The small train ride is informative, takes 10 minutes and costs about $4 a person. The 1000ft walk into an old mine working is about $3 a person and is well worth it. The whole place gives you an idea of how hard life would have been for the miners and their families.\nShow less"], ["Reviewed April 18, 2017", 4.0, "Something for everyone", "This is a nice place to stop off the I-15, just follow the main road towards the \"Calico\" on the hill. Nothing glamorous or anything but a nice pit stop perhaps for the older crowd in Vegas traffic, as they have restaurants...and beer. As well as an educational, learning experience for the younger ones. Our 8 year old enjoyed taking a step back in time. Laid back atmosphere, great for a picnic. More activities are an additional charge. The little ones enjoyed the mystery shack, mining for gold and Cave self walk tour. Very interesting to see the preservation of this place, although with some modern amenities. Spent about 3 hours there, would definitely go back.\nShow less"], ["Reviewed April 18, 2017", 4.0, "Intersting!", "Need little mining town/ghost town set up. Not the abandoned ghost town we were looking for but nice. The mine was interesting. The town is a cute setup. worth the admission fee to see."], ["Reviewed April 15, 2017", 3.0, "Fun afternoon stop", "Cute little attraction with a lot of gift stores. Not really a ghost town but more of a built up old west themed attraction. You pay per person to get in the entrance and then pay per attraction like the train ride and mines. Kids had fun but definitely more exciting for kids under 10.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Nice thing to do on the way to Vegas", "We went for a quick visit on our way to Las Vegas. We just missed the reenactment of the Civil War, but instead got to witness a real life argument between North and South soldiers, over parking spaces, dinner arrangements and other present day problems :-)\n\nThe kids loved roaming around and there was a lot of things going on. The ceremonial firing of the cannon was our favourite. A number of shops with more or less interesting souvenirs and quite a few eateries as well!\nShow less"], ["Reviewed April 10, 2017", 5.0, "An adventure exploring old mining town", "If you need a break to get out your car while driving to or from Vegas, this is a great place to stretch your legs for a couple of hours. We really enjoyed learning about the history of the small town. We also enjoyed the train ride and having our pictures taken with the engineer. It's $8.00 per person but was worth every penny.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Great for the kids!", "The Calico Ghost Town is a great stop off the the freeway. For around $20, you can gain entrance to the park, ride a train, tour a mine, pan for gold, hike, shop, eat, and buy a trinket. The buildings are recreated and rebuilt and 'commercial' feeling. I spent about 2 hours there. Nice paved road. Plenty of parking and not crowded during the week. Great for kids!\nShow less"], ["Reviewed April 4, 2017", 4.0, "A real replica - NO how it really was back then", "Put on your walking shoes, lots to see and do all day, try not to end up in the jail though\nThe views are great and the drive out to the town is wrong on the GPS, Just look for the big guy, you'll see what I mean. Have a great day !\nArrive in the morning as the afternoon sun could be bright and increase temperatures.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Fun little trip", "We stopped here a while back. We were late in the day arriving so the place was shutting down but we had a nice stroll and descent quick meal. Will definitely return to spend more time."], ["Reviewed April 2, 2017", 5.0, "Awesome", "Thou a very warm day - great place to visit with lots to see I must stop in don't be shy ☺️ to go the views are awesome and see how they lived back in the days"], ["Reviewed March 31, 2017", 3.0, "Worth a stop", "We were staying at the KOA site just down the road so thought we should visit.\nThere is plenty of parking.\nIt's basically an old style street of a really old mining town. You can buy stuff in the shops, eat food there in a few different restaurants and do a few other things such as walk through an old mine shaft, ride an old train around the town.\nWe enjoyed spending time there & our little one had fun too.\nWould recommend.\nShow less"], ["Reviewed March 31, 2017", 3.0, "Don't Expect History", "A completely rebuilt, modernized, Californianized version of an 1890's mining town. Lots of recreated building selling souvenirs and overpriced food, just a few authentic buildings with historical material. We stayed in the RV park in a sloping, uphill gravel site with a broken water fixture. I'm sure this is a fun place for a young family and children, but if you want history go to Bannack or Virginia City in Montana.\nShow less"], ["Reviewed March 31, 2017", 3.0, "Knott Spooky At All", "What a great hidden spot.\n\nAn actual mining ghost town dating from the 1880s, the Calico townsite was developed into an attraction by Mr. Walter Knott, the founder of Knott’s Berry Farm, so it’s knott surprising that it’s a pretty sweet place to visit. Hey, I should get paid for writing stuff like this.\n\nThe San Bernardino County now cares for Calico Ghost Town as one of its regional parks - and they are doing an excellent job of it.\n\nHilly desert country with distant snow covered mountains and an incredible nighttime blanket of pure stars overhead add to the enchantment of this historic town.\n\nThe campsites harken back to mining days with their rough rock roads and parking pads. Not too fancy but they fit perfectly into the overall theme of the ghost town. Although it appears to be just a rocky gully, many of the sites are fully serviced and have picnic tables as well as natural rock fire pits to continue the mining town lifestyle. There has been hard work done to maintain a rustic look in this modern campground. Camping options include cabins, large bunkhouses, OHV area sites, full service sites, electric only, and a fair number of unserviced / tent spots. Over 230 spots in total by my count. Central washrooms & showers round out the support services.\n\nThere is a double duty off-road vehicle area that both meets the needs of the gas-powered rock jockeys and also to agitate those folks who are searching for desert peace & quiet. This area is located at the park entrance so is a good distance from the quieter folks so no noise or dust issues were noted during our stay.\n\nThe Ghost Town is located up the hill from the campgrounds so is a good warmup for your walking adventure.\n\nThere are 31 main structures and 5 of these are historical Calico mining town buildings. The town offers almost every option imaginable ranging from Boot & Saddle Repair to wood carvings. I’m also happy to add that there are also 3 vendors of cold beer which are strategically spread among the other fascinating businesses. Needless to say, I set my walking pace to correspond with the spacing of these beverage sources but only to ensure that I did not become dehydrated from the dry desert air. Safety first is my primary motto while cold beer is a strong second.\n\nThe shops are all old-timer with some housed in original buildings. Lots of tourist trap silliness as would be expected as well as some cranky folks who really don't want to be working there. Amongst the normal highway sideshow trappings are some excellent bits of work by local artists as well as some characters who add color to the town theme, and even some excellent service people who clearly have found a job they enjoy and don't mind spreading that sunshine with their customers.\n\nIn addition to the gift shops, there are a number of food vendors that were surprisingly average. Not sure why we expected anything different but the unique location seemed to demand unique food experiences.\n\nSome excellent mini-museums that displayed the early and developing days of Calico, the arts and sciences involved in mining the various minerals in the area, and examples of homelike in an 1880 mining community.\n\nWe visited mid-week to avoid busy weekend crowds but there was a surprising number of foreign and domestic visitors that made the Main Street quite lively.\n\nWe didn't get a chance to check out the tiny railroad because it was exceptionally windy during our visit and the train was shut down. A little while later, the entire town was closed down due to the danger of flying shingles, garbage containers, and small children.\n\nPrices are high but as expected in this out of the way place.\nShow less"], ["Reviewed March 26, 2017", 5.0, "Great way to spend a couple hours", "We were staying in Barstow a few days and decided to wander just down the road from our KOA and visit Calico Ghost Town. We thoroughly enjoyed the few hours we spent there seeing how things were back 127 years ago. There was an 8 dollar charge at the booth upon entering then another 4.50 per person for the little train ride and another charge to enter the mine. I didn't do the mine tour so I can not quote a price for that. There were a number of restaurants that sold food and alcohol for those who wished to indulge. Overall, it was a fun time and I would recommend stopping by.\nShow less"], ["Reviewed March 23, 2017", 5.0, "Pit stop", "Stumbled upon this Ghost Town on way to LA from Vegas. Saw the entire place in just over an hour. Paid to get in at the guard shack, and once inside had to pay additionally for the train ride and also for a short walk through a mine tunnel. Should be included in price since after all, why else would you stop at a mining Ghost Town?? Duh - to see the mine. Was worth it, cute little place.\nShow less"], ["Reviewed March 20, 2017", 4.0, "Fun day but several things still closed", "We'd been 10 years ago to the week & it's largely the same. A few of the buildings are part built of the original structures, many are re-built as replicas of how they used to be. Some are now shops selling souvenirs & trinkets at fairly reasonable prices, several aren't open at all, we weren't sure if they will be during peak season. There are a couple of restaurants/cafes which again have reasonable prices & good service. The little train ride lasts 8 minutes, shows you around the other side of a hill to the bit you otherwise see & is a cheap & cheerful break to wandering about in the heat. Sadly there is a lack of much information about the place really, it's not as much a museum as an attraction & could do with more signage & info to tell you about the olden days. Still well worth a visit if you are out that way.\nShow less"], ["Reviewed March 14, 2017", 3.0, "Price seems good until you add it all up", "This on the face of it seems like a nice little detour on the way back from Las Vegas. You pay your $8 per adult to get in and for that you get well nothing. You get to look in shops and take in the ambiance of the area.\n\nIf you want to take part in anything else its further money.\n\nNow I agree its lovely to see them keeping this place going. And you can see that improvements have been made. But keep the price real.\n\nGreat views, great stop off place but bit pricey.\nShow less"], ["Reviewed March 12, 2017", 5.0, "Great stop on the Way to Vegas", "Calico is exactly what I expected a \"Ghost Town\" experience tom be. It is more of a recreation of a town but is full of interesting shops with a bit of history thrown in. The little mine tour is well worth it and the place is suitable for the whole family. If you want authentic, falling down buildings and tumbleweeds - this aint it. If you want a \"theme park\" style experience of an old silver mine with modern conveniences - this is perfect.\nShow less"], ["Reviewed February 19, 2017", 3.0, "Ghost town attraction", "Calico Ghost Town is more of a ghost town attraction/theme park than a real ghost town. If you're expecting an authentic ghost town like Bodie you'll badly disappointing. But it's not all bad. It's still interesting and can be fun for the kids."], ["Reviewed February 15, 2017", 4.0, "Ok", "After paying 8 dollars for each adult to get in all the attractions you had to pay to go on them including the train. The pizza we had was good,"], ["Reviewed February 11, 2017", 4.0, "Interesting, worth a visit on purpose or detour from your route", "In the original location of a once silver mining town, now restored to 'almost' original design, Calico is more a small theme park than an original old town, but it is worth the visit.\nRailroad trip is good to have a panoramic view of town, and with some imagination, figuring out how was it in XIX Century.\nIt is also worth visiting the school.\nPeople is very friendly.\nShow less"], ["Reviewed January 24, 2017", 5.0, "Fun", "This ghost town is very informative along with entertaining. We ate at the restaurant which was very good. The Maggie Mine Tour was interesting and fun. We had enjoyed wondering the streets, reading the history, and seeing all the historical buildings and furniture. I would definitely come here again.\nShow less"], ["Reviewed January 21, 2017", 4.0, "Not authentic enough, but still interesting to see", "Admission is about $12 USD. We were expecting to see the village in its original state. However, most of the buildings have been turned into tourist shops and traps and renovated, so it's hard to tell what they would have been like inside. You can walk into one home and it's mostly been left alone, so that's cool. A walk through one of the mines is another $3 or so. It was interesting enough for $3 but not amazing. We went in winter and there weren't too many people there. However, judging by the amount of parking they have available I think it would be a tourist trap nightmare in summer, full of tour buses.\nShow less"], ["Reviewed January 15, 2017", 3.0, "I didn't think it was possible to commercialize a ghost town", "When our first activity of the day fell through we decided to go to Calico Ghost town as recommended by the owner of the motel we were staying at. Most of the town is reconstructed and filled with shops. You pay $8 to enter the ghost town but all you get for that is the opportunity to walk through it. If you want to go in the wacky house, on a mine tour or on the train you have to pay for them. They had the town decorated with antique things which were interesting and there was a good view from the outlook on top of the hill. I just got the feeling that they wanted to make us part with as much money as possible.\nShow less"], ["Reviewed January 11, 2017", 4.0, "Stepping Back to 1881!", "We stopped on a trip from California to Vegas -- expected to stay for an hour. We were there for almost three hours and even had lunch at the Calico Restaurant. It was very well done -- with builidngs were either restored or built to look like 1881. Many were turned in to shops but still kept the character of the period. We took the additional walking tour through the mine ($3/each in addition to the $8/each admission). It was lot of fun.\nShow less"], ["Reviewed January 5, 2017", 5.0, "Nice clean.", "Not too much to do, but is only costs a few bucks to get in it includes parking it's about the price of a movie ticket. The place is nice and clean. Walter Knott bought the place. It has the same feel Knott's Berry Farm had years ago. Worth a few hours of your time.\nShow less"], ["Reviewed January 4, 2017", 4.0, "I Ain't Afraid of No Ghosts!", "A friend asked me why I would visit a ghost town. \"Isn't a ghost town called a ghost town because it has disappeared?\" And in many cases. that is true. But in this case Walter Knott (of Knott's Berry Farm) saved Calico. Calico has been \"recreated\" from photographs and reports of old timers. The town burned to the ground at least twice, so it is hard to pin-point exactly what Calico may have looked like with 2000 miners. Now it is full of shops, restaurants, and attractions. For a little history, take the eight minute train ride or tour the mine in town. For a beverage, stop by the saloon. For some geology, stop by the rock shop. Or visit the old school house.\n\nBut don't expect to see a boarded up abandoned mining town. If that is what you are looking for, drive to some of the ghost towns near Death Valley or Bodie State Park.\n\nSince Calico is only a few miles off I-15 it gets a lot of tourists, many from foreign countries. My wife and I sat on a bench and did a little \"people watching.\" As they say, a little something for everyone.\nShow less"], ["Reviewed January 4, 2017", 5.0, "A Side Trip Worth Making", "A quaint little wild west mining town well worth the visit on your drive to or from Las Vegas. Purchased by the Knott family in the 50's, this is the inspiration for the Ghost Town in Knott's Berry Farm in Buena Park, CA. Admission is only $8 per person making it a very good value.\nShow less"], ["Reviewed January 1, 2017", 4.0, "Interesting Bit of History", "Great little price of history. Train ride fairly short. Location pretty touristy. Enjoyed the Mystery House. Great view of the valley"], ["Reviewed December 31, 2016", 4.0, "Nice short outing", "Interesting bits of history; breathtaking views of the valley from above; not much to do (unlike Tombstone). The train ride was short but definitely interesting.\nWe did not eat there, but the restaurant looked inviting.\nLots of little shops for souvenirs\nDon't spend more than a couple of hours\nShow less"], ["Reviewed December 27, 2016", 5.0, "Must see", "Fantastic place to visit! We popped on here on our way to Vegas and had fun exploring the town... even though it was technically shut for the day we could still get out and see all the different shops and houses."], ["Reviewed December 26, 2016", 4.0, "Ghost Town Halloween", "We visited Calico Halloween 2016. They certainly go all out to make the Halloween experience great with all of the attractions done up and the staff in appropriate costume.\nThe town is interesting and it was transformed for Halloween. We enjoyed our visit very much and it was very well done with attractions and entertainment but we were unaware it was going to be set up for Halloween. As this was our only opportunity to visit it would have been good to see it without the theme.\nI would suggest that if you are going to visit you check if it is set up for holidays so you understand how it is set up.\nShow less"], ["Reviewed December 18, 2016", 3.0, "See once", "Worth to see once with adults or kids. Well preserved and the intent is good. I wouldn't say it was solely a tourist trap because there is a good history to this area. Go see it and you won't be dissapointed if you only see it once.\nShow less"], ["Reviewed December 11, 2016", 3.0, "Ok on a slow afternoon", "Driving from Vegas to L.A. we got a little bored and decided to stop at Calico for some unique diversion. My wife had never seen an old west ghost town before and I had somehow avoided this old tourist trap, er, I mean roadside attraction, in all my years, so we were both curious.\n\nAfter the hefty parking fee, I figured we would get our moneys worth at least in photo ops and history. Few of the regular operations were running that day. No stagecoach, no gunfights. Only the mini train and the mine tour. About half the shoppes were open with minimal staffing. There is a glaring lack of an old west saloon!\n\nI am no expert, but much of the town looked rebuilt in modern times, and I suppose some horses and a dirt on the main street might have enhanced the illusion. The clue to Calicos reincarnation and inspiration may be that statue of Knott.\n\nWe had an interesting half hour wander, bought some rock candy and got back on the road somewhat refreshed and a bit lighter in dough.\n\nIf you are a western fan, or have young kids, it might be worth a quick stop. But otherwise, it was just okay as an attraction.\nShow less"], ["Reviewed December 7, 2016", 4.0, "NICE STOP", "We were really enjoying taking our time wandering in and out of the shops and looking around. Then 3 buses with kids arrived and 2 tour buses. It quickly became hectic and we didn't even get to do the mine tour before it started getting really hot. Will have to go back again another time.\nShow less"], ["Reviewed December 2, 2016", 3.0, "Surprisingly Built-Out Attraction", "We stopped by the ghost town to break up our drive to the Grand Canyon from CA and were pleasantly surprised at how large of an attraction this was. The best part of the visit was actually going into one of the mines. A definite must if you stop in. There were a lot of gift shops and dining areas to stop by, but most likely were shuttered due to our off-season visit or perhaps low visitation in recent times. Lots of fun photo opportunities and a nice reprieve from the road. Bring a jacket as it gets pretty windy on the hill.\nShow less"], ["Reviewed November 27, 2016", 3.0, "Hot as hell!", "Really interesting place if you concider that people was really living and working here. Worth a quick stop."], ["Reviewed November 26, 2016", 5.0, "Like being in a an old cowboy film set", "Brilliantly preserved old silver mining town complete with Saloon, canteen, Sheriff's office and Jailhouse. There are old silver mine workings and machinery and a steam train. The whole town is steeped in history, very picturesque and interesting well worth a visit."], ["Reviewed November 24, 2016", 5.0, "Family fun, would recommend", "We accidentally came across Calico on our way back to Vegas from Barstow; we were looking for a souvenir shop. Had to call them for directions because the gps was wrong, but it was easy find. The $8 adult entrance fee is very reasonable for all of the things to see and do. Our teenagers had tons of fun taking pictures in the mountain. It was windy when we went, but full sunshine and I was comfortable in shorts, a cardigan, and walking shoes with good traction. We didn't get a chance to eat at the restaurant, but snacks at the sweet shop were decent. I wouldn't suggest getting Starbucks there because it was just ok.\nShow less"], ["Reviewed November 20, 2016", 5.0, "Fun day steeped in history", "Calico is a great way to spend a day. You can see the whole town in a day and enjoy it. This area was known for silver mines, and Calico was one of the towns that sprang up due to the silver mining. This is a restored mining town (twice there was a fire that destroyed the original buildings) and there is a lot of interesting history to learn, set up against the mountains. Admission gets you into the town, and there are four things that have a small additional cost ( the short train ride, the Maggie Mine, panning for gold, and the mystery shack) Cost for these activities are cheap, it was $3 for the mine and $4 for the train ride. The walk through the mine is short, but interesting to see how they mined and even lived underground. The train ride allows you to see more of the landscape and gives you some additional town history. Both are worth the extra cost.\n\nThey have several buildings to look at, and many shops. The town is on a hill, so you will be walking up an incline to get to the upper parts of the town but there are plenty of places to stop and rest if you are with somebody who needs to.\n\nGive yourself about 4-5 hours to do the town and you will be able to cover everything, including the cemetery at the base, near the entrance.\nShow less"], ["Reviewed November 20, 2016", 5.0, "Fab", "We visited on our way back from Vegas to San Diego.\nThe town was so much bigger than we thought and what a lot to see.\nDefinitely worth a visit for people of all ages.\nShops and all sorts there. So glad we decided to stop and got some brilliant photos too.\nShow less"], ["Reviewed November 18, 2016", 5.0, "Old Cali Mining Town.", "Just up a road from Peggy Sue's Diner is an old ghost town. There are signs leading the way.Make sure you bring a camera the scenery is quite nice all around, for the Holloween season they had all kinds of spookey characters: witches, ghosts, an invisable horse driving a wagon with a coffin, also aliens!\nThere's a General Country store, gift shops, restaurant, and ice cream place.\nThe town displays what the mining town was like when it was once flourishing. When the mines dried up, the population left too.\nShow less"], ["Reviewed November 14, 2016", 5.0, "Interesting Story and Amazing Silver Find!", "The facilities are well kept and maintained. The story is very interesting as is walking though the mines. Be sure to check out the massive silver deposit that is worth quite a few million dollars."], ["Reviewed November 11, 2016", 4.0, "Replica of an old silver mining town", "This is a replica of the town of Calico that was a bustling silver mining town in the late 1800s. Walter Knott, who built Knott's Berry Farm also built ithis, so it is a bit commercial. Still it is fun for kids to see what life was like in the late 1800s.\nThere are some attractions like the short railroad ride that require and additional fee.\nThere are supposedly some \"ghosts\" at the property that you might run into around the town.\nPlenty of shops and restaurants.\nBe prepared for bus loads of tourists at times.\nShow less"], ["Reviewed November 7, 2016", 3.0, "Old west style town", "This ghost town is out in the middle of nowhere and of course has a very interesting landscape. Plan on several hours and try to do it when it's not so hot because it requires a lot of walking and climbing."], ["Reviewed November 2, 2016", 5.0, "A Great Break on I-15 through Mojave Desert!", "We 5 adults just visited this ghost town yesterday. It was a fun break, and we love historical places. It was all decorated for Halloween. Nice gift shops and mine tour/short railroad ride available. Just a very short drive off the interstate. Very scenic place with friendly people.\nShow less"], ["Reviewed November 2, 2016", 4.0, "Interesting visit", "However I wouldn't have cry if I would have missed it. Just an old western set-up. There are a few attractions but you have to pay extra for it...."], ["Reviewed November 1, 2016", 5.0, "Excellent tourist attraction", "This was our second visit and enjoyed it just as much second time round. The atmosphere was good as it was close to Halloween. The experience is good for all ages and there is lots to see. Well worth a visit."], ["Reviewed October 29, 2016", 4.0, "Like Western?", "Not that many old Western style town on California to see how was old Western style house look like...this place is small town left in Mojave desert..drive by on the way to las vegas .. family fun experience."], ["Reviewed October 28, 2016", 4.0, "Off the beaten track but worth a diversion", "A well restored old mining town in the old West. Some great shops and Native American artefacts for sale. A bit commercial but the little steam train looked awesome and there is also a tour through the old silver mine. As a bonus there is a camp-site close by which is much nicer than the nearly KOA in Barstow which is right on the interstate and very noisy.\nShow less"], ["Reviewed October 27, 2016", 4.0, "Good pit stop", "We stopped here on our drive between Vegas and LA. It was not quite what we were expecting as it is quite commercialised but still we enjoyed it for an hour.\n\nThe train tour was worth the additional fee as showed and talked about history of the town.\n\nAll staff friendly and our daughter liked the addition of the Halloween decorations and spirit.\n\nWorth a pit stop on your road trip!\nShow less"], ["Reviewed October 27, 2016", 3.0, "Looks like a Hollywood set", "I suppose I expected a quiet, abandoned town but found tourist shops, busloads of tourists and buildings that looked appropriate on a Hollywood set. I stopped by to stretch my legs and kids would find it interesting on how they used to mine silver."], ["Reviewed October 22, 2016", 3.0, "Hokey", "Not sure what I expected, but this was not it. Some history provided of the site, but did not find any other references to \"ghosts\" or haunted buildings. There were extra fees to ride their train or go in their mine over and above entrance fee, which was nominal. All of the buildings were gift shops or eating places. Probably good to give children a sense of what an old time, western mining town was like.\nShow less"], ["Reviewed October 21, 2016", 3.0, "Worth a quick stop on the way from LA to Vegas", "Visited here on the way to Vegas from Barstow. It wasn't too much of a detour off the freeway - only about 5 minutes or so. It cost $5 each to get in and there was plenty of parking. We spent about half an hour or so here. We could have spent longer here if we'd gone on the train etc but this was enough to get a feel for the place. Make sure you go up to the look out point as you get a good view of the town from here.\nThe staff that worked here were really friendly. It is quiet tourist-y but it's worth a visit if you have time and are passing by.\nShow less"], ["Reviewed October 20, 2016", 2.0, "Awful place", "Shoot me now I almost shouted, when I in the corner of my eye saw this \"sheriff\" in his best masquerade costume, and choked. This is an really tourist trap and as its now almost Halloween. Filled with skeletons and witches and what not of tacky extras! Just an really tacky place\nShow less"], ["Reviewed October 18, 2016", 5.0, "FUN BUT COMMERCIALIZED RECREATION OF AN OLD MINING TOWN", "Calico Ghost Town appeals to the kid in of us dreaming of the Old West and the long-gone era of silver mining. Calico Ghost Town was created by Walter Knott (of Knott's Berry Farm to recreate a long gone era and then donated to the County of San Bernardino.\n\nIt is a fun stop on your way to or from Las Vegas/Los Angeles. Just 4 miles off the freeway, you can spend visit a stylized recreation of an Old West town. I was told that only 5 of the buildings are original. The rest are reconstructions. Although the paved road through the town does lessen the authenticity but it is still fun to walk around and imagine the past.\n\nOne could argue that you are paying an $8 admission fee for the privilege of shopping. Most of the buildings now house shops and restaurants. I did go crazy for the Fossil and Rock shop. For $19, you can see and experience all the attractions.\n($8 adult admission, $4 train ride, and $7 for the combo ticket for the Mystery Shack, Gold panning and a walk through the Maggie Mine).\n\nThe attractions can be silly fun at times. The Mystery Shack is pure camp as you walk through a shack that was built at an angle--not for those with physical disabilities or vertigo. The Maggie Mine is an easy walk through a now tourist-friendly mine. Learn to pan for gold and keep the fool's gold you find. The short ride on a small train with a historical commentary is worth the $4.\n\nWalk around the town, visit the schoolhouse and make the small climb to see some miner's shacks built into the mountain. The Ghost Town is a fun diversion but probably not a place to visit regularly. I budgeted 2 hours but probably would have liked 3 hours. Several of the small buildings house tiny museums with artifacts and information on the heyday of the mine era.\n\nCalico Ghost Town is a small scale recreation of town that existed on the very spot. It's the closest thing to an authentic Ghost Town in southern California. Go to Nevada or further north in California for the real thing. Still, Calico Ghost Town is fun and no doubt even more fun on special event days. There are camping facilities just outside the town.\n\nThe town closes at 5pm and they mean it. I noticed the shops were closing their doors a few minutes before 5. The saloon had snack treats like a slice of pizza or nachos. I stopped in at 4:45 and was told they weren't serving food.\n\nAgain, Calico Ghost Town is a fun and a change from the normal tourist places. It is very commercial but even just walking around is fun. It's worth a visit.\nShow less"], ["Reviewed October 18, 2016", 3.0, "Great stop on the way to Las Vegas", "Old silver mining town on the way to Las Vegas. Whilst many of the town's buildings were either relocated to the site or renovated by Walter Knott (of Knott's Berry Farm fame) sometime in the 1960s, a lot of the town and the old diggings are original. The Maggie mine is worth a look whilst the other attractions are really tourist traps. When we visited it was the Labor Day long weekend and were lucky enough to see a re-enactment of a shootout between a few lawmen and some cattle rustlers which our children enjoyed.\nShow less"], ["Reviewed October 16, 2016", 5.0, "If you like to camp, stay here!", "We have an RV and whenever we pass this way, we stay here to camp. You get into the Calico Ghost Town free when you stay at the campground. If you want an eerie, quiet, western feeling, don't come to the campground during the weekend - TOO CROWDED! Stay during the week. Back to the Ghost Town. Great place to walk around, cute shops, train ride, nearby cemetery. Fun and different place to spend some time.\nShow less"], ["Reviewed October 15, 2016", 4.0, "Nice stop on the road to or from Las Vegas", "The visit was very nice, good quality for price ! The town is very nice, well maintained, lots of shops and dining locations. but you have to pay extra for all extra attractions."], ["Reviewed October 11, 2016", 4.0, "A Fun Stop on the Drive from Vegas to CA", "Our family really enjoyed our time at Calico Ghost Town. They charge $10 per person to get in and then there is a small fee if you want to do the other attractions. Some folks didn't like this approach to payment but I did. My youngest didn't want to do the mine or the house of mysteries so I liked that we could pay a small fee for the attractions we wanted to do. The kids learned a lot about this old mining town and had a lot of fun!\nShow less"], ["Reviewed October 10, 2016", 3.0, "Interesting location, but.......", "We live within fairly easy driving distance of Calico, and decided to visit during Calico Days. Admission is fairly reasonable at $10 for adults and $5 for children, but that's where reasonable ends. Because it was a busy day, parking was somewhat chaotic. We were directed to a lower parking lot, but after that it was a free-for-all trying to find a space to park in the canyon. There are stairs to access the main street area, but be prepared to walk up about five to six flights of uneven stairs with handrails constructed from 2x4's. There is also a shuttle bus that goes to the upper parking area, which we elected not to wait for. The main street is set up as an old west mining town, which my children thought was really neat to see. There are only two buildings that are actually original to the town. The rest were constructed on site specifically for tourists. There were no outside food stands or anywhere available to purchase food on the go. There options were the sit-down restaurant, and a slapdash pizza shack tucked in an alleyway between two buildings. Both were overcrowded. There was a live band playing in the area of the pizza place that made hearing what was being said nearly impossible. There were several costumed role-players wandering about, which coincidentally makes it impossible to tell who works there and who just dressed up, and we did get to see a shooting show with actors in the street. One of my children was scared by the shooting noise, so keep that in mind for smaller children. There is only one \"ride\", and that is the train ride that is basically a slow 15-minute ride that gives some brief history about the mining and the town. The train ride was nice, but the line to get tickets was incredibly long, and only one staff member was selling tickets. Tickets for the train, mine shaft tour, and oddities show were a bit steep at $4 per person for each, so the train was the only thing we did because I was not about to pay $4 to do the additional activities. There were several souvenir shops, but the quality of those souvenirs was what you'd expect from a tourist trap. The fossil shop was overcrowded, and a couple of places were not wide enough for two people to pass through at the same time. Our children are slightly older, so we have no need of a stroller, but I did notice several families with little ones struggling to get around because the area is not stroller friendly at all. Outside there is very little shade, and the afternoon sun can be brutal. Overall, it was interesting to see the canyon and views of Yermo in the distance, but we will probably not be returning any time soon.\nShow less"], ["Reviewed September 30, 2016", 3.0, "Calico Ghost Tours:", "I can not find a listing exclusive to the Calico Ghost tours, so have to post the review here. I believe the owners of the tour would have to request a review of their tours in order to get a listing created. They do have a FaceBook page. There are lots of reviews for the town itself, suffice to say it is a government park now and costs $8 to get in. A tourist trap of sorts, interesting to see once.\nCalico Ghost Town has three ghost tours listed for the public to sign up for. The number to call is on the Calico Ghost Town Website and you will pick the tickets up at the bottle house next to the Maggie Mine. The ranger gives you a map when you pay the admission fee to the park. The first tour is for the Maggie Mine, the second the Schoolhouse sitting, and the third a walk up Main Street after dark. Since they walk you up Main Street anyway to get to the schoolhouse I could see no reason for doing the Main Street tour, which overlaps time wise with the schoolhouse tour, so you can only do one or the other. All of these tours are very cheap, $10 per person as of the time of this writing. Believe me, we do a lot of these and depending on how they are done you can pay six or eight times as much. The difference however with these tours as opposed to other tours is that here they permit no equipment of any kind on their tours: no K2's, Cell Sensors, Mel Meters, REM pods, Ovillus..nothing..just video and audio capture equipment. The guides told us that it was distracting on the tours and that regarding the Schoolhouse tour it was not permitted by the Park Service itself. I have no idea if that last part is truthful, but it doesn't make any difference who banned the items. What that means is that you will be left with no proof that there is or is not activity in these locations, unless you just happen to see an apparition of some kind. So here is the breakdown:\nMaggie Mine Tour: This tour starts right after the park closes so it is still light. It begins at the bottom of the hill where you park and if you leave and come back you will not have to pay the $8 to park a second time. You can tour the Maggie Mine during the day for $3, it's worth it. Not a long mine to walk through but it is underground and has been secured from cave ins. Kids would love it. The after hours tour is conducted with a guide or two (we had two) and with lights and ventilation turned off. You are given flashlights, the little generic ones that a cast a beam about twenty feet. They don't restrict you bringing your own, but you will have to carry it. I used a Coast 370 Lumins with a belt clip for easy carry. I also carried our usual IR equipped camcorder with a IR assist without the guides trying to pick on it as being \"equipment\" In fact one guide asked me what it was so I don't think they had ever seen IR in use before. As can be guessed, without equipment we had no captures, but I would recommend this tour, as $10 for an hour or more underground can't be beat. The guides told their personal stories which were good and you could tell that they had personally experienced them, which is a big plus. As far as a mere tour I recommend this tour.\nThe Schoolhouse tour: The schoolhouse is closed to human traffic during park hours the only way to see the inside is through signing up for the after hours ghost tour. Check for age limitations when you book. Again, this is a $10 tour as of the time of this writing. It begins after the Maggie Mine tour so as not to conflict with timing. It starts at the entrance to town and you are walked by flashlight up main street. The park is closed, you are the only ones in it at this time of night. Stay with your guide and use your flashlights. There are rattlesnakes in the desert area at night and they are not beyond coming onto the path although we were blessed and did not run across any. You will be walked up to the schoolhouse where the guides will give a short historical speech and then let you in and you will sit in one of the little kids chairs from the period. The only light in the schoolhouse is the one the guide has. IR, if you have it, will be desired. We were here in August, the schoolhouse is hot and luckily we sat near one of the open windows for a breeze. The stories that we were told about sightings were not first hand experiences which was a disappointment to us. This leads us to believe that perceived activity here is few and far between if it does exist at all. Again, no equipment allowed here. You will be in the schoolhouse for about half an hour or a little more as they pass out what they believe would be \"trigger objects\" of the period, but that brought out nothing. This tour was interesting, just to say that we had done it, but probably would not go back on this one again. Our videos of these tours have been posted.\nShow less"], ["Reviewed September 28, 2016", 3.0, "Tourist trap!", "We had high hopes for this place but to be honest there are about three buildings that are actually original. It's $8 entry for an adult, free parking and then additional attractions cost more. We went into the mine which was $3 a person and it was basically just a hole with a few mannequins inside.\n\nThe 'ghost town' has basically been turned into a mall. And while the candle shop was particularly great and we did spend some money in there, I really wouldn't bother going- we were told this by some Americans we met on our trip.\n\nPeggy sues diner just round the corner was a better experience!\nShow less"], ["Reviewed September 25, 2016", 4.0, "Worth the diversion", "Driving from Los Angeles to Vegas decided to take the few mile drive of the 15 to visit Calico. Worth every minute. A fairly unspoiled old town.\n\nPlenty to see in an hours walk and short train ride. Old shops, bars and a reasonable feeling of the old days. Easy walking and good for wheelchairs.\nShow less"], ["Reviewed September 24, 2016", 5.0, "Fantastic", "A real ghost town that has been kept up quite nicely! We enjoyed a train ride and panning for gold which we actually got to keep!! So much fun!"], ["Reviewed September 24, 2016", 2.0, "More than a little disappointed !", "We first visited here some 10 years ago and enjoyed the experience,however the onus has now changed and it appears that the main theme is to extract as much cash as possible from the visitors.Ten minutes walking around was enough and we left never to return.\nShow less"], ["Reviewed September 21, 2016", 3.0, "Interesting, but bring extra cash!", "I thought the ghost town was interesting and fun, although I was a little disappointed that they charged for every attraction. So, as long as you know that going in, it is a fun spot to get out of the car and walk around for a few minutes.\nShow less"], ["Reviewed September 19, 2016", 1.0, "Very disappointed- pure money grab", "Paid $26 for family of 4 to see only 5 original buildings, we were denied access to the resteraunt even though it was lunch time due to tour bus arrivals. The resteraunt is closed to non tour visitors between 10.30am and 2 pm so don't go there if you're hungry. If you wanted to tour mines you were required to pay another $3 per person to walk 100ft. All buildings were selling items, so it didn't feel deserted like what you'd expect from a real ghost town.\nShow less"], ["Reviewed September 19, 2016", 3.0, "Losing its originality", "Mixed feelings about this place, whilst the many of the original building remain, it is being spoilt by the new modern signage creeping in and ruining the authenticity and the character. The saloon is quite nice with some paintings of past characters dotted around the walls. Personally Oatman and Chloride in Arizona are a better alternative.\n\nThe Cowboy shootout is the worst piece of acting I have ever seen......really is cheesy and poor!\nYou ill need more time if you wish to do the train tours etc.\nShow less"], ["Reviewed September 18, 2016", 2.0, "More of an experience than a national park!", "I enjoy visiting the ghost towns in the Western USA and I was exciting to learn that Calico is a national park. Also I had read about activities taking place where actors dress up as residents from back then, ride through town on horses and that there even could be shoot outs. However the truth is that all you see is the old houses with newly installed stores (some of them not relevant at all) and the main street is paved so it does not feel like an old town. We meet two actors who both just walked around - no horses, no shoot outs and no old western feeling. Leaving the place a few box poorer, the only nice memory was the mining tour.\n\nIf the management of Calico reads this, then may I suggest that either you remove the entrance fee or change some of the shops into living exhibitions and reestablish the dirt road!\nShow less"], ["Reviewed September 17, 2016", 4.0, "Surprise find on road from Vegas", "This town is a reconstruction of an old west mining town from the 1880's and contains many gift shops and three places to eat and various attractions such as a mine tour , museum ,gold panning etc. When we visited it was very very hot and we had to dart in and out of the shops. Entrance is $5 and was well worth it for the curiosity of it all.\nShow less"], ["Reviewed September 15, 2016", 1.0, "Expensive, empty and fake", "I went here with some friends. It was horrible. It was 8$ each and every activity or tour costs extra. The park consisted of some houses based on some historical houses. In all those houses were shops. The houses were badly made. Airconditioning was visible on every rooftop. Empty bottles and wraps were laying around in several corners and places. We did the solo walking tour in the mine. It was 3$ each and we were done in around 10 minutes. The information given was shallow and simple. There were ugly lifesize dolls. Also here were empty bottles and wraps, under the stairs. Some stores sold nice jewelry, stones or trinkets, but everything was at least twice the usual price.\n\nConclusion: Calico was for us a big tourist trap. The park was unrefined, badly maintananced, empty, fake and expensive.\nShow less"], ["Reviewed September 14, 2016", 4.0, "Nice reconstruction", "Originally was purchased by the gentleman that owns Knoxberry farms. He then donated to the county. It is a nice reconstruction of a ghost town my only objection is that they nickel and dime you to death. Everything is extra two or 3. Five or six dollars there. Many many many gift shops. At the end of the day you need to visit\nShow less"], ["Reviewed September 13, 2016", 5.0, "Don't miss it!", "We were driving from Las Vegas to Palm Springs and saw the sign for Calico. It seemed like a good place to break our journey and it was! It is an authentic old western town, at one point in the 1800's when mining was at its peak there were over a thousand inhabitants. Today that is down to two but the town and shops are just outstanding. We went expecting to stop for half an hour but we're still there two hours later. One of the best visits we had during our holiday.\nShow less"], ["Reviewed September 9, 2016", 2.0, "Disappointed", "I was disappointed as it was really a ghost town, everything has been built on and it doesn't look old at all, it looks basically modern. In all the pictures and online it wasn't portrayed in the way it actually was. I was disappointed along with the rest of my family as we really wanted to go to a ghost town and was disappointed by this one.\nShow less"], ["Reviewed September 5, 2016", 4.0, "Worth a visit", "We had a great afternoon here, I would definitely recommend it. The town has all the amenities you would expect...bar, pharmacy, shop etc and each one is as it was when the gold prospectors left the town in the late 1800's. Its very interesting to see how people lived back then, and to learn about the gold rush. Suitable to park an RV here too.\nShow less"], ["Reviewed September 4, 2016", 5.0, "Very Authentic village", "Excellent recreation of what a western mining town was like in its heyday. Lots of different building all restored. Great photo viewpoints too. Only thing is that practically every shop was also a souvenir shop. Though a few also had more authentic souvenirs - things that people would have used. At $10 per car to park it's well worth a visit.\nShow less"], ["Reviewed August 31, 2016", 5.0, "An interesting stop!", "The town is located in the desert outside of Barstow, so it gets very hot in the summer. Bring plenty of water. This is very historical old California, Old West, so neat to visit. While the buildings are now shops, there is still plenty to see and if a person uses his or her imagination, it can be quite fun!\nShow less"], ["Reviewed August 29, 2016", 4.0, "A Ghost town......in the desert.......", "Growing up in So Cal I had always heard of Calico, but had never been there. We decided to fix that today. We drove up from the LA basin......a pretty long drive. Calico is pretty much how Walter Knott left it in 1950. Very rustic, rugged mine town in the high desert. Calico is for folks that want to see old, real, California 150 years ago. I enjoyed it.....it was 105 today and it's a tough walk.....but $8 well spent for me.\nWhile the town can be seen from a wheelchair much of it you must walk including most stores and restrooms......but it is late 1800's.\nShow less"], ["Reviewed August 27, 2016", 3.0, "Could be better!", "It was a hot... Bring water!! Travelled on I15 for years and finally stopped to see the ghost town. Was not impressed!!Town seems more focused on making money leaving more to be desired in the structures. There's a camp site which seems like it would be a good place for a summer camp. Won't be stopping again any time soon and definitely not in the summer.\nShow less"], ["Reviewed August 26, 2016", 3.0, "Average with no tour, superb with tour!", "The ghost town was easy to find and well sign posted. The cost of entry is fair.\n\nThe ghost town has a few original buildings but many buildings have been rebuilt. Interestingly a former resident bought and helped to rebuild some of the buildings exactly as they looked when the town was in use. The town is really cool to look at.\n\n\nMany of the buildings are now used for shops or restaurants - there is very little historical information available to help you learn about the town and area which is a shame. There is a Maggie Mine tour where you can pay extra, but the lady running the amusement was not very pleasant at all! Without going on the tour we would not have been able to spend much longer than an hour here.\n\nHowever, we paid $50 each to go on the tour - it was quite simply fantastic and worth every penny. Lawrence the tour guide was friendly, knowledgeable and passionate about the town and it's history - he kept us on our toes with his questions! He is the local Indiana Jones - uncovering and exploring mines all over the local area. The tour brought the town and the local area to life! We found out so many interesting facts around the town and beyond!! It was brilliant and we feel it would have been a tragedy to have come so far and missed out on the incredible history by not doing the tour. The tour of the mine was humbling and an incredible experience.\n\nIn a nut shell, if you are visiting Calico you must do the tour to unlock the secrets and history of the town that is just not available when visiting just the town itself.\n\nThank you Lawrence for an incredible experience!\nShow less"], ["Reviewed August 23, 2016", 3.0, "ONCE!!!!", "Stopped here on a drive back from Vegas. It is about 3 miles west of the 15. It can be accessed either via exit 194 or 191. After arriving you park in a large lot just outside the town. When you enter the town there is the main drag and located on either side are various souvenir and other shops hawking their wares. There is an old school house that is located a short distance away from the main town. When we were there it was not open to the public but you could look in the window. If you decide to eat here expect the prices to be a little steep. There is a little mine railroad that takes you around in a loop, horseback rides for the kids. The view from the top of the town overlooking the town and valley is great. The town is OK, we visited once but probably will not make another trip out here. Be aware this is in in the desert and does get very warm during the summer.\nShow less"], ["Reviewed August 23, 2016", 5.0, "Not a Ghost Town... but a great Tourist Attraction nonetheless", "If you are expecting a dusty thoroughfare with squeaky doors on an abandon saloon and tumbleweed you will be bitterly disappointed. Instead it is a great tourist attraction of what i presume is rebuilt replicas coupled with authentic remnants of mine shafts and basic housing. I would say for any overseas visitor this is a must stop and the $8 (Aug 2016) is well spent for one or two hours of walking around. I would think kids will find this place amazing\nShow less"], ["Reviewed August 22, 2016", 4.0, "A small relaxing place.", "We got there very close to the closing time. It was 3.30 pm and 114 degrees Fahrenheit and windy. We look around very fast and left. I was impressed with the cemetery that they have over there. We didn't get in the restaurant. To get in that town you have to pay an entrance. If you get there after 3 pm you can visit for free. It will be nice to visit that place when is cooler outside. It is worth it to see.\nShow less"], ["Reviewed August 22, 2016", 3.0, "Good for a stop over", "Not sure what we were expecting but was a little disappointed. Make sure you do the tours/train as it gives u an insight in to the old mining town. Entry price was $8 per adult and the train $4each. Good place to get out and stretch your legs.\nShow less"], ["Reviewed August 22, 2016", 5.0, "Fun", "Weird odd but fun, we were on a bus tour, m not sure if you pay money to get in, but I would not have. Cute but just not that big a deal."], ["Reviewed August 21, 2016", 4.0, "Fun and interesting", "Great quick place to stop on the road between Los Angeles and Vegas. Great small mine to visit. Great root beer floats. Friendly staff."], ["Reviewed August 19, 2016", 4.0, "See for yourself what a tough life mining was", "Very nicely restored ghost town. Reflecting daily life both in the mines and daily chores. Harshness and uncertainty in life becomes obvious and the glamour of gaining treasures is overthrown! Very good for adults and children, therefore a good family event"], ["Reviewed August 18, 2016", 4.0, "A Slice of California History", "Calico Ghost Town is located a few miles outside of Barstow, just North of the 15 Freeway. It's a reconstructed center business section of a real 1880's mining town. Several of the buildings are original. Most are authentic reproductions because the original building may have been destroyed, as by fire.\n\nThe reconstruction work was supervised by Walter Knott, of Knott's Berry Farm fame. Walter Knott donated the facility for use as a public park. Knott's Berry Farm has a similar theme in a portion of its amusement park.\n\nAlmost all of the buildings house some type of tourist-oriented business: Photo Studio, Restaurant, Gift Shop, Candle Shop, and so on.\n\nBut, if you can look past the touristy aspects, This was a real mining town that died away because of the crash in the price of silver in 1893. It's worth a visit.\nShow less"], ["Reviewed August 16, 2016", 4.0, "As expected, but still fun", "We’ve all seen these kinds of places. A little bit history, a little bit cheesy, a lot of fun. This one is one of the better ones. It is also part of the Regional Parks system, so at least it is a good cause. There is a short train ride, a mine tour, gem mining, and other activities that are not only fun, but you learn some things along the way. Some of it was a little touristy, but that also is to be expected. Walking thru the buildings and surrounding area gave the family some time to step back, slow down, and spend time actually talking to each other. Look at how life used to be compared to life today. It does get really, really hot, so be prepared for that. There are air conditioned shops along the way, so that helps and plenty of benches and such to take a break. We chose to walk up the road on one side and then down the other rather than zig zag the street. The kids (2 teens, 1 tween, 1 7 yo) really enjoyed themselves as did the adults. We wouldn’t go there every year, but since it will probably be a few years till we are back in the area, we will most likely stop in again. There is a parking area for big rigs so don’t worry about having to downsize to a regular car for the visit. We were surprised it is only open until 5:00 daily which kind of surprised us due to the excessive heat during the day. Perhaps that is a Parks thing. In any case, it is worth a stop and look see :-) I did not see a place to put the correct web address for the Ghost town in this review, so here it is: http://cms.sbcounty.gov/parks/Parks/CalicoGhostTown.aspx\nShow less"], ["Reviewed August 15, 2016", 5.0, "Historical Silver Boom Town always worth a visit", "Before you think \"Walter Knott\" built this...remember that Calico truly was an important and very successful silver producing town with well over 10 million dollars hand mined out of the miles of spider web mines. Walter Knott has a connection because his uncle John C. King co-owned the Silver King Mine with a friend...walter spent a lot of time at Calico as a young boy. He ended up buying the land much later and rebuilt some of the burned down buildings using aerial maps images of the foundations. At the same time, he removed some buildings and many artifacts from the town and transported them to the now famous, Knott's Berry Farm. He donated the town of Calico to the County of San Bernardino where it remains a Regional Park. Calico is also registered as a California Historical Landmark (Landmark #782) and in 2005, was proclaimed by then Governor Arnold Schwarzenegger to be California's Silver Rush Ghost Town.\n\nVisitors that don't take the time to learn about the people who lived there and the history of Calico, always describe the town as \"touristy\"... back in Calico's 1880s heyday, its residents all has businesses that lined the single street town...they were all there to make money in order survive...especially in that harsh environment....well the same thing applies to the modern business occupants...they are all individually owned, some merchants own more than one business...but the fact remains, they are trying to survive much like the original townsfolk who's blood, sweat, and tears, are now dust on the wind....\n\nAnyway...Calico is an interesting place to visit. The shops are all different and have something unique to offer to take home...my favorite is the Candle Shop! There are some concessions that are for fun and children love...such as \"gold panning...(even though it's a silver town), the Mystery Shack, and the narrow gauge Odessa railroad...during Festivals put on by the county there are a myriad of fun activities scheduled all day long...Calico Haunt - - the last two weekends in October are a blast and so family friendly, Calico Days is the first weekend in October and is also a great time...there are other festivals during the year to include: Civil War Days in Feb, Mothers Day, Easter/Spring Festival, and Christmas Tree Lighting/Holiday Festival...the county does its best to bring the old west flavor back to the town during these times....the rest of the year Calico depends on the few folks who volunteer their time to interact with the public. I am a member of the Calico Mountain Volunteer Gunfighters and I am also an interactive/Living Historian there as well. Follow Calico Mountain Volunteers and Victorian Muse Theatre on Facebook for current activities!\n\nDue to the rugged and rustic nature of the town and grounds, not all areas are accessible to wheelchairs...cafes/restaurants and bathrooms are located both at the top and bottom of the one street on a hill town....summer can get VERY hot...hats, umbrellas, sunscreen and long sleeve shirts are recommended...ESPECIALLY for children...I can't tell you how many times I've seen scorched babies and with parents parking their strollers with babies facing the sun...OY!!!...please don't do that!...the desert sun is very fierce even in winter!! The town is pet friendly...dogs on a leash, pick up your dog's poo..no one wants to step in it...and be very cognizant of the blistering asphalt on their paws!! There is Dorsey's Doghouse on site where you can pick up booties to protect them...but be prepared ahead of time....water is available.\n\nCome to Calico with the mindset that you are actually walking on the same land where hundreds of miners, families, and businessmen once tread as well. Sit on a bench and think about what life might have been like...reflect on the hardships and differences between our easy lives now and their day to day struggles just to survive in the harsh desert....and survive they did! We aren't living in the Old West anymore...so of course the town is going to reflect changes to current times...but I hope you will fall in love with Calico like I, and so many others have. I am not a paid endorser...just someone who loves history and volunteers hundreds of hours because I love it there and so others can learn and enjoy the town. Come see us!\nShow less"], ["Reviewed August 13, 2016", 4.0, "Interesting but touristy", "It's a great way to break up the long drive from LA to Vegas. It's pretty interesting and fun but not mind blowing. Every building was a chance to sell you a tchotchke or rock. That was my least favorite part."], ["Reviewed August 12, 2016", 4.0, "Touristy but interesting", "$8 pp gets you in and you can explore the few dozen buildings most with shops offering an array of souvenir items. I loved the candle shop the best. There are some extra attractions which require additional payment of a few dollars such as the mine, train and curiosity exhibit. The staff are dressed in Wild West outfits making the experience more fun. Top Tip : head up the main road to the top and visit the school house first, then slowly zig zag your way back down the air conditioned shops and exhibits as the temperatures soar during the day. For what it is - a couple of hours visit breaking the journey between LA and LV it is worth it, but I wouldnt make a special trip.\nShow less"], ["Reviewed August 9, 2016", 3.0, "Good place to break the journey from LA", "If you're driving from LA to Las Vegas or Arizona this is a good place to stop off for a bite to eat and a browse of the shops. It is a little gimmicky and it's not clear what is original and what's reproduction. Some things are extra such as the train ride and mine tour.\nShow less"], ["Reviewed August 4, 2016", 5.0, "Lovely!!!!", "We visited today and I loved it! It felt to me like I was in a old cowboy movie. It's full of different gift shops, I didn't manage to see them all as we were only given fm hr for the visit. I would of loved to see and read everything that was there. My favourite was fossil shop and I have treated myself to a fossil. All of the gift shops I visited were reasonably priced. My teenagers are not into history so they found the hr too long. It was very hot with limited shade, plenty of toilets and few places to eat. My son had a hot dog which was the cheapest we came across on our travels in the last 9 days and very tasty\nShow less"], ["Reviewed August 1, 2016", 4.0, "Miner for a Heart of Silver", "This was a fun stop. Great place to stretch out your legs, get a little historical and walk through some mine shafts feeling much better about the size of your office. There were all the fun gimmicky shops of classic Americana theme parks selling candy, candles and kitschy knick knacks. What more the park boasts preserved buildings, creepy mannequins acting out frontier living and a \"Glory Hole.\" Kid friendly, I swear. They seemed a little understaffed at the concession stand, but I realize we might have caught a rush during the off season.\nShow less"], ["Reviewed July 28, 2016", 4.0, "Fun place to go with kids", "Having not been here in 37 years, we stopped with kids on our way home from Las Vegas. While the cheese and nostalgia factors are great, this place is actually pretty fun. Plenty of stuff to do. Yes it's touristy, but that is part of it's charm. Remember this place was created by the Knott's family and they did a great job. Stop there for a few hours, enjoy the attractions, and have a piece of pie and some sarsaparilla.\n\nThis place is just old fashioned fun.\nShow less"], ["Reviewed July 27, 2016", 4.0, "Surprising, very interesting for history fans", "I enjoyed the fact that a broad variety of the buildings from the old west were feautured in the town and it included more than just shoot-outs at the saloon at high noon but rather tried to give you an appreciation of how people lived. The store with displays of produce from the era, the mine etc provide a good trip back in time.\n\nThe ghost town provided lots of shopping opportunities for those seeking gifts but they were not the uul items that appear at every gift store when you travel - the Indian and Leather wear store had some fairly interesting and unique items.\n\nTip: Try to arrive as close to opening as you can, you will find the crowds are less and the weather not a savage.\nShow less"], ["Reviewed July 27, 2016", 4.0, "Fascinating, Historic Ghost Town", "The Calico ghost town was extremely interesting with many different stores and attractions! The train ride was fun and the rock and leather stores were cool and had many different products. The restaurant also had good food and friendly service! I recommend a visit of this renovated, historical landmark. (P.S there was a western movie being filmed)\nShow less"], ["Reviewed July 26, 2016", 3.0, "So hot!", "Stopped off to break the journey from LA to Vegas and it was midday in July - I've only given it 3 stars because (tbh) it was such a hot day in excess of 114 deg F that it was impossible to feel comfortable walking around. I've been to other ghost towns in Arizona which were better. All the old buildings in Calico are pretty much gift shops and you pay extra for gold-panning (but this area was renowned for silver mines!) and extra for the train. You have to pay to enter but we probably didn't get good value as we only stayed for 30 a 40 mins at most due to the heat and not wanting to buy souvenirs or craft items (or food).\nShow less"], ["Reviewed July 26, 2016", 5.0, "Like Stepping Back in Time", "My boyfriend and I spent the entire day here and had an amazing time. We're both history lovers and I am a huge fan of the \"Western\" era of cowboy books and movies so it was perfect for us! We stayed in the RV park which was tidy and reasonably priced. There is no shortage of things to do or see in Calico. Lots of shops to browse, photo ops, mine tours, and riding the train was a highlight. I would love to go back and step back in time again.\nShow less"], ["Reviewed July 25, 2016", 4.0, "Too hot but great reataurant", "We stopped here on our way from LA to Las Vegas. Sadly it was 115 degrees and we didn't have the constitution to climb up to the mines. We talked to a few of the staff/volunteers and they were very friendly and informative. We retreated to the cool of the restaurant and were very pleased to find an excellent and varied menu at reasonable prices. Food portions were large so we shared two plates between four and waitress happily bought us spare plates to share our food. Would be a nicer stop in the spring or fall.\nShow less"], ["Reviewed July 25, 2016", 3.0, "Looking for Ghosts.", "Haven't been to this ghost town in 20 years. Quaint teeny weeny ghost town with history filling up their mines. You can navigate through town yourself and it's literally half a day. Loved the saloon and hotel. Don't forget to check out their cemetery too (awesome). Adventurers and ghost seeking fanatics need to check it out. Try not to go in the summer as the brutal heat might torch you. How they managed to live back in the days with all that 1800's attire, I don't know. I didn't go on their ghost tour, but I'm 100% positive it would be a scream.\nShow less"], ["Reviewed July 24, 2016", 3.0, "Kids liked it", "Exactly what you expect from a Roadside attraction. I little informative - but mainly a tourist trap. It was a fun little stop to get the kids out of the car, but I wouldn't drive too far out of the way to see it. The train ride was fun, but the mine tour was lackluster. The kids enjoyed the fun house and panning for gold - but it was hot hot hot in July.\nShow less"], ["Reviewed July 23, 2016", 4.0, "Fun Stop", "My brother and I travel with our two beagles on our vacations, so we were happy to discover that Calico Ghost Town is pet friendly. Not only are well-behaved pets on a leash allowed in most of the shops, there is a shop near the top of the street in town, Dorsey's Dog House, that is filled with treats and pet themed items--the cheese \"bones\" were a big hit with our fur babies. Calico Photo Shop gave us our favorite souvenir, a Wild West themed portrait of the beagles. An early in the day visit to the cemetry/boot hill is an experience in history plus the views are really impressive back towards the mountains. Everything in town is easily walkable, but because it goes up and down slopes, pace yourself. The mine train tour is short but informative plus it is also pet friendly. Calico House Restaurant is worth a visit as it is the oldest surviving building in town, built in the 1880's. A good selection of bbq items, burgers, salads, and desserts. Patio dining out back is pet friendly with a nice view of the townsite. For travelers looking for a desert experience, there is a nearby campground and OHV area.\nShow less"], ["Reviewed July 20, 2016", 4.0, "Interesting and worth a visit", "As you would expect, Calico Ghost Town is quite remote and a decent drive for most visitors. However, worth the effort! I would describe it as an interactive living museum. There is something for everyone, as there are original buildings, informative facts and stories to read, shops selling smellies and candles, a working saloon bar and photo opportunities. For young children you can actually enter an old mine and see the conditions the miners worked under and a working mine train for a ride. They won't become bored and disrupt your visit if promised the mine or train ride.....or the usual ice-cream!\nShow less"], ["Reviewed July 20, 2016", 5.0, "Hidden Gem", "Calico Ghost Town was our first stop on our CA-VA cross country road trip and well worth a visit. I doubted stopping here and was really only expecting to walk around for a few minutes. Our visit ended up being about 3 hours. There is much to see from quirky souvenirs to original gifts, to educational museums/walkthroughs. While it was hot during the day, you can get plenty of shade heading inside the little stores. We did not get on the train; however, we did pay to walk in the mine and walk through the mystery house which was very cool and worth the inexpensive price.\n\nWe were on a time crunch in getting to our next stop so we had to eventually leave without discovering the entire town. Regardless, this place is highly recommended. Travelled with an 8 and 13 year old daughter who also enjoyed it.\nShow less"], ["Reviewed July 19, 2016", 1.0, "Waste of Time", "As part of my drive from LA to Vegas I read about this ghost town and thought it was worth a quick visit. I thought that it was a real Ghost town that I could wander around, but they wanted to charge $10.00 to just wander around. I asked the front lady what was there to see to as I only wanted to spend an hour tops, she was quite rude. She wouldn't even share a map that showed me what was. I asked if the burnings are still 100% original and in their original spots to make it authentic. She couldn't tell me so I left. If you are traveling through here, stay cool and keep driving.\nShow less"], ["Reviewed July 15, 2016", 3.0, "Nice for short break if you are driving nearby.", "Nice for a walk around and stretch your legs while driving from/to Vegas. Kids might find it more interesting."], ["Reviewed July 14, 2016", 5.0, "Cool semi-authentic place", "It was fun to walk through this place. The lady at the dog shop is friendly. Didn't ride the train, but went inside the mine, which was very cool, both literally and figuratively."], ["Reviewed July 11, 2016", 4.0, "Had a weird experience in the Maggies Mining.", "My husband and I were coming from our Vegas trip and saw the signs on the road and decided to give it a try! It was 106 degrees. We were lucky because it wasn' t crowded eventhough it was a Saturday. But not too many personel working so didn't really get the whole experience! The stores were all full of history! One of the stores (post office) which sold refreshments and bought some drinks , I asked the cashier if this place was haunted? And got no answer? Little did I know obviously it was and to my surprise got a picture of one in the Maggies Mining! I felt weird and uncomfortable at some point and took a picture! Here judge for yourself!!\nShow less"]]}}