{"California Academy of Sciences": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "California Academy of Sciences", "url": "/Attraction_Review-g60713-d117078-Reviews-California_Academy_of_Sciences-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/db/d2/61/california-academy-of.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "5222"}, "address": {"@type": "PostalAddress", "streetAddress": "55 Music Concourse Dr Golden Gate Park", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94118-4503", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 5 days ago", 5.0, "Fabulous experience.", "Really loved this place. I could have spent all day at the aquarium. Beautiful displays, smaller fish and creatures were easy to see. The rainforest was well done with birds and butterflies flitting around in front of me. I took the \"backstage tour\" with a knowledgable guide. A bit pricy at $24. on top of the $22. entry fee for seniors. I think there might have been a discount card for $3. off in a visitor center brochure,but not sure I could have used it on top of my Sr. discount for entry. The best part of the tour was seeing the taxidermy women working on a large hawk and a teeny hummingbird. (They only use donations of deceased animals.)\nShow less"], ["Reviewed 6 days ago", 5.0, "The butterflies!", "Be careful because you can spend hours here! The staff are helpful and friendly - full of knowledge. The rain forest exhibition is great."], ["Reviewed 1 week ago", 5.0, "Fabulous museum for adults and kids", "My husband and eleven year old daughter and i visited the California Academy of Sciences on our last day in San Francisco. The museum is comprised of several different areas, including a rainforest exhibit, aquarium, natural history exhibit, theater and traveling or temporary exhibits (currently there is one on earthquakes that is fascinating). We spent about four or five hours and definitely could have spent even longer had we managed to get up earlier! The ticket prices are a little high but a movie is included with the price of admission, which adds value. This is one of the finest science museums I have ever visited!\nShow less"], ["Reviewed 1 week ago", 5.0, "treat for a grandson", "Just a terrific exhibit of butterflies, birds, fish, aquatic animals, geckoes, snakes,dragonfish, jellyfish , etc. the plantation shows are also marvelous."], ["Reviewed 1 week ago", 5.0, "visiting the museum", "Beautiful exhibits and fun exploring the new exhibits and regular displays especially the main one from the bottom levels below the water up to the cloud forests above"], ["Reviewed 1 week ago", 3.0, "A great way to spend Christmas day", "The cost of admission was pretty steep. Exhibits are unique. We especially liked the bio dome. Wish there were more birds and butterflies to experience in the bio dome. Also the planetarium show is worth the time and include in price. Cafeteria has limited options and is also very expensive so you’d be better off to pack a lunch. You can complete your visit in 4-5 hours.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very Interesting Morning.", "We got off at this stop from the Hop on/off Bus tour as we had spotted it the day before. I love a good Museum and this was a happy mixture of Museum, Aquarium and Rainforest.\nThere wasn’t much there I hadn’t seen before but the whole experience was calm, quiet and somewhat relaxing.\nWe did watch the Earth Quake experience and found that very interesting. The butterflies in the rainforest were beautiful.\nWe also had a bite to eat in the cafe, not too badly priced.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A Great Way to Spend a Day", "This place has an aquarium and rain forest as part of the museum. The kids really like the displays of the plants and animals. It does get a little crowded about mid day so plan you trip accordingly."], ["Reviewed 2 weeks ago", 5.0, "Great exhibits", "So the rainforest is great. The exhibits always change so if you went 6 times a year you would see something different. Plan the whole day because there is a lot to see."], ["Reviewed 3 weeks ago", 4.0, "Good, but smaller than expected", "Maybe it's a because I'm a Londoner... that I found this quite a small museum. There's a very good planetarium, a very good rainforest, and good aquarium. Each are of a decent size. But all the other exhibits seemed minor, and tacked on.\n\nPlus point: keep an eye on the walls and ceilings are there's some mass displays there.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nightlife", "Came here for the nightlife dog of the year event which was awesome. Loved the rainforest dome with all the bugs and plants. The albino alligator was super awesome too. Loved being able to walk around with drinks- super fun!"], ["Reviewed 3 weeks ago", 5.0, "Fabulous museum for the whole family", "The California Museum of Sciences is a wonderful natural history museum which includes the Steinhart Aquarium. The creative exhibits are fascinating for children as well as adults. Everyone loves the albino alligator! Our favorite is the 4 story rainforest exhibit! This is a must for anyone visiting Golden Gate Park.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing educational experiencce", "This is a really amazing institution. Everyone remembers the albino alligator, but there's tons of amazing stuff to see. The aquarium section is awesome, and the rainforest is really interesting too. You could spend a good 1/2-1 day at this place."], ["Reviewed 3 weeks ago", 5.0, "Unique and special", "There is more to see than can be done in just one visit, and exhibits change all the time. The rain forest and aquariums are the most special exhibits, and the living roof is fascinating. Weekdays are the best times to go."], ["Reviewed 4 weeks ago", 4.0, "The butterflies were awesome", "I chose this place from one of the options on the city pass. The butterflies alone is worth a visit. There huge and fly all over the place. The only thing I didn't like was the promotion of evolution."], ["Reviewed 4 weeks ago", 5.0, "Go for the Thursday 'Night Life'!", "We just went recently to check this out for the Thursday night 'Night Life' where they sell alcohol and food (for adults), have a DJ as well as have all the attractions open. This is a phenomenal museum and well worth checking out.\n\nWe got to do an Earthquake simulation, see a re-created rainforest in a dome, as well as see some amazing aquatic life and animals below (including a white alligator).\n\nA nice date night - the only unfortunate thing is that parking is very expensive.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Birthplace of Nemo and Dory", "This is a fantastic museum to visit, particularly with children. It can certainly get a bit busy, but if you arrive when the museum opens, you typically get a hour or so where things are reasonably quiet. The exhibits are universally well crafted and thoughtful. The staff and volunteers are very friendly and the cafe has great food. What's not to like. Also, just learned today that the Pixar team came here to observe dory fish and clown fish for their films. Enjoy!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A great but very expensive excursion~", "We made the Flight in the Age of Dinosaurs exhibit right before they left. This exhibit was fantastically done with interpretive interactive displays, actual bone specimens, and life-sized constructed models. Adults and children alike enjoyed it all. It was very crowded, and very expensive however. The room we thought was most attractive for its views of Golden Gate Park and the DeYoung across the way. Not much info we could find. The aquarium exhibits were not as exciting - for the money get down to Monterey instead. The precious stone exhibit was in fact a small hallway with signs and some specimens one could touch. Very underwhelming. Swamp and their signature albino alligator \"Claude\" were fun for kids. Wait in line for the earthquakes exhibit, it's worth it as well.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "For the young and young at heart", "A great place to visit, I visited with my children 9 & 12. We spent the whole day exploring and learning. This is a hidden gem in San Francisco. I though this was an great interactive fun learning experience for the whole family."], ["Reviewed January 22, 2018", 5.0, "Got to visit", "Really loved this we went as a family and spent hours inside its like 3 places in one so much to see and do will go back again on next visit we need more places like this back home"], ["Reviewed January 22, 2018", 3.0, "Okay for little kids.", "Our group was all adults and we were underwhelmed. It was pricey, not very large and crowded. The coral reef was fascinating but otherwise we could have skipped this site. The other sites in the park were wonderful."], ["Reviewed January 21, 2018", 5.0, "A unique and varied museum in the middle of Golden Gate Park", "Most of the visitors to this place are families with young children, but I would argue that the Academy of Sciences is an extremely interesting visit for anyone who appreciates nature and science in general. They have a great aquarium that hosts regular shows, flanked by exhibits of animals who normally live in the Amazon and in the marshes. Right above that is a \"contained rainforest\" in this really cool dome that showcases a lot of additional wildlife, and the living roof, a sustainable rooftop overgrown with grass and plants, is an incredible exhibit all on its own.\nThe only exhibit that was a slight letdown for me was the African wildlife exhibit - not because it wasn't interesting, but because all of the animals were either just models or taxidermies, which was a little boring, but didn't significantly detract from my experience.\nYou could probably cover the whole of the museum in about 2-3 hours but I understand they do introduce new events and exhibits regularly. In addition, it's located right next to a beautiful botanical garden, which adds to the value of repeat visits.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Great wet day activity", "Rain today so we went looking for an inside activity\nSome really good exhibits and shows , the dark side show was really interesting , however was a bit entailed for the young ones\nThe rain forest with birds and butterflies fantastic as was the aquarium\nThe white crocodile just bizarre\nFood , quality was really good and fresh yes a bit expensive\nShow less"], ["Reviewed January 16, 2018", 4.0, "Worth seeing", "An aquarium, planetarium and rainforest all in one. Worth seeing. Thanks to other trip advisor members who let us know that there is limited seating for the planetarium so you need to get tickets for these shows before they run out. We scored a quiet day. We ubered 5 of us there from Ghirardelli for only $27. Aquarium was pretty good as was the planetarium.The rainforest was good but we have a really amazing one in NZ in Dunedin with much larger in fact really huge butterflies that alight on people with more colours and the full life cycle breeding on display. Still it was worth going to see here in San Fran though.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Amazing!", "This place was simply amazing! We were astounded at every turn. What a beautiful building. So much to do here for all ages. Really friendly and knowledgeable staff!! Highly recommend you put this at the top of your list!"], ["Reviewed January 12, 2018", 5.0, "Mind = Blown", "If you are looking for a space to find a bit of every living form along with a sneak peak of our stars and galaxies, this is the place to be. We spent one full day here and never felt bored for a second. Be it butterflies, fishes, fun facts on nature, science and space, you name it. Specially for kids, this is an absolute marvelous place to have a gala time.\nShow less"], ["Reviewed January 11, 2018", 5.0, "NightLife", "This is for 21+ - great fun to hang out with a gang of friends (birthday/Christmas present), enjoy science, have a cocktail and leave the kids at home with the grandparents/babysitter. Have an early dinner before or late dinner after (make reservations though!). So much fun.\nShow less"], ["Reviewed January 11, 2018", 5.0, "A must-see for science enthusiasts", "It was my first time coming to the California Academy of Sciences and was really impressed by it despite its expensiveness. If you're like me, you'd probably need more than 3 hours to fully immerse yourself in what the museum has to offer. The aquariums alone were impressive by themselves. It's not easily accessible though, but Lyft/Uber will easily bring you here. It's also right across the de Young Museum!\n\nMake sure to arrive early so you can sign up for the optional experiences (like the Planetarium).\nShow less"], ["Reviewed January 6, 2018", 4.0, "Nice day but expensive", "I've been wanting to visit this museum since it's facelift so we chose to go when the Pterosaur exhibit came to town. We had a good time and enjoyed all the exhibits but were surprised at the cost of tickets. For two seniors, which there is a small break in price, we paid $70 for the two of us. And if there ever is a next time, we'll bring our own lunch. Two bowls of soup and two sodas came to $39.\nShow less"], ["Reviewed January 6, 2018", 3.0, "Needs an overhaul", "We've been to the Academy probably 20 time with the grandkids over the last few years.\nIt is a great place for kids of all ages. However, I've noticed the last few times there seem to be some management problems. When we entered there was quite a mess.\nYou get in a long line to buy tickets, then get in another long line to hand your tickets in to a person who can't figure out which tickets to approve. If you had groupon tickets or tickets purchased by phone she would get confused and send you over to the ever growing ticket line-in the rain. How is it the DeYoung can have one ticket line and the museum with lots of kids requires two long slow lines?\nOnce inside try not to go into the restaurant. Cost aside, there is not nearly enough seating for the number of people inside. Also skip the 30mins. Earthquake movie. There is not a kid I know who would appreciate this movie! If you can go after 2:00 o'clock, I would. The cafeteria crowd is smaller, the line to get in is shorter and the number of strollers is reduced by at least 75 per cent! (I've never seen so many strollers in one place!). So bring lots of money and come late-it's a great place!\nShow less"], ["Reviewed January 4, 2018", 4.0, "Full day experience", "From open 9:30 to close at 5 pm, the Academy captivated our family with many exhibits. Winter/snow events for the season were good. Many hands-on experiences. Recommend the Dark Universe show in the planetarium for kids over 6 years. Seemed a little pricey compared to other major city's museums/science centers.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Fantastic day with grandkids", "We took our grandkids during winter break and arrived later than we should have. At 11:00 AM it was very crowded but still we didn’t have to wait too long for anything. The one big disappointment was that we didn’t know we had to get tickets for the planetarium in advance right when we entered, and I think it would have been good if we had been notified of that when we bought our tickets.\nWe were so focused on getting into the rainforest because there was a big line, so by the time we asked about planetarium tickets there were no slots left.\nWe still had a great time in the rain forest and my little granddaughter kept having butterflies land and stay on her, which was quite a treat.\nThe kids were never bored and they loved the aquarium too. It was the perfect size and nicely interactive.\nWe did get stuck at the top of the rainforest with a big line trying to take the elevator down. We tried to walk down and out but then realized that was the only way out.\nThe food (except for the coffee and pastries) looked bad and we wished we had taken a picnic. We did enjoy the outdoor eating areas during bought a few snacks.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Ice skating at the Academy of Science", "The Academy of Science offered holiday fun for both young and old during the holiday season. Although I could not entice my 6-year-old companion to venture onto the ice, it was fun watching others slipping and sliding around the on the temporary ice skating rink.\nThe museum offers many favorite exhibits as well as temporary and interactive displays. I decide to become a member so that I can visit as often as I like and the bonus is free admission for a companion. Oh, what a deal!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Science at its best!", "The academy is in Golden Gate Park (GGP) across from the DeYoung Museum. Worth several hours to enjoy and explore. As a member of the academy one can enter an hour before the public on Tuesdays and Sunday mornings. If you have little kids it may be worth it then. There are the penguins to see and time it with their feeding schedule.\n\nI find the academy to be magical with the butterfly garden, the planetarium and the narrated programs, the native plant garden on the roof top of the academy and the aquarium below. So much to see you have gauge your time and interest there.\n\nThere are places to eat inside but one can consider eating outside GGP along Irving between 7th and 9th Avenues. A number of places to try out.\n\nThe academy does have parking available below the DeYoung and is it accessible by Muni lines.\nShow less"], ["Reviewed January 3, 2018", 4.0, "A minority view", "I went with a family of four, two adults and kids 9 and 4, and they all seem to have had a good time. The kids know only a little English, and it didn't seem to matter that much.\n\nIf you're a AAA member, make sure you buy tickets though that site. We saved 20% or more on the tickets (the list price is confusing -- I see around $40 for an adult on the Academy's website, but on the AAA site the list price was shown at $36....AAA price was about $29).\n\nI'm sure I'm in the small minority of visitors who thinks there was TOO much of an environmentally conscious tinge about the presentation. We went to see the penguin feeding and our speaker -- professional and glib, but somewhat disconnected from his audience -- went on about extinction and sustainability for maybe 25% of his discussion. He's talking mainly for kids, who just want to see a couple of penguins fight their guts out for a fish (at least the boys do), using multi-syllabic words many can't understand yet.\n\nThese children will get all this stuff twice over in the classroom. Can't they avoid the lectures about how horrible their grandparents made the planet and just have some cool fun here?\nShow less"], ["Reviewed January 1, 2018", 5.0, "Well worth the cost of admission!", "Interactive and educational for all ages. Super layout so that it never seems like it’s too crowded. Beautiful displays and helpful staff. Lots to do and learn. Great food court with healthy choices. We were there for four hours and didn’t even come close to seeing the entire museum. I was shocked at first when it was a steep price tag to get in, but ended up understanding the cost. Planetarium included in price. If you plan on going more than once in a year, splurge on the annual admission.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Aquarium a great excursion for kids!", "Though the museum was mobbed on a holiday weekend, the flow at the front door moved pretty fast and once inside were able to maneuver around pretty easily.\n\nWe focused on the aquarium, and it did not disappoint. Large, mesmerizing tanks of rainbow colored fish loom over you, and the space is great for slowly taking in the sights and hanging out with family.\n\nThe cafeteria was also mobbed -- less successful in the traffic flow, it gets very clogged at choke points and makes for a stressful experience, but the food was surprisingly good for a museum, if inconveniently laid out among different lines. So if you want a salad and also a burger, you are waiting in two long lines instead of one.\nShow less"], ["Reviewed December 29, 2017", 1.0, "sad, horrible (expensive); don't go!", "After standing in the line for over 30 minutes, we finally got in.\nIt was a very busy day and we felt like the museum did not count the people who got in, so the busyness felt overwhelming, even unsafe.\nHowever, the most shocking thing of the entire experience was the aquarium, with the albino alligator in particular. the animal is kept in captivity in a very small area with no room to really swim or move around. even more, with all the kids and people around the animal must be in distress and it does not feel okay the watch this all going on.\nI thought in 2017 (almost 2018) we, as human, would have passed the stage of using animals solely as entertainment.\nFurthermore, there are more animals at the museum put into the small aquarium, with kids banging on the glass windows. pure animal cruelty; PLEASE DON\"T GO THERE.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Fantastic and meaningful trip for family !!", "Brought my 8,10 year old and spent almost the whole wonderful day and it’s still not enough!\n\nThe planetarium is fantastic and we watched a few shows incl earthquake, universe etc ...definitely an eye opener and brings science to life beyond what we see on everyday life. We also love the aquarium which by the way is more impressive than Monterey Bay Aquarium .\n\nThe only regret was that we did not have time to explore the rest of the park outdoor which was a waste of a good day of sunshine!\n\nShow less"], ["Reviewed December 29, 2017", 5.0, "A great place for all ages", "Located in Golden Gate Park the California Academy of Sciences is a terrific place to visit anytime. The exhibits are first-class and extremely comprehensive. We visited in late December when ice skating was available in the East Garden. Although it was very crowded, the cafe, in true California foodie fashion, was excellent—they even had sushi. Despite our timing (Christmas break) we were able to park easily.\nShow less"], ["Reviewed December 28, 2017", 4.0, "A bit too young but fun", "Our teenage daughter was not all that impressed but we can see that the under 10 crowd would enjoy this activity."], ["Reviewed December 28, 2017", 5.0, "Always a hit with the kids...", "We have been members here for awhile and love it. Every time we visit SF from Sacramento we take our daughters (10 and 7). The exhibits change often and the fact they have a planetarium, aquarium and rain forest dome under one roof helps satisfy everyone in the family.\n\nDefinitely get here early. If you arrive just before opening you can usually find free 4-hour parking along the street in Golden Gate Park. Will save you $25 over the underground lot.\n\nBy noon the place is always packed. The first two hours are always the slowest and, as such, the best time to really see everything.\n\nThe planetarium shows fill up quick, so go get the free reserved tickets as soon as you get inside. You can pick your showtime and then you’re charters to get in and experience the wonderful shows that rotate through.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Amazing aquarium", "This facility has several attractions, but we came specifically to see the aquarium and were not disappointed. The entry fee gets you into the rain forest attraction, the planetarium, and access to the restaurant and gift shops well. This aquarium is one of the best I’ve ever seen! The seadragons are amazing (my favorite)… as are all of the many types of fish and eels. We lucked out and were there when the octopus was out of his hiding place. (One of the people standing by us said that he is a member of the aquarium, and had never seen the octopus in all the times he had visited.) There is a gigantic tank in one room with the most colorful fish you’ve ever seen, and rows of seating so that you can just sit and relax for a bit. It is very soothing. There is also an open tank with starfish in it, where you can actually touch them and see what they feel like. Each tank seems to have a wonderful creature in it from another world. I will attach some pictures so you can get a feel for what awaits you. You have got to go see this place to believe it!\nShow less"], ["Reviewed December 26, 2017", 5.0, "Great place to all the family", "This place was great, we had a great time. Perfect for adults and kids. The dining area has several types of food which is very good."], ["Reviewed December 26, 2017", 4.0, "Good but not as good as the Hype", "Very impressive building and the fact that in one place you can visit a rain forest, aquarium and planetarium but each exhibit just good rather than outstanding. Very good for a family but then very expensive"], ["Reviewed December 24, 2017", 5.0, "A must see if you have children.", "All kids and adults will love this. All the locals use this regularly, so it’s not just a regular tourist spot , although it still is very busy and there are queues. Be prepared for that and it will make your visit more enjoyable. Really worth it.\nShow less"], ["Reviewed December 22, 2017", 4.0, "Fun way to spend a rainy day", "Well worth the price with lots to see and do. Need a full day at the museum and definitely make time to watch the shows at the planetarium.the tickets are free to enter the planetarium but have to be obtained prior to the show at the ticket desk inside the museum.the rainforest and aquarium are treats for people of all ages. As a group of adults we thoroughly enjoyed our visit there.\nShow less"], ["Reviewed December 21, 2017", 5.0, "My most often visited museum", "I love this place. There is such variety, and not so much information that it is overwhelming. I visit once a month as a member, and there is always something new. I adore the Sky Shows. All exhibits bear repeating for greater depth. Warm and personable feel, not overwhelming. It is a planetarium, an aquarium, and a natural history museum all in one. Spend the day, and go up in the free 7-story observation deck attached to the deYoung Museum before 4 pm. Walk around Golden Gate Park. San Fran at its best!\nShow less"], ["Reviewed December 21, 2017", 4.0, "A fun learning experience!", "This is a great place to take the whole family. Lots to see and do here. It is rather pricey and if you've been a couple of times a lot of the stuff is the same.\n\nThe best tip is to go for Nightlife if you are 21 and over. The admission is about half of what it is during the day and they play music and they have bars set up everywhere. It's really fun, most of the exhibits are all still set up and running during Nightlife. But like almost every time you come here, be prepared to wait in line!\n\nThe earthquake simulator is super fun and I've still yet to visit the planetarium. But Claude the alligator is my favorite by far!\nShow less"], ["Reviewed December 20, 2017", 5.0, "Amazing world class science museum", "With its Rain Forest exhibit, plus the Morrison Planetarium and Steinhart Aquarium, this place is world class and extremely fun. Kids especially would enjoy it, and even older kids like my wife and I (who are over 60!)"], ["Reviewed December 14, 2017", 3.0, "Underwhelming", "Planetarium show promised something exciting ... curved roof layback seats but way to much science and could have been fun if content more general . We all snoozed. Would ha e been nice to receive a program at front door of times of events so u could plan .\nShow less"], ["Reviewed December 14, 2017", 5.0, "Incredible! Go here!", "This place is AWESOME! The exhibits are so well-maintained and the whole place is just magical. Plus, there is an albino alligator! The geology exhibit was my favorite. I could spend entire days there."], ["Reviewed December 12, 2017", 5.0, "Fascinating and educational", "Great place for all ages and the earthquake experience is so realistic! GREAT TRIP FOR THE WHOLE FAM, with both life science and physical science experiences!"], ["Reviewed December 11, 2017", 5.0, "Best science museum ever", "We have been to science museums all over the country, and this stood out as one of the best. The rainforest offers 3 stories of flowers, birds, and butterflies. One butterfly even landed on me. Beneath this exhibit is the aquarium - small, but lots of interesting things. We saw a couple excellent shows at the planetarium. In between were smaller exhibits. We spent the whole day there and enjoyed every minutes.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Beautifully presented", "We especially enjoyed the rain forest (butterflies and birds flitting about) and aquarium exhibits. We enjoyed a presentation in the planetarium. Altogether, an amazing number of experiences housed under one roof. The cafe seemed to be expensive."], ["Reviewed December 11, 2017", 1.0, "Don’t go on their free day", "So we didn’t realize it was a free day..I’ve never seen so many people in a museum..\nWe waited about 30 minutes to get in- but once we were inside it was so busy we barely could walk. Everything had lines. We waited for the earthquake simulator for about an hour.\nI guess since it was free it was nice to check out but I would have preferred to pay to have fewer people. We ended up leaving.\nShow less"], ["Reviewed December 2, 2017", 5.0, "A must go in SF", "It’s a out of the world museum, I’ve been at their first location but this one is so increadible that is a must."], ["Reviewed November 26, 2017", 4.0, "overpriced food & drinks", "Went here as a family of 4. An excellent place to spend a half day. We were there on a weekday. It was very crowded and I imagine it would be worse on weekends.\nThe food options were horrendously expensive so make sure you take your own snacks and drinks.\nShow less"], ["Reviewed November 24, 2017", 1.0, "Tickets & Availability", "Why did Trip Adviser report that no tickets were available for this museum when I was able to go directly to the museum's website and purchase directly. This is frustrating and diminishes confidence in TA."], ["Reviewed November 23, 2017", 5.0, "Unexpectedly Fantastic!", "I am a high school science teacher and recently found myself in San Francisco for a friends wedding. While the family was preoccupied getting things ready, I took an Uber to Golden Gate Park to explore for the day. What a fantastic time I had!\nThe Academy of Sciences is FULL of interesting exhibits. It is essentially a planetarium, aquarium, museum of natural history and rainforest all in one. I was there for more than 3 hours. It IS very kid-centric and local schools schedule field trips during the week -so be prepared for crowds of kids. The planetarium shows are first come first served, BUT you can see more than one show in a visit if you visit the kiosk again. The staff were friendly and accommodating.\nIf you find yourself with more time to spare, the park itself has many other wonderful gems - the botanical garden, the DeWolf Museum and the Japanese Tea Garden.\nShow less"], ["Reviewed November 22, 2017", 3.0, "A solid okay", "Being in our early 30's with no kids we found this place a bit kid-centric. The displays and attractions were more aimed at younger kids. Go to the Exploritorium for a more hands on adventure!"], ["Reviewed November 22, 2017", 5.0, "It is really a Museum Like No Other", "This is a the only aquarium-planetarium-rainforest-natural history museum on Earth, adventure is around every corner. If you are driving, parking place is far away. If you come by bus, it is preferable. Or take a taxi. You can marvel at the deepest living coral reef tank on Earth. Zoom across the Universe in our 75-foot planetarium. Trek through a butterfly-filled four-story tropical rainforest. In the middle of the tour, we had to stop for a lunch break, go to the cafeteria. Everything is healthy and organic! The aquarium has nearly 40,000 live animals representing over 900 separate species. The Morrison Planetarium is one of the largest and most advanced all-digital domes in the world. Tip: as soon as you arrive, go get the planetarium show first to guarantee your session! The four-story rainforest is a slice of tropical paradise. The Kimball Natural History Museum is loaded with diorama displays and high-tech interactives at the Pterosaurs: Flight in the Age of Dinosaurs. Could not go to the Shake House, a 7.9-magnitude earthquake simulator because the line up was too long... You will have complete fun for an entire day!\nShow less"], ["Reviewed November 21, 2017", 5.0, "Great time at the museum!", "My two boys, ages 6 and 9, really enjoyed this museum. We spent over 4 hours there and still didn't get to see everything. It started to get really crowded (around 2pm) so we left.\nAs others recommended, we got our Planetarium passes right when we arrived. Then went to the aquarium and rainforest areas. Both these areas were not big but had enough wildlife and educational signs that it did take some time to go through.\nWe also browsed the gem room, the flying reptile room and the room with the different skulls. We didn't have time to do the earthquake simulation and missed the penguins.\nIf I were to do it over again, I would have brought more snacks as the line for concession was very long, and get in line for the earthquake exhibit as soon as it opened as that line was long and slow by mid-day.\nNonetheless, it was a great way to spend our morning.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Plenty to see", "There's a lot going on here with many different sections, so make sure you allocate plenty of time to visit. The various planetarium shows are cool and free - the narrator for the earthquake one was very good - as is the rainforest exhibit. The informational signs are comprehensive as well. The albino alligator is quite a sight, though it didn't move much at all.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Interesting museum", "Maybe we we're a bit jet-lagged, but we got a bit tired fairly soon. However, there are lots of interesting things. And certainly not only for families with children! As somebody else said, if you can bring a pic-nic, the café was expensive and not that good (But certainly not bad!). Still, I think that they could have made more of it, for example, we’d loved to be able to a walk on/along the green roof. However, well worth a visit!\nShow less"], ["Reviewed November 17, 2017", 5.0, "A little bit of everything!", "I really wasn't too sure what to expect when I came here but it is just a bit of everything. There are a few museum exhibits like you would see in a natural history museum.\n\nThere is also a very nice aquarium! I spent well over an hour exploring the aquarium part and it was simply amazing. Several viewing tanks with floor to ceiling windows into different environments.\n\nThere is a rainforest biodome with lots of butterflies and birds - seemed really cool but at that point WAY overloaded with screaming kids so a little overwhelming.\n\nAnd finally, there is a planetarium with free tickets to any of the shows! Just stop by the desk to pick up a ticket for the one you want to see. I saw a great show on dark matter.\nShow less"], ["Reviewed November 15, 2017", 2.0, "Poor Penguins", "Was enjoying the visit until I saw how small the penguin enclosure is. This place should focus on science and let larger zoos have the animals. As Trump would say: Saaaaaad!"], ["Reviewed November 15, 2017", 4.0, "Much to see so allow some time", "I was the Brit with 2 Californian friends and our time was a bit limited but the museum is full of interesting sections. The planetarium has shows which I think are free to attend and last 20-30 minutes so you get escorted around the universe via this huge cinema screen with an explanation of what's OUT THERE.\nIt's complex as is the universe so like me, much of it may pass you by but I really enjoyed the show about earthquakes and how the city is in a tricky place! The film explained just how the tectonic plates slide and cause damage.\nThe aquariums have some wonderful displays with cool lighting so even jellyfish look alluring. The albino crocodile just looks sad and lonely. We managed to see quote a bit but the museum needs a few hours and don't forget to go see the rood garden as the views are great too.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Fun-Filled!", "Loved seeing all the different exhibits and animals! Great for taking pictures and learning cool stuff!"], ["Reviewed November 13, 2017", 4.0, "Day trip to the park", "We used the Big Bus to get to and from the park. There are so many areas to the academy which would appeal to everyone. Unfortunately the rainforest enclosure was being renovated when we were there but could still see some of the butterfly's through the window. Such an amazing green energy facility that you could easily spend the afternoon at.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Amazing experience!!!", "California Academy of Sciences is an unforgettable way to spend an afternoon in the city with family. The adults loved it. The children didn’t want to leave!! Wear comfy shoes because it is a lot of walking. There is a restaurant onsite. Although many families brought their own food and had a little pick nick. A good time\nShow less"], ["Reviewed November 12, 2017", 3.0, "Great if you have kids, ho-hum if not", "I read all of the reviews on this place and was so excited to get here! We made it our first stop when arriving in San Francisco and couldn't wait to see and do all of the activities listed based on the stellar reviews. Upon coming up the stairs to the California Academy of Sciences, my husband and I were greeted with throngs of children waiting to pour into the museum. We pushed past the crowd and purchased our tickets and entered the venue. There were children literally EVERYWHERE. When I read the reviews, it said this place had a rainforest with more than 1,600 animals. Did they count each and every fish, because it didn't seem as if this were possible. My husband and I walked through the aquarium and while it was quite nice, we thought, \"Is this it?\". We completed the entire museum in 90 minutes or less. We didn't even stay for a Planetarium show because we didn't want to waste anymore time there waiting for the next showing. Honestly, this place is great for families with young kids, but holds nothing of any real interest for those who have none. We felt that we wasted our money as far as our own entertainment was concerned, but know that a portion of our dollars goes to the upkeep of a lovely museum aimed at families and education. And that's never a bad thing. If you have young kids, this place is a must. If you do not, then hitting the Japanese Tea Garden and taking in the beautiful sights there might be more enjoyable for you. Good luck and enjoy!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great learning center", "Much to see!!! Many neat crystals and rocks, plenty of local sea life, some fossils, great planetarium show, definitely worth the visit!!!"], ["Reviewed November 11, 2017", 5.0, "Great way to spend a not so great weather day", "It was the last full day of our vacation. We spent every day up until this one, doing outdoor things. This day was cloudy, windy, with periods of drizzle from time to time so we spent the day here.\nIt was a fantastic experience with much to see and do. We saw 2 of the planetarium's shows as well as experienced what it is like to feel the building shake in an earthquake.\nThere is a lot of exhibits to see. They have a cafeteria area with good selections but a bit pricey. It would probably be a better idea to eat before arriving.\nShow less"], ["Reviewed November 11, 2017", 5.0, "State of the Art Science Museum", "You can spend the entire day and this state of the art museum and enjoy every second. If you are pressed for time must see: Rainforest, Aquarium, Penguin colony and a movie. Also the food at the museum's cafe is delicious!"], ["Reviewed November 10, 2017", 5.0, "Amazing!", "I was so sad I didn’t have my daughter with me on this trip. There is so much to see and on so many different subjects. Drawn in by their living roof, I have been wanting to come here for years and it did not disappoint. This is a great way to spend a day.\nShow less"], ["Reviewed November 10, 2017", 5.0, "What a wonderful day!", "All ages will be enthralled!! We spent hours watching the beautiful creatures and still could have seen more. But the highlight for our family was Claude, the albino alligator. The museum docents were very helpful and gracious. The earthquake sequence was very interesting. There is so much to see we recommend you pace yourselves as you go about. Enjoy a wonderful day :)\nShow less"], ["Reviewed November 9, 2017", 5.0, "Planetarium, Natural History, Aquarium", "Planetarium, Natural History Museum and Aquarium: all under one roof, for one price. Walk, bike or take public transportation and get $3 off each admission price.\n\nThis was a neat place. We have seen many science museums; we all enjoyed the variety and beauty of this one. The aquarium was cool, the rain forest unique, the planetarium educational. There is an earthquake simulator, but the line was long.\n\nDon't eat in the cafe, if you can bring a picnic or eat elsewhere. Overpriced and not very good. Beautiful outdoor space to eat lunch. It was crowded and loud, lots of school field trips. We were inside about five hours and we saw everything from the rocks to the living rooftop. A beautiful and educational museum in pretty Golden Gate Park.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Beautiful Museum with mammoth collection", "We visited this museum to learn more about animals, even microscopic animals, reptiles etc. Its a huge museum with lots of collections of several species across the globe and lost of info about every species."], ["Reviewed November 8, 2017", 5.0, "Great mix of nature, history, short shows", "We loved it. Prehistoric exhibitions, great aquarium, SF earthquake exhibition, and much more. People present explaining what you see, ask questions to, etc. Good lunch opportunities as well. Way too less time to see everything, we have to get back."], ["Reviewed November 8, 2017", 5.0, "Amazing museum", "This is truly a top notch museum. I didn’t get to see it all as I didn’t have enough time but there are several floors including a huge aquarium area, rainforest dome, earthquake experience, and many others. The rainforest was absolutely beautiful with butterflies flying all around. The aquariums reminded me of the Atlanta aquarium just on a smaller scale. The museum is great for every age group! They include something for everyone to learn from at each exhibit.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Great Place for Kids", "I went here because it was a rainy cold day. It was really interesting and lots to see and do the aquarium was awesome. There were lots of kids and they were all having a great time. The earthquake area is really interesting. the butterfly garden was closed the day I went so hopefully I will make it there another time.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Must see for families", "So glad we made the time for this- plenty of fun for our four year old and we had a great fun as well. Carve several hours out so you can walk the grounds as well."], ["Reviewed November 3, 2017", 5.0, "Outstanding living museum for kids of all ages. All science museums should be like this one", "We took a 'Behind the scenes' tour as 'Friends', which gave privileged access to the roof garden, the botanical sciences unit, the indoor rain-forest and the aquarium. Apart from excellent exhibits, very imaginatively presented, the building itself is amazing, light, airy open and inviting.\nWe could only spend a couple of hours there but could easily have used a couple of days to explore and be entranced. If you go, and if you can, you should and plan your visit to make the most of an outstanding opportunity.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Scince in a nutshell", "To us, with small children, that sea life was the most appreciated. The relatively huge fishes impress in their large tanks. It is all well described and give a good background why it is important to take care od the seas."], ["Reviewed November 2, 2017", 5.0, "A Must Visit in SF", "Spend a whole day here and you won't regret it. It was fun as a kid and as a adult it still manages to keep you entertained. Great family time."], ["Reviewed October 29, 2017", 2.0, "Overpriced for what's there", "Definitely several good exhibits. We enjoyed the Rainforest Exhibit, as well as the Earthquake exhibit. But there just wasn't enough there to justify spending $35 per person to attend. I wonder how poorly they're doing to justify prices like that. Would not recommend if you're from out of town/not a member.\nShow less"], ["Reviewed October 28, 2017", 3.0, "Beware planetarium being closed", "Really disappointed to purchase tickets in advance only to get there and find planetarium closed. Given the price and the fact that we had travelled from UK so couldn't come again I think a partial refund would have been nice or a voucher for a coffee even. Not as good overall as I expected for the money.\nShow less"], ["Reviewed October 28, 2017", 5.0, "A must for everyone", "Spend at least the day so much to see. Aquarium. Planetarium. gems. top of the roof solar planning. Didn't plan enough time. Beautiful area with more to see for everyone. Can touch snakes too"], ["Reviewed October 26, 2017", 5.0, "Fantastic!", "We spent almost an entire afternoon here. Easily done as there is so much to see. Very interactive if you are bringing kids. Very expensive to dine at.. bring your own food..there are plenty of tables to sit at. Nice and cool and clean to walk around. The guides are very helpful and interesting..no problems there! A beautiful aquarium..better than at Fishermans wharf!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Simply outstanding place, must visit for all.", "This is really very nice and informative place, the rain forest is a outstanding experience, all the actives and shows are worth watching, if you are visiting this city with kids, it is a must visit location, even this location has many attractions close by."], ["Reviewed October 26, 2017", 5.0, "Great place!!", "This place is incredible!! There is so much to do and see! My husband and I saw a showing in the planetarium and the staff inside is such a joy! The exhibits are beautifully displayed and have so much detail about what you're looking at!!"], ["Reviewed October 25, 2017", 5.0, "An educational and fun way to spend the day!", "This is a must see if you have children from pre-school she to fourth grade. Interactive exhibits and cool ways to look at science and nature. Planetarium, aquarium, rainforests, earthquakes and more! The butterflies are delightful and the albino alligator awesome!"], ["Reviewed October 24, 2017", 5.0, "Attended The President's Even for the meeting of the AAOMS. The bouffet style meal service was exquisite and I liken it", "I annoy say enough about the quality of the food selection. Everything you could possibly want was available and cooked to perfection. I was impressed."], ["Reviewed October 24, 2017", 5.0, "Great science, great aquarium, great planetarium show", "The Big Bus tour showed this as a stop. So, it was a must. Great experience - visiting the aquaria at which they had accesible creatures for the children. I shuddered as children poked at some live creatures. The planetarium show was Dark Universe which was superb. Also, the Cafe served very tasty food.Definitely a place to visit. Allow half a day at least.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Science made accesible to any & all", "This is is the only institution of it's kind in the world. It houses an aquarium, a planeterium, & a natural history museum all under one roof.There are many interactive displays & activities that engage people of all ages\nFor example the aquarium an exhibit with tidewater creatures like starfish & sea urchins& plants like live kelp with a shadow area so that you may touch these. There is a tunnel whose walls are made out a clear material & when you walk through it, all around you there fish plants& creatures from the Amazon, There is a long bench so that you can sit & observe what is going on around you & here you will find it very peaceful. There fish & creatures from accross the globe from Claude the albino alligator to sea horses as well penguins which you can watch being fed.\nThere is a planeterium that has regularlyrics scheduled shows. A hall with taxidermist animals from various parts of the world in terms original part of the Academy. Throughout the year there special exhibits many are interactive like one on adaptive evolution or what it feels like to be in a house during an earthquake & how to prepare for that event. During the winter holidays there are live reindeer outside one of the wings of the museum & inside periodic \"snow\" falls.\nSome of the labs are visible to the public & one can see scientists working on investigations that might one day breakthroughs in science.\nWhen you do come be prepared to be engaged, surprised & awed by this fantastic place. Wear your walking shoes & bring a snack as you could spend all day to be able to see what is oferred.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Nice museum with lots to do", "The butterfly dome was our favorite. A huge blue butterfly landed on my daughters hand. We were sad that the penguins were closed for a private event. The aquarium was interesting. We didn’t do the planetarium."], ["Reviewed October 23, 2017", 5.0, "A Rain Forest Adventure!", "What a great rain forest exhibit! I have never seen so many or such a variety of butterflies anywhere. I took my 2 year old grand daughter on a three day trip to San Francisco and this was by far her favorite place. She loved the aquarium here but, her favorite thing was definitely the butterflies.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Crowded but fun", "We went on a Saturday afternoon and it was very crowded so we didn’t get to see everything. What we did see was interesting though."], ["Reviewed October 21, 2017", 5.0, "Earthquakes, aquarium, planetarium and more!", "Wonderful place to visit more than once. There are so many things to see and do, wonderful for kids and adults. Simulated earthquake, albino alligator, fantastic special effects in the planetarium presentations - we couldn't see everything!"], ["Reviewed October 21, 2017", 5.0, "Get your geek on!", "A highlight of our trip was booking VIP for nightlife, I would highlight recommend for a number of reasons from a cost perspective:\n- VIP entry was $59, standard is $21\n- two free drinks with VIP ($12 per drink for the cocktails), leaving $14 more than standard entry and for this you get;\n- very short queue to get in, standard entry queue was MASSIVE!\n- nibbles\n- tour into private / staff only areas\n- guaranteed entry into the main presentation, separate tickets for this for standard entry\n- queue jump for some specialist attractions (rainforest, earthquake sim)\n\nIn terms of the academy this was very interesting with some excellent exhibits, but the aquarium and particularly then coral reef was a highlight for me. Susan the tour guide was very knowledgable, full of enthusiasm and very knowledgable. The music played at nightlife was borederline terrible but then again, i have a poor taste in music and I think it’s unliklely they were going to blast out Doctor Jones by Aqua!\nShow less"], ["Reviewed October 20, 2017", 5.0, "World-class Attraction", "There is so much to see here! Aquarium animal habitats are clean and healthy, Rainforest is a unique and amazing experience, exhibit halls are packed with amazing science highlights - we learned a lot."], ["Reviewed October 19, 2017", 5.0, "Excellent educational venue and good for tourists also.", "We were a bit nervous about going here after two reviews below. Fortunately we were very pleasantly surprised. The route 7 bus from downtown Market St for $2.70 drops you about 5 minutes from the front doors. You get a $3 discount on entry if you show your public transport ticket. A further $10 off for seniors.\nYou MUST visit the planetarium - we saw three separate shows in there about space and earthquakes. Very good productions and great screen.\nInteresting talk at the swamp about alligators and turtles. The rainforest is open now and well worth a walk through.\nThe fish displays are best seen from the basement and include tropical fish in a live coral environment; large fish in a large tank which is also visible from the rainforest; many other fish in individual ponds. Snakes, frogs, butterfly's and more.\nLots and lots of interactive hands on activities, which kids love, as do adult Aussies! We were there for 5 hours and could have stayed longer(except they close at 5pm).\nI nearly forgot the great variety of food in the cafe, wholesome salads, sushi, sandwiches, soups, and of course trashy fast food. They also sell beer and wine if you like one while on holiday.\nThere are a number of other good things to do in the Golden Gate Gardens so I recommend catching the route 21 bus from downtown right up to the park and then walk through the park visiting the various places on the way to the academy. Allow a full day to cover most things and then catch route 7 home. Definitely worth the entry fee.\nShow less"], ["Reviewed October 19, 2017", 4.0, "Super Cool and More Local", "I loved this place. There was a ton to see and do here. It's great if you have kids, but I was here with just my hubby. We had lunch here too and the cafeteria was pretty good. It felt much more local than touristy."], ["Reviewed October 17, 2017", 1.0, "Waste of 1/2 of day.", "This was awful. We had to take cab to get there (40.00 each way),\nAnd the exhibit was not a good value for the money(40 each adult to get in). The aquarium was sadly a few fish behinfpd glass but not too exciting( We were expecting a Ripleys type aquarium) There were a few stuffed animals. The rainforest exhibit was closed for refurb and we didn't look at the planetarium.\nShow less"], ["Reviewed October 17, 2017", 3.0, "Did the after hours 21+ event", "A few buddies and I decided to do the 21+ after hours thing. It was highly recommended to us so we were super excited. Unfortunately the biodome was closed which I guess is our own faults for not checking ahead of time however oh well we still enjoyed ourselves. The reason this is not a 5 star review is because of the \"IMAX\" presentation which was free! The presentation was on hypothetical surfing conditions of planets we can only speculate about. I'm a big Star Trek guy so at first I was really into it until I realized the knucklehead playing Surf Rock records on vinyl wasn't turning his incredibly annoying desk lamp off. The music didn't work with the presentation and the light ruined the quality of the IMAX. It seemed like this was put together in five minutes by a guy who can throw a bunch of science mumojumbo at you. Clearly I was not drunk enough for this presentation. Oh yeah and give the fish bigger tanks..sea homies gotta stunt too.\nShow less"], ["Reviewed October 15, 2017", 4.0, "Great Science Museum: Something for Everyone", "The admission was costly but it does include the Planetarium, the Aquarium and the Living Roof. Unfortunately the Rainforest was closed when we were there. This is a great place for kids and there were lots of school groups and strollers; but as two adults we enjoyed it too. Many of the exhibits are very well done--the current one on Pterosaurs is outstanding. The Earthquake simulator is a 'don't miss.' We felt very bad for the few live animals outside the Aquarium in captivity such as the alligator and the penguins. The highlight for us was the Planetarium--we asked for tickets to two shows and they gave them to us. We saw the 'Earthquake' show and the very excellent 'Tour of the Universe,' a great introduction to the current science of our universe, don't miss that one.\n\nAfter about two hours, we got our hands stamped and left for a break and snack at the nearby Japanese Garden; then we returned for the second Planetarium show. There is paid parking underground in front of the museum. The cafe has plenty of indoor and outdoor seating and a good tuna sandwich.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Plan to spend half a day", "What an interesting museum! The aquarium is fabulous with some really really interesting exhibits. The earthquake simulation was also excellent and the entire family enjoyed the exploration area on the second floor we can touch, and look at things through the microscope. When you first arrive make sure you book to get into the show in the planetarium. The shows book out early so it’s good to get there first so you can get a time. It’s certainly worth the visit. There is a good cafe in the museum with lots of healthy choices.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Great museum for all ages", "Where else can you see a natural history museum, planetarium, aquarium and more in a single location! It was not cheap, but well worth the money for a few hours spent wandering through well curated exhibits. Located in Golden Gate Park, it was a wonderful way to spend the day. Food court style restaurant also had very nice choices and surprisingly good food.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Thanks for support", "The wonderful Academy of Sciences offered free admission to those of us affect by the fires in Sonoma and Napa. We took our five year old granddaughter who had a great time. There are so many great things to do that even the little ones can enjoy it. There are also so many very sophisticated exhibits that the scientifically minded are also enthralled.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Well worth the entry fee", "Fantastic centre, something for everyone. Saw my first albino alligator. Well laid out and plenty of spots to sit and rest."], ["Reviewed October 12, 2017", 5.0, "Great night", "My husband and I attended the Cal Academy of Sciences Nightlife. We went ahead and paid for VIP and it was worth it. We had drinks, apps and a great behind the scenes tour. We even went into the lab where they clean specimens. Towards the end of the night there was a band on the terrace who was really good. So much fun1\nShow less"], ["Reviewed October 12, 2017", 2.0, "Overpriced", "Probably twice the price it should be. If you are local and buy an annual pass then this may make sense as a Sunday afternoon with the kids. You will find wider collections elsewhere and in most cases free or for small donation. This is a kids experience not adult.\nShow less"], ["Reviewed October 12, 2017", 3.0, "Interesting but you can pass.", "The museum is beautiful from outside. Inside you can see some aquatic animals what makes me wonder if the goal is actually the education. We also saw a lonely deer in captivity outside. what does it mean? There are some interesting information about different ecosystem around the world but nothing special. Another thing to notice: if you have labyrinthitis don't go to planetarium. The effects are amazing but make adults feel a little bit dizzy!\nShow less"], ["Reviewed October 11, 2017", 3.0, "Too expensive, too loud, and crowded", "All reviews reflect the author's situation as well as the place visited, right? My wife and I are senior citizens who like science and natural history museums. We went to the Cal Academy on Columbus/Indigenous People's Day when we learned that SF schools were not observing the holiday. That's as may be - the museum was full of small children and their parents or nannies. That would not in and of itself be a problem but (a) there is insufficient sound absorbing material in this museum and (b) a major area of the museum, the rain forest, was closed, so there was much less space than usual to absorb the crowd. Add to this that the museum is very expensive in terms of single visit tickets. Yes they have some nice exhibits, but there are many better, less expensive, museums around the country.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Too many things to see", "We went on Saturday. Lots of crowd. Too many things to see but not enough time. Dont miss the planaterium show. Its included in ticket price."], ["Reviewed October 11, 2017", 4.0, "Good museum", "It was really interesting to be here, the place it is amazing and the exhibitions are really good, the only down side of this museum I think it is the price, I think it is too expensive, but other than that I think it is great\nShow less"], ["Reviewed October 8, 2017", 5.0, "Fantastic Natural History Museum", "Wonderful natural history museum. When you get there make sure you go and book a place on one of the planetarium shows, well worth it. The Aquarium downstairs is fantastic, thousand times better than Aquarium at Pier 39. Helpful volunteers on site to talk and explain things to visitors. Cafe very nice as well.\nShow less"], ["Reviewed October 7, 2017", 4.0, "Fantastic few hours", "We visited the museum whilst holidaying in San Francisco mostly for our teenage daughter. We had a wonderful few hours exploring the rainforest, various exhibitions,and the aquarium. The only slight negative was trying to find a seat in the restaurant when we went for lunch as it was so busy.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Museum, Planetarium, Aquarium all in One", "I highly recommend going to the CAS in SF. We enjoyed everything, from the planetarium, the entire ecosystem, the earthquake exhibit, the aquarium. Everything is great here. The show at the planetarium was the best 4d experience I'd ever seen. Well worth the fee. Discounts for vets too.\nShow less"], ["Reviewed October 6, 2017", 4.0, "I wish we had this back home!", "What a fun idea. Let loose after the elementary school kids are safely away with beer, wine (or the cocktail of the week) at the CAS! Start your day strolling the grounds of Golden Gate Park and then end it here. Every city should have this.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Amazing place for the whole family", "I HIGHLY recommend visiting this place. Take at least one day to enjoy and let the kid(s) explore all the place. We got the tickets with City pass and was really worthed.\n\nFood is a little expensive but almost everything is expensive in the city. Take your time to enjoy the areas around them. The Golden Gate Park itself is really good. Soo beautiful...If you get early you can find a spot to park close to the place.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Best place for edutainment", "California academy of science is the best place for child or adult to learn and eucated un formaly and have fun in visting animal and equeipment about eperical science. It s place in edutaiment field , very intresting and fun."], ["Reviewed October 4, 2017", 5.0, "Very awesome place to visit", "Within the Golden Gate Park, the California Academy of Science is an amazing building full of science and information about our planet and all living creatures. They also give valuable information about earthquakes. A must to visit"], ["Reviewed October 4, 2017", 5.0, "Great stop for everyone", "Informative stop with some great exhibitions. There is something for everyone here. The aquarium in particular is spectacular, with lots and lots to see. The planetarium is a great experience and l recommend making time for it. Earthquake house is another great exhibit. You will need at least 2 hours for this attraction, but it is well worth the time!\nShow less"], ["Reviewed October 4, 2017", 5.0, "A lot to do and see", "Had a great day at the academy. A lot to do and see. Very interactive for all ages. Loved the aquarium. It's small but so much to see. A little pricey, but look for discount brochures. Also was told it was even more inexpensive if you had a city pass. It was our last day so that option didn't work for us. Spent 5 hours there. If you go earlier, you could also explore the San francisco park. Eat in the cafe and the lunch was very good.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Interesting", "Went here because it was part of an attraction pass I bought. It was very interesting and had some cool displays, but nothing I couldn't see back home. Still good though."], ["Reviewed October 3, 2017", 4.0, "Nightlife VIP tour was good", "Great place, made better by the nightlife tour - great drinks and snacks and good to see the displays in a relaxed atmosphere without lots of kids running around."], ["Reviewed October 3, 2017", 1.0, "Museum", "Didn't go in, as entry fee was far too much! It was going to coast $79 to get in and I for one, was not going to pay this for something or things I could most probably see at home, in a museum, for nothing!"], ["Reviewed October 3, 2017", 5.0, "A musuem to rival London’s", "I was really impressed with this musuem. It’s actually like multiple attractions in one building. There’s a big aquarium, a planetarium, a natural history section, an earthquake section....the list goes on. It’s not cheap, but considering all there is too see and how much you would pay for just an aquarium on its not bad value. Also it’s in such a beautiful setting that it’s worth a visit just to see the golden gate park. The rainforest area is closed at the minute, but we (two adults) spent several hours there without seeing everything we could have. The restaurant and gift shop also had good quality items. I’d read reviews saying about big queues, but we didn’t have this problem when we visited around midday on a Wednesday.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Best Museum in SF", "Cal Academy is the best museum in San Francisco. The museum is an active research institution on par with the Smithsonian. It's collections and exhibits are world class, and they cater to children as well as adults. If visiting San Francisco or if you live here, it is a great place to spend a day. Also, don't miss Night Life on Thursdays!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Three Museums in One", "I am fifty four years old and I went to this museum with my wife. Loved it! Planetarium, aquarium and natural history museum in one."], ["Reviewed October 2, 2017", 5.0, "Next best thing to diving in the ocean!", "We go to the Cal Academy to view the Philippine Coral Reef, the sharks and the penguins. Food a bit pricey, but convenient. There are some food trucks behind the stage of the Music Concourse."], ["Reviewed October 1, 2017", 5.0, "Science Museum", "Great place to go with anyone. Such a wonderful museum. It has interactive activities and a wealth of different information it is also surrounded by golden gate park which is beautiful and other museums would recommend this if you are in the city"], ["Reviewed September 30, 2017", 3.0, "Great for children", "The Academy is reasonably sized, interactive and extremely family friendly. Saturday's are very busy so if you want to avoid the crowds go during the week.\n\nThe shake house, demonstrating the two last San Francisco earthquakes was interesting although the wait was long to get in. The water features were also very interesting and popular with all.\n\nDespite the rush of people the cafeteria had enough seating and a good selection of options. Considering where this is located there aren't many choices so they did a good job.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Night life on Thursdays", "Make sure to attend the 21 plus night life on Thursdays from 6-940 pm!!!\nWe bought tickets in advance a couple days but I'm sure if you went 15 mins early you'd be okay.\n\nDrinks and food and nerd life! And a DJ! And aquarium! With a diver ! And a planetarium with a show! And a Terrance with beer and a pig roast\nShow less"], ["Reviewed September 28, 2017", 4.0, "Very good Natural History Museum, Aquarium and Planetarium", "This is a large and modern museum with lots of activities for all ages of the family. We learned much about earthquakes throughout its simulation exhibit and show in the Planetarium. The aquarium has a good coral reef exhibit."], ["Reviewed September 28, 2017", 3.0, "Underwhelming, wouldn't rcommend a visit unless you are at a loose end", "If you are fortunate enough to have been to London's Natural History Museum this will not compare well. We were left a bit disappointed."], ["Reviewed September 27, 2017", 3.0, "Not a good way to spend vacation time", "It's a nice place, but very underwhelming if you have been to a good aquarium or dinosaur exhibit. My 12 year old was disappointed. And for a $38 ticket, there was little access to certain areas which are labeled \"members only\". If you're in California for the first time, go to the coast, redwoods, light houses, etc. and save this type activity for a Saturday with nothing else to do.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Awesome!", "Great place to go! Something for everyone, including an earthquake simulator, an aquarium with a coral reef, an eco dome and a planetarium. Don't miss it!"], ["Reviewed September 26, 2017", 5.0, "Great 'natural history' museum", "Well worth a visit when in San Francisco. Particularly good is the rain forest 'globe' which you walk up through, full of macaws and butterflies, all free flying and a real experience to be in among them. The aquarium is also excellent and together with the earthquake experience help mark this natural history museum out from others.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Birthday trip", "The museum is great. Lots of fun experiences for people of all ages. (Don't go on Sunday. The line can get to be up to a mile long). There are a lot of fun games and animals."], ["Reviewed September 24, 2017", 4.0, "A Visit to California Academy of Sciences", "Soon after our coming to California our first place of visit is the famous California Academy of Sciences, where we can see an aquarium, a planetarium and a natural history museum—a sort of three centers at one place. Of course in San Francisco there are many museums like Walt Disney Family Museum, Asian Art Museum, San Francisco Museum of Modern art, Musee Mecanique, Cable car Museum etc. But as most children in our batch were interested in watching various types of plants, fishes and animals, we chose this place which is a must see for everyone. It requires almost one whole day to see so many rare and astonishing things here that we have not seen elsewhere. The academy people deserve our utmost compliments and appreciation for their untiring efforts in preserving all these specimens and in promoting the spirit of science and in creating awareness of caring for our environment and other fellow creatures and beings which have their right to live and grow in their habitats. For this purpose the Academy provided suitable surroundings and simulated conditions for all these creatures to survive without any discomfort and troubles. This Academy is located at Music Concourse Drive on Martin Luther King Jr. Boulevard, in the heart of the city. This institution started as a society in 1853. In 2008 it was designed by the famous Italian architect, Renzo Piano and re-built in a spacious area. It was opened for public on 27th September, 2008.\n\nThe building was constructed in eco-friendly style having a spacious area of four lakh square feet. Nearly 26 million specimens are preserved and looked after here by the managing committee consisting of forty one trustees who allocate duties to executive members. This academy is a scientific and educational institution “dedicated to exploring, explaining and sustain life on earth.”Apart from display of exhibits this academy arranges lectures, workshops, field trips and demo classes on bio-diversity, taxonomy, anthropology, marine biology, herpetology, ichthyology and phylogenetics.\nKimhall Natural History Museum has three sections; The Osher Rain Forest, Aquarium and Africa Hall (the oldest running exhibit). The Rain Forest section is housed under a 90 foot glass dome kept at 82-85 Fahrenheit temperature with 75% of humidity in air to suit the rain forest flora and fauna. Various trees and plants from Borneo, Madagascar and Costa Rica are seen on three floors as we climb the stairs enclosed on both sides by glass covering. Huge palms, mahogany trees, orchids and others with dark green leaves take us into the world of nature filled with so many different kinds of plants and flowers. Colorful butterflies, moths and birds are seen flitting all around. Under the first floor the Amazonian forest is displayed with flooding waters. One can also see various types of reptiles and amphibians kept in glass cases. Nearly 1600 live animals are displayed here and one is surprised to see so many different kinds of snakes and frogs. In Steinhart Aquarium various types of fishes, corals, crabs, sea anemones, urchins, stingrays, star fish, and snails are displayed. The aquarium is the star attraction of this place. Many children love to see the bright colored fish and multicolored corals and urchins.\n\nThe Tusher African Hall is another place of attraction to see lifelike models of various jungle animals displayed in glass cases. At the entrance “Human odyssey” the evolution of man is shown by display of various human fossils and skulls. The computer animation of the famous Lucy skeleton shows how changes occurred in physical structure of human species in course of time. The models of African animals like the tiger, the lion, the rhino, the elephant and the antelope are quite realistic and impressive. At one of the hall within a glass enclosure are kept the African penguins which dip and dive in the 25,000 liter water tank. In the East Wing one can see Foucault pendulum, a huge 16-ich diameter brass ball weighing about 238 pounds hung from the ceiling by an aircraft control wire. It demonstrates the earth’s rotating movement on its axis. In the West Wing many geophysical exhibits are shown in various glass cases. There are nearly four hundred types of various mineral rocks and gems in this section.\n\nIn the Earthquake section a lot of information is given about the occurrence of earthquakes with details photos and models. The effect of earthquake is practically experienced in the chamber by technological simulation. As we had to hurry to get into the planetarium we did not spend much time there to know about earthquakes. The Morrison Planetarium is one of the largest completely digital planetariums with a spacious dome above measuring about ninety feet in diameter and with a seventy five feet broad screen. The introducer gave a lecture about the theme of earth’s evolution and galaxies with their enormous size and numbers. The appearance and features of Pluto were clearly projected on the screen. But we felt it would be better to give more visual details instead of verbal explanation. Details may be shown on the screen itself. At the Naturalist Center many books, toys, specimens, printed T-shirts, films and interactive games are available. In the main hall skeleton of a blue whale is displayed while in another hall the huge skeleton of Tyrannosaurus Rex is seen. At another place the huge skeleton of 87-foot long blue whale is seen suspended from the roof.\n\nAt the Science Project one can look at the scientists working on real, live research projects and also at several smaller exhibits. But most of the scientific research work is carried out in private labs. This institution publishes a journal called “Proceedings od the California Academy of Sciences” to inform people about their latest discoveries and information. In 2011 scientists of this institution went on an expedition to Phillipines and discovered nearly three hundred species quite unknown to science.\nThis Museum is open from 9.30 a.m. to 5.00 p.m. from Monday to Saturday and from 11.00 a.m. to 5.00 p.m. on Sundays. At present the Rain Forest section has been closed from 5th September to 12th October as renovation works are going on. The entry ticket for adults is 35.75 dollars, 30.95 for senior citizens and for those aged between 12 and 17 years and 25.95 dollars for children below twelve years. The authorities may consider reducing the entry fee to facilitate more people coming to this museum and get enough knowledge and awareness in protection of the surroundings and our fellow creatures as well.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Great Museum", "This was one of the best Natural Science Museums we have been to. Very good displays and aquarium and reptiles. The earthquake exhibit was awesome. Great setting in Golden Gate Park as well."], ["Reviewed September 24, 2017", 5.0, "Highly Recommended", "I am a science lover (Physics major) and had a great time here. I was with friends who are not of a scientific background and they enjoyed it too. We saw 2 shows at the planetarium (recommended), 1 about dark matter in the universe and the other a session on earthquakes (very apt considering the location). The aquarium was interesting and interactive with some fantastic creatures. The rainforest was under maintenance when we visited, which was a shame and in my opinion should have made for a discounted ticket but overall well worth spending a few hrs here.\nWhilst we didn't have children in our party, there are facilities, activities and stores aimed for budding scientists.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Interesting museum in Golden Gate Park", "Helps to buy a city pass for museums in Sa Francisco dye to their cost, especially this one and the Exploratorium. We did not allow enough time to get here from Fisherman's Wharf and visit CAS. Needed longer than an hour or so. Fun exhibits, especially the rain forest, aquarium with a little bubble so you felt like you were right in the water. We also saw butterflies in the rainforest. Would have liked to go to the planetarium. Sign up when you first arrive and be sure to save enough time. We coupled this visit with a walk along the sea. Perfect.\nShow less"], ["Reviewed September 21, 2017", 3.0, "Lots of interesting exhibits but expensive", "Visited here on a weekday recently. Really enjoyed the planetarium and the aquarium, unfortunately the rainforest exhibit was closed for renovations. Although we really enjoyed what we saw, we found the price of entry ($35) pretty hefty considering we saw everything that was open and were ready to leave in just over 2 hours. The restaurant has a pretty decent selection (burgers, salad bowls, sushi)\nShow less"], ["Reviewed September 21, 2017", 4.0, "Worth visiting especially if the weather is poor", "Lots of exibits ranging from the old fashioned dioramas to more modern interactive earth quake simulator and rainforest.\n\nAquarium and touch pools, reptiles and spiders (didn't go near them).\n\nThere is also the famous alibino alligator. You could probably do it all in 3-4 hours once done you are a quick walk to the modern art museum and the Japanese Tea Garden.\n\nShow less"], ["Reviewed September 20, 2017", 5.0, "So much to see!", "This place is a natural history museum, aquarium, planetarium, and interactive science center all rolled into one! Great for kids and adults alike. Be sure to sign up for tickets to a planetarium show. Informative and calming during a busy day. This is a must see. We were able to use our CityPass for this site and it was well worth it.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Spent half the visit waiting in line", "My husband, mother, and I paid the California Academy of Sciences a visit because we had purchased the CityPass and it was an included attraction. The available day for us was a Sunday and the museum didn't open until 11am, which I thought was unreasonably late. We spent time in the rose garden in Golden Gate Park and headed to the Academy shortly before 11am and were astonished to find a line of hundreds of people waiting to get in when it opened. Luckily the line moved fairly quickly, but then we went straight to another line to get tickets for the IMAX (included with admission, but tickets required). We were instructed to return to the theater 10 minutes before showtime and when we did, we were the last people in line (didn't want to spend our entire visit in line when we couldn't get into the theater before show time). Fortunately we were able to find seats together (in the front). We also waited in line for the earthquake house and the rainforest. The aquarium was so packed, you could hardly move. I thought there were lots of really good exhibits, but the crowds and lines really detracted from the experience.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Excellent Displays and Presentations", "Our second day in San Francisco and we both decided to attend the California Academy of Sciences. This was an exceptionally good decision.\nEverything we saw and experienced we enjoyed.\nIn the Planetarium we attended Incoming, Earthquake and Tout of the Universe - all were amazing experiences.\nWe wandered throughout the museum for about 5 hours, and there was more to see and experience.\nThis is a great place to visit, experience and learn for all ages.\nShow less"], ["Reviewed September 19, 2017", 5.0, "We've been twice this month!", "This museum has blown my mind. I lOVE it!! We love the butterflies then directly to the Aquarium. The layout flows very nicely. All the additional exhibits are amazing! We will go back again soon. So much to see! Cafe has really great food!!! Not the usual food options which I was thrilled to see. The outside seating is lovely also. Each time we go, we find another reason to go back.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Something For Everyone", "The aquarium here is outstanding. The planetarium here is outstanding. The rain forest dome is ok, and the parking is pretty easy. This is a definite family group must see. Enjoyed the afternoon we spent here."], ["Reviewed September 17, 2017", 4.0, "Save the Planet!", "A very interesting museum, with plenty of hands on things to do for the younger members of the family.\nThe penguins are real, but other big animals are stuffed! Plent of displays with regard to the evolution of man, and ways to save it. Great display of Coral Reef, and the fish that live in and around it\nShow less"], ["Reviewed September 16, 2017", 5.0, "Very interesting.", "Lots of families there today. Saturday is busy, as expected, but we still enjoyed our visit. The 2 shows at the planetarium were also good. We used the pass out of the citipass booklet , which we have found to be great value."], ["Reviewed September 16, 2017", 5.0, "Great", "Great place for the entire family, lots to see and enjoy and interact and the aquarium was an unexpected delight, restaurant on site , fun ,fun ,fun😎"], ["Reviewed September 15, 2017", 5.0, "A Must for Families", "All ages will enjoy, however it's especially great for children. Don't miss the planetarium. Parking is easy. The food is okay."], ["Reviewed September 15, 2017", 5.0, "Wonder-filled visit!", "From the living roof to the aquarium, earthquake exhibit and planetarium we had an engaging and thought-provoking visit. Looking forward to bringing our 4-yr-old next time."], ["Reviewed September 14, 2017", 3.0, "Good place for kids to get interest on sciences", "It's good place for the kids, specially small kids, to explore to science and get interested in sciences. The newly remodeled building is eco friendly and go to the top for a view of the top of a building is worth to do."], ["Reviewed September 13, 2017", 5.0, "Lots to see at the California Academy of Sciences", "We enjoy coming to the California Academy of Sciences when we come to San Francisco. There is so much to see here that we spent the entire day here. We enjoy the museums in San Francisco but don't go until we can stay the week because the drive is too long from the south bay. It's fun to be tourists in San Francisco because there is so much to see and do. We just got a week-long transportation pass that allows you to ride the cable cars, buses and street cars all week. I will definitely be back and I would definitely recommend it to others.\nShow less"], ["Reviewed September 10, 2017", 5.0, "A Great Stop for All Ages", "We stumbled upon the California Academy of Sciences during a trip to the park. I'm so glad we did! We loved everything about it- the aquarium was definitely our favorite part. The planetarium, butterflies, and penguins were also fabulous!"], ["Reviewed September 10, 2017", 4.0, "Worth it if you are in San Francisco for a while", "By the time we had reached our final days of our week long visit, we had seen a large portion of the city. We decided to head to the California Academy of Sciences to start our final full day in the city, and we were not disappointed. While we only stayed for a few hours, you can easily fill half a day here. Worth it for the views of the Rainforest, Aquarium, and the Earthquake simulator!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Horizon School Field Trip", "We only had three hours to visit, but we were able to see a lot of exhibits. One of the main attractions was closed (the rain forest) but there was enough other things to keep children and adults busy."], ["Reviewed September 8, 2017", 5.0, "FAsniating", "Butterflies Stingray Snakes Africa so many different things to see Very enjoyable and informative without being too overwhelming Would definitely recommend friends when they come to San Francisco on holidays"], ["Reviewed September 8, 2017", 4.0, "Pretty nice. Can get crowded.", "Another Citypass activity. I don't even know what time period you should avoid if you don't want a huge crowd, but expect a nice crowd at all times. That means for some activities you do have to get a ticket for a 20-40 minute wait line (next show). Overall this is a nice museum.\nShow less"], ["Reviewed September 8, 2017", 3.0, "It was a lot smaller then we expected", "We visited the museum of history in Los angeles as well as London a few years ago, so we had high hopes for the Acadamy of sciences.\nWe were kind of disappointed price wise. There was not that much to see and if you wanted to see the other exhibits, you had to pay extra (we thought the normal admission was pricey enough)\nWe did like the aquarium though.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Buy it as part of a package to get best price", "This is the place to go to when the weathers bad. Family friendly it offers a wide range of interesting mind enhancing activities an aquarium, planetarium, and rain forest. There are presentations in the planetarium on planets and earthquakes. There is also an interactive earthquake experience which allows you to feel what it's like to be in the middle of an earthquake. There is an underground car park but you can get 4hours free parking on the street close by.\nShow less"], ["Reviewed September 7, 2017", 2.0, "Very expensive, and geared more towards children than adult visitors?", "This museum is focused very much on natural science and has three main attractions; an aquarium, a rainforest and a planetarium. The aquarium was very interesting and gives a great insight into marine life. The planetarium show was rather underwhelming, with rather fuzzy imagery and an emphasis on just how much we don't know about dark matter and dark energy. We left feeling none the wiser! We cannot comment on the rainforest as this exhibit was closed for maintenance when we visited. The visitors were mainly family and school groups with young children, who seemed to be (noisily!) enjoying themselves. Perhaps that's really this museum's target audience? The adult entry fee was very steep at $35.95 and a bit outrageous, given the temporary closure of a major exhibit (which was, admittedly, signposted before entry).\nShow less"], ["Reviewed September 7, 2017", 4.0, "Small but a fun few hours", "The aquariums are worth the trip alone. The Alligator is overrated, its just an albino gator in a tank. But the earthquake room was fun. Rainforest was under construction"], ["Reviewed September 6, 2017", 5.0, "Revolving Exhibits from eras gone by!", "The Academy of Sciences is a wonderful amalgam of historical & current day exhibits from the Reefs of the Philippine Islands in the massive Aquarium to the Planetarium shows to delight the senses & infuse your mind with amazing exhibits. Ever see an albino Alligator?"], ["Reviewed September 6, 2017", 5.0, "Great for all ages", "Wide variety of exhibits ranging from anacondas to gemstones to dinosaur fossils. Made this super fun and informative for myself, wife and 7 year old.Everything was amazing, and would certainly go back.\nThe ImaX movie about astronomy was very entertaining, as was the crystal collection and aquarium and rain forest and you can also experience both the california earth quakes. You can certainly spend a whole day getting entertained and informed at the same time. Great for all ages\nShow less"], ["Reviewed September 6, 2017", 4.0, "Excellent learning for the family", "A busy day at the Academy.Long queues that move fast.The dining options are limited for vegetarians and ' halaal' needs.It was extremely enjoyable and easy to access with the hop on hop off."], ["Reviewed September 5, 2017", 5.0, "Superb Science Museum in SF for all ages", "This place is definitely worth going to! The exhibits are first rate and interactive. The building itself is worth seeing. Nice cafe with inside/outside options. Be sure to visit the \"living roof\" too!"], ["Reviewed September 4, 2017", 2.0, "Very busy", "This place was so busy, not only do you have to queue to get in, you have to queue for everything inside as well. You also have to go get tickets to go in half the attractions which give you a time to come back, so we didn't bother as we didn't plan to spend the whole day here.\n\nI've never met ruder staff than at the coffee shop in the food court, argued with every customer infront of me and then with me too.\n\nThe dinosaur bit has some interactive areas but you can't get near it for the kids.\n\nWe went in because we had the go San Francisco card and admission is included but I probably wouldn't go again if I didn't have this card.\nShow less"], ["Reviewed September 3, 2017", 3.0, "Interesting but a flawed experience...", "We visited on a very hot day.\n\nThe queue for the tickets was short and we were soon inside.\n\nThe first thing to say is that there are a lot of hands on exhibits, which is great. What is not so great, at least on the day we visited, was kids running around everywhere, often screaming as they did so. This was especially annoying and off-putting in the enclosed areas, such as the aquarium. Whilst on the subject of kids, the signs such as don't tap,the glass or don't touch the butterflies are a complete waste of effort...\n\nThe rainforest, at least the sections that were open, was good, especially the free flying butterflies.\n\nThe aquarium was also very interesting, especially many of the smaller tanks.\n\nThe penguin enclosure was not at all good - it appears to be far too small and not in keeping with the rest of the exhibits.\n\nThe entrance fee also seemed very expensive for what we experienced.\n\nSo, a good but flawed experience on the day we visited.\nShow less"], ["Reviewed September 2, 2017", 3.0, "A little bit of everything", "Firstly, attempt to go during school day hours because it is primarily small children and parents visiting. Secondly, do not go solely to see prehistoric fossils because you will be disappointed. This attraction focuses on many different areas of the natural planet, and does not go into enough depth to be satisfying for an adult with a passion for any of the exhibits. The aquarium was the best part, with aquatic species from across the world; however it is hard to look at all the tanks in a systematic order. The Africa exhibit was interesting, however the penguins at the end seemed extremely depressed in a small enclosure, with no sky light access; very disappointing in comparison to the penguin enclosure at a local zoo in England. The rainforest exhibit had some very beautiful butterflies, however it was clear it is still a work in progress as you could see tanks and creatures in a closed off areas still being prepared. All in all I would say it would be a good place to keep children entertained for a morning or afternoon, however it is too expensive to be worth visiting as an adult interested in natural science.\nShow less"], ["Reviewed September 1, 2017", 5.0, "Not cheap but a great value", "A cool and cloudy day in SF? The perfect antidote is the CAS. There is a lot here for everyone to do and see, regardless of age and can keep you occupied for a full morning or afternoon if you're game.\nWe used a CityPass for our trip, which includes admission to the academy. It's a great deal given the regular tariff is $36.95 for adults. With a family of four that adds up. But with a planetarium, aquarium and natural history museum under one roof you get a lot.\nA good idea is to plan your day around the planetarium shows, was they have timed tickets. This way you don't risk getting shut out and can see multiple shows. Tickets are given out in advance.\nThroughout its halls, the academy does a great job of presenting exhibits that are educational but neither simplistic nor pedantic. If two adults, a 12-year-old and 10-year-old can spend more than six hours there and never be bored, then you know they are doing something right.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Educational", "A fantastic site to spend a few hours, but be prepared for crowds and a lot of youngsters. Plenty to see and enjoy for all those with a scientific mind. Also as an added bonus are the grounds that the Academy is housed in. Some lovely peaceful walks can be had. Did not have enough time to get around all of the grounds as it was a group visit and we were under a time constraint.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Night time visit is a must", "We came to a night time event aimed at adults and it was amazing. I don't know why more museums don't offer this. Live music and bars available inside the museum, which provides a very relaxed and fun way to explore the museum.\n\nIt is a must to book this in advance but would definitely recommend.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Like a school trip", "Very warm. Not over cheap. Not as interesting as \"The Deep\". I'm sure it's very educational but just wasn't for me.\n\nWaited a considerable length of time to see the albino alligator twitch.... not sure if I can say that was worth it! The roof garden was also a bit dead tbh and in need of a good drop,of rain.\n\nNice beaver though....\nShow less"], ["Reviewed August 30, 2017", 5.0, "Expensive, but a nice attraction, just the same", "This is a good place to take people of all ages. Check with different city tour companies for discounts if you're going to be in San Francisco for a few days doing this type of activity. Go to the grass roof on this building; it's pretty unique.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Worth the entrance fee", "This place was fantastic and perfect for both adults and kids. They have an aquarium, planetarium, penguins and a multi level rainforest, as well as other exhibits. We only spent 2 and a half hours because we arrived late but could have easily spent longer. The planetarium was amazing, it's included in the entrance fee but you do have to pre pick up tickets from the stand outside it. We were also able to catch fish and penguin feeding sessions. It was quite interesting because the staff inside doing the feeding also had microphones and answered questions so it was very interactive. All the staff here at the various exhibits were very knowledgeable. The displays was all well planned and laid out. We paid 64.90 for 2 adults, after the $3 discount each for taking public transport.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Loved this place", "This place is so great, I couldn't believe that you can be in the rain forest and under the sea and even looking at the stars. This place is so educational for everyone. I enjoyed looking at everyone's faces with such joy. I wish that we had something like this closer to me.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Wonderful experience", "Anyone interested in nature or anyone having inquisitive children should not miss the California Academy of Sciences. The display of local and exotic fish are beautiful, and there are live penguins and reptiles to enchant children and a great African Hall filled with ancient specimens in classic scenes.\nDining in the cafe is excellent, and a visit to the natural roof top a must.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Amazing place for kids and adults", "This is an amazing place. Under one roof, a planetarium, rain forest and aquarium! With an 8 and 4 yr old, we had planned on staying maybe three hours , and wound up being there amost 5 hours"], ["Reviewed August 28, 2017", 5.0, "Save enough time to see all of this!", "We had California Academy of Sciences on both of our must see lists. We were there during the Summer of Love exhibit at the de Young museum and that was a lot of fun. We didn't leave enough time to see all of the de Young and the CA Academy of Sciences, which was unfortunate. What we did get to see was well worth the trip. I would return and spend more time next visit.\nShow less"], ["Reviewed August 28, 2017", 3.0, "Nice space, exhibits was okay", "took my 5 year old son here hoping to see some sharks at their aquarium. There weren't any :( He still enjoyed see some of the animal sculptures/statues. i personally found it boring and not worth $39 for admission."], ["Reviewed August 26, 2017", 5.0, "Worth the steep admission price", "Plan to spend most of a day to see it all and make it worth the price of admission. Make sure to see a couple of dome planetarium movies: they are very good, no extra cost and again make your admission worth it. Bring a lunch if you can as the food in the cafeteria is super expensive.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Great Fun, Varies Exhibits", "We loved this museum. Our favorite exhibit was the Pterosaur exhibit which has great information, models, bones and an interactive wii type game where you are the pterosaur. We also really liked their color exhibit, rain forest with butterflies and the albino alligator."], ["Reviewed August 25, 2017", 5.0, "Awesome Place!", "My son wife and I had a great time. The place was very clean and the staff was very friendly. Everything was great about this place."], ["Reviewed August 24, 2017", 5.0, "Amazing, Friendly and Light!", "My daughter who is 34 and I attended last September for the entire day and had a wonderful time here. I wished we had gotten there when they opened the doors because there is so much to see. Wonderful, wonderful place!! Lots of interaction yet plenty of quiet too, if you need it. The Docents made our experience very special!\nShow less"], ["Reviewed August 23, 2017", 4.0, "Kids will love this place", "highlight for me was the butterfly house and the aquarium. Allow a full day or it is too much and remember to book your Planetarium ticket as soon as you get in."], ["Reviewed August 23, 2017", 5.0, "lot to see", "we went in the california academy of sciences for the nightlife, we have really appreciate to visiting the aquarium and the planetarium. it's not a big nightlife, because everybody is occupied to visit the building, but it's a good way to visit at low cost if you don't have children with you. Else go visit the place in the day to see the white crocodile and plenty of nice fishes.\nShow less"], ["Reviewed August 22, 2017", 5.0, "great way to spend an afternoon", "Lots to do in this wonderful museum.We especially loved the planetarium shows and the roof garden.Plenty of staff around to answer your questions"], ["Reviewed August 22, 2017", 5.0, "Very Interesting - great place to spend a rainy day", "The rainforest and aquarium are amazing! Make sure you have reservations for the planetarium. Admission is pricey, but worth it."], ["Reviewed August 21, 2017", 4.0, "Spur of the moment idea", "Very nice place. A lot of people. We only stayed a couple of hours. Really enjoyed the aqarium. Thought it was a little expensive for tickets and parking."], ["Reviewed August 21, 2017", 5.0, "Fun museum even for adults", "This museum has a really cool planetarium and butterfly exhibit. I'd also recommend the aquarium. Go during the week to avoid the crowds."], ["Reviewed August 21, 2017", 5.0, "Solar Eclipse Day", "Lots of people but the staff was very helpful. The view inside of the planetarium was great! And so was the presentation on eclipses. Mary the narrator was great. The other exhibits inside were also educational and fun for all ages."], ["Reviewed August 21, 2017", 2.0, "The loss of wonder and knowledge", "In the middle of the most amazing man made park in the world, California Academy of Sciences and Steinhart aquarium has had two renovations over it's many years. The first was an improvement, the last one a disaster. When I was a kid it was free, mysterious and awesome. The first renovation added a new greeting hall in the front and you were greeted by a big Allosaurus skeleton. It had many Great Halls. The Hall of Minerals, North American Hall, Steinhart Aquarium, Simson African Hall, Science Hall, Morrison Planetarium, The Hall of Man and more. It was deeply involved in education and it's darkly lit halls let the treasures shine all the more brightly. I'm sure it was responsible for turning many a fascinated child into todays scientists.\n\nThen the mistake. In 2008 the new \"Academy\" opened. Gone were the Great Halls, gone were all the reptiles surrounding the alligators and crocodiles, gone were the fantastic dioramas painted and sculpted by the finest artists, gone was the playful genius of Gary Larson's \"The Far Side\" twisted view of science. And gone was the inspiration of the youth.\n\nInstead, they hired an architect who's sole desire, it would seem, was to show off his building and forget about the fantastic wonders that should have been inside. They boast about the \"Living Roof\"! Who needs a living roof when you are surrounded by Golden Gate Park?!\n\nNow when you pay your outrageous $36 entry, you are greeted not by a dinosaur, but a big restaurant! One of three! Serving regretful food at regretful prices. Food is not why you go to a museum.\n\nIt boast a huge \"Open Space\" with lots of air empty of exhibits apart from printed info panels. Even the great whale skeleton is hung so high that it cannot be fully appreciated.\n\nThe Aquarium might have an enormous tank, but the intimacy and fascination are missing. The Planetarium may be state of the art, but what they gained in digital CG they lost when they threw out the Zeiss star projector.\n\nI'm very sad believing that my beloved Academy will no longer inspirer young, would be, scientists as in did in my youth. Two thumbs down. My whole family were members for three generations, I even worked summers there. I will not go back. It has become a money making travesty, not the awe inspiring institute is once was.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Great value ! Free with the Citypass", "California Academy of science was A wonderful experience I would highly recommend this for anyone, but families traveling with any age children this is a must. There is a planetarium with numerous shows each day. There are many hands on exhibits, a beautiful aquarium with coral reefs from around the world in the Steiner aquarium on site, hands on an inner active learning areas with live snakes and penguins. This is located in the absolutely beautiful Golden Gate Park area which is an entire days adventure all by itself.\nShow less"]]}}