{"California State Capitol Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "California State Capitol Museum", "url": "/Attraction_Review-g32999-d219610-Reviews-California_State_Capitol_Museum-Sacramento_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/e9/fc/7c/contact-information.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1183"}, "address": {"@type": "PostalAddress", "streetAddress": "1315 10th Street Room B-27", "addressLocality": "Sacramento", "addressRegion": "California", "postalCode": "95814", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Intriguing", "What a Beautiful building i see where all Californias money has been spent. Full of tourists. Such beautiful decor."], ["Reviewed 2 weeks ago", 4.0, "Very Worthwhile", "California has a beautiful State Capitol building. It is a combination of the old Capitol and an updated building that was joined together and it works. Definitely take a tour and stop by to visit your Assemblyman and Senator. Tours are free."], ["Reviewed 2 weeks ago", 5.0, "Beautiful building and surrounding grounds, great tours with enthusiastic guides, gift shop, art, & history!", "This is a great place to visit with your family if you have an interest in California history, or if you enjoy learning and seeing art, and getting a peek at how local government works.\n\nThe capitol is situated in a large park with many beautiful shade trees, lush grass, and many walking areas. The building itself is beautiful and meticulously maintained. There are some art tiles installed outside one of the entrances that shouldn't be missed.\n\nWhen entering, expect to pass through a metal detector and have your bag(s) searched, as this is a working government office. Once inside, there are a lot of areas to explore. Each of California's counties is represented by a diorama, and they line the hallways for you to check out. There are a few impressive sculptures to admire, and many paintings throughout the building. There are former government offices that have been preserved for viewing (behind a velvet rope), which are really fun to look at.\n\nWe took a great tour with a friendly, enthusiastic guide. On the tour, we were able to sit in on actual state government sessions, which was fascinating. There is also a great, small gift shop which features books and the other typical museum stuff, as well as handmade art created by local artisans with disabilities.\n\nOverall, I was very impressed with the beauty and history of the capitol. I would recommend it to anyone in the area!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Knowing more about California's history makes you enjoy the city even more!", "Since retiring from his job my friend Keith Evans, has signed on to give tours of the State Capitol Museum. As a former teacher in Sacramento I didn't feel the need to go because I thought I knew enough about Sacramento! I was so wrong! During a visit from New Jersey I took my granddaughter, a Sacramento native for twenty -three years, and went on the tour. I was impressed with how well the building and everything in it was so well maintained! The meaning of so many items and how significant the building is to California history was astounding! We enjoyed the tour and the tour guides knowledge!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Not to be Missed, If You Want to Really Experience Sacramento", "The California State Capitol is the far and away BEST attraction in Sacramento. I have toured it many times, and never tire of seeing its many treasures. The Docent/Tour Guides are extremely dedicated to their work and well education in all the facets of this historical jewel. If you come to Sacramento, you MUST come to the Capitol and take the guided tour. You will always remember the experience Trust me, I know!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Perfect place for a family outing!!!", "We had the chance to visit the State Capitol and it was a great family experience. Sacramento is one of the \"Greenest\" cities in the U.S. and it is noticeable. A lot of green areas refreshed the busy streets of the California's Capitol! Perfect for a stroll and to take some pretty cool pictures. If you visit NorCal don't miss this landmark!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Nice job California!", "The state capital was deteriorating. The craftsmanship that built 100 yrs ago was failing. Then, for our nations 200th birthday, California stepped up -pain the money, hired the craftsman from around the world to make our building shine like it was first built. If you’re coming to Sacramento take the time for a tour- and see craftsmanship like you haven’t seen in awhile.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Nice place to visit", "The grounds are nice and there are many activities and events that are held here on the ground and or start or finish here. Take some time to go inside and take a look around and get a history lesson. If you have out of town guests it’s a nice starting place when exploring the downtown area.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Historic beauty and stately educational and legislative building", "Beautifully restored state capital building, great brochure for self-guided tour, safe visit ensured through required scanned entry. Lovely tiled floor, historic paintings, beautiful dome. Go to 3rd floor and work your way down. Go in both galleries, no floor entry."], ["Reviewed January 18, 2018", 2.0, "Surprisingly unimpressive for such a populous and powerful state", "Our family (4 kids ages 5-14) visited to compare it with our own State's capitol (a smaller state than CA in ever way) and were entirely underwhelmed. We missed the guided tour - they begin on the hour, so if you want to hit it, plan accordingly. Our little people couldn't hang tight for 30 minutes, and by the time we had showed ourselves around, it didn't seem worth spending more time in the building. I was surprised by the smallness of the capitol, and the run-down appearance of the portion I assume was built in the 70's. The map we were given was terribly produced: black and white, poor layout, looked like it was made on an old hand-crank ditto machine and designed in some ancient computer program, and was not helpful. I looked all over for the \"museum\" and concluded after walking the whole building that the building itself must be the museum. If so, it was a terrible museum in every way. Was quite disappointed that so few of the offices, while one was able to see inside, were not in use of any kind and only re-created to look like what they once did. No info/signage/history posted on those few, re-created rooms. I compare all this to our home state where one can walk in the governors office which IS in use AS the governor's office and beautifully kept in it's historic form. Also, compared to our home state, I was shocked at the lack of art of any kind, including murals and sculptures depicting state history. Not being from CA, the county displays were not of interest but I noted many seemed dated. We saw the Senate chamber, which was lovely and grand, but over-all, I expected more of the building to be like it - lovely, grand, currently used, and it was not. We watched a film in the basement about the preservation. It was quite dated as well - info was good, but pacing and graphics reflected its age. Overall, I was very glad we went for the opportunity to compare and contrast. And even more glad it wasn't my state capitol.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Experience our Capitol!", "After driving through the United States and visiting several state capitols...I am proud to say the California State Capitol and Museum is truly beautiful. The docents that were available to provide tours were not only informative but very friendly and welcoming. Explore the grounds and various monuments and gardens representing different parts of California and save time for the beautiful rose garden. The photograph provided may be dated though, they no longer run the water fountain on regular bases due to water shortages.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Great tour, interesting history.", "We toured the beautiful building while on vacation. It was very beautiful, the tour guide was informative - everything was fascinating.\nShow less"], ["Reviewed January 9, 2018", 5.0, "The tour was amazing!", "The tour docents were so informative. I am a native Californian and learned so much on this tour! Not difficult to manage and fully accessible for ADA.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Smaller than expected", "I recommend that you take a public tour that way you get to see off limit place that you wouldn't otherwise get to see (both chambers). In the walkway they have a shadow box for every county in the state. The governor's off has a giant \"golden bear\" in front of the off to keep press away (only kinda kidding). The hall of governors is pretty neat. Overall. was much smaller than expected, but nice visit.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Must visit when travelling to Sacramento", "I'm a local, and worked at the Capitol and just love the beautiful architecture of this building. The wood and marble are truly something to see."], ["Reviewed December 29, 2017", 5.0, "Lovely visit", "We did the tour, and would highly recommend it. It is free, informative and a great way to learn about the building and California’s past."], ["Reviewed December 26, 2017", 5.0, "Wow, this is the place to visit", "The orange trees and gardens are stunning, even in December. We arrived early so as to get a good parking spot. We wandered the massive gardens before going through security to visit the State Capitol. We enjoyed the exhibits that described each California county. Inside is a statue of Ronald Reagan, great for getting a selfie.\n\nThe visit was great. Our only disappointment was that we couldn't get our Capitol Collections book stamped to show that we had visited. When we asked about the stamp, the staff weren't aware of one. For those with a goal to visit all 50 states, pick up a Capitol Collections book at any state capitol and receive a stamp with the date visited.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Awesome time!", "If you love history and want to learn about California check this out. Took the kids and they were amazed we were allowed inside to tour...Free tour! Architecture is beautiful. Lots of cool things to see inside."], ["Reviewed December 21, 2017", 4.0, "Wonderful experience", "We had a nice visit. We went during the holidays and they had a group preforming with bells to Chrismas music under the dome. very nice and the Christmas tree is spectacular"], ["Reviewed December 21, 2017", 5.0, "I must visit", "The grounds of the California State Capitol are absolutely spectacular. Along the many pathways you can learn about the history of California as well as the flowers that were planted. Again, it is a \"must see\" for anyone."], ["Reviewed December 17, 2017", 5.0, "Great place to work", "I came to work on my laptop, walked from my hotel. Excellent place to sit on a bench and type on my laptop. Beautiful grounds."], ["Reviewed December 13, 2017", 5.0, "A Capitol to be Proud Of", "Any first time visitor to Sacramento should walk the halls of this beautiful, historic building. The woodwork is outstanding and the architecture is impressive."], ["Reviewed December 12, 2017", 5.0, "A Beautiful Building and a Wonderful Restoration", "Beautifully restored interior and exterior, The floor mosaics are unbelievable as is all of the art and historical displays throughout the entire tour."], ["Reviewed December 10, 2017", 5.0, "Worth checking out", "We were passing time and walking the grounds and went in to see our capital. Was worth the time and interesting too"], ["Reviewed December 9, 2017", 5.0, "Historical Tour with out of town guests", "We took a memorable tour of our California State Capitol with visiting guests. Our guests were just amazed and happy to see our State Capitol and the immaculate grounds surrounding this magnificent and stately building.\n\nThis tour is given free of charge and the tour guides walk you through the Capitol so that you are able to see the senate and assembly chambers. The guides give you the history, stories, and interesting episodes conducted within the building. You can see how magnificently built this Capitol is and gain a historical and contemporary perspective of the workings and transactions that happen within this structure. The guides present well, thoughtful of visitors and have a passion for their work which make the tours interesting, entertaining and memorable.\n\nThere is a restaurant and gift store within the Capitol too.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Sacramento's Capitol is a highlight", "i always take out of town visitors to the capitol. The beautiful white marble statue of Columbus in the entry was a gift to the state by the city of Genova, Italy. Make sure to also visit the Senate and Representative rooms, Also make time to visit the gorgeous grounds and the monuments to our nation's fallen soldiers and firefighters.\nShow less"], ["Reviewed November 28, 2017", 4.0, "Interesting state capital and museum", "We love visiting state capitals when in any state and we had the opportunity to visit Califórnia’s this past week. There are free tours as well as a museum highlighting all the counties of CA and special periods of the States growth, it is a good historical tour.\nShow less"], ["Reviewed November 22, 2017", 5.0, "I live here so I'm prejudiced", "Took my wife down here because she had never been in the capitol building. It's a beautiful old building that's been restored to its original grandeur. There are galleries to look on both sides of Congress. It cost nothing to go in and enjoy the history of the building. The grounds are beautiful with many monuments and beautiful flowers. It is a lovely place to go on a clear day and just walk around.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Beautiful building", "If you have never visited the California State Capitol, you should definitely attend one of the free guided tours.\nWe spent one hour and a half going through the building, learned a lot about the history of California and the design choices made when the Capitole was build.\nOur guide was super nice and we would definitely recommend the visit!\nShow less"], ["Reviewed November 19, 2017", 5.0, "Outstanding Architecture", "This building is rich in history and exquisite architectural detail. Everything from the inlaid tile floors ti the staun-glassed dome is in immaculate condition. I highly recommend visting the California State Capital building."], ["Reviewed November 15, 2017", 5.0, "Make time to see it", "It can be as quick or as long as you like but make time to see this. The building is beautiful, full of history; we missed the tour, that was disappointing but looked around ourselves."], ["Reviewed November 14, 2017", 4.0, "Worth a visit for history fans and the civic minded", "After the initial security screening the capitol building is generally accessible for free wheeling around and exploring. I was able to view the House gallery and enjoyed the offices that recreated the look and feel of the \"old days.\" The portraits of all the former governors were amusing in their variety of art styles. There is a statue of Reagan that was very poorly done. Sad.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Governors Regan and Schwarzenneger", "Paintings of both these larger than life figures on the same wall was worth the visit. Vintage preserved offices and Senate chamber also noteworthy. Hard to find parking though..maybe use a parking app to reserve."], ["Reviewed November 11, 2017", 5.0, "Beautiful historic building", "From the collection of trees on the capitol grounds to the historical rooms and portraits of past governors it is a great tour. Avoid the school children that tour during the weekdays by stopping by on the weekends."], ["Reviewed November 10, 2017", 5.0, "Full of History", "I use to work there and I was always in awe of this beautiful building with so much history. I have taken many of the tours and learn so much about this amazing place and it's history. The grounds are also beautiful. Young or old, it is a place you will want to go!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Take tour and learn about our government", "This building has so much going on both inside and outside: architecturally stunning, landscape full of trees and monuments, interior immaculately restored with free docent lead tours a must.\nThere is a cafe in the basement along with a great gift shop. Good for all ages and anyone curious about how our laws are made.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Really enjoyed my self-guided tour", "Brought a visiting friend here, because one never visits the places where one lives otherwise, and we had a lovely time. The little historical library was fascinating with it's beautifully displayed vintage volumes and the short film, narrated by Burgess Meredith (the Penguin!) was very informative. The gift shop is small'ish but had a nice variety of items and the cafe was perfectly adequate with the handsome, lifesize bronze statue of Ronald Reagan standing just outside. Would highly recommend! Oh! there is security checkpoint upon entry and I had a bit of trouble getting through with my belt so be advised.\nShow less"], ["Reviewed November 9, 2017", 5.0, "School Field Trip", "Our trip was awesome!! We had a great guide and got to see the legislative floors and where all the bulls are discussed. Such awesome history and beautiful architecture. Great for kids 8 and up."], ["Reviewed November 9, 2017", 5.0, "California Capitol Building", "The place is amazing and I learned a lot about California government. They tour the place and tell the history of the rooms and grounds."], ["Reviewed November 8, 2017", 5.0, "California capitol", "Interesting visit to the capitol building in Sacramento which is well preserved 1869 (then added to) building surrounded by government offices (one of which had to visit).\n\nThe 1st floor has offices kept as a museum while 2nd floor is the current senate and representatives assemblies while 3rd floor has visitor galleries and the halls have portraits of governors. There are hourly free tours and brochures that are enough to do it on your own like we did after helpful advice from a volunteer manning the place.\n\nParked at the Capitol parking lot and ate lunch at bakery below which was decent and seemed popular with locals. There is also a canteen in the basement of the capitol building which was cheap, but nearly empty (maybe gets full when parliament is in session or tour groups visit).\nShow less"], ["Reviewed November 6, 2017", 5.0, "This is worthwhile whether you are from California or elsewhere!", "The Capitol building is beautifully constructed and is magnificent to tour. There are movies telling the story of it's construction and history. Walking the halls while current state business is being conducted feels like a privilege!"], ["Reviewed October 28, 2017", 4.0, "A large& impressive state capital", "This building is large & impressive. The governor's office has several interesting historical exhibits. Parking is hard to find. I saw a sign for maybe 3 or 4 places for 1 hour free visitor parking close by but I couldn't figure out what places were free. There is metered parking & parking garages close by. The many 1 way streets close by make it hard to find a place to park for first time visitors.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Lucky to be the only one in a free tour", "I visited on a weekday morning and the fee tour by Richard became a private tour for me only. It's a very informative visit, about the history as well as the integration of people from different background. It was pity that the senate house and some other rooms are under construction. It took me a total of 2.5 hours, including 40-minute guide and 3 intro videos in the theater. Highly recommended.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Impressive Exterior and Interior: Excellentl Tour Guide", "September 11, 2017 - We have been to a few State Capitols over the last several years but the California State Capitol is one of the most impressive. We entered the side entrance which I think is the same entrance most legislators, lawyers, and other employees enter. Not long after entering, we made our way to the visitors office and found out that a tour was starting soon. Public tours are held daily starting at 9am and concluding at 5pm. You can call: (916) 324-0333. We and others assembled next to Ronald Reagan's statue. This area is surrounded by paintings of various events in the history of California.\n\nWe stayed in the Ronald Reagan statue area for about 15 minutes while the tour guide described the significance of each painting. Next, we walked up to the second floor where the doors faced the front of the building. Our tour guide described how the building was constructed and the modifications made over the years. We walked out to the center of the building where we could see a stained glass of the Great Seal of California and our guide explained each part of the Seal.\n\nThen, we walked up to the third floor where we visited the Senate Chamber with a very valuable painting of George Washington. She told us that the Senate desks had been replaced from the original while the Representative's desks had not been replace but refinished. The Senate Chamber is a very impressive room.\n\nFinally, we walked out the the hall area adjacent to steps going down. In this area are hung portraits of several California Governors like Jerry Brown and Arnold Schwarzenegger. Jerry Brown's portrait is quite different from the other portraits because it is a bright painting, not a painting that looks like a photograph.\n\nAfter the tour, we were able to wonder around on our own. We passed an area where each county has an indented wall area to display what makes that county special. This was very impressive and a lot of imagination and work went into the displays. We found the \"golden bear\" outside of the Governor's Office where the Governor poses for pictures. We also viewed one of several videos about the building. And, we saw one room (107) that was decorated just like the Governor's Office would have looked in 1907.\n\nAre you impressed yet? This was quite a visit: tour, wondering on our own, video, step back in time to 1907.\n\nYou have to visit the California State Capitol and Museum when you are in Sacramento.\n\n.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Checking out the capital", "This is a must check out when visiting the area...\n\nIf you find parking, it is worthwhile..\n\nThe whole area is really big... Plenty of spots for pictures...\n\nThey sometimes have political demonstrations here ..\n\nAlso, the homeless hang out here but we have never had a problem..\nShow less"], ["Reviewed October 10, 2017", 5.0, "Unexpected pleasure", "Needed to kill some time before an afternoon performance so toured the capital. Holy cow, what an amazing building and interesting history. Highly recommend if you have a couple of hours."], ["Reviewed October 10, 2017", 5.0, "Stately and impressive", "We always feel a sense of pride when we visit the Capitol building. The architecture and materials used are from another era and are not to be missed. Don't forget to look down at the marble floors and up at the ornate ceilings."], ["Reviewed October 6, 2017", 5.0, "State's displays are cool", "Inside the capital are displays for each county in California- I found these really cool and educational. My 6 and 10 year olds found them moderately entertaining. There is a bear statue you can get on for a great picture inside as well. I get a kick walking around the grounds and it is an easy walk to old town and the river walk if you want to make a day of it. There is a place to eat inside, but I would recommend packing a picnic to have on the lawn instead.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Free Tours inside the Capital Building", "A free docent tour of the CA State Capitol building is given every hour starting at 9:00, last tour is at 4 pm. The tour takes you throughout the main floor and into the legislative viewing area. The tour lasts about 45 minutes and is a great educational opportunity for Californians and visitors alike.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Sacramento Capitol Visit", "Visiting family in the Sacramento area. No one had visited the California Capitol. Went on a Saturday to the Capitol. No traffic and few visitors to the Capitol. Able to take a self guided free tour of the Capitol. Beautiful building and great tour. Very enjoyable and great for all ages.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Beautiful grounds and building", "I enjoyed touring California's State Capitol and Museum. Its a great history lesson. Well worth seeing."], ["Reviewed October 2, 2017", 5.0, "A throwback to the 1800s!", "I worked right across the street and have spent a lot of time in the Capitol bldg. Many rooms are original and decorated like they were in the early 1800s. Take an original gated elevator downstairs to the cafeteria which is all brick. It's a beautiful building.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Grand children time, tour to learn", "We highly recommend To go to the State Capitol, is a way to learn about CA history and all the legislatives laws . Architecture, the personnel working there all is great."], ["Reviewed October 2, 2017", 5.0, "The California State Capital and Museum is a great place to see and visit.", "The California State Capitol and Museum is a beautiful structure. You can walk around or take an elevator to see various parts of this historic building and learn about it's history. Great for the entire family."], ["Reviewed October 2, 2017", 5.0, "Great visit! Educational and free", "This is such a great stop for anyone in Sacramento. You can see government at work if the assembly or senate are in session. In fact, contact your local assembly member and they may be able to give you a specialized tour of the Capitol. Great for photo opts and new a cool if its 100 degrees outside. There's a cute gift shop in the basement The best part is its FREE. Sign up for the free tour. Lasts about 1 hour. Again, you can't go wrong with free and educational. Great for young and old.\nShow less"], ["Reviewed October 2, 2017", 4.0, "The center of Sacramento", "The State Capitol is beautifully preserved and a must see if you're in Sacramento! It's a historical museum in the middle of current events."], ["Reviewed September 29, 2017", 4.0, "State Capitol, Worth Going To", "It is hard to evaluate something which you have gone to so many times. But once you are in the building, we realize why we return to see the State’s Capitol building. Whatever your politics are, this is where our laws are made, where our futures are established. From pictures of our past governors to the assembly and senate rooms, there is an aire to the place which demands respect. So for that alone, it is worth going to see.\nThe Capitol Building was built with the US Capitol in mind. While not a replica, it does retain the sense of awe of the DC building. Inside the building are exhibits from each county. They range from pretty sophisticated to somewhat cheesy. There are free guided tours which you go on. They start in the basement. Very interesting.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Take the guided Tour", "If you visit the State Capital, you must take the guided tour to learn about CA history and the legislative process. A bit of walking is involved. There is garage parking nearby, O believe street metered parking is for two hours. Whether you live in CA or visiting I believe you enjoy the tour as well as the surrounding ground around the Capital.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Beautiful building", "I highly recommend California families with school age children to visit the Capitol. The interior is beautiful with dark wood and tile work. Governor Brown's picture to say the least is interesting. We wandered where we wanted to go, but there are tours avaiable."], ["Reviewed September 22, 2017", 3.0, "Should visit being a Californian, right?", "If you live in California, you should visit your state capitol once, right? Unfortunately I didn't have much time to take the tour etc, so just simpily looked around on my own. Going through the security, just like the ones they have at the airports, can be a hassle, and the gift shop on the basement floor, is not easy to find.\nAlso, if you are like me and just want to take some pictures and a brief tour on your own, park your car at the nearby roundabout for free. It's on Capitol Mall/Lincoln Highway between 10th and 9th street, where the California State Library- Stanley Mosk Library and the California State Treasures Offices are.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Great place to see with a very knowledgeable and enthusiastic tour guide.", "Eric our guide made us truly appreciate and learn more about the place and understand CA governance system. The tour is offered for free and is scheduled every hour from open till the last tour at 4pm."], ["Reviewed September 19, 2017", 5.0, "The Capitol", "Everyone should take the time to see the Capitol. You can take a tour, or get the map and go on your own. The portraits of the governors are very interesting, esp. Jerry Brown's."], ["Reviewed September 14, 2017", 5.0, "Great experience!", "Had to kill a bit of time and were given a recommendation to take the tour. Really glad we did. Learned a lot and had fun doing it!"], ["Reviewed September 13, 2017", 5.0, "A must stop, great for family!", "What better way to teach kids (over 10 yrs old I think) to know where the Laws are made and the history of the Capitol. Free entry, beautiful interior of this working Museum. Went on a Sunday so the Senate Chambers were not in session. The Docents are there to give you explanations, so make sure you speak with them on the goings on of each room and the history of the Capitol. Fun Facts: I didn't know there were 5 capitols before they had decided on a permanent site in Sacramento. Expect to be here a good 2-4 hours if you take your time, they also have Tours so you can really be educated on the history and facts. On weekdays, you will be able to listen in while the Senate and Assembly are in full session.\nShow less"], ["Reviewed September 13, 2017", 5.0, "That portrait of Jerry Brown is worth the tour!", "We had a wonderful time on our guided tour of the Capitol. Our guide was not only knowledgeable but thoroughly engaging. We learned about Bacteria Bear and other more notable sculptures throughout the capitol. The displays depicting each city were fun to review (and critique). Our tour included both chambers as well as the \"portrait row\" where all the governor's official portraits line the walls. Oh, Jerry! You represent California SO well! HIGHLY RECOMMEND!\nShow less"], ["Reviewed September 8, 2017", 5.0, "Loved the tour of the capitol", "anyone interested in history, architecture or california would enjoy seeing this capitol and taking the tour"], ["Reviewed September 8, 2017", 5.0, "Beautiful Counties", "Beautiful displays of California Counties. Each county has a display of the outstanding products, entertainment, and historic for that county. The rotunda is quite spectacular. The acustics are great! In addition, the grounds outside the capitol have an outstanding variety of trees and flora. You can even experience a tour to find out more about the varieties on display and the history of the development of the grounds. There is a monument on the grounds honoring American veterans. Local food is available close by across the street. Very informative and beautiful walk around the grounds as well as inside\nShow less"], ["Reviewed September 7, 2017", 5.0, "much better than I expected!", "very interesting and informative.. Wear some comfortable shoes and don't carry more than is necessary.spend the time to see everything available it takes 2 plus hours but I feel it is worth it."], ["Reviewed September 6, 2017", 5.0, "Surprisingly interesting historic building.", "We planned on dropping in for an hour and ended up spending three hours. The guided tour is well worth the time."], ["Reviewed September 6, 2017", 5.0, "Capital", "Great place to visit. Always take my out of town friends when visiting and always a big hit with everyone."], ["Reviewed August 28, 2017", 5.0, "Do it", "Beautiful building\nLots of history (including why Sacramento is the capital city)\nFree\nTyler doing the guided tour was great\nPlenty of other information\nRare original books / manuscripts in the section about the California State Library\n\nPark over the west side of the Tower Bridge a few blocks in residential streets as its free and you can just walk in, takes around 15 minutes and saves you $10-15 probably\nShow less"], ["Reviewed August 26, 2017", 4.0, "Conference Tour", "Attended a guided tour during a conference and was fantastic to see and hear the history of California's capital city. Our tour guide was very knowledgeable and had been associated with facility for many years which added to his ability to tell interesting stories."], ["Reviewed August 20, 2017", 5.0, "Fun", "Fun, low-key walk around the state capitol building. The building is very nice, and the grounds are well kept. It's a state capitol building."], ["Reviewed August 18, 2017", 5.0, "Entertaining", "Our tour guide was Jolene and she was amazing. We had a large group and her voice projected very well and she answered all questions expertly! The tours leave on the hour every hour. Allow yourself time to get thru security and to the meeting spot in the basement. The guards are very helpful at directing you.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Guided tour & a good look around!", "This was one of the highlights of our holiday.\n\nEven the security team who scanned our bags etc were welcoming, pleasant and friendly whilst being sufficiently vigilant for us to be confident that security standards are high!\n\nEric gave us a really great tour - about 30ish minutes and pitched at just the right level of detail. He zoomed in on detail when asked but made sure the little kids were also included. Of course, as Brits, we were fascinated by the unfamiliar political system in the US. But even so, the level of power exercised by the state government is significant and therefore very meaningful. It was great to understand how that works in California.\nThe history was also interesting and covered the birth of the state as well as the founding of the Capitol building in Sacramento. The imagery of the seal and of the Governors over the years was thought provoking and insightful. The portraits of the Governors of the State over the years were also historical vignettes of their times - especially that of the present Governor who has served one term already whose modern art portrait was innovative and compelling. And a great portrait of Arnie S. too - the epitome of a political film star!\n\nThere were also rooms set up as historical mementos of how offices and staterooms would have looked in the 19th Century.\nA very forbearing policeman from the Sherriff's office (have I got the right title?) next to the big brass bear outside the Governor's office - let us take his photo with my rather giggly sixteen year old. She was thrilled so thanks for being so obliging!\n\nNot sure if the Governor of the State of California ever reads Trip Advisor but your staff at the Capitol really do you proud - a great representation of the State and a very interesting experience. Civic pride the way it should be!\nShow less"], ["Reviewed August 16, 2017", 5.0, "First Time taking the tour not the last!", "My son just went to William Jessup University to play soccer. Never been there or in Sacramento. Stayed three days and took the state capitol tour. Wow! very nice and my son and I enjoyed it tons. I'll be taking many trips over the next four years to Sacramento to my son play soccer and plan on seeing everything! This tour was GREAT!\nShow less"], ["Reviewed August 13, 2017", 5.0, "Must see!", "We went on a Saturday morning and very little people which made it nice! Walked all over the inside areas. They have tours on the hour. One of the most beautiful capitols I've been in. Be sure to get the history of the marble statute inside the building. I never knew there was a California State library next door! I wished the cafeteria was open on the weekends just to get the full experience.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Interesting visit for preservationists", "Sacramento is a great place to live, but not much for visitors. The state Capitol is a gem, though. As in many states, the Capitol ended up in Sacramento after a few other stops. Tours usually tell you that history, and there are quirky details about people, secret tunnels, and interesting architectural features, many of which were uncovered and lovingly duplicated and repaired during a big overhaul in the 80s. In December there is free music during the noon hour every day in the Rotunda.\nShow less"], ["Reviewed August 10, 2017", 4.0, "A nice place to waste some time and learn about California.", "It was great to be so close to the capital while we stayed in Sacramento because we were short on funds and this gave us something totally free to go and experience while on our stay. The grounds are beautiful and well maintained. It's like an oasis in an otherwise filthy city. The architecture and details that went into the construction of this facility are fantastic. Other than looking and feeling like every other capital building in the entire united states, you get a feeling of nostalgia for our country and a time when craftsmanship and pride in a job well done still existed. The ornate carvings and the exquisite materials along with the basic upkeep of the structure really lend a glimpse of what life was like back when this structure was built. The free museum aspect is really nice and being able to peek into the offices of the past and see the way things looked in a working government building probably a century or more ago was really cool. They have a theater showing films about history and how legislation works.\n\nOverall, we had a very enjoyable time walking the halls and taking in the history. I would recommend that if you have time, make sure to stop by and see the facility. The price is right and it definitely deserves the attention.\n\nThanks for reading.\nShow less"], ["Reviewed August 9, 2017", 5.0, "it the capital of california what can one say", "its the center of all things politics in california...you need to know something, this is the place. want to learn california history, come here..."], ["Reviewed August 8, 2017", 5.0, "Just to visit cause I work nearby", "This is a very good muesum to see\nIt was so nice to see the various pictures that represented each county showing what they were famous for. Also u get to see what the governor's office used to look like. Very nice. Nest of all... it's free. So I would highly suggest that you go see this muesum and take a look at the park around the museum. I even found the redwood tree that went into space when it was a seedling!!! I think it's called the coastal redwood ..Nasa...Apollo 14 1971 Moon Tree. This tree is about 120 feet tall and well worth seeing.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Great place to visit", "We came here by coincident and was pleasantly surprised how great it was. The building is so rich on history and the wing open to the public was perfectly renovated to show the history on the institution. Had had a great afternoon with the kids."], ["Reviewed July 31, 2017", 5.0, "Great tour and history", "Fully enjoyed my tour of the capital building. It was very beautiful and historic. The building is beautiful inside and outside. Just walked during a few hours from attending business meetings. Very nice. Worth the trip."], ["Reviewed July 28, 2017", 5.0, "Great Tour Guide!", "It was our first time to visit the Capitol. We took the free guided tour and the guide was excellent. He was informative and interesting. The tour lasted about an hour and he was willing to stay after and answer questions."], ["Reviewed July 28, 2017", 5.0, "Great history", "Loved walking the grounds and interior and learning about the counties of California. I used to live here, but moved away a few years ago. It's strange to visit now that I moved away."], ["Reviewed July 22, 2017", 3.0, "Not bicycle, skateboard, skate, anything non foot friendly", "Eh, first state capitol I've ever been to that didn't allow anything with wheels near it. And that's saying a lot, since I've been to a TON of them. The building itself is gorgeous, and the park behind it is also equally nice, but I guess I didn't see much since I can't go in any further than the outside perimeter sidewalk.\nShow less"], ["Reviewed July 20, 2017", 5.0, "A lovely place to taken in a bit of history", "Pleasantly surprised by our visit. We did the self-guided tour as we were not sure how long our teenage children would want to stay - although there was an option for an hour long guided one.\nSaw a session in progress and wandered around the displays for each county.\nLearned a lot from our short visit - would definitely recommend this.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Visit to the Capital Bldg", "Great visit on the Veterans Memorial and inside the State Capital Bldg. rose gardens and statues are phenomenal! Must visit the halls of the Capital Bldg to see artifacts, photos and incorporated cities of California and what they're famous for."], ["Reviewed July 16, 2017", 5.0, "Took the free tour", "And it was really good. The tour guide was friendly, at ease, a little humorous and spoke loud enough for the group to hear. She also was knowledgeable as well. It took about an hour and seemed to go by rather quickly. We went upstairs and down stairs as she pointed out points of interest. Really good job! Take the tour--it can be overwhelming on where to go if you have not been, but to go it alone, they do have a self guided tour that can fit your need. Capital was busy with people a-buzz. Check your bags. They go through a scanner. I forgot about a pocket knife I had and some shell casings from a firearm target shoot earlier in the week in another state. They confiscated but returned the items to me up my exit. Finding a Parking spit can be tricky and it is metered. You can stroll through the park. On our visit they had music playing in the park ...but it was hot out!\nShow less"], ["Reviewed July 14, 2017", 5.0, "Excellent tour and introduction", "We thoroughly enjoyed our visit to the Capitol, and learnt a lot about California and Sacramento. Worthwhile for both national and international visitors. Worth doing the tour."], ["Reviewed July 12, 2017", 5.0, "Great to see!", "I have to say I've been here a few times and always enjoy the visit. I love seeing the history and the extravagance of the Capitol. This last visit, a legislative session was in action and my family and I sat in to listen and see the process. It happened to be about healthcare reform in California. What a great experience and a great way to reinforce what my teenager has learned about our government and it's processes.\nShow less"], ["Reviewed July 11, 2017", 5.0, "History, Architecture and Government of the Golden State", "We are both CA natives and this was our first trip to the Capitol Building. Take the tour, which is chock full of historical narrative and wander around offices that have been restored as they were complete with furnishings from the 1800'. The Assembly and Senate chambers are beautiful. The garden is also worth a stroll.\nShow less"], ["Reviewed July 11, 2017", 5.0, "A Trip Through History, Literally!", "From the brilliant white statue encircled dome to the richly hand-carved wooden bannisters along the stairways to the basement, the California Capitol building is literally a trip through history. The main floor features turn-of-the-20th-century restored offices with docent-led tours. The floors are of thousands of tiny colorful mosaic tiles depicting signs and scenes of California. Both houses of the California Legislature meet in chambers on the first floor with viewing from second floor lofts. And the first floor museum recounts early California history along with details of the 20th century restoration of the entire building. A small viewing window in the basement allows visitors to view the original brick foundations laid in the early history of the Capitol. And the surrounding Capitol Park displays hundreds of mature trees, colorful gardens and monuments honoring veterans and public servants. It's truly and adventure offering both pleasure and education to all who visit.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Family day", "We moved to sacramento 4 years ago and went around town to get to know the area. We did go to the State Capitol building tour and we loved it, it is very well maintained and an awesome way of getting to learn about sacramento & California history. Definitely would recommend for all family's.\nShow less"], ["Reviewed July 10, 2017", 4.0, "See Gov't in action", "Okay, so there's some good times when things get done and you can actually watch the California Law makers do it, and then their are times when the place is dark and you can only tour around to look at what things look like. I would suggest that you look at the agenda schedule and see if you can plan your visit for when everyone is back in town and something is going on. A self tour of the Trees and Roses outside the capital grounds is nice for those who have an interest in horticulture. Most if not all of the tress have been marked with a plaque to tell you what type of species they are. Plan to spend at least 1/2 a day there if you've never been before.\nThe Capital is centered in Down Town and close to many places to eat and stay.\nShow less"], ["Reviewed July 9, 2017", 5.0, "definitely is “visit worthy”", "The Exterior, Interior and Garden/Park are all significant and attractive. The rose garden and memorials beckon you to stroll through the well maintained grounds. There are trees over 100 years old. The exterior resembles the U. S. capitol building. The interior is welcoming (after passing through security checkpoint). It was quite a relief to step into the lovely air conditioning. There are county displays, bookshop, theater with informational videos, coffee shop, huge murals, life-size or bigger statue of Ronald Reagan, in the lower level. The rotunda is a work of art. There are free guided tours every hour on the hour. Highly recommend a visit.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Gorgeous grounds", "Almost as great as the state capitol building are the grounds and park surrounding them. Gorgeous and well manicured with amazing fragrances from a variety of rose bushes and orange trees."], ["Reviewed July 6, 2017", 3.0, "A bit disappointed", "We go to every State Capitol in every state we visit and this let us down a bit. We were able to go into the Senate Gallery but not the house. The museum is small and not very interesting. Even the grounds are not special for a state as large and well off as California\nShow less"], ["Reviewed July 3, 2017", 4.0, "The gardens surrounding the Capital are really fabulous.", "We had a little time to kill, and decided to walk around the capital gardens. We spent about an hour walking around the eastern side of the capital. The collection of trees and roses were unbelievable! There was even a small area that commemorated the Civil War, with trees from I think 40 battlefields.\nShow less"], ["Reviewed July 2, 2017", 5.0, "Best State Capitol in California", "Inside and Outside, this capitol is well-maintained. Gorgeous rose garden & grounds.\nFirst thing you see when you enter is the state flag hanging over a Statue of 'Columbus' Last Appeal to Queen Isabella. Down one hallway, each county has a window box, filled with items that most represent that county. When we were there, the Senate Gallery was open, where we observed where bills are discussed and passed. Volunteers on the first floor will gladly give you information about the exhibits (rooms as they were when past governors were in office). My favorite part of our self-guided tour were the portraits on the 3rd floor of some of our governors.\nShow less"], ["Reviewed July 1, 2017", 5.0, "Top 10 State Capital", "Always try to visit state capitals when on vacation and this is one of the best. Sign up for the guided tour and take lots of pictures. Just think of it: Ronald Regan, Arnold Schwarzenegger and Jerry Brown as governors."], ["Reviewed June 29, 2017", 5.0, "Must Do if in Sacramento!!", "I dragged my family here because I read such great reviews about the free guided tour at the State Capitol. Being Native Californians, I felt we need to do this not only to learn more ourselves but to also give our son a peek into our government that he will be learning about this year in school. Not everybody in our family was completely excited about doing this stop. But I have to say our docent was so informative and made the tour so interesting that by the end of the hour tour we were all excited to be there! I would love to go back and do the guided tour again!\nShow less"], ["Reviewed June 27, 2017", 4.0, "A nice, air-conditioned location", "We flew into Sacramento and needed a way to kill a few hours. It was nice to wander around the Capitol building, being able to see the House and Senate chambers, as well as most of the other rooms. The entrance to the building was a bit difficult to find (it's not the front door).\nShow less"], ["Reviewed June 26, 2017", 5.0, "Such an interesting tour", "We had a tour that was just so fascinating. Took some great pictures too. Enjoyed it all around. Would go back a gain."], ["Reviewed June 26, 2017", 5.0, "Photographers get your camera out!", "There are so many wonderful places to shoot. Take a walk around the area photographers. Don't just look at its face. The whole area is a plethora of opportunities."], ["Reviewed June 22, 2017", 4.0, "Don't Take the Kids", "Fourth graders in CA study CA history and one field trip often taken, is to the Capitol. Believe me, it is lost on them. ( I taught 4th grade) for adults, though, it can be facinating, especially when representatives are in session and you can watch our government at work.\n\nAside from that, the woodworking and craftsmanship, choices of beautiful woods, period furnishings are all are worth strolling around the inside of the building for. We didn't take a tour, but wish we had.\n\nThe outside grounds are beautiful to walk around as well. Many of the trees and plants are labeled and most, if not all are CA native plants. Plenty of grassy areas if you want to picnic, or just sit and relax.\n\nSince it is the Capitol, there is often some small, or sometimes large, group of protesters, or marchers, but that just adds to the experience.\n\nGreat place if you like history.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Impressive without being showy", "I expected gold and glamour-- but it looks like it was built long ago with few upgrades. It was still beautiful, however, and quite informative. Was hoping to witness the Senate in session, but that section was closed."], ["Reviewed June 18, 2017", 4.0, "Good tour from guide with odd but engaging style", "Enjoyed our tour that showed us the principal areas and covered outline State and Capitol (s) history.\n\nThe building is not especially grand and the curious point is how many more head of population are represented here by House and Senate members than in maybe all other States.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Touring a piece of history", "We had some time in our schedule while visiting in Sacramento so we decided to take in the Capitol tour. This is a one hour guided tour, that leaves on the hour from the lower level of the capitol building, next to the Ronald Regan statue which sits directly below the rotunda. Sign up in the tour office in the lower level before the tour. There is no charge for the tour. Our guide talked us through the history of the building, its reconstruction, and many of the interesting 'quirks' about the structure. We took the elevator up to the 3rd level to visit the viewing galleries for both the state Senate and Assembly. Both bodies were in session to discuss the state budget, so it was very interesting to see this process in action. Highly recommend the tour for most folks, but probably not for younger children, who might become quickly bored.\nShow less"], ["Reviewed June 8, 2017", 5.0, "historic and beautiful", "Beautiful historic architecture. You may be able to get random pics of you surrounded by the security riding on a horseback.It has beautiful garden with fountains and many trees. The museum is great , we loved it."], ["Reviewed June 7, 2017", 5.0, "Trees", "Although we stay st the Hyatt year after year, this time I decided to visit the\nCapital, I really enjoyed the architecture of the Senate room, besides that all the good exercise exploring the grounds in the City of Trees, these trees are magnificent\nadding to the thought of a wonderful Creator, the Rose Garden was also nice.\nShow less"], ["Reviewed June 3, 2017", 4.0, "Very informative and an insight into US Politics", "As a group of Brits visiting the US, we really enjoyed our trip to the Capitol. The tour guide was very patient with our total lack of knowledge of the US Political process at a State level. The building is beautiful and the access to both Chambers was a pleasant surprise - considering recent events in the U.K preventing this in our own Parliament buildings. Loved Mr Schwarzenegger's official picture in its 'Terminator' frame!!\nShow less"], ["Reviewed June 1, 2017", 5.0, "Nice tour, Great Price - Free", "I enjoyed the tour, loved the price (Free). No appointment was necessary when I went. People were very friendly/"], ["Reviewed June 1, 2017", 4.0, "A Beautiful Building with amazing Grounds", "The park around the Capitol has trees from all over the world and they are all labeled with type and country of origin. There is a line of Coastal Redwoods. The tree garden was started in 1905 so there are very large trees. The inside of the Capitol Building contains some nice portraits of Governors, including Earl Warren from 1943 to 1953.\nShow less"], ["Reviewed May 27, 2017", 4.0, "Free hourly tours; nice history lesson", "Tour includes the State Assembly and State Senate chambers as well as the common rooms. Good for all, even young kids. If you are visiting Sacramento, how can you NOT go?"], ["Reviewed May 26, 2017", 5.0, "The State Capitol Peace Rose Garden is worth going to the Capitol", "I went to the State Capitol and went through the rose garden on the way. The entire garden was in bloom and just beautiful and fragrant. There is a Vietnam Veteran War memorial located on the grounds. The inside of the Capitol is worth seeing and be sure to go down to the basement where there is a display of seismic activity occurring in real time!\nShow less"], ["Reviewed May 25, 2017", 4.0, "Full of local history", "There was a lot to see and some parts look beautiful. The museum rooms are full of historical artefacts - very interesting. Several rooms have been set back in the old days."], ["Reviewed May 24, 2017", 5.0, "Beautiful building and grounds", "This capitol building is one of the nicest that I've ever seen. It has been beautifully cared for. The ceiling murals are gorgeous and the grounds are also lovely."], ["Reviewed May 22, 2017", 5.0, "Impressive architecture and history", "We visited our Assembly member at her office and took a docent led tour. It was fascinating to hear the history and see the Assembly and Senate chambers (they were not in session). The docent was very knowledgeable and answered all the questions patiently. The tour was well worth our time.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Capitol visit finally!", "I was born and raised in CA & finally visited our historic capitol! Glad I toured our capitol! The politicians were not in session, but we learned a lot about their roles & processes."], ["Reviewed May 22, 2017", 5.0, "Tour of the capitol building Sacramento", "Looking for something to do this summer? Head to the capitol for a free tour. Took my fam there one summer day and they were not too excited about going. By the end of the tour they had changed their tune! The front doors were closed for some reason the day we went and had to enter on the side. Took some asking on how to find the room to sign up for tour. Its downstairs. The tour guide was extremely knowledgeable and the whole experience was informative and interesting! Such great history and the everything is beautiful. The treat was sitting in on the legislative chambers! The architecture is incredible!\nShow less"], ["Reviewed May 22, 2017", 4.0, "Politics in action", "We went on a week day and enjoyed the architecture of this stately building. The assembly was in session so we sat in the gallery and listened...."], ["Reviewed May 12, 2017", 5.0, "Fascinating view of historic and current state government", "The state Capitol is really interesting, it's simultaneously a historic museum and also an active seat of government populated by serious-looking guys in suits and ladies with power hair. You also get a continually changing cast of demonstrators outside waving placards and chanting.\n\nThere are several rooms kept in their original state, including the treasury with its safe and strong room, and the governor's private office complete with spittoon. I guess governors chewed tobacco a lot. The docents were really knowledgeable when we had questions.\n\nHighly recommended as a way to see how California's government works today and how it worked in the past. Allow a couple of hours as there's a lot to see.\nShow less"], ["Reviewed May 12, 2017", 5.0, "Amazing place! Be sure you visit!!!", "Very interesting history and beautiful place! a free tour is worth it!!! The day we came happened to be the yearly Police Memorial so the front of the Capital was closed off to the public, but we went in through the annex. The school children who were in the basement on field trips were very noisy and our tour guide was very frustrated at the noise. We ate lunch downstairs before we left since they have a little coffee shop and sitting area. The grounds are gorgeous. All of that area in Sacto is so pretty: I loved the big trees. It is very pedestrian friendly.\nShow less"], ["Reviewed May 9, 2017", 4.0, "It's free to get in and worth the visit.", "You can walk around to see both historical exhibits and see where our current day governing takes place."], ["Reviewed May 7, 2017", 4.0, "Good to know", "Being Sacramento the state capitol, getting to know this place is for me this is the number 1 thing to do"], ["Reviewed May 5, 2017", 5.0, "4th Grade School Field Trip Destination", "I recently brought my 4th graders to the Capitol for a tour and our guide was just perfect. He was enthusiastic and kept my students very engaged which was not that easy as my students were quite tired having spent two full days touring the major educational destinations in the area. It was just the right length of time (1 hour) and he kept the content of his descriptions appropriate to their level.\nShow less"], ["Reviewed May 4, 2017", 5.0, "Excellent", "First visit was 2-years ago when wife and I did a guided tour, which was excellent and extremely informative. This time around we did a self-guided tour. First off, the building itself is impressive both externally and internally. Then there are the volunteers who are so friendly and ready to answer any questions you may have. There were two highlights of our visit: having the opportunity to see and hear the Senate (I think that's the correct term) at work; to be given a mini-guided tour of the Secretary of State's office as it was in 1906 by one of the volunteers who was keen that we'd seen as much as we could of the building.\nThe State Capitol is an important part of Californian history and a significant building. Definitely worth a look.\nShow less"], ["Reviewed May 2, 2017", 4.0, "So glad the restored vs rebuilt!!", "You can take a tour of how the capital building was in 1933! The guide was knowledgeable and funny. How it was when the state started was so interesting! I'd go again\nShow less"], ["Reviewed May 2, 2017", 5.0, "Wonderful tour", "Our tour guide was very knowledgeable. A very beautiful capitol and worth visiting. The portraits of several governors was most interesting. Lovel the one of Reagan, but the one of Jerry Brown was very strange.\nShow less"], ["Reviewed May 1, 2017", 4.0, "Beautiful lawn and gardens", "Beautiful lawn and gardens, enjoyed a shaded walk through the gardens on a hot afternoon. Beautiful trees and roses everywhere. Very well maintained, great spot for a picnic."], ["Reviewed April 30, 2017", 4.0, "Lovely visit", "Gorgeous building with either a self-guided visit or a short tour. You're free to wander the four floors and look into some recreated rooms from the early twentieth century and the Assembly chamber. Went on a Sunday and it was tranquil and very pleasant to visit. The surrounding park is also lovely. Not too far from Old Sacramento and makes a lovely outdoor day.\nShow less"], ["Reviewed April 26, 2017", 4.0, "Beautiful garden + POW MEMORIAL", "We walked the outside grounds early in the morning to get our day started. The flowers were in full bloom and beautiful. The grass is meticulously manicured and vibrant and the trees stunningly majestic. The plants and trees have name & region identification markers.\nLest we forget those lost and follow him defending our country there is a well-designed memorial / tribute contained in the park.\nWe did not go inside because we went early in the morning before it opened.\nShow less"], ["Reviewed April 19, 2017", 4.0, "Great place to tour, the portraits of the governors are interesting", "A great visit on a Saturday morning. We enjoyed exploring the chambers, which were manned by docents, and looking at the portraits of the governors."], ["Reviewed April 18, 2017", 5.0, "Free fun and educational, too!", "Over Spring Break, we spent some time being tourists in our own city. The free tour of the California State Capitol is really well done! My 9 year old was not bored at all. We especially enjoyed seeing both the Assembly and Senate Chambers (they were off this week). The tour moves around the building and focus on key points in history, architecture and art within the building. It lasted about 40 minutes.\nAll of the staff and volunteers were friendly, knowledgeable and enthusiastic.\nThere is a great little store if you want a souvenir and even a cafeteria if you need a beverage or snack!\nWe also enjoyed a very short film in the theater. There are a few different options which play regularly throughout the day.\nThe surrounding grounds are lovely and make for good photos.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Great place to visit", "If you have not been to the state capitol and museum, you need to. So much history and understanding how the politician works. Great art work everywhere. You will be in awe. Good for everyone."], ["Reviewed April 15, 2017", 4.0, "Pretty Good Tour", "We got to visit the State Capitol and were able to visit the Assembly floor as well as part of my son's Fourth Grade Field Trip this week. The history of the place is pretty interesting and you get to see the capital up close and personal. Probably the most interesting part was getting on the actual Assembly floor and having a personal talk there.\n\nThe architecture is beautiful and the grounds are well kept and maintained. It was very crowded the day we were there as there were a lot of other school groups taking the tour as well and, unfortunately, drizzling the whole time so we were all a bit cold and wet.\n\nThis is one of those tours that, if you're in Sacramento and have the time, include it in your itinerary. Budget a least an hour and bring a camera as the architecture is probably the best part of the tour. It's a beautiful building.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Tour was excellent", "We sometimes regret taking tours as they end up telling you more detail than you can absorb. But our guide around this beautiful building (Eric) was really good and funny too. Highly recommended. Coming from Britain, I wish I had known the answer to the green and red question - but I won't give the game away.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Amazing Venue", "Put on a PR event. It was flawless. Everyone loved the museum and thought it was a creative and different venue."], ["Reviewed April 11, 2017", 3.0, "Nice addition if you've not been.", "If you are going downtown and haven't been there it's kinda neat to see. Of course ir's big and ornate with nice artwork, but it also sit's in a nice park which is great for picnics, lunch, people watching.\n\nGood restaurants very nearby (Fats) and many more in walking distance and they have a veterans memorial, fallen officer memorial and large garden.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Must See", "Absolutely stunning state capitol. Take the free tour, as you get a few behind the scenes bonuses, that you would not otherwise experience. Capitol park is gorgeous, definitely take the time to walk through and take in the beautiful surroundings and numerous memorials on the grounds.\nShow less"], ["Reviewed April 10, 2017", 5.0, "A building worth restoring!", "We had a great time exploring this historic building with a very fun tour guide. We learned about the House of Representatives and Senate as we viewed their chambers. We loved the history lesson we received and were interested in learning all about this magnificent building and how it has been restored. After the tour my grandchildren were anxious to view Sutter's treasure map in the library!\nShow less"], ["Reviewed April 10, 2017", 5.0, "Beautiful and interesting", "So much to see, tour was an hour and there was still more to see. On weekends go in side entrance on N street. Lots of free street parking in a Sunday morning."], ["Reviewed April 10, 2017", 5.0, "nice", "We were able to visit inside and see offices on a Sunday, which was not there last year. Very clean and well kept."], ["Reviewed April 10, 2017", 5.0, "History Lover", "I love History. I have been in the State Capitol twice in the last 2 years. I have walked through it myself and taken the guided tour with my family and my friends. The building has had some repairs done without compromising too much of it's original structure. The tour was great. We got to sit in the public viewing chamber where people can sit in and watch politicians at work down below passing laws etc.\nShow less"], ["Reviewed April 10, 2017", 4.0, "Historic", "I love seeing the inside of the majestic building, the assembly and senate chambers, and the museum displays."], ["Reviewed April 9, 2017", 5.0, "Tour was well worth doing", "Really enjoyed our visit! The tour was very interesting, our tour guide was a real story teller! But we all learnt things!"], ["Reviewed April 9, 2017", 5.0, "Slice of CA historh", "Great tour. You see and learn a lot from the folks here. In addition to old town and sutters fort, I would say that the capitol is the other \"must see\" in Sacramento."], ["Reviewed April 8, 2017", 5.0, "I Was Fasinated", "I really enjoyed going and seeing the different pieces of art and artifacts. The offices are plush furniture with plush carpet. I am so glad that I went to see it."], ["Reviewed April 5, 2017", 3.0, "Where a very ignorant man works", "The tour is cool, its pretty standard honestly. The ground are pretty nice and there's a lot of good bars and places to eat with in walking distance. So you can drink away the fact the jerry brown is in charge."], ["Reviewed April 3, 2017", 5.0, "Not to be missed !!", "Even though I live here, its such a wonderful historical place to visit. Whenever folks come to visit, The Capitol is always a must see."], ["Reviewed April 3, 2017", 5.0, "Great property to visit", "I was here on a Sunday, so the Capitol was closed, but I enjoy walking around and seeing the memorials. The park is quite large with beautiful trees and flowers, especially roses all around. It was peaceful to sit in the shade and admire the beautiful day. I'll be back!\nShow less"], ["Reviewed April 2, 2017", 5.0, "What a lovely building!", "We attended the last tour of the day. Our tour guide was knowledgeable, professional, and was genuinely excited to tell us all about this place. We love the pictures of the past governors, (Jerry Browns was a mess!) and the rotunda was stunning. The sculpture of Christopher Columbus and Queen Isabella was surprising, but a stunner never the less. The tour lasted about 45 minutes and was worth the visit.\nShow less"], ["Reviewed March 30, 2017", 4.0, "My doctors visit.", "The state capital is a great place to visit. Is a wonderful part would beautiful trees. The history of our stay in the running of our government. I've never forgot my school trip when I was in eighth grade. So I brought my grandson to share with him the wonderful experiences of state capital.\nShow less"], ["Reviewed March 26, 2017", 5.0, "Beautiful Building", "Visited the state capitol building while in Sacramento for the NCAA tournament. Beautiful old building and many rooms that were originally offices have been preserved as they once were back in the 1800's. In addition there are lots of old artifacts to enjoy, old publications, etc. The building is beautifully constructed with ornate woodwork and plasterwork. Easy to spend a couple of hours poking around.\nShow less"], ["Reviewed March 12, 2017", 5.0, "Beautuful architecture", "In town early so decided to walk from J Street to the Capital Building. Surprised that it was open to the public on Sunday and offering free tours. My tour guide spent a bit too much time on the workings of the lawmakers, but it IS the Capital. A definite must see, even for a couple hours.\nShow less"], ["Reviewed March 6, 2017", 5.0, "The Heart of California", "If you are visitor to California or a native Californian, then you need to stop by and give the capitol a visit. So much of California history in a nutshell can be found here. If you are into politics and federal government then the capitol is also for you. I have been here twice and both times was amazed by the display cases of all the counties in California. The architecture is very old and fascinating as well. Stop by the capital and learn a bit about the Golden State, especially if you were born and raised in California such as myself.\nShow less"], ["Reviewed March 2, 2017", 3.0, "Interesting, but more California history would be helpful", "We spent a couple of hours at the capitol with two grandchildren, ages 5 and 8. We would have enjoyed more exhibits about the history of California."], ["Reviewed March 1, 2017", 5.0, "A must do in Sacramento!", "They almost tore down this building! What a shame that would have been. Our tour guide, Jolene - we sang her name the whole tour. She was really informative and made the tour interesting. The tour is free and gives a comprehensive overview of the building and its contents.\nShow less"], ["Reviewed February 18, 2017", 5.0, "Interesting exhibitions in a beautifully maintained building", "You have to go through a security check, but after it you are free to wonder inside the building. Videos, tours or just walk around. A lot of old offices from around 1900, beautiful book exhibition from the state library's treasures. The rotunda is nice and the kids loved the old elevator doors and staircases. The grounds were really nice, flowering trees, and lots of palm trees.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Historical", "Never missing a chance to and visit this beatiful place, when we have company.inside and outside is so much to see. The garde is beautiful, many different trees there lots of flowers and we love to walk around there. The capital building is just full of very helpful people and you can learn a lot about history. Our favorite place to visit.\nShow less"], ["Reviewed February 13, 2017", 3.0, "For sure a place one should see .. But not WOW", "When we went there people were busy protesting the second amendment .. The capitol has some interesting details to explore and if you have time to spare is worth a visit."], ["Reviewed February 9, 2017", 5.0, "My experience", "My husband and I decided to walk in downtown and we found out that CA State Capital Museum is open on weekend. It is not the first time we visited Museum, but each time we enjoyed to be there. My advise for next Open for Public day to open at least the door into the hall where are meeting takes place.\nShow less"], ["Reviewed February 6, 2017", 4.0, "The Statue of Ronald Reagan surprised us.", "This is a gem of a building and should be visited by as many people as possible. There is a security check at the entrance and after that you can wander around the building, visiting some of the former working rooms of the Governors. In the basement and holding sway to everything around is a golden statue of former president and governor Ronald Reagan. Just to see him is a good enough reason for visiting the State Capitol.\nShow less"], ["Reviewed February 5, 2017", 5.0, "One of our nations best", "It does not take a lot of time but a visit to this Capital is well worth doing. Few State Capital Buildings are as nicely maintained"], ["Reviewed February 3, 2017", 5.0, "You Have to Go to the Capitol!", "The California Capitol Building is a beautiful piece of architecture. It was built during the Civil War and has been nicely restored. The tour guides are excellent and you can learn something about our state history in a short time. The grounds are magnificent and you can walk for acres looking at the trees from all over California and the world, all marked.\nShow less"], ["Reviewed February 1, 2017", 4.0, "Love walking the Capitol grounds", "The Capitol is a great place to visit and see the majestic building in the middle of the surrounding city. It is a nice place to tour with the kids especially if they're studied government at all. There are tours or you can walk through on your own. I love walking in the surrounding gardens and grounds and looking at the various statues.\nShow less"], ["Reviewed January 29, 2017", 4.0, "Free tour", "Make sure you sign up for a tour that is free as soon as you get there. It is down in the basement. Great history."], ["Reviewed January 25, 2017", 5.0, "a MUST to visit in Sacramento downtown", "to best appreciate the state capitol is to go inside and feel the history in your foot steps. we've been here a number of times, though there's more celebrity appeal during the time of gov. arnold, the glamour and historical appeal of the state capitol never ceases. if you're a california local, this is a good place to show-off our great state. if you're a visiting tourist, you'll have much better appreciation of the state of california looking on the county's dioramas.\nShow less"], ["Reviewed January 18, 2017", 5.0, "Worth the trip.", "Amazing history frozen in time, at the same time the active hub of the sixth largest economy in the world. Make sure you don't miss the original paintings of all the states governors!"], ["Reviewed January 18, 2017", 4.0, "Learning a little about how it works", "Taking a tour of the California State Capitol Building was a chance to learn a little about the body of power that run a state whilst learning a little about the State of California at the same time, since being neither from California or even the US it’s nice to learn more about the different ways countries run things. As with all government buildings in order to gain entry you will have to go through and clear the usual physical security checks, but once inside you can wander quite easily throughout the public areas. I signed up for the guided tour (daily on the hour from 9 to 4) and the guide for our time through the building was able to pass on a lot useful information about what we were seeing and how things generally worked, something I would unlikely have found had I simply taken the self-guided route by myself. Along with the functioning legislative and committee rooms and offices there are several rooms to see that are set up and furnished as they would have appeared in the past. My visit to the California State Capitol Building provided me with a sanctuary from the miserable weather outside whilst giving me the opportunity to learn a little about the Californian political structure.\nShow less"], ["Reviewed January 17, 2017", 4.0, "A great place to see the history in the making!", "Located in the heart of Downtown Sacramento, this Historical Landmark is still used to govern our beautiful state. Take the family and learn about how our government really works in person.."], ["Reviewed January 17, 2017", 5.0, "Capitol Beauty", "Sacramento's capitol building is a beautiful architectural building. There is a lot to see and discover about our State government. Be sure to see the displays of each county."], ["Reviewed January 17, 2017", 5.0, "Beautiful State Capitol", "I've lived in California most of my life and this was the first time I've visited the state capitol. It is a beautiful building and superbly maintained. There's plenty to see within it's walls and we were not disappointed at all. Very impressed."], ["Reviewed January 17, 2017", 5.0, "do visit!", "do not miss visiting this! It is free of cost to visit here, there is so much to see here, it is one of the best things you can do when in Sacramento."], ["Reviewed January 16, 2017", 4.0, "Enjoyed walking through while in Sacramento", "Very nice building and located in downtown Sacramento. Lovely architecture. Look around at the various portraits of former governors of California. Free admission. Tour the building by yourself."], ["Reviewed January 11, 2017", 4.0, "Cool building", "Check this place out if you're in Sacramento, really nice building. You can go in for free and walk around."], ["Reviewed January 7, 2017", 5.0, "Breathtaking Building", "Stopped by on our way home during out Christmas vacation and absolutely breathtaking. There was a beautifully decorated Christmas tree outside, families were outside singing, taking pictures and enjoying the last few days of 2016."], ["Reviewed January 5, 2017", 4.0, "Great piece of history", "This was very interesting to visit. I liked how one corridor had a display for each county showing the unique aspects of that particular region. While the portraits of past governors were nice to look at, I rather enjoyed the statue of Ronald Reagan, as I recall the highlights of his term. The museum is essentially scattered through the entire building, with rooms which reflect the styles and décor of the late 19th and early 20th Century. These were an interesting window into the past, and the way an office (much less a government) was during those times.\n\nThe special collections area had various old books, which included some pages from the Guttenberg Bible. These tomes, many which were hundreds of years old, were impressive to see, considering the handiwork required to make the wood-cuts for illustrations, and the by-hand coloring.\n\nA treat in itself was just the architecture of the building, with the carving of the bears on the stairwell bannisters, and the design of the rotunda. The exterior, with the classic Greek columns, added an air of distinction to the place to. It was a little chilly to walk the grounds around the capitol, but from the street they looked nice.\n\nOut front was the holiday tree, which stood tall and had many nice decorations. Since our visit was in the middle of the day, we didn’t get to see it lit up, but we could imagine what a beautiful spectacle that would be.\nShow less"], ["Reviewed January 3, 2017", 5.0, "Impressive", "The capitol and surroundings are a must see that is well worth a visit. We enjoyed touring the building which is magnificent. So historic and informative of California history. The grounds are equally beautiful recommended"], ["Reviewed December 30, 2016", 4.0, "Fun tour", "We visited the capitol on December 28 with four adults and six kids ranging in age from 7 to 15. I am so glad we took the tour. Eric, the tour guide, was very informative. He took us to places in the capitol that I definitely wouldn't have felt comfortable going by myself, like the senate chamber, even though they were a open to the public. He engaged the kids and all of them talked about the stuff they saw later during the trip.\nShow less"], ["Reviewed December 27, 2016", 5.0, "Sacramento Capitol and Christmas Tree - December 2016", "We visited the capitol of California. Its a pretty building. Since it was December, they also had a Menorah and a beautiful Christmas tree in front of the capitol building. We have visited the capitol several times."], ["Reviewed December 25, 2016", 4.0, "A great captial to visit", "They appear to leave the capital open to support your own self guided walking tour. It's a cool place to visit."], ["Reviewed December 23, 2016", 5.0, "Grand building and grounds!", "Glad to mark off another state capitol building visit on my quest to get to all 50! The building and grounds were spectacular...a must see!"], ["Reviewed December 21, 2016", 5.0, "A Great Tour!", "A definite must see when in Sacramento.\nThoroughly enjoyed the free tour and the guide was very knowledgeable and informative. Had the opportunity to see both the Senate & House chambers. The Capitol has just finished with a $70 million dollar remodel and it is quite a sight to see.\nShow less"], ["Reviewed December 19, 2016", 5.0, "Beautiful building", "We went through the Capitol in early December, late on a Friday afternoon, and had the building almost to ourselves. It is beautifully restored and without doubt is the highlight of any visit to Sacramento. The museum part such as the restored offices used by the early officials, are all well worth seeing. Take time to read the history.\nEasily the top attraction in the city.\nShow less"], ["Reviewed December 17, 2016", 5.0, "Do the guided tour !", "The tour guides are very knowledgeable and will point out the unique history behind seemingly \"out of place architecture \" hint: they are not mistakes. Must see the cake frosting room the work put into it is a cool effect. Beautiful building and see Arnold 's bear when you are there.\nShow less"], ["Reviewed December 16, 2016", 5.0, "A very enjoyable and informative experience!", "The CA State Capitol is a beautiful building and the tour is very much worth your time. It lasts about 45 minutes and is free. The tour guides are very knowledgeable, there is a lot to see, and there is a lot of history covered without getting bogged down in too much detail. We particularly enjoyed seeing the wonderfully restored original office areas for various state executives. Be sure to get your picture taken with the life-size bear statue outside the governor's office. The Capitol is surrounded by a large and beautiful park that is worth strolling through and exploring in its own right.\nShow less"], ["Reviewed December 16, 2016", 5.0, "Nice place", "Was a great way to see the building and find out some facts about the building and history. Good for the 7 yo, 11 yo too, I think we all got a bit out of it."], ["Reviewed December 16, 2016", 5.0, "Fantastic Tour", "What a beautiful Capitol! The museum was amazing. The tour guide was well informed and made the capitol come alive."], ["Reviewed December 15, 2016", 4.0, "Nice place :)", "Learned a lot about the city of california at the capitol. Very educational tour, the staff are very friendly and accommodating."], ["Reviewed December 9, 2016", 4.0, "Great area to run", "This is a beautiful location to go for a jog and appreciate the fresh air in the middle of the city. Parking will be a challenge but it is worth it."], ["Reviewed December 7, 2016", 5.0, "excellent", "Capitol state is very creative and very nice place to visit where you can see all the state cabinets and their places to see.Its a great and worth to see.Architecture is very nice."], ["Reviewed December 6, 2016", 4.0, "Great. Tour and a snapshot of California's History", "Set in a beautiful park as a backdrop this building is spectacular. The soaring scale of the building and its rooms lets you know that this state was bound for greatness early on. It is quite easy to arrange a guided tour and the gentleman who was assigned to the group was exceptional. You get a great snapshot of government, history, architecture and a few interesting stories that go along with the building. The tour took just about an hour and I am glad that I made the time to stop in.\nShow less"], ["Reviewed December 2, 2016", 5.0, "Great tour", "We took the tour Saw the entire building. Clean rest rooms and knowledgeable tour guide. Interesting place and interesting building."], ["Reviewed November 30, 2016", 4.0, "Great one-hour free tour", "Learn about California, its capital buildings and grounds, and the state's governors; after the tour, do not miss the \"museum\" rooms which you can visit on your own.\nNot sure why the guide didn't take our small group to the rooms showing how offices were furnished 100 or so years ago; very interesting.\nShow less"], ["Reviewed November 30, 2016", 5.0, "It's the State Capitol!", "Brought my 4th grader to tour as, well, it's 4th grade! Although he hasn't gotten to Sacramento and the Gold Rush yet in CA state history, his teacher thought it would still be appropriate to bring him now. He was very interested in the tour and liked the Senate rooms. My kids liked the big dome and the grizzly bear outside of the Governor's office.\nShow less"], ["Reviewed November 30, 2016", 5.0, "Charming Building and Grounds", "Don't miss a visit to California State Capitol Building!\nI thoroughly enjoyed wandering the halls of this beautiful old building with all its history! So well maintained, I felt like I was stepping back in history!\nBrass mailbox, elevator doors, original woodwork on staircase with magnificent carvings. Breathtaking rotunda. A visit to Senate chambers was a real treat! Lovely gardens, and memorials add to the charm.\nShow less"], ["Reviewed November 29, 2016", 5.0, "Capitol history is very well done!", "We toured the capitol and historic offices, then went by the assembly chambers and senate. Was very interesting and gave a good perspective on the building and the work of California government."], ["Reviewed November 26, 2016", 5.0, "Great educational trip", "What a nice touristy place to visit! We grew up in Southern California and pretty sure I have never visited. A few years ago we moved to Oregon and we have visited the Capital there. This one was beautiful inside and out. Of course there a newer metal detector screening you had to go through. But you could go up all four levels plus the basement to look around. Both assembly areas were open to see. And I loved the historic rooms of the treasurer, Secretary of State, etc that were modeled from the 1900's. Very cool to see it besides read about it. My husbands father was a fallen firefighter so we went to visit the fallen firefighter memorial outside the capital which was cool too. The kids were pretty impressed with the architecture and museum type rooms. Ages 13, 11, and 8.\nShow less"]]}}