{"California State Railroad Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "California State Railroad Museum", "url": "/Attraction_Review-g32999-d102772-Reviews-California_State_Railroad_Museum-Sacramento_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/ee/19/b2/model-train.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "2316"}, "address": {"@type": "PostalAddress", "streetAddress": "111 I St", "addressLocality": "Sacramento", "addressRegion": "California", "postalCode": "95814-2204", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "All aboard!", "I’ve been here several times. I’ll be back! There’s always something to see that was overlooked, and the trains are just so stunning that I want to see them again! THis is one of the best collections of locos anywhere. If you like trains, both of a bygone era and more modern ones, then this is a great way to while away a couple of hours, at least.\nShow less"], ["Reviewed 5 days ago", 5.0, "A kid again", "I was 9 years when I last came here in the 80s. I was on a school field trip visiting all splendor of Sacramento. I found this museum surprisingly fascinating...\n\n30 years later, and at age 39 and a history nerd, I still found this marvelous museum fascinating. Though, this time as a nerdy mature adult whom enjoyed reading and learning about California's history and the impact of the railroad network. About half of the trains you can actually go inside and explore...old trains, new trains, sleeper train cars, mail trains, cargo trains, food cars(my favorite!), and more. There are hundreds of placards and literature you can read to keep yourself entertained for hours...if you're a history geek like me. Sadly, I had flight to catch and couldn't stay as long as I would've liked to.\nShow less"], ["Reviewed 6 days ago", 5.0, "Amazing attraction", "I went with my son and familty during boyscouts. This was simply amazing. Lots of history, locomotives, rail cars."], ["Reviewed 1 week ago", 5.0, "Great Historical Museum", "Excellent displays of early railroad engines, cars and equipment. Signage was very informative and well placed for ease of viewing."], ["Reviewed 1 week ago", 5.0, "Unique and Fabulous", "It's hard to find another railroad museum as grand and well-designed as this. Great for train and history buffs, great for kids, great for a good time. And located in an interesting and entertaining part of town."], ["Reviewed 1 week ago", 5.0, "Fabulous for all ages, heaven for the “Train Buff”", "Visited with friends. We intended to spend 2-3 hours, and stayed most of the day. The attention to detail is phenomenal! The collection of china patterns is amazingly complete with pristine pieces new condition. One train simulates the feel of a moving train. browsing thru the cars was such a treat! One of the best features was upstairs, where behind glass, is a display with a few trains which individuals can operate with buttons.\nFortunately, there are benches right across from the display. We operated the lines to our great satisfaction, but the delight was in watching other guests...especially youngsters, discovering the fun! One of the volunteers visited with us there at great length. The volunteers are the most dedicated and enthused we have had the pleasure of meeting, from the tour guides to those in the gift shop! They were sold out of a t-shirt I wanted. I called several weeks after our visit and the lady I spoke with was very cordial and arranged to ship it to me.\nThe Museum is an absolute “must see” experience! I just made a friend on a caribbean\ncruise who was wearing a Museum t-shirt! What a delight to find a fellow train person, at sea!\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautifully restored vintage trains!", "This museum has quite a few beautifully restored steam engines as well as other types of cars. Many you can walk through including a Pullman sleeper, dining car and mail car. The Pullman is even rocking gently so it really feels like you are on a moving train! For small kids, there are wooden toy train sets to play with upstairs. Two hours was a reasonable amount of time to see the whole museum. The guy who did the museum tour was an excellent story-teller; we enjoyed how he brought the railroad stories to life.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great history", "Loved the first floor with the life size train cars. Great to be able to actually walk through them. Many volunteers around to answer questions and tell you things you may not have even thought of!"], ["Reviewed 2 weeks ago", 4.0, "Very Interesting", "Went with good friend who’s husband used to work on the trains. His explanation and enthusiasm really made this great place into something special. Well worth a visit."], ["Reviewed 2 weeks ago", 4.0, "Great Place", "We loved this place! We would have given it a perfect score but the admission is a little high. We brought our four kids (6 and under) and they enjoyed spending about three hours here. It cost us $42 for 3 adult tickets and one child. We'd do it again but, ouch. We parked in the garage directly in front and it's $1.50 per half hour.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome", "Far exceeded expectations - spent all day here and it didn't feel like we had enough time to really enjoy everything.."], ["Reviewed 2 weeks ago", 5.0, "Love the Trains!", "Highly recommend. Things for the whole family. Old and new engines, different eras. The model train set ups are awesome. Lots of hands on toy trains for the little ones to play with."], ["Reviewed 2 weeks ago", 4.0, "Great place for kids", "It's not that big-- one can see everything in a couple of hours. The toy train area is a great place for kids to spend an hour. The city parking garage nearby on I street for $10 a day is a good deal."], ["Reviewed 3 weeks ago", 5.0, "A must visit", "I've been to rail museums all across the country, this is by far the finest of them all. Not just a collection of old decayed machinery from a bygone era, the sets and displays of perfectly restored locomotives and stock take you back to the time they were in use. Even a display of toy trains will hold the attention of all ages. Having taken my childten, and now my grandchildren, it's one of my happy places.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Free Museum Day", "We took advantage of the Free Museum Day on Feb. 3 to visit the Calif. State Railroad Museum. We really enjoyed the exhibits and the museum is filled with history going back to the beginnings of building the railroad. It was amazing to see the actual train cars on display and you are allowed to board some of the trains for viewing. There is so much to see and don't miss going to the upper floors.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun for adults too worth the 10 bucks or so.", "Really interesting to take a step back in time to see how people traveled. Train simulation was very cool. I also liked all the different table settings the trains had the china was beautiful."], ["Reviewed 3 weeks ago", 5.0, "Worth a visit!", "Even if you are just a little interested in trains, this Museum is well worth a visit. I would allow a minimum of 3 hours to see everything."], ["Reviewed 3 weeks ago", 4.0, "Very enthusiatic engineers, real trains and great for families", "My family and I thoroughly enjoyed visiting this museum. We were lucky enough to be able to take the train ride and speak to the engineer. He was so enthusiastic about what was being done there. I loved seeing the old trains being renovated and rejuvenated. Make sure to spend a couple of hours to see it all.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "BIGGER than I ever though!", "This was definitely worth the wait to get in! 3 floors of history and so many real historical trains that have been preserved for us to enjoy. Also a terrific gift shop, and LOTS of places throughout to sit down. That's always been a frustration for me in a museum because my legs get tired, but this was not a problem in the Railroad Museum. In fact most of the places to sit were historical rail benches. And you can go inside a lot of the trans as well. The new California Bullet Train is on display, and that was interesting to see.\nJust can't say enough about how excellent a job the CSRM has done, and the docents and volunteers are VERY helpful and friendly.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Real trains, toy train hodels...Fun for family!", "Multiple floors. Very interesting museum! My boys love it.\nI'd say give it enough time, at least 2 hours, or it would be a shame to rush through like we did within 1 hour.\nThe ground floor had lots of retired trains from ancient to modern.\nThe second floor has hands-on mechanical things kids can play with. The docents were very nice and helpful with kids.\nThe thrid floor has beautiful toy trains and tracks. I really enjoy the sight.\nIt was definitely worth the time and $$.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A great museum for train lovers and history buff", "I’ve been to a couple of train museum and this is by far the best I’ve ever been to.\n\nBoth Oregon Heritage Museum and the NC Spencer museum were fantastic but this museum has so many diverse steam locomotives including the SP 4294.\n\nVERY HIGHLY RECOMMEND\nShow less"], ["Reviewed 4 weeks ago", 5.0, "This place was amazing", "My husband and I visited this museum because I really wanted to see the trains I once saw in old black and white western movies. (And back to the future lol). We had a wonderful time. The trains on display were a sight to behold, we are not huge train buffs but I couldn’t take my eyes off them. It was located in old Sacramento and was very cheap to visit. Honestly, take the time out of your trip, this is a must see. The staff were very happy to share their incredible knowledge which enriched our visit greatly.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Caltfornia State Railroad Museum Excellent!", "The California State Railroad Museum is an excellent place to do to learn everything about old and new trains"], ["Reviewed January 23, 2018", 5.0, "A hoot for train lovers", "This was my second visit here and I am glad I returned. I felt there was even more to see this time, though I am not sure that is actually true! But you’ll get your money’s worth seeing all the different types of trains. You can get right up close and even board some of them. Good photo ops as well.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Feels like a real train ride", "We took our grandson, I was more entertained then him. The feel the smell of the old rolling stock is so nostalgic. The dining car which rolled with the rails and a mannequin waiter. The day was brilliant."], ["Reviewed January 22, 2018", 5.0, "Great fun for the family!", "I have been to this museum with my kids multiple times and it never disappoints. I took my 75 year old Dad when he came in town, he was so taken with all the exhibits."], ["Reviewed January 21, 2018", 5.0, "Togetherness", "Excellent for family together time. Great programs during holidays. A little something for kids of all ages."], ["Reviewed January 21, 2018", 5.0, "California State Railroad Museum", "Amazing for adults and children. Interactive exhibits and knowledgeable docents make this a fun and educational place"], ["Reviewed January 21, 2018", 4.0, "Amazing", "Amazing attraction for the entire family. I will totally recommend if you are on old Sacramento this is a must."], ["Reviewed January 21, 2018", 5.0, "Top shelf", "Sacramento RR Museum is worth it! Up close and personal with the machines that built the West. It is the place where cinema meets up close and personal."], ["Reviewed January 21, 2018", 4.0, "A Great Place", "We love to take our family or friends who visit from out of town to themRailroad Museum. California, especially Sacramento has such a rich history and the museum does a great job of showing these stages-for development."], ["Reviewed January 21, 2018", 5.0, "Always a delight to visit this museum and this area.", "One of the highlights of any visit to the Sacramento area is this museum and the whole Old Sacramento area. Many, many things to see and do, even in the off-season."], ["Reviewed January 21, 2018", 5.0, "Kids favorite!", "Our twin boys love this place, you can’t go wrong in finding a place that kids love and keep parents entertained as well. Who doesn’t love trains. They get hands on experience and learn about trains history at the same time. Every time we visit it’s a great day for the boys and we here about the stories for days.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Walk through historic trains!!!", "My family spent about 4 hrs here total. For the price, it is one of my favorite things we did in Sacramento. You can re-enter so fitting a visit between meals isn't a problem. We took it slow and enjoyed the guided tour and chatting with the amazing docents. Went at opening on a Thursday in January. Had the place to ourselves. The introductory film is quite dated, but well-produced for when it was made and had good info. The hit was walking through old train cars. THRILLED my 14-5 yr old kids. The younger 2 liked playing on the third floor with the Thomas trains. We hardly spent time on the 2nd floor - we like history more than science I guess. The kids were tempted at the \"drive a high speed train\" exhibit, but each turn takes 6 minutes and with 4 kids in front of us the wait would have been nearly a half hour, so they skipped it. Next time, we would go there first - if you go early, hit that if it is of interest ASAP. We parked in the near-by parking garage and wound up paying the $13 day rate b/c b/n the museum and exploring the neighborhood of Old Sacramento, we were there all day. There was plenty of metered, street parking for less if your visit wasn't as lengthy as ours. The kids loved Old Town as much as the train museum!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Love Trains Go Here!", "I recently took 8 friends to visit the Museum and just can't believe how great they tell the story of the Transcontinental Railroad & how important it was to linking the west coast to the east coast. It made the United States one. Always something new to see & rediscover too. I can spends hours looking around here. If you love trains you just have to make this a destination vacation spot. Old Sacramento is located in this area too and has lots to see and do with great places to eat.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Fantastic", "This museum is a train lover’s paradise. The collection of locomotives and traincars are wonderfully placed in creative environments. The toy train collection captures the essence of the hobby. This is railstuff— past, present, and future. It’s a remarkable place."], ["Reviewed January 10, 2018", 5.0, "Train History “Bucket List” Site!", "Having read several references to this museum over the years, we finally had an opportunity to visit and check it out. We were not disappointed! Even if you have a minimal interest in trains and train history we encourage you to check out this museum, one of California’s (and our nation’s) treasures. Very friendly and informative docents. A fun day of adventure for us!\nShow less"], ["Reviewed January 9, 2018", 5.0, "If you are into Trains...this is the best! If not, you will be a convert.", "I have been to train museums around the world and this is the best hands down. While you are there, you will see trains in motion, on turn tables, visiting for special events via the tracks outside, and a plethora of cars inside that you can walk through to learn about this segment of transportation history. The exhibits are well designed and ADA accessible. There is a lot to see and learn here so give yourself at least 2 hours to enjoy it.\nShow less"], ["Reviewed January 8, 2018", 5.0, "A great place for railroad fans.", "Learn about the railroads of California with lots of great exhibits of engines and cars. Walk inside historic rail cars and engines and learn about the men and women that built the Central Pacific and Southern Pacific railroads."], ["Reviewed January 6, 2018", 5.0, "Educational and fun for all ages", "The docents are very knowledgable and the exhibits are fabulous. A great stop in Old Sacramento, with enough to keep the kids interested."], ["Reviewed January 6, 2018", 5.0, "Fascinating", "A large well kept museum with many fascinating exhibits. There were plenty of staff to to tell you about the trains and you can climb on to many of them and one of the carriages is converted in to a cafe. There is a superb model railway on the upper floor which takes up a large area and is fun to watch - kids obviously love it. There is plenty of room to walk around even if it is crowded and also plenty of seats should you wish to rest. A little gem hidden down town well worth a visit.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Railroad museum fun", "Went to the museum to buy a train whistle and ended up staying and looking around, very cool place to visit, especially if you’re into trains. I had a great time and the staff was very friendly."], ["Reviewed January 3, 2018", 5.0, "Comprehensive & interesting history of railroads", "This is a great place to cap off a family reunion, to take kids of any age, and just to explore another aspect of California history."], ["Reviewed January 3, 2018", 4.0, "Interesting", "But loses interest for younger kids quickly in details but not in scope. Older kids enjoyed traveling through rail cars and could also handle reading signs. Tour was good but somewhat to much information and needed quicker pace but definitely more informative than on your own.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Railroad Museum has Top Notch Collection", "My daughter, 18 month old grandson and I visited the California State Railroad Museum in December, 2017. This was mine and my grandsons first visit. I had heard from a \"train afficianado\" at the point that I announced that I was moving to Sacramento that I would be living in a town with the best train museum he had ever visited. He is right. At first, after paying a hefty entrance fee, and starting out to explore I was skeptical. The building is deceiving from the outside entrance because it does not reveal the vastness inside which contains some marvellous exhibits. My grandson loved going in and out of the cars and I fondly remembered my childhood when I used to ride the train between San Diego and Santa Ana to visit relatives. This was in the days when the dining car had a big pirates trunk filled with candy and comic books.\nShow less"], ["Reviewed December 31, 2017", 5.0, "All ages museum", "This is a great place for all ages. We toured the museum with our toddler twins, their grandparents and great grandparents and everyone had fun! They've got vintage locomotives, mock displays of other more modern trains like a bullet train and a play place upstairs."], ["Reviewed December 31, 2017", 5.0, "Great for All Ages", "This place is amazing! It is definitely worth a visit. Trains of all sizes and eras. You get to board many cars and engines. There's also a great model train display and play area (save it for the end or you won't get your kids to leave so you can look at the rest of the museum).\nShow less"], ["Reviewed December 27, 2017", 5.0, "All Aboard!", "For the last 6 years my husband and I have been members of the California State Railroad Museum. It has been the best bet for our buck! We have enjoyed taking our grandchildren through the museum, riding the trains, participating in their annual dinner and fund raiser, and, especially the Polar Express. Our grandchildren absolutely LOVE the Polar Express. They never tire of wandering though the museum, nor do we! The museum proactively offers many programs, focusing upon the history of the railroad and Old Town Sacramento. It is a wonderful place to spend an afternoon or day!\nShow less"], ["Reviewed December 23, 2017", 5.0, "Awesome. Sheldon Cooper worthy.", "This is the best Railroad Museum I have ever visited. You enter a theater and view a short film on railroad history. The last scene of the film features an awesome engine. When the screen rises, you see the real engine an enter the museum. Lots of hands on experiences and a model train display. The passenger car has some motion as you walk through. You can also ride trains along the river.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Great museum!!", "We have been here so many times. Never get tired of that big cab forward locomotive. They always seem to have something new on display. It’s so worth the visit."], ["Reviewed December 21, 2017", 5.0, "Fantastic railroad museum.", "This is probably one of the best, if not the best RR museum in the world. All kinds of equipment, hands on exhibits-something for the entire family."], ["Reviewed December 13, 2017", 5.0, "Outstanding for ages 4 to 94", "Our children and now their children do not tire of going to the Railroad Museum. I took east coast visiting friends there last month. They raved about it and, as always, i learned new factoids about trains and California history. Visitors should not miss the museum. Locals should become ongoing members of the museum foundation.\nShow less"], ["Reviewed December 12, 2017", 5.0, "Train Lovers Dream Come True", "This is an excellent and massive museum. It has a huge impressive collection of old train engines and cars, some of which you can even go inside. There is incredibly detailed history of railroading and everything you could ever want to know about it, and especially it's history in California. If you are really into this sort of stuff, I'd suggest setting aside the better part of a whole day to visit, as there is so much to see here that time will fly by before you know it. Every time I have come here I have not arrived early enough in the day to see the whole thing. Maybe someday! Great place for kids as well as nostalgic old folks, and everyone in between.\nShow less"], ["Reviewed December 12, 2017", 5.0, "Had No Idea I'd Love It!", "Never thought of myself as a train person or, especially, a train museum person. But surprise!\n\nI took my kids (8 & 10) to the Railroad Museum on Summer Vacation this past summer. They have the museum set up chronologically. And there's just so much great info on California's history, along with the trains.\n\nI highly recommend for anyone in the area looking for something to check out. An absolute must!\nShow less"], ["Reviewed December 12, 2017", 5.0, "The Best Railroad Museum Anywhere", "The displays are real and authentic pieces. The décor is very high quality, and the docents are a wealth of information. Even if you're not a train buff, this museum is wonderful to see. Everything from the movie to full size trains to the history displays to model trains to the art and photographs are excellent. You won't be disappointed.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Trains x 3", "We started on the third floor and worked our way down. This floors has scores of model trains and tells you everything you’d want to know about their history. There were many we had never heard of like a Z-class that fits in a briefcase! There is a huge model train display that is interactive for the kiddies, and a big play area full of toy trains for kids to play with while their parents take a load off their feet for a few.\nThe second floor is full of information about train technology and has a theater.\nThe main floor on the ground level had 10 or more train cars or locomotives for visitors to walk through. These include many from the golden age of trains. I walked through a mail car; a Pullman car complete with mannequins sleeping; and a dining car where each table was set with a different magnificent china service from various train lines. Most of these cars had a knowledgeable docent nearby to answer questions and impart fun facts. Also on the main floor were exhibits depicting important train stories such as the building of the transcontinental railroad and what life was like for the workers.\nMy husband had free admission the day we visited (Veteran’s Day), but it was well worth any admission price.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Never gets old.", "I have been coming to the Railroad museum for the past 15 years. First by myself and them eventually all three of my children. Boy or girl, they are amazed by all the different models of trains from different eras. They get to board certain trains and experience what it is like to dine in a car and sort mail in another. Once you are finished with your visit to the museum, take a walk down Old Sac for food and more shopping.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Fun place for a family outing", "I've been to the California Railroad Museum with family, friends, kids and adults. This museum has a little bit of something for all. Small kids enjoy the interactive trains and other play activities, and adults like the fact you can go through the railcars and see so much about the development and history of the railroads. If you are going to Old Sacramento this museum is a must see.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Everyone enjoyed", "Something for everyone in our group -- from age 18 months to over 60 years. Hands on play for young ones and trip down memory lane for experienced train riders."], ["Reviewed December 6, 2017", 4.0, "We love the Train Museum!", "Great for kids of all ages, my now 10 and 7 year old still like to go check things out. The Thomas play area was always great on a rainy day for us! If you are local, I recommend a membership! Don't skip the train ride down the river in the spring and summer, but get there early!\nShow less"], ["Reviewed December 4, 2017", 4.0, "Into Trains", "If you are into trains or have kids that are interested. It's a must see. Lots of cool things to do for most ages. We come every other year when we're in area."], ["Reviewed November 30, 2017", 5.0, "Grandpa's favorite", "My grandson dependencies here. We have been going since he was two, he is now four. He never gets tired. He loves the toy trains and seeing the big trains, but mostly the toy trains."], ["Reviewed November 23, 2017", 5.0, "Loved this Train museum!", "It's in a old round house! In Old Sacramento! And I love all things old! I was in awww of the beautiful trains, and old old box cars! I could day dream about riding 1st class in those beautiful box cars! My son loved the toy train level!\nShow less"], ["Reviewed November 20, 2017", 5.0, "World-class!", "I've been here before - I try to hit at least the gift shop every time I get to Sacramento - and every visit is like the first. WOW! There's so much to see, and every time I visit, there's more to see. You'll need a couple hours to explore everything, and die-hard railfans can easily spend the whole day.\n\nTwo tips: One, on the day I visited it was 100+ outside and the upper floor of the museum was extremely close and stuffy; this could bother some people. Two, if you plan on going nuts in the gift shop, buy a membership instead of an admission ticket. It's good for a year, you get in free, and save 10% on your purchases.\nShow less"], ["Reviewed November 19, 2017", 5.0, "If you Like Trains this is a Must Visit", "The Museum is at one end of Old Town Sacramento and from the outside looks like any other big building, but inside you are in a world of trains and the history of trains in California.\n\nThe first thing I found a blessing was that they had all of the train cars and displays Chair Accessible. The only displays that were not available were old rail cars that are tight quarters for someone to in a chair to navigate.\n\nThe displays are all very informative and that staff, that I met were all retired railway employees with wonderful stories to impart.\n\nIf you like trains this is that place to go.\nShow less"], ["Reviewed November 19, 2017", 4.0, "Interesting museum", "The museum is both about trains and about the building of railways. A fair number of locomotives and wagons. You can walk through some wagons and see how the were \"at the time\", We would have liked som more informations on the locos, but the main aim of the museum is probably people who don'ät know that much of train. But that is a minor complaint, the museum is good and definiyely worth a through visit!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Unexpectedly large and intetesting.", "Great place to visit on a hot sunny day. Tons of refurbished rail cars....realistic displays of gold mining styles and gear....model trains and pleasent staff."], ["Reviewed November 10, 2017", 5.0, "Trains, Trains, Trains, and alot to see....", "This Museum really took you back to the wonderful days of all kinds of trains... They have them furnished with the things they would had used in those days... Many ways children can learn and enjoy being a part... The restored trains are so beautiful.. Lots of art work here in the painting of them... If you love trains you will love this wonderful museum....\nShow less"], ["Reviewed November 9, 2017", 5.0, "Fun place to visit", "The Sacramento Railroad Museum is aboutthe best thing in old Sacramento. They have lots of restored locomotives and cars, and life-size mock-ups of various places, including construction of the first transcontinental railroad, which began in Sacramento.\n\nThis museum will give you a real sense of the importance of the railroad in American history. They also have an incredible model railroad collection.\n\nWell worth a visit!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Kid friendly, interesting museum to visit!", "We visit frequently and are patrons. Young children love it. Parents are friendly and polite. Very educational."], ["Reviewed November 9, 2017", 5.0, "A journey through history", "Here you will discover the dramatic story of the transcontinental railroad, complete with original artifacts including the first steam locomotive purchased by the Central Pacific. The museum has large and lofty galleries displaying the iron and steel locomotives and railroad cars that helped conquer the West and build this nation. Give yourself plenty of time to see the informative film and join a docent lead tour. This museum is not to be missed.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Old Sacramento Railroad Museum", "Trip to the Railroad Museum was top notch. Some of those old trains are so huge. The history is well represented."], ["Reviewed November 9, 2017", 5.0, "Happy two year old", "Had to drag my two year old grandson out of the Railroad Museum screaming, he loved the train sets on low tables upstairs so much. I bought him a set to take home to the East Coast at the museum gift store to placate him. The older cousin, age 9, enjoyed the rocking full scale cars.\nShow less"], ["Reviewed November 9, 2017", 5.0, "School Fieldtrip!", "Sooo fun and such awesome exhibits!! A must see for all ages!! Walk-in cars... mini trains. Educated docents. Great gift shop too!"], ["Reviewed November 8, 2017", 5.0, "Do you like trains?", "The train museum is full of memorabilia and interesting facts about the history of rail in the area. You can see full size models of trains used when the railway first came to California."], ["Reviewed November 8, 2017", 4.0, "amazing train display including toy trains", "Allows you to see up close the engineering marvels that these old locomotives were. Built around an old round house where the trains were serviced. The passenger and freight cars give a glimpse into a bygone era of rail travel. Be sure to check out the model railroads! Give yourself a few hours to wander around. Some fairly unique items in the gift shop too.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Really worth your time", "This museum is worth while for adults and kids. Do try to get a guided tour. They will then tell you the early history of California and the role the rail roads played in its development."], ["Reviewed October 30, 2017", 5.0, "Railways Galore", "What an ideal place to visit. Our Grand daughter and her Parents took Granny and Gramps to this large home for many wonderful old railway engines and trains.\nTiming proved just right as we joined a guided tour that took us through several exhibits lead by a friendly expert who was incredibly patient but still kept us in order!\nLeft on our own following the 45 minute(?) tour we spent over 3 hours seeing the rest for ourselves with a break for lunch in Old Town Great Fish and Chips!!\nSadly the drive back took us through smouldering fields either side of the road. So sad what had and went on happening with those terrible fires.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Nice Train Museum", "Museum offers a lot of actual size train models from different eras. Great place to go if you're into history and/or trains."], ["Reviewed October 29, 2017", 5.0, "A train lovers dream", "train history buffs, big trains of all kinds, model trains, you name it and it is in this spacious museum. three floors full of fun for all ages."], ["Reviewed October 28, 2017", 5.0, "Quick peek into the West's story of the Transcontinental Railroad", "With trains you can climb aboard to feel the history, movie shorts, plenty of photographs, and easy-to-read placards, you can quickly whet your (and your kids') appetite to learn more - or just enjoy a wonderful visit to a bygone era!"], ["Reviewed October 26, 2017", 5.0, "A brilliant insight into American Railroading!", "The California railroad museum is probably in my opinion, one of the premier in railroad museums North America. The museum provides an excellent insight of America achievement the manifest destiny ( America from sea to sea) with the construction of the Transcontinental Railroad of 1869. The museum also provides excellent recognition of the great labour that the Chinese' provided with the construction of the Transcontinental railroad. Nonetheless, the museum has Great variety of locomotives and rolling stock. The museum also has an amazing example of a sleeping car and dinner car, in which, the public can walk through. For the record, in the sleeping car there motion and sound. The museum is less than 10 minutes walking from the Sacramento Amtrak train station and with in five minutes away walking there is an excellent selection of bars and restaurants to enjoy lunch. I would strongly in courage anyone who is the Railroad enthusiast or have children who enjoy trains to visit to California Railroad museum.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Outstanding!", "One of the best museums anywhere. Excellent guided tour with a lot of historical information. Many authentic railroad cars to explore. Fabulous working model train display. Well-designed displays throughout. Kids' activities. Nice gift shop."], ["Reviewed October 17, 2017", 5.0, "Fun Place for Grand Prents and 4 Year Old Grandson", "We took our 4 year old grand son to the railroad museum for a day out. Our grandson had a great day. He loved the trains. I have learned from past experience when taking young ones to this museum they want to see everything at once and look at any single exhibit only for a few seconds before wanting to move the next. In several exhibits there was a docent that engaged our grandson about the exhibit and added to his positive experience at the museum. The docents were in one of the old passenger/Pullman cars, dining car, and another passenger car that gave the impression the sleeping car was moving down the tracks at night.\n\nNext time I go to this museum I will go without children so I can linger by the exhibits and study them without distraction. This is a fantastic world class railroad museum. I have seen several railroad museums. The only one that compares is the railroad museum in York England.\n\nThe grandson had a great time in Old Sacramento with a pizza lunch, soda and plenty of ice cream. A great day out!\nShow less"], ["Reviewed October 16, 2017", 4.0, "Awesome time, just couldn't see everything", "Our conference rented the Railroad Museum where we had over 100 people attend the museum. There were food stations and bar where the majority of our group hung out at and it was a little tough to eat & drink and have enough time to look at all the trains in the museum. I really want to go back so I can properly take advantage of the history of the train and get a closer look at all there is to offer.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Returned several times during our visit to Sacramento!", "What a great place to bring your family or to reminisce! This is an amazing museum with so many surprisingly large and lifelike displays. Your kids will love it and so will you! You can spend a lot of time here checking everything out."], ["Reviewed October 14, 2017", 5.0, "Excellent, Even if You Are Not a Railroad Buff", "September 10, 2017 - After checking into our Best Western Sutter hotel and having a quick sandwich lunch, we walked over to the California State Railroad Museum. Although it was just a 20 minute walk, it was hot and humid and we wished we had driven. However, parking at the Museum area is $10.\n\nWe paid the $12 admission. It is said that they do not offer any reduced admission for AAA, AARP or veterans. Still, we entered the museum and found out when the next guided tour would be held. While we waited for the tour to start, we walked around to the tour area and looked at several exhibits along the way. Our volunteer tour guide was around 80 but he was excellent. He had an incredible memory to relate all of the history to us.\n\nAfter the tour, we were able to wander around and visit several large historic trains. One exhibit was a sleeper car that rocked gently as it simulated how it would feel on the tracks. In another large engine, we were able to see historic instruments. And, in a dining car, we saw numerous examples of the dishes used by the railroad. There was a volunteer in most cars and in many areas who could answer any questions and also had a narrative to share.\n\nThe museum has a ceremonial gold spike that was final spike driven by Leland Stanford to join the rails of the First Transcontinental Railroad across the United States connecting the Central Pacific and Union Pacific.\n\nIn addition to the museum exhibits, there is also a video about the railroad.\n\nYou must exit through the gift shop.\n\nIt is a must see while in Sacramento.\nShow less"], ["Reviewed October 13, 2017", 5.0, "A MUST see!", "The California State Railroad Museum is a MUST see while in Sacramento. This place is fun for all ages. Take a tour (HIGHLY suggested), then wander around yourself, and let the kiddos play in the trains for kiddos play areas. You will be wowed AND have a interesting learning experience.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Gem for all ages", "I went with my four year old, not knowing what to expect, since we entered based on simple convenience during our Old Sac stay. We were both pleasantly surprised. The format and layout allows you to tailor how much time you spend there, with plenty of hands-on detail that allow lingering through exhibits, or making a sensory pass.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Very interesting museum", "Well worth a visit if you are in the area. You can either walk around the museum on your own or with a guide if you prefer. Staff very hepful."], ["Reviewed October 12, 2017", 5.0, "I love this museum", "There are so many things to see and explore in this museum. The docent-led tour is fascinating and we learned so much. The people stationed around the museum bring the various exhibits to life. The place is so large we run out of energy before seeing everything.\nShow less"], ["Reviewed October 11, 2017", 5.0, "As good as York & Shildon but in a different way", "Definitely worth a visit and has some of the most beautiful locomotives I have ever seen !\n\nDoesn't have as many trains as other museums but they are absolutely pristine and beautifully presented - they even have mirrors so you can see underneath.\n\nAnd watch out for the docents pretending to be mannequins !\nShow less"], ["Reviewed October 11, 2017", 5.0, "Trains, trains & all things trains", "If you love old trains this is the place for you. There is a gigantic room with many beautiful trains. The docents that volunteer their time at the museum are incredible. They are very informative & appear to love sharing. After your visit to the museum make sure you stroll over to the train station & ride a relic from the past on a short ride along the river. Halloween & Christmas are the best time for this since they special programs.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Great museum to visit", "This is a fantastic museum of old trains and other wonderful exhibits of California history. It's a lot of fun for all ages."], ["Reviewed October 11, 2017", 4.0, "Historical Masterpiece", "This museum is well worth your time to visit. The museum is very well maintained, and they have the staff to answer any questions about the displays you may have. It will take you back in history !"], ["Reviewed October 11, 2017", 5.0, "Cool musuem", "This gem houses a few really great displays! There are fun activities for kids and lots of well-presented and well-thought out displays for adults. There are a number of retired engines and train cars on display and the museum houses various exhibits on many aspects of train travel, past, present, and future. A highly recommended way to spend a couple of hours, especially if you're a train buff in any way, shape, or form.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Place for energetic boys!", "I have a very active toddler 3 year old and he certainly enjoyed exploring this place. Parents, don't forget to visit he 3rd floor where your kids can play with toy trains on wooden toy tracks. I think that was his favorite place and mine as I could rest peacefully on the bench. :)\nShow less"], ["Reviewed October 9, 2017", 5.0, "Intriguing and Informative", "I didn't buy a ticket to the museum as I didn't have enough time. I did purchase the underground tour from them. While there, I walked around the main floor and through the gift shop where I purchased a couple of items.\n\nThe museum is extensive and contains a lot of information. If you are train aficionado, you won't want to miss this.\nShow less"], ["Reviewed October 9, 2017", 4.0, "So interesting", "I loved it and would have liked to take my time and read everything but my two kids were so excited to see everything it went fast!! I defiantly recommend this museum."], ["Reviewed October 9, 2017", 5.0, "Train buff bucket list item is fun for all", "The greatest engineering feat in history and what made us the nation we are today, in film, artifacts, restored rail cars, guided tour and interactive exhibits. A must for any US history, train or Civil War buff, anyone who has fond memories of passenger rail from childhood, and the next generation of train crazy kids.\nWatch the film, take the tiyr, and save time for the real restored passenger station and lunch etc in Ols Sacramento. The whole 9 acre site along the river is a state park worthy of a visit.\nShow less"], ["Reviewed October 8, 2017", 5.0, "A must for rail or history lovers", "Railroads are arguably a bigger part of California than any other state. From the building of the transcontinental Central Pacific over the Sierras to the shipment of produce and goods to the rest of the country, this museum tells a compelling story through exhibits and artifacts. The ability to actually board engines, mail cars and dining cars adds to the experience, especially to those who have never had the chance to travel this way. Docents - mostly retirees, many with prior rail experience - adds to the experience. They rotate the engines and cars displayed from time to time, so you may see things you hadn’t on previous visits.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Big Locomotives Found Here", "The CA State Railroad Museum is a gem located near the waterfront in Old Sacramento. It is huge inside because it has to hold all these really neat railroad trains and associated gear. There are staff available to answer questions. Some trains are open to climb into so you can imagine what train travel was like in early years. If you have kids, its a great pace to visit as its entertaining for them. If you love trains this is the place.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Train Museum", "Great place to take the kids! They will love the hands on trains. We go every year when we have visitors or the grandkids come to visit."], ["Reviewed October 4, 2017", 5.0, "Definitely worth a visit", "I'm not a \"train-fan,\" I don't build model trains, I don't read train magazines, etc. BUT, this museum is amazing and worth a visit. The trains are fascinating. The history of California told here is also quite interesting. It's great for children and adults. The museum has trains and exhibits not found in California or elsewhere. Always enjoyable.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great visit for train lovers!", "One of the places I always recommend to friends and family to visit. Quite a bit to see! Convenient parking right across the street in historic Old Sacramento."], ["Reviewed October 2, 2017", 5.0, "One of the best", "There is so much to see. Besides the historic early wood burners, there is many engines of importance to the western rail system.\nThere is also a world class model railroad system that is a huge hit with everyone especially the kids. For railroad buffs this museum is a destination place.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great experience", "Even if you're not a train Enthusiast this is an awesome place. If you have out of town guests great place to introduce them to Sacramento."], ["Reviewed October 2, 2017", 5.0, "A Great Place to Take Kids of All Ages!", "The California Railroad Museum is located in Old Town Sacramento and is a MUST visit for any one with school-aged children thru grown-ups who just like trains. Many exhibits are interactive and kids can climb on old locomotives, experience the sensation of being on a moving train, and see the 100 year history of trains in our country!\n\nThere is a collection of model trains for us older folks and a play area where kind can build and move the Thomas Trains.\n\nOld Sacramento is loaded with excellent restaurants and a walk along the River and the old Tower Bridge.\n\nThe boardwalks in the Old Town are delightful. This will be a really cool day for families. The Christmas season is especially magical for youngsters. The summer season can be very hot, so plan carefully!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Must see", "This is a great place to take kids to see how the railroad help build America. You can do it in aprox 1 hour or spend all day just depends on the kids and parents."], ["Reviewed October 2, 2017", 5.0, "Had a lot of fun", "Took my grand kids to the train Museum and not only a learning experience but fun too. There is a lot of history to be uncovered here."], ["Reviewed October 2, 2017", 5.0, "Entertaining for young and old", "This is such a fun place to visit. Several full size steam engines under one roof. I really enjoyed walking through the U.S. Postal Office Train and the fine dining train car. It is really cool to see the fine china for various trains."], ["Reviewed October 1, 2017", 5.0, "Great Display of Static Exhibits and Guided Narratives", "The wide range of restored railroad cars and locomotives is truly impressive. The museum also offers a one-hour tour focused on the building of the Central Pacific RR, which is truly worth the time."], ["Reviewed September 30, 2017", 5.0, "Outstanding!", "This is probably on of the best museums we have ever been through. The displays are amazing as it's all the actual locomotives and various train car types. The photo displays and written narratives are well done and very informative. But, the most impressive thing was the volunteer staff - they were well versed in what they would talk about, friendly and chatty, but not a bother when you just wanted to wander and look. Our only regret was that we weren't able to spend more time there.\nShow less"], ["Reviewed September 27, 2017", 4.0, "Enjoyable educational accessible tour and great gift shop", "Our tour guide used a scooter and was just great! The gift shop was happy to share info about age related materials we were purchasing for friends and children we were visiting. We bought books, videos, T-shirts and stickers and more. 3rd floor (toy trains) was not accessible by our wheelchair due to elevator issues.\nShow less"], ["Reviewed September 26, 2017", 5.0, "A fascinating museum", "A very interesting place to visit and not just for train buffs. History of the railroad in America, engineering, social history, toy trains, it's all here. You can walk through the sleeping car as it rocks its way through a night time journey. You can climb aboard the cab of a huge old steam loco or try driving a high speed train in the simulator. You can relive your childhood upstairs in the toy train exhibits. The only downside? If you are driving parking is expensive and vigorously enforced in Old Town.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Awesome!", "The exhibits were well done, amazing to behold and very interactive for all ages. The ALL VOLUNTEER docents were incredible! Interactive, engaging and informed! Today our docent volunteer Vern was very engaging and personable. And they ALL were!! We ended up feeling as though we had a major stake in the railroad history in CA!\nShow less"], ["Reviewed September 24, 2017", 5.0, "Great experience and great volunteers!", "This was our second visit this year because there was SO much to experience! What a great and amazing exhibit: large, extensive, very interactive and the volunteer docents were SO engaging and informative!! WOW!! Seriously, as a docent myself at another state park, to interact with so many very dedicated and excited volunteers at this state museum says A LOT about the quality of the place!! Volunteer Vern was especially gracious and engaging! Wonderful experience!!\nShow less"], ["Reviewed September 20, 2017", 5.0, "Deserves the #1 rating!", "We spent 4 hours here and were very pleased. The tour they offer after the movie is great and sets the stage of the railroad in CA. Plently of helpful, friendly volunteers and good history, trains, toys to see. Don't miss this museum."], ["Reviewed September 20, 2017", 5.0, "Best train museum", "This is the best train museum I have visited so far. I strongly rocommand to wait for guided tour. You will get lot of interestind details."], ["Reviewed September 19, 2017", 5.0, "Great place for all ages... terrific collection of old trains", "Kids and old folks love this place. It's living history of trains... we loved it. Trains are filled with nostalgia and romance and Americana. Try the high speed simulator."], ["Reviewed September 19, 2017", 5.0, "RR Museum", "The RR Museum is a \"must do\" in Sacramento! Full size trains and locomotives fully-restoredand wonderful volunteers and exhibits to tell you about the glory days of the railroads. Look for the \"lost spike\"."], ["Reviewed September 15, 2017", 5.0, "A Trip Back in Time", "The Railroad museum takes you back to the challenge of putting a railroad across the US, and brings you up to the modern day. Lots of hands on exhibits even the most hyper kid can enjoy. Treats the last time included a model railroad as well as the chance to ride on a train along the Sacramento River through Old Sacramento. This is a great family experience .\nShow less"], ["Reviewed September 14, 2017", 5.0, "Appreciate the history.", "Great to learn more about the history of the city. Educational tours are always encouraged within our family and the facility did a great job. Very happy we went through this time after time."], ["Reviewed September 14, 2017", 5.0, "Amazing railroad museum!", "I have been hear for several events both public and private. The collection of railroad equipment is one of the best in the country. It is a must see for every railroad buff.You can step back in time and be on a sleeper car and see how they ate in the dining car. Wonderful place!\nShow less"], ["Reviewed September 13, 2017", 4.0, "A Museum...not to be missed", "Maybe its my age, but it is an amazing museum. So much is to be learned from the railroad history. I never get tired of going there when friends visit from out of state."], ["Reviewed September 13, 2017", 5.0, "Best Train Museum in US", "This is a fabulous railroad museum! California State Parks has done a first rate job with this facility. This is a must see for train aficionados! After visiting the museum there are plenty of other attractions nearby in Old Town Sacramento."], ["Reviewed September 13, 2017", 4.0, "Great museum", "Well designed with extremely well trained docents. Mist of the actual trains were inside. Good educational displays thus museum also offers tours. We are glad we went."], ["Reviewed September 13, 2017", 5.0, "All Aboard", "This is a really cool museum, they have trains set up with motion and decorated as they would have been when they were actually in service. There's an exhibit of the proposed high speed train that makes me want to take a ride on it."], ["Reviewed September 13, 2017", 5.0, "Not to be missed", "Whether you're young or young at heart, the California State Railroad Museum is not to be missed. We completed a self-guided tour which was great for us. We were able to view the rail cars, read the historical markers and descriptions and enjoy our own pace. Well worth the price of admission.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Enjoyable for all ages", "This Railroad Museum is one of the best in the nation. The museum is enjoyable for the whole family and can be experienced multiple times. If you are local I recommend getting a membership. It is a great deal! They have member events, give discounts and allow early access to the amazing Polar Express!\nShow less"], ["Reviewed September 10, 2017", 5.0, "California State Railroad Museum", "If you and your family/friends like trains, you'll love this museum! Your visit starts with a movie. The trains are wonderful; you can actually climb into some and walk through the various cars. The exhibits are great and there is a children's play area. I highly recommend it!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Tripping the past", "Love this place. Kids especially like that they can enter trains and get a Taste if the past. Great family experience, also enjoyed the train ride along the river."], ["Reviewed September 8, 2017", 5.0, "Incredible", "A must and make sure to take the guided tour first. Earl was our tour guide and he was great. Full of information and personality. Then we were on our own to enjoy the displays many interactive. They also had additional docents in each display to provide additional information.\nThe museum boasts all original displays not reproductions. You can spend hours here.\nDon't miss this it is the best thing in Old Sacramento\nShow less"], ["Reviewed September 6, 2017", 4.0, "Well done RR history museum", "Don't miss the vintage sleeper car - evokes images in your memory from the train scenes in \"White Christmas\" and \"Some Like It hot\""], ["Reviewed September 6, 2017", 4.0, "Great place for a relaxing informative visit", "Great place for a relaxing informative visit while in old Sacramento . Lots of information on the history of the railroad and California . Nice train exibits .fun for the whole family looking for something to do"], ["Reviewed September 6, 2017", 5.0, "Trains, train cars", "Had a great time at the museum. lots of things to see and do. The docents have loads of information."], ["Reviewed September 6, 2017", 4.0, "Railroad museum", "Very nicely done. Enjoyed several hours learning the history of the railroad. Great for kids as well"], ["Reviewed September 6, 2017", 5.0, "This is a must see", "If you love trains, this place is for you. From static displays to train cars that have sound and sway back and forth as if running down the tracks! Old engines from Steam to Diesel. You can easily spend all day enjoying the museum.\nIt is located next to Old Town Sacramento with tons of parking. Easy in and out to interstate 5.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Chaperone of a school trip to CSRM", "This is a wonderful point of interest for all ages. It has a great historical story, told with actual locomotives and railway cars. Much of it is interactive, with visitors being allowed to get into, and onto the cars. The docents are friendly, and very knowledgeable. Upstairs they have a hands on play area for children, and a great collection of display and fully functioning model trains. Every year during Xmas time they have an excursion train, primarily for children but enjoyed by adults as well. The train runs about 8 miles, while actors enact the story of \"The Polar Express.\" Every passenger on the train gets a cookie and a cup of hot chocolate. My children and grandchildren enjoyed that visit very much. It is a state operated museum with a fairly moderate attendance fee. It is well worth the time and money. It is located on the bank of a picturesque river in a scenic part of \"Old Sacramento. I have visited this museum numerous times in the past. Each visit is as enchanting and educational as the previous visits.\nShow less"], ["Reviewed September 6, 2017", 5.0, "many areas to explore on 3 levels", "many areas to explore on 3 levels. Wheelchairs are available for use at no charge. Spent about 4 hours exploring with my 15 year old grandson who enjoyed the Museum also."], ["Reviewed September 6, 2017", 5.0, "Kids loved this place", "I was visiting 6, 12 yr old kids. I thought only younger one will enjoy this visit. Both kids enjoyed this visit."], ["Reviewed September 6, 2017", 5.0, "Went here a while ago, had fun", "I went to this as a kid in grade school, and would recommend it to anyone. Its right near old Sacramento and the vibe in and around the building is great. The museum itself is large and airy - it has to be because they have actual trains inside!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Excellent museum, but it may be a challenge to keep little ones interested", "We traveled as a family and greatly enjoyed this museum. It's educational, well-maintained, easily accessible, and honestly it's just a marvel to see. It's also conveniently located across the street from the main parking structure and just a stroll down from Old Sac. We enjoyed the museum and then followed up with some sweet treats close by. There's plenty to see with three floors of exhibits. The only thing to caution is that younger children might lose interest as the visit progresses. Still a great museum and unique experience.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Best Railroad Museum", "The museum is big and very informative. We went in several trains to see the inside. Docents were very knowledgeable. Took 20 min break in the theater watching film. It is amazing what a great role did railroads and trains played in American History."], ["Reviewed August 29, 2017", 5.0, "A Must see Museum!", "We throughly enjoyed this museum! The docents were well placed for information and questions. We did the tour, watched the movie and looked at all the exhibits. Loved that the sleeper car rocked and you could walk through it and the dining car. Great way to spend a hot afternoon!\nShow less"], ["Reviewed August 29, 2017", 5.0, "Docents are helpful!", "Walk through railroad cars: coaches, sleepers, even an ice car. Docents improve the experience with their knowledge, and real life experiences. Model trains exhibits cover all sizes. Be prepared to walk to see the all of the locomotives and other exhibits. 3 floors with elevators."], ["Reviewed August 29, 2017", 5.0, "Family trip", "We spent a few hours inside this museum. We were having fun as a family and even though I do not have little kids anymore and they are teens they still really liked walking around the place and looking into the past! It is very beautiful inside, clean and organized. The staff is also very friendly and will talk to you and answer any question you might have!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Very impressed", "I've been to a good number of train museums and was impressed by this one\n\nThey have plenty of trains here all with good detailed information on. Interestingly they also have an original train from the 1860's as it was the day it was purchased! (Trains are often rebuilt several times because of the heavy wear and tear + converting to more modern technology / a different usage over time. The small train there was actually not powerful enough to do anything the train company wanted it to do so it was just kept in reserve, hence it being original in its entirety.\n\nI have to just say the guide Bob was awesome and obviously still passionate about the tour even though he does it on the half hour every hour)\n\nThe museum is also in the old town so you do two things at once (it's also by the art museum but I went on a Monday when it's closed)\n\nP\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great Way to Spend the Day", "Full sized train cars throughout the museum. Walk through the dining and sleeping cars for the full feel of what a train ride would be like. There is a video plus an interactive area for the kids. The 45-minute train ride is not part of the museum tour, but be sure to do it. It's great fun. The 3rd floor contains the toy trains and will certainly bring back memories of your childhood. Lots to love here. Great fun.\nShow less"], ["Reviewed August 27, 2017", 3.0, "Educational", "This was #1 on my daughter's to do list during our day in Sacramento. They have 19 steam locomotives from 1862 to 1944 and signs to learn about the development of steam technology. They were interesting to look at, but I enjoyed very much the displays about life of the railroad workers.\nShow less"], ["Reviewed August 26, 2017", 5.0, "I LOVE this museum!!!", "I have been to this museum with family and friends several times over the past decades and it is still one of my absolute favorite attractions in Sacramento. Everyone I have brought has had a great time and there is always something that is new and improved. There is literally something for everyone at this museum, whether a fan of trains, a history buff or just interested in experiencing a world class museum. With the added attraction of being located in Old Town Sacramento, it a must do for locals and out of towners as well! I highly recommend it for everyone!!!\nShow less"], ["Reviewed August 26, 2017", 4.0, "Trains are the best!", "Always loved trains so this was a no brainer for me. Affordable, entertaining and educational. Very good static displays and collection of toy trains."], ["Reviewed August 24, 2017", 4.0, "Fun place to see history.", "This was only my second visit in 25 years, and it was still amazing. Lots of trains and train memorabilia, excellently displayed. The staff is awesome, and I can't say enough about it. A must see if you are in Sac for any longer than a couple hours.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Fantastic museum", "We went here because we still had some time to kill before checking into the hotel by the airport, my husband loved trains as a kid, and it got good reviews. I understood the good reviews pretty much immediately! What a great museum. There is so much to see, the museum is incredibly clean, the staff is great, and the displays are very well thought out. We were extremely impressed and will be recommending this museum to everyone we know that will be in the area.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Amazing Trains", "WOW...The best train museum in the west for sure. Add this stop in Old Town Sacramento to your buck list. The trains are amazing, BIG, amazing history about the railroad connecting the west and the east.\nGreat private collect donated by Tom Sefton (San Diego) to the museum. Friend staff, great docents, great movies.\nPlan no less then 4-5 hours to enjoy the museum. The gift store was also fun.\nPark in the Old Town Sacramento parking garage across the street from the Train Museum\nShow less"], ["Reviewed August 20, 2017", 5.0, "Excellent Museum", "This is an excellent railroad museum, with great exhibits and beautifully restored engines and cars. The upstairs has a great collection of model and toy trains. The docents are friendly and informative."], ["Reviewed August 18, 2017", 4.0, "Big iron dragons here", "Age of steam comes to life here. If you are a kid at heart or have kids whose eyes go wide in wonderous shock at the mention of anything fire breathing this is a place for you!!! Some of these coal eating monsters are a block long and several storey tall. A mountain locomotive has eaten the little engine that could....History of this country's march to the ocean unfurled in a spectacular way here through various exhibits. Be prepared to be amused by docent or two who are train enthusiasts and can probably tell you more than you ever wanted to know about lubricants used to keep all this cast iron huffing and puffing along\nShow less"], ["Reviewed August 17, 2017", 4.0, "Great historical exhibition of Train and roads of California", "This is situated at old Sacremento We got late to go here so we had only a short time to go through the entire place, it was very well organized and properly explained, wish we had some more time. This place is fully committed to the history of Rail roads and the trains.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Historic, Educational and fun", "There was lots of historical information. The movies were excellent and so was the tour. If you are lucky enough to be there when the steam train is running it is well worth the ticket. If it is a hot day, I recommend spending extra for the first class ticket for air conditioned accommodations and a feel of what first class travel was like during the train era.\nThe museum has a floor dedicated to \"toy\" trains which any model railroader would love.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Great Way to Spend an Afternoon", "I've been to this museum twice and each time come away really impressed with the exhibits and staff. There are a ton of train cars, engines, and trolleys that you can walk through while the staff on hand are very informative about each one. Be sure to check out the toy trains on the second floor!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Don't shortchange yourself with just an hour visit, though it's already worth the admission if you only have an hour.", "Its location at the edge of Old Town Sac with many dining options and shops/buildings that take one a step back in time wonderfully complements this museum. The museum is near an actual train station. Great break from the summer heat. I'd expect kids to love it, the seniors citizens with me loved it. Certainly if you enjoy trains this is the place for you but if you also enjoy history, dioramas, scale modeling, technology and photography there are bits of these for you as well. Major impact was the sheer scale of the full-sized locomotives. The walk through the sleeping car with the gentle rocking and dining cars with china displays are both presented to great effect and help illicit the romantic charm of a bygone era. Bonus - Absolutely impressed with the three volunteers/workers I encountered. Very welcoming, so dignified, informative and helpful. I was sensing their pride with the museum. Be sure to save some time for the additional exhibits and activities on the 2nd and 3rd floors. A real gem. Good gift/book store with something for all ages. And within the day there are return privileges too, convenient for taking a lunch break. I wholeheartedly can recommend this attraction.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Wow----just wow!", "Unless you hate trains for some reason, this is one of the most fun AND educational museums I have seen in a long time. There is something for everyone at the Train Museum! My 7 year old grandson loved----EVERYTHING."], ["Reviewed August 14, 2017", 4.0, "A Great Railroad Museum", "A very neat museum with a large variety of trains that you can walk around and through. The facility is large which make it nice when there are a lot of people it doesn't seem like it. Great educational experience."], ["Reviewed August 14, 2017", 5.0, "A Step Back in Time", "The Sacramento Train Museum is another one of those something for everyone places. The history of the railroad and the people who made it happen is awe inspiring. The trains in and of themselves show a time and place not to be forgotten. There is lots of comfortable seating throughout the train museum. Experiencing the trains by actually going on board is an adventure for any age. The mail train car is a quality reminder of how things use to be when mail was delivered by train. And the dinning car displaying elegant China dishes is an experience in itself. There are trains of every speciality to experience up close and personal. Again I have visited many times.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Great, Able to Get in Front Cab of 4882!", "Very well done Railroad Museum. Huge building housing several old steam locomotives, displayed extremely well and all in great shape! Toy train area for the kids. Lots of \"conductors\" around to answer questions and take your photo. If you are a train aficionado, this is a must!\nShow less"], ["Reviewed August 14, 2017", 5.0, "Well worth the ticket price", "The bulk of the reviews give the museum a 5 star rating and I can not disagree. I had a wonderful morning wandering through the exhibitions and following the story of the railroads as they developed across the country. The staff were wonderful and I learned so much from them. What a great museum but it still comes second to The National Railway Museum in York in the UK.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Trains, History Lesson mixed with humor", "Spent the day in Old Town Sacramento. First stop was the California State Railroad Museum. We took the guided tour. It was intertaining and full of history facts we enjoyed our tour guide who explained how the railroad was built from coast to coast. The human effort in building the railroad all was nothing short of amazing. The trains are Huge and the real deal. The Museum store has history books on the railroad and lots of other memorabilia.\nShow less"], ["Reviewed August 13, 2017", 4.0, "So much history", "The volunteers do a great job of educating everyone who wants to learn. A great movie is also available for more education opportunity. They also have a simulator to pretend to drive a train."], ["Reviewed August 12, 2017", 5.0, "A Trip Back in Time", "When I walked into this museum, I was instantly in AWE! I wouldn't say I was A big fan of train before. I was just looking to do something I hadnt done. Walking into the beautiful interiors of this trains, I honestly felt I was in the world 100years ago. One funny thing is there would be a mannequin and then a real person. It would be scary to see the real person move or speak. Lastly, people were a LOT smaller than we are niw.\nShow less"], ["Reviewed August 8, 2017", 5.0, "A step back in time!", "This is an awesome museum about the railroad. The story of how the transcontinental railroad began. So many anecdotes of people and places along the way. The museum has old trains that are in wonderful condition that you can walk through. I especially enjoyed the dining cars. One dining car has representations of china used on different railroads of the time. Great place for adults and children. I would allow about 2 hours for this museum. More, if you are a detail person.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Calif State RR Museum", "Outstanding display of engines, cars, structure and models. Information on construction and terminus of the Trans-Continental RR."], ["Reviewed August 8, 2017", 5.0, "RAILWAY RIDE", "I visited the museum because my grandson is a fanatic for trains. Even though he did not attend, the experience personally for me was top notch. The guides were highly knowledgable and friendly. This is a place no child should be deprived. It is informative and interactive. The gift shop would place any child in a candy store.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Train Buff Heaven", "This is one of the better museums I have visited. The restored railroad rolling stock is amazing, some of it just huge. You can experience what it feels like to ride in a Pullman car, and there are train rides on summer weekends. Very informative, and held my interest. And I don't consider myself to be a train buff.\nShow less"], ["Reviewed August 8, 2017", 5.0, "A must for the kids (big & small)", "Great Museum! The history is amazing! Highly recommend for everyone to go, whether you've lived here all your life or are a tourist yourself!"], ["Reviewed August 8, 2017", 5.0, "CA Railroad Museum Rocks!", "I had been here before for a company-sponsored event, but my most recent trip with the nephews (9 and 12 years old) was amazing. Take the tour at the start. Our docent, Paul, made the learning so much fun and the information he provided enhanced the rest of our exploration through the three-floors of exhibits. I was particularly impressed with the quality of the displays; bias-free, frank write-ups; the professionalism of staff; and the very thoughtful layout, including accessibility considerations. The museum has something for all ages and you do not have to be a train enthusiast to enjoy your time there. Tickets are reasonably priced and allow in/out privileges. We used this option to find a shady spot for a homemade picnic, but as the museum is located in Sacramento's Old Town, there are also plenty of eateries within walking distance.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Don;t be surprised how cool this is", "First, I am the worlds worst tourist. second, I am not a big train buff. So I was very reluctant to go to the California State Railroad Museum. I thought I would be bored to death.\n\nI was very wrong.\n\nFirst impression is its 'kinda quaint' with the park ranger attendants and understated little gift shop.\n\nPay the modest fee and step into a place that will make you want to come back. From the scale of the largest locomotive ever (1 million lb) to the largest exhibit of scaled Lionel trains (every scale) this place is first class. Restored dining cars that ramble through the countryside complete with the clack, clack, clack of the rails, the gentle rocking back and forth as the countryside is traversed the cross roads bells and mooing cows all with perfect doppler intonations. Not your thing, the grandeur of the private rail cars, the assortment of the finest china and the a view into the kitchen and its gourmet meals.\n\nMaybe you like history or the AMC show Hell on Wheels-its all here, including the painting with all the characters (except Cullen Bohannon)-this is your place. Asian American and what insights into how this country was united coast to coast- there's a lot here for you.\n\nI won't tell you everything because I just scratched the surface.\n\nWe have taken many reluctant visitors here and the outcome was always the same-they loved it. From the exhibits to the architecture to the things large and small, historical and engineering-there is something for everyone.\n\nRemember, I am the world's worst tourist but I enjoyed, equally, the unguided and the guided tours. This place is a treasure\nShow less"], ["Reviewed August 8, 2017", 5.0, "If you are a train lover, a history buff, young or young at heart, you will love this museum.", "There is so much to see here! Sacramento was originally a railroad town as well as a gold discovery site. This is the history of the railroad in the West. There are many trains that you can walk through and lots of windows to peek in. There are model trains. There are old trains. There is the history of luxury train travel. Admission prices are low. This is a great family activity.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Alonso and the trains", "One of my grandsons is 4 years old. His mom and I had planned a visit together and we wanted to be sure Alonso had a good visit. So we went to the California Train museum. The trains were wonderful to see. Alonso loved going in the trains and the docents working there were very good at explaining things to a 4 year old little boy..he loved the visit very much and so did we.The entry price was not bad and there is an interactive area on the second level that is specifically designed for children ...a very hands on place.\nShow less"], ["Reviewed August 8, 2017", 5.0, "A great day for train buffs!", "A great day for the family to review the history of railroads. This is a wonderful museum and I highly recommend at visit."], ["Reviewed August 7, 2017", 5.0, "California Railroad museum", "EXCELLENT...! Recommend this for anyone that may be interested in railroads or the Trans-Continental railroad. This museum is well done."], ["Reviewed August 7, 2017", 5.0, "One of the Best in the Country!", "What a wonderful museum, they cover the building of the transcontinental railroad from the west through to modern times - the high-speed rail being built between LA and San Francisco. They also have a floor dedicated to all the different types of model trains. Definitely worth the visit for any family with an interest in trains and/or history.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Worth the price!", "If you love trains, you will love this Museum! This was my second trip and I enjoyed the evening more than the first."], ["Reviewed August 5, 2017", 5.0, "A Beautiful Museum", "Took a train from Denver to Sacramento so of course we needed to see the Railroad Museum. What a treat!!! It was hot outside so it was nice to go in and cool off for a few hours. Keep in mind you could stay here all day. Worth the price of admission to go back in time and see how the rail system came to California. Exhibits are beautiful and you get to board a few of the trains. A great for kids as well as adults. Lots of walking involved so keep that in mind.\nShow less"], ["Reviewed August 3, 2017", 5.0, "A great place for kids (and little ones too!)", "I'm nothing but a big kid myself, so going here is quite a treat. I took my granddaughter there and she loved it. She is a toddler, and wasn't afraid of the large locomotives. She especially like the play area for children, of course. If you want to spend a couple of hours just enjoying being together and exploring a vibrant past, this is a great place for families, train buffs, aka \"foamers\", and history buffs.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Interesting for train buffs", "Lots of interesting displays for adults and some play spaces for kids. It's a great place to get out of the summer heat. The play tables for younger kids were really enjoyed by families visiting. My son was a bit older so he enjoyed going through the rail cars. Good movie too. Right next to Old Sacramento shops and restaurants.\nShow less"], ["Reviewed August 2, 2017", 5.0, "What an unexpected treat", "Well worth going out of your way to visit. Incredible exhibits. Rich with history. A definite must see!"], ["Reviewed August 2, 2017", 5.0, "Great place for railroad buffs", "This has to be one of the most comprehensive museums for fans of railroad engines, cars and history. I have visited on several occasions and always find something new. The facility also works well for corporate events which was the reason for my most recent visit.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Yes this place has lots of trains!", "This is a great place to see how trains evolved over the years and how they were so important to the growth and economy which connected California to the rest of the world. Kids will love this place as well, there are quite a few interactive things that they can do there. My nephew has a seasons pass and goes once a month. For tourists or visitors from out of town this is a great place to add while you are taking in the sites and sounds of historic Old Town Sacramento.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Trains, history, design and more", "For anyone interested in trains, railroads , American history or design this is a must. I went with a friend and her 2 eight years old boys. We all loved it. The old school workmanship of trains and carriages is outstanding. It goes from old times through to today. Even has some restored cars.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Interesting museum!", "This was our third time to visit the museum and there were several new exhibits. There are trains to tour, exhibits teaching the history of the railroad, and lots of interactive exhibits. In a separate building, there is a replica of the old train station. They also have a variety of different types of model trains. It is a museum that would be good for children, adults, train enthusiasts, and anyone interested in history.\nShow less"], ["Reviewed July 28, 2017", 4.0, "All aboard for a great museum", "As a rail fan and model railroaders, this was a treat. Seeing the various engines and rolling stock and passenger cars inside the museum was great, especially seeing their restored condition. The \"skeletal\" diesel display was neat, allowing passers-by to see what's behind the skin. History buffs and fans of AMC's Hell on Wheels will appreciate the Central Pacific engine and the accompanying history. Docents are knowledgeable. The other treat for me was the impressive Lionel operating exhibit upstairs, donated by a long-time collector. But don't miss the outdoor exhibits, which is easy to do!\nShow less"], ["Reviewed July 27, 2017", 4.0, "Great for young and old", "This is a wonderful museum even if you are not a train enthusiast! My husband and son really enjoyed it and there are many interactive displays for kids to get involved in. There is a great film about the history of the California railroad that runs for around 20mins which gives you an understanding of the development of the railway. There are many life-size carriages to explore which is fantastic.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Must see this!", "Allow at least a couple of hours, there is much to see. To Rail Fans of all ages this is the best set of exhibits I have seen. Worth a side trip even from the Bay area."], ["Reviewed July 24, 2017", 5.0, "Sacramento Hot Day Gem", "We met six friends for an afternoon in Sacramento. It was too hot to go to the state fair; instead, we chose a visit to the RR Museum. What a great family activity with interest for all ages! 2-10 year olds were fully engaged in the third floor model train collection. The second floor offers interest to teens with simulations of the role of a train engineers. The main first floor has several trains of various sizes, including Pullman dining and sleeping cars. Half past each hour the museum provides any history buff with a detailed history of the transcontinental railroad. We had a very enjoyable two hour time.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Worth it, something here for everyone", "This is a very impressive railroad museum for the trains and for the glimpse into California's history. Open spaces with room to roam. There is something here for everyone. My dad (70) and son (16) both found a common ground! Definitely recommend to anyone visiting. Do your self a favor and park in ether parking garage at Old Sacramento. Circling the area looking for a street spot is a waste of time.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great place if your kids love trains", "This place is awesome, my family really enjoyed themselves here. My son loves trains since he's been watching all those Thomas shows.\nThe museum is awesome, they have many different types of vintage trains.\nThere's a third floor with Toys trains for all the kids. We spent hours here as my kids were constantly playing with all the toys and didn't want to leave.\nThe 2nd floor was great, they had a train simulator.\nGreat place for the train lover...\nShow less"], ["Reviewed July 18, 2017", 5.0, "Excellent!", "Before our visit to Sacramento I checked Trip Advisor for things to do. After having attended the California State Railroad Museum there is no doubt as to why it is the #1 thing to do in Sacramento.\n\nThe museum has been very well done and appeals to all ages. I would recommend beginning with the brief history movie on the American railroad and then take the 30 minute guided tour. Paul our guide was very knowledgeable and kept us engaged. I learned a ton. You could easily return and cover ground you did not the first time around.\n\nIf you are thinking of visiting don't hesitate, it's worth your time.\n\nShow less"], ["Reviewed July 18, 2017", 5.0, "Outstanding Museum on the impact of trains on our culture, history and commerce.", "This was my second trip to the museum and really enjoyed the historical perspectives and background over the years, including the recent addition of a high speed train. The exhibits are very well done, we especially liked the real trains one is able to walk through, this adds great scale and a better understanding of what they were and are like. Very informative!!\nShow less"], ["Reviewed July 18, 2017", 5.0, "If you're looking to experience history or trying to avoid the Sacramento heat, this is an excellent place for the whole", "Great place to visit for a trip back in time. Hands on exhibits the whole family can enjoy. There's even a place for the little ones to play with toy trains."], ["Reviewed July 17, 2017", 5.0, "Fun for kids and adults", "My husband and I went here on our honeymoon eight years ago and enjoyed it. We decided to bring our two kids this year (5 and 1-year-old), hoping that it was as interesting as we remembered. It was! The kids really enjoyed it, and they aren't necessarily into trains. They loved climbing into the full-sized trains, and my son got a kick out of the high-speed simulator. The toy trains at the end were really crowded, so they didn't enjoy that as much. We went on a Tuesday and there were a lot of workers around to answer general questions and give more information on the trains. It was fantastic.\nShow less"]]}}