{"Cannery Row": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Cannery Row", "url": "/Attraction_Review-g32737-d108607-Reviews-Cannery_Row-Monterey_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/10/be/b7/f9/come-explore-historic.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "3695"}, "address": {"@type": "PostalAddress", "streetAddress": "Cannery Row & Wave Streets", "addressLocality": "Monterey", "addressRegion": "California", "postalCode": "93940", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "lots of shops and restaurants; fun to walk around", "a fun place to walk around and window shop; pick up your typical tshirts and such; and have some seafood but it doesn't feel overly touristy like Fisherman's Wharf in San Francisco. Very clean and safe area."], ["Reviewed 2 days ago", 2.0, "Nice but not worth day trip", "We couldn't help but think homeless slept here at night and then they made them leave in the morning. There was an overwhelming smell of urine everywhere. Looked like it had been hosed down but smell lingered everywhere. Definitely not worth the trip if you are traveling far to get there, many shops that all sold the same souvenir junk. Beautiful view if you can stand the smell while looking at it\nShow less"], ["Reviewed 3 days ago", 5.0, "Destination Spot", "This is a must visit area of Monterey. Lots of shopping and fantastic restaurants without feeling to touristy"], ["Reviewed 4 days ago", 5.0, "John Steinbeck's Legend in Monterey, California", "I know this place like the back of my hand since I lived in the Monterey area and was a merchant on Cannery Row for 37 years. My original wood sculpture gallery Stohans became a Cannery Row landmark. Cannery Row was originally a huge fishing industry with about 30 cannery buildings operating on this famous street. Eventually the fishing boat fleets over consumed the fish in Monterey Bay nearly to extinction and later the cannery companies gradually went out of business, leaving many empty buildings behind. Afterwards, many of the old cannery buildings were converted into restaurants, hotels and retail stores. At the end of Cannery Row lies the Monterey Bay Aquarium and nearby you will find the famous Doc Ricketts Lab.\nShow less"], ["Reviewed 4 days ago", 4.0, "Fun area", "Cannery Row is a good spot to visit while in Monterey. Lots of shops and restaurants line the street. You can visit the aquarium and walk while people watching. A bit touristy for us - but as a stop over it was fun."], ["Reviewed 1 week ago", 3.0, "Fun the first time, but so very much like every resort town.", "Too many old T shirt shops, too little local stuff. You have to go if it is your first trip to town. After the first day, you will want to go elsewhere."], ["Reviewed 1 week ago", 4.0, "cannery row visit", "My sister and I spent the day at cannery row , had a wonderful time going through the shops and walking around enjoyed the beauty of the ocean"], ["Reviewed 1 week ago", 5.0, "Improved", "It's been several months since I've been to Cannery Row and today I was quite impressed. Some new businesses - new paint on some older buildings - Things looked clean and inviting to visitors. I love to walk the area and now even more so. So many people were out today enjoying the sunshine and beautiful weather.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Typical tourist trap", "The place is cool especially if you like to shop, but is a typical tourist trap, high prices, crowded, expensive parking."], ["Reviewed 3 weeks ago", 5.0, "Fun place", "Wife and I had a great time.lots of shops and great food.I walk with a cane and it was easy walking.very nice people working in the shops.We had so much fun we went twice on the same trip"], ["Reviewed 3 weeks ago", 5.0, "Fun spot!", "Best visited by bike, there are several great shops an restaurants along Cannery Row. We enjoyed our dinner complete w/ a water view."], ["Reviewed 3 weeks ago", 5.0, "So wish I had had more time!", "Cannery Row was absolutely fascinating. I could have easily spent an entire day there without hesitation (but I would have needed more money for sure!) Really enjoyed the party-type atmosphere and the lights at night were amazing! Will spend more time there if I ever get back!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Clean, fun tourist shopping area, complete with local \"color\"", "Cannery Row has some colorful history and thanks to John Steinbeck, a fixed image in people's minds. It's surprising that the only restored cannery (non-operational) and history is in the Monterey Bay Aquarium - itself a renovated cannery!\n\nFun shopping, from typical coastal tourist shops to upscale decorations, art, and clothing. there are a number of good restaurants with wonderful views of the Monterey Bay, and ample parking within a block or two of Cannery Row.\n\nIn there are a number of historical sites within a mile or two to make a day of it.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Touristy, but interesting, good signage along the sidewalk", "There are several very touristy shops, but the signs along the sidewalk are informative. Worth the time."], ["Reviewed 4 weeks ago", 5.0, "Get In Touch with Your Inner Tourist", "Okay, at one time or another we are all tourist. What better place to channel your inner tourist than Cannery Row? Lots of distractions and ways to separate you from your money but you won't mind. Abundant food options (Local and Chain Restaurants), Wine tasting, Sea gazing, shops full of things to bring home to the unlucky ones that weren't able to join you, walk/bike path, awesome aquarium and the ever changing cool tunes at McFly's Bar where you can dance the night away. Become the tourist you only have been able to read about. John Steinbeck would be happy to know you enjoyed his home town.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "A nice stroll", "We went here right after spending the morning at the aquarium (its right next door). It was a pleasant stroll but the stores were mostly tourist type places that could have been anywhere in the country. Like a bubba Gumps restaurant with a line out the door, or a place selling Indian clothing. One unique place was a souvenir store with Pebble Beach items a discount prices. An interesting concept that does not show up everywhere. We found parking nearby for $10 a day. Not a bad way to spend alittle time and increase my step count but not so good for shopping.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Not your Steinbeck era Cannery Row....", "A renovated area consisting of small shops and restaurants with the Aquarium at one end of Cannery Row. Great for a couple of hours of shopping....\nMany buildings maintain some of the memories of this historical location.... a nice place to shop and have a quick snack or meal.\nThere are several pay parking lots located in the area. but street parking is available...\nA nice escape for a few hours.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great place to shop.", "My wife collects ladybug stuff. Found some cool things she does not have. Shops keep you busy looking at items. Good place to buy suvoniers and window shop."], ["Reviewed 5 weeks ago", 4.0, "Cannery Row kept pristine!", "Love walking down cannery row. There is a lot to choose from when it comes to food here. Seafood of course is everywhere. There are a lot of Italian restaurants and America food. Restaurants around here don’t make it unless they are good due to costs so every place we ate at was good. The shopping and the beaches are all right here on cannery row. There is a lot to do around this area.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Plenty Of Things To See And Do With A Few Distractions", "Lots of gift shops and places to eat with the historical part of Cannery Row almost invisible except for the walk-ways that cross above the street. You can find ice cream sundaes to prime steaks here as well as wine tasting and ocean view dining. There's plenty to see and do for the whole family. Top draw of course remains the aquarium-who doesn't love to watch sea life up close? The gift shops all pretty much carrying the same items so it often pays to shop around first. One thing that bothered me while walking around was the unpleasant smell of urine at certain spots on the street-what a shame!\nShow less"], ["Reviewed January 24, 2018", 4.0, "A lot of people concentrated in a very small place", "We stayed at the Holiday Inn on Cannery Row for a couple nights in December. During the week this is a very charming area. On the weekend it was just really overcrowded. There is extremely limited beach access but a beautiful walkway overlooking the ocean. The area is under construction and the whole of Cannery Row is about a block. We parked at the hotel but it appears there is a decent amount of public parking a block off. The Aquarium is also within a block's walking distance from Cannery Row.\nShow less"], ["Reviewed January 23, 2018", 4.0, "cute small town", "Getting out of the aquarium, we turned left to the mainstreet shopping. It was nice to walk around and eat some icecream."], ["Reviewed January 23, 2018", 5.0, "Divers shops and restaurants", "Not many establishments in the area disappoint. Indulge in cocktails, dinning or entertain the children at many points along the row. Many recreational adventures in the area."], ["Reviewed January 21, 2018", 2.0, "Purely designed for tourists", "The cannery row has rich history, popularized by John Steinbeck.\nThe modern day Cannery Row is nothing more than a small street with shops for tourists. Most of the historic buildings and canneries are gone. Don't spend too much time there. There is very little to see or do there.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Met expectations", "There is a lot of history around Cannery Row, but today it's mainly a tourist location 4 shops. Oddly, the restaurants in this area don't have great reviews. If you're coming to Cannery Row it's probably to see the Monterey Bay Aquarium. Make Cannery Row the icing on the aquarium visit cake.\n\nOut of town and international tourists will love Cannery Row. It's very America nostalgia.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Everything!", "Awesome!! Such fun, spent the day shopping, roaming & eating!! Returned to our hotel spent but super happy. We'll be back next year!"], ["Reviewed January 18, 2018", 4.0, "Great walk around!", "Very nice, clean area to walk and enjoy with friends or family. Lots of wonderful boutique shops and chain restaurants to choose from. Beautiful coastal and beach views. Don’t forget to visit the Aquarium! Plenty of parking available."], ["Reviewed January 16, 2018", 2.0, "tourist trap", "On a nice day this is a fun place to walk around, but it is a tourist trap loaded with chain food and stores and too much fakeness."], ["Reviewed January 15, 2018", 4.0, "Enjoyed an afternoon on Cannery Row.", "Our Family enjoyed some shopping, eating , a massage, and learning about some of Cannery Row's history"], ["Reviewed January 15, 2018", 3.0, "The Tourist Spot", "I've lived in or visited Monterey since the 50's. Back then, even up to the 80's, there were still strong elements of the cannery days. Very little of that remains today. The Aquarium is an excellent visit, but I wouldn't waste more than an hour or two with the rest of Cannery Row. Lots of gift shops for that needed souvenir, some senic vista spots, places to eat- a tourist spot\nShow less"], ["Reviewed January 13, 2018", 5.0, "Fun", "So much to see and do. Shopping, dining and fun. There is a maze kids can get in and have an all day pass. There is so much to keep a family of all ages busy."], ["Reviewed January 11, 2018", 5.0, "Fun Place!!", "Monterey bay cannery row is full of fun shops and restaurants to wander in and out of for hours! A short walk to the marina you can see lots of cool things right from the pier. We spotted jellyfish, fish, crabs, sea anenames, sea lions & a pair of sea otters! It was a great time..\nShow less"], ["Reviewed January 11, 2018", 3.0, "Steinbeck would be sad", "Standard fare - american tourist attraction. Limited unique flavour coloured by an overabundance of pan-handlers claiming to be war vets. Was hoping to see something / anything of the charm put forth in Steinbecks novels. Was sadly let down."], ["Reviewed January 10, 2018", 5.0, "Favorite for Locals and Tourists Alike !", "This strip never gets old. I go several times a month, just to relax. There are plenty of restaurants (both upscale and cheap eats), bars, shops, attractions (mini golf, lazer challenge, mirror maze, wax museum, aquarium), and beach fronts to explore. It's beautiful in the daytime and lively/romantic at night. There are parking garages, as well as plenty of street parking on each block (although usually completely packed since the Row is always busy).\nShow less"], ["Reviewed January 10, 2018", 5.0, "Perfect spot", "It’s a must in Monterey. Such a nice and fun place. You can walk eat shop and have drinks. Several restaurant have a nice ocean view."], ["Reviewed January 9, 2018", 4.0, "Cute and fun walk", "Cute coast side commercial area with good eats, nice views, and family entertainment. We spend a couple of hours there when we go."], ["Reviewed January 9, 2018", 5.0, "Great food", "So many food options and beautiful views of the pier and the ocean. Loved it! You can easily spend half day here."], ["Reviewed January 8, 2018", 5.0, "Great little shops", "Cannery row is a fun place to visit during a day trip or a vacation. There good places to eat and fun little shops to go into. Cannery is a must do thing in Monterey. It is very close to the beach. I would recommend this to anyone that is close to Monterey and is looking for something to do. It is a very fun place to go to.\nShow less"], ["Reviewed January 7, 2018", 3.0, "A Nice Place to Shop and Tourist Watch (but John Steinbeck is Turning in His Grave)", "In Steinbeck's Depression Era days, the fish canneries of Cannery Row (never a place of riches) had hit hard times, and the place was littered with silent factories, strewn with broken dreams and whatever hard drunks become when they haven't got the money to buy a drink....and loads of character to spare that inspired Steinbeck to write about the locals. Today, the Row has been re-conceived: upscale shops for tourists (no more local trade here)...restaurants for tourists...tourists for tourists to tourist-gaze, and the same paradise-on-Earth sunshine that has always drawn people to Northern California. There's magnificent natural beauty all around, and the Aquarium, too, reflects that, so why anyone would come all the way to Monterey to see other tourists being tourists escapes me. But if that's your thing, you'll have a satifsying afternoon.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Nice for a Short Visit", "Cannery Row is a developing tourist area. They build off of the fish cannery history of the area. Though there are some quaint areas, most of the original cannaries are long gone as they collapsed from neglect and were not well built in the first place. Renovations and new construction cary the look of the originals. You will find a number of souvenir shops and restaurants with an emphasis on sea food, of course. Sadly, you also find corporate restaraunts lime Bubba Gump and Starbucks which undermine the quaintness of the location. It is easily walkable and you will enjoy the stroll. Sea otters and birds are found along the shoreline. At one end is the aquarium and there is a small park on the other.\n\nI called it developing as it looks like they are building off the history, but they have a ways to go. I would have liked to have seen a museum or a tour featuring the history. Connect us with Steinbeck's writing and the movie. Perhaps a couple of classic fishing boats to create ambiance. There are signs with some information, but nothing that really tells the full story. They just need to make the story and history more central to the experience.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Great to visit", "Fantastic place to visit with kids. Plenty of places to eat and drink. Many gift shops and quality boutiques. Nice afternoon to spend in a very pleasant atmosphere"], ["Reviewed January 4, 2018", 2.0, "Tourist Trap", "Standard Tourist Trap... You see the Bubba Gump Shrimp and you know you are in a tourist trap. All the standard boring shops, souvenirs etc... pretty boring,"], ["Reviewed January 4, 2018", 3.0, "Lots of small stores and shops", "Lots of stores and small shops definitely a tourist attraction I think the food here is little bit better than its on the pier. There's not much more to say it's like most tourist attractions."], ["Reviewed January 1, 2018", 4.0, "Great place for Christmas Eve!", "We walked down here on Christmas Eve and had a great time. Lots of nice shops, and learned a lot that I wasn't aware of about the sardine industry and fishing the Pacific."], ["Reviewed December 31, 2017", 3.0, "great for exploring", "I agree about parking issues but once you find parking spot it was nice to explore shops and food places and was fun so I recommend to spend few hours here. Would like to come again when it is off peak season just to go to aquarium next time.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Must stop in Monterey", "While parking could be an issue here, great place for eating seafood in the many restaurants, boutiques, and attractions for the kids. Stop in and browse the shops and grab a meal!"], ["Reviewed December 26, 2017", 4.0, "Great place to walk around, shop and eat.", "A great place for a stroll. There are plenty of little shops, ice cream parlors, bakeries and restaurants. Some look more modern and some look like they probably did when they were first built, which adds to the character of the place. There are several places where you can look out over the bay. The highlight is the Monterey Bay Aquarium at the end of the row. I would recommend driving from the Bay Area to see the Aquarium and also spend time afterwards walking Cannery Row and eating dinner at one of the many restaurants. But not sure I'd recommend driving from the Bay Area to only see Cannery Row.\nShow less"], ["Reviewed December 25, 2017", 4.0, "Fun Tourist Attraction with lots to do in Monterey!", "Cannery Row is one of those places that you must visit in Monterey. It is like visiting a beach boardwalk (sort of) at Long Beach, Pacific Beach, Virginia Beach, and etc.\n\nThe difference is there is no beach, but it is a rock ocean front area that you can see beautiful water and sea creatures (like sea lions).\n\nThe other difference is that there area many shops, restaurants, wine bars, and WINE TASTING.\n\n***Definitely check out the Taste of Monterey.***\nShow less"], ["Reviewed December 23, 2017", 5.0, "Beautiful Little Town!", "Cannery Row is a must see when in Monterey! Walking distance to the Aquarium and has a good number of shops to check out when exploring! Great small novelty and souvenir shops as well! Very nice place during the night and definitely a safe place to walk. The deck off the Intercontinental Hotel has a beautiful view overlooking the shore and waves coming in!\nShow less"], ["Reviewed December 20, 2017", 2.0, "Very Disappointed!", "The last time I came to the Cannery Row Outlet shops, I went home with a back seat full of stuff. I suppose everyone went to Gilroy, but I was so looking forward to shopping there...I came upon near abandonment, space after space empty and it was pretty creepy. Pendleton did not have outlet prices, but the VanHuesen store was worth the trip.\nShow less"], ["Reviewed December 19, 2017", 2.0, "Not a Lot There", "Super touristy and there's not a lot left to give you a feel for what this area was like in its heyday. I was disappointed and next time I was in the area I didn't feel any need to go back.\n\nTick the box and move on.\nShow less"], ["Reviewed December 19, 2017", 4.0, "Nice afternoon stroll", "Nothing special that you cannot find in other places. Gift shops, small restaurants, seafood, souvenirs etc."], ["Reviewed December 19, 2017", 3.0, "Well kept and worth visiting", "We walked through on a walk along the coats. It was nice to stick our head in a few stores but didn't find there was much more to do here. I would recommend going as the buildings are very nicely presented."], ["Reviewed December 18, 2017", 5.0, "Fresh and quaint", "Love coming to this area at least twice a year. Great seafood, small shops and relaxed atmosphere. All within walking distance to your hotel."], ["Reviewed December 17, 2017", 4.0, "Repurposed history", "Cannery Row is lovely in the morning, and walkable if you don't mind climbing hills. It's a little bit upscale for my taste. Best time to go is first thing in the morning."], ["Reviewed December 15, 2017", 4.0, "Quaint place", "We were here on a week day so not crowded. A lot of attractions in this area, obviously the aquarium, we enjoyed lunch at the wine market & bistro. The white facade makes a pleasant change."], ["Reviewed December 11, 2017", 3.0, "John Steinbeck would be horrified.", "I certainly understand that Monterey needed to milk what they have from John Steinbeck's classic novel, but the poor guy must be rolling in his grave to look down on this shameless tourist trap. To be realistic, it is a street of schlock shops and touristy restaurants.\n\nPleasant enough, but do not go out of your way unless you've come to visit the Monterey Aquarium which is a first class attraction (and which I have reviewed separately).\nShow less"], ["Reviewed December 8, 2017", 3.0, "Nice walk around", "Pleasant enough area, restaurants, nick knack shops etc. Aquarium at one end, fisherman’s wharf at the other\nNice boardwalk areas, and nice feel. Got the feeling you spend the day on the beach then come up to Cannery Row to eat etc\nWon’t take you long to see it all even at mooch speed. Parking did not seem cheap. Nice statue in the middle, all with Santa hats for Xmas\nShow less"], ["Reviewed December 7, 2017", 5.0, "Great place to see", "This is one of our favorite spots. We love the food and shopping. Outlet Mall is good, however only two main stores left in there, sad to say. Check out Pendleton while you are there, great prices and product.\nThe cinnamon roll place is way overpriced, watch out there. Highly recommend this place.\nShow less"], ["Reviewed December 7, 2017", 3.0, "Walked through on the way the Aquarium", "Very quaint and pleasant to walk through but unless you like shopping that we don't not much else to it."], ["Reviewed December 5, 2017", 5.0, "Really Enjoyed Cannery Row", "My husband and I had the opportunity to walk Cannery Row in November while visiting Monterey and loved the shops boutiques and restaurants well as the Acquarium"], ["Reviewed December 5, 2017", 5.0, "Always fun", "I always love walking along Cannery Row. There are so many shops: from your typical touristy tshirts and trinkets to specific golf and jewelry stores. There are plenty of restaurants to choose from, and hotels are also on the Row. It's great for people watching also. And you can't miss a stop at the Monterey Bay Aquarium! So much joy in one place.\nShow less"], ["Reviewed December 4, 2017", 5.0, "Love it so much that we stayed two extra days.", "Our hotel was right on Cannery Row, but we have been here in years past and it has become so much more welcoming and interest. The shops and restaurants, the parks and history are well worth the trip and a must see if in the area.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Very Nice", "This is a very nice place to gather and enjoy many local attractions. The biggest problem is to find a parking spot."], ["Reviewed November 30, 2017", 4.0, "Commercialised zone", "This is no longer the Cannery of the John Steinbeck novel. in fact is more closely resembles Disneyland then those days. Still it is worth a wander through but more like a 2 hour stop than a full day visit. 2069"], ["Reviewed November 30, 2017", 4.0, "Love the Vibe of this Place !!", "This is a good place to just walk around and take it all in !! It is touristy, but that you should already expect. There is plenty of shops to take in and restaurants around so that should keep you busy !! I loved it and being a tourist to the area, totally enjoyed it all :)\nShow less"], ["Reviewed November 30, 2017", 3.0, "Very commercial", "This is a shopping / restaurant street with few real links to its history and only slight reference to Steinbeck. There are some good explanatory plaques here and there"], ["Reviewed November 29, 2017", 5.0, "A great street to wander the day away", "Lots of interesting shops and restaurants, all bordering the seafront with sea lions and sea otters to entertain you. Totally recommend Monterey and its fab atmosphere."], ["Reviewed November 28, 2017", 4.0, "Classic Monterey", "Enjoyable to walk and search around a bit away from the tourist shops and vendors. The old buildings and their layout and arrangement tell a story, as was so well laid out by Steinbeck."], ["Reviewed November 28, 2017", 5.0, "A little touristy and A little retro - but fun", "It is definitely retro coastal California and at times a bit too touristy. But all in all, nice variety of eateries, lots of shops (some better than others), jaw drop views and a few aquatic animals (jelly fish, lots of fish and some otters).\nTake a deep breath, pay a little for parking, bump into tons of strollers and enjoy the crowd.\nShow less"], ["Reviewed November 27, 2017", 3.0, "A bit touristy, but plenty to interest the Steinbeck fans", "On first inspection, Cannery Row is a bit disappointing. Lots of shops selling fairly unremarkable, over-priced t-shirts and trinkets, albeit from the original cannery buildings. But once you poke around away from the main shopping areas, there is a lot about the local history and the people & places where John Steinbeck found his inspiration.\nShow less"], ["Reviewed November 24, 2017", 4.0, "A stroll through", "An old part of town and very interesting. Full of restaurants and gift shops. Basically a bit of a tourist trap!"], ["Reviewed November 24, 2017", 5.0, "Fun Place", "Cannery Row was a fun place to take a stroll and visit the shops and get a taste of what,it must have been like when it was a real cannery row."], ["Reviewed November 23, 2017", 5.0, "Lots of shops, restaurants and hotels here!", "I heard that Cannery Row was a good place to visit if you are staying, eating and shopping in Monterey, CA. We didn’t stay in a hotel here, but we had lunch at the pub and we bought a few souvenirs. Cannery Row did not disappoint!\nShow less"], ["Reviewed November 23, 2017", 4.0, "Fun Time", "Wife and visited the cannery row during Thanksgiving and it was a wonderful time. Very basic stuff, bunch of good restaurants and candy stores. Enjoy your time worth trying!"], ["Reviewed November 22, 2017", 5.0, "Cannery Row, A Must See!", "If you have never been to Cannery Row you simply must go, it is so much fun, dining, shopping, indulging in sweet treats, adult beverages, night life, and beautiful hotels by the Monterey Bay. We have been time and time again and each time we see something new. You really need to allocate a day to take it all in and to enjoy a variety of dining experiences. I would recommend staying at one of the hotels along Cannery Row that way you are close to where you are staying and can park your car and walk to everything. : ) have fun!\nShow less"], ["Reviewed November 18, 2017", 4.0, "Great place to visit", "Pretty touristy with many shops with overpriced merch but it's definitely something to see when in Monterey!"], ["Reviewed November 18, 2017", 4.0, "Walk through Cannery Row", "My wife and I recently visited Monterey with friends while on a cruise vacation. We strolled along a very nice walk way to Cannery Row. The area is beautiful and right along the beach. There are many interesting shops and eateries at this must see location. I would definitely recommend this very cool area and hope to return.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Something for everyone", "Cannery row has changed a lot in the last 30 years - more tourist oriented - but there is still something here for everyone.\n\nYes, there are the dreaded tourist traps, but mixed in are galleries and interesting stores. The anchor of the row is the Monterey Bay Aquarium, which is one of the best in the world. You can still see Ed Rickett's lab, and learn a lot of history. If you're a fan of Steinbeck, then you see where all the places from the novels were - even if almost none still stand.\n\nOne really cannot visit the area and not go.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Shops and Restaurants", "Lots of restaurants and shops. All pretty much geared towards tourists, but there were some interesting historical sites as well. Plus several places to grab a drink and snack and look out at the Bay."], ["Reviewed November 14, 2017", 5.0, "From Sardines to Tourist", "Iconic Cannery Row is the Monterey waterfront street where sardine canning factories once thrived, until 1973. Now transformed into shops, restaurants and hotels. VERY COOL! We loved walking though this area. It was interesting to see the vintage sardine labels displayed from the light posts. Its a nice walk from Fisherman's Wharf. Wear your walking shoes as most surfaces are uneven.\nShow less"], ["Reviewed November 14, 2017", 3.0, "Ultimate tourist trap!", "Lots of shops selling stuff to tourists and cruise ship passengers with some nice restaurants. Great bike path. Rent a bike! Go south of town for the best views. Did not do the aquarium, but it is pricey."], ["Reviewed November 13, 2017", 3.0, "Really fairly ordinary", "There are a lot of shops and restaurants and hotels along the row, but nothing really stood out other than the view of the sea that you can see at many places. The Aquarium is located at one end of the Row and this is worth going to.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Cannery Row is Lit!", "Rows of restaurant and souvenir shops line this historic street of Monterey! On top of the street is the luxurious hotel - inviting, welcoming guests. Short walk away is the amazing Monterey Bay Aquarium. Your visit is off to a good start just walking on Cannery Row.\nShow less"], ["Reviewed November 11, 2017", 5.0, "A Row of Fantastic Little Shops!", "I really enjoyed shopping on this lane! There were specific stores of all types. In one, a socks store, I bought socks for myself and for friends. There were all types, so I got cat socks, penguin socks, and s'mores socks for a friend! My friend went to a Turkish store and bought a Spanish-language cookbook! Have the time of your life shopping here!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Excellent visiting", "It’s a good place, with a variety of businesses, can’t go wrong walking there. There’s food, candy shops, and other types of places to visit"], ["Reviewed November 9, 2017", 3.0, "A fun palce to walk through when visting the aquarium", "It's touristy but fun. Not worth a special trip unless you're doing the aquarium. You can use your cellphone to dial the free historical information at the marked stops."], ["Reviewed November 9, 2017", 4.0, "Interesting place", "Old sardine canning factories turned into shops, restaurants and bars in this part of town. It's cute, very interesting and certainly a nice way to spend a couple of hours while in Monterey. People were very friendly and we enjoyed the area."], ["Reviewed November 9, 2017", 4.0, "A bit touristy but hey that's not necessarily a bad thing.", "Cannery Row was of course originally a working cannery, and now has been transformed into a tourist area with the usual restaurants, funky shops, etc."], ["Reviewed November 9, 2017", 3.0, "OK place to visit. Food just average.", "Nice place to visit. Several burger-style places. Pricey for average food. Parking can be an issue. We parked at the base of the Presidio (free) and walked."], ["Reviewed November 9, 2017", 4.0, "Fun area to walk around and shop and eat", "This is right by the aquarium and is a little charming area to walk around by the beach and shop and stop for a bite to eat."], ["Reviewed November 7, 2017", 4.0, "Not Much Changes", "Always love wandering on cannery Row, no matter what the season. A bit more difficult when pre-teens/teens are along as there is not much for them to do and browsing in the very interesting shops is not their thing. The parking lots are a tad bit expensive- $20. For all day, but just $5 after 4 o’clock. Just a great place to wander and even relax and enjoy the beautiful bay.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Bubba Gump shrimp 🍤 and Steinbeck’s Cannery Row!", "We always have to come and visit Cannery Row. The shops are fantastic and my wife loves bubblegum shrimp! Our dog loves all the smells and we just love the atmosphere down here! Don’t miss it!"], ["Reviewed November 7, 2017", 5.0, "Loved walking around Cannery Row", "We drove down to Cannery Row on a Sunday evening. We were pleasantly surprised that all the shops were still open. It seems that most of them stayed open until 830 or 930pm even on Sunday evening. Lots of restaurants and shops and beautiful views of the bay. Worth a visit.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Touristy Yes-But Worth a Go", "This is a tourist destination-but there are some decent shops and some really good restaurants aside from the chain operations. Views-yep they got that all over the place. Parking is not terrible-get there early for some pretty close spots in the garages. Check out the non-chain restaurants for better food options.\nShow less"], ["Reviewed November 6, 2017", 4.0, "Great place to visit when in Monterey!!", "Tons of shops, restaurants and attractions. The Monterey Aquarium is on Cannery Row. You can spend hours in this area checking out the aquarium, shops and take a break for lumch! Cute spot."], ["Reviewed November 4, 2017", 5.0, "A Fun Day Trip", "Cannery Row has something for everyone. If you just want to people watch, it's the best. If you're looking to find lunch or dinner, there are many different kinds of restaurants from Mexican to Sea Food. If you want to shop, there's no better place. From exotic jewelry to a fun bazaar/import shop, there's something for everyone.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Nice even off season", "Visited cannery row with my wife and we took a bike ride up the coast to Pebble Beach. As it is “off season” it wasn’t crowded and the weather was great. Not too hot and not too chilly. Just right\n\nThe aquarium was open as well several souvenir shoppes and restaurants.\n\nWould definitely come Back during the summer Months.\n\nShow less"], ["Reviewed November 1, 2017", 5.0, "Great shops to explore", "Went to a conference and wanted to explore shops before heading back home. My husband and I took the trolley and visited different shops from ice cream to a seafood restaurant. Prices are reasonable and the people are so friendly."], ["Reviewed November 1, 2017", 4.0, "It's a Street but Worth a Stroll", "Cannery Row is a historic, vibrant and interesting place to stroll while in Monterey. We have stayed at a hotel three street up and truly enjoy just walking down to and along Cannery Row. The street is lined with hotels, restaurants and shops (some nice and some tourist junk). We have eaten in several of the restaurants and of course visited the Monterey Bay Aquarium which is at the end of the street. The best part for us is the easy access to the coast and the beaches. We often take the access paths leading down to the water or to an overlook above the water to view the sea otters. If you are in Monterey, a stroll down Cannery Row can be relaxing and enjoyable (unless it is overrun with too many tourists).\nShow less"], ["Reviewed October 30, 2017", 5.0, "Loved it!", "Lots of cute shops and history on cannery row. Also lots of great bars and restaurants. Right on the water with great views. Very safe area."], ["Reviewed October 30, 2017", 4.0, "Fun place to wander and people watch", "We walked around and just killed time before dinner. It was nice. Of course, it's a very touristy area but the surroundings are beautiful. We'll go again."], ["Reviewed October 30, 2017", 4.0, "Variety", "Shops, restaurants, places to stay, parking are all available on Cannery Row. The shops are numerous and probably one or more can be found to your liking! Early enough and you can probably park on the street or there is public parking available."], ["Reviewed October 29, 2017", 3.0, "Lots of shopping", "Cannery row is a historic place turned into a haven for shopping and restaurants. Other than that not much else. Worth an hour to just say you saw it."], ["Reviewed October 29, 2017", 5.0, "walking , shopping and starbucks", "Walked from the ships tendering spot along the monterey rec trails to the aquarium and stopped at all the shops , starbucks, etc along the way. was a beautiful day, the sea air, the harbor seals, otters, etc all made for a great day."], ["Reviewed October 27, 2017", 4.0, "Feel the Vibe", "Cannery Row is just a fun place to be a part of and a great place to stay. You can allow yourself just to submerge into just enjoying and absorbing your surroundings."], ["Reviewed October 26, 2017", 3.0, "Worth the visit due to Interesting history", "It was an interesting spot due to the history of the area. Lots of touristy shops, though. Decent restaurants."], ["Reviewed October 26, 2017", 3.0, "touristy and more touristy", "lots of shops and restaurants. nice little area to visit while you're in the area. would return if I were back in the area."], ["Reviewed October 26, 2017", 3.0, "Shopping", "There is a lot of different shops. It is a nice little walk interesting looking buildings. If you are looking for souvenirs you are in the right place."], ["Reviewed October 26, 2017", 3.0, "Average oceanside town but with Steinbeck statues.", "Strolled up and down several streets without much actual purchasing. Some food and tourist t-shirts. The Steinbeck statue was fun. Family went to aquarium but I went up 4 blocks to the used bookstore. Starbucks was actually unusually \"local\" for a Sbux. This was a good thing.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Typical tourist street with a few surprises.", "There’s quite a bit to do on this tourist street. Lots of tasting possibilities, such as olives, wine, jerky, hot sauce, beer and chocolates. Lots of restaurants, souvenir shops and good views of the bay."], ["Reviewed October 24, 2017", 5.0, "Shopping", "Lots of shops and restaurants. Definitely a fun place to visit. Take stroll along the beach, go kayaking, shopping, lunch or dinner. We were there for two days and still didn t have enough time."], ["Reviewed October 24, 2017", 3.0, "mostly gift shops and touristy stuff", "We didnt spend much time here as it reminded us of Branson MO and downtown Myrtle Beach SC. Lots of touristy gift shops and seafood restaurants. it was just ok."], ["Reviewed October 23, 2017", 5.0, "Touristy As Hell But You Just Have To.", "I read Cannery Row many moons ago so to be actually stood there is a great thrill. It's just about as touristy as you'll ever get, but sometimes you just have to don't you."], ["Reviewed October 23, 2017", 5.0, "Excellent stop", "Stopped here for a visit/lunch break as part of a coach tour. Great place, full of history and lovely views. Had take away fish and chips from the Fish Hopper restaurant and whilst we had to wait a while the food was worth it and we sat by the ocean to eat it.\nLots of shops selling tourist gifts.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Perfect weather - Beautiful ocean", "Weather was great,made shopping extra fun. The ocean had huge beautiful waves. Definitely a great stay"], ["Reviewed October 22, 2017", 4.0, "Like most ocean side tourist areas.", "We stopped for lunch and some shopping here after a whale watching tour. The Cannery is much like other beach side tourist attractions—lots of restaurants, souvenir shops, sweets shops, and a few expensive gift and clothing stores. Lots of signs stating that patrons should not touch.\nShow less"], ["Reviewed October 22, 2017", 3.0, "Super touristy, not much to do", "It wasn't quite what we were expecting - it was quite a bit more rundown than we had anticipated. The entire area is less than a mile long and packed with a bunch of random touristy stores selling all of the same merchandise. I wouldn't spend more than an hour here - possibly just walk up and down the street to see it and move on.\nShow less"], ["Reviewed October 22, 2017", 3.0, "Tourist shopping", "There is nothing but a few random tourist cheap shops and some places to eat. Definitely a one time visit, never need to go back."], ["Reviewed October 20, 2017", 4.0, "Things to do in Monterey", "A nice place to spend some time when you are in the Monterey area. Nice shops and good atmosphere, though nothing very particular."], ["Reviewed October 20, 2017", 4.0, "Touristy but interesting", "We walked from Fishermans wharf to Cannery Row. Many of the oceanfront hotels we passed looked lovely . The shops and wharf were interesting at Cannery Row, particularly the Pebble Beach outlet shop."], ["Reviewed October 19, 2017", 5.0, "Historic Site", "We visited Cannery Row on a sunny warm fall day. The restoration of historic buildings is heart warming. The preserved signage and the glass block on some older structures was very impressive. The flowers lining the outside of some businesses and the sculptures along the lower area of the Row were stunning. There was ample room to stroll along the walkway in the mid morning hours.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Historical Walk", "This is a must do walk when visiting Monterey.\nPleasant 20 minute stroll from Fisherman’s Wharf along the coastal path seeing the old Cannery buildings now being updated and in some cases replaced by upmarket hotels and restaurants.\nMuch of interest to see and many opportunities to shop.\nMonterey Aquarium is at the Southern end.\nLots of seabirds and seals on the rocks.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Nice shops", "Not as touristy as expected and some genuinely nice stores. Wish we'd had more time here as I would have loved to have spent more time browsing."], ["Reviewed October 18, 2017", 3.0, "Tourist shops", "If you love souvenirs then this is your street! I bought a coffee and enjoyed wander but would prefer to do a tour to get more history of the area."], ["Reviewed October 17, 2017", 5.0, "love the shops, stopped at many, my daughter loves mermaids.", "cannery row is the place to be. make sure you have some good tennis shoes on, to do some walking around.\nI had flip flops on and my feet hurt afterward. I did take many pictures outside the shops. very fun and happy time, will always think of the good times at Monterey.\nShow less"], ["Reviewed October 17, 2017", 3.0, "Girls Trip", "Nice place to walk and look at shops, places to eat and drink. History.Some areas you can see the warer."], ["Reviewed October 16, 2017", 5.0, "Always a nice stroll between Monterey and the aquarium.", "We stayed at a hotel on cannery row and walked on cannery row as well as the bike path that goes parallel to lighthouse and the row. The are several nice parks, great shopping and restaurants. There is a Ghirardelli chocolate store, Irish pub, pizza and several good seafood restaurants.\nShow less"], ["Reviewed October 16, 2017", 5.0, "More than a tourist trap", "Cannery Row is locally and world wide known. Back in the 20's and 30's, it processed more sardines than anywhere in the world. Today many of the buildings still stand, all converted to restaurants, gift shops and bars. Just a few walking blocks is Monterey's Fisherman's Warft, and just a block away is the world renowned Aquarium. Parking can be an issue. One can spend an entire day or a few hours. The views are gorgeous the weather seems to always be perfect, 62 to 72 degrees. The history is intriguing along with the entire place is dog friendly. I take my two Danes and always greeted well.\nShow less"], ["Reviewed October 16, 2017", 2.0, "I Can Buy Candy And T-Shirts At The Mall", "What a tremendous disappointment. The Monterey Bay is one of the most breathtaking settings on the California Coast, and I spent my afternoon negotiating crappy junk stores. Nothing worth spending time here for, other than perhaps finding a bar with a view of the Bay - which is what we wound up doing. Not a fan at all.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Walk around Cannery Row", "My wife and I just walked around Cannery Row to see the sights and to find a good place for lunch and ice cream. My wife is vegetarian so finding a good place for her was not easy. She likes veggie burgers. Not many restaurants on Cannery Row had veggie burgers but Cooper's Pub did and their veggie burger was excellent and their English style fish and chips and ale was even better. Later we stopped at Ghirardelli for a wonderful sundae. A great day of fun and eats.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Lots of Shops and Great Restaurants", "We walked along Cannery Row visiting shops and restaurants. We had to stop in and have a water massage. Wow, was it incredibly relaxing! There were several wine-tasting opportunities as well. By all means visit Cannery Row on the day of your Aquarium visit."], ["Reviewed October 11, 2017", 5.0, "Nice shops and restaurants", "Cannery Row has a lot to offer when it comes to shops, restaurants and entertainment; all being so close to the ocean. Very clean."], ["Reviewed October 11, 2017", 5.0, "You can feel the history. Great restaurants with a wonderful view.", "The aquarium is a must visit when you go to Monterey and Cannery Row has really adapted to the times with a vintage feel. My wife and I really enjoyed strolling the street. We grabbed some coffee and cookies at the Nestle Cafe. Got the munchies and went to the Sugar Shack. Enjoy the history!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Always fun", "My family and I visit Monterey a couple times a year. We love it! And we always enjoy walking cannery row and looking at the shops. Definitely a must stop for anyone visiting."], ["Reviewed October 11, 2017", 4.0, "Good night life", "Loads of restaurants and bars. Most types of food.People are friendly and happy to talk in bars. Temperature swings about 15-20f each day and night time brings in sea mist"], ["Reviewed October 10, 2017", 4.0, "Steinbeck", "It is the history and the connection to John Steinbeck's book which makes Cannery Row a special and interesting place to visit."], ["Reviewed October 10, 2017", 3.0, "Nice streets", "While these streets are a bit historic, they are like so many others in such areas, lined with shops, cafes, etc. Easy to stroll and window shop or drop in for a drink but rather average."], ["Reviewed October 10, 2017", 4.0, "Excellent", "Great time to stroll with your love one.. we had a great time visiting the different stores. Parking is not good.. so you have to get there early if you want parking. Very little handicap parking."], ["Reviewed October 9, 2017", 3.0, "Like any other tourist street", "Not overly impressed by cannery row. It was full of all the tourist type places you find in any city. It was almost exactly like Fisherman’s wharf in SF."], ["Reviewed October 9, 2017", 3.0, "Expensive restaurants and not our favourite Pacific Highway stop off", "We had high hopes for Monterey but felt it was nowhere near as good as Pismo Beach as a stop off on ocean highway. In general the restaurants were expensive and did not offer anything special to justify the high prices."], ["Reviewed October 9, 2017", 4.0, "America, the same", "It's a very nice coastal shopping area, and rich in history, when one looks for it. But it's not much different from every other upscale shopping center in every other upscale beach resort."], ["Reviewed October 9, 2017", 4.0, "nice", "It is a nice place to spend an hour or two at the most. Some special shops and restaurants you won't find everywhere"], ["Reviewed October 8, 2017", 3.0, "Quite Good", "We wandered around whilst staying in the area overnight. Peaceful little place to wander about & I got to spend it with my hot wife. Lots of shops & restaurants to choose from, we took advantage of the good happy hours :-) 8/10"], ["Reviewed October 7, 2017", 4.0, "Nice", "Cannery Row was nice and lovely (one we found it haha!). Everything was very pricey though food and shop wise which would be my only qualm. It does have a lovely location and is home to what I think was the first ever Bubba Gump"], ["Reviewed October 7, 2017", 4.0, "Very touristy", "Cannery Row is a mix of tourist shops and restaurants. If that's what you like, you'll be in heaven here. There are remarkably few places to sit and, especially, few places to sit and enjoy the view of Monterey Bay. If you want a less touristy experience, the trail about a half block inland is a better choice.\nShow less"], ["Reviewed October 5, 2017", 3.0, "Nice", "Nicely located along the water, a series of shops and restaurants await. I’m not a shopper so I didn’t engage myself this way but it was still a pleasant walk, detouring often to sit and look out at the coast."], ["Reviewed October 4, 2017", 4.0, "It is Touristy but still fun", "We were in Monterey for 3 days for the Jazz Festival and other things, so Cannery Row had to be done. My daughter was interested in the Aquarium, which is housed inside an old cannery building. There are lots of shops and restaurants in the area so if you are looking for something like Ghiradelli Chocolates or Ray Ban sunglasses you are in luck. Interesting area to stroll around. Found a restaurant with clam chowder sourdough bread bowls, just what I was looking for. It's pretty, being right near the water.\nShow less"], ["Reviewed October 4, 2017", 4.0, "very lively", "We visited Cannery Row while staying in Monterey. The area is where sardines were canned in years gone by. The buildings got into a neglected state but the area is now vibrant with eating premises and a vast array of shopping outlets and hotels. Worth a visit\nShow less"], ["Reviewed October 3, 2017", 4.0, "Great way to spend some time..", "Cannery Row has numerous, hotels, shops, restaurants and also leads down to an excellent aquarium. It is a fun street to stroll down and enjoy the shops. Right along the ocean so has great (free) views. Worth a small detour if you are going thru or staying in Monterey. Hotels right on the street are a little expensive but very nice. There are also hotels located just off the street.\nShow less"], ["Reviewed October 3, 2017", 5.0, "My how it has grown", "Cannery Row has expanded to being two streets wide and loaded with good places to eat, wonderful looking places to sleep, and plenty of interesting shops. Plus the aquarium! Everything you need, all in one place."], ["Reviewed October 3, 2017", 4.0, "Lots of shops and resturants to explore", "Lots of fun little shops and resturants to explore during the day. At night the options are less. Overall a good family oriented area"], ["Reviewed October 2, 2017", 4.0, "Normal Tourist Shopping Trip", "Lots of souvenir shops and small places to eat. Most of the shops sell the same merchandise and prices seem to be coordinated between the stores, so no need to spend tons of time here."], ["Reviewed October 2, 2017", 5.0, "So Fun !!", "My adult daughter and I went for my birthday and she wanted to see the Aquarium, which we did! We took so many pictures as you can see every kind of fish, stingray, sharks and jellyfish, it was incredible each and every different aquarium was so clean you could see so clear it was almost like touching them. One particular stingray posed for the camera, it let us take multiple pics and did multiple poses for us. It was a GRAND TIME! There were great shops and restaurants, you really must see for yourself. Great for couples and children!! Oh and did I mention the awesome blues band we heard off Canary Row? I give music and entertainment a 10.\nP.F.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Fun place to go hear live bands at night", "We ended up going to cannery row 3 times in 2 days. Twice we stopped in at the cannery row brewing company for a late night light meal and drinks. There was live music in at least 3 of the clubs, and the area was not overly crowded for Friday and Saturday nights. We returned on Sunday to check out the shops and the views of the bay. We also enjoyed looking at the Monterey statue which is in the bay overlook area. Some of the shops seem a little tired and smell slightly musty, but are fun to step in to browse.\nShow less"], ["Reviewed September 30, 2017", 4.0, "Quick visit but fun", "Only managed a fleeting glimpse but the Row is full of interesting shops and things to see. Along from the marina it is easy to find - prices seem reasonable too - at least compared to the other parts of the West Coast we have travelled to recently. Coopers Pub is a good place to stop for a drink and food.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Wide Variety of Shops and Restaurants", "We really enjoyed our walks here during our vacation. You cannot get lost as it is mainly one wide strip with the Auarium at one end and The Monteray Plaza Hotel at the other. I especially liked the Fish Hopper restaurant. The Aquarium has a wonderful history of the Cannery as well as artifacts and photographs. You can book excursions at one of the offices as well as renting diving equipment and bicycles.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Worth a visit", "If you are in Monterey, this is certainly worth a visit. For me it is a piece of history, and I enjoyed stopping and taking a picture of the sign and looking at the buildings. We walked around, had lunch and dessert, and visited some of the shops.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Out of state", "Fun place to look around and shop. We went to the aquarium and then walked around cannery row. Had a great time"], ["Reviewed September 27, 2017", 2.0, "Yuk!", "This is Disney Steinbeck. Between all the candy stores and t-shirt shops you will find a statue of Steinbeck and the Cannery Row crew. Doc Ricketts house is there... you can view it from the street if it isn't open for a tour. Way too commercialized for me.\nShow less"], ["Reviewed September 26, 2017", 4.0, "picturesque street by the ocean", "Lovely place to relax and enjoy the ocean. worth staying a couple of days while visiting Monterey area. Lots of shops, nice restaurants but more important, access to the oçean where you can see marine animals such as otters and seals all within an eye distance from the shore. the history of fish canning is interesting, with the aquarium right there. a perfect two days vacation where you dont need a car...just relax and enjoy!\nShow less"], ["Reviewed September 26, 2017", 4.0, "Nice Place To Walk", "We walked by the water and took pictures of the sea lions sunny themselves on the rocks, and then strolled along Cannery Row. I bought a cute tee shirt at one of the shops."], ["Reviewed September 26, 2017", 3.0, "Great piece of History", "Visited Cannery Row ,there are shops and places to eat and drink but not as many as I was expecting but great bit of history worth a visit we would have gone into the aquarium but far too expensive.\n\nOverhaul worth a visit you can even catch a free bus there and back from the sea front at Monterey\nShow less"], ["Reviewed September 25, 2017", 4.0, "Nice place to while away a few hours", "Lovely part of town to spend a few hours browsing around the shops and dockside with a great choice of restaurants and shops"], ["Reviewed September 24, 2017", 4.0, "old world", "Some very nice restaurants there, you can also watch the sea lions relaxing under the board walk, they can make a racket... well worth a visit people very friendly"], ["Reviewed September 23, 2017", 4.0, "Nice Walk!", "We parked by fisherman's wharf and walked to cannery row which was a great walk especially seeing the seals. I attached a picture of one sunning himself on a lone rock....hysterical! Anyway we stopped at a few places in Cannery Row for food and drinks and then checked out some shops. We enjoyed walking around the area.\nShow less"], ["Reviewed September 22, 2017", 4.0, "Monterey visit", "A nice walk from Fisherman's Wharf. Many restaurants on the water. Variety of shops. Sandy beaches in some areas."], ["Reviewed September 22, 2017", 5.0, "Roadtrip", "Many varieties food & shops from coffee, burgers, cookies, ice cream, seafood, Mexican, bubbu gump, pasta to antiques, t-shirts, souveneirs."], ["Reviewed September 22, 2017", 5.0, "A must see in Monterey", "We spent about 3 hours here wandering around all the shops and did the Wax Museum. The museum is dated but gives a very good review of the history of the Monterey area."], ["Reviewed September 22, 2017", 3.0, "Interesting Walk", "The street is not that long to walk. Lots of restaurants and gift shops. There are several historical markers and signs giving a history of the Row and local features."], ["Reviewed September 21, 2017", 5.0, "Vacation", "We spent the afternoon shopping at Cannery Row. There are a lot of adorable shops mixed in with typical souvenir shops. Lots to see and do."], ["Reviewed September 19, 2017", 3.0, "Ok but not a lot there and dead after 8pm", "We would visit again, but it's limited. I insisted on a hotel on the row and it was a good location, but would I bother again, probably not in September. Cannery row is ok but a couple of hours you've done it. This is not to say don't bother because everything else that's here is well worth a visit, but stay at any hotel and just drive in as the place is closed after 8pm at this time of year, we were hoping to wander and try a few wines extra but there's none of that at this time. So in short visit, it's great, but don't make a big effort just for \"cannery row\" - it's the stuff around it that's good.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Nice when the sun is out", "This is a touristy place, but it is nonetheless fun to stroll around, has beautiful bay views and offers much historical context of the area and the row specifically."], ["Reviewed September 19, 2017", 4.0, "Always worth a stroll / view", "The novelty of Cannery Row is always worth a stroll and view of the many stores, shops, and restaurants there. One can never loose sight of the fact that EVERYTHING is needlessly overpriced - for tourists, of course. There are still some great views of the shoreline from several vantage points by ocean that should always be capitalized on. And some of those may entail purchasing a (e.g.) room, a meal, or, sometimes merely a stroll near the center of Cannery Row to view the beauty of Monterey Bay - for some great photos.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Great Shops, Restaurants & View of Monterey Bay!", "Cannery Row has so much to offer, lots of Restaurants to choose from, shops to go in and out of and an overall enjoyable walk! We were able to take some beautiful pictures of Monterey Bay. A must stop when visiting Monterey!"], ["Reviewed September 18, 2017", 5.0, "Interesting", "Interesting place, can get really busy but seems much less \"tacky\" than Pier 39 in San Francisco. Really lovely area."], ["Reviewed September 18, 2017", 5.0, "Beautiful", "A beautiful place to visit, with lots of restaurants to choose from, shops and an aquarium. Has a small beach area, but the water is very cold. Beautiful blue water. Worth a visit."], ["Reviewed September 17, 2017", 5.0, "Cool Place", "The Aquarium is Amazing all the shops are cool the one with movie star pictures is neat and as seen on tv shop also cool but some of the restaurants are excellent not going to name them because every ones taste is different but I truly feel there is at least one restaurant for everyone regardless of taste so many different things to do and see also shopping is great chocolate shop is off the hook very cool place.\nShow less"], ["Reviewed September 15, 2017", 3.0, "Busy and Eclectic if you are a Shopper", "We actually spent very little time in the shopping district - not our thing - lots of traffic, narrow streets, a couple one way streets. Park and walk if you like the shopping thing. We enjoyed the waterfront."], ["Reviewed September 15, 2017", 4.0, "fun", "A little street to walk around. There are alot of stores in the area, many restaurants. It's a nice little spot"], ["Reviewed September 14, 2017", 4.0, "Very nice", "Lots of shops and restaurants here. Nice place but thought all the restaurants were very expensive. Also difficult to park. A few parking places but they are 15 and 18 dollars for the day. Best to try and park one street up as there are more chances to park up there. But nice to see if your in Monterey.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Shopping, Eating, Sight Seeing", "Plenty of shopping and eating here. There is great places to stop and take pictures of the seals and ocean. There are bars and breweries as well as bakeries, pizzerias, candy shops, coffee shops, and shopping. Stuff for children of all ages. Have to pay to park everywhere and there is a fishy smell in the air.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Shop till you drop... Then eat!", "Fantastic shops, lots of variety. Food of every kind and for every taste. When you exhaust yourself you can take a spa break along the way."], ["Reviewed September 13, 2017", 3.0, "Touristy", "Cannery row has always been a tourist attraction but the last few years it has gotten way too crowded. And as sometimes happens it can get pricey. Most of the resturants on the main street are just average and not a great value but it is fun to stop in to one and have a drink while looking out to the ocean. There is a Gharidili chocolate shop with a soda fountain which is fun to visit and alot of touristy shops with trinkets that can probably be skipped.\nShow less"], ["Reviewed September 12, 2017", 3.0, "Revamped buildings", "The area had been revamped but unfortunately with lots of low end shops (with some notable exceptions). Overheard some young girls saying \"why is there so much sugar?\" and that about summed things up. The aquarium is the obvious centre piece and I'm sure that it's excellent but it wasn't what we were interested in that day so we gave it a miss. Would visit on another occasion when we are geared up for it. Interesting to see what has been made of a run down though historical area. It's just a shame that the shops are so unappealing.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Fun shopping", "I know this is a touristy area, but I liked it. There are some great shops and terrific restaurants. Love walking this area, especially on a day when the weather is nice."], ["Reviewed September 10, 2017", 3.0, "Shopping Haven", "Cannery Row is now filled with gift shops and tourists. Thus, for a feeling of the fishing and peninsula culture I prefer touring the National Steinbeck Center that's about 15 miles away in Salinas."], ["Reviewed September 8, 2017", 5.0, "A lot to see!", "It's so much fun to walk around Cannery Row. There are lots of fun shops and restaurants. You can also walk on the rocks and look for sea creatures. It does get crowded on the weekends, so go early!"], ["Reviewed September 8, 2017", 2.0, "Nothing to see here...", "Whilst the Monterey peninsula, Carmel and the drive south is gorgeous, sadly those looking for Steinbeck inspiration will be disappointed. It's a pretty down ar heel tourist trap. Read the books instead."], ["Reviewed September 8, 2017", 5.0, "Lots to do!", "Love to walk around Cannery Row. There is a lot of things to do and see. Great shopping and great restaurants!"], ["Reviewed September 7, 2017", 4.0, "Touristy but Local Stuff too!", "Cannery Row is full of great places to eat with awesome views, lots of shops - from $$ to $$$$ places but all fun to wander in/out of. Parking is next to impossible but there are parking lot and garage options available. I was just there on a girls trip but saw lots of families and everyone seemed to be enjoying everything.\nShow less"], ["Reviewed September 6, 2017", 3.0, "No weekend", "Beautiful places and views all along the row but to really enjoy you need to visit Monday's through Friday. The aquarium needs 4 to 8 hours to hit the best parts. The Grotto is up tight and a rush job on weekends but the best meal are through the week.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Beautiful", "Very neat spot in the Monterey area full of history. Plenty to do with many shops and places to eat or drink. The aquarium is fun and there is a small access to the water. Fun place to visit and explore."], ["Reviewed September 5, 2017", 4.0, "Shops and More", "Nice area to walk and shop. Several eateries and places to just set and look. Parking can be a problem but if you keep riding a parking spot will become available. There's a small beach area that the kids will love. Look for the seals. They are everywhere.\nShow less"], ["Reviewed September 5, 2017", 3.0, "Crazy busy touristy", "I guess this just isn't my type of relaxing vacation. The only thing I enjoyed was going to Ghiradelli for a hot fudge sundae."], ["Reviewed September 5, 2017", 4.0, "A beautiful place to visit", "It's filled with quaint shops, great restaurants & very clean. The only down fall is the parking - costly & few of."], ["Reviewed September 5, 2017", 4.0, "Nice to be in Monterey", "Had dinner @ McFly's which is always yummy and strolled among the shops. It's touristy but we love the aquarium."], ["Reviewed September 4, 2017", 4.0, "Nice ambience", "Walking the streets and footpaths of cannery row, we really appreciated the effort gone into retaining the original look of the sites. Really many interesting small corners, shops and restaurants to explore"], ["Reviewed September 4, 2017", 4.0, "Crowded but historic", "It is fun. A bit kitschy. But that is life. The walkways along the bay are the highlight. It is a must do. Bring your patience."], ["Reviewed September 3, 2017", 4.0, "Very busy, stimulating. beautiful.", "I enjoyed walking around Cannary Row. It was interesting, fun to see, beautiful views. Great restaurants."]]}}