{"Carmel River State Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Carmel River State Beach", "url": "/Attraction_Review-g32172-d128002-Reviews-Carmel_River_State_Beach-Carmel_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/12/ed/81/misty-view-of-the-coast.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2283"}, "address": {"@type": "PostalAddress", "streetAddress": "Carmelo St", "addressLocality": "Carmel", "addressRegion": "California", "postalCode": "93921", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Always beautiful beach", "I don't remember how many times I've been to this beach, but every single time I'm mesmerized by its beauty, the amazing blue of the water, and the surrounding mountains that just accentuate the picture. For the past 2 years we've come around the same time in February and it was a great time to visit. We were lucky with a good weather and we enjoyed the beach tremendously. I would definitely recommend at least visiting it twive.\nShow less"], ["Reviewed 1 week ago", 4.0, "A quiet walk", "Loved the Sandy beach at Carmel.. beautiful setting and easily accessible.. very pretty area. A must see on the Pacific coast highway drive"], ["Reviewed 2 weeks ago", 5.0, "Best beach ever", "Always beautiful. The weather was wonderful. Responsible dog owners. We got to see a pod of dolphins and seals at play. Nice long walk on the beach. Wonderful"], ["Reviewed 2 weeks ago", 4.0, "Nice", "We are a bit spoiled in Australia for beaches and so it's hard to find one that is exceptional. This wasn't but it was still very nice with a reasonable amount of sand and nice, clean water."], ["Reviewed 2 weeks ago", 5.0, "Great Day", "Beautiful beach. Easy access. Street parking only. Long, wide and sandy. Otters and seals easy to spot. Great view of Pebble Beach. Lots of people with dogs. I’ve never seen a better day than the day we spent there. 77 degrees and sunny! Just lovely. Check weather conditions before you go if from out of the area. It’s often overcast/foggy on this part of the CA coast.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Nice beach", "I love this place. One of the cleanest beaches I have ever been. The sand is so so white. I recommend to go there, even in winter, just to appreciate it!"], ["Reviewed 3 weeks ago", 5.0, "Beautiful beach & dolphins!", "Amazing spot to watch the sunset - we saw dolphins playing in the water too, which was utterly magical. The beach is lovely to walk on barefoot, which is something I rarely do, but enjoyed here. Lovely to watch the dogs having a great time and you can see all the way to Pebble Beach too. Very laidback vibe here - feels very safe and is a quick walk from the heart of downtown.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Lovely for Frolicking", "Well mostly. I hope the people who do not pick up after their pets do not spoil it for most. Almost stepped in doggypoopy.\nThat would not have been a happy experience. It’s such a beautiful beach to walk. We enjoyed the sunset as we walked south then climbed the stairs and walked back to our car up by the street. I love this place.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful", "If watching the sun sink into the ocean while dogs frolic on the beach is your thing, then you should probably come here for sunset. Parking is limited, come early."], ["Reviewed 3 weeks ago", 5.0, "Best morning jog ever", "There is no better beach in the entire world to job on that this one. The sand is so soft, the temperature is perfect and the dogs offer a welcome distraction to running ;) you can also jog up and down the many staircases for an extra cardio hit!\nShow less"], ["Reviewed January 24, 2018", 5.0, "Loved it!!!!", "Carmel is place with serene & picturesque views.Absolutely loved it. Beautiful beaches, lovely sunset,good vibes with great local food outlets. Will recommend staying in Carmel."], ["Reviewed January 23, 2018", 5.0, "Great beach / lagoon for bird watching & dog walking & sunset viewing!", "We have three older dogs so we aren't interested in going to the Carmel City Beach, where younger ones are frolicking around off leash. We head to the quieter more out of the way Carmel River Beach. A small parking lot provides easy and level access to the beach and to a lagoon area, great for kids, bird watching, and strolling with your canine friends. We went there several times during a weekend trip to Carmel.\nShow less"], ["Reviewed January 22, 2018", 5.0, "My dogs favorite place", "Best dog friendly beach. Relative low waves, lots of open sand for people and puppies. Bathroom and water fountain there. Bring your dog a water bowl to fill at the fountain after play. This was the first time our 6 month old lab was at the beach and he did drink a lot of water on the first day and had an upset stomach. Gave him some white rice and he was ready to go the next two days. He loved it.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Gorgeous", "I definitely recommend to walk the loop. There are some beautiful homes of all shapes and sizes and the beach is so beautiful and peaceful."], ["Reviewed January 19, 2018", 5.0, "Always a gem - any time of year", "In a perfect location to walk up and experience the Pacific Coast! Even in the winter a wonderful place to visit. Access is easy at the end of Ocean Ave - ample free public parking winter weekdays. Recommend grab a lunch to go from an Ocean Ave restaurant. Take a walk toward Pebble Beach during low tide, or just sit at the lookout. Dog friendly, too!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Popular spot for locals and tourists", "Beautiful beach, very clean. Lots of people were here with their dogs and children enjoying being out in nature."], ["Reviewed January 14, 2018", 5.0, "Sunny day in Carmel", "Came in town for the birthday weekend and went down to the Carmel beach to enjoyed the beautiful sunny weather. Husband and I admired the landscape and kids enjoyed the waves. Walked along the beach and had a good time while there."], ["Reviewed January 13, 2018", 4.0, "Beautiful place to visit", "Nice view and surrounded by beautiful houses close to the beach ! Very well Prepared for tourists and amazing sunset"], ["Reviewed January 12, 2018", 5.0, "Great beach with wonderful sunsets", "This is a lovely, though busy, beach. We went lat afternoon/evening and the parking was still difficult. We parked in town and walked down. As the sun went down the sunset was beautiful."], ["Reviewed January 10, 2018", 5.0, "Great beach", "Beautiful beach next to Carmel Beach. Great place for relaxing & picnics. Frequently see dolphins & whales in the distance."], ["Reviewed January 9, 2018", 5.0, "Excellent Beach for Families and Dogs!", "This beach is one of the best beaches I have ever been to. I took my dog here and she had a blast meeting other dogs. The surrounding houses and town itself make it a nice tourist attraction. I would definitely recommend others to visit this beach.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Excellent", "Great drive along coast with photo stops . Lovely rugged coast line and billionaire mansions to look at .."], ["Reviewed January 4, 2018", 5.0, "One of the best beach Sands in the world", "As a young kid growing up in the Bay Area this was one of my go to beaches next to Santa Cruz, even at that time the sand was some of the softest cleanest ever to be found in California the sand is so soft and fluffy it squeaks between your toes as you walk on it. There's not very much parking here so come early. It now seems to be a very large tourist attraction. If you never been to California or you want to check out a beautiful Beach for the first time this is a must. I must also say that Santa Cruz and more south of Pismo Beach the beaches have gone downhill.. they seem to have kept this one up and its free.. all the other California beaches now charge to park at tourist and non tourist areas.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Where Carmel California natives go to the beach", "My wife and her sister grew up in Carmel, and the beach of choice for recreation, particularly family recreation, is the beach at the mouth of the Carmel river. On the landward side is the beautiful salt marsh - the lagoon - sloping u[ to the Mission Ranch, and on the seaward side, across the barrier sandbar, the Pacific ocean, with Point Lobos dominating the horizon. The lagoon side offers sheltered, shallow-water wading for the youngsters; the ocean side is somewhat dangerous because of the undertow, but is a great vantage point for wave-watching and beach combing. Never crowded, an ideal spot. Occasionally the sand bar is breached (by bulldozers) to allow the river to flow into the sea and lower the level of the lagoon, a spectacular sight.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Dogs on the beach", "Wonderful walks with numerous dogs of all types and sizes. Kris brought his puppy Kepa an Italian Mastif along with our small mutt. Best free entertainment on the planet"], ["Reviewed January 1, 2018", 5.0, "Parking place!", "It is a nice place where you can park your auto (easiest convenient free place) and begin to explore a Carmel by the sea or walk along the beach."], ["Reviewed December 30, 2017", 5.0, "Wonderful beach", "Beautiful beach with lots of people walking around, playing with their dogs and children, watching surfers, and otherwise enjoying almost perfect weather in Carmel. Wish I lived here."], ["Reviewed December 28, 2017", 3.0, "Carmel by the Flea", "Let me start by saying that I have a dog and I always have had a dog but I think the city is quickly becoming \"Canine Carmel\".\n\nThis beach is over run with dogs. The city itself is dog crazy. There was not one restaurant or coffee house that I visited that didn't have a dog. The art galleries appear to be the exception.\nPeople even bring their dogs to a nice dinner out in town.\n\nThe view at this beach is beautiful and there is hardly a more scenic stretch of coastline. It is a 5 star beach without the cavalcade of canines. Just be aware that you will encounter dogs off the leash here.\nI wish they had dog hours and non dog hours.\n\n\"Who let the dogs out?\" You ask?\nCarmel, that's who.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Dog-HEAVEN", "If you have a four-legged family member, you simply can't go wrong with bringing them on your vacation to Carmel. There's no shortage of dog-friendly shops, restaurants, beach, and outdoor spaces. Beach is completely off-leash and there are tons of dogs for your furry friends to make friends.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Great beach, easy walk", "Watch sunset here on your way to dinner! Maybe go for a nice walk as well. Beautiful beach, close to town."], ["Reviewed December 27, 2017", 5.0, "Beautiful Place", "I have been to many places in the U.S. as well as in Europe, but Carmel is one of the most beautiful places i have ever been to. The beach, the Pacific Ocean, The hillsides, the town and its shops and galleries.......everything is just lovely."], ["Reviewed December 25, 2017", 5.0, "Superb weekend away", "Beautiful place to visit when traveling down South from San Fransisco. Quiet, relaxing place to chill, unwind, go for long walks and/ or to spend a romantic time. I enjoyed to variety of Italian restaurants of excellent quality and cosy coffee shops. Will for sure visit Camel again next year!\nShow less"], ["Reviewed December 23, 2017", 4.0, "beautiful place to watch the sunset", "can be a good walk to get down to the beach and an even tougher walk back up from the beach. area enjoyed by the locals. the dogs seemed to really enjoy the beach. can be breezing."], ["Reviewed December 22, 2017", 4.0, "Beautiful beach and not very crowded", "It's a beautiful beach, we went during low tide and had a lovely time in the sun. There were very few people around and we could find parking easily. It had a small parking lot so must be getting quite busy in summer. There were changing rooms/toilets as well. The river was cut off from the sea, maybe it connects only during high tide.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great for your dog!", "We took our Golden Retriever to the beach twice while we were in Carmel. He loved it, including meeting many other dogs and playing in the surf..."], ["Reviewed December 10, 2017", 4.0, "Open bay beach.", "Great sandy beach in a bay with waves and beautiful sunsets. This town as everyone seems to know is a dog lovers town. They are also on the beach. People behavier is fantastic. Polite, careful and attentive to others. It’s a very clean beach. It shoud be used as an example of how it is possible for all to enjoy the sea..\nShow less"], ["Reviewed December 9, 2017", 5.0, "Beautiful!!!", "Loved Carmel! What a beautiful city with plenty of activities to do as a couple or with family and friends."], ["Reviewed December 5, 2017", 5.0, "a truly lovely relaxing place", "The beach at Carmel is a must see when you're there. Weekend parking is tight, but during the week, there are lots of spots right by the beach. Beautiful white sand. Long walks in the sun are so enjoyable. Many residents bring their dogs there to run both on the sand and in the water. There is lots of space for everyone. Some people picnic there as there are lots of restaurants and snack places a couple blocks away.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Beautiful beach but remember that it is COOOOOOOOOOOOOOOOLLLD", "love walking there and very clean and calm but of course lots of people visiting. relaxing to have a picnic but the water is cold. too bad it is not as warm as the Mediterranean Sea."], ["Reviewed November 29, 2017", 5.0, "Wonderful", "Very clean beach, easy parking, great views of the ocean and fun for the kids to play in...Bring warm clothes"], ["Reviewed November 28, 2017", 5.0, "Beach in Town ...", "A world class beach at the foot of town, Carmel, this place just about has it all. Enjoy the beach activities or easily walk up in town. The fun is up to you."], ["Reviewed November 27, 2017", 5.0, "Beautiful Northern California Beach", "We stopped at this beautiful beach. So nice to have a beautiful beach like this so close to ‘downtown’ Carmel. Quintessential Northern California Beach."], ["Reviewed November 26, 2017", 5.0, "Always beautiful, always relaxing!", "Visited Carmel Beach on a Sunday morning recently...the experience is always the same. Natural beauty in every direction one turns. Never crowded. Lots of friendly dogs. Can't find a better spot for an early morning coffee :)"], ["Reviewed November 26, 2017", 5.0, "Swanky Downtown", "Carmel by the Sea\nWe stopped at Carmel by the Sea and were absolutely charmed by the downtown. It had many many art galleries and stores selling attractive items like Tiffany-design lamps made of colored sea-shells, embossed leather Cowboy boots and crystal Christmas ornaments! Of course, Carmel being an upscale artists’ enclave, it also had its share of the big brands along with the local Boutiques and restaurants. Our lunch at the Mediterranean restaurant was delicious!\nShow less"], ["Reviewed November 26, 2017", 5.0, "Great Beach", "Lovely long white sand beach. Very popular with tourists visiting. We only visited for a short while but were suitably impressed."], ["Reviewed November 25, 2017", 5.0, "Pebble Beach Golf Club visit", "Travelling from San Francisco to Los Angeles we decided to get off the highway and drive along the coast. Very scenic, beaches, smaller towns, and Carmel. Home to Clint Eastwood and Doris Day in the past."], ["Reviewed November 25, 2017", 5.0, "Wish my street ended here", "Walk down to the beach past really neat beach cottages and end at a stunning beach. Temperatures were perfect and the beach was clean for being so busy. Really nice."], ["Reviewed November 24, 2017", 5.0, "Kick off your shoes and dare yourself...", "Kick off your shoes and dare yourself to step into the cool water. It is a fantastic place alone, with a special someone, or family and friends. Take the time and cross this off your bucket list."], ["Reviewed November 24, 2017", 5.0, "Great weather and a great time", "Absolutely beautiful scenery. Pack some good shoes to walk down from the street and some others to swamp into for the beach. Parking is probably the only difficult part of the entire experience. Everything else was fantastic."], ["Reviewed November 19, 2017", 5.0, "Most Pet-Friendly Beach in the World", "We love Carmel Beach because our dogs can roam free. The coast line is beautiful. All the dogs and people get along. The sunsets are spectacular. It is warm during the day usually but foggy and cool in the mornings and evenings. Carmel Beach is a must see for tourists.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Best dogs friendly beach.", "Take the walk from 8th Ave to Carmel River beach for a world class ocean promenade. Or join the dogs running on the wide sands."], ["Reviewed November 17, 2017", 5.0, "Beautiful!", "Loved walking on the beach every morning. Sand is not sticky. People are out with their dogs and children and are very friendly."], ["Reviewed November 17, 2017", 5.0, "A must see", "Both beaches are beautiful. The steep walk to the ocean at the bottom of Ocean Avenue is fun, but walking back up in the soft sand is a real chore. I recommend driving down Scenic Rd, parking,and taking a set of steps to the beach. Or, you can just walk the promenade and sit on one of the benches and watch the surf and people.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Beautiful beach!", "Beautiful beach that is walking distance from anywhere in Carmel. Went one evening to watch the sunset. Lots of people there with their dogs- all friendly."], ["Reviewed November 16, 2017", 5.0, "Quiet and relaxing area", "Hardly any people around when there. Easy access for the majority. For you camera buffs be sure yours is handy. You, I am sure will end up with some beautiful pictures."], ["Reviewed November 15, 2017", 5.0, "Beautiful sunset", "Took many pictures The waves were awesome and sunsets were beautiful. The water is very cold in November!!"], ["Reviewed November 14, 2017", 5.0, "absolutely stunning", "The most beautiful beach I have seen. driftwood collectors paradise, if you are local enough Watch out for the Squirrels."], ["Reviewed November 11, 2017", 5.0, "Wonderful!", "We stopped by the Carmel City Beach while we were in town. It was wonderful. It's a beautiful location with the Pebble Beach golf course bordering it. It's a classic Northern California beach. People enjoying the beach and being outdoors, many families and people with dogs.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Worth the visit", "Go and take in the view. White sands. Looks great for windsurfing . Bit of an uphill walk to Carmel by the Sea but great to visit"], ["Reviewed November 9, 2017", 5.0, "Gorgeous", "My children were wine tasting and everyone told them to go see the sunset. Sadly, it was cloudy but the beach is still beautiful. My husband, son, daughter-in-law, daughter, son and myself are visiting from the East Coast."], ["Reviewed November 9, 2017", 5.0, "Some of the loveliest beaches anywhere.", "Carmel City Beach, or as locals often refer to it, Ocean Beach because it's at the bottom of Ocean Avenue, is a wonderful spot for picnics, dogs, and long walks.The Carmel River Beach is also particularly delightful from where you can watch amazing sea life not far off shore, including whales spouting and sometimes breaching. The sand is clean, the wildlife enchanting. When I lived at the other end of the path from the mouth of the river, I would walk it every day, visiting the cross at the top of the knoll that marked an historic time. It's revivifying that I often walked it twice a day, and sometimes even more. Delightfully peaceful and calming.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Best dog beach ever", "We didn’t take the dogs this time. We got our dog fix at the Cypress Inn and Carmel beach. Lovely white sand beach. Cliffs with lovely homes.\n\nSurprisingly I enjoy Carmel most in the fall, spring and winter. One would expect it to be a summer location. It’s foggy in summer. Try it off season.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Wonderful; a calm and serene place to enjoy quality time, food and beach", "Carmel-by-the-sea is a hidden gem as it cannot be compared with other beach villages; it has no billboards, no major commercial advertizing, no fast food chains - everything is based on enjoying quality in life! Given the fact that many of the houses have a unique style, which resembles old German/old English style, it very much felt as if we had landed in a Fairytale. As if Nottingham Forest is just around the corner.\n\nThe center village is really nice and offers quality shops, coffee bars and reataurants.\n\nLooking for a piece of heaven? Here it is!\nShow less"], ["Reviewed October 30, 2017", 5.0, "Well worth a visit", "This small town is well worth a visit. Very quaint and many unique little shops, great for those who enjoy the creative arts."], ["Reviewed October 26, 2017", 4.0, "Beautiful beach, well kept.", "Went down end of September just to wade and sit in the sand. If you have a cane (I do~) caution because dog-friendly also means jumpers! Wading was perfectly cold (as desired) and the waves were low that time of day. HC parking was fine, although I did notice jams and conflict further up the avenue, as parking was getting very tight. Restrooms were not too horrible - it's a beach! - and the smell was tolerable. More like permanent outhouse than a real restroom. Bring your own food/drink - food truck line was long and with a cane a hard wait.\nShow less"], ["Reviewed October 24, 2017", 4.0, "Warm October day", "Drove down to the beach at the bottom of Ocean Ave. Was able to find parking. Not to crowded at eleven in the morning. Water calm and clear."], ["Reviewed October 20, 2017", 5.0, "The best beach I have EVER been to - June 2013", "I could have spent all day here. It was beautiful, and peaceful. I would highly recommend going here."], ["Reviewed October 19, 2017", 5.0, "Beautiful vista", "We arrived to the dog friendly beach at 10 a.m. on a Thursday. Parking was available at that time. There were many people, local and tourists, walking on the beach and viewing from the lookout. We accessed the beach via the sandy walkway. There were dolphins playing and swimming just off shore. The view of the ocean is fantastic. The beach is beautifully kept.\nShow less"], ["Reviewed October 19, 2017", 4.0, "What's not to like", "Beautiful beach, great for walking, great for watching dolphins and sea lions and pelicans or just sitting, reading and people watching. Dogs are allowed which is a plus. The his would be a 5, if there were shells you could collect like Pismo Beach...."], ["Reviewed October 17, 2017", 5.0, "Beautiful beach", "An obvious favorite for locals and tourists for a reason. I wish we had more time to mince on the beach but had to leave after a few sunset pics."], ["Reviewed October 17, 2017", 5.0, "Most beautiful Place", "I love this charming little town. The beach is just stunning and the views are breathtaking. Wish the water was warmer :)"], ["Reviewed October 17, 2017", 5.0, "Scenic drive", "Any drive along the California coast is gorgeous. We particularly enjoyed this drive for the Carmel neighborhoods it brought us through, the unique homes we saw and of course the views!!"], ["Reviewed October 17, 2017", 5.0, "Wonderful beach with all the rolling and crashing waves sound effects", "We stayed in a borrowed house 3 blocks from this beach and could still hear the waves crashing. Spent several evenings on the beach and it was a wonderful sight to behold. Loads of dogs on the beach but folks were diligent about cleaning up after them. The bird life was abundant! There were fire kettles available as first come first serve so that was really nice.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Great walking beach", "Great views of Pebble Beach and the cypress trees are beautiful. Great place to spend the day and then watch sunset!"], ["Reviewed October 16, 2017", 5.0, "It’s a nice sunset", "White sand and a walking beach make this a people watching spot. If you’re there in the late afternoon stay for the sunset. You see pelicans cruising low on the water looking for dinner, people dog walking, kids frolicking, and then the setting sun. Check out the cute houses too.\nShow less"], ["Reviewed October 15, 2017", 5.0, "The cutest little town", "We made a special side trip on our way from San Francisco to LA and it was well worth it. The place is so cute and relaxing with a wonderful drive along the beach."], ["Reviewed October 14, 2017", 4.0, "Drive by", "After Monterey aquarium we swim by this town to pay respect to the ex mayor Mr. Clint Eastwood and the local shops and restaurants. We stop by the beach for a short stop. The parking was easy. We were able to park right in front of the beach with public toilets. The walk to the beach was a snap. The sunset was beautiful and the people are nice.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Unique", "One of a kind. Just start walking and take in the views. Easy access and walk until your tired and head back. Good spot for picnic and sometimes hot coffee. Pick your weather."], ["Reviewed October 12, 2017", 5.0, "Clean and Long Beach", "Unexpected surprise to find such a beautiful beach in this part of California. Clean. Great walk Saw otters, dolphins and amazing waves."], ["Reviewed October 12, 2017", 5.0, "one of California's truly beautiful beaches", "I had one full day with a rental car from SFA to visit Carmel-by-the-Sea, drive the 17 Mile Drive, drive up to Pescadero and get back to the aeroport. Accordingly all I had time for at Carmel City Beach was regret that I didn't have time to explore and at least get a dip in the Pacific . It is as beautiful to photograph as it is terrific as a spot for a swim\nShow less"], ["Reviewed October 11, 2017", 5.0, "Love it!", "It's the beach...how can you go wrong? Family friendly, pet friendly. Could use more parking but worth the effort."], ["Reviewed October 9, 2017", 4.0, "Great spot to watch sunset", "Great spot to watch the sunset or beach Combe. It gets windy here which can cause you to get sandblasted but worth it for the views. Lots of beautiful homes in this area and a popular spot so get there early to find parking"], ["Reviewed October 9, 2017", 4.0, "Want to see sunset?", "This is the place to go and the town of Carmel is a delight. Lots of good restaurants but they’re a walk from the beach where there seems to be no refreshment outlets."], ["Reviewed October 7, 2017", 4.0, "Just stopping by", "I've always heard about the view, but this quaint town is just perfect! So much to do in a very small area. Pretty and elderly friendly, food of all sorts and styles. The beaches area spectacular and the locals are awesome."], ["Reviewed October 6, 2017", 4.0, "Beautiful Coastline", "The beach is white sands and the sea a beautiful turquoise green. There were a number of other people enjoying the fantastic scenery, both on the sea and the land. Free parking at the beach on Ocean Avenue and Restrooms close to the beach too!"], ["Reviewed October 4, 2017", 4.0, "Beautiful", "We visited around mid-morning. The beach was not crowded. The views were spectacular. The local trees are gorgeous."], ["Reviewed October 3, 2017", 4.0, "Good sand and surf.", "Enjoyed our time on the beach. Good weather--clear skies, not crowded [did go twice mid-week. Good restroom facilities near the beach."], ["Reviewed October 3, 2017", 5.0, "Wonderful beach", "The beach along Carmel is beautiful and easily accessible by car or walking from town. There is an active community of beachgoers who create an atmosphere of enjoyment. During one visit, there was a sandcastle competition that was extraordinary."], ["Reviewed October 2, 2017", 5.0, "Most beautiful beach!", "This is the most beautiful beach ever! The water is so blue. We love to picnic here and just relax listening to the waves crashing. You can watch the divers get in out out of the rough water."], ["Reviewed October 2, 2017", 5.0, "Wonderful beach", "Called the \"white sands\" because the beach is really white sands. I live in Carmel and enjoy the beach throughout the year. I don't have a dog, but it is supposed to be one of the few public beaches in California that allow dogs on the beach unleashed.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Great beach", "It was years since my last trip to Carmel and it looks like the beach hasn't change in those few decades. It's beautiful, clean and always has a marvelous feel to it. Even if you're a tourist, you'll feel like a local because there are so many people walking dogs, throwing Frisbees, sketching the views, and just enjoying the setting. We were blessed with a perfect weather day; there was no fog, just a slight breeze, and perfect temperature. Early fall is a great time to visit.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Ah, the Pacific Ocean", "Beautiful sand beach. Sands were soft and warm. Wonderful to walk along and enjoy the wind, sand, sun, waves and views."], ["Reviewed September 28, 2017", 5.0, "Central Coast at it's finest", "The white sand is very fine and looks like sugar. It feels wonderful between your toes. The views along the beach are stunning and it is a good place to observe occasional whales and pods of dolphins swimming by."], ["Reviewed September 28, 2017", 5.0, "Beautiful beach", "One of the loveliest beaches I have ever seen. Houses on front are pretty. Sandy. Need to avoid May grey and June gloom if you want to sunbathe! We enjoyed walking in grey May weather."], ["Reviewed September 27, 2017", 4.0, "Toes in the sand.", "A great walk down Ocean Blvd to the beach, it's beautiful and peaceful. On the way back, walk back up to the neighborhood and see beautiful homes."], ["Reviewed September 26, 2017", 5.0, "Beautiful", "The beach and drive along is stunningly beautiful it takes your breath away. We always love driving the road along the beach it's like nothing else around. Lovely homes along the way too."], ["Reviewed September 25, 2017", 5.0, "An amazing part of california", "The beach is beautiful. Totally unspoilt white sand and an amazing views from any point. We also has an opportunity to see a pod of dolphins in the surf which was brilliant! And to the guys looking to propose on holiday... this is the place it worked for me!!!\nShow less"], ["Reviewed September 23, 2017", 5.0, "Unspoilt beach", "A lovely beach for a walk, and totally unspoilt. Soft white sand and huge breakers on the day we went (there's a notice saying it's too dangerous to swim or even wade in the sea here)\nIt's an easy walk from the shops/restaurants of Carmel.\nThere are public toilets by the car park, but be warned they don't smell very pleasant!\nShow less"], ["Reviewed September 22, 2017", 5.0, "Beautiful! One of the nicest beaches....", "We walked from our hotel at San Carlos and 5th which took about 15 minutes. The tree lined walk is lovely and we enjoyed the weather too! The Carmel Beach was just beautiful, pristine, clean, white sand, crystal clear water and one of the nicest beaches I've ever been to. The low humidity is an extra delight!! Our route to the beach was a cinch being all downhill which means uphill upon return. It wasn't a bad walk but be aware just in case someone has difficulty walking. I don't know if there is another route to the beach which has less of a hill but you can drive to the beach. We were there on a Sunday (after Labor Day) and there was plenty of available parking. By the way, for all of the doggie lovers out there, the beach as well as the City of Carmel is very dog friendly which was so nice to see.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Seemed Less Populated", "Walked the Scenic Road Walkway to here. The beach is very nice and unlike Carmel Bay it was not crowded (maybe just got lucky?) and there was no steep hill to walk up or down to access the beach. There were restrooms."], ["Reviewed September 20, 2017", 5.0, "Beautiful Stunning Scenery", "We visited Carmel, parked on the Main Street and explored the town on foot. Walking down to the beach is well worth the effort, the views are stunning. The huge slope of sand going down to the beach makes you feel like a kid again... also there are some old massive weather worn trees on the beach, stunning and impressive, a sight to see....\n\nShow less"], ["Reviewed September 14, 2017", 5.0, "Great beach", "We had a great time on a beach. The parking was easier on a weekday than on a weekend but there is plenty of street parking around. We built sandcastles, flown a kite and jumped in the waves. There are restrooms at the main parking area.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Relax", "Mom came with us. We parked on a local street and walked over to the beach. Lovely white sand. Nearby attractions and cities. Scenic drives"], ["Reviewed September 11, 2017", 5.0, "The perfect beach!", "Great walking and relaxing on this beach. The waves are good and we even saw some dolphins. The sand is soft to walk on and not too hot. Lots of people but lots of space. Especially nice early in the day."], ["Reviewed September 10, 2017", 3.0, "Nice but cold", "Very nice view but cold. Once you get to beach - it's still a walk to the actual water. Very rough. And a bit of a hike back up hill. There is bathhouse. It's a hike back up to town But they do have Uber!!"], ["Reviewed September 9, 2017", 5.0, "Beautiful Light", "we went near sunset and the light was just so magnificent. When people talk about Carmel, this is where it's at!"], ["Reviewed September 8, 2017", 5.0, "Great walk on the Beach", "We walked up and down the beach, enjoyed the view of Pebble Beach, the beautiful Ocean & Beach, it's a very nice walk on the Beach."], ["Reviewed September 6, 2017", 5.0, "Stunning Carmel", "Went to Carmel when my Son got Married there. Got there a day earlier then everyone else . Visited the many boutiques , delicious restaurants , and their amazing beach . The people there were very friendly . Would highly recommend Carmel for you next trip . Such a pleasant lovely place.\nShow less"], ["Reviewed September 4, 2017", 5.0, "BEAUTIFUL", "What a beautiful beach. White sand , clean and pleasant people about with their families. Take a picnic and soak it all in. Remember though to pack your trash bags to ensure to keep this gem sparkling. It is a treasure here!!!"], ["Reviewed September 3, 2017", 4.0, "Beautiful West Coast Beach", "This is a beautiful beach within walking distance of downtown Carmel shops, restaurants, and galleries."], ["Reviewed September 2, 2017", 5.0, "Wonderful, albeit a little chilly in May!", "We drove to here from San Francisco and even the drive down was so scenic! We had a wonderful time walking through the town down to the beach and had lunch at an amazing restaurant. It can get a little windy in May so make sure to layer-up!\nShow less"], ["Reviewed September 1, 2017", 5.0, "Dreamy", "I went for a morning walk before the kids were up and I dragged them there the second they were up. It was well worth the nagging as we were all giddy with its beauty within moments. The sun glinting off the cliffs of Pebble Beach, the dogs frolicking in the waves, the mystical trees overhanging the bluffs...pure magic!!\nShow less"], ["Reviewed August 31, 2017", 5.0, "A different kind of beach", "The crashing waves, the expanse of beach, and the distant view of golf course made this beach visit exhilarating. Long walks are possible, diverse personalities visiting, and even unique seaweed gave us Michiganders a real treat. Though not recommended for swimming, one of my teens met up with a younger kid who was braving the waves with his boogie board and they had an amazing time. My son did get banged up by the waves a bit, which was a good lesson for him to respect the west coast. Luckily he was ok. I wish I could have spent more time there!!\nShow less"], ["Reviewed August 29, 2017", 5.0, "Beautiful", "Carmel City Beach is gorgeous! The surf is good, scenery spectacular, sand white and soft and it is within walking distance of town and shops/restaurants."], ["Reviewed August 28, 2017", 5.0, "Beautiful place", "The beach is great and you can walk along way along. The shops in Carmel are quirky and really interesting to wander around even if you don't want to buy anything. I cannot recommend this place enough (although I would say take a sweater - it's pretty chilly!)\nShow less"], ["Reviewed August 27, 2017", 5.0, "Awesome Beach", "Huge waves and fine sand. This beach was not extremely busy and had lots to see. Watched an otter as well as surfers. Restrooms near the parking. Loved the vegetation with many photo opportunities."], ["Reviewed August 27, 2017", 4.0, "Peaceful beach", "This is a very peaceful beach with white sand. A pleasant place for an evening stroll. If you are looking for beaches with dramatic scenery, you will have to go to the beaches in or around Big Sur."], ["Reviewed August 24, 2017", 4.0, "Quiet Retreat", "Quieter compared to Carmel's main beach. Good for a picnic and meditation. Not as good for swimming. Nice scenic views too."], ["Reviewed August 24, 2017", 5.0, "Beautiful!!!", "This is a gorgeous beach along the coast!!!! Big sandy beach with restrooms. Come for the day and pack a picnic and enjoy this beach! Not crowded like the one at the end of Ocean Ave in Carmel By The Sea."], ["Reviewed August 23, 2017", 5.0, "“Cool Weather”", "If you are not from west coast, you may not realize how cool the summers can be along the coast, or that the waters of the Pacific in this area are cold. Carmel has a beautiful beach, and the day we were there was our lucky day because I noticed something floating in the water far away. With the telephoto lens on my camera I could tell it was a sea otter! (see photo).\nShow less"], ["Reviewed August 21, 2017", 5.0, "Family trip", "Good location Nice pictures take from this point Must see to enjoy Take nice walk by the beach And amazing views People very friendly and helpful My kids take amazing pictures of the bay And enjoy the walk"], ["Reviewed August 16, 2017", 5.0, "Beautiful views and soft sands", "I came here with my family early on a weekend. Parking was not a problem because we arrived so early and there was a heavy mist that hadn't cleared up yet. We played in the sand and dipped our toes in the waves. We even saw some dolphins swimming a little bit off shore. Cute dogs abounded but owners were very considerate in making sure that the dogs didn't spook our kids. Overall, a great experience even if the water is too cold for a swim.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Beautiful beach", "If you're visiting definitely do not miss the opportunity to walk down along the beach. There are frequently dolphins in the morning and at night you can have a fire and roast marshmallows in certain spots on the beach. This is also one of the only beaches where dogs can run off leash. Make sure they are well-trained and come when you call, though.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Doggie Central", "There must have been more dogs on this beach than people the morning we were walking along it (all with owners I should add). Nice beach but sadly the mist had descended so visibility was poor. Still, a nice walk on the beach and along the cliffs back to the town centre.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Cruising the west, sommer vacation", "Cruising the west, sommer vacation. After having a not so positive experience with San Francisco we drove south and stopped in Carmel. We went to the beach and found it very nice, met some locals and go recommendations for lunch. Carmel is on the revisiting list.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Beautiful", "Spectacular views. Water cold this time of year, but the beach walk with the water on one side and cool homes on the other is not to be missed."], ["Reviewed August 14, 2017", 5.0, "Beautiful", "This beach is so nice. Beautiful all around. The white sand is so soft under the feet. The water is coooold of course (it is Carmel!) I love it here walking along the shore."], ["Reviewed August 14, 2017", 5.0, "Great white beach!", "One of my favorite beaches in the area! We loved the wide beach and the white sands. Parking is a little scarce though and can get quite frustrating."], ["Reviewed August 13, 2017", 5.0, "The Perfect Furry Friend Inn!!", "The Carmel Garden Inn is a delightful Inn with incredibly warm, friendly and attentive service to all that enter including furry family! Everyone involved at the Inn is focused on going over and above to assure that you have a wonderful visit to charming Carmel. From the endless supply of dog treats to the homemade breakfasts and wine hour specialties, the staff is one of a kind in their commitment to service. There are no store bought muffins here! The patio rooms have large comfortable patios with beautiful plants and a table and chairs. They are perfect for relaxing with your four legged friends. It is a joy traveling to an Inn where they not just allow pets but welcome them with open arms and hearts! You will also be happy to know that they can provide towels, blankets and a hose for those necessary pup cleanups after a day at the fun-filled dog beach!! Thank you to all of our new friends at the Carmel Garden Inn for making our vacation so memorable! We will cherish our memories of our time spent with all of you!!\nShow less"], ["Reviewed August 13, 2017", 4.0, "If only it was warm to swim", "Coming from Australia we presumed ALL California would be warm if not hot in July being summer. Well no, Monterey and Carmel areasare cool and although they warm up a tad during the day and you may take your hoodie off...definiately not swimming weather. This beautiful beach with many people but no-one game to swim...water was freezing.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Beautiful Cove", "Beautiful, quaint, dog friendly, and people friendly. We began and ended each day of our trip with a short walk from Normandy Inn to the beach. Even at it's busiest time it was wide open for walks, photography or just reading a book. We loved it!! There is parking right there at the beach if you are just driving through, just steps away from the sand. The survey asks if there is a coffee shop or restaurant here, but the reality is all of those things are right up from the beach as this is part of Carmel, just not on the actual beach, so I answered accordingly.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Carmel Beach", "Pleasant surprise that we have this gorgeous beach in Northern California. Skipping Monterey next time and we would stay in Carmel instead. Beautiful homes around. We will be back!"], ["Reviewed August 8, 2017", 5.0, "Love this beach for our dogs!", "Clean beach, respectful and friendly pet owners. So much better than our beaches at home! Nice to meet well-behaved dogs and people who respect beaches and other people."], ["Reviewed August 8, 2017", 2.0, "skip it", "This is a dog friendly/off leash beach and there are a lot of dogs there that shouldn't be off leash. Too many dog attacks here. I guess if you don't have a dog it's ok but be aware that dogs are running around you constantly and kicking up sand.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Our favorite beach", "Of all the beaches in the world, very few hold as much sentiment or beauty for us as Carmel Beach. We return every few years to this pristine spot to overlook the majestic scenery of Carmel Bay. Whales, sea otters, and the smell of beach fires fill our senses with wonderment and serenity.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Beauty All Around", "Take a towel or blanket, cup of coffee, or a cocktail in a plastic cup and just sit and take it all in. This is a great spot to watch the ocean, take a walk, sit and read, or kids can play. Beautiful!"], ["Reviewed August 6, 2017", 5.0, "Beautiful", "A nice walk along a scenic road. The waterfront is peaceful and relaxing. If you can take the time to visit the beach."], ["Reviewed August 3, 2017", 3.0, "Great that it is available", "Great place to enjoy the waterfront in the Carmel area. So nice that it is available. Parking is very limited and the water is kind of brackish."], ["Reviewed August 3, 2017", 5.0, "A hidden gem", "No, it doesn't have the white sand of neighboring Carmel Beach but it is lovely and quiet. Keep walking along Scenic Road and you will end up here. We enjoy the quiet beauty of this gem of a beach."], ["Reviewed August 1, 2017", 5.0, "wonderful english style resort", "Carmel is posh and expensive from a shops and restaurants point of view but the beach is fantastic and parking free."], ["Reviewed July 29, 2017", 5.0, "Lovely family beach or romantic getaway", "Friendly beach, at night families have campfires all down the beach, Such a beautiful spot! Its what it means to be a californian living the outdoor life in elegance!"], ["Reviewed July 29, 2017", 5.0, "Beautiful Sandy Beach", "We were staying in Monterey - which even in August always had dull weather in the mornings, so we would often drive down to Carmel, which seemed to brighten up earlier and quicker. We would park near the magnificent beach front properties and then walk down the wooden steps to the sandy beach.\nThere are beautiful Cypress trees lining the road above the beach as can be seen in the photo.\nIts a peaceful place.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Wonderful Beach", "Had a great lunch and walk on Carmel City Beach. Short walk from Carriage House Inn. Little cool so dress appropriately. Just a great place to spend time relaxing."], ["Reviewed July 27, 2017", 5.0, "Expansive Beach", "Carmel Beach is a huge half moon shape beach with plenty of room for a lot of people. The proximity to downtown Carmel is perfect and many people take advantage of the location. We walked the entire length of white sand, seeing dolphins, seabirds, picnickers, families, couples, and beautiful views. There is limited parking for a large crowd, but people seemed to adapt to that somehow.\nShow less"], ["Reviewed July 26, 2017", 5.0, "White soft sandy beach, just stunning", "This beach at the bottom of Carmel, is just something special, white sands, driftwood trees blue ocean.... beach houses further along to die for.... a must see, walk the whole length and just soak it up! Wonderful"], ["Reviewed July 25, 2017", 4.0, "Nice beach", "Soft sand and plenty of shoreline. Did not get crowded during the weekend that we were there. Parking was limited, but I didn't have trouble finding parking in front. The water is cold, and it was sunny but chilly. Not sure if that's typical weather for this beach. Too cold to dip in the ocean on this July weekend, which was a surprise. Nice looking unique trees.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Excellent walks along the beach without having to struggle of walking on the sand", "Excellent walks along the beach without having to struggle of walking on the sand. Worth continuing on to the next beach south. Afterwords walk through the back streets and delight at the charm as you wonder if you can find your way back to your car or hotel. Yes a map of the town will help but there is charm in getting lost.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Love it", "We love walking along the city Beach and the River Beach. We were so lucky to see many whales on two different days! It is quite beautiful in both areas."], ["Reviewed July 21, 2017", 5.0, "My Birthday Road Trip July 2017", "SOOOOO RELAXING AND BEAUTIFUL. My daughter & I had a great time strolling and sight-seeing. this place is picture perfect :) I only wished I had bought some chairs and/or blankets would have been great to stay longer but we enjoyed our visit to this beach\nShow less"], ["Reviewed July 20, 2017", 5.0, "Love this beach so much!!!", "Perfection! Soft white sand, blue, blue water, gorgeous Cypress trees in the distance. Magic! We spent a lovely afternoon frolicing in the sand and basking in the sun. One of the best beaches North of San Diego."], ["Reviewed July 19, 2017", 4.0, "Another fabulous spot in Carmel", "After we walked along the walkway, we headed over to the beach area and were floored as to how vast the beach is. There were a few people playing catch and some kids building castles but that was about it. There were many birds out and that was kind of cool. There also weren’t many people because we got there in the later afternoon and some needed light jackets because of how windy and chilly it was becoming. Overall, it was a nice beach. Not super picturesque but still a nice beach to lounge and BBQ.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Lots of dogs, white sand and sun", "We had a wonderful walk on the beach with crashing waves and lots of dog buddies to visit with. The sun was warm and the sand was white. Parking near the beach was not the easiest to find on a sunny Sunday mid day!"], ["Reviewed July 19, 2017", 5.0, "Not crowded", "Our little kids loved playing in the sand. While the Pacific shore is very windy, this alcove of a beach is tolerable. No swimming. Bathrooms make it even better for young families. Views are terrific!!"], ["Reviewed July 18, 2017", 5.0, "Beautiful way to end the day!", "We did the Pacific Coast Highway down to the 17-mile drive and ended our trip in Carmel. This beautiful, soft white sand beach is at the end of Ocean Ave. There is a steeper slope to get down to the beach. There is street parking and possibly a parking lot (we just parked on the street). There are restrooms with flushing toilets and a sink wig hand drier. I didn't find a place to wash feet after playing in the water/sand. I would imagine sunsets would be beautiful there!\nShow less"], ["Reviewed July 18, 2017", 5.0, "Amazing!!!", "I just came back .Beautiful Beach, Peaceful, Highly Recommend to see it. I recommend to see the sunset, it's incredible. As well I recommend to drive the 17-Mile Drive in Scenic Pebble Beach which is extremely close from Carmel."], ["Reviewed July 16, 2017", 5.0, "Beautiful Day for a Walk", "Save a day and walk the entire beach and then walk Scenic Drive. You won't regret it. We happened upon a Sunday afternoon beach party of over 100 dachshund doggies."], ["Reviewed July 16, 2017", 5.0, "Must see", "Wide beach, soft sand, clean despite the dogs. Periodic entrances and public rest rooms but places to buy food or drink half mile away so come stocked up. Good for relaxing and walking but not really swimming. Cold and rough."], ["Reviewed July 16, 2017", 5.0, "STUNNING...", "This is a truly beautiful white sand beach with all the amenities a greAt beach should have. It's fantastic for swimming, walking, sun bathing and just enjoying a true California great beach.\n\nIt complements the beautiful town of Carmel so well, there like bread & butter.\n\nHonestly we did the entire west coast from Seattle to San Diego over 28 days and this beach was one of my favourites if not the favourite it's gorgeous.\n\nHave a blast .....\nShow less"], ["Reviewed July 11, 2017", 5.0, "Oh my gosh! What a delightful beach!", "We did the 17-mile drive and stopped in at Carmel. Very nice restaurants/shops at the top of the hill on Ocean Ave and then this incredibly beautiful beach at the bottom!\nEasy parking, easy walk to beach--might be a little steep for some--seriously beautiful as we were there in the early evening after dinner up the hill.\nIt was so beautiful that we drove down again from Monterey, where we were staying, the next morning to walk on the beach again before the drive to Yosemite.\nWe also ate breakfast at Lafayette's, not exactly near the beach but worth the drive, and it was soooo good. Plus, they have sandwiches to go, which we put in our cooler for lunch to eat along the drive to Yosemite.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Easy walk from town.", "Cool beach. Pebble Beach golf course at one end. Watch the golfers on top of the rocky bluff. Rocks, sand, good place to hang out and people watch."], ["Reviewed July 9, 2017", 4.0, "Delightful beach", "Carmel is a charming place. This was my first stop outside San Francisco and it is a delight. Beautiful beach of pure white sand and everywhere in walking distance."], ["Reviewed July 8, 2017", 5.0, "Gorgeous!", "We ran a 5K there the first day of our vacation (I know...who pays to run on vacation?!) But, the views were so amazing that we didn't care about our time and had to stop to take a picture! This is a great place to walk and enjoy the scenery.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Great all year round!", "This is easily accessed and there is plenty of free parking, either on the roadside by the beach or on streets back from the ocean. We found a super sheltered spot which was peaceful until early afternoon when all the dog walkers and some families came out to play on a sunny Sunday!\nShow less"], ["Reviewed July 6, 2017", 5.0, "A MUST SEE!", "Lovely place! Carmel by the Sea is one of the nicest places in the USA. I would recommend to all travelers to visit here. Nice area, very clean, friendly people, lots to see and do."], ["Reviewed July 5, 2017", 5.0, "morning walks", "the place we were staying was only a block away, great for a morning walk, lots of dogs out for a run. nice beach"], ["Reviewed July 5, 2017", 5.0, "Unbelievable!", "Carmel City Beach is beautiful. The beach is a long hike from ocean avenue. The walk from the beach is a steep incline and would not be accessible to those with health issues or declined gross motor abilities.\n\nHowever, the view is priceless. The beach is wide and the waves crash with power and majesty. On a clear day, you can see houses on the side of the hill. Pebble beach golf course can also be viewed from the beach.\n\nThe crowd of people vary on the beach (e.g., dog owners, families picnicking, couples, runners, meditators, etc.)\n\nThis beach is a must see!\nShow less"], ["Reviewed July 3, 2017", 5.0, "Great beach for the dogs!", "We have been here many times. We enjoy it more than Santa Cruz. It's pretty crowded and parking can be a challenge."], ["Reviewed July 3, 2017", 5.0, "Very accessable and pretty", "We loved it here! Parking was a challenge, though we were able to get a good spot. Easy to walk to, clean bathrooms, and great ambiance! We even saw some cool old cars driving by!"], ["Reviewed June 28, 2017", 5.0, "Peaceful Beach", "We arrived for the sunset and it was so quiet and peaceful. I found this beach by accident and really love its low-key nature."], ["Reviewed June 27, 2017", 5.0, "Marvelous Experience", "The outing at the beach was really good. Enjoyed the surf there though being a Sunday it was crowded and getting parking space was a hassle. Also felt that the beach front could have been more clean as there was stench from rotting kelp, seaweeds."], ["Reviewed June 27, 2017", 5.0, "Okay, so you can't swim in it...but here's an UPSIDE to voyeurism!", "What a dramatic coastline! Beauty from every angle.... Appreciate the breathtaking, rugged majesty of the landscape! Magnificence in its essence."], ["Reviewed June 26, 2017", 4.0, "Good clean place to hit the beach", "Carmel-by-the-sea beach is a beautifully well kept beach. The sprawling beach can host lot of visitors and their pets. It's nice to see pets on the beach and their owners taking care of their pet's droppings.\n\nThe negative though is parking. There isn't much parking and people tend to be a bit rude when trying to jockey for parking or waiting in a single lane round about.\nShow less"], ["Reviewed June 25, 2017", 4.0, "Beatiful beach with beautiful sunsets", "The beach is very beautiful with awesome views. Apparently walkable from town but I would recommend driving which most people do. As such, parking can be tricky especially during sunset as it tends to be quite crowded. Dog friendly and lots of people walk their dogs.\nShow less"], ["Reviewed June 25, 2017", 4.0, "A week at the westcoast", "This beach is particular good if you have a dog with you. There are a lot of dogs on the beach having fun. The beach is very wide and there is plenty of room to have some privacy."], ["Reviewed June 23, 2017", 4.0, "Beautiful", "The sand was so unique. Made up of tiny rocks vs the fine grain sand that usually makes a beach. It was very beautiful and fun to sit and watch the waves.\nI was a bit sad when I found out that the water was very rough and you are advised not to play in it at all.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Beautiful beach and town", "Carmel was every bit as good as i had been lead to believe. Nice town with plenty of boutique shops to browse around. The beach is fantastic, good for a wander along on a summers evening thoroughly enjoyed this place."], ["Reviewed June 21, 2017", 3.0, "Good if looking for a dog beach", "I wasn't looking for a dog beach so they were more of a nuisance, but this beach was conveniently located near the shops in Carmel. I was a little disappointed because I was looking for a more picturesque beach. Wish we had tried a different one.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Best Beach in the State of California", "This is an incredible stretch of beach on the California coast line....and it's one of the only beaches I know of where your dogs can run off leash....people are friendly.....the beach is clean...one of the most beautiful pieces of beach on earth!!! I live here and visit this beach often for the last 25 years...\nShow less"], ["Reviewed June 20, 2017", 5.0, "Fabulous Sunsets", "This is a quiet beach where dogs are allowed as well as fires in specified containers. Lots of driftwood makes this doable. Beautiful sand and big waves add to the experience. You'll probably see some surfers too. Enjoy!"], ["Reviewed June 14, 2017", 5.0, "Perfect weather and a perfect view", "Nice to chill in this summer weather,just bring a blanket,pillows & snacks and watch beautiful people enjoying the beach."], ["Reviewed June 5, 2017", 5.0, "Wow...Sun..Surf...We must be in Carmel !!", "Great sandy dunes leads you down to a dynamic waterfront...beaches as far as the eye can see !!! all the way to the fabled \" Pebble Beach\""], ["Reviewed June 1, 2017", 5.0, "Do you love things that are gorgeous?", "If you do, Carmel beach is for you. the water is clear and an unbelievable aqua blue. The whole town including the beach is very dog friendly. the sand is powdery and white. Even just walking along and looking at the houses on the beach is the best day ever.\nNote, there are a lot of stairs or a fairly steep sandy hill to get to and from the beach.\nShow less"], ["Reviewed June 1, 2017", 5.0, "My favorite part of Carmel !", "White sandy beach with turquoise colored water! I love watching all the dogs running free on the beach. Best part of Carmel is that dogs are allowed everywhere."], ["Reviewed May 31, 2017", 1.0, "Nowhere to park - go to Monterey Bay instead!", "We drove around for over a half hour and couldn't find a parking space. We finally left and went to Monterey Bay, which we LOVED!"], ["Reviewed May 31, 2017", 5.0, "California Trip", "Just the most beautiful and najestic and beach. We walked the shore and picked up shells and stones, the view was breathtaking. The sand so clean and crisp, your feet squeak in the sand. There was V a man making a Carmel -by-the-sea sand castle fir hours and it was so much fun. There are gorgeous homes, bathroms, picnic area, viewing area and easy access. Loved this beach\nShow less"], ["Reviewed May 29, 2017", 5.0, "Beautiful beach", "Lots of space, gorgeous views, clean water, and great combination of cultures........ We heard at least ten different languages while we strolled the beach!"], ["Reviewed May 28, 2017", 4.0, "Clean Beach", "Great white sand beach. Really nice place to spend some time walking along the beach and taking in the great views. Wish I could have spent more time there. There is some public parking, and the beach seems accessible even if mobility is an issue."], ["Reviewed May 26, 2017", 5.0, "Fun and Clean - Especially for Dog Lovers!", "The beach is long and incredibly clean. Very dog friendly - fun to just sit in the sand and watch incredible variety of dogs walking by!"], ["Reviewed May 25, 2017", 5.0, "A Human's and Dog's Paradise", "You can walk this beach forever. Beautiful fine sands, waves pounding your feet, flat sands rise to hills of soft sand for the children to play in. We walked the beach end to end and enjoyed every minute. My only woe was that I didn't have my dog with me. He would have loved it even more; all the different kinds of doggie friends free to play together. I loved watching them caper around.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Savor the Memories", "Even though a blustery chilly day....a walk on this beach is among Californias finest...certainly one of norcals top. Walk the cliffs of pebble beach golf links....the tide pools of point lobos. .Mother Nature at her creative best."], ["Reviewed May 22, 2017", 3.0, "Too crowded", "We were here briefly because there were no parking. The shops are pretty interesting and beautiful but to find a good place to park waa not easy. The road and streets are annoying yo turn or can be confusing so slow down. I like the beach but it's nothing new compare to other beaches. There's a part of the beach that is pet friendly!\nShow less"], ["Reviewed May 20, 2017", 5.0, "Beach", "One of my favorite beaches to visit! With kids or without. Super nice clean and easy to get to parking is all along the beach its kind of limited you can say that. We always have such a great time. We always stay till the sun sets because it's just so beautiful! Dogs are welcomed as well\nShow less"], ["Reviewed May 17, 2017", 5.0, "Breathtaking!", "These 2 beaches are a walk apart. Both are white cresant and about 1 mile long each. Carmel city beach has great views of Pebble Beach Golf course on the bluff above."], ["Reviewed May 12, 2017", 5.0, "Quiet beach", "Wonderful sounds of huge waves breaking on the shore and water cold enough while paddling to stop your circulation but worth it. Dog friendly. Great place to surf with a dry suit."], ["Reviewed May 6, 2017", 5.0, "Gorgeous views and plenty of sand", "Parking is scarce, but once you're there and unload your picnic stuff, you're sure to be rewarded. The ocean view, sand and atmosphere cannot be compared to anything else. This is right off of Ocean ave, and the sand starts as soon as you're off the parking lot. You can stay at the top of the hill or make your way down to the waves. Either way, sun, sand and waves galore. Bring your drinks, food, sunblock, shades and hat. You're in for a great day!!\nShow less"], ["Reviewed May 6, 2017", 5.0, "Really a hidden gem!", "Driving down to this spot you wouldn't think you'll get to a large beach spot like we found. The road leading to it is narrow, residential and hilly. If I wasn't looking at my GPS map, I would have never guessed that it is a beach access. And what a wonderful beach it was. On the left side, the river comes down to join the ocean and it widens a bit as it approaches, making for a nice wading spot; even for kayaking and swimming in the shallow fresh water. The ocean waves and the sand are the best at this end of the bay. The other end of the land - I'm guessing Big Sir- is almost opposite so, the view is fabulous. The sand and waves in the for-front and the green mountains as backdrop! I cannot wait to return; now that I know about this.\nThey don't recommend swimming, and fire is not allowed, so picnic is the best option and of course hiking the beach is the highlight of this trip!\nShow less"], ["Reviewed May 6, 2017", 4.0, "huge sand area", "This is a beach area that underwent some improvements in a recent years. Parking remains small, but waterline moved farther away. You will need to walk on the sand may be 1/4 mile (or less) before reaching water."], ["Reviewed May 4, 2017", 5.0, "You just want to stand there and look.", "We walked down the hill from our hotel, and were instantly mesmerized. What an incredible view! It was close to sunset, and there were many people in the area, most of them snapping photos. The parking lot and side streets were packed with cars, so we were so happy that we had walked. (Although, going back uphill was not that easy.)\n\nYou can either go on the beach, or there is a wooden walkway on the right side. This leads to a small platform, with some seating. Surprisingly, not that many people were on the platform, so we were not cramped there, and had a gorgeous breathtaking view of the sun sinking into the ocean.\n\nIt's worth going out of your way to see such beauty.\nShow less"], ["Reviewed May 4, 2017", 4.0, "A great beach! White sands, fab views", "Parking is the key issue here, though once you're parked its such a great beach. Has restrooms too. Kids will love it! And the town is close by though really expensive!"], ["Reviewed May 3, 2017", 5.0, "Walk on the beach", "This is a very nice beach. White sand not to crowded. We took our two small dogs as it is doggie friendly. You can see Pebble Beach Golf Course from the beach. Parking was free. It is an uphill walk back so make sure you're ok with that.\nShow less"]]}}