{"Castello di Amorosa": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Castello di Amorosa", "url": "/Attraction_Review-g32143-d645572-Reviews-Castello_di_Amorosa-Calistoga_Napa_Valley_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/66/8a/63/the-courtyard-at-castello.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "4411"}, "address": {"@type": "PostalAddress", "streetAddress": "4045 Saint Helena Hwy", "addressLocality": "Calistoga", "addressRegion": "Napa Valley", "postalCode": "94515-9609", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "A very pleasant surprise!", "I was SUCH a Negative Nancy about going to this place. Thought it was going to be super generic and too touristy with mediocre wine.\nWell, what a suprise when I had an awesome time!!\nOur sommelier, Hassan, was fantastic. Super knowledgeable, lovable, funny. We had a great time with him. The property is beautiful, felt like I was in an episode of GoT.\nThe wine was delicious! We had just come from another (castle) place where we completely felt underwhelmed - not great wine, could have totally gone without. This place was awesome. Even the gift store items are super cool.\nMy only stink is that it's a VERY busy place with a lot of tourists. But we ended up not caring about that at all.\nPlus they are dog friendly and that was a big bonus. We became members ;)\nShow less"], ["Reviewed 6 days ago", 4.0, "More than just tasting wine", "Unless you are avid wine lover, most of the time you are looking the experience rather than just the wines. And here you go at Castello. The wines are exclusive and rather expensive, but it is good. For the price I supposed you pay for the nice castle-filled photo shots as well. :) Worth going for the tour but pls book. The service is normal, can be better if have more staff dedicated to serve you and explain more abt their wines and history.\nShow less"], ["Reviewed 1 week ago", 5.0, "Gorgeous Winery, Picturesque Setting", "So many nooks and crannies to explore, every corner a gorgeous view or photo-worthy spot. The grounds were beautiful and fun to roam. Such a romantic setting - a South Asian couple was getting their engagement photos done and their colorful, elegant clothes looked stunning against the regal backdrop - what a great idea! The staff were friendly, but skilled at managing the crowd and flow of visitors. I highly recommend doing a tasting - the staff were friendly, charming, and knowledgeable. I bought a few wines and souvenirs, which is not typically my style, but they were all worth it. I felt so relaxed and happy here! I'd love to go back.\nShow less"], ["Reviewed 1 week ago", 2.0, "Avoid", "My wife and I love Italy. The building wasn’t as bad as I feared, and the employees were lovely. But place was totally slammed (crowded) on a Sunday. Crowds were impenetrable at the tasting room, so our $30 tickets went unused. They need to somehow limit attendance or vastly expand facilities or sell “castle only” tickets. Avoid!\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautiful and a Site to See!", "Okay; this is not your typical winery. The owner has spared no expense in creating this castle. We didn't do the tour, but walked around and enjoyed some lovely views before heading down to the wine room. A super friendly and helpful young woman assisted us in making our tasting selections. We felt quite attended to and indulged, certainly not rushed. We found a great wine that we bought several bottles of for ourselves and for gifts. This is not your usual winery but definitely a place to visit while in Napa Valley.\nShow less"], ["Reviewed 1 week ago", 5.0, "A very enjoyable experience.", "Even though I am not a wine fan I really enjoyed this tour. Such a unique property and experience. I even found a wine I loved (1st time for this)"], ["Reviewed 2 weeks ago", 5.0, "Wine tour and tasting", "Best winery around. We toured the Castle and had great wine recommendations from Jamie. He was the best and so knowledgeable. Highly recommend visiting the beautiful grounds and joining their wine club."], ["Reviewed 2 weeks ago", 5.0, "Very Interesting... 🙂", "In Napa, we went to Castello di Amorosa, it was meant to represent a Roman castle ( I think...) and it was much like one... so there’s a courtyard, and a half fake dining room thingy ( not for dining!) There’s also a gift shop! Plenty of wine, underground in the fake castle is where you taste the wine, but you need a tour guide, ( it’s a maze down there! And I don’t think you can go down by yourself! ) They has really good chocolate and breadsticks! And in the dining room there are paintings of naked people like the one down there...\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Wine and castle. ...", "We got a bit late to take the tour. ... so we went unguided. ... but it's still amazing experience. ... The wine tasting was underground room a long with gift shop. ... The castle was amazing. ... touring around it was nice. ..."], ["Reviewed 3 weeks ago", 5.0, "Fascinating visit to the castle", "We loved our visit to the Castle! We took the guided tour led by Henri who was extremely knowledgeable and fun for our small group. The Castle was not only beautiful but authentically built to reflect the 14th and 15th centuries. The tunnels and lower levels, including the dungeon and torture chamber were very interesting too. The wine and cheese pairings were amazing, and Henri offered an opportunity to taste many reserve wines. We highly recommend this as a daylong experience.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Go on a Sunday to avoid the crowds!", "My husband and I have been here many, many times (he's a wine club member). It's a beautiful place. We often take our out-of-town family members to visit the Castello. Saturdays are pretty crowded so book tours in advance or arrive early. Sundays are a great day to visit as it isn't as busy or crowded.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Cheesy but worth it", "The person at our hotel told us not to go there, but we were glad we didn’t listen to him. It was a bit cheesy with the castle motif but the scenery is so beautiful it more than made up for it. The wines are actually getting good ratings and I would definitely go back. Great place for a tour and tasting.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful place to visit", "Best wine we found in Napa, we went to 8 winerys. Highly recommended paying extra for tastings of the reserved wine. Castle was beautiful and so was the view. Our tour guide was spectacular!"], ["Reviewed 4 weeks ago", 4.0, "Interesting and fun", "Took the castle tour and tasting, with the chocolate add-on. Tour was very interesting, and had a fun and informative guide. The castle is definitely worth seeing! Authentic, although not old. At the end, a tasting with your tour guide. Only issue here is...the groups have 15-20 people and its very hard for one guide to service so many people. Wines are only available on site, and fairly good. All in all, recommend the stop!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "NOT TO BE MISSED", "This is an absolutely amazing. We toured the castle, and tasted wine that would rival any we had in Italy. We also restocked our wine collection back home as they do ship.\nThe grounds are impeccable to the days of castles even down to the moat and draw bridge. If you are in Napa valley you need to come see the castle and taste some very good wine, as it can't be bought any where else.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Delightful tour and wonderful wine!", "This is a must see when visiting Calistoga! We were one of the last tours of the afternoon but never felt rushed or hurried along. The guide was funny and informative -so much to see and take in . Of course the torture chamber was our children's favorite room in the castle. Paying the extra for the guided tour is well worth it.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Fun wine tasting + beautiful castle", "We went to Castello di Amorosa because we love medieval tuscan castles having seen quite a few when we went to Italy. Although, it’s not a real medieval castle it has that feels of being back to Tuscany. Beautiful castle. We enjoyed the wine tasting with Hassan, of all the wine tastings we had, this was the most fun as he is very friendly and gave us insights of their wine making. Overall, this place is highly recommended!\nShow less"], ["Reviewed January 22, 2018", 4.0, "Unique experience", "A rich man's hobby, this castle was imported from Europe and rebuilt in the Napa Valley. The entrance fees are extraordinarily high for a short tour, capped off with wine tasting. For some impenetrable reason, the food tours were not available on our day (we wanted a bite to eat around noon when we were there). Our guide was very professional, the winery tour would be interesting for someone who had never gone on one before, and the wine tasting was generous. We found the red wines disappointing, but the whites and dessert wines excellent! You can join a wine club and some of the monthly events on the grounds are very intriguing.\nShow less"], ["Reviewed January 22, 2018", 4.0, "A complete wine experience", "The wine tour inside this castle takes you through the history of wine making through the years, ending with a wine tasting. A valuable experience."], ["Reviewed January 21, 2018", 5.0, "Visit to Castillo di Amorosa during our California vacation", "It was raining the whole day when we went there at Napa valley but I said to myself now or never for we have to return to Houston,Texas. My brother who had already visited the Castello told us there is a rooster as big as a dog in the castle. To my amazement, the rooster was walking right in front of us when we were entering the grounds. It was really huge but my niece who had seen the rooster before said it's bigger when the feathers are dry. I was struck by the castles beauty. Immediately we took pictures of the rooster, then the gargoyles at the gate, the drawbridge, and couldn't stop snapping the camera everywhere. It was so overwhelming and you feel like you are in a castle in a storybook come to life. The entrance fee was $35 wine tasting included and the guided tour was $45.00. We did not do the guided tour on this occasion. We explored around the castle taking pictures of every nooks, hallways, balconies, towers, giant wine kegs, wine bottles, courtyard, doors, stairs, impressive restrooms with paintings on the doors and all the areas pleasing to our eyes. We ended up in the gift shop and could not resist buying the scented soap, lotion, etc. At last the most awaited moment was the wine tasting. Our server was really nice and with a sense of humor. Explained well the wine we tasted and what food to go with it. We enjoyed so much our wine tasting experience. He was so good that the three of us ended up buying 4 bottles of grape juice and 2 bottles of wine, Sangiovese and Simpatica. On the way to the cashier I picked up a wine bottle refrigerator magnet and a bottle of grape seed oil. It was really a very wonderful and amazing experience for us even with the rain.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Yup- real deal", "Fantastic place. Take the tour if you can. Real castle and fun for non drinkers in your group too. Michelle went above and beyond. Check out the futures wines. Pretty amazing stuff. Heri took great care of us too."], ["Reviewed January 20, 2018", 5.0, "Most beautiful winery!", "I recently took my fourth wine tasting trip using the Calistoga wine passport and this is one of the wineries included and my most favorite! It is a must visit! It is my favorite wine, the grounds are beautiful and the view is amazing!"], ["Reviewed January 18, 2018", 5.0, "Amazing place to visit and it is a must for all to go there.", "We had a great guide who was able to answer our questions and was knowledgeable about the castle, history and the wine. The wine tasting with different cheeses was a big plus. It is best to have a guided tour, rather than going on a self-guided tour.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Self guided tour", "We choose to do the self guided tour for $30 and 5 tastings were included. It was beautiful but very crowded/ \"touristy\" even in January. This is known as the \"castle\" it is one of the iconic places of Napa. There are other guided tours that allows you to go into more rooms that are off limits to the general admission, but i do not feel like i missed out on anything by doing the self guided tour. Very cool and beautiful\n** watch out for cops! They are everywhere on the roads**\nShow less"], ["Reviewed January 17, 2018", 5.0, "Loved the tour of the castle and the tasting", "This was our first trip to Napa Valley and my girlfriends and I visited in January. Even though it's winter, January is a wonderful time to go to Napa. There are just no crowds at all. We did the wine/cheese and castle tour for $70 and we all thought it was not overpriced. We started the tour at 10:45 and did not leave until about 2:30. Our guide, Henri, was personable and knowledgable. He went out of his way to interact with everyone in our group. We toured the lowered levels of the castle, did the torture room and then a tasting in an elegant room sitting at a dining table with cheeses and crackers. One of my girlfriends only likes sweet, white wine. Henri completely switched her wines to accommodate her. If you are a local in the area, I can see why you might skip it. But if it's your first time in Napa and you are not sure when you might get back then I would say that it's a must see winery.\nBtw, the detail of the castle and it's construction is simply fascinating. I have seen many castles in Europe and you can tell that the owner put so much heart and passion into the construction of this beautiful building. I would definitely recommend!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Great stop on our couples weekend", "We enjoyed the grounds and had a wonderful time doing the reserve wine tasting. They had such a fantastic variety from whites to reds and dessert wines as well."], ["Reviewed January 14, 2018", 4.0, "Beautiful but expensive!", "This is a beautiful winery to visit with a family. The grounds are beautiful & you get some gorgeous views. Unfortunately like most things in Napa, prices have shot sky high for just entering the premises. Adults are $30 with wine tasting & kids ate $20. So as a family you are looking at $100 plus. We were a family of 4 and my brother & his family who were visiting from out of town so it was a staggering $230 for 2 hours. Yikes!\n\nWe had visited the castle in the summer & the store was open in the courtyard & there was a display of how grape seed flower is made & oil tastings. This time they were setting up a huge tent for their $350 a head Great Gasby New Years event & that blocked a lot of photo ops on the grounds. I felt it was kind of unfair to charge the same entrance prices when you don’t get to enjoy the same areas of the winery.\n\nAnyway...all in all a pretty winery. Pricey but so is everything in the area. Welcome to the Napa Valley!\nShow less"], ["Reviewed January 14, 2018", 3.0, "Too touristic", "The place is this medieval castle in Napa Valley. Too crowded and you have to wait a bit to do tasting. The wines I tasted were ok but nothing out of the world. The person who attended us at the tasting was very good."], ["Reviewed January 13, 2018", 5.0, "Family and wine", "We had a nice family time tasting very good wine!\n\nOne can also see the process of doing the Wine and see the wine trees.\nPeople are very friendly!\n\nRecommended!\n\nAn Observation is that Castle itself was constructed recently, in any case, it is interesting to see how to construct a business around a theme.\n\nAlso, be aware that one can order the wine probe with fewer options and upgrade it when already in if unsure go with the less expensive option.\nShow less"], ["Reviewed January 12, 2018", 4.0, "Great place to visit", "Really enjoyed our visit here. The tour was very intriguing and they even let us sample their latest batch that still needed to age so that we could taste the difference. My major recommendation.. get the reserved Cabernet it was the best Cab I had in Napa\nShow less"], ["Reviewed January 10, 2018", 4.0, "Beautiful ground, excellent wines but hard sell by server!", "We visited this beautiful winery during winter and were impressed by the castle grounds.\n\nEntry is not cheap at all though tasting in included in the price. We had paid 40 dollars each ( a handsome sum we feel) for the Reserve tasting and were thoroughly impressed by the wines.\n\nHowever, one thing I did not like was the fact the server at my tasting keeps mentioning that my countrymen “always buys and ships crates of wines” back to my country.\n\nDon’t get me wrong, I love wine and drink occasionally, and frankly the wines were excellent as well,but I am not interested in buying and shipping a crate of 12 wines back to my country! The most I usually buy on trips to vineyards is 4-5 bottles of good quality wines back to my hometown to enjoy with family and friends on special occasions.\n\nHowever, the server was surprisingly persistent that my countrymen buys crates of wines back and seems disappointed when I “only” bought 4 bottles of wines (which still costed me an extra 200+ USD on top of the tasting fee). The attitude of the server kinda spoiled the experience for the whole visit and I may reconsider revisiting again if faced with such a server again.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Beautiful place!", "I loved the castle so much! It is so beautiful! The tour was very nice and we had such a great time there, despite the rainy day. The only thing missing is a restaurant! That is why this is not a 5 star."], ["Reviewed January 8, 2018", 5.0, "Great place to start Wine Tasting & Family Friendly", "Fantastic experience! This was our first experience wine tasting. We participated in the tour and tasting. Our daughter (6 years old) was enthralled with the castle and the enchanting thoughts of kings and queens. The tour guide was very knowledgeable and made the tour fun. The wine is amazing - I highly recommend the chocolate parings with the wine.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Amazing wines with great host", "Paulo Marcellino and the team at the bar is an amazing host and team! Do find him and he will bring you the amazing world of fine wines produced in Castello di Amorosa. I am an avid red wine drinker and red wines at Castello di Amorosa has blown me away, together with the friendliness and great knowledge from Paulo! The Castle also takes you back to medieval times - great architecture, history and superb wines! It is definitely must a visit when in Napa Valley. Thanks Paulo and Castello di Amorosa. Also get the Passport when in Napa Valley - great value!\nShow less"], ["Reviewed January 3, 2018", 4.0, "Prices were very high but gorgeous location", "We went with a underage companion as it was a family trip, and her price was 25 dollars which we thought was fine because she would get to experience what we were with juice. She received one tiny cup of juice and was told that she couldn't be with us while we were served. She ended wandering the gift shop on her own for about an hour. Now to the positive. The location itself is beautiful. We loved exploring with castle and the grounds outside. The animals are delightful. Our wine server was really friendly and didn't try to push us into making purchases which we hate. We ended up making purchases of wines that we loved without feeling like we were forced to. Overall, a pretty nice experience.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Great tour and tasting-must not miss!", "A pleasant guide, fast tour and lovely/cozy/classic wine tasting and related products. Recommended for every one. The tour is reasonable priced."], ["Reviewed January 1, 2018", 1.0, "No Respect to Customers, VERY RUDE", "The wine was amazing, but, the server’s(tall, bald, and big front teeth) attitude yesterday was very rude, he shows no respect to us and pushes us to buy the products, when we refused he just sneered and humiliated us in front of our friends by his words and gestures (we said we don’t wanna buy the chocolate and he just throw it away with a dirty look), and he just gave us an explanation that it’s a sense of “humor”. This kind of awful treatments are full of our wine tasting yesterday and it’s totally a nightmare, and here is not enough space to say all about it, obviously. Again, it’s not cool or funny to make laugh at or treat your customers like that kind of “humor”, it’s not our first time to visit the castle and we know the service should not be what the guy did to us, seriously, we drive four hours to castle wine tasting with our friends for vacation okay, not for being guests on a rude wine tasting server’s stupid “how to give the worst service talkshow”. We won’t pay for his rudeness and stupid, even one buck.\n\nShow less"], ["Reviewed December 31, 2017", 5.0, "A Memorable Trip to the Picturusque Napa Valley!", "Visited Napa Valley and did a conducted tour with Premier wine tasting.\n\nSurprised to know that the old Castle is only 10 years old. Understand the raw materials came from all over Europe and assembled in Napa Valley at a cost of $30 million. The Tucson castle was constructed in Roman architecture over a 30-year labour of Love! Before hearing that from the Tour Guide, I presumed the castle to be 150 to 200 years old!\n\nThe cellars & Winery are in the basement along with other rooms like a church, torture room and storage area.\n\nAfter a half an hour tour, they started with not so old wine for tasting. After that, they served 5 X 2 different wines (red/ white/ sweet) for every two participants.\n\nOne can also order/ purchase or taste different wines from their bar.\n\nAn interesting trip - thanks also to our guide - Christopher!\nShow less"], ["Reviewed December 31, 2017", 5.0, "wonderful wine tasting experience", "Our fear is it would be one of those cheesy tourist traps but turned out to be quite a fun sophisticated experience with guide Thomas at the helm. We had our 8 yr old son with us and special kudos to Thomas to have gracefully accommodated and made him a part of the experience. The wines offered for tasting were top notch with IL Passito being the star.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Family-friendly winery", "I've been to countless wineries throughout the world, but this winery was by far the most family-friendly. We got there pretty early on a Saturday morning and the parking lot was practically full! We began walking toward the castle and we stopped after seeing the animals in the front yard! It was a great touch and kids (and adults) flocked to it. Our sommelier (Anna G.) was really knowledgable, polite and patient with us. We just did the basic wine tasting, but I noticed kids could try the non-alcoholic grape juice tasting and color as well! Overall, I'd say this is a must see while in Calistoga.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Wine Tasting!! Wonderful!", "Wonderful way to spend a few hours exploring this beautiful winery in a Tuscan setting and beautiful castle! Wine is excellent and so is the staff!"], ["Reviewed December 28, 2017", 5.0, "Love going here", "Always a pleasure to go to Castello di Amorosa even got the wine club this time i Will be heading there more often"], ["Reviewed December 27, 2017", 5.0, "Christmas Trip", "The architecture of the castle should not be missed. Truly impressive building. Booked this tour for the benefit of my 5 year old granddaughter. But the whole family really enjoyed the tasting. I had no expectations of the quality of the wines and I was very pleasantly surprised. I recommend that you reserve a private tasting.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Castello di Amorosa", "This was a great trip! We went in off season when the grapes had already been picked, but it was a beautiful tour of the castle and it was a little chilly, but they did an outstanding job with the tour. Our tour guide Thomas was excellent. Very personable and he made the tour interactive and fun. During our wine tasting experience, he was able to pick out wines that we thoroughly enjoyed. We ended up buying 12 bottles of wine and 2 bottles of grape juice. It was delicious!\nShow less"], ["Reviewed December 27, 2017", 5.0, "Incredible experience", "The castle is very interesting and the wine tasting in the members only room was delicious and memorable."], ["Reviewed December 26, 2017", 5.0, "A must see!!!", "Incredible atmosphere and knowledgeable fun staff. The wine and cheese pairing is enough for an entire meal! Can't wait to come back!"], ["Reviewed December 26, 2017", 4.0, "The castle is stunning", "This is a must see attraction when visiting the Napa valley. The history and charm capture one's attention. While we didn't do the guided tour, my thought is that one can see far more of the castle with the tour."], ["Reviewed December 23, 2017", 5.0, "Visit after visit", "I been coming here since 2012. I love their wine and their staffs are mostly very friendly and sweet. They have an awesome dungeon, but you need to do the tour to see it. It is worth it though. Just do it once at least. I did it multiple times :D\n\nDid I mention that their castle is very beautiful!!\nFamily, friends, visiting, couples. This place is for all that!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Stunning Place, Great Wines", "My third time here and it never disappoints. Very friendly staffs and great selections of reserved wines!"], ["Reviewed December 21, 2017", 5.0, "Wine Tasting at its Best!!!", "Got the chance to visit this 13th century old Tuscan castle with acres of vineyards surrounding it..the entrance to the castle will lead you to a small patio with a small chapel surrounded by pottery of spring flowers...the place would really bring you the feels of the medieval time of kings and knights. The wine tasting was held at the basement of the castle where they also showcase a winery and other products to sell. Our package includes wine with chocolate pairing...after 5 different variants, me and my friends were on cloud nine!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great time", "We had a great time touring the castle and winery and tasting the wines. Our guide, Tomasso, was outstanding. We really enjoyed their Sangiovese and the Il Barone."], ["Reviewed December 20, 2017", 5.0, "Best wine", "The wine was excellent and the service was one of the best that I have had. the Castle was breath taking, the tour was very detailed and our tour guide was nice, friendly, approachable and sweet. He was ready to help and answer any questions that we had.\nShow less"], ["Reviewed December 18, 2017", 4.0, "Beautiful view from surroundings", "Beautiful look like castle building with wine tour and tasting. Pricey tough... surroundings have a amazing view."], ["Reviewed December 18, 2017", 5.0, "Great Wine Testing", "I have been to this place on 17th December. The most authentic wines to taste. They don't sell outside in the market. One can buy from this place only. The guide explain the process and show the Barrel room in very interesting way. I have been to breweries but first time at wineries. Amazing Place !!!!\nShow less"], ["Reviewed December 18, 2017", 4.0, "A lot of history", "One of the better tours of wineries in the Napa. It's best you book as tours fill very quickly. Great history of how/when it was built.\nThen off to,the obligatory tastings which was one of the better tour conclusions we had had.\n\nFantastic large tasting room and souvenir shop.\n\nDefinetly visit on your way to Napa.\nShow less"], ["Reviewed December 17, 2017", 5.0, "A Really Great Day", "The tour and the tasting was so very much fun! We had a really great fun filled visit. I recommend it to everyone if you will be in the area."], ["Reviewed December 17, 2017", 5.0, "visit to Castle di Amorosa", "I was on a trip with my son to the Napa Valley, and after the traditional trolley tour, on the next day we decided to visit a couple vineyards on our own. My son was interested in the Castle, so we went there. Just buying a ticket for the tour of the Castle (we had enough wine tasting after the first day), we were in the large room where tasting and food and wine tours were given and were approached by one of the staff, John. He asked if we wanted to taste some of the wine despite not having a ticket for that. We were so impressed with John that before you knew it, in a wonderful way, we had a great hour or so and purchased a case of wine. It was a very good experience for both of us and we truly enjoyed the entire event. We never felt pressured to buy wine. It was the highlight of our Napa Valley trip. Next to a Redwood forest was also a special treat.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Girls weekend wine tasting", "Girls Weekend to support Wine Country. Brought my friends who were first timers to the winery. They loved it. We did a self guided tour. We did a tasting which was our favorite part. We split a dozen bottle purchase and I became an member! Great gift shop too!\nShow less"], ["Reviewed December 16, 2017", 5.0, "Fun and Educational", "Visiting the Castle was so much fun that I've returned three times! With three different groups of family and friends. Please don't miss it!"], ["Reviewed December 16, 2017", 5.0, "Spectacular Structure", "Visited in early December for the guided tour with wine and cheese pairing. Jade was our tour guide, and provided a fun and interesting tour. The winery is worth a visit for just the magnitude and scale of the building(s). The cheeses were very good and the portion was generous. Walked out with 2 cases of wine.\nShow less"], ["Reviewed December 16, 2017", 5.0, "A trip to Tuscany", "A wonderful place! We feel like we’ve been to Italy for the afternoon when we visit this incredibly authentic castello. The wine is excellent."], ["Reviewed December 16, 2017", 5.0, "Amazing", "This place is Such a unique winery tour. It was very interesting and so much fun. I HIGHLY recommend it!!"], ["Reviewed December 15, 2017", 1.0, "Pay to Shop??", "Two friends and I wanted to visit the gift shop (without tasting or touring) and discovered they would let only one person in at a time. The shop wasn't crowded, so can't imagine why. Don't need our money?? We opted to spend elsewhere!"], ["Reviewed December 11, 2017", 5.0, "A bit kitschy but a super fun place to visit with excellent wine to go with it", "What a fun place to visit! Yes, it’s touristy and designed to separate you from your $, but the wine is excellent (the reserve wines plus Il Rubino). The tours are fun and give you a feeling of visiting a castle in Tuscany. Splurge for the reserve tasting tour, but pass on the chocolates. They’re nice, but not why you’re there. Plan on spending two hours there despite what they say. The tasting is always longer than advertised. A great way to spend a morning, especially during the week when there are less tourists. Cheers!\nShow less"], ["Reviewed December 11, 2017", 5.0, "A trip that should be made if you are in the area", "I would strongly recommend a trip to see the castle.\n\nWhile it is a “new” castle, it still looks impressive and the tour was great with the guide sharing many different stories.\n\nWe had chances for many photo moments in the castle with the great doors and cellars where the wine are kept.\n\nDo try the tasting with the wine thief too.\n\nShow less"], ["Reviewed December 10, 2017", 5.0, "Tipsy Honeymoon", "We’re not big wine connoisseurs but the castle was very interesting to walk around and see. I thought the price was good for the tour which included the torture chamber and other places which are off access unless doing a tour. We did have samples of about 10-12 different wines and they were all good. Highly recommended place to visit.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Second Visit, Better than the First", "On our first visit we enjoyed the food-pairing tour with head sommalier Mary. This trip, now as members of the Amici de Baron Club, we took a regular tour guided by an enthusiastic and knowledgeable \"career wine business\" guide, Henry. Detailed explanations, touching on the wine production and the history and purpose of the castle, followed by a generous tasting experience. We are very experienced wine enthusiasts, hard to fool and please. But Sattui and his people have created a genuine and authentic experience that we will revisit over and over. (My personal history with Napa dates back to meeting Robert Mondavi in the construction trailer as they began to build Robert Mondavi Winery in 1966.)\nShow less"], ["Reviewed December 7, 2017", 4.0, "Bad wine, but great castle tour and experience", "I would go here again to tour this beautiful castle and drink their dessert wine 'La Fantasia', but not to drink their other wines. Here are all the pros, and one con, from the experience.\n\nPros\n- Beautiful and authentic Italian castle with an impressive interior and exterior.\n- The tour is fun and is full of lessons on Italian medieval history and architecture.\n- The place is rich with photo opportunities.\n- The first wine you taste will be taken direct from a barrel using a wine thieves device.\n- The dessert wine called La Fantasia is tasty and popular.\n- Their gift shop is full of cool items to purchase. We bought a set of their infused olive oils, a wine bag, a bottle opener and an empty wine barrel.\n- They have some goats and chickens at the front of the castle.\n- They host parties here, including a popular halloween one, that are suppose to be excellent. They have the perfect venue!\n\nCons\n- Their wines, with the exception of La Fantasia, taste pretty bad and are harsh on the palette. No one in our group finished their wines. This estate has stayed true to old methods of wine production so this could possibly be the reason for the harsh taste. Perhaps you just need to grow accustomed to their style of wine.\nShow less"], ["Reviewed December 7, 2017", 2.0, "Great castle - Dishonest billing", "I booked a group wine tasting for 15 people. I booked an upgraded \"Reserve\" wine tasting directly with Castello, which was supposed to include 3 of their reserve wines. This was paid for in advance. We received no reserve wines. I inquired at the time of the tasting, and they said that there was nothing that they could do and that I would have to contact the Castello's agent Angie who booked our group.\n\nI emailed Angie with no response for 2 weeks. She eventually responded and I provided the wine sheet with the wines that we were served that showed that no reserve wines were given. It has been another 2 weeks with no response.\n\nI have only asked that they refund the difference between the regular wine tasting and the reserve tasting ($10/person); but I cannot even get a reply from them.\n\nBe careful that you are not cheated too!\nShow less"], ["Reviewed December 5, 2017", 3.0, "Disappointed", "I typically don’t write reviews but I felt inclined to for this reason. Three girlfriends and I came here over the weekend. The place is beautiful, the wine was fantastic. My girls and I were willing to buy three bottles each. However, I was VERY disappointed in the service at the wine tasting portion. The man providing us with the wine tasting, Paolo, was incredibly rude to us, especially when two of the winery club members arrived. We were trying to ask him questions about the wine but he was so focused and passionate on educating the club members, he kept brushing us away. After a while he didn’t even bother. I get it, the money makers come in and you want to keep them impressed, but for the future, don’t ignore other customers. We all wanted to love the place, but we were all shocked at the service. None of us will be going there again.\nShow less"], ["Reviewed December 1, 2017", 5.0, "Regal tasting", "Lots of decadent rich red wines that are exclusive to this fully functional stone castle complete with underground cellars and actual watchtower? Yes. I'm in."], ["Reviewed December 1, 2017", 5.0, "This is the PLACE to go in Napa", "Went on a tour of 3 wineries. I quite enjoyed this one - could have avoided the other two. Guided tour was great, scenery excellent - so impressed with how much was put into building this castle. Would highly recommend this spot to other friends. Got tipsy as well and spent a lot of $ on wine - great tasting wine though.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Experience the tour and the wine pairing", "It's hard to pick which place to go to in Napa but the castle is really fun. We did the tour and the wine tasting with the meal. Mary was our tour guide and she is absolutely fabulous. The castle has a great story behind it and the wine is amazing. They don't distribute their wine so make sure you take your opportunity to buy some while you are there.\nShow less"], ["Reviewed November 30, 2017", 4.0, "Fun tour.", "This a fun tour and tasting experience especially if you have a fun tour guide. It’s a tad pricey but worth doing at least once. The wines are ok and there are lots of choices and they are reasonably priced."], ["Reviewed November 30, 2017", 5.0, "very informative wine tasting", "Vincenzo was very helpful in describing the various blends and single vintage grapes used in their wines"], ["Reviewed November 30, 2017", 5.0, "SOLID AND MAGNIFICENT", "beautiful and smart structure for many reasons to stand out of many fine wineries in California. it being so far below ground to reserve their wine, any fire would not affect. definitely paid tour was worth all the dimes every time i visit.. whispering wall was very charming experience as the winery forged ancient castle in very details..\n\nas they only distribute thru membership, make it more unique..\nShow less"], ["Reviewed November 30, 2017", 5.0, "A Treasure in Napa!", "The castle is an amazing structure, that one would find in Europe, not here.\nThe ancient process of wine making can be seen here. Our tour guide was informative and entertaining.\nWe especially enjoyed the wine tasting of the exclusive wines made here.\nHighly recommend visiting here , should you be visiting Napa.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Amazing", "The customer service as well as the castle itself is amazing. Wonderful experience. Look forward to returning."], ["Reviewed November 30, 2017", 5.0, "Enjoyed our visit", "We enjoyed our visit and loved the castle. The only thing that needs to be addressed are all the flying nats in the tasting area after the guided tour. They were flying in our wine glasses. I’m sure you can fix it asap. Thanks."], ["Reviewed November 30, 2017", 5.0, "Not to be missed!", "One of the best experiences I have ever had at a wine tasting. The castle is amazing, the wines are delicious and our wine host, Jason, created a memorable and fun experience. This should be at the top of your list for visiting."], ["Reviewed November 30, 2017", 5.0, "Lovely castle", "Visited the castle for a birthday celebration. We were not disappointed. Chocolate and wine were amazing!"], ["Reviewed November 28, 2017", 5.0, "Wow factor", "The Castello is just as interesting and lovely as advertised. I think it is a must-see on a wine tour although it is more a boutique winery. The tour was interesting and the tasting was a pleasure. Our guide Eric was very knowledgeable and charming."], ["Reviewed November 28, 2017", 5.0, "Gorgeous Castle!", "What a breathtaking winery! They have a wide variety but we are more sweet wine drinkers so their Fantasia was wonderful, probably too sweet for the usual wine enthusiast, however. Worth driving in and walking through the castle. Very lovely architecture, true to its time (although it was built in 1993). Very flirty funky server. Tons of things to see. More of an attraction for the lovely grounds and building. Don’t miss it!\nShow less"], ["Reviewed November 27, 2017", 5.0, "Great Service - Great Wine", "It’s the wine maker that makes the wine great, but it’s the staff in the tasting room that makes the experience one to remember! We enjoyed a 2-hour tasting with Hassan that was very enjoyable, interesting and informative! We renewed our membership and bought 3 bottles to bring Home with us, since we couldn’t wait for our first shipment! A must stop for anyone visiting Napa Valley!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Entertaining Tour", "The castle is very interesting and the tour is well worth the money and time. The tour guide was very knowledgeable and the tasting at the end was very good."], ["Reviewed November 25, 2017", 5.0, "Wonderful Winery, Different From The Rest", "Having never been to Wine Country before, we did some intense research about which wineries we wanted to visit, and Castello di Amorosa was included on our list. In addition to having delicious wines, the winery is also an incredible feat of architecture and design. This is one you should not miss. When walking through the Castello, you are treated to sights that make you feel like you are in Italian wine country. Every inch of the property has been well planned, and you can easily do a self guided tour - there's no reason to pay extra for the guided tour, unless you really want to. You should definitely plan to do a tasting, though. We did the Reserve tasting, and were upgraded to the private tasting room, which made the experience even more special.\n\nWhether you've been to Wine Country before, Castello di Amorosa is a special place and is a winery not to be missed.\nShow less"], ["Reviewed November 24, 2017", 5.0, "First trip to Napa!!", "Juan was our tour guide and was “Outstanding”. Wine was beyond expectations and we had a case shipped and joined the Wine Club. I highly recommend this stop when in Napa."], ["Reviewed November 24, 2017", 5.0, "Beautiful castle with excellent wine and atmosphere", "Loved V Sattui, sister winery, visited the castle for an experience of a life time. Excellent tasting wine 🍷 and ambiance and structure is like going back in time."], ["Reviewed November 24, 2017", 4.0, "Enjoyed the visit but it's expensive for not a lot.....", "My husband and I were staying in Calistoga so decided to go on the self-tour of the castle/wine tasting. It was expensive for what it was, the castle isnt very big (or what you have access to isnt very large) and took us about 10 minutes to see everything available, then watch the free video about the owner (a little pretentious) and then on to wine tasting. The host we had to ourselves which was nice and he showed us 5 wines which were ok. The price is high, shipping makes it almost unrealistic and i still managed to spend over $200 on 'bits'.\nIt was pleasant and a beuatiful backdrop, if you can try and forget how much you spent!\nShow less"], ["Reviewed November 23, 2017", 4.0, "The castle and our host was amazing but.....", "The castle is worth the tasting fee, but don't go for amazing wine. You are paying for the experience. Our host Lucas was funny and knowledgable we really enjoyed having him do our tasting! Visit to take some pictures and ask for Lucas at the tasting bar!\nShow less"], ["Reviewed November 23, 2017", 5.0, "Estupendo! recomended by Bay Area friends!", "First visit to Nappa from Florida, and wow what a place. We drove in from Pataluma and truly enjoyed the drive with all those crazy curves we don't see when driving in the flat lands of FL. We took the tour with the amazing wine tasting, and really learned alot about wine. My wife is not a wine person but after trying some amazing wines she has taken a different view of how special these grapes are! Thanks for the great memories, and look forward to coming back. BTW, no damages from the fires...\nShow less"], ["Reviewed November 20, 2017", 4.0, "Beautiful Castle, but...", "The castle is absolutely beautiful and has a unique history. The wines are good, but not great. There is such a large volume of visitors that while the staff is friendly it can feel like a puppy mill especially when you get down to the tasting room. Would I go back and recommend it, yes, but it doesn't have a mom and pop winery feel to it.\nShow less"], ["Reviewed November 20, 2017", 2.0, "Too expensive for non wine drinkers", "It may be a nice tuscan experience in california but if you are not a wine liver there is no point in paying 120 dollars for a tour of few remodelled fake middleages look alike rooms a five sips of cabernet. Sorry it looked like Vegas for winos.\nShow less"], ["Reviewed November 17, 2017", 2.0, "The time share sale of wineries!", "Can’t complain about the beautiful castle of the valley, but I️ would stay outside and enjoy that. $60 tasting for two, no sharing a tasting here! Most of the building inaccessible without a tour and the tasting room was just like every high pressure time share presentation I’ve ever made the mistake of being talked into,and I️ paid to do it!\nShow less"], ["Reviewed November 17, 2017", 3.0, "Great Place to See, But not a great place to taste", "I have been a Wine Club member at the Castle for several years, but this was my first trip to see it. The castle itself is incredibly well done. Very interesting tour and we had a great guide in Justin, who had just started there recently. He did a great job of giving us all of the details of the castle, the winemaking process and the history of the owner. We went to 8 wineries over 3 days, and we were less enthusiastic about the tasting part of the tour as they seem more interested in controlling the amount of wine poured compared to the other places we visited. Justin was great and made us feel very welcome. Not much he could do about the pours as they were pretty strict on the amount of the wine and did not let you taste any of the reserve wines. As a result, that was the only winery that we did not buy any wine from while were there. I think they cater more to the busses coming in and the lower level wine enthusiast. It was worth going because the place is beautiful, but if you are a serious wine drinker, go see it, skip the tasing and go right to the next place on your list.\nShow less"], ["Reviewed November 15, 2017", 2.0, "Pretentious", "Beautiful castle and grounds. Tasting for 2 was 50.00 for 5 tastes. The gentleman giving us the tasting was so full of himself it was hard to take. Just because you have an Italian accent doesn’t mean you’re gods gift to the world. Bought 2 bottles of wine but they do not put your tasting price towards purchased wine like many other wineries do. Would never go back.\nShow less"], ["Reviewed November 15, 2017", 2.0, "Beautiful but it's all about the $$$$", "Went here on a recommendation of a friend...the place is stunning but a VERY COMMERCIAL WINERY!! You go to a kiosk to buy your ticket then downstairs for the tasting. Huge tasting room with 4-6 servers behind the bar area. We had Vincenzo who was an extremely smug and arrogant Italian man. He did not care about giving us any personal service what so ever. We left buying two bottles of wine and our $25 tasting fee (total of $50) was not credited toward our wine purchase. Won't go back. There are hundreds of other wineries that will treat you like family. Save your money!!!\nShow less"], ["Reviewed November 13, 2017", 5.0, "splurge!", "We did the $85 ( now $95 I think) tour and wine tasting with food. Mary was our guide for both the tour and the food pairing. She is awesome! The castle is really fun to tour...the food pairing was delightful. There were about 10 of us and Mary served several courses paired with different wines in a fun, casual setting. I would do again for sure!\nShow less"], ["Reviewed November 13, 2017", 5.0, "A Beautiful Castle With Great Wines!", "We loved having Massimo as our sommelier, he had great food pairings for the wines we tasted. He was able to describe the wines very well and really appeared to enjoy his role in our tasting experience."], ["Reviewed November 12, 2017", 4.0, "Fun place to go visit and explore, good (not great) wine", "Went to Castello di Amorosa on a Saturday in early November with my wife and adult daughter. We got there ~11am because this place (like many others in Napa valley) can get really crowed in the afternooons. Be aware that even non-drinkers need to pay the full fee to go inside the Castle, that's kind of a rip off in my opinion. Paying $30 for my wife (designated driver) to get into the castle and watch me and my daughter drink seems a little crazy. But...\nThe Castle is really cool. One thing to keep in mind after you get entry into the castle, explore the Castle before you taste and buy your wines. From some areas of the Castle you can get a fantastic view of the Northern Napa Valley; in general just exploring all the nooks and crannies of the Castle is a lot of fun. After you've done that and are ready for your wine tastings, try to find one of the side tasting rooms that's not too crowded. Most of the wines are very good (but not great, and some are very pricey) and they are only available at the Castle. I thought the Merlot was the best, but my daughter loves the Fantasia (to sweet for me). Between exploring the castle, shopping for trinkets (Soaps, bottle stoppers, dried pasta's, etc.), and the wine tasting, plan to spend at least 2 hours. It's almost directly across the street from Sterling Vineyards where you take a tram up to the elevated Sterling Winery, Sterling is another must stop if you never been to Napa.\nShow less"], ["Reviewed November 9, 2017", 3.0, "Castle Overshadows Wine", "This is an unusual winery. The Castle is very impressive and historically accurate down to every detail-could be a movie set. Wine quality nothing special—imo their sister winery V. Sattui has better wine. Still is a fun place to visit and worth a stop."], ["Reviewed November 8, 2017", 5.0, "OMG, Just OMG!! Beautiful.", "We stopped here as a side trip on our way to Lake Tahoe, and OMG we were so pleased that we took the time to visit this beautiful place. The Castle itself is amazing. Photo Ops at every turn. The architectural details are incredible. You really feel like you are in a 13th century castle! The wine tasting was very intimate, located in the lower level and the wine selection was fantastic. Fully loaded gift shop to take some treasures with you, and a nice Chapel on property to sit and reflect. We didn't have time for the full guided tour, but we heard from those that did that is was fantastic. We will do that next time.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great Place for the Day!!", "Awesome hand made castle! Just wish it was a little more price convenient. Beautiful place to spend about half a day. Great wines to taste."], ["Reviewed November 2, 2017", 5.0, "Loved it", "Loved this winery. Did the guided tour and wine chocolate tasting. The tour was awesome, very cool to see the castle and the authentic pieces. The wine is also very good, definitely more red wine options. Loved all the wines and bought 2 bottles but kinda wish i had bought 3 bottles!! The tasting is a little weird that they give you 3-4 options for each round of tastings, but I really wanted to try all the reds. Our guide Savannah was also awesome!\nShow less"], ["Reviewed November 2, 2017", 5.0, "Excellent Wine Tastings for Parents with Young Kids But No Strollers Allowed", "I went here in September with my husband and three kids (under 5). It was very enjoyable as they have a special wine tasting area just for parents. There are tables for the kids to color at and unlimited grape juice for them. While it is a bit pricey to get in, if your kids are under 5 you can't go wrong. We made a day of it being here. Our friends had an 11 year old and they had to pay $20 for him to get the grape juice. I'm not sure if I'd want to come back when the kids are older, but for younger kids this is great. After our tasting we were able to walk around, one down side is they don't allow strollers, but luckily our youngest was old enough to walk around a bit and is still light to carry. The only thing that would make this more enjoyable is if they allow you to bring food in. They have all these tables set up to enjoy wine but you're only able to have it in the tasting rooms, why not allow people to bring in lunch and then have them order more wine!\nShow less"], ["Reviewed November 1, 2017", 5.0, "Beautiful winery", "We went there a week after the fires and everything was fine there - no need to worry about traveling to Napa. The castle is very impressive and the staff were wonderful. The scenery is amazing. We had lots of fun at the wine tastings and actually ended up joining the wine club.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Just Amazing!!!!", "This was my favorite winery! Just so well done. Not to mention,. The wine was great too.\n\nSavannah, our tour guide, was a lot of fun and enthusiastic. It was great going through the catacombs and into the torture chambers and seeing all the private wine rooms.\n\nJust Amazing!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Stunning castle!", "Great castle style winery in Calistoga, great wine and Juan and Ana were great hosts, giving us good info about the wines we were tasting. We had a blast!"], ["Reviewed October 25, 2017", 4.0, "If Disney designed a winery", "As a visitor you step back into medieval Italy when you visit Castello di Amorosa. This was our second visit to this winery and we returned for the wine and for the experience of being transported back to Tuscany. If Disney designed a winery you would find these authentic replicas of frescoes, a drawbridge, antique fireplaces, Italian ironwork,(even a tortue chamber), a chapel and a massive stone castle. Pay for entry and enjoy a tasting of their Tuscan style wines. Many of their wines are excellent and can only be purchases at the winery.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Stunning castle, great wines!", "I came here on a group winery tour from San Fran. It was our first stop of the day so we got there just as it opened - almost no one around and so we spent about an hour and a half just exploring the castle and the grounds. We have some wonderful pictures from the turrets. We then went down to the wine cellar to try the wines. I am more of a sweet wine drinker, and I really enjoyed their La Fantasia wine. If I had more time, I would have loved to have done the full tour, as it was we paid $25pp for the self guided tour and the wine tasting, and that was just enough for the two hours we were there.\nShow less"], ["Reviewed October 22, 2017", 3.0, "Interesting", "Very interesting tour. If you want to really see and understand how wines are made, that’s not the tour. But... the whole Castle thing, tour, history, background are very interesting."], ["Reviewed October 16, 2017", 5.0, "beautiful bldg", "A very interesting tour and the property is beautiful. Many interesting things to see. We enjoyed the tour and tating"], ["Reviewed October 16, 2017", 5.0, "A 13th Century Tuscan Villa reassembled in Calistoga!", "What a treat it was to visit this fabulous place. Tasted delicious wines, learned about sustainability in th evineyard, took a guided tour of the castle from the drawbridge to the Fattoria to the tasting room as well as the great hall, courtyard and chapel, and even the torture chamber. Finished off with the barrel room and then got educated on the history of wine making and tasted great wines. Wonderful experience\nShow less"], ["Reviewed October 16, 2017", 3.0, "Much more about the castle than the wines", "This really should be two reviews; the castle as a scenic destination, and then the wine tasting. No reservations required, and this place does an amazing business. Huge groups and crowds come to visit, as the castle makes for an interesting setting, and definitely a fun place for kids. However, I have been to castles before, and this one seems like it was built purely to attract tourists. After a quick look around, we then had the wine tasting, and I did not overly love the wines. In the end, it was a fairly expensive tour and tasting, and while scenic and I can see where a lot of people might love this place, it is not a place I would visit a second time.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Great winery tour and tasting", "In light of the wildfires, I wanted to provide a review of the Castle. My wife and I visited in mid September. Great tour, extra long as our group had questions and our host was enjoying us as well. Great wine and venue. Received an email today that they are closed due to the fires, which is sad, but they are safe and hope,they are back in business soon.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Majestic castle and wines", "We visited this winery and loved it! Everyone there is really helpful and knowledgeable about wines, the wines are amazing!!"], ["Reviewed October 13, 2017", 5.0, "Praying for your safety", "My wife and I visited Your winery in July and it was one of our highlights during our tour through California. We weren’t big wine drinkers until our tasting. We actually shipped home 1/2 of a case and have purchased another case since we returned home. We are praying for all of your safety during this horrific disaster.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Great wine tour", "We had a very informative tour and tasting. Our guide was wonderful and charming. The castle is beautiful and winery is amazing! The wines were superb. We ordered a case to ship home. Received it last week and can't wait to indulge!"], ["Reviewed October 11, 2017", 5.0, "Fabulous winery, tour, tour guide and wine!!", "This was our favorite winery of all our wine tours during our week in Napa! The castle is beautiful and very interesting to tour. We did the wine and cheese tasting and would highly recommend this! We are now wine club members and anxiously waiting our shipment of Castello di Amorosa wine! Our guide, Heri C. could not have been better! Request him for your tour!!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Be reasy to be taken back in time!", "I was in disbelief with the magnitude of this this place. I've always been a history freak, so this place definitely filled all of my senses. We did not do the guided tour, we decided to explore ourselves and read into everything. Which was so fascinating. Now don't go with the idea that is place is historic because you will be disappointed. Right of the bat they say that this place was \"inspired\" by European castles and all that good stuff. But either way, to me personally it was such an amazing experience. The wine tasting was a fun experience specially since we were a group of 10. Overall, I felt like I needed to spend more time there, which was something we didn't have in that moment. Definitely on my list of places to go back to.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Castello di Amorosa", "We had to wait about an hour to get into a tour and tasting. We could look in the gift shop and parts of the castle. The tour was very interesting and worth the price."], ["Reviewed October 11, 2017", 5.0, "Beautiful Castle, great wine", "Visited the Castle and met Paulo for a tasting. We did not tour the castle, but from the areas we visited it was very beautiful. Out back are some goats, chickens, roosters and guinea hens to watch. The tasting was fantastic and Paulo was super fun and friendly. Not to mention an encyclopedia of wine. Highly recommend visiting this winery when in Napa\nShow less"], ["Reviewed October 9, 2017", 3.0, "Interesting but expensive and limited self-tour", "We visited this on the Labor Day weekend. It was very crowded. The self-guided tours, which was the only mean to access the tasting room and to purchase product, was $30 per person. The main entrance, the chapel, a banquet room, a room full of casks, video information, and the terrace area was all that was available to see. We couldn't visit the torture chamber, guard room and other more interesting areas.\n\nThe server that provided our wine tasting was very nice and broadly interpreted our 5 tastings. Between my sister and me, we purchased a case of wine, which provided additional benefits/discounts.\n\nIt was a nice day. I have to wonder at using the amount funds necessary to import the materials and artisans to build a castle in the middle of Napa Valley, but the vineyards looked healthy and it was interesting to do once. I wouldn't feel the need to do it a 2nd time..\n\nBe prepared to do a lot of walking - just from the parking lot to the entrance was a hike. It was during a heat wave, so we really felt it. Also, very long lines for the bathroom.\nShow less"], ["Reviewed October 9, 2017", 3.0, "Fantastic structure, but feels like a tourist trap", "The castle is an architectural masterpiece and enormous in its size and complexity. Our group enjoyed the tour and the experience, however, it was very crowded and was the only stop on our 3 day trip that felt like we were at a tourist trap.\n\nThe wines were the least pleasing of the 7 wineries we visited.\n\nNot unhappy we did it, but would not do it again.\nShow less"], ["Reviewed October 8, 2017", 5.0, "beautiful!", "Beautiful castle and surrounding grounds. Nice wine-tasting room with friendly staff. Large gift area."], ["Reviewed October 8, 2017", 5.0, "Minnesota Nice", "A friend of ours had told us to take this tour. We were not disappointed with our tour. (You can walk the castle but you don't get to visit the tunnels and other \"rooms\". ) We had 6 in our group and the entire tour was limited to about 12. We had a very knowledgeable guide who answered many questions. We tasted our wine in an area away from the general public tasting in one of the tunnel rooms. The wine was super and we also had some chocolates to enhance the tasting. I believe this is a must see winery.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Superb", "Very interesting and fun experience! My friends from Chicago, Arizona and Los Angeles enjoyed their visit! Definitely will bring my family and more friends next time. Thank You! Our bartender/ host was great!"], ["Reviewed October 7, 2017", 5.0, "Various periods walls were developed to resemble", "This is a most spectacular winery and architectural site you must see if visiting Napa\n\nThe grounds I felt were from medieval times including the animals outside surrounded by the vineyards and the view was something! Once inside the castle I felt as if I was back in time I really loved the Art Deco nod the wine\nShow less"], ["Reviewed October 7, 2017", 5.0, "A must visit in wine country!", "This is a 2 part experience. Come for the castle tour, stay for the wine. Both are excellent. This tour included a great tour of the total wine-making process. I visited during harvest and that made the tour all the better."], ["Reviewed October 7, 2017", 5.0, "great tour, great wines", "The castle is a neat place, We had a great tour guide from Philly who was fun and engaging. The wines were good enough that we ordered some. Thanks for a wonderful experience."], ["Reviewed October 6, 2017", 4.0, "Nice property", "This is definitely a touristy place but definitely worth the visit. The 🏰 is interesting and we were able to observe wine production. Paulo gave us a great experience for the tasting."], ["Reviewed October 5, 2017", 5.0, "Tuscany In Napa", "We were hesitant to go to the Castle, thought it would be too gimmicky and fake (we've spent time in Tuscany) and figured their emphasis would be the castle rather than the wine. Our 30 year old daughter really wanted to see it so we gave in, at first just to walk the grounds/castle and were so impressed (it looks more real than a Tuscan castle!) we decided to try the wine. Glad we did, it was much better than we were expecting (only tried reds) and ended up shipping a case home! Our server was friendly, generous and entertaining and we will definitely return to Castello do Amorosa the next time we are in Napa.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Winery in style with Italian taste", "We were amazed by this 13th century style winery. Each part of the castle has been well thought of to give it an authentic feeling of Italy.\nDuring our short visit to Napa Valley, we decided to have a wine tasting there. We were welcomed by Massimo who is very knowledgeable and friendly. He suggested some wine after discussing with us about our taste. We leisurely enjoyed these moments, learning about the winery and their special wine.\nMassimo's Italian accents perfectly fits the set up and we felt like carried away into Tuscany.\nBack in the Netherlands we will have a special thought about this experience while sharing our bottles with our friends. Keep it up!\nShow less"], ["Reviewed October 5, 2017", 5.0, "incredible experience", "If you only do one winery... THIS is the place! Excellent and knowledgeable staff and amazing wines. The overall expeirence was totally enjoyable and enriching. We loved everything about the history and background and furnishings to the wine making and behind the scenes insight!"], ["Reviewed October 5, 2017", 5.0, "Larry Di Palma. Seafood NY", "I enjoyed the entire experience from the history of the castle and how it was constructed to the info on how the wine is made. Our guide was very knowledgable and the tasting was over the top. 5 stars and I hope to return soon"], ["Reviewed October 5, 2017", 5.0, "Bella", "This was our first visit to wine country and the Castello. Domenico and the staff were amazing. Felt like la famila. Fabulous wine. Will revisit."], ["Reviewed October 5, 2017", 5.0, "Castle in a valley of wine", "As many wonderful wineries exist in Napa, some just stick out because of the whole experience. Castello di Amorosa was truly enjoyable through the whole tour, including the wine tasting at the end. ...and I will say, we tasted some very delicious wines. Even if you're not the wine enthusiast but enjoy architecture, Castello di Amorosa winery tour is worth the time to visit.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Cheers!", "Do the tour, taste the reserve wine. You won't regret it; hence, they don't sale their wine to the market or other restaurant around napa. You can only purchase it at the castle only. I'm in love with their king and queen cabs. I can drink that everyday There's so much bodies and flavors, the best part is it's very smooth. Don't forget to get the grape juice, it's delicious for minors. It's not like your average grape juice you can buy at the store, it's not too sweet and there's no added sugar. Just 100% pure cab grape juice.\nShow less"], ["Reviewed October 5, 2017", 3.0, "Castle Tour", "Tour host talked way too much, too salesy, nice guy but I've the top and that made out experience less enjoyable. The castle is really great though! Wines so so."], ["Reviewed October 5, 2017", 5.0, "Such a nice surprise!", "Six of us visited Castello di Amorosa and I have to say we were so pleasantly surprised!!! We expected a super touristy location and it wasn’t! This place was full of history, beautiful and intriguing! The wine was delish!!! We got to taste out of a barrel that had yet to be bottled and we liked it so much we bought a case of futures...something we had not done before! I strongly encourage the wine and cheese tasting in the beautiful members room! And add the chocolate pairing!!! So good!! We even enjoyed going down into the dungeon to see the oldest wine bottles and the underground chambers and tasting g room. Such a beautiful and fun place!\nShow less"], ["Reviewed October 4, 2017", 5.0, "Work of Art", "One of the most interesting and beautiful wineries we have visited. We recommend the guided tour to get the full enjoyment of this place. Thomas was our guide and he really made you feel welcome. He made sure you were able to see everything and explained the passion behind it.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Castle in Valley", "Very cool experience and excellent wine. It's easy to get caught up in the experience of visiting a castle and forget about the wine but DON'T!! We enjoyed everything we had during our tasting but really loved the sparkling rose."], ["Reviewed October 3, 2017", 5.0, "Much more than I was expecting; in fact, it was \"awesome\"", "I've been traveling to Napa Valley for over 40 years and have visited countless wineries in Napa/Sonoma. When a friend from Canada suggested Castello di Amorosa, I was a bit skeptical. It is relatively new (10 years old), and I expected a Disneyland/Epcot experience. I was quite surprised.\n\nA group of 11 of us did the guided tour, including my 97-year-old father who lives in Sonoma Valley. He's visited six times more wineries than I have, and it takes a lot to impress him. At the end of the experience, he turned to me in the car and said, \"Now that was awesome!\"\n\nThat pretty well sums it up! Yes, it was awesome. It was not gimmicky, nor was it overplayed. The physical grounds are very beautiful without appearing like a Hollywood set.\n\nBut the real gem in the tour was our guide, Gary S. He was very humorous, quick-witted and knowledgable. The guided tour private wine tasting was not the typical \"three pours and you're outta there\" and well worth the slightly higher admission price.\n\nCastello di Amorosa will now be my new recommendation to friends for a worthwhile winery tour when they're in the Napa/Sonoma area.\nShow less"], ["Reviewed October 3, 2017", 3.0, "Pretty but expensive", "Strange to see a medieval castle in the Napa Valley but it works quite well. The castle is very photogenic from the outside and really interesting inside. My only gripe would be the cost of entry"], ["Reviewed October 3, 2017", 5.0, "A castle in Napa", "It offers a unique Napa experience. The castle sits at an elevated area and provides a view of other vineyards. Tip: explore even the vineyard grounds"], ["Reviewed October 1, 2017", 5.0, "Spend the Time to Take the Guided Tour", "The guided tour was a great choice as you get to visit much of the castle not otherwise available on the self guided tour. Our guide was excellent - knowledgeable and funny."], ["Reviewed September 30, 2017", 5.0, "Excellent Tour", "Had a private wine tasting included with our tour. The castle was very interesting and well done considering that it is a replica of a European castle. The wine was excellent and private tasting room really set the mood."], ["Reviewed September 29, 2017", 5.0, "Loved the tour", "We had input the wrong address into the gps! Be careful and make sure you use right address! Anyway we really enjoyed this tour and the wine tasting. I love that this winery is a castle and how unique it is! Our tour guide was an awesome young lady and the gift shop as a lot of variety to buy from. I would definitely recommend this tour!\nShow less"], ["Reviewed September 28, 2017", 5.0, "it is all about the wine", "So yes the \"Castle\" and surrounding grounds are beautiful but we went for the wines and boy were we amazed. Some of the best vintages we tasted in Napa"], ["Reviewed September 28, 2017", 3.0, "Good photo opp", "Pretty from the outside, not worth the $$$. It's a bit commercial, I mean, torture chambers??? I call it the Disney of Napa."], ["Reviewed September 27, 2017", 5.0, "Fun & Exciting Winery tour. Very entertaining", "Went with another couple. The castle is absolutely beautifully designed and details. We wanted to go to a winery where they would go down in the dungeons and this one was perfect. Multi-level down where they store hundreds of barrels & thousands of bottles. They do a reasonable job on going into details. The whole place is amazing. We absolutely enjoyed it.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Castle!!", "This place, although i typically enjoy smaller family owned vineyards, was a neat place to visit because of all of the detail that went into constructing the building and the number of years it took to build it! I recommend to attend at least once. I do think you should be able to tour with OUT paying a fee. I didn't like that part.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Go for the great wine", "To be honest, we were in the mood for a wine tasting we could pair with chocolate to end the day :)\nThe castle is a bit of a gimmick BUT the wines were amazing, the grounds are beautiful and the staff (at least those we interacted with) were fun and knowledgable\nShow less"], ["Reviewed September 26, 2017", 5.0, "Castello di Amorosa ... the best in the valley", "Castello di Amorosa not only had the best views and ambiance in the valley they had some great wine choices. If you like BIG reds they have them. Service was tops. I suggest you use them as your litmus test. Have fun there."], ["Reviewed September 26, 2017", 5.0, "Royal Food and Wine Pairing tour was exceptional!", "Although I had some initial concern that a tour of Castello di Amorosa would be too 'touristy,' I was very pleasantly surprised. Mary Davidek gave us an exceptional experience that rivals other experiences in Napa. The food and wine pairing tour is well worth the money.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Not the best wine you will have on your trip, but the Castle and grounds are a sight to behold", "If it's your first time to Napa you have to go to Castello di Amorosa. The Castle is a beautiful sight to behold, modeled after European castles down to the bricks. The tasting is in the basement of the castle where you will find cool air and barrels and barrels of wine. Almost everyone who works there is from Italy or Europe and all very happy to be in Napa and love telling you about their wine, the castle and everything about it.\n\nThe wine was okay, not the best I had in Napa and not the worst, but you are going for the views and the castle ambiance. Many gorgeous pictures and a beautiful place to see.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Castello di amorosa", "My wife and I were captivated by the Castle itself. The tour we took was informative and the wine provided was excellent. We became members of the wine club."], ["Reviewed September 26, 2017", 5.0, "Great Experience", "We did a Tour/tasting. Juan was our tour guide, very informative and loads of fun. The Castle is amazing and such an authentic reproduction of a medieval castle. Highly recommend."], ["Reviewed September 26, 2017", 4.0, "Fun day activity", "Expiring the inside of the castle and hearing its history was very fun. Start early because it gets busy in the afternoon. My wife and I would have given this 5 stars, however, the tour felt rushed by our tour guide. Then during the tasting he did mint even seem interested in discussing the wine. He just wanted to pour all our tasting as fast as possible so he could get on to the next tour.\nShow less"], ["Reviewed September 26, 2017", 5.0, "A great way to spend an afternoon in Napa Valley", "An adventurous afternoon in a castle equipped with all the amenities one would expect...and most importantly, the wine!"], ["Reviewed September 26, 2017", 5.0, "Napa 2017", "The adventure at Castello di Amorosa was filled with great information and the tasting was great! We had Gary as our guide and his knowledge and enthusiasm was excellent. Definitely a must do when in Napa!"], ["Reviewed September 26, 2017", 5.0, "Must see in Napa", "Absolutely loved visiting the castle with Jason as our tour guide. He gave us in depth detail of how the castle was created and the history behind the owner. The wine tasting was superb and beautiful scenery. Muse see if you are going to Napa!"], ["Reviewed September 26, 2017", 5.0, "Very mice place to visit", "The castle is wonderful and wines are excelents. The medle age atimosfere is aplesant invite to teaste wines produced there."], ["Reviewed September 25, 2017", 5.0, "Ladies weekend get away", "The castle was outstanding and amazing to visit, the history of it is AMAZING, we had a blast learning about their wines!!"], ["Reviewed September 25, 2017", 5.0, "Great time @ the castle", "We had such a great time. First of all the Castle itself was super interesting. It's hard to believe it was built in this century. It's so authentic looking. Our tour guide was very knowledgeable about the structure as well as the wine. The wine was very good. And the chocolate pairing at the end of the wine tasting was especially yummy!\nShow less"], ["Reviewed September 25, 2017", 5.0, "Will definitely be back!", "Will definitely be back. It is a beautiful property with great wines. The staff was very friendly and helpful. It was a great overall experience."], ["Reviewed September 25, 2017", 5.0, "Touristy but well worth it", "Everyone talks about this winery. Is it fake or not? Really it doesn't matter it is the best view and best tasting we had. Merci Alex. We didn't take the tour and had a ball looking at everything plus we left with one of our best Chardonnay\nShow less"], ["Reviewed September 25, 2017", 5.0, "Unusual and fun place to visit", "We visited here as part of our Napa Valley Wine Train experience. Very interesting, elaborate location. Not our favorite wines but the atmosphere was great and we got to taste a lot of varieties. Tour guide was knowledgeable. We enjoyed our time here."], ["Reviewed September 24, 2017", 3.0, "Interesting but lots of fake!", "We did the tour and wine tasting. The tour was well done but as a Brit coming from a 9th century town in England I didn't really 'get' the great excitement of seeing 16th century bricks imported from Italy.\nHearing about the wine, how it is produced and finally tasting it was good. In retrospect I would probably skip the tour bit and just go for the tasting!\nShow less"], ["Reviewed September 24, 2017", 5.0, "Vincenzo is the best!", "This was our first and best stop on our Napa wine tour. Vincenzo was awesome, entertaining and friendly. The Castle was amazing. What a great experience!"], ["Reviewed September 23, 2017", 5.0, "Ask for Jade Sparks for your wine and cheese tour", "An amazing tour with Jade who was extremely knowledgeable and funny. She has local connections (graduate of the Culinary Institute of America) and really knows how to entertain. During the tour she kept it flowing and had us all listening to the various stories associated with each room. At the end of the tour in our own special room she paired wines with cheese and delighted us with some additional wines that were out of this world. Really a first class, fun and entertaining way to spend the afternoon. She made it special.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Castle tour and excellent wine", "This tour and tasting is totally worth the price of admission. I suggest reservations. The castle was built by the owner using period appropriate methods and materials. Our tour guide was incredibly knowledgeable and thorough. The wine selection and cheese pairing were amazing. Highly recommended."], ["Reviewed September 23, 2017", 5.0, "Amazing winery tour", "What a great experience. We were lucky enough to have our tour done with the marketing director Steve K. who described everything with passion. If you are planning to come to the Napa valley this stop is a must. If we come back to a California we will certainly come back. Thumbs way up to all the Castello di Amorosa staff\n\nMichel & Nancy\nShow less"], ["Reviewed September 22, 2017", 5.0, "Amazing wine paradise!", "This place is simply gorgeous, one of the most famous winery in Napa. About the wine, is a perfect place to know and taste it, their sangiovese wine is one of the best what I had."], ["Reviewed September 20, 2017", 4.0, "Beautiful winery", "The Castello di Amorosa is situated on hill and reminds one of a medieval castle complete with moat. The scenery is wonderful and even though it was crowded with tourists we were able to enjoy or visit. The staff are all friendly and courteous as well as knowledgeable on the subject of their wines.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Molto Bello !! (very beautiful !!)", "We only had time to stop in 1 place for a wine tasting. This place was highly recommended and we were not disappointed. The setting is a castle. The atmosphere is upbeat and lively. The Italian gentleman pouring our wine was funny and friendly and gave us a lot of good information on wine selection. The reserve wines were so good we ended up buying 1/2 case which was packed for airline travel.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Winery", "The castle and scenery were beautiful and we had fun trying different kinds of wine. Of course I did find some that I had to have. Our guide was very knowledgeable, friendly, full of good humor. He made the tour very enjoyable. I would definitely recommend visiting Castello di Amorosa.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Authentic Castle - Great Wine", "Castello di Amorosa was included in our itinerary because of the castle and we were not disappointed. This awe inspiring structure is authentic through and through! It will be entertaining visitors centuries from now. The biggest surprise was the wine which was as good as any in Napa Valley! And guess what....they ship to MS. NO ONE ships to MS!! They explained they do not distribute. They only way to get their wine is on site or through their wine club, therefore we can join the club and get shipments, Yay!!\nShow less"], ["Reviewed September 19, 2017", 5.0, "Highlight of our trip!", "We were treated like VIPs from the moment we arrived. The tasting room was beautiful. John was the best and taught us so much about wine. He brought us to the rooftop and down to the cellar where he serenaded us while sampling wine and walking through the wine barrels. We had a blast!\nShow less"], ["Reviewed September 19, 2017", 4.0, "An experience", "Four of us spent a few hours touring and experiencing the Royal Pairing. The food and wine tasting was excellent and the Castle is awesome. Downside was the crowds and they were setting up for an event which took away from the experience."], ["Reviewed September 19, 2017", 5.0, "The jewel of Napa Valley", "We visited Napa to celebrate a Bachlorette party. We visited over 15 vineyards and Castello was the clear winner. Paige was the best hostess we met on our trip. We were so pleased we ended up buying 4 cases! We look forward to coming back again!\nShow less"], ["Reviewed September 19, 2017", 5.0, "Wine & Food Pairing", "Our food &. Wine pairing with Mary was amongst the best experiences our family had during our week in wine country. The private tour was well worth the $$$! After taking a very thorough tour of the facility including their underground caves, we were treated to a handmade lunch and wine pairing. I would go back for sure!\nShow less"], ["Reviewed September 19, 2017", 5.0, "\"Something about Mary\" - Highly recommend the food pairing/wine tasting experience w/ Mary!", "I could pass on the tour, but the food pairing/tasting experience with Mary far exceeded our expectations! Skip the tour unless you're really into the castle stuff, but don;t pass up the experience with Mary!"], ["Reviewed September 16, 2017", 5.0, "Mind-blowing. Worth the visit up to Calistoga...", "Absolutely amazing that this guy ships in old stones & ruins, and constructs this castle with all ADA requirements met!! Wow..."], ["Reviewed September 16, 2017", 5.0, "Best Trip To Castle", "We had an amazing trip to Napa! The highlight was the castle. Marcella was the best! She immediately greeted and helped us find the best tour. We even came back for a second visit the next day because of our experience. The staff was so friendly and we became members after this visit because we had such a good time. We will be back again very soon!\nShow less"], ["Reviewed September 15, 2017", 4.0, "Reconstructed castle", "Worth visiting just to see the castle recreated in all of its finery. Wines not too special. Worth a visit."], ["Reviewed September 15, 2017", 5.0, "The winery highlight of our Napa vacation", "We visited a total of 5 wineries on this family trip to Napa, and by far the one with the best overall experience was the Castello di Amorosa - great scenery (how can you beat a castle?), a fantastic tour, an extensive wine tasting at a good price, and one of the best wine clubs in Napa. And of course, the wines were excellent! For a number of reasons (did I mention the castle?), this is a can't-miss stop on any visit to the area. Highly recommended.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Best winery in town!!!", "I live 50 miles away from the area. And I never considered visiting any wineries in Napa at all! Until my twin from Germany came back. My sister wanted to do something while she was in the area. So since of my friends goes here all the time, we ended up checking the castle.\n\nOwen was our tour guide! He was very knowledgeable as well as patient to everyone in our group. We did reserve wine tasting and my gosh their reserve wines are very good! I ended up taking 2 bottles home lol!\n\nI will definitely recommend this place to everyone!!!\nThanks to Owen who made our experience unique!\nShow less"], ["Reviewed September 13, 2017", 5.0, "WINE TASTING", "I loved this place, loved the guy that helped us with our tasting he was from France and was very good at his job and knew a lot about wine."], ["Reviewed September 12, 2017", 5.0, "What fun and only cool place in 115 degrees!", "Great visit. Great wine. Bought a case to ship home. Would recommend to anyone. Wine cellar nice and cool on record hot day."], ["Reviewed September 12, 2017", 5.0, "Beautiful Castle and wines", "I wish we had time for a tour of the castle. We only came for wine tasting, but it was the best experience on our trip to Napa."], ["Reviewed September 11, 2017", 5.0, "Fantastic afternoon!! Would highly recommend!", "This was fantastic - we loved it here.\nWe chose this winery over the others as the setting looked very appealing and had heard very good things. It was around 25/30 mins from Napa centre. Free parking and easy to find.\n\nWe had booked ahead over the phone which made it quicker but you can walk in too. We booked in to a guided tour and tasting which was $40 each - this included a guided tour around the castle ( and the history behind it ) as well as a tour of the wine cellars and a walk through of the process to make their wines.\n\nOur tour guide was fantastic ( Steve K ) and the tour , which was around 2 hours , flew by! It was a very interesting tour, well\npaced , good fun and people were very happy and comfortable to ask questions.\n\nSteve was very knowledgeable and really made our visit.\n\nWe then went to the tasting room - we had 5 wines each ( 2 of us ) but following recommendation tried 10 different wines rather than the same ones. Mixture of white , red and dessert wines. We then got to know a bit about the wine and score it.\nThere was then an opportunity to buy the wines and visit the shop.\nWould highly recommend!\nShow less"], ["Reviewed September 11, 2017", 5.0, "In awe", "Wow! The amount of authenticity and attention to detail in this castle was impressive. This was by far my favorite winery. The tour was excellent. We did the reserve tasting paired with chocolates. I highly recommend spending the extra $5.00 to add chocolate. It DOES pair well and really enhances flavor. And the reserve wines were a nice option as well. We ended up buying a few bottles. I only wish they would have sold the Cabernet that we tried from the barrel. It wasn't quite finished yet but it was SO good! So fruity and I would have paid a lot to have it at that point. We did buy that same bottle but both my boyfriend and I agreed that the finished product wasn't as good as the barreled version. We are not at all wine connoisseurs though I will add; Just wine lovers! Great experience and excellent wine. A must see winery\nShow less"], ["Reviewed September 11, 2017", 5.0, "A day in Tuscany without leaving the US", "We arrived here by a \"Limo Bus\" from the Wine Train that delivered us to the front gate.\n\nAfter disembarking from the train we were assigned a tour guide that stayed with us until we arrived back at the train station. He gave us a introduction to what we would do and see at Castello Di Amorosa. He also told us that we would be getting another guide when we reached the Castle that would guide us on our tour of the Castle. The whole experience would culminate in a wine tasting at the bottom of the Castle where we would taste 6 different wines.\n\nUsually, I'm very descriptive in my reviews but I went knowing very little other than it was a castle that was brought over from Tuscany and the wines produced here were unparalleled. I'm not going to say anything else other than this because I think it would destroy the overall experience. I will say that our guide was very knowledgeable, we experienced more than 6 wines in our tasting, for an additional $10 I experienced 3 wines that were more than $100 per bottle, I departed with the purchase of a case of wine that was shipped to my door and was held for shipment so that it arrived 2 days after I returned home.\n\nIf you should be in the Napa area and do not go to this Winery you will have missed the experience of a lifetime.\nShow less"], ["Reviewed September 11, 2017", 5.0, "The Earlier The Better to Beat the Crowds", "What a lovely setting and so much to see at Castello Di Amorosa! They have a fabulous wine selection/tasting as well. You can walk in and around the castle grounds which makes you feel like you're in a fantasy world. Well worth the visit!"], ["Reviewed September 8, 2017", 4.0, "Italian Castle winery", "My wife and I thoroughly enjoyed our visit, general admission with tasting. Vincenzo who served us our tasting was a highlight. Enjoyed his energy and banter. He was so charming and persuasive we ended up shipping a case home to Pennsylvania. We got there early and it got crowded. Our waitress at the Rutherford Grill described it as the Disney World of Napa Valley wineries and I understand why but it did not take away from the obvious attention to detail and authenticity of the castle and wine. Not the place to go if you want serious sideways traditional winery experience.\nShow less"], ["Reviewed September 8, 2017", 4.0, "HOT DAY", "Great tour especially learning about the history. Heat at 105+ no problem in the cool caves at 55 degrees. Wine tasting coupled with tour one of th best."], ["Reviewed September 8, 2017", 5.0, "Interesting visit to a Tuscan castle in California", "We really enjoyed our visit to this winery. The tour is worth taking to find out about the wine making process and the interesting history of this particular winery. It certainly stands out as it is built as a Tuscan Castle using authentic materials! The wine was very good and the tour guide very knowledgeable.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Great tour/lovely wines", "We thoroughly enjoyed our tour. Our guide was very informative and a pleasure. The wines are awesome and affordable and we made quite a purchase...."], ["Reviewed September 7, 2017", 5.0, "very cool!", "Great tour with a small group so easy to get the info out to us all. Great wine as well which of course is kinda key. The castle is what gets you here."]]}}