{"Children's Pool": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Children's Pool", "url": "/Attraction_Review-g32578-d1466558-Reviews-Children_s_Pool-La_Jolla_San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/71/aa/9f/children-s-pool.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1058"}, "address": {"@type": "PostalAddress", "streetAddress": "850 Coast Blvd", "addressLocality": "La Jolla", "addressRegion": "California", "postalCode": "92037-4254", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 5 days ago", 5.0, "Awesome!", "I'm surprised that someone hasn't started charging for this! It was so lovely to stand and watch the sea lions playing, swimming, diving and frolicking. An hour went by in a flash!"], ["Reviewed 5 days ago", 5.0, "I could watch all day!", "Walked here from my hotel every morning at low tide to watch the seal mothers and pups sunning themselves and nursing on the sand. Good views from above on the sidewalk, but definitely walk around the horseshoe shaped seawall too, to watch them swimming in the shallows together.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Place to Visit", "This is a must see if you are visiting the San Diego area. The sea lions or seals (lol) are just so adorable! Because we visited in February during their pupping season, all the little babies were there scooting around right next to their mothers! It was the cutest thing ever!! Definitely take a visit here, and then walk about .3 miles to some nice restaurants and shops.\nShow less"], ["Reviewed 1 week ago", 5.0, "Love It Here", "I love coming to the Children's Pool to see the seals. Since they've remodeled the lifeguard station it's nice that they have bathrooms but beware they are not much better than a porta-potty.\n\nThe parking around the area is terrible as well so expect to drive around for a while to find something close or expect to park further away and have a decent walk, maybe up and down hills.\n\nBut with all that, it's worth it to come and just hang out on the sea wall and spend time watching the seals sleep or play, especially when all the babies are around.\n\nIf you come at low tide, the La Jolla tide pools are a short walk from the Children's Pool and that is always an adventure. If you come at high tide, expect to get a little wet as the waves crash against the sea wall while you're watching the seals.\n\nA great experience!\nShow less"], ["Reviewed 1 week ago", 4.0, "Baby seals", "When we visited the beach and rocks were closed to protect the mother and baby seals. This last for several months. You could walk out along a seawall to look and take pictures. There was a lifeguard inside a station to make sure people were following the rules and leaving the seals alone.\nMany of the seals were sleeping in the sun but we saw one mother and pup swimming and climbing out of the water. A fun place to walk by and see the seals.\nShow less"], ["Reviewed 1 week ago", 5.0, "A Must See", "We love to walk all the out on the sea wall , The view is beautiful every couple of steps it seems a little different. We enjoy taking pictures from all the different angles."], ["Reviewed 1 week ago", 5.0, "February Is Seal/Sea Lion Cubbing Time!", "The Children's Pool is one of the bex=st attractions along the fabulous LaJolla coastline.\nBut in the winter, its even better because you can see dozens of sea lions and seal mothers with their cubs! These little sports are eager to learn and to get to know mom. Mom takes them swimming once in a while but we were there at midday and they were all sunning and sleeping!\nJust below the lifeguard building is a public rest room.\nThe entire La Jolla coastline drive is very popular and parking, while plentiful, is also sometimes hard to find. If you make a pass up the drive and don't find anything, just go inland a block or two.\nShow less"], ["Reviewed 1 week ago", 3.0, "Another spot to see the sea lions", "We saw alot of the baby sea lions sun bathing. Cute stop for a picture from above, but nothing more."], ["Reviewed 2 weeks ago", 5.0, "Sea Lions", "The sea lions here were very lazy. I had many comments asking if they were dead. The views were nice and it wasn't too crowded."], ["Reviewed 2 weeks ago", 5.0, "What a fun place to visit", "The area was full of seals and their pups while we were there. It was so much fun to watch the seals and their pups. There is an area to walk out on for better viewing of the seals and the cliffs. What a great location.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Seals", "Still called the children’s pool although it’s been home to seals for longer than I’ve been alive. It’s a neat place to get close to real seals in a beautiful setting but they do smell a great deal. This part isn’t to be taken lightly it is prohibitive to taking in the sights. Definitely walk out on the stone railed area at least once, it’s a special location where the waves crash on the rocks and the seals lounge safely on the other side. If you go during the right season you get to see cute seal pups laying on the sand it’s an adorable site and the best time to go.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "WOW Hello Sea Lions!!!!!!!!", "I visited the beach and ocean in La Jolla and this place also in almost indescribable……beautiful views of the clear water, lots and lots of shore birds and pelicans and so many sea lions. I actually got pretty close to the sea lions and got some great pictures. The only small negative is the smell of the excrements of the birds and sea lions…. But the views more than out weigh the olfactory negatives!!!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Pupping season", "Not as many seals out as I thought (and had seen in other people's pictures on here), but maybe because it's \"pupping\" season? Saw at least 2-3 little seal pups, so cute! Enjoyed watching them in their own environment. The beach to the seals was closed December to March for Pupping Season so you don't scare away the Momma's, just an FYI!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Spectacular natural beauty marred only by lawyers, seals, and stink!", "This beautiful area at the point of the La Jolla coastal drive is so incredibly beautiful whether you are driving, walking, biking.... or sitting on a grassy spot for morning or sunset.\n\nThe controversy surrounding the area called the Children’s Pool is based on the sea wall that was built to create a sheltered natural water area in which children could learn to swim. The protection afforded by the sea wall indeed protected against the waves and many, many children learned to swim there.\n\nIn the last decade though, seals have overtaken the area and have chosen to do their pupping on the beach. All CA beaches are open to swimmers/people, thus the beach has become a point of interaction between the seals and people. The mire seals, the more poop in the water and the higher fecal organisms contaminating the water. The more people, the more chance of a negative interaction between a sea mammal and human.\n\nAnd thus the legal battle between beach access (people) and the environmentalists (for the seals). Aggressiveness and bullhorns has sometimes shown the worst side of people.\n\nAnd thus let me get this review back to where it belongs.... to the natural beauty of our incredible coastline, especially at The Children’s Pool. My children and I have actually seen a pod of whales sauntering by this area of the coast and we just love enjoying our beautiful coast. So I invite you to enjoy our beautiful coast as well.\n\nIf you visit the Children’s Pool, be sure to walk out onto the sea wall, it’s great!! Please don’t bother the seals.... it’s not good for anyone. No selfies with them either!!\n\nParking is tight so just be patient as you look for parking on the side streets. Restrooms are available at the lifeguard station. There are many coffee shops and cafes within an easy walk from The Children’s Pool.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Up close to the ocean", "Wonderful area to view the seals or sea lions, whoever has moved in!!!. Enjoyed the walk out into the ocean. It allows you to get great wave pictures as they crash against the walkout. Also great views looking back into the cliffs"], ["Reviewed 4 weeks ago", 4.0, "Seal Viewing!", "The Children's Pool is a section of the La Jolla beach where seals live and are easily available to view. Wildlife observation is usually not this convenient, but at Children's Pool, it is easy and fascinating, a great idea for a short stop(even though they're really interesting, there is a certain amount of time that the seals can hold your attention). One thing that could be done better, though, is information for visitors. I learned nothing from this visit-plaques or interpretive signs would be nice, at the very least. This could be a great opportunity to teach the public about seals. Still, I definitely had fun and think it would be an activity enjoyed by most everyone, regardless of age.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Children's pool is for seals", "During much of the year the Children's Pool is exclusively for seals and sea lions. It's a perfect spot to view the animals up close. It's as close to a Galapagos Island experience as you're going to get without going to the Galapagos. It's two blocks from downtown La Jolla on a gorgeous cliff side walk.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A must!", "The sea lions sure put on a show for people. The views are gorgeous. What is not to like? Be sure and take lots of pictures. It’s not often you’re able to get this close to sea lions!"], ["Reviewed 4 weeks ago", 5.0, "Seal viewing, kids love it", "Great spot for viewing the harbor selas, swim, get on rocks, dive and lay on the sand. Good photo opportunities, watch out for the eventual splash!"], ["Reviewed January 23, 2018", 5.0, "Part of a wonderful promenade", "The day we were there, the beach had 10-15 seals and sea lions. There were also wonderful seals and pelicans at La Jolla Cove, a beautiful walk way."], ["Reviewed January 22, 2018", 5.0, "Seals", "So many seals!! Fun to watch them blubber around in the water and the shore! The lookout area gives many great photo opportunities. There are concrete walking paths all way down to the cove as well as a sea wall surrounding the cove."], ["Reviewed January 21, 2018", 5.0, "KIDS LOVE IT", "I took my kids here and they loved it. There is lots of seals to look at and they put on quite the show for people. The smell was not terrible but some odor from them being there. Tons of people swimming in the water an scuba diving seals dint bother anyone. Will go back multiple times per year great trails to walk and awesome food to eat.\nShow less"], ["Reviewed January 21, 2018", 3.0, "Great view of the seals but ...", ".... that is about it. The seals have taken over the beach so you have to watch them from afar. LOL. Still, go early in the morning for a beautiful photo opportunity. The lighting was gorgeous."], ["Reviewed January 21, 2018", 5.0, "One of my Most Favorite Places in the World", "I always make a point to visit La Jolla and stop to visit the sea lions at the Children's Pool. The sea lions know they are on display and love every minute of it. This time I spent about a half hour just enjoy the sounds of the waves and watching a sea lion \"surf.\" Highly recommend visiting this area of La Jolla.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Not for children but seals", "A Beach designed for children but taken over by seals. Parking in the area is tough but the walk along the shore is lovely and the seals are adorable. You can’t actually go down on the beach as the seals have taken it over. But you can see (and smell) them well. Public bathrooms are a plus.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Kids will like this place", "Sea Lions are everywhere and the only dangerous thing is the walk way getting near the animals. Looks like the sea water has eroded the concrete a little bit."], ["Reviewed January 11, 2018", 5.0, "Amazing!", "This beach offers a shelter for tired seals and marine lions who lazily sunbathe. We got there after a pleasant stroll from La Jolla Cove."], ["Reviewed January 11, 2018", 4.0, "Sea Lions and more sea lions", "Awesome opportunity to view Sea Lions on the rocks. I wish that the area was policed by DEC as some people were encroaching/taunting some of the sea lions."], ["Reviewed January 9, 2018", 5.0, "Great place to see seals or just check out the beautiful scenery.", "We stopped here because of a friend's recommendation. Parking took quite a while to find but it is a lovely walk with great scenery of the ocean hitting the cliffs or the beach. We almost missed the seals but once we found them they were a lot of fun to watch.\nShow less"], ["Reviewed January 5, 2018", 1.0, "Paradise lost", "Once again while walking above the ocean in La Jolla we went to children’s Pool only to find that interlopers have now designated this as seal capital USA. We have always co existed with the seals in La Jolla but these folks have taken it upon themselves to make this beach for seals only. It’s only a matter of time till the seal population swells making it dangerous for humans swimming off La Jolla beaches as Apex predators will come in the cull the herd.\nShow less"], ["Reviewed January 4, 2018", 4.0, "You have to see the sea lions", "This is a great place to take the family, nice park with small playground, great walking path, nice views, great to climb down to the beach and so many things to do. May be hard to find parking"], ["Reviewed January 3, 2018", 5.0, "Always in the La Jolla News as people contest or support sea lions", "The children's pool is protected by a wall that you can walk down and experience the tide hitting the wall. The pool area itself is a sanctuary for sea lions. You will always see them here and smell them! Also, in the rocks going down, lots of squirrels and pelicans. The beach itself is restricted for water use due to nesting sea lions. Parking is a challenge, but once you find it, you can then enjoy a walk along the coast line.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Amazing", "I could stay there forever, enjoying the seals and sea lions. What a cool place! This was the most amazing sunset I've ever seen in my life! Find yourself a comfy seat sit back relax and enjoy! Such a fabulous atmosphere!"], ["Reviewed December 30, 2017", 5.0, "Sea Lion watching!!!", "This is a great place to watch the Sea Lions sleep and sun bath. Just please leave them alone!!! There are already enough disrespectful people who don’t read the signs... Parking is also very difficult, so be patient!"], ["Reviewed December 30, 2017", 5.0, "It's called a Children's Pool but I wouldn't leave my kids in it", "They put the walls up back in the day to shield this area of the beach to let children wade. I don't think I would do that, there's plenty of wildlife around with the Sea Lions, and bird life that I don't think I would be in that pool. But that also gives you plenty to see and you can have a nice walk on the beach. Great Sunset watching area too.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Too cold to swim but fun either way", "We really enjoyed walking out on the curved Pier watching the waves and seals. Wish it was warmer so we could have swam... some day!!!"], ["Reviewed December 28, 2017", 5.0, "Sea Lions!", "Saw a ton of sea lions here! It has a great view and we were glad we stopped. We almost walked past this thinking it was a child swimming pool area."], ["Reviewed December 19, 2017", 5.0, "Go here for more seals!", "Lovely beach surroundings this area, gorgeous for pictures and relaxing. There are several areas to sit and enjoy the view!"], ["Reviewed December 11, 2017", 5.0, "Nature at its best", "This is in a great area. lots of seals up on the beach the day I was there. The ocean and rocky cliffs are beautiful. Great place to see wild life and enjoy the ocean."], ["Reviewed December 10, 2017", 2.0, "Nothing special..", "We went a highish tide so there was no rock pools to play in. The beach is small but nice, I'd say it's probably pretty surgey with strong waves maybe currents but the waters too cold in December anyway. There was 4 or 5 Seals to see which was nice and a small bird colony.\nParking was a problem.... Be lucky or prepared to walk a long way\nShow less"], ["Reviewed December 9, 2017", 5.0, "I have been visiting this spot for at least 55 years, about every 5 years or so.", "When I visited as a kid, it was more popular with the locals, but now, because the sea lions are protected by federal law, they own the place and so it is less visited by the two legged swimmers. But maybe a local would have a different pint of view.\nShow less"], ["Reviewed December 1, 2017", 4.0, "baby seals", "Nice cove to view the seal babys and adults sunning and relaxing. Nice walk along the rocky shore of the Pacific ocean."], ["Reviewed December 1, 2017", 4.0, "Amazing views, terrible parking", "My wife and I drove here hoping to see some seals and it was gorgeous. The sea was rolling and crashing into the rocks just like you would imagine and we saw 3 seals. They kept sliding off into the water and jumping back onto the rocks so they were fun to watch. These are wild animals, not Navy SEALS. Somebody really asked me about that after our visit, so just in case you are wondering. There was also a jetty to walk out on that provided great and close views of the tide.\n\nI gave it 4 stars instead of 5 because parking was a nightmare and the public bathrooms were disgusting. Drive down to see this spot for sure but you will see what I mean when you get there. Traffic moves extremely slow and it is stop and go for a very long stretch. If you need to use the facilities try to hold it for the next place if you can.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Great place to watch the seals", "Really nice beach where you can observe live seals. Sea lions are a little down the road but seals are here. Free activity and great opportunity to observe these amazing wild animals."], ["Reviewed November 28, 2017", 5.0, "A MUST SEE", "La Jolla alone is beautiful but the seals and sea lions are the icing on the cake! If you are in the San Diego area, this is a must. Don’t miss this opportunity!! It is worth the trip."], ["Reviewed November 26, 2017", 3.0, "Small beach", "Kids had fun. Protected cove. There were plenty of seals to see. But beach too small for regualr beach fun."], ["Reviewed November 26, 2017", 5.0, "The perfect place to watch Sea Lions.", "We were able to be close without invading their space. I've only ever seen seals or sea lions at a zoo. It was amazing to watch them in their own habitat."], ["Reviewed November 25, 2017", 4.0, "Seals and Sun", "Don't be fooled, the seals have taken over and the children have been delighted but moved on. It's such fun to see the seals all rolling around and sun bathing. Your children will love the sight and you can climb down to get closer to them. Although it is best to keep a little distance as they are still wild and seal breath is far from pleasant !\nShow less"], ["Reviewed November 18, 2017", 4.0, "I paint her all the time it is a very special light here. There are seals", "There is a constant on going battle about gettin the seals out of here and getting the kids back the cove. It is a very special place."], ["Reviewed November 17, 2017", 5.0, "Must see when you are in La Jolla", "Children's pool and La Jolla Cove area is always included when I show people around San Diego and vicinity. Though it is not easy to find parking anywhere, be patient. If you are willing to walk, try to find parking on Prospect closer to the art museum, and take time for a nice stroll along the shore. If you don't see any seals/sea lions here, don't be disappointed. There should be some more around the cove/tide pool area along the shores behind the grassy park area and have seem more there in the recent years.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Children's Pool at La Jolla Cove", "The Children's Pool at La Jolla Cove is a sanctuary for a large number of Sea Lions, which are amazingly entertaining year round. There was a group of people in San Diego that embraced kiking the Sea Lions out of the \"Children's Pool\" to return it to children, but they didn't succeed (Sea Lions are running out of sanctuaries, and this is their special place to raise their babies and enjoy the ocean views).\nShow less"], ["Reviewed November 12, 2017", 4.0, "Nice, unique beach", "I was glad to be back to the beach and watch the seals and pelicans. It is a well known place, much visited by tourists, who sometimes get too close to the seals. A must see attraction, when in the area."], ["Reviewed November 10, 2017", 5.0, "Get Close to Lounging Seals", "This protected harbor beach was built for kid use, but the seals moved in. And now it's protected for seal use only. But we spent a few hours here, watching the seals, walking on the pier, along the beach and cliffs, playing near/in the water (my kids are crazy). It was all so much fun, and getting that close to wild seals is something we will remember!\nShow less"], ["Reviewed November 9, 2017", 4.0, "If you love seals this is a MUST!", "There is some (but not many and they're timed) free parking areas sort of nearby but this view of nature is worth any priced parking! A short stroll from this area and you can have an up close and personal experience with these seals too!"], ["Reviewed November 9, 2017", 3.0, "Nice for a short stroll", "There were not a lot of swimmers in October but it was pleasant and there were plenty of sea lions to check out close up."], ["Reviewed November 8, 2017", 5.0, "A Must See While in San Diego", "This is a great sight to see while in San Diego and near to downtown La Jolla. There is a wave break that you can walk out on to a point where it curves and sea lions like to sun themselves. Nice to see nature in its habitat. I highly recommend.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Hang out for Seals!", "This is not a swim beach for children. The beach was covered with seals - very cool! We were there mid morning."], ["Reviewed November 4, 2017", 4.0, "Lovely area", "We were lucky when we visited as the sun was out, but it is clearly a lovely area to visit and the scenery is superb with many photo opportunities."], ["Reviewed November 3, 2017", 4.0, "No longer a children's pool but one for the seals", "We visited the Children's Pool at La Jolla Beach on a day when the ocean was quite rough. It is famous for Sea Lions. I only saw one baby Sea llon frollicking in the water. Normally there are a lot more.\n\nAt one stage they removed the Sea Lions by having loudspeakers with dogs barking so that the locals could have their beach back. This was determined to be inappropriate and once the speakers were removed the sea lions returned.\n\nNot appropriate as a children's pool anymore and I believe swimming there is now prohibited.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Great view, Great Place", "This secluded area is more for the seals than children. There were seals taking sun bath and nice relaxing water splash. Nice picturesque place with nice walk to the edge. Waves were great and seals were all over."], ["Reviewed October 31, 2017", 4.0, "Super-Close Seals", "I read about this place and srumbles upon it by accident when visiting some other spots on the La Jolla coastline. Everything is actually closer together than I thought.\n\nThere were a lot of harbor seals the morning I went and probably the best view of them from my whole trip. They were very close and either sleeping or playing in the water. I was happy to see that the guests who were there were respecting the animals and keeping a safe, quiet distance.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Beautiful area!", "We wanted to see seals and or sea lions. Parking was tricky but manageable requiring a short walk.\n\nThere are several areas to observe the natural beauty and wildlife. We walked to the observation area and were literally feet away from three seals that were basking on the ocean side in the sun as they tried to avoid the sea spray. There were about 20 (or more seals) in the pool area laying on the rocks.\n\nWe wanted to see seals, but there were pelicans, sea gulls and some of the more amazing views of the California coast line we have ever seen.\n\nWe cant wait until we can visit this area again!!!!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Day Trip.", "Strolled upon this area by mistake. The harbor seals were basking in the sun. Beautiful little area. Beautiful spot to just sit and watch the sun set"], ["Reviewed October 22, 2017", 5.0, "Seals, Seals & more Seals", "My little boy loved this. His favorite is the beach & getting to get up close to these easy going super cute sea creatures was fun!"], ["Reviewed October 21, 2017", 3.0, "Seals & More", "Children's Pool was closed to children as the seals had taken over. Watching the seals was very cool. They were playing around in the water or lounging out on the shore.\nI didn't rate this as high for two main reasons.\n1. It's not very big. I think the pictures do an injustice. You think it is a huge crescent shaped area, but it is not that big.\n2. Parking is a nightmare. Trying to get here was hard. There's hardly any regular parking. Even in off-season (October), you couldn't find anything without driving in circles. Kind of makes you think this is a HUGE attraction, but when you get down there, it can be disappointing.\nThe kids enjoyed the seals. Especially after we had gone to the San Diego Zoo.\nOverall--cool place to stop if you have little ones who want to look at seals lounging on the beach.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Just beautiful", "This is right there where the sea lions are!!! The colors of the water are amazing. It was a little windy with waves crashing against the rocks the day we went. But it didn’t stop me/us from putting our feet in the water. It’s a beautiful place that’s so peaceful. Will be going back. A must visit for sure.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Loved walking along the seawall and seeing the seals and sea lions", "Perfect place to spend the afternoon. Went down to the beach to grab sea shells. Then walked along the seawall (wear shoes, parts of it are all stone) and took a ton of photos of the adorable seals below"], ["Reviewed October 18, 2017", 4.0, "Seals! and cliffs", "I was searching for something that was inexpensive and gave me something to do outside. I looked up 'things to do in La Jolla' and this came highly recommended. It is fun to sand on the walk way and watch the seals but it is very crowded and you get bumped into a lot. The stairs are uneven as well so make sure to wear flat shoes. There is a small beach that you can swim in and the seals and pelicans come around so a snorkel and face mask would be fun to have for under water. There is not much shade so come prepared. Up on the cliff, there are paths and walkways to the local businesses. The parking is bad during peak hours.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Really nice place to take some good photos and find sea glass.", "It was nice little part of the beach. Had a few Seals come up and lay out on the rocks and got some cool photos. Found a lot of sea glass as well."], ["Reviewed October 14, 2017", 5.0, "Go here to see the sea lions.", "Geat spot to see seals and sea lions. You can walk right up to them and take a pic. Must warn you the smell can be rank. Just breath through your mouth !"], ["Reviewed October 7, 2017", 4.0, "Surprise in La Jolla", "WE travelled to La Jolla to see the town as it was recommended by friends. Came upon the boardwalk & Children's Pool while looking for the elusive parking spot!! What a treat! A lovely, well kept park, gorgeous ocean views and seals, sea lions and birds galore! Several areas to access small pubic beach areas with snorkelling possible. Advise spring or fall visit, as would be very busy in summer.\nShow less"], ["Reviewed October 7, 2017", 5.0, "A MUST See!", "This place has been around forever but, it's really a Great View and, located next to the Lifeguard Tower. You walk out, over the MIGHTY Pacific, on a narrow curved walk, with rails and, you can look in awe, at the Seals, lying in the sand basking in the sun on the Beach below! However, please do not approach them as, locals may not appreciate it, just a word of caution. However, it's Mother Nature at her Finest and, you and your children, wouldn't appreciate it either, if some strange being, approached you or them either but, it's still Grand! I Highly advise you go and let the children see this, they will never forget. Then, you can simply walk or drive, a few blocks too downtown La Jolla, and enjoy lunch and ice cream, at one of many restaurants, as there are quite a few so, enjoy and, Safe Travels!\nShow less"], ["Reviewed October 6, 2017", 3.0, "4-5 minutes from la jolla cove ...for more close photos with seals and sea lions", "better close view of the bay front with less seals and sea lions...less prior than the cove but very close and worth seeing..not a perfect place for swimming...few free parking slots..no admission fees and showers and rest rooms are available"], ["Reviewed October 2, 2017", 4.0, "Beautiful spot!", "With sea lions and the walkway into the waters for some stunning views. Went early in the morning and loved the place..."], ["Reviewed October 2, 2017", 1.0, "SEAL POOP POOL", "This place is over ran with pooping seals. Should let the Children's pool be that not poop pool!!!! Used to be great for the family."], ["Reviewed October 1, 2017", 4.0, "A great place to see the seals and sea lions!", "A truly perfect little cove for children to play in —except that the seals and sea lions dominate it, and there are all kinds of signs warming not to get near them! AND it smells awful. So, if you hold your nose and just enjoy the physical beauty of the creatures and the gorgeous water views, you will be fine!\nShow less"], ["Reviewed September 20, 2017", 4.0, "one of the sea lions ( seals watching spots", "This is one the 3-4 best points at La Jolla for watching seals and sea lions. So, it's worth to visit. If you start from here going north along the coast you will see all the spots for watching the animals within 15-20 minutes."], ["Reviewed September 18, 2017", 5.0, "Sea lions", "Everybody days the smell is overpowering bit we didn't notice it. Farther north where there were more sea lions it was much more powerful but the animals were so amazing or just didn't matter. Highly recommend this place. The earlier the better. Beat the crowds."], ["Reviewed September 15, 2017", 3.0, "Parking was a Challenge", "Took 3 yo grandson on a Sunday. Parking might be easier to find on weekdays. He enjoyed getting splashed on the bridge and getting his feet wet in the surf. High tide might shrink the sand area?? This is not a blanket on the beach for the afternoon kind of place. Leave everything in the car and enjoy splashing.\nShow less"], ["Reviewed September 14, 2017", 4.0, "Didn't see many seals, but it was still a cool area", "We went looking for seals, and there were only a few out in the water. However the place was still beautiful to watch the tide come in."], ["Reviewed September 13, 2017", 2.0, "Cool to see but dont swim here.", "So nice area to see but go swim on the regular beach or the regular cove. The children's pool often has high bacteria levels and I would not recommend swimming there."], ["Reviewed September 13, 2017", 5.0, "Beautiful place", "I have walked to this area on each visit to La Jolla. It is lovely to walk along the walkway to see the water and sometimes see the seals! Fun for all!"], ["Reviewed September 7, 2017", 1.0, "Stay away!!!", "The seals love it but kids (and adults) should stay out of the water. Let me repeat that - stay out of the water!"], ["Reviewed September 6, 2017", 2.0, "The foul smelling sea lions have crowded out the kids", "The Children's beach is no more, it's not a children's beach right now. It was Last year, tons of kids in the Scripts family donated beach. Now the foul smelling sea lions have invaded again and the stench was horrendous."], ["Reviewed September 6, 2017", 5.0, "On my top places to take my guests when they're visiting!", "Have brunch/lunch/dinner at Georges on the Cove then take a walk down the steps to see the Seals/Sealions at the children's pool and the Dr. Suess park :)"], ["Reviewed September 6, 2017", 5.0, "Enjoying family time", "Nice opportunity to stroll along the beach area with family. Quiet-peaceful.....lots of tide pools and sea lions"], ["Reviewed September 6, 2017", 4.0, "Hold your nose!", "This is a location that one must visit. It is fun to watch all the seals that hang out here. If you are lucky enough to be here when the pups have been born then there is more to see. But they will close off the beach and not allow you to get on the sand. Actually I wouldn't want to get in that smelly water anyway but some people do!\nShow less"], ["Reviewed August 27, 2017", 4.0, "Sometimes the seals are in the other side of the wall", "We stopped by to check out the seals lazing around the children's pool and were initially disappointed to see an empty beach. But we just walked along the sea wall and found a couple of them on the other side, along the somewhat calm tidepools. One bonus is the plentiful bathrooms right under the lifeguard station.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Nice spot for kids and seals", "Our 18 month old enjoyed walking in the sand and getting his feet wet in the water. We saw 4 seals there just before sunset. Parking can be a challenge in the area (you might have to pay for parking) but there's no admission to the children's pool.\nShow less"], ["Reviewed August 21, 2017", 4.0, "Good seal viewing", "This is a great place to view the seals!! You can spend a lot of time taking nice pictures of seals here and people watch as well. There is an area of the beach roped off to protect the seals, though we saw many (mostly teens-20 year olds) going right past the ropes to lay on the beach.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Great for kids!", "We stayed very close by and almost spent everyday here with our 3 kids. Our 9 and 7 year olds are confident swimmers and were about to play around in the water while seals came in and out occassionally. Our 4 year old was able to play in the shallow entry. Sandy beach and upclose seal watching!\nShow less"], ["Reviewed August 20, 2017", 4.0, "Check out free spot!", "Enjoy this views as you walk along this beautiful shore. This unique experience is free and worth stopping by if you are in the area"], ["Reviewed August 20, 2017", 4.0, "Definitely a nice beach for little kids", "We didn't spend a ton of time here because our kids are getting bigger, but if I had little ones, I would definitely come to this place. There are few big waves, and the water is shallow, so little kids can frolic to their heart's content. You can also see Seal Rock from here, though if you walk further down the sidewalk from Children's Beach, you get a better view. They had public restrooms, which is always a nice feature at a beach.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Nature, naturally in a man-made setting.", "Years go when we visited there were an abundance of seals. Not so many now but they are still fun to watch whether they are active or just sprawled out and soaking up the warm sun. It is very serene. A good prescription for stress relief.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Nature up Close", "Great place to catch the seals! Loved going here to see nature up close--the seals don't even care they are being watched! They were fun to watch and at times seemed they were trying to entertain us!"], ["Reviewed August 12, 2017", 5.0, "Seals for days", "Have to visit if your in La Jolla. Fun for adults and kids! You can walk on the cliffs to get close to the seals. The memories and cliffs are incredible, if you are lucky and it's not hazy the views are amazing"], ["Reviewed August 6, 2017", 4.0, "Awesome views around the corner", "We went right around the corner (south?) from the Children's pool and saw so many seals sunning themselves on the rocks and beach. So cute to see them up close. We continued walking and saw beautiful rock formations right along the beach. Some nice swimming areas and beautiful views. Children's pool looked calm and shallow so great for little kids.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Perfect summer day in LaJolla", "A beautiful summer day allowed us to wind our way along the Coast Blvd and we eventually ended up at the Children's Pool. This is a happening place for families simply because there is room to set up \"camp\" for the afternoon and the water is shallow and inviting. The seawall is where you will want to walk in order to see the beautiful sights - we found seals (including a baby!) and they held our attention for a long time! Absolutely beautiful location - stunning. Don't miss.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Perfect for little kids", "Great spot in La Jolla with calm, shallow waters. Bathrooms and showers located directly next to the pool. Lifeguard station is directly above. Parking is limited so either arrive early or expect to walk a ways. Access to the Pool is by staircase only, so leave the stroller in the car. We had a great time here.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Nice", "Very relaxing and such a beautiful place to visit, relax and hang out on a nice sunny day. Highly recommend."], ["Reviewed July 22, 2017", 4.0, "No Seals Just People and 1 Annoying Guy with a Drone", "I read that seals had taken over this spot, but when we went, there were no seals at all. It is a small beach protected by a sea wall. You can walk on top of the wall and see the coast from a different perspective. Be warned, you will get wet if you walk all the way to the end of the sea wall. The views are spectacular! The only thing that annoyed me was a guy with his obnoxious drone.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Beautiful VIews", "Had a nice time walking out on the sea wall and watching the waves. There were no seals around in the mid afternoon which surprised us. Even so I do not think it would be healthy to swim in that water where the seals come every evening and night. Lots of little kids were in the water with their families. It is the first time I have seen so many people on the beach and in the water. I wonder how many people get sick after being in that water. The new restrooms are beautiful as is the lifeguard tower. It is a great place to take visitors, but I would not recommend swimming or playing on the beach there now. Years ago it was a perfect place to take young children for a day at the beach before the seals made it their home. Lifeguards told us they come on shore in the evening & spend the night and leave in the morning when people starting coming.\nShow less"], ["Reviewed July 19, 2017", 3.0, "Crowded, small beach", "Pacific Beach and Mission Beach are great and approximately 4-5 miles south. The La Jolla Children's Pool was really crowded and small. Area has nice views in general and I would definitely recommend visiting La Jolla, the Cove and the restaurants, but if you are looking for a children's beach I would not chose this over the two previously mentioned beaches.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Your seal viewing may vary", "Based on other reviews, I was kinda expecting this place to be crawling with seals but when me and my friend went, I think we saw between 5-6 and they were pretty far away in the water. I think it mostly had to do with timing. We got there around noon and I got the impression most likely heading out to sea for food. There were some families on the beach. Looked like a very chill spot, but would have definitely enjoyed seeing more of them.\nShow less"], ["Reviewed July 18, 2017", 4.0, "Really cool!", "A great little swimming area for kids where they can be seen easily. A cool seawall to walk on for great views. Public bathrooms that are kind of gross, but easy to find and use."], ["Reviewed July 17, 2017", 5.0, "A must with Children!", "This is such an awesome area for children to play and swim. No waves. You can see bottom. Many sea lions in the area as well."], ["Reviewed July 15, 2017", 4.0, "Nice beach for children", "It was crowded and is a small beach. Personally I saw children have so much fun at the tide pools, that would be my first choice when taking my granddaughter to the beach."], ["Reviewed July 14, 2017", 5.0, "Seals, surf and sunsets.", "La Jolla is a dream come true, and a visit wouldn't be complete without a trip to the Cove or the Children's Pool. Great seal watching with stairs to the beach. Beautiful views of the curving coast line. Fabulous any time of day... outstanding sunsets."], ["Reviewed July 9, 2017", 5.0, "Beautiful", "See seal lions up close in natural setting. Shops across the street up a hill and places to eat but pricy. Bring food, sit and watch nature and see the sun set in California. Please respect the mothers and calves and see a view of a lifetime. I am local native and I never tire of being there with them and my own children. Walk to a place and get a burger and shake. This is gorgeous.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Amazing, unique beach worth returning to again and again...", "We visited this one-of-a-kind spot on our last trip and headed here two times this trip. It is such a cool spot where you get a chance to share the ocean with seals and sea lions, snorkel, swim or just take in the view (along with the sounds of the surf crashing on nearby rocks and the sea lions barking commands...and the smells of the salty air mixed with the not-so-pleasant smells of the beautiful birds and marine animals). My kids can run in and out of the waves for hours and my husband enjoyed his snorkeling adventure (though the water is VERY cold here). This is such a pretty spot and we will return on every future trip. It is a can't miss for any trip to the San Diego area.\nShow less"], ["Reviewed July 7, 2017", 4.0, "Great, if you are a seal !", "It is called the Children´s Pool for a reason.......\n-So that family´s with small children could have a place to play in the ocean, in shelter from the surf.\nThen came the seals and took it over........and they think it is a great place too !!!!!\nSo, now it has become a place to watch seals instead !\nShow less"], ["Reviewed July 4, 2017", 4.0, "Fun to Visit with the Seals and Sea Lions, as Long as You Can Stand their Smell!", "This is a fun public beach where one can commune with seals and sea lions when allowable. Otherwise, it's a dramatic place where the ocean can crash against the protective wall to spray visitors standing upon it. One can enter the ocean at this point, and swim out into the ocean. One should be a good swimmer to attempt this, however, as the lifeguard tower (which was built in 2015-2016) is on the inside of the wall. There is an interesting swim-throiugh located about due west about a hundred yards from the wall, through which one can freedive if one can hold one's breath while propelling oneself down and through.\nShow less"], ["Reviewed July 4, 2017", 5.0, "A gorgeous view and seals to watch!", "This place is gorgeous! Great views and loved watching the many seals and sea lions with their newborn babies! Definitely crowded here (understatement) and very hard to find parking. I will definitely have to come back in the off season or during a weekday to really soak it in :)\nShow less"], ["Reviewed July 3, 2017", 3.0, "Stay on the overlooks! Too many persons allowed directly on the beach", "Still, a nice place to visit. However, the crowds on the beach kept sea lions and their pups from coming ashore whenever they attempted to."], ["Reviewed July 2, 2017", 1.0, "I wouldn't let any child near any water or beach that smelled of animal waste", "The stench of animal waste from the seals was horrible. We stayed on the walkway. We saw a few seals (maybe 6 or so) but the smell was unbelievable. I can hardly believe any responsible adult would allow their children to play in filth."], ["Reviewed June 29, 2017", 5.0, "A MUST see while in San Diego", "We spent a lovely day at the Children's Pool watching the sea lions sun bathe! We did a lot of walking along the beach and had a nice picnic on a grassy area overlooking the water."], ["Reviewed June 28, 2017", 5.0, "Sand and Sun", "Nice clean place to walk on the beach, sit in the sun, get your feet wet, or just watch the baby seals play in the surf."], ["Reviewed June 27, 2017", 5.0, "Sightseeing", "Spectacular view of sea lions... Ready for camera Many visitors Breathtaking view of Pacific ocean Weather was gorgeous"], ["Reviewed June 21, 2017", 2.0, "Should be named the Seal pool", "What was a man made safe place for kids to go, is now a polluted seal birthing ground. The poor lifeguards job has changed to keeping the tourist away from seals, and the seal lovers away from the family's who want to use it for what it was made for\nShow less"], ["Reviewed June 20, 2017", 5.0, "Great spot to see sea lions and the ocean", "This is an area with a wall, built a while back intended to break the waves and create a safe space for children to swim in the ocean. Well, the seal lions noticed this little relaxing safe haven, and made it their own. They come here to hang out, especially during pupping season. We went out to see the sights, and we were not disappointed. We walked the walkway all the way to the end, and you get awesome views of the ocean, and the sea lions. I also encourage you, once done here, to keep walking along the waterfront park area, down to the cove. So much to see!\nShow less"], ["Reviewed June 18, 2017", 5.0, "Excellent for families with children, protected from large waves", "June 17, 2017; There is a barrier wall to keep the rough waves away from this area. I actually saw seals swimming in the same area but they maintained their distance."], ["Reviewed June 18, 2017", 5.0, "Seals galore", "Originally built in the early 1900's as a Children's swimming area, it was taken over by seals. We went at night and you can walk right up to the seals. there is a rope barrier to keep you from going to close but I'm pretty sure the seals don't always respect that! Fun adventure for our kids.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Beautiful!", "\"Children's pool\" refers both to a small circular beach area for both kids and sea lion pups to play! They get surprisingly close and even swim towards the kids at times. It is stunning! Wish we had more time to spend on this little beach."], ["Reviewed June 18, 2017", 5.0, "Great attraction, not a pool, not for children (2017 edition)", "The children's pool is one of the most famous attractions in La Jolla. This is a part of the coast that was clearly modified by humans to become a protected beach (possibly for children). Although modified by us, humans, for our intentions and use, some other creatures found it rather appealing and decided to make it their \"pool\". So during the winter of 2017 when I visited the place the children's pool was occupied by sea lions or seals and seagulls... Quite a spectacular attraction!\nShow less"], ["Reviewed June 17, 2017", 3.0, "Neat", "Neat thing to experience. My son loved getting to look at the sea lions and seals in their own environment. It was pretty crowded and the rocks are slick. I was carrying a baby and stayed up top. My husband went down with our son. There wasn't a perfect way to get down there, but I could see and watch just fine!\nShow less"], ["Reviewed June 16, 2017", 5.0, "Not really for children", "The name was misleading. When we arrived and walked out on the breaker surrounding the ocean \"pool\" we saw that this was actually an area where seals were hanging out with their babies, not a place for children to swim. It was a great opportunity to see them up close.\nShow less"], ["Reviewed June 13, 2017", 5.0, "Not a Pool!", "Not your typical 'childrens pool', but you will understand when you see it. A lovely day in Lajolla."], ["Reviewed June 9, 2017", 5.0, "Beautiful!!!!", "The seals were so fun to watch!!!! Sunset was beautiful!!! Had a great conversation with a local! Wonderful time!!!"], ["Reviewed June 4, 2017", 4.0, "Loved this.", "Lovely afternoon watcing the seals, Managed to park the car just up the road. Went to the small beach first and was amazed to find we could walk on the beach. However what we did find unsettling was how close some of the people were getting to the seals and unfortunately despite our protests some people were touching the seals, After that we went to the larger beach and watched the seals. You can't go on this beach but they were amazing to watch even if all they do is sleep. Lovely day but folks please don't touch the seals.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Nice for Seal Watching", "First time on the West coast and was told about this. We went there on Friday--adults and children were at the Children's beach - the seals were in the water. It was fun to watch for them in the ocean-see their little heads pop up in the water. We did get to see one get on a rock. The ocean views here were wonderful. Unlike anything we have ever seen. Also got to watch a surfer.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Nice location", "Nice to watch seals from a distance. Don't get too close during pupping season. I listened to the podcast and was so excited to visit the site"], ["Reviewed May 25, 2017", 5.0, "Great views of the ocean", "The ocean view is beautiful. Fun place to walk on the beach and watch the seals. Busy with many families."], ["Reviewed May 24, 2017", 4.0, "Good and Bad", "Well the Children's Pool is not for children at all. Unless them looking at the sea lions counts. The sea lions took over years ago and they have never left. It good for a stop to view the sea lions while doing the coastal walk. If you can stand the smell walk out on the jetty for a closer view.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Fun with seals", "I love watching the seals play and sleep. They are so cute! This area does tend to get stinky though, so fair warning. Nice way to spend a couple hours with a wonderful view and wildlife."], ["Reviewed May 22, 2017", 5.0, "Good nature lovers stop", "Carved out of small cliffs, many seals like to rest and play here. Reasonably walkable and you get safely close to the animals. Free attraction but the parking can get sketchy."], ["Reviewed May 22, 2017", 1.0, "The SMELL, SMELL, SMELL!!!!!!!", "It should not be called the childrens pool for any reason. I would never let my children anywhere near there. The smell of Sea lions defecating is horrendous. Do yourself a favor and visit Sea World instead, Birch Aquarium, or visit other parts of La Jolla Beach.\nShow less"], ["Reviewed May 22, 2017", 2.0, "If you want to see seals, this is the place!", "This used to be a place for kids to swim in a protected environment. There is a semi circle of jetty that protects the little cove. It has become over run by seals and now it is not only illegal to swim there but the fecal bacteria counts are off the charts. While seals are fun to see, they increase the danger of shark attacks in our community and make swimming potentially hazardous. As you can tell, I am not a big fan.\nShow less"], ["Reviewed May 21, 2017", 5.0, "It was good to see seals and sea lions so close", "We knew the children's pool was closed because of seals before we went there. We watched the seals played in the water and lay down on beaches so close. That was fun to see wild animals so close by. It is very good that people and animals share the coast.\n\nThe shore line is very interesting and different from the beaches at the east coast.\n\nWe walked along the shore line and enjoyed the day.\nShow less"], ["Reviewed May 16, 2017", 1.0, "Not a Fan of the Seals", "This was donated to be a children's pool in La Jolla, but has been invaded by seals and has become a ghastly smelling place. I guess there are those who enjoy seeing the seals, and animal activists have promoted keeping them safe, but their presence has not only caused pollution (waste products), but also has attracted their prey--great white sharks to the area creating a danger to both the seals and those who have enjoyed local water sports.\nShow less"], ["Reviewed May 8, 2017", 5.0, "So many Seals", "Arrived to see about 6 Seals lying on the small beach and a few more in the water. We expected that to be it, but as we took a walk around the point there would have been a further 50 plus on the smaller beach. Beautiful location. Only spent about an hour here as was a cold day, but was fun watching seals riding the waves and sunning themselves.\nShow less"], ["Reviewed May 8, 2017", 3.0, "Interesting for a Quick Look", "It is interesting to see the seals jump in the water in a natural surroundings but mostly fun for kids to be in the sand and water's end. Leave the swimming for the seals though!"], ["Reviewed May 6, 2017", 4.0, "Seal", "There are nice to have children's pool but seal take over place ! Little cold and raining today but lot of people are visiting! Very nice !"], ["Reviewed May 4, 2017", 5.0, "Sea lions!", "Go see the seals and sea lions! Smelly, but so fascinating. The whole area is fun to walk around and there is lots to watch!"], ["Reviewed May 2, 2017", 4.0, "Beautiful view of sunset", "Loved the beautiful views of the waves at sunset! Also got great photos of the seals! A lot of fun! Bring a camera and take it all in!"], ["Reviewed May 1, 2017", 5.0, "Where the seals are", "If I am\nLucky enough to be in San Diego, then I am heading to see the glorious seals at the Children's Pool. I will walk out onto the long pier and take a ridiculous number of photos and groove on the smell of the ocean and majesty of the locale. Stay for the sunset- it's a religious experience.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Amazing Seal Viewing!", "This is a great location to see the seals. My kids, 3 and 6, loved walking out on the wall with the waves crashing around us. Parking was easy and the views were great. It was also helpful that public restrooms were available."], ["Reviewed April 26, 2017", 5.0, "It is so awesome too bad KIDS cannot enjoy it year round", "This is called the CHILDRENS POOL, but animal activists have ruined it for the CHILDREN. The land was donated to provide a safe haven for families with children to have a place to wade and play in the water. Then seals visited, and animal whiners insisted these animals that swim 100 miles per day could ONLY rest there, so they have been able to push away the families and children this was created for. If you DO go there during seal pupping season, you can observe them, but please, respect the animals space that these idiots have somehow managed to get reserved for them. Human children can enjoy it other times. The sea wall is great, and the walk along the coastline is amazing. Be safe and have fun.\nShow less"], ["Reviewed April 26, 2017", 5.0, "SEALS!!! Free parking near by!", "This American Life is one of my favorite Podcasts, and a few weeks ago they replayed an episode about the huge arguments over the seals at Children's Pool in La Jolla, so I had to check it out while I'm down here!\nSo the \"Children's Pool\" is this lovely beach and cove created by a sea wall that was built in 1931 so that you can safely neglect your children while they play in the ocean without waves. The seals decided that they loved the spot too, and for decades people and seals happily swam and sunbathed together. A few years ago, a group calling themselves Seal Docents made official looking uniforms and lanyards and started guarding the beach and aggressively stopping the public from sharing the area with the seals. It turned into a huuuge battle in the community and the police were called so often that they eventually stopped responding to calls to come down to the area. Many locals had fond childhood memories from Children's Pool and were incensed that they were being pushed off.\nI'm not sure why the Seal Docents started; NPR says that there has never been evidence of any seals being hurt by people, and they're definitely super far from being an endangered species - I read that marine biologists call them Sea Pigeons. :)\nIn the end, the Seal Docents won and the entire area is roped off from people for part of the year (including right now). BUT, proving that the seals don't mind taking selfies with visitors, the beach on the other side of the lifeguard station is not roped off from people, and tons of seals still flop up onto that people-filled beach and happily pose for pictures! They're soooo cute! We watched them for hours!\nShow less"], ["Reviewed April 22, 2017", 5.0, "Lots of Seals - Great Seawall for Viewing", "Our first encounter (from the pathway) with seeing seals on the beach - they were sunning with pups. Walked out on the seawall and was able to see seals swimming and sunning on the rocks. Seawall pathway was high enough to feel safe although it is very narrow. Open water/waves on one side, a secluded beach with even more seals on the other. A fun place to watch the wildlife.\nShow less"], ["Reviewed April 20, 2017", 3.0, "Stunning view, stinky seals.... hold your nose as you take photos!", "I walk along the coast several times a week and the view never gets old. I saw a pod of whales just off the Children's Pool a few months ago... special!\n\nThe stench varies depending on the wind, the sea animals, and the bird excrement.\n\nI don't understand why they just spent millions of dollars to build a new lifeguard stand at this location when swimmers, divers, and beachwalkers are basically off-limits anymore, either due to the toxicity of excrement in the water or the ongoing legal battles of seal people v people people.\n\nCome and enjoy the beautiful beachside walk, just be ready to pinch your nose on stinky days!\nShow less"], ["Reviewed April 19, 2017", 3.0, "Great seal watching, tourists need to give the seals space", "This was a unique place to go see seals relaxing on the sands. However people were walking right up to them and disturbing them, which is sad to see."], ["Reviewed April 18, 2017", 5.0, "Childhood Memories", "Children's Or Lisa Beach As We Used To Call It Was A Great Place To Take Children For A Day At The Beach In La Jolla, So It's No Wonder Why The Sea Life Has Restaked Their Claim For This Beautiful Beach As Their Home! Yes People The Seals Were Living In This Beach Before Humans\nShow less"], ["Reviewed April 18, 2017", 5.0, "See Sea Lions up close", "Great place to see sea lions up close, They laze around on the beach and don't seem to care too much about the humans who come close . This is a must visit place for those with kids. The name is a little misleading as there isn't any sort of pool. Parking on the beach is a little hard to find on weekend, however i found the $10 valet parking convenient on Prospect street.\nShow less"], ["Reviewed April 17, 2017", 4.0, "Not for children to swim", "The Children's pool is the place where seals take their naps. There isn't access down to it, but there is a walkway that gives you access to get a better view of them."], ["Reviewed April 17, 2017", 4.0, "Watch the seals taking a nap", "This is why you should love San Diego. Right there, next to some apartments, a bunch of seals just come out the water and lay on the beach. It's like a normal, daily thing, down here. So amazing."], ["Reviewed April 17, 2017", 5.0, "Seal rookery in La Jolla", "This is an actual seal rookery, only one of two in SoCal. They are so amazing to see but you HAVE to keep your distance. The moms will abandon their little babies if people get too close. Legally you are not supposed to get within 150 feet of the seals. It is a federal law, the Marine Mammal Act.\n\nYou can walk out on the sea wall to get a close view without disturbing them. Such a gorgeous spot.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Awesome view of Seals and their Pups", "When visiting La Jolla our driver told us about this location and how great it is this time of year because the seals give birth to their pups at this location. Our kids loved seeing all the baby seals up-close. Be aware of the smell...it's intense.\nShow less"], ["Reviewed April 17, 2017", 4.0, "Great view", "This is not for swimming but for viewing the seals laying on the beach and playing in the surf. Smell can be strong at times."], ["Reviewed April 16, 2017", 5.0, "Harbor Seals", "Great place to view Harbor Seals when they have their pups. This is December through end of April. Then the beach is open to people with kids low waves and not deep."], ["Reviewed April 14, 2017", 3.0, "Be Aware! The curved walkway is uneven, bumpy, hard to walk on...", "There are a couple of things you need to be aware o if you are going to walk out on the curved walkway that surrounds the children's pool.\n\nFirst, the walkway is very corroded, eroded, and uneven in many places. We had no trouble walking it, but any one with mobility issues or unsteady on their feet will find it very difficult to walk on.\n\nSecond, the walkway often has people standing against the rails looking at the seals and sea lions on the beach and in the water. It can be crowded and you need to pay attention as you walk on it.\n\nThird, the seals and sea lions can smell very bad. When we got down there, the stink was pretty bad!\n\nAnd finally, at high tide, the water crashes against the walkway and pours over it. We saw people near the end get soaked from the crashing waves.\n\nIt is fun to see the seals and sea lions, but be careful if you walk out onto the walkway.\nShow less"], ["Reviewed April 14, 2017", 5.0, "Pool for sea lions and seals", "This pool beach is mainly for this beautiful sea lions and seals and birds. It's breathtaking, s family destination!"], ["Reviewed April 13, 2017", 4.0, "Beautiful, but...", "The beach and area sure are beautiful, but it is very stinky and covered in sea lions. They are fun to watch and they are very active, but be prepared to plug your nose occasionally. Don't swim in the water, it is polluted with the animal feces. Gross. But, it is very pretty and entertaining!\nShow less"], ["Reviewed April 12, 2017", 4.0, "Sea lion beach", "This gives a beautiful beach and ocean view - but be prepared for a beach covered in sea lions! No swimming here any more, but it's fun to watch the ocean and the sea lions playing. Just be prepared - there are a lot of sea lions, and the smell definitely lets you know that!\nShow less"], ["Reviewed April 10, 2017", 3.0, "Beautiful and exciting views of the ocean and shorelne but lots of sea lions laying around", "The name is mis-leading. Although it once was a dedicated beach set aside for calm ocean beach access for young children,its occupied by many sea lions sharing the beach and with the smells of gull dropping and the animal dropping in the water, not too sure its a place for being called a children's pool.desirable for swimming.A winding sidewalk but not much space for picnics and no outdoor cafes for a drink or coffee. Really difficult to find a parking space but many folks don't stay long so be patient and wait for looky lous to leave.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Seal beach", "It's a nice place to watch seals! But, having lived near here as a teen I much preferred it when we could swim there.."], ["Reviewed April 10, 2017", 5.0, "Great place to watch sea lions!", "From the rocks near the Children's Pool and beach area and on the beach nearby all the way down to La Jolla Cove, you could see sea lions sunning themselves and resting on any available surface. The only drawbacks were finding a parking place and the state of the public restrooms, but seeing the antics of the sea lions made it all worthwhile. I even drove back a second day to bring my husband, this time on a weekend. There is no charge so you can stay as long as you want. Coming in the spring increases the chances that you might see a mother with pups. We saw several.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Sea Lions Rule!", "I had read that this area was created for kids but that the sea lions had taken possession of it...and it's true! They're all over the beach and huge rocks and in the water. You must walk the wall to the end to see them and a nice ocean view.\n\nAround the corner, I was unhappy to see some young girls taunting and trying to get close to a couple of sea lions on one of the rocks. The lions kept getting agitated and making biting gestures toward the girls (which I don't blame them for doing), but the girls wouldn't stop and the parents just stood by watching. Good way to provoke an attack.\nShow less"], ["Reviewed April 6, 2017", 5.0, "Adorable", "Lots of sea lions (or water sausages as my son called them) to see. The pups were nursing, so precious. You can also walk out on the manmade wall and dare the waves to splash you. Just know that the bacteria level in this area is high, so no swimming. Easily our most fun outing, and it was free!\nShow less"], ["Reviewed April 5, 2017", 5.0, "Right there with Nature!", "What started as a man-made beach cove for children and families to play in quickly turned into a sun bathing and relaxing spot for all of the amazing sea lions of the area. It is amazing to see these animals lounging about, and there are quite a lot of them! There are multiple different vantage points to view them, and even a smaller pier/walkway that heads around the cove from another angle. There's a bit of a smell of course, but that comes with the territory of being so close to nature!\nShow less"], ["Reviewed April 3, 2017", 5.0, "Awesome sites of seals/sea lions.", "This is a great place to see seals/sea lions. Between Dec 1 and May 1, the beach is closed due to the pup season. People line up on the walls surrounding the beach watching the seals. Awesome visit with nature. There are bathrooms available but parking is difficult. Try parking a block or 2 away from the shore to find a spot.\nShow less"], ["Reviewed April 3, 2017", 4.0, "Spring break!", "Always fun, but fun finding parking is rough! The beach is not open until May due to the seals but if you go to the beach to the left you're good :)"], ["Reviewed April 3, 2017", 5.0, "Great place to see seals!", "We were hoping to see seals, and Children's Pool did not disappoint! There were adults and babies relaxing on the beach/rocks and playing in the water. It's a really beautiful spot to check out if you're in the area!"], ["Reviewed April 3, 2017", 5.0, "Great spot to see seals and sea lions", "Was jogging along the coast and stopped by here to go the the washroom. Realized that the seals were \"pupping\" and stopped to see the rocks turn into moving creatures. Was fascinated by the animals and brought the kids a few times later on the trips to learn more about these playful creatures.\nShow less"], ["Reviewed March 30, 2017", 5.0, "Seals", "Very beautiful place to visit! Seals were basking in the sun with their pups, flowers were blooming on the cliffs and it was just beautiful!"], ["Reviewed March 30, 2017", 4.0, "Seals Legally Own Children's Pool", "In spite of the donor's wishes, the city of LaJolla has sided with environmental lawyers to dedicate the Children's Pool to the seals who use it for sun bathing and as a safe place to raise their young. Children are not free to use the beach, but can get an overview from the cliffs above or the walkway by the ocean.\nShow less"], ["Reviewed March 30, 2017", 5.0, "Such a wonderful sight !", "Although we had seen the sea lions at SF Pier 39, it was such a wonderful and peaceful view when we decided to do a quick stop here. Well worth a visit if you are in SD."], ["Reviewed March 30, 2017", 4.0, "Was OK", "When we were there it was full of Seals - or Sea Lions - can't remember. Nothing spectacular - save you time and go to La Jolla Shores beach with the Family - 10 min. North of here - it's a beautiful swimming beach"], ["Reviewed March 29, 2017", 5.0, "Seals & Waves", "Depending on the season, there may be dozens of seals & pups lounging on the protected beach. Easy strollnorth ro La Jolla Cove, our south along the coastline with surfers and interesting rock formations. Kids and adults alike love it."], ["Reviewed March 29, 2017", 4.0, "Fun even when closed for seal pup season", "Took the family over to La Jolla during our vacation and really enjoyed Children's Pool. It was Harbor Seal pup season (runs thru May) so we couldn't go down to the water but the seals were everywhere. The walkway out along the rocks is an awesome view and you could sit for hours and enjoy both the seals and the ocean scenery.\nShow less"], ["Reviewed March 28, 2017", 5.0, "Beautiful scenery", "My friend in San Diego recommended this stop. It is a glorious spot. It is seal pupping season so the beach was full of seals and their babies. The water was busy with swimming, feeding and playing seals, many sunning themselves on the rocks. Parts of beach are closed during pupping season which is Dec 15 to May 15 but surrounding beaches are open. The view is spectacular. There is a narrow, rough walkway around the protected beach where seal watching is done.\nShow less"], ["Reviewed March 26, 2017", 5.0, "Great views", "You could not enter this area until May 15 due to nursing pups. But it was a great place to view the seal families. Moms were teaching their babies to swim. Very cute. You will get wet on the bridge"], ["Reviewed March 26, 2017", 5.0, "Sea Lions Everywhere", "We wanted to see the sea lions and we were not disapponted! How fun to be up close to so many of them. We enjoyed watching them swim and lay on the beach and sun."], ["Reviewed March 25, 2017", 5.0, "Cute seals and sea lions", "Loved watching the mommas and babies hanging out on the beach or coming in from the water. It was late afternoon when we went and they were mostly resting. One baby was feeding and several were frolicking in the calm waters. Amazing sight!"], ["Reviewed March 24, 2017", 5.0, "Can't miss this place", "I was so glad we made a special trip back one morning to see the harbor seals and sea lions. This place is beautiful and you can lose track of time watching the pups."], ["Reviewed March 21, 2017", 4.0, "Easy Wildlife watching", "Incredibly tolerant wild Harbour seals with pups, fab to see them swimming in the sea from the quay above."], ["Reviewed March 19, 2017", 5.0, "Great place!! Beautiful wildlife.", "Even though it was closed to people, for good reasons, it was so neat to see the wildlife and their babies!! It was a neat sight. We will be back! It's a great place to come see and enjoy. Sunset was beautiful."], ["Reviewed March 19, 2017", 5.0, "Sea Lions Pupping", "Visited the Children's Pool and got up close and personal with all the sea lions. Great spot to take kids and to see tons of sea lions."], ["Reviewed March 19, 2017", 5.0, "Spectacular views", "A must stop during your visit to San Diego. Our family was amazed at the number of seals on the beach. Very cool experience."], ["Reviewed March 17, 2017", 5.0, "Seal watching!", "We were in town for a conference and wanted to see the beach! Imagine our surprise when we found the seals! It was almost dark so the babies were resting but such a great, up close experience!"], ["Reviewed March 17, 2017", 5.0, "visit the seals in La Jolla", "This was a very busy place, but since we stayed across the street, we visited nearly every day. It is called Children's Pool, but it is a Seal Pool. Children (all people) are not allowed to swim in this area....it is a seal protection area. There are people selling items of clothing which go to the info@spiritoftheenvironment.org.\nWe were there during pupping season, so there were lots of cute little ones to watch along with their parents. There is a long walkway to walk out over the water, so we spent hours (no exaggeration) watching them. It is very tranquil except if a wave decides to go crazy and soak you once in awhile. Love this place!\nShow less"], ["Reviewed March 16, 2017", 4.0, "Great place to see new sea lion pups", "Walk the \"pier\" to peer at the sealions in water and on beach. We had the exhilarating experience of being deluged by a sneaky sneaker wave: never ever turn your back on an ocean even if standing on a solid structure! It was cold."], ["Reviewed March 14, 2017", 5.0, "Baby sea lions everywhere", "The Children's Pool was closed off due to all of the baby seals and sea lions there. It was wonderful to experience seeing the young ones with their Moms."], ["Reviewed March 13, 2017", 5.0, "Seals", "Seals and their pups line the beach and a great place to watch the seals play, rest, argue and swim ..."], ["Reviewed March 12, 2017", 5.0, "Wow!", "Early March provides the most wonderful opportunity to see seals and their pups lined up along the beach, not to mention the beauty of the area."], ["Reviewed March 11, 2017", 5.0, "Wow!!!!!!!!!", "You must visit. The view is amazing. You can het close to so many sea lions!!! You can walk down right next to them. The water is so clear!!! This is awesome!!!!"], ["Reviewed March 11, 2017", 4.0, "You'll see lots of wildlife.", "A popular location to see seals and other wildlife. Wander a bit south and the beaches are less popular and very nice."], ["Reviewed March 10, 2017", 5.0, "What a seal deal!", "From December to May the harbor seals give birth and raise their pups on the beach of Children's Pool. So these furry mammals who learn to swim in these protected waters of La Jolla can be watched for hours. And the price is right -- free. Seals like salmon go back to their place of birth to give birth to their offspring. At the same time the adults haul out on the beach and molt or change their fur coats. The only hassle is finding parking along Coast Blvd. or nearby to enjoy this annual event. .\nShow less"], ["Reviewed March 10, 2017", 5.0, "Memorable experience", "Where else can you get so close to sea lions in their natural habitat? I was 2 arm's lengths away from a baby and her mom. Many of the babies were feeding on their moms. Definitely a memorable experience.\n\nParking can be a challenge, but we kept circling until we found someone go out.\nShow less"], ["Reviewed March 9, 2017", 5.0, "Lots of harbor seals and their pups", "We recently visited the area and got to see the seal pups that were only months old with their mother. The waves are beautiful and the sunset is amazing in this area."], ["Reviewed March 7, 2017", 3.0, "Lots of rocks and places to explore", "Lots of little coves and rocks to jump around and explore. Not a great swimming beach. Good views for sunset"]]}}