{"Chinatown": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Chinatown", "url": "/Attraction_Review-g60713-d108679-Reviews-Chinatown-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/34/72/78/chinatown.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "5603"}, "address": {"@type": "PostalAddress", "streetAddress": "Grant Avenue", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94108", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Loved it!", "When visiting a new city I always check out their Chinatown area and this is one of the best. The area is very colorful, with the beautiful store facades and the lanterns hanging overhead. There are many, many shops and restaurants to choose from, and alleys to explore. If visiting, I highly recommend doing the Fortune Cookie Factory and the Golden Gate Bakery and try one of their popular Egg Custards...\nShow less"], ["Reviewed yesterday", 4.0, "Cool Neighborhood", "Very cool authentic Chinatown neighbor hood. I really enjoyed walking through it, window shopping and eating."], ["Reviewed 2 days ago", 3.0, "Chinese New Year Parade let down", "The day of the parade, we walked through Chinatown. Streets were blocked off for pedestrians only so that was nice. There were tents with vendors and free giveaways but the lines were very long and all in Chinese. It was fun to see the bustle of the crowds. Chinatown is full of kitschy stores with lots of stuff. I didn't like dumplings we had but my husband thought they were average. We visited the Tin How Temple that is tucked away in a side street. It is on the top floor. Very small and not what we expected. We can say we've been there. We left for lunch and a break before heading back to see the New Year Parade that evening. We were very excited about seeing it and had a good viewing spot near the beginning of the parade on Market Street. This was not the best parade we have seen. The timing was off so there were long gaps between floats or participants. There was a lot of repetition in performers, many martial arts, ribbons, and small dragons. Lots of spectators left before the end of the parade. We stayed because we wanted to see the 288 foot dragon. That was fun, with lots of firecrackers. Due to the poor timing of the parade we actually got to see the dragon for quite a while. It kept circling around the street waiting to advance. Perhaps in Chinatown proper it is more exciting to see, but for us it was quite a let down. But, we can say we were there and saw the dragon.\nShow less"], ["Reviewed 2 days ago", 3.0, "Worth a visit but parking is an issue", "We went during the new year celbrations so it was very busy. Kind of place you feel you have to visit but dont be too dissapointed if you miss out. Its mainly shops selling there items. We did not eat, we wanted too but the cost of parking our car in the nearby car park would have cost more then the meal.\nShow less"], ["Reviewed 3 days ago", 3.0, "Went during the Chinese New Year celebration", "Didn't really get to see much as there were hundreds of people down the street. There were street vendors and carnival rides for little kids. Would like to go back sometime when the place isn't so busy."], ["Reviewed 3 days ago", 4.0, "Bigger than NY, but w/o the charm", "Admittedly I'm a New Yorker asnd biased, but while SF's Chinatown is bigger it doesn't have the character of NY's. It does have the Golden Gate Fortune Cookie Factory though."], ["Reviewed 3 days ago", 4.0, "Steep streets. Small shops. Busy. Fun. Food.", "Walked through China Town a few times. Lots of small shops, marketplace, fruits, vegetables and daily life. Nothing extraordinary just daily life, in it’s own simple beauty. Very steep streets walking from Harbour are up to Nob Hill. Try cable car ride if you can get onboard.\nHint: At Nob Hill find the CableCar Museum. Free. Fun to see. Active museum.\nShow less"], ["Reviewed 4 days ago", 4.0, "Experience another culture", "Not many cities can claim to have their own Chinatown within a city and San Francisco has one of the largest. It wonderful to stroll the streets and hear Chinese spoken, foreign signs on the builings, and authentic architecture. Experience the culture w/o having to travel through the music, the food and the festivities. Chinatown is one big celebration!\nShow less"], ["Reviewed 4 days ago", 5.0, "Reminded us of Hongkong", "We loved Chinatown! It brought back memories from HK. Chinatown in SF is a good alternative to fill the Asian void..."], ["Reviewed 4 days ago", 5.0, "A must tour in San Francisco", "I wasn't interested in visiting the first time in San Francisco. This time we were with friends and it was a group decision. We had so much fun there. It was a total experience and it gave a real feel for the Asian culture. We spent the whole afternoon walking around and discovering new and interesting things. Please go on your next trip to San Francisco.\nShow less"], ["Reviewed 4 days ago", 5.0, "Love this place.", "For a tourist attraction it is very authentic to Chinese culture. Lots of shops restaurants herb shops grocery stores with things I'm sure you've never seen. To be honest it's quite cheap compared to the rest of San Francisco. All the shops are competing with one another so you can haggle\nShow less"], ["Reviewed 4 days ago", 5.0, "Dim Sum Adventure", "China town is a lot of fun and has such a selection of delicious Dim Sum! Lots of hills in this area but worth the walk around this special area. Lots of choices of places to eat and shop."], ["Reviewed 5 days ago", 4.0, "Cheap stuff", "This Chinatown is relatively small, but has all that you can expect from such a place: cheap Chinese food, cheap haircuts, small stores that sell almost anything that you can imagine, yoga/zen/meditation centers and noise.\nIt gets really crowded on Saturday where the sidewalks are covered with vendors.\nIt is located close to Little Italy and the Financial District and do not expect to find street parking anywhere.\nShow less"], ["Reviewed 5 days ago", 5.0, "Fun Chinese New Year parade", "I've lived in the SF Bay Area for almost my entire life and finally went to a Chinese New Year parade. I highly recommend it if you have a chance. It was a lot of fun! Lots of dragons, lion dancers, drummers and firecrackers."], ["Reviewed 5 days ago", 4.0, "Fortune cookies", "Stop by Grant and Jackson get your fortune cookies. They will give yoo sample. For .50 you can get your picture with the lady."], ["Reviewed 5 days ago", 4.0, "Lovely for a stroll", "A nice walk through Chinatown browsing in the shops is a lovely way to spend an afternoon. We were there just after Chinese New Year so there were plenty of decorations still up.\n\nSome gorgeous things in the shops (and tat too!) But definitely worth a browse to find cheaper deals.\nShow less"], ["Reviewed 1 week ago", 3.0, "Largest Chinese Community in the United States", "Relatively clean, this bustling community is the largest Chinese community in America. I recommend you walk through this are and sample the food, sights and smells. It's very interesting and loaded with shops that sell very unique Asian gifts."], ["Reviewed 1 week ago", 4.0, "Interesting", "Bustling place to stay. Great places to eat, really cheap. Buy cheap fruit. Transport easy to catch."], ["Reviewed 1 week ago", 2.0, "Tourist City", "We walked a couple of blocks into the area and were disappointed that it was all purely tourist stuff. Junk for sale straight from, well, China!"], ["Reviewed 1 week ago", 4.0, "Neat area to walk around", "I walked through Chinatown with a few friends one afternoon and we really enjoyed ourselves. We had lunch, then I picked up a lot of souvenirs for my daughters. (Fabric wallets, umbrellas...etc.)"], ["Reviewed 1 week ago", 2.0, "Gates", "The only part worth seeing are the entrance gates. We visited in the morning and looked through some stores. We took a few pictures and left. We didn't eat there, but the restaurants appear authentic."], ["Reviewed 1 week ago", 5.0, "Amazing.........", "An abundance of colour, smells and photo opportunities. Chinatown is such a vibrant place to be. There are vegan restaurants here, so everyone can find suitable eats."], ["Reviewed 1 week ago", 5.0, "Favorite are to walk through", "This is one of my favorite areas to walk through in San Francisco. Very interesting architecture and shops, with restaurants serving amazing food. We've been here twice and in the Washington, D.C. Chinatown; I love San Francisco more!"], ["Reviewed 1 week ago", 4.0, "Lights, Color, Noises & Smells!", "Take a mini trip to Asia by visiting Chinatown! I loved browsing the shops for bargains and unique items. It is always a bustling area and you feel like you are immersed in an Asian country (with the exception of some menus and signs in English). So much great food, whether a sit-down upscale restaurant or a little dim sum joint. If you are there in February, do NOT miss the excitement of the Chinese New Year Parade!!\nShow less"], ["Reviewed 1 week ago", 5.0, "Shopping", "Super busy when you are visit here in the day time. There are all wholesalers right around here . Gift shop - dry food from China , Gold shop and anything.\nThais people call “Sampheng and Yaowarat “ China town is the old Market in Bangkok. So much fun all day and night time. PS. Take bus &taxi the best way to get here.\nShow less"], ["Reviewed 1 week ago", 4.0, "Not all Chinatowns are created equal", "Great place to stroll through, some neat shops and interesting attractions. I’d visit this area again."], ["Reviewed 1 week ago", 4.0, "Culture", "This is truly Chinatown, San Francisco has a huge Asian population and this is a reflection of that culture, this is not New York fake purse Chinatown. Very friendly and lots of shops. We did not take a walking tour, but I have friends that said it made their trip.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun and interesting", "A lot of good stores and food. Nice spot to walk around, it is a lot like China towns in other cities but still fun. Good Vietnamese food"], ["Reviewed 1 week ago", 5.0, "Never Disappointed", "Finally was able to take my husband to Chinatown and it did not disappoint. First day of the Chinese New Year and there was an afternoon dragon walk which is always fun to see. The stores and helpfulness of others is bar non. Ask anyone and they will direct you to the next spot to be enjoyed.\nShow less"], ["Reviewed 1 week ago", 4.0, "Lucky stop", "Lots going on here. We were lucky enough to go on a Saturday where there was some kind of street festival going on. Very cool shops and really makes you feel like you’re not just in San Francisco"], ["Reviewed 1 week ago", 5.0, "So much to see", "It’s Chinese New Year today and every where were lanterns The hustle of the city and the store fronts and the restaurants could easily take me a whole day of I had the time. Wish I spoke some Chinese as it would have been even more fun. The people were so friendly.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun to Visit China Town", "While we were in San Francisco we spent half a day in China Town. From the time you walk into the dragon entrance you defiantly walked into China. The structures are beautiful and there was defiantly a festive buzz in the air. We went in February and just a few days from Chinese New Year so there was all kinds of activities going on. I highly recommend finding the Fortune Cooke Factory and watch the older women make the cookies. You can sample and buy cookies here. As well we found this was the best place to buy Souvenirs for everyone. We stopped in a Little House of Dim Som - we got two plates of food (plates stacked full) and it only cost us $8.00. Walking around there were areas that were like a farmers market where you could buy fresh produce inexpensively and it looked good. You can also catch the Cable car from China Town down to Fisher mans Wharf.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Nothing special", "Nothing amazing to see here. Lots of gift shops all selling the same things. We walked through and walked out again"], ["Reviewed 2 weeks ago", 5.0, "Can’t get more authentic than tbis", "Wow! What a neat place. Lots of great dining places and unique shopping. Be prepared to walk the hilly streets though. We liked it here. Compares to Toronto CA Chinatown. A must see experience while in San Francisco!"], ["Reviewed 2 weeks ago", 4.0, "Atmosphere - eh, Food - 👍🏼👍🏼👍🏼!!!", "While the atmosphere in Chinatown can be rather unpleasant, the sensational food makes up for it. Disgusting pictures, smells, and loud sounds may be prevalent, but the food makes up for it by far!"], ["Reviewed 2 weeks ago", 5.0, "I love China town!", "I can’t say it enough! I just LOVE China town! I mean how can you not?! Fun cheap stuff, good food, good oriental food shopping for those hard to get and favorite items and beautiful views! The people in the stores tend to follow you around because of the theft problems they have, but not stealing anything so we don’t take offense to it. Something fun in every shop! Found my fav colorful fish chips that I get at our local Thai restaurant as a appetizer for only $1.25 a bag, fun candy for the kids that they have to make that look like sushi and doughnuts , pho making broth and noodles, toys for the kids and sooooo much more! Never can go wrong going to China town! Such an adventure and always find something new! Can’t wait to return!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Chinese New Year", "We got lucky and happen to catch the Chinese New Year festival taking place in Chinatown. Lots of performances taking place and got to enjoy some dancing Dragons. I'm not sure what this place is like on any other given day but there was a lot of authentic Chinese restaurants and plenty of fresh fruits and vegetable stands. Cool architecture with a heavy Asian influence and hanging lanterns everywhere. It's definitely worth a visit if you enjoy Asian culture and cuisine.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A lot of historical here", "This is a very touristy but fun spot to visit. We took one of the free tours provided by the library and learned a lot about the history of the area. We were surprised to stumble upon the local Tai Chi school training in the local park. This is a definite must visit spot when in San Francisco.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Hasn’t changed too much", "I love to visit Chinatown whenever I visit SF. It is not much changed in 40 years. I love the food and the atmosphere in this neighborhood. Dim sum is a must have experience each time we go."], ["Reviewed 2 weeks ago", 5.0, "Great place to visit.", "Chinese markets, restaurants galore. Spend some time walking around here and have a bite to eat at one of the many restaurants."], ["Reviewed 3 weeks ago", 5.0, "drive by", "walked through the food stalls it was crazy crazy busy full pavements of stalls ... though it busy you have to walk it"], ["Reviewed 3 weeks ago", 4.0, "Great location to stay in", "This area was great to stay in. It is relatively close to a lot of attractions throughout the city. Many Uber drivers in the area as well. Felt safe walking In the area at night."], ["Reviewed 3 weeks ago", 4.0, "Great place to mix with the local community", "We spent an afternoon strolling through the streets of china town, its a great little neighborhood, the tourist to local ratio is perfect, we really got wrapped up in the local hustle and bustle, so much to see, so much delicious food to try and overall a great 2-3 hour walk.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Interesting.", "Stopped by to check it out and was shocked at how busy it wasn't. I stopped by the archway. My biggest disappointment was how many people were trying to push their restaurant on you. It reminded me of Vegas but with food instead of clubs. Go for the experience and to say you were there!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great neighborhood", "This was a fun neighborhood to walk around. Lots of cute shops with Asian goods and just lots of pretty decor to enjoy on your stroll. There’s even a fortune cookie factory tucked away on an alley that is worth checking out if you can find it!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Worth a walk through", "It is definitely worth a walk through. Cheap gifts, people-watching, cool decor and authentic Chinese food."], ["Reviewed 3 weeks ago", 4.0, "Step into a Chinese community where the atmosphere never changes", "Chinatown never seems to change over the past 40 years. Some shops and restaurants may change but the open market, restaurants, bakeries, and the Chinese language will always be there. You can find Chinese restaurants, Dim Sum, roasted ducks/chickens, and souvenirs. This is truly a \"go to\" place when in San Francisco. Parking is next to impossible on the street but at Portsmouth Square it is possible. Spend all of your time walking to experience Chinatown at its best.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Just like any Chinatown", "There are real Chinese with real Chinese food. Everything is in Chinese on the boards for food but you can ask in English. Hint, read the numbers,they are usually prices."], ["Reviewed 3 weeks ago", 5.0, "With my daughter, son-in-law, and grandsons!", "Got off our hop on hop off bus to visit this interesting area. This is where the Chinese live, it is not set up exclusively for tourists so don’t expect that! I love to see how other cultures live and I really enjoyed this experience. My grandsons aged 4 & 6 played at the playground near the Chinese Cultural Centre. I love how children have no prejudices they just interact as children. The streets are colourful and looking into the shops very interesting especially the ones specializing in herbal medicines. We watched fortune cookies be made. Grandson had a haircut, had lunch, bought some herbs to help with various conditions and took lots of photos! Be open minded and enjoy the experience! Observe and learn about others.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nick-knacks galore", "A great place to find a bargain, people watch and good Chinese food. Walk around, buy some souvenirs, listen to some street musicians, enjoy yourself."], ["Reviewed 3 weeks ago", 4.0, "A glimpse of Asia", "San Francisco is a city foul of Asian immigrants and its Chinatown one of the biggest in USA.Every visitor must go there and admire Asian architecture and lifestyle.You may found something interesting at the numerous shops."], ["Reviewed 3 weeks ago", 5.0, "Like visiting another country", "Chinatown is a different world. A fabulous walk with great places to eat and shops to look around in. The smells are different. The food is different. And the items is stored are from what I call the old China. It was the best part of San Fransico along with Coit Towner and Fisherman’s Wharf.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Nothing special", "It is a little China but really not pretty or special. You can buy a lot of plastic stuff and it is dirty."], ["Reviewed 4 weeks ago", 2.0, "I expected more ...", "Unfortunately the streets are unkept, dirty, we didn’t feel safe. Maybe because so many people say so many good things we expected more..."], ["Reviewed 4 weeks ago", 5.0, "Authentic China", "If you want to experience Chinese culture without going to China then this is the place for you. Authentic restaurants abound, stop at one that looks good and enjoy food unlike any you’ve had. It’s just a fun place to spend some time."], ["Reviewed 4 weeks ago", 4.0, "was an lively place and a nice stop in our Hop on hop off bus", "visited, shopped, had coffee and its a nice colorful experience, the gate is also very nice and easy to recognize the start of this neighborhood."], ["Reviewed 4 weeks ago", 5.0, "GO HERE", "This is the best Chinatown I've ever been to. So many places to eat and drink and I loved experiencing the hustle and bustle of the residents up and down the streets buying their market produce. Great value and beautiful part of town!"], ["Reviewed 4 weeks ago", 4.0, "Always Interesting", "As one of oldest communities in US a walk through Chinatown is a must. Lots of interesting shops, restaurants, massage parlours, community centre and spiritual places. You get a great feel of the mix of the community. I entered a store which was having a closing doen sale and was agressively pounced on to purchase something. This unnerved me, so made my exit. It did deter me from entering sny other shops. A great place to potter around and recommndd.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "San Francisco Chinatown for ever changing", "We parked in the garage located on Kearney St and upon exiting we were in a small plaza with elderly men playing cards games. We walked the main streets visited a number of shops. Mostly tourist ones. We ended up in Stockton Street where there are still assorted Chinese grocery stores with fresh vegetable and fruit. Fish markets too. We stopped by one of the bakery's and bought some items. Very good pork buns. We also made a stop at one of our favorite places for fortune cookies. The GoldenGateFortune cookie on Ross Alley. You can watch them make the cookies and how the paper fortune are inserted in to the cookies. I buy the flat cookies without the fortune. You can see that things have changed over the years, but still a nice area to tour.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Changing", "China town is changing. Many places visited in years past are gone. Have spent a lot of time and money in China town but where did everybody go?"], ["Reviewed January 24, 2018", 5.0, "Spend a whole day here", "So many shops, so many restaurants. I love and hate China down. You can spend a whole days here and buy the cutest gifts. And you can’t go wrong with the food."], ["Reviewed January 24, 2018", 5.0, "Always fun!", "We spent most of our day here, shopping and walking around. Souvenirs of every kind. Great restaurants as well."], ["Reviewed January 23, 2018", 3.0, "Visit Chinatown", "Only a few blocks full of stores with Chinese products and some restaurants. The fortune cookie store was worth it. I would return only for that. The food we ate was nothing exciting."], ["Reviewed January 23, 2018", 4.0, "Biggest Chinatown in North america", "As someone who has travelled in China, i can say that many of the streets look a lot like the real China! Similar shops and smells!\n\nIt’s a nice walk through... also a nice place to get cheaper San Francisco souvenirs and great Chinese teas!\n\nMy highlight was the fortune cookie shop - you can see a lady making the cookies by hand!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Chinatown is a nice stroll and cultural experience", "I was in San Francisco Chinatown this past Saturday(1/20/18). I think before going to Chinatown plan your trip right. Bring a jacket if planning to stay for the evening (winter time), bring comfortable walking shoes (some uphill and downhill walking), bring a carrying bags for food or merchandise purchases. think about parking, some parking garages or street parking. I parked in a garage on 170 Columbus Ave, San Francisco, CA 94133 after 3:00 pm $10.00 all day (Saturday) Just off Jackson st.. Nice starting point. easy to find after a long walk. Get a map. Always remember where you parked(important) it can be a maze of streets once you get into the market and business streets.Had a great time in the Dim Sum markets, merchandise stores and bakeries and restaurants and taking in the sites of cultural Chinatown (Plan on at least 3 hours or more). They are getting ready for Chinese new years. I took a cool picture with wall mural painting of Bruce Lee (see pics) on Jack Kerouac Alley and grant ave (Applemeister 1142 Grant Ave,). I am a huge Bruce Lee fan. I like the Dragon's gate Grant Ave and bush St. for the landmark picture. Some streets are well decorated with hanging lamps and buildings with Terra Cotta Soldier statues (see pics). Really had a great day. Start later in the day and stay for the evening night walk. Lots of the street vendors for vegetables and fruits are usually open in the morning and daylight hours. Restrooms in some dim sum markets and restaurants. If you buy something use the restroom. Your day activities depends on what you want to do. Hope this review helps and enjoy!! I Did.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Now This Is Shopping", "Everywhere else in the city jacked the price up for tourist. Chinatown is still the place for great deals on shopping and just as good on food. For the real deal Chinese food, this is the only place to go."], ["Reviewed January 21, 2018", 4.0, "Enter Chinatown via The Dragon's Gate", "Chinatown is like most Chinatowns of the world and lots of fun to hunt down bargains, souvenirs and of course look for a moon cake and steamed pork bun. Escape into the stores and look for a bargain. Stop into Eastern Bakery about 4 blocks in on the right after the gates for a snack too.\nChinatown short stroll from Union Square area also.\nShow less"], ["Reviewed January 21, 2018", 4.0, "A classic of SFO", "I always go there. The stores are fun, the restaurants are good. You can find OK massage places and overall its a nice area to stroll and just discover."], ["Reviewed January 21, 2018", 4.0, "Grant Avenue, Golden Gate Fortune cookies, Chinatown Alleys and more", "Golden Gate fortune cookies 'factory' is tiny but worth a visit to watch them masking fortune cookies by pouring dough into shaped griddles which are then baked on a conveyor belt. the 'fortune' is then put inside the mould before it is folded. I didn't realise before this visit that fortune cookies don't come from China, they actually originated in the Japanese Tea garden in San Francisco in 1909. If you want to take a photo of the lady folding the cookies, then you need to pay a dollar.\nAfter leaving the cookie factory we then ventured into Chinatown Alleys, full of old fashioned stores and small restaurants and the \"Street of Painted Balconies\" - just look upwards and you'll understand where the name comes from.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great for a wander", "A tour guide will tell you take a trip to Chinatown. We liked the painted graffiti on the walls, with Bruce Lee featuring in a few places, lots of tourist shops, restaurants and a nice atmosphere."], ["Reviewed January 18, 2018", 5.0, "Cool Place", "Cool place, great bargains and amazing food. People were really nice too. Great art murals as well. Must go to when in San Fran."], ["Reviewed January 18, 2018", 3.0, "Disappointed", "Very commercialized. Could find the same thing in every store. Definitely catering to the tourist. Liked Vancouver Canada Chinatown better!"], ["Reviewed January 18, 2018", 3.0, "souvenir shopping", "It is just an average chinatown. They have a ton of stores for souvenir shopping and very close to union square"], ["Reviewed January 14, 2018", 1.0, "Yuck", "The scenery was cool, but it seemed to me like a line of Chinese themed dollar stores. The one place we went to that my wife wanted clothes at, the lady followed us around like a vulture trying to get us to buy like 10 outfits for our daughter. Just a very underwhelming experience.\nShow less"], ["Reviewed January 14, 2018", 4.0, "A SF must see", "With every visit to San Francisco, we routinely walk through Chinatown and typically have a snack or a full meal. This trip was no different and, as in the past, enjoyed our time strolling up and down the many colorful streets. When all is said and done, our only complaint is the impossible number of restaurants to choose from. But this is part of the fun in that we try a new restaurant with each visit.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Walking around the neighborhood", "A lot of nice shops to browse through. If you are looking for souvenirs this has it all. Large range of prices. Restaurants to try out and tea houses."], ["Reviewed January 11, 2018", 1.0, "The worst place i visited in SF", "I was very excited to visit chinatown but totally regret doing so\nThe streets are not very clean with litter everywhere on the floor and smelly garbage all around.\nMost of the restaurants there looked unclean and definitely wouldn't try eating in them\nNothing really interesting to see or do, just a lot of grocery stores so unless you would like to try out strange fruits/vegetables/spices then i wouldn't recommend wasting your time there\nShow less"], ["Reviewed January 10, 2018", 5.0, "A great place to walk, buy and eat.", "China Town is another gem of San Francisco. It is a great place to walk, shop and eat. Lots of great shops with unusual items. It pays to look around and compare prices. China Town is always busy with deliveries and quick walking locals doing their daily shopping. The markets with whole smoked chicken, squid, fish on ice and live fish and turtles are amazing. It is a great place to briefly step into a different cultural environment. Be respectful and you will have a great time.\nShow less"], ["Reviewed January 8, 2018", 4.0, "\"Leave it alone Jake!, It's Chinatown!\"", "Sorry, couldn't resist quoting the movie, but it's great! Chinatown is heaps of fun and there are lots of great places to eat, but the main reason for going here is the shopping. One of the very few reasonably priced places in San Francisco these days. If you're looking for your souvenir magnet for your fridge or a cheap t-shirt, this is the place to find it. Check it out on your visit.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Chinatown with Simply Amazing", "Why you're walking through Chinatown you really think you're in China I really enjoyed the culture iJoy the atmosphere the music and the people it was simply amazing however there was plenty of walking to do and if Mobility is a problem this might not be for you. You cannot leave San Francisco without touring Chinatown after my experience there I think I would like to go to China.\nShow less"], ["Reviewed January 7, 2018", 3.0, "Quite Like Beijing", "San Francisco's Chinatown is quite like Beijing...in that it is pretty dirty and overwhelming. However it is a fun way for people who have not been to China to imagine themselves there. There are plenty of shops selling souveniers and some pretty good restaurants as well. We went at night and it was fun to see the street lanterns aglow. We ate at the Great Eastern Restaurant and were not disappointed.\nShow less"], ["Reviewed January 6, 2018", 5.0, "So Cool", "This place was so so so cool! Make sure to check out the fresh fruit, veggie, and sea food markets they have after 10 am. There are murals in tons of alleys as well. Such a beautiful little city within the city!"], ["Reviewed January 6, 2018", 3.0, "No very different from other China Towns , worth if you haven’t visit one or eat good Chinese food", "Very commercial, good places to shop Chinese things, a great variety , several choices for eating . Wear comfortable shoes to walk in the area. At night is not a lot of people walking around, so I think not very good for you to be alone\nShow less"], ["Reviewed January 5, 2018", 4.0, "Cheap things found there", "If you want Chinese cheap things then this is your place. I bought tea and chopsticks. You can find cloth, home decorations, tea, sweets, coffee, gold and many other things. The tea was delicious. The other things were cheap but I cannot comment on the quality.\nShow less"], ["Reviewed January 4, 2018", 3.0, "Same as any China town around the world", "Nothing special. Another dirty China town. If you have been to one anywhere in the world you don’t need to go here. There are too many beautiful up scale places in San Fran to waste your time there."], ["Reviewed January 3, 2018", 4.0, "Great way to spend an afternoon!", "We came here to do some shopping and have lunch. I found some great inexpensive souvenirs for my kids and our lunch was delicious. We tried some desserts from one of the bakeries and they were also very good. All in all, a fun afternoon. There’s lots to see here.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Stockton Street is where the action is", "Similar to streets in Hong Kong and street markets in Beijing, Stockton street is where the locals to there shopping. Of Stockton and the East-West streets (Sacramento, Clay and others) are little alleys and parks to explore. Laundry hangs in the windows. Chinatown is still very poor and crowded.\nShow less"], ["Reviewed January 3, 2018", 3.0, "A Little Seedy!", "You need to stay close together here. Lots of shady pan handlers. Not an area to bring small kids. Interesting how they hang their clothes out to dry from the windows. Didn't want to eat here."], ["Reviewed January 2, 2018", 5.0, "INCREDIBLE!", "If you haven't been to San Francisco's Chinatown, then you need to go. Now! What a neat place. Many different shops, souvenirs, food, grocery, tea, etc. When my stomach told me that I was hungry, I started looking for something that maybe just the locals went to. Boy, did I find just that! Although the name of the place evades my old memory, they're know for their specialty, a fish that is served to you alive. Yes, alive. No, I did not try it. I stuck with my old standbys, friend rice and some noodle dish. I had a ton of fun exploring Chinatown!\nShow less"], ["Reviewed January 1, 2018", 3.0, "Very Busy Area", "Busy making it hard to stay on sidewalk. Chinese ingedients all sold on street. Inexpensive Chinese items as well. Not my cup of tea but worth seeing"], ["Reviewed January 1, 2018", 4.0, "Nice walking tour", "Hadn't been to San Francisco's Chinatown in 15 years. Walked through it going from Fishermans wharf to the Embarcadero.\nMaybe it's my memory, but the district seemed less vibrant than before. We did get to eat at a good Chinese restaurant there, and enjoyed the walk through the district.\nShow less"], ["Reviewed December 31, 2017", 3.0, "Worth seeing. Different to Sydney China town. Less restaurants.", "Not better than china town in Sydney. Worth seeing but not better that SYDNEY chinatown. Lots of cheap buys."], ["Reviewed December 31, 2017", 4.0, "Fantastic", "We have spent a lot of time here on our latest visit to San Francisco. After completely missing it on our first visit we are making up for it this time. We have enjoyed the shopping for Asian antiques and treasures as well as some amazing food outlets. We are staying close by in Powell Street and enjoy the walk there and back. At present there are a lot of retailers having big sales or closing down so there are bargains everywhere. We only wish we were in a self catering apartment so we could buy some of the amazing fresh produce we have seen. The shopkeepers are so friendly and the atmosphere is great. So lovely to see the history and culture of the old San Francisco alive and well today.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Food a must, read other reviews !!!", "Check out trip advisor for best food tips and you will not go wrong. Can’t remember where we went but trip advisor reviews proved to be so true! Shopping for tourist gifts was a lot of fun."], ["Reviewed December 31, 2017", 5.0, "Fun and fabulous", "Just walk down Grant Street from the dragon gate on the Union Square side of Chinatown. Many fabulous restaurants and gift shops that will entertain young and old. One of the only places in California to get fireworks every day of the year. Many many interesting sites.\nShow less"], ["Reviewed December 28, 2017", 4.0, "Interesting to stroll around", "For the most part this area was flat which was a welcome change from SF's hills! Great little spot to grab cheap gifts and food."], ["Reviewed December 27, 2017", 5.0, "Go where the locals go....", "Chinatown....a place where you will find fresh produce, fresh fish, hole in the wall street food, authentic asian cuisine and bakeries!\n\nThe smell of ancient spices and fish fill the air in this compacted neighborhood. If you see a line....stand in it! It’s obvious the locals know what’s good!\nShow less"], ["Reviewed December 27, 2017", 5.0, "Lots to See", "Unique trinkets, carving, jewelery, food, and fad items -- \"head massager\", anyone? -- plus the atmosphere of real Chinese marketplace serving a large Chinese population. Good reminder that lots of varied communities make a city."], ["Reviewed December 27, 2017", 4.0, "Chinatown", "A real eye opener. We loved our visit to China town and bought some of the obligatory tacky gifts. Picked up some gorgeous dim sum from a little take out place."], ["Reviewed December 23, 2017", 5.0, "Fun for All!!", "Lots of fun thing to buy and plenty of restaurants to eat at. Also some great tea shops you can sample wonderful teas."], ["Reviewed December 21, 2017", 3.0, "Touristy", "Lots of shops with the same tourist stuff. Good restaurants everywhere although not exceptional. A couple hours of shopping was about all our group needed"], ["Reviewed December 21, 2017", 4.0, "Experience Asia at the heart of San Francisco", "Spent an entire afternoon, leisurely strolling through the crowded street of China town. It was a short ride in cable car from union square. There are also several busses that plies this route. It was an interesting sight: streets are full of Asian grocery shops, wet markets, eateries, meat shops and shops selling Asian utility items. Whole place was fairly crowded, people, mostly Asian buying their groceries or food items. Though the name is China town, I could spot shops selling Thai and Philippine stuff as well. I had lunch at a Thai food restaurant, which was decent and authentic\nShow less"], ["Reviewed December 21, 2017", 5.0, "On the way", "My trip was really rich with events, flights, meetings, catch ups planned and ad hock. I didn’t manage to buy souvenirs and China town was the place solved the issue. I spend 10 minutes in some small store on the way to the airport at 8 am and was happy to complete SF with right feeling.\nShow less"], ["Reviewed December 20, 2017", 3.0, "Worth a visit, but can be overrated", "Tell someone you have been to San Francisco and they will ask you if you visited the Golden Gate Bridge, and then shortly after that they will ask about Chinatown. Chinatown is a unique, colorful, and loud place you should visit at least once. It's extremely touristy, so the streets will be crowded at most times of day. People are looking for some cheap goods and some Chinese experiences.\n\nYou'll find some interesting markets and shops. You have opportunities to try some things outside your comfort zone. It's a bustling place that you should go and try out. Walk around and see the sights and take the smells in. It's definitely worth a visit, but maybe not many return visits.\nShow less"], ["Reviewed December 19, 2017", 1.0, "Overrated.", "Regret to go there on the first day. Horrible Chinese food, streets are like wet fish market, gifts are old, dirty and badly kept, nothing to buy from there."], ["Reviewed December 19, 2017", 5.0, "Culture", "Chinatown San Francisco is huge! We walked around for about an hour and got to look at all the different things they sell and I’m pretty sure I would eat it. The seafood and fresh fruit and vegetables look delicious. We ate at New Asia for dim sum and it was pretty good. If you’re looking for something different to do and experience the Chinese culture you won’t be disappointed.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Largest Chinatown Outside of Asia; Gates Guarded by Chinese Guardian Lions", "Worth venturing through the impressive Gates into Chinatown. Notice the Chinese Guardian Lions, also known as Foo Dogs, acting as noble sentries. Restaurants with traditional Chinese food; antique, jewelry and novelty shops abound. Definitely worth the journey, as this is the largest Chinatown outside of Asia, with over 100,000 residents.\nVenture into Old St. Mary's, listed as a California Registered Historical Landmark. This was the first building erected as a cathedral in California. Originally built in 1853 by Chinese laborers with brick brought around Cape Horn, and granite mined in China, it was destroyed in the 1906 earthquake, and rebuilt in 1909, and presides high over The City. Chinatown has something to offer all ages.\nShow less"], ["Reviewed December 17, 2017", 5.0, "A must see in San Francisco", "Shops, dining, activities and incredible arts. There is something for everyone. Personalized fortune cookies down Ross Ave. What a great gift idea!!!"], ["Reviewed December 16, 2017", 3.0, "Meh", "I didn’t like it very much. Variety is there but it’s not so much lively as I had expected. Nonetheless you can buy stuff for cheap from here."], ["Reviewed December 16, 2017", 5.0, "FOOOODDDDD", "This is the biggest China Town in the country!! Lots to see and eat and eat and eat! Cheap food and lots of options."], ["Reviewed December 14, 2017", 5.0, "So much fun! Exciting !", "A true experience you do not want to miss. Great dinning from pennies on the dollar upwards to dine dinning. Lots of interesting shops. The merchants are very helpful and friendly ."], ["Reviewed December 13, 2017", 4.0, "Bargains abound.", "Walk the length of Grant street from downtown to Northbeach. Definitely experience Sa Frans Chinatown and don’t be shy to bargain. Great place to pick up those last minute souvenirs."], ["Reviewed December 13, 2017", 3.0, "Supersize Chinatown", "Pretty much just like any other Chinatown around the world but on a larger scale.\n\nInteresting to walk around, however it becomes quite repetitive as the stores don't differ too greatly from each other and all seem to sell similar items.\n\nThere's also plenty of street art adorning the walls and buildings, so it's a good photo op location.\nShow less"], ["Reviewed December 12, 2017", 5.0, "Fun to explore", "Walking around and enjoying the sites was great fun. Don't miss the fortune cookie factory with its free samples. So many options for lunch and shopping!"], ["Reviewed December 12, 2017", 5.0, "Great place to experience", "Visiting ChinaTown in San Francisco is a must. It gives you a good feel of how is to be in an asian country. They are many restaurants to choose from and many stores. We took a few minutes to stop at the Fortune Cookie Factory, which is a must visit when you are in S.F.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Authentic", "Take the streets past the trinket shops, there are apothcaries, fresh produce and dried items such as sea cucumbers"], ["Reviewed December 9, 2017", 2.0, "Tired and dreary", "We visited the Chinatown area of San Fran one mid week lunchtime.\nTo be honest we found it really run down, tired and unappealing.\n\nLots of businesses were closed up and the majority that were trading, pedaled cheap tack to the tourists.\n\nOur aim was to have a good Chinese lunch but the restaurants that we saw along the main street from the Chinese entrance gate looked totally unappealing, dirty and nothing drew us in.\n\nWe did not last long and jumped a taxi and ate elsewhere.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Another must do whilst in San Francisco", "Plenty to see here with several good places to eat. Some parts were in need of updating but overall worth the several miles we walked."], ["Reviewed December 6, 2017", 4.0, "Fun & interesting", "It’s an interesting area to stroll around for sure. Obviously lots of Chinese culture along with some great food options and tea houses with tea tastings-must try a tea tasting, really fun & interesting to hear the healing properties of each tea you taste. If you have a few days in SF I would fit this in for sure.\nShow less"], ["Reviewed December 5, 2017", 2.0, "Old and Dirty", "I was there in nineties and now... No more that magic place of exotic things that make you feel special... Now you can buy by Internet everthing and cheaper."], ["Reviewed December 3, 2017", 5.0, "Beautiful architecture and good shopping!", "I love going to Chinatown when I’m in SF. Great dim sum at the Great Eastern and fun shopping with not pushy salespeople. Most of the architecture survived the great earthquake. Very nice area and you must go!"], ["Reviewed December 3, 2017", 5.0, "Grand St is grand but Stockton st is China!!! Go there!", "Chinatown is fun but venture off grand and enjoy the real China town in Stockton. Buy you meat and fish here. Rabbits. Frogs. Live fish. Chicken hanging in the Windows. Fruit and vegetables - some you’ve never seen. A real delight."], ["Reviewed December 2, 2017", 5.0, "Great self guided walking tours here", "There is nothing quite like a self guided walking tour of Chinatown in SF. Stop and checkout the unique stores. We love Chinatown in SF way more than in Boston."], ["Reviewed November 30, 2017", 5.0, "Fab area", "Lots to see lots going on watch out for imitation goods but great place to look around friendly area"], ["Reviewed November 29, 2017", 5.0, "Like Visiting China", "We came here twice during our stay in San Francisco. Apparently it's the largest Chinese settlement outside China. The Chinese played a big part in the building of San Francisco and many decided to stay. This looks and sounds as I would imagine China would. Food, smells, sounds make you believe you are in China. Great place to visit if you are looking for an authentic Chinese experience when you are here\nShow less"], ["Reviewed November 29, 2017", 2.0, "Cheesy area", "The souvenir shops are so so cheesy , way to many people crowding a small area ! Lots of bars. Too crowded for me"], ["Reviewed November 28, 2017", 5.0, "Must Do While in San Fran!", "I love San Fran Chinatown. Great to explore and LOTS of shopping and dining experiences. I love just walking thru Chinatown streets. We made a point to be there Saturday morning hoping to get ahead of the crowds and that strategy worked and we enjoyed our day immensely.\nShow less"], ["Reviewed November 25, 2017", 4.0, "Explore!", "I love Chinatown. If you have a chance go early morning around 6:30 or 7am and find a little locals cafe for some great food and watch Chinatown come alive. In the afternoon there are tons of people, but I never feel unsafe and I love walking in and out of the little shops. If you walk in a place with a bunch of tourists, go someplace else\nShow less"], ["Reviewed November 24, 2017", 3.0, "Not bad, but most the stores are the same", "We wanted to include Chinatown in our visit to San Francisco as my wife was looking forward to the shopping and culture. It is definitely worth a stop, but could probably be done in an hour or less\nonce you realize that 90% of the stores carry the exact same stuff.\n\nThere were some really neat high-end art/furniture stores that were great to walk through, but most of the other stores were carbon copies of one another.\n\nI planned on stopping for some dim sum but we had eaten a huge breakfast so we skipped it, but there are plenty of places throughout Chinatown to stop for food if you choose - including a store that sells \"dragon's beard\" candy that was being made right there in the window.\n\nA bit underwhelmed overall. I wouldn't put Chinatown near the top of my list if we were short on time, but it is worth a quick visit if you have a few days in SF.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Visit!", "The biggest Chinatown outside China. The atmosphere, the smell and a lot of fantastic restaurants. Just visit!"], ["Reviewed November 21, 2017", 4.0, "One of the largest outside Asia", "The San Francisco Chinatown is one of the largest outside of Asia and one of the most densely populated areas in the USA.\n\nWe enjoyed strolling around this area and we found Chinatown quite by accident as we ventured a few blocks away from our hotel from the Union Square area upon arrival.\n\nThere was even a Chinese festival in progress. Lots of food options and Chinese gift stores to explore.\nShow less"], ["Reviewed November 20, 2017", 5.0, "It feels like Hong Kong", "Walking around Chinatown is like walking around Mongkok. You can buy everything in Chinatown and there are lots of souvenirs which aren’t expensive. Loads of good restaurants. Go to Portsmouth Park to see the older men play mahjong and doing tai chi in the morning. Love this part of SF\nShow less"], ["Reviewed November 20, 2017", 4.0, "An Interesting Experience", "Probably had my friend and I had a Chinese meal, this would have been a more interesting experience. We did have an overview of Chinatown on a tour, so we did know a little about it when we did a walking tour on our own. Most of the shops had all kinds of trinkets and cheap souvenir type stuff that doesn't hold my interest very long, but if you like that kind of thing, this would definitely be the place for you. I would classify the shops as mostly junk, but still it was okay...and now I've done that, but probably wouldn't put it at the top of my list of things to do in San Francisco.\nShow less"], ["Reviewed November 20, 2017", 3.0, "Old Chinatown", "Was really disappointed by the state of San Francisco Chinatown, very rundown and it feel like the early 80. With shops selling modern cheap stuffs. Plenty of food choices, good value for money. This place is only good for good chinese food, that's all."], ["Reviewed November 18, 2017", 5.0, "Colorful Chinatowm", "Shopping galore, great bargains, from diamonds to cheap umbrellas all made in...where else...China. If the shopping does not get to you, which it will...you must try the food...oh boy, plenty of restaurants.\nVisit the fortune cookie factory and wander thru the colorful alleys\nTake picture of the cable cars as they zoom by.\nPedestrian friendly\nShow less"], ["Reviewed November 18, 2017", 5.0, "One of the largest and......", "........most colorful Chinatowns anywhere (including China). Great food, interesting shops, great people watching, and lots of \"Kodak moments\"."], ["Reviewed November 18, 2017", 2.0, "A Royal Chinese tourist trap", "I have luved in Sanfrancisco most of my adult life and i have never seen more junk thats being sold in the stores on Grant ave in SF China town than any place on this Gods green earth than here . Probably no. 2 would be in Bangkok , Thailand on Sucomevet and Soy one in this 9 story shopping mall . When i came ti SF 47 years ago it always wasnt like this . It used to be quaint and a fun shopping experience to die for . I use to go into these stores on Grant ave to buy alot of fun and colorful stuff . lije Vases or furniture or jewelry . But now it has turned into a tourist trap of very expensive low and medium end junk all mass produced in China on some asembly line of slave laborers . Its really to bad . Becayse this makes a joke out of Sanfrancisco and its ambiance . China tiwn still has some great Chinese restaurants to eat at . I lice Chinese foods alot. . There is a place called Sam Wos on Grant and Washington street thats been there mire than 100 years that has really reasonable price food and flavorful too . I use to go there at 12 to 2 am to eat several of their plates of delectable chinese foods all for under $ 5.00 a plate . I loved it . This restaurant is a SF landmark . And its not a tourist trap either . Sanfrancisco has turned into a cheap Las Vagas. Rip off joint without the barkers . It didn't use to be this way .Urs a real crime that this gas happened here .Urs a reflection on how this city is being run . For real . Bye for now and happy traveling .\nShow less"], ["Reviewed November 17, 2017", 4.0, "Feels like you’re in another city", "We walked there after getting off a cable car ride. It does feel like you’re in another city! Very cool to look at and take some pictures. We didn’t buy anything but there were many shops. It is kind of dirty though - there was a lot of trash in the streets.\nShow less"], ["Reviewed November 17, 2017", 4.0, "A little over rated", "I expected more authenticity in San Francisco’s Chinatown., instead there were shop after shop of “new” Chinese Antiques, filled with copies of Murano glass made in China, all owned by Russians. Little evidence of real Chinese or Chinatown. Disappointing"], ["Reviewed November 16, 2017", 3.0, "1996 - Crowded Streets", "It is quiet in San francisco at the moment but not in Chinatown! I had a wander through the streets here for about half an hour before heading down to the waterfront. Not much to interest me personally. 1996"], ["Reviewed November 16, 2017", 3.0, "Typical city china town", "We enjoyed strolling through the streets of San Francisco’s Chinatown. It is one of the oldest Chinatowns in the world which is great. Nothing major stood out to us though, the gates to Chinatown were lovely."], ["Reviewed November 14, 2017", 5.0, "Chinatown is awesome", "I love to go to Chinatown almost every time I come to San Francisco I really think this is one of the best Chinatown’s in the world. Lots of little shops and restaurants and touristy things to buy.\n\nWhen you take photos of Chinatown make sure you get one outside of the big gate...\nSome of the best restaurants are slightly off the main street so look around and have fun!\nShow less"], ["Reviewed November 14, 2017", 5.0, "Nice shopping place", "Its a very cool street with nice details. The prices and quality on things depends from shop to shop so you need to be aware of that yourself. I bought some very cheep but very good quality scarfs but I couldn’t find them in other shops so I’m very satisfied that I got it so cheep. The other shops had actually less quality and more expensive in price. So you need to know what you are looking fore. But this street has variety of everything and its a good street for shopping small traveling gifts or souvenir.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Pretty cool Chinatown", "We visited from Chicago and have been to Chinatown there and in New York. This one had a great history component because of the migration of Chinese people to this city. The stores are cool (we saw a fortune cookie factory and had a tea demonstration at a tea shop). Actually would encourage using WokWiz tour because it’s a great way to experience Chinatown. Our guide brought us to a Buddhist temple and a dim sum restaurant. We went on our own through the streets of Chinatown the day after our tour and the residents were a little crabby that we were wandering around their neighborhood that day. Maybe it was a shopping day for them or something. I liked it better with the guide.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Bustling shopping & lunch day", "Lots of places to shop - not always great quality but there were some interesting things to look at.\n\nWe had a great acupressure massage that was good value and some fabulous dim sum!\n\nA great place to soak up a huge piece of San Francisco’s historical district as it is the largest China town in NorthAmerica.\nShow less"], ["Reviewed November 14, 2017", 4.0, "The classic Chinatown. It's all you've seen in the movies", "It's Chinatown. Seen it on many movies. Here it is for real. Lanterns hung across the streets. Little restaurants everywhere. Many shops selling Asian style trinkets. Smell the incense as you walk around."], ["Reviewed November 13, 2017", 3.0, "Interesting Area", "I visited this area because That's where the fabric shop is that I wanted to visit. There are lots of restaurants and shops. It's not a tourist area. It's a residential area."], ["Reviewed November 12, 2017", 5.0, "A must visit with good shoes!", "Grant avenue is the main street of Chinatown. You should not miss the Chinatown Gate at Bush Street and Grant. There are many blocks of local markets, restaurants, bakeries and gift shops, The atmosphere is unique: experiencing the Chinese culture first hand with often musicians playing with oriental instruments. Try to find the Golden Gate Fortune Cookies down Ross Alley (they were invented in San Francisco). You will see how they are made and will be allowed to take all the pictures you want. However, you just leave 50 cents in the tip jar or buy some fortune cookies for a dollar or more..\nShow less"], ["Reviewed November 12, 2017", 4.0, "Nice place to spend a few hours shopping and dining....", "This place also, I reached using a sight seeing bus service. Those hop in and hop out bus tours are cheap, effective and time saving means to reach there. (There are 4 companies, so you need to board the bus for which you paid for only)\n\nThere are a lot of gift shops and restaurants there. I was able to get interesting photos with statues of monkeys, horses etc...\n\nA good place to come with friends and children and enjoy...\nShow less"], ["Reviewed November 11, 2017", 4.0, "Live Fortune Cookie Making", "You have to see two ladies hand making fortune cookies two feet away from you. 10,000 per day! In addition, Chinatown has a lot of restaurants and lots of trinket stores. Don't miss Chinatown in SF because it is pretty substantial."], ["Reviewed November 10, 2017", 5.0, "Go hungry, be prepared to walk and bring cash.", "No trip to San Francisco is complete without a walk through Chinatown. There are several blocks or local markets, gift shops, restaurants and bakeries. It's hard not to0 want to stop at them all so make sure to allow yourself adequate time to take it all in.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Amazing experience in Americas best China Town!", "Having always heard about San Francisco's Chinatown, I was not disappointed. It was going through a portal to China which was surreal. Just being there was special, and seeing people go about their lives and experiencing the culture first hand was special. I look forward to coming back soon, and trying even more food and culture visits.\nShow less"], ["Reviewed November 9, 2017", 3.0, "Interesting", "Great shops and sights. Stores carry varied items. Didn't have a chance to eat there but the food smelled incredible."], ["Reviewed November 9, 2017", 5.0, "A fun Chinese Vibe", "Crazy little fun shops and atmosphere. A fun time to explore your inner Asia. The restaurants are divine. Too many to choose from but so delicious."], ["Reviewed November 9, 2017", 4.0, "Authentically Asian", "From high end jewellery stores, Asian grocers, trinket shops, and wonderful Asian restaurants, this Chinatown will not disappoint. We ate a wonderful dinner at the Asian Pearl, browsed around stores with unilingual sales staff and generally well attended by recent visitors and immigrants from Asian countries. It was highly enjoyable.\nShow less"], ["Reviewed November 9, 2017", 3.0, "Nice experience...", "Great experience and has several of the homes and establishments converted to look like China. Flags on top of each establishment will signify which area or region in China the area represents."], ["Reviewed November 9, 2017", 4.0, "Unusual beauty...", "Its like u jump on a chinese city...little markets with products u ve never seen in your life...everybody is asian and everywhere u see chinese tags and writing.. a lot of restaurants and gift shops..it gives a little something to the whole san fran experience.."], ["Reviewed November 8, 2017", 4.0, "Seemed very authentic", "Best experienced on a walk-through. Amazing range of activities - shops restaurants, factories, churches; against steady buzz on Asian voices. Look for live fish ready for cooking. Best & cheapest souvenir tea shirts. You can haggle a bit."], ["Reviewed November 7, 2017", 5.0, "Colourful Place with Strong Chinese Vibes", "I took public transport to Chinatown and I would say it is quite easy to get there from town. Chinatown SF have lots of restaurants and stores. I would say you can feel the good old days of how the chinese work and play there. There are some very nice street arts too. I like the picture opportunity in the area as there is opportunity to take great picture of people or objects. Do find a place and sit down and soak in the atmosphere.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Here come the China", "This area, almost a district, is so colorful! Here you're in China, there no sign of America, expect for a buch of souvenir shop. I hadn't the occasion to have lunch or dinner here, but I can bet there are good place where you can eat great Chinese food. There is a memorial about asian victims of world war 2, if you have time it's worth a visit. Anyway it's nicealso just to walk around and among chinese in America!\nShow less"], ["Reviewed November 6, 2017", 5.0, "Huge Variety of Excellent Deals", "Multiple blocks of stores and restaurants featuring the Chinese cuisine and culture. The variety ranges from tourist souvenirs to typical Chinese merchandise to the highest quality Chinese antiques and collectibles. Almost all stores features discounted goods and many stores have major sales ongoing. In the five or six antique stores we found major good buys as compared to prices across the country an in China. A MUST SHOP for bargain shoppers and skilled antique collectors alike !!\nShow less"], ["Reviewed November 6, 2017", 1.0, "Have someone drop you off", "Do not attempt to drive here. It's scary, if you are no used to the hills. It is a complete madhouse."], ["Reviewed November 4, 2017", 3.0, "A lovely variety of shops and restaurants.", "Each time I've visited the city, some wandering time in Chinatown is mandatory. It's definitely Americanized China town in comparson to Beijing, Xi'an, and anyplace actually IN China. But the cultural diversity is lovely to enjoy, and the history here is valuable. Take a walking tour if you have the time. I'll do that again NEXT time!\nShow less"], ["Reviewed November 4, 2017", 4.0, "Superb - Walk Through and savour the East!", "Took a walk from the top of Chinatown right to the bottom by Dragon Gate. Was a lovely day so could walk in and out of the many stores and feel the Eastern Influence.\nSo many stores selling everything you could imagine... So we spend quite some time walking down the main GRANT street...\nBought some tradition Chinese gifts.. great fun!\nIs good to walk thru and experience.\nWere going to eat - But in the end did not - But there were many places selling local food that all looked good and were busy too.\nRecommend for a few hours to savour a taste of the East.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Unusal items to buy.", "We did't go all around China town just the main street.The end we entered had an oranate archway which is on a very busy street.\nIt was very nice to walk through with plenty of shops selling all manner of things from life size statues to fridge magnets.\nIf you want a China town magnet you will find some nice ones here.\nAbout half way up the road we came across a gift shop selling magnets we had not seen any where else.We had intended to eat here at what looked like and nice restaurant called y+z ,we even printed off a menu from there web site and took it with us.\nProblem was at the time we were't hungry but if you are check it out,its in Jackson street.Anyway we enjoyed the walk through.\nShow less"], ["Reviewed November 3, 2017", 4.0, "Interesting to walk through", "Another place ticked off our list whilst visiting SF. We found it to be a nice place to walk though, the buildings were amazing to look at and photograph, but as some other reviewers have mentioned, the shops did seem quite tacky. Can’t comment on the food as we didn’t eat, but it was an enjoyable experience to walk through China Town.\nShow less"], ["Reviewed November 2, 2017", 3.0, "Interesting to see", "We found the streets were filled with souvenir shops that were mostly filled with low quality items that weren't priced very well, parking was hard to find and the food we bought at one of the restaurants wasn't very good. It's still interesting to see and I would suggest a visit if you haven't been but don't expect much.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Chinatown Is Not China!!", "I went to Chinatown with a group of my college friends! Although a lot of people compare this Chinatown to other Chinatowns or China itself, we felt this was more importantly a representation of Chinese Americans living in San Francisco. SFO's Chinatown can't be compared to China because the people that live there are not Chinese, they're Chinese American, and therefore the experiences are extremely different. We shouldn't pretend to be experts on cultures that we don't identify with, and should come into these spaces understanding that real people live and work here. Reviews on how this Chinatown failed to be authentic stem from an expectation of Chinatown as an extension of China, whereas Chinatowns were created as places of business as well as by patterns of oppression of Chinese people in America that kept these individuals in a particular space in the city. This in and of itself is a type of authenticity that shouldn't be overlooked.\nP.S. We only rated the attraction because we had to in order to publish the review, but no one should be able to place a value on this space except for the people who live there.\nShow less"], ["Reviewed November 2, 2017", 4.0, "A community, not an attraction", "San Francisco Chinatown is a neighborhood where people live, work, and play. It does not exist solely for tourist consumption and entertainment.\n\nMany other reviews on this site demonstrate a complete lack of respect for the people of this neighborhood. This is not China, and it is also not other Chinatowns. While Chinatowns around the world may share some characteristics, they all have their own stories and histories (and forms of authenticity). Exoticizing this space using racist assumptions disregards these differences.\n\nTourists need to be especially considerate of the spaces that they enter and intentional about how they interact with the people there. Please watch your comments and be self-reflective about your thoughts while you're there.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Chinatown is exactly what it sounds like", "Chinatown first off, has the best food that I have ever had! Simply amazing food, mixed with shop till you drop all day makes for a great day!"], ["Reviewed October 31, 2017", 2.0, "Tacky", "A review suggested this area as a good place to find somewhere to eat. It possibly is but compared with London's Chinatown it's seedy and scruffy."], ["Reviewed October 31, 2017", 3.0, "There are better options", "San Francisco used to boast the largest Chinatown in North America. My guess is that contest is now won by either Toronto or Vancouver.\nThis area is a bit run down and not very appealing as a destination neighbourhood for an extended wander. Perfectly fine otherwise if you have not had this sort of experience before.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Very Unique!!", "It’s worth to stroll through and check it out! Shops on shops on shops! Also, tons or restaurants everywhere. It’s tough picking one, but I’d really recommend going!!"], ["Reviewed October 31, 2017", 2.0, "Daytime visit", "We’ve definitely seen better around the world. It was all very underwhelming. There was no vibrant atmosphere whatsoever. Chinatown London during the day has a great vibe . Not here ."], ["Reviewed October 31, 2017", 4.0, "Great cultural experience", "Wandering the streets of Chinatown was great fun. Interesting shops and restaurants. Good food as well"], ["Reviewed October 29, 2017", 5.0, "Fun Cultural Immersion", "This island of Asian culture is truly awe inspiring . There are shops and markets of all flavors. The restaurants emanate enticing aromas and the architecture is beautiful."], ["Reviewed October 28, 2017", 4.0, "Culture infusion", "This was a highlight of my San Francisco experience. We Googled to find a highly rated massage in Chinatown. We walked the streets, a spectacle in itself. Decorated in red lanters and painted buildings, worn-in routes of street traffic and sidewalks full of people from every walk of life. We enjoyed the scenery and culture of it all.\nShow less"], ["Reviewed October 26, 2017", 3.0, "Not so impressive...", "This is just like any other China town in the world, did not found a good bargain at this market, but nice places for food..."], ["Reviewed October 26, 2017", 3.0, "Tourist China Town", "Just like most large cities SF has a Chinatown as well. As of 2017 SF still has the largest Chinese population outside of mainland China so definitely lots here. I can't say anything stood out as different than any other touristy Chinatown main strip. Take a stroll, mainly uphill from the gate and when you get tired stroll back on another street. I had dinner here one evening. Tons of food and decent prices; most places have menu's out so easy to pick something that sounds good. Afterwards I hopped back on a cable car and went back to Fisherman's Ward where I was staying.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Good and bad", "There is a lot of tourist crap here, but the side streets are awesome. Mah jong and people living and maybe even opium."], ["Reviewed October 25, 2017", 3.0, "Not really impressed", "So we did the tourist thing and slogged up and down Grant street ( I think). Into store after tacky t shirt store all selling about the same things. We walked almost to Broadway and then back to Union Square. It was getting later in the afternoon, so we didn't venture off the main street. Maybe that would have made a difference in our experience, maybe not.\nShow less"], ["Reviewed October 25, 2017", 4.0, "SFO Trip 2017", "Very bustling and crowded with local residents and tourists. Lots of eateries offering dim sum, noodles, pastries. So many markets offering fresh fruits, meats, dried seafood, mushrooms, herbs. Great place for exploring.\nIt’s a pain finding parking and with all the hills, it can be a challenge to walk\nShow less"], ["Reviewed October 23, 2017", 3.0, "Dirty", "So many shops selling rubbish souvenirs or food. Same same. Noisy, crowded and dirty. This area is huge. So many asians that you forget you are in a western country."], ["Reviewed October 23, 2017", 4.0, "Fascinating", "Really need to walk around here but we have only seen from the bus tour. Huge array of marvellously interesting shops"], ["Reviewed October 23, 2017", 4.0, "Nice place to visit and buy souvenirs!", "Very nice place to buy souvenirs, and see the east influence in San Francisco's gastronomy and business."], ["Reviewed October 23, 2017", 5.0, "Like stepping into another world", "Fun neighborhood to visit. Signs and shop owners are all Asian. Lots of touristy shops at good prices. Lots of Chinese restaurants. Fun architecture."], ["Reviewed October 23, 2017", 3.0, "Great food but a bunch of souvenir shops", "Heard that China town was a must see on my San Francisco to do list, and when I got there I realized it's mainly several souvenir shops. The chinese restaurants serve up the authentic stuff, and the chinese architectural elements sprinkled across was a nice touch.\nShow less"], ["Reviewed October 22, 2017", 3.0, "China town", "It is a China town street in Sanfransico. It has all kind of Chinese shops. It includes grocery shops, gift items, and,other shops."], ["Reviewed October 22, 2017", 4.0, "Fab place", "China town is great. So much cheaper for gifts to bring home. Street art is fab and we had one of our nicest meals here."], ["Reviewed October 21, 2017", 5.0, "A taste of the orient", "Neat place to stroll through. Many shops line the active streets decorated in a china feel. No chain restraunts or stores here. While there make a stop at R and G Lounge for a delicious and affordable lunch."], ["Reviewed October 21, 2017", 3.0, "It was ok", "We didn’t have a plan for what to do/see in Chinatown so we just “winged” it. It really felt as if we were in a different country when we were walking the streets. There were just a lot of shops with cheap souvenirs from China. There were plenty of restaurants but we didn’t try any. I would research Chinatown for things to see and do and eat before you go.\nShow less"], ["Reviewed October 20, 2017", 5.0, "A World Away from the Ordinary", "Whenever visiting the SF area, I always try to walk through Chinatown. This time we started at the Dragon’s Gate entrance at Bush and Grant St. and took our photos with the standing bear and with the See No Evil, Speak No Evil monkeys. I love the exciting variety of somewhat chaotic colorful shops selling everything from clothing, furniture, silks, porcelain, jewelry, bronzes, herbs, baked goods, art work and much more, see photos. They are all so exotic, not like you are going to find at Walmart! This time we stopped in at the Golden Gate Fortune Cookie Factory at 56 Ross Alley, off Jackson St. which is between Stockton and Grant. I’ve always wondered how they were made! There is so much more in Chinatown than you can find at home.\nDid this review earn a “Thankful” vote?\nShow less"], ["Reviewed October 20, 2017", 3.0, "Less then Expected", "Cool area, great food, great little markets but a lot less of a wow factor than I had expected. Other cities \"Chinatowns\" surpass SF's, even if their area is smaller."], ["Reviewed October 18, 2017", 5.0, "Where to begin?", "I'm a 62 year old native San Franciscan...my wife is Chinese...I've been coming to Chinatown as long as I can remember...oh yeah, I lived in China for many years too!\nHere's the deal...in Chinatown, Grant Ave. is for tourists. It's an amusing walk but the t-shirt shop clutter and photo-op gloss is not the \"real\" Chinatown. 1 block up, Stockton St. is where to go. Prepare yourself for authentic stores selling all manner of things \"Chinese'...produce, traditional medicine, dim-sum, butchers, fish mongers etc. Always crowded, always bustling, always ALIVE! (just like China). Duck into any shop, gaze at products you may have never seen before...did I say \"duck\"? Yep, they're here too...hanging in the windows of the many tiny dim-sum eateries you'll find. Don't be shy, go in, sample, savor...and don't forget the bakeries...they're not just for fortune cookies!\nFor a \"sit down\" restaurant experience I would recommend a late morning visit to the \"New Asia\" on Pacific between Grant and Stockton. It's a cavernous old joint that serves a nice variety of traditional dim-sum from little carts that patrol the floor like some kind of wheeled Hong Kong siren...and, unlike many of the Hong Kong variety, these sirens are waitresses who speak English so don't hesitate to ask what's in those bamboo steamers. After you've stuffed yourself with all manner of dumplings, barbeque and what-not (braised chicken feet?...yes, please!) try the lobster noodles...a classic that's a terrific value as well...order it and look like a local! Bring a newspaper, sip the tea (jasmine?...you betcha!) take your time. The New Asia may not be the \"best\" dim-sum in SF but the experience is fun and very authentic...witness the clientele of long-time Chinatown residents in the tables around you...they know.\nNow, get back out on the street to walk off your meal...prowl the lanes between Grant and Stockton...hear the traditional opera being rehearsed in upstair rooms...visit the Chinese American Museum...and begin to appreciate the families that live and work here...they're a big part of what makes San Francisco great...and they've been at it since the Gold Rush.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Very authentic", "Its really authentic and you‘ll find some crazy stuff there. The streets are not very clean but they aren’t in china is well."], ["Reviewed October 18, 2017", 4.0, "Vibrant, colorful neighborhood that is fun to explore", "Bordered by Bush Street on the south, Broadway Street on the north, Stockton on the west and Kearney on the east, Chinatown is a warren of side streets and alleys filled with restaurants, shops, markets, bakeries and apartments. Walking is the only way to effectively tour the area and Grant Avenue is the central artery to explore. Numerous stores sell made in China souvenirs, from tea sets to textiles, furniture to jewelry, toys to Chinese herbs. The Asian markets with their poultry (complete with heads) hanging in the windows, the pungent smells of take away dishes and the unique selection of produce make a stroll a journey of discovery. Check out Old St. Mary's Cathedral and the colorful balconies onWaverly Place.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Great for souvenirs", "Unusual part of the city, great for cheap souvenirs and Chinese restaurants. You can walk round for quite a while and find random items that you would not find elsewhere"], ["Reviewed October 18, 2017", 4.0, "Take a walking tour to Chinatown", "Little China in the middle of SF. Interesting how they kept their traditions and shops. Take a walking tour to this area to understand better"], ["Reviewed October 17, 2017", 1.0, "Expensive Tack", "Tacky Tacky Tacky. And over priced. A lot of the stuff that was for sale can be bought off the internet from Hong Kong for next to nothing. It was a real disappointment. Go to Japantown instead."], ["Reviewed October 17, 2017", 4.0, "Very crowded", "I hear China town has more population in a 30 square block than any other in the US. Not sure what to say about this place as it’s like any other town but very crowded. We at lunch at R&G Lounge which was recommended by the local beat cops and it didn’t disappoint.\nShow less"]]}}