{"Citadel Outlets": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Citadel Outlets", "url": "/Attraction_Review-g32655-d1908285-Reviews-Citadel_Outlets-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/bf/89/55/located-10-minutes-from.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1255"}, "address": {"@type": "PostalAddress", "streetAddress": "100 Citadel Dr Ste 480", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90040-1596", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Great shopping !!!", "If you are buying from higher end outlets - this place is fantastic.\nIf your have have a late night flight this is a fantastic idea. They pick you up from your hotel (make sure you get there as soon as the shops open) and take you to the airport for your departing flight. The VIP treatment is worth the cost with storage of your bags, shopping and supply of drinks and snacks - they even give you some shopping vouchers (an improvement would be to supply some fruit). There is Armani, Nike, Asic, Tommy H, Calvin Klein etc\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great Choice of Shops. Free Parking", "So it maybe that we were just lucky but coach had 70% off and Kate spade had 60% off with a extra 20% on some items!!! Therefore some shops you had to queue to get it. There is a great range of low to mid range shops and a Disney store for the kid! It’s missing off saks and polo Ralph Lauren.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Good range of shops", "There are quite a few shops here to choose from, but it really depends on the day as to whether you get a bargin or not. Worth checking out if in LA. Plenty of free parking, but limited food choices. We always check it out whenever in LA.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Love this place", "This is a fantastic outlet mall. Every time I visit I find a bargain. The sports apparel stores in particular are really great. However, it could do with a few more options in the food court as it does get very crowded during meal times."], ["Reviewed 4 weeks ago", 5.0, "Wide variety of outlets with sale offers", "Enjoyed shopping there. Took advantage of the sales.\nLiked Under Armor and Adidas outlets.\nOutlets well spaced out.\nThanks to Ellen of Tommy Hilfiger outlet who helped my wife when she had a minor accident.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Very crowded", "Visited this outlet mall first before the others and comparatively, this mall offered a good and wide range of brands and great discounts just before Christmas. However, the crowd made the whole experience much less enjoyable."], ["Reviewed January 22, 2018", 4.0, "Holiday Shopping", "Huge outlet mall with just about all brands housed in a good space. plenty of deals in most stores, so good buying was an easy decision. Also good service on offer as well which isn't always on offer in outlet malls. Lots of choice for food and drink as well as range of stores, we commuted from Santa Monica for the shopping trip and thought we got very good value for money\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great shopping", "All the usual outlet shops, loved Calvin Klein, got some great bargains. Good food court. Take the free bus, cost us about 60USD for a taxi from downtown and free bus back!!"], ["Reviewed January 21, 2018", 5.0, "Designers for less", "Needed some new business work wear - I go through a few suit pants way to quick so I wasn’t in the mood to overspend, can highly recommend going on the weekdays"], ["Reviewed January 13, 2018", 4.0, "Very Good", "The main advantage of this outlet is that its accessable within less than thirty minutes. It is an average outlet with a limited number of shops compared to the desert hill outlet"], ["Reviewed January 4, 2018", 5.0, "Shopping", "Great amount of stores lots to choose from was worth the visit the stores had good discounts great for getting a deal."], ["Reviewed January 2, 2018", 3.0, "Christmas shopping", "This is a large outlet mall with a lot of parking but it was very busy so parking was hard to find. They have a variety of shops from the gadget shop to high end discount stores."], ["Reviewed December 27, 2017", 3.0, "Average outlet mall", "Citadel outlets at Commerce in LA are easy to get to off the I5 and the parking is easy during non peak times. The food court is fairly limited, particularly when busy with limited seating and restrooms. The range of outlets is okay and not great. The boss store is excellent, particularly when they have sales. Columbia has a good range, however most of the sports stores have a limited range with Adidas being the best.\n\nOverall worth a visit during sales but expect to que outside stores during busy times at holidays.\nShow less"], ["Reviewed December 8, 2017", 4.0, "Excellent grouping of outlet stores with great prices!", "Right off of the I - 5, between Atlantic and Washington, the Citadel is a great grouping of really nice outlet stores with great prices. Clothing stores, shoe stores, leather and purses, etc. They seem to have everything. Parking can get tight, so they have two valet lines, one directly off Citadel Drive, and one just a little further into the parking lot. For my wife's new purse, we were able to shop Brighton, Coach, Coach Factory, and Michael Kors, all within a few hundred feet of each other. Really good daily specials at each store!\nShow less"], ["Reviewed December 2, 2017", 4.0, "Tiresome", "Citadel Outlets should provide more chairs for tired shoppers to rest a while and then continue shopping, and more restroom facilities so there won't be too long waiting time. Shoppers rather send more time shopping than falling in line at restrooms, most specially females shoppers."], ["Reviewed November 24, 2017", 5.0, "Great Shopping", "Excellent outlet shopping with a great range of shops. If you love shopping this place is definitely worth a visit. You will be able to find some great bargains."], ["Reviewed November 23, 2017", 5.0, "Huge Place", "Most shop are welcome and friendly I love Kate Spade / Michael Korr\nbut I'm really really disapppointed at Coach. The staff not smile, unfriendly and have bad mood when I ask her question.\n\nAlso Citadel Facebook Admin not really helpful I ask about Citadel Express and the reply I got is customer service phone number.\n\nI'm not living in US that 's why I send message instead of calling.\nShow less"], ["Reviewed November 22, 2017", 5.0, "Very good Outlet with High Value for money", "Here you find everything you need if you are looking for clothes, sport clothes or shoes. Prices are really good."], ["Reviewed November 19, 2017", 4.0, "Good", "The only outlet mall located in the Los Angeles city limits, Citadel outlets is a pretty decent outlet mall. The location is not the greatest (it's located in the commercial area of downtown, due to cheap rent), however it's not the worst either. Overall I would recommend a visit if you're in the area.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Good place for shopping", "Easy to get to and good place for outlet shopping. Manage to get some stuff for my little ones. There is also a Starbucks there too for getting a drink on a long drive"], ["Reviewed November 13, 2017", 4.0, "Good Deals and Not Far From Downtown LA.", "If you're staying near LA and looking for a deal, Citadel Outlets has a good amount of name brand stores to choose from. There are larger outlets that are perhaps better, but this is one of the closest ones to DTLA and in between OC and LA.\n\nOverall: Not a bad option and by saving time on the commute, you will be able to do other things while visiting.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 10, 2017", 5.0, "Great Shopping Destination", "A great shopping destination. Easily reached by car or public transport. The shopping centre does get busy, however there is heaps of car parking available. A massive range of discount outlet shops of high end and mid range goods. A good food court area, free wifi and very clean toilets. Highly recommend visiting here!!!!\nShow less"], ["Reviewed November 9, 2017", 4.0, "Great for shopping during Black Friday", "It gets packed Thanksgiving night. Its a great place to go if you don't mind the amount of people shopping at the same time trying to save money. The have amazing deals."], ["Reviewed November 8, 2017", 4.0, "Check, buy and keep on with your travel agenda!", "It doesn’t matter if you are local or from out of town. There are different coupons and partnerships to have bigger discounts at Citadel Outlets! Go City card gives you a discount of 20%. Citadel Card gives you different discounts according to the venue. Stores give you their own offers and discounts. Check if you are listed in the customers benefits. Sometimes you can get not only discounts but coupons for future offers. Finally, even if you are not buying anything Citadel Venue can be good meeting point and an easy eating plaza.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Good Shopping Experience", "Good Shopping Center. Free Parking, Free Wifi, and a good mix of retail and restaurants. Shops are outdoors."], ["Reviewed November 1, 2017", 4.0, "Shoping for whole family", "This place so big, a lot of shops,shoes, shirts for all family, watches etc.place for shopping for all family. We went by uber. It took from hollywood bvd around 35 minutes, and didn't cost much and theres restaurants and coffee shop. I recomend this place"], ["Reviewed October 27, 2017", 5.0, "Birthday Shopping", "Stopped by the Citadel Outlets to do some shopping for the kids birthday on our way down to Disneyland. What a very nice set up they have there very open and nicely decorated open air style of shopping. Many stores to choose from some of our favorite were the Nike, Under Armor, Disney and the Vans store, but there are lots of others. Very easy to access from the freeway, lots of parking I would suggest using the parking garage much quicker to find a parking spot. I had not had a chance to go into the food court, but maybe next time.\nShow less"], ["Reviewed October 18, 2017", 5.0, "New and worthwhile", "We had been looking for a Bass Shoes outlet because I like their stuff. The shops used to always be in Premium Outlet malls but not any more. Bass have reorganised and there are less shops. We found them in San Clemente Outlets and bought quite a lot in Bass, Nautica, Loft and others, plus we had a nice lunch at Panera. This must be a new mall, and it has picked up shops that have gone from elsewhere. Very clean place, even the restrooms must have cost a fair bit. Definitely worth the drive from LA\nShow less"], ["Reviewed October 16, 2017", 4.0, "Great prices in a great place", "Well, for my wife and for me as well it was like paradise, prices and collection of premium brands prevented us from leaving the place until it's closed and we actually spent almost all the money we had. very good offers and prices even when compared with other outlets in the United States.\nShow less"], ["Reviewed October 11, 2017", 5.0, "So glad we went!", "We got an Uber to Citadel as we were staying in Hollywood and it was too hard to get there with public transport. The stores are well laid out with good maps. We shopped up a storm - we're from New Zealand so pay a lot more for branded goods so even full priced stuff was cheaper but we also got some amazing bargains! The restrooms were clean and lovely, the nicest I have ever visited in a mall! We had lunch at Ruby's which I'd highly recommend.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Great Prices even for an Outlet Mall", "I have been to several outlet malls across the US an I have to say that is a great mall with terrific prices in premium stores like coach, Tummy, Kate Spade, Under Armour, Nike to mention some; I really think that if you are looking to go shopping has to be in your list.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Road and shopping trip", "We are on a two week road trip from Australia. Citadel has lots of stores and bargains to be found. We spend a good few hours exploring and shopping."], ["Reviewed October 5, 2017", 3.0, "It was okay", "The free shuttle did not arrive on time (estimated arrival was shown); almost took a lyft/uber when it was still not in sight for the next 15mins as the next timing was another hr wait. No signboard/direction to free shuttle from Union Station so we had to ask at the information counter.\n\nStandard outlet that you get in the States. Similar to the ones in Vegas. Not much food variety.\nShow less"], ["Reviewed October 4, 2017", 4.0, "Plenty of shops on offer", "There are plenty of shopping opportunities at the Citadel outlets. We found some great bargains and enjoyed looking around. Parking was really easy and painless. There are some good options for food. No hassle, easy to get to and good day out."], ["Reviewed October 4, 2017", 3.0, "Average mall", "It is ok. Not as good as other malls in Orlando. Some of the prices are the same back in the UK, especially Levi jeans. Easy to walk around."], ["Reviewed October 3, 2017", 4.0, "Shopping", "Kind of standart outlet. Pretty similiar to vegas one. And from food definitely korean bbc. Dont go there through bug sales cause americans crazy"], ["Reviewed October 2, 2017", 4.0, "A good range of shops.", "We traveled to the States en route to other countries. On our way home we gave ourselves a few days for shopping in LA. We didn’t have time to scout the different stores in Beverly Hills so visiting Citadel was convenient.\n\nThe sales were not amazing nor was the exchange rate but we managed to get a few items which we wanted and needed.\n\nPublic transport from the LAX area to Citadel took almost two hours and was a real eye opener. Police approached us at the first metro stop to have a chat and warn us of downtown LA on the metro and traveling with a baby. For $30 I wish I took an uber.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Lunch", "This place has a variety of eating places. I was there for a 3 day conference. We are at Ruby's Diner and a Korean fast food place, both were great."], ["Reviewed September 30, 2017", 5.0, "If you like shopping ...", "If you love to shop you must stop in here. There are a number of brand name store selling their wares at some fantastic prices. There is something here for everyone. The mall is designed in such a way that it is relaxing to walk through, have a coffee and maybe even sit down for a while. The parking is free and plenty of parking stalls. There are clean bathrooms evenly spaced out so you never really have to look for one.\nThe stores that we dealt with had friendly, helpful and courteous staff.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Good place to shop", "Must visit outlets if you're living near downtown LA. It's filled with many brand options with really good price and the service is also very satisfying!"], ["Reviewed September 25, 2017", 5.0, "Nearest outlets to LA, free shuttle bus", "Have been visiting outlets around LA for 20 years and only just found Citadel at Commerce!! It is much closer to LA than other outlets - really is in LA as only 25 min from DTLA. There is even a free shuttle bus that collects from DTLA.\n\nAll the usual outlet stores are here from the luxury brands to the big chains - too many to name but check their web site. Plenty of parking and decent food casual food stores as well.\n\nWe ended up doing 2 visits over 8 days as everyone wanted more! Some decent extra discounts to be had going twice as many stores have extra discount vouchers on receipts for purchases within next few days (eg: Calvin Klein - extra 20% off for further purchases within 7 days).\n\nThe ice cream cones from Ruby's Diner takeaway are worth a mid shop rest break.\nShow less"], ["Reviewed September 21, 2017", 4.0, "Local Outlets", "The citadel is a series of outlets in the LA area. Most are the modern outlets, i.e. they have merchandise made for sale in the store and are not true outlets, but they are still decent. There are a few real outlets, too."], ["Reviewed September 17, 2017", 5.0, "Shop to you drop", "The variety of stores and prices are fantastic. You will need a whole day to get through all the shops. Lots of discounts and sales. The facilities were clean. Plenty of food options to choose from. Worth the visit."], ["Reviewed September 17, 2017", 5.0, "Love the variety and pricing", "As visitors to the U.S. we always enjoy visiting Citadel when in L.A. We love variety of stores, pricing of goods, and the fact there is plenty of parking.\nHaving free wi-fi is handy for getting in touch with family back home to ask for sizing requirements!! Haha!\nShow less"], ["Reviewed September 17, 2017", 4.0, "Great shoppings....Sales!", "Surprising as compared to the Premium Outlets in Las Vegas and San Francisco, this outlet is not bad. All the shops, ie. Adidas, Nike, Under Armour, Coach, Michael Kors, etc having quite a good discounts. But for food wise, there is only a few selections at the food court. Overall, we have a great shopping day there.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Always great shopping", "Went back to the Citadel Shopping outlets many times. Great deals, great service from most stores and always always very busy. Plan to arrive early and stay late. Great selection of food and place to sit and relax. A must see if you enjoy shopping."], ["Reviewed September 15, 2017", 4.0, "Huge shopping complex for choices", "This outdoor mall is so huge and has variety of brands to look for including one of my favourite Disney outlets.\n\nSure the products in Disney outlet is rather outdated and 90% of them are for kids.\n\nOne of the weirdest tap water I've found coz it's white colored. Not sure what is it.\nShow less"], ["Reviewed September 13, 2017", 3.0, "Good shopping", "The Citadel outlets offers over 100 stores to shop in at one location. It is easy to get to off of the I-5 freeway and it a good place to shop while you are in Los Angeles."], ["Reviewed September 11, 2017", 4.0, "Med size outlet with good selections", "Citadel is not a huge outlet but they have many and nice outlets that offer good selections with good bargain."], ["Reviewed September 4, 2017", 2.0, "Extremely busy", "Visited on labour day so knew it was going to be busy but the the queues outside the bag stores were ridiculous!! Only allowing in when someone came out !\nOverall a poor outlet the Simon outlets at Camarillo are better and have a better range of shops\nThe choice was poor\nShow less"], ["Reviewed August 31, 2017", 4.0, "Plenty of shops to wander on a hot day!", "Enjoyed walking round here. Lots of sir conditioned shops to look at. Clean wash rooms. Friendly staff and food outlets too. Also a shuttle to local hotels and lax too!"], ["Reviewed August 31, 2017", 5.0, "Best Place to Shop in LA", "Outlets is certainly the shopping delight as most of the signature brands are available at factory prices and great discounts. It is a must-go-and-shop destination if you are in LA!"], ["Reviewed August 30, 2017", 4.0, "Great shopping", "All the usual stores in one place all in all a great shopping experience parking is easier after 5pm and it's a little difficult to navigate access to and from the freeway (for an international traveller) not many places to eat but in general a great shopping experience\nShow less"], ["Reviewed August 27, 2017", 4.0, "Real outlet", "If you go to Los angles don't waste time go directly to citadel outlet and start a real shopping with reasonable price for most brands also there is a good forecourt"], ["Reviewed August 18, 2017", 3.0, "Expected better", "Mix of shops not particularly exciting. Most of the brand names are represented. Lots of walking as pretty spread out. Got discount card from nearby DoubleTree Hotel and that helped. Been there done that."], ["Reviewed August 17, 2017", 5.0, "Shop until you cannot carry anymore", "Spent the day shopping with two ladies that love a bargain, so this was a long day. With so many stores and all the stores having some very good deals, it took a long time going store, by store. Aldo shoes for $17, steal! Calvin Klein T shirts for under $20 and hand bags at up to 70% off crazy, but in a nice way. Food court was a bit of a let down and none of the coffee shops provided an inside seating area to enjoy your Latte out of the sun. Good range of well known brand name shops for both Women and Men. Put this on your must visit list when in LA.\nShow less"], ["Reviewed August 13, 2017", 3.0, "Very busy, fairly average", "Visited about 1:30pm on a Sunday. Car park very busy despite there being so much of it, so be prepared to drive round/wait for a space. All the top name stores were very busy, mostly with messy stock, bigs queues to check out. Didn't think the prices were that discounted most places. I'd say it was also mostly outlet designed stock too not same quality or design as main store stock. Only good thing was being able to buy 2 pairs of Levi shorts for same price I'd pay for 1 in UK. You could probably pick up more bargains if you've the energy to look but personally I'd rather pay a bit more and have a nicer shopping experience.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Great Prices But What Does One Do With the Car?", "This place is popular for good reason. The prices are great. So many shops, so little time.\n\nBut the parking is terrible. I learned that the Americans can be pretty bad drivers in this situation (maybe they were tourists so perhaps I was unfair) but they wer all so polite. No parking lot rage, nothing but smiles and patient people waiting for a spot.\n\nThe parking is a bit lacking it seems but then again, I was new and perhaps I did not go the right spots.\n\nGet there early, buy your bargains and then get out. You will need some time to tavel the rather congested freeway system but it may be well worth your time.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Outlet Mall", "This outlet is very good and have most brands the selection of brands is very good and the parking is convenient. It's not very crowded but that depend on the time of year and day you are visiting it's not far from LA short drive not out of town as dessert Hill\nShow less"], ["Reviewed August 10, 2017", 4.0, "Very good option", "It is not so far away from Inglewood. It took me only 15 min to arrive. You should go early. Some brands have very good deals. You can also eat there so it is a day excursion"], ["Reviewed August 9, 2017", 3.0, "Not great", "This is your standard outlet. However, unless you're willing to buy in large quantities, bargains are hard to come across. There are the odd absolute bargains, but you have to hunt for them.\n\nDo your research beforehand and plan a route around the centre because it's rather large.\n\nParking's free, which is good.\nShow less"], ["Reviewed August 8, 2017", 5.0, "shoping here was amazing", "they have a very good selections of stores and lots of parking just have to get there early and good food locations"], ["Reviewed August 7, 2017", 5.0, "Great Back to School", "This a great place for getting back to school clothes and shoes. We were at the Columbia Employees' Store in Portland last week and this outlet had the same shirt in the color I wanted for less money than the \"Employee Discount\" there. There are many up-scale outlets like Armani and Coach, about every shoe company, jewelry and outdoor outfitters like Columbia. It is easily walkable and there is lots of parking.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Great shops", "Great place to shop. Good prices and great selections. Food court was good as well. Plenty of parking."], ["Reviewed August 5, 2017", 5.0, "We bought shoes and sports clothing for the whole family here!", "We didn't have a lot of time there, but we managed to get shoes and sportingwear for the whole family here. We got converse, puma and vans for such good prices. I was worried that, this bring our first shopping stop, that we'd find better deals elsewhere in LA & Vegas, but it wasn't the case.\n\nThey had a great range of shoes & sizes (our kids are tall & have big feet, even the 9 yr old!) and we all got what we wanted at VERY good prices, especially compared to the high prices in Australia for the same items. Of course, it did help that we were getting nearly 80c to our dollar at the time.\n\nI was actually expecting a bigger place & an indoor mall, but it's not huge and all outdoors. We weren't disappointed at all, though, and managed to get more than expected I. The short amount of time that we had to shop.\n\nIf you're in the area and enjoy getting a good deal, mainly on clothing and shoes, I'd say stop by here.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Superb", "Great place to shop,you require more than a full day to shop with various options . Would want to go there again n again"], ["Reviewed August 3, 2017", 4.0, "One of the best", "Great outlet to have lunch and shop. Close to downtown LA. Many shops with good clearance prices. Worth to go."], ["Reviewed August 3, 2017", 4.0, "Great shopping", "This is the second time we have visited Citadel when traveling from Australia. There is a great range of brands/ outlets. We used the concierge to store bags which was free. Good variety of places to eat in between shopping.\nWe visited whilst staying at Anaheim and it was a 30 min trip via Uber.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Bargain deals on top clothing labels.", "If you love a bargain this is the place to come. Top America designers at a fraction of the retail price. Make your first stop the Customer Services Centre to collect a Cidadel Card which entitles you to further discounts at many participating stores."], ["Reviewed July 26, 2017", 5.0, "Great outlet mall", "Spotlessly clean and the best public toilets I have ever encountered. Extremely impressed. Lots of parking. Good array of stores"], ["Reviewed July 26, 2017", 4.0, "good value", "it is the second time we visit this outlet and again found some great bargains. The NIKE shoes my son bought we found the next day in Santa Monica at double the price for the exact same pair. clean environment. nice shops."], ["Reviewed July 26, 2017", 5.0, "Great shopping experience", "We visited this outlet mall on a recent trip to LA from the UK. The shopping mall is well laid out with a good selection of shops and places to eat and drink. Parking is free. Really enjoyable."], ["Reviewed July 24, 2017", 5.0, "Shopped for Kate spade purse", "I love the citadel outlets everything about it to the parking to the stores everything is close by. i loved the customer service."], ["Reviewed July 22, 2017", 4.0, "You want it the have it", "You name the store and you will\nProbably find it here. Allow a few hours to get around these stores. So get a snack, you'll want to keep your strength up.\nParking is easy in the Multi level car parks.\nVery easy to get around, well Set out shopping center.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Shop till you drop", "Large outlet mall. So many stores with discount prices. Try to go in the morning so you have time to see all there is to offer. It gets really crowded. Many places to eat as well."], ["Reviewed July 19, 2017", 5.0, "This outlet center makes sense", "Most outlet centers are a long drive from the metro area, but The Citadel is close to downtown LA, and even runs buses to bring non-drivers and employees in and out. I especially liked their adding indoor parking to stay out of the hot sun. My wife and daughter like the shopping deals, and I like the cafes where I can spend time.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Nice outlet", "If you're visiting Los Angles and want to shop first you must visit Citadel, here you can find a lot of offers so don't shop anywhere before coming here, in Citadel you will find most international brands like Coach, Nike, Puma, MK, Vans, Max studio, and more. When you arrive there go to customer relations and ask for the discount card you sill get more discounts\nShow less"], ["Reviewed July 13, 2017", 5.0, "Shopping mecca", "When in L.A., and if you like warehouse-discount shopping, Citadel is a must-do!\n\nPros:\n- Copious amounts of discounted brand names\n- Fashion that is still 'in'\n- Plenty of food/refreshment places\n- remember to visit the Visitor Centre for your Citadel shoppers pack that has extra discounts, etc.\n\nCons:\n- Location from Hollywood\n- the crowds depending on day and time of day\n\nTips:\n- Uber it to Citadel if you don't have the patience to get public transport, or a booked coach. You'll save $$ on the transfer (that you can then spend at Citadel ;) )\n- wear comfortable shoes for this shopping expedition\n- make sure you (if you're an international traveller) inform your credit/debit card bank of your travel and shopping intentions.\n\nFinal Note: \"I'll be back\"\nShow less"], ["Reviewed July 13, 2017", 4.0, "Great deals and nice variety of stores", "This outlet has a nice variety of stores, which mostly have decent prices. My last visit was in June before going to St. Lucia. I found lots of deals on summer clothing and shoes even though we are well into the season.\n\nThe Citadel has also been working on adding and updating its food court, which is really nice during a long day of shopping.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Many good shops", "A collection of famous brands. Easy to get around. Free parking space. We can recommend this outlet."], ["Reviewed July 11, 2017", 5.0, "Love shopping here", "Citadel is one of my go to places when I g shopping because it has a large variety of stores for all different types of items that you would need and it goes from high end to low end."], ["Reviewed July 11, 2017", 3.0, "Parking lot issues", "Although this outlet faces the highway and main road getting to it....if you are circling around to get to Starbucks like we did, it will shoot you right out of the parking lot. So around the outlet we drove and on the back side was where we found not only a parking a garage (which I think is free, but it isn't known from just looking at it), but also multiple entrances to parking. It just seems like backwards planning. We just popped in to grab some shorts before Disney and also breakfast at Starbucks. If you like to shop, this looked like it had a great variety of stores.\nShow less"], ["Reviewed July 10, 2017", 3.0, "Outlet shopping", "Outlet bargain hunting landed me here at Citadel. Visited Carlsbad, Orange and Fashion island and Citadel has the best variety and selection among them. Recommended for solo or with family."], ["Reviewed July 10, 2017", 5.0, "amazing", "40 min Uber trip from hotel, we arrived before 9.30am opening, so managed to beet the crowd. Everything is so so cheap, I do not normally enjoy shopping, but this was a great experience. Reebok, Levis, Nike, H&M, La cruset, Kalvin Klein, Sketchers to name only a few\nShow less"], ["Reviewed July 10, 2017", 5.0, "The hang out", "This is a place where you can hang out, if shopping go early for parking. Rubys is a great place to eat at and there is valet parking."], ["Reviewed July 10, 2017", 5.0, "Shop til you drop!", "Brilliant outlet shopping!! All the named brands. Restaurants and cafes scattered about the place! Would recommend"], ["Reviewed July 4, 2017", 5.0, "Cheap", "These outlets are cheap, even when you take into account money conversion rates from Aud to Us dollar. They have heaps of brand shops to shop through, and also have food court's located within. If your a shopper you could spend hours there."], ["Reviewed July 4, 2017", 4.0, "Lots of shops", "There are an absolute tonne of stores here and we walked for quite a few hours going from store to store. When things are on sale in the U.S. they certainly are and I had to make a trip back to the car with more bags than you carry bringing the groceries inside in one go! Bring your walking shoes and give yourself 3hrs minimum.\nShow less"], ["Reviewed June 30, 2017", 3.0, "More Shop More People here", "I'm visited there on the soldier day then have a lot of people here.This place have more shop for me to shopping and not big too much and the price was not different from other outlet.I like Guess shop that was very cheap bag and watch.For some shop was very much people when you had to pay you had to wait more than 1 hr that so bored for me and I cannot wait.The have some food court too .\nShow less"], ["Reviewed June 21, 2017", 4.0, "Shopping", "The outlet is quite far from city about 1.5 hour,but there is shuttle bus from metro rail way and some of other spot you can find to get there\nThe factory outlet offer discount, the outlet is not to big but still for those who like shopping one hour not enough\nIt has several good brand such as coach, tumi, Kate spade, Nike, adidas etc\nShow less"], ["Reviewed June 19, 2017", 2.0, "No charger foe electric cars", "I was surprise that this huge outlet mall have no charger for electric cars. Also costumers didn't respect clean air parking spaces. A employer told me the parking garage have chargers with wasn't true. I drove every single floor looking for one until a maintenance guy told they don't have yet. Hello its 2017!\nShow less"], ["Reviewed June 17, 2017", 5.0, "The best outlet stores", "This outlet location is the best in So. Ca., it has more wholesale stores than all the other outlets in the area. Whatever your looking for, you\"ll find it here at reduced prices. Try the food court, it has a variety of cultural foods that you\"ll really enjoy.\nShow less"], ["Reviewed June 15, 2017", 4.0, "Lots of choice and great prices", "I found these outlets to have a great variety of shops, and all the ones that I liked. We happened to go on the labour day weekend and there were huge sales. We visited the outlets 4 times during our trip. Got some great bargains that you just can't get in Australia. We also enjoyed the Mexican takeaway food. Toilets are so clean and fancy!\nHeaps of parking. It was a really nice place to shop.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Great outlets and great prices", "Why pack clothes for your trip when you can stop and stock up with minimal fuss. The outlets are easy to navigate and have most outlets and more that are common to this format. Long weekend sales are good for a bargain!!"], ["Reviewed June 13, 2017", 5.0, "Lots of Great Deals", "This place was similar to a place back home but I loved the Tory Burch Outlet!!! Lots of great deals to be found here."], ["Reviewed June 12, 2017", 4.0, "Let's shop!", "The first thing to notice is the way this outlet presents itself. It looks if you enters an old city in old Persia. High walls and stone statues of the Fire God as half a man, half lion and eagle. The best thing to do is to go the customer service to collect the discount card. Almost all brands are represented. The only shop I missed was Ralph Lauren. Despite that it still was a nice outlet to shop.\nShow less"], ["Reviewed June 9, 2017", 3.0, "Sadly Pretty Average this time around.", "When shopping away from NZ anything that is not an Australian clothes chain is a bonus so we always look forward to the shopping in California.\n\nWe make an effort to go to the Citadel ever time we are in Cali but this time around it felt like there was more construction than anything else. A number of shops were closed and there were sections of boarded walls with no indication of what was coming.\n\nWe did go to Outlets at Orange and Farmers Market so maybe we were spoilt by the time we made it here. These places had many seats to take a rest, lots of different places to eat dotted around the shopping complex but the Citadel feels like it doesn't offer anything specifically to the shoppers to set it apart.\n\nI think well leave it next year and see what's going on down that way in 2019.\nShow less"], ["Reviewed June 8, 2017", 5.0, "Wow wow wow!!", "We're from Australia and this place has ruined shopping back home. hahaha! The most amazing shopping mall. It has so many brand name stores and most of them are 60% off. I bought so much Calvin Klein, DKNY, Guess ect ( I usually wouldn't even look at those brands here in Australia) I'd travel back to America just to shop here. HIGHLY RECOMMENDED!!\nShow less"], ["Reviewed June 5, 2017", 5.0, "good buys", "the place is perfect with all the shops and prices which are cheaper compared to malls. luxury brands are present. shops are for all ages. nice place with choices of restaurants and fast foods."], ["Reviewed June 4, 2017", 4.0, "Great shopping destination.", "If staying in Los Angeles or Anaheim its a great shopping spot. There are a huge variety of stores .All the designer brands at hugely discounted prices..We shopped at Memorial weekend and it was so busy and chaotic., but bargains galore .\nWe ordered a shuttle for our large family of 10 from Anaheim.. It cost usd 90 each way which we split cost of.\nIt was better than the Orange Outlets even though they are good..\nIf you are a serious shopper like me you will be guaranteed a bargain.We spent a lot at Tommy Hilfiger and Coach and Gap and Michael Kors.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Citadel outlets", "OMG they are so cheap I went to Michael Lots and didn't buy anything what a sad person I am , I walked around with a purse worth $250 and it was 70% off and in the end I did not buy it! Handbags worth $380 going for bugger all and still did not buy. There was nothing that spoke to me. But we went to Columbia and got 2 winter jacket plus 2 boots for $230.00 what a bargin. You can now understand why everyone has the designer handbags and clothes here, because they shop at Citadel outlets! We caught the bus there that was pretty easy. Well worth the look.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Must-go Outlet Shopping center!", "Free parking at multi-level garage for easy accessible to Citadel. A busy and lively shopping place with savvy shoppers and families with kids. There is one ice-cream kiosk with long line and quick turn-over to order for our one big scoop in a cone, and also pay an additional empty cone at $0.50 for a total less than $5. Nice ice-cream at valued price. Worth trying!\nShow less"], ["Reviewed May 26, 2017", 4.0, "Nice Outlets in Los Angeles.", "I visited this Outlet Mall and made a couple of great purchases. You'll find great bargains and many stores. Conveniently located just 20 min ride from city center."], ["Reviewed May 24, 2017", 4.0, "Lots of stores", "Unlike some of the other outlets, this outlets offers a wide of stores that are useful. I mean, seriously, do we really need to shop at Giorgio Armani or Prada?! No, we really need stores like Nike, Under Armour, Gap, Disney, etc.\n\nThe parking is pretty good though very very busy on the weekend. I wish their food court is toward the middle of the outlet so that you do not have to walk all the way to the other end for food.\nShow less"], ["Reviewed May 20, 2017", 5.0, "Multiple Choices", "There were lots of signatures stores which was in clearance. Aside from window shopping/shopping there was also a food court in the place where you can have your meals when you get tired. Aside from that, Starbucks is there. It's a very convenient place to go to. One can find everything that you're looking for in Citadel :)\nShow less"], ["Reviewed May 17, 2017", 5.0, "A great place to grab a bargain.", "Wow the savings on clothing prices at Citadel are amazing. The prices are so cheap. All the big brand names here too."], ["Reviewed May 16, 2017", 3.0, "Average", "Don't go looking for a bargin. Not your typical outlet shopping experience. 99% of items are full price, although they will have a marked down Price tag. Hmmmmm!! Lots of shops though and you should find what your looking for."], ["Reviewed May 16, 2017", 5.0, "Designer Names - Massive Savings!", "Must have been half a dozen times or so to Citadel in LA over the past two years.\nTo be honest only tend to buy clothes now when in America\nCitadel have the top designer names giving you great savings!\nClothes, Accessories, Watches - Check out the website for full list of stores\nYou can easily spend 5 - 7 hours here...Also provides a selection of cafes, rest rooms and plenty of seating areas to take a break from all that retail therapy!\nGreat shopping experience!\nShow less"], ["Reviewed May 15, 2017", 5.0, "Great Shopping", "If you're not from the states and love a bit of retail therapy, make the trip to the Citadel Outlets! All the top brands, great sales and discounts. It can get crowded, particularly on weekends but there is plenty of free parking and places to drop and eat, recover from your shopping frenzy. I needed to buy an additional suitcase for the homeward journey. i.e. Levi's 501's for $39US, Calvin Klein discounts up to 70% off - and they give you vouchers for further discounts if you buy additional items, Polo jeans for $21.95US, just remember that there is sales tax applied to each sale at the register, so a bit more than the marked price.\nShow less"], ["Reviewed May 10, 2017", 4.0, "Good offers!", "Lots of offers in this Outlet mall One of the best in LA! Its near downtown and airport. 930am to 930pm"], ["Reviewed May 9, 2017", 5.0, "Great", "Very clean and nice! Very nice restrooms and offcourse all the shops is also very good. Good food options and when we was here we found parking easy and for free. But we parked kinda early so I dont know how it is during the day\nShow less"], ["Reviewed May 9, 2017", 5.0, "Accessible without car - save good money on brand products", "We did not have a car but there is a great arrangement for accessing this outlet. Go to Union Station (metro red line), when you exit you see a large platform area. Citadel Express shuttle departs from there (platform 7). It runs maybe every 30 min or so and the trip takes 30-40 min but it's easy, simple and free - no cost! You also get the shuttle back from Citadel to Union station. The shuttle departs from the same platforms where it leaves you upon entering the outlet.\nYou have plenty of brand stores available and the prices are really good. The prices are significantly lower than what you find i.e in Hollywood & Highland mall. The discounts often require buying two pieces so take a friend to shop with to get the most benefits.\nYou have cafes and restaurants so you can eat and drink. You have benches so you can rest your feet. Buildings are pretty, everything is very neat and clean. You can spend all day just browsing through the stores. Just a really great place for shopping.\nShow less"], ["Reviewed May 7, 2017", 4.0, "Accessible and outdoor", "The outlet has number of brands at good prices but I think the best part is that it is outdoor so you get to walk and enjoy the day. The second is that you can easily reach it"], ["Reviewed May 3, 2017", 5.0, "Perfect!", "Many shops in outside shopping centre! Everything clean, nice. If you want to shopping go there!! Dont forget buy delicious ice cream at the entrance/end."], ["Reviewed May 1, 2017", 5.0, "Worth The Visit.", "Outstanding outlets, you must get there early we used an uber from west Hollywood 2011 Highland Ave which coast about $21.93. If you know basicly what you want go to those shops first as the day gets busy the sizes run out. Happy shopping. I picked up a Fossil watch at 70% off however this was easter Sunday, also Nike was very bust so if you like Nike like go there first. We intended to stay half the day but ended up spending a full day shopping.\nShow less"], ["Reviewed April 30, 2017", 1.0, "A total waste of time and transportation costs", "As we were just staying one day for transit , we choose between this outlet or Getty museum.\n\nI was so regret about not insist going to the Getty museum.\n\nThe brands here are not exciting at all and so are their products and their price. Also, the similes of the salesperson are so fake.\n\nShow less"], ["Reviewed April 24, 2017", 5.0, "Amazing Shopping!", "We came here twice during our 10-day holiday & I have to say we just loved it! Prices were amazing in all stores & all the big names are here. Who would have thought you could get a Michael Kors handbag for US$100 or a Fossil watch, engraved while you wait for US$30!!! Not only that but even though the prices are already heavily discounted lots of the time when we entered a store we were given an additional discount voucher. At some shops they also add additional discount vouchers for other stores to your receipt. Loved this place!\nShow less"], ["Reviewed April 22, 2017", 4.0, "Great place for sports brands", "We ubered from Anaheim (40mins) and was charged $42. On the return it cost $27. Learnt today it's all about peak travel times etc. great bargains in the Nike store for shoes- I got 2 pair for $113 plus a $25 off voucher when the next purchase over $50.\nThis shopping facility is great if you love branded clothing- check the list via the web before you go though to make sure they have a preferred store or you maybe disappointed.\nOur returning uber driver also drove with Lyft a similar system so have downloaded this app also- when comparing the same 2 rides there was a huge difference which will determine our choice from here on in.\nShow less"], ["Reviewed April 20, 2017", 5.0, "Awesome prices for us Aussies", "Had a great day here, purchased a $460 coach bag for $140 and many other bargains that I simply would not be able to afford in Australia. Make sure you download the voucher before you go to get a discount card, most stores will give you an extra discount on top of the already discounted prices. Make sure you visit Ruby's if you want a real American 'diner' experience.\nWill definitely be back next trip!\nShow less"], ["Reviewed April 14, 2017", 5.0, "A good Outlet", "The Citadel Outlets are a good address to find some clothes and other things to wear. It's very nice there."], ["Reviewed April 12, 2017", 4.0, "Better go during school time", "Large varieties of stores, foods and good deals.\nGood for families, benches are all over the spot but in my opinion need to put more.\nOutlets to charge your cell or tablet are available near food court.\nAdvice: during holidays go with family or friends so you can wait in looong line and alternate people when they tired or need to go to the restroom. Go before stores open, so you can have the nearest parking space far from the stores.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Excellent Shopping Mecca", "Super selection of outlet style stores. Always great prices and hidden bargains! Close in town shopping for locals and freeway close access for out of town visitors! Something here for everyone including great food!!"], ["Reviewed April 9, 2017", 5.0, "Shopping heaven!", "Be sure you have lots of time to spend here..and bring another suitcase! This was a great shopping experience. Everything for everyone. .. even valet parking if you want. It was easy to find and there is lots for free parking area too."], ["Reviewed April 9, 2017", 5.0, "Designer shopping", "Lovely shopping mall with free parking space, shop till you drop!! & if your Hungary there's a loads of eateries with outdoor shared tables & chairs you just find somewhere to sit & enjoy your meal! If you go make sure you find & go to the customer service section b4 you start yr shopping & ask for a citadel card which enables you 2get more of a discount on your designer shopping! Shops like Micheal Kors & Nike dnt participate in the discount scheme but most the others do & Iv had great bargains & buys! The discount varies differently in each shop so it's best 2ask them b4 u go to purchase! Happy shopping!\nShow less"], ["Reviewed April 3, 2017", 4.0, "Must visit", "It's very convenient that Citadel offers free shuttles at various times to and from the outlet. This is a must visit even though there are fewer shops than expected as a lot of the brands had ongoing sale/ promos."], ["Reviewed March 26, 2017", 4.0, "Bring photo ID", "We arrived at Citadel to go shopping only to find that we needed photo ID to use our credit cards! Our passports were at our hotel. We managed to get enough cash to complete our shopping. The place was clean, well laid out, staff were attentive and great shopping. It was worth the fare getting there as prices were significantly cheaper than in Australia. We were able to get a vegan lunch at the Pho Cafe too which was delicious. A good day out.\nShow less"], ["Reviewed March 17, 2017", 4.0, "Lazy day in Spring", "Very nice update to the Facility- Parking Structure and still building more ! Customers' Service Mind - Bravo ! Lots of Tourists, traffics even on the week day ! Food Court has varieties to offer ! All the Branding names stores ! Nice !"], ["Reviewed March 7, 2017", 3.0, "Good Sized Outlet , but not much cheaper than other local shops", "I luvvv bargain hunting. I stayed in LA after flying from London just to shop for a day. So I stayed at Ra'mada ($6.00) uber ride to be near the outlet.\nI hit the shops straight after the 10 hour flight.\nI was a bit disappointed as the prices were not that much different from LA shops like Macy's.\nI actually found cheaper prices in Macy's than the outlet shop.\nSo I came home with not that much bargain.\nShow less"], ["Reviewed February 27, 2017", 5.0, "Great Outlet", "This was our first visit to Citadel and we'll definitely go back when next in LA!!\nIt has a great selection of shops, well-presented and all nicely arranged with spacious walkways. Good music playing everywhere, which is always a bonus for us.\nWe were staying in Pico, so it was a quick and easy journey getting there. Parking was plentiful, easy and free!\nWe went specifically for the Calvin Klein Underwear shop, Skechers and Vans but there are numerous others . . too many to name from memory!\nWhichever store we visited, the staff were friendly and attentive.\nFantastic shopping in the beautiful Californian sunshine . . what more could you ask?!\nShow less"], ["Reviewed February 18, 2017", 4.0, "\"Good Local Outlets with Name Brands\"", "I enjoy visiting this Outlet during the major holidays (ie. After Thanksgiving, Christmas, etc.). Top name brands like MK, Adidas, Levis, Converse, GAP, Coach, etc. My favorite is Adidas... I have a friend who works there and they give me their employee discount which is about 30% on top of whatever discounts the store is having. You just have to know somebody who works there and they can do this per Adidas!\n\nThe Converse store is another one of my favorites... I buy most of my kids shoes here before they go back to school. I always look at the \"Clearance\" section first and I get lucky with a pair of cool high or low tops for my daughters.\n\nThe crowed is sometimes huge, so are the lines to pay and parking can be bad during these special deal days/holidays at this Outlet, but you wont find a better price in the local area for my two favorite stores that I reviewed here for you.\n\nNote: They have several outdoor benches, small food court with outdoor tables and chairs, restaurants, fast food, etc. valet parking for about $5, a friendly customer service office for all that have questions or concerns and they include current exchange rates, lotto (scratcher for sale), phones, large clean restrooms with changing stations for babies/little ones.\nShow less"], ["Reviewed February 15, 2017", 3.0, "Try this monster of a shopping center when you want a unique item", "Housed in the former Goodyear plant, the facade is unlike anywhere else in SoCal. Enjoy outlet prices with a wide range of selections to choose from. Well over 100 places to explore with a shopping buddy. Go to their webpage to see who is having a sale before you break open your piggy bank.\nShow less"], ["Reviewed February 14, 2017", 4.0, "New Outlet Mall that Offers Great Store Selections and Substantial Discounts!!!", "We were staying just down the street from this outlet mall at the Crown Plaza, as since this is kind of an industrial area, we went here a number of times to eat and to do some shopping. The mall appears to be relatively new which was very nice, the stores were all in great shape and had lots of selections at great prices, which means we spent a lot of money there.\n\nThe food court offers a number of your standard food selections and was adequate. Parking was a bit of a problem when we went on a Saturday night, but that was to be expected as that is peak time. The other times that we went there was no issue with parking whatsoever.\n\nSo if your in the area, be sure to stop by and enjoy good cheap shopping.\nShow less"], ["Reviewed February 13, 2017", 4.0, "Great outlet mall.", "This is a great outlet mall but it is super busy so be sure to plan accordingly in order to avoid the traffic. Lots of stores to choose from and some decent restaurants to eat at in between. You probably won't be ably to hit every store in one day so check out the website before to make sure you find all the stores you really want to see.\nShow less"], ["Reviewed February 13, 2017", 4.0, "Great shopping", "I love shoes....... I found great buys here........ you can get name brand items at a discount......\nthe weather was nice and I appreciate the sales representatives kind words and help. I do plan to go back again.\n\nThen had a nice lunch before heading home.\nShow less"], ["Reviewed February 12, 2017", 5.0, "Good shopping experience!", "This outlet was the only shopping experience I got in LA...lots of brands and fair offers. Compared to other outlets in san diego and dallas...the prices are a bit higher but thats the best in LA."], ["Reviewed January 29, 2017", 5.0, "Great shopping especially casual clothes!", "Great place to shop for casual clothes and shoes.Great bargains and sales in January!If you like ADIDAS,LEVIS.NIKE , VANS and American EAGLE you have to go here!GO early in the day and be prepared to spend the whole day here.All the staff in all the shops are friendly and helpful.Set yourself a budget or you will overspend!!!!!\nShow less"], ["Reviewed January 22, 2017", 3.0, "Not really an outlet mall", "I have been to outlets in Camarillo, St Louis and New York (New Jersey) and this oulet in comparison was not that great.\n\nPrices were the same as most retail shops and selection was pretty limited. There are not that many shops either, compared to the other outlets I have visited.\n\nThis was the last outlet we had to shop at and unfortunately we could not finish getting all the things we wanted.\n\nBonus, if I could call it that, it was raining so very few people were there making looking around much easier.\nShow less"], ["Reviewed January 17, 2017", 3.0, "Standard Outlet outside strip mall - nothing spectacular - prices still high", "Stayed at a hotel next to this mall. Decided to walk through it - has all the basic chain stores. I walked into a few Men's clothing stores and did not see any sales worth any purchases. I am used to going to Outlet malls in the Southern states and the discounts I saw in the LA outlet were not good enough for me to buy anything. Also the food court was pitiful. just several low end fast food chains. Overall I give it a \"average\" rating based in the sheer number of chain stores.\nShow less"], ["Reviewed January 15, 2017", 4.0, "Great place for shopping", "This is a massive outlet, if you like shopping just like I do then you will enjoy, make sure you have enough time, we were there 3.5 hrs on Saturday night and it was not enough, prices are ok and good brands can be found, wear comfy shoes and bring a coat in winter as it get windy this is outdoors mall so you need to walk out to go to the next shop, enjoy\nShow less"], ["Reviewed January 14, 2017", 4.0, "Great Outlet Mall", "A great outlet mall which contains a lot of brands store. It is an outdoor mall. You can find a good deals there. It just require more restaurants options as 5 options is only available."], ["Reviewed January 12, 2017", 4.0, "Good for shopping", "Its a very nice place to find all the brands you want with a good prices and sale most of the time. You can spend 6-8 hours minimum."], ["Reviewed January 11, 2017", 5.0, "AUSTRALIANS you must shop here!", "We're from Australia and I can easily tell you that we (Australians) get so ripped off with everything! My husband, 2 kids and I bought 4 pairs of shoes from the Nike Outlet for $130 including tax!! In Australia that total price equals 1 shoe!!!! We bought alot of things from the Disney store. A MAui toy (from the Disney movie Moana) cost only $36 but when we came back to Australia, the shops were charging $80+ for the exact same item!! All I can say is, if you're from Australia. Go crazy on the items because we get RIPPED off back home!\nShow less"], ["Reviewed January 7, 2017", 4.0, "A lot of shops, great for bargains", "Our last day in the US was well spent buying up big at the Citadel. Heaps of shops with a good range of stock. Not that close to the tourist parts of LA but worth the $30 Uber fare. We ended up being at the Citadel for over 4 hours. There are a number of cafes and a food court to help you get through the day.\nShow less"], ["Reviewed January 6, 2017", 5.0, "Shopping heaven", "Coming from New Zealand where we get ripped off for everything, we found this place amazing and well worth it. Have been twice (2014 & 2016) and got great deals both times.\nSpent a whole day here. In 2014 it was very busy and had to queue to pay for items at most stores but in 2016 it was very quiet.\nWe have found its cheaper to pay the airfare from NZ to LA and shop for the whole family at Citadel, than buy similar things in NZ.\nWill be back for sure :)\nShow less"], ["Reviewed January 4, 2017", 5.0, "Nice deals", "We visit this outlet couple times a year. Parking can be challenging during the weekends but during weekdays we don't wast much time in finding one. Deals vary. We compare them with the outlets at Camarillo. Sometimes you are lucky to find nice discounted products. Easy located next to the I5. The food options are there but most of them are pretty crowded, i.e. long lines in the weekend.\nShow less"], ["Reviewed January 4, 2017", 4.0, "Good value shopping trip", "Enjoyed a few hours shopping here with my teenage kids. There is a good variety of stores, and something for everyone. The only thing missing are some decent places to eat."], ["Reviewed January 4, 2017", 4.0, "This was an excellent place to shop.", "So everything we saw or did in California was EXPENSIVE, Groceries, parking, restaurants, and entertainment.\n\nThis mall is not. We stopped in about half the shops and was surprised at the prices and sales.\n\nMost of the staff were helpful and friendly.\n\nif there had been room in the bags, we would of brought home more.\nShow less"], ["Reviewed January 3, 2017", 1.0, "NOTHING SPECIAL BUT WHY SO BUSY?", "Worst parking setup ever. Took me 20 minutes just to figure out how to leave the lot. Stores are nothing special too."], ["Reviewed January 3, 2017", 3.0, "You can easily spend a day here", "A pretty nice shopping mall where you can find basically everything. Sometimes there seems to be so many people that you actually need to wait in line before you can get into specific stores. Prices are good and often you get discount coupons to other stores when purchasing something.\nShow less"], ["Reviewed December 31, 2016", 5.0, "Great shopping", "I have been here like plenty of times, sometimes you end up getting things like 70-80% off, and sometimes they are just normal prices, overall, great brands and good shopping"], ["Reviewed December 31, 2016", 5.0, "Vibrant & Great Deals!", "Where the deals are and Super crowded! Parking was super challenging during weekends and holidays. Go to Customer Service and show your AAA for a VIP discount book. This outlet has way more variety than Barstow Outlets - no need to drive all the way out there for same quality stores (considering price of gas); and, yes, aside from a few quality stores Barstow stores alley where a bunch of stores have moved out looks depressing. Citadel is vibrant!\n\nFor luxe items, they have a Luxe store (Luxe is part of the name of the store) featuring a tiny variety and selection of brands under one roof: Celine, Tod's, Versace, etc. There is also a Bally store next door.\nShow less"], ["Reviewed December 29, 2016", 4.0, "Good shopping experience", "Visited last in August 2015. Sometimes it's hit and miss even at the same time the following year. Depends on fashions. Sometimes I've found really nice clothes at good prices and other times left empty handed either because the styles weren't very nice or nice, but sales weren't good enough to spend the $. You probably only need 2-3 hours if even. If you're alone and you only go to the stores you like, it might be less than that. Seating for those who don't want to shop is located throughout, but the cushy chairs are near BCBG and Guess?. Decent size outlet. Go find the tourism center when you arrive and pick up the visitors discount book. Sometimes there's some good discounts that can be used in conjunction with the sales. Located about 45 minutes north of Anaheim in the city of Commerce. Don't go on any holiday as you'll be overwhelmed by the crowds on the freeways and then once you arrive here. My Mum forgot about Memorial Day in May 2015 and she said it was like a madhouse that Monday on the way to the outlets and then at them. Small food court at the rear of the center with Panda Express, sparrow, Starbucks. There is also some dining areas around the parking lot area too.\nShow less"], ["Reviewed December 20, 2016", 3.0, "Good Enough", "This is a good outlet, but the design of the outlet is a bit scattered and not like your typical clustered outlet. I would recommend other outlets which also have more variety and a better design outlay."], ["Reviewed December 19, 2016", 5.0, "Great shopping", "Great outlets here we grabed some good bargins here to finish off our USA trip. You need a full day to get through this place."], ["Reviewed December 19, 2016", 5.0, "Brilliant shopping.", "This is THE place to shop. Great outlets, well laid out, clean and great service. If you are visiting from interstate or overseas be sure to visit the visitor information centre first and grab your coupon booklet.. Great deals. Allow yourself lots of time here, loads of stores. DO NOT attempt to get transport to and from here between 7-9 am or 5-8pm.... Traffic is a nightmare.\nShow less"], ["Reviewed December 17, 2016", 4.0, "shopping", "It was very fun time shopping there. My wife loved the place. They also have the food court and free parking."], ["Reviewed December 16, 2016", 5.0, "Great", "Good variety of shops and some awesome deals to be had in mostly every store. Is just your basic outlet shopping center. Good food court and nice layout. Good for a days shopping."], ["Reviewed December 11, 2016", 4.0, "Clean and organized", "Each time I shop hear I always find what I'm looking for, they have a wide variety of well maintained name brand stores that off a true value, and the parking lot is well maintained and monitored ."], ["Reviewed December 10, 2016", 4.0, "Good bargains", "Had a one day splurge at Citadel Outlets. There's nothing like these in New Zealand so got some great bargains. Timed my visit so it was in the middle of the week so it wasn't too busy."], ["Reviewed December 9, 2016", 5.0, "Shopping retail therapy for the bargain hunter", "Shopping Paid 5 dollars for valet parking so we didn't have far to walk Great up market shops micheal kors Kate spade ,coach , tommy h,vans shop the list goes on allow a day and go to guest services to get your discount card Not enough shoe shops for my liking\nShow less"], ["Reviewed December 7, 2016", 5.0, "Best Place to Shop in Los Angeles", "I had a 7-hour layover in Los Angeles and because Citadel Outlets was the closest outlet mall to the airport; I just had to make a trip there to do some Christmas shopping. The deals there are really fabulous and they carry a lot of brands there. Even shopping 2/3 hours wasn't enough for me and I really enjoyed myself there. If I had more time, I probably would have burnt a big hole in my pocket because the prices are really a steal.\nShow less"], ["Reviewed December 1, 2016", 5.0, "Megaoutlets with anbience of Assyrian fortress with sphinx", "This megamall locates on I 5 freeway between San Diego and Los Angeles, on the city of commerce. The outlet comprises 6 zones with each zone beginning with number1-6, there are almost 150-200 shops and restaurants. Brandname flagship retailed stores and many superstores selling various products are all here. If you are shoppaholic, doubletree hotel is also in the vicinity of this outlet.\nShow less"], ["Reviewed November 24, 2016", 4.0, "Retail Therapy", "Citadel Outlets is about 45min drive from Hollywood and about 30mins from Anaheim. Large outdoor sprawling layout with an outdoor food court area. Typical shops and prices and some good bargains if you look hard enough. Popular stores had queues to line up Michael Kors and Nike if youre really keen to shop for these brands. Good shopping overall and shopaholics paradise.\nShow less"], ["Reviewed November 21, 2016", 2.0, "Avoid! Prices are hardly outlet worthy, and you will save more than 30% elsewhere!", "To pass the time on the drive up to Barstow, I did some retail therapy here.\n\nThe Hugo Boss suit I bought was great. The only problem was that I found the same suit later at North Premium outlet at $200 less!\n\nThe moral of the story? If you can make the 4 hour drive up to Vegas, do it, because $200 will more than cover the gas and food BOTH ways!\nShow less"], ["Reviewed November 19, 2016", 5.0, "Fantastic shopping destination", "If you're looking for an outlet mall in the LA area, this is the place to go! A fantastic range of shops with good discounts across a well laid-out outdoor mall. A nice way to spend a morning or an afternoon away from the noise and business in Downtown LA.\nShow less"], ["Reviewed November 19, 2016", 5.0, "Im satisfied", "I was lucky to attend shopping in Michael Kors, when it had 60% off. So there was very good offer! Haven't visited other stores, but during sales this place is very good! Also there is enough of parking space, a lot different kind cafeterias."], ["Reviewed November 18, 2016", 5.0, "Shopping heaven", "Make sure your credit card has plenty of credit because this place is a great place to grab a bargain with all the name brands. Once you've completed shopping enjoy the many restaurants. Free Wifi is available so you can pay photos of your shopping triumphs\nShow less"], ["Reviewed November 13, 2016", 4.0, "Shopping Trip", "Lots of great shops. From Old Navy to Nike to True Religion.\n\nI didn't find the prices as comparable as other national outlets. But the ambiance and vibe were great.\n\nI loved the free shuttle from downtown LA. That made it a lot easier for us to get to and depart from. The shuttle driver was also very friendly and eager to show us around downtown LA.\nShow less"], ["Reviewed November 5, 2016", 5.0, "Shop til you drop!", "To have a nice little break from Los Angeles and the madness head on down to Citadel. Complimentary transport from Union Station and return!\nExcellent selection of shops, get there early, check website for opening times as it gets very busy!\nNo real traditional food court but Ruby's Diner just on the grounds is fab with the usual diner food plus gorgeous and huge salads!\nBeautiful restrooms and spotlessly clean and most of all plenty of bargains to be had!\nShop til you drop!\nShow less"], ["Reviewed November 1, 2016", 4.0, "Real treat after hard work", "Spending half the day here after my conference ended was a real treat after hard work at the conference. Nice mix of shops - impressed that staff at Coach could speak some Mandarin with the PRC shoppers. Sufficient food choices to catch a quick bite before getting back to the real business of shopping.\n\nChristmas came early! They were putting up a huge tree at the end of October!\n\nThe shuttle service from the Convention Center hotels to the mall and back was comfortable with onboard wifi. Worthwhile paying for it.\nShow less"], ["Reviewed October 29, 2016", 5.0, "Love shopping like me?", "I love shopping i truly do its my favorite thing to do so a visit to this outlet was a must for someone like me.\nWhen we drove in it was obvious parking was going to be a problem so for $5 let the friendly valet team take care of that for you. This outlet is fairly large it is all open-air with nice seating & shaded areas for the non shoppers to wait & relax. There are various vendors selling snacks & a decent sized food court, the ladies restroom facilities were a big surprise they are gorgeous.\nWhen we needed a respite from shopping & some sustenance Ruby`s Diner covered our needs perfectly.\nI like everyone have my favourite brands, i do know a bargain when i see one & i know my prices. I also come from australia & at this time our dollar is not strong against the US dollar so you really need to know weather your actually getting a good deal or paying too much. The biggest annoyance with outlets for me even ones in australia are that brands also stock their lastest lines/products with the same prices as you would pay in their flagship stores seriously I just want items that are on sale is`nt that the point! It frustrates me also when these outlet stores are \"packed to the rafters\" with stock that they need to move but offer very very average discounts.\nMy favourite stores at Citidel were Michael Kors, Calvin Klein, Coach, Max Azria & Guess.There were many other stores & brands that i shopped in but these were where i spent most of my money & got the best bargains. A lot of these brands can be expensive to purchase at home so i will always check out these stores before say H&M, Gap etc. Im not into sports so outlets for brands like Nike, Asics, Adidas etc are stores I dont even walk into. I also dont follow the \"active-wear\" trend in anyway so im unsure about the discounts on these clothing styles. The outlets selling make-up, perfumes etc i thought were not really offering discounts that they should be in an outlet setting. My advice would be check out on line what stores they offer that you would buy from im a handbag girl so i was well catered for. To sum up if your sport of choice is shopping like mine you wont be dissappointed.\nShow less"], ["Reviewed October 29, 2016", 5.0, "Shopaholics Dream", "We went to Citadel Outlets mainly for our daughter as clothing & shoes choice in New Zealand is limited outside of Auckland. Lots of great stores here, including our favourites GAP, H&M, and Sketchers. A good selection everywhere, and glad of the extra baggage allowance on the flight home.\nCertainly worth the visit.\nShow less"], ["Reviewed October 25, 2016", 4.0, "Good shops and restaurants", "Lots of good shops and several restaurants. Something for everyone. It was decorated for Christmas in October. It looked nice but kind of early for that."], ["Reviewed October 25, 2016", 4.0, "Outlet in LA", "This is a pretty good outlet mall. There is ample free parking and also valet parking. It's right off the freeway. The stores are ok. Camarillo premium outlets is much better."], ["Reviewed October 23, 2016", 4.0, "take advantage of the free shuttle from downtown LA", "The shuttle from Downtown LA made this easily accessible (and was free!). Shops opened at 10am and my first stop was customer service to get the free coupon book for extra savings. It is a huge complex and open air so on a hot day it does get rather warm. The stores are nicely air conditioned though. I ended up spending about 5 hours here and saw almost everything that I wanted to before returning to the city. There seemed to be good bargains in most stores - you just had to restrict yourself depending on your luggage allowance.\nShow less"], ["Reviewed October 22, 2016", 4.0, "Great outlets, NYDJ is gone!!!", "Really worth the stop to this outlet center! My favorite store is leaving though. This will be the last week for the NOT Your Daughters Jeans store! This is too bad! Nice outlet mall though!!"], ["Reviewed October 20, 2016", 4.0, "Shop to you drop", "We went to Citadel on a Sunday morning on opening hours and there was almost no people. It gradually started to fill up and by noon-one pm it was packed!!\n\nIt's easy to navigate around at the outlet and the selection of stores are ok. Not so much sale as anticipated, but some stores had good discounts.\nShow less"], ["Reviewed October 17, 2016", 4.0, "Amazing Finds", "Get a coupon booklet in customer service before you start shopping as you'll get additional savings!\n\nWent to Kate Spade and got 60% and an additional 20% on top of it. Got a lot in Carter's, True Religion, Ann Taylor, Calvin Klein.\n\nWish they have Tory Burch, Ted Baker and Ferragamo.\n\nWent to Ruby's for lunch and it was good diner food. Was able to use the 10% discount from the coupon booklet.\nShow less"], ["Reviewed October 16, 2016", 5.0, "Shop until you drop", "We went to the Northern mall on the Strip in Las Vegas a week or so ago and we drove to this place during our stay in LA and it is comparable with it. Good range of shops and food area. Great wardrobe refresh opportunity and great bargains on offer which negate the £/$ current (almost) parity as 50% off pretty much everywhere. So what are you waiting for!\nShow less"], ["Reviewed October 11, 2016", 5.0, "Shop your life away", "As you can expect for any American outlet, the deals are great specially if you go there on a Holiday. Unknowingly we went on Colombia day and found special deals for the day.\n\nI recommend you check their website to see if the stores you can find there interest you.\n\nThe parking space is free and there are plenty to pick from.\n\nThere is a foodcourt and sit down restaurants for when you are hungry.\nShow less"], ["Reviewed October 10, 2016", 5.0, "Citadel vip shopping", "This place was terrific. Prices were comparable to other outlets we hsd been to. The big srand out is that you can turn what is normally a waste of a day waiting for your flight into a fun experience. The vip loung was fantastic. We were taken there by karmel shuttles and met by angie the customer service person. She showed us wherd to go and pointed out all the free drinks and coffee and snacks. The lounge has tv music wifi and very comfy seats. It is like a hotel lounge. We loved it and bought lots of clothes. You also get a discount card and vouchers. Soooo worth it.\nShow less"], ["Reviewed October 3, 2016", 5.0, "Great shopping Great prices", "Oh boy did we spend up a storm here. This place has great prices and friendly staff. You must stop here if you can."], ["Reviewed October 1, 2016", 5.0, "All shopping in one place", "Very easy to find, very easy to park. Outlet is open air with restaurants and shops. Wide range of shops and chilled out ambiance"], ["Reviewed September 29, 2016", 5.0, "Great shopping destination.", "We visited a few outlets in different cities and found that the Citadel Outlets in LA were by far the best. They have more shops and better bargains than the others we shopped at."], ["Reviewed September 29, 2016", 3.0, "All the usual retailers", "The best thing about this outlet is the multi-storey car park where your car can wait in the shade! Food outlets mostly at one end so a bit of a walk in the heat today."], ["Reviewed September 21, 2016", 4.0, "Big outlet mall", "It's a big outlet mall, with a lot of great shops.. we went there and spent some good hours, would recommend going there, but as others are saying, you could get a better bargain at other outlets."], ["Reviewed September 15, 2016", 3.0, "Massive", "Probably the largest outlet center we've ever been too... in terms of bargains....: I'm not so sure! Prices were pretty much what they're at 'normal' shops. Easy to get to."], ["Reviewed September 14, 2016", 5.0, "Really good", "Masive place with really good shopping and plenty of places to have some food or a drink during your shopping spree. Also big parking which is great."], ["Reviewed September 14, 2016", 4.0, "Good atmosphere", "very packed. parking mediocre at best. sevral shops, as always some good price as some expensive. they have a nice outdoor food court."], ["Reviewed September 14, 2016", 5.0, "Shop 'til you Drop!", "Something for everyone from infants to seniors, from traditional to outre......you will find it there. Fun to just people watch too. Growing like mad...parking is a challenge sometimes."], ["Reviewed September 11, 2016", 4.0, "A huge outlet with good deals", "This is a massive outlet with all major brands and down really good deals.\n\nWith a visit if you have a couple of hours to spare and some money to spend!!\n\nMy wife assures me that the items here aw very good value compared to the high street!\nShow less"], ["Reviewed September 9, 2016", 4.0, "Some Bargains to be found", "Visited this outlet in weekday around noon. Parking was a bit of a hassle as you are driving around and around looking for a space. However when we were leaving at 1730hrs it was half empty.\n\nOn the whole a good experience but I found prices have gone up considerably to my last visit. Food court was nice and clean. A few bargains in some of the shops. However do your research before you go to know your prices.\nShow less"], ["Reviewed September 9, 2016", 4.0, "A good outlet not so far away", "Citadel Outlets is centrally located and not so remote. Most of the name brands you look for are here. It also has restaurants nearby and a big food court so you can take your time to shop around without worrying about food. It is a big busy during weekends but you can always find parking because the lot is big.\nShow less"], ["Reviewed September 7, 2016", 5.0, "Nice Outlet Mall", "This is an outdoor outlet mall however it has a nice amount of quality stores. I found the prices to be pretty good!"], ["Reviewed September 6, 2016", 4.0, "A Great Place for a Deal", "The perfect way to end a great week before heading home. Citadel has your usual Outlet stores but it also has a number of stores I hadn't been in before including homeware stores. I couldn't help but walk away with both arms carrying bags.\nThe outdoor food court is great with a large range of food options and it is easy to sit and relax and loose time\nThere's also a range of other eateries scattered around if you so desire something bit more special.\nA number of amenities areas including toilets and parent rooms are within easy walk from anywhere in the complex\n\nDefinitely a place to visit if you want quality at great prices but just make sure you can show your taxi driver where it is, as not every local knows about it\nShow less"], ["Reviewed September 5, 2016", 5.0, "Centrally Located Outlet Store", "Citadel Outlets is the nearest outlet stores coming from LAX (Camarillo and Ontario Mills are further away). There are lots of name brand stores with very good deals. Come in early as lots of people come here and so parking would be easy. There is a food court if you get tired and hungry shopping. It was sunny and warm when we visited so hydrate because plenty of walking outdoors. Bring a roller luggage if planning for big shopping.\nShow less"], ["Reviewed September 2, 2016", 3.0, "a great variety of shops", "There is a wide variety of shops here for people to explore - lots of different brands covered, although the prices in some are not as competitive as you would hope. Be careful when shopping for a bargain - there may be other 'outlets' out there that offer better.\nShow less"], ["Reviewed September 1, 2016", 4.0, "Very good for shopping", "This place is highly recommended. Good price. Near the city. Also you can go too camarillo outlets too if you are a shop-addict. Great brands and stores. The foodcourt is also good with many options."], ["Reviewed August 26, 2016", 4.0, "Good choice for outlet shopping", "Overnight stay in LAX en route back to the UK\nFound it easy to drive to , about 35 minutes from Hollywood Boulevard though the freeways were very heavy with traffic\nAs others have said , parking spaces are hard to come by . We arrived at 1200 and had to drive around to find any sort of space\nFor the UK tourist , this outlet will cover 90% of your needs .apart from designer brands there are some high st names here as well . We only had a couple of hours but you could easily spend 4-5 hours here browsing every shop\nPlenty of eateries , rest rooms and a couple of customer service points\nShame for us that the rate of exchange is so lousy at the moment as it made some items as expensive as buying in the UK\nShow less"], ["Reviewed August 26, 2016", 3.0, "Best Bargain - An Ice Cream!", "These outlets (UK and USA) seem to have very little in the way of bargains, albeit they herald 20%/50%/70% discounts.\nOften, they sell items \"Specially bought in\" not originals.\nWe bought some Converse shoes at the same price they can be bought in England.\nOne of our party decided they would have an ice cream from the stall near GAP. On return, I queried why they had bought such a large one.\nApparently, this was the smallest available!\nBest bargain of the day.\nVery Very busy place. Manic car park.\nShow less"]]}}