{"Coit Tower": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Coit Tower", "url": "/Attraction_Review-g60713-d104674-Reviews-Coit_Tower-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/52/31/89/coit-tower.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "3926"}, "address": {"@type": "PostalAddress", "streetAddress": "1 Telegraph Hill Blvd", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94133-3106", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Great views of the city.", "We had to wait about 30 minutes to take the elevator to the top. The murals made the wait go by quickly. I would have liked to of known a little bit more about the tower, they didn't really have any history while we waited. There was a very small article about Lillie Hitchcock Coit and her bequest to the city to build the tower.\nShow less"], ["Reviewed 4 days ago", 5.0, "Great view, great exercise if you climb stairs!", "From atop the hill the Coit Tower sits on, you have a great view of the city from multiple directions. If you want to get higher, you can ride the elevator to near the top of Coit but we did not do that. There are three ways to get to Coit; walk/climb stairs take bus, or drive. We chose to walk and it was a lot of work! There are two sets of stairs and the starting point is around the Levis plaza. There is signage in the area for both of them. Once you get to the tower, you'll be treated to some very impressive murals at the base and a statue of Columbus in the parking lot. There are bathrooms here as well.\nShow less"], ["Reviewed 4 days ago", 5.0, "The shin splints were memorable souvenir", "We decided to walk up to Coit Tower from North Beach. It was quite the uphill walk. I did not see the parakeets this day, but saw them later outside of a random hotel. I would say that it was worth it. We paid for the elevator ride to the top. There, a helpful guide, gave us photography tips and posed us for the best shots! The views were breath taking!!\nShow less"], ["Reviewed 5 days ago", 5.0, "you have great views up there", "After reading about tight parking, we decided to walk over from Pier 39. Walking down the Embarcadero, cross the street to Sansome for two blocks then you will see stairs. Then, you climb and climb and climb. Take your time. You have to pay eight dollar to get on the elevator but the darn thing does not go all the way to the top. You have to climb more stairs to do so. But, the views at the top are incredible. There are nice murals on the bottom floor.\nShow less"], ["Reviewed 6 days ago", 5.0, "Amazing view in a night", "I recommend to visit it during a night (with wine much better), but take hoodie with you - could be cold even in a summer)"], ["Reviewed 6 days ago", 5.0, "Fantastic View", "You can appreciate the beauty of the city from Telegraph Hill and inside the tower the drawing of Diego Rivera and others, from the 210 feet tower built as a gift to the city. To get to the observatory you need to get a ticket and could take a few minutes to negotiate the lines. A statue of Colombo sits outside the tower.\nShow less"], ["Reviewed 6 days ago", 5.0, "Wow simply great views may be the best", "This comes a very close viewing option with Twin Peaks. The tower charges a small fee ($8) to go up the tower. Entrance to the ground floor area is free. However the views are just amazing. You can see the whole fo SF. One of the best views I have ever seen. Do it !!\nShow less"], ["Reviewed 1 week ago", 5.0, "You can't visit SF without stopping here.", "Stairs, workout, heart rate .......All good but the views of the Golden Gate bridge are worth the stroll up to Coit Tower!"], ["Reviewed 1 week ago", 4.0, "Another Iconic Landmark", "Go at least one time, look at it many times from different locations. Another historic landmark with a practical background."], ["Reviewed 1 week ago", 5.0, "Great views", "Worth to climb the hill. You will have a great view and it's also a Mustdo to get to the top. To get back to the pier, we took the stairs. If you are able to walk a bit steph paths don't miss that."], ["Reviewed 1 week ago", 5.0, "Great City View", "Easy to find with GPS and convenient parking at no cost. An elevator to near top but be prepared to walk up another 39 steps once you get off the elevator. An old fashion elevator with an operator taking you to the top and bottom. Open air at the top but a wonderful view of the city. A gift shop on the main floor once you exit and some wonderful paintings on the ground floor\nShow less"], ["Reviewed 1 week ago", 4.0, "High on a hill", "Have been seeing this city landmark all week. Chose to walk and it's a bit of a hike. Well worth it for the fabulous 360 degree views. Beautiful public space. If you are elderly or unable to walk there is public transportation or cars"], ["Reviewed 1 week ago", 5.0, "Historic Landmark", "Find the historic landmark on Telegraph Hill. Pretty during the day or night, it's a real standout. At 210 feet, it was built in 1933 to beautify the city."], ["Reviewed 2 weeks ago", 5.0, "Cool", "We hiked up the steep stairs then took the elevator all the way to the top. Great to get a sense of the city layout, and breathtaking on a sunny day!"], ["Reviewed 2 weeks ago", 5.0, "A must see in San Francisco", "The WPA murals that line the interior walls as you enter Coit Tower are amazing! We try and visit every time we come to San Francisco. Yesterday was a beautiful clear day so we took the elevator to the top for amazing 360 degree views."], ["Reviewed 2 weeks ago", 4.0, "Beautiful Coat Tower was built in 1933.", "At Telegraph Hill is the 210-foot Coit Tower. This elegant tapering column was built in 1933, the legacy of San Francisco’s Lillie Hitchcock Coit, who left a $125,000 bequest for the purpose of adding beauty to the city which he always loved.The ground floor lobby is adorned with a series of fresco murals by some 30 local artists, depicting life in 1930s San Francisco. The artists and murals were funded by President Roosevelt’s New Deal pilot art program, the Public Works of Art Project. They remain a colorful, insightful look back to a difficult time,\nBeautiful Coat Tower is seen from all around, Lombard Street, Pier 39, almost anywhere in the city.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Enjoy the view but for goodness sake go inside.", "The painting on the ground floor of the tower are not to be missed. the view from the top is worth the wait."], ["Reviewed 2 weeks ago", 4.0, "Fantastic views", "Steep walk up, or there is a bus from the piers. Very old fashioned lift, nice murals. Pleasant small park outside"], ["Reviewed 2 weeks ago", 5.0, "You can easily see Coit Tower from just about anywhere in San Francisco...take a walk (or drive) to get to the top!", "Since we were staying in the North Beach neighborhood, Coit Tower was fairly close (walking distance) to get to Coit Tower, then when you enter you get some great views of beautiful art....and pay the extra small fee to take the elevator up....with a series of steps to get to the very top for amazing 360 degree view of ALL of the beautiful San Francisco sights and landmarks!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful Tower", "The Coit Tower is a beautiful tower to visit with a great view from the top. The parking is not good and it’s tough to get a spot. They cut off ticket sales half an hour before tower closes so make sure to arrive before then. The view is still good from the top of the hill around the base of the tower. Make sure to check out the murals inside the tower.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing views!", "A 360 view of the land, history dedicated to firefighters....Buses take you right to it! Easy to get to ."], ["Reviewed 2 weeks ago", 5.0, "MUST VIEW SAN FRANCISCO FROM THE COIT TOWER!", "Even if it's a quick trip to SF - climb the steps to the top of Telegraph Hill and take the ride up to the top of the Coit Tower...it's an old fashion view of the city as it spreads out below and across the bay...but, it's worth the side-trip!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing views", "This is a must visit. You can see for miles on a clear day. Views are amazing. There is an elevator and about 20 steps to the top. Murals in the lobby are incredible to view while waiting in line to go up the elevator."], ["Reviewed 3 weeks ago", 5.0, "Coit Tower San Francisco", "A long, uphill walk from the dockside in San Francisco with steps on the last ascent, it’s much easier to take a local bus which drops you right outside. A brilliant building with lots of artist murals on the lower floor which are free to view. The elevator takes you up 10 floors after which you climb two floors by stairs. It is worth it! The views are absolutely unrivalled; Lombard Street – the wriggliest street in the world, Fisherman’s Wharf complete with sealions, the financial district with endless skyscrapers and, of course, Alcatraz. $8 gets you to the top, one of the cheapest things you can find in San Francisco.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Good views but...", "...half the windows are shut, so you have to queue to get a decent picture, and some staff can be presumptuous and controlling, telling you to where and how to take the best photographs. I'm a pro, dammit!"], ["Reviewed 3 weeks ago", 5.0, "360 View", "Beautiful area. Be ready to walk some stairs, both to get to the spot and then inside after the elevator ride too. But it is like a piece of heaven in the middle of the city - take a lunch or snack and enjoy the lawn after going up. The elevator attendant was so cheerful. You get to see the city, the bridges, Alcatraz, all around from all windows. If it's not too crowded, the attendant will even take some special photos of you (they know all the right spots!).\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Romantic view of the city", "It's a hike to get up the hill, but we did it again, on our second visit. Coit is a perfect place to start your trip in San Francisco. You can see over the city in all directions. It closes at 5 pm, so it's a bit early for the sunset, but still beautiful any time of day. Very friendly employees and volunteers there! Easy elevator ride to the top after your climb up the streets. Beautiful trees and plants surround the tower, too.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful Views!", "We visited on a Sunday afternoon when there were short lines and decent parking. Of course the views were breathtaking. We stayed up top over half an hour just enjoying the view. The next best part of the tower wasn't the murals. It was the staff. Everyone from the ticket agent to the elevator operator to the guides were cordial, knowledgeable and laugh a minute! It was a memorable experience.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Nice view", "From this tower you have a very nice view on the city and sea! The area around it is quiet and pretty."], ["Reviewed 4 weeks ago", 4.0, "Cheap admission and nice views", "The tower has a really cheap admission price and you get good views of the Bay and the San Francisco Pyramid tower."], ["Reviewed 4 weeks ago", 3.0, "Good views but long lines", "We went to Coit tower to see the spectacular views but were disappointed by the experience. We walked all around the city that day and saw great views (there are great views just in the parking lot of Coit tower) There is a fee to go up into the tower and once you get to the top you cannot even take nice pictures because the \"windows\" are covered in plexiglass and it is packed with people. The line for the elevator builds quickly due to the limitations of the car, and it goes around the area where one would like to admire the murals. Of course you can see some of the murals while waiting for the elevator but it definitely takes away from the overall experience. A small parking lot with a wait to park on busy days is another downside to the experience.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Superb views and great murals", "Get a ticket for the elevator at the bottom of Coit Tower and whilst you queue to go up take time to study the detail in all of the murals depicting - California Industrial scenes; a library; city life; a department store; agriculture.\nOnce you get to the top after a brief elevator ride the views are superb. Starting from the right is the Financial district and the Transamerica Pyramid building; then slowly panning left, next is the Ferry Building the pier where the San Francisco Belle (working paddle steamer) is moored with Bay Bridge in the background; then Pier 39 and Fisherman's Wharf with Alcatraz in the background; then Fort Mason, Crissy Field, the Palace of Fine Arts and Lombard Street and its 8 switchback curves in the foreground, with the Golden Gate Bridge in the background.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Cool views", "Going up the tower costs under 10$ and you get to see great views of te city. This was our first stop after arriving in San Francisco and it was a great one. After seeing views from the piers, Golden Gate Bridge and Alcatraz though, i feel like the views from the tower weren’t that « amazing ».\n\nRegardless it’s still worth it - especially if you walk over to it via the hidden staircases... they are absolutely beautiful.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Great views", "Coit tower is in a great location. we were lucky enough to catch a lovely sunset from here. We watched the sun go down behind the golden gate Bridge. Unfortunately the tower itself was closed by the time we go there. but it is a lovely walk up and down.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Best views of San Fran", "This is a wonderful place for the best views of the city. Golden Gate bridge on the left and Bay bridge on the right with downtown behind you.\nPick a clear day, it's worth waiting for one! There are two good approaches, one from the Embarcadero side up Greenwich Steps and one from Filbert street. If you're not driving to Coit Tower, pick Filbert Street, coz the climb up is not long. Greenwich steps are a long climb and more tiring. And it's nicer to exit via the Greenwich steps, a lovely walk down stairs through gardens, broken by views of the bay.\nInside, the base of the tower shows off the murals by various artists brought together under the Public Works of Art project. Plan to spend at least half an hour looking over these. The elevator ride up to the top of the tower needs a ticket which you can purchase on site. The views are somewhat similar to what you can see from the base of the tower.\nThe area is a \"park\" so you can spend as much time as you like on the hill.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Great 360 degree views", "It is very busy in the holiday season and expect to line up as there is a limit on the number of people that can go up at any one time but worth it when you get there.\nWe walked to it from downtown but make sure you are reasonably fit as the gradient gets very steep and it's further away than it looks.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great art on the cheap", "The murals! Even if the art were located in a basement, it would be well worth a visit. But great views come with the elevator trip, and it’s very reasonable. For years, this was my favorite SF destination, only eclipsed by the Legion of Honor museum.\nShow less"], ["Reviewed January 21, 2018", 5.0, "The Best views!!!", "This a Must for visiting SF the Coit tower has the best views for any point of the city your pictures ate going to be the best ever!!! get the tickets in advance and you avoid the line to get in"], ["Reviewed January 20, 2018", 5.0, "Amazing views of the city", "On a clear day the views from the tower are amazing. The walk to the tower up the hill is a workout. The lift up the tower is a crush. The views are the payoff."], ["Reviewed January 19, 2018", 3.0, "Nice murals but long wait and disappointing view from top", "A very good view of San Francisco from outside at the bottom of the tower, but the view from the top was slightly disappointing given my expectations. Effectively one stands on the top floor of the tower surrounded by a concrete wall with windows from which you can see out, with other tourists make getting a good view even more difficult. Wait to get in was approximately 45 mins though was made less tedious by the extensive, rather aesthetic and extremely detailed murals (and very educational, should you wish to read the explanations) covering the walls in the waiting area as you walk around in the queue. Perhaps to save money and time one might bypass the ascent of the tower and enjoy the view from the outside. Note also the unnecessarily long wait for amenities outside the tower due to the self-cleaning process , though there are toilets inside.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Views~", "You have to walk up this tower! It is such a dope view from the top -- highly recommend. It is worth the time!"], ["Reviewed January 15, 2018", 4.0, "Great views even without entering the tower.", "Great views even without entering the tower. Yes, It is not really a must to enter the tower itself. You do see most from the bottom of the tower. But the way to it is great and the hill is splendid and worth your time."], ["Reviewed January 14, 2018", 5.0, "Best view to the bay", "It was a last minute visit we did and we almost lost this one. The view from the top is great. In a clear day one can see the bay and the city pretty well."], ["Reviewed January 13, 2018", 5.0, "The best viewing location of this city", "It is a 210-foot concrete column on the top of the Telegraph Hill. There is a small parking lot by the entrance, which you need some luck and patient to find a space. (People come and go quickly so, just wait). The parking is actually free! You could also walk up the hill to reach it. The top of the tower costs $8 for an adult. The view of SF from above is magnificent. A must do in San Francisco\nShow less"], ["Reviewed January 13, 2018", 5.0, "Beautiful Panoramic Views", "Telegraph Hill and Coit Tower is the perfect location to view the Bay Area in its entirety on a clear day! Well worth the short wait for the elevator ride."], ["Reviewed January 12, 2018", 5.0, "Amazing views and worth the effort", "It seems like many tourists in San Francisco skip this attraction which is a shame because even the walk up to the tower was well worth it. Some locals recommended it which was why we went. The tower itself is quite interesting with murals inside and an elevator ride to the viewing platform. We bundled this into a day of hardcore sight seeing, we'd previously walked from Union Square to Fisherman's Wharf, then along to Ghiradelli Square before finding our way to Coit Tower and then a walk to Lombard Street. I'd definitely recommend a visit if you find the time!\nShow less"], ["Reviewed January 9, 2018", 4.0, "Breathtaking views of SF", "I went to city many times but never went to this place. I had family visiting us so took them to show them the city and golden gate. had some extra time so took them to this tower. Unfortunately the elevator was closed at 5 PM we got there by 5:05 PM. But the views from even the telegraph hill is amazing. parking on the hill is very limited. i went there on Monday at 5 PM so I found parking very easily.\nShow less"], ["Reviewed January 8, 2018", 4.0, "A big climb to see a wee gem", "Hubby decided we should walk all the way up to catch the amazing view from the top of the tower. Sadly I forgot to pack the oxygen mask and defibrillator. What a climb! With steep hills and too many flights of steps to negotiate. we made our way up from sea level. Slowly.\nAs a ‘Munroe Bagger’ (hill walker) hubby set the pace saying ‘start at the pace you can maintain all the way’ - which he did. A snail ‘s pace! I found going so slow was harder on my old bones and would have preferred to take a longer, quicker stride. However as he is many years older than me and in his 70s, his experience and his plan worked for him. Slow and steady wins the race. We finally made it to the top. And the tower was shut!\nIt was just beginning to get dark so the views of the semi lit skyline were amazing. But we wanted the ‘real’ view from the top of the tower and to see the murals as well, so we went back next day - on the number 39 bus! And we were so glad we did.\nThe view during daylight hours ate stunning as expected. What wasn’t expected were the stunning murals that decorated the walls on the ground floor of the tower. They are a must see. You don’t even pay to see them. You only pay $5 pp to go up and down on the lift.\nCoit Tower does not get the same publicity as the likes of Lombard St, Pier 39, cable cars etc but it should. It really is a little gem. And I’d take the 39 bus no matter your age. Then you can enjoy the views and the ride on the way down.\nShow less"], ["Reviewed January 7, 2018", 3.0, "Great for history lovers and pictures", "It is a great spot for people who love history, it has a great story of the woman who it wes built for. It also is a great spot for pictures of San Francisco itself, the Golden Gate Bridge, and Alcatraz (need a good camera for the last two). The view is amazing and you can go inside the tower. You can go up top for a great view you just have to climb a lot of stairs. I’m 20 years old and I honestly thought it was boring. It was great for pictures but once that was done I just wanted to leave. You can get a picture of the tower from anywhere else in the city, I didn’t really feel the need to go there.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Walking up is the highlight.", "Walk up one side of the hill and check out the beautiful houses that survived all the major earthquakes; challenging for the residents to furnish but a treat to wander up the little access path. Walk down the other side and enjoy the views."], ["Reviewed January 4, 2018", 5.0, "A Room with a View!", "Take the grueling steps from the bottom, or just Uber to the tower. Either way - don't miss the breathtaking vistas! The best place to see the WHOLE lay of the land from a top Historic Telegraph Hill. Park guides can answer all your questions. The murals on the ground floor are fun as well. Murals are free to see. The elevator ride is a nominal fee.\nShow less"], ["Reviewed January 4, 2018", 5.0, "The most beautiful view of the most beautiful city", "We didn't stand in line and pay to go to the top of the tower. We walked the steps leading to the tower (fairly grueling) and strolled around. We discovered the back of telegraph hill from there to continue our exploration. Gorgeous!"], ["Reviewed January 3, 2018", 4.0, "360 degree view of SF city, bridges and bay", "Staff members are knowledgeable. Can't beat the scenic views! View deck is NOT handicap accessible, but free to look at murals on ground floor and they are very interesting."], ["Reviewed January 3, 2018", 5.0, "Cool view!", "Cool view. City center so really easy to get to and drive by to check it out. You see this tower from everywhere in the city so it is just really nice to see it up close."], ["Reviewed January 3, 2018", 4.0, "Great views", "$8 to take elevator up to top to see the great views. Free to walk the steps. cool art deco building"], ["Reviewed January 2, 2018", 5.0, "Fantastic Views", "WORTH the wait. This was worth the wait. The views were amazing. You could see the entire city from the tower."], ["Reviewed January 1, 2018", 4.0, "One of the best views of San Francisco", "Visiting Coit tower is a bit of a (steep) walk, but definitely worth the effort. We were there at night and the views (almost 360 degrees) of San Francisco, the Oakland and Golden Gate bridges, along with the downtown, Wharf and Embarcadero areas were fantastic."], ["Reviewed January 1, 2018", 4.0, "Great view of San Francisco", "Like a lot of other things in San Francisco, you have to do a fair amount of going up the hill to get to Coit Tower. Some of the surrounding streets are so steep that you have to wonder how one with a stroller or as such, can manage going downhill!\nYou'll get on an elevator to get almost to the top and then you'll take some stairs to finally reach the top. As noted from outside, the tower is not that wide and we were lucky we were there when it wasn't busy. There are windows all around so you can view San Francisco from different angles. We went there mid afternoon but I imagine it would look magnificent during sunset hours.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Does it really look like a fire nozzle?", "Does it really look like a fire nozzle. As I climbed the steps through the North Beach neighborhood I continued to contemplate if it was a nozzle or simply a reason to build a tower. Terrific view of the bay and city as I meandered up the hill. Weaving and dodging among the houses and building. No straight line pathway to the tower. Just a very interesting walk. Tower views were worth the walk.\n\nThis is a must do walk if you journey to San Francisco.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Didn't Get to the top.", "We ended up not being able to go to the top of the tower but the walk was worth it. The view is incredible. We walked up Lombard street and then went down through a bunch of steps that was incredible. So glad we make the walk. Maybe next time we'll try to get there early and go up the tower.\nShow less"], ["Reviewed December 27, 2017", 5.0, "great view of the city", "Staff is very colorful for your assisted ride to the top of the tower. A few steps up after that. Several viewing areas, great spot for selfies."], ["Reviewed December 24, 2017", 4.0, "Nice view", "If you have time this is a worth checking out. You can either drive up or hike up from North Beach area. I would do the latter if you have time as it can get busy with cars as there is limited parking."], ["Reviewed December 23, 2017", 5.0, "Beautiful tower and views", "Beautiful architecture and park with magnificent 360 degree views of San Francisco and surrounding area. You can see the Golden Gate Bridge, Alcatraz, the Oakland Bay Bridge and other SFO landmarks from here. We had a beautiful clear day!"], ["Reviewed December 21, 2017", 4.0, "Up the Coit", "Coit Tower is a relaxing and enjoyable walk which every family visiting San Fransico should experience. Start the walk at the park at the bottom of the hill that Coit Tower sits on. At the top of Coit Tower is a great view of San Fran, Alcatraz and the bay.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Still one of the best views in the city", "After walking up Telegraph Hill all the way up Montgomery from Market St., my legs were jelly while climbing the stairs up to Coit Tower. But, it was all worth it. The murals inside are stunning in their simplicity and detail. Spend some time to view them all closely, they really do deserve attention. Then, take the elevator up to the top of the tower. The elevator operator is a great diversion. Once at the top, enjoy the views of the bay, the city, and everything for miles and miles. Breathtakingly beautiful on a clear sunny day.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Get great views of San Francisco", "While you are exploring the streets of San Francisco, be sure to take time to visit Coit Tower. Telegraph Hill has some beautiful homes and streets that are worth the visit, as well. You can catch a bus to Coit Tower or you can walk up the hill. It's a pretty decent climb, so keep that in mind.\n\nWhen you get to the top, you'll be able to experience some great views of San Francisco from the tower and the surrounding property. The visit inside the tower and to the top is worth it if you are willing to spend the extra money and time. Otherwise, you can find very good views around the outside of the tower. It's an SF landmark that is well worth a visit.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Superb views", "Catch a bus right up to the door. There is a small charge to ride the lift up to the top. The views from the top are wonderful. While waiting for the lift enjoy the very interesting friezes depicting scenes from San Francisco's history. Highly recommended.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Amazing views", "9$ is a good price to get the chance to enjoy the most fantastic view os SF and the Bay. If you don't want to walk you may take a bus right to the tower."], ["Reviewed December 17, 2017", 5.0, "Must visit", "Surely the best view over San Francisco. The tower is visible from almost every place in the city but it is a bit tricky to find the way. Of course, you can get there by your own car or taxi, I think there was some Muni bus too, but you can just walk.Up the road or the stairs. The stairs are on two sides of the hill but those from sea-side are really well hidden. In any case, I promise you will be captivated by the final view from a top of the tower. There is an entrance fee, but not high (I don't remember exactly but I think it was under 10$)\nShow less"], ["Reviewed December 14, 2017", 4.0, "Nice view while you catch your breath.", "Great view of San Fran.\n\nYou can drive up but I prefer to take my visitors up using the Greenwich stairs (corner of Sansome and Greenwich streets). Pretty exhausting trek up hundreds of stairs but exhilarating when you make it to the top.\n\nYou can then drop down casually towards Northbeach for a nice meal...you will have worked up an appetite.\nShow less"], ["Reviewed December 13, 2017", 4.0, "Good Panoramic Views", "An absolute hike to get to, but it definitely gives you a very commanding panoramic view of the Bay area.\n\nWorth a visit, but I would probably recommend against walking the many steps to get to the base of the tower, unless you enjoy the exercise.\nShow less"], ["Reviewed December 8, 2017", 4.0, "Earn the view", "Coit Tower is nice enough and worth getting to, but you should do it the hard way - up the 453 steps. The avenues and up-close look you get into some absolutely gorgeous homes is worth the sore calves."], ["Reviewed December 8, 2017", 4.0, "Morning Walk", "Not necessarily an easy place to navigate to, but if you’re up for an uphill walk, it’s totally worth it!"], ["Reviewed November 30, 2017", 5.0, "Best view, especially at sunset", "This is a fun tourist attraction. There is a small fee for the elevator but it's so worth it. If you time it just right and in the right season, you can watch the sunset from the tower. There is a great view of Alcatraz too.\nShow less"], ["Reviewed November 30, 2017", 4.0, "Amazing view", "This is one of the places that you do not have to miss during your visit to San Francisco. The view is amazing."], ["Reviewed November 28, 2017", 4.0, "Great view for a over priced city", "Coit tower has been a lover's lane of a place now for a couple three decades . It has a famous old tower built that was named after Sanfrancisco's older quaint residences by name of Lily Coit .who use to chase fire engines down the street in her bathrobe and curlers . They say she loved these fire trucks but it was the men in the trucks she was crazy about . So when she passed away they made this tower in the shape of a fire hose nozzle . and named it after her L. Coit. .The road up to the tower is lined with expensive homes that costs in the millions . This is one of Sanfrancisco's most exclusive neighborhoods too . Coit tower has a little gift shop with post cards and cheap souvenirs too .\nShow less"], ["Reviewed November 27, 2017", 5.0, "Worth the Trip", "Took the cable car near our hotel ( Cartright Hotel Union Square) to Union Street caught the number 39 to Coit Tower for the views of San Fran. There is an admission. Took elevator up to the top and the views were great. You can see the whole area . The tower is circular so everything is there for you Recommend\nShow less"], ["Reviewed November 27, 2017", 5.0, "Excellent Attraction", "I went up here near the end of my time in San Francisco. I wish I had done it earlier. Though it is a hike to walk there and then there is the elevator ride to the top ($5 for seniors), the view was amazing. The one drawback was that though you could see for miles, the windows were not all open so you had to wait your turn to get a good photo without reflection of dirt in the way. Other than that, stop by and enjoy\nShow less"], ["Reviewed November 26, 2017", 4.0, "Great Views", "Great panoramic views of the city from the top of Coit Tower. The viewing area is quite small so can feel busy at times. Well worth a visit."], ["Reviewed November 25, 2017", 4.0, "Great Views", "Well worth the long walk up the steep hills to get here. I was a bit worried we would then have to walk up stairs to get to the top, but never fear there is a lift! $8 per adult and $5 for youths up to 17 years old. The murals painted on ground floor are amazing and the wait time wasn't too long. Looking at the murals and the cool breeze coming in through the open door allowed me to cool down after the steep walk up here. The staff are all friendly and the views from the top are fantastic. A great place to visit. The lift to he top is optional and that is all you pay for. It is free to enter into the lower floor where the murals are painted\nShow less"], ["Reviewed November 22, 2017", 5.0, "Fantastic View", "Amazing view. Great story about how it is named after Lillian Coit who was the first women firefighter honouree. Lots of walking to do if you want or just drive up and enjoy the view. Come early as lines are long in the afternoon with cars waiting to park.\nShow less"], ["Reviewed November 21, 2017", 4.0, "Great views!", "Well worth the short wait to take the elevator ride up to the top. You can look out in all directions (360 degrees) and see the city from the top of this hill. No such other vantage point in the entire city!"], ["Reviewed November 20, 2017", 5.0, "Amazing views of San Francisco", "The history of the tower is interesting enough but really it is the views from the top that make the steep walk up the nearby streets that make the effort worthwhile. Pay the $5.00 per person for the short elevator ride to the top; bring your camera or phone and enjoy wonderful views of San Francisco. Probably would not bother if the weather is not conducive to good views\nShow less"], ["Reviewed November 18, 2017", 4.0, "Parking it tough!", "So get there early. Fabulous panoramic view of the city, the bay, the Golden Gate Bridge, even Alcatraz ."], ["Reviewed November 18, 2017", 4.0, "Amazing view of the entire SF", "It wouldn't be my top sightseeing priority while at SF but if you have spare time be sure to visit this place for an amazing view of the city.\nThe only thing to keep in mind is that you should try to visit while there is no fog (I know, kinda hard to do in SF) so that you can get the best view of the city.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Nice place to visit", "Great views, nice peaceful area to visit. There is a bus which goes up the hill from fisherman's wharf if you dont feel like walking. Lots of birds and native plants. Nice murals inside as well. Was a short wait for the lift, but not too bad.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Panoramic City Views", "We saw the Coit Towers from Chinatown and decided to walk there! It was quite a hike up a relatively steep hill but so worth it especially after a big dim sum lunch!\nAn elevator takes you 210 feet up to the top of the tower.\nPanoramic views of SF of Golden Gate Bridge, Alcatraz, the Bay and entire city is breathtaking.\nThey limit the number of people up on the view tower which makes it very enjoyable.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Must Do on a clear day!!", "We were advised to visit Coit Tower by a worker in Stovepipe Wells. The walk up to the tower itself was taxing but we got to see Telegraph Hill and archetypal San Fran housing. After looking at ground floor murals we took the elevator and enjoyed fantastic 360 degree panorama of the bay and city. Great value but don’t go on a foggy day.\nShow less"], ["Reviewed November 14, 2017", 5.0, "An awesome attraction.", "Coit Tower is one of our favorite attractions. Once you make the challenging trek to get up to the tower, you are greeted with 360 degree views of San Francisco. Taking the crazy stairs and path back down to the Levi Building below is a lot of fun. It's a great workout with a payoff at the end. A must see SF attraction.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Wonderful views", "It is a steep climb to this interesting landmark ,but the views from the top ( or even at the base of the tower) are spectacular.\nThe murals within the tower are both beautiful and fascinating and I wish we had been able to spend more time scrutinising them\nShow less"], ["Reviewed November 12, 2017", 3.0, "Great Views", "San Francisco is pretty hilly so there are plenty of places where you can get vies of the city. Coit Tower is one of the highest points and there are great views of the city and the harbour from the top. Even better there is a lft so no stairs to climb. Waited maybe 15 min to get to the top.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Visit during the week", "We stopped by during the week and visited the tower. My son and new bride enjoyed seeing the tower and taking the ride on the elevator to the top. The phrase we heard during the visit made a lot of since \" it was built as a monument, not as a tourist attraction.\"\nShow less"], ["Reviewed November 12, 2017", 5.0, "Best Views", "At the end of a long day, we took the bus up a winding street to get to Coit Tower. After a short wait for the elevator, during which we got to view the Depression-era murals on the first floor, we went to the top and got the best views of the City, the Bay and the Harbor. The views are exhilarating.\nShow less"], ["Reviewed November 12, 2017", 5.0, "SEGWAY TO THE TOWER!", "We enjoyed views of the city and interesting history about the tower as part of a Segway tour. This is an iconic and worth visiting spot in SF. Taking a Segway up is fun because parking is limited."], ["Reviewed November 10, 2017", 4.0, "Great views - long wait", "The views at the top of the tower are awesome. However, we ended up waiting around an hour to get up to the top. If the wait was shorter i would definitely go again."], ["Reviewed November 9, 2017", 5.0, "One of the MOST San Francisco of San Francisco places", "If you are in San Francisco, make the effort and pay the money to go into Coit Tower. My mother used to visit Coit Tower in the 1940's when she was stationed at Mare Island in Vallejo. There are amazing murals inside Coit Tower and the views from the top are unequaled in San Francisco. This is one of the most special spots in a magical and wonderful city that is FULL of special spots.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Best Views of San Francisco", "It was just a ten minute wait for me, so I visited the Coit Tower and am glad I did. The views were incredible, and not overcrowded, making picture taking nice and easy."], ["Reviewed November 7, 2017", 4.0, "Nice views, but not much else", "The tower is just that: A tower; nothing else. It’s not an office or commercial building with public access to a viewing platform on the top floor (as is the case in many other places). Apart from a toilet inside the building (and a public one outside too), and a small shop selling pricey trinkets and T shirts, there are no other facilities. The tower was built in this rather isolated, but elevated spot, to serve only as a lookout. There are some interesting and colourful murals on the ground level which you can see on your way out.\n\nYou’ll be taken up in an ancient, but well maintained, lift to the top. The ride takes just over a minute and you’ll be accompanied by a parks official, which gave us extra comfort. The view from the top is extensive and expansive in all directions. You'll get an especially good view of the Bay Bridge and if you’re lucky and it’s not too foggy, you'll see the G.G. Bridge as well. You’ll see Alcatraz and the whole city of S.F. stretched out in front of you.\n\nWe booked tix online and paid $19 for one senior tick and one regular tick, and that included all the hated taxes and something called a “convenience fee”.\n\nFrom our hotel near Union Square, we took an Uber to Coit Tower, and paid just $7, although bus no 39 also goes up there.\n\nOverall, it was worth the money for the views, but don’t expect to find much else there besides the tower.\n\nWhen you leave, you can walk all the way down about 150 steps and you’ll end up at Levi Plaza, which was quite fortuitous for us, as we had wanted to go anyway, but had not figured out how to get there. You can get a nice lunch at the friendly Starbucks there.\nShow less"], ["Reviewed November 7, 2017", 4.0, "great views", "The staff/volunteers are very nice and the experience at the tower was worth it. The 360 degree views of the city are impressive."], ["Reviewed November 6, 2017", 5.0, "excellent views", "Don't miss Coits Tower its fun and its free lovely views across San Francisco ,good parking available and I tink you can get there by public transport"], ["Reviewed November 6, 2017", 4.0, "Coit Tower - Worth the Climb", "Coit Tower, on the top of Telegraph Hill, is a perfect spot for sightseeing and views. For a small fee, you can also take a small elevator just about to the top, then walk about 40 steps to the top of the open observatory. From the top, you get a complete 60 degree view of the city and the bay.\nIn the main level, there are lots of beautiful murals depicting historical events and depictions of agricultural and other stories of ways of life in the early 1900’s.\nYou can take a bus #39 to the top, or hike your way up via the road or a series of stairs called the Filbert stairs starting near Montgomery Street.\nShow less"], ["Reviewed November 6, 2017", 4.0, "The walk, the views - it's all worth it", "We arrived in San Francisco after the long haul Melbourne flight. Rather than sleep and risk worsening our inevitable jetlag we decided to walk off the travel dregs. We meandered our way to the Coit Tower and stood in awe - the views from up there are truly stunning and on a clear day (no this isn;t the beginning of a song) you can see for miles and miles; landmarks and cultural filmic iconic we all have our own images of.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Breathtaking views", "A must do walk to the top. Not too difficult but the steps to the tower do leave you breathless. Once there the views are stunning. Was there early so it was quiet and the tower itself wasn’t open."], ["Reviewed November 4, 2017", 4.0, "Fantastic views.", "We were lucky as it was very quiet when we visited and we were able to walk straight in and go up the elevator without waiting although the man said it does get really busy during the summer time. The views at the top of the small tower are amazing and the lady who works lady was really friendly and taking everybody's picture for them. Glad we went at a quiet time as I don't think I would queue as the top of the tower isn't very big and I think you might struggle to get a good picture from the window. There are also nice views from the car park area and gardens at the top before you go in.\nShow less"], ["Reviewed November 2, 2017", 3.0, "Not worth it IMO", "We stood in line for the elevator for quite a while. Paid $8/person. Finally went up and of course view is great but I didn't feel like we were looking at anything you couldn't see from the top of any of the higher hills there, Most of the windows are covered in plexiglass with the odd one that's open on each side. You have to wait to be able to take pictures out the open glass, It's a small space, You kind of feel guilty spending too much time up there because you know there's a ton of folks waiting in line downstairs, Seemed pricey for what you get,\nShow less"], ["Reviewed November 1, 2017", 5.0, "Great views all around", "The tower its self is pretty ordinary but its worth the visit because of the fantastic views you get from the top.\nIt was only $8.00 to enter,there are no stairs there is a lift ,you are taken to the top by a very jolly lady .\nAt the very top there are about 6 stairs you then enter into a circular area that has great views of the city and the bay.\nPlenty of windows so you can get shots of the whole city and area.\nThere is a gift shop and toilets at ground level also a small car park.\nThe tower is near to the Filbert steeps but we never found them.\nWell worth the time to visit.\nShow less"], ["Reviewed October 28, 2017", 3.0, "Wait for a view", "Arriving to find a line to buy a ticket, quite another long wait in the tower hallway for the elevator. As a woman repeatedly reminded people not to touch the murals on the walls and not to sit or lean on the rails around the paintings. Let's just say she enjoyed her authoriry... We finally made it to the elevator, loaded in by 5 or so... made it to the top of the tower. It is a view of the city and a nice monument, but a quick glance out one of the windows wasnt worth the wait and nagging instruction we endured. The statue of Christopher Columbus outside has been vandalized and now has red hands and wears the words American Genocide.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Perfect Viewpoint with great surroundings", "It is well worth the $8 (at time of writing) to go up the Coit Tower, and it is worth waiting in line to do so if you have to. The views from the top range out over the whole of the Bay and downtown. On a clear day, lingering at the top to take in the scenes at each lookout point is highly recommended.\n\nThe wait to ascend is alleviated by some excellent murals depicting various aspects and figures of historical San Francisco and Californian life.\n\nThe building in general is a delightful Art-Deco work, and the surrounding park, although not huge, is a great place to unwind and enjoy seeing the parakeets and hummingbirds that live there.\n\nI'd recommend walking to it up the Greenwich stairs from Sansome St., which takes you up through an urban garden park created by one of the residents, and seems largely unknown.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Breathtaking view", "Take bus 39 from pier 39 to the front entrance of Coit Tower. Admission is only $5 for seniors to ride up the elevator. Take your camera for pictures of downtown SF, Alcatraz, Golden Gate Bridge and much more. Walk down Filbert Street 438 steps to Embarcadero-lovely gardens along the way.\nShow less"], ["Reviewed October 26, 2017", 4.0, "A fun trek from Union Square to catch awesome views of the Bay", "Agree with previous posters, some staff is a bit cold or unwelcoming. Such a charming piece of history - it'd be nice to have some approachable personnel to ask questions if you had any. Overall, very enjoyable due to the sights and view."], ["Reviewed October 25, 2017", 5.0, "Lovely tower honoring a wonderful woman", "We all enjoyed the steps going up to the base of the tower. The paintings depicting early 1930s San Fran were interesting to look at and kept us busy while waiting in the fairly substantial line. View was beautiful!"], ["Reviewed October 24, 2017", 4.0, "On steep summit, views, murals", "On the map it looks close, but in SF there usually a huge hill in the way. Consider buses unless fit. The tower entrance has Depression paintings, small lift up; stunning views, some through open windows. Talk to the staff, knowledgeable,"], ["Reviewed October 24, 2017", 5.0, "Well worth the visit for the view.", "We walked to the tower all the way from the top of Lombard Street. Because we didn't want to wait for the tram. All down hill so it was really a no-brainer. The line to get into the elevator is pretty long but the paintings depicting life in San Francisco are pretty spectacular to view while you are waiting. Us and another couple (strangers to us) entertained other visitors with witty reparte over the automated (smelly and not recommended for use) toilet cubicle outside the building. (Big enough for two so you can see where that was going). Once up on the viewing floor tho everything else was forgotten. 360º! You could see for miles! Spectacular. Lots of photo worthy moments with a close up lens.\nShow less"], ["Reviewed October 23, 2017", 3.0, "A little steep", "Not that convenient to get to but the irws from here are nice but not as nice as from the GG bridge. You can see this tower from the water"], ["Reviewed October 23, 2017", 4.0, "Great views", "Long queue to go up in the lift, and its small at the top, but offers great views, and gives a good perspective of the city."], ["Reviewed October 21, 2017", 5.0, "Historic Tower with magnificent 360* views", "Located on the top of Telegraph Hill in the middle of North Beach, Coit Tower was constructed after socialite Lillie Hitchcook Coit bequeathed funds in 1929 for the beautification of SanFrancisco. The tower was completed in 1933 and the murals inside the base of the tower were added in 1934 by artists commissioned by the WPA. Admission to the gift shop and murals is free, while there is a charge to ascend the tower via a small elevator. The 360* views from the small observation deck are magnificent on a clear day. The tower is open daily from 10am to 6:30pm with guided tours of the murals on Saturday at 11am.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Just Take the Bus!", "On Sat. 9/9/17, we took the 1:46 pm #39 Coit Tower Bus from the stop on the esplanade just across the street from the entrance to Pier 39. It comes about 6, 26 and 46 min. s after each hour and drops you off at the tower located at the top of Telegraph Hill. The bus arrived at the tower at about 2pm. We enjoyed seeing the Art Deco style murals in the lobby depicting the 1930’s men & women at work in the city and in the county. However, there was a long line for the elevator and it took about 45 minutes to get to the top. The observation level was not crowed and we had great views of downtown, the Embarcadero, Fisherman’s Wharf area and West San Francisco. After the visit we walked 2 ½ blocks down Filbert St. to Washington Sq. where there are other bus connections. It is open every day 10-5. You might want to get here either early or late to avoid the crowds.\nDid this review earn a “Thankful” vote?\nShow less"], ["Reviewed October 18, 2017", 5.0, "Great views", "Best is to either walk here or take Uber/Lyft/Taxi - not much parking. The expected great views on top but walking around the base offers some really good views through the trees."], ["Reviewed October 17, 2017", 5.0, "Fantastic views", "We have been here twice. It gives fantasic views of the city. The place goes way back and is iconic."], ["Reviewed October 17, 2017", 4.0, "great views", "Great views of San Francisco from the top. Price is a little steep at $8/person for the 15 minutes you spend in the tower."], ["Reviewed October 17, 2017", 4.0, "Excellent views!", "Worth the trip and the fee to see the 360 degree view of San Francisco! Enjoyed the murals on the first floor!"], ["Reviewed October 17, 2017", 2.0, "Horrific staff member, beautiful views", "The title says it all. The views from the top are absolutely magnificent. On the other hand, we encountered the most condescending, patronising and rude staff member we’ve ever seen at a tourist attraction. She scolded a 40-year old man for finishing a lollipop (he was eating a piece about 2mm big) on our way down in the elevator and then made snarky comments about how she’d take “a million dollars out of your Swiss bank account” to refurbish the Tower. I mean, seriously? She also snapped at me to take my backpack off in the elevator (I would have hit the girl behind me, who told me not to worry), and then went on to berate me in front of everyone. Needless to say the elevator ride was incredibly uncomfortable - no one knew how to react because it was so shocking. I saw her pick out people and start ranting at them and patronising them at several points during our visit. Trust me, you will know her when you see her.\n\nShow less"], ["Reviewed October 16, 2017", 5.0, "Great views, especially the Blue Angels!", "We were lucky enough to visit San Francisco during Fleet Week which featured the Blue Angels. When we visited Coit Tower, they were out doing their stunts. The views from the Tower are great of the city, but were made much better with being able to watch the Blue Angels. There was a \"back pack Nazi\" on the first floor, but she was just doing her job. The guy operating the elevator is HILAROUS! He made the visit perfect!\nShow less"], ["Reviewed October 15, 2017", 4.0, "Worth it for the views", "We attended here on our last morning in SF, when we arrived, the tower was not yet open and there was already a line forming.\nEntrance is $8 for adults and you get a small elevator to the top for stunning views of the city. Fair price for views and seeing the artwork and finding out about the history of the tower.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Beautiful views", "Must see! 360 views. The trek to get there can be a steep and daunting as most Ubers or Taxis will not take you to the top, so you have to climb up a normal SF steep inclined street, and then an inclined trail ad stairs. But...you are rewarded with the Best way to view the bay from SF.\nShow less"], ["Reviewed October 13, 2017", 3.0, "Better view elsewhere", "I was very intrigued by Coit Tower which you can see from many points in the city. My family and I were dropped off at the tower mid afternoon on a Saturday. There was a line you stand in to buy a ticket followed by a line you stand in to ride in a very small elevator to the top of the tower. The view is very nice but a better view can be seen from the De Young Art Museum Tower in Golden Gate Park which is free of charge.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Good view of San Francisco and a fair price", "Sitting atop Telegraph Hill the Coit Tower offers a good view of the bay.\n$8 to go up the tower (an elevator takes you up) to the open top enclosed room. There are windows to look out of all around and at least 1 window of each set is open.\n\nYou can drive up or walk, approach from Filbert St either side, there are steps.\nThere is a statue of Christopher Columbus in the car park.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Art, exercise and best city views", "Coit Tower, constructed to emulate a fire hose as homage to the volunteer fire engine squad beloved by its memorialized benefactor, Lillie Coit, is one the most unexpected and underestimated monuments to visit.\n\nSitting atop Telegraph Hill in the North Beach neighborhood makes hiking up to the tower challenging but well worth the effort. Once inside you are transported back to 1934 as depicted by 20 some murals of California life and politics of the era. The artists all had a local connection and many were devotees of famed artist Diego Rivera.\n\nOn the day I visited I was eavesdropping on a group convened outside. The docent, Rory with a free guided tours group \"sfcityguides.org\", permitted me to glom on to his tour. His well-researched knowledge of the artists and happenings of the time delivered with humor and passion elevated and enriched my experience. We were even allowed to view several paintings generally off limits to the public with his guidance.\n\nDon't forget to purchase a lift ticket for $8. and linger a while on the observation decks where you'll find unbeatable 360 degree views of the city, the bay, including Alcatraz and the Golden Gate Bridge, plus East bay. It happened to be fleet week when I was there and it was a special treat to see (and hear) the US navy's Blue Angels commanding the skies in formation at the pinnacle of this towering monument keeping watch over San Francisco.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Splendid Views", "It’s quite a climb up the hill but worth it. Or take a bus or cab. Wonderful murals inside. Take the elevator to the observation level and see the city. Thank Mrs. Coit and the city of San Francisco for this extraordinary monument atop Telegraph Hill. Don’t forget to GOOGLE her and learn about this extraordinary woman.\nShow less"], ["Reviewed October 11, 2017", 4.0, "view of teh city", "nice view of the city, 360 degrees. parking is free within 30 minutes on weekdays. so plan your visit between Monday to Friday."], ["Reviewed October 11, 2017", 4.0, "THE view point", "If you want to see the whole city from up above, this is the place. It takes quite a walk to get here up the hill, and even a little bit inside. We had to line up for almost 30 minutes, but it was worth it. It gets very windy upstairs!!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Coit Tower in San Francisco", "This landmark is a must visit if you're going to San Francisco.\nParking is tight but the views are worth it.Bay and city views you will remember for a long time.\nTake a coat as it tends to get cold winds, and a camera is a must visit\nMany other nice attractions near by one can walk to Italian north beach and Chinatown areas for delicious foods.\nShow less"], ["Reviewed October 10, 2017", 3.0, "Nice view", "But there are nice views all over San Fran. So if you don't want to wait in line to go up on the tower, don't worry, you won't miss a lot. And after you get up there you're ready to come down after 5-10mins, but you won't because of the time and money you spent to get up there.\nShow less"], ["Reviewed October 8, 2017", 5.0, "a must", "we really enjoyed our walk to the tower. the view from the top is brill you have good views over the city and bay. cheap to go up the tower as well"], ["Reviewed October 8, 2017", 4.0, "Great Murals inside and Great Views of the City", "Coit Tower is at the top of Telegraph Hill and is a steep, but enjoyable walk to get there. There is a small parking lot, so drive up when it opens in order to get a parking spot -- otherwise you'll be walking. The murals were done during the 1930s and are worth seeing by themselves. You can take an elevator up to the top for great views of the Golden Gate Bridge, downtown, Russian Hill , and wharf areas. Worth about an hour of your time. We were visiting over July 4th holiday so Coit Tower was illuminated in alternating hues of red, white, and blue. We drove up at night in order to see it up close and had no problem parking then either.\nShow less"], ["Reviewed October 8, 2017", 4.0, "Holiday", "This is very interesting good place to go you can take a bus there we didn't no this and walked it's a long way lots of steps you can go right up to the top of the tower the veiws are great"], ["Reviewed October 7, 2017", 5.0, "We walked to it, and it was a steep climb", "We were in San Francisco for a day and decided to walk a bit to see some of the sights. We walked first through China Town and enjoyed looking into some of the shops. We didn't buy anything, but it was fun to look. Then we walked up to Coit Tower. Now that was a steep walk! I had thought the Coit Tower was to remember the big San Francisco fire, but no, it was not.\nThe lady that gave the money (on her death) did give it in honor of the fire department, but not for that fire. Once you get to the tower you can walk in and see the murals inside and learn the whole story about how this came to be built. These murals are very well done. For a $5 fee (senior rate) you can take an elevator to the top. The views from up there are fantastic. It was a clear day when I was there and the buildings surrounded by blue sky were very pretty.\nI would highly recommend going here and paying the fee to ride up the elevator. The elevator operator was friendly and fun to talk with.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Fantastic views", "If you want great views of San Francisco and the bay then come here and go to the top. There is a fee of $5 or so to go to the top but the tower offers complete views of downtown SF, the GGB, angel and Alcatraz islands along with all of the wharfs.\nThe staff were very friendly and happy and the tower grounds offer a pleasant stroll around and down the steps to the wharfs.\nBe aware there are no steps up to the top and the only way is via lift.\nShow less"], ["Reviewed October 5, 2017", 3.0, "A symbol of San Fran but just \"ok\" for me", "If you have a nice day, it would be worth it to go up and see the city. Without a nice day, your views wont be as good and prob not worth the price. You are also not able to walk up the stairs as they are closed so you have to take the elevator ( I would have preferred stairs)\nShow less"], ["Reviewed October 5, 2017", 4.0, "Superior views", "You can see Coit Tower from the wharf and I was determined to walk there from our hotel, the Marriott Marquis. That being said it was quite a climb to the tower. All streets leading up are super steep. The climb was definitely worth it. The views of the bay are spectacular from the tower.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Towering the city", "Coit Tower can be seen from almost anywhere in this part of the city as it is located on top of a mini 'mountain' and has a great observation point. Surrounded by lots of trees it provided a great relaxation ground for the tired tourists."], ["Reviewed October 4, 2017", 4.0, "Great Views", "We had purchased VIP passes to this before we travelled and it was well worth it to go to the head of the queue. The tower itself has an interesting history and the lady that gave us our tour was extremely knowledgeable. Fantastic views over San Francisco so be sure to have your camera.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Good views", "The line was kind of long, and a bit of a wait, but it was an amazing view from the top. The line also has murals and information plaques all the way around it so it's really not bad, and it's not pricey either at $8. Its worth it for the views in my opinion\nShow less"], ["Reviewed October 1, 2017", 3.0, "Nothing special - not worth the queue", "We had to wait 30+ minutes to go up and for that reason it is not worth the trouble. Much better views are from Grandview Park near Tiled Steps and are for free."], ["Reviewed September 30, 2017", 4.0, "Nice view of city from the top", "We took Uber from our hotel in Union Square to this place. There was a small queue inside but we spent the waiting time by admiring the nice murals inside. Once we were at the top, it was a very nice view and much different from Twin Peaks. Both the places have really excellent views and I cannot say to skip one for the other. This place is near to Lombard street but the roads are quite hilly and walk can be too much.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Every city has to have one", "And the Coit tower is San Francisco's answer to a phallic symbol on top of a hill. It doesn't do much, but is a good walk to work out the kinks of travel"], ["Reviewed September 27, 2017", 3.0, "Nice view, but might not be worth it", "If you have a clear day (which isn't as often as you might want in San Fran), it provides you with a nice view. Saying that, if you do go, make sure it is not during a busy time of the day or you will be waiting for an hour to spend five minutes taking pictures of the view.\nI was impressed with the murals on the wall while waiting in line and reading the write up on the history.\nI would say, if it is a clear day, maybe go see the murals, walk around Coit tower for views, don't bother spending the money to go up the tower. But if you want it for the experience of going up the old elevator, then its not a bad experience either.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Worth the Walk Up and the Wait", "We walked up to the Coit Tower and then had a wait of 40 minutes to catch the elevator to the top but it was worth it! The veiws are awesome and all of the people who work there are so friendly!"], ["Reviewed September 25, 2017", 4.0, "Worth visiting for the views.", "We walked to here from our hotel on Geary Street and were huffing and puffing by the time we arrived, oh those hills. You queue inside but there are some nice murals to look at before you enter the lift to the top. Once there the views over the city are excellent. It is also not too far to Lombard Street from here so you can combine the two.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Very historic with lovely views", "Very historic with lovely views and a relatively quiet location if one needs a break from the massive crowds of tourists. There is a small cafe inside and lots of historical photos."], ["Reviewed September 23, 2017", 5.0, "Ariel view of the city", "This is on the top of the mountain hence you will get a great view of the city. You can go by a vehicle or you can walk. There is a ticket to climb up the tower. and mindful of the opening time."], ["Reviewed September 22, 2017", 5.0, "Great view of a great city", "Well worth the climb up a number of steps, once you are at the tower then there is a lift to the top. Admission fee applies but well worth it as the views from the top of this iconic tower are worth it."], ["Reviewed September 21, 2017", 5.0, "Well worth the climb", "It you are up to the challenge of climbing the steps the views from Coit Towrr are you reward.\n\nOr you can catch the 39 bus.\n\nThe steps are narrow and at some points there are no handrails so be careful.\n\nFor $8 you get a lift to just under the top of the tower, then you walk up two short flights of stairs and you at the top with 360 views its a bit windy as the top has no roof.\n\nInside while you are waiting for the lift there are plenty of murals to view.\nShow less"], ["Reviewed September 21, 2017", 3.0, "Pricey sfo city view", "The place was crowded when I went in a weekend afternoon. Had to wait an hour to reach the top. Only limited parking slot in front of the tower . Other way is u could park below the hill and take a small hike. The view was amazing. But I felt it was pricey. There is a gift shop where you could get pricey souvenir. You hav to pay an admission fee only if you are planning to go up the tower. You get amazing view even from the foot of the tower. Restroom was available within the facility\nShow less"], ["Reviewed September 19, 2017", 5.0, "Oh what a view", "The base of Coit Tower is a park, with spectacular views of Alcatraz, the Bay Bridge and the Golden Gate Bridge. It is free to go in the park, but parking is metered. I did not go inside the tower to view the artwork, but the view from the park is lovely.\nShow less"], ["Reviewed September 19, 2017", 3.0, "Not a must do", "It was a mission to get to Coit Tower. We went up a lot of hills with the stroller. It was a super hot day. Just getting there was a mission. We waiting a long time for elevator and again it was hot in there like crazy. Tight elevator, cramped stairs. View was nice, but back in line to go down. I would pass next time.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Great views of the city for only $8", "Well worth a trip up the steep steps to the top of Telegraph Hill to visit Coit Tower- the views over the city are second to none. There was a bit of a wait for the lift as only so many people can be at the top of the tower at one time, but it wasn't too long. You can see the Bay Bridge and Golden Gate Bridge, Alcatraz and all over the city.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Can you say windy?", "What a great view of the city. Some of the windows are open and the breeze is crazy! After hiking up Filbert Street the breeze felt like a million bucks! You should take pictures with your hair blowing in the wind; we looked like rock stars!\nShow less"], ["Reviewed September 18, 2017", 4.0, "Fantastic views of the bay and the city", "Coit Tower is a 210 foot (64m) tower at the top of a hill overlooking San Francisco.\nFrom the top of you get amazing views of the bay and the city. Just don’t go on a holiday weekend like we did as you will have to queue to go to the top in the lift, which cost $8, $5 for seniors.\n\nAlso don’t miss the fresco murals on the inside of the tower which were painted by 27 different artists.\n\nThe tower was built with money donated by Lillie Coit a wealthy socialite, an avid gambler who dressed like a man in order to gamble in the male only gaming establishments. Lilly was also a volunteer fire fighter throughout her youth and adulthood.\n\nYou can drive to Coit Tower but for those feeling more energetic you can walk up steps that go all the way up from Filbert Street which is just off The Embarcadero, opposite the midpoint between Pier 19 and Pier 23. It’s a very steep climb and there are lots of steps but it’s worth it.\nShow less"], ["Reviewed September 17, 2017", 5.0, "long walk", "this tower is off the track it eather walk or car in side the tower is one lift wich wil take you up to the top the cost is $6 per person one you get there the veue is bret taken the windows cover most points of intrest of the city one of the best places to go for one in a life time trips\nShow less"], ["Reviewed September 17, 2017", 4.0, "A must for city and bay views.", "This is always a great stop for anyone, but I was a little disappointed that itclosed at 6:00PM. My last visit 18 years ago, I got some wonderful sunset shots of the Golden Gate from the tower."], ["Reviewed September 17, 2017", 4.0, "Best view of San Fran available.", "Taxi from Fishermans Wharf didn't take much time. (Took the bus back - stops right outside.) Got there early and was treated to some poetry from a lady staff member as we were queuing to enter - surreal! If you want a great view of San Fransisco - this is the place. Be careful to choose a non-foggy day!\nShow less"], ["Reviewed September 16, 2017", 4.0, "Lovely View!", "While passing through San Fransisco for the first time we decided to check out Coit Tower. The view is really nice but the trees do hinder some of the view. Hopefully they trim some out of the way in the future. There is a small parking lot at the top but be prepared to wait for spots. You can also go into the tower as well and learn about the history.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Take the stairs of Telegraph Hill and come back at night", "There are 2 sets of stairs that will lead you up the hill to Coit Tower. We found one of them by accident and came back at night to take the other set. They're both on the east side of the hill, off Sansome Street, near Levi's Plaza, at the end of Filbert Street and Greenwich Street. The steps are tough and little rustic but a fun adventure. Once you're at the top, it's definitely worth the wait to go up the tower. And be sure to come back at night. The tower is closed but the views from the hill are just as beautiful at night and it won't be nearly as crowded!\nShow less"], ["Reviewed September 15, 2017", 4.0, "Good , but slightly underwhelming", "Nice views from the base of the tower and parking lot. The walk up is difficult, but interesting and adds a fair amount of value. Nice to see the surrounding neighbourhood. Did not ascend the tower as there was a line and fee for the elevator. Murals in the interior of tower are historically interesting, artistically less so. A good low cost sight that incorporates some exercise.\nShow less"], ["Reviewed September 14, 2017", 4.0, "Good place to have a panorama view of Golden Gate Bridge", "This is a very popular stop by place to have a panorama view of Golden Gate Bridge and San Francisco city. I recommend to walk down the short path starting next to the parking lot and beside the road to have a good view of down town San Francisco. At peak time, you might have to wait for the parking lot but it's not that bad since people don't take that long to visit.\nShow less"], ["Reviewed September 14, 2017", 3.0, "Would have been nice on a clear day ...", "Unfortunately three unfortunate things happened during our stay in San Francisco. 1. Fires north of the City. This created a very hazy fog from time to time. Still, Coit Tower was on MY list so we took a city bus (thank you Muni-Pass!) up to the Tower. 2nd unfortunate thing. The elevator to the top of the Tower was Not Functioning. OH, but you could still PAY to walk up the 376 (?) steps ..and back down again of course. Unfortunately, my arthritic hips weren't up to that ...and especially when it came to the 3rd unfortunate thing ...it was ...no lie ... over 90 degrees OUTside...worse inside. Sigggghhh. I would still highly recommend it and will definitely go back another time. I was just very disappointed. No one's fault. Just sad. sigh.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Best place to go on a clear dsy", "Take the 39 bus to Coit tower on a clear day and you won't be disappointed. The views from the bottom are good but from the top of the tower they are superb. Small charge for the lift to take you up it but it's worth it.\nShow less"], ["Reviewed September 13, 2017", 4.0, "Great View of the City", "You can see Coit Tower from just about everywhere while your in the heart of San Francisco. I strongly recommend that you go early. I have read that people have been in 45-60 minute lines. We only waited about 10 mins (that is because the elevator is really slow). It is $8 fee ($5 for seniors) if you want to use the elevator. You can view all the murals on the main floor and take in the views while outside.\nAgain there is more climbing of hills as you take Telegraph Hill to the top. If you are unable to do it or find it too challenging, rest easy, as there is a city bus that does take you all the way to Coit Tower. My mother wished we knew that before she hiked up.\nTake a moment to look at the murals before or after going to the top.\nThis is a beautiful place and worth the time to come here.\nShow less"], ["Reviewed September 13, 2017", 4.0, "Did not go up the tower", "We did not want to wait to go up the tower but enjoyed the murals and views of telegraph hill. A good spot if you have a car, spots open up constantly. Public transport will also take you to the tower."], ["Reviewed September 12, 2017", 5.0, "Fantastic Visit despite the line.", "This was great to visit. Even the hike up the hills to get there were worth it. Pay $8 to go up into the tower by elevator. Views from the top are unsurpassed. And there MURALS are gorgeous. That made the long line to the top worth it. It also allowed you to interact with other travelers, which is part of the fun!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Great views on a clear day", "We were very lucky yesterday and had a fantastic clear, sunny day to go up Coit tower. We got off the hop on hop off bus at the bottom of the steps and hiked up through beautiful gardens, wondering how the people living here manage the slope. If you're mobile it's well worth choosing this route (we went up one set of steps and down the other)\nThe tower itself, on top of telegraph hill, boasts fab views.\nThe small fee to go up is worth it, although you have no choice but to wait in a slow moving queue for the elevator as it only takes 8 people every 4 minutes (no stairs option). It took us well over half an hour - the murals are interesting though.\nAt the top the views through the windows are amazing, you have to wait your turn for the open windows to get your pics\nDefinitely recommend\nShow less"], ["Reviewed September 10, 2017", 5.0, "Panoramic views of the city", "If you can survive the walk up there (including the steps), it is well worth it. On a clear day, you get a spectacular, panoramic view of the city that is unmatched! Worth at least a short visit."], ["Reviewed September 9, 2017", 4.0, "Beautiful Views", "Coit Tower is well worth a visit. Be prepared for a wait as it is a popular location. Interesting site with spectatular views so ensure you take your camera. If you enjoy a challenge you can walk but otherwise you can get the bus. Walking will give you the chance to enjoy the interesting and different scenery but not for the faint hearted. Enjoy the view.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Great views of Golden Gate Bridge", "We took the bus up the steep hill to Coit tower & waited about 30 min on line to get to the elevator. Was 11am on a weekend - so a reasonable wait. Enjoyed the paintings inside the tower. Elevator is a tight squeeze for 9-10 people and the view on a clear, cool day was totally worth it. The base of the Golden Gate Bridge was still covered in fog, but great view of the main span, the cruise ship docked & the hills across the city. We didn't feel rushed & it was a great orientation to the city layout. Recommend taking the bus - very efficient & convenient.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Beautiful", "Drove the road in the evening to coit tower. Just beautiful with the city lit up.. couldn't take the elevator up but the views around the tower are excellent"], ["Reviewed September 7, 2017", 4.0, "Great views", "I had been to San Francisco in the past and never went up in Coit Tower because of the long lines and time constraints. Decided to take the time to see it this time. Waited 45 min- 1 hour in line, but I feel it was well worth the wait. Beautiful views, great for pictures. Really enjoyed looking at the murals on the inner walls while waiting in line.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Sensational views of San Francisco", "Coit Tower is absolutley worth queing for. It took me over an hour before I finally got to the top, but the wait was, without doubt, worth every minute - just the best views of the city. And as you wind your way through the building to the elevator, there are excellent murals portraying the history of the city. This is definitely a must do in San Francisco\nShow less"], ["Reviewed September 7, 2017", 4.0, "Amazing views", "Did this tower after having it recommended by some friends. It's about $8 to go up in the lift and well worth it. Please take your camera as you can photo San Francisco from 360º and the views are amazing"], ["Reviewed September 6, 2017", 4.0, "Amazing Views", "You get quite a view from the Coit Tower. It's a good view from the base if you don't want to pay the $8 to go up but, it's amazing from the top. The line was a bit long but, it was worth it. (It was not peak season. I waited about 15 mins)\nShow less"], ["Reviewed September 6, 2017", 3.0, "What a View!", "If you have an hour or so to spare, this is a great way to see the city skyline. Alcatraz Island, The Golden Gate Bridge, Pier 39 are all easy to see on a clear day. I went after 3:00 PM and the sky was sunny with some clouds. There was no fog so the visibility was very good.\nI spent some time looking at the beautiful/interesting murals on the first level before going to the observation area. It was slightly crowded but the ticketing line moved quickly!\nThere is a wait for the elevators but not bad.\nI took public transportation, Muni, to this site.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Interesting History", "Fascinating to visit the Coit Tower and learn the history, both facts and fiction, of the tower. Equally interesting to learn about Lillie Coit and what a colorful character she was. From Telegraph Hill we got great photos of San Francisco skyline and the bay, including the Golden Gate Bridge and Alcatraz.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Coit Tower", "Nice view of the city. When I went it was not super busy. I would advise to take the hike up filbert street steps om telegraph hill if you want to add a neat urban hike."], ["Reviewed September 6, 2017", 4.0, "Great view, long queue!", "As the title suggests, this is worth doing for the view. If you walk up to it, beware it's up a very steep hill or a long staircase. There is a bus, so if you don't want the exercise, you know what to do! Only downside was the queue to get up as the elevator only takes about 8 people at a time, so even if you have advance tickets it makes no difference.We had to wait about 40 minutes.....\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great workout walking to Coit Tower", "A great workout getting to the Tower, great hearing about the history of the tower, and an amazing 360 view of San Fran once you reach the top of the Tower, you really have to put this on your list of places to visit in San Fran, you can see the Golden Gate bridge (on a fog free day), Alcatraz, Lombard Street, the Bay Bridge, downtown San Fran - it really is a must see place!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Nice and Cheap and Amazing Views", "Great Views across San Francisco. Definitely worth making the trip up to see. It's cheap too, and wasn't too busy at around midday when we went up there."], ["Reviewed September 6, 2017", 4.0, "Great overview over the city and bay area", "Loved to get up and see an overview of the city of San Francisoco. Would have been even better if they allowed us to walk the stairs."], ["Reviewed September 4, 2017", 5.0, "Lovely views of San Francisco", "There was a line to get in on a Sunday afternoon, but it was worth the wait. There are nice views of the city from the Coit Tower. The murals are really cool on the first floor. Check out the Columbus statue before public sentiment leads to it being taken down!\nShow less"], ["Reviewed September 4, 2017", 3.0, "Not designed to handle large crowds", "Unfortunately we chose to visit San Francisco on Saturday during Labor Day Weekend when it was a high of 110 degrees. The gentleman at out hotel front desk advised us not to take bus 39, but instead walk from Fishermans Wharf along the Embarcadero to Coit Tower (he didn't tell us about the stairs!). Even with this climb, we were anticipating a great, relaxing visit to the top of Coit Tower once we arrived at its base. But it was over an hour wait inside this non-air conditioned structure with few places to sit down while waiting for the one elevator. We were miserable!\nShow less"], ["Reviewed September 3, 2017", 5.0, "Breathtaking views", "Well worth a visit. The views from the top are amazing. Get there early as the queues get very big and they only allow 10 to go up in the lift at a time and 10 have to come down before they let 10 up."], ["Reviewed September 1, 2017", 5.0, "Great views", "Fabulous 360 views from the top of the tower. Fabulous murals around the inside while you are waiting."], ["Reviewed September 1, 2017", 5.0, "Beautiful views of the city", "We walked to the tower from North Beach, coming up the Filbert Steps. There is an $8 fee to ride the elevator up to the top. When you get out, there are a few steps to climb, but you get a fantastic 360 degree view of SF.\nShow less"], ["Reviewed September 1, 2017", 4.0, "A must do on good weather", "I would recommend to do this when there little to no fog in San Francisco as this gives the best view. We did it when there was no fog and you can take beautiful pictures of the city, Alcatraz and the Golden Gate Bridge. The price is 8$ pp which is not so cheap as the only thing you can do is take nice pictures on top. We did it and we are glad we did it for the nice pictures.\nShow less"], ["Reviewed August 31, 2017", 3.0, "Not really the best view", "My friend and I walked up to Coit Tower on the promise of amazing views of the city.\nUnfortunately, whilst lovely, the views didn't really leave us in awe. There is fee to visit the top of the tower, which we do not believe is really worth the money, and additionally the views from the base are all obscured by trees.\n\nIt is certainly an intense (but good if you like a bit of a hike!) walk up, and the area surrounding the base of the tower is beautiful greenery/trees. However, I would not recommend it as the best place to view San Francisco.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Take the wrong route back down", "Beautiful views from the top when coming back down we noticed an exit on the opposite side to where the enterance was this took us through a path of jungle like steps and brought us out at Levi's 😀"], ["Reviewed August 30, 2017", 5.0, "Walk up to Coit Tower to find it closed to go up to the top but a great view!", "We got to the Coit Tower but got there late to go to the very top. We were able to walk around inside and the gift shop which had great art work inside. It has excellent views even from around the tower park."], ["Reviewed August 30, 2017", 3.0, "A place to visit", "Coit tower in Telegraph Hill is one of the place to go when visiting San Francisco. Nice views from there to the bay and to the city from the top of the tower. However, it is not a must to go to the top. View are ok but not majestic.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Beautiful gardens and views", "Climbing the stairs up to Coit Tower was quite difficult. However, stopping along the way to look at the gardens made it more enjoyable. Once at the top, the views were amazing. My camera can't do justice to the views!"], ["Reviewed August 30, 2017", 5.0, "There's more to Coit Tower than you think", "Coit Tower offers more than spectacular views. There are lots of murals and if you plan ahead, you can sign up online for a private tour of the second floor and see murals the rest of us mortals who didn't plan missed."], ["Reviewed August 30, 2017", 5.0, "Stunning views!", "It's well worth walking up the hill(s), through the park (with its coyote warnings!!) and going to the top of this tower. Absolutely magnificent views over San Francisco and excellent staff who willingly answer questions. The murals in the lower part of the tower give a great historical picture of San francisco, too.\nShow less"]]}}