{"Coronado Island": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Coronado Island", "url": "/Attraction_Review-g32250-d1519764-Reviews-Coronado_Island-Coronado_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/24/33/ca/this-is-what-heaven-looks.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2568"}, "address": {"@type": "PostalAddress", "streetAddress": "1100 Orange Ave", "addressLocality": "Coronado", "addressRegion": "California", "postalCode": "92118-3407", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Go visit!!", "My boyfriend and I were visiting San Diego from NY, and have heard lovely things about this place. We easily got over to the island by ferry (tickets cost about $10) round trip. There are several restaurants, shops, beaches, and outdoor activities. We walked to everything we needed to see, including the Hotel Del Coronado, which is on the other side of the island. However, you can rent bikes by the hour which is a great way to get to different places. I highly recommend the restaurant “Tartine,” and checking out Coronado beach.\nShow less"], ["Reviewed 2 days ago", 4.0, "Lots to see and do", "This is just a very nice place, with lots of restaurants and things to do. It's all very pretty and picturesque."], ["Reviewed 3 days ago", 4.0, "Still Beautiful", "It's been a number of years since I've been to Coronado. We went and just enjoyed the beautiful weather and watched the waves. The crowd was nice and quiet for the most part. Every now and then there was a rowdy bunch. The one thing that I couldn't get over was all the fake grass. I wonder why they went with some fake grass....Certainly worth going for a day of relaxation.\nShow less"], ["Reviewed 1 week ago", 4.0, "Visited In Winter", "Took the ferry over and uber/walked to the other end of the island where we could explore more. A lot of little shops, food and beautiful views."], ["Reviewed 1 week ago", 4.0, "Great island to visit", "Visited here and really liked it. I was actually surprised at the amount of sand dollars we found on the island. What else is great is the gold/glitter in the beach sand. It's just amazing."], ["Reviewed 1 week ago", 5.0, "Beautiful", "The entire island is beautiful. From the million dollar homes, to the Hotel Del and the beaches. It can get crowded with traffic and people, but don’t let that detour you from its beauty."], ["Reviewed 2 weeks ago", 5.0, "Best vacation ever", "We have never enjoyed a vacation more. The receptionist all went out of their way to make sure we had all that we needed. The bikes were great. Don’t want to go anywhere else."], ["Reviewed 2 weeks ago", 5.0, "Not crowded in February!", "The beach here was clean, beautiful, and uncrowded (in February). Bike rental in the town area was not expensive, but didn't open until 10 a.m. The bike path down the length of the island was flat and very nice, although there were lots of bike teams riding en masse that were constantly passing me. Highly recommended.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful Place", "One of the most beautiful places around. Friendly people and lots of eateries. Most people walk or bike around. Very clean."], ["Reviewed 2 weeks ago", 5.0, "Almost Like Heaven!", "Coronado Island is a wonderful place to spend a day, a week, or a lifetime! After a short ferry ride from San Diego one arrives on the shore of this historic and beautiful island community. While some catch a trolley or walk down the main street to the heart of the island we often take a longer route through the quite and pristine neighborhoods of Coronado. So peaceful and relaxing as we wind our way toward the beach at the Hotel Del. Lots of restaurants and shops dot the island’s main business district. Coronado Island is the centerpiece of everyone of our San Diego vacations.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A must when visiting San Diego", "We took the ferry from Harborside to the Island. Walked around the ferry landing area and then to the Coronado Hotel for lunch and drinks.Used ferry tickets on water taxi for return trip to Convention center."], ["Reviewed 3 weeks ago", 5.0, "Destination Wedding", "Coronado Island is a beautiful place! Although I am a little biased because I got married there! The beaches are extremely clean and there is no riff-raff. We got married in front of the Hotel Del Coronado, which is absolutely breathtaking. We arrived around 6:00 PM and most people were beginning to clear out which made it nice for our ceremony. Also, the NAVY Seals train on Coronado Island. So, you will see and hear the training taking place.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Can't Visit San Diego Without A Day in Coronado", "Beautiful, fresh air, clean... great beach and small town feel. Love coming here each time I'm in San Diego."], ["Reviewed 4 weeks ago", 4.0, "Vacation", "Excellent views, food and relaxation! Walked the beach. Caught a glimpse of a seal swimming. Watched a navy ship dock. Had a wonderful time while there."], ["Reviewed 4 weeks ago", 5.0, "Peaceful Spot", "We took an uber over to Coronado and the ferry boat back downtown. A lovely spot to walk along the boardwalk on the water. The beach is clean and very large. A beautiful spot to relax! Also nice boutiques along Orange Ave, as well as fun restaurants. Suggest Leroy's for lunch. Overall, glad we visited! Suggest setting aside about 3 hours to wander around.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful Place to Visit", "Took the Old Town Trolley to Coronado Island and spent a few hours exploring the area. There are many cute boutique type stores, restaurants etc to visit. Take the time to walk through the Hotel del Coronado, certainly worth the time. Had lunch at a little pub across from the hotel, very good to say the least.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Did Not Disappoint", "Was told I had to go to Coranado, and I am glad I did. Stunning drive over the bridge, and the beach was beautiful, even on a mild January day. Parking was a challenge, but the beach and ocean are worth it."], ["Reviewed 5 weeks ago", 5.0, "Beautiful !", "Very beautiful Place to visit and spend whole day ! Must watch the sunset, it’s an amazing view ! Love the Island."], ["Reviewed 5 weeks ago", 5.0, "Absolutely gorgeous", "We had a wonderful morning walking by the beautifully kept beach. Sea was gorgeous. Coronado itself has quaint neighbourhoods and plenty of coffee shops and restaurants. An easy drive from San Diego."], ["Reviewed 5 weeks ago", 5.0, "This is the life", "Coronado is a small jem. There is a fair amount of daily traffic to and from the air base, but the beautiful beaches, eclectic houses, and unique restaurants just can't be beat.\n\nWith the gorgeous weather and laid back attitude you can feel the stress just melt away.\nShow less"], ["Reviewed January 23, 2018", 5.0, "A MUST When in San Diego", "Coronado is just a beautiful place to see whether you are visiting during the warm months or not. We were in San Diego in January, and the temps were in the low 60s and it was overcast during out visit. Didn't matter. Coronado was still worth your time.\n\nThe island is easy to get to. We took a Lyft from our hotel (Hilton Garden Inn), and the ride was around $13 and 15-20 minutes. Just riding over the bridge to Coronado is an experience! You could spend lots of time wandering the downtown area, shopping and grabbing a bite to eat, but I would recommend heading to the Hotel Coronado and the surrounding beach.\n\nThe hotel is such an impressive site. Over 130 years old, it's scale is just amazing! Try to get into the hotel to visit the lower level and walk around the exterior. There are shops and restaurants. You can stop, grab a bite and take in the amazing views. Then take a walk on the beach. It wasn't sunning or swimming weather during our visit, but that didn't stop us from walking on the beach, dipping our feet in the water and just taking in the views from the sand. (Be prepared for the juxtaposition of Navy jets flying overhead as there is a Naval base on the island. Those jets are very loud.)\n\nIn short, it's worth your time - whether you want to spend the day or just a couple of hours, add it to your list of places to visit.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Love coronado", "Such a lovely beach. Hotel del is beautiful and has great ice cream to buy and watch the sunset. Rent a bike and enjoy the whole day. Ferry landing also has nice group of shops and dining. Everyone should make this area a part of their san diego vacation.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Afternoon in sun", "I love Coronado island and visit every chance I get. It is a great place to shop, walk on beach and look at town. So easy to pop over on ferry from San diego"], ["Reviewed January 22, 2018", 5.0, "A memorable place to visit", "When we arrived there after the big bridge we were amazed at the beauty and cleanliness of the downtown area. We parked along the beach near the hotel and walked up to get breakfast at the cafe at the hotel. We saw the coolest sandcastles on the beach and couldnt wait to have breakfast so we could check them out.\nShow less"], ["Reviewed January 22, 2018", 5.0, "A Must Visit for Everyone Visiting San Diego", "Do not leave San Diego without budgeting time for a visit to Coronado Island. A trip over the free 2.1 mile Coronado Bridge (which my granddaughter lovingly refers to as the Blue Bridge) gives you a wonderful view of San Diego Bay to the right and looking out toward the Pacific to the left. The view of sailboats to the right and large U.S. Naval vessels to the left is awesome. Coronado Island is picturesque and includes beautiful parks, beaches, homes, and shopping areas. Don't exceed 30 miles here or risk a speeding ticket. You will see both locals and visitors travelling the roads in golf carts . A visit to Ferry Landing Park affords excellent restaurants and walkways overlooking San Diego Bay and the San Diego skyline. Orange Avenue boasts many restaurants with both indoor and outdoor seating as well as shops of all kinds. Allow time for a stop and visit at the historic Hotel Del Coronado, founded in 1888. Visit the gift shop and learn about the resident ghost. Have a drink on the veranda to watch the sun set over the Pacific. A drive down the Strand, the road which connects the Isthmus to Imperial Beach boasts beautiful beaches and views of wetlands. Good for a day trip or better yet a stay of several days and nights. We return to Coronado Island every time we visit San Diego.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Sitting at the dock of the bay", "Love just sitting at the beach and watch the world go by. It was a little to cool for us to go in the water but I am sure it would be wonderful."], ["Reviewed January 21, 2018", 5.0, "Unique California beach town minutes from downtown San Diego", "Great beaches, bike friendly beach town with good restaurants and lots to do. Nice for a day trip but nicer to stay a couple of nights."], ["Reviewed January 21, 2018", 5.0, "Happy New Year!", "Great place to spend New Years or anytime of the year. Lots of cute boutiques, restaurants and bars. Kid friendly. You can walk from hotel del Coronado and be downtown in about 10 minutes or rent a golf cart and drive around to take in the sites. Tons of fun and lots of things to do.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Perfectly charming", "Absolutely charming! You feel as though you have stepped back in time. There is an amazing history to this island and much beauty."], ["Reviewed January 21, 2018", 5.0, "Came to watch the sunset", "Took a Lyft over to the beach from the ferry. Awesome beach and beautiful sunset. Walked back to ferry. Came up group after group of the rudest pedestrians of my life. Prob not locals. But sharing the sidewalks was not in their set of skills."], ["Reviewed January 21, 2018", 5.0, "6 stars, 7 stars! O.M.G.!!!", "Wow, what a place!\n\nI had spare time after a business trip and came here for a few hours before flying out.\n\nBest decision of the entire week.\n\nI rented a bike and took it for a spin for a couple of hours around the Island's beaches, neighborhoods, a drink on the beach and lunch.\n\nParadise, basically. Clean, safe, friendly, all-round amazing for young and old, groups and solo.\n\nI cannot wait to be back there. No, to live there!\n\nA total must visit\nShow less"], ["Reviewed January 18, 2018", 4.0, "must see!", "Coronado Island is a nice ferry trip across from San Diego. There are many shops, restaurants, and of course the Del Coronado hotel is a must see. Definitely a nice day trip if you're visiting San Diego"], ["Reviewed January 17, 2018", 5.0, "Lovely Place To Be", "I loved the small town feeling of Coronado Island. You can walk easily almost anywhere, including the ferry to slip over to San Diego. Fabulous food options abound!"], ["Reviewed January 13, 2018", 5.0, "Great day get away.", "I live here so maybe bias. However - this would be a great day get away for the family. Recommend getting here early for parking - and start around hotel Del area for great beach access. Restaurant are a plenty and great quality.\nRecommend heading this way early and getting breakfast at brueggers bagels!!\n\nShow less"], ["Reviewed January 11, 2018", 5.0, "Worth the visit", "Great place to visit. The views when coming over the bridge are amazing. The beach is kept really clean and is great for a walk along or to watch sunset. A must when in San Diego."], ["Reviewed January 10, 2018", 4.0, "Beautiful island, hard to park", "Coronado island is beautiful, great places and views and water! But it is not that easy to find parking..."], ["Reviewed January 9, 2018", 5.0, "One of our favorite/must see places to come", "We love Coronado Island (which is not technically an island). From the different shops (ranging from ice cream, bars, restaurants, and sweet shops) on the street to a great beach. We like to go to the beach in front of the Del Coronado Hotel since you can grab food or use the restrooms. We come off season so street parking is manageable. If you drive south on I-75 you may get to see some Navy Seals training or you can also sit on the beach and watch planes land at the nearby navy base.\nShow less"], ["Reviewed January 9, 2018", 5.0, "An amazing hidden gem!", "We were on our last day in the USA from Australia and had the day to explore the San Diego area. I've always wanted to cross the 'big bridge' but was unsure where it went and what was there to see. What we discovered was an amazing little 'village'. I only wish we had more time to look around and explore.....maybe next time!\nShow less"], ["Reviewed January 9, 2018", 5.0, "Beautiful Evening Stroll", "We made an afternoon trip to Coronado to check out the famous hotel (Some Like It Hot is my favorite film!), and walk the beach. The trip across the bridge was fun, but oh the scenery from the beach looking back to the Hotel Del Coronado left me almost speechless. There was a large wedding party going on, complete with the bride and her new groom taking pictures in the surf-- complete in their wedding attire! This was fun to watch, as was the other families strolling up and down the walk. We of course went in and walked around the hotel, which had a gift shop and lots of mementos of different hotel events over the years. This little trek was one of my favorite times in our San Diego trip.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Beautiful beachwalk with Family", "If you are visiting San Diego, then visiting Coronado is a must! It has great clean beach, and ideal place for kids to spend a day on the beach. The only downside is the lack of any toilets, but else it is good. The little walk around the town is a must, with wonderful shops and restaurant. Gelato Paradiso is a good place to have some ice cream.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Family friendly", "My husband and I spent a week in Coronado in July. We enjoyed wonderful restaurants and shopping opportunities. The beach was relaxing and filled with families enjoying their time together. There were local friendly law enforcement officers community policing the more populated areas which was nice to experience.\nOverall this area is a family friendly safe place to relax and enjoy family time in a beautiful area of California!\nShow less"], ["Reviewed January 6, 2018", 5.0, "Great place to hike and bike for the day", "Whether you're walking or renting a bike and riding there is plenty to see and do on the island. Stop by hotel de Coronado for lunch."], ["Reviewed January 5, 2018", 5.0, "Beautiful island, beaches, hotels, and Ferry Service1", "The most fun way to get to the island is by ferry - from the San Diego Convention Center or from the cruise dock area. Once at the ferry landing, you can walk to the downtown area and the beach (and the Del Coronado Hotel) in about 25 minutes; or grab a taxi. Driving can be a hassle - over the toll bridge into heavy traffic and difficult parking. A taxi from San Diego cost about $20. The shopping/dining area near the ferry landing is a destination in itself. You can also rent a bike and cycle south on a bike path to Silver Strand State Beach (about 4 miles). The Island is a wonderful escape from San Diego .\nShow less"], ["Reviewed January 4, 2018", 4.0, "Beautiful Sunday beachwalk", "Very popular place for a nice stroll on the spacious beach and perhaps a visit to the beautiful, iconic landmark of the island, Hotel del Coronado."], ["Reviewed January 4, 2018", 4.0, "Day Trip from San Diego", "Great spot for a day trip while visiting San Diego, accessible by car via bridge, or by ferry from downtown San Diego. Boutique shops, large choice of restaurants, lovely beaches, photogenic skyline of San Diego, historic Hotel del Coronado to visit, and even ice skating in winter, overlooking the beach!\nShow less"], ["Reviewed January 4, 2018", 4.0, "Nice day trip!", "Coronado Island has beautiful beaches, and the Del Coronado is a lovely historical spot to visit. Be warned that everything at the Del costs noticeably more than other spots on the island. The ferry trip over from San Diego is cheap and easy, and you can have a nice lunch at the brewery, or just grab ice cream and wander around a bit.\nShow less"], ["Reviewed January 2, 2018", 5.0, "We want to live here!!!", "This is now officially my happy place. Coronado is SoCal on slow burn. A strip of golden California coast where the beaches are long, the sand fine and San Diego is just a ride over the bridge or a 15 minute ferry ride."], ["Reviewed December 31, 2017", 5.0, "Came to see hotel.", "We crossed the bridge to Coronado to see the hotel and ended up eating lunch on Orange St. What a great spot. My wife and I want to come back to hit the beech. It's $30 to park just to go inside and view the Coronado hotel so I drove around in circles for 20 minutes while the family ran in to see the upside down Christmas tree. Beautiful spot but stupid money to stay there.\nWe enjoyed the shops and restaurants on Orange St. Need area with a cool vibe. We will be back!\nShow less"], ["Reviewed December 29, 2017", 5.0, "Beautiful place", "Very upscale and gorgeous place. Beautiful beaches and the Del Coronado is always worthwhile to swing by."], ["Reviewed December 29, 2017", 4.0, "Nice but not without drawbacks", "Coronado is a beautiful spot to visit however it is extremely crowded at certain times\nIf you don't arrive quite early and with dinner reservations you may have difficulty finding a place to dine at\nThe beach is beautiful Lots of people having professional photos taken because it is quite breathtaking\nThe boardwalk is this horrible cement path that is horrible to walk on\nI think it is ok for biking or rollerblading but not for strolling\nIn fact there is a lot of cement paths all over the place Kind of hard on your joints\nCoronado seems safe People are pretty nice\nIt would be so much better if it had an actual wooden boardwalk\nShow less"], ["Reviewed December 22, 2017", 5.0, "Love!", "We love to stay on Coronado Island... It is quaint. If you don't like driving over the bridge, that could be a problem! There are ferries that go back and forth, but I don't think they take vehicles. There are lots of restaurants, and places to get good food, and the beach is beautiful. Just be okay with the sounds of jets flying overhead constantly, because that will be your soundtrack of your stay on Coronado Island.\nShow less"], ["Reviewed December 21, 2017", 5.0, "A wonderful peaceful part of San Diego", "We recently spent a week in San Diego. That was our first time there and we spent one day in Coronado. We were staying in the Gaslamp area so we had to decide whether to take the ferry or the public bus. We were also thinking about a harbor cruise for another day so we took the bus. We got off the bus at Orange ave near the ferry stop. We checked out that area and then walked down one side of Orange to the boat launch and Del Coronado Hotel area. We explored all that including walking around the hotel to have a look inside, the skating rink, and the beach. We then walked back on the other side of Orange Ave, ate at a restaurant that was close to the ferry stop, and then caught the bus back to the Gaslamp area right around sunset. It was a nice day with lots of walking and we decided that if we return to San Diego we would like to stay on Coronado Island.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Love This Place", "Been here a few times. I would never hesitate to go back. The beach is well kept. Parking can ba a little dicey but worth the effort. The Del is right there, always a nice stop."], ["Reviewed December 20, 2017", 4.0, "Coronado is a must see when in San Diego", "take the bridge over to Coronado and drive down the main drag of town Orange Ave. There are plenty of bars, restaraurnts and shopping. Park the car and walk the town, go over to The Del Coronado and take our shoes off and walk the beach. It is a great place to just take in Southern California.\nShow less"], ["Reviewed December 18, 2017", 5.0, "West coast sunset", "The sunset was beautiful! There were so many festivities happening for the holidays or maybe because it was a beautiful Sunday. The water was too cold and rough to swim in but just enjoying the sunset , and running barefoot in the sand was enough for my girls to be very happy . We could have stayed all day !\nShow less"], ["Reviewed December 13, 2017", 5.0, "Shopping", "We walked the shops and toured the hotel and really enjoyed our day. The hotel was awesome and reading some of its history was exciting. Great views"], ["Reviewed December 9, 2017", 5.0, "Loved this place at sunset", "My husband and I were staying in San Diego and made the trip down to Coronado at sunset. We watched the sun go down from the beach and dipped our toes in the ocean. It was beautiful, and one the most memorable spots from our trip. We found a restaurant at the Hotel del Coronado called ENO Pizzeria and Wine Bar, where the food was delicious, especially the dessert. The hotel area felt like a tropical resort. We didn't want to leave!\nShow less"], ["Reviewed December 9, 2017", 5.0, "Fabulous island", "So much to see and do within a short walk wherever you stay. There were great restaurants, the food tour, shopping, the beach, and historical sites all on the island. I would definitely visit again."], ["Reviewed December 9, 2017", 5.0, "Nice day trip", "Took the ferry from the downtown harbour to Coronado. Trip runs every hour and takes about 15 minutes. The terminal on Coronado is surrounded by a shopping area with lots of restaurant options from coffee and ice cream to fine dining. There is a paved walking path that goes around the island by the water. There is the option to rent bikes as well.\nShow less"], ["Reviewed December 6, 2017", 2.0, "interesting little community", "I am not quite sure what I would recommend it for. It appears to be mostly a bedroom community with little else happening except for the naval base."], ["Reviewed December 3, 2017", 4.0, "Great beach to visit", "We went back twice in the midst of Thanksgiving holidays and it was still easy to park and felt fairly quiet. It’s a lovely beach town and a cosy resort with a traditional vibe."], ["Reviewed November 29, 2017", 5.0, "Go-It’s So Rich.", "The Island has its”Own Bank”. How Rich is That? It’s Militarily. How Safe is that? The houses are Not Gated. How Safe is that? THE BEACH IS AT HARMONY WITH THE SEA.? You will never find a Safer and Secure Place In The World. John"], ["Reviewed November 25, 2017", 5.0, "Have to stay here at least once in your life", "Very cool relaxing island with lots of shops and restaurants, can ride your bike go for a jog, have some drinks on the ocean, etc."], ["Reviewed November 24, 2017", 5.0, "Great vacation spot away from the hubbub", "This is a lovely place to visit. You can walk to great shops, great restaurants, spend the day at the beach, or hop the ferry to San Diego."], ["Reviewed November 19, 2017", 4.0, "A gem", "The perfect beach community. Item number one. The historic Hotel Del Coronado. Item two one of the most beautiful white sand beaches in the US. It’s a public beach. The town itself has numerous restaurants, bars, stores and beautiful homes. It’s a true gem."], ["Reviewed November 18, 2017", 5.0, "Day visit to Coronado Island", "My wife and I recently visited Coronado Island with friends. We rode to this beautiful peninsula on the San Diego trolley. We got off and walked around this fantastic beach resort. The views were outstanding and the place is fabulous. We enjoyed our scenic walk and highly recommend this place.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Want to relax, go to Coronado", "Coronado island is only a bridge drive away from San Diego, but had had a whole different feel and attitude. You can spend a day at Dog beach with your buddy or take a look at the historic Hotel Coronado. Pace is slow and relaxing. US Navy constitutes the bulk of the area, so many ships can be seen.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Best of San Diego", "Best of San Diego--beautiful island-like peninsula over the bridge from San Diego--great restaurants on Orange St.--don't miss sunset @ Hotel Del Coronado Beach."], ["Reviewed November 12, 2017", 5.0, "QUICK TRIP!", "We hadn't planned to even go to Coronado, but the ferry was there, so we did it! It is a fun little place to grab a bite, do some shopping, or take a self-guided electric bike tour of the island, which I LOVED!!!!"], ["Reviewed November 12, 2017", 5.0, "Lots to see and do!", "We highly recommend visiting Coronado Island when staying in San Diego. It’s a very pleasant excursion with lots of restaurants and shops. No visit would be complete of course without a visit to the Del Coronado hotel and the ocean side beach. Take the water taxi by Joe’s Crab Shack and save yourself the hassle of driving over. You can easily walk around, rent bicycles, or take the trolley. It’s a great day!\nShow less"], ["Reviewed November 10, 2017", 5.0, "❤️ Great stuff", "I had the pleasure of stopping here on my tour of San Diego, I'm glad we did.\n\nAs you drive across the bridge there is splendid views of the harbour and city, it really is breathtaking. If you look to your left you can see the coast of Mexico In the far distance it's about 7 miles away.\n\nOnce on the island you have the option of grabbing a bite to eat, there are great food places that range from a specialist cupcake shop to a KFC and some other quant different little spots. You can also grab a ferry across the harbour for a tour of the bay. Most of all there is great views of the skyline of San Diego.\n\nWhen we were there, there were groups of marines in uniform mooching Around also grabbing lunch etc,that view was rather pleasant too. Make sure you go for an hour or two while in San Diego.\nShow less"], ["Reviewed November 10, 2017", 3.0, "Uber Trip", "I had seen so many great reviews about this area. It was nice, perhaps my expectations were too high. We were staying in San Diego and I wanted to the Hotel Del Coronado that everyone raved about. I found things to be overcrowded and busy. It was nice but too much for me, perhaps it was just the time of year.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A cool place just to hang out", "Visited San Diego in October during a heat wave, so Coronado Island was the place to go. An Uber driver took us over to the island in no time from Old Town. A great afternoon spent walking, on the beachwalk as well as at the Del in the shops, the bar and people watching. Great destination, next time in San Diego we would like to stay on the Island.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Love the area", "Nice to stroll around and visit the shops. Hotel is neat to look at. Cute shops a few blocks away. There are sand castle artists nearby."], ["Reviewed November 8, 2017", 5.0, "what a place, few places like this in the US with this feeling of vacation", "you would like to go into this place, and dive plently of restaurant, bars, yet a verry nice and family oriented place, with beutiful sigths and amazing places to go and visit, the hotel is a main and a must."], ["Reviewed November 8, 2017", 4.0, "A Good Side Trip From San Diego", "The island has a pleasant old-fashioned feel to it and is a pleasant wayto spend some time outside San Diego. Take the 901 bus over the Coronado Bridge and catch the ferry back to either the Convention Center or Broadway Pier."], ["Reviewed November 7, 2017", 5.0, "Beautiful day trip", "Such a beautiful place! Rented electric bikes and saw the whole island! Perfect day! Fantastic restaurants...great shopping!"], ["Reviewed November 7, 2017", 5.0, "Perfect Spot", "We stayed on the island and enjoyed it very much. We was able to walk everywhere. Beautiful beach on one side and beautiful skyline view of San Diego on the other, and lots of shopping and restaurants."], ["Reviewed November 5, 2017", 4.0, "Lovely beach with many eateries and shops", "We had only a limited amount of time in the island but there are plenty restaurants, mcafes and pubs. The beach itself is very large and sandy and there are some high end shops."], ["Reviewed November 5, 2017", 4.0, "Fun, but crowded beach", "A beautiful beach on a beautiful island. On a warm summer day, the beach gets extremely crowded. Hard to find an open towel spot."], ["Reviewed November 4, 2017", 5.0, "Cute Southern California Coastal get-away", "Coronado is like no other beach town in So-Cal. Quaint, gorgeous and a small town atmosphere. If you want \"big city\" its just a 10 min drive over the bridge. Lots of restaurants & attractions. Don't miss the Hotel Del! Spectacular & loaded w/history."], ["Reviewed November 3, 2017", 4.0, "Stunning Coronado Beaches", "The beac in Coronado goes on for miles and because it’s so big it never looks busy, we did not see any sun beds to rent as it seems people take their own. Water was lovely and not too cold, best part for me was , right by the shore when the water comes in, you can see Gold glistening by the edge and it’s all along the shore, amazing site. The island of Coronado is very pristine and even the grass looks plastic, very well kept place. There is a great deal of walking to be done and some great scenery, we also took a bike ride around the island. There are some great restaurants in Coronado and my favourite was the Stake Chophouse & bar, quite pricy but they do happy hour which was great.There is a Irish pub called McP,s that had a good menu and was full of life.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Fun, beautiful beaches", "Lots to do here especially if you want to shop. Lots of shops and places to,eat on Orange Ave. park your car and enjoy the walk. The hotel del Coronado is a wonder take time to visit if your not staying there. The beaches were amazing. Go by the historical society, the ladies there were helpful and full of advise and fun stories.\nShow less"], ["Reviewed November 1, 2017", 4.0, "Nice beach - parking is tough!", "It was very nice to get out and walk along the beach in front of the hotel. The parking situation is difficult and after opting for the Hotel parking we realized at $35 why it was the only thing available — oops!"], ["Reviewed October 28, 2017", 4.0, "Lots of easy walking and shops", "A bit more touristy than I remember with lots of souvenir shops but there is a good mix of restaurants. There are some midrange hotels that are easy walks from most shops. The Del is touristy but worth a walk through."], ["Reviewed October 26, 2017", 4.0, "Beautiful Large Island", "I took a bus over to the island from the convention center. I took a boat back to the dock in front of my hotel. The weather was nice and the shopping was fun."], ["Reviewed October 24, 2017", 4.0, "Great area to walk", "This island is so relaxing there are a ton of restaurants that are not expensive. The history of the island is all around you. The beach is number one plenty of walking or hope on one of the tour buses that makes stops all over San Diego . Great for families.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Lynn H", "Beautiful area of San Diego to visit. Easy access from bus or Ferry. I took the local Ferry, they ran hourly and also a great way to see part of Harbor and Coronado bridge.\nEasy access to bus ride over to the beautiful Coronado Hotel, lovely to sit up on the deck with a drink and watch along the promenade and beachfront. Great day out.\nShow less"], ["Reviewed October 19, 2017", 2.0, "Laid back and dated", "A perfect place for a relaxing and unscheduled trip. But not much going on here, downtown it's nice to walk around. There's a \"back to the future\" about being here."], ["Reviewed October 18, 2017", 4.0, "Loved experiencing Coronado Island!", "My husband and I enjoyed our time spent on Coronado Island! McP's was excellent for lunch and the Hotel Coronado was fun for drinks and appetizers. We loved spending 3 hrs on the beach."], ["Reviewed October 17, 2017", 5.0, "Fun Attraction", "Kick back and see what else southern California has to offer. The island is home to the Hotel Del and the Naval Base. Sit on the beach with a cool drink and watch Naval aviators perform touch & gos."], ["Reviewed October 17, 2017", 5.0, "wow", "this was a beautiful island just across from downtown san diego. it was very quaint and peacheful. shopping and restaurants all in walking distance. clean safe family environment. but it also has its own downtown scene.beautiful views and interestings stores to explore. we loved it!"], ["Reviewed October 16, 2017", 5.0, "Great small island with lots of history, military and visitors", "Coronado Island is an iconic place to visit. You won't miss the Coronado Bridge and Hotel del Coronado, and the beautiful Coronado Beach. You may be curious about the Pacific Fleet of US Navy, which is headquartered on this island, but won't be able to get in. You'll see the vessels and jets often though from a distance.\n\nThe island is very neat and fun to visit and spend some time. But expect to see lots of visitors, from local and far away. The famous landmarks are always full of people. But the neighborhood is usually very quiet.\n\nParking isn't very easy on the island. So make sure not to be ticketed or towed.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Go See The Xmas Boat Parade", "This spot by the ferry landing is the best place to watch the boat parade. You can sit, buy food like BBQ or pizza, and enjoy a coffee while being outdoors on a nice night. We dressed warm, brought snuggle blankets, and arrived early to park for a fee and get a table. We really enjoyed it, and we even walked on the little pier to take pics.\nShow less"], ["Reviewed October 14, 2017", 5.0, "A fun place for an outing!", "Although, one can certainly spend a week here, in my opinion, a day or possibly two would suffice. This spot offers quaint shops, good restaurants, and of course a spectacular beach along with the historic Hotel del Coronado. The nearby naval base also affords opportunities to watch aircraft fly in and out. The highlight of this area is the beach which is quite wide and is characterized by fine sand. A beautiful place particularly at sunset!\nShow less"], ["Reviewed October 12, 2017", 5.0, "The Isalnd has a GREAT FEEL about it", "What a wonderful place to live! Houses look really interesting and the whole place has a quiet contentment. Suspect that it is not cheap."], ["Reviewed October 12, 2017", 4.0, "Excellent beach for a sunny day", "Coronado island has very nice houses on the non military part of the island and a beatufil white sand beach to spend the day or just walk about on the beach front. Stop for a few drinks at the Coronado hotel while viewing the ocean."], ["Reviewed October 12, 2017", 5.0, "USS Midway Museum, San Diego", "So interesting to learn about the WWII ship. We did the self guided audio tour. Would be fun for school age children also to walk aboard the ship and listen to audio tour along the way. The grounds are beautiful and there is easy access to parking nearby.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Love coronado island", "Beautiful area in san diego. Stayed at the marriott but my favorite id the del coronado. Will be back there in february. Can’t wait"], ["Reviewed October 9, 2017", 5.0, "Not to be missed once in San Diego", "I've visited Coronado all the first 3 times been in San Diego and I think it shouldn't be missed even staying in SD for work.\nOld Coronado hotel is fantastic site, full of wooden interiors and of memories like the old elevator (said to be the very first, installed by T.A Edison) and like all the movie set places of \"Some like it hot\".\nNice to drink a cocktail looking at the beach, thinking about the wonderful comedy shot here.\nThen, walk in the large sand beach and meet people enjoying sea breeze, jogging, playing with their dogs, taking it easy for a while.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Beautiful haven", "What a lovely place to live, clean, beautiful. Reminded me of Celebration in Florida. Beautiful houses, great views, would love to stay."], ["Reviewed October 8, 2017", 5.0, "Family & Business Owner", "Everything about Coronado Island is Perfect!!! Food.. Entertainment... Shopping... Money Value... Island Tours...Local Families and Visitors... And The History of The Coronado Island is Fascinating and Awesome... Then to see ALL of our USA Military Branches UNITE and As ONE to TRAIN is Breath Taking and will Give you Such Pride to be a US Citizen!!!\nShow less"], ["Reviewed October 8, 2017", 5.0, "What a pretty place!", "I was making my first visit to San Diego and on the first morning drove to Coronado - a place I didn't previously know existed! But I loved it so much that I went back the next day too. And I am already looking forward to my next trip to San Diego to return there.\n\nThe town is spotless, with some beautiful houses. The beach is lovely and clean. It's not like some beach towns where the area around the beach is a bit run down. If anything, Coronado is the opposite - showing its best side to the people who visit. There are lots of shops and restaurants to go to too, when you can prise yourself from the beach.\n\nI also loved the drive over the bridge from San Diego. It's hard to imagine that this place is 15 minutes or less away from the bustle of the Gaslamp Quarter.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Great location, quaint and fun!", "I love this location. Close enough to downtown but with an energy of its own. I am glad we chose to stay on this side of San Diego. Great walks, views and restaurants. The sunset park and beach are a must do. Stunning!"], ["Reviewed October 5, 2017", 5.0, "Nice day out", "Caught the ferry over think it was $5 each? Hired a bicycle for an hour $8 per hour, had a nice ride over to the Hotel Del Coronado and along the beach path. Rode back through the town and after taking the bikes back we had a lovely lunch at Peohe's. The ferry reside was nice, I guess the amazing weather helped the day.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Great place", "As we checked almost on a daily basis, prior to our trip, the live camera view from hotel Coronado del Mar, we knew the weather here can be very moody.\n\nFortunately, as we arrived at the hotel, we had only lovely days and not only we enjoyed the hotel and the great hospitality we encountered here but also visited on a daily basis different parts of the island, more or less as we came/left via Coronado bridge.\n\nI really loved the sleepy atmosphere further away you got from Coronado del Mar hotel with houses still made of wood, which you do not see in the UK and Europe in general and here seem to be the norm. People seem to be very nice and friendly and the 'centre' of the town seem to be around our hotel with lots of restaurants and shops and great road.\n\nThe beach is not bad although it does not have the same fine sand you get in Clearwater Florida, our favourite to which we return every year, also the water is not as warm as there.\n\nHowever this is a great island to visit once in a lifetime.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Outstanding choice for any stay in San Diego", "We loved the laid back atmosphere. A beautiful beach, lovely walks, variety of restaurants from casual to fine dining. Yet easy access to all the things we were doing— ceremony at Navy base, family visit, concert at Spreckels Organ Pavilion in Balboa Park and Gaslamp district.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Stunning beach", "This turned out to be one of my favorite all time beaches. The sand actually sparkles in the sunlight. The curve of the beach is also quite romantic"], ["Reviewed September 30, 2017", 5.0, "Great beach!", "Coronado Island is lovely and the beach is long and wide. In particular, the beach in front of the Del Coronado is public and is wide and very clean. Restaurants are nearby and easy to walk to in addition to those at The Del. Public parking is nearby as well. The lifeguard towers were empty but there were hardly any swimmers in the water anyway. The Del has chairs and umbrellas for rent but they are pricey. We didn't find any public restrooms other than at The Del but we didn't wander far from there either.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Great views and beaches", "My wife and I took a drive over the bridge to Coronado Island, basically to have lunch at the Hotel del Coronado. But we took a drive through down and to the beaches to enjoy the views. We stopped at Coronado Beach that had benches right near the street so we could sit and view the ocean, very restful. Then it was off to Silver Strand beach for more views before heading back to the Hotel. All in all it was well worth the drive and the time spent enjoying the views.\nShow less"], ["Reviewed September 28, 2017", 5.0, "My favorite place!", "We love Coronado Island! We haven't visited for 15 years and we were not disappointed! It's beautiful as ever! We love the beach and ocean. It is so relaxing! We haven't found any great places to eat on the island yet. Always love seeing the Coronado bridge at night. Can't wait to return.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Beautiful", "Simply beautiful. I love this place, and the town is just amazing. I would stay here over San Diego again."], ["Reviewed September 25, 2017", 4.0, "Nice walk", "Spent the day walking around and shopping in the sweet boutique shops that of course are over priced. It's a must hike around if you have never been to Coronado island. The beaches are amazing and not many people are there compared to San Diego beaches. Lovely homes and of course the hotel. Go, if you haven't been!!\nShow less"], ["Reviewed September 24, 2017", 4.0, "Not really an island!", "Actually an isthmus connected to mainland at the south. Hob nob with retired Navy Admirals. Great place to ride bikes-so perfectly flat."], ["Reviewed September 24, 2017", 4.0, "Beautiful", "Beautiful golden sand beach surrounded by cliffs to the north and south. Warm sunshine and the cool pacific ocean was just plain good for the soul. I didn't do any activities, but walked by the famous hotel (a gorgeous wedding was happening on the beach!), watched a surf school in the water, and had lunch at a nearby pizza place (The Village (??) - tasty). Peaceful. Sun, fresh air, ocean, and a breeze...can't ask for much more.\n\nWas an easy/quick drive from the airport car rental place. Definitely worthy of checking out while in San Diego! Ocean Drive had meters for parking, but I had no problem parking off the main strip on a residential block for free.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Always like Coronado", "Been here a few times staying mostly at the Navy Lodge on North Island. Walk the beaches in the am carrying my coffee. The city beaches are dragged and groomed each morning to remove seaweed and beach debris. Always a nice casual walk but finding seashells can be iffy at times.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Beach lovers Must see", "I had rented a motorcycle for this portion of my stay in San Diego and decided to cool off in Coronado which turned out awesome. Word the average water temperature for summer was around the higher 50s so exercise some caution when bathing. Nonetheless the beach is gorgeous with it's white sand and plentiful waves. If you're truly lucky you'll catch Navy SEAL trainees during exercises on the beach.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Old School California Chic", "Back in the day when I was a kid in San Diego, Coronado was the community where naval commanders and the wealthy lived. It is still a enclave for the wealthy. It is still a beautiful community. I still want to live there. If you ever visit San Diego, you must cross San Diego Bay and visit this beautiful place!\nShow less"], ["Reviewed September 23, 2017", 5.0, "Corando Island long Weekend", "Staying on the island was perfect. After sightseeing San Diego area it was wonderful to return to a slower pace for our evenings. We stayed in a small boutique hotel, Hotel Marisol, near the Del Coronado. Walking to shops, restaurants and the beach."], ["Reviewed September 20, 2017", 5.0, "Beautiful island", "Super cute place . Went over on the ferry , unfortunately it was dusk so most places were closing but still worth it. I think next time we will go earlier in the day to explore some more ."], ["Reviewed September 20, 2017", 5.0, "Beautiful island", "From the bridge to get there to the beautiful white sand beach to the stately Del Coronado hotel to the lovely town, this place is worth a visit when you are in San Diego. Totally different."], ["Reviewed September 20, 2017", 5.0, "Neat island and beaches", "It is worth it to come to the island. The shops are a little high in price but the houses and beaches are great."], ["Reviewed September 19, 2017", 5.0, "Beautiful place to visit!!", "While in the San Diego area- it is definitely worth the drive over the bridge to the beautiful island of Coronado! Lots of shops and restaurants- take a walk down Orange Avenue and visit the famous Del Coronado! Or visit the beautiful beaches here! Great views, beautiful homes, lots to do!!\nShow less"], ["Reviewed September 18, 2017", 5.0, "beach", "Love either renting chairs or just a towel on the beach. Long walks were also great. Clean, cold water and loved every minute of it."], ["Reviewed September 17, 2017", 5.0, "Excellent place", "This is one of the best place in San Diego. Plan to visit this island when you visit here. The beach here has white sand and there is a trail by the side of del Coronado hotel which adds to the beauty of this place. Must visit !!!\nShow less"], ["Reviewed September 16, 2017", 5.0, "Unforgettable place❤", "I love, love this place❤ From the brigde to get over there to the beautiful beach, homes, parks, local stores and exquisite cuisine. Lovely experience near San Diego."], ["Reviewed September 15, 2017", 4.0, "Worth visiting while in the San Diego area.", "This narrow strip of land has the cityscape on one side and the beach/ocean view on the other side. About 2 miles apart so easy to walk or bike. Most drinks, shops, meals are near the Ferry dock, on Orange Street or near the Historical, Del Coronado Hotel.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Wow!!", "well this place is just amazing. it has the most wonderful and massive beach, the houses are beautiful and the place oozes class. I wish I could live there! the bridge you cross from San Diego to get there is just mad and the views amazing. If you are passing nearby you must pop in here\nShow less"], ["Reviewed September 13, 2017", 5.0, "Beach Walks", "Lovely area and beautiful Beach. Hotel Del has great food, drink and MooTime ice-cream. Sooo relaxing, wonderful."], ["Reviewed September 13, 2017", 4.0, "Worth a visit", "Lovely little place with beaches, restaurants & shops. Short drive over the bridge from downtown San Diego. Visit the Hotel Del Coronado if you have time, it's beautiful & has an interesting history linked to movies & Christmas trees."], ["Reviewed September 12, 2017", 5.0, "Beautiful setting", "Lovely peninsular with a pretty town and stores. Lots of restaurants. Beautiful silver sands beach and the bay. Stay here for a break from the city"], ["Reviewed September 9, 2017", 5.0, "San Diego", "Great Island over an amazing bridge this is the quieter side although 10-15 mins over to city side by ferry"], ["Reviewed September 9, 2017", 5.0, "Coronado fun", "Amazing little island with adventures for the entire family! Enjoy yourself and relax at the beach aw some time at thenohannafest"], ["Reviewed September 6, 2017", 5.0, "Don't miss visiting Coronado", "Considering moving to San Diego? Move to Coronado. Homes are all well kept up, yards are pristine, surrounded by water, great restaurants and so easy to get to downtown San Diego. Getting to the airport and beaches is just as easy."], ["Reviewed September 4, 2017", 5.0, "Wonderful \"Get out of the Heat\" Vacation", "We rented a small house and stayed for three weeks. The weather was absolutely perfect - between 74 and 75 degrees and sunny. The beaches are some of the best in the country. We especially enjoyed the \"Dog Beach. Great restaurants of all kinds plus many tours. The free concerts in the park were really fun. Bottom line - GREAT SUMMER VACATION SPOT!!\nShow less"], ["Reviewed September 2, 2017", 5.0, "Ferry Ride", "Took a ferry to Coronado Rented a Surrey Walked through the shops by the ferry landing We had a great time"], ["Reviewed August 29, 2017", 4.0, "Beautiful!", "Quaint, lovely island peninsula to drive through. Streets lined with trees, shops, restaurants. Nice to walk downtown and check it all out. Ferry's Landing was a great place to check out, too. We almost missed it as it was off the beaten path a little, but was a lovely village with great restaurants right on the water with a view of San Diego in the distance\nShow less"], ["Reviewed August 24, 2017", 5.0, "Beautiful Island", "My family visited Coronado Island while on vacation in San Diego. We loved it. The drive over the Coronado Bridge is spectacular. Great views of the water and downtown San Diego. We spent the day on the beach, which was beautiful, a long sandy beach. Unfortunately, the water was full of seaweed. Our legs were completely tangled up in it. I don’t know if the water is always full of seaweed or if it was due to a storm. We set up our chairs near the main lifeguard station where the restrooms are. The restrooms were very clean. There are also outside showers for rinsing off the sand before you leave. While we were there, quite a few military jets and cargo planes flew overhead landing at their base on nearby Point Loma. They fly very low over the beach which was really cool to experience. Later in the day we walked down to tour the Hotel Del Coronado. The hotel is absolutely beautiful and definitely worth a visit. While we were there, we stopped and had happy hour at one of the hotel’s bars. Even at happy hour the drinks were expensive - $9 for a beer and $18 for margarita. We had packed our own lunch but on the drive to the beach I noticed a slew of restaurants on Coronado’s main street. We were there on a Saturday and the area was packed. As far as I could tell, there were not any parking lots near the beach. We drove around for 30 minutes before we found a parking spot. I did notice a parking lot near the restaurant district. We enjoyed ourselves so much that we went back later in the week.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Visit the Hotel", "Come see the hotel where \"Some Like it Hot\" was filmed. It's quite amazing. And this island is charming, beaches and pretty houses with gardens. Good for biking."], ["Reviewed August 24, 2017", 5.0, "Recommend to add a stop here for your trip", "We loved this place! We were staying downtown so took the ferry across (I think $5 each) and the took a Lyft back which was like $8.\n\nOnce there we took the free shuttle bus to the beach! We walked around a bit but not much prior. The beach is lovely and even though it was busy never felt crowded as it is sooo huge!\n\nAs the military is close a fighter jet flew by and then looped around and did some fancy maneuvers before landing which was neat. When we finished we took the free shuttle back and stopped at Nicky Rottens which we liked a lot before going to the grocery store which is near the Ferry and grabbing a few things before taking a Lyft back to the hotel. If you don't get to the other beaches (we went to Ocean/Mission) I would definitely say make this a stop or better all of them a visit as we liked them all!\nShow less"], ["Reviewed August 23, 2017", 4.0, "Very nice", "We spent a couple of hours here. We found a beautiful place to walk along the water. There are numerous such paths in the area. The only problem with this is is that it was somewhat short. I think there might be others very nearby but I'm not sure\nShow less"], ["Reviewed August 23, 2017", 5.0, "Island Time", "In the past, we've always used the ferry to travel from San Diego to the island but this time we used the bridge because of a tight schedule for dinner reservations. Parking is a little difficult to find so the ferry is a better choice. Coronado and the views are San Diego from the island are gorgeous. Highly recommend Peohe's restaurant for a great meal while you are on the island. Loved relaxing by the ferry landing and listening to live music.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Beautiful island near San Diego", "The drive over the Coronado Bridge is spectacular - high views over the water and city. The highlight of the island is the Coronado Hotel - an old hotel that sits right on the beach."], ["Reviewed August 21, 2017", 5.0, "Quaint Vacation spot", "This island is well kept and very beautiful. Many nice restaurants and hotel accomodations. It was hot that day but so many different historical things to see"], ["Reviewed August 20, 2017", 4.0, "Nice Island", "Take a walk on the seaside. Its a nice place to spend an afternoon. The beaches are really nice, and the wether is great"], ["Reviewed August 19, 2017", 5.0, "Beautiful island", "Coronado is truly beautiful. Bike friendly, pet friendly and has a beautiful view of the San Diego skyline. Walking at night time is the perfect way to see the buildings and Coronado bridge lit up with the lights."], ["Reviewed August 19, 2017", 5.0, "Pleasant place for a walk", "We took a late afternoon walk around the island. It is very picturesque with well kept buildings, colorful gardens, quaint shops,lovely beaches and coastal views."], ["Reviewed August 19, 2017", 5.0, "Must visit every time I am in San Diego!", "I cannot rave enough about how much I enjoy going to Coronado Island. I love the beach, the Del, the shops and cafes, looking at the million dollar homes, and just walking around this peaceful, beautiful island. I have stayed at the Del for NYE previously, but even if you do not stay there, you can walk around the lobby and visit the shops and restaurants. The beach is lovely on Coronado, and the bay side over at Ferry Landing offers nice views and eats, too. Take the ferry over or drive across the bridge. I highly recommend eating on the island and spending several hours here.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Loads of FUN!", "I've never been to Coronado Island and it was a great little adventure for my wife and I along with our good friends that we usually travel with on get away weekends. There's loads of wonderful places to eat (Chez Loma, Peohe's, Old town, Cosmopolitan Hotel) and great beaches. We toured through the Visitors Center, which gives you a wealth of info about SD and it's history. We went to Municipal Beach, and styed at the Cherooke Lodge, which was a lot of fun. Also there are a LOT of shops to hit on Orange Ave. with a lot of \"Stuff\" that you won't see anywhere else. Most everything was in walking distance so you don't need to worry about parking, which by the way is quite tight most of the time. Once you get a parking spot you don't give it up. It's a great little trip for So. Californians, next time we're going to take the AmTrak to add to the adventure. JUST DO IT!\nShow less"], ["Reviewed August 18, 2017", 5.0, "Beautiful trip", "Did a girls trip here for a relaxing weekend. Very good weather, and stayed right next to the bay. Everything was walking distance which was great. Love this little island."], ["Reviewed August 18, 2017", 5.0, "Gorgeous beach!", "This is a unique beach because of the gold flecks in the sand. It almost looks like glitter was sprinkled in the surf! We found a few shells, but the overall feeling of the beach was truly like a step back in time."], ["Reviewed August 17, 2017", 5.0, "Beautiful island", "Had a wonderful time at Coronado Island would recommend anybody to go there! The town is very pretty lots of restaurants and bars the people are super friendly and I had a great time!"], ["Reviewed August 16, 2017", 5.0, "Most beautiful beach!", "Coronado Island and its hotel is not to be missed. Great dining and a lovely town to explore. Must try Restaurant 1500."], ["Reviewed August 16, 2017", 4.0, "Great day at the beach", "Coronado is lovely and makes for a great day trip. Good food, shops, and of course the beach. I would love to return and stay at the Hotel Del Coronado."], ["Reviewed August 13, 2017", 5.0, "Favorite place to visit", "I love San Diego. I live here. But it is always such a treat to make our way across the bridge oron the ferry to the \"village\" of Coronado. Everything is within walking or biking distance.\nGreat food.\nClassic hotels\nWorld class beach\nConcerts in the park\nSailing\nKayaking\nLocal brewery\nIf you have been to SD without making it to Coronado you've missed part of our city's charm.\n\nParking can be difficult.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Pleasure", "Always wonderful!! Love the history and ocean beauty from our room and the roof top! My husband loves the spa, sauna and the gym. Fresh coffee every morning and of course a visit with Cody the parrot!"], ["Reviewed August 8, 2017", 5.0, "Very pretty", "Coronado is a beautiful beach area with great shopping and restaurants. It's easy to park ( for free) and just enjoy the area. The hotels are beautiful and worth a walk through. It's a nice contrast to the hubbub of the city."], ["Reviewed August 8, 2017", 4.0, "Lovely", "Coronado is a premium place to travel to. From San Diego you can go by boat across the bay. When you dock there are restaurants and shops. You can also rent bikes. Very nice and affordable. Take your family to see the sites. A clean place. Love the beach.\nShow less"], ["Reviewed August 7, 2017", 2.0, "Shot ride along coronado", "I had a lot of expectations but unfortunately I had got disappointed. We took a bike ride and with 1 hour is enough to ride all the island. Why? Mainly because there is a military Base that take the half of the island. Beaches are good but too much tiny sand which I personally don't like. My feeling this is a good place to spend some hours with the family, see and go to another place.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Family vacation", "Excellent place to visit with your family prolactin beautiful I love that I go every year It's beautiful in August"], ["Reviewed August 6, 2017", 5.0, "Everything you need in this island", "Though not a true island, it sure feels like it. Great restaurants and many activities to do. Great ocean beaches and nice bay activities. Surprised with nice quality of good Restaurants. From Italian to Japanese we found excellent choices. Very close to downtown San Diego and La Jolla too. You'll have a great time with your vacation!\nShow less"], ["Reviewed August 6, 2017", 5.0, "Great visit and cheap", "Make sure you see Coronado island and the hotel. Just a great cheap visit. Go to visitors center and drive to the south of the island."], ["Reviewed August 5, 2017", 4.0, "Nice Island", "Cute little place interesting history. worth a drive by and see the hotel it is historical and pretty cool"], ["Reviewed August 5, 2017", 5.0, "Vacation", "This is a nice location with lots of to do. This is a good family or romantic location. There are good restaurants and shops."], ["Reviewed August 3, 2017", 5.0, "A must see when in the San Diego area", "Just a couple of miles from downtown San Diego over the toll-free Coronado Bay bridge and you are in a quaint seaside community. Travel down the main drag of Orange Avenue and you will find many fine restaurants and shops. A visit to the Island would not be complete without stopping in at the historic Hotel Del Coronado first opened in 1888. Stroll the white sand beaches in front our sip a cocktail in one of the ocean view bars. There are several other beautiful hotels and bed & breakfast locations in the area also. The U.S.Navy\"s North Island air base is located on the island so you may be treated to the sights and sounds of freedom.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Beautiful beach", "Quick visit while traveling for a conference. Loved the soft white sandy beach very clean not crowded. We walked downtown area lots of nice shops and restaurants. Would definitely like to return for a romantic stay."], ["Reviewed August 1, 2017", 5.0, "A Must See when in San Diego", "You could easily spend a full day here.The Flagship ferry costs $10 return approx. and you can take a bicycle for free.The main attraction of the Coronado hotel and beach is on the opposite side of where the ferry docks.The Jacaranda trees that line the streets made the whole experience wonderful.At your service D&T.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Fantastic location during a San Diego trip", "Having seen San Diego from a little experience, I'm chafed that we spent only one afternoon at Coronado.\nThis is a beautiful area influenced with Navy folk and seemingly very safe.\nThere are several trendy eateries on Orange St as well as shops that rent out wet suits, surf boards and bicycles.\nI sincerely recommend staying here for 2 nights.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Night time visit!", "If I'd have seen it during day, I guarantee you that it's probably one of the most beautiful places ever! Just hearing the surf at that beach made me fall in love with it. :)"], ["Reviewed July 28, 2017", 5.0, "Great place", "Best place in the San Diego area.. Beaches are cleaner with less people. Area has a nice small town feel."], ["Reviewed July 27, 2017", 4.0, "Great beach", "Visit Coronado Island for a lovely day at the beach. Make sure you go to the Hotel del Coronado. There are restaurants and bars at the hotel. I went on a busy day in June, but still enjoyed the water and sun. This is a popular destination.\nShow less"], ["Reviewed July 26, 2017", 5.0, "trip with mom", "It was beautiful island and easy access from San Diego downtown. I traveled with my mom and we had great memory there. recommended time to visit is sunset time. you will see most beautiful sunset over the sea."], ["Reviewed July 26, 2017", 5.0, "Beautiful island!", "Enjoyed the island. Biking is very easy here. It's very beautiful and lots to do and see. We stayed at the Marriott which is quieter and less busy, but has lots of activities."], ["Reviewed July 23, 2017", 5.0, "Just amazing!", "We came to San Diego for Comic-Con but chose to stay on Coronado instead of down by the convention center. This was the best decision of the trip. The island is like another world so well maintained, beautiful homes, landscaping. Tiny little shops & local restaurants. Most everything is walkable too. Our only complaint is most everything & I mean everything is closed by 9pm 10 at the latest, even fast food. We actually had to go to Vons grocery one night to eat after getting back from convention at 10pm. The shops close between 5-7 as well. Overall though the island is beautiful! We are Caribbean beach people, even Hawaii does not do it for us...so the beach here is very much like most of the west coast or Miami Beach on the east coast in our opinion. So if you like any of those you'll enjoy the water here too.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Paradise, great weather cute town!!", "Loved this island, stayed at the Coronado which is walking distance to the town. The locals were friendly, the restaurants in town were great. We will be back."], ["Reviewed July 21, 2017", 5.0, "Small town feel", "Coronado Island certainly feels like a small town. Lots of local activities welcoming residents and travelers alike."], ["Reviewed July 20, 2017", 5.0, "Nice!", "Enjoyed the beach while we were here! The surf was beautiful and the breeze was cool and refreshing! This is a nice stop while in San Diego!"], ["Reviewed July 20, 2017", 5.0, "Lots to see and do", "Just a quick drive over the Coronado bridge (or you can take a ferry to the island) this a must do when in San Diego. There is shopping on Orange ave, everything from boutiques to souvenir shops. Stop by the classic Hotel Del Coronado just off the Coronado beach. The Crown Room has a fabulous, although pricey, Sunday brunch that is worth the experience. The Coronado Beach provides views of downtown San Diego and has amazingly soft sand. The beach stretches along the coast allowing for lots of people and provides a great spot to spend some time at the beach, or just go for a stroll if you are tighter on time. There are lots of great dining options allowing for a full day getaway.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Beautiful island", "Lovely island close to San Diego downtown. Beautiful beaches and restaurants along the bay. The town is small and quaint. Very clean and the people are friendly. Safe to walk around and explore. Huge navy base close by so many helicopters frequently fly above across the shore. Definitely worth a visit if you are heading to San Diego\nShow less"], ["Reviewed July 19, 2017", 4.0, "Beach time", "Great beach & nice dunes. Can be noisy with all the Navy planes & helicopters, especially during the week"], ["Reviewed July 19, 2017", 5.0, "Beautiful island!!!", "It's very nice to see the island as well you can see the famous Coronado Hotel where Marilyn Monroe filmed the movie \" Some Like it Hot\". If you want to see the hotel, park outside, they free parking otherwise the parking at the hotel is extremely expensive.\nI recommend to see the beautiful beach and walk all around, it's a very nice area.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Beautiful Area, Very Busy", "We enjoyed walking around Hotel De Coronado and visiting the nearby beach. Gorgeous area and setting, just very busy."], ["Reviewed July 17, 2017", 4.0, "Beautiful Area!", "It is hard finding a parking place on Coronado Island. Read signs carefully. Very beautiful area, easy access to the beach and lots going on. Enjoyed strolling the street and doing some window shopping, there are cafes and little restaurants. Overall an enjoyable afternoon."], ["Reviewed July 14, 2017", 5.0, "Great location", "Spent 3 nights here and loved the laid back atmosphere. Beautiful boardwalk and plenty of dining options. Convenient for cycling too. Highly recommended."], ["Reviewed July 13, 2017", 5.0, "Beautiful, clean, trendy equals pure pleasure", "What an incredible Island, each view is postcard worthy! Took the Ferry from San Diego, to Coronado. The moment you disembark the islands beauty surrounds you. Trendy stores offering the latest fashions, chic restaurants and fun bars await! Actually the food is reasonably priced for the island.\nBikes are available for rent, but there is a free trolley that takes you to the downtown area and Hotel del Coronado.\nBikes are not allowed on the sidewalks, there is a lot of traffic, which makes biking a little dangerous in congested areas.\nThe white sand beach spreads across a large area of the island. Beach chairs cost $20. Each so bring your own.\nThere are inexpensive restaurants on the island, Burger King and Kentucky Fried Chicken, so you don't have to spend a lot of money!\nShow less"], ["Reviewed July 13, 2017", 5.0, "Best Beach in San Diego", "In my opinion, no trip to San Diego would be complete without a visit to Coronado. The drive across the Coronado Bridge alone is worth the trip. The island is beautiful and is almost completely rimmed with gorgeous beaches. The beaches are cleaner and kept up better than most other SoCal beaches. Also, the sand is full of mica which is very rare for a beach. It makes the sand look like it's full of flecks of gold.\n\nParking can be an issue, so do your homework before you visit but nearly everything on Coronado is within walking distance due to the island being relatively small. Besides the beaches, it's full of great shops and restaurants. You also have to check out the Hotel Del Corondo. Incredible!\n\nCoronado is the perfect place to spend a day... or longer.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Food truck, beach, sit down lunch and shoe score", "Day trip to the Island. We parked near Birkenstock store and checked it out first my husband found a comfy pair of size 14 sandals. Always hard to find appropriate sizes. Walked to beach and I had a breakfast burrito at HolyMolyGuacamole truck. Walked back to town and checked out Coronado brewery. Great trip.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Beautiful Island", "Took the ferry across to Coronado from SD one lovely afternoon. Had a very tasty bite to eat then proceeded to walk to the Coronado hotel from the ferry.\n\nYou don't have to do this, there is a free shuttle which takes you there, but I do like to take in the sights on foot.\n\nWe walked down Orange and stopped at a lovely children's playground and park for our 6 year old to vent some energy!\n\nOur final destination was the famous Coronado hotel, then we took the free shuttle back.\n\nAll in all a beautiful island and a must see if in SD.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Excellent walking spot", "Very nice spot for walking if you're in San Diego, a chance to see how the others are living. Nice beach and relaxed atmosphere."], ["Reviewed July 11, 2017", 5.0, "A \"must do\" in San Diego", "In addition to a wide variety of shops and restaurants, the island offers beautiful architecture. The Hotel del Coronado is a \"must see\", with beautiful grounds and a nice beach. Orange Avenue through downtown is a great place to spend a few hours, but visit some of the side streets to view a variety of building architecture. It can get crowded in summer, but we found parking by searching for tips online. We arrived before 11am and found good parking just off of Orange Ave within minutes.\nShow less"], ["Reviewed July 11, 2017", 4.0, "Beach and is so smooth and fine", "We just a few hours there just to see how the place is like. It's a beautiful place, and the sand is so fine and smooth. It's very hard There are lots of people. If you can find parking, it's only .25 an hour, very reasonable. It is very hard to find bathrooms along the beach. Lots of signs warning people that everything is for patrons only, which is understandable. It's business. The visitor is the only place we know if that has public bathrooms, but it's not on the beach, and it closes early. There foot rinses on the beach. It looks like it's for the people who stay there, but others were using them. If you drive down toward the other end of the island, there are other little parks. Close by is a little beach on the bay side for little kids with a playground, lifeguard, bathroom, foot rinse, shower. We drove all the way to the other end of the island and found a Costco in a nearby town, but it was a big loop back to San Diego.\nShow less"], ["Reviewed July 11, 2017", 5.0, "A step back in time", "Beautiful, historic, quaint, and full of fun things to do ! The free Island shuttle runs all day; stopping every 20 minutes at 8 locations. The ferry ride across the bay is an excellent way to travel-no need to worry about parking or traffic and the shuttle takes you all around the Island. The Beautiful Hotel Del Coronado is a MUST SEE! The shops, restaurants, and beaches are stunning! The Sand Castle Man is always building something amazing on the beach. A wonderful trip back in time where kids still ride bikes on the streets and families are playing in the sand. A magical vacation spot that is difficult to leave! ❤️\nShow less"], ["Reviewed July 10, 2017", 3.0, "Beautiful but crowded", "Would have loved to spend more time here but it was so crowded. No place to park. I think you need to plan to be here very early if you come. Not ideal place for families with kids, in my opinion. Better place for young and singles.\nShow less"], ["Reviewed July 10, 2017", 5.0, "From golf to paddle boarding", "So much to do! Walk the beach, shop the unique shops, sail, take a gondola ride, wind surf or paddle board. Have a picnic listening to the band playing in the gazebo, get up and dance! Ride on the varied bike paths. Enjoy the varied foods offered at the many restaurants. Enjoy the sea breeze. Enjoy yourself!\nShow less"], ["Reviewed July 10, 2017", 5.0, "We will most definitely go back!Also we will continue to recommend others to travel to the same spot!", "Our stay at the 1906 Lodge on Coronado Island was special,and a trip to certainly remember! The calm of the environs, the attitude and friendliness of the populace,along with the inviting foods, made it all exceptional and worth while!"], ["Reviewed July 10, 2017", 5.0, "Lots to do", "We had teenagers and kids under 12. Loved everything. Lots to do. Golf carts, bikes, kid friendly activities and restaurants. Patricia Ryan"], ["Reviewed July 10, 2017", 5.0, "What a wonderful little Island!", "Coronado Island is a must see when visiting San Diego. It's a quaint little island that is easy to get to buy a car or by Ferry. There are many little restaurants and shops that'll keep you busy throughout the day. It's a great place to stay for vacation and allows you to enjoy the island feel but at the same time the ability to get to the city very quickly.\nShow less"], ["Reviewed July 9, 2017", 5.0, "A must see in San Diego area!", "What beautiful views from here. A nice little downtown area. Had such a good feel to it. Do not skip this on your trip! Words cannot describe it."], ["Reviewed July 7, 2017", 5.0, "Treat Yourself to a SEAL Haven", "Coronado Island is a true dichotomy in life. It is the home of the US Navy Special Warfare School (BUD/S), the Hotel Del Coronado - for the rich and famous, and NAS North Island. All of this is packed into one tiny island at the end of a massive bridge, the Coronado Span.\nIf conditions permit, go see the Brown Shoe Navy Coastal Riverine Museum boats on display.\nThis is a sharp contrast to the USS Midway\nShow less"], ["Reviewed July 7, 2017", 5.0, "Relaxation", "Stunning. Super relaxed, everyone is friendly. Little bit of a yuppie vibe in the major resorts, but still everyone was quite friendly. Great beaches, good food, gorgeous sunset. Random trolley tours which were adorable, and free shuttles to places. Nice for a few days. Very relaxing!\nShow less"]]}}