{"Coronado Bridge": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Coronado Bridge", "url": "/Attraction_Review-g60750-d127014-Reviews-Coronado_Bridge-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/86/51/35/photo1jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "4932"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "A Bridge too far", "I was originally a little bit nervous on this bride as arrived in the dark and I was worried about dropping into the sea (nutty I know) However we crossed this bridge so frequently,I got used to it. There were beautiful vistas from the bridge and to the bridge from our hotel balcony. It is a beautiful structure. I understand 100,000 cars cross the bridge daily and it was responsible for increasing house prices by 10000 per cent,\nShow less"], ["Reviewed 2 days ago", 5.0, "Very pretty drive", "The bridge is very high, and blue. It's a nice drive over to Coronado Island, and there's lots to see."], ["Reviewed 3 days ago", 4.0, "WOW! Like a roller coaster ride", "We got a Mustang from the rental car company and I felt like I was on a roller coaster! Yikes! We don't have these bridges in Chicago ... very cool!"], ["Reviewed 4 days ago", 5.0, "Beautiful HIGH bridge!", "The bridge going to Coronado is so awesome and such an easy way to get to the island! We went on a cool day so the traffice was not bad at all. When we arrived at Coronado it was fun to park and walk along the ocean....beautiful island to explore...the Coronado Hotel was beautiful also!\nShow less"], ["Reviewed 4 days ago", 5.0, "Coronado Island", "We drove over the Coronado Bridge and on to Coronado Island where we visited the historic Hotel Del Coronado and walked along the boardwalk there. A must-do if you like history."], ["Reviewed 4 days ago", 5.0, "Interesting structure", "It is the best way to go to Coronado Island. The island is worth a visit-old hotel, beach and restaurants."], ["Reviewed 5 days ago", 5.0, "Take a ride over to this beautiful island", "The bridge to the island is just beautiful...take time to explore the island and the beautiful homes and of course the Del Coronado Hotel...so beautiful. Downtown offers some fun shopping in boutique stores, and the beaches are lovely."], ["Reviewed 5 days ago", 3.0, "On the way", "Quickest route to North Island. Please obey traffic laws. I do not recommend looking around while driving, if you are a passenger...you may be able yo take a photo. Very nice view of the bay."], ["Reviewed 6 days ago", 4.0, "Got the bus over", "We had a 3 day pass for the transit system, that includes trams and buses, so we got the bus across using our pass. Really easy simple and no haste. Great views from the bus. You can enjoy without driving."], ["Reviewed 6 days ago", 4.0, "Wonderful view of Bay", "Very much enjoyed the drive over the Coronado Bridge. Would love to walk it, but don't know if that is possible."], ["Reviewed 6 days ago", 5.0, "AAD 18", "Beautifully built bridge connecting main city to the Coronado area. You can view the border area of the Mexico also. Bridge height is quite high to accommodate ships and boats movement."], ["Reviewed 1 week ago", 5.0, "Expand your horizons!", "Take a trip into another part of San Diego and see the city from a difference vantage point. Especially beautiful at night, and there some great places to sit and enjoy the views!"], ["Reviewed 1 week ago", 5.0, "Magnificient from the shore on Coronado", "This is a beautiful part of the San Diego skyline. I don't enjoy being that high off the ground, but it is an easy drive from downtown San Diego. Once a year in May, you can do the Coronado Bay Bridge Run/Walk and actually walk across it, after you donate to a Navy charity.\nShow less"], ["Reviewed 1 week ago", 5.0, "A Bridge with a view", "We traveled this bridge twice once on a Bus Tour of San Diego and then while on the Hop on Hop Off Trolley Tours and it impressed us so much we took a Harbor Tour and went under the bridge"], ["Reviewed 1 week ago", 5.0, "Awesome view of San Diego!", "Be sure to drive over this magnicient bridge!! Crossing over you get such a wonderful view of San Diego!!!"], ["Reviewed 1 week ago", 5.0, "Cool view", "Went to sandiego for a trip. Went to the bridge the view was really nice. Went down to the beach and swam in the ocean. Freezing cold but great time"], ["Reviewed 1 week ago", 5.0, "Amazing bridge!", "It’s a bit screwy on the approach to the bridge. Thought our GPS was sending us to places unknown but before we realized it, we were on the on ramp to get on this bridge. Make sure as you’re going south on this bridge to look to your right......beautiful view of San Diego harbor!\nShow less"], ["Reviewed 1 week ago", 5.0, "Wide and smooth", "The Coronado bridge is easy to drive. It’s wide and smooth with fabulous views! The signs are clear and easy to read. By the way, Coronado is a fantastic area!"], ["Reviewed 2 weeks ago", 5.0, "Great Views", "I think if your hear visiting then you should check out Coronado. I worked there for many years. You can go to Coronado Brew company on Orange for cold beer and great food. However, be advised, there are peak travel times so plan accordingly."], ["Reviewed 2 weeks ago", 5.0, "Place of enjoyment", "The sight seeing is great. There are lots places where you can just stand or sit and enjoy the bridge view. I strongly suggest eating at tge restaurant next to food mart right before the bridge. Great spot!"], ["Reviewed 2 weeks ago", 5.0, "I ain't afraid of no bridge!", "If you have a fear of bridges, this is not for you. It spans over 2 miles and makes a nice curve from San Diego to Coronado. The views from the bridge are awesome, so have your camera ready. The experience is even more meaningful if you are on a tour so that they can fill you in on the sights to your left and right. It is worth the trip because both San Diego and Coronado are worth the visit.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Extraordinary", "Wonderful pc of engineering\nI believe bridge is 2.5mls from start to end. At peak traffic times the two lane eastbound is made into three lanes & visa versa westbound. This is achieved by a motorized man driven machine that literally pushes the middle concrete barriers from left to right & right to left pending when the traffic is heaviest going East or Westbound. Amazing well worth driving over it if in Southern CA. Sidebar: traffic is extremely heavy in the am up to 9ish & likewise in the afternoon 4.30ish tru 6ish\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Impressive bridge", "The Coronado bridge itself is not that special, but the place it’s leading to - Coronado - is a very charming area. Calm and far away from the lively city of Dan Diego and yet so close to the beating heart of Southern California."], ["Reviewed 2 weeks ago", 5.0, "Superb Views!", "Great views of the city, ocean, and surroundings. Worth a drive across both ways, sun setting views are spectacular."], ["Reviewed 2 weeks ago", 4.0, "Great engineering accomplishment", "My wife and I drove over the bridge to visit Coronado. Spectacular engineering and views, but without pull offs to see the views, it was just a big bridge."], ["Reviewed 2 weeks ago", 5.0, "Great View", "Great view! Special when the sun is setting. The main roads are very narrow and because you can get easily distracted because of the view make sure you keep a close watch on the rode."], ["Reviewed 2 weeks ago", 5.0, "Have the camera ready", "The bridge that will take you from downtown San Diego to Coronado Island. Yes parts of the movie Top Gun were filmed here and home to the world famous Hotel Del Coronado. Visit for the day or lunch/dinner. It is free to drive over the bridge.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "No Cycling on the Bridge but gorgeous Views", "Cyclists can cross on a bus or reach Coronado by Ferry from Seaport Vilage at the Broadway Pier. Cycle path around the bay is well worth the ride which is flat and scenic."], ["Reviewed 2 weeks ago", 5.0, "Beautiful scenery. Must visit when you are in San Diego.", "Cross the bridge to enjoy the beautiful view. Once you are on the other side, you might think you are in Europe or other country. Very unique and the beach is so nice. Watching the sunset is a great way to end a day walk around. So nice and so relaxing.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Stunning Views - Let Someone Else Drive!", "This sweeping, majestic bridge soars over San Diego Bay, connecting San Diego to Coronado Island. Built in the 60's, it was a toll bridge for years but is no longer.\nAs you soar above the harbor, the view of the bay in both direction is breathtaking.\nBut the traffic is often heavy and the road curves pretty much continuously, so if you are driving, look at the video later!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful views", "Beautiful views from the bridge which connects San Diego with Coronado. Traffic during commuting time so be patient..."], ["Reviewed 3 weeks ago", 5.0, "Great view", "Great views both directions. A greater understanding of the city layout can be seen from this vantage point. Good view of naval base."], ["Reviewed 3 weeks ago", 5.0, "Stunning view", "The Coronado Bridge that we crossed while driving to the Coronado Beach is really stunning - the bridge is long and high and the views are stunning. You should take this way while going to the island."], ["Reviewed 3 weeks ago", 4.0, "very tall", "Its weird reviewing a bridge. It is extremely high above the water. It offers great views of the harbor. Great to cross at night and see all the lights of the city."], ["Reviewed 3 weeks ago", 5.0, "Impressive", "We drove over this bridge and took a harbor cruise which went under the bridge and from every angle, it is impressive. It is a landmark you can see from practically anywhere in greater San Diego. The ride over was fast and gives a great, elevated view of everything in the area. There was no toll when we went thru which made driving very quick. Worth doing to see the Coronado Hotel and the surrounding beaches.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Bridge from San Diego to Coronado", "Great sightseeing ride from San Diego over to Coronado. Also enjoyable to take the two part harbor cruise which goes under the bridge twice. Interesting note: The bridge design had to include making each section float, so that enemy bombing would not block ships from leaving the harbor.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Jumpers Paradise", "Well this bridge could be beautiful at night if it was lit up from below. It is a well kept secret in \"Coronado circles\" that many of their \"troubled kindred\" use this bridge to commit suicide. Most recently the city voted to put up nets on the sides and make it less beautiful but safe over all instead of lighting it. When there are traffic problems (which is about every day) this bridge can really mess up your day. Luckily there are two better alternative to reach Coronado, the Ferry or the Silver Strand Highway.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Scary in a convertible", "We drove over this in a convertible with the top down on our way to the beach. Scary but neither my wife or I wanted to admit it until we were off. Fun bridge and it is now toll free."], ["Reviewed 3 weeks ago", 4.0, "Nice, long bridge", "This is a nice, long, winding bridge connecting to the Coronado Island. The water views are spectacular as you cross into the island."], ["Reviewed 3 weeks ago", 5.0, "Spectacular", "Wow - I've been on lots of bridges - even those high enough to allow commercial ships to pass, but this one is so high. What a view. Well worth the drive over to Coronado just to travel the bridge. Also don't miss the Coronado Hotel - a must see.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "An awesome trip over this bridge", "Felt like we were in the sky as the bridge is so high. A great engineering feat and the views were spectacular. The trolley bus driver gave us hints how to get the best photos."], ["Reviewed 4 weeks ago", 5.0, "Hop on hop off", "We had a great experience with the hop on hop off bus line. It took us to over 20 spots around the city, over The Coronado bridge, and onto The island . This bridge is very impressive, it is curved, very long, and the views are awesome. Well worth the tour.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Very nice bridge over a busy harbor", "We were scared at first but as soon as we saw the ships and boats below we forgot about the highness of the bridge. It was too cool that you can see the Navy ships!!!"], ["Reviewed 4 weeks ago", 5.0, "And Thats a Bridge", "I was there about when it first opened and it was a real treat to go across without having to pay a toll. This bridge is really high up and a great access to Coronado Island. Have someone ready to take pictures as you are driving across. We took a harbor tour and also got to see it from the bottom end. Quite a feat in engineering.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Sight To See", "Enjoyed seeing the bridge from both driving over it and from the harbor. Drive over it and have lunch in Coronado."], ["Reviewed 4 weeks ago", 5.0, "Coronado Island", "Visited Coronado Island for a day. Wonderful island to visit. Wish I had a Bike to bike the island. Visited beach, lunches at Hotel Coronado and toured the historic hotel."], ["Reviewed 4 weeks ago", 4.0, "Spectacular", "This one of a kind bridge is something to see and drive over. One of the things about the bridge is its curved design, they could have built it straight but it would have been under 2 miles long and they wouldn't have gotten any federal money to help with the cost. That's why it's curved to make it 2.18 miles long to get the the Feds money. I personally thought that was wrong.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A great view of San Diego", "Only gripe is the multi lane directional highway bridge merges into solo directional lanes right at the merge zone which causes the entire bridge to crawl. Otherwise some of the best views of San Diego bay area."], ["Reviewed 4 weeks ago", 4.0, "Nice views", "Nice views. Definitely go to Coronado and look at the SD skyline from Coronado. Best views of the skyline."], ["Reviewed 4 weeks ago", 5.0, "Not really a tourist attraction", "This is a beautiful bridge with a beautiful view in both directions. It is mostly for transportation to and from the island. The driver will have to pay attention to the road, but passengers can enjoy a really spectacular view of both water and city lights.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "It's A Bridge.......", "The Coronado Bridge connects downtown San Diego to Coronado. It is about a 5 minute drive with a nice view of downtown San Diego. But otherwise, it is just a bridge."], ["Reviewed 4 weeks ago", 4.0, "Incredible views!", "You have to drive over it to get to Coranado! Looks like fun to bike or walk. Try not to wreck while driving and looking out your window!"], ["Reviewed 4 weeks ago", 4.0, "high rise to heaven", "odd to do this review, but it is a fine - vvery high, winding bridge to IB and Corodad - no choice but to use it..."], ["Reviewed 4 weeks ago", 5.0, "Amazing View", "Check out the view on your way to Coronado. Beautiful overlooking the bay. Easy access, good traffic flow even on a Saturday in late January."], ["Reviewed 4 weeks ago", 5.0, "Cool Bridge", "Enjoyed an afternoon on Coronado Island, very pleasant. The island is easy to get around on and we enjoyed a leisurely walk on the beach."], ["Reviewed 4 weeks ago", 5.0, "Spectacular Views", "This bridge leads into Coronado which is a beautiful area which houses one of the Navy bases as well as the training ground for the Navy Seals. Once you get to the top you can see forever in all directions. The views are amazing. The city was talking about putting lights on the bridge for a beautiful night show as well as safety features but that hasn’t happened yet. Once you are on the bridge you cannot turn around you must complete the drive. The only other way to get to Coronado is on the road called the silver strand.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Magical view", "You have to cross this bridge if you visit Coronado. It’s a little iconic spot. Lots of history and apparently a favorites suicide place. Once on the bridge you get a marvelous view out over the bay - the skyline is tremendous and the view of the navy harbour is a treat.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Scenic", "A looping long bridge with a great view Walked along the beach near the Coronado Hotel There was a guy who makes unbelievable sand sculptures nearby It’s a must see. The hotel dates back to the 1880s. Nice area to relax"], ["Reviewed January 22, 2018", 5.0, "Spectacular views of Cononado is just the start!", "Amazing views as you head into Coronado from this landmark structure. Sweeping views of downtown San Diego as well!"], ["Reviewed January 22, 2018", 4.0, "its a bridge", "we used the bridge several times with no problems easy on and off ramps the traffic flowed well even at commuter time"], ["Reviewed January 22, 2018", 5.0, "Beautiful views", "When you drive over the bridge you have some of the best views of San Diego and the water. The city of Coronado, is gorgeous, lots of shops and cafes and the beaches are gorgeous. Go see the Hotel Del Coronado, not to be missed"], ["Reviewed January 21, 2018", 3.0, "Coronado - San Diego Bay Bridge, unto itself a method to traverse the bay, albeit a nice landmark", "The San Diego - Coronado Bay Bridge is an iconic component if the skyline. It serves as as a nice way to traverse between the two great cities. The bummer is there is no pedestrian of bicycle option. You either drive, hop a bus or opt for the ferry, for the self powered afficianados. However you go, the beach and views of San Diego from Coronado cannot be beat.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Beautiful", "We took the bridge to get to Coronado Island! The views of the skyline of San Diego with Yachts underneath were too good to see!!"], ["Reviewed January 21, 2018", 5.0, "spectacular", "I have the privilege of transversing the Coronado Bridge once or more a week. It has spectacular views, and excites the senses with water, cliffs, boats, ships, aircraft carriers, city skylines, restaurants ship yards, golf courses......pretty cool"], ["Reviewed January 21, 2018", 4.0, "Very pretty drive", "We drove this at night, and the city lights and the lights on the bridge were quite beautiful. Definitely a quick little side adventure for your trip to San Diego."], ["Reviewed January 21, 2018", 5.0, "Beautiful bridge!", "This was a fun and beautiful bridge to drive on and view! We enjoyed showing our young kids the bridge and then the island!"], ["Reviewed January 21, 2018", 4.0, "Holy Huge!", "Wow! This bridge is huge, just huge! You can seriously see for miles. Definitely nothing like we have ever seen before."], ["Reviewed January 19, 2018", 5.0, "It’s high", "Not a bridge you would want to ride with Ted Kennedy over. However, for an amazing view you really can’t beat it. I have to go over this bridge twice a month and I’m excited every time."], ["Reviewed January 19, 2018", 5.0, "The Blue Bridge", "This bridge is a wonderful structure connection San Diego and Coronado. It makes for a great backdrop in photos of the area. You can’t walk or bike across it; there are no special extra lanes. Cars only. However there are a few special events during the year where traffic is blocked for a run or bike race. Check a local calendar for those events. The view from the top is amazing!\nShow less"], ["Reviewed January 15, 2018", 5.0, "Interesting and Exciting", "An interesting ride over this narrow and high bridge to Coronado Island(not a real island). Great views of the whole area of San Diego!"], ["Reviewed January 14, 2018", 5.0, "Trolley Tour over the Bridge", "We crossed the bridge on the Trolley Tour, it was a great way to get from Old Town to Coranado. The Tour Guide had a lot of information about the area, including the socioeconomic background and history."], ["Reviewed January 13, 2018", 5.0, "Great view!", "Loved driving over this bridge and seeing all of San Diego -- the piers, naval shipyard, downtown, etc. was a nice clear day so we could see for miles."], ["Reviewed January 11, 2018", 5.0, "Great views", "Great views from this bridge, connecting directly to Coronado. Definitely worth a visit to Coronado when in San Diego."], ["Reviewed January 11, 2018", 5.0, "The Structure Itself is a Thing of Beauty", "i bridge is a necessity when it comes to crossing bodies pf water. Seldom can you combine this utilitarian feature with a work of art. The curving bridge connects San Diego and Coronado Island, There is a ferry that does the same thing, but it is truly just functional, not beautiful like the Coronado Bridge..\nShow less"], ["Reviewed January 11, 2018", 5.0, "Coronado bridge", "Great views coming and going in and out of San Diego and into the city of Coronado. Nice people, very friendly atmosphere. Very clean with no trash."], ["Reviewed January 10, 2018", 5.0, "It's not really an attraction. More of a landmark", "Great Views. Coronado is a nice place to have a picnic or go shopping in its downtown, since coronado avoids the noise and crime of some sections of the downtown."], ["Reviewed January 10, 2018", 5.0, "Beautiful bridge", "I was amazed driving on this bridge. It so so high and long and the view from it is amazing. The night drive is also pretty with all the lights"], ["Reviewed January 9, 2018", 5.0, "Entryway to Coronado Island", "This has a great view of the ocean while you are escaping to Coronado Island for the day and visit the famous motel located there"], ["Reviewed January 9, 2018", 5.0, "Gorgeous Views", "Even to just drive across this bridge it is a treat - with stunning views of San Diego and the ships / boats nearby. Great open air views with little obstruction - worth a look."], ["Reviewed January 8, 2018", 5.0, "Amazing view from this bridge!", "Every time I visit San Diego I venture over to Coronado Island. I have taken the Coronado Bridge several times. The first time was via car many years back.\n\nIn 2015 I decided to take the City Bus (MTS) to get there. If you don’t mind taking public transit, I highly recommend this path. There is only one bus that goes across the bridge, but there are frequent runs. Both the locals and the beach goers ride it. It is $5 for a bus/Trolley day Pass. Well worth it!\n\nSnag a bus seat on this bus, and you will not regret the view. Riding in the bus gives you a rather high view of the bridge. Very cool. Stay in the bus to Coronado Hotel, and stroll the day away.\n\nReturning by bus will give you the same high level perspective! Enjoy!\nShow less"], ["Reviewed January 7, 2018", 4.0, "Always a Beautiful View", "This bridge was built to replace the ferries that took people across to Coronado. It is a quick and great way to see views of the San Diego skyline and to get over to Coronado where there is always something to do and see. Today there are again ferries that run and they are fun but not as quick to get to Coronado.\nShow less"], ["Reviewed January 6, 2018", 5.0, "A bridge is a bridge.", "Has panoramic view if you are not the driver. Still has the toll plaza on the Coronado side. During rush hour tough. Non-rush.. not bad."], ["Reviewed January 6, 2018", 5.0, "Huge Bridge!", "This was such a great bridge to cross, it is extremely high and the rails aren't that big so it can be a bit scary if you are afraid of heights, use the middle lane to drive over it. The view though is beautiful, we all enjoyed it! It was cloudy when we went so the view looks blurred in the picture but I recommend it!\nShow less"], ["Reviewed January 5, 2018", 4.0, "Great View - But it's just a bridge", "Drove over the bridge and it gives you a great view of SD and the layout of the area. Not much else to it other than that. It's about the only way to get to Hotel del Cornado and the beach so it's a bridge well travelled.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Stunning views", "Perfect location for some amazing photos of the river, San Diego Convention and Petco Baseball stadium. The scenery is breathtaking and the bridge leads down to the riverbank which allows you to walk along it and appreciate the tranquility of San Diego."], ["Reviewed January 4, 2018", 5.0, "Any long bridge is a must do item.", "How can you not enjoy a long curved bridge over the water. It is wonderful to see all the ships and boats in the water on the way over. Somehow we got turned around on the way back to the main land and missed it in our return trip.\nShow less"], ["Reviewed January 4, 2018", 4.0, "You have to go here", "We loved going to the Coronado Island. They have an ice skating rink at the beach and the view is beautiful. So much to do and so many things to see. Great family outing."], ["Reviewed January 3, 2018", 5.0, "Outstanding vistas of the whole San Diego area while crossing", "Crossed this bridge several times to walk around the Coronado Hotel on our Christmas vacation. Old bridge but real nice."], ["Reviewed January 3, 2018", 5.0, "Crossed using the Hop On/Off tourist bus", "Good way onto the island which is worth a visit. Spent time walking near the ocean and beach. Pleasant touristy place with lots to do and good shopping."], ["Reviewed January 3, 2018", 5.0, "Beautiful View", "Taking the Coronado Bay Bridge to and from Coronado provides a breathtaking view of our magnificent city. Enjoy the ride it is worth the trip."], ["Reviewed January 3, 2018", 5.0, "Fun View", "This bridge is very well done and an easy drive. I enjoy the view while driving on the bridge as well!"], ["Reviewed January 3, 2018", 5.0, "Nice Bridge", "Free - no toll. Better for the passengers who can enjoy the view. It was neat going back to SD as the sea fog was rolling in under the bridge. Made for a fun trip."], ["Reviewed January 2, 2018", 5.0, "Great view during a Full Moon!", "One of our good friends drove us over this bridge on the eve of new year 2018 and we experienced an awesome view of the San Diego city. Plus, guess what? It was a full-moon night :D"], ["Reviewed December 31, 2017", 4.0, "Driving to Coronado", "Amazing aspect of our drive from the airport. The architecture provides an incredible view of the bay. It's hard not to look at the ships!"], ["Reviewed December 31, 2017", 5.0, "Great view!", "Alway enjoy crossing into Coronado over this bridge. No toll!!! Don't miss Coronado when you visit San Diego. You can also take a ferry."], ["Reviewed December 30, 2017", 5.0, "Fun to drive", "This bridge is fun to drive. It will take you from downtown San Diego to Coronado. It is a must see when you visit San Diego."], ["Reviewed December 30, 2017", 4.0, "Nice easy drive with some great views of the area", "If you are driving much around San Diego, you are likely to pass over the Coronado Bridge, we did several times and enjoyed the views in all directions. Make the effort if you can, it is well worth it. Just remember to keep your eyes on the road if you are driving.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Marvel", "Coronado bridge links San Diego with Coronado. The bridge was built in an arch to make it longer in order to meet federal requirements to obtain federal funding for its construction. Passengers can get a great view, the driver, not so much."], ["Reviewed December 29, 2017", 5.0, "Engineering Wonder", "What a fantastic bridge the Coronado is! Easily accessible from either end and free if your vehicle has 2 or more occupants. The bridge is longer than the Golden Gate, some would say unnecessary long, to qualify for additional federal funding. What a great view from the top if you dare take your eyes off the road! That's ok, we were in the outside lane in light traffic. Enjoy US superior engineering!\nShow less"], ["Reviewed December 29, 2017", 3.0, "Great view", "There are many great views of this bridge throughout the city or on a boat. The bridge is not allowed to be walked on only driven over."], ["Reviewed December 28, 2017", 5.0, "Top of the world", "I grew up in San Diego and recall the day when getting to Coronado required a long drive or taking a ferry. The bridge provides a spectacular view and there’s no reason to not drive across now that there is an no toll. On a clear day, there is no better way to see San Diego!\nShow less"], ["Reviewed December 27, 2017", 5.0, "Excellent view", "It was a little scare for me but very exiting experience to go over the bridge and see the whole city from there."], ["Reviewed December 26, 2017", 3.0, "good way to drive over the water", "Nice looking bridge. Easy to cross on Christmas day at noon and six. Not sure why this needs a rating."], ["Reviewed December 25, 2017", 5.0, "Beautiful bridge in San Diego", "The only way to get onto Coronado Island from San Diego other than a ferry ride. Nice architectural and engineering design."], ["Reviewed December 25, 2017", 5.0, "Impressive bridge", "This is a neat bridge. Very high allowing great views of San Diego harbor. No more tolls to pay. Worth the drive."], ["Reviewed December 24, 2017", 4.0, "Another last minute - Jump on the bus to visit", "I think it was the #902 bus from the Transit Store or metro station (trolleys) that I rode to get a quick view of the island. Indeed another very trendy touristy spot but getting off close to the beach on the island (or take the ferry from the bayfront side past Seaport Village) will be a longer walk. In town, people stop off to shop or have a coffee or lunch, then walk. Quaint houses and reminds me a bit of our “Steveston” in Vancouver.\nShow less"], ["Reviewed December 23, 2017", 4.0, "Coronado", "A peninsula forming round the harbour at the end is a naval base with an airport on it. Nice green parks well manicured with a few eateries. All in all a pleasant walk around although watch where you park can get expensive"], ["Reviewed December 23, 2017", 4.0, "Great site to see.... Take the trolley", "I took the Olde Town trolley through the different neighborhoods and over the Coronado Bridge into the area. The tour guide have the history of the bridge, the military and the home designs. It was a good day with beautiful sites."], ["Reviewed December 22, 2017", 3.0, "It is definitely a bridge...", "It’s a bridge, nothing fancy. Except there is that concrete wall movies thingy that shifts the lanes around from time to time. That is cool. I have never seen on of those before.\n\nGood views of the strand and the island, and the airport in San Diego.\n\nTake the ferry instead. It’ll be a better experience.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Super cool bridge", "If you have the chance, definitely take a drive over this bridge. Honestly, it completely stressed me out driving over it but the shape of it was nothing i had ever seen before."], ["Reviewed December 22, 2017", 4.0, "Coronado Bridge", "What an impressive bridge. I liked this bridge more than the golden gate bridge in San Francisco. Very tall! I travelled over this bridge in a bus. Fantastic views."], ["Reviewed December 22, 2017", 5.0, "The feeling of Key West", "The Florida Keys have a quaint, quiet feel to them and Coronado Island feels just like Key West. Traffic is light, shops are plentiful and everyone around you is enjoying themselves. Stroll onto the beach and you are welcomed to eat at the famed Hotel Del Coronado with an exceptional view. It is a bit spendy but much cheaper than renting a room there!\nShow less"], ["Reviewed December 22, 2017", 4.0, "An impressive bridge over a stunning waterway", "The photos accurately reflect the magnificent colour of the water and the beauty of San Diego area. A must visit location in the USA."], ["Reviewed December 21, 2017", 4.0, "Good view of the island 🏝", "Part of the highway, a little packed in the morning rush hours, the only quick way to get from downtown San Diego to Coronado Island."], ["Reviewed December 18, 2017", 4.0, "Great view for the passenger of your car", "So if you are the Driver of the car this may not be the best view as you need to concentrate on the traffic. As a passenger of a car, it is a great view. A fairly long and high bridge offers great (passenger) views of San Diego. Traffic going over and coming ba ck at certain times of the day can make it almost a parking lot so time it accordingly. Coronado is very touristy so worth a visit and the way to get there is over the bridge\nShow less"], ["Reviewed December 18, 2017", 4.0, "Gives you a good view of the harbor and Coronado Island", "We were staying in the Gaslamp area and wanted to go to Coronado Island one day. We caught the bus which was less expensive than the ferry. The bridge is amazing with the big curve as it approaches Coronado. It was indeed a most interesting ride. We had decided to take the bus there and come back on the ferry but later decided to use the bus again.\nShow less"], ["Reviewed December 17, 2017", 5.0, "The view!", "We went across the bridge during the day and at night. The day view was beautiful, but let me tell you the sight at night was spectacular! A must see if in the area!"], ["Reviewed December 17, 2017", 4.0, "It's a bridge, what can you say.", "The views of San Diego are great if you're a passenger! The bridge is free and to get to Coronado and the beaches it the way to go."], ["Reviewed December 16, 2017", 5.0, "Impressive Bridge", "We crossed this bridge on a trolley...interesting, unusual bridge offers great views in all directions."], ["Reviewed December 15, 2017", 4.0, "What a beautiful spot!", "We drove over to the island but it was so busy we lost a lot of time finding parking (a Sunday). So glad we went though as it was a lovely spot. We walked around and looked at Hotel Coronado, down onto the beach and some of the harbour area. Would love to return one day.\nShow less"], ["Reviewed December 15, 2017", 4.0, "Wow look", "It will make you to feel wow when driving on this bridge and looking from the top. Clean blue and many sea rides make the view very beautiful."], ["Reviewed December 14, 2017", 5.0, "Beautiful!", "Went over the bridge to visit Coronado.. It was lovely.. The bridge is 2.1 miles long and curved. Recommend going over at night as the city lights reflect in tje water.. Amazing!!"], ["Reviewed December 13, 2017", 5.0, "Great adventure.", "Wonderful trip over the bridge. Traffic was not bad. Great view from the bridge of San Diego and Coronado island."], ["Reviewed December 12, 2017", 3.0, "coronado bridge", "You can get some good pictures of this bridge if you take the ferry to Coronado Island. We never drove across it but it makes for some nice pictures of the bay from the ferry."], ["Reviewed December 12, 2017", 3.0, "ok to get to Coronado", "Nice bridge by bridge standards but how much can you say about a bridge ? Views of the bay and city are nice."], ["Reviewed December 12, 2017", 5.0, "Best free view", "Visit Coronado via the bridge. Non-drivers will have a great view. Best to go at non-peak traffic times."], ["Reviewed December 10, 2017", 5.0, "Views Forever", "My husband's cousin took us on a driving tour that included going over the beautiful Coronado Bridge to the Hotel Del Coronado. What a great spot for viewing the boats, beaches, and ocean around San Diego. We were lucky to be passengers so we could look around to our hearts' content as we crossed the Bridge.\nShow less"], ["Reviewed December 10, 2017", 5.0, "the bridge to a wonderful community", "This bridge connects San Diego with the Coronado community. The bridge itself used to have a toll to help cover construction and maintenance costs but that has since been removed several years ago. This bridge is high (very high at its peak) to allow Naval ships pass underneath. I suggest you take turns driving this bridge so you each get to look at the sights while the other keeps an eye on the road (the bridge curves). Once off the bridge on the Coronado side follow 3rd street to North Island Naval air station or turn onto Orange St. and head South into downtown Coronado. Many small shops of all types head West and enjoy the beautiful wide beaches. So much to see and enjoy on Coronado Island.\nTake the bridge just for the experience if nothing else since there is no fee you wont regret the view at the top, just keep and eye on the road as well, which is hard to do with that view.\nShow less"], ["Reviewed December 8, 2017", 4.0, "Famous San Diego view", "Coronado bridge was a toll when I moved here in 1985. It still makes me a little nervous to drive over but the view of the bay is spectacular! You can take a ferry over to Coronado and see it best by boat.\nNo matter Coronado bridge is a landmark.\nShow less"], ["Reviewed December 6, 2017", 4.0, "An interesting landmark, worth traveling.", "It is honestly just a rather dramatic 2.1 mile long bridge spanning San Diego Bay, just south of downtown over to the exclusive neighborhood of Coronado. It is often used as THE city's landmark structure. No pedestrian, or bike, traffic is allowed across it. Once a toll bridge, that ended about 10 years ago. They light it up at night, and plan to have some fancy LED display in the future. It is a three lane bridge, with the center lane alternating direction to accommodate commuters.\nIf afraid of heights, probably not for you. With an extra tall height it has a good view of the City and bay at 20 miles an hour. Its' tall arch allows large ships to pass underneath it (mostly military back in the day). I was always told that it was designed to break into sections and float should it be bombed. This preventing enemy bombers from bottling up ships in the south end of the bay. Has not been put to the test yet.\nChicano Park is under the east end of the bridge, with historical ethnic/political murals on the first supports. I don't imagine many casual tourists go to Coronado, but I would suggest if you are staying downtown, take a cab over the bridge and have them drop you at Ferry Landing. You can use the small beach area, the restauraunts or rent a bike there. You can follow Orange Avenue south-west 1.5 miles to the Historic Hotel Del Coronado (where the movie \"Some Like It Hot\" was filmed). The mile long public beach there is my personal favorite. If you are in for some serious adventure/exercise (22 miles), there is a bike trail you can take from downtown, around the south end of the bay, to fairy landing. It is a worthy jaunt, most of the locals have not even attempted. Give yourself plenty of daylight when you start though, it runs through some remote, poorly lit areas. If you get a flat, or need water, you will have to travel some miles to find help.\nShow less"], ["Reviewed December 5, 2017", 3.0, "Cool bridge with a cooler destination", "The bridge itself is pretty average but the island of Coronado with its famous Hotel del Coronado and the amazing surrounding beaches make this part of our must do list each time we visit San Diego."], ["Reviewed December 3, 2017", 5.0, "Great views and our tour guide Roxane was very good at showing the sites of San Diego.", "We always try and do a bus tour of the cities or locations we visit and this time was no exception.\nWe used The San Diego Ride and Tours owned and operated by Roxane Atouil at 619-794-2486 and from the start she treated us right. She met us on time and provided a goody bag for the trip. We saw the city sites and Coronado as well as the Veterans memorial and many other wonderful areas.\nSimply put this was a very good choice and we thank Roxane for guiding us thru the area.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Wow!!!", "What a wonder! You can easily and without any fees cross this iconic bridge that connects the city of San Diego with North Island and the naval base as well as community there. Or you can catch a glimpse of this wonder from the downtown central library or from the deck of a cruise ship coming into the harbor.\nShow less"], ["Reviewed December 3, 2017", 5.0, "A drive over this amazing bridge", "If you have never been to San Diego you really should drive across this bridge there is some history of the bridge, and the view is stunning. So is Coronado quaint town. You might want to switch drivers so the one who drove over can see the view. I believe you can not stop on the bridge. It’s also not for people who do not like heights.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Beautiful piece of construction", "This bridge is an awesome piece of construction and connects San Diego to the beautiful island of Coronado. We love to travel both under and over it..... Impressive, but windy if you are on a tour bus, so wrap up !"], ["Reviewed December 1, 2017", 3.0, "Bridge", "Not sure how to rate this bridge, Is serves it’s purpose getting from A to B. Nothing else to it...."], ["Reviewed December 1, 2017", 5.0, "Wow", "This is a beautiful bridge to either look at or drive across. It is not the only way to get to Coronado but it is maybe the most scenic. Take a drive on it but use caution. The lanes are narrow. And please don't try to take pictures while you're driving, let the passenger(s) do that. Enjoy the view!\nShow less"], ["Reviewed November 29, 2017", 5.0, "AMAZING VIEW!!", "It's certainly worth the drive as a \"check the box\" kind of thing. Very nice views for sure. The island has a lot of very nice houses on it as well."], ["Reviewed November 28, 2017", 4.0, "It's a bridge", "Really great backdrop for pictures. It is worth driving over and there is no cost to do so. There is no area for stopping."], ["Reviewed November 26, 2017", 5.0, "Fun visit to Coronado Island", "Great restaurants and a fun place to serendipity with the family. Visit the hotel and check the Xmas deco."], ["Reviewed November 26, 2017", 5.0, "I was there shortly after it opened.", "This 2017 trip to San Diego and especially Coronado Island was all about nostalgia for us dating back to 1971. I attended the U.S. Navy SERE (Survival, Evasion, Resistance and Escape) School after I reported to North Island NAS Coronado. The 10 day School was geared to teach the Aircrew Sailor or anyone with orders to Viet Nam how to deal with the extreme demands of combat survival.\n\nI will NEVER forget catching a cab at the airport and taking that solemn journey across the Coronado Island Bridge. The cabby knew what or better yet who I was; some kid just out of Basic and Advanced Schools heading to learn about Survival. The trip was during the day in November; the sky was very clear with NO smog. The Coronado Bridge provided that lift up into space to see the San Diego Harbor for its true beauty. Very picturesque.\n\nFast forward to today, our return trip to Coronado Island was great as it gave my wife a small glimpse into the life I endured during that Survival Training Program. I lost over 13 pounds then, so I could not, in good faith, have made ANY recommendations for places to dine back then.\n\nToday, the Coronado Island Bridge serves as a conduit providing a means to leave San Diego and quickly travel over to the Town of Coronado or NAS North Island. The view it provides is picturesque to say the least.\nShow less"], ["Reviewed November 26, 2017", 5.0, "One of the best reasons to visit Coronado is the bridge.", "It's a beautiful bridge from afar, but the views from the bridge going in each direction are also good reasons for visiting Coronado island. I look forward to it each time."], ["Reviewed November 24, 2017", 5.0, "Spectacular and a lot of history !", "Lot of history behind this bridge that was completed and opened in 1969. Did you know that Ronald Reagan was the first person to ever cross this bridge (as a part of its inauguration) ? During the San Diego harbor cruise, one gets to enjoy amazing views of this bridge from many different angles and view points. A must see when in San Diego...\nShow less"], ["Reviewed November 24, 2017", 5.0, "No toll bridge", "What a view from the top as you pass to Cornado island. Boats in the bay, the navy ships and Bluewater. Awesome. But, a tall, well maintained, nice bridge...free"], ["Reviewed November 24, 2017", 5.0, "Impressive 2 mile bridge", "This is an impressive arch bridge that spans between downtown San Diego and Coronado. No toll, just expansive views."], ["Reviewed November 19, 2017", 4.0, "Beautiful views", "As a San Diego native I do not remember a time this beautiful blue and white bridge was not a part of San Diego. Coming back after awhile away and crossing this impress bridge i was reminded of the breathtaking views of San Diego. It was fantastic. .\nShow less"], ["Reviewed November 18, 2017", 4.0, "Trip on trolley over the bridge", "My wife and I recently visited San Diego with friends. While there, we took the trolley tour. The tour took us over the Coronado bridge. The bridge is very interesting and designed with a large curve."], ["Reviewed November 17, 2017", 4.0, "Links San Diego to Coronado", "This bridge links San Diego to Coronado where I saw one of the best white sandy beaches so far on my USA trip. The bridge is over 3kms long and unfortunately has the second highest rate of suicide on a bridge in the USA."], ["Reviewed November 17, 2017", 4.0, "Spectacular views stretching between Coronado Island and San Diego", "Took the bus from Down Town San Diego to spend the day on Coronado Island amazing place with great shops, beaches, and food."], ["Reviewed November 16, 2017", 5.0, "Both over and under ... A magnificent bridge", "Had forgotten how imposing the Coronado Bridge is since my last trip to San Diego. Rode over to and from the island in an Uber then later that evening had the pleasure of a bay cruise under the bridge at Sunset. A sight to behold!"], ["Reviewed November 14, 2017", 4.0, "Nice drive", "It's a nice drive out to Coronado if you're looking for a way to spend part of the day. We drove over the bridge and out the long peninsula, parked ($2) and walked on the beach for a bit, then ate lunch at Coronado Brewing Co. A lovely morning!\nShow less"], ["Reviewed November 14, 2017", 5.0, "Fantastic Coronado", "Must if in SD. The high curved bridge with the sight of parked yatch in the Pacific makes a marvellous sight. The OTT ride , its jovial lively commentary is so interesting. One can spend time in Coronado beach which has quite a bit of history. Overall, its fantastic & makes a long lasting memory.\nShow less"], ["Reviewed November 12, 2017", 5.0, "liked driving", "We were driving to Coronado island and this bridge reminded me of rainbow bridge near Niagara. Beautiful!"], ["Reviewed November 10, 2017", 5.0, "Pleasure", "The Coronado Bridge is a Beautiful sight to see in San Diego. Not your typical city bridge where it is all function. Our bridge stretches out over the water like a ribbon in the sky. It arches up moving towards the clouds and the gently drops down into a beach town that even we San Diegans vacation at - Coronado. If you haven’t visited this historic “east coat” naval town where Presidents have dined then cross that bridge and experience something very unique.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Gateway to the island", "Highly recommend a visit across the bridge to the island. Check out the history to add to the experience. The bridge provides a great view of downtown San Diego as well as a gateway to Coronado Island."], ["Reviewed November 9, 2017", 4.0, "Great, efficient way to get to Coronado", "I wouldn't really call this a tourist attraction - more a means to an end, but it is an attractive bridge and the easiest way to get to Coronado - which is totally worth a visit"], ["Reviewed November 9, 2017", 5.0, "so beautiful", "drove over the bridge at night this time and was very impressed went on to the hotel del coronado . love the walk through the hotel and took some pictures . had a lobster sand by the hotel an just loved it ."], ["Reviewed November 9, 2017", 3.0, "good view", "OK, there was a decent view of downtown and up/down the coast but I would not have went out of my way for it other than at my wife's request."], ["Reviewed November 8, 2017", 4.0, "Great view of the city and Coronado", "It's an easy trip across the bridge to Coronado. Great views of San Diego and Coronado. Can't wait until the decorative lighting project for the bridge is funded and complete."], ["Reviewed November 8, 2017", 3.0, "A Bridge To Coronado Island", "It is a good bridge, high and well engineered and provides tthe road access to Coronado Island. For tourists take the 901 bus for a 30 minute ride to Coronado beach and get a good view of the bridge, the bay and the island from the bridge.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Put on Your San Diego Visitors' Bucket List", "A must see bridge, you say? Yes! This beautiful structure, described by my grands as \"The Blue Bridge\" spans San Diego Bay and connects downtown San Diego to Coronado Island. A trip across provides sightings for various US naval vessels as well as commercial ships and picturesque sail boats. The view approaching Coronado Island also includes views of the waterfront parks and ferry landing. Once in Coronado, you have arrived on one of the most beautiful San Diego Bay communities. The homes the parks, the shops, the restaurants, and of course the iconoc Hotel del Coronado are among the sites which await you.\nShow less"], ["Reviewed November 8, 2017", 5.0, "The view from the bridge is Magical!", "I had to drive in the center lane of the bridge the first few times I experienced the drive. It is intimidating initially,at least for me..I now LOVE it!\nThe view changes with the mood of the weather. It is never the same.\nEven if you have a short time to visit San Diego, like a long layover from the airport, get an Uber and cruise the bridge, see the view and know you experienced a landmark jewel of San Diego. If you have time to play, Coronado offers everything from beaches to galleries,bars,bike rentals,walking trails and more landmarks!\nYou will then get to see the bridge from the air when you return for another visit to San Diego!\nShow less"], ["Reviewed November 6, 2017", 5.0, "Coronado Bridge San Diego, CA", "Coronado Bridge San Diego, CA is excellence of engineering & it connects the city to the island & coronado beach"], ["Reviewed November 6, 2017", 4.0, "Great way to see San Diego harbor and the bridge is now free to use.", "The Coronado bridge is easy to travel on and the views are really good at that height. I used the bridge to get to the Del Coronado hotel which is worth the time to visit. Protected outside dining area which has ocean views. The sunset was beautiful and the beach is that soft white sand. A good walking beach. It was not that crowded when I visited the Del Coronado so finding seating was easy enough and the sandwiches were tasty. The drinks were good and the prices as you would expect are expensive. The interior of the Del Coronado is custom woodworking with coffer ceiling which are 15 ft high. The banquet room is beautiful. If you appreciate beautiful interiors this hotel and it's interior gardens are not to be missed if you are in the area.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Amazing bridge", "We went across this bridge by the Old Town Trolley Bus and we had amazing views from the bridge, both of San Diego as well as Coronado island."], ["Reviewed November 5, 2017", 4.0, "It rivals The Golden Gate Bridge in its size", "Went over this twice and then saw it from the shore several times. It is very striking, and it provides a very convenient way to get from San Diego to Coronado Island"], ["Reviewed November 4, 2017", 4.0, "Scenic view from the bridge.", "A nice right over to Coronado from the bridge. Does not take tolls. The drive was worth it to see other things around the area."], ["Reviewed November 2, 2017", 5.0, "Spectacular View", "This is a gorgeous, very interesting bridge. For passengers, they get a super view on a blue sky day, which is almost every day."], ["Reviewed November 2, 2017", 4.0, "Good view but ugly", "To go to the Coronado island by car or by bus nr 901 you are using this bridge. Very high and curves 90 degrees... Has beautiful view both downtown SD and Coronado Island. I feel everywhere is full of concrete at highways and bridges at US. They don't care about architectural esthetique by building bridges and highways, or maybe they do but roads and bridges build are very wide and big to show this..\nShow less"], ["Reviewed November 1, 2017", 3.0, "A bridge", "The Coronado Bridge is it interesting breeze occurs over the top of the coat the channel between the islands of Coronado and San Diego. The bridge richest to a height of about 200 feet above the water. Although the bridges interesting I’m not sure it’s at the sedation that you need to go to unless you’re going to go to Coronado.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Great structure with beautiful view", "Taking the bridge gives you opportunity to take some pictures both San Diego Downtown and the Coronado as well. But, it is best to just watch around 360 to absorb the wonderful view."], ["Reviewed October 31, 2017", 4.0, "Coronado Bridge", "Pretty neat to check out. The view from the bridge is pretty neat. The Coronado bridge connects San Diego to Coronado."], ["Reviewed October 30, 2017", 5.0, "outstanding view", "exciting to ride over a few times. beautiful view of SD. many sailboats and navy ships. We had a guide with HOP ON HOP OFF who pointed out the areas below."], ["Reviewed October 30, 2017", 5.0, "Beautiful At Night", "had to go across to check out views,all lite up at night,great view from our hotel,takes you over to the island for more adventuring."], ["Reviewed October 29, 2017", 4.0, "Drive over and see the city?", "Not sure why I’m reviewing a bridge. A bridge is something you either love it or hate it, if you need to use it - Love it. If you hate it I think you have a other problems in life. The bridge is Average. Not sure why I would give it excellent rating.\n\nNothing to do on the bridge except go over it and then take pics of the city. No real reaSon to take pic of the bridge itself, it’s not like Golden Gate Bridge in San Fran or the Ambassador Bridge in Detroit.\n\nI will give it a Very Good for being so neat and clean!\nShow less"], ["Reviewed October 29, 2017", 4.0, "Great View from Bridge", "Recently went over the bridge on way to Coronado. Great place to get a different look at the city. On our way back into the city, from the bridge, we were able to see Navy Seals in the water doing drills. It was awesome."], ["Reviewed October 28, 2017", 5.0, "A must visit !!", "First time to visit Coronado Island and it was the highlight of our trip for me so far. What a beautiful spot! Hired a bike for the family and pedaled along the foreshore then the kids enjoyed a swim at the beach. Lots of great shops and places to eat. The drive across the Coronado Bridge was stunning with views that take your breath away ! A MUST DO when visiting San Diego.\nShow less"], ["Reviewed October 28, 2017", 4.0, "A Bridge", "We enjoyed crossing the bridge! It’s like most bridges but we loved collecting shells on the beach which was our original mission!"], ["Reviewed October 27, 2017", 5.0, "Beautiful area", "We took a guided boat ride and went under the bridge. The views of the Navy base and Coronado were beautiful !! The guide described the bridge and all the unique aspects"], ["Reviewed October 26, 2017", 5.0, "Great views", "This bridge is high!!! From the top there are great views of the city we travelled by car and I don't think you can walk it mind you it is very long as it connects San Diego with Coronado worth a trip just for the amazing views\nShow less"], ["Reviewed October 26, 2017", 5.0, "WOW! Such a cool bridge...went on it and under it!", "Loved going over the bridge to Coronado! Then cruising under it. Saw some painters under the bridge, painting it. Yikes, what a scary job."], ["Reviewed October 25, 2017", 5.0, "Breath-taking views of the bay", "I tend to be a bit apprehensive about heights but found this to be a peaceful and thoroughly enjoyable drive. Not very long and the views were to die for. If accompanied by someone, I suggest taking turns driving so each gets to enjoy the view. Great views of the bay and sailboats, as well as the San Diego skyline. Definitely a must see, and it is FREE! unlike most sights in San Diego.\nShow less"], ["Reviewed October 24, 2017", 4.0, "Where Jack Black booted Baxter into the water as Ron Burgundy watched in horror", "Cool Structure - I’ve been over it many times. After a great time at the Hotel Del Coronado, you get a fantastic view of San Diego as you drive back across the bridge. If you are in San Diego, take the easy drive over the bridge and have some fun on Coronado Island. The beaches there are incredible.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Great harbor view-no tolls!", "This bridge is such a visible sight in the San Diego harbor that one should take a drive across. We did it near sunset and the orange sky over the bay with the various navy vessels below was inspiring. You get a great view, unless you are the driver who has to watch the road. Even then it's still fun. Lots to do on Coronado Island when you get across. Hotel Del Coronado, restaurants, Silver Strand beach.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Beautiful bridge to a tourist destination", "I've been over this bridge on several trips to San Diego and always enjoy it. I like the history of the bridge and how it is defense friendly. I especially like being a passenger so that I can look for activity at the naval base and in the air.\nShow less"], ["Reviewed October 23, 2017", 5.0, "A beautiful bridge", "This beautiful bridge connects SanDiego and Coronado. It is quite scenic and you can see lovely sites of the harbor and military ships. At the end there are quaint restaurants and art galleries. You can also see the naval seal training area. There are also some bars with great views to chill in the sun\nShow less"], ["Reviewed October 22, 2017", 4.0, "Pretty Cool Bridge", "This is a pretty neat bridge but I am surprised to see that it’s a point of interest. We live in Tampa Bay so we frequently travel large bridges. Maybe we are tainted from our living experience.\n\nWhat we enjoyed the most is visiting Coronado island. My wife recommended we vacation there in the future. I was not sure about Coronado as a vacation destination - but it looks perfect.\n\nWe will return. Exceptional day bridge and all. :)\nShow less"], ["Reviewed October 22, 2017", 5.0, "Must see Coronado", "Bus , taxi or uber - if you are in San Diego- go across to see this elite resort island. Go for a drink at the resort or lunch if you have time."], ["Reviewed October 21, 2017", 5.0, "Very High", "A little crazy, scary if you're afraid of heights, but all in all it affords awesome views of San Diego and the Bay."], ["Reviewed October 20, 2017", 5.0, "What a view!", "I'm afraid of heights, but the view was breathtaking. The city seemed so small compared to the vastness of the blue, seemingly serene waters. Boats of all shapes and sizes nestled in the waters below. If traveling in the morning, do so before 8!"], ["Reviewed October 20, 2017", 5.0, "Running place", "Coronado is perfect to feel the peace! And walk around the beach, perfect for cycling around, running and so many other activities"], ["Reviewed October 19, 2017", 4.0, "Great views", "There are great views from the bridge and while I wouldn't go all the way to San Diego just to see the bridge...I would see the bridge if you are in San Diego."], ["Reviewed October 19, 2017", 5.0, "Iconic San Diego bridge!", "While it is not as famous as the Golden Gate Bridge, it is a beautiful piece of architecture and engineering. The best photos (in my opinion) should be taken after you cross the bridge, from the Coronado side with the beautiful view of the city, the boats and the bridge. Very clever “zipper” like median that help control the flow of traffic.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Beautiful at night.", "We went underneath the Coronado bridge at night. What an awesome sight. The entire San Diego skyline was beautiful."], ["Reviewed October 18, 2017", 4.0, "Go for a drive :)", "I am a long time San Diego resident, and I love the Coronado Bridge. It is a spectacular drive just outside downtown. On a clear day, it offers a picture perfect view of how beautiful San Diego is. A little known fact, the bridge is built to collapse into San Diego Bay and block enemy submarines from entering the Naval shipyard in times of war.\n\nFor new travelers, the bridge is a freeway. There is no stopping in the middle for a selfie. It is a gorgeous bridge and it bridges downtown to one of my favorite places, Coronado Island.\n\nHope everyone has a chance to visit my city. It's a great city, America's Finest City.\n\n~Kevin\nShow less"], ["Reviewed October 17, 2017", 5.0, "Beautiful view", "We were happy to find out that the bridge is free! Such a beautiful view and a lovely sight from a distance too. Love taking the ferry, but this was great."], ["Reviewed October 17, 2017", 5.0, "Great bridge", "Had to travel over this bridge to get to Coronado Island where we were staying. Looks quite scary but gives great views of the Island and San Diego. A great feat of engineering skills."], ["Reviewed October 17, 2017", 5.0, "Bridge of Size!", "Beautiful structure and stands out proudly in the San Diego Bay. Much better viewed from afar as opposed to being on it as cars are on the bridge to get to a destination not to sight-see."], ["Reviewed October 15, 2017", 4.0, "A little scary", "I was wondering what the hoopla was about this bridge. From the shore it's just a bridge. It's not the Golden Gate or Brooklyn bridge. But once you go over it you get it. It's so dang high. Driving an RV over it was just a little scary. I couldn't take my eyes off of the road for fear of falling off while white knuckling it all the way across. The reason why it's so high? Navy ships have to get under it on their way out to sea from Naval Base San Diego.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Beautiful bridge", "This is a beautiful bridge that offers wonderful panoramic views. I would recommend taking some time to drive across it."]]}}