{"Crissy Field": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Crissy Field", "url": "/Attraction_Review-g60713-d144990-Reviews-Crissy_Field-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/9a/b2/d0/views-from-crissy-field.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1258"}, "address": {"@type": "PostalAddress", "streetAddress": "1199 E Beach", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94129-1605", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "On my morning running route", "I was staying in a hotel near Fisherman's Wharf and Crissy Field was part of my running route towards the Golden Gate Bridge. Pleasant area near a nice neighbourhood, with lots of cyclists and runners early morning. Nice views of the Golden Gate Bridge."], ["Reviewed 3 days ago", 5.0, "Best View of Golden Gate Bridge", "This was a wonderful surprise for us! We went in the morning and the sun was on the bridge and on the walking path. Beautiful spot for locals and visitors."], ["Reviewed 3 days ago", 5.0, "Great view of the bay", "My family and I grab some lunch and had a picnic in the park here. Suck a great place to just relax on a sunny day (which I know are rare in San Francisco). Highly recommend grabbing some food and a blanket and just relaxing with people you care about!\nShow less"], ["Reviewed 3 days ago", 5.0, "Awesome park for people and dogs", "Great place. Beautiful park along the SF Bay. Plenty of open space for sports and pets. Great people watching. Tons of bikers and runners. One of my favorite spots in all of SF."], ["Reviewed 1 week ago", 4.0, "Found this Place By Accident", "Riding bikes from Fisherman's Warf area to the Golden Gate bridge we found this park by accident. Another gem with plenty of parking and easy access."], ["Reviewed 1 week ago", 5.0, "Must see", "Pack your walking shoes and just head out on all the walking paths and trails. The views are incredible and the different points of history notes along the way are interesting."], ["Reviewed 3 weeks ago", 5.0, "If I lived in SF I would come every day with my dog here!", "We stopped on our bike ride over the bridge here and loved to see all the dog walkers. It was amazing to see how many dogs people could walk at once. The surroundings are beautiful. It was fun to see a volunteer group grooming the grounds. You can even volunteer on the spot to help if you want!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great views and activity.", "Had a half day to sightsee while on business in San Francisco and decided to walk through Presidio Park to Crissy field to get a view of the Golden Gate Bridge before dinner. The walk through the park was great and I was pleasantly surprised upon my arrival to Crissy Field. I didn’t realize that there were some small businesses along the walkway in front of the park which was a nice touch to add to the wide open and flat grassy area which was full of people picnicking, walking, doing yoga and playing with their dogs. Not to mention the waterfront, the view of the city and Alcatraz and of course the main attraction!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Serenity on San Francisco's North Shore", "While my husband was at Fort Point participating as a re-enactor in a Civil War Living History event, I took advantage of a glorious January day to visit nearby Crissy Field and log some steps. I'd never been there before and didn't know the history of the former airfield, but informative plaques filled in that gap. The large grassy area used to be part of the runway. A walking, biking, jogging trail runs alongside the Bay, giving visitors great views of the Golden Gate Bridge, Alcatraz and the San Francisco skyline. I walked a lot, but I stopped several times in order to snap pictures. Such a restful place away from the bustle of the big city.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Pleasant, flat walk", "I like walking here when I visit because it is right on the Bay and mostly flat. You can walk from the Marina to the Golden Gate Bridge. There is a slope up as you approach the bridge. It can be breezy."], ["Reviewed January 2, 2018", 3.0, "Beach Scene", "The kids were not interested, we rode through on our way to the Golden Gate Bridge. I was glad that we did not dedicate too much time."], ["Reviewed December 18, 2017", 5.0, "Great place to get iconic shots of the Golden Gate Bridge", "This is a lovely place to take a walk towards the Bridge or towards East Beach. There are great views and also wildlife to see. This is also one of the best places to photograph the Golden Gate Bridge. There is public car parking. You can also take a free Presidio shuttle bus ride around the Presidio.\nShow less"], ["Reviewed December 16, 2017", 4.0, "Leisurely Place", "Perfect location to go for a jog, have a picnic or just relax. Offering picture perfect views, this vast green area also has an interesting history of being a former airfield."], ["Reviewed December 13, 2017", 5.0, "Nice park with great views", "You can come here to learn about the history of this area and how it contributed to the defense of this nation or just come here to walk and take in the views. Watch out for the dog droppings. It is very popular with dog owners, unfortunately not all of them pick up after their dog.\nShow less"], ["Reviewed December 7, 2017", 4.0, "Great place to relax, go for a walk, and see the bay", "Chrissy field is a classic destination for SF natives and tourists alike. You can take a stroll while taking in the views of the bay and all for free. A great spot to take a classic Golden Gate Bridget photo."], ["Reviewed November 26, 2017", 4.0, "Nice Vantage Point", "Great vantage point for viewing the Golden Gate Bridge, lots of room to spread out and wander around. I do wish I would have known you cannot walk under the bridge from here, there is a dead end with a fence!"], ["Reviewed November 20, 2017", 5.0, "Get some fresh air!", "This area is really amazing. I have done it so many times, I almost take it for granite! The trail is nice and flat, and offers sweeping views of the San Francisco Bay. Great place to run, as it is not asphalt. Each step you take gets you closer to the Golden Gate Bridge until you get to Fort Point and you can't get any closer! Great nature preserve and is a must for any tourist and local alike!\nShow less"], ["Reviewed November 1, 2017", 5.0, "Super views of GG Bridge from an old airfield turned city park", "This is where my son asked his soon-to-be wife to marry him - their rescue pup at their side. Views of the Golden Gate Bridge are stupendous. Parking is plentiful and free. You can walk from the eastern end to the western end, and see the protected area for the western snowy plover. Lots of folks are out walking their dogs. Historically part of the Presidio of San Francisco, Crissy Field closed as an airfield after 1974. Under Army control, the site was affected by dumping of hazardous materials.The National Park Service took control of the area in 1994 and cleaned it up, and in 2001 the Crissy Field Center opened to the public. While most buildings have been preserved as they were in the 1920s, some have been transformed into offices, retail space, and residences. If you are hungry, you can grab coffee at one of the nearby trucks. There are also trucks offering quick bites. I recommend taking in a good weekend stroll: extra early is better. Bring your own coffee or a picnic. Enjoy.\nShow less"], ["Reviewed October 24, 2017", 3.0, "old airfield now a park", "A flat bit on your cycle ride to the bridge. No need to push along the road, there is a path beside the water most of the way. Parking & toilets."], ["Reviewed October 23, 2017", 4.0, "Beachy", "Nice view of the GG bridge. We strolled here after walking around the presidio area down to the beach. Quite a few people walking and swimming."], ["Reviewed October 20, 2017", 5.0, "Great view of Golden Gate bridge", "Crissy field is the best place to get a nice view of Golden Gate bridge. It is a picnic spot and one can find some fun activities to do here. Parking was easy."], ["Reviewed October 7, 2017", 4.0, "Great Views!", "Nice wide open grassy space in San Francisco. Great place for picnic or walking dog. Nice views of the Bay."], ["Reviewed October 7, 2017", 4.0, "A nice spot", "A great spot near the Golden Gate bridge. A clean and fun spot. Great location for watching the blue angels"], ["Reviewed September 20, 2017", 5.0, "Memories", "Personally, I think this is the best place to view the Golden Gate Bridge. Of course, I am bias. We used to come here every time we were in SF with our dog who enjoyed running around this spacious field. Our dog passed away just days before we made this trip up north and we certainly had a lot of memories of our time with him here. This will forever be our favorite place in SF. It has gotten more crowded and now we have to pay for parking but the view is still as beautiful as before.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Excellent Views", "Excellent views of the San Francisco bay, Alcatraz, the Golden Gate Bridge, Marin County, Angel Island, etc. Fun place to visit!"], ["Reviewed September 18, 2017", 4.0, "A Lovely walk on a sunny day", "We caught the bus to the bridge and walked back to town via Chrissy Field and the walk was wonderful. You have the shore on your left which has numerous dog walkers with many, many dogs in tow and on the right at one point you have a lake with all types of birds present. Well worth the effort.\nShow less"], ["Reviewed September 18, 2017", 2.0, "Unfortunately we could not get here", "As foreign tourists we had researched birding at Crissy Field and took a bus to near the visitor center expecting to be able to get to Crissy Field easily from there. We found that a new road cut off Crissy Field and were told it by the folk at the visitor center that it was a very long walk now to get down to the shore area. We started walking but gave up. We are older folk and it was very hot. We were rather disappointed.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Beautiful Open Space with a View", "Crissy Field is full of life, openness and views for days. This was our second trip to SF and we had to come back to hang out at Crissy Field. Take a picnic lunch or nap on a blanket or sit and watch people or boats in the bay, whatever your desire you can do it here. Some of the best views of Golden Gate and the bay around. Today we just laid on a blanket and admired the bay and Golden Gate. Beautiful place. My daughters quote was \"If I lived here I think this is where I'd come everyday.\"\nShow less"], ["Reviewed September 11, 2017", 5.0, "Wonderful Views of Golden Gate", "Spend a lovely afternoon strolling along the water, up to the Marina and into Chrissy Park with it's wonderful views of the Golden Gate Bridge and Bay. Nice beach with lots of dogs and spacious areas to walk."], ["Reviewed September 8, 2017", 4.0, "Awesome park!", "We spent a few hours here on a Friday afternoon in late August. This area has sweeping views of the golden gate bridge and the bay. There is a long path to walk along the Bay to the Golden Gate bridge. We strolled all the way to the warming hut, gift shop and bathrooms. We also took the path up to look at some of the batteries and stopped at the Golden Gate welcome center. It was a beautiful day with a light breeze and the sun was shining in-and-out of the fog. There were many people taking the path both walking dogs as well as riding bikes.\n\nBeautifully maintained area and we really enjoyed it!\nShow less"], ["Reviewed September 3, 2017", 3.0, "Open Space and Dog Park", "We briskly walked by Crissy Field on our way through the Presidio. While we did not really take advantage of it, it appeared to be well-used by both locals and tourists. In addition to providing yet another good viewing of San Francisco Bay, there were many dogs off-leash enjoy the grassy area. It appears to be a hot spot for local dog walkers, and seeing the dogs running around provided us with some fun amusement.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Fantastic views", "We came here for a walk and a run. It is a wonderful place to take in views of the Golden Gate bridge. Wear comfortable shoes fit for a gravel path, and a camera."], ["Reviewed August 28, 2017", 5.0, "Much Improved Park", "This huge park along the bay front has been much improved and is very well used by joggers, kite-flyers and ball players. Great views of the Golden Gate. Can be windy and foggy."], ["Reviewed August 27, 2017", 5.0, "Come here for a walk and get your EV recharged as well.", "An excellent windy place for a run or a walk. Plus free EV chargers. This is the kind of place every city needs."], ["Reviewed August 27, 2017", 5.0, "Walk to Golden Gate Bridge", "We walked through Crissy Field on the way to the Golden Gate Bridge & Fort Point. Great views out to the bridge & Alcatraz Island. Plenty of grassy areas for a picnic and a rest stop while enjoying the scenery. I'd recommend walking via Crissy Field rather than just catching a cab/Uber to the bridge.\nShow less"], ["Reviewed August 26, 2017", 4.0, "Wonderful place to people watch - land AND bay", "There are things going in the water and the field. People with their pets or friends playing games. Wind surfers and sailing boats. It is an awesome place for people watching"], ["Reviewed August 25, 2017", 5.0, "Beautiful area for a walk or run", "We walked through Crissy Field on our way to the Golden Gate Bridge. A beautiful area, with a pathway along the lovely beach or a good walk/cycle way farther back from the beach. Very busy at weekends but a real pleasure to be there. The area used to be an airfield but is now a conservation area and when you visit you can see why. Really worth a walk or cycle here.\nShow less"], ["Reviewed August 24, 2017", 3.0, "Confused", "Walked along from Fishermans wharf to GGB, confused as to why so many good ratings. Sure you can see the bridge and other views but the park itself is well, pretty average as was the beach. There is supposed to be buses that pass here but saw none. No signs of food or drink here either. Adjacent there is a huge sports and outdoors store (in an old converted supermarket), if that is your thing, they rent bikes there also.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Lovely breezy walk", "Great views towards a Golden Gate Bridge and Alcatraz. We walk from Marina to the fort under the bridge. The walkway is well kept and there are many benches to rest a while on."], ["Reviewed August 18, 2017", 5.0, "Brilliant walk", "Walked from Golden Gate Bridge to Fisherman's Wharf through Crissy Field. We loved it and it was one of our highlights. Great views of the bridge and a chance to learn more about the city."], ["Reviewed August 15, 2017", 4.0, "Beautiful View", "Went first thing in the morning. Perfect place to watch the sun rise over the Golden Gate. Don't forget your camera."], ["Reviewed August 14, 2017", 4.0, "beautiful vistas", "A lovely place to cycle or walk and get amazing views of the Bay. Also great views of Alcatraz, Golden Gate and across to Sausolito"], ["Reviewed August 9, 2017", 5.0, "the place to go to see the bridge", "I found it difficult to find an easy place to really see the water and the bridge, but Crissy Field was the winner for sure. There was a lot of parking and it was not too crowded. It offered beautiful views of the bay."], ["Reviewed August 9, 2017", 3.0, "nice place to take a picture", "walked from Golden Gate Bridge into the city through Crissy Field. Nice place to rest a little bit!!"], ["Reviewed August 4, 2017", 4.0, "Nice place to chill out", "Great views of Golden Gate in windy beach area. Lots of people hanging out enjoying the bay and bridge view. Plenty of parking all around the area."], ["Reviewed July 29, 2017", 5.0, "Excellent views of the Golden Gate", "Crissy Field offers up one of the best views of the Golden Gate bridge, especially at Sunset. There's lots of room to ride a bike, go for a jog, have a picnic or toss the frisbee around."], ["Reviewed July 27, 2017", 4.0, "Great at Sunset", "Nice park area with plenty of room for walking and taking in the view of the water and the Golden Gate Bridge. A brief drive down from Pier 39. We went at sunset time, which is gorgeous. Be prepared for the wind coming off the water, as it can get chilly quickly. Favorite place in San Francisco.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Don't take bikes, just walk", "It is absolutely beautiful, but even in July it is cold...56 deg F. We rented bikes, but really didn't need them. Walking this field is beautiful."], ["Reviewed July 23, 2017", 5.0, "Double Whammy", "Within walking distance of the Presidio and you can see both Alcatraz and the Golden Gate Bridge from here. Was very peaceful and not crowded."], ["Reviewed July 23, 2017", 4.0, "Nice view and walk", "Great view of the Golden gate bridge, the beach, and a fantastic walk, and if you're want to do some running, this place is amazing."], ["Reviewed July 20, 2017", 3.0, "Good view of the gate", "Its a nice place to picnic and soak in the views of the gate and alcatraz. Lot of people running around and playing with dogs."], ["Reviewed July 19, 2017", 5.0, "A great place to get a feeler the bay.", "I used to be an MP at the Presidio back in the early 70's .Crissy field was a working Army Airbase, and had some of the highest security of anyplace on the post. Now it's been converted back to a wet land, and a bay side trail where people walk, run. stroll and bike enjoying th fresh air, Great place to the a break from the busy bay area traffic .\nShow less"], ["Reviewed July 19, 2017", 5.0, "Best things in SF are Free! A walk in Crissy Field", "You don't have to spend mega bucks to find the best views in San Francisco. Take a long walk thru Crissy Field. You can start from the Yacht club and walk by the sandy shoreline. Catch spectacular views of the bay and sail boats as you take a leisurely stroll. End your walk with coffee at the Warming hut and a closeup view of the Golden Gate Bridge. And it's all free except for the cup of coffee!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Lovely views of Alcatraz and the Golden Gate bridge", "A lovely place to go for a walk on a Sunday morning. Picturesque as you can sit on the beach watching the waves and the dogs, looking at the view of Alcatraz and Golden Gate bridge. Lots of historical boards explaining the history of the surrounding area.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Beach time in the city!", "On a sunny day this is the place to view both Alcatraz and the Golden Gate bridge. It is a relaxed fun environment with a wide dirt/stone path that accommodates both walkers and bicyclers on their way to/from Golden Gate bridge. If you don't want to spend time on the sandy beach, just take in the view from one of the many long benches. Many locals walk their dogs here. there is wonderful bird watching as well. Others visitors watch the proverbial \"slow boats from China\" arrive in the harbor. It is the place for kite sailors, wind surfers to head out to enjoy the Bay. Wet suits are recommended for all but the most intrepid swimmer. Parking is free and ample during the week. On weekends, the lot fill up quickly. Final note, if you come during the right time of year, you will be able to whale watch right from the shore. Enjoy the gusty wind!\nShow less"], ["Reviewed July 14, 2017", 5.0, "Beautiful, Tranquil and Magical", "I have completely fallen in love with this place. Walked all the way from the Golden Gate Bridge until the fisherman's wharf all along the field by the bay. Love every bit of it. If I could, I would like to walk here everyday."], ["Reviewed July 10, 2017", 5.0, "Love it!", "Do come and enjoy this great part of the city. Picnic, bike, stroll or run, bring your kids or grandparents. Just in case, be prepared for fog and cold!"], ["Reviewed July 8, 2017", 5.0, "Unique view in the world!", "It is a unique place in the world! One of the best place to see the Golden Gate Bridge. I would recommend to go at the sunset time! Bring some food and wine!!!"], ["Reviewed July 7, 2017", 4.0, "Nice stroll along the shore", "This is a great place for a picnic and to stroll along the shores of the bay. On a Sunday, it was not really crowded so you did not feel like you were on top of other people. Great walk up to the bridge."], ["Reviewed July 5, 2017", 5.0, "Under renovation but plenty to visit", "This entire park area is awesome, walk around and through the park heading towards the Golden Gate Bridge, great way to spend an afternoon"], ["Reviewed June 28, 2017", 5.0, "Great views of the Golden Gate Bridge", "Easily accessed by bus from the center and worth the visit for great photo's. Possibly the best vantage point for taking photo's."], ["Reviewed June 23, 2017", 5.0, "Great place to relax", "You get stunning views of the Golden Gate Bridge, Alcatraz, and downtown all in one spot. We were able to find parking quickly and I was really surprised because we came on a warm clear day. It was 74 degrees so for coastal SF that's warm! There are activities and a cafe, lots of trails and walk paths too. The beach was nice, not crowned at all and grassy field was extremely large. We spent about an hour here then went on to Baker Beach\nShow less"], ["Reviewed June 21, 2017", 4.0, "Relax and enjoy the views and the beach!!", "We walked across the Golden Gate Bridge and back and decided to walk down to Crissy Field. It was Sunday and there were a lot of families on the beach and folks having picnics. The kids went into the water and it was sooo cold, but the breeze felt good. The view of the Golden Gate Bridge and Alcatraz were wonderful. We stopped at the Warming Hut and just enjoyed relaxing in the sun, watching the sailboats, the paragliders, and the huge ships crossing the bay heading towards Oakland. It was a good way to enjoy the cool breeze and relax after the trek to and from the bridge.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Very nice atmosphere", "A good beach for a short break, always fully crowded, avoid going weekends, suitable for sun baths. You can see people doing gliding in all time"], ["Reviewed June 18, 2017", 3.0, "Nice area, but not much going on", "Chrissy field is a nice area that's mostly well taken care of. Depending on the time of day, it's a moderately peaceful area to relax, hang out at the beach, take in the views of the bay, Golden Gate Bridge, Alcatraz, etc...\nWhen I was relaxing, there were a few guys wind surfing. They were tearing it up..it was pretty cool to watch.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Beautiful walk", "Beautiful walk from the information Centre beside the bridge. Well maintained tracks. Beautiful wild flowers and trees."], ["Reviewed June 15, 2017", 4.0, "Short Visit", "We really enjoyed our quick stop to Crissy Field. We had planned another stop here, but, unfortunately for us, less than an hour after arriving in the city, our rental van was broken into at the Walgreens on Divisedero and Lombard. We were in the store for less than 15 minutes. Apparently, this is very common in the city. Crimes against tourists are VERY common. Please, if you are a tourist in the area, be aware of your surroundings and never leave your items unattended or even hidden in your car. Rental vehicles have barcodes on the windshield, making them stick out like a sore thumb.\nShow less"], ["Reviewed June 15, 2017", 5.0, "A dog's delight", "We took our dog to this beach during the weekend. This is one of the best off leash beaches that we have been to in CA. Our dog likes to run and she found this place delightful. She also does not get into the water usually. I think the waves scare her but here there were some waterways which she really enjoyed splashing in. The beach was not crowded and the people/dogs seem to get along well. There are toilet and picnic areas and plenty of parking. We would use this beach frequently from now on. This is closer to us than Santa Cruz and Carmel that has off leash beaches\nPeople use this area for hand gliding. The beach is scenic against the backdrop of the Golden Gate bridge.\nThe only problem was that we have to drive through the city to get there.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Great Views & Fun For Kids!", "Grab a cup of coffee or you preferred beverage and enjoy a stroll through Crissy Field. There are great views of the Golden Gate Bridge and Alcatraz, kite surfers to watch, or try flying your own kite. There is a beach here. The water is COLD so unless you are very brave or wear a wetsuit there won’t be any swimming, but it is fun to run up, wait for the waves to roll in, get your feet wet, scream, and then run back again. Or however your family likes to do it. Your kids may get dirty. There is sand and water and you probably know which kid is going to end up a sandy and wet mess. Bring some baby wipes and maybe an extra set of socks. A towel wouldn’t hurt, but unless you are staying near the park you will be stuck carrying it all day. Be prepared to annoy your kids when you take all the pictures.\nShow less"], ["Reviewed June 6, 2017", 4.0, "Beautiful shoreline trail", "Well maintained-divided trails used by everyone (hikers,bikers,runners,roller bladers) and offer a gorgeous uninteruuped view of the Pacific Ocean, Alcatrez and the Golden Gate bridge. Very windy so wear layers."], ["Reviewed June 3, 2017", 5.0, "San Francisco gem", "Off the beaten path under the south end of the Golden Gate Bridge, is the ex Presidio base. Now it has been converted to picnic spots, fun centers (trampoline and wall climbing) so you can make your own fun in this beautiful panoramic beach front area. Views of Golden Gate, Alcatraz and the city skyline from a unique perspective that most tourists don't get to.\nShow less"], ["Reviewed May 31, 2017", 4.0, "The best view of the Bridge", "I visited Crissy Field because my husband was running in the Park Run which they hold every Saturday at 9am, it is a free 5k race which has its origins in the UK.\nThe race should have run along the path towards the Golden Gate Bridge, unfortunately the trail is undergoing restoration, so an alternative course was quickly put together. It did not alter that it had to be one of the best views, it is very popular with locals, who use it run, walk, cycle, boat and all other manner of activities\nCrissy Field was transformed starting in 2001 from a former military airfield into the area it has become now\nA lovely area and definitely worth a visit\nShow less"], ["Reviewed May 30, 2017", 5.0, "Gorgeous views & Romantic Spot! Be prepared for strong winds ;)", "Chrissy Fields is beautiful. Have already been here twice, once with friends and the other time with family.\n\nGorgeous views of Golden Gate, Alcatraz and more depending which spot are you parking yourself at. Lovely walks all the way to Golden Gate entry or the other way to Palace of Fine arts and parking yourself at the Marina brunch places to get a bite and a cold beer! Or opt to have a picnic with your friends around the picnic benches at Chrissy Field, but be prepared about aggressive winds here ;)\n\nHave enjoyed being here and snapping some great pictures. Great for sunny days so you can feel the warmth eventhough it's very windy. Just beautiful and easily accessible. We also took the presidio shuttle back to BART (10 min walk from Yacht and Marina) which was great!\n\nCan't recommend enough this romantic spot! Spread the love :)\nShow less"], ["Reviewed May 24, 2017", 4.0, "Great place for a walk on a sunny day", "Views of the Golden Gate Bridge and SF Bay, the ocean lapping at the shore, possibility of seeing sea lions, the ocean breeze....on a nice day, it does not get much better than this. It can be very cold on a foggy, winter day though....but you can buy hot chocolate to heat your spirit at the warming hut. Tourists, locals, bikers, dog walkers and joggers enjoy the paths.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Fantastic view of The Golden Gate Bridge!", "We took an Uber to Crissy Field to take photos with the Golden Gate Bridge. It was lovely! Wide open space with a great view! The fog was rolling in, so the bridge kept coming in and out of view, and it was magical! Great viewing point for the bridge!\nShow less"], ["Reviewed May 22, 2017", 4.0, "Great open area!", "I loved all the open area and the views of the Golden Gate bridge and the cityscape! Seen whales breaching under the bridge so bring binoculars!"], ["Reviewed May 21, 2017", 5.0, "A great walk with unbeatable views", "The walk from the palace of fine arts to torpedo wharf is a must do on a sunny day . The views of the Golden Gate Bridge are breathtaking . Allow twice as long as you would expect to take pictures ."], ["Reviewed May 18, 2017", 5.0, "The place to view the Golden Gate Bridge", "This gorgeous beach is located near the Marina district and will gift you with a memorable view of the Golden Gate Bridge along with a walk along a lovely beach. Especially good for visitors who miss their dog as it populated daily by both dog walkers and residents who bring their dogs for off leash fun and a splash in the bay. There is a nice spot called the Warming Hut for a quick bite and you can walk all the way to the Bridge itself if you are so inclined.\nShow less"], ["Reviewed May 18, 2017", 4.0, "Great place to take it all in!", "We took a pit stop here while riding bikes. It had public restrooms and a shop. It was a nice place to take pictures as well."], ["Reviewed May 14, 2017", 5.0, "Lovely, pretty area", "Lovely area, very pretty, lovely beach. Great views across bay, Golden Gate Bridge, bay bridge, and Alcatraz island. A peaceful place"], ["Reviewed May 13, 2017", 4.0, "Peaceful", "Really enjoyed our Sunday afternoon walk to the GG Bridge. A bit cold in December, but plenty of people enjoying the sunshine."], ["Reviewed May 11, 2017", 4.0, "Good views", "Good views of Golden Gate Bridge and back to Alcatraz. Popular for fishing. Toilet fav Cilities and a tourist shop with a cafe."], ["Reviewed May 10, 2017", 4.0, "Nice park with great views", "Former airstrip, now a great place to walk or hangout. Good parking facilities and great views. It can be a bit windy."], ["Reviewed May 8, 2017", 5.0, "Saturday morning Parkrun - Best value activity in San Francisco?", "Parkrun is huge in the UK and I was delighted to join the one at Crissy Field. If you don't already know, Parkrun is a free 5k run and everyone, no matter your ability or experience. It starts at 9am every Saturday and is the perfect way to counter your indulgences in the fab restaurants and in town.\n\nIMPORTANT - Although you dont need to book, to participate you need to register on the parkrun website and print a barcode. It will be scanned at the end of your run and your time will be put on the website.\nShow less"], ["Reviewed May 6, 2017", 3.0, "Construction for a better tomorrow makes a poor today", "Every time I visit San Francisco I enjoy walking around Crissy Field - but be aware, as of the end of April, 2017, and it seems continuing through summer (at least), significant construction has removed or re-routed paths; blocked access; temporarily closed restaurants and businesses; and made traffic even more challenging. What has always been a pleasant day was for me at the end of April more of a series of hurdles to overcome. Once the construction is complete I'm certain it will be, again, a wonderful experience; but if you visit now, know what you're getting into.\nShow less"], ["Reviewed May 2, 2017", 5.0, "Great change from city hustle", "If you are into history and seeing something different in SF then take the tour or drive through --- converted military base into nice neighborhood."], ["Reviewed April 28, 2017", 5.0, "Nice open space in the heart of the city.", "We spent a lovely day here. Very enjoyable, there was a farmers market going on while we were here. Many locals and travelers alike, spending time enjoying the sun."], ["Reviewed April 26, 2017", 5.0, "Always a great spot even when freezing cold", "Crissy field is always full of great energy. The view of the Golden Gate Bridge is fantastic. There is lots of convenient parking. The beach is great. Lots of dogs, kite surfers and windsurfers. It is a wonderful place to go between meetings for a time out or to spend an afternoon with a picnic.\nShow less"], ["Reviewed April 26, 2017", 4.0, "By the water,,,", "Beautiful views - lovely walk - Walk as much as you can - it is very relaxing… can be windy ! Make sure you have a jacket of some sort…"], ["Reviewed April 26, 2017", 5.0, "Dog Day Afternoons", "The dog walker's choice! Dogs, dogs, and more dogs. And babies! Moms and nannies come down here on weekdays and runners, families and tourists on the weekends. Bike renters and photographers will not be disappointed with that unobstructed view of the Golden Gate Bridge! Fun, fun, fun. 2 coffee shops, 2 gift shops, electric car charging station, rest rooms, doggy showers, and a hot dog stand, and BBQ pits are all offered here. This area aside from the bird refuge is an off lease dog haven!\nShow less"], ["Reviewed April 24, 2017", 4.0, "Great option for tourists looking for a relaxing walk along the beach.", "A walk along the beach is a great way to see the Golden gate bridge in a very relaxing way. The beach adjoins Crissy field. Crissy field is full of locals enjoying the outdoors. A nice insight into how locals spend their weekend. Just a short walk from here up to the Presidio.\nShow less"], ["Reviewed April 23, 2017", 3.0, "Along the way to the GGB", "We waled to the Bridge and along the way we went throught the Crissy Field section. A lot of it was closed fro re-working and there were no-go regeneration sections along the way. The wildflowers were just starting to come out would no doubt be a beautiful sight. We wouldn't make a \"special\" trip to go and visit this again\nShow less"], ["Reviewed April 23, 2017", 5.0, "Pretty", "We found this park by accident while we were walking from our hotel to the Golden Gate Bridge. It offers some beautiful views of the bridge and has a nice little beach area. We were very glad that we stumbled across it!"], ["Reviewed April 22, 2017", 5.0, "What Great Views", "This was the first time in a long time that I have visited here. And I forgot how beautiful it is. Parking was bit of a challenge. Walking along the trails were majestic. There are great views of the Bay and the Golden Gate Bridge."], ["Reviewed April 19, 2017", 5.0, "Worth the walk", "We walked from the Palace of Fine Arts and the scenery along the way was phenomenal. Great place to spend a few relaxing hours if you have time. Walk along the beach and grab some pictures of the Golden Gate bridge in the background. Take note that the warming hut cafe closes at 5PM.\nShow less"], ["Reviewed April 11, 2017", 4.0, "An unexpected delight", "We stumbled upon Crissy Field on the way to the Golden Gate Bridge and stopped off for a lovely walk along the beach. We watched some jet-ski rescue teams practising, took photos with the bridge in the background."], ["Reviewed April 11, 2017", 5.0, "This is the place to see the goldengate", "The field is a huge open field with the sea at the right side and the goldengate at the end. Dont go to goldengate park because from there you can see the goldengate bridge as close."], ["Reviewed April 11, 2017", 4.0, "What a great walk to the base of the GG Bridge", "We had a great walk and backdrop to take photos from, it was a great couple of hours. We watched some local surfers and they were having a great time out there."], ["Reviewed April 10, 2017", 4.0, "A must for runners/walkers", "This is a beautiful path 3-4 miles along the bay...gorgeous view of the Golden Gate Bridge going west and The City/Alcatraz going East. You can picnic, have coffee or lunch at the Warming Hut (Alice Waters casual limited menu restaurant); visit a fort and just chill. If it's really warm (not often), you can frolic on the sandy beach.\nShow less"], ["Reviewed April 6, 2017", 5.0, "Just One Part of the Presidio", "Crissy Field is in the northern portion of the Presidio of San Francisco. The Presidio is a former U.S. Army military fort on the northern tip of the San Francisco Peninsula, and is now a huge urban park that is part of the Golden Gate National Recreation Area. Crissy Field was the former U.S. Army grass airfield for the Presidio, which today is the most prominent feature you see when you arrive here. However, within the area that is called Crissy Field, you will also find some great areas to explore. If you go to the westernmost part of Crissy Field you will find a picnic area, the Warming Hut cafe, and connector paths and trails to the Golden Gate Bridge and Fort Point.\n\nAlong the northern part of Crissy Field, you have the shoreline, which has been restored, including the creation of sand dunes which provide habitat for several native species.\nThe recently restored tidal wetlands has a boardwalk built across the marsh to provide views of the wildlife.\n\nCrissy Field of is a great place to fly a kite. If you don't have one, you can pick one up at one of the kite stores on Pier 39.\n\nShow less"], ["Reviewed March 29, 2017", 4.0, "Walk, jog, cycle along the footpath", "Great walk from Marina area to Golden Gate bridge and visitor centre. Named after pilot who crash landed here. We walked for about 30 mins, possibly longer admiring the views and people watching. reat views of bridge as you walk along and lovely spot for an elaborate, family picnic and bbq as mmany of the locals can testify. Lovely cafe and restrooms at end before short climb to bridge.\nShow less"], ["Reviewed March 28, 2017", 5.0, "Great", "We parked here and walked to the base of the Golden Gate Bridge. We were there on a 65 degree Thursday afternoon in March and had no problem getting a parking spot here (it's free parking). We walked to the bridge (took maybe an hour), it was a nice leisurely walk, minus me stopping to take photos every five minutes because the bridge is so neat to see and the closer you get the neater it is.\nShow less"], ["Reviewed March 27, 2017", 4.0, "Borrow a dog and go for a walk", "Pick a good weather day, borrow a dog, and go for a nice walk, run, or bicycle ride along this pretty area on the water."], ["Reviewed March 24, 2017", 5.0, "What a way to see the Bay", "Catch the bus route 30 and 28 that drops you to the base of the Golden Gate Bridge after you have taken some fabulous shots walk down to Crissy field and walk the length of it. Down the steps from the bridge is like going through a herb garden, the smells from the vegetation are wonderful. The walk along the field has ducks and ponds, children bikers joggers tourists photo opportunities of Sausalito, bridge Alcatraz and more and the exercise will do you good. It finishes off at a marina which is also lovely. The field was a 1930's airfield stopped in the end by fog!\nShow less"], ["Reviewed March 20, 2017", 4.0, "interesting place to visit..", "enroute to golden gate bridge by foot - but failed! nice little beach, nice weather, good if have the time to just sit to enjoy the breeze and beautiful sky. nice!"], ["Reviewed March 19, 2017", 5.0, "Great Bridge Views", "Great place for a stroll and to view the GGB up close. Recommend the walk up the hill just over the road from the Warming Hut - when at the top of the path turn right and go through the small brick tunnel - takes you right to the bridge (and onto it if you want to)\nShow less"], ["Reviewed March 15, 2017", 5.0, "Great location for a parkrun", "Had a wonderful Saturday morning with some wonderful people. A great and well organised parkrun, the hosts are very welcoming too."], ["Reviewed March 13, 2017", 4.0, "recovered gem", "reclaimed airfield as a wonderful marshland preserve. wonderful on a sunny day and even a nice bracing stroll in rainy foggy weather. they did this one right."], ["Reviewed March 11, 2017", 5.0, "Free & Easy", "Miles of walking and biking territory along the bay. Get your nature on with fabulous views of boats, bridge, sky, birds, the ever-changing tides. Accessible for all ages and seems to be a popular place for canine companions as well."], ["Reviewed March 9, 2017", 5.0, "Great View of the Golden Gate Bridge", "We stopped here to take photos of the Golden Gate Bridge. Fun place for the kids to get out and stretch their legs."], ["Reviewed March 9, 2017", 5.0, "Walk from Fishermens Wharf to GoldenGate Bridge", "Started walking from Jefferson and Hyde Street ,headed west through Fort Mason to the Marina District. On this day it was clear and sunny,there we're loads of people walking, jogging and bike riding.The views of the Bay and GoldenGate bridge we're spectacular.I continued walking from Marina District to Crissy Field. At Crissy Field there were picnic tables we're people were eating. I brought lunch so I stopped and eat.I continued to Torpedo Wharf, which is an old wooden pier that goes out into the Bay.This spot is were you can get amazing pictures of the Golden Gate Bridge and the opposite side of the Bay.I Continued from there to a steep path that made its way to the bridge.This took me about 11/2 hours and approximately 3.5 miles one way, 7miles round trip approx.If you like to walk,this is a very scenic path and well worth the time seeing. Also great photo op.\nShow less"], ["Reviewed March 8, 2017", 2.0, "Nothing to see that you haven't seen before", "Typical day at Crissy. Joggers, bikers, dog walkers, baby strollers, skaters and picnickers. Drive over to Golden Gate Park and you'll have a marvelous time"], ["Reviewed March 1, 2017", 5.0, "Scenic Walk", "If you want to hang out with the locals make sure you check out this location. This is a great place to walk/run to the Golden Gate Bridge, hang out on the beach, walk your dog, picnic, play tag football, ride a bike, watch the wind surfers, take photo's, pick up a cup of coffee at the warming hut or lay in the sun and day dream. No rules, no worries....your the boss!\nShow less"], ["Reviewed February 28, 2017", 4.0, "Do not stand here during a 6+ Richter earthquake.", "During the Loma Prieta quake, I think it was, the Marina District which Crissy Field abuts, turned to quicksand and three story Victorian Flats had their second story windows almost at street level. This is all landfill and it gets \"Mushy\" if the ground shakes too much.\n\nOn the other hand, Crissy Field provides a nice view of the Golden Gate on the left, Sausalito and Marin County behind it, Angel Island and Alcatraz out in the Bay, the East Bay Hills in the distance, the Bay Bridge and San Francisco Waterfront around the corner to the right.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Great place for views and to stroll", "The views of the bridge and bay are terrific from here and the walkway is fantastic. Shout out to the National Park rangers and their rogue twitter account from this area! Y'all rock."], ["Reviewed February 24, 2017", 5.0, "Beautiful and Relaxing Walk", "A group of friends and I had a great time walking through Crissy Field. It was a beautiful, sunny and warm day. Lots of scenic views of the Golden Gate Bridge and lots of photo opportunities. Its worthy of a walk through."], ["Reviewed February 15, 2017", 5.0, "Sunny Day Picnic Spot . . .", "Take your lunch and a soccer ball . . . sprawl out on the grass and enjoy the views and people watching"], ["Reviewed February 13, 2017", 5.0, "Nature-Urban-Bay-History-Do Not Miss", "A blustery January walk from beginning to end, Crissy Field is an urban renewal success story. Crissy Field was transformed from a former military airfield into a series of dog-friendly beaches, salt ponds, nature walks and city and island views. Dress warmly in layers in the chillier months - which is most of the time in San Francisco. There is a snack shack and National Parks souvenir store near the end of the park; don't pass up the opportunity to visit Fort Point at the base of the Golden Gate Bridge.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Playground, Gym, Walkway all in one", "This is truly the happiest place on earth. With awesome views of the Golden Gate Bridge, a sandy, dog friendly beach, great bike and walking path and a nice cafe and book store. Whether you are 5 or 105, you can enjoy the wonderful views and ocean breezes of the San Francisco Bay and a peaceful walk or bike ride.\nShow less"], ["Reviewed February 11, 2017", 5.0, "ThenBest!", "Grab a blanket and a Picknick basket!! It's an all day event!! The child, husband and dog just love it! The beach it absolutely beautiful! You can see a variety of pleople on the beach walking their dogs or playing with their children. Or maybe just relaxing watching the windsurfers and kite flying on the beach and on the water! The bay is always filled with sailboat ⛵️ and fishing boats coming in and out of the bay, along with the cargo tankers that are always fun to watch!! The view of Alcatraz is not bad at all!!\nShow less"], ["Reviewed February 11, 2017", 5.0, "Great relaxing place to walk and just take in the Bay and the Golden Gate Bridge.", "Crissy Field is a park located close to the Golden Gate Bridge. This is a must place to see the bridge, since you are almost directly under it! I would recommend stopping by the Warming Hut for a coffee or a bite to eat. Great place to walk a dog (or even a kid!).\nTake a jacket, it gets a bit windy there!\nShow less"], ["Reviewed February 9, 2017", 5.0, "Beautiful Place for a Morning Walk", "This is a beautiful place to go for a walk in the morning. Beautiful view of the Golden Gate Bridge. Bring a cup of coffee and watch the birds and people walking their dogs. It's really a peaceful place."], ["Reviewed February 1, 2017", 5.0, "Great walk, best view of GG Bridge", "A beautiful way to see SF from the ground.....the bay, the GG bridge, the people. A spectacular walk from the yacht club to Ft. Point. Stop at the Warming Hut to get coffee, rest, relax and journey on."], ["Reviewed January 30, 2017", 5.0, "Gorgeous views--perfect for a sunny day!", "You can walk from Pier 29 all the way to Golden gate bridge-- Crissy field is a long path by the water--lots of bikers, joggers, walkers! Beautiful views of the bay and the Golden gate bridge as well as the amazing homes along the street!"], ["Reviewed January 30, 2017", 5.0, "An exquisite way to see \"San Francisco in motion!\"", "There is nothing like a long walk along the beach toward the magnificent Golden Gate Bridge! It is such a unique view of San Francisco. It's not only the sights -- magnificent -- but also the steady stream of people and dogs of all ages. It was pretty windy yesterday so take a wind breaker no matter what the reported temperature is. You can take a good long walk to Fort Point or just a short one. Either way, THIS will be a great memory of visiting San Francisco.\nShow less"], ["Reviewed January 29, 2017", 5.0, "Gorgeous area with spectacular views", "Crissy Field is one of my favorite parts of San Francisco. It's a great place to spend some time on its own, walking, running, riding a bike, flying a kite, etc. But on top of that, there are spectacular views of the Golden Gate Bridge and the hills up in Marin.\n\nIt's also home to several awesome businesses, including Planet Granite (a climbing gym) or House of Air (a trampoline park), both of which are great places to have some fun and exercise without it feeling like exercise!\nShow less"], ["Reviewed January 23, 2017", 4.0, "Seaside area beneath the GG", "This is a great place to admire the famous Golden Gate bridge, the Bay and City panorama. Plenty of parking around,a lot of greenery and a long beach.\nI suggest to walk all the way to Fort Point and reach the GG right beneath. The views are spectacular.\nShow less"], ["Reviewed January 21, 2017", 5.0, "Take a Walk Here for a Great View", "We walked from Crissy Field all the way to Fort Point. Best view we've had of the Golden Gate Bridge. IT wasn't very crowded-- mostly locals walking their dogs. Great, relaxing walk. Definitely stop here if in San Francisco."], ["Reviewed January 20, 2017", 4.0, "Recreation", "This is a large area of grass, picnic tables, walking paths and boat marina. It has sandy beach and a great view of the Golden Gate Bridge."], ["Reviewed January 19, 2017", 4.0, "Must see when you have spare time", "The camp for soldiers during the war. Not much to see but much history to appreciate. My husband and I never regret to visit this place and probably will recommend to our friends who can stay in SanFo a bit longer."], ["Reviewed January 12, 2017", 3.0, "A place for dogs", "My big takeaway for Crissy is that people LOVE to bring they dogs there and not everyone picks up they poo. Be careful where you walk or sit down."], ["Reviewed January 12, 2017", 5.0, "Super Place", "I truly love CRISSY FIELD! On any day it's a great place to go and enjoy a beautiful peaceful outting in San Francisco!"], ["Reviewed January 12, 2017", 4.0, "Great for flying kites.", "It's just a field with a strip of beach next to it. Good wind for kites. Get a picnic from the Marina Safeway and being your kites and a coat. If you are brave, go for a swim over to the piers. The water is not as cold as you might think. Spot the sandpipers running along and avoiding the incoming tides. Dogs should be banned. A nice day out.\nShow less"], ["Reviewed January 10, 2017", 5.0, "GREAT SPOT!", "a great spot to take a walk or a bike ride or just sit and relax and soak it all up! Great views of the bridge and bay"], ["Reviewed January 8, 2017", 5.0, "Brazil by the Bay!", "Fun beachside with breathtaking views, places to picnic, run, bike, snack. Photo heaven! Great way to see how the locals play and unwind.."], ["Reviewed January 8, 2017", 4.0, "Nice place to take a walk in the heart of the city", "This place gets busy on a weekend and on sunny summer days. Lovely to take a walk along the water with a great view of the GG bridge on one side and the city on the other. Lots of dogs here too which is fun to see and mingle with\nShow less"], ["Reviewed January 5, 2017", 4.0, "Great place to ride bikes!", "Crissy Field was actually a landing strip early the last century. Today it's a Wonderful Urban Park with fantastic views of the Golden Gate Bridge Kama Alcatraz, and San Francisco Bay. Great place to fly a kite too! From here you can ride a bike or walk across the Golden Gate Bridge as well. In good weather it's our favorite place to catch the sunshine...\nShow less"], ["Reviewed January 4, 2017", 5.0, "A Wonderful Walk", "We discovered this walk by accident and will make it a must whenever we are in San Francisco and the weather cooperates. In addition to getting some great exercise, the views are spectacular. You get a nice view of Alcatraz and the City skyline, but the best is the birds eye view of the Golden Gate. The walk seems to be populated mainly by locals walking their dogs and by local families although there are quite a few bike riders as well. I can't wait to do this walk again....and again.\nShow less"], ["Reviewed January 4, 2017", 4.0, "A great walk to enjoy nature and the City!", "I lived in SF for over a year and never ventured here. Well, on a recent vacation I made the journey, walking about 6 miles from Chinatown. It's a really pleasant walk, and the natural tidal pools and nature are a wonderful contrast to the surrounding city views. Of course you can see the Golden Gate in the distance too. A great beach for play, and a great site for picnic or other outdoors play.\n\nConsider this as well as Baker Beach for views of Golden Gate. My preference is Baker Beach.\nShow less"], ["Reviewed January 1, 2017", 5.0, "Iconic Scenery", "Great place for tourists and locals alike. Views of the Golden Gate Bridge and Alcatraz Island. Went walking here most days when we were in San Francisco, stopping off at the Warming Hut for a well deserved coffee."], ["Reviewed December 31, 2016", 4.0, "Good spot for a different view of Golden Gate", "Located on the south side of the bridge this offers a different view of the bridge and Alcatraz. Great for walking along the water and a starting point to walk across the bridge. There is parking and a public restroom. Nice views, we went in the evening and shared some wine on the beach\nShow less"], ["Reviewed December 30, 2016", 5.0, "Take in another view of SF and stroll the water front", "This is an easy destination - no hassle parking, and pet friendly spot to take a break, stroll the waterfront, and take in a fabulous view of SF, GG Bridge, and smell the ocean breezes. N/Charge!!"], ["Reviewed December 29, 2016", 4.0, "Nice Walk towards Bridge", "Nice open area bounded by a beach. Very pleasant walk towards the GG Bridge (if there is no fog!). Good views towards Alcatraz and the Bay Area. Different views of the bridge. Many cyclists use the paths but mostly very polite. Well worth getting away from the traffic for an hour or so.\nShow less"], ["Reviewed December 29, 2016", 3.0, "Pit stop before the bridge", "I was walking to the Golden Gate Bridge following the coastal road and decided to stop and have a few minutes to watch the locals flying kites and the dogs playing."], ["Reviewed December 27, 2016", 4.0, "Nice beach", "We stopped at Crissy Field on our way to Golden Gate. It wasn't crowded so we walked to the beach and put our feet in the water. Nice stop!"], ["Reviewed December 2, 2016", 3.0, "Pass through on bike ride to Golden Gate Bridge", "Chrissy Field was previously an airfield but now a recreation area.\nNot much to write home about apart from the fact you pass through it on your bike ride to Golden Gate Bridge. It's kept very clean and tidy and a lot of people were making the most of it on the pleasant day we biked through.\nShow less"], ["Reviewed November 29, 2016", 4.0, "Great views of the Bridge and Bay", "I like visiting Crissy Field because it is less crowded than the Fisherman's wharf area and you get great views of both the Golden Gate Bridge and Alcatraz Island. I also didn't have any problem finding parking (free) which is nearly impossible in the more touristy areas of the city.\nShow less"], ["Reviewed November 29, 2016", 4.0, "Windy", "Could have love it if not for the chilly wind and water, so bring your cold gears. Another great view of Golden Gate Bridge. Great to see dogs enjoying the weather."], ["Reviewed November 26, 2016", 4.0, "Crissy Field with my sister.", "Such a nice place. Perfect for taking pictures with the Golden Gate as background. You can also walk, and spend some time admiring the view, Both Alcatraz Island and the Golden Gate."], ["Reviewed November 19, 2016", 3.0, "Large green area", "This is another great view the city has to offer. It's in the Presidio so it is serviced by their shuttle. It seemed to be a dogwalker's ideal place. And the dogs loved it too! There was pure joy on their little faces as they ran as fast as they could.\nShow less"], ["Reviewed November 18, 2016", 4.0, "A favorite mid-week escape", "A great area to take a walk by yourself, with friends, or with your four-legged companions. Advice: Always dress in layers when visiting, be aware of your surroundings and potential hazards -- lot's of tourist on bikes!"], ["Reviewed November 18, 2016", 4.0, "Good City Park", "Walked through here to get to the Golden Gate Bridge. It offers great views of the bridge and San Francisco Bay."], ["Reviewed November 14, 2016", 5.0, "pet friendly beach", "the local is very good for walk and pic-nics. For any ages and local quiet to appreciate the view of the Golden Gate bridge."], ["Reviewed November 13, 2016", 5.0, "This is where they used to land Sea Planes", "Had a great Large (100+) Family picnic here. This used to be a sea plane landing area during the war. Now its a great fishing dock and grassy fields for picnics and games."], ["Reviewed November 12, 2016", 5.0, "One of a kind place to hang with friends with", "Are you kidding me? A full and close view of the Golden Gate bridge combined with great San Francisco energy made this place a unique one. When I first visited this place, it was a birthday celebration. Yes, this place has picnic groves and you can use it for free. I love to keep coming to this place in SF.\nShow less"], ["Reviewed November 9, 2016", 5.0, "a superior wetlands retreat", "this is a fabulous walk. flat, easy, not too long. always full of people. it is along the bay, with a large lagoon. usually, good bird watching. always, sailboats."], ["Reviewed November 9, 2016", 4.0, "Take a stroll", "Great on a hot and sunny day, the crashing waves and view of the Golden Gate Bridge are some highlights Not so good when it's a bit colder and rainy! I'd pack a coat on a blue sky - the weather can change quite quickly!"], ["Reviewed November 9, 2016", 3.0, "Nice Retreat in the Busy City", "My wife and I visited Crissy Field while traversing between the Golden Gate Bridge and the Walt Disney Museum. The open park atmoshpere was a nice retreat from the busy city. Lots of people running, biking, walking dogs, relaxing on the grass. The history of the site is very cool too so be sure to take the time to read up on it while visiting. Great place to escape busy city life!\nShow less"], ["Reviewed November 8, 2016", 5.0, "Great place on a sunny day", "Crissy Field is a great location to spend time with your family or friends on a nice day. Huge open area to fly kites, practice yoga, run, bike etc. Many people had their pets (leashed) with them. Cute picnic tables for a quick bite to eat if you pack your own and great view of the Golden Gate Bridge. Even a small beach area if you are brave enough to dip your toes in that cold water!\nShow less"], ["Reviewed November 2, 2016", 4.0, "Great views of the Golden Gate Bridge", "Crissy Field, a former airport, is now a long park, and biking and walking area. A really nice area to bike in, and you go through it if you're taking a bike tour across the Golden Gate Bridge. There are some great views of the bridge here.\nShow less"], ["Reviewed October 29, 2016", 5.0, "Wide Open Space with Amazing Views", "What an amazing open space to hang out on a beautiful day. Great views of the bay and Golden gate; great for sunsets; picnics; walking/running/biking; playing with family and friends. You can't go wrong with a visit to Crissy Field."], ["Reviewed October 29, 2016", 4.0, "Walk along the shore", "Walk by the Golden Gate Bridge or hire a bicycle. Interesting history, take water as no shops nearby."], ["Reviewed October 26, 2016", 5.0, "Great open space near Marina with breathtaking views!", "Want incredible pics of the Golden Gate Bridge and our picturesque Marina? Head to Crissy Field and bring your pup along! Access to beach nearby, sweeping views, and entrance to Presidio. A true SF experience that is FREE."], ["Reviewed October 20, 2016", 5.0, "Great views", "Lovely waterside route for cycling / walking\nGreat views over the bay and the Golden Gate Bridge\nWe cycled out on hired bikes for a bit of calm away from the buzz of SF - well worth it\nSome good bird watching as well if you are into that like my friend\nShow less"], ["Reviewed October 17, 2016", 4.0, "Go fly a kite", "Or just walk, jog, ride a bike. Crissy field is a popular destination for locals. The kite flyers are very interesting. Families enjoy picnics, ball games, people watching and enjoying the views."], ["Reviewed October 17, 2016", 5.0, "Beautiful sunset from Crissy Field Beach", "We had a lovely evening listening to the water and watching the sunset over the Golden Gate Bridge. It was peaceful and a great way to wind down a very busy day."], ["Reviewed October 15, 2016", 5.0, "One of My Favorite Places in SF", "I just love Crissy Field. The views of the Golden Gate Bridge and Alcatraz are great. But my favorite thing is strolling along the beach and watching all the dog walkers and their dogs that chase their balls into the ocean. There was lots of easy parking and we were able to walk over to the Palace of Fine Arts.\nShow less"], ["Reviewed October 12, 2016", 4.0, "LARGE URBAN PARK", "Crissy field is a large area on the bay by the Marina district located within the confines of what was the Presidio. The former military airfield has been repurposed into a haven for those who walk, run or bike. A promenade runs along the bay with fantastic views of the GGB, Alcatraz or the city itself. This area provides great sunsets behind the GGB. This is a great place to come and relax, picnic or people watch.\nShow less"], ["Reviewed October 8, 2016", 5.0, "Great views", "This was the finish of my bridge to bridge race. What a beautiful place to take in. You can also see the spectacular homes in the Marina district."], ["Reviewed October 7, 2016", 4.0, "Urban Beach Stop", "A wonderful way to see San Francisco as a local. Grab a deli lunch and a blanket and enjoy being near the Presidio, having a view of the Golden Gate Bridge and Alcatraz all in one go. You will envy locals for this beach and it makes a great final stop if you have walked all the way around from Union Square.\nShow less"], ["Reviewed October 4, 2016", 4.0, "Good views", "Good views of Alcatraz and the bay. Good place to just come and relax. Just take the day and see the sights of the bay."], ["Reviewed October 4, 2016", 5.0, "Bay Views and Birdwatching", "The restored marshland at Crissy Field is a special place in the Presidio. Beautiful views of the bay and the Golden Bridge, and wonderful to see the positive effects on wildlife produced by the restoration projects. A bird watchers delight-bring your binoculars. Lovely for a stroll for everyone.\nShow less"], ["Reviewed October 1, 2016", 4.0, "ParkRun", "I ran Crissy Field ParkRun and it was a lovely field to run with views of the Golden Gate Bridge / Fort Mason, nice to escape the hustle and bustle of San Fransisco for an hour."], ["Reviewed September 30, 2016", 5.0, "A Breadth of Fresh Air Without All the Crowds", "My wife and I loved Crissy Field. Lot's of people but not the crowds of Pier 39. A great place to have a picnic lunch and gawk (in a nice way) at the beautiful Golden Gate Bridge!"], ["Reviewed September 29, 2016", 4.0, "Jog, run or walk? This is your escape from busy SF", "Within walking distance of downtown SF, this place is a great escape from the crossings, traffic lights, hilly streets and slightly crammed atmosphere of downtown SF. Here you are free to walk or even jog or run, and \"stretch your eyes\" - Enjoying the view of the bay and the skyline.\nShow less"], ["Reviewed September 29, 2016", 5.0, "Amazing place to catch a San Francisco sunset", "We didn't have a lot of time in San Francisco but as an East Coaster, I was intent on watching the sunset on the West Coast. California sunsets NEVER disappoint-- this time it was San Francisco Bay and the Golden Gate Bridge for the backdrop...amazing!"], ["Reviewed September 29, 2016", 5.0, "Good history", "You will love the Field, park area and the history of this place. What a view of the surroundings, the bay, the city, Alcatraz, and the Golden Gate Bridge"], ["Reviewed September 28, 2016", 5.0, "Walk from Fort Point through Crissy Field to Fort Mason Centre", "I walked it but lots of people also bike this route along the San Francisco trail. It became my favourite part of San Francisco. Having walked the bridge, I descended to Fort Point, stopped off at the Warming Hut for refreshments and walked through Crissy Field, stopping on the beach for a while and then continued on to the Fort Mason Centre. It's a long walk but you make it a more leisurely stroll with with stops at the Warming Hut and on the beach.\nShow less"], ["Reviewed September 27, 2016", 5.0, "A little but if everything San Francisco", "Crissy Field offers a taste of everything San Francisco represents from sitting by the dock on the Bay to outdoor volleyball to waterfront homes to wildlife conservancy to the beach. The grassy fields can be used for numerous activities. The history of the area can be explored at the Golden Gate Bridge at one end while the locals frolic at the beach on those rare but exceptional hot days. The views are simply marvelous. You can walk, run or just sit along the trails. It can be romantic or family friendly or a solitary escape. Just enjoy!\nShow less"], ["Reviewed September 21, 2016", 5.0, "Walk to the Bridge", "We walked from Fisherman's Wharf to the base of the Golden Gate Bridge. Beautiful views along the Marina and Crissy Field. Its quite long (3-4 miles) but its an excellent way to see San Francisco."], ["Reviewed September 18, 2016", 5.0, "lovely place to people watch", "kites abound, and really amazing ones too...bring family and dogs and dont forget the picnic as well."], ["Reviewed September 17, 2016", 4.0, "By d beach", "The view is nice here and some people do play with the water but look cold. If you want to enjoy the view of the bay, this is a nice place not to be missed."], ["Reviewed September 13, 2016", 5.0, "Combined with Golden Gate Bridge and Fort Point", "Since you are going to visit the Bridge, come here after Fort Pint to complete your experience. Quiet, but windy / hot depending on the weather. You would not feel that you are in a tourist attraction yet you could enjoy beautiful view. Be mindful though, you need to walk at least a mile in order to reach the nearest Muni bus stop.\nShow less"], ["Reviewed September 13, 2016", 5.0, "Relaxing....", "If you want to enjoy the view of the bay, this is a nice place to do it. You can take a leisurely stroll here along the water while some people are fishing or go around the warehouses that were turned into specialized gyms and sports places. This place is not crowded unlike the other tourist areas in the bay area.\nShow less"], ["Reviewed September 12, 2016", 4.0, "Popular Picnic and Gathering Place", "This Public Park literally at the entrance to the Golden Gate Bridge was a perfect gathering spot for friends and relatives who traveled to San Francisco for a family wedding. The morning fog, view of the bridge, Alcatraz, and the sea, all created a nostalgic and sentimental backdrop for everyone, who came from nearby towns and cities, or from distant States far away. The Park is maintained in a natural state, and while it is grassy and features needed facilities like trash, recycle bins, and restrooms, one still has the feeling of nature, not over-development, in this lovely setting for a picnic, dog walk, frisbee toss, or kite flying. Memorable!\nShow less"], ["Reviewed September 9, 2016", 5.0, "Best bit of SF", "Love walking from the golden gate bridge along the coast and around Crissy field. The views are incredible. Very romantic. One of my favourite places on the planet."], ["Reviewed September 9, 2016", 4.0, "Wonderful views, a lovely place for a day out", "With a lovely clean beach, various walk ways and green spaces as well as interesting bird watching and great views of the Golden Gate Bridge, Alcatraz and, in places, San Francisco, Crissy Field is a unique place to have a stroll and while away a nice day. It's also a great place to catch a sunset framed by the Golden Gate Bridge. Yet another lovely outdoors space around SF!\nShow less"], ["Reviewed September 7, 2016", 5.0, "Great views, with parking!", "Great spot for taking pictures of the Golden Gate Bridge. The closer you get to the bridge, the more interesting it gets. Take the trail up the hillside to the bridge itself for an ever-improving vantage point. Just when you think you've taken the perfect picture, you climb a little higher or round the next bend for an even more breathtaking view. Highly recommended spot to spend a couple hours.\nShow less"], ["Reviewed September 7, 2016", 3.0, "Walking the Bridge Area", "Walking Crissy field was so awesome. Their was gyms to work out, guys and girls on bicycles, and people just hanging out. It was good exercise as well."], ["Reviewed September 6, 2016", 4.0, "Good place to enjoy day out", "This place was along the way to the Bay bridge, so you would not miss it. Nothing much at the fields. Its a very nice place though to just relax and chill."], ["Reviewed September 3, 2016", 5.0, "Field for Fun", "San Francisco has many pockets of nature to enjoy. Do not miss a visit to Crissy Fields. The parking is free and the area is flat so you can see panoramic views of the Pacific Ocean and the Golden Gate Bridge. You can grab a bite at the little cafe or bring a picnic basket for lunch. Many rent bicycles for a great family outing. I highly recommend visiting Crissy Fields.\nShow less"], ["Reviewed August 31, 2016", 4.0, "Bernie Sanders Rally at Crissy Field", "My friend and I were very excited to be part of the crowd attending the Bernie Sanders Rally. It was a beautiful but brisk day. It was so much fun to watch all of the \"characters\" who turned out dressed in outrageous costumes!"], ["Reviewed August 30, 2016", 5.0, "Great Place to walk", "A great place to walk with superb views across the bay including Alcatraz and the Golden Gate Bridge. It is flat and wheelchair accessible. There are picnic tables and the Warming Hut is a welcome break especially when the wind is blowing as it can feel like you have been sandblasted. Despite this it is a great place and i would recommend a bracing walk.\nShow less"], ["Reviewed August 28, 2016", 4.0, "Open space to stroll and enjoy great views", "Plenty of space to stroll or cycle through with plenty of locals and tourists enjoying a relaxed atmosphere. Great views of the bay , the bridge and Alcatraz . You can just sit back and watch the world go by."], ["Reviewed August 28, 2016", 5.0, "Park Run - Saturday 5 km.", "Park Run well worth your time 👍 Saturday morning. We were made to feel welcome and part of the running mob from the moment we arrived. Big thank you for the organisers and volunteers at the event."], ["Reviewed August 24, 2016", 5.0, "Nice views of the bay, good paths for hiking", "You can walk right along from the St Francis Yacht Club to the Golden Gate Bridge. Great place to watch yacht races, fly a kite, take a walk. Can be cold most days. Bring at least a wind breaker and a scarf and hat."], ["Reviewed August 23, 2016", 5.0, "Very relaxing", "Went to Chrissy Field during our visit to San Francisco this month. It is the perfect place to people watch. You can see Alcatraz and the Golden Gate Bridge while sitting on a nice bench."], ["Reviewed August 23, 2016", 5.0, "great for jogging or a picnic with the family, nice views but bring your jacket", "There's a crossfit workout zone here that has great ways to get a good sweat on. Nice area to ride around on the bike or go for a jog... Nice views of the golden gate bridge and lot's of restaurants nearby as well... Great area for the dog too.\nShow less"], ["Reviewed August 23, 2016", 5.0, "Crissy Field is a San Francisco Treasure!", "Crissy Field has many faces depending on the weather, the time of day, any special events or not. We have lived nearby for 34 years and have watch the Presidio evolve from a military facility with an airstrip where Crissy Field is today, hence the name.\n\nThanks to seed monies from the generous Haas family, Crissy Field was restored to natural beauty we all enjoy today. Great beaches, amazing views, options for long walks, a quick peek, shop for unique San Francisco only items or coffee and a nosh at the \"Warming Hut\" between Fort Point and Crissy Field.\n\nThere is always something new to see. Water sports, little children enjoying the sand, nautical traffic on the Bay, and dogs and their masters playing ball or just chillin'.\n\nCurrent projects in the Presidio can make access to Crissy Field. It is best to enter from Marina Blvd. Westbound bearing right onto Mason St. Then carefully (busy bike and jogging path) turn right into the East Beach parking lot (currently free). You could spend a few minutes or a few days (no overnight allowed). There are restrooms and a cafe at East Beach and adjacent to the Warming hut. Enjoy! Pack a picnic basket, go for a walk, ride or watch the hours unfold.\nShow less"], ["Reviewed August 20, 2016", 4.0, "Great spot for views! No shade though!!", "Beautiful spot for views of the Bay. Awesome for picnics. Bring an umbrella or hat for the sun. Nice to stroll close to the Golden Gate bridge nearby!"]]}}