{"Crystal Cove State Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Crystal Cove State Park", "url": "/Attraction_Review-g32588-d219510-Reviews-Crystal_Cove_State_Park-Laguna_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/62/a0/09/crystal-cove-state-park.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1036"}, "address": {"@type": "PostalAddress", "streetAddress": "8471 Pacific Coast Highway", "addressLocality": "Laguna Beach", "addressRegion": "California", "postalCode": "92651", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Favorite Hidden Gem in California", "I try to go to Crystal Cove once a year and spend a week. There is something so relaxing and healing about walking the trails above the open and then walking or running the beach. One the the few preserved areas where you can see what the coast used to look like before all of the water heavy decorative plants were brought in. It is a beautiful desert oasis and the history of cabins built there is fascinating. Please take the time to read the wonderful information cards on the \"main\" cabins and go through the Visitor Center area. Loved the little gift shop, too and don't miss the Beachcomber Mexican restaurant! The Beignets are mouthwatering treats!\nShow less"], ["Reviewed 4 days ago", 4.0, "A nice place for a hike", "We wandered into Crystal Cove State Park around 9:30 Sunday morning in February. Parking lots were filling up fast and the trails were loaded with hikers and bikers enjoying the sunny winter So. Cal weather. There are lots of nice trails to choose from, with lots of nice views to the ocean.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Lovely", "A big change from nearby Laguna, Newport and Huntington. Very relaxing and free WiFi! Good facilities and lovely and clean."], ["Reviewed 2 weeks ago", 5.0, "Great walking beach with interesting history", "Enjoyed walking this beach while waiting for our table at the Beachcomber Cafe. Interesting history surrounding Crystal Cove dating back to the early 1900's ... read about it at the small building next to the cafe. Beaches cottages are being restored and are available for rent.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Christmas vacation", "The park is a short walk from the hotel and very pleasant.There are plenty of restaurants within walking distance although it does get a bit crowded in the summertime and parking is always an issue."], ["Reviewed 3 weeks ago", 5.0, "Breathtaking", "Love the history here and enjoyed walking through nature. Saw some whales from the shore. Great place for photographers."], ["Reviewed 4 weeks ago", 5.0, "Favorite!", "My favorite beach in So Cal! $15 to pay for parking at the entrance gate. Great beach to take a long walk! Peaceful, no dogs allowed. Plan on spending the entire day, it is heaven."], ["Reviewed January 23, 2018", 5.0, "A CA Secret", "Thousands of people drive by here daily and have never taken the time to stop by! It takes a bit of work, but well worth figuring out the parking and paths. But please don’t share with too many people."], ["Reviewed January 22, 2018", 5.0, "Find the Peace Here", "What a wonderful day. Go early and walk as much as you can. And keep your eyes open for the visitors who may appear near the shore. We were blessed to have two seals come close and play for a short time. It was nice to get away from the crowded Laguna shops.\nShow less"], ["Reviewed January 22, 2018", 4.0, "There is something about the Pacific Ocean on the California coast line.", "This park has parking options and runs right along with Oceanside. Great paths, open and airy all along the shore. There are even some bathrooms available along the way. Clean and beautiful views. And there is just something about the air and temperature that makes it perfect.\nShow less"], ["Reviewed January 22, 2018", 4.0, "A popular place for locals and their guests", "Service was very good and food very tasty. Will be back soon.\n\nOnly issue is confusion about % of individuals requesting reservations. A person on the phone said only 30% get reservations; a person on-site indicated that was not the case and that you need to be there, wait, and then secure a table 10 minutes to an hour or so later.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great Hiking near Moro Campground", "We were looking for a hike right near Newport Beach and found the Crystal Cove State Park. We did the Moderate Loop Trail (and added in a little bit to make it longer) but it was hilly, beautiful and a fun time. There were a bunch of challenging hills but our party of 7 with age ranges of 5 - 60 was able to do it and enjoy it fully. You can find all the hike information on the website and get directions by looking for the \"Moro Campground Entrance/Kiosk\" (given that there are a number of entrances along the coast). Strong recommend on a beautiful day for a good workout and great views.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Day trip, short walk, sharing an oceanside meal or camping!!", "Crystal cove has so much to offer. Great for a day at the beach, a leisurely beach walk, a few restaurant choices and a beautiful hillside campground."], ["Reviewed January 12, 2018", 5.0, "Beautiful Beachfront Ghost Town", "Crystal Cove State Park is several parks in one. Located along PCH south of Newport Beach and Costa Mesa along the shore you'll run into the park's many entrances. The four parking lots are in chaparral with numerous walkways and hiking paths among the cacti, sage and tumbleweeds. Most of the paths head towards various sections of the beach cliffs, with several picturesque spots along the way. If you make your way down to the beach like we did, there's a section of nice swimming and surfing beach area, a tide pool section to climb and search for wildlife in the pools, a popular underwater diving spot and if you walk a little further, a small little beach front ghost town.\n\nSomewhere between 20-30 houses along the beach and halfway down the cliffs have been condemned and are now part of the state park. Each looks to be derelict and in various states of decay and are protected from humans by chain link fence. Only the top row of homes at the tops of the cliffs are preserved and appear to be rent-able through the park. The architecture was clearly done for most of the homes in the late 1940's to 1960's era surf town.\n\nThere are a few shops and stores, a visitors center, bathrooms, two restaurants and a bar on site. We managed to grab some margaritas and cold water from the bar as we rested, preparing for the return hike up the sandstone cliffs to our car later that afternoon.\n\nIt's a really cool place to check out. I don't recommend the sandy trails for strollers but there is easier access to the cove via steps. Families with older children five and up won't have any problems. It's a real hidden gem that shows you what life was like for a beach boys beach town 70 years ago.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Great time to enjoy the ocean", "With grand children we went to the beach A nice day at the beach. We went in the water and enjoyed the sand. A clean beach great waves and just a nice time. A short walk from across the highway under the road to the beach\nShow less"], ["Reviewed January 5, 2018", 5.0, "Quick visit!", "Lovely little beach, uncrowded and clean. There is a lifeguard stand, but don't imagine there are lots of people here, even in the summer, which is great!"], ["Reviewed January 3, 2018", 5.0, "Unsurpassed Beauty", "This is one of the best beaches to stroll in Orange County. The beach is about 3 miles wide and has a restaurant right on the sand near the middle. Enjoy the rehabilitated beach cottages that bring back the good ole day when things were less complicated. Unfortunately, there is a steep price to park - I think $20.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Moro Campground!", "When at Crystal Cove State Park stay at Moro Campground. Every unit is surrounded by shrubs and has sea view. The whole place is well kept and looked after. In the morning we would see and hear a whole lot of birds and in the evening the rabbits were passing by our camper van. Given that it is so close to L.A. the peacefulness is incredible. We did not try any of the trails but made trips to Crystal Cove and Beachcomber's Cafe. Both were worth the trip. You should also drive to Laguna Beach which is basically right behind the hill.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Nice walk", "Had a lovely walk at crystal cove. Laguna beach is clean and serene. Not much wildlife on the tide pool but we got some nice pictures of the view. Walked to the end and reached the famous Beachcomber Restaurant. Wasted opportunity to eat here without a wait, but my family was not hungry.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Always a highlight!", "I never miss an opportunity to go to Crystal Cove when I am in Orange County. This unspoiled strip of coastline and its cottages are a blast from the past! There are many manageable hiking trails that are beautiful, but the main draws for me are the Bootlegger Bar, and Beachcomer restaurant. Excellent food and drinks in this idylic throwback community from the golden age of coastal California living. This place is virtually untouched since the mid 20th century. Nostalgia eminates from its core! I highly recommend a visit.\nShow less"], ["Reviewed December 21, 2017", 5.0, "A Beautiful Beach Called Laguna...", "It's beauty is just ....magical You'll get mezmerized by its sunsets.... (so much that you won't want to leave until the sunset is completly gone, just take into consideration that when it gets dark, it is a little difficult to find your way back up)."], ["Reviewed December 14, 2017", 5.0, "California Dreaming!", "Laguna has an amazing coastline. We had a magical walk on the beach at sunset. Very quiet. Very beautiful."], ["Reviewed December 14, 2017", 5.0, "Amazing beach views", "Crystal Cove State park draws folks from dawn till dusk. It is a beautiful stretch of Nature you will want to spend hours walking, resting and hiking."], ["Reviewed December 6, 2017", 5.0, "Great Escape w/o leaving the City", "Crystal Cove is an amazing way to get away without leaving far from home if you are in the OC. I love the long stretches of sand to walk, the gentle waves and the great sand. Extremely quiet with no city noises and great views."], ["Reviewed November 28, 2017", 5.0, "Beautiful place to walk", "Love this place, never tire of it. The walks, views, places to sit, beach. Bring your dog or bike, stunning scenery."], ["Reviewed November 22, 2017", 5.0, "Great Scenery!", "On 10/12 walked down to Crystal Cove from the Marriott Newport Coast Villas. The scenery is beautiful! Beach, ocean, hills, etc. Walked along the beach and saw the bungalows - some of which have been rehabbed - others are in the process. If you want a \"rustic\" place to stay you probably couldn't beat the bungalows. The historical display of the area was very interesting. Beachcomber restaurant was too busy to wait to get in. If you are driving you have to pay to park.\nShow less"], ["Reviewed November 22, 2017", 5.0, "Wonderful beach!", "A quaint little beach off the southern coast of California, it's a great place to go for a walk especially during sunsets. I highly recommend it especially on a date. Make sure to bring a jacket or shawl if your planning on watching the sunset as it can get cold quit quickly once the sun goes down.\nShow less"], ["Reviewed November 18, 2017", 4.0, "Easy Hiking Trails", "I went here specifically to go hiking and found an easy 4 mile trail that was described as \"difficult.\" It was almost all on fire roads, with just a short stretch that might be described as single track, but even that was pretty wide. The trail did lead to the top of Moro Ridge and offered a spectacular view of the ocean and Catalina Island. There is a 3-mile trail described as \"easy\" and an 11 mile loop described as strenuous. There is a $15 entry fee, paved parking, and restrooms. There is a small visitor center describing the flora and fauna of the park. Watch out for rattlers!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Cliffs overlook clean sand and islands of rocks, block sounds of PCH", "You can take a walk or jog on the beach along the edge of the Pacific Ocean, great restaurant, cottages to rent, best of all is a cliff that allows the sounds of waves to be heard (blocks PCH car noise). Join people near restaurant to hear tribute played at sundown. Parking is easy with shuttle bus. Bring a beach umbrella, spend some time.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Breath-Taking Views So STOP!", "We were drawn by the movie location but stayed for the gorgeous surf. Walking under PCH was fun and safe, as was the entire state park. Very clean and well maintained. Wandering past the restored vintage beach cottages was a plus and a step back in time. Well worth the stop and the walk!\nShow less"], ["Reviewed November 12, 2017", 4.0, "Worth a stop", "It’s right on the coast highway and it’s a beautiful stop along a drive either north or south. It can be crowded in the summer but a fall beach walk is well worth it."], ["Reviewed November 12, 2017", 4.0, "Beautiful beach", "I didn't get to spend a lot of time here. But I enjoyed walking along the beautiful beach with little rock pools. The bungalows are also interesting. One tip: Eat at the Beachcomber and get a voucer for the $15 fee to park at the state park. I wish I had more time to do a hike in the area.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Fantastic Glamping in State run cottages", "It's a great place to to soak up the sun and enjoy the beach. The hard part is reserving one. Keep trying and you will eventually get it. All of the cottages have their own unique style. We stayed in #27. It has a phenomenal view and deck over looking the beach and a cool scuba dive themed interior. Be warned the beds are terribly uncomfortable and I highly suggest bringing a inflatable mattress to put on top of their mattress. Besides that enjoy the views and make sure to try the beignets for breakfast at the beachcomber.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Sun, sand and surf and a couple of great visits", "Our first visit, during the late October heat wave, saw us park up behind the beach. We walked down the long winding path to the sand below, admiring the surf as we went.\nThe whole beach was clean, tidy and inviting from the start.\nOnce on the sand, we swam and enjoyed the surf, despite its powerful undertow. The beach was quiet, not deserted but very quiet and very relaxing and enjoyable in the 95F / 38C sun. Lots of seabirds also enjoyed the beach, adding interest. Toward the southern end of the beach, low-lying rocks and rock pools provide an opportunity for more advanced beachcombing, with wildlife varying from tiny fish to sea anenomes land more beside. But the rocks can be deceptively slippery, particularly when wet.\nOverall, a couple of great afternoons that we'll remember for many years.\nGo for it and find your own memories. And the little beachside bar and restaurant may help you do that.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Coastal Camping You Won’t Regret", "Crystal Cove/El Moro campground is fantastic! The views are awesome. The campground is clean and the hiking is perfect.\nEach campsite is very big with space in front of your rig (or whatever) for chairs and blankets. The sites are tiered to allow a coastal view for all campers. RVs are kept to a few top loops of the campground and soft camping with tents and pop ups are on their own lower loops. Trails around the campground are well taken care of and the area is clean (including the bathrooms)! Hiking is conveniently located behind the campground in the canyon and the trails are well maintained. The trails are challenging but not ridiculous, offering nice views and a deceptively peaceful getaway even though civilization is very close. Mountain biking is allowed, but no dogs on trails. I know there is wildlife, but I’ve only seen birds and a mouse on the trail. In hot summer I can imagine the snakes as stated on the signage near the trails.\nAccess to the beach is also effortless - just a short walk down to the day use parking lot and a cross through the tunnel. A Beautiful beach awaits. So quiet during the week. Campgrounds have to be reserved far in advance.\nIf you can get a reservation, I recommend this campground. It’s worth the price (which is a bit expensive).\nShow less"], ["Reviewed October 26, 2017", 5.0, "Beautiful!!!!", "You have to pay to park in the park but walk in is free and easy. A gorgeous park and on the ocean. There are rental properties available along the ocean as well as an amazing ocean-side restaurant."], ["Reviewed October 25, 2017", 5.0, "Family visit", "A must visit if you’re in the area very nice beach and facilities and watch the sun go down on the beach excellent."], ["Reviewed October 24, 2017", 3.0, "Exspensive", "Went for a day trip . The state park charges you 15.00 for the day . One can ride a shuttle bus down to the beach for 1.50 one way . We decided to stay for the sunset and when we went to check out with our ticket of entry they charged us another 5.00 ... so 20 bucks to park a vehicle - There was no time limit posted when we checked in to park and it said nothing on the ticket about hours other than the park closes at 10pm - needless to say we won’t be back and Crystal cove beach is pretty but the old buildings need to come down it’s a eye sore !!\nA bit run down there is a beachcomber resort there that is high end they are trying to leave it like it was back in the 50’s and 60’s\nIt’s a bit scary I would not stay there .\nShow less"], ["Reviewed October 22, 2017", 5.0, "My favorite place", "Wonderful place and must see if you color to Orange County! My favorite place in the world!! You cannot miss it!!!"], ["Reviewed October 21, 2017", 5.0, "Beautiful area!", "We only had a short time to visit here but it was absolutely beautiful! There was a really nice area off to the side where some people were doing crafts with kids. Our kids were even offered to join them! The people were so friendly! Well worth the stop! Beaches were clean and historic houses are being renovated. Several picnic tables if you want to pack a lunch. If not, go to the Shake Shack at the top of the cliff!\nShow less"], ["Reviewed October 13, 2017", 5.0, "Lovely Wild Beach and Sunsets", "Crystal Cove is a state park. It closes an hour after sunset. Don't be caught and get a ticket. You can take a significant walk to the Beachcomber restaurant from there. Or just enjoy the sunset from one of the outcropping vistas or down at the beach. Some surfing. Lots of rocks and sand. Dogs allowed everywhere but the beach. Walking trails above the beach.\nShow less"], ["Reviewed October 12, 2017", 3.0, "Not that accessible and Over Commercial", "We were driving up the Coast Highway specifically to stop at Crystal Cove State park to stretch our legs and enjoy the Ocean. Compared to other S. Californian beaches it was all a bit of a let down and over-hyped."], ["Reviewed October 7, 2017", 5.0, "Nice beach for the kids", "Visiting from Texas and this beach had a good score on the beach score card we found online. There had been a slight rain a couple of days before and we were concerned about water quality. The park rangers assured us that the water was safe and my younger kids had a lot of fun playing in the light surf. The tidal pools were a plus, as they were able to explore and identify some of the sea life present in the water once the tide went out. We went in the afternoon so that we could stay to see the pools that remained. Watch out for some large rocks that appear under the waves as the tide goes out, once we started seeing these I made my kids stop riding the waves in case they were to fall on an exposed rock that they could not see underneath.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Beatiful Beach", "We enjoyed walking on the beach while waiting to get in to The Beachcomber Restaurant located right on the beach. It was a beautiful day and not crowded. The surf was up and the sky was blue."], ["Reviewed October 3, 2017", 5.0, "El Moro Canyon hike & Crystal Cove State Park Beach", "First time visitor. I understand the high recommendation and rating this park and hike get. If you hike this trail, it is a steep uphill, but when you get to the top and turn toward the Pacific Coast, your jaw will drop at the sight that's in front of you. I did the trail starting from the Ranger Station in the park. It's about 5 miles total. It's rated Difficult. The trail is wide and dusty, like a dirt road. Maybe not too much scenery but you have to remember you're in OC. and that's enough for me. Then, it's a steep uphill, and you start coming back down all the while facing the coast and the Pacific. That was stunning for me. Then, once back at the bottom, take the tunnel to the beach. Beautiful.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Beach visit", "Beach was ok a lot of sea weed along the shore the day we went. Nice restaurant and tiki bar. Lots of history there."], ["Reviewed October 3, 2017", 5.0, "Morning Hike", "This was my first time to hike Crystal Cove. The mountain trails were wide for the most part. The inclines varied from mild to fairly steep. The surroundings were just so unbelievably beautiful, from the vistas of the ocean and coastline to those of the mountains. The trails were well marked with maps showing the many trail options along with mile markers. I can't wait to walk Crystal Cove again.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Gorgeous Beach", "Very quiet and beautiful stretch of beach between Corona Del Mar and Laguna Beach. Good for romantic beach walks, work out runs, sun bathing without big crowds . Several beautiful coves."], ["Reviewed September 25, 2017", 5.0, "Fantastic Day at Crystal Cove - El Morro Canyon", "We spent the day at Crystal Cove State Park and had a great time. We arrived early in the morning and hiked El Morro Canyon. We took the 5 mile hike that was advertised as difficult. I didn't think it was too bad until we got to the East Pass and started walking up hill. I'm not sure it was exactly difficult but it was a pretty steep hill that I thought was never going to end. We walked across the El Morro Ridge and the views were spectacular. After a quick lunch at the Shake Shack right down the street we headed out to the Crystal Cove Beach. So beautiful out there. It was a week day and it felt like we had the beach to ourselves. i took another 2 or 3 mile walk down the beach and it goes forever with the cliffs on one side and the water on the other. Can't wait to go back. Maybe I'll do the longer hike at El Morro next time. For $15 a car for the day it's a bargain.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Sand, beach, rocks, tide pools and sunny SoCal ... whats not to like", "I love this place because its less crowded that other public beaches in the area or in LA county, their is an admission fee of $15 per car which might be the reason.\n\nClean beach, very nice tide pools, you can see wild life all the time, their is a cove on the northern side of the beach, many open sandy areas and many rocky areas, so you get the best of both. the beach is located on a short hike down the cliffs which is an attraction by it self, many observation areas on the cliffs top, bring binoculars because you could see dolphins and whales passing by the area.\n\nThe only thing I do not like about this area is that the bathrooms are located far from the beach, its located by the parking structures which is on the cliffs, so you gotta walk up (10-15 minutes) to get to the bathroom\nShow less"], ["Reviewed September 19, 2017", 5.0, "Gorgeous Rocky Beach with Tide pools", "Crystal Cove State Park is a gorgeous must-see in Laguna Beach. Located minutes down the highway from Newport Beach, it's a respite from crowds. The shore is gorgeous and rocky with excellent surf. Families will enjoy Morro Beach, which is less rocky, located down from historic cottages. There are a couple of beach stands and restaurants, and the restrooms are impeccably clean. No outdoor showers are available due to California's drought conditions. The tide pools are fascinating. This park is a great place to hike, wade, and swim, but the tide might be too challenging for smaller children due to its rocky shores. Still, it's a beautiful and peaceful place to visit.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Hidden Gem worth finding!", "Visiting Crystal Cove is like stepping back in time.....to the 1920's. With a secluded beach, restored bungalows and dining close by it's a great place to relax and spend the day."], ["Reviewed September 6, 2017", 5.0, "This is our go to beach spot!", "We lived in the Bay Area for 5+ years and could not stand how the beaches took 45 min to an hour to get to and the beaches were always freezing!\n\nNow that we've moved back down to Southern California to Orange County we live 15 minutes away from here and invested in the \"CALIFORNIA EXPLORER VEHICLE DAY USE ANNUAL PASS\" - $195.00 for the year. Otherwise every visit to this beach would cost $15 parking and it is not an easy beach to get to without paying for the parking. The perks about this beach is that it does not get THAT crowded further away from the Beachcomber restaurant. I feel the reason why people cluster there can be due to the fact that there is one restroom there. All the other restrooms are on the trails away from the beach. Also, do checkout Beachcomber, the drinks are pricy but worth it, cause they are huge and well liquored.\n\nOn certain mornings you can see pods of dolphins swimming nearby. Bring binoculars to get a better view but you can see them just standing at the sands of the beach. We've seen them twice this summer.\n\nIt's a different beach experience than Santa Monica, Huntington or Laguna because it is much less packed and isn't surrounded by shopping and restaurants.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Historic beach park", "Great spot for hanging at the beach. It has historic cottages for rent right on the sand, a nice restaurant (The Beachcomber) and outdoor bar. There's also a great burger joint at the top of the hill, The Shake Shack."], ["Reviewed August 30, 2017", 5.0, "Just beautiful", "What a hidden gem. Beautiful beach, lovely walks, homes & a great restaurant to enjoy good food. Have visited many times of the year & xmas was the most memorable with a xmas tree planted on the beach."], ["Reviewed August 23, 2017", 5.0, "Beautiful beach", "The beach is very clean and quiet and has a spectacular view of the Pacific Ocean. There are some interesting rock formations. The terrain is beautiful and a great place to unwind and relax."], ["Reviewed August 23, 2017", 5.0, "Great place to spend the day!", "What a great place to hang out for the day. A very quick, short drive from Laguna Beach, we found everything we needed... very convenient parking, shuttle to the beach, lovely restaurant, chair and umbrella rentals, quiet peaceful beach time, gorgeous waterfront. I would recommend this park for anyone visiting Southern California.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Very pretty area!", "We friends walked down the beach & saw beautiful tide pools & rock formations! Once we walked past the very numerous big umbrellas staked into the sand, the beach was very beautiful."], ["Reviewed August 19, 2017", 5.0, "Crystal Cove is Spectacular", "We enjoyed eight days exploring the greater LA area and a few hours at Crystal Cove State Park was a highlight! On our next visit (from the east coast), we plan to spend much more time at the beautiful locations."], ["Reviewed August 14, 2017", 4.0, "Tidal pools and pounding surf", "We chose Crystal Cove State Park for a beach day, showing up early in the morning at low tide, and clambered down the cliff to the tidal pools, which were full of colorful crabs and minnows. At a larger pool, some lads had captured two sea slugs, and spotted an octopus just as it camouflaged, as well as a baby tiger shark. An interesting morning for sure. After lunch we went further down the cove to a beach area that was not quite as rocky. The surf seemed to be rather high so we checked with a life guard to see what her recommendation was for people who would like to do some body surfing but who were not familiar with ocean swimming. Apparently there had been a hurricane off shore, and the swells were bigger than usual, so she recommended that we go to the pool for the remainder of the week we were in California. If we did go in not to go deeper than thigh-deep. So we sat down to watch the ocean for a few hours. It was bringing in chunks of concrete and asphalt that were bigger than my head and a cement block one time. Glad I did not venture into that. We waded knee deep and got wet feeling the sea suck the sand out from beneath our feet. But the day was lovely, and the sea air refreshing. And with all things having to do with nature, one has to have respect for forces that are more powerful than we are. All in all, it was a great day.\nShow less"], ["Reviewed August 11, 2017", 5.0, "A hidden gem!", "This is a very nice beach which is not so crowded. It is also safe for kids to play near the sea. We went there twice, and had much fun. The slope to the beach is a bit steep to walk, but perhaps that is the reason why it is less crowded. We prefer to go in the sunset.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Tuesday Morning Swim", "Visiting from NYC we found this beach to be quite nice,not too crowded by 10am. The surf was at high tide and the waves were a little rough. But the water was cool and clear. Got to see a lone sea lion swimming by which was a highlight.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Good Beach pleanty of room", "The walk from the parking to the beach is not too far, even after 7 hours in the sun. The beach was clean and not overly crowded. Well worth the visit.\n\nWatch out for the toll road on the way down - Google did not warn\nShow less"], ["Reviewed August 7, 2017", 5.0, "Great Outdoor Activities", "This is a spectacular park for walking/hiking/swimming. I walked with a friend for the entire stretch and the views of the ocean are incredible. Park at the southern most terminus and walk it up. Then we stopped for lunch midway at rubys. It was a true treat. We can't wait to come back when we are back in the area.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Fun in the Sun", "Enjoyed the day at Crystal Cove. Dropped the gang off near the beach and then parked car across street. This was great so we didn't have to lug our beach necessities so far. Not too busy. Kids liked it."], ["Reviewed August 2, 2017", 1.0, "Fillthy tunnel to cross the beach!", "We parked at the State Park to go to the Crystal Cove beach by using the only tunnel that takes you to the beach. It is surprising that the tunnel under the highway was inaccessible because of sewage.\n\nThey should have warned us about the tunnel, at the gate before paying the park fee, when we asked them forehand is this the way to go to the beach...\n\nWhat a disappointment to have this type of an unhealthy access for a possibly great beach!\nShow less"], ["Reviewed July 31, 2017", 5.0, "Peaceful", "Chesapeake patient trying to look for parking when you're coming to this beautiful Park. Just take yourself a Beach Blanket or chair and enjoy listening to the crashing waves smelling the ocean water. If you're not a fan of sand and saltwater just sit at the the view points, there is usually a bench\nShow less"], ["Reviewed July 30, 2017", 5.0, "Beautiful hidden little cove!", "We discovered this little gem when we were staying at the Marriott Villas. It is very private and secluded with an out door restaurant."], ["Reviewed July 27, 2017", 5.0, "Great sights", "I was staying in Corona del Mar but my friends recommended visiting here. Worth the trip! it is gorgeous, not to crowded and close to all the amenities in Laguna beach"], ["Reviewed July 22, 2017", 4.0, "Spectacular ocean view", "You can enjoy walking/jogging or cycling in this park or you can go for a swim or a day at the beach. Just be careful the waves are strong!\nYou can also enjoy watching the birds, snakes and other kinds of creatures if you were lucky!\nShow less"], ["Reviewed July 18, 2017", 5.0, "Beautiful spot for a family day at the beach", "We stayed nearby and loved visiting. The park is kept up and has bathrooms and outdoor open showers to rinse off. Some of the paths are steep but you can also get sweeping views from the boardwalk up top. If you enjoy less 'touristy' looking spots this is for you! $5 for sunset visitors. $15 for the day ( in and out access all day).\nShow less"], ["Reviewed July 16, 2017", 5.0, "So beautiful!!!", "This beach is great and so beautiful. Most ORANGE COUNTY beaches are awesome. Very family oriented and clean!"], ["Reviewed July 15, 2017", 5.0, "Once in a lifetime", "Had a fantastic time. We were able to stay in one of the bungalows. They are very hard to get. Check out u-tube , maybe the one you like is on there and that way you can tour them before you rent one. If you go in the summer, bring a fan with you.\nShow less"], ["Reviewed July 13, 2017", 4.0, "Well kept beach and patk", "Had a wonderful time at this beach with friends. Well kept beach and park. No trash seen. Coast guard on duty. Nice big waves , good exercise walking in the beach . California sun and the weather was perfect. Took uber from hotel and very convenient, did not have the hassle to park.\nShow less"], ["Reviewed July 13, 2017", 5.0, "A Throwback to the 50s/60s", "Felt like time had stopped several decades ago at this hidden gem beach enclave. A couple shops and restaurants that offer amazing views of the beach. I understand you can rent the 10 is so cottages. I might just do that - seems like an experience that can be a fantastic cocktail party story.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Natural beach", "This is a beach with rocky natural cliffs down to the ocean and wonderful rock formations to see in the water when the tide is low. Paved paths on top of the cliff. We saw sea lions and dolphins one time. Little restaurants and cottages in the historic district. Not as much of a swimming beach because it's more rocky but there were still lifeguards and people swimming.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great resturant on the beach", "We had a great time on the beach and the staff was exceptional. The shuttle from the parking lot served us well. We did not have to walk up the steep road to the lot"], ["Reviewed July 10, 2017", 5.0, "Great Beach - Clean State Park", "Love this beach. Was not crowded at all. Only $15 for the entire day! We loved the sand. Not too good where we where for boogie boarding but a great beach."], ["Reviewed July 10, 2017", 5.0, "Stunning views, not crowded!", "Beautiful beach for a morning jog either on the sand or on the trails on the cliffs overlooking the beach. I was there on a Friday Saturday and Sunday and the crowds were not bad at all.\nBeachcombers restaurant and the bar behind ( Bootleggars I think ) are worth checking out.\nI ran/ walked from the Marriott at Newport Coast just about a mile away but there is plenty of parking inside the park. $15 per car.\nIf you can catch low tide there are fascinating critters in the tide pools.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Simply Beautiful", "Nature preserved and for all to enjoy. The beach/ocean is so majestic and dramatically stunning natural beauty with an abundance of protected ocean life. Walking distance to great restaurants, coffee, some shopping, and Trader Joe's."], ["Reviewed July 10, 2017", 5.0, "GREAT BEACH", "This is a very nice beach with a small delicious restaurant. If you eat there, they give you a voucher for parking. Try their"], ["Reviewed July 6, 2017", 5.0, "Amazing tide pools", "Kids had lots of fun walking along the shoreline, playing at the tide pools and exploring the beach."], ["Reviewed July 5, 2017", 5.0, "Dinner on the Beach", "Magical dinner on the beach in Crystal Cove. White sand. Nice people. Great service. There's a trolley down the hill so parking was no hassle."], ["Reviewed July 4, 2017", 4.0, "Not Crowded Like Other Beaches", "While staying with a friend in Mission Viejo, she suggested we go to this beach to avoid the crowds at more popular beaches in the area. Since it was a warm Sunday, we are glad we came here. It is very pleasant and we were not jammed in between other beachgoers. Waves were not good for body surfing but would have been for a body board. Parking is expensive.\nShow less"], ["Reviewed July 3, 2017", 5.0, "A lingering hint of a wild southern California sea coast.", "South of Newport and away from the traffic on Pacific Coast Highway this State Park offers both interpretive and scenic excellence unmatched by so many SoCal beaches. From the mixture of extensive sand beaches, cliffs, lagoons and rock bound intertidal shorelines the facets of this reserved area have something for every beach goer. The cost is worth the trip although walking and hiking are necessary to enjoy the full extent of this remaining wild paradise by the sundown sea.\nShow less"], ["Reviewed July 2, 2017", 5.0, "Wonderful spot on the Pacific Shore", "Great walking in the State Park and down the shoreline. Historic cottages, some restored, some still waiting and a Visitor's Center to explain both. A couple of great eating spots for breakfast, lunch or dinner. Bring your boogie boards and beach chairs and spend the day.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Best Beach for Roaming", "Looking for a scenic beach workout walk? Then head to Crystal Cove. We got there at 8 am and there were few early birds out for a walk/run. We headed south and ran into a mysterious group of abandoned cottages - something out of The Hunger Games movies. What we didn't know was we were heading into the original Crystal Cove area. Charming and filled with history it was a great stop on our walk. The Beachcomber Cafe was busy! We walked thru the historic Crystal Cove area and learned about its fascinating history. The beach changes from sandy areas to moonscapes. We met a few crabs along the way. Don't miss it - beautiful and peaceful before 9 am!\nShow less"], ["Reviewed June 25, 2017", 5.0, "My favorite place in the OC!", "I love Crystal Cove State Park. It's worth the $15 per day to park, IMHO. So many great trails, the views are stellar, quiet beaches. Be aware that there are snakes, though - I saw two (gopher snakes), on different days, right on the trails. So yes, there is wildlife here. But you also have the historic area, which I always find charming; Ruby's, if you want a shake and a burger; and my favorite restaurant, The Beachcomber. I just love this park, and always try to stay nearby.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Life's a Beautiful Beach", "On recent visit to Newport Beach, took the short drive to Crystal Cove SP and loved the walk on the beach from one end to the other. Rock outcroppings and cliffs added to the allure of the beach. The restored historic cottage area was a fun extra to see (some used for movie sets but now are rentals on the beach). A quick way to feel 'away from it all' while still not far from the city!\nShow less"], ["Reviewed June 17, 2017", 5.0, "Camping at Crystal Cove", "This is a new California State Park just north of Laguna Beach and south of Newport Beach.\n\nWe have enjoyed many weekends here in our Airstream. It's like having a beach house right on the Southern California Coast.\n\nElectric and Water hookups are available as is WIFI. The bathroom and shower facilities are new and clean.\n\nOne of the best beaches in Southern California is a short walk down the hill.\n\nWe love this State Park!\nShow less"], ["Reviewed June 14, 2017", 5.0, "Great park", "I go there at least 5 to 6 times per year it is little far from my house but when I make it there I always enjoy the Long Beach walk"], ["Reviewed June 13, 2017", 5.0, "Amazing day at a beautiful beach!", "We loved this beach! Spent the whole day- enjoying the views/scenic surroundings and clean beach. We brought snacks and kids loved walking through the \"secret tunnel\" to arrive 🏖"], ["Reviewed June 12, 2017", 5.0, "Great place to walk.", "Spent a couple of early mornings walking this area and exploring tide pools. About a 3.2 mile stretch of beach. Highly recommend."], ["Reviewed June 9, 2017", 5.0, "Crystal cove", "Crystal cove. Is a beautiful place .beaches are beautiful. Sencery. Is so beautiful. You can go hiking. 2 restaurant there. Food is wonderful.family orient. Must see!!!!"], ["Reviewed June 4, 2017", 4.0, "Nice Beach and Views", "This covers a large portion off the Pacific Highway and there are plenty of spots to park but it is hard to determine which parking lot to go to. We went to two wrong parking lots before finding the correct one and then had to walk a great deal. I recommended truly understanding the location and were to park before heading out. There are other beaches/parks that you can park closer to then this one.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Wow! One of my new Cali Favorites", "I had searched this beach and thought it looked cool to check out. Although the parking was a little expensive as we were only there for 2 hours. It turned out to be worth it. The atmosphere and scenery of the beach is beautiful. I had dolphins swimming right next to me! This is for sure one of my new favorite beaches in California, I would recommend going here\nShow less"], ["Reviewed June 3, 2017", 4.0, "Beautiful beach with views and nature!", "So much to do and see here the best thing to do is break up your visit each time!! So much to look at, love the tide pools! Great trails for cardio and hiking with breathtaking views everywhere you look! One of my favorite places to go hiking. You can just relax on the sand plenty of beach to find a spot to catch some sun. The breezes are fantastic during workout sessions. Good for family and friends all ages. Easy access with a decent all day fee to get in.\nShow less"], ["Reviewed June 3, 2017", 4.0, "fun little spot", "Have to say I loved this quaint little beach resort-a taste from the past and you can see the porch where she dies in \"Beaches\" not to mention a great bar right in the sand."], ["Reviewed June 2, 2017", 4.0, "Great hike / runnable.", "Many trails to choose from - big climb up first couple of miles. Great views of ocean. Would like more single track."], ["Reviewed May 27, 2017", 4.0, "NICE SANDY BEACH IN A PRETTY COVE.", "The beach at the day use area is a very nice sandy beach, very clean and on Mamorial day weekend not that crowded. Nice place to fish the surf. There are lots of trails and some great picnic areas on the inland side of PCH by the parking lot. The restrooms were very clean for being at a beach area.\nThere are four different sections of the park linked by trails or paths, each section has a different park entrance gate off of PCH. Lots of history here also.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Beautiful!!!", "Nice little spot, what more can u say. Beautiful views, great walking trails!just gorgeous! Can do in one day. Not totally quiet, can hear PCH 1 traffic, but once on trails it quiets down."], ["Reviewed May 25, 2017", 5.0, "Do not miss this if you are in the area", "Such a historic gem on the coast. A preserved sea side resort with cabins for rent on the beach. Gorgeous dunes and plants surround the property."], ["Reviewed May 24, 2017", 5.0, "Lots of variety all within walking distance", "We enjoyed our visit to Cyrstal Cove State Park. We walked in and followed the trails. Many places with signage to tell about the area, wildlife and history. There is a sandy beach with a restaurant, rocky hills, rocks to explore and even a cave."], ["Reviewed May 23, 2017", 4.0, "Well worth a visit", "We bicycled into the park (avoid the 10 dollar fee entrance fee). Great trails and we could see whale off the coast."], ["Reviewed May 23, 2017", 3.0, "standart", "here is standart cove. the sunset is nice, but when you compare it with laguna, it is not beautiful then laguna. if it is on your way, you can stop by."], ["Reviewed May 22, 2017", 5.0, "Beautiful State Park", "Great treat to do the trails and end up in the beach village that has been preserved. Includes museum type preserved beach homes that are fun to walk through. Beachcomber restaurant on the beach and around the corner is a beach bar to enjoy a beer. Interesting terrain and in the morning a fun place to walk among the tide pools to look for marine life. Well worth a stop.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Best beach in Cali", "Hands down all time best beach in Cali. Ample parking (with a hike/shuttle), food for purchase close by, rocks to explore, great sand, great waves. Simply the best. Been going there all my life."], ["Reviewed May 21, 2017", 4.0, "Nice Beach with shallow water shelf", "This is a State Beach park that requires a small fee for entrance. The area has lots of hiking trails and nice beach area without rocks that is fairly shallow water with a gentle surf. We walked a mile one way and two miles the other way which has some rocky areas where you can view some marine life that is accessible from the beach.\nShow less"], ["Reviewed May 18, 2017", 4.0, "Good Park", "Nice beach park, multiple entrances off of the PCH. Has some good tidal pools if there at low tide. Enjoy"], ["Reviewed May 17, 2017", 5.0, "Fun place to spend the day.", "We went as a group to paint. It was a perfect place. Good food available, family friendly location, and a clean beautiful beach."], ["Reviewed May 15, 2017", 5.0, "Our Favorite Place in Orange County", "We are in Orange County several times a year to visit our son and we always make time to visit Crystal Cove State Park. It is the kind of place that I could visit daily for the rest of my life and never grow tired of. The park is actually quite large and encompasses bluffs overlooking the Pacific as well as a string of beautiful beaches that run from Corona del Mar/Newport area up to and connecting with the beaches at Laguna.\n\nThere are multiple entrances to the park and each one of them leads to a beautiful bluff area covered with wildflowers and California sage brush and a trail or trails down to the beach. There are paved parking, facilities and hiking/running trails up top and, depending on the entrance you select, either a stairway or steep walkway down to the beach.The bluffs and beaches are wild and natural, not groomed or landscaped. There are some nice rock outcroppings on the beach and tide pools as well--be sure to check a tide table if you want to explore the tide pools as they are submerged most of the day. Make sure you take note of where you park and which walkway you take down to the beach so you can easily find your way back. There are no bathrooms or facilities down at the beach level unless you are up near the Beach Comber Restaurant so be sure to plan ahead. Bring what you need and be prepared to pack it in and out.\n\nThis is a lovely, lovely wild place. Wonderful place to hike, walk or view the sunset. It's impossible to not fall in love with it.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Loved, loved loved this park!", "We actually walked to the beach from our hotel. We stopped to take amazing pictures and ended up by the Beach Comber Restaurant and Shake Shake and Crystal Cove Visitor Center. All were very nice. The history of the area was quite interesting, too. It was once the play-land of many American families (some of the original cottages are still standing) and a farming area of Japanese families.\nShow less"], ["Reviewed May 10, 2017", 5.0, "Spectacular Hikes and views!", "Great place to hike. We did the \"strenuous\" path...almost 9 miles and 3 hours long ( we were fast). Hike was well marked. Some areas of narrow paths that could be intimidating, but mostly large paths with steep inclines and declines that show up periodically. Mostly gradual inclines or declines tho.\nA challenge, but worth the effort! The views are great...at the front and the back of the trail.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Beautiful historic location", "Crystal Cove is a great place to go back in time and experience what southern California beach communities were like decades ago. With planning, you can stay in one of the original cottages. The Beachcomber Cafe is a great place to enjoy drinks and a meal literally on the beach. Cocoanut macadamia pancakes are worth the trip!\nShow less"], ["Reviewed May 8, 2017", 4.0, "RELAX and ENJOY", "This is a very peaceful place to sit and watch the waves or to walk breathing in the fresh air. It costs $15 for the day but worth it to help preserve the natural area. It is so close to local shopping and eating places,or bring a picnic. The scene is beautiful with waves, rocks and sand. There were not many people today so that added to the tranquility of the day. An unexpected place to relax.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Perfection", "Seriously this patch of earth is pure perfection! It's how you picture California.\nThe parking is a bit of a mess with the overfull lot, the inconsistent shuttle service - but once you're here it's perfect!\nOcean, life guards, white sand, good restaurant, cute cottages. It's almost the perfect California movie set - feels very old school.\nWe love it!!!\nShow less"], ["Reviewed May 5, 2017", 5.0, "A great beach!", "We walked for a good two hours on this beautiful beach. Was just perfect--the day, the ocean, the beach!"], ["Reviewed May 3, 2017", 5.0, "A step back in time", "What a wonderful beach - a step back in time. All the original Laguna cottages. Private and pristine. Take a walk and enjoy!"], ["Reviewed May 2, 2017", 5.0, "Hike", "Have gone for hikes here a few times when visiting. There are a few paths to take depending on your skill and stamina. I would recommend not going in mid-afternoon as i get HOT. There is a bridge/underpass that you can walk right out to the beach if you want a dip or just walk on the beach. there is a tourist center with trails as well as water fountain and restroom.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Spring hike up the canyon to see the 'superblooms'", "My sister in law took me hiking here to check out all the spring blooms - we saw TONS of wild mustard, thistle, and various of other flowers I don't know the names of :) It was a warm day for hiking but still pleasant when the sea breezes hit. The views can't be beat on a clear day - rolling green hills with sparkling blue waters. If I lived closer, this would be a frequent spot for day hiking.\nShow less"], ["Reviewed April 27, 2017", 5.0, "WHALES!!", "This is a great hike and wonderful place to hang out. Stay on the cliff or trek down to the beach. All kinds of flowers and plants. On the beach there are many rock formations and it becomes even more interesting when the tide goes out. If you're patient at the right time of year, you'll see grey whales and their calves migrating north to Alaska. Always an opportunity to see dolphins. If you go down to the beach, there's a strenuous hike back up to the parking lot. This is a site you can visit every day and not be disappointed.\nShow less"], ["Reviewed April 27, 2017", 5.0, "MUST visit if you are in Orange County", "This is the most fantastic place to visit, relax, and enjoy the Southern California coast. $15 parking fee that is validated if you eat at the Beach Comber restaurant located in the park. Mornings may be cloudy, but typically burns off by 10-11. Walk to/from beach has steep pathways.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Best place to go for not a lot of people no lots of space for your own", "I loved this place so much while visiting my sister in California I tried to go there every day. I could not believe how compared to other beaches, how few people were there and how much private space you had, even on the weekend. Amazingly beautiful, I walked several miles along this cove and swam everywhere I threw my towel down. Took too many pictures to count, and fell in love with it.\nShow less"], ["Reviewed April 26, 2017", 5.0, "The Jewel of the South Coast", "Ive been coming here since the mid-80's. Many changes, but the most important thing is the same. A Fantastic hidden Beach and Tide Pools that most People do not come to. I do miss sneaking down to park where the Residents parked and getting yelled at by them...haha. Now you have to park PCH in a lot that gets locked after hours and trek under the Hwy. I Love Crystal Cove !\nShow less"], ["Reviewed April 24, 2017", 5.0, "A beautiful view", "This is just a lovely place to stay and watch the sunset or just to think and watch a beautiful view. I really recommend this place if you are going to Laguna Beach"], ["Reviewed April 24, 2017", 5.0, "Always wanted to come here", "THe first time we stopped by was like 6 years ago but did not get off. This time we parked the car across the highway and took the shuttle down intending to have lunch at the Beachcomber's cafe ( very long cue). I love the quaint atmosphere. It is perfect for laying out in the sun and taking on one of the California beaches. It was a perfect day to be out. There were a few tables right by the beach, just bring your own umbrella. The tiny visitor center cottage is cute!\nWill definitely go back.\nShow less"], ["Reviewed April 24, 2017", 5.0, "One of my absolute fave beaches!", "I've been going to Crystal Cove since I was very young. It's always been one of my favorite beaches. I love the tidepools, the old beach bungalows and the access to Beachcomber Cafe and Ruby's Shake Shack. It's also often rather desserted in the off-season."], ["Reviewed April 24, 2017", 5.0, "Paid to park & See the Sunset", "Breathtaking Views of the Sunset! Love all the Pelicans flying by. Made my trip out to see the Beach worth it! Took some pics. Costs $15 for the day but goes down to $5 before sunset"], ["Reviewed April 18, 2017", 5.0, "Nice Hikes and Views on a Sunny April Day - Crystal Cove State Park", "We enjoyed the views from Crystal Cove State Park on a beautiful sunny April day. We also enjoyed the views on our walk from the parking lot to the ocean. Its a gorgeous place to go. We used our California State Park annual pass to enter. If you do not have that parking fees are $15.00 for the day. There are several parking lot areas.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Quiet, Beautiful Beach.", "There is very little development along this State Park beach. It seems the $15 all day parking fees discourages people. It is a beautiful, clean, quiet beach, which is well worth the parking fee. Access is down a small, verdant canyon, through 1950's vacation cabins, which are being restored by the state for short term rentals. Very interesting. There is a good restaurant right on the sand. For a small fee, a bus will take you down the bluff to the beach, if you like.\nShow less"], ["Reviewed April 12, 2017", 4.0, "Breakfast has gone downhill", "We have gone here for breakfast many times but maybe because they were transitioning to there lunch menu we ended up getting the old cold salty potatoes and leftover salmon from the morning meals. The $20 bloodymary was good but not a lot of vodka for the price. They use to have an awesome Frittata but menu is always changing.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Wonderful views, perfect for families or friends to enjoy", "This is a very special place with incredible views, wonderful history, terrific walks on the beach! The restaurant is a great treat, as well!"], ["Reviewed April 6, 2017", 5.0, "Unexpected find - awesome!", "Loved the cliffs and peacefulness of the beach. After the beach we hiked up the mountain and took some amazing pictures. The view was incredible. Park was clean and felt safe."], ["Reviewed April 6, 2017", 5.0, "Best birthday ever", "The whole family surprised me on my 70th at this beautiful beach. Surprisingly I had never been there even though I have lived here all my life."], ["Reviewed April 1, 2017", 4.0, "Iconic and Scenic Beach", "We parked one block away from the path to enter the Crystal Cove Park and paid the public parking fee of $15.00. It was all worth the price after we hiked down to the beach and enjoyed spending the whole morning there. Great place to take the kids because there are so many tide pools filled with crabs and sea creatures. The different and dramatic shapes of the big rocks makes this place iconic. There is a cafe near the beach and a shake place near the highway if you get hungry. A great scenic place to visit in Southern California. \nShow less"], ["Reviewed March 30, 2017", 5.0, "Take off your shoes and feel the sand!", "Crystal Cove is one of the nicest beaches in the Orange County area. It is a state park so access is controlled. That tends to make it less crowded. The uniqueness of the old cottages make this a very special place. And, the Beachcomber restaurant is right there on the shoreline. The food is good, but you may have to wait for a table in high season.\nShow less"], ["Reviewed March 25, 2017", 4.0, "Coastal gem", "Have been coming to this beach for 60 years now. Entrance fee/parking is now up to $15 so not good for a quick visit, but good for an all-day beach day. If you plan to just eat at the Beachcomber, keep in mind that you only get 3 hours validation and only if you spend more than $15 at the restaurant, and if you take the shuttle from the parking lot, it is $1.50 each way. Handicapped parking available on the beach, and the Beachcomber and restrooms are accessible to wheelchairs. There are also beach wheelchairs (manual) for use if needed.\nShow less"], ["Reviewed March 24, 2017", 4.0, "Not as pretty as Heisler Park but also less crowded", "Miles and miles of white sandy beaches with fewer rocky crops and an elevated path that does not have manicured California gardens but rather wild habitat. The memorial to the 1950s cottages is worth viewing. We did not do the back trails."], ["Reviewed March 22, 2017", 3.0, "Overcast skies skewed the view", "The crystal cove park has plenty of trails along the beach, on the bluff and into the hills, take your pick. Parking is convenient, although across PCH. Park was clean and nicely maintained. Friends recommended breakfast at the beachcomber restaurant... food was good, staff was prompt. Overall, glad we visited. Restaurant validated parking for up to a 3 hour visit.\nShow less"], ["Reviewed March 20, 2017", 4.0, "Lunch", "Had a great time on the beach. We parked across the street and walked thru the Historic tunnel under the highway.\n\nEat right on the beach and enjoy the view.\n\nStay in a cottage, reservations required.\n\nI went and enjoyed the Historic cottage museum and walk ways. Great lunch spot.\nShow less"], ["Reviewed March 17, 2017", 5.0, "Amazing hidden gem! Hike to your heart's content!", "Crystal Cove has hikes ranging from 2 to 11 miles. Most are wide, well maintained trails. We opted for a 5 mile loop going back into the park which was beautiful due to all the rain, and then coming back to breathtaking views of the coast. Not crowded during the week. This is a winner for all you outdoor enthusiasts. Hiking. Mountain Biking. Kid friendly.\nShow less"], ["Reviewed March 15, 2017", 5.0, "Amazzzzzing!!!!", "One of the best view on the coast with the traditional sunset in the pacific ocean...Just do check on the bucket list! All sites have a nice view an it is very near the beach so with else can you ask?"], ["Reviewed March 14, 2017", 5.0, "Take a hike or ride the bus", "Parking on the Northside of the PCH. There is a shuttle bus for $1.50 each way or take the hike through the tunnel which is well lit and painted with murals. Beach is great with old cottages some open for tours and others available for rental. There is a museum and a couple of food options. You have to pay to park but that buys you security for your car. There are bathrooms on both sides of the highway.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Favorite Beach", "A best kept secret of OC - usually uncrowded, especially during the week. Miles of beaches to walk and admire."], ["Reviewed March 12, 2017", 5.0, "Camped here for the week", "We have been to this state park numerous times but this was the first time we camped here. We absolutely loved it. The sites are generous size and the location can't be beat. I cherished running the trails in the mountains behind the campground and the beach is a close walk. There is a Trader Joe's five minutes away for supplies. I need to give a special shout out for the camp host Chris who went above and beyond when my husband got injured skateboarding and he needed a few days to recuperate. Chris was helpful in numerous ways and was a bright light of kindness which we so appreciated. We will definitely be back!\nShow less"], ["Reviewed March 10, 2017", 5.0, "Great walk on a California Beach", "Great vistas, fun spot to walk. Not overly crowded in October but plenty of people around to keep it interesting."], ["Reviewed March 9, 2017", 5.0, "Great place to walk - and great beaches", "We really enjoyed our 3-hour hike through one small area of the park followed by time on the beach. The park was closed for several days after very heavy rainfalls and once we got in we could see some of the intense erosion. There were cyclists and other hikers on the trails. It is worth a visit in February (when we went) because of some beautiful views and must be spectacular when things are in bloom\nShow less"], ["Reviewed March 8, 2017", 5.0, "Walk on the beach", "Beautiful quiet several mile walk on one of the most beautiful beaches in So Cal. Perfect for sunsets..."], ["Reviewed March 7, 2017", 5.0, "Great visit", "Crystal Cove State Park offers some of the best secluded get away spots to spend time with that special person or family"], ["Reviewed March 1, 2017", 4.0, "Beautifully quintessential SoCal", "Park across PCH and take the bus over to the beach or walk under PCH through the tunnel. Expansive stretch of beach....bring friends or family and just hang out. If you get hungry grab a seat on the patio of the restaurant which has large portions and excellent cocktails.\nShow less"], ["Reviewed March 1, 2017", 4.0, "Step back in time in this quaint little beach spot", "Crystal Cove and it's beach cottages are wonderful. I was there in 2/17 and for some reason the beach is covered in medium sized rocks. I've never seen it like that and hope they clean it up before warmer weather comes. The movie Beaches was filmed as the last cottage to the north!\nShow less"], ["Reviewed February 24, 2017", 5.0, "My favorite local beach", "This is a beautiful stretch of coastline. There is a tram from the parking lot across the street, but the walk is scenic. Even if you take the tram, there is a bit of a walk to the beach if you are carrying a lot of beach gear. The restaurant is excellent, and you are given a beeper so that you can explore and hang by the beach while you are waiting. There are historical cabins that you can stay in, and a new phase is being restored. If you walk up the stairs to the lobby area, there is a beautiful deck with awesome views.\nShow less"], ["Reviewed February 21, 2017", 4.0, "Crystal it is", "Inspired by the whale and two dolphins we saw! Enter at the historic area to check out the cabins and walk that section of the beach. We brought lunch and ate on the beach while looking at the beautiful waves."], ["Reviewed February 21, 2017", 4.0, "Walk the beach", "Great place to walk the beach and relax. Beach combing is strictly forbidden as it is a state park. Enjoy the walk, but don't touch anything."], ["Reviewed February 16, 2017", 5.0, "Romantic walk on the beach", "This is the best beach if you want to get away from the crowds. A blast from the past with all the restored beach cottages. Restaurant is busy and sometimes a wait for a table, but it hardly matters as you just grab a beeper, take your shoes off and still on the sand. Check it out, you won't be disappointed!\nShow less"], ["Reviewed February 16, 2017", 5.0, "Beautiful setting", "Sit outside.the crashing sadness are a great setting go any casual background.breakfast is the best menus of the day.their French toast it's killer! I like doing in the gift shop to browse the wonderful plein aire framed originals...Will definitely buy one at some point.the restored state bungalows are charming and for out of towners, a great get away for a beach front vacay. State property makes an affordable stay at one of California best beaches.\nShow less"], ["Reviewed February 14, 2017", 3.0, "Beautiful Place, Snarky Park Workers", "My husband and I visited Crystal Cove State Park today. This was our first visit to this park and our first experience with the California state parks system. The coastline is stunning and we enjoyed the beaches and learning about the historic beach district. The rude park staff, however, were unwelcoming and made us wonder if this park really wants visitors. The guy at the Los Tracos entrance gate should re-think his job choice since the general public seems to irritate him.\nShow less"], ["Reviewed February 14, 2017", 5.0, "Most beautiful beach in SoCal", "This place is so beautiful that it almost looks fake! A definite must see if you are in the area! Park on the beach side park and walk/run from there. It's gorgeous! Go north and stop at Ruby's Shake Shack for a snack."], ["Reviewed February 13, 2017", 5.0, "Family beach at its beast", "You can walk along the beach or just enjoy the beach life at the state park, you can have a great meal at the beachcomber restaurant or bring your own picnic. There are some great little walks along the beach, too."], ["Reviewed February 11, 2017", 5.0, "Lovely place for a stroll on the beach and through the beach houses", "We met a lady on the shuttle from LAX who invited us down there by chance and we're glad we went. It's a lovely beach that you can stoll along with some nice rock pools and rock formations, not the mention the historic beach houses that have been used in movies and that can be rented (if you're quick or lucky enough to get hold of).\n\nThere are a few cafes and bars in the village to get something to eat and/or drink after your stroll, as well as gift shops and a museum/discovery centre that's worth a look.\nShow less"], ["Reviewed February 1, 2017", 4.0, "Great scenic views", "Crystal Cove State Park is located along the coast between Newport Beach and Laguna Beach. You can walk along the trails on the cliffs or walk down to the beach. There are lots of scenic views along the way. There are parking lots and restrooms at the entrance points. There is an admission cost depending on how long you want to stay. If you walk on the beach, there are lots of rocks to climb and tide pools to explore.\nShow less"], ["Reviewed January 30, 2017", 5.0, "Beautiful Hike", "We took the hiking trails from Los Trancos down to the beach. Great hike and beautiful and Historic beach front homes. We spent a great time walking the beach and then had lunch at the Beachcomber Café, right on the beach. You have to take the time and go here. You won't be sorry.\nShow less"], ["Reviewed January 28, 2017", 4.0, "Very nice beach", "Enjoyed a walk along the beach here. Take a number of steps down from roadside to reach the beach. Nice and private. Not overly full with beach goers. Between Newport Beach and Laguna beach. Enjoy a shake at ruby so shake shack afterwards. Nice beach to go for a walk on, sit and relax, picnic, walk your dog, etc.\nShow less"], ["Reviewed January 26, 2017", 5.0, "You can take a bus down to this lovely beach.", "This is a charming little beach with restored old beach cottages and a small exhibit. The beach is clean and easily gotten to via bus or walking from the parking lot. THey have a restaurant that always has a long wait but is good."], ["Reviewed January 16, 2017", 5.0, "Love this little cove!", "Charming and fun!!! Have been to the restaurant and have been for a party at a charming beach house. Wonderful!!"], ["Reviewed January 13, 2017", 5.0, "3.25 Miles of unspoiled Beach", "Its like stepping back in History to a simpler cleaner time. The Beach walk is one of my favourites and as a matter of fact it becomes a daily ritual when in Newport Beach"], ["Reviewed January 9, 2017", 5.0, "Great view of the ocean from Crystal Cove State Park", "The view is fantastic. It is not crowded. One can walk the beach for a long way without a crowd. There are old cabins that are from the 1950's era with the old time radio, refrigerator with coil on the top, etc. One can rent a cabin for overnight. (I have not done that). There is a nice restaurant with reasonable prices. If you have lunch at the restaurant, they will validate your parking ticket. It is nice to sit out on the patio and have lunch and watch the ocean and the birds. There are also hiking trails. Parking is across the street. You can walk down the hill and through a tunnel or take a shuttle bus to the beach.\nShow less"], ["Reviewed January 4, 2017", 5.0, "Paradise to me, walking quietly on the beach early in the morning", "This is a wonderful each early in the morning, it is a State Park and is best to get there early to avoid the crowds. There is a restaurant called the \"Beachcomer\" that had Breakfast Lunch and dinner. Nothing but Seaglass can be picked up from this beach as it is protected. I Love collecting Seaglass, picking it up along the beach is the most relaxing part of my morning while I am on vacation!!! There is also cabins to rent!!!\nShow less"], ["Reviewed January 1, 2017", 4.0, "Nice view, leisure walk", "Visiting this place with my family during the holidays, the weather was nice, cool, and sunny... the walk along the beach was nice... and the scenery in general was beautiful... got a few interesting pictures of the seagulls, sanderlings, and the scenery"], ["Reviewed January 1, 2017", 4.0, "Ocean front trail network and beach", "Crystal Cove is comprised of both a beach as well as a network of trails that extend into the foothills above Laguna Beach. I only visited the trail network, so my review focuses on that. I rode most of the trails on my mountain bike during my trip to Laguna Beach. The trails are well maintained are mostly fire roads, with a few single track trails mixed in. If you like to do a lot of steep climbs, with generally non-technical descents, this is your place. The one exception to this is \"rattlesnake\" trail, which has a nice tight single track trail that starts near the top of the park and ends in a steep / rutted / technical rock garden at the end (i.e. the rattle). The views of the ocean from the park are spectacular and connects to Laguna Coast Wilderness Park in several places. Great place to hike, run or bike.\nShow less"], ["Reviewed December 27, 2016", 5.0, "I could spend all day here!", "You can walk along the ocean or on the path on the cliff. Either way, you are walking along the ocean and enjoying the CA coast. It's relaxing and beautiful. This park was my favorite and we went back a second time. I wish I lived near it, I would walk there every day!\nShow less"], ["Reviewed December 19, 2016", 5.0, "Escape to Nature", "Although PCH goes right through the park and it's just minutes from Laguna Beach and Corona del Mar, Crystal Cove is a true nature retreat. The beaches below the cliffs are spectacular. The mountain hiking and biking area is rugged and beautiful. We've even backpacked there! The bungalows are hard to reserve, but the area is great to visit. The Beachcomber restaurant has good food and an unbeatable location right on the sand.\nShow less"], ["Reviewed November 24, 2016", 5.0, "Beautiful", "Incredible views - beautiful walk on the beach. Eat at the beachcomber excellent food and great to just stare out onto the beach"], ["Reviewed November 22, 2016", 5.0, "So pretty--plan a day here", "This is such a great spot. We paid $5 for an hour but I think it was $15 for all day parking. We came on a Tuesday so it was pretty empty.\n\nThey have trials where lots of walkers/ joggers take advantage of the great weather.\n\nThe beach is very clean... so two thumbs up for that. They had a variety of benches throughout.\n\nThe path down to get to the beach was a bit rough if you have bad knees or some physical ailment. There were stairs. There might be a ramp further on down but where we parked there wasn't.\n\nThis place is a great place for family/engagement etc pictures.\n\nAlso they have bathrooms (clean also) which is a plus. No soap in the bathrooms so carry hand sanitizer. Also no paper towels or hand dryers.\nShow less"], ["Reviewed November 19, 2016", 5.0, "Last bit of Orange County natural beauty", "OC oceanfront is over developed. So this stretch of beach front, canyon hiking area, and bluffs is a wonderful sight to see and explore. There is something for everyone including two restaurants. The upscale Beachcomber on the sand and Ruby's on the cliff which is casual and moderately priced. At low tide you can walk forever on the flat sand. There are also cottages and rooms that can be rented through the California park system. Further north, there is just beach without any signs of commercialism. Spend the day or a few hours there and you will hopefully feel refreshed and recharged to tackle the more urban OC.\nShow less"], ["Reviewed November 12, 2016", 5.0, "Beautiful cove", "Easy hiking trails down to the beach. Have benches where you can rest and watch the sunset. Bathrooms are also accessible at the top of the trail. Easy parking and not crowded at the time of the year that we went in November. Would recommend this beautiful cove\nShow less"], ["Reviewed November 11, 2016", 4.0, "Hiking and Beach...", "We've been there before to go to the beach and, of course, that's great. But today, we went hiking. When you face the ocean, it's a great place to hike. The trails are loops, though, and so often, the ocean isn't within view. Though the trails are well-maintained, there isn't much great to look at when facing away from the ocean.\nShow less"], ["Reviewed November 10, 2016", 4.0, "Very Beautiful", "This park has very nice views. $10 entrance fee per vehicle I believe. Laguna beach also has spectacular views and only fee is parking at $1.50/hr."], ["Reviewed November 10, 2016", 4.0, "Fun place to spend the day", "This is a very nice wide stretch of beach which means it really doesn't seem crowded most days. There is a place to grab a bite and restroom facilities which are both a huge plus. They also have chair rentals which is also convenient."], ["Reviewed November 7, 2016", 5.0, "Great place", "It's a beautiful place, lovely with kids and for a swim. It's a hidden gem compared to the larger beach areas nearby."], ["Reviewed November 2, 2016", 4.0, "Must see, interesting history", "We stopped in Crystal Cove Park a few days ago. Interesting bit of history here. Kind of odd with many of the old original houses still standing and fenced off. If only those houses could talk and tell their story. Stop in visitor center and learn about the past for this section of beach before CA state park took it over. Take a look at the pictures from past. We walked th beach for bit. . We Didn't stop to eat. Perhaps next visit.\nShow less"], ["Reviewed November 1, 2016", 5.0, "Great Beach!", "This is the beach made famous by the movie Beaches! It is still beautiful but not as remote. You can rent one of the beachfront cabins, grab a shake at the Shake Shack or have dinner at the Cove restaurant. You really can't go wrong!"], ["Reviewed November 1, 2016", 5.0, "Hidden Jem", "Crystal Cove State Park is a great strip of beach in Orange County. Parking can be a challenge, but if you're willing to hike a bit with your beach gear, it's well worth it! My family likes to come and spend the day here."], ["Reviewed November 1, 2016", 5.0, "Beautiful scenary - a must see", "This is a great place to visit, but be ready to do some walking. It's a bit hilly to get down to the beach (and UP again) but it's worth the scenary and the tidepools. Now... there are rattlesnakes.. yes that is right. BUT we did not see any on our trip and as long as you are aware and stay on the path you are fine. The beach itself is great to walk up and down and do some exploring. There are some public restrooms and places to stop for a drink and a bite along the way.\nShow less"], ["Reviewed November 1, 2016", 5.0, "Favorite place in SoCal.", "This is my favorite beach in Southern California. I love the beach, tide pools, cafe, bar, and historical aspects."], ["Reviewed October 27, 2016", 5.0, "Back in Time", "Crystal Cove is an old Timey California beach area. There are a bunch of cottages on the beach that were restored and are available for rent. This location goes back to the 30s and 40s when going to a beach cottage for the week was a popular thing to do. This place is so full of history. Even the gift shop is fun\nShow less"], ["Reviewed October 18, 2016", 5.0, "Amazing views fa tasting coloured water and beach", "Would love to live here would never tire of the view it is so pretty With the sea and the sky and the beach this is a great place and safe enough to take little ones as well"], ["Reviewed October 17, 2016", 5.0, "Unexpected beauty by PCH near Laguna and Newport, CA", "Very nice hike. Views were beautiful. State park is very well maintained. Price for parking ticket is very reasonable, 15$. And it last all day in any of the parkings throughout the park."], ["Reviewed October 17, 2016", 5.0, "Perfect Place for Everyone!", "There's something for everyone here ... bask on the beautiful beach, wander around the wonderful walking paths (for athletes-in-training you can find lots of stairs to climb) and for those less energetic, check out the wonderful restaurants and stores across the street in the Promenade ... after your stroll on the beach, grab a drink or dinner at the Beachcomber Restaurant.\nShow less"], ["Reviewed October 14, 2016", 5.0, "A step back in time", "Crystal Cove Cottages is a hidden gem. They are renovated cottages built in the 1940s. You have to make reservations for a cottage six months ahead on the first of the month. I went on in April 1st and got a reservation at 8:08 and all of the cottages were booked for October by 8:15. We booked #40. A small cozy cottage that is literally on the beach. It is small for two and a child. But it has a large deck that is about 40 ft from the ocean. Absolutely great. We just chilled for two days and nights. Walked on the beach, ate, sleep, did nothing. So cool. If you're looking for a Hyatt Regency don't stay here. It's a step back in time. No TV, no phone, only a microwave but wifi and cell. So relaxing. There is the Beachcomber restaurant on site a very short walk from #40. The staff was outstanding and very friendly. I highly recommend it. Dynamite.\nShow less"], ["Reviewed October 13, 2016", 5.0, "Beautiful waves", "Great state park with beautiful views and peaceful beaches. Great waves. We would return if back in this area to spend more time at the park"], ["Reviewed October 12, 2016", 4.0, "KB", "The only reason I didnt give it 5 circles is the parking is 15 dollars. State beaches up in ventura and north LA County are 8 dollars.\nGood paved trail runs length of the park. Several trails give you beach access. One of the trails is a boardwalk. Several signs talk about the fauna, animals and wven the sea life.\nBeaches are clean. Several restrooms were very clean.\nShow less"], ["Reviewed October 12, 2016", 5.0, "Team building on the Beach", "Took a group on the beach for team building and lunch afterwards. The lunch experience was great as we booked it with state that allowed the Group to partake in adult libations while on the beach."], ["Reviewed October 10, 2016", 4.0, "Great hour hike", "Nice little hike. Was worth the time...Well groomed hiking trails. Steep clime on the shorter version."], ["Reviewed October 8, 2016", 4.0, "Beautiful sunset spot", "Went there on a Saturday night in October. $15 to get in unless you have the state park pass. Plenty of parking. You can stay above and look down from the cliffs or walk down to the beach. They have public restrooms. Great place to watch the sunset.\nShow less"], ["Reviewed October 7, 2016", 2.0, "Beautiful park ruined by rude staff...", "The lady at the main entrance and the lady at the parking entrance were very rude, irritable, and unhelpful when asked very simple questions. I felt like a bother to them and all I asked was where the parking was. It put a damper on a beautiful afternoon. It is not hard to be nice to paying customers. Otherwise, 10/10 for The Beachcomber. But be prepared for rude staff at state park.\nShow less"], ["Reviewed October 2, 2016", 5.0, "Lovely Beach & Cottages but surrounding area not the same", "This is a beautiful spot, but having lived in SoCal for about 16 years having moved there in the mid 90's it is sad to see how much this area has changed. I am glad they are preserving the Crystal Cove Cottages rather than having big developers scale the hill with mansions like the rest of the area. There is good parking across PCH but it's not what it used to be. People no longer drive the coast leisurely to enjoy the pacific ocean but portions of PCH is now 3 lanes each direction, I came home calling it the new PCH speedway. Development is not always a good thing and the hills are littered with expansive homes, condos and resorts which enjoy the view but have literally ruined the landscape for those of us that remember what we loved about the Southern CA coast line along this stretch. Thankfully the cottages are there and maintain what is left of the SoCal beach culture. It is rumored the last little cottage on the beach was used for a scene with Bette Midler and Barbara Hershey in the movie Beaches. So be careful getting to the beach. The beach itself is beautiful and fortunately the crashing waves and portions of hills will diffuse the sound of cars speeding down PCH. So great beach, great views, great place to relax but on my way there I felt I was going to be run off the road by speeding traffic.\nShow less"], ["Reviewed September 29, 2016", 5.0, "Nothing Better", "Chrystal Cove is located between Laguna Beach and Corona Del Mar. This is a state park with one of the greatest beaches in OC. Enjoy walking the trails. Parking is good. Just go. This is a can't miss experience."], ["Reviewed September 28, 2016", 5.0, "Beautiful views, walks, exploring, and bike path", "We had a great family outing walking along coast and exploring the different inlets. Plenty to do for the family where it's clean and safe. Would recommend parking across the street to save money if less than 2 hrs or if you only plan to visit the cottages. Trolly to cottages, restaurant, and additional beach. If you're looking for food they have a small restaurant with drinks on the beach and hamburger shack above overlooking cottages. Great day all around and god spot to bring out of town guests.\nShow less"], ["Reviewed September 18, 2016", 5.0, "Wonderful place for long walks", "This is a wonderful beach for long, romantic walks. Depending on the tide, some parts may require flip flop wear, but usually we can do 2-3 miles barefoot."]]}}