{"Dante's View": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Dante's View", "url": "/Attraction_Review-g143021-d531585-Reviews-Dante_s_View-Death_Valley_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/aa/6d/eb/hinweisschild-am-rande.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1867"}, "address": {"@type": "PostalAddress", "streetAddress": "Dante's View Rd. off Rte. 190 30 mi south of Furnace Creek", "addressLocality": "", "addressRegion": "California", "postalCode": "92328", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 5 days ago", 4.0, "Breathtaking !", "Lowest point in US over - 281 feet below sea level - from Dante’s Point you can get a fantastic view of the valley ! Very picturesque- be sure to take the camera ! Worth the ride down into this area off the main road ! Will repeat !\nShow less"], ["Reviewed 6 days ago", 5.0, "Great view of Valley", "stop here on the way in from Death Valley Junction.....................You can see for miles in all directions of the valley"], ["Reviewed 6 days ago", 4.0, "What a View!", "WOW what a great place to view the wonderful Death Valley NP.\nLooking down onto the salt flats and Badwater Basin was amazing.\nKind of a little out of the way but definitely worth the trip.\nVery narrow road in places so no long vehicles.\nPretty windy when we went so be prepared.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great view", "Dante's View is an overlook with a great view of Death Valley, especially the salt flats of Badwater Basin. RV's and trailers are not allowed on the narrow and windy Dante's View Road. There is a decent-sized parking lot at the end of the road.\n\nWe visited the overlook on a Friday morning in November, and it was not crowded. Although it was hot in the valley (79 deg F/26 deg C), it was windy and chilly at Dante's View (63 deg F/17 deg C). Be sure to bring a light jacket. The panoramic views of Death Valley were great. At no other overlook (Zabriskie Point, Father Crowley Vista Point) do you get to appreciate the size of Death Valley as you do here.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Magnificent View", "You can get a wonderful view of death valley and the Amargosa River as it spreads across the valley, as well as Mount Telescope. A great way to orient yourself to the park. Unfortunately, the area was closing for road improvements shortly after we saw it in late January 2018 so check to see if it is open if you are traveling there anytime soon after this in 2018.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wow!", "Incredible vista of Death Valley. You get a real sense of the extremes of high and low with the combination of the height of this vista, the height of the mountains to the west and the low long valley. The salt flats below are enormous- and this is a completely different perspective than what you get from driving in the valley.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "On our bike trip", "Worth the drive up this steep road to reach the top. the view is quite incredible. Glad it wasn't windy."], ["Reviewed January 20, 2018", 3.0, "Would be better on a clear day", "I didn’t think today was especially cloudy but when you get to Dante’s view I guess you’re high enough to be in low clouds? Anyway for the long and winding drive, I didn’t think the view was worth it. On a clear day I think it’d be much more impressive.\n\nAlso note, it’s quite cold up there so even if the day is warm, take a jacket!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Best view!", "Great view of the salt flat. Went there in late November so temp was perfect. We enjoyed the view a lot better than stopping at Zabriskie's Point. Plenty of parking that day. Road is a steep climb at the very end, recommend stopping at the bathroom on your way down.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Nice view on the flat", "It was normal temperature when we visited. If you go there in the summer you are up for a challenge. Bigger cars/campers can not go all the way up. You will obstruct other traffic on the small winding road and you both cant go anywhere.\n\nI found people like driving faster than allowed over there. Pull over for those speeders and let them pass you.\n\nThe view was nice for a minute of 10. You can walk around a bit but i dont know if that improves your view or just makes you sweat more.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Amazing veiws looking down the valley", "Great place to stop and take it all in. You stand above the valley that seems to stretch on forever. Take a few minutes to soak in the majestic veiws. It’s a great place to enjoy the sunset."], ["Reviewed January 4, 2018", 5.0, "Best view - stop on your way in", "If it's on your way in, stop here first. The view is amazing and will save a trip later to a must see location. Beautiful views!!"], ["Reviewed January 3, 2018", 5.0, "Awesome view from 5000ft to 280ft below sea level", "Definitely a must do. The view from here .. the valley below and the salt flats was just breathtaking. The drive itself was beautiful. But it was cold and windy up there."], ["Reviewed January 1, 2018", 5.0, "Family Review: Must Do at Sunset!", "We got here at 4:15pm which was perfect timing with the sun setting around 5:10pm. The road to get here is a windy 12 miles going uphill. One kid got slightly carsick on the way up. There’s a bathroom about .25 mile before hitting the top. No bathrooms at the top so make sure the kids go before you get there!\n\nUpon arriving, there were lots of people set up with tripods and nice cameras ready to capture the sunset. The view is an overlook of the Badwater Basin and the rest of the Valley below. There are several peaks you can hike to, to hang out and watch the sunset. Bring warm clothes in the winter as it did get chilly up there especially once the sun goes down.\n\nThis is probably the best place to view a sunset in Death Valley!\nShow less"], ["Reviewed January 1, 2018", 4.0, "Great view point", "With limited time spent at Death Valley NP, this is the must stop place to get a feel of the park. It's kind of chilly in the morning but the view is amazing. Well worth the 13-mile drive from the main park road."], ["Reviewed December 31, 2017", 5.0, "Great view", "Dante's View is an observation point, offering a great view, which is more impressive either in am or at the sunset. It could be a great area for hiking."], ["Reviewed December 30, 2017", 5.0, "True, must see viewpoint", "It was the first stop from Las Vegas. Got there almost noon but it was still chilly and windy. It gave a great view of the valley especially bad water basin. The second stop would be Zabriskie point."], ["Reviewed December 22, 2017", 5.0, "Go there!", "Get above the valley for stunning views across its expanse, valley to Panamints. There are side hikes to follow too."], ["Reviewed December 21, 2017", 5.0, "Great view!", "Hitting this and Badwater Basin is a good time. It's right around a mile vertical difference. Fun to look down to the bottom, and from the bottom up."], ["Reviewed December 19, 2017", 5.0, "Breathtaking", "The views from Dante's View are amazing. We went two different times: at sunset which was absolutely beautiful and again the next morning with the different light it was amazing. Very cold and windy in December but well worth the drive."], ["Reviewed December 18, 2017", 5.0, "Absolutely Breathtaking", "Date's View was a fitting grand finale to our trip to Death Valley. The last 1/4 mile drive up to site is moderately steep, and vehicles longer than 25 feet are prohibited."], ["Reviewed December 17, 2017", 5.0, "great views of valley", "Long windy road to the parking lot at the top. Went for sunset. was a little windy and cold up there(december), take jacket, gloves."], ["Reviewed December 17, 2017", 5.0, "Quick drive up for breathtaking views!", "This was one of my favorite stops in Death Valley. Visited with my sisters and spent quite a bit of time here. AMAZING AND BREATHTAKING VIEWS!!! We noticed the temperature drop as soon as we got out of the car. It was a bit chilly. There are two paths you take for pictures. We went to the most common one. My sisters enjoyed it too. Also great for panoramic photos.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Viewpoint!", "The drive to this point makes it mysterious at first. After driving the windy road, you'll finally reach the top. From the top, the view of the park is brilliant! You can see all the way down to the salt flats and beyond. It's lovely during sunset when you're on top. You cannot miss this part of the park!\nShow less"], ["Reviewed December 14, 2017", 5.0, "Surreal", "Dante's View is a 7 mile drive off the main road that goes through Death Valley concluding in a very, very steep, curvy tail to get to the View itself where a parking lot awaits. It is an unbelievable view of the salt flats and the valley stretched out across the distance with mountains rising on the other side. Have never seen anything quite like it. Starkly beautiful, interesting textures and colors- resembles almost what you'd think of as the landscape of the moon. You can view the area directly from the parking lot or take a worn-in slim trail to the left which takes you over a few hills to get a closer view of the valley - not really a trail easily traversed by strollers or wheelchairs. Really gives you an appreciation of the diversity and the beauty of natural Earth.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Thrilling Views", "So opposite to Badwater Basin. When you go to death valley and wonder how a place in this desert can be so chilling after you have already visited Badwater basin where you try to protect yourself from the sun in every possible way you can."], ["Reviewed December 3, 2017", 5.0, "Salt Flats", "Dante's View is actually the specific destination we had in mind when we set out. Absolutely amazing. I suggest you start here so you don't miss it. Great spot for photographs and just to take a moment to appreciate nature and the park on a whole. There is a bit of a walk uphill if you want to venture out a little bit and get a different view/angle - for this, I recommend comfortable footwear.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Amazing Outlook Point", "Phenomenal view showing the white salt flats below and the stunning Mointain ranges surrounding the valleys. An extraordinary sight!"], ["Reviewed November 29, 2017", 5.0, "Fantastic view on the Valley", "A little drive to go there but it is worth while. The view is amazing. Chose the time of the day to get the best colors on sunset or sunrise"], ["Reviewed November 27, 2017", 5.0, "Incredible view", "Definitely worth going here, the view is incredible. Up here you can get a feel of how big the Badwater Basin salt flats truly are."], ["Reviewed November 24, 2017", 4.0, "Open space view", "Easy 14 miles drive (oneway) all the way up to the parking lot. Great view of open space. Flat bad water basin and colorful peaks make a great and beautiful contrast. There are two short hiking trails that may give you even better view."], ["Reviewed November 24, 2017", 5.0, "Must see!!", "Easy drive and breathtaking views. Great view of Badwater and the entire Death Valley basin. Probably on of the top areas we went to to see an overview of the park."], ["Reviewed November 20, 2017", 4.0, "Great Viewpoint!", "We were able to drive all the way up to the parking area which is situated such that almost the whole of death valley can be seen. It looks down on the Badwater salt basins. Certainly a must see vista for anyone touring Death Valley. Probably best photographed when the sun is either rising or setting.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Death Valley Must See", "We stopped here before descending to Death Valley so that we could gain perspective about what we were about to see. The floor is close to 6,000 vertical feet below, which is more than the Colorado River from the North Rim of the Grand Canyon! Take time to hike around if you can; your time on top will be all that more memorable for it.\nShow less"], ["Reviewed November 15, 2017", 4.0, "amazing", "amazing views. hike a little steep for little ones, but don't have to go up hike. Can still take part of the view."], ["Reviewed November 11, 2017", 5.0, "Sweeping view of Badwater", "The best time would be by morning light to early afternoon when the sun lights every detail of the landscape. By dusk, the cold wind will kick up in earnest although it always seems windy there. It's higher in altitude, and it's much cooler up there. Windbreaker would be advisable.\n\nYou have the best sweeping view of Badwater and valley below that I know in the park. It's a bit of a drive which is accessible without 4-wheel drive from HWY 190. There is a length limit due to some narrow turns up near the top. Coming down, I was driving in the first and second gear and riding the break for a good part. If you have a stick shift, this will be a breeze. Allow yourself some driving time.\n\nThere was a family of three strolling down a steep pitch, mom and dad with a 6 year old girl in between, back down to the parking area from a tip top. Sure footed like mountain goats...\n\nThere is a hiking trail (8 miles and good deal of altitude gain) that could be great if you are fit and have all day to spend on it. I have never seen anyone doing that, though.\n\nVault toilet which has my vote as \"The Most Scenic Toilet\" in the area is located on the flat pad right down from the top. Go slow or you will miss it and you are not going have the room to turn back up.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Worth the drive", "Most scenic part of the southern half of Death Valley. It's a good spot for people of all levels of physical ability to appreciate a view. I would advise wearing close-toed shoes if you are going to walk beyond the parking lot."], ["Reviewed November 9, 2017", 5.0, "Truly a Natural Wonder", "We drove to Dante’s View from Vegas and it was our first stop in Death Valley. Majestic, serene and spiritual is the best way to describe it. I think I could of sat there all day just looking at the mountains and valley. Incredible. Go if you can, you won’t be disappointed. Personally, I liked it better than the Grand Canyon.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Two wheels through death valley", "Stayed in Pahrump nv 60 miles to furnace creek near center of death valley national park. Dante's view gives you a great view of bad water basin and surrounding area. Very curvy near top not recommended for large rv's but there are a couple of spots to drop a towed trailer before curvy section.lots of different colors of rock in park .Zerbreski's point is another must stop, mid 70's in november for high's lows in 40's at night.bad water basin is 282 feet below sea level big parking lot and you can walk out on sea bed snow white in color,worth the 13 mile detour and make sure you take artist drive on the way back from bad water basin it's one way and winds through the foothills and back onto the road you turned off of everything is tar road but again not good for large rv's\nShow less"], ["Reviewed November 8, 2017", 5.0, "Breathtaking view over the Death Valley", "Everyone visiting Death Valley should go to Dante's View as their last stop (!), otherwise you'll see the best in the beginning ;-) The vista point gives you a breathtaking 360 degree view over the entire Death Valley and shows its immense dimensions."], ["Reviewed November 5, 2017", 5.0, "Awesome", "Try to get here before it gets mid afternoon so the sun will not be in your field of vision. 22 mi RT but well worth it"], ["Reviewed November 5, 2017", 5.0, "The best...", "This was easily the best thing about Death Valley. You can see for miles and miles and miles. Don't be put off by the drive up there, which from some reviews/guides sounds tricky. It's not that tricky, just pretty steep in places, but it's proper road the whole way - even though at times you do feel that you in the middle of nowhere. Which you are!\nShow less"], ["Reviewed November 4, 2017", 5.0, "Stunning scenery", "We visited Dante's view as part of a road trip which took us through Death Valley: the view down over Badwater Basin is amazing and the drive to Dante's view takes in some breathtaking scenery. We fell a little in love with Death Valley on this trip and are planning a return visit.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Must see", "You must park up and hike to see this phenomenal view. There isn't a better view anywhere in the park."], ["Reviewed October 30, 2017", 5.0, "TOP 1 in Death Valley", "For us, this was one of the best or at least one of the best spots in Death Valley. The highest view into several directions. You could also see Badwater. Absolutely worth the 20 minutes \"detour\" from the main road to Las Vegas.\n\nYou should definitely not miss this!\nShow less"], ["Reviewed October 20, 2017", 5.0, "A long way in and out but worth it", "Not a loop road so be prepared to drive a long way in and same again out but the view is not to be missed.\n\nYou can walk up the hill or walk down to the tip. We chose to walk down to the tip for the view of the valley. Amazing.\n\nShow less"], ["Reviewed October 16, 2017", 5.0, "Just Amazing!!!", "Another wonder that is worth a stop off for a photo op in an amazing park. Take the time and check it out."], ["Reviewed October 16, 2017", 4.0, "Great Views", "Entering DV from the east, this is the first point at which you get a view, (it's actually a turn off south a few miles before entering the valley). Impressive view down the valley, which gives you an idea of scale before descending."], ["Reviewed October 15, 2017", 4.0, "Add to your DV stops", "Beautiful view even though the day we went was hazy. Worth adding to your stops in DV. Don't forget your jacket though."], ["Reviewed October 15, 2017", 5.0, "Scenic view!", "Exploring some parts of the Death Valley we stopped at Dante's View too and enjoyed the scenic view. As we were there around noon it was way too hot to stay long outside the car. Back home I read the recommendation to visit this site early in the morning.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Make sure to go down to Badwater and look up, too!", "Fantastic view in Death Valley! It's a bit out of the way of other attractions in Death Valley, but very worth the detour!"], ["Reviewed October 13, 2017", 5.0, "Beautiful view", "Worth the stop, the views in this area are incredible. The road is winding and fun to drive, and lots of beautiful views along the way!"], ["Reviewed October 13, 2017", 5.0, "Perfect Place to Start / End The Day.", "This was the pinnacle of our one day visit to Death Valley. I must say I'm glad we saw it last because it was the most spectacular view in the park and there were many.\n\nTake the path North to Dante's View although there are other great views to be had at two locations to the south.\n\nGreat Place to watch the sunset and the stars come out.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Terrific View Point in Death Valley", "We did this side trip on our way out of the park. It is terrific, and well worth the time to ascend to this spectacular viewpoint."], ["Reviewed October 11, 2017", 5.0, "You must go there. Amazing view of Death Valley", "This is about a half hour drive south from Furnace Creek. About 15 minutes is on a narrow, windy paved road that leads up, up, up to the top. You feel like you are on the top of the world from up there. Bring good shoes and water, and hike out 10 to 15 minutes along the rim trail to the very edge. Amazing view!!! Try to time you visit for sunset for the best experience.\nShow less"], ["Reviewed October 5, 2017", 5.0, "First thing/Last thing", "Dante's View should be the first thing you see if you enter the park from Nevada or the last thing if you enter from California, but don't miss it. The views are spectacular. The peak overlooks Badwater which is the lowest point in North America. Great photo spot.\nAllow 40-45 minutes each way. Parts of the road are steep and winding, but overall not too bad. Paved all the way.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Don't Miss This Absolutely Gorgeous View!", "A simply breathtaking view from this vantage spot, the highest driveable point in the park. You can see the salt flats in Badwater Basin in the valley and Telescope Peak and the Black Mountains. It is the best viewpoint to take some gorgeous panoramic pictures of the park.\n\nThis was our first stop in Death Valley on our one day road trip from Vegas. It is a bit of a detour off the main road but it is really a “Can’t Miss” photo stop. Highly recommend you stop here first, then backtrack down the road to get to the other points of interest. It is beautiful first thing in the morning, and the temperatures are still reasonable.\n\nThis should be a “Must Do” on your list of places to visit in Death Valley.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Unforgettable point of view of the Valley!", "At 5000ft (1800 meters), Dante's View offers a dramatic view of the Valley. In front of you there is Badwater, the lowest place in North America, the Panamint Springs mountains system at the background (including the highest peak in U.S.) and all the Valley proper.\n\nYou will want to stay there forever enjoying the sighting.\n\nWe visited the Park in Summer and at Dante's View the temperature was 90F (32C), \"cool\" thanks to the height.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Great views of the bottom of Death Valley from a height", "Fantastic panoramic views of the bottom of Death Valley - great on a clear day - you can see for miles"], ["Reviewed September 24, 2017", 5.0, "What a View", "My friends can not understand why I would take a day from Vegas to visit Death Valley...Are they missing out. About as 2 + hour visit is well worth the drive. We arrive in middle September to 77 degree's making it very enjoyable. On the way out it was up to 90. Dante's view in my opinion should be the first stop. The drive up is well worth the view. Although we did not get to see everything, what we did see was well worth it. This was are first stop of the day as we arrived thru Pahrump where you should fill up even if you think you don't need it. Buy water if you did not bring it with you.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Amazing views at night", "By going to Dante's View you'll understand why you can see so many more stars, and the milky way from such a point of isolation. In addition, be sure to pack clothing for both extremes..... light cloths for the desert floor. hoodies and sweats for the mountain tops. Have fun.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Stargazing spot", "If you were looking for a good spot to do some stargazing this is the place you want to be. The view of the stars in death Valley are truly unbelievable. If you do nothing else in Death Valley be sure and check out the stars from this point, you will never forget it.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Visit!", "Worth the drive and a good car park. Fantastic and unique views. There is a safe short walk from the car park and good information boards. Glad we don't d it."], ["Reviewed September 19, 2017", 5.0, "Ranted View Death Valley", "Amazing to see this area , Death Valley surprised us, there was so much more than we expected just great"], ["Reviewed September 15, 2017", 5.0, "Breath taking view", "A long climb with twisting bends near the summit, leads to a large car park. From here the view into the basin is amazing. There is a short walk to a look out point, but beware of loose gravel and stones, there is no protective barrier. There are no facilities, but as you leave the car park there is a toilet a few hundred yards on the right. A great way to get the feel for the size of the park.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Really stunning views", "Head here early and make sure to take the short walk to the best views, a little steep & rocky but take care and it's easy. Beautiful views and it's much cooler than Badwater due to the elevation. Restroom available here too."], ["Reviewed September 8, 2017", 5.0, "Great place to start DV trip", "This is a great place to start off Death Valley. First it's cooler than the rest of the park as it's at a higher altitude. Sweeping views of the valley and various places that you will see while driving through the valley. The view of the basin is pretty awesome too. Bit of a detour but totally worth it. Like any place in DV, take plenty of water!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Fantastic views", "The first stop on out drive through Death Valley. A good place to start as you get great views over places you'll visit later on. Bring water!"], ["Reviewed September 4, 2017", 5.0, "Excellent view of the whole valley", "This is the perfect place to get a whole view of Death Valley and it's a nice drive up. There are a couple of places to hike to for even slightly higher views that are great for different vantage points."], ["Reviewed September 4, 2017", 5.0, "An amazing view of Death Valley", "Worth the view! At the visitor center I was told that as I only had one day and considering I was going to LA that this could be left out. I didn't agree and decided to go. Glad I did!"], ["Reviewed August 30, 2017", 5.0, "Astounding!", "This is the place to enjoy a magnificent view of the valley before going down to enjoy it from closer. Be aware that in summer the heat becomes unbearable and makes the hike routes of the part very demanding after 10:00 AM, so if you plant to do some hiking, consider visit this point as the end of your visit instead of the ending.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Awesome Views from Dante's View (Death Valley National Park)", "From Dante's View, we liked the views of Death Valley. Its close to the Badwater area and in the Black Mountain area of the park. Dante's viewpoint is at 5,476 feet."], ["Reviewed August 27, 2017", 5.0, "Great Vantage point to view entire Death Valley", "Enjoyable, Challenging drive to the top - the last mile had an interesting twists and turns; great view from the top, try during Sunset or Sunrise for the added effect (I guess mid-day would be too hot to enjoy anything) - it was chilly at the top, even though Death valley was 90 degrees! plan to spend about 1 hour at the top, walking around, view from different angles; hike a bit etc.; Bring a good camera and binoculars if possible.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Best View of the Badwater Basin", "This view point offers the most unique view of the Badwater Basin/Amargosa Valley, some almost 6000ft above sea level. The expansive and meandering salt flats are most appreciated from this vantage point.\n\nThe park fee is $11, and well worth it. The drive up to the point is at times a bit scary-the lanes are narrow, steep, and with oncoming traffic, it can be nerve wracking, but the views as you drive along to the point are just as breathtaking as once you're at the top!\n\nThe bathrooms along the way were outhouse style and not very clean, though for a park, it's pretty average.\n\nOnce you arrive at the top there is a large paved parking area and foot trails to the left and right that lead you along the top of the mountain for a more panoramic view. The trails are easy to traverse and require very little effort.\nShow less"], ["Reviewed August 24, 2017", 4.0, "A sight to behold", "I guess we went on the wrong day to Death Valley? There were some tourists with very bad etiquette, geez. In any case, that probably won’t happen to you so get there full of expectations and once you get there be prepared to be amazed beyond your expectations. It truly is a sight to behold. If there are other unruly tourists there, just wait it out if you can. We went in July and we couldn’t wait it out as it was just too unbearable.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Amazing", "A drive, and then a small hike to get to the top of this will give you amazing views all around the valley of Death Valley and across the other side. Unfortunately no pics from me as camera battery ran out but I'm including some other pics from Death Valley.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Shouldn't be missed!", "We only hiked a little bit up there, but it was further than we've seen others go on our visit. Up and down path goes along, offering different view angles of the valley down below. The drive is totally worth the views. Go for it!"], ["Reviewed August 18, 2017", 5.0, "Stunning, a Must See in your Lifetime", "I am very lucky in that I was raised in California and still live here so I have had the pleasure of going to Death Valley many times in my life. Each time I go, I find something new, or I see something amazing. The area gives you a true feeling of peace and you will see that you are but a speck on this planet, the Valley can kill you, if you are not careful and it will also hug you and give you a feeling of calm better than any drink or drug you have ever had.\n\nDante's View is spectacular with views as far as the eye can see. You will drive a while to get there and it is worth it. Make sure your car is in great shape--you do not want to break down in Death Valley-and take water, ever if you have no intention of leaving your car. Be prepared, it can be hotter than anything you can imagine and it can catch up to you and your car fast.\n\nDante's View is at the top of the Black Mountains and it will take your breath away. All of Death Valley will. You can drive up and park and take photos or a break or you can hike and if you decide to hike make sure you know what you are doing.\n\nIf I were you I would go to the Official Death Valley web site and check weather and closures, flash flood can harsh your entire mellow and if it is close to 120 degrees (considering the heat index) , this is information you will need.\n\nYou can also go at night and the stars will just send you into another world. Put on some great music and just sit.\n\nEnjoy.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Fantastic", "This is well worth the drive. Good road. And once you arrive it is easy to walk to the point. Excellent view of the valley. Very colorful. There are signs about bees on the lookout point but we did not see any at all. Great for looking at the sky at night as well. The only problem is that the smog of Southern California casts a fairly heavy haze over the area most of the year. If you are lucky the wind may be blowing and slow for a crisper view. Definitely a place to go.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Amazing", "It was a really jaw dropping view a definite place to goto if you are in the area not many people there when we arrived around 1pm"], ["Reviewed August 12, 2017", 5.0, "The BEST View in Death Valley", "Dante's View is (in my opinion) the best view in Death Valley. The drive to the viewpoint is a bit long and winds up the hill, but it is worth the time. Take some time up at the overlook to hike out a bit on the ridge for even better perspectives.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Great views but fairly poor visibility", "The views from here are magnificent but on the day we visited the visibility was not great due to dust reducing the distance we could see. We could see a fair distance but there was a distinct haziness. Still great though."], ["Reviewed August 6, 2017", 5.0, "Spectacular STARGAZING after dark", "My son, dog and I drove up from the Longstreet Hotel and Casino (40 minute drive) at dusk and arrived at the view about 15 minutes after sunset. Seemed like dozens of cars were coming down after sunset, which I am sure was pretty but I felt like telling them the real show was still to come. Sure enough once the sky started to get dark your eyes were welcomed to an amazing show. Stars lined the sky from one horizon to the other. As it got darker and darker you actually began to see the clouds of the Milky Way galaxy, just as clearly as pictures from NASA. Being able to see this with your own eyes is a once in a lifetime experience. Don't miss it!\nShow less"], ["Reviewed August 6, 2017", 5.0, "Hot, Desolate and Out of This World", "After a long drive we came upon this viewpoint and it is worth the trip. Death Valley is beautiful and very very hot, obviously."], ["Reviewed July 31, 2017", 5.0, "Otherworldly view", "This has to be a detour to take when driving in to Death Valley from Vegas. It is a sensational view and with the extensive salt flats below it looks like a view on another planet. From the parking area there are a couple of easy walks to little outcrops. They don't change the view much but stretching the legs is welcome. We went in early May and it was nice to see quite a varied selection of wild flowers in bloom which we had not expected.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Spectacular views", "The drive up is fun and when you get to the upper car park the views are breathtaking.\n\nYou can get out and walk for 1km or so to get away from the car park and it's worthwhile, we didn't do the full walk cos we have a two year old but with kids a little older it should be no problem.\n\nIt's worth the drive in and out.\nShow less"], ["Reviewed July 29, 2017", 5.0, "A must see!", "A bit of a journey from Stovepipe Wells but an amazing view. You can snap pictures here all day long."], ["Reviewed July 19, 2017", 5.0, "Beautiful, but beware of bees!", "Totally worth the trek up here. If you're a Star Wars fan, this is the same scene that shows Mos Eisley, and it's fun to compare the movie to real life. BUT, be careful of the bees. My teenage daughter got stung, which put a damper on our trip. Gorgeous view.....and the temps are lower than the valley, so it was a nice escape from the 120 degrees below....to only about 98 above.\nShow less"], ["Reviewed July 19, 2017", 5.0, "The most amazing view down the valley!", "We loved this view of the valley it was amazing to see all the formations and expecially the \"salt\" flats of white laying there ahead of us!"], ["Reviewed July 10, 2017", 5.0, "Best view in Death Valley", "Dante's View is viewpoint at 1,669m offering a panoramic view of the southern Death Valley basin. The road leading there is a sand road in good condition with a lot of turns towards the end and the drive from road 190 to the viewpoint takes around 20 minutes. We came here around 2PM. The sun was shining but due to the wind the air wasn't too hot. There is a parking lot up the hill and from there you can take around 300 meter path up to the north to get the best view. A must if you visit Death Valley.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Gorgeous view, cooler temps!", "Dante's View is easy to get you... you get to drive! Large vehicles (campers and trucks) may have to park and the occupants make the climb to the overlook, but it is well worth the effort! From the top, you are treated to views of the surrounding mountains, Badwater Basin, and endless skies. And because the elevation is much higher, temperatures are cooler and breezes plentiful!\nShow less"], ["Reviewed July 10, 2017", 5.0, "Agreed - great view", "Went near sunset, was not disappointed. 13 miles off main road, some of it twisting and steep. Maybe obvious to others but wanted to add this observation...this is a grand vista, not much to see up close (except a jackrabbit, briefly)...but still, awesome!"], ["Reviewed July 5, 2017", 5.0, "Incredible Experience", "We visited during November. The temperature was bearable. It was an amazing experience. The views are beyond description and will exceed anyone's expectations. I feel fortunate that I had the opportunity to add this to my list of experience."], ["Reviewed June 30, 2017", 5.0, "Beautiful Sunset, but watch out for bees", "The drive up to Dante's Point is amazing. The view was even more remarkable. We enjoyed watching the sunset, but watch out for the bees."], ["Reviewed June 30, 2017", 4.0, "Worth it", "this was our first stop after entering the park. Great shots of Badwater below. I'm not a hiker but plenty of people were"], ["Reviewed June 30, 2017", 5.0, "A view like no other - totally breathtaking", "If you've gone to all the considerable effort to get to Death Valley, you've really got to want to see it, so trust me when I say that first view will take your breath away and make the journey worthwhile. It is simply stunning. A real WOW moment.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Incredible!", "Dante's View is a must see if you're passing through Death Valley. It's a little de-tour off the main road but don't let that put you off - it's so, so worth it. The views here are absolutely incredible. Make sure you bring that camera and tripod!\nShow less"], ["Reviewed June 27, 2017", 5.0, "Sunset at Dante's View", "If you're going to be at Death Valley until sunset, make sure you check out Dante's View. The sunset looks amazing from up there. The road to Dante's View is relatively steep and has some sharp turns, if I remember correctly. The road is narrow too so follow the speed limit. We got there a little late so it was a bit dark, but the view was still fantastic (see photo). It's significantly colder up there, especially at sunset. It's quite windy too! I had to leave my cap in the car as I was afraid it would blow away. There was a man there who lost a bunch of papers/documents because of the strong wind. I hope they were not too important. Dante's View is also a great place to look at stars; we saw a ton of them on our way back home.\n\nA few general tips for Death Valley:\n- Death Valley holds the record for the highest reliably recorded air temperature in the world (134°F / 56.7°C). Therefore, make sure you have lots of food and especially water. Wear breathable clothes.\n- If your car doesn't have a GPS, use real maps or offline Google maps since you won't be able to connect to the internet. We used offline Google maps.\n- Bring a nice camera so you get some unforgettable photos!\n\nAbout our road trip:\n- 3 friends, 8 days, 14 states, and over 5000 miles.\n- Since we knew our trip would be very hectic, we only visited what we thought were the best places at each location.\nShow less"], ["Reviewed June 25, 2017", 5.0, "worth a short hike", "We took the short hike up the hill after parking at the top. Was worth it. We went at dusk and happened to catch the sunset. It is setting directly behind the mountains opposite the parking site, so is a very good place to see the sunset from that perspective.\nShow less"], ["Reviewed June 24, 2017", 5.0, "Of all the views in Death Valley, this one takes the cake!", "If you are looking for a scenic viewpoint to stop in when visiting Death Valley NP, Dante's View is a can't miss! Although there is not much up there in the way of hiking, you have a perfect view of the mountains and the salt flats below, and can see the park for miles. It has an other-worldly feel that makes you feel like you are on another planet- how can something this beautiful be on planet Earth? We took some of the best photos from our trip there. You wont be disappointed with Dante's View, I promise.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Death Valley 1 day tour (3rd day of park trip)", "This was the third stop on our 3-day park tour (Yosemite-Sequoia-Death Valley). And being a bit disappointed with Yosemite (see my first review) and totally impressed by Sequoia (see my second review) I was eager to see a scenery change and weather change. First two parks were pretty cold.\nAnd what I saw was stunning. It reminded me of the Mars planet. We have passed several abandoned villages, train stations, cargo trains and more. We drove through the dessert to reach our hotel that reminded me of an oasis (see my review of Furnace Creek Ranch hotel).\nNext morning we had a guided individual tour which is a must if you want to take the utmost of the park within one day. We visited several places like Zabriski point, sand dunes, art passage with different color mountains, salt lakes and more. And all of that was definitely worth many hours of driving. Unique place and is a must see.\nSee photos made with my Relonch camera to get a better impression.\nShow less"], ["Reviewed June 22, 2017", 5.0, "Beautiful View....Caution There Are Bees!", "After a long drive the last 1/2 mile is a twisting blind section that opens up in the parking lot over looking Dante's View. The view of Death Valley from above is beautiful and with the heat breath taking. There are signs warning of the bees in the parking area. There are lots of bees buzzing around so if you have an allergy to them be careful. You can take a short hike to the point for better views of the area. Caution...temp was 120.\nShow less"], ["Reviewed June 19, 2017", 4.0, "Worth it for the big picture", "If you want to see all of Death Valley,,or most of it,,drive up here. You will look down upon the white salt flats and see it from above. The NP serive will say no large vehicles or campers up there,,but some tried. The road is pretty narrow and some points adn a lot of switchbacks. I beleive this is the highest point you can drive to in the valley and the Temps are like 20 or more degrees cooler then down below. Also, your cell phone will light up because there is aonly 2 palces you can get a signal and this is one of them.\n\nPS: If you like Star Wars, primarily Episode IV from 1977, this is part of your SW tours. This is the place Luke and Obiwan looked down on the Mos Eisley spaceport which was put in on top of the white desert by movie magic. There were maybe 7 places Episode 4 was fimed at in DV.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Thrilling", "Dante's View has to be one of the decisions i have made on my Vegas trip\n\nThis spot is a little over two hours from Las Vegas. One of the most breathtaking view i have seen. A very enjoyable and amazing drive. Very quiet and peaceful.\nThis is also one of the best locations for stargazers.\nTips:\n1. The nearest gas station is about 60 miles, in Pahrump, Nevada. Last 35-40 mils has no civilization at all. Make sure you car is topped up.\n2. Carry enough water and food. If you are planning to go there during summers, carry plenty of water and food. There's a reason why this place is called the \"death valley\". The area around this place can get really hot (111F)\n3. No cellphone reception - plan to spend the drive n complete communication darkness. I had a few bars at the location but i had no coverage for the most part. If people would be worried about you, let them know you are going into communication darkness. If you are planning to rely on you phone's GPS, don't. Carry old style GPS units, paper maps, car's in built GPS etc.\n4. Dante's view is considerably cooler and windier than the bottom. Dress up accordingly.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Stunning", "Everywhere you look is awesome to behold. The sights (and the heat ) will take your breath away. If you're anywhere near Death Valley National Park, it is well worth driving through"], ["Reviewed June 10, 2017", 4.0, "Impressive View", "Great panoramic view across the valley and well worth taking the drive to the summit.\n\nI would suggest a visit at sunrise or sunset when the view is at its most impressive. Although cooler than the valley floor it can still get very hot during the day.\n\nModerate walks near the summit are options but not essential to enjoy the view.\nShow less"], ["Reviewed June 9, 2017", 5.0, "Easy Diversion", "Paved road to a great view, and much cooler temps. You can see Badwater, Salt Creek, and much of the southern valley. Well worth the drive!"], ["Reviewed June 5, 2017", 5.0, "Beautiful view from Dante's View", "Take the time to walk out on the trail that goes along the ridge of the mountain from the parking lot....it's well worth the walk."], ["Reviewed June 4, 2017", 5.0, "Breathtaking Views", "We drove the 15 miles or so to the viewing area in late afternoon. The views of Death Valley are mesmerizing and awesome. As we where there in the late afternoon, photography wasn't at it's best due to the sun angle. We returned the following morning and was even more mesmerized. The photography was much better. There is a trail that leads out to a point on the left side of the parking lot. A worth while 10 minute walk. A little up and down, but nothing to stressful. You will be 5500 feet, and the temperature can be cool, so bring a light jacket just incase.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Amazing view", "I have been to Dante's View twice now...once in the heat of the day in May and once at sunset as a storm moved in in the fall---both experiences were amazing. I don't think there would ever be a bad time to visit. The temps are lower up there than in the valet below, so it can get chilly in the evening, but it is a great break from the heat in the summer. You take the long drive up and enjoy the view--nice signs to read about the area and some trails if you want to walk around a bit more than just the parking lot. Bring your camera!\nShow less"], ["Reviewed June 1, 2017", 5.0, "Mesmerizing View", "If you are in Vegas and have a day to spare, ensure you add Death Valley to your itinerary. It's a must visit destination and have plenty of places to visit, if you love nature.\n\nWe were awestruck by Dante's view and as the weather was nice, we didn't felt hot for the short hike that we did. Overall you can spare around couple of hours at this location, if you wish to hike.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Awesome!", "Take a quick ride up here before going to badwater. Amazing view of the valley and surrounding mountains!"], ["Reviewed May 31, 2017", 5.0, "Beautiful overview but do the climb in cool weather", "Was a great way to kick off our tour of national parks. Breathtaking views of the valley. Climb was moderate for us older people. Worth the effort to get good shots of a unique place on earth."], ["Reviewed May 29, 2017", 5.0, "What a view!", "Stunning, stunning, stunning! Drove through DV from Bishop/395 to LV in 1 day. Loved every minute of this. Coming from Lake Tahoe the day before, the temperature went from -12 to 84 in a day."], ["Reviewed May 27, 2017", 5.0, "Favorite", "Our favorite sight in the park. Easy parking. Easy hike, fantastic view overlooking Badwater. Much cooler up at Dantes compared to Badwater. Can't miss this site when visiting DVNP"], ["Reviewed May 26, 2017", 5.0, "Awesome views", "Awesome views out here ! You can hike here and take it that much further for stellar views ! It's usually pretty hot so make sure to have water with you and sub screen ! It's worth the drive"], ["Reviewed May 25, 2017", 5.0, "Best View", "This was hands down in our opinion the best view of the park. You can see for miles and miles. Super amazing view. You can see the pictures but it's nothing like being there. It's a must visit if you're in the park!"], ["Reviewed May 25, 2017", 5.0, "Long drive but great views", "Best views in the park. Long winding road to get there but worth it, especially if you are entering or leaving the park in this direction"], ["Reviewed May 25, 2017", 5.0, "Excelent View", "It's a long drive out to the point, and a very steep road at the end. No trailers are allowed. The long distant view is worth it."], ["Reviewed May 23, 2017", 5.0, "Views are worth the drive up and the little hike out.", "We parked and walked down the path where many others travel to get a bit closer to the valley and away from the parking area. The views of the valley and salt flats and all are very beautiful and amazing. It is worth driving the little bit out of the way to make the trip here.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Incredible view of bad water basin and Panamint range of mountains.", "Highly recommend going to this site. Last bit of drive up to Dante' view has very tight turns but not too difficult. No wonder is #1 recommended place to see in DVNP."], ["Reviewed May 22, 2017", 5.0, "Definitely worth a stop!", "The view is just amazing! If you're in the area make a point of driving up to this point and checking out the view from Dante's!"], ["Reviewed May 20, 2017", 5.0, "Amazing outlook", "The outlook from Dante's View is amazing. From the parking lot you can take a little trail to a hilltop or just have a look from the parking. Below Dante's View you see the white salt of Badwater. Just gorgeous."], ["Reviewed May 18, 2017", 5.0, "Beautiful", "This was our last stop and little did we know, we saved the best for last. Gorgeous views and cooler temps made for a great conclusion to our visit to Death Valley. It was also a welcome sight to see wildflowers after a day of nothing but rocks & sand!\nShow less"], ["Reviewed May 18, 2017", 5.0, "Great view", "Very impressive. Panoramic. Don't miss. Easy access. Can see all the various elements that comprise Death Valley."], ["Reviewed May 18, 2017", 4.0, "Sunset", "We visited here to watch the sunset. The views are amazing and the colours change so dramatically as the sun sets. There was quite a multi cultural crowd there doing the same as us, but that didn't spoil the atmosphere."], ["Reviewed May 17, 2017", 3.0, "Great view even when hazy", "The drive up is winding but fun if you enjoy that type of driving. It is windy and cold at the top. There are couple hikes that can be done to outcrops. The view is pretty over the badwater basin. It was hazy when I went but still worth it.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Dantes point.", "It's breathtaking view. Looking down the valley is very beautiful. I went up in late afternoon, and I loved it."], ["Reviewed May 13, 2017", 4.0, "The trip is worth it!", "Driving all the way up the mountain, on serpentine roads bring you to this vision of the desert floor. How can it be described? I don't want to begin to tell you, you will have to decide for yourself. When the sun is shining on it, or there is a cloudy or rainy day the vista changes. It is all worth the trip.\nShow less"], ["Reviewed May 12, 2017", 5.0, "What a view.", "It is a long ride but worth it. The last 10 minutes of the ride is a tight switch back roadway. The temp drops a lot and is windy, but the view, ahhh."], ["Reviewed May 11, 2017", 5.0, "Breathtaking views from high to low.", "It's a slow, winding road up, but well worth the drive! It will take about 15-20 minutes from Furnace Creek Wash Rd. Once you arrive, you can look down see the salt flats in Badwater Basin, the lowest point in the contiguous United States (-282 ft below sea level) or look across at Mt. Whitney (14,505 feet above sea level).\nThere are several great hiking trails as well as being a photographers paradise of panoramic views. There is also posted information about the site itself, how it came to be, and what you would see during the day or nighttime views.\nShow less"], ["Reviewed May 10, 2017", 5.0, "Gorgeous View!", "A very special place. Especially at dawn. It's quite a ride up to it-- about 13 miles so one needs to leave wherever one is staying early in the morning. Also nice at sunset. It's a must see in Death Valley."], ["Reviewed May 9, 2017", 5.0, "Breathing taking view", "Vast valley beneath you. Short hikes around the cliff. Could be very windy. Nice spot to eat a snack, or to meditate."], ["Reviewed May 8, 2017", 5.0, "Magic, Really Magic", "Who would think that a valley names \"Death\" would be so beautiful. Dante's view if one of the many ways to see the glory of Death Valley. Be sure to include this view in the many view you must take."], ["Reviewed May 7, 2017", 5.0, "An awesome view of the natural beauty of Death Valley!", "Dante's view is at 5475 feet above sea level, directly above Badwater, the lowest place at -282 feet below sea level, in America. Across Death valley you can see Telescope Peak the highest point, 11049 feet, in the Panamint Range. The view makes one wonder what those traveling by wagon felt when they arrived in the valley below. This is well worth the time to experience the grandeur of this National Park.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Beautiful view", "Dante s view is a great overlook of the valley. I would definitely advise to get there early morning to watch the sun rise ! Be careful though because it can be cold and windy at this time if the day. Be sure to bring a warm jacket.\nShow less"], ["Reviewed May 5, 2017", 5.0, "A View worth the drive", "The road to the view is long, but not a terribly difficult drive. At the end you are treated to a vista of what seems to be the whole park. And the day we were there, Badwater was at about 100 degrees, and Dante's View was about 75, so a nice refreshing respite from the heat.\nShow less"], ["Reviewed May 5, 2017", 4.0, "View of Badwater Basin", "You can see the Badwater Basin from the heights of Dante's Peak. Be prepared for the wind and the chill almost any time of the year!\nFrom the parking lot you can walk in either direction for gorgeous views of the basin. To the left, walk out onto a \"peninsula\" or to the right and climb a trail to a pinnacle overlooking the basin.\nAt sunrise or sunset, of course, is the best time to go but do be careful on that road to the peak when it's dark.\nThe views are stunning!\nShow less"], ["Reviewed May 3, 2017", 4.0, "Impressive", "Great views of some unusual landscapes not seen anywgere else. This is weel worth the visitr if you are staying within an hours drive."], ["Reviewed May 2, 2017", 5.0, "Breath taking", "Explore the trails ! Great view of the prehistoric river bed ! Great views of badwater below . Great to see different times of day . Looks so different"], ["Reviewed May 1, 2017", 5.0, "\"MUST SEE\"", "Just so breathtaking. Enjoyed Death Valley so much, going again this year and will be able to spend more time seeing the different sites since we ran out of time last year. Be prepared it does get hot."], ["Reviewed April 29, 2017", 5.0, "Simply beautiful, not to miss", "Not sure what else can be said about this site other than incredible and a must-see. Had it not been for this being our first stop in DV we would've spent more time admiring the views.\n\nHelpful info if you're going- we drove a sedan and did fine on the drive up which consisted of short, quick turns. There was a cyclist ahead of us so we had to wait till the opposite lane was in the clear and not around a curve to pass him up. Much props to him as that was a pretty strenuous ride for him, i'm sure. It's a short walk/hike from the parking lot and really you don't have to keep walking even when the trail keeps going as the views are the same, but depending on your activity level i'd say it's a moderate in difficulty. It gets pretty windy but the weather was pleasant at the time of our visit. There are restrooms in this site.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Go there", "This is a place you could walk up to and down without really looking at the colors, Then you can take the circle (50 yards wide?) walk around the periphery and see everything from mountain ranges far and near and an absolutely incredible view of the Death Valley floor. Presented beautifully and the walk up is a bit strenuous for seniors, but worth the effort.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Spectacular Panoramic View from Dante’s View", "We visited Dante’s View whilst staying at Furnace Creek Ranch about 35 minutes drive away.\nIt is quite a long drive up and towards the end, a rather winding and narrow road, which eventually opens out to a large car park.\nThe drive is highly recommended because the panoramic views, at the top, including the Devils Golf Course Salt Pans and the Mountains including Telescope Peak are spectacular.\nShow less"], ["Reviewed April 27, 2017", 5.0, "National Park Tour", "Earlier in the day we stopped at Bad Water the lowest point in the United States and from Dante's View you can see all of the valley and Bad Water. This is a must see vista well worth the drive. It's also a good place to cool off. The temperature was 69 degrees and 94 degrees at Bad Water.\nShow less"], ["Reviewed April 27, 2017", 5.0, "A bit futher than Zabriksie Point but worth the drive", "It takes about 20 - 30 minutes to drive all the way to Dante's view but it is really incredible to view the Valley from up there. Hiking trails all around for additional exploring. I thought it was worth the drive. Not sure my kids agreed but I am glad we did it.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Excellent views of Death Valley", "Great weaving winding paved road up to the top. The wind blows all the time, the view is spectacular of the salt and bad water and most of Death Valley. Well worth the trip up. One of the iconic views in the park."], ["Reviewed April 24, 2017", 5.0, "Must not miss this if you are in Death Valley", "It takes about half an hour off the main 190 road to get to Dante's View. The last five minutes or so are a steep drive up a winding road. And then your jaw drops when you get out of your car and see the 360 degrees of what appears to be an oil painting but is in reality a view of the valley floor and surrounding multi-colored mountain range.\nShow less"], ["Reviewed April 24, 2017", 5.0, "A view that goes on forever", "This was the last stop on our visit to Death Valley, and I'm glad we chose to see it at the end. It was a final goodbye to such an amazing place. The drive up to the view is somewhat lengthy and uphill all the way. It's almost like driving up to a mountain pass. Watch out for cyclists! The temperature up there is also at least 20 degrees cooler than down below in the valley and very, very windy. The view is amazing though, and you can see for miles and miles. It was kind of fun to point out all the places we had been. As a side note, there are restrooms just below the main parking area.\nShow less"], ["Reviewed April 24, 2017", 5.0, "A view that can't be beat!", "We travelled to Death Valley in March of 2017 and took he road to Dante's View. You will not be disappointed! The view from here is unbeatable!"], ["Reviewed April 23, 2017", 5.0, "Incredible Views", "Dante' s View is just about the nicest view of the many, many we stopped at in the magnificent Death Valley N.P.\nThe views are mesmerising over the salt pans, mountains and valley. It has plenty of room to pull in and all you have to is look out and drink in the scenery. Absolutely amazing.\nShow less"], ["Reviewed April 22, 2017", 5.0, "Gorgeous and Chilly", "We visited Dante's View during our recent visit to Death Valley National Park. It is a beautiful place with wonderful views of the Park. It was very chilly and windy during our visit."], ["Reviewed April 22, 2017", 5.0, "Very worth the drive", "To get a real handle on what you're seeing in Death Valley go up to Dantes View. You can see the entire scope of the fault block ranges that form the valley. Interpretive signs on site in the mini guidebooks available provide you a real education in terms of your view. The drive-up is easy on paved roads. The last quarter-mile was a little steep but not a problem.\nIt is also a cool place on a hot day.\nShow less"], ["Reviewed April 18, 2017", 5.0, "Wonderful view of Death Valley", "We drove in from the east, and made this our first stop in the park, after the DVNP sign of course. It gives you a great view over Death Valley - absolute must-stop."], ["Reviewed April 17, 2017", 5.0, "Amazing and breathtaking views.", "Dante´s View was our first stop in our one day trip to Death Valley. Arrived around 9 am and luckily the crowds have not arrived yet so we got to enjoy the amazing view in quiet. If you are driving from Las Vegas this is the first stop you have to do.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Just when I thought the views would not get better....", "We drove in late afternoon to this spot, and it was definitely worth it. We had been to Badwater earlier in the day, so the alternate view of the Valley and contrast was amazing.Wear good shoes to walk out on the cliff path. I read other reviews in this site and agree with the positive ones\nShow less"], ["Reviewed April 15, 2017", 5.0, "Right at the entrance to Death Valley on the east side", "This takes about 15 minutes to drive out to. You can leave your trailer a couple of places on the road out to Dante's View--you are better off leaving it at the bottom. The last part is very narrow and winding. The road is paved the whole way. The view is very spectacular and informative. There are a few hiking trails in the area. Death Valley is a geologists dream! It can be really windy up there.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Family Adventure", "We drove up at 11:00 pm to see the Night sky- was gorgeous. Drove up again in the day time to see the views. Amazing"], ["Reviewed April 15, 2017", 5.0, "Breath taking views", "Very busy at sunrise and sunset so need to get there early. Views are wonderful. Would need a car to access for ease."], ["Reviewed April 14, 2017", 5.0, "Uplifting, colorful, beautiful !!!", "Dante's View provided amazing overlooks and hiking opportunities during our March stay in Death Valley National Park. My husband and I admired the views and lingered for an hour, walking around, looking and photographing. We saw the white salt flats of Badwater Basin far below. We saw mountains afar. Being on a high elevation, Dante's View was cool and breezy. We absolutely adored the attraction and would love to return anytime. We plan to hike the trails in the future return.\nShow less"], ["Reviewed April 13, 2017", 5.0, "Amazing View", "This place is beautiful! There was no end to what you could see no matter what time of day it is. There are paths off the mountain that lead to even better viewpoints than the parking lot. They require minimal walking. There are longer hikes, but to get a beautiful view you don't need to go to far. It gets better as you go on but it's already incredibly beautiful at the parking lot. Dante's view is a must-see in Death Valley.\nShow less"], ["Reviewed April 12, 2017", 4.0, "Best view of borax salt flats", "Death Valley NP is a very large area with many beautiful and/or interesting views. The view from Dante's Peak is very expansive and I place it in the \"interesting\" category because the valley floor below is splotched in whites, greys, and browns creating bizarre patterns. The borax has leached from the rocks and soil to settle on the surface -- a great teaching moment for children. It can get very windy and cool at the top of the mountain.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Almost Missed This!", "We had a dust storm on the afternoon of one of our two full days in Death Valley and had to spend the afternoon at the hotel as the visibility was close to zero. We had not gotten to Dante's View and are plan was to leave the valley on our check out morning. We decided that we would get a later start and go back to see Dante's View...So GLAD we did. It really is the WOW spot in Death Valley and it would have nagged at me forever if we had not make the trek up that mountain to get that view! You can drive up and have a fantastic view without much effort. If you want a better view you can walk out a little ways from the paved area but we did not do this. This vantage point gives you a real perspective on how big and deep Death Valley really is! Don't miss it!\nShow less"], ["Reviewed April 11, 2017", 5.0, "Sunset", "Famous viewpoint for Death Valley . . Gotta do it. . Great view of Death Valley and the Panamint range. There are two trails to get away from the crowds too . . The one on the right . .goes out for 4 miles or more . .check the map. Buttttt great place for a sunset.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Sunrise vantage point", "Get here at least 1/2 hour before sunrise. The view is spectacular with the entire valley visible between the mountain ranges."], ["Reviewed April 7, 2017", 5.0, "Always gorgeous", "Dante's View is a must see at Death Valley. The view is a stunner, and you can see for miles.\nThe drive to the view has lots of twists and some hairpin curves- no RVs allowed near the end.\nMy photos don't do justice to the beauty of the area.\nShow less"], ["Reviewed April 6, 2017", 5.0, "Feast Your Eyes and Beat the Heat", "This site deserves its popularity because it is one of the three best places to get a stunning panoramic view of the valley. Temps in late March were in the low 30s. The drive to the lookout is steep but can be made with any standard vehicle. Didn't get the chance to enjoy the sunset and stargazing here, but I'm sure the views would defy description.\nShow less"], ["Reviewed April 5, 2017", 5.0, "Good view of whole Death Valley from here.", "We went to Dante's View on April 1, 2017 at about 11:00am. The view of the Death Valley was spectacular from here. In April, the mountains west of the Death Valley was snow capped in contrast to the red, brown and grayish mountains of Death Valley. You can see the whole Badwater salt flats from this location. It was windy and chilly on that day and we had to wear our jackets.\nShow less"], ["Reviewed April 5, 2017", 5.0, "What a great motorcycle ride", "We travelled from Vegas to Death Valley. But we had little time in the park. So like everyone has said, if you have only one thing to see, you see Dante's Peak. Wow. What a thrill. Not only are the roads awesome by bike, the the scenery is just awesome. A must for sure.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Panoramic view of death valley", "We told the ranger that we had a half a day and what one one of the must see sights in the park. He steered us to Dantes View. This is one of those vistas that - in my opinion - cannot be captured adequately by the average photo. In each direction you turn there is a differing scene. It was only a bit out of the way and well worth the investment of time.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Worth the drive up", "The drive up was great and the view when you get there is amazing. You really get the perspective of the dry flat basin."], ["Reviewed April 3, 2017", 5.0, "Try for sunset", "Got to park just in time to buy our pass and head up the 13 mile winding road to dantes peak. We arrived at 5.30 which gave us time to do the different view points that you can walk to ,which were great ,but at 6.30 we just sat on the tailgate of our truck at watched the sun set over the mountains. Fabulous views of badwater ,the mountains and if you stay long enough the stars are incredibly bright. Parking lot was full,so a slower ride down\n.\nShow less"], ["Reviewed April 1, 2017", 4.0, "Wonderful panoramic view of the valley and surrounding mountains", "It is a long drive to the View and road gets steep and windy at the end. Only suppose to be for cars but of course some RV's drive up and cause problems. Guess the Park Rangers are too busy to regulate this. View at the top is great and some nice trails to adjacent peaks that are not too long.\nShow less"], ["Reviewed March 30, 2017", 5.0, "Windy ride", "If you or someone in your car is prone to car sickness, beware, it's a steep and windy ride, but the view is spectacular and there's lots of opportunity to stretch your legs along a unique walk."], ["Reviewed March 30, 2017", 5.0, "Magnificent view", "This is definitely a vantage point worth driving up to . The information sign helps you put it into perspective and gives you names of the surrounding sights"], ["Reviewed March 29, 2017", 5.0, "Fantastic view.", "If Dante Alberghetti had seen this view, he would have added more to his Inferno. Beautiful scenery and sunshine and fresh air."], ["Reviewed March 29, 2017", 5.0, "The best views in Death Valley", "If you're planning a trip to Death Valley this is absolutely one of the best places to go. The views are simply spectacular, from the mountain ranges down to the Badwater Basin at the bottom of the valley."], ["Reviewed March 29, 2017", 4.0, "Dante's view", "There is a spectacular view from here. You can see the salt flats below at Badwater Basin with the pathway below from the road out onto the flats. There are several points from which to view. They say all of Las Vegas can fit into the salt flats.Be prepared\nfor the wind which was 20-30 knots when we were there.\nShow less"], ["Reviewed March 28, 2017", 5.0, "Absolutely stunning view of the Death Valley NP", "The view from Dante's View point is breathtaking. We were there in March and the weather was a bit cold and the wind can get quite strong so dress warmly. The drive up to the top can be taxing for autos that might be under powered.The view more than made up for any discomfort as you can see so much of the spectacular valley and the mountains surrounding the park.\nShow less"], ["Reviewed March 28, 2017", 5.0, "Cool lookout", "This was our first stop in the park. It was nice to get the view of Badwater before heading down there. I noticed the sign warning about bees and thought it was a joke. They didn't bother, but I could hear the hum of (lots of) them as soon as I got out of the car!\nShow less"], ["Reviewed March 27, 2017", 5.0, "Great view, well worth the trip!", "13 mile detour off 190, but this offers a beautiful view of Death Valley and is a must see. Steep ascent at the end, but not too bad. Great location!!"], ["Reviewed March 27, 2017", 5.0, "Takes your breath away!", "A rather twisty ride up but oh so worth it! Amazing view of the Valley especially at sunset. Quite a few degrees colder so bring a wrap."], ["Reviewed March 26, 2017", 5.0, "Amazing view of the valley", "Best place for sunset. The views are amazing from this location. It was cold and windy when we drove up the hill."], ["Reviewed March 23, 2017", 5.0, "The start of our day trip to Death Valley", "We started our day trip here. We drove the 90 minutes from Las Vegas. We already had the National Park Pass, so we didn't have to pay an entry fee. It is quite a drive all the way to the top - not for the faint of heart if you don't like heights. But worth every climbing mile! The views are unparalleled. You can see all the way to the bottom - the lowest point in North America. There are a few trails for you to stretch your legs and then continue on to the next breath-taking site.\nShow less"], ["Reviewed March 22, 2017", 4.0, "Beautiful view anytime of day", "Quick 10min hike on the side of a mountain (watch the kids) to the top of the outlook over the valley."], ["Reviewed March 22, 2017", 5.0, "Spectacular views/windy", "A short drive (10-20 miles) off the main road. The view was spectacular. It was a bit windy. Reminded me almost of Pikes peak haha. My daughters loved it. Definitely worth the drive up there."], ["Reviewed March 21, 2017", 4.0, "A must-see if you haven't", "Take the winding drive up the eastern range overlooking Death Valley and be rewarded with 30 degree cooler temps, an almost one mile drop to the valley floor, and the Panamint Mountains in the distance"], ["Reviewed March 20, 2017", 5.0, "Dante's View", "This was the highlight of our Death Valley trip. 13 miles east of Furnace Creek then 13 miles up the Dante's Peak road. Don't take a trailer. There is a spot to drop off trailers along the road but if it is full you are out of luck and may have a hard time turning around\nShow less"], ["Reviewed March 19, 2017", 5.0, "Truly Amazing View - Windy and Cool when the valley is stifling hot and dry", "This is THE viewpoint, you can see from one end of Death Valley to the other, and all the surrounding mountain peaks too. It's what I call \"the long view\", that overall perspective you don't get from any other location in the park, except maybe if you bagged the Telescope Peak.\n\nThe drive out to the point is long and winding, if you are going for the sunset be sure to allow plenty of time, it is at least 30 minutes from the turn off 190 to the end of the road at the point. If you're early, stroll out one of the ridge top trails to use up time until the sun sets.\n\nTake your time driving back, there are lots of bunny rabbits and little foxes that come out at night along the road.\nShow less"], ["Reviewed March 18, 2017", 5.0, "Amazing view", "You can see Mt. Whitney, highest point in the lower 48, in the far distance and look down on Death Valley, lowest point in the western hemisphere."], ["Reviewed March 18, 2017", 5.0, "Best view in Death Valley!", "We stopped here on our last Day in Death Valley. It was the best view of the week!! The drive up is easy until the last 1/4 mile to the top - steep and windy!"], ["Reviewed March 18, 2017", 5.0, "imagine you arrived here with your mule treck...", "...and this vast, hot, amazing valley gleams in front of you in the hot sun. you know you gotta get through this, to reach, eventually, the gold mining mekka of california. you know you might die down there, stuck with a broken wheel, a donkey dying of thirst. and you make your first step into this hellish bleakness with year and awe.\nShow less"], ["Reviewed March 18, 2017", 5.0, "A Must See spot at Death Valley National Park", "This is definitely one of the highlights of Death Valley National Park. It's a bit of a drive to get there, but very much worth the drive. Large RV's or buses cannot drive up to Dante's View. Something to keep in mind. There is only a single restroom just before you reach the peak and that is very basic. I'd hit the bathroom before you leave your hotel or restaurant. Once you are at the peak however you will be rewarded with the best views around. Don't miss this spectacular sight.\nShow less"], ["Reviewed March 17, 2017", 5.0, "Amazing", "This view is amazing, you can see the hole death valley drive that you took earlier in the day to get here. If you have binoculars you an see people walking down below. This is such a beautiful sight. There was a difference in temps up there.this is a trip every one needs to see\nShow less"], ["Reviewed March 15, 2017", 5.0, "Cooler than the valley floor", "When it's hot, Dante's view is a good place to explore. With some hiking, even more views are possible."], ["Reviewed March 13, 2017", 5.0, "Death Valley Love", "I am biased----I love everything about Death Valley---even the heat! If you love nature and can tolerate the heat in the summer, then you will enjoy most of the suggested locations."], ["Reviewed March 13, 2017", 5.0, "Go early, dress warmly", "Best place to watch the sunrise. Give yourself time to drive there due to winding roads. Dress warmly! It was 38 degrees Fahrenheit in the parking lot when I visited in February. It was a lot colder and very windy on the trail!"], ["Reviewed March 13, 2017", 4.0, "Spectacular Views of Death Valley & Surrounding Peaks", "Dante's View Provides spectacular Views of Death Valley and the surrounding peaks. To get to the parking lot at Dante's View, take the Dante's View road from state road 190 at the south end of the park. The road is well marked."], ["Reviewed March 11, 2017", 5.0, "Spectacular", "A must see. Great ride up to the point and a spectacular view from the top. You get a great view of the lay of the land. We went in February so bring some warm clothes."], ["Reviewed March 10, 2017", 5.0, "Breathtaking View of Death Valley!", "The view of the valley from up here is worth the drive up. It is the only place in the park to get such a panoramic view of the valley. It is especially interesting if you have also visited Badwater Basin since you are looking over 5000 feet down to it from the viewpoint.\nShow less"]]}}