{"de Young Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "de Young Museum", "url": "/Attraction_Review-g60713-d127943-Reviews-De_Young_Museum-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/0a/c3/c5/exhibits.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1847"}, "address": {"@type": "PostalAddress", "streetAddress": "50 Hagiwara Tea Garden Dr Golden Gate Park", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94118-4502", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "deYoung spectacular art and views!!", "I have been to the deYoung a few times but on our latest trip after viewing the beautiful American Art collections with my husband,we went up to the tower and enjoyed the most spectacular view of San Francisco you can imagine.Weather was great and there was a docent up there who was very knowledgeable and able to identify areas on the large map they have on the wall.Love their restaurant and sculpture garden for a light lunch.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "teotiuacan", "fantastic retrospective of a culture unknown origin with an incredible development , when we european where , basically living nakedand dominated by whichcraft"], ["Reviewed 2 weeks ago", 5.0, "Fabulous views from the observation tower!", "The DeYoung has a 9-story observation tower which offers a 360-degree view of the city as well as the park itself. Admission to the tower is always free, and admission to the museum is free on Wednesdays. The museum store has many nice items."], ["Reviewed 2 weeks ago", 4.0, "for de young and de old", "Great exhibits. Just in the past year, we have seen the Summer of Love,Teotihuacan and the Maori. If you are local, become a member. Members receive free admission to special exhibitions and other collections at the de Young and the Legion of Honor.We went to the Legion of Honor after and saw the collection of Rodin and other exhibits.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Same ticket as the Legion of Honor, free first Tuesday of the month", "As the title says it, you could visit this museum on the same day as the Legion of Honor. If you're not driving, you could take Bus No. 18 from in front of the museum, and change to No.5 or 5R, which will get you to the De Young. It focuses on arts from the Americas as well as Oceania. It has a nice touch when it comes to modern art (primarily 20th century).\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Art in all forms the de Young celebrates Culture, Costume, and Creativity", "The majestic building with an observation perch nestled in Golden Gate Park is the de Young. Home to a vast historical collection and host to many visiting installations this quiet museum in the park is electric with style and glamor. From Balenciaga and Vivienne Westwood to cultural treasures from Mexico and Egypt the team at the de Young expertly and thoughtfully curates your experience with respect and difference defferenc to the works. The Museum tickets begin at $15.00 with some editions depending upon the special show. Do take time to enjoy the gardens and visit the look-out tower. Golden Gate Park is a local's and visitor's experience, so enjoy your time and say hello to people.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Went for the Maori Portrait exhibit and was Wowed!", "This is a special exhibit that ends within the next two weeks. Run, don't walk to see this exhibit. It is terrific, that is if you are interested in the Maori, the indigenous people of New Zealand and if you are interested in facial tattoos called \"ta moko\" by the Maori. I also enjoyed their African collection as well as the artifacts from New Guinea.\nWe had excellent lamb mole tacos in their cafe for lunch. Since the museum is in the middle of the park, there are not many food options outside the cafe itself. The food was tasty and priced within the prices of SF. SF is not a cheap food town.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Teotihuacan: City of Water, City of Fire", "Three to four times a year we are fortunate enough to get a tour with our favorite docent, Gretchen. She is amazing as is the de Young Museum. Typical we are seeing art masterpieces but this time it was something quite different and very special - artifacts from the ancient city of Teotihuacan, a UNESCO World Heritage Site and the most visited archaeological site in Mexico. I urge you to see it if you live close enough and read about on the de Young website before doing so to prep you for this informative exhibit.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Brilliant! Lovely Location & Plenty of wonderful exhibits", "A wonderful way to while away half a day or so.. some excellent exhibits. In close proximity to golden gate park, the Japanese tea gardens, the science museum... Wonderful! Dont miss it if in SF."], ["Reviewed January 22, 2018", 5.0, "My Must-Go Place in San Francisco", "Why? First you can go right there by bus, or easily park nearby.\nThen, regardless of the temporary exhibitions, the permanent collection is top class; the pictures of the American West are beautiful, and there is quality everywhere.\nIn January the free exhibition of Maori portraits was a real surprise.\nThe cafe can be expensive but some of the dishes are imaginative and tasty.\nAnd, if you are European, you can drool over the elegant items in the shop - that you can't afford.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Nice viewing deck, hard to find parking, cool outdoor displays", "You can get nice views of the city from the viewing deck. The surrounding outdoor displays were quite interesting too. Especially liked the fog area. Can easily spend 2 hours in here. Has a bag check. Only complaint maybe that getting in took a while with the tickets. My friend and I came during the Bank of America free museum day, still had to line up.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Hamon Observatory Tower is a must", "If you appreciate art and views, then you must make the time to fir in several hours at the de Young Museum. The art and exhibits are superb, I'll let the attached pictures tell the story far more eloquently that I can, and the views from the top of the Hamon Observatory Tower simply add to making this a must visit venue. If that's not enough to entice you there's the California Academy of Sciences opposite, the Japanese Tea garden next door, along with Shakespeare garden and Stow lake.\nI can't wait to return on my next visit from the UK in July\nShow less"], ["Reviewed January 14, 2018", 4.0, "Wonderful Art", "My friends and I went in the early afternoon and spent about 3 hours looking at all of the beautiful artwork. I definitely recommend this for a rainy day if you’re visiting San Francisco!"], ["Reviewed January 13, 2018", 5.0, "A great art museum.", "It has many permanent exhibits, as well as traveling exhibits of world famous art. In beautiful Golden Gate Park. The tower gives you a view in all directions over the park and the city. It has a good restaurant and book/ gift store."], ["Reviewed January 13, 2018", 5.0, "Glad we came.", "We enjoyed the uplifting design of this museum, especially the entertaining and inviting mega screen when you first enter the museum. This feature immediately sets the tone and makes you feel invited into a great place. My only criticism is that the volume of the videos was unnecessarily high, and despite the appealing videos and seating, I could not spend anytime viewing because the volume was uncomfortably high. I say it was unnecessary as the screen invites you in and sound does not need to do that job! Also, there are so many people and large groups of children in this main lobby that the high volume of the video adds to the chaotic atmosphere and does not encourage people to sit and listen to the video.\nWe enjoyed the many beautiful artworks, sitting outside looking out over the grounds, and the wonderful viewing area on the top floor.\nAlso, there was a well presented video about one of the paintings, and given the length of this presentation I think a few benches would have been appreciated to encourage people to watch it in comfort.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Great view of the city", "The Hamon Observation Tower is worth the stop alone; giving a somewhat fresh perspective from “above” San Francisco. And best of all, the it is Free:)\nThere is an admission cost for the museum’s current exhibits however.\nI brought my mother on a cloudy, foggy, rainy day so the view was obviously obscured. On a Clear day one can catch a different view of the area surrounding GGP from atop the tower, aside from the more typical “tourist” overviews of the city like from Twin Peaks or Coit Tower. Directly across from the Academy of Sciences building.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Awesome!!! Free w/ Legion of Honor Museum admission!", "Wish I had another 2 hours to hang out longer. The museum is located right in Golden Gate Park across from the Academy of Sciences. Got in free with paid admission to the Legion of Honor Museum (we had an art appreciation day theme). This museum had so much domestic art compared to that of many others that have more foreign artists. What I loved most was the African American exhibits with quilting and art forms prominent in the south.\nShow less"], ["Reviewed January 3, 2018", 4.0, "interesting collection and special exhibits", "In Golden Gate Park, the de Young is easy to get to: it's next to the Tea Garden. It's an easy building to walk around with a good cafe for a snack or lunch. The collection spans a wide range of styles and eras. We saw a no-extra-cost exhibit of New Zealand Maori portraits that I recommend highly if it's still there.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Teotihuancan Exhibit", "This special exhibit about the dead city found near Mexico City is fabulous. The quality and quantity of artifacts found and exhibited is astounding. It is well worth the $25 fee. The rest of the museum has many wonderful segments. My wife found the fabric room fascinating.\nShow less"], ["Reviewed December 26, 2017", 4.0, "Nice architecture Good eclectic collection", "Enjoyed my visit. Not very big and varied collection. I was very moved by the art of early black Americans reflecting their experiences"], ["Reviewed December 19, 2017", 5.0, "Our first visit to the \"new\" DeYoung", "I have always thought of the DeYoung as the Asian Art museum -- but that shows you how long it was since I last visited. We were here for a special event but toured the main and upper floors while we were here. Interesting, eclectic collection. We were here for Angie Wilson's \"the Universe Within\" opening as this month's Artist-in-Residence -- superb!\nShow less"], ["Reviewed December 15, 2017", 3.0, "skip it", "The museum is ok -- expensive for what it is and there's an upcharge for the special exhibits. The cafe is mediocre."], ["Reviewed December 14, 2017", 4.0, "Very welcoming museum", "Come enjoy the view from the tower, have lunch in the cafe, lounge in the sculpture garden. Enjoy art including photography and sculpture. American art, Mexico, Africa - art from almost everywhere except Europe. Currently three special exhibits -Maori portraits, September thru March; Teotihuacan until February 2018; Revelations: Art from African American South\nShow less"], ["Reviewed December 11, 2017", 5.0, "Superb collection", "We started at the top of the tower and saw beautiful views of the park and San Francisco. Then we explored the art, which was beautiful."], ["Reviewed December 11, 2017", 4.0, "Summer of Love exhibit - Took me back", "We visited the Summer of Love exhibit, and thoroughly enjoyed the posters, fashions and information about the movement. It was so enjoyable that we purchased a membership and plan to visit the Teotihuacan and Boquets to Art 2018 exhibits."], ["Reviewed December 8, 2017", 5.0, "Incredible art from Papua New Guinea...and elsewhere", "If you have never been there--just go. And leave plenty of time. There is also a great African collection, and they currently have a Maori photo gallery etc.!"], ["Reviewed December 6, 2017", 5.0, "Special Exhibit", "We visited the de Young to see the Teotihuacan: City of Water, City of Fire special exhibit which runs until 11 February. If you are in SF before it leaves, make it a priority. Organized in collaboration with the Instituto Nacional de Antropologia e Historia, the exhibit highlights monumental and ritual objects from Teotihuacan's three pyramids along with murals, ceramics and sculpture from the compound.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Teotihuacan exhibit is so worth it", "Paid extra for the exhibit from Teotihuacan, and am grateful I did. Fascination history from ancient Mexican ruins, very educational. This is a great museum, full of art from modern to several centuries old, and its location in Golden Gate Park puts you right near the Japanese Tea Garden.\nShow less"], ["Reviewed December 6, 2017", 3.0, "Not very world class, I'd say 55/100", "Having just come back from Chicago, we got very spoiled by the museums in that city, particularly the Art Institute. The \"Teotihuacan\" exhibit was overpriced and underwhelming. We could have skipped that attraction and would have saved $28 each!"], ["Reviewed December 4, 2017", 4.0, "Beautiful building", "The museum in located in a beautiful setting in the middle of Golden gate park and right across from the California academy of sciences and a wonderful rose garden. The building is beautiful and the surrounding gardens are an attraction. When you visit, make sure to go to the top of the tower for a spectacular view of the city. The only complain about this museum is its less than stellar art collection. The American colonial collection was wonderful but we found the rest boring and uninspiring.\nShow less"], ["Reviewed December 2, 2017", 5.0, "For American Art and Modern Sweeping Architecture, This is the Place.", "One in my party doesn't think much of the charcoal and copper walls and glass exterior of the de Young. I like it very much, on the other hand; and our divergent views tell the story of this modern makeover of what was once a traditional museum building. It is a topic of debate, still, even though the new makeover was completed several years ago; and it's a characteristic of how lively an atmosphere the museum provides. American art is the permanent collection. I was here to see a couple of visiting exhibits, one on the ancient Aztec city of Teotihuacan and one of over 50 portraits of Maori leaders of 19th century New Zealand. Both exhibits were laid out in several rooms and were wonderful. This is a first rate museum and the added bonuses are that it is located in the city's lovely Golden Gate Park, near the Japanese Tea Garden and the California Academy of Science (natural history), both worth visits. You could spend the day here.\nShow less"], ["Reviewed November 29, 2017", 5.0, "A great museum in the heart of Golden Gate Park", "We initially went there for the special exhibitions on Teotihuacan and on African American Art of the south but also took in the views of San Francisco and the Bay from the tower which were fantastic. A must see which is served by the Fulton 5 bus and the 44 on 9th avenue.\nShow less"], ["Reviewed November 24, 2017", 5.0, "A good museum in a beautiful setting", "My wife and I took in the de Young after the Legion of Honor took less time than we had planned, since admission gets you entrance to both. The collections here are not extensive as compared to other major city’s museums, but they are good and offer a wonderful variety. The setting is beautiful, and the observation tower is a must! We also ate at the cafe which, while typically overpriced for museums, was quite good. I highly recommend carving out time for both the de Young and Legion of Honor, as together they add up to a great museum experience!\nShow less"], ["Reviewed November 24, 2017", 5.0, "Excellent and varied collections", "Excellent and varied collections. Great mix of media, genres and artists from around the world and through time. Don’t miss the views from the tower on clear days!"], ["Reviewed November 22, 2017", 5.0, "Great Museum!", "We loved this museum! The collection is wide ranging! Even better it offers an observation floor that doesn't require a ticket. This observation area closes promptly at 4:30."], ["Reviewed November 14, 2017", 5.0, "Very cool", "I’m not really the museum type because I love modern art, but this was so cool. There was a variety of old and modern art and a very broad combination of all sorts of art like paintings and things combined. The museum itself was huge and there was a lot to see. We went there on community day so not only did we get in for free, but there was also a lot of Mexican cultural performances that day. Lastly, there was a view point in top of the building. This was amazing. We took and elevator to the top and we could see the view 360degrees, from the city and around the park :D This was a very nice experience!\nShow less"], ["Reviewed November 13, 2017", 4.0, "Great Collection", "The highlight of this museum for me was the collection of African relics, masks and headdresses. There were a few Dali and a Georgia O’Keefe paintings as well as Chihuly glass and Tiffany glass. Well worth the visit."], ["Reviewed November 10, 2017", 4.0, "observation deck a highlight", "A very modern building with a fantastic top floor 360 degree all glass observation deck; unfortunately, that is only accessible with ticket purchase. Cafe was very good."], ["Reviewed November 9, 2017", 4.0, "de Young Museum San Francisco", "The Teotihuacan exhibit that runs through Feb. is very interesting to see. The artifacts in the exhibit are beautiful. Even though I have been to Mexico city, I did not know much about this early civilization, City of Water, City of Fire. After seeing this great exhibit, I certainly will make an effort to go to the actual site (designated a UNESCO world Heritage Site) next time in Mexico City.\nShow less"], ["Reviewed November 8, 2017", 5.0, "FABULOUS museum with a tower with a 360 degree view", "If you love art, you will LOVE this museum. Ever changing exquisite collections of World Class artists. Sculpture, painting, fiber, mosaic, ceramic, etc etc etc. The de Young is in one of the most beautiful parks in one of the most beautiful cities. This museum is a MUST for any visitors to San Francisco. It is wheel chair accessible and has devices for people with hearing and visually disabilities. The museum is within a 5 minute walk of the Japanese Tea Garden, the Science Museum and the band shell. Just do it!!!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Incredible", "This place is huge! It just went on and on and on. Make sure you have 3-4 hours planned if you attend. It was much more than paintings, it had a wide range of pieces. This is a \"must attend\" if you are in SF."], ["Reviewed November 7, 2017", 5.0, "A World Class Venue", "The De Young Museum is a world class museum located in San Francisco's Golden Gate Park. If you are visiting the city for the first time, you may not think of this venue, but it is well worth a visit. The tower offers exceptional views of the surrounding park and the city at large, and the Art is exceptional, including a variety of styles and genres. The De Young is also located next to the Academy of Sciences, the Japanese Tea Garden, and the San Francisco Botanic Gardens, all of which are excellent.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Not to be missed.", "Easy to get to by bus from the Union Square area. The permanent exhibitions are very interesting and well laid out. The building itself is astonishing. Don’t miss a visit to the tower which affords 360 degree views of the city.\nGreat restaurant and outside terrace. The Japanese Garden close by is also well worth a visit. Don’t miss a walk through the parks.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Mexican highlight", "Astonishing exhibition on a mexican era forgotten since long. Well put together and with good reading material. Worth a visit!"], ["Reviewed October 31, 2017", 4.0, "Wonderful special exhibition", "A really interesting visiting exhibition of Teotihuacan artifacts. Well presented, and the guided tour putting it all in its historical context was very illuminating. Well worth the visit."], ["Reviewed October 31, 2017", 5.0, "DeYoung always delights", "Go for the Wayne Thiebault. You are in San Francisco and he is the poet laureate in my visual world for San Francisco. Go for the building and the views. Go for the amazing Pozole Verde I had in the lunchroom. Or go for a special show (we just saw and were stunned by the Teotihuahan show) and learn something, see something....or become inspired. The De Young is a superb museum--with a great collection. Do not miss it.\nShow less"], ["Reviewed October 31, 2017", 5.0, "great museum in great architecture", "in case you are interested in high quality contemporative art and contemporative architectue this place is good for you. the architecture of herzog&demeuron is spectacular!"], ["Reviewed October 24, 2017", 5.0, "Always fascinating", "Always worth a visit just for the usual art but especially wonderful the way Rodin and Kilmt were displayed and compared. Never will I take the Rodins for granted!\nAnd the coup de grace were the mummies. After that, we had tea and a pastry outside in the sun at the little cafe.I will be glad when the organ concerts return in February.\nShow less"], ["Reviewed October 22, 2017", 5.0, "I could move in and live here!", "Stunning art museum, with a varied and eclectic collection, wonderful shop and good cafe, which was a fine place of refuge on a day turned cold and blustery."], ["Reviewed October 20, 2017", 4.0, "Interestinf visit", "we had a very intersting visit/ We loved especailly the icoanicpuctures painting and crafts. The park surrounding the place was lovely as well,"], ["Reviewed October 12, 2017", 4.0, "Well Done Exhibits in a Beautiful Building!", "We visited on Sunday, 9/9/17, after parking our car on Fulton St. at about 0845 and going on to see the nearby Japanese Tea Gardens. The building itself is a delight for the eye. The exhibits are displayed with a high degree of professionalism. We particularly enjoyed the captivating portraits of Maori leaders by Gottfried Lindauer painted from 1874 through 1903. The historical film describing the Maori leaders during that period in New Zealand added to our understanding and enjoyment. Don’t miss the elevator to the observation tower to see the surrounding parts of San Francisco. Having lunch on the outdoor patio of the cafeteria provided a welcome break from strolling the galleries.\nDid this review earn a “Thankful vote”?\nShow less"], ["Reviewed October 11, 2017", 5.0, "Great New Exhibits", "We stopped by the de Young to see the exhibits of Teotihuacan and Maori portraits. Both were fascinating, especially the new discoveries at this ancient Mexican site. The Maori one requires some careful reading of the labels, because the artist often changed the details of the person depicted. Both exhibitions were well-presented and labeled. The de Young has a great gift shop and a good restaurant, so all in all, it's well worth a visit, even if you just want to see the permanent collection.\nShow less"], ["Reviewed October 11, 2017", 4.0, "world class museum", "it is a great museum, a lot of collections and you can spend hours easily. they have policy no backpack, so better leave your backpacks and bag in the car, rather than carry them."], ["Reviewed October 10, 2017", 5.0, "beautiful location, great museum", "Stop in even for an hour if you can. The permanent Ruth Asawa art alone is sufficient reason for going. The observation deck is nice. A wide range of works, definitely a must-do on your Golden Gate Park adventure."], ["Reviewed October 9, 2017", 5.0, "World Class", "This is a lovely museum, and gets world class traveling exhibits. If you can, check what is there and go. The whole area is beautiful to walk around and tour."], ["Reviewed October 7, 2017", 5.0, "Outstanding", "This museum is a must see if your in SF. It's contemporary architecture is an incredible sight to see. It is also filled to the brim with contemporary art works, sculptor, and many forms of art. I would suggest going early in the morning as it opens. Your ticket also gets you access into its sister museum The Legion of Honor - also worth a visit if you like more historical art. The DY museum is located in the Golden Gate park and there is lots to do in the area too.\nShow less"], ["Reviewed October 7, 2017", 4.0, "Good free views", "If you are exploring the park then the de Young museum offers a useful pit stop with an added free bonus.\n\nYou can ride the elevator to the observation level for free (go right from in front of the pay desks). The views are really good from up there - not as good as the Twin Peaks obviously, but not bad.\n\nIf you go left from the pay desks there are public toilets and also a cafeteria. The cafeteria can be a bit pricey, but is OK for a snack.\nShow less"], ["Reviewed October 7, 2017", 4.0, "Interesting to visit", "Well worth a visit. The building itself is impressive. Make sure you go to the tower for a 360° view of the city."], ["Reviewed October 3, 2017", 5.0, "Fabulous collection of artefacts from around the world", "Loved this museum. The view from the tower is awesome. The collection is well set out and a fascinating array from many diverse cultures."], ["Reviewed October 3, 2017", 5.0, "Large and Largely Interesting", "Spent several hours in this museum in Golden Gate Park and only saw about half of it. Interesting displays of Mayan artifacts. Extensive collection of American paintings. If you go, be sure to begin with a ride to the top of the tower. It provides an amazing panoramic view of San Francisco from the ninth floor gallery.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Wonderful building but need better tours", "The building is great and you should spend time outside and on the tower. Modern art is interesting. We were little disappointed by the guided tours. One was confusing and not well prepared. The second was meant to focus on architecture but spent most time in the exhibitions.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Visit to de Young museum", "We had an afternoon visit to the de Young Museum on a Saturday. The entry was smooth and we spent about two hours inside looking at the great exhibits ranging from Maya era , the African -American section and the modern paintings. THe 9th floor gives a good view of the city. The exhibits are in two floors , first and second . They also have a coffee shop and gifts store.A great place to visit to understand the rich history of the west coast .\nShow less"], ["Reviewed September 22, 2017", 4.0, "Fantastic Museum", "Beautiful building with great pieces of American and Foreign Art. Special exhibitions are all ways fantastic."], ["Reviewed September 21, 2017", 4.0, "A walk trough American history", "Definetly worth a visit. You will witness the evolution of art from north, south and latin america from all different cultures and times. A student ticket is 6$. It will take you between 1 and 2 hours."], ["Reviewed September 19, 2017", 5.0, "The De Young Museum in Golden Gate Park", "The de Young is a very nice museum located in Golden Gate park. It is very accessible.\nWe opted for public transportation and took the 5 bus to 10th Street which puts you on the north side of the park. A short walk and you are there.\n\nThe museum offers reduced pricing as we visited the web site to get tickets but found out the time and information was incorrect.\n\nWe were there to see the Revelation exhibit. It was outstanding. The museum is full service, however they lack outlets or ability to charge your device, which is surprising given the techie nature of the city.\n\nThe bookstore is fully stocked and there is sufficient room to visit the exhibits as well as relax with outdoor/indoor seating.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Viewing Tower", "Very interesting art gallery. Plenty of artefacts from since before the Pilgrim Father's landed in the USA. The viewing tower is an excellent place to get a veiw od San Francisco"], ["Reviewed September 16, 2017", 5.0, "Great Art Museum", "The de Young has much to offer with a stunning building, great location, excellent shop, good restaurant and a viewing tower and that is before the collections. I was back again for the opening events related to an exhibition of Lindauer Māori Portraits from New Zealand, and had the chance to re-visit the collections again, which include American art but de Young also has comprehensive collections of Oceanic/Pacific art; pottery, weaving and mural fragments from the Americas; textiles and costumes; and graphic arts. The American and Americas collections are some of the best around with icons such as Copley, Bingham, Cassatt, Sargent, Rivera, O'Keeffe, Motherwell, de Kooning, Hopper, Rothko, Wood, Rivers, Stella and Diebenkorn. The pottery of the Americas collection is truly superb.\n\nThe collections are therefore first class and include the large John D. Rockefeller III collection.\n\nThe viewing tower provides excellent views and the restaurant is really good also. Simply put, this is a \"must visit\" in San Francisco. The Legion of Honour is part of the same structure and also well worth a visit.\n\nA highlight this time was a special visit to the conservation department, faciliated by Curator, Christina Hellmich.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Excellent Museum", "A great building and easy to get through in half a day. Love the collections. The food is outstanding too. Parking garage makes this an easy visit."], ["Reviewed September 13, 2017", 5.0, "de Young Museum - Summer of Love", "We thought the day we went it was supposed to be free but it wasn't, $50 for two. The Summer of Love happened to be on exhibit when we went. It was nice to see things from the era in which we grew up. We enjoyed the special exhibit and the regular collection as we have not been here in many years. We enjoy the museums in San Francisco but don't go until we can stay the week because the drive is too long from the south bay. It's fun to be tourists in San Francisco because there is so much to see and do. We just got a week-long transportation pass that allows you to ride the cable cars, buses and street cars all week.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Great museum .......", "Take time out to visit de Young and spend a bit more time there as there is so much to see..... Japanese tea gardens are close by so take some quiet time out there too..... so glad we got to do both !!!!\nJust love San Fran will deffo go again!!!!\nShow less"], ["Reviewed September 13, 2017", 5.0, "Don't Miss the Observation Deck!", "We made a point of visiting the de Young Museum while we were in San Francisco in order to see the glass art display (which was fantastic). Afterwards, we took the elevator up to the 9th floor, and as we stepped out, I gasped in astonishment - we had a full 360 degree view of San Francisco in all its glory. Breathtaking - every bit as breathtaking as the art exhibit!\nShow less"], ["Reviewed September 12, 2017", 5.0, "Fantastic small museum", "In Golden Gate Park, this museum is excellent. The collections were really very good and very interesting. The beautiful sculpture garden was great to sit, and the view from the top floor is wonderful. Staff was helpful. And the women's bathroom on the lowest floor is not to be missed. Seriously. it's one of the most beautiful bathrooms around, complete with orchids. No kidding. The architecture of the building is very cool. We loved it.\nShow less"], ["Reviewed September 12, 2017", 4.0, "Beautiful facility - mediocre Summer of Love", "I have been to the de Young many times over the years. The standard collection is interesting one-time but fails to draw me back. As a result, visits are usually timed in conjunction with a special exhibition - King tut, Picasso, Girl With The Pearl Earring, etc.\n\nIn this case, the Summer of Love pulled me in. But I found it profoundly disappointing. As someone who wandered through the Haight in the mid-to-late 60s during my college years, I found the exhibit tedious and limited. It did a poor job of explaining how the Haight came to be a focal point for young people, what the era felt like, or how the area changed when the youth began to migrate away again. Very little on the musical groups, lifestyle issues, poverty, drug use, etc and an overwhelming fixation on odd outfits worn by some of the area's characters.\n\nDon't miss the tower when you visit - an elevator will whisk you to the top with excellent views of the city.\nShow less"], ["Reviewed September 10, 2017", 4.0, "Premier public Gallery", "Saw the summer of love exhibit, brought a lot of memories back, as well as learning some new stuff (I was only ten)"], ["Reviewed September 9, 2017", 5.0, "Museum of Choice no. 1", "I was told by locals this is NO. 5 museum in the USA - its mind blowing - If you have Time for one museum only in San Francisco make it your choice to come here. The building is a beautiful modern design with spacious galleries and international exhibits. Paintings, art work, sculptures and so much more. For us we arrived on the opening day of Maori Portraits and a fascinating presentation by a Maori elder who was a direct descendant and great grandchild of a famous Maori chief. What perfect timing. This whole complex in golden gate park is worth a whole day's visit. There are concerts going on in the park and opposite De Young Museum is a fabulous Science museum which looked fabulous, extravagant and Smithsonian-style-quality-adventurous but we ran out of time. Amazing day here !!!\nShow less"], ["Reviewed September 9, 2017", 4.0, "Spectacular building", "Spectacular building by Swiss architects Herzog & de Meuron. Viewing tower should not be missed. Collection, ostensibly of \"America art\", is quite diverse and not wholly coherent. Interpretation is minimal to non-existent. Superb cafe. Watch out for closed times (including public holidays)."], ["Reviewed September 8, 2017", 4.0, "A hotchpotch but much to see", "Now set in a remarkable modern building with a viewing platform over Golden Gate Park, the museum is a strange mix. It's strength lie in two disparate and two geographically distant but similar areas. The Mayan collection, though not large, is excellent. There is a very fine collection of American art and furniture ranging from colonial days to the late 1800s. Perhaps the best for quality - but not that good in terms of presentation - is the collection if artifacts from Papua and New Guinea and nearby areas. This is complemented by a good section on Africa. Other sections include modern ceramics and other bits and pieces.\nTry and allow 3 hours if you want a comprehensive viewing or pick the sections you are most interested in.\nBy the way, the entrance ticket is valid same day for the Legion of Honor Art Museum, which is not very far away.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Great museum and something for every taste in art", "The de Young Museum has a very broad range of exhibits in it's permanent collection, ranging from Mayan pottery to abstract modern art. However, the highlight for us was the wonderful collection of 18th to 20th Century American paintings, skilfully curated to illustrate the story of its evolution from its European roots. The gallery spaces are calm and comfortable, allowing time and space to appreciate the exhibits fully. The adult entry fee was excellent value at $15. The ticket also covers same-day entry to it's sister museum, the Legion of Honour, but visiting both in the same day might be rushing your visit to either. Definitely a \"must see\" when in San Francisco.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Good Museum", "This museum is wonderful in many ways. It displays stunning paintings, and many other forms of art. It is in the middle of golden gate park, the building is worth a visit alone, and the exhibits were great.A treat for your eyes.A bit expensive though."], ["Reviewed August 30, 2017", 3.0, "Good museum depending on your interests and the exhibits", "This is an expensive attraction, but depending on your interests and the exhibits, it could be well worth it. Currently, they are running the Summer of Love exhibit."], ["Reviewed August 28, 2017", 4.0, "Summer of Love exhibit", "Very fun exhibit that really captured the mood of the 60's. The clothes, the colors, the artwork was truly of a different era, and one I remember well. Can be enjoyed in under 90 minutes. Wished I had more time to explore the museum on this visit.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Exceptional Museum at Golden Gate Park", "We love this museum especially seeing the outstanding Summer of Love exhibit! de Young always has fantastic events for families and extended hours."], ["Reviewed August 24, 2017", 5.0, "Fantastic muesum", "Excellent American art collection, the best Oceanic collection I have seen, interesting textiles. The Summer of Love exhibition was very crowded (weekday) and was a bit repetitive with posters, so a little disappointed, however the costumes were amazing. The museum architecture is interesting, the grounds have sculptures as well and I highly recommend a visit to any lover of art. TIP the main restrooms are gender neutral (male+female) which may be a bit weird for some, there are other restrooms if required.\nShow less"], ["Reviewed August 20, 2017", 3.0, "too crowed to see anything!", "was totally surprised that the museum was so full on a week day that you could barely see any of the posters or items from the Summer of Love. Think they should have limited the number of guests that they allowed in every 10 minutes or so. Done at the Broad in L.A. was disappointed. left early.\nShow less"], ["Reviewed August 19, 2017", 5.0, "A Pleasant Surprise", "We went back to this museum which was not on our original list after seeing it in a bicycle tour. It hit way above its weight in terms of interest, value and qualify of exhibits."], ["Reviewed August 16, 2017", 4.0, "Must go to top floor for views", "Made a special visit for thru Summer of Love exhibition. It was ok but expected better and more. Sadly didn't have time to explore more exhibits. But in beautiful location. And the view from the top floor is amazing. $100 for four adults."], ["Reviewed August 14, 2017", 5.0, "Incredible View from the Top!", "We originally went to the de Young Museum to see the views from the top floor of the building. They are incredible! Since we arrived on a Friday evening, admission was free for the regular exhibits, so we stayed and walked through them. Even my 10 year old granddaughter was interested in the exhibits. She said it was really hard not to touch the sculptures. The Revelations exhibit gave us and opportunity to discuss the history of civil rights in America. It was a very cool building, and very lively with music and activities when we visited.\nShow less"], ["Reviewed August 12, 2017", 5.0, "\"The Summer of Love\": Terrific exhibit", "I was passing by the De Young Museum. I was very interested in the exhibit \"The Summer of Love.\" So I decided to buy a ticket.\n\n\"The Summer of Love\" is an exhibit which discusses the hippie culture around the year 1967. It talks about the music, the art, and the clothing of that time period.\n\nThe exhibits were very interesting. There were paying customers who actually experienced the \"The Summer of Love.\" This exhibit goes nicely with a walk down Haight - Ashbury and the Golden Gate Park. That is where the Summer of Love took place.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Awesome building and well thought exhibitions.", "Me working in a museum here in Mexico City, I'm so happy when i'm able to visit others museums like this one. Now every time I go to SF I try to visit this museum. Great exhibitions and the collection. Congratulations."], ["Reviewed August 11, 2017", 5.0, "Birthday Visit", "In celebration of my daughter 's birthday, we attended the Summer of Love exhibit. I'm an older mom so I was part of those years. My daughter (22) liked learning about the music, the concepts, the life I remember. The exhibit was mostly posters from concerts. Some clothing, some music, some photos. I would have liked more photos and music. The museum itself is modern, clean, and the cafe served a lovely lunch.\nShow less"], ["Reviewed August 11, 2017", 3.0, "Good if you're into art", "We went on a free day to see the exhibits. Very nice stuff, if you're into art. My family was pretty bored"], ["Reviewed August 10, 2017", 5.0, "Summer of Love", "This brought me back to my youth! Actually, a little before I was a teenager. It was so exiting to see the posters and the clothing and the photos taken of the individuals who were actually there.\nI was never into drugs, but I loved the whole concept of Peace vs. War\nShow less"], ["Reviewed August 8, 2017", 4.0, "The Summer of Love Exhibit", "We came to see the on-going 'Summer of Love\" exhibit, featuring the art, music, and clothing of the hippie \"Be-In\" in San Francisco of 1967. Having spent the previous summer of 1966 working in the city, I wanted to see what I had missed, and my wife was interested in seeing what had attracted her older sister to leave the Midwest and come out for the \"Love scene\" here. The show was interesting and well-documented as far as it went, but it focused more on the cultural and artistic aspects of summer of '67 and was very light on the historical factors that led up to it (Viet Nam was hardly mentioned, while rock concert posters and other psychedelic art seemed to be what fascinated the curators. Afterward we toured the museum's collections of American art. Their works from the US 19th century is especially extensive. Parking seems to be a problem here. The friend who drove us parked his car about a half mile away, resulting in a pretty but tiring walk through the Golden Gate Park before reaching the de Young.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Summer of Love Exhibit at deYoung", "Saw this exhibit Sunday. Lots of clothing displayed. I was surprised at how many 1960's concert playbills were displayed and not many duplicates. They covered a few walls from the top to the floor. There were photos, some quotes and a group of vinyl albums. I wish they would have played music from the era. It brought back memories as I lived near Speedway Meadows where I attended many concerts. If you're a baby boomer or just want to go back in time it's interesting. Bring your kids, they might learn something. Buy tickets online and you won't wait in line. Park at the museum lot; as its a hassle finding parking. Exhibit closes August 20. Afterwards eat at Pasquale's Pizza on 8th & Irving.\nShow less"], ["Reviewed August 8, 2017", 5.0, "One of the World's Great Museums", "One of the world's great museums in one of the world's great parks. Plan at least half a day. Great cafe for the hungry. Always fascinating exhibits."], ["Reviewed August 8, 2017", 5.0, "Summer of Love", "This museum is well laid out and the special exhibit from the '60's was very fun. Take time to go to the top of the tower for the spectacular 360 degree view."], ["Reviewed August 7, 2017", 4.0, "Went for Summer of Love Exhibit", "Went for the Summer of Love Exhibit and only had about an hour and a half to visit. We did not get through the whole exhibit. I would say give yourself at least two hours. In hindsight we should have went a little faster in the beginning. We stopped to read and look at everything. It was very crowded early Saturday afternoon, so it was difficult working through the crowds. It did become more spacious as we walked through it. Personally I felt curators could have given you more, more history of the time and set the mood better with music and lighting. We did not have the audio, that may have enhanced the experience. My teenage daughter and I loved the fashion.\nJust have to say, not being from CA, the gender neutral bathrooms were a little shocking. I saw several men walk into (what used to be) the women's restroom get a little flushed and turn around and walk out.\nShow less"], ["Reviewed August 6, 2017", 4.0, "Summer of Love Exhibit", "Posters, music, anti-war protests and hippie fashion--that's what this exhibit is about. Fun to taste a little of what I was too young and too square to participate in at the time. Fun to see."], ["Reviewed August 5, 2017", 5.0, "Fabulous Summer of Love exhibit at the de Young Museum.", "The Summer of Love exhibition was very special bringing back lots of memories of music, clothing, peace, love and rock n roll. All the posters and pictures graphically brought back the music of Jefferson Airplane, The Grateful Dead, Credence Clearwater Revival just to name a few special bands. The psychedelic colors and strobe lights weaved into the music of our mid-60s and early 70's in the USA.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Beautiful Modern Museum and Galleries", "This was a first visit to the de Young museum and we were delighted with our visit there. We particularly enjoyed the Art of the Americas with its strong Alaskan contributions , as well as the Arts of Africa and Oceania. The big draw on this visit was the Summer of Love Experience exhibitions featuring Art, Fashion and Rock & Roll which is only there through August 20 and should not be missed.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Summer of Love - Very Cool", "Enjoyed the exhibit, I grow up in SF during the 60's and this was very cool flash back... Well done, everyone should take this trip back to the Summer of Love!"], ["Reviewed August 3, 2017", 5.0, "The Summer of Love Was a Hit!", "Went in to see the Summer of Love exhibition although haven't experienced that special summer of '67 myself as a participant. The exhibition was a 'mindblower'! Album covers, posters, clothes and all that stuff."], ["Reviewed August 1, 2017", 1.0, "Awfully old fashioned attitude", "What is it with the de Young. They have bizarrely strict rules. I was there today, walking in to the outside cafe area at the side of the museum and one of the guards told me I couldn't have my young daughter (2yrs) on my shoulders in case she fell off, they'd be liable. On a separate occasion we were in really early before almost anyone else was there and my daughter sat on the steps behind where the ticket desks are. A different guard told her I'd need to get her up as others could be coming down. Like I wouldn't have done that if there were others. Another occasion, yes another one, a member of staff barked at my two year old for being about a meter from one of the guard rails around a picture, even though I had my arms around her waist. Utterly bizarre over reactions on each occasion. Totally unwelcoming, really old fashioned. Most of the really good world class museums and galleries realized a few decades ago that democratizing access, creating a welcoming environment, not being rude to guests who are t doing anything remotely wrong, is actually not only good for business but is good for arts in the society. Seems like the de young hasn't caught on yet.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Summer of Love exhibit was Awesome", "Stopped by the De Young Museum to see the Summer of Love exhibit. An excellent depiction of the sights, sounds, people, and music from this historical period in San Francisco. The displays were very revealing of this period. There was a self guided audio tour available. Overall it was an amazing exhibit full of stories, color, music, and a true glimpse of the Summer of Love. Before you leave, make it up to the observation floor on the 9th fl for a panoramic view of Golden Gate Park and San Francisco.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Modern Art & Great Special Theme Exhibitions", "First: We directly bought the year membership after the first time, we went to the de Young and took full advantage over the last year. The building is beautiful, the cafe for sure worth a visit, the night events a lot of fun, and the special exhibitions a reason to come back regularly. Together with the SF MoMA the de Young museum is for us the art highlight ... and a real treat of living in SF.\nTip: If you know someone local - check if they are member of the de Young as they can take 1 person along for free\nShow less"], ["Reviewed July 28, 2017", 5.0, "Summer of love!", "This museum is wonderful in many ways. It is in the middle of golden gate park, the building is worth a visit alone, and the exhibits were great. We saw the \"summer of love\" exhibition and I highly recommend it."], ["Reviewed July 27, 2017", 5.0, "Amazing museum, great view", "This was a surprise stop and I am so glad that we did it! The exhibits were amazing. The observation deck was spectacular. I wish I could have spent an entire day here."], ["Reviewed July 26, 2017", 4.0, "definitely check out the summer of love!", "We came here specifically for the Summer of Love exhibition in early July, and I was not disappointed. Being a museum worker, I only paid the extra charge for that particular exhibition, so for me the price was worth it. The Summer of Love has a great deal of photographs, clothing, and works on paper from the era. There are so many lithograph posters that I really enjoyed looking at, and I could have looked at them for hours. There was a room that had bean bags on the ground where you could listen to music and watch a projection on all of the walls that is very trippy and psychedelic. I didn't check out the rest of the museum, but it seems to have a good collection.\nShow less"], ["Reviewed July 26, 2017", 5.0, "A Truly stunning display of some of the finest masterpieces of fine art.", "This museum displays stunning paintings, and many other forms of art. Our visit was a treat for the eyes."], ["Reviewed July 25, 2017", 1.0, "Wake me up when we get through the poster portion", "Such potential. I was looking forward to the visit. The bean bag room with psychedelic projections on the four walls was the best part. Did I mention the posters? That seemed to be the main focus of the exhibit. A missed opportunity to have started with a few, black & white rooms showing the history of the War, race relations, women's rights, and then transitioning into the color of the counter-culture. Having lived through the era, I tried my best to be transported. But as another reviewer mentioned, I was only transported to the gift shop. A shame.\nShow less"], ["Reviewed July 25, 2017", 4.0, "I have seen some AMAZING special exhibits here", "Beautiful location and beautiful building in the park - very close to the California Academy of Sciences. Don't bring young children to art museums, you will all soon be miserable. I have to look a bit in the permanent collection to find stuff I really like, but it is there. Terrific view from the tower. The special exhibits are world class.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Summer of Love Exhibit is Lovely", "I went on recommendations of friends and family to see the De Young's \"Summer of Love\" exhibit. Because I was there in SF in 1966 and 1967, and partook of many events and activities of this era, this was a wonderful journey down memory lane!\nThe exhibit was true to its advance notices, colorful, musical, full of memory- tugging sights and sounds, clothing, posters, music, words, photos, art and the like. I was nostalgically plunged into past wonder years!\nEspecially evocative for me were the art, clothing and music!\nI did note some inaccuracies in descriptions and assumptions that were written as if they were fact, but of course that comes with the territory. Also I wish the transition from the Beat/hipsters to the era of Hippies was better explained. Al in this was a marvelous undertaking and well worth the obvious love and care in its assemblage. Congrats on a job well done.\nShow less"], ["Reviewed July 25, 2017", 3.0, "saw two exhibits", "The summer of love exhibit was okay, but less than fascinating.\nThe exhibit on the experience of African Americans in the South was insulting from my point of view. As a Southerner and someone who works in the field of race relations, the portrayal of black art was very primitive and looked as if there was no more sophisticated art available to show. The negative images of the atrocities of the 60s also portrayed white southerners at their worst. There is a lot more to the south than was shown.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Moving African American exhibit", "The DeYoung has acquired an African American art collection that was a combination of paintings, sculptures, quilts, prints, and photos. I found the paintings and photos of critical historical events and experiences (Civil Rights movement, slavery, lynchings, Emancipation, Jim Crow, . . .) hauntingly beautiful yet wrenching in the stories contained within. The De Young is a large museum with multiple exhibitions presented. It's in a lovely setting (Golden Gate Park) that reminded me a bit of Tuileries in Paris.\nShow less"], ["Reviewed July 24, 2017", 5.0, "A San Francisco staple visit.", "This museum is truly amazing. The building itself is a work of art.\n\nThere is a wonderful cafe with glass on three sides a large outside covered dining area overlooking a sculpture garden stretching across the grassed lawn.\n\nThe museum showcases American Art from 1600's onward; other exhibits I enjoyed include the history of California's glasswork and exhibits from many including Dale Chihuly. Further there are exhibits from Mexican/ and multiple other cultures/ textiles and costumes.\n\nI'd recommend for the serious Museum lover joining up and spreading their time over several visits of 2 or more hours including visits to their fabulous cafe.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Always something special here.", "Check newspaper listings for special exhibits, but there's always something interesting to see. The permanent exhibits are wonderful - and the views outside the Museum are some of the best in the city."], ["Reviewed July 24, 2017", 5.0, "Summer of Love Retrospective --- Olé!", "I made a visit to San Francisco early in June specifically to see this Summer of Love Experience exhibit that highlights the art, fashion and rock and roll of that wonderful summer in San Francisco 50 years ago. Whether you are an aging hippie, a wanna-be, or just interested to learn about this fascinating time in history, this is a wonderful multisensory way to experience what it must have been like. As you approach the museum, there are hints of the exhibit: DeYoung sidewalks are labeled \"Haight-Ashbury\", etc., and on the ground there are painted round pins (a nod to the lapel pins of the time) with messages such as \"make love not war\" \" trust no one over 30\" - you get the idea! I loved the idea of being gently moved back 50 years as I walked toward the doors of the museum, which also had these \"message pins\" on the windows. Once inside, the treasure of \"art, fashion and rock& roll\" was a perfect reminder of the amazing summer of 1967. In addition to the San Francisco fashions of the 60s for men and women that are displayed in all their glory, the music was such a kick to listen to! And a room that aimed to recreate a psychedelic 'happening' for museum visitors to experience was a kick: it looked like flowing lava lamp reflections on walls and ceiling of this particular area together with the music of the summer of love - and bean bag chairs if a visitor wanted to sit back, relax and relive the amazing experience. As you can see, I just loved it -- definitely something to see when you visit San Fran!\nShow less"], ["Reviewed July 24, 2017", 5.0, "Architecture", "Beautiful building. Small courtyard with powerful messages. The inner space is sleek. Ticket counters if you want to see the exhibits. The entry to the tower is free. Magnificent space up there with changing views. When I got up there, fog covered most of the view. Then it lifted, the sky turned blue and the views to the bay, the city and the Renzo Piano building across were amazing!\nShow less"], ["Reviewed July 23, 2017", 3.0, "They have a great scenic view", "Didn't care for the museum. Didn't have the time to go thru it. We did, however, enjoy the floor to ceiling windows on the viewing level. Some great views of the city. I also heard it is free. Did not see this advertised anywhere. Would sure be nice to know this in advance.\nShow less"], ["Reviewed July 22, 2017", 4.0, "Summer of Love Experience. de Young Museum.", "In depth exhibition of counter culture taking control of San Francisco in the 1960's. Art, fashion, protest, rock & roll. Details of people, history, clashes, drug overdoses, tripping, clinics, peace and love. Posters, clothing, music, pamphlets. Visual and audio experience. Nostalgia."], ["Reviewed July 20, 2017", 4.0, "Interesting museum in Golden Gate Park", "Wide variety of exhibits from the modern art wall spanning two floors to the textile arts display, ceramics, Oceanic arts and much more. Don't miss the elevator to the top floor for a panoramic view of San Francisco."], ["Reviewed July 20, 2017", 4.0, "go now for the summer of love till mid aug!", "In a separate building till mid august. You can experience that feeling again...legally. very well done show!"], ["Reviewed July 19, 2017", 5.0, "Summer of love ✌️", "Such a fun exhibit and a great prequel to exploring the Haight Ashbury neighborhood.\nThe posters clothes slogans and music were fun to explore and reminisce back to the good ole days.\nPure fun and enjoyment.\nI learned about the art of the 60's and gained insight as to how the life and times were forever immortalized and reflected in multiple modes of expression.\nA great way to spend 2-3 hours ..... we only did \"the summer of love\" but we probably could have spent the entire day viewing the other exhibits as well.\nIt was a nice (30 minute) walk to Haight Ashbury.\nA very groovy day ☮️\nShow less"], ["Reviewed July 17, 2017", 5.0, "Summer of Love", "We experienced the Summer of Love Exhibit and thoroughly enjoyed it. It is well laid out and expleained to the opint that I don't you have to be a \"child of the 60's\" to really understand and enjoy it. It's easily accessed, as tourists we did Uber and it was very simple.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Summer of Love", "We went to see the exhibit Summer of Love experience. I recommend renting the audio set to walk around with - you will be able to hear people who lived through that time and listen to the history and of what took place. How events evolved and the steps it took - people who were involved - history of clothing - development of bell bottoms - barter system - free health clinics - the ideas of community sharing - how everyone seemed to live harmoniously and worked out differences.\nLoved the music, art, posters and clothing. Watching grandparents and parents bring their young adult children was very entertaining. The disbelief in the young people faces - priceless.\nIf you grew up during this time - you must visit this exhibit and look back at the days of your youth.\nShow less"], ["Reviewed July 16, 2017", 4.0, "Summer of Love Exhibit", "Great limited time exhibit at a reasonable price in the heart of Golden Gate Park. Would highly recommend if you are interested in the power of the cultural, political and musical revolution of 1967."], ["Reviewed July 16, 2017", 5.0, "An Appetite for Art", "Nothing beats a gentle stroll through gallery upon gallery of creativity and artistry. I happened upon the Summer of Love Experience - a brilliantly curated exhibition documenting the Hippie movement that embraced the city 50 years ago. This museum also boasts in my opinion one of the best 360 views of the city and it's free too. Plus a delicious al fresco cafe on the ground floor. Sundays have never been easier.\nShow less"], ["Reviewed July 15, 2017", 4.0, "Frisco bucket list!", "Great half day excursion before hitting the Haight Asbury area!\nWe did the \"Summer of Love\" exhibition and Stuart Davis gallery! Very nicely done, traffic was awful coming and going so plan for that. Golden Gate Bridge was fogged in from the observation tower, go figure!\nShow less"], ["Reviewed July 14, 2017", 5.0, "Highly Recommended to Experience the Summer of Love Exhibit", "Well worth viewing the Summer of Love Exhibit. My husband and I chose this in addition to the regular museum pass. Although we were a couple of year too young to totally relate, it was a great experience. Afterwards we toured the main museum and also one up the tower to view the SF view. Very cool. If you are a military retiree or active duty, ask for the military discount which is not advertised.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Summer of Love and so much more....", "We went specifically for 'The Summer of Love' exhibition, which we tripped through twice. If you have any connection/interest in this revolution, the exhibit is a must see! The most fun we're ever had in a museum. We wtill had time to go up the Observatory tower....amazing views! The other exhibits were also fantastic.\nShow less"], ["Reviewed July 12, 2017", 5.0, "de Young Surprises", "The de Young Museum is always full of surprises. The permanent collection is interesting, smaller than the big museums you'll find in New York e.g., and the special exhibits are well done and worth the trip. We enjoyed the current \"Summer of Love\" experience (probably most interesting to those who lived during the time - 1967). The cafe is excellent (not cheap) with an assortment of prepared sandwiches, but also hot dishes. My biggest complaint is the layout of the museum and the lack of signs. We were there twice before we discovered you can take an elevator to an observation deck with a fabulous 360 degree view of the City. Parking is on the street...expect to walk a distance if you go by car, but the parks is a beautiful place to walk!\nShow less"], ["Reviewed July 11, 2017", 5.0, "wonderful musuem experience", "This musuem has a wonderful collection and great shows. Thr building itself is worth visiting.The food is wonderful in the cafeteria, and the outdoor scultures wonderful to see"], ["Reviewed July 10, 2017", 5.0, "A summer of excellence!", "We were on vacation and wanted to visit 'The Summer of Love' exhibit. We throughly enjoyed our time in the museum. Being tourists, we took the elevator up to the observation deck. Well worth the wait for the elevator! You can see all four directions of San Francisco, just breathtaking! The exhibits in the museum were just as amazing. Clean, helpful employees, awesome museum store. Well worth the trip!!!\nShow less"], ["Reviewed July 10, 2017", 4.0, "Summer of Love!", "Very interesting--had fun reminiscing of days gone by. de Young Museum always have interesting events. Recently saw the floral displays (have seen them for the past 3 years- beautiful)"], ["Reviewed July 10, 2017", 4.0, "Great museum in a beautifiul spot", "Along with SFMOMA and the Museum of Legion of Honor, de Young Museum is one of the gems of the San Francisco art scene. Its location cannot be beat. Give yourself a few hours to spend here. There are always exciting special exhibits along the permanent collection. There is a lovely gift shop and very good fare in the museum cafe.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Curiosity caught the Cat", "We aren't \"art\" people, so this wasn't originally on our list, but we were pleasantly surprised while walking up to the museum and the Summer of Love Experience. We took the Audio tour, and learned so much about all that took place at Haight-Ashbury. It was a great cultural lesson, and beautifully put together.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Free viewpoint", "We were in the de Young cafe (food excellent) and learned that there is a viewpoint on the 9th floor of the museum that is free to enter. It gives great views over the whole of Golden Gate park and beyond. It is well worth dropping in for and is one of the few things in SF that is free!\nShow less"], ["Reviewed July 10, 2017", 5.0, "Summer of Love Exhibit", "This is a fabulous museum right in Golden Gate Park. Parking is easy and the exhibit was very comprehensive and well done. The permanent collection is incredible as well. We enjoy having lunch there and on a nice day sitting outside with views of Twin Peaks and the sculpture garden is wonderful.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Lose yourself at the de Young", "On a recent trip to San Francisco with my sisters, we found ourselves walking through Golden Gate Park on a chilly, windy, cloudy day. We decided to take refuge in the de Young, which is situated conveniently within in the park.\n\nOnce inside, we first visited the cafe for some filling and very reasonably-priced lunch. Then, we lost ourselves in a world of American and contemporary art. They had some very interesting Dalis, and a Modigliani or two. They also had a large gallery where they paired paintings with descriptive poems written by students. (Loved that exhibit.) We also enjoyed their African and Oceanic collections.\n\nThough the museum is sizable, it's easily covered in a day or a long afternoon, and there's plenty to keep you occupied! Worth a stop!\nShow less"], ["Reviewed July 9, 2017", 5.0, "An outstanding educational resource. Check the listings to see if something interests you.", "This visit was for the Summer of Love exhibition, which mostly passed me by as a local teenager of 14 years in early 1967, but I was aware of the history, and hoped to learn more. The real theme was the revolution and methods of social change, and not the music, which is my primary interest. This is a very nice display space in a beautiful park setting, so check the listings to see if there is something that interests you during the period of your visit to San Francisco. Tickets, head phones, and parking are about $100 per couple for admission, which is par for the course in this fairly expensive city.\nShow less"], ["Reviewed July 8, 2017", 4.0, "Summer of Love Exhibit", "I visited the Summer of Love Exhibit at 3pm on a Friday. While it was not crowded, there were a surprising number of people there. The Exhibit consists of about 6 or 7 rooms and each had around 15 people in it. I was able to see all of the art up close and read the placards without waiting.\n\nThis Exhibit was $25 and I also purchased the audio tour for another $8. It is too bad that the deYoung does not have additional public or charitable support, because $33 seems like a high price for an average person to spend. There were no discounted tickets via AAA or other affiliations.\n\nThe exhibit with the audio was excellent. I noticed that some of the information on the audio was available to read in the exhibit, but much of it was not. I highly recommend the audio to enhance the enjoyment of this tour. And, if you use it, be sure to take the time to listen to the supplemental content. Also - in some rooms it was hard to find the signs that go with the audio so I have this tip. Just play the next number. The item you are looking for is usually described well enough that you'll see it. I learned a few really interesting facts from the audio tour. Also - don't ignore the items not on the audio - be sure to see everything!\n\nIf you appreciated the music or fashion of the late 60's or if you like history, you will enjoy his exhibit. The setting of the exhibit is very colorful and really sets the mood for enjoying the photos, fashions, album art, concert posters, and other artifacts. The only reason I did not rate this exhibit excellent is because the content was heavily overweighted with concert posters. I almost had the sense that the curator was unable to turn any posters away. There was one room dedicated to the posters, but then the other rooms had so many as well. The scope of the exhibit \"Summer of 1967\" is pretty narrow, which may be the reason that more photos and artifacts weren't found. I'd like to say that the best room was the one that discussed the free store, the clinic, and the diggers. The ideology and philosophies reflected in the written content communicated a sense of the youth and naivete of those who came to San Francisco to be free.\n\nIf you have not been to Haight-Ashbury, it is very near the deYoung. Look for the Summer of Love Brochure at the ticket counter and notice that it provides a map with numerous historical sites to go see. I recommend coupling a visit to this exhibit with a walk to see the sites afterwards.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Take your time - - there's a lot to love and you don't want to rush it!", "Perhaps the best way to experience the de Young is by allowing yourself a few hours, and by having absolutely no preconceived notions. Just look. Stop when you see something you love, and really, really enjoy being in the same room with that much beauty. It's an eclectic collection, and not everything will be to your taste - - but you'll find something to surprise and delight in every room.\nShow less"], ["Reviewed July 8, 2017", 4.0, "Summer Of Love Exhibition", "This is an exhibition about 1967 San Francisco. Lots of cool art, posters, clothing, writing, etc. Kind of nostalgic for me and my wife. Talked to quite a few there and seemed to be the vibe. Well worth going ...$20 admission for seniors. I always enjoy the exhibits at DeYoung. Would have rated a 5 but the ticket counter and directions we're a bit disorganized today.\nShow less"], ["Reviewed July 8, 2017", 4.0, "Beautiful art museum in a wonderful location", "The deYoung, the Japanese Tea Garden, and the Steinhart Aquarium (now the California Academy of Sciences) have been destinations for many school field trips over decades. My father had great memories of these trips when he was in grade school in the 1930s. All have been remodeled and renovated since then, but the draw is still there. The deYoung houses interesting special and permanent collections.....as well as offering art classes and special lectures for teachers and the community. A great place to spend an afternoon.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Celebrating the Summer of Love", "From downtown we hopped the MUNI at Powell Street and enjoyed a long ride to Golden Gate Park.\n\nThere were lots of lunch options before a ten minute walk to the the museum which is nicely surrounded by nature,.\n\nAs a now retired professor of American Art I was astonished by the depth of text book masterpieces, from Colonial times to the present.\n\nThere were unique works by the renowned Bay Area Figure Artists.\n\nThe special exhibition was the mind blowing \"Summer of Love Experience.\" It reminded us of the birth of psychedelic art and rock posters from some 50 years ago.\n\nBe sure to visit the museum when in Frisco this summer and be sure to wear some flowers in your hair.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Fresh take", "I have visited a couple of times now when in SF. It's always got interesting exhibitions. Engaging and eclectic is how I'd describe it. Also such a pleasant setting and a great cafe on site!"], ["Reviewed July 5, 2017", 3.0, "Building is nicer than the collection", "Certainly a few great pieces, but I think I would visit the Legion of Honor instead. The exhibits with extra cost did not seem like they were worth the expense! I did enjoy African American art collection which I have not seen before."], ["Reviewed July 4, 2017", 1.0, "Closed on 4 July - bummer", "After organising a whole day around a visit here on 4th of July I was really disappointed to find a handwritten \"closed\" sign at the front door. With only 3 days in SF from Australia this was a big disappointment. Academy of Sciences and everything else open today - why not de Young?\nShow less"], ["Reviewed July 3, 2017", 3.0, "Good museum, large crowds", "We went for the Summer of love exhibition at the De Young. It was a very busy week-end with lots of cars and not enough parking. We ended up parking underneath the museum at the parking garage and paid $24 for the privilege of parking close. We only had the time and energy to visit the Summer of Love exhibit, wish we could have seen the Monet exhibit but with the crowds it was not possible.\nShow less"], ["Reviewed July 3, 2017", 1.0, "Summer of Love a huge waste of time and money", "I felt ripped off. This exhibit was the biggest waste of time and money. $70 to bring my wife and kids for 15 minutes of boredom."], ["Reviewed July 2, 2017", 5.0, "Don't Judge This Museum by Its Exterior", "I was sad when the old De Young was demolished because it was an elegant, classic building, but the new museum, though not attractive on the outside, is a much better space for exhibits. Small gardens viewed through windows make the inside more attractive, and the large restaurant includes a lovely patio surrounded by grass, trees, and shrubs. My husband and I especially enjoyed the special exhibit commemorating the 50th anniversary of The Summer of Love because we lived in San Francisco in 1967.\nShow less"], ["Reviewed July 1, 2017", 3.0, "Museum Good . . .Summer of Love exhibit a Bummer!", "I am a poster artist from this era and very familiar with the artist work in this exhibit. Ther are a few really good displays explaining the process of taking the idea to final print and what's involved. The poster exhibit at The Denver museum a few years ago was better, though!\nSome people who weren't part of this generation and some who were, may take to the overall sights and sounds of the experience the curators tried to express here. But as for me, I was underwhelmed.\nAs far the museum in general, I give it high marks. A trip to the observation deck is a must!\nShow less"], ["Reviewed June 29, 2017", 5.0, "Great exhibit nhappening Now! Summer of Love. Really captures the Bay Area during the 60's early 70's", "Great exhibit nhappening Now! Summer of Love. Really captures the Bay Area during the 60's early 70's"], ["Reviewed June 27, 2017", 5.0, "Well curated museum with special exhibits", "This is the second time we have been at the de Young and we would go back tomorrow. The regular museum is well curated but the special exhibits are truly special. The Summer of Love currently there is a a great look at the 1960s. Highly recommend\nShow less"], ["Reviewed June 26, 2017", 5.0, "Fantastic", "This a beautiful museum of American , African art including the Hudson River School with some church,s and cole paintings along with Bierstadt and many others. You can spend several hours here. Nice cafe and lovely views"], ["Reviewed June 26, 2017", 5.0, "Revisit the Summer of Love 50 years later!", "My wife and I really enjoyed the Summer of Love Exhibition at the de Young Museum.\n\nWe developed a great understanding of the artists and processes that created the iconic concert posters of this era. Examples of the fashion and \"light shows\" of the period also helped in communicating the ethos of the Summer of Love. My only disappointment was that the music of the period was not prominent enough. More video snippets from the era would also have been helpful.\nShow less"], ["Reviewed June 26, 2017", 5.0, "The summer of love exhibition is a must!", "Recommendable! The colours, the music , the posters and photoes reminded me of a past time. 50 years ago more than 100 000 young people invaded SF's parks. Their influence on the rest of the world were extensive."], ["Reviewed June 22, 2017", 5.0, "What a great find!", "First Tuesday of month is free for starters. Intriguing building design. Very creative displays and special tower to view the city."], ["Reviewed June 22, 2017", 4.0, "Summer of Love Exhibit - Great but for Lack of Context", "I was a teenager in New York that summer of 1967. The De Young Show only put the times in context once saying thee was still was \".'50s conservatism\". Let me tell you what parents and the culture was like back then - ridiculously ignorant - no education of other cultures, so uptight. My mother once said \"Your generation talks too much\" !! And in elementary school we practiced \"bomb drills\" ducking in the hallways regularly...as in ATOMIC BOMB. Scared the heck out of us! It was time for some creative exploration of \"others\".\nShow less"], ["Reviewed June 21, 2017", 5.0, "The Summer of Love Exhibition was excellent !!", "I rate this venue as one of the best places to visit in San Francisco. East to get to and from using Uber. We saw the Summer of Love Exhibition and it was excellent. Relax and give youself at least 3 hours here. I highly recommend it. Something for all ages.\nShow less"], ["Reviewed June 21, 2017", 5.0, "We went to see the exhibit \"The Summer of Love\"", "The exhibit celebrates the 50 years of the Summer of Love area. Beautiful posters, clothes worn in those years and music from that era"], ["Reviewed June 21, 2017", 5.0, "Beautiful Museum", "We went to the DeYoung for the Summer of Love exhibit. It was an amazing exhibit, taking us back to 1967, which was a very memorable year. There were other very interesting exhibits as well -- one of quilts from Gee, Alabama and another of pottery from Central America. The cafeteria had nice sandwiches and wine and the weather was perfect.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Summer of Love", "The De Young had a special exhibit featuring the art and design of the Haight-Ashbury years from '62 through '68 or so. It was a very detailed exhibit with interactive details. There were a couple of other special exhibits with educational points. The regular exhibits were varied with a large group of primitives. I think there is probably something for everyone at this museum. We wanted to go up into the observation tower but it closed just as we were entering so be careful if you are there after 4 in the afternoon. We ate in the museum cafe which was very good. My only complaint is with the gender neutral restrooms. I am all for gender parity in theory, but in reality I still need a bit more privacy. But its restrooms are all gender neutral. I thought, perhaps, that meant that the stalls in the restrooms would be built with a little more coverage (no gaps, doors that go down farther), but no, they were regular stalls. There were lots of people in there and people were laughing about the shared space. I didn't feel \"unsafe\", but it would have been nice to have had a choice.\nShow less"], ["Reviewed June 18, 2017", 1.0, "Don't Waste Your Time", "I graduated from high school in 1967. My boyfriend attended USF and lived in the Haight. Grateful Dead, Big Brother, Jefferson Airplane!! When I heard about the deYoung exhibit, I couldn't wait to see it!!\nIt was such a disappointment!! It was 95% posters, (many repeated over and over throughout the exhibit), some strange clothes that very few people would have worn, a psychedelic \"tent\" with faded free form projected images (nothing like the real ones shown at concerts.) Just a couple photos taken in the Haight and Panhandle. I think the curators of this exhibit must have been very young, or very old, had never been around during the \"summer of love.\" With all the Bay Area media could help provide of historical records and video footage (and have been providing) there is no excuse for such a pitiful showing!! Too bad; it could have been wonderful!\nShow less"], ["Reviewed June 15, 2017", 5.0, "Great museum in frisco", "The exhibition currently showing was the 50th anniversary of haight Ashbury. This is a conveniently located museum in golden gate park. We did not see the American art but the haight Ashbury 50th anniversary with posters fashion and a freak out dance room was absolutely fabulous. Loved it and great friendly staff. My 21 year old daughter also loved it.\nShow less"], ["Reviewed June 14, 2017", 3.0, "Over priced", "I enjoyed the Stuart Davis exhibition much more than the summer of love exhibition. The summer of love exhibition was boring. It was just endless posters, one room would have been enough. There wasn't enough political and social information of what was going on at that time around the world. The exhibition only focused on a few bands as well. There could have been more fashion. I wouldn't call this an art exhibition, it was more like a crappy nostalgia room and it attracted the kind of people that just wanted to \"relive their LSD days\" (yes someone actually said that). The architecture of the museum is really nice though. The viewing level should have a balcony rather than looking at the city just through glass.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Oscar de la Renta!", "I went with my family to see the Oscar de la Renta exhibition. It was wonderfully curated. Everyone was enjoying this exhibition. My husband stayed outside by the park with my young son. Afterwards, we walked together and were looking at some artists that were selling their works of art.\nShow less"], ["Reviewed June 14, 2017", 3.0, "Check before you go...", "This museum was far from my hotel, I used Uber pool for $7, to get there. Arriving at the museum I found out there was a typo on there web site and the exhibit I was planning to see had closed. The museum refunded my money.\nShow less"], ["Reviewed June 13, 2017", 2.0, "Baby boomers Disappointed in Summer of Love exhibit", "Three of us (ages 68, 67, 66) visited the museum Saturday and were disappointed that there wasn't more video included in the exhibit. Overall, at the current ticket prices (nearly $100 total for the 3 of us), I would not recommend it.\n\n* The (free) 9th floor Tower was a great end to the exhibit - highly recommend going upstairs prior to leaving the museum for some fantastic 360 views of the City.\n* The outdoor Golden Gate Park Band performances in the amphitheater were much more entertaining and enjoyable.\nShow less"], ["Reviewed June 11, 2017", 2.0, "Summer of Utter Boredom", "Don't wast your time or money on the Summer of Love Exhibition here. Totally lame and boring. Curator didn't / couldn't get license for original music, tons of posters (a few quite fine though), a few mildly interesting photographs that could be seen many other places, but mostly dozens and dozens of fashion show mannequins dressed up in some dull-minded, 1980's rich kids idea of a Halloween costume party, \"Hey guys, let's dress up like 1967\". Not worth it.\nShow less"], ["Reviewed June 11, 2017", 5.0, "A world class museum", "The DeYoung is one of the great American Art Museums - one with international stature.\n\nIt is one of Museums we respect enough to hold membership in and visit every time we return to San Francisco which is frequently. It comprises with the Legion of Honor the Fine Arts Museums of San Francisco.\n\nA couple of years back,the DeYoung mounted a spectacular huge David Hockney show that was remarkably complete and hung, the De Young allowing the exhibition of his oversized works.\n\nIt's photography collection is first rate. The permanent collection covers the gamut.\n\nThe museum itself presents as an architectural achievement, note the cracks in the pavement entering. While it might seem trite, it's worth a trip to the viewing deck for the panoramic views of the San Francisco urb, bay and sea.\n\nLastly the museum is set in Golden Gate Park which is a pleasant setting for walks, weddings, etc.\n\nThe Restaurant of the DeYoung offers indoor and outdoor seating - food is good and moderately priced.\nShow less"], ["Reviewed June 10, 2017", 2.0, "Not worth the price, very disappointing", "With all the material available for this era, do I really need to see 6 rooms of posters? Yes, they are art, very good art. The fashions were great too, all 1/2 dozen in each room. But otherwise, what a disappointment. Where's the music, where's the history of the era, the neighborhood, the rise and fall of the movement? So much more that could have been done to show the special spirit that happened in this little microcosm of time and space. Who ever put this together had NO sense of the 60's, the summer of love, or the entire spirit of the times.\nShow less"], ["Reviewed June 9, 2017", 2.0, "Can't Compare with Other Major U.S. Cities", "Even with its new building, the de Young Museum cannot compare with other major museums in other large U.S. cities. The layout is better because the museum was redone, but the exhibits hold a ho-hum for me. Really not worth it unless you are an art buff and can tolerate the things that annoyed me.\nShow less"], ["Reviewed June 8, 2017", 2.0, "eh...", "If you aren't into serious art museums this place is not for you. Spent 30 min and had more than my fill. Spend your time at the California Academy of Sciences instead."], ["Reviewed June 7, 2017", 5.0, "Sunner of Love Exhibit", "Golden Gate Park is the west coast's answer to Central Park, and site of the de Young Museum. There are varying exhibitions as well as permanent collections of early American art, Oceanic art to view in an interesting facility. \n\nThe current exhibit through August is \"The Summer of Love,\" featuring photos, sounds, light shows, music, clothes, and posters of the summer of 1966 and 1967. My favorite part of this show was sitting in the bean bag chairs listening to the music of the day as light shows surrounded me and watching those that start into the space smile as they enter and smile recalling their \"summer of love.\" On a clear day it's worthwhile to visit the top floor of the tower for a wonderful view of the city.\nShow less"], ["Reviewed June 7, 2017", 4.0, "Free GA", "I looked it up & found out that the museum is free general admission on the first Tuesday of the month. This has been my first visit to the museum. It was a nice visit, very clean, no problems. They did have a few exhibits that aren't part of the free ga, so I didn't get to look at those. Overall it was a nice time.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Fascinating Building and Exhibit -- Summer of Love", "I thoroughly enjoyed the Summer of Love retrospective. It was a great reminder of the summer of 1967. My 28 year old son was fascinated as well. I don't think he had really understood what the hippie movement was all about.\n\nWe also enjoyed the permanent collection and the view across the city from the tower.\nShow less"], ["Reviewed June 4, 2017", 5.0, "A Full Day Here!", "Wonderful museum and be sure to visit the Tower for amazing views of San Francisco and beyond. I would say it is a hidden gem as it was not crowded."], ["Reviewed June 2, 2017", 5.0, "Utterly Beautiful Location & Good Museum", "I visited both the De Young and the Legion of Honor on separate trips. I've seen a great number of art museums in my life all over the world and wasn't disappointed by this one. For the artwork itself, I personally prefer the generally older artwork of the Legion of Honor, but when it comes to location the De Young cannot be beat. I think that the Golden Gate Park is the best city park in the entire world in which I have been (90+ countries and 50 states) and just the walk to the museum among the redwoods and other flora by itself is a great experience. Spending a couple hours in the museum accompanied by slow and long walks through the natural beauty of the park greatly heightens the experience. Both the De Young and the Legion of Honor could be seen in one day if one got an early start, but an additional long walk or taxi would be required for those who walk in. An employee at the De Young Museum told me that I could see both within 4 hours on foot -- not hardly.\nShow less"], ["Reviewed June 1, 2017", 5.0, "The Summer of Love Experience", "We visited the de Young museum to see the Summer of Love Experience. So many cool pictures, posters, clothes, memorabilia from the \"hippie\" experience that went on in the late 60's in and around San Francisco. Wish I had been old enough to experience first hand!\nShow less"], ["Reviewed June 1, 2017", 5.0, "Best Museum on the West Coast", "I will be honest with you; I am biased about this museum. I love it to death because they exhibited one of my all time favorite paintings a while back (La Conversation by Matisse) So I am forever in love with this place; I come back here on every single SF visit. Besides Matisse's painting, this architectural gem is well worth visiting from all aspects of a museum. The exhibitions, architecture, outdoor sculpture garden, the cafe...Everything about it makes me feel happy. While you're there, enjoy a glass of rose at the cafe for me!\nShow less"], ["Reviewed June 1, 2017", 1.0, "Architecture of building", "I find it it astonishing that a building that houses an art museum should be so ugly. Did anybody approve the plans before it was built?"], ["Reviewed May 31, 2017", 5.0, "Summer of Love Exhibition", "Visit made primarily to see The Summer of Love Exhibition it's a fine spot and exhibition well worth visiting and Museum has nice cool indoor and outdoor cafe for resting up following the exhibition"], ["Reviewed May 31, 2017", 1.0, "Summer of love exhibit ruined by nails on chalk board", "We were excited to go see the summer of love exhibit, but the screeching sound that was part of it (what it was supposed to be about, we have no idea; staff was also not able to tell what that piece was called) was like nails on chalk board, and we had to leave without seeing anything.\n\nApparently they had already had many complaints about this noise, but still part of the exhibit.\n\nThere was no warning of this.\n\nAvoid.\nShow less"], ["Reviewed May 30, 2017", 4.0, "Excellent museum in Golden Gate park", "We purchased tickets to both special exhibitions - \"The Summer of Love Experience: Art, Fashon, and Rock & Roll,\" and \"Stuart Davis: In Full Swing.\" My wife (an art historian) commented about the first special show that she was about \"postered out.\" The show largely consisted of posters from the 1967's, although there was a lot of material about their production that we found very interesting. The \"fashion\" part of the show consisted of sets of clothes on mannequins - most of them posed in ways that the folks back then would have never adopted! The Rock & Roll was largely loud, pulsing music throughout the gallery, although there was one room with music and light projections of the four walls with bean bag chairs to sit on. It caught some of the sense of those days but the light projections did not work very well as they were too faded out.\n\nThe Stuart Davis exhibit did not seem to have much of a theme behind it - it was just a series of his paintings with individual labels and no text relating one picture to the next. None the less, it was an enjoyable visit\nShow less"], ["Reviewed May 30, 2017", 3.0, "A unique collection of Californian, Meso, and Pacific American Art.", "The de Young Museum (located in Golden Gate Park) is a unique collection of Californian, Meso American, and Pacific American Art. Start by going up the observation tower for a great overlook of Golden Gate Park and the surrounding area. Next, make sure to spend most of your time looking at the Meso American and Pacific American Art on display. I found this to be quite comprehensive and well done. However, I was a bit underwhelmed by the modern/Californian art collection which I found to be average. This museum is worth the time if you have time for more than one art museum on your visit to the city.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Another SF museum standout.", "The 'Summer of Love' exhibition in honor of the 50th anniversary of those trippy times is a great show for anyone interested in learning more about that tumultuous time in US history. All aspects of the era are touched upon--fashion, politics and of course, music. A good selection of vintage Fillmore and Avalon Ballroom posters are on view (by the best artists of the day--Mouse, Griffin, Moscoso etc.). These are complemented by great photos of the day by SF photographer Elayne Mayes and others. A really great show.\nShow less"], ["Reviewed May 29, 2017", 3.0, "Was Not Overwhelmed", "My wife and I recently visited the deYoung Museum and we were both left rather unimpressed with the general collection. Outside of the interesting collection of South Pacific artifacts, the rest of the permanent collection seemed a bit wanting. I am pretty certain we will not be going back. There are much better museum options in San Francisco (e.g., Asian Art Museum, contemporary art museum).\nShow less"], ["Reviewed May 28, 2017", 5.0, "Architectural Gem in SF", "Just visited the \"new\" museum today, 25 years after moving out of the Sunset District when the \"old\" museum was part of a neighborhood walk. Wow! Stunning building, organically connected to the park, a joy to explore, and filled with wonderful contemporary art. Observation tower and low-key sculpture garden delightful. No blockbusters. Just beauty and joy.\nShow less"], ["Reviewed May 28, 2017", 3.0, "Really not worth it", "Weird collection and not really worth the time, Go if you have plenty of extra time. the summer of love exhibit was excellent but that was about it"], ["Reviewed May 27, 2017", 5.0, "Do not miss the Summer of Love Exhibit", "What a cool place! The Summer of Love Exhibit was really fun, also enjoyed the other exhibits. Had an outstanding meal in the cafeteria, falafel sandwich and mushroom risotto. Lots of great grab and go items, too. Definitely worth a visit."], ["Reviewed May 27, 2017", 4.0, "More like de Old (but good) Museum", "My family and I had about twenty minutes to look around at the de Young Museum before heading back to the pier. The museum was very well kept and very elegant. We looked at the gift shop and the cafe. The cafe has a wonderful selection of healthy snacks and drinks and the gift shop was a good place to pick up a souvenir. In general, the little pieces of art we saw were okay but not my cup of tea. I would recommend this place for adults but not children. Your children might get bored if they don't understand art and it's beauty. Overall, a decent museum.\nShow less"], ["Reviewed May 26, 2017", 3.0, "Well, I wouldn't bother", "I was hoping for a great exhibition of contemporary art and was very disappointed. Current display of hippie posters and clothing from the 1960s made up for it slightly. Very expensive admission of 30 $, really not worth the money. Nice viewing platform of the surrounding Bay Area, which is free.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Summer of Love, Stuart Davis", "Summer of love the current exhibit at the museum is worth the ticket price. If you lived in California during the 60's it will definitely bring back memories. Even if you didn't, it's a good look back at the San Francisco scene. The Stuart Davis Jazz Age exhibit was also enjoyable.\nShow less"], ["Reviewed May 24, 2017", 5.0, "a must for American Art", "Great location in the middle of golden gate park. Start you visit with a trip to the observation deck for a panoramic view of the City. Excellent display of the range of art from the Americas, including many pieces from Native artists. Scale of the museum is not overwhelming but could easily fill an entire day. Don't hesitate to eat in the on site café. Food was quite good and reasonably priced. Outside seating is available. Unfortunately the Modern and Contemporary galleries were closed on the day of our visit. Museum was well laid out with an easy flow between galleries.\nShow less"], ["Reviewed May 24, 2017", 3.0, "Average collection, good special exhibits", "My favorite part of the museum is the collection of Polynesian and African art. The rest of the collection is just average. I much prefer their special exhibitions. There is a great view from the roof....you can access without buying a ticket to enter the actual museum. The gift shop is a good one, as are the places to eat. It is across from the California Academy of Sciences, Japanese Tea Garden and in Golden Gate Park, so it is easy to combine with a day in the Park.\nShow less"], ["Reviewed May 23, 2017", 5.0, "A Must", "Great collections and beautiful building. Our favorite museum in SF. The Summer of Love exhibit was kinda short but very good."], ["Reviewed May 23, 2017", 5.0, "Don't miss this place", "We visited to see the Summer of Love exhibition. We weren't disappointed by either the exhibition or the museum. We spent over 5 hours in the museum and had morning coffee and lunch there. The food was excellent and based on the summer of love experience - palma ham, brie, leaves and strawberries plus a glass of rose. Highly recommended.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Spend the whole day!", "We thought we'd zip through this museum on a whirlwind few days in San Francisco. The Summer of Love exhibit was a fun recollection of times gone by. Posters of the time, 1967, were prominent. Psychedelic, wobbly for the eyes. Loved the display of fashions from prominent designers. But it was the installation by Leonardo Drew and the paintings of Stuart Davis that kept us in the museum all day and into the evening. See it while you can!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Summer of Love Exhibit", "My daughter gave me an early Mother's Day gift by taking me to this wonderful exhibit. I loved every moment of it. She made sure we had headphones to hear all the interviews, music, plans and accomplishments.\n\nI loved hearing how the artists wrote their songs, made the posters and fashioned the styles of the 60's. This is a great exhibition and if you get the chance, please see it.\nShow less"]]}}