{"Disneyland Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Disneyland Park", "url": "/Attraction_Review-g29092-d103346-Reviews-Disneyland_Park-Anaheim_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/3a/87/b9/sleeping-beauty-s-castle.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "23772"}, "address": {"@type": "PostalAddress", "streetAddress": "1313 Disneyland Dr", "addressLocality": "Anaheim", "addressRegion": "California", "postalCode": "92803", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 1.0, "Disaster at every turn", "Booked a trip to Disney for a week for my 4 year old daughters b day. We have 3 other children. Bought 3 day hopper online only to spend an hour at the ticket booth since staff could not find the tickets in “the system” conformation email apparently was not sufficient. Upon standing in line dealing with a cantankerous female booth worker we were told sorry can’t find them..... So, a not so quick phone call for refund followed and we paid a premium at the booth for same tickets. Finally got in mid day whooo hooo. Met with crowds long waits, over priced food and more unfriendly staff. Mind you this was the off season too. Ordered some food screwed it up, oh well ate it anyway. Several rides closed and Arielle’s Grotto closed. Daughter wanted a meal with the princesses as far as I could research there are no other establishments that offer this. Disney without princesses nice. Furthermore, parking. We made mistake of parking in the shopping area, downtown Disney. For a mere 48$ a day you can park here. We found out later after asking multiple people that you can validate it by spending money in the shopping district. Of course after we’d paid 48$ twice for two days. Booth employee said bring receipt, so ate a 130$ meal for six, brought receipt only to be told nope stamp on ticket only. Asked for a supervisor to plead our case. Brian, the apparent supervisor came told us what you can’t read the sign it’s been there all day since 7:30. The one that says validate you see, wow. Hmmm we are morons perhaps but explained what we’d been told, he said you can’t read? Wow ultimately paid 96$ in one day to park since we left for naps and came back. Ticket from earlier didn’t matter either. It’s down right criminal. Happiest place on earth Nope just look at all the other over paying suckers and ask yourself is it? Problem is putting a price on a child’s happiness a parents weakness of which Disney is the authority of exploitation. This was not our first trip been to Aulani and Disneyworld as well the service here in Anaheim fell far far short it’s become an unfriendly corporate corrupt world with disgruntled unfriendly employees.\nShow less"], ["Reviewed yesterday", 5.0, "My Happy Place", "Our 10th Visit and certainly wont be our last..Disneyland brings out the kid in my 54 year old body..love the rides, park is clean..staff are excellent..cant wait to go back!!"], ["Reviewed yesterday", 5.0, "There's nothing like seeing the park Walt built.", "People get caught up in the big things here but it's the little things that Walt touched that mean the most to me. Slow down and take it all in. It's a masterpiece."], ["Reviewed yesterday", 5.0, "AMAZING!", "I love Disneyland. We had a two day park hopper pass and did both parks. We should have bough a 3 day and spent more time at both parks because there is just so much to see!"], ["Reviewed 2 days ago", 5.0, "Family with Young Adult Children", "Do yourself a favor and get Max Pass! We were able to ride everything we wanted while we were there the first week of Jan. We heard the parks were near capacity every day. Plus the photo pass was amazing!"], ["Reviewed 2 days ago", 5.0, "Bring the kid out of you", "This is one huge park unlike 4 different parks in Walt Disney World in Orlando,Florida. You will feel like a kid when you are here. It's difficult to cover entire park in one day. I would recommend to take flash pass. It's totally worth it."], ["Reviewed 2 days ago", 4.0, "west coast usa", "a little tired, being winter areas were closed for renovation, but we had fun, watching the kids and characters. Be good if you could find out what was closed before you paid your money."], ["Reviewed 2 days ago", 5.0, "Family DL trip", "This was my grandkids first visit. The rest of us haven’t been in over 15 years. Overall we had a great time. I was very disappointed at the walled off center of the main entrance to Disney but I heard it came down a week after we were there. I brought my rolling backpack and security had a cow-every time\nI brought it in, but oh well, deal with it people!\nShow less"], ["Reviewed 2 days ago", 5.0, "Wonderful Visit", "We visited Disneyland in late December 2017 and had an absolutely wonderful trip. We used the MaxPass and what a difference it made in our visit. The park was crowded, but we didn't wait in line for more than 10 minutes for any ride. We would scan our ticket for one ride and while in line would book the next MaxPass ride. This made for short waits and more time spent enjoying the day. We (two of us) ate at Bengal Barbecue, ordered four skewers (three meat, one vegetable) and were satisfied for the rest of the day - we also threw in a dole whip, which was very tasty and lactose-free! We also followed the advice about grabbing a cup at one of the quick-service restaurants and filling it with water at the outdoor seating areas around the park - this helped to save money. We enjoyed the light show at Small World and the fireworks. The train ride was fun - we rode it twice around the park. Unfortunately, we didn't make time for a monorail ride, but hope to do that on another visit. Overall, the entire day was fun and we will be back!\nShow less"], ["Reviewed 2 days ago", 5.0, "Free Disney Fun!", "Make the most of your day at Disneyland by taking advantage of wonderful, free things. For Star Wars fans between the age of 4 and 12 years, sign up for the FREE Jedi Academy. Children learn light saber skills and test them against Darth Vader and Kylo Ren! Such a great photo op! Participants receive a cool pin and its all free! The Academy is offered multiple times throughout the day, but it does fill up. Upon arrival, immediately head to register at the kiosk by the Star Wars Launch Bay near the Tomorrowland Terrace. Ask a Cast Member if you can’t find it.\n\nA second important free offering is Fast Passes. These allow you to go to a ride and receive a return time to avoid waiting in line. Before you visit, read the details of how a Fast Pass works, which ride offers it, and plan which rides you will use it on. Then in the meantime, you can go on other rides with shorter wait times.\n\nFinding the free perks makes the happiest place on Earth even happier!\nShow less"], ["Reviewed 2 days ago", 4.0, "Trip to the happiest place on earth", "Disneyland is a great theme park! My only gripe is the ever increasing prices for tickets. I understand the reasoning behind it I just wish the prices were lower a few days a year. That being said I still will visit Disneyland in 2019 when Star Wars land is open!\nShow less"], ["Reviewed 3 days ago", 2.0, "Broken rides and lots of construction", "We have been to Disneyland in Anaheim several times and this was the first time encountering so many ride malfunctions. The Cars ride was down for several hours due to maintenance and other rides were cancelled after waiting in line. There is a lot of construction going on and the roller coaster at California Adventure is closed for construction along with the Ferris wheel. Upon entering Disneyland we were disappointed that we couldn’t see the beautiful downtown area and see down the street toward the Castle due to temporary walls put in place for construction. Many rides we never got to enjoy because of the ongoing ride failures. We had a 3 day hopper pass and only used 2 days.\nShow less"], ["Reviewed 3 days ago", 5.0, "AMAZING!", "My husband’s first time at Disneyland! He had a wonderful time and I couldn’t have been happier. The max pass was an amazing bonus."], ["Reviewed 3 days ago", 3.0, "Was not impressed!", "I was never at a Disney park, so when my daughter had a conference in Anaheim, I happily went along to take my granddaughter to Disney World. We went the beginning of November and most of the shows did not happen during the week. Mickey and Minnie Mouse were great on the weekend but during the week first thing in the morning, they were not very friendly! So disappointing! We paid the same as people in the busy season and I did not appreciate so many shows closed. Was definitely not the happiest place on earth and I will probably never go back.\nShow less"], ["Reviewed 3 days ago", 5.0, "a little spendy!", "great fun, but boy the costs have gone way up! 464 for 3 people for 1 day! skip the maxpass its worthless for 30.00 you do the same with fastpass and its free"], ["Reviewed 3 days ago", 5.0, "My Favourite", "This was my 5th time visiting Disneyland Park in Anaheim. It's my favourite over Disneyworld in Florida because everything is so close. You can walk basically anywhere saving you time and money. I can't wait to come back many more times!"], ["Reviewed 3 days ago", 5.0, "Expensive but a bucket list check!", "My family and I had an amazing time. It is rather expensive but it is a must. You forget the $ stacking up when you see your kids smiling. Get fast passes but be mindful you can only ride it once on them per ride. Spend a little more and get the hopper pass, too much to see in one day.\nShow less"], ["Reviewed 3 days ago", 5.0, "We live Disneyland", "We had a great time here. The weather was cool and lines weren’t too long. It’s a great time to come and visit."], ["Reviewed 4 days ago", 5.0, "Go early, prepare your wallet, amazing experience", "Castmembers are friendly and helpful, most of the rides are interesting and fun but food and merchandise is very expensive. I advise going at park opening or earlier as security and main gates while take at least 20 mins. By mid afternoon it’s literally a sea of people, shoulder to shoulder so it can be tough to get around and most rides have 30 min + lineups. I don’t think 1 day would be sufficient, plan for at least 2.\nShow less"], ["Reviewed 4 days ago", 5.0, "Disney Does it Right!", "Everything is top notch, fun as always. Tip for families with older children (10+) use the “singles” lines for rides. Later in the day Fast Passes close but single lines move quickly and most of the time we were still paired together on the rides (usually not sitting right next to each other though)\nShow less"], ["Reviewed 4 days ago", 5.0, "Loved Disneyland", "Loved this park. Have visited Florida and Paris in the past and this was at the top of the list of Disney parks. Friendly staff new and different rides compared to Florida. Lots on offer."], ["Reviewed 4 days ago", 5.0, "Truly Magical!", "I had never been to a Disney park, so this was a big deal for me! It was great! I felt like a kid, and I couldn't hide my smile (the entire time)! The staff were outstanding and the park deals they had for Canadians were too good to pass up! I literally have no complaints. Favourite rides included Space Mountain, Jungle Cruise (at night), and Big Thunder Mountain Railroad. The fast pass system was amazing and it allowed us to get on every ride at least twice. February was the perfect time to go! I'll be back!\nShow less"], ["Reviewed 4 days ago", 1.0, "Downhill Disneyland", "I grew up going to Disneyland - was there on opening day of Space Mountain in the 1970s. It used to be so fun at Disneyland - not too crowded, clean park, everything running & polite staff.\nAs an adult and parent - I have taken my daughter to Disneyland 3 times now - each time it got progressively less magical with the cost, the dirtiness factor, the LONG & RIDICULOUS lines and main attractions closed. This is really not the \"happiest place on earth\". My daughter rather go to the Santa Cruz Beach Boardwalk!\nShow less"], ["Reviewed 5 days ago", 5.0, "Awesome time", "Awesome, fun, exciting, adventurous, fantastic, spectacular, marvellous, happy and a supercalifragilisticexpialidiceous time was had by all."], ["Reviewed 5 days ago", 5.0, "Perfect for a father / daughter vacation", "I have been going to Disneyland with my daughter every year since she turned 4. We just completed our 4th visit, and had an amazing time. The rides are great, lots of food options, and I highly recommend going to the \"Royal Theater.\" Its a great way to pass the time while you're waiting for your next fastpass, and if its hot you can get of the sun and rest your legs.\nShow less"], ["Reviewed 5 days ago", 5.0, "DISNEY MAGIC - RENOVATIONS TAKING PLACE", "It was x21 years since my last visit. January 2018 was listed as a quiet time in the parks - even with our early magic hours to gain access from 9am - the queues were so big outside - we didn’t enter the park until 09:50am which was a shame. Main Street was actually boarded up straight from the entrance to the castle. This was also unexpected and didn’t allow us to get the photo pass pics we wanted. We have been to Paris and Florida in the last x2 yrs so wanted to get the same pics on main st. Next time. I recommend queuing at city hall (guest services) to get free badges - ‘MY FIRST VISIT’ etc. The park was spotless. Specialty treats & Disneyland only merchandise. Classic rides - Peter Pan, Pinocchio, dumbo (closed), big thunder mountain, space mountain, it’s a small world, mr toad, haunted mansion etc. Great fun. Specialty dining was worth the extra $. Photo pass was a much better offering than at DLP. A marching Disney band relaxed the Main Street parade. No fireworks. A good visit - but a bit of Disney sparkle lacking. Florida customer service still has the excellent record compared to other parks. Take plenty of £€$ - you will need it\nShow less"], ["Reviewed 5 days ago", 4.0, "First visit", "My husband and I planned our first trip to Disneyland finally after living in Florida for over 20 years. Of course the parks and property are smaller than Disney World but we had an amazing trip. Would definitely recommend staying on property if possible because of the convenience. Unfortunately the week of our trip all of Main Street and the storybook canal boat ride were under construction. I understand sometimes attractions are closed for refurbishment but the whole length of Main Street at one time seemed a little excessive and took away from the magic slightly especially being our first trip.\nShow less"], ["Reviewed 5 days ago", 4.0, "A magical place for kids", "If you have kids then this is a must see, must do adventure. While it is fairly expensive (look around for specials and discounts), it's something you need to experience at least once in your life. Make sure you plan on at least 2 or 3 days to visit because you can't see it all in a day. If you want to whole experience, stay at o e of the Disney hotels but once again, it will cost you. There are plenty of hotel options close to the park if you are on a budget and most offer transportation to and from the park.\nShow less"], ["Reviewed 5 days ago", 4.0, "Day trip to Disneyland", "Nice day at the park. Crowds were as expected, but longest wait without fast pass was 45 min. We ate at the Golden Horse Show Saloon and stayed for the show. Fun show, they grabbed some people from the tables to join the show, so be warned if you side down front. The foot traffic in New Orleans Square got pretty crazy when people started gathering for the Fantasmic show. Be ready to come about one hour early if you want a good spot for the show.\nShow less"], ["Reviewed 6 days ago", 4.0, "Make sure you get a fast pass!", "If you want to ride your favorite ride make sure you download the Disneyland app. Not only does it give you average wait times you can download the fast pass to get on rides quicker. They only release a limited number of fast passes in a time period and you can only have one FP at a time so get in quick. I was very disappointed that we weren’t aware before we went that the whole Main Street was boarded up therefore no parades or fireworks at night. :( Apart from this we had an amazing couple of days and came home with some wonderful memories. Not for the faint hearted though. Have to be prepared to battle crowds and do a lot of waiting in queues. But apart from that this big kid (48 years young!) had a magical time! :)\nShow less"], ["Reviewed 6 days ago", 5.0, "Amazing", "This is an amazing place, lots and lots to do. Some lovely eating places. I really enjoyed my time there. I am not young, but went on lots of the rides, ideal for adults as well as kids. This is in an ideal situation in California, to go with the flow or just sit and relax, its all there waiting for you\nShow less"], ["Reviewed 6 days ago", 5.0, "After 38 years, I finally made it!!", "I was suppose to go when I was ten years old, but my Mom wouldn’t let me go with my Grandmother...well, 38 years later I finally made it. So amazing, I’ve been to Disney World 8 times, but it was nice to finally see where it all started.\nShow less"], ["Reviewed 6 days ago", 5.0, "One of my favorite places!", "My hubby and I started going here right after we got engaged in 2013. It is never a dull moment. Since we live in Texas, for us, going to Disney is worth it since it is not a place we go to regularly. When we go, it is always clean. They offer so many different types of foods and rides, and attractions. Get there early, and you can enjoy several rides before it starts to get really busy.\nShow less"], ["Reviewed 1 week ago", 5.0, "Disneyland Park was so awesome", "The Disneyland Park was so awesome. I really enjoyed my dinner at River Belle Terrace and I loved the show Fantasmic!!"], ["Reviewed 1 week ago", 5.0, "This is the second visit. I love it!!", "I was run over by a wheelchair but still it was fun. We joyed eating around the park. We will be back with more of our Grandchildren."], ["Reviewed 1 week ago", 1.0, "Such a disappointment", "We (a family of 10, ages 2-68) all visited Disneyland & California Adventure Park on February 16 & 17. It was a waste of time & money. Adventure Park: maybe 4 rides for people over the age of 7 and the waits for those rides were rediculous (1.5 - 2 hours). Many of the rides were closed or broke down during our visit. Next day at Disneyland, again rides closed, long waits, rides breaking down left and right and way too many people! We should have been told more about the parks when we purchased the tickets or even when I called in advance to ask questions. One park is primarily for little kids and the other, unless you pay for the Fastpass app and figure out how to use it quickly, don't waste your time or money going here. I personally cannot ride any rides due to medical issues, but still had to pay full price (rent for the space I took up while standing for hours waiting, possibly??)\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun day", "Finally took family to Disneyland even though they are teenagers & it was a day which brought out our inner child. It was very busy, so lines for some rides were very long so we didn't go on as many rides as we would have liked to. We also missed out on street parade, we were told it was due to renovations on Main Street. All in all had a fun family day out.\nShow less"], ["Reviewed 1 week ago", 5.0, "Enjoyed it with fast pass", "Enjoyed the rides. Sadly didn't have many with photo ops but was great. We went on all the rides we wanted and still had time. We also enjoyed the night show. I liked the Disney gallery a lot"], ["Reviewed 1 week ago", 1.0, "not good", "go somewhere where there were some guards who came to me that they thought it was me who did something criminal or something and I did not even get the money back! 1300kr away on nothing"], ["Reviewed 1 week ago", 5.0, "Lives up to the dream!!", "Promised my mum I’d take her here for her 50th a number of years ago and thought I better keep to my word - this place is amazing no other words for it! One tip though is if you are doing other parks do this last otherwise the other will seem a bit dull in comparison to that Disney touch.\nShow less"], ["Reviewed 1 week ago", 3.0, "Biggest disappointment of our trip :-(", "Sadly the illusion of Disneyland was greater than the reality. Our first visit was on the Monday and it was excessively packed with people, strollers and mobility scooters. The main street is under construction which made for a lot of congestion and the queues for the rides was never ending and then sadly the rides fell well below expectations. We visited the park again on the Wednesday and the crowds were reduced minimally but made for a lightly better experience but again the rides are a huge disappointment compared to a lot of the rides at other parks around the world. We enjoyed California Adventure Park a lot more and would recommend spending your time there.\nI was disappointed that you hardly got to see any of the Parks Characters and when we finally did see Mickey the lady had cut off the line so we missed out on a photo with him. Never saw any Disney Princesses over the two day period which again was a huge disappointment.\nThe reality of Disneyland is over priced food, poor - average rides and lots of standing around in queues.\nThe free Fast Pass every 2 hours worked good and that saved us a long wait on a couple of rides and we had downloaded the Disney App to be able to see what the wait times were around the park, so I definitely suggest you download that.\n\nPack plenty of food and snacks/water in your back pack so at least you can eat while standing in the long lines!\nShow less"], ["Reviewed 1 week ago", 2.0, "HUGE disappointment.", "After years of wanting to go to a Disney park it was such a disappointment. We didn't even spend the whole day there as it was pretty boring. Rides weren't that great, we saw one character in the park the whole time, the park was mainly just souvenir shops and restaurants at overcharged prices. No fireworks. No parades. Nothing that I imagined at all. The entertainment at the saloon was boring and slapstick and I am a professional performer. Waste of over 200 dollars. Truly disappointed in Disney, it just felt like a money making machine. The runaway train ride which I begrudgingly lined for hours as I knew it was a worse version of a great one we have at Alton towers at about 30 quid for the day! Don't even get me started on Space Mountain!\nShow less"], ["Reviewed 1 week ago", 5.0, "Serioulsy - THE HAPPIEST PLACE ON EARTH", "It is hard not to be happy at Disneyland! The detail in everything is amazing. The food is delicious, you want to be careful because you feel the need to buy EVERYTHING and the customer service is.... well, Disney - the best out there! I would LIVE there if possible. Even the increasing (somewhat ridiculous) ticket prices will NOT stop my from my happy place. Thanks, Walt for the legacy of wonder and happiness you left the world...\nShow less"], ["Reviewed 1 week ago", 3.0, "Vacation day", "Sorry to say but there were a few things\nNegative about this visit\n\n1. Ticket machine jammed at entry to the park;\nI understand these things happen, but it took almost 20 minutes to get sorted\n2. No one at the ticket gate understood how the\nFastpass really worked on the app\n3. The 3 times we went to use the fastpass the\nRides were not working because of mechanical\nChallenges\n\nSo basically we paid extra for fast pass and it\nwas never used and actually irritating\nShow less"], ["Reviewed 1 week ago", 5.0, "3 days we will never ever forget, 3 days couldnt wipe the smile off our faces", "where do you start, smiles, laughter, mind inspiring beauty and joy.\nwent with 3 kids 8/ 13/ 15 and 4 adults. the enjoyment had no age limit. we have been saying we will go there for over 10 years. our experience did not disappoint.\nFebruary is their winter, a great time to go as the lines are only 10-20 mins long. the weather cool but the sun warm. t-shirt and jeans each day and no issues.\nThere was renovations on a few things but the entire park was amazing. the service, the smiles the rides all of it.\nFavorite ride........Starwars 4d experience and space mountain, i dont normally do rides but these two blew all my senses. most hated ride \" pirates of the Caribbean\" and the haunted mansion. the pirates ride was a hour wait most times, after arriving early one morning and lining for 10 mins we went on it. dont get me wrong amazing inside the ride, but if i had of waited any longer than 10 mins i would of been so angry. same deal with the Mansion ride. disappointed after waiting so long.\nMinne & mickys houses where a treat and very cool. As are the characters themselves, it was a family treat for us all to meet them.\nWe had a 3 day park hopper and we covered all we wanted. we did 2 days Disney and 1 day 2 nights at the adventure land park. if you love rides you will need more time, but dont forget to stop and look at the park and its facade too. at night Disney streets are so stunning. the park was a dream come true, just dont spend all your time lining up for rides there is so much to see and enjoy that doesn't involve a line.\nShopping there was amazing, but be prepared to blow your budget.\ni had one teen and the star wars shop alone cost me. Not extremely expensive, but so much to choose. WE looked around and left the shopping for the last day to ensure we got what we wanted and thought it over for a day or two before spending on ever thing.\neven if you only do this once in your life, it is well worth it.\nTHE HAPPIEST PLACE ON EARTH FOR SURE !!!\nShow less"], ["Reviewed 1 week ago", 5.0, "Disneyland fun", "This trip my daughter used an electric scooter due to surgery. This park is older so some of the queues don't accommodate the scooter and you have to go to the exit. Stop at the city hall to get a map that tells you which rides you go to the exit. Once at the exit they will give you a return time to come back and ride the ride...kind of like a fast pass. We didn't find out until the last day you can have a fast pass AND a return time at the same time. We were helped by cast members at every ride because she couldn't do stairs and they gave her extra time to get into and out of the rides without being rushed. The classic rides are at this park and new ones are coming. When we visited some attractions were down (splash mountain) and they had the entire main street half blocked. It made it very difficult to navigate scooters and strollers through this area. We have been here many times and love this park. This time we experienced it a new way with the scooter and I am grateful for their accommodating help.\nShow less"], ["Reviewed 1 week ago", 5.0, "Annual Disney Trip", "It’s always a blast to go to Disneyland. Going over President’s Day Weekend was awesome because the park wasn’t too crowded."], ["Reviewed 1 week ago", 4.0, "Good times but long lines", "The whole setting and the themes of this place is gorgeous to be in,and the rides are pretty fun too.The food is also pretty to look at and tastes good.However,even if you spend the whole day there,you could probably ride about 5 or 6 rides.The place is quite crowded which makes lines extremely long and tiring to be in.You have to stand in line for about an hour for each ride which is crazy,but besides that,the overall experience is great.\nShow less"], ["Reviewed 1 week ago", 5.0, "2 words - FAST PASS", "I found it difficult to find information on the fast pass system until we got there.\n\nFirstly, fast passes don't cost anything. It is just a queuing system.\n\nNot all rides are FP, only the most popular.\n\nGo the a ride that has the Fast Pass system and scan your entry ticket to get a fast pass for a particular ride. Go on other rides in the area and come back at the time shown on your fast pass and enter through the fast pass entry. As soon as you use the fast pass, get a fast pass for the next FP ride.\n\nYou can only have one fast pass at a time.\n\nWe were at Disneyland during a very busy time and still managed about 3 rides per hour.\n\nI love the Fast Pass system and especially love that it doesn't cost any extra. Well played, Disneyland!\nShow less"], ["Reviewed 1 week ago", 5.0, "Disneyland need I say more", "Your bank account will hate it and your body will be exhausted but too see the smiles on your kids faces it’s well worth it."], ["Reviewed 1 week ago", 5.0, "Sharing the Magic", "We were able to go to Disneyland with 10 of our grandchildren, ages 2-18 and their parents. Some of them have been before and for some it was their first visit. There is something for everyone! Old favorites and new experience on the horizon.bwe used the fastpass system and were able to experience everything we wanted to. It did feel more cramped with so much construction. My husband who had not been for many years enjoyed the fact there was so many places to sit.\nShow less"], ["Reviewed 1 week ago", 5.0, "Happiest Place on Earth", "It took me 56 years to make my first visit and it was great fun. Such an icon from my childhood watching Disneyland every Sunday night on TV. Very busy even though it was winter. Lots of queues as you always expect in theme parks. The original and best. Lots of renovations going on so no parades or fireworks unfortunately. Fantastic was great but get your spot early.\nShow less"], ["Reviewed 1 week ago", 5.0, "Makes you feel like a kid still", "I LOVE DISNEYLAND! I have been to Orlando and Cali, both are great. Both have plus and minuses. Neither will disappoint. Great time is promised. Amazing how clean a park could be. Terrific job of making this place special."], ["Reviewed 1 week ago", 5.0, "Always the happiest place on earth!!", "Disneyland is always the happiest place on earth! The park is always clean and the people are always friendly. Despite all the construction and the refurbishments, there was still so much to do. The Max Pass was worth every penny! It helped make the most of our time in the park. I just wish we knew where the Wifi hot spots were earlier on in our trip. (They are marked on the park map)\nShow less"], ["Reviewed 1 week ago", 5.0, "First Visit!", "This was my first visit to any Disney Park and it was wonderful! The cast members from the tram drivers, ticket sellers, shop people, characters and cleans were ALL wonderful and SO helpful. We rode some rides, enjoyed the sights and ate dinner. Parking at Mickey and Friends was easy and the walk to the trans was reasonable. However the drive down 5 was ridiculous. Three and a half hours to drive 75 miles! Plan carefully when driving.\nShow less"], ["Reviewed 1 week ago", 5.0, "So Much Fun!", "We all loved Disneyland, what a great place to have some great family fun. So much to see and do, even if a ride was busy there was always something to keep the kids happy. We will definitely be coming back when Starwars opens, can’t waut to see what they come up with. So much detail in the park now, so my expectations are pretty high for this coming attraction! Simply, the happiest place on earth!\nShow less"], ["Reviewed 1 week ago", 5.0, "Never fails to impress", "What can I say. We love it here. Cast members go out of their way to help you, and they're so good at even if the lineups are long, giving everyone something to look at while you wait."], ["Reviewed 1 week ago", 4.0, "Sleeping Beauty Castle", "Who doesn't love the Magic Kingdom but as usual this time of year, a several rides were closed including Main Street trolley which made picture taking impossible."], ["Reviewed 1 week ago", 4.0, "Happiest place on earth , nuff said", "Wife and i visited Disneyland at Anaheim over the presidents day wkend holiday , and the park was packed ! However, this did not dampen our spirits as we managed to ride many of the more thrilling rides thru the usage of the fast pass distribution which gives faster access at a given 1hr time frame . You are only allowed one fast pass per every 2 hrs , so pls plan ur park activities well . All in all, always something for everyone at the park and weather was great!!\nShow less"], ["Reviewed 1 week ago", 3.0, "It's showing it's age", "Having been to every Disney in the world and here 8 years ago, it was a shame to see that not much has been added/updated since the last visit. When you compare to Disney World in Florida, this feels very dated. Many things were closed for renovation which, although annoying, does hopefully mean it's getting the much needed upgrade. I would hold off going until it's had the facelift so needed.\nShow less"], ["Reviewed 1 week ago", 5.0, "John", "We are repeat customers who come visit the park once a year. The tradition started with my parents and I’ve continued it with both my sons. I simply enjoy it and will continue to do so for many years to come."], ["Reviewed 1 week ago", 4.0, "Fun, but it's not Disney World", "We are regular visitors at Disney World, so thought we'd give Disneyland a try. While it was fun, it was just not the same Disney service that we are used to. It felt like a really nice Six Flags. They did have a great variety of rides, but no shows. The weekdays were not too busy, and we could relax and enjoy ourselves, but come Friday about 5:00, watch out all of the locals came and it was jam packed all Friday evening and all day Saturday!! We've never seen crowds like we experienced at Disneyland.The line for Dole Whip looked like it was a Mile long! For true Disney fun head to Florida!\nShow less"], ["Reviewed 1 week ago", 5.0, "Disneyland", "What can you say? My first visit my wifes second, its busy but great some attractions are closed but most are rolling along tried all the ones that were open. Fast past system works great and lines not to busy. Music and entertainment at every turn. Met Mickey, Capitan Jack Sparrow and saw lot's of other character's . The Disney cast members love Disneyland and will assist you to help you enjoy your time in the park. If your near Anahiem you have to stop at Disneyland\nShow less"], ["Reviewed 1 week ago", 5.0, "First time to Disneyland for my wife", "The crowds in February are great. Only downside was the walls in different areas for refurbishments. Either way we had so much fun! It's always so clean and nice there. It was the first time for both of us to DCA. Same situation with a huge overlay going on at the pier. Besides that we had tons of fun over there too\nShow less"], ["Reviewed 1 week ago", 5.0, "Love the Disney creativity", "Yes, Disneyland has lots of great rides. However, it is the creativity that makes Disney so special and different from all other theme parks. Love the creativity, fun and a beautiful way to spend the day with friends."], ["Reviewed 1 week ago", 4.0, "We did it", "The Park is very well done, but even a month like February is very full. You have to queue 30-60 Minutes for every ride and also for eating, although it is pretty expensive.\nHere some tips:\n-Buy your ticket in Internet, it's much cheaper\n-Buy fast pass, it's worthy\n-Bring something to eat\n-Avoid the Parkhouse, it's too expensive\n-Check the weather forecast\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome is the word .. not Disneyland.. hehe :)", "I have been there already twice and still the best feeling. The parks are well organized and a lot to do in a day. Be prepared for fun fun and more fun :)"], ["Reviewed 1 week ago", 4.0, "One Day at the happiest place on earth", "Our family spent a lovely day there Friday, February 2nd and, although I find it hard to criticize the Happiest Place on Earth, a couple of small things could have made the day so much happier. We knew to expect at least one major attraction to be down for maintenance (that day it was Splash Mountain), but by the end of the day, Thunder Mountain and Space Mountain were also shut down. These were three rides the kids were looking forward to and did not get to ride. We had a fun day, but with one day ticket prices at $120 a ticket plus $20 parking and three major rides down, it did mtake the overall “happiness” down a notch or two. Just our bad luck, I guess. Also, no fireworks was a bummer too!\nShow less"], ["Reviewed 1 week ago", 3.0, "It was good", "We booked before they announced that they were do work on the park coming all the\nWay from the uk I was really worried that we would miss so much, it wasn’t as\nBad as a thought we didn’t see many characters about and for a Wednesday/ Thursday it was very busy we only managed 4 rides but we wasn’t that bothered we just enjoyed walking about in between parks. Im glad we can say we have done Disneyland in California :-) only thing I didn’t\nLike was coming out and seeing homeless men carrying children with a sign homeless it really upset me.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun day", "Went 2 times first time we had VIP guide . and 2nd time our own lots of attraction the put it all together very close by. Day and night Parade, mickey magical is unique and Fantasmic is as usual if you had in Disney Hollywood studios in Orlando.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Love Disney Land", "This was our fourth visit and we still love it. It’s not cheap but it’s worth the visit. I would definitely go again. This time was with a teenager and still had a great time."], ["Reviewed 2 weeks ago", 5.0, "Fun for the whole family", "What an experience. The training they take with their staff is amazing. The characters are so good with the kids. We never felt like we were being rushed, and the characters took the time to speak to the kids and ask them questions. Even when my niece got shy and didn't say much, they kept the conversation going while at the same time keeping her involved without her doing much more that stare wide eyed and nod. Go first thing in the morning and hit the rides you want to hit early as the lines do get long. Ride attendants were great at making sure all the seats were filled up and the lines moved as quickly as possible. Learn the fast pass system as that helps speed up the experience, although for us the most we waited was 1/2 hour. We spent 3 full days there (Mon-Wed open to close) and I am not sure if I saw everything. Enjoyed the experience more than I thought I would.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Download that APP!", "Disneyland on a Monday can’t be as bad as Disney on a Saturday right!? Boy was I wrong, maybe due to the construction in Disney and some rides being down at California Adventure might have played into the over crowdedness. You can’t stop the rain but you can prepare for it! The Disney App is life! I strongly recommend using the app prior to attending the park just so you can become familiar with the app. It has a map of both parks, tells you the wait times of rides, your tickets are saved on the app, character locations, restroom locations, guest services locations and you can fastpast from the app so you don’t have to walk to the ride to get your fastpast!!! You can also make reservation from the app which was so clutch!!! If we didn’t have the app my sons first experience would’ve been a huge disaster!! Download that App!\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Disneyland Park", "There is a lot of construction going on and Main Street was partially closed. Even going in the off season during the week it still seemed really crowded with the center ofMain Street barricaded down the entire length of it. And with it being barricaded there is no Main Street parade. If you are going to go I would recommend going after all the construction is finished. As usual Disneyland is very expensive.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Under construction", "I am so bummed that our Disneyland trip was sub par. Many parts of the park are closed, including the main st...this is located at the main entrance point of the park and one of the most iconic sections. Large walls lined both sides of the road, forcing patrons to choose which side of main st to walk on. It also caused congestion and took away from the charm of the park. Not to mention the walls were so tall and took up main st from start to finish, you couldn’t even see the Walt Disney statue or castle. Splash Mountain was also closed as they were doing work it. Additionally, parts of Small World and Fantasyland were closed. To be honest you could tell the whole park is going under a revamp. This is something Disney did not explain before going. A part of me feels like we were gipped out of the true experience. I wouldn’t pay to go here until all of the work is complete. I’m sure it will look great in the future but it was very much a let down as I know what the park could offer if all it’s sections were opened. And Disney, if you read this, don’t cheat your customers, let them know about these things ahead of time.\n\n\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best Visit", "My Wife and I went to Disneyland and California Adventure the day before Valentine's day. Was the best trip we've had there. The weather was perfect. The lines were the shortest I've seen in a very long time. We literally walked on to several of the big rides. We were able to sit and have a nice sit down lunch and dinner, not getting rushed because of the crowds. There was some construction going on, but didnt mess with our day. Great day!!!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Simply magical", "There are theme parks and attractions all over the world, but Disneyland is the only park that is truely magical! Get there early before park openings and take advantage of the park before the lolleygaggers wonder in. The first few hours you can get more done in the park than the entire rest of the day combined!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "We were there from 9am to midnight !!", "They say it's the happiest place on earth (well, apart from the overcrowded issue). Indeed they have a lot of rides, a lot of nice backgrounds and characters for photo taking. It's a blessing to grow up in the disney era where you can sing along when they play the theme songs. A magical experience. My only advice is, please plan your trip wisely. This place is huge, if you miss a show or you miss your meal time, it's gonna be tricky to re-arrange your schedule. Apart from that, definitely one of the places you need to visit in your lifetime.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Always great.", "Had a great time this year at Disneyland even with Main Street being partially blocked due to the refurbishment of the street. Disney is always fantastic you just have to roll with the crowds. We went during the typical slower times and it was still busy. All the rides are really fun and just as it says, \"happiest place on earth\". The exciting new thing was seeing the construction of the new 14 acres addition of the new Star Wars Galaxy's Edge to be open in 2019.\nOne thing I would like to add is during our time at the park I accidentally left my back pack in Tomorrow Land and didn't realize it for two hours. Panic set in because it had my wife and daughter's IDs, credit cards, and cash in it and I could not remember where I had left it. After about an hour search and a lot of help from the Disney staff, we found my back. A very nice lady that worked at one of the food carts had placed it at her station knowing that someone would be coming back to look for it. Thanks Disneyland staff for being great.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great time of year", "For couples with no kids, Feb is awesome before presidents weekend and spring break. We did not buy fast pass and with so little crowd, we still road all rides with little wait including the popular ones. Food lines are pretty long so bring a sandwich.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun and leisure", "We enjoyed our entire day in the park. it was a wonderful experience. To make the experience even better i would like to suggest the management to make more ticketing counters at the gate in order to cater the crowd on busy days. I have spent one hour to get the tickets in the queue on Sunday 11th February.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "4th Time", "Been to Disneyland 4 times now (1st time prior to kids and the rest with the kids). My kids are in their teens now and any trip to Disneyland is always fun. Absolutely love this place and I am still amazed and happy to be inside the park. It does get busy so you just have to plan your day well.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "The original and the best!", "We got a 5 day 2 park pass. We did two full days at each park and asked our kids which one would they want to spend the last day in and they said this one.\n\nAlthough its got some of the older rides, there seems to be a lot more to do here. The night time lights show gets very crowded however, so make sure you get there early to get the fastpass for this.\n\nThe surprisingly good Matterhorn Bobsleds was one ride that we enjoyed more than we thought we would. Space Mountain was amazing as well, but some of the other ones like the Star Wars and Buzz Lightyear rides, were ones you only had to do once.\n\nIndiana Jones was good fun.\n\nThe only ride closed while we were there was the Big Thunder Mountain Railroad, which we'll have to catch next time.\n\nThere also seemed to be a lot more characters & princesses in this section of the park, which was great for the kids.\n\nWe were there during the Halloween period, and they did a great job of dressing everything up. A must do!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "First time visitor!", "Have been to Disney World before, first time Disneyland. We decided to do the max pass along with our ticket and it was totally worth it. It gives you a fast pass with out having to be in the area of the ride you want. And any Disney professional who takes your picture with any character or at any designated area you get all the pictures! Worth it! When we were there and they said til spring time, so something to keep in mind if you go in the next couple months. The main street is blocked off with construction. There are no parades at this time or fireworks with the castle. Knowing this before you go will help with decisions and experience. We did not know this and was a little disappointed when seeing it. However it did not ruin our experience. We had a very fun time! Spent the day. We even did a fantasmic dining package. I highly suggest. And don't forget to go through the castle where the sleeping beauty story is displayed.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Senior Fun", "Still the happiest place on earth for me now a senior at 67! Still enjoy all the rides and Fast Pass system so standing in long lines is not a problem. Always a pleasure to enjoy the new attractions at the park."], ["Reviewed 2 weeks ago", 2.0, "Meh...Terrible Traffic Control and So Much Under Construction", "Love you Disney, but barricades all the way down Main Street made foot traffic a nightmare. The Indiana Jones Adventure broke down as we stood at the turnstiles to board the ride on the morning. It broke down again when we were getting ready to head back for our Fast Pass reservation near the end of the evening. Most of Paradise Pier was under construction and it’s impossible to get a reservation at a restaurant in either park. When you do, they cancel it without notice (see my review on Wine Country Trattoria). In all, for the $150 price of admission completely not worth the headache. Also, you should have left Tower of Terror alone. I love Guardians of the Galaxy and the video component is gray but ToT was very special. Guardians is just ok. ToT was only thing worthwhile about California Adventure.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Family Group of 11", "Accommodated very well on rides and other activities within the park. We had a GREAT time together. I must add, Disney staff used to be known for courtesy and friendliness. No more."], ["Reviewed 2 weeks ago", 5.0, "woohoo", "explore my Inner child. the place where it can make me happy to everyone who come and visit. wish there is one in NYC"], ["Reviewed 2 weeks ago", 5.0, "Mickey and the Duck", "You can never say no to Disneyland everytime the topic of visiting this magical kingdom comes. So\nMuch wonderful things to see and the children enjoys it everytime. So if you have the time bring the kids to this magical kingdom of Mickey and the Duck. :)))\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Dated compared to Orlando but still magical", "If you've been to Disney World in Orlando you'll find this one smaller, dated and less exciting. It was still magical with the basic works available, rides, photos with the characters but I felt the night finale wasn't as impressive and very lacking in the fireworks part.\n\nThe staff here also didn't seem very happy, to think they are supposed ambassadors for the Happiest place on earth.\n\nThe app was helpful, Fastpass was just $10 more but only limited number of rides had a Fastpass lane.\n\nIf you have been to Disney World there's probably no reason to come to this one unless it's in your bucket list to check off every Disneyland Park in the world.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Disapointed!!", "I was so looking forward to our Disney vacation but I have to say that it was a disappointment!! This was my first time to the park and my last!! The 3 (2 on California and 1 on Disneyland side) rides that we wanted to go on were CLOSED!! Plus there were major issues with other rides. Why would they close the Ferris Wheel and the roller coaster at the same time?? We spent good money to travel there feeling like we wanted more out of our experience than we had. I truly did not get the magical feeling that they portray in their advertisements. I wish I went to MEXICO instead :(\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great!", "Hadn't been here in years. It is more kid friendly. We went to Legoland. Children liked playing there and taking pictures outside. Rides were colorful! The rides were cute and the sceneries were artistic. Enjoyed our two day trip."], ["Reviewed 2 weeks ago", 5.0, "Wow", "Get there when they open, shorter lines. If your planning on eating in the park make reservations in advance. Some of the longer rides offer single rides which can also save you time."], ["Reviewed 2 weeks ago", 5.0, "I enjoyed it!", "I so enjoyed my time at Disney Land. I have been twice now and both times have been very memorable times. I love the friendliness of the crew there and how they always have a smile on their face. I loved the atmosphere there for having fun and enjoying the entertainment.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A place for everyone of any age to enjoy", "This was a 3 generation holiday to Disneyland and California Adventure Park. Everyone from 6 to 69 had a blast. We took a locker outside the park between Disneyland and California Adventure which was convenient for hopping back and forth. We used Fast Pass on the App for ease of enjoying more rides. Our remote cell charger got used keeping the cell phone charged because of using the App all day for a map and fast passes.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "We love our Disney trips every year!", "Disney is a trip our family looks forward to every year. We usually go in February, but have tried all times of the year. While February is nice because the crowds are usually lower, the park hours are shorter and they usually have some rides shut down.\n\nEither way, it’s amazing and a must for kids and families. We have 3 kids under 7 years old and all of them love it! Happiest place on earth! ❤️\nShow less"], ["Reviewed 2 weeks ago", 5.0, "AMAZING", "I came here with my son with a 3 day pass for his birthday and we weren't disappointed. Even thought the time of year we came some rides are closed we still had a fantastic time. Every staff member we came across was lovely & due to my son wearing his birthday badge we picked up at city hall it made his day to have so many people wishing him a happy birthday. Cannot wait to come again.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "We Just Don’t Understand What All The Hype Is About", "I kept asking family members if there were things to do at Disney that didn’t revolve around rides. Not really. Most of the rides suck. We were there on a slower day mid week in Feb. The wait times weren’t too long. 20-30 minutes. Even still, we waiting that long to get on to a ride that is really just a parade for a movie that was released years ago. The Park was under construction. I don’t really care about that part. The park was clean and the staff was friendly. The food was not memorable. When it comes time to eat, either bring your lunch from home or go to Downtown Disney. It is a nice perk that they allow you to bring in your own food. We also like they they would give you free water cups with ice upon request. I would be just fine if I didn’t come back to Disneyland. There isn’t anything here that is worth what you pay for.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "First Class Theme Park - avoid Reno season", "We went to Disneyland for two days in late Jan / early Feb and it did not disappoint. Top highlights include: the character breakfast at the Plaza Inn, the classic Haunted House and Pirates of the Caribbean rides, the recently updated It’s a small world ride, and finally the numerous character meet and greet opportunities.\n\nDuring this trip, we brought along our 2.5 yr old toddler so we did slant towards the more child-friendly rides. However, the new Disneyland app meant upgrading to Maxpass for ease of booking Fastpasses and keeping unlimited digital photos very worthwhile.\n\nWe were able to go on more adult themed rides and switch on and off thanks to the convenience of the Fastpass and Rider Switch option.\n\nRegarding the character breakfast, it may seem expensive, however it meant we were able to take pictures with at least six characters while eating and this not have to spend twenty minutes or more lining up for each character in the park. There are dozens of characters in the park, so reducing the number of characters we had to line up for meant more time for rides. Additionally, if you go for the breakfast charger meal, the Mickey Mouse waffles are quite excellent.\n\nIf you are willing to sit down for lunch, the monte cristo sandwich in the New Orleans area is very worth it! The kids meal at Cafe Orleans is also very sizeable and has many healthy fruit and vegetable options.\n\nRegarding renovations, while we knew this was a period of time in which some rides would undergo renovations and would this be closed, we didn’t anticipate that the entire streetcar rail system on Main St was also going to be under renovation. This resulted in the whole centre section of Main St being boarded up and left the area rather cramped.\n\nSome of the rides in the park were definitely showing their age as we had three cases in which rides broke down and we had to vacate them. These rides included: the roger rabbit ride in toon town, the Pinocchio ride, and the snow white ride.\n\nFinally, some of the older rides are not as small children friendly as you might think. In particular, the Snow White, mr. toad, and pinnochio rides were all very dark and mainly featured more of the scary scenes than memorable ones.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Honeymoon halloween", "First time here at Halloween and it was great! Very very VERY busy. Take advantage of early hours and bounce between parks. The app wasn’t working and we were unable to use fast pass many times. Hopefully that’s sorted but the staff was helpful. We only encountered one staff member who was a bit abrasive when we explained our troubles but then offered us some fast passes to compensate.\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Grumpy! 5 Rides Broken, Fast Pass Broken and entire Park Under Construction", "Most expensive place on earth! Paid over $4000 for 3 nights at Disneyland Grand Californian, 2 day Park passes for 3 people (two adults one toddler). Bought the max pass in addition and ate every meal on premises. Extraordinarily expensive and low value. There were 5 rides broken throughout the Saturday Feb 10 (Snow white, Pinocchio, Star Wars, Roger Rabbit, Small World) that we know of. This causes the lines at working rides to double/triple in length. Received Bonus multi fast pass on app because one of the rides was broken. Nice! But Wanted to use it at Small World and told we couldn’t because the fast pass machine was broken!! At every turn, even when Disney tried to make it right, it failed. Also, Disney won’t tell you the ENTIRE railway system on main street and castle area is 100% under construction across the park so the crowds have no where to go. There is no mention of this at time Of booking with the Disney travel agent by the way” and they charge you the same. January is typically construction time but it’s now mid Feb. Unacceptable. The staff were average at best as even said to us “we are breaking down”. Ate character breakfast at Park with Mini, made reservations, etc sat us in corner, no one cleared our plates until we were 100% done, and food was greasy and low quality. Disney will gladly take your money, treat you average and not tell you they should discount their prices because they sell something that is subpar. Their Tomorrowland is 1970’s Star Wars. The submarine ride is 1970’s 20,000 leagues under the sea now with Nemo holograms. Old. But if they were to improve something, they should invest more money in their app. We still had paper/plastic tickets and none of our stay was linked to the app automatically. It should all be automated! Systems are not talking to each other and it shows. Not seamless.\n\nThey are running an average operation at best and over selling it based on their reputation. Disney corporate should take note of the poor reviews on Trip Advisor. I don’t even see any comments from\nDisney management on Trip Advisor explaining the situation.\n\nSo, sorry, but the Disney magic is gone for me in California. My recommendation is to look for another park or another vacation location to spend your hard earned dollars. Disneyland lost its luster and its simply not worth the money anymore. The park is aging and it needs a major redo to keep up with the times. Walt would be disappointed. Maybe try Florida.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Disney", "Wonderful Time Spent with all my family. Activités for everybody old and young people! One day is not enough"], ["Reviewed 2 weeks ago", 2.0, "Crowds!", "I've visited on a few occasions at different times of the year and each time overwhelming amounts of crowds. I guess because the parks aren't large so not a lot of rides like Disney World! And every time a lot of rides were shut down!"], ["Reviewed 2 weeks ago", 5.0, "Family trip", "Awesome experience. Spent 5 days total. 2 days at California Adventure and 2 days at Disneyland. 4 would be fine too- doing 2 days at each park. Loved the Frozen show and the Cars ride. And of course Peter Pan ....."], ["Reviewed 2 weeks ago", 5.0, "Happiest place on Earth", "Honestly, there isn’t too much I can say regarding Disney that you wouldn’t already know. Such a wonderful place to spend time with your family. So much fun. The only thing I can add for those of you that don’t know, during the off season, it is really slow, but they’re are a decent amount of rides down for refurbishment. You can take a look at this ahead of time on Disney’s website though.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "max Fast Pass +Unofficial Guide =win", "Used the unofficial guide to Disneyland and saved hours of waiting in line! Also the max fast pass was amazing too. Why would anyone wait in line if they could avoid it?\nAlways get to the park early, the touring plans in the guide will set it out for you.\n\nI took my two kids, one 19 years old daughter and my six year old son. We haven’t been since my daughter was 6. So much has changed. One of the things we noticed the revamp of the rides and it was for the better, but made me miss the originals Swiss Family Robinson Treehouse is now Tarzan too\n\nAlso, the Peter Pan ride broke down at least twice, Toad’s Wild Ride did too. The line for Peter Pan was over 35 Mins all day long maybe a Fast Pass is needed to be implemented for this... Also the line for characters never below 30 Mins. Crazy. We didn’t want to wait in any character lines if we paid well over $100 a ticket! No way!\n\nAnother thing we both noted is the friendliness of the people that worked there. I rarely saw a smile or even an acknowledgement of my son wearing his “1st visit” pin. Actually only one cast member said something about it. The ones we did encounter were kind of grouchy. We had a very expensive lunch at the New Orleans area with a horrible tasting shrimp po’boy where I asked for ketchup for my son’s chicken, and they rolled their eyes. I then went back out to the cart where five people pointed, and went back inside and told them no that’s tobasco, so someone came and pulled it out from under the cart.\nI am a happy, nice person from Texas and to experience lack of warmth and I guess just overall lack of helpfulness is strange.\n\nAll in all, we had a good time. I think we will wait a few years and re-experience Disneyworld.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "First time at Disneyland", "We were quite excited for being my brother and I first time ever at a Disney theme park. It was a magical experience, but not quite exciting for teenagers. Food wasn’t as expensive as I thought, but it is still better to bring your own, specially if you rather spend your money on souvenirs.\nThe only sad part was we couldn’t see some attractions due to renovations. But we get our photo with all Star Wars characters availables, Goofy and Aladdin.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Wrong time of the year!!", "I have dreamed of visiting Disneyland ever since I was a little girl! My husband and I have recently travelled from Australia to go & whilst we loved each bit - I cannot give it 5 stars for a few reasons! First being, so many rides were closed! Including the iconic big white roller coaster in the ‘New’ California Disneyland. Being a low season, I imagine the crowds were smaller than usual, but the park was still very crowded and line times on most rides were 30-60min wait times. I’d hate to see it during peak season! In saying this, we do plan to one day return in peak season (so we can bring our one day children & go on all the rides without them being closed down!). But two words for anyone planning to go at any time of the year - FAST PASS! Not sure how much extra they are, we didn’t bother getting one because most of the rides we wanted to go on were closed. But it’s my hot tip (along with getting a park hopper ticket, so you can visit both parks). Overall, we had a magical experience! Loved it & can not wait to one day return.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "For families with special needs kids", "A lot of people wrote reviews of Disneyland. This one is for anyone accompanying kids with special needs. As soon as you enter the park, go to City Hall and register the party for Return Passes. Usually one person per party has to be the carrier of the Return Passes but you can have them designate another person if your party plan different attractions. You can combine Return Passes with Fastpass so you can maximize your visit. There are 5 spots around the park marked with green umbrellas where you can reserve the attraction with Return Pass. They give you a return time usually better than the Fastpass, you go then to the attraction and use either the exit (for Pirates of the Carribean) or the Fastpass entrance. Once you’re done with the ride, you can book the next ride with Return Pass. Beware that you can’t book more than one ride at a time with Return Pass. But, as I said before, you can combine it with Fastpass. So if you do a little planning ahead (and use the app that shows you wait times) you can actually do a lot of rides with minimum wait time.\nMy advice is to start with Tomorrow Land since Star Tours fills up pretty quickly. We’ve done this a few times and always ended up doing much of what we had planned to do.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Get a MaxPass and watch out for ride closures!", "This park is more crowded than California Adventure, even on a weekday in the offseason. I was disappointed in all the closed rides - we visited January 2018 and Splash Mountain and Its A Small World are both closed. If you're coming from out of town and only have a day, definitely spring for the Max Pass. It lets you sign up for FastPasses from your smartphone while you're in line for other rides. It really does let you maximize your time in the park. Although keep in mind, it's impossible to see it all in a day, or even 2, so make a plan of what's most important to you.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Our third Disney Park!", "We have been to Walt Disney World in FL, Disney in Paris and now Disneyland Park in CA. It is interesting to see how each park differs yet how they are the same. Very busy park and lines were long even for February. Would go again because we are Fans\nShow less"], ["Reviewed 3 weeks ago", 5.0, "For fun", "I have been to the Disneyland park a few times as an adult without a child, but this time we brought our two year old daughter.\nWhat can I say it brings out the kid in you. But seeing Disneyland through your kids eyes is a different experience to see her light up when she saw the characters was priceless and to have her avoid them when it came time take a picture with them was hilarious...hahaha..\nI guess it’s different to see them from far away and then getting up close...\nThe characters are amazing and super patient...\nShow less"], ["Reviewed 3 weeks ago", 5.0, "We love Disneyland!", "We went in January, mid-week, in hopes to avoid crowds. Though the crowds weren't as bad as summer, it still felt very crowded. However, that is Disneyland...it is always crowded, but for good reason. It is so much fun! So clean! So thought out. So magical! We absolutely coming here, even if we have to drive 7 hours to come. Just wish it didn't cost so darn much!\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Everything was closed", "At least four of the attractions were closed because of the renovations, we travel from Mexico just too see the fireworks at the castle but there wasn’t any show there because of the magic “renovations”, at least for us the fantasmic show was pretty good."], ["Reviewed 3 weeks ago", 5.0, "Loved it!", "Who doesn’t love Disneyland though?! So we went on a Tuesday 2/6/18 and it’s the off-season so the lines really weren’t bad at all. We rode every single ride that we wanted to and even did a couple of them multiple times. Pay the extra $10 so you can get the fast pass definitely worth the money. My personal favorites were the Buzz Lightyear and Star Tours rides. Also we ate dinner at the Blue Bayou and absolutely loved it.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Did you even need a review to know you should go?", "My husband and I are huge Disney fans. We live near WDW, but love to travel to all the other parks on earth. Disneyland is amazing because, like all the parks, it’s unique, but it’s also the only park that Walt actually got to walk, so it’s very nostalgic.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Ladies fun trip", "Love Disney. Have been there many times. This time was a bit disappointing though because they were doing renovations Down Main St., Disney and leading up to the castle so it was all blocked off. The biggest disappointment was there was no parades or fireworks any of the nights we were there and we were there for eight nights. I felt that we shouldn’t have been charged the same as other times we’ve been there. No matter what we still had a great time!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Good Jan. Weather; Max Pass worked well", "Visited a second time - this time in Jan. Really great weather (70s) and fewer crowds (still crowded of course). Loved, loved \"Star Tours\" and I'm not a big ride person. We purchased max pass and I'd say was well worth the cost and really convenient since you can view your fastpasses on your phone and keep things organized if you're in a group/not all walking around together. The Disneyland app is a must! P.S. Bummed that the Haunted Mansion was out of service.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Tips for Disneyland", "Definitely get app on phone and spend a little extra for fast pass. There was 65 and 70 min waits but we walked right in with fast pass. Park off sight and take the shuttle in. It’s so much faster and less aggravation. Same cost though. Enjoy it all\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Too busy", "We thought for $100 each entry we would get to ride all attractions...a couple of rides were closed and a couple broke down during the day...the main strip has maintenance work going on which means no parades\nWe hardly saw any characters\nThe lines for rides were huge...too many people and too many strollers and this is quiet season!\nFood and merchandise is way over priced..almost $5 for a coke that would buy outside for a dollar..i felt ripped off more so than being in the happiest place on earth\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Construction but still the best!", "Main St. is all messed up right now but the park was busy still and the magical feels everywhere. I can't wait for Star Wars land!!"], ["Reviewed 3 weeks ago", 5.0, "Disney in 4 hours", "We went at 7pm and also left at 11:30pm. We were only in town for two days . Most stay at Disney longer but we were able to ride four rides and see one show . It’s also free for children under 2."], ["Reviewed 3 weeks ago", 4.0, "Need More than One Day", "Disneyland is huge, huge, huge. Plenty for the kids to love a lifetime's worth. The park needs more water fountains and resting spots throughout the park. Not all of us can go, go, go."], ["Reviewed 3 weeks ago", 5.0, "Fun fun fun. ...", "We had so much fun. ...\nMy son and nephews ride till there heart content. ...\nIt was a nice and excellent experience. ... we got to roam around. ... there were lots of people and long lines. ...\nThe locker room was nice too. ...\nGifts shop was good too. ...\nThe food is all over the place which is perfect. ... but bring water for long walks. ...\nAll in all we had much fun. ...\nShow less"], ["Reviewed 3 weeks ago", 5.0, "It really is magical", "We met up with relatives here and we all had a great time together. Husband and daughter had only ever been to Disney World in Florida so was fun to see some of the differences (Pirates of the Caribbean was so much better here! And ToonTown!) and to see that there is a similar magical feel. Several attractions were closed, which is typical for the time of year, so worth considering if there are some \"must do\"s on your list. Was a bit disappointed that there were no fireworks on the two nights we were there. California Adventure is literally next door and park hopper made sense for us - was glad we got it.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun for kids of any age.", "We have been to Disneyland Par many times over the years...bringing the kids....and then going back without them . Always fun at any age!\nVery clean.....staff works hard to keep it nice.\nMany bathrooms (mostly clean) to use throughout DP. And of course many places to eat and rides for everyone. Lots of fun rides to enjoy.... \"classic Disney rides\" to reminisce about the Disney movies....they have it all.\nFood and drink are spendy......bring a cooler with food and drinks to save money if you need to.\nHave fun and don't miss it if you're in Anaheim with the little ones!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "1st holiday to Disneyland with our family", "Had a a fabulous time in Disneyland. It was our 1st family holiday. It was a fabulous experience and the joy of Christmas in the air making it a truly magical place to visit. I would suggest to anyone explore and enjoy the sights sounds and experience that Disneyland has to offer it's a truly magical place to visit.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Magic", "We came a long way at great expense and hoped Disney would live up to our expectations. It was great! We made the most of our magic hour, fast passes and late night openings."], ["Reviewed 3 weeks ago", 5.0, "California Grand Resort with Grand Children", "What a time to remember for a very long time. I was limited with my pain levels. However renting a scooter for days at the Parks was so good. Reasonable rates understanding and professional staff. Going the extra mile."], ["Reviewed 3 weeks ago", 5.0, "Best Experience to end the year!!", "My family's Disney Experience was awesome! A great one to end the year. Given a chance, I'll definitely go back there to enjoy my self!"], ["Reviewed 3 weeks ago", 5.0, "It is amazingly great", "The theme park it’s self is full of magic and I love it. Stay for a least 4 days. And enjoy yourself"], ["Reviewed 3 weeks ago", 5.0, "Max Pass", "The new Max pass is definitely worth the cost. We got unlimited fast passes to all the big rides. The ones that we could not get fast passes to we did the single rider lines. The longest we waited for any ride was 20 minutes. This made a huge difference. I choose to pack food and snacks and not eat at the park, and use that money for the max passes. Will do again!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Truly the Happiest Place on Earth", "I appreciate that it may not be everyone's cup of tea, but please take the time to travel there at least in your lifetime! We are planning to go back in a couple weeks after a 3 year hiatus, and couldn't be more excited.... from thrilling rides, to excellent food, it truly has become one of the happiest places on earth for our family.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Still the gold standard of LA amusement parks, but the lines!", "I love Disneyland. Perfectly run. Spotless. Motivated \"cast members\" and rides so well and imaginatively designed that movies and books are written about them. Their a victim of their own success as the lines have become intolerable. I will only take my kids on weekdays during their short off seasons (now, for instance). I wish some of LA's other amusement parks would take just a smidgeon of a hint from how well-run this place is (I'm looking at you, Six Flags!).\nShow less"], ["Reviewed 3 weeks ago", 5.0, "First visit to Disneyland", "It was our first ever visit to Disneyland & we absolutely loved it, both of us spent the day running around like big kids, it was awesome. Managed to get quite a few autographs too. Loved “ToonTown”, but our favourite part was “New Orleans”, we had a meal in the restaurant there called “The Blue Bayou” & it was the most amazing place we have ever been, you feel as if your actually sitting on the bayou, fantastic. Other highlights were visiting Tinkerbell & watching Chip n Dale dance, loved it, can’t wait to return\nShow less"], ["Reviewed 3 weeks ago", 5.0, "The Disneyland", "What can anyone say about Disneyland?A visit is a must.Truly magic.You should be there early so you could enjoy all attractions before it becomes overcrowded.Ticket for adults costs about $100.A whole day there is necessary to see it all.If you have ever visited another Disneyland (e.g Eurodisney)it is recommended to visit Disney adventure park instead of Disneyland.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Fun but ridiculously expensive", "Disneyland has always been overpriced but it's fun, I suppose. If we didn't have kids I probably would never go back because it's such a huge waste of money. The kids who work the rides are friendly for the most part and the food is mediocre. It was insanely crowded the last week of January. I can only guess that was because of the unseasonably hot weather. All in all, overcrowded no matter what time of year, overpriced for what you get, and the food is overpriced and underwhelming.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Family trip- out of state AP holders", "Always enjoyable. Although the crowds (year round) have increased substantially. There used to be seasons that were better for you to visit without larger crowds. Our experience has always been with polite CMs (staff), and a clean environment for the most part. Unfortunately some people don’t know how to clean up after themselves, and leave messes for already busy staff to clean. Most people are happy to be there... some people have been there too long, LOL. Their kids have drained them and their patience. (We always find it a good idea to go to your room and nap/rest in the afternoons.) It is a fun place to go escape the real world for a little bit and connect with your inner youthful self. But it is important to remember there will most likely be a LOT of people there with you, so pack those extra patience in that suitcase along with everything else.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "3 days not enough", "We spent three days at Disneyland and California adventure park and 'almost' did all the rides. There really is a lot of information on the internet about how to 'do' Disneyland and we read quite a bit of it. The 'tips' that worked for us mostly related to using fastpass. Though it must be said that fastpass can be a nuisance if you end up with a late return time for an attraction which we did on one occasion as you can't get another fastpass in the same area until that one has been used.\nWe also used 'magic morning' to our advantage by going straight to the fastpass line for Radiator races, meaning we avoided a long queue later in the day as fastpasses ran out and the standard queue got long.\nWe are told that we went at one of the quietest times for disneyland, hence the longest we waited was around 40 minutes for the Indiana Jones ride. We noted that from mid-afternoon the crowds grew and the lines subsequently increased.\nFood was as we expected, expensive and some areas of the park seemed to have very little choice. Toontown was very short on food options.\nMerchandise was equally expensive - they certainly make their money on the likes of mouse ears at $25USD.\nWe managed 90%+ of the rides but we didn't do any of the shows, so there is a bit of a tradeoff. My sister and her family went to quite a few of the shows but did hardly any rides - so each to their own.\nSo what would we tell others?\n1) buy a lanyard for your ticket outside of the park - they were a horrendous price inside disneyland.\n2) ask for water at the restaurants, to save on fizzy.\n3) my wife took a camelbak filled with ice and water that she used each day.\n4) Try everything - you may as well do a ride, rather than walk past one - thinking you might do it later.\n5) Buy your merchandise somewhere other than disney - our hotel had a large selection of disney gear, all cheaper.\n6) Don't go home before dark - the park really is magical at night with all the lights.\n7) There were no parades or fireworks whilst we were there - they don't start until April and they are apparently amazing.\n8) The guardians of the galaxy ride was the tower of terror - wish I'd known this before we went on it ; )\n9) If you need help - ask. All the staff we talked to were super helpful. We had my mum with us, who is in a wheelchair - staff went out of their way to make things easier for her when and where it was possible.\n10) if you are from overseas as we are, stay from dawn til dusk because it is the experience of a lifetime and one that will most likely never happen again.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "LOVED it! Eventhough we have FLORIDA DIsney passes, we loved Disneyland and the rides are quite different and fun too", "Had a lot of fun for our first time to Disneyland. We are DISNEY WORLD passholders so we thought we would be disappointed by the size of the parks but we were actually pleasantly surprised and enjoyed both. Even though some rides have the same names as FLORIDA rides, most are completely different which was cool! The Fantasmic (Disneyland) and World of Color (Disney's California Adventure) shows are absolutely TOP NOTCH and the BEST!!!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Not prime time, still battled crowds, but always worth it", "Disneyland is always worth the trip! We went in January in the crowd to be slim. Unfortunately there were still plenty of people, and there were many rides down for refurbishment at that time. We still had a great time. The weather was nice for us, so we got to enjoy a lot. Their Disney show “Fantasmic” was amazing!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "LOVE It so much", "After going to Disneyland for the first time in Paris and then coming here 8 months later, OMG such a better experience here in Anaheim. No waits for characters, or fastpass tickets, you practically just walk on to the ride if you have a fastpass. But the character meet and greets were so good that I think my daughter and I spent most of our time seeking out characters then going on rides, it was so much fun. I would definitely come to this park everyday if I could. Recommend the maxpass though as it is only 10 bucks a person and you get unlimited photos also which is a nice touch to your special day. The fastpass system on your phone is a breeze to.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "You cant help but have a great time", "My first time to California adventure and it was great, a nice area for the older kids and the cars section was so much fun for the adults\nfood was also very good for a park\nduring the week in January was amazing even though cold but no lines\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Three days", "Spectacular weather!\nClean and friendly place and staff.\nDisappointing that the renovations are so extensive that there are alot of areas and productions not being done.\nI think if rides and production is limited then there should be a discount on tickets. The rides we did go on were fun!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "First time in Disneyland.", "Touring the US on a Greyhound bus for two months and a half in the summer of 1963 with another foreign student , we managed to visit Disneyland Park in Anaheim CA. It was an adventure world for us, quite fascinating. We got a booklet of tickets, which we could use. What interested me most were characters from movies like Mickey Mouse and Mina etc. and what is still clear in my memory is sailing among trees and suddenly meeting animals foreign to me, i.e. not existing in my country.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Do NOT go in December!!!!!!!", "This was our first time taking our kids to Disney land. Hadn't been in like 15+ years. MAN I would NEVER go back again in December, it was SOOOOOO PACKED. Around 3pm through like 8pm, week day, it was so crowded we could barely walk around the park, it was like an amusement park packed inside a sardine can. MISERY. We finally realized you just have to leave for dinner and come back afterwards, hoping your kids last. Get there when it opens and leave the park for dinner.... And use the fast pass wisely, time it!!!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Love Disneyland but don't bring a selfie stick. Tripods & monopods that can fit in backpack are okay", "I love Disneyland. I try to come once a year and I live in Hawaii. I did not know I could not bring in my phone's tripod. I did see others with tripods/monopods for their phones and go pros. I just walked into the park and went to the bathroom. The lady in the shop comes walking up to me and says, \"I need to confiscate that selfie stick.\" I asked why and she was rude with her explanation enough for another guest, a mom with her child, interrupted to help me. She even explained that it wasn't a selfie stick but a tripod. After the mom helped me, the older lady employee let me go to take it to lost and found, where they said I was okay to take it into the park. They just reminded me to not use it like a selfie stick. I agreed and went into the park. It was too much of a hassle for me to even take it out of my purse again. Both the security and the lost and found were great with customer service! The older lady might have been having a bad day. I was in Disneyland the happiest place on earth and my favorite place on earth, so I let it go because I didn't want this incident to damper my visit especially because it was my first time with my boyfriend.\n\nI LOVE LOVE Disneyland. We both had so much fun! I can't wait to go to WDW with him now and maybe even the cruise to Europe.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "More difficult to go through security than the airports", "Got to the Disneyland parking lot at 9:45am with tickets, yet got in to the park after 10:30am due to 2 security check points. We also missed having our breakfast at Plaza Inn with Disney characters as they shut down for breakfast strictly at 11am. We got there literally at 11:01am and were refused entry. So if you are visiting the park during the week you will have very little time to go have breakfast there. Park opens at 10am and breakfast is over at 11am.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Needs a little more pixie dust", "the rides were fun as usual and the park was tidy with immaculate gardens but the visit did not shine as much as previously.\nThere was very limited assistance for disabled guests.Some rides had an electronic queue option but not enough of them,\nThere were also no reserved spaces for parade viewing unlike other disney parks. Still enjoyed the 2 days there but slightly disappointed as usually Disney have the edge on customer service\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great place", "Fantastic place to visit we had three days a I think that we just managed to scrape the surface a little disappointed that some of the attractions were close for the winter period but whoever would recommend the park to anyone friendly staff and people a good variety of places to eat not over priced as some theme parks can be the night light and water show was fantastic went and watched it 2nights\nShow less"], ["Reviewed 4 weeks ago", 4.0, "It’s Disney!", "It’s the happiest place in the world, I feel like I can’t say anything bad about Disney besides the food isn’t that great haha"], ["Reviewed 4 weeks ago", 5.0, "Disneyland With Grandkids", "We arrived the day after Disneyland had been decorated for Christmas (Veteran’s Day weekend), making everything more magical! Characters could be found throughout the park. Using the Disneyland telephone app is a MUST to see how long the wait times are for the various rides. Pirates of the Caribbean was open and only had a small line when the park first opened in the morning. Toon Town was quiet in the morning, so was beneficial for the youngest grandkids. The parade was Christmas themed and was quite long! Highly recommend visiting during the holidays!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Cali-Florida or bust?", "So, we’ve returned from our trip to the USA and the West Coast, a trip that ended with a Five day visit to Disneyland in Anaheim.\n\nFor the benefit of those of you who have only ever made the journey to Walt Disney World near Orlando, is a trip to Disneyland worth it, or can you get much of the same experiences in Central Florida?\n\nFirstly, Disneyland is made-up of only two theme parks, one of which, Disney California Adventure, had a troubled and frustrating gestation before finally getting itself on track only in recent years. Disney’s keystone in California is Disneyland itself, the original 1955 park that took elements from existing American theme parks and pleasure gardens, and perfectly fused them together into ‘the’ definitive family entertainment destination.\n\nWalt Disney World in Florida was an effort to break free of the historic limitations of the California site and, over the years, has expanded to a total of four parks across enormous acreage. The most recognisable park is Magic Kingdom and it is this park that is a homage to Disneyland. Elements are shared between the parks, but none are true replicas of one another, gentle facsimiles persist, but many seemingly familiar attractions have slight differences, and many attractions are unique to one location or the other.\nDisneyland and Magic Kingdom are therefore closely related, while California Adventure shares some of its heritage with the content of Disney’s other Florida offerings: Hollywood Studios, EPCoT and, Animal Kingdom.\n\nFrom a purely package holiday perspective WDW wins, with a much larger size, it’s much more capable of sustaining a family vacation for a much longer visit (the typical two-weeks that British visitors are likely to book). There are other benefits too; multiple Disney owned hotels, on-site restaurants aplenty, water parks, shopping & entertainment, and close by, Universal Florida and SeaWorld too. WDW is cleverly designed to act as the hub for all of your holiday needs and is increasingly, with dining packages, digital ticketing, multiple pre-bookable attractions, and experiences, a completely integrated Disney experience from sun-up to sun-down.\n\nDisneyland is a very different experience to its upstart younger sibling and this is where some very surprising elements reveal themselves.\n\nFor starters Disneyland is small, though they may look similar, Magic Kingdom is quite a bit larger, and Cinderella’s Castle in Florida is massive when compared to Anaheim’s original Sleeping Beauty Castle. The limited scale of Disneyland was a necessity of the constraints of the original site and of Walt being unable to afford more land when embarking on the project. With finances tight, Disneyland was soon hemmed-in by hotels, restaurants, and vacant lots purchased by speculative real-estate developers. Over the years, Disneyland’s designers have become adept at squeezing attractions into an increasingly full plot, the result is a surprisingly intimate experience that WDW seeks to duplicate but, because of its more generous size and despite using clever tricks with scale and perspective, doesn’t quite manage to replicate. Disneyland still has Walt’s influence around every corner and, though planned and conceived by him, WDW didn’t even break ground until after Walt’s death\nSecondly, Disneyland is much more of a local’s park; that’s not to say that hundreds of thousands of foreign visitors, or those from across much of the USA don’t venture to Anaheim, it’s just that the overwhelming majority of visitors are from the LA and Southern California conurbation and this lends the park a more casual vibe. Many Californian’s are day visitors or just there on short stays, and the popularity of annual passes mean that many can drop-in for an afternoon or evening visit almost any day of the week. Attendance levels can therefore fluctuate dramatically, at times outside of peak demand, particularly during mid-week, the parks can be remarkably quiet compared to Florida. Walt Disney World is becoming much more of a year-round destination to the point where crowds are flattening-out and periods that have historically benefitted from low attendances are starting to get squeezed.\n\nThe next difference is in the time you may want to dedicate to visiting the parks. Disneyland Resort (that’s Disneyland and the neighbouring Disney California Adventure) can be attempted, at the right time of year, in just two days (one day for each park). In some favourable circumstances, a reasonable taster of both parks can even be managed in a single day! This opens-up Disney as a vacation excursion destination, something that can be added, but need not dominate, a busy schedule spent visiting Los Angeles, San Diego or other Californian cities and landmarks. General Admission theme park tickets start with single day options and top out at five day passes, remember to specify park-hopper tickets if you wish to skip between both parks in a single day. So, Disneyland works well as an addition to any trip that brings you to California, rather than necessarily being the focus of a long vacation. WDW is a destination that visitors commit multiple days to, with one and two week visits increasingly popular, and except for a few days at Universal Florida, many people never leave the boundaries of the Florida resort at all.\n\nFinally there are attractions in California that you won’t find in Florida and some special takes on some familiar WDW favourites that are exclusive to Anaheim. Here are some of your exclusives:\n\nIndiana Jones and the Temple of the Forbidden Eye – a high speed truck ride through a South American treasure temple\n\nThe Matterhorn Bobsleds – the world’s first tubular steel rollercoaster that winds its way through the iconic Matterhorn Mountain that borders Fantasyland\n\nFinding Nemo Submarine Voyage – the famous Disney submarines given a Pixar Makeover\n\nGuardians of the Galaxy Mission Breakout – the extremely clever and uniquely re-themed Hollywood Tower of Terror\n\nCars Land – the phenomenal multi-million dollar recreation of Radiator Springs, featuring three unique attractions centred on the popular characters from the Cars films including the amazing Radiator Springs Racers.\n\nParadise Pier and California Screamin’ – currently undergoing a reimagining as Pixar Pier and The Incredicoaster (themed on the Incredibles, just in time for the film’s sequel)\n\nGrizzly Peak – a water raft ride through a Californian National Park\n\nMickey’s Toontown – a mash-up between the worlds of Disney Animation and Who Framed Roger Rabbit\n\nThe World of Color – A spectacular water fountain show held on the lake in California Adventure and enhanced with pyrotechnics, lasers, and animated projections\n\nAdded to these, are some attractions that manage to beat their duplicates:\n\nHaunted Mansion – from Halloween thru Christmas, this attraction is exclusively redecorated to include special theming from: “A Nightmare Before Christmas”, turning-it into a unique attraction that makes Florida theme park fans extremely jealous\n\nPirates of the Caribbean – This is the superior US version of the classic, with better drops and better loading and unloading (just don’t look at the Shanghai Disneyland version)\n\nIt’s a Small World – The Disneyland original features the iconic clock and the original world’s fair outdoor beginning absent from the WDW edition\n\nSo, should you visit Disneyland? Our opinion is yes, just with some conditions. If you are visiting California, definitely try and add it to your list; you’ll just have to determine how much time you’ll want to spend there. We recommend between two and three days in low season and midweek, if you’re visiting in high season, the two parks can get quite full and the only guarantee of seeing and riding everything may be to stretch a visit out to four or five days – depending of course, on just how ‘Disney’ you are.\n\nThere’s no dining-plan at Disneyland and the park dining is limited when compared to WDW, but there are a few great restaurants inside the gates (reserve using the Disneyland App) and some reasonable offerings nearby.\n\nIf you’re familiar with WDW, you won’t find magic-bands or advance fast passes in California, but there have been recent changes to introduce a little technological ticket management to Disneyland. For a $10 per guest daily supplement, guests can now link their park tickets to their Disney Account using the Disneyland App, benefits include an unlimited photo-pass, and fast pass reservations that won’t require a visit to the attraction to get a time.\n\nTying Disney to a visit to Universal Studios in Hollywood is not as practical as the Florida Equivalent, as the parks are on opposite sides of LA and the traffic on the freeway between the two destinations can be torturous. Another great theme park experience, Six Flags Magic Mountain, in Valencia, is even further away, to the North of Los Angeles. Our advice, should you wish to add Universal and Six Flags to your itinerary, use a hotel near to Hollywood or Universal City and stay a few nights there using that as your base, before moving on to Anaheim.\n\nIf you’re looking for another theme park experience closer to Disneyland, you can visit Knott’s Berry Farm, also in Anaheim and just a few minutes away. Disney doesn’t offer any water parks at Disneyland, but nearby Knott’s Berry Farm does have a reasonable offering in the shape of Soak City and Six Flags has the excellent Hurricane Harbor (both open seasonally).\n\nSo, for us Disneyland is a gem. Yes, inevitably, there is a lot of duplication between California and Florida, but there’s still plenty of unique experiences too. Despite the clamour from some Disney fans that the company should replicate everything in both locations, Disney is clever enough to know that allowing each resort to have its share of exclusive attractions allows them to have a distinctive character. It’s this approach that makes a visit to either location such a different and worthwhile experience.\n\nFootnote: My wife and I took our first holiday together to California, Disneyland was my first experience of a Disney park (California Adventure was still the parking lot at the time), despite having been to WDW lots of times since, Disneyland remains my favourite Disney Park, after all, they say that you never forget your first time…\n\n\n\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A Need to go to place for every family", "This is every kid's dream place to go and it really is a great place to go! There is lots to do and even if you can't find something to do the staff will. We were having dinner at one of the restaurants, 4 men were singing in cool costumes and my mom got pulled in to sing along! It was hilarious and something we will never forget!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Heaven", "I watched the fantasmic show at night that was so epic, with a dragon, pirates fighting on a ship, lights, water, and fire, and a cute story to pull it together and all my Disney favourite characters making a cameo. Do not miss this, it is amazing\n\nThe rides mainly are gentle and allow you to revisit Disney moments which I love. Sleeping beauty castle, Peter pan, finding nemo (I have no idea how they make the fish seem like they're really there its so freaky), pirates of the carribean (omg the animatronics on johnny Depp is amazing and the fight scenes and lighting wow), and the jungle cruise is so punny, but I actually think kids won't love it as much as I did but I loved it.\n\nThrilling rides include Indiana Jones (most thrilling and arguably best ride. Matterhorn bobsled as well was great with some surprise around the corners.\n\nThe shows are actually fantastic - Abe Lincoln, royal theatre (and I loved reliving my favourite Disney classics as they redid tangled and beauty and the beast but in a theatre like, Comedic way), laughing house, tiki room (omg didn't expect that to be so good),\n\nYou can't beat meeting the Disney princesses for girls who grew up with Disney and they were as awesome as my imagination, they stayed in character even when I asked them weird questions haha. Love it.\n\nPlease go it is worth every penny\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Disappointing - won’t be returning", "Husband & I had very fond memories of previous visits to Disneyland which we had hoped to share with our 3 teenage chn however the excessive number of people let into the park meant HUGE queues for everything (I’m talking 2-3 hour waits for a single ride). Food & drink queues also long. Consequently the whole day became ride-centric and we obtained little ‘magic’ that such an experience should afford. Additionally the ‘fast pass’ app was down, however this had only succeeded in getting us one ride more quickly the previous day at Disney California anyway. All disappointed.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Very poor value", "The sparkle has gone out Disney for me. They seem much more interested in relieving you of as much money as possible than delivering a fabulous Family experience\n\nThe only upside was the Mickey Show at the end of the day, however that cost over $200 for food to get a decent seat\n\nTickets expensive, food & drinks expensive. Rides & entertainment dated. Poor value\n\nIf the kids are older than 8 I wouldn’t bother.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Oh, Disneyland", "Is it ever not a good time when you visit Disneyland. Although smaller than other Disneyland parks I have been too, still so enjoyable"], ["Reviewed 4 weeks ago", 5.0, "Thats a great new attraction for Star Wars fans", "Its tucked in right between Space Mountain and the gift shop for Star Tours. For long time Disneyland members its where they used to show Captain E.O. Runs pretty continuously and they really did an awesome job of compiling clips from all the Star Wars movies into one mini short film. Great chance to rest your feet and for us- no long lines yet as I don't think hardly anyone knows its there- we sure didn't. Our entire group aged 8 to 78 Loved it, hope they keep it running for years to come.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Overall Fun Day", "The park itself is excellent. Well staffed and run with precision. Especially enjoyed the Star Tours and Pirates of the Caribbean rides. On the down side......lines. The lines started before we got to the park on the highway. Then a queue to get into the parking structure. Another line for security. Another one to get on the tram. If you don't mind standing in line a lot, you will have a great time.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Big Kid", "Love visiting Disneyland whenever I'm in California. Whether I'm with friends or roaming solo, it's always a fun time. So easy to relive ones childhood...even if said childhood dates back a few decades 😂"], ["Reviewed 4 weeks ago", 2.0, "Disappointing visit to Disney", "My husband and I went with my nephews to Disney at Anaheim. Were a bit disappointed with Disneyland. The rides are old and the park just isn’t as well kept as it used to be. Staff wasn’t overly friendly, no one really smiled, plus we tried to get close to the characters and …sorry Pluto has to take a break, or it’s Mickey’s coffee break…. it was 9:30 a.m.\n\nWe got on the Nemo’s submarine…absolute fraud!! Unless you enjoy looking at a faded coral and wall covered with bubbles for over 15 minutes with a couple a Nemo animations here and there. Come on, at least you can do better than that!\n\nIf you take the train ride, the dinosaurs are ok, but there is a lot of debris on the side, construction materials here and there…I mean it’s the Magical World of Disney!\n\nQueues are a nightmare and to top it off… after waiting over 40 minutes at the Pirates of Caribbean (this ride is improved) a lady from the staff lets a couple cut in without even asking us if it was ok. Come on, we paid and waited a long time!! I have no idea who they are, but if they are VIPs, then they should use their VIP time not ours. Here’s their photo.\n\nWill I recommend it or return...i don't think so!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Truly THE Most Magical Place on Earth", "If anyone told you that Disneyland was magical, they were understating the wonder and imagination you will experience firsthand the moment you walk through those gates. The first time I visited, I was transported to another world entirely. Five trips later, the magic never gets old. If I lived close to Anaheim, I would be an annual pass holder.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Disney Delight", "What can we say, it’s Disneyland! Expect to pay high prices for food, but it’s Disneyland! Always sure to please."], ["Reviewed 4 weeks ago", 4.0, "Disney", "First trip for our family of four. Our two girls are 9 and 11. We had a great time. It was off season so lines and crowd not too bad. Many attractions closed and no fireworks though. Our kids were the right age to enjoy both the kid and adult rides. We did 2 day park hopper which was just right for us. We had already played tourist in San Diego for 5 days. Cast members all friendly, most even wished our youngest happy birthday. The disney app with max pass was easy to use and with it the only line we waited in was for Peter pan with no fast pass. Fantasmic was a treat but hard for the kids to see because of adults stepping in front of them. All and all a good trip. Not quite 5 stars because of the attractions closed for refurbishment and several rides closed while were waiting and even on them (stuck for 20 minutes in middle of Indiana jones)\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Disneyland", "Waste of money for seniors. I paid approximately $250 Canadian for 2 days to just sit around watching the stroller. Seniors & people with disabilities should have a reduced rate because I didn’t do anything that was worth the cost."], ["Reviewed 4 weeks ago", 5.0, "6th birthday celebration", "First thing you need to do is download the disneyland app and get MaxPass. It's the new digital form of fastpass and will enable you to get fast passes without having to actually go to the ride to get them--saves time. Worth every penny--it's $10/per pass. The second you get into the park and your tickets are scanned you can start using it. You will use your phone as your Maxpass to scan when you enter the ride. Also FYI--this will drain your cell battery, so have a backup battery or carry a portable charger. Definitely utilize the MaxPass so you aren't wasting time just walking around the park.\n\n40\" in height is the magic number for most of Disney's roller coasters. Big Thunder, Star Tours, & Space Mountain. Matterhorn is 42\". If your child is not over the height limit, you can utilize the rider switch pass. Just tell a cast member that you need one and then One parent can go on ride with a child and then switch with your friend or spouse once they return without waiting in line.\n\nThere are multiple parades over the day and seating fills up quickly. It goes from Small World to down Main street and most people try to sit down Main street, the right side of the castle in between Matterhorn and Alice in Wonderland--better viewing and doesn't fill up as quickly. At the entrance there are park maps and the daily schedule of parades as it changes everyday, so be sure to grab one. Plus it will also be on the app. The parades are exactly the same so my suggestion is to pick one to watch and then utilize the shorter lines in fantasyland during the other one.\n\nUpon your arrival--stop by City Hall (right inside the entrance on the left hand side) and get a birthday button and the rest of you can get \"I'm celebrating\" buttons.\n\nAlso, my personal opinion...the best place to see the fireworks is by the entrance in front of the train station. They do projections on the store fronts down main street that you can't see unless you are further back and you get the full view of the effect that way..( I received all of this feedback from my friend Michele and agree with her :)\n\nWe love the park. It’s worth every penny if you plan your day. Last thing you want to do is wonder around. The day goes by quick.\n\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great visit. Not sure it’s the happiest place on earth 🙂 but it comes close", "It’s Disney land what can I say. Lots to do. In a full day we we were kept busy. Wait times in lines didn’t exceed 20min. Only disappointment was splash mountain and a few other attractions were closed."], ["Reviewed 4 weeks ago", 1.0, "Disney World in Orlando is way better", "This park is alright, but the only thing it has that Disney World doesn't have is the Matterhorn. Otherwise, it's too small and generally boring compared to Disney World in Orlando."], ["Reviewed 4 weeks ago", 5.0, "Disneyland - everyone's favourite!", "More for the littlies with \"It's a Small World\" and other such rides however also has the Haunted house and a few rides for the older kids. Always busy so be prepared to wait - we waited 45 minutes just to do the teacups. Although it is busy the foot traffic seems to flow quite well.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Magical as always", "Beautiful like always, but we found splash mountain closed for refurbishment, and the fast pass only works when you are inside the park and one by one (different from Orlando, where you can select 3 options previously). Also you have to reserve restaurants like blue bayou (very good) with anticipation. Must go early in the morning to skip long lines by using fast pass. Good coffee in just a couple of places, delicious beignets at mint julep bar (not really a bar, there in absolutely not a drop of alcohol in the park) and good soups at the veranda.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Great fun", "Iconic Disney. The park is relatively compact, so not too strenuous to get around if you have a plan. Our family visit was in mid-late January, and we were surprised by the high attendance during the week. All the classic rides can be found here, but prepare to wait anywhere from 20-60 minutes for the pleasure, depending on popularity. Unfortunately our visit coincided with a huge amount of boarding all over the park, including Main Street and the Walt/Mickey statue. Timing is everything.\nShow less"], ["Reviewed 5 weeks ago", 3.0, "Is Disneyland the happiest place on earth?", "With park entry prices increased, it makes it very difficult to take a family vacation to Disneyland and be able to buy food and drinks and other memorabilia for the kids (never mind the adult kids) while in the park. If it’s meant to be the happiest place on earth, then the CEO needs to adjust the cost and make it more affordable for families.\nShow less"], ["Reviewed 5 weeks ago", 3.0, "Disneyland trip", "Love Disneyland but was very disappointed in all that was closed and many rides and show that were open were randomly not working. When there are few people and few rides working, the waits are still long🙁."], ["Reviewed 5 weeks ago", 4.0, "Fun times for the family", "3 full days , amazing ,we all loved it , our kids loved the rides new and old\nSpace mountain is by far the best ride , toons town was like stepping back in time amazing all the characters that we know and love roaming around\nIn the most part the cast ( staff ) were really good , happy in the Disney way there were a few that needed a happy pill\nPart of Main Street is closed for renovation so no parades major disappointment ( till April 2018)\nWe did fast pass for 1 day so that we could do all the busy rides , on the other days we purchased one Max pass so we could get the photos\nOnly negative is the APP needs some improvement it's a bit clunky and not that well set out\nBeing January the weather was just fantastic , and I'm told crowds not too bad , although it was really busy , Im not sure I'd like to be here in a busy time\nGreat family holiday\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Happy", "So much fun!! Happiest place on earth indeed. Love the weather and the friendly staff. Very clean.. impressive park management"], ["Reviewed January 24, 2018", 5.0, "A magical trip with family", "I am a huge fan of theme parks and to be in Disneyland and Disney California Adventure park was like entering into my childhood memories. We grew up with those disney movies and for my kids it is not so different either. It took us 2 days to complete the two disney parks covering most rides.\n\nMy daughter loved the princess and my son loved the thunder mountain railway, haunted mansion, tower of terror.\n\nFast passes made our lives easy but fo use them wisely. Loved the ambience, the crowd and activities all around the parks. Easy to move around with strollers and so many restaurants and food stalls to keep your tummy satisfied.\n\nNote of advice, take some snacks and water bottles with you when traveling with young children, as you will be spending the whole day. Make sure to stay till the end if you want to see the shows and fireworks.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Does not get old", "Disneyland never gets old, We have brought our 2 older boys there and now that we have a girl, I get to experience with her all the princess themed area like fantasy land. We went during summer time which was super crowded. We were used to going around October when weather is slightly cooler and lines shorter than the usual summer break in June.\n\nCons: expensive whether it's a single park multiple days ticket or a multiple days hopper tickets. To top it off, staying at the Grand California hotel was not cheap too (however, I liked that we had easy access to the park), lines are always long, waited 50 minutes for peter pan-ridiculous), food and drinks expensive, everything pricey!!\n\nPros: FUN FUN FUN, it never gets old.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Wheelchair accommodations", "We purchased a 5 day park hopper for our family of 5 and we had the best time at Disney during our vacation!! Our youngest son (6) broke his foot a week prior to vacation and Disney was very accommodating. For two days we rented a wheelchair on site but found the travel from our hotel to the wheelchair rental a long way for our little guy to use his crutches. We ended up renting a wheelchair from our hotel and Disney had no problem with us bringing it into the park. They no longer require you to get a pass for mobility issues as the wheelchair is evident enough. This allowed us to get return times, enter through special entrances and sometimes skip a bit of the line. They try to be as fair as possible with the people who are waiting normally but in some cases we flew through the lines much faster. The park is incredibly clean. There is never a piece of popcorn on the ground for long as people are continuously cleaning. The food and drinks in the park are insanely expensive, but of course we ate them. There is a snack cart or a beverage stand or a restaurant around every turn. It was nice we never really had to search for food or washrooms as they are all over the place. Unfortunately the water rides were closed as this is their downtime so we never got those but everything else was great. Download the app and take advantage of the info on there! Also, everyone there is incredibly friendly and knowledgeable. The popcorn cart employee knew exactly where the next churro stand was so my boy could get the treat he was eyeing. Everyone will stop to help and answer questions. It truly is the most magical place to be and we recommend the five day hopper so you can take in all that Disney has to offer!!\nShow less"], ["Reviewed January 23, 2018", 5.0, "The Magic of Disney", "After doing Orlando a couple of years ago I admit I was a little apprehensive about this one. I couldn’t see how it was going to measure up. My initial fears were met as I walked in and saw the castle, it’s TINY! I was thinking ‘omg this is going to be terrible’. I’d say after about another ten minutes all concerns had left and I had the best day ever! Try not to think and compare it to Orlando. I loved its charm of being the first Disney park and it being a little smaller (still didn’t fit it all into a day) and the Fantasmic show at the end gave me goosebumps. The magic of Disney is very much alive here, all the workers were 5 star and really add to your experience as you would expect, the park is stunning and whilst there isn’t an option to buy an upgrade for a queue jump ticket the facility they have for free is really efficient! My tips would be make sure you stay til the end to see the show! Use your fast passes wisely, if there is a ride with a fast pas and you have a three hour wait, check another ride with a shorter time, go on that fast pass and then get the last longer fast pass.\nAs I left the park walking through the little castle I actually changed my mind and loved that they’ve kept it smaller and how it originally was, it shows how far the theme parks have developed, it would be boring if all of the parks were the same.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Magical", "One of the best trips we have ever taken to Disney. It brought the Holiday Season full circle with the mystical light display of Sleeping Beauty Castle to the fake snow flying through the air on Main Street. It was the best park experience ever and loved the holiday spirit! We will be back again and again in 2018.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Disney World is Better", "I’m a Florida resident and visit Disney World often with my family. My wife wanted to go here to compare. We both enjoyed our day, despite quite a bit of construction within the park, but DL just doesn’t compare favorably to DW. What’s up with that tiny castle?\nShow less"], ["Reviewed January 23, 2018", 4.0, "Very busy", "Yes I know it's Disneyland and they are going to be busy but for a Thursday, it was crazy! But my 3 kids had fun and didn't mind the crowds."], ["Reviewed January 23, 2018", 3.0, "Disney Magic But With A Caveat", "First off- I am a huge Disney fan and for me it has such roots in the Anaheim area and with Walt Disney's original vision that it is a must see.\nI visited on a Monday toward the end of January and it was extremely busy- I think it's similar to Tokyo Disney in that it has a very densely populated area with lots of AP holder's who are willing to take the day off (or take advantage of goverment shutdown!) and spend time at DIsney. The park did handle the numbers well however it does make the whole experience more stressful, especially when you don't expect it.\nThe park itself is a blend of the classic Disney rides from Alice in Wonderland through to Buzz Lightyears's Astro Blasters set into well laid out zones which are all very distinctive. There are a good range of restaurants both sit down and counter service however I would definitely make a reservation if you're looking at one of the waiter service restaurants. I was disappointed in the gift shops as there wasn't really anything special that was different- I thought especially with it being the original Disney park, they would make more of that rather than standard gift shop fare you can find in Paris or Hong Kong.\nI think ultimately for me, Disney will always give you a day out that's different and special however I think this park has lost its way a little bit and for that reason I would probably head to Knott's Berry Farm instead for my next visit.\nShow less"], ["Reviewed January 23, 2018", 3.0, "A family fun time.", "Missed the old style or type of service Disneyland used to give . Yes I can help you get to next ride or store no problem.\nEmployees in store we went in were outstanding in there help nice touch.\nTo many of the employees on rides were just talking to each seems over staff on to many ,other like they didn’t have tIme to help us to get to next area as some things have changed since we were there last . Our kids even picked up on this and told us about how they felt about it. Like they didn’t have time for you they just wanted to talk to each other rude staff members.\nSo help or lack of it made that what was new and or where we could get our handicap person on this ride or not uncomfortable to say the least.\nTo many employees together seemed to just stand around togetherness and talked,we did find a few employees at it’s a small world to help and goofy kitchen staff was a great help to us.\nWe missed the nights fireworks as we didn’t know about the time it was taking place and we were coming back from dinner at goofys kitchen wonderful staff clean comfortable as I said and saw the very end,we would have gone back sooner if we had got the right answer to what time fireworks display was going to happen.\nWe talked as family oh well we saw little of the end from the tram ride back so better then not at all.we tried to make the best of all and have wonderful vacation on earth.\nIce cream pineapple treats was great while waiting to get In to see singing birds a must to try and we all loved it worth it oh yes indeed. Enjoy the jungle ride ,submarine,cars ,toon town, pirates of the Caribbean , riverboat ride,shops, once you got into parking garage it was spacious clean comfortable to get into next area to get bags check out and then on a ride over to park all came together. Long lines to get in to park but that’s nothing new .\n\nWe all talked on way home and we will go back but we are going to have to have better service and help on our visit.\nMaybe it’s not this bad all the time.\n\nWe went away with will give it another try before we say no way Universal and warner brothers is so much more fun.\nKids and adults love the fun had at other two places in the past.\nShow less"], ["Reviewed January 23, 2018", 5.0, "So amazing", "We are annual pass holders to Disneyland and visit all the hotels n the area. We will stay here from now on. The rooms were clean and spacious and the beds were comfy. Customer service was great. The restaurant downstairs was good and the breakfast was yummy. Esp cuz kids eat free. We loved it\nShow less"], ["Reviewed January 23, 2018", 5.0, "Awesome holiday!", "We spent 3 days at Disneyland California. Day 1 was a learning curve. We got a locker for our cooler with lunch and snacks just inside the entrance between the two parks. This worked well for bathroom and lunch breaks when we bounced back and forth. Day 2 we took full advantage of Fast Passes and day 3 we topped up with a few rides we’d missed and some we wanted to retake. The light show was amazing.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Plenty of activities to fill a day!", "It's fun for families. Exhibits are great and rides authentically adventurous with great animation props."], ["Reviewed January 22, 2018", 5.0, "Tired, but happy people", "It is always the lines and lines and lines. Anyway if you have to try the rides make sure you get the fast line and plan out everything you want to do ..and use the map to guide you! For a tourist like me, I have to maximize the time to compensate for the ticket price. Or get $200 from Costco for 2 parks (1 park per day). Anyway, I missed to see in the parade my fav disney princess because i dozed off due to jet lag! The parade is a must see for me everytime I visit the park. I always feel good and happy.\nShow less"], ["Reviewed January 22, 2018", 5.0, "The Original Disneyland", "Where else can grandparents with their kids, and grand kids go at 8am and stay for the fireworks at 9pm then say where did the day go. Everyone has a great time (apart from granddad who is paying!) and the hours just fly by. Even who nanna did a dance with Minny Mouse much to the horror of her granddaughter.\nAs much fun and well run as ever.\nShow less"], ["Reviewed January 22, 2018", 3.0, "Unhelpful Staff", "Que to buy ticket at gate was 35 minutes long. Monorail/Train wasn’t operational.\nI was unaware of the FASTPASS feature until gone lunchtime, when most of the rides were fully reserved. Why was I not told about that at the gate?\n\nA woman was sick over my rucksack on a Star Wars simulator ride, I told staff and they let the next lot of riders on without cleaning it which just amazed me. I had followed this woman out and asked her husband to wipe my bag clean as it was just disgusting, he refused and said it’s not his or her fault. I said well it’s not mine! Had no regard to my belonging being soiled in her fish smelling vomit. I had done my best to wipe it clean but it still smelled, I walked to guest services explaining my problem and they had no suggestion, I asked for a complimentary locker so I didn’t have to carry it around with me and gross myself and others out anymore and they said I would have to pay! This was my first visit and was totally spoiled. Fireworks were disappointing and the pizza was grossly overpriced, as was a Coca Cola.\nShow less"], ["Reviewed January 22, 2018", 5.0, "WOW", "OMG Disney was just everything I had imagined when I was a kid so glad I got to take my children and experience the magic of Disneyland from the moment you walk into the gates from the moment you leave it makes you feel like you have entered another world\nShow less"], ["Reviewed January 22, 2018", 5.0, "Huh! Tired to death but a day to remember", "Our iPhone app showed we walked almost 8 miles on the day we were in Disneyland. Phew! Didn’t feel so all day. That says it all. We were there on the 26th of December 2017. You can imagine the crowd situation. Had to wade through the crowds almost all day from the time we entered till the late night we left from there. A few things we tried and learnt.\n1. There are several restaurants in 2mile distance. We took a Lyft taxi (just for $4). Had a proper dinner and went back to Disney. That was a good 1 hr break and amazing food compared to the fast food and expensive ones at Disney. More so the waiting time. Only draw back is the walking to the main entrance. But it is worth the effort.\n2. Pack some good snacks especially if you’re there with kids. They did allow our food items although we had read a few reviews saying outside food would not be allowed. We did have a few sandwiches, cookies and a little rice. This was handy to have some quick bites in between rides when we anyway knew we would be waiting in the queue.\n3. Make sure you carry a battery power bank for the phone. We need to keep checking the Disney app for fast pass times for many rides often. Make sure you have the Disney app installed on multiple phones and use the same login so your fast passes are available on multiple phones. This would be handy as a back up plan when one phone is dead.\n4. We didn’t have much time to plan in advance. But a little bit of research and watching videos in advance would have helped in zeroing in on the top rides. We didn’t have time for Indiana Jones. The wait time was almost 1.5 to 2 hours for most of the time. Had we known in advance we would have probably gone there in the morning.\nSplash mountain is top of the rank for my family. My older daughter and I did this three times. It’s such a fun. You will be very wet if you are on the front seat. Better carry some ponchos. Our ponchos were very helpful in keeping the backpacks and purses from getting wet. We didn’t care so much about ourselves getting wet so much.\n5. There is a special light show in the night. For this one we need to get physical tickets even if you have the fast pass. I didn’t know that before. These tickets help you have front seats with better view. We ended up standing at the far end and watching it but it was very difficult. My wife and I had to hold up our kids so they have a better view. The lighting show on the castle is way too good. Please don’t miss this. This is open to all. Make sure you are aware of the show timings on that day and plan to be there well in advance.\n6. Lastly. Arrive early. Take breaks. Stay till late evening. If you are concerned kids will be tired and you may not be able to stay longer, don’t be. We are a good example. We were there early and retuned to the hotel at midnight. Take it easy. Enjoy. I am sure we will go back to Disney in a few years.\nShow less"], ["Reviewed January 22, 2018", 5.0, "The week before Christmas", "We took our six year old son to Disneyland Dec 21,22,23 2017. I was afraid of the crowds and congestion. Neither one really were an issue! Using Fast-passes and the Disneyland wait time app, we saw all that we wanted except the Peter Pan flight. I refused to stand in a line more than 20 - 25 minutes. The highlight was of course Fantasmic and World of Color.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Disneyland Family trip 2018", "Be prepared to walk a lot. I suggest to go early when the gates are opening. Go to the main ride attractions such as Indiana jones it's only a 10min wait which is nothing compare to how it gets in the day (2-3hours). I always take a bag pack and fill it up with snacks and drinks especially on a sunny day it helps a lot and it's less expensive. Tickets are over $100 and when you have a family of 5 you try to be mindful of how to save . I love Disneyland & I go every year.!\nShow less"], ["Reviewed January 22, 2018", 4.0, "nice but overly priced", "Glad we went to keep promise to children. The food is overpr\niced, the ride waits were long, but overall the children are so happy to be there. Our favorite ride was the roller coaster in frontierland. The paddle boat was a fun relaxing ride too. Space mtn ride was not a favorite. The train around the park was good. Some rides shut down because of the rain.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Fabulous!", "You can never get enough of the magical kingdom. From the storybook and film characters you know and love to the fun-filled rides where you experience scenes from childhood memories or favorite shows. Everywhere you look around you are surrounded by wonderful sites!"], ["Reviewed January 22, 2018", 3.0, "Way too crowded", "Even with the Fast Pass we could only ride about 3 rides in 6 hours and we decided to leave. Not to mention power was out for 30 minutes ir more and shut down most rides. There were so many people they jmhad to stop letting them in. Fast Pass felt like a scam, it was a terrible value for my family of 5... Parking took over an hour, mot organized, getting in the gate took over an hour not very well organized. It was a miserable experience.\nShow less"], ["Reviewed January 22, 2018", 4.0, "A bit disappointed this time", "Park is still fun overall and kept very clean but there were many rides that kept shutting down. We were in line quite a few times when we were told the ride had stopped and they weren't sure when it would be back up. This added longer lines to other rides and made for long waits. I won't ever go there again between Christmas and New Years! The Castle lit up at night is beautiful and the rides we got on we fun and well managed.\nShow less"], ["Reviewed January 22, 2018", 2.0, "Swarms of people", "I expected the park to be busy but not to the extent that i experienced. Bottom line, they let too many people in. Would not go back."]]}}