{"Disney California Adventure Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Disney California Adventure Park", "url": "/Attraction_Review-g29092-d186690-Reviews-Disney_California_Adventure_Park-Anaheim_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/19/a4/29/balmy-november-evening.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "13171"}, "address": {"@type": "PostalAddress", "streetAddress": "1313 Disneyland Drive", "addressLocality": "Anaheim", "addressRegion": "California", "postalCode": "92803-3232", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Brilliant Day at California Park..", "Love coming here..Thrill rides are great..Guardians of The Galaxy was awesome, Soarin over the World is my favourite..Cars Ride is great..Park is Clean, Staff are Excellent, food choices are great.."], ["Reviewed yesterday", 5.0, "Such a Day", "The new Guardians revamp to Tower of Terror was someting I wasn't too excited about. I was soooooo wrong! This ride had me laughing up and down every fall! Super great day!"], ["Reviewed yesterday", 5.0, "LOVE", "January is a great time to go! We had 80 degree weather and the crowds weren't too terrible. We LOVED Soarin' over the World!"], ["Reviewed 2 days ago", 5.0, "Family with Young Adult Children", "Very busy during the first week of January. Get Max Pass! It will save you hours in line. We rode Grizzly River Run 4 times in a row with Max Pass while others were waiting in the fast pass line."], ["Reviewed 2 days ago", 5.0, "You just arn't too old for Disney", "Trip of a lifetime heading to Disneyland for my 40th birthday. First time and boy did i have an awesome time! What blown away by the awesome customer service we received. The rides were AWESOME.\nLucky we went on non-busy days and only had to wait 20 minutes for rides but we kept ourselves entertained.\nShow less"], ["Reviewed 2 days ago", 5.0, "Get Your Free Fast Passes!", "Disney’s California Adventure offers Fast Passes for rides with the longest lines. As soon as you arrive, go to The Radiator Springs Fast Pass distribution kiosks, followed by the World of Color Fast Pass Center. These are the most popular attractions and you don’t want to have to wait in really long lines or miss them! Ask a worker where the Fast Passes machines are located. You can have both of these Fast Passes at the same time. Then hit the less popular attractions while you await your time. Before your visit, study which rides have Fast Passes so you are prepared. With as much as you are spending for your day, make the most of it!\nShow less"], ["Reviewed 3 days ago", 5.0, "Husbands First / Birthday Trip!", "He had such an amazing time. The cast was so nice, everyone told him happy birthday. Everyone was so wonderful, it couldn’t have been a better expierence."], ["Reviewed 3 days ago", 5.0, "Love this place!", "My family and I had an amazing time. It is rather expensive but it is a must. You forget the $ stacking up when you see your kids smiling. Get fast passes but be mindful you can only ride it once on them per ride. Spend a little more and get the hopper pass, too much to see in one day\nShow less"], ["Reviewed 4 days ago", 5.0, "Another top Disney park", "We spent one day here and had an excellent time. Includes our favourite ride Soarin but also has some new rides we haven’t riden before which were brilliant. We especially enjoyed the river rapids and the radiator springs. We also really enjoyed the live frozen show.\nShow less"], ["Reviewed 4 days ago", 4.0, "A little more of a thrill", "This place had the thrills we were looking for! Still utilizing the great 3 day promo they had available for Canadians, we decided to check this park out on our second day at the resort. The rides were great! Unfortunately, many rides were closed for refurbishment, but I guess that's the price you pay when you travel during off season. Stand out attractions for us included Soarin', Guardians of the Galaxy: Mission Breakout and surprisingly, The Little Mermaid - Ariel's Undersea Adventure. I'd love to return when Pixar Pier is complete. Looks like it's going to be incredible!\nShow less"], ["Reviewed 5 days ago", 3.0, "Wait until Paradise Pier reopens, then give it a shot!", "My daughter (now 7) and I come to Disneyland every year for a father / daughter vacation. Currently, much of Paradise Pier is closed. That drives even more people to Cars, which frequently had waits of 120+ minutes. That, combined with mediocre food and limited entertainment, make for a park that's worth skipping. If you only have 1 or 2 days, I would spend both in the main park. 3+ days you can give it a shot, but I really wouldn't come back until they have Paradise Pier reopened.\nShow less"], ["Reviewed 5 days ago", 4.0, "First visit", "We loved Cars land! Walking the street was just like being in the movie. We were able to do the extra magic hours since we stayed on property. This allowed us to do all the rides in cars land with no lines and take some awesome pictures of the park without people. The monsters inc. ride was also super cute. The Pixar pier part of the park is going to be awesome once opened but unfortunately bad timing with our first visit the fun wheel under construction.\nShow less"], ["Reviewed 6 days ago", 5.0, "Cars land", "This was my favourite park even with construction going on it wasn’t that bad, I loved cars land it was amazing we went to this park more than Disneyland. Still get a nice picture of the wheel 😊."], ["Reviewed 6 days ago", 3.0, "So many closures", "There were scheduled ride closures, but while there, we experienced rice malfunctions on 3 separate rides and the Frozen show was cancelled unexpectedly. With our fastpass sitting all day to get on the cars ride in the late afternoon, we spent a lot of time in lines. After so many issues, I ended up counceling my 8 year old on how we need to just roll with things out of our control. However, since we paid over $400 for the day for our family, the number of these issues was really frustrating. I expect better from Disney. My kids wanted to go back to Disneyland and leave CA adventure. Soarin was definitely a highlight of the day and worth the hour + wait.\nShow less"], ["Reviewed 6 days ago", 3.0, "Not what we expected", "We visited the park two days ago and to be honest, we were very disappointed! This review is being made by three adults who went to the park instead of having kids with us so I know that could make a difference with this particular park. However, that being said, I have been to Disneyworld one time without kids and it is great fun for adults, too! So many things were under construction and they were the things that we would have enjoyed. The roller coaster was shut down as well as the Mickey Mouse Ferris Wheel. Also, there were two other attractions that were temporarily closed during the day. We were surprised to find that we were waiting in lines for 45 min. We did use the fast pass but you have to wait so much time in between each ride to schedule those. I know how crowded these parks get because I have been to Disneyworld three different times. However, this isn’t their busiest time of the year and; truthfully, the park isn’t that large and we really felt they should have had one pass for both parks. Possibly, if there were more rides available, there wouldn’t be these really long waits, We only were able to get on 6 rides/attractions in 6 hrs. and that was using a fast pass for 3 of them. We were staying in Laguna Beach and very sorry we wasted a day of vacation at the park.\nShow less"], ["Reviewed 6 days ago", 5.0, "Excellent, even with some construction going on.", "We had a great time, don’t miss the nighttime show, it’s impressive! I wish I was still there, we’re going to have to go back."], ["Reviewed 6 days ago", 4.0, "CARS LAND...WOW", "We visited Disney California Adventure park last week on a week day and just for one day. Week days are value days. It was fairly expensive for just one day. My children were only interested in Cars Land. We did checkout the whole Park but never bothered with any other rides except in Cars Land. The big Micky Mouse wheel was closed which no-one informed us about. It was busy but not as busy as other times of the year I suspect. We had a really long day from 9am-8pm. We bought our tickets the day before when we ventured to Disney Downtown. When we arrived there were queues but they went very quickly. We got fast passes for the Cars Land Racers ride but even with them it worked out that we could only get on the ride twice in the whole day. We covered the other 2 rides as well which were all good. The best is definitely the racers, a real must do.\n\nThe whole set up in Cars Land was amazing you felt like you were really there. The had different characters coming along all day as well. The food was unexpectedly no expensive and fairly good too. On the whole my boys loved it but as they inly wanted to see one area we just did the one day. I believe its much smaller than Disneyland in Florida? There are deals for 2 parks over 2 days look on the website although you can buy your tickets at the entrance for the same price I believe. So to sum up definitely worth a visit.\nShow less"], ["Reviewed 1 week ago", 5.0, "Loved Disneyland California Adventure Park", "I really loved Disneyland California Adventure Park, I loved the restaurant where we went for dinner before the show \"World of Color\", first they had The Year of Dog and the regular show, I loved both shows!!"], ["Reviewed 1 week ago", 5.0, "My favorite part of both parks. I could have stayed 2 whole days just in here.", "I could not stop taking pictures. My husband and I got to the park before our kids and we giggled like little kids going on the rides before anyone got there. The warm welcome from every single employee was just wonderful. I enjoyed every second of the park.\nShow less"], ["Reviewed 1 week ago", 5.0, "Enjoyed", "We couldn't go on all the rides as some were closed and some didn't appeal to us. However we enjoyed all the rides we went on. Some were for the first time as we had gone to Disney in Paris and Hong Kong before. It was a lovely time. I loved the night show too\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth every minute of the long plane ride", "Took my mum for her 50th and we both absolutely loved it - planning to go back for when Star Wars land is built! No problems, no issues - just Disney Magic!!"], ["Reviewed 1 week ago", 3.0, "Better than Disneyland!!", "We enjoyed a much better day at this park than we did at Disneyland battling the hundreds of thousands of people and strollers and mobility scooters!\nThe rides were of a better quality and the scenery sets etc, really enjoyed Soarin and Cars where we used the Fast Pass aswell as queued for 45mins. The water rider was the fastest moving line in the park as you came off drenched so pack a cheap plastic poncho in your bag for this ride ;-)\nYou are allowed to take food/water into the park and i totally recommend you do this as you can snack and keep fuelled while waiting in the long lines.\nShow less"], ["Reviewed 1 week ago", 3.0, "So much closed down", "It was surprising and disappointing that so many things were under construction or shut down. Of course you can check that ahead of time, but if your coming to Disney, of course your going to both parks. The Soarin ride was really good, and of course cars was too. With Ariel shut down, and too cold of weather for the raft ride, no roller coaster and no micky wheel, it seems that The value for the ticket just isn’t there. Plus it looks shabby to see construction, not magical like you want Disney to be.\n\nThis has been our “go to” vacation spot for 4/7 years but we won’t be back now.\nShow less"], ["Reviewed 1 week ago", 5.0, "MUST visit", "We spent three days here. The first was spent exploring. The second, we revisited our favorites from the first day and experienced a few new opportunities. The third day, we made sure to hit our favorites again before we left. We didn't need a fourth day, so I'm glad we didn't plan one. Several rides broke down after we'd waited in line for nearly an hour, which was extremely disappointing. However, if you have time, spread out your experience over several days so you don't experience the disappointment of a broken ride. The employees certainly work hard to keep things moving, but some of these things are just beyond their control. Whatever you do, BE SURE to enjoy the fireworks and electric parade at the end of at least one night. Both of these are worth the crowd and loss of sleep. You'll find everyone to be in good spirits, so it's worth the wait.\nShow less"], ["Reviewed 1 week ago", 5.0, "Favorite place ever", "I don't even know where to start, i have loved Disney my entire life. but it came to life in radiator springs!!!\nThis park is amazing, really well catered for little ones in bugs life land. Goofy land is awesome, the toy story ride is hilarious.\nGuardians of the Galaxy ride OMG OMG OMG. I didn't know if my nose was my navel or my navel was my nose. i cried, screamed, then laughed till i hurt. This is not a ride for the faint hearted, or even strong hearts my struggle with this ride. I dont do ride, i did not know what it was, i am glad i went on to say i survived.\nnow lets go to radiator springs, this was so like the movie it was the best. the Cars ride is so cool i went on it 8 times (single rider is the best). flo's cafe, the shops, the Cozy cone, luigis tyres. it was so very amazing.\nI have to say adventure park was my preferred out of the two lands (disney vs adventure) i spent 2 days here and i was smiling like a mad woman. my kids loved it too.\nthe other happiest place on earth.\nits a must its amazing its perfect\nShow less"], ["Reviewed 1 week ago", 3.0, "Disney", "Cool place , lots an lots of things to see an do . Not sure why , however it appeared to be smaller then I’d imagined. In saying all that it is really a wonderful place for the under 12s not so much for the older . Ques are massive for rides so my tip is go in the single rider line, saves you a stack of time and allows you to do both parks in less then a day .\nShow less"], ["Reviewed 1 week ago", 5.0, "California Adventure fun", "This park is the newest one of the two. It's rides are all ADA accessible so you have to stay in the queue if you have a wheelchair or scooter. They help accommodate you getting on the ride. This park has rides like you'd find at a fair, then they have some thrill rides like the soon to be incredicoaster, the guardian of the galaxy, cars ride, and soarin. This is my kids favorite park of the two and it's easy to find things. The only down side is the backtracking to get to certain rides.\nShow less"], ["Reviewed 1 week ago", 5.0, "My favorite Park", "This is my favorite Park! Usually less crowded than Disneyland during the week. Highly recommend the Frozen show at the Hyperion Theater. Paradise pier is currently under construction making way for the new Pixar themed area. Little Mermaid, Toy Story Mania and restaurants on the Paradise pier are still open and character greetings are still there in certain areas as well. Because of the Lunar New Year celebration we saw Mulan and Mushu and able to try some Chinese and Vietnamese cuisine. The Disney Jr show is brand new with exciting character surprises!Currently in the mornings if you go see Anna and Elsa you can see Olaf and Kristoff at the same time. Check with a cast member for specific times.\nShow less"], ["Reviewed 1 week ago", 3.0, "Worth a visit. Single day, maximum", "Go first thing in the morning and get a Cars Fast Pass. People actually run for these so just follow the crowd and don't be surprised if you have to wait 4 hours to go back for your ride. Alternatively, just run for the ride and don't worry about a Fast Pass. Also, expect to line up for an hour or more, even with a fast pass. It's hard to not get stroppy when the fast pass queue is so slow moving and the kids start whinging, but then the ride was so much fun so I thought it was worthwhile.\n\nWe didn't get many other rides in as the rollercoasters were all either on scheduled maintenance or broke down mid ride for 2 of the 4 days we were there. So the rides that were available had ridiculous wait times. Nevermind, back to Disneyland on the park hopper ticket.\nShow less"], ["Reviewed 1 week ago", 5.0, "Cars land", "My 5 year old son loved Cars land and as an adult I thought it was really well done too. Especially at night."], ["Reviewed 1 week ago", 5.0, "Great Family Fun!", "We visited with 10 grandchildren ages 2-18 and there parents. Guardians of the Galaxy was the new family favorite, with Radiator Springs and Soarin following close behind. This park has so much variety for all ages! We were able to get fast passes for all of our favorites and ride them even more than once. It was disappointing to have California Screaming and the big fun wheel down, with a lot of construction for the new Pixar Pier. The World of Color Show was wonderful!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great First Time Visit", "Across the way from Disneyland the Disney California Adventure Park is a newer and more thrill rides. Great fun with lots of queues and wait times can get long even in off season of winter. Fast passes help but still a lot of waiting. Great rides and attractions and the World of Color show at night is excellent. Hands down the Guardians of the Galaxy ride was best. Soarin around the World is a very excellent quiet ride for all. Great theme park.\nShow less"], ["Reviewed 1 week ago", 4.0, "Family Good, Always Good.", "I have been to Orlando and Cali, both are great. Both have plus and minuses. Neither will disappoint. Great time is promised. Amazing how clean a park could be. Terrific job of making this place special."], ["Reviewed 1 week ago", 5.0, "Excellent day out", "We found this park better than Disneyland. Go early and make a beeline for the cars ride and guardians of the galaxy. Must do rides. Get there by 8am and you will only wait 20 mins for rides rather than an hour.\nWe went with our 21 and 23 year old kids and all love it. Highly recommended.\nShow less"], ["Reviewed 1 week ago", 5.0, "Yes", "California Adventure you have yo stop here when in town. We spent 2 1/2 days here and totally enjoyed it. Lots of great rides from Cars Guardians of the Galaxy to Bugs Life and Toy Story. So much fun and the rides are very modern so smooth and tight less chance of feeling ill from vibrations. Food here is great make sure to get a corn dog, turkey leg and the most awesome smoothie down in the Hollywood area. If you like to shop California Adventure has that too and don't miss Soarin it's AWESOME. This was my first time here but would recommend it and will be back for a roller coaster ride and the Mickey wheel as they were closed for refurbishment.\nShow less"], ["Reviewed 1 week ago", 5.0, "California Screaming!", "What a great place for adults and teenagers alike to get the rides that are a little more exhilarating than some that you may find at Disneyland. California Screaming was by far are favourite ride! Adults are able to walk around the park with beer, margaritas and the like. The show at the theatre “ frozen “ was as good as it gets for theatre, what a great show for the kids. If you have little ones, then turtle talk is a great interactive experience for them. We will definitely be coming back such a great time!\nShow less"], ["Reviewed 1 week ago", 4.0, "Awesome day", "We went with a 1.5 year old and a 5 year old. Had an awesome day. Park is connected to a plaza that houses Disneyland as well as Downtown Disney. All parking is together in a high rise structure. A team is used to bring to park. A little difficult with strollers. Lots of nice rides and cars town in awesome. In the back they are building a pier with more rides which were nice.\nShow less"], ["Reviewed 1 week ago", 5.0, "First Time Visit", "I recently visited Disneyland for the first time and Disney California is one of if not my favorite Disney Theme Park. I have visited all of the parks in Walt Disney World but just loved being in this park! It does represent the spirit of California and Hollywood, etc. And of course, Car Land is awesome!!\nShow less"], ["Reviewed 1 week ago", 4.0, "The happiest place on earth part 2 !", "There is always a question , that is which park is better ? Disney land or adventure park, well my answer is , why ask ?? Try both !! Ok seriously , i think it is hard to compare as both parks have its classics and different attractions ....my advice for those who want to squeeze in 2 parks in a day , arrive early to adventure park , ride the more thrilling rides, then have lunch and head over to disneyland. Once there , you can have a choice to go back n forth the parks , but it will be a long day , so stay hydrated , rest when needed and always fuel ur tummies up .\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice park", "We enjoyed CAP. It wasn't overly crowded so that made it nice as did the pleasant weather. Radiator Springs ride is crazy wait times but we were lucky to get to it during the magic hour so wait was only 15mins (it got to 120mins wait and fast passes ran out later in the day).\nShow less"], ["Reviewed 1 week ago", 4.0, "Carsland made all worth it!", "Since we do visit Disney World each year, most of Disneyland and California Adventure had many of the same rides which we love! BUT DW does not have Carsland and wow is it super themed and fun!!! It was definitely our favorite. Be sure to ride, or at least watch, the rollicking car ride - it's adorable. The ride Radiator Springs Racers is like Test Track and is a blast and even better than Test Track at DW. Even though most of the Midway is closed right now for refurbishment don't skip Toy story Mania. But be sure to race on over to Carsland!\nShow less"], ["Reviewed 1 week ago", 5.0, "John", "Very exciting and upbeat Park. My 4 year old really enjoyed the cars land ride. We especially liked the Guardian of the Galaxy ride...wow! Very wide open park, but plenty crowded for month of February."], ["Reviewed 1 week ago", 5.0, "The adult Disneyland", "In the past, I have always avoided the California adventure park. Today I got a little bit of a experience here, and I’m ready to come back and spend the entire day and evening in this part of Disneyland. As a pilot I enjoyed the aerial ride. This was all I did today and I can’t wait to come back for more. Looks like lots of great restaurants, and they serve beer and wine in many places on the side of the park.\nShow less"], ["Reviewed 1 week ago", 5.0, "It's Disney, of course it's fun!", "Even though it's a little expensive and their is a lot of construction going on - it's still a fun place to visit. If the crowds are light you will not spend a whole day here because there are not as many rides here as with Disneyland - especially if you have teenagers You may want to invest in a park hopper if traveling from out of town. Overall a must do while in Southern California.\nShow less"], ["Reviewed 1 week ago", 2.0, "A lot was closed", "I was here in late Jan / early Feb 18 and so much of the park was closed for refurbishment that I barely spent any time here. I'm sure it's better when all attractions are available."], ["Reviewed 2 weeks ago", 5.0, "Great park but looks small", "We had VIP guide when we visited Disney California park. it feels we finished in 5 hour the most activities with multiple time. ( I believe due to private guide it feels less attraction than Disney in Orlando but worth to visit at least once. Disney Frozen show was the best.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Love California", "This was our fourth visit and we still love it. It’s not cheap but it’s worth the visit. I would definitely go again. This time was with a teenager and still had a great time."], ["Reviewed 2 weeks ago", 5.0, "Is was great", "The foooooooood is crazy good and will have you like wow when you eat them The price is crazy high but worth"], ["Reviewed 2 weeks ago", 2.0, "Disney California Adventure Park", "I have been to this park multiple times and this trip was not very good. There is a lot of construction going on and quite a few attractions were closed. Also when it started to rain it seemed like half of the park shut down."], ["Reviewed 2 weeks ago", 5.0, "Great time to come!", "Loved the maxpass! The lines were short on most rides and we were able to get fast passes on our phone for the longer ones. Best $10 ever... Guardians of the Galaxy and Radiator Springs were so much fun we rode them each three times."], ["Reviewed 2 weeks ago", 5.0, "Great time was had by all", "Always a great time in Disney California Adventure Park. Even with a lot of renovation going on in the pier area the park is fantastic. Cars Land is always fun. It gets busy so get your FastPasses early and utilize the single rider line at Radiator Springs Racers.\nThe highlight of the week was the revamped Tower of Terror to the new Guardians of the Galaxy Break Out. We were a little skeptical at first about the change of a great ride, but when we saw the new look we were very impressed. The ride it self is so fun and seemed different every time we rode. LOVED IT!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "February is Great", "Go before presidents weekend and mid week if possible especially if you have no kids. No need for fast pass because we went on all rides with very little wait. Also Chinese New Year celebrations."], ["Reviewed 2 weeks ago", 5.0, "Disney Addict", "Although Paradise Pier was being revamped we still had a lot of fun. Absolutely loved Guardians of the Galaxy (I have been on the old ride and Guardians is a lot better)."], ["Reviewed 2 weeks ago", 5.0, "Great fun!", "We didn’t expect such crowds on a Monday in February! Some rides were closed for renovations. The attraction that I enenjoyed the most was “Frozen”. It was an excellent life performance that only Disney could do."], ["Reviewed 2 weeks ago", 5.0, "First Time!", "We visited in mid January and it was our first time. We decided to do the max pass along with our ticket and it was totally worth it. It gives you a fast pass with out having to be in the area of the ride you want. And any Disney professional who takes your picture with any character or at any designated area you get all the pictures! Worth it! We got so many pictures. We loved this park. Cars land was awesome. I would suggest sharing food around the park. I also would suggest getting a fast pass right away for the racers. They go fast and the line gets long quick. When we were there and sounds like til April part of the pier was under construction for the up coming Toy Story land. So just to keep that in mind. The roller coaster and some of the rides were down. The Ferris wheel was also down when we went. Putting the disneland app on your phone is very helpful to get rides that are down and approximate rides times. Also where characters will be. Would also highly suggest seeing world of color! Great show! To make it easier and good seats for us we did the dining package. Was going to eat anyways.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Little bit less", "Out of the two twin parks, this one seemed to have a little less to do, in terms of rides and shows.\n\nWe all still had a great time, and there's probably more space for the nighttime lights show here, but our favourite was the original across the way.\n\nThe cars ride is good, but not worth the wait, so get your fastpass early and then while you are waiting, can go on less busy rides like the California Screamin while you wait,\n\nThe Toy Story ride is very busy too, but that one is fun, so that's another you have to fastpass when you can.\n\nYou WILL get wet on the Grizly River Run, so if you want to stay drier, bring a poncho.\n\nAnd Soaring Above the World was our unexpected surprise ride, which we didn't expect to be so good.\n\nIts tough to be a bug was good fun too!\n\nI really don't need to spruik it though- its Disney!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun Day - Great Rides for Young Kids too!", "Visited Feb 11 and had a great day. Entered Park early before crowds showed up at 12. Frozen show and Disney Dance Party are a must for young kids. Soar and Cars were excellent (using our own shortened name version). Didn’t find a ride we didn’t like. Staff were friendly and knowledgeable. Midway area closed until summer. But all other rides working during our stay. Recommend you Limit time at Disneyland and spend more time here - especially since Disneyland main-street is under construction. Get the fast pass early for major show in evening. Fun day!\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Disappointed!!", "We didn't get the experience we expected. The 3 of their biggest rides were CLOSED!! (2 on California side and 1 one Disneyland side). We spent good money but we left feeling like we didn't get the experience we were expecting leaving feeling like we wanted more. Most of the rides were tailored to younger children. There should be a balance for older kids as well. The selection of food was not great on the California side as well. We found it hard to find something to settle with. Plus the prices at the park are crazy!! 80.00 for fries, burger and a pop for four people is a bit much.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great day", "Typical Disney fun Great park. There when they opened with was the slowest part of the day. Cars and soaring are the two rides to go right to. Also recommended was the frozen show. FYI don’t bring a selfie stick in as they are not allowed.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome place for kids at heart of all ages", "This was a 3 generation holiday and everyone from 6 to 69 thoroughly enjoyed themselves. We took advantage of FastPass through the App and got to enjoy a lot of rides without the lineup. We took a locker outside the Adventure Park which was convenient for hopping back and forth between there and the original Disneyland.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "We love California Adventure!!", "So fun and another Disney must for families. There are rides and fun for all ages. This park\nHas a lot more advanced rides. Cars land is amazing! Be prepared to wait a long time for some of the more popular rides (Radiator Springs & Guardians of the Galaxy).\nThis last trip we took advantage using the MegaPass. That makes all the difference in waiting times, etc.\nCalifornia adventures is amazing!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great holiday", "We loved it here once again. We spent 3 days here and had a ball. We loved the new Guardians of the Galaxy section especially the dance off my 8 year old thought it was THE BEST EVER. Crowds were fine and the Lunar New Year section was fun.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "A Little Better Than Disneyland", "I don’t think I’ll be returning to Disneyland as a planned family trip. If we did return, California Adventure is a better park. I’m not really impressed with either of the parks because they are both a ripoff. People who say their favorite place to vacation is Disneyland need to get out and see the world a bit more. Who in their right mind pays the price of admission to get in to this place to go stand in a long line for a subpar ride and then go eat food that’s overpriced and not very good?\nShow less"], ["Reviewed 2 weeks ago", 4.0, "First time at California adventure Park", "Enjoyed our time. Glad we had a friend give us the rundown BEFORE going; explaining fast pass and recommended rides.\nDisappointed that a whole section was closed including Ferris Wheel and that whole area. I knew it would be closed but that and the Big water ride all being closed, it seems that Disney could have compensated us in some way. But hey, it's a Disney Park and that's just the way they rock. With so much closed, a partial day was good enough. Toy story ride was the best. Glad to see so many young people seeming to enjoy live theater with Frozen. Excellent. Staff very pleasant and Information at the front of Park was amazingly helpful. Water show worth the wait and standing on tired feet.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun but super crowded", "Main Street is completely blocked off with a wall that makes it difficult to navigate with so many people. The park was super crowded but ride lines were not too long. We had a good time riding rides and shopping. Our favorite rides are Thunder Mountain Railroad and Space Mountain!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Loved It!!!", "First visit here with my family husband and sons 15 and 19 was comparing it to Florida a bit !! Not as big but certainly as good !! It's situated in the middle of a housing area and is in easy walking distance from the local hotels and paces to stay .\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Another Disney Park for great family outing", "Living in Kissimmee FL in close proximity to WDW, this park is smaller but they have newer attractions and rides, as always, Disney is never short of spreading magic to park-goers.."], ["Reviewed 2 weeks ago", 5.0, "So much fun!", "Honestly, there isn’t too much I can say regarding Disney that you wouldn’t already know. Such a wonderful place to spend time with your family. So much fun. The only thing I can add for those of you that don’t know, during the off season, it is really slow, but they’re are a decent amount of rides down for refurbishment. You can take a look at this ahead of time on Disney’s website though. I also do like the new Guardians Break Out remodel of the old Tower of Terror.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Good experience, lots of construction", "We visited DCA mid-week at the beginning of February and enjoyed the fact that it wasn’t as crowded as it’s neighbour Disneyland. We used the max pass to book fast passes for the two most popular rides - radiator springs and the guardians of the galaxy ride. Since we were travelling with our toddler, we used the rider switch option for both rides. The walkways are wider than Disneyland which aided in less people crammed into small spaces. However, due to the construction of the paradise pier area which will become a Pixar land a couple of months down the road, it felt like at least a quarter of the park was not in use. We enjoyed the shows and rides, but one day is definitely enough for this park.\n\nThe only real negative event that happened was in the morning at the entrance gates. We arrived early and when it was our turn to enter, the parking attendant asked us how many tickets we had to scan. I said two. She glared at us and asked if our daughter was under three. We said yes, she’s 2.5. She then paused for awhile and sternly asked our daughter to stand up. She did and the attendant glared at her some more with a loud pout and glared at us. We then proceeded through the entrance gates. This unfortunate experience soured our entire morning as we were left thinking why this happened. Was it due to racism or the fact that our toddler is a tall girl for her age? Everyone else beside us was getting through the gates fine and we were never asked how old our daughter was otherwise. My husband and I concluded that it was completely fair of the entrance attendant to second guess our daughter’s age as she is indeed big for her age, but she could have simply asked us to show I.D. which would have efficiently solved any issue without making us feel like we were terrible parents trying to fraudulently usher our child through the gates without paying for her. All the evil glares and unprofessional tone of voice was entirely inappropriate. Hopefully, Disney will train their staff properly and also include some sensitivity training.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Bad time to visit", "Left a full review for both parks on the Disneyland attraction. But in short, loved the park, but just wrong time of the year to visit. The big white coaster and Ferris wheel were closed!!! Bit disappointing when we travelled all the way from Australia (hence my 4 star rating) My hot tip would be to get a fast pass. The lines are ridiculously long 30-60min wait and this was low season!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Get a MaxPass and watch out for ride closures!", "I liked this park better than Disneyland - less crowded, newer rides, and lots of superhero characters. I especially liked it after sundown - Radiator Springs is beautiful at night! If you're coming from out of town and only have a day, definitely spring for the Max Pass. It lets you sign up for FastPasses from your smartphone while you're in line for other rides. It really does let you maximize your time in the park. I will say, I was disappointed to see so many rides closed - they're rebranding the entire Pier section and most of it was closed. So if you're traveling spring 2018, keep that in mind!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "First time visit", "This was our first time visit to CA Adventure Park but our third Disney park. Loved all of the details in Cars Land and the Racer ride - that was our favorite area. Would love to go back when we had more time to spend"], ["Reviewed 3 weeks ago", 5.0, "Welcomed break from Disneyland", "We always come to California Adventure Park after spending an entire day at Disneyland. It is a welcomed break from all the crowds. There are still plenty of people, but it seems more spread out. There are so many great rides and shows that this park never disappoints!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun for all ages", "I love California Adventure Park. It has a mix of contemporary rides / attractions, as well as the traditional rides that you expect from Disney."], ["Reviewed 3 weeks ago", 5.0, "Always a great time", "I’ve been to Disneyland and California Adventure many times and it’s always a great time. I highly recommend going whether you have kids or not (we don’t and always have a blast)."], ["Reviewed 3 weeks ago", 3.0, "Ladies trip", "Have been to Disneyland and California adventure many times. We loved soaring around the world! Our big disappointment was that so many rides were closed. It is low season so I understand but the whole Paradise pier was closed so really took us half a day to see California adventure. Felt that we did not get our moneys worth. No parades were happening at all. We all still made the best of it!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A lot of fun and less crowded than Disneyland", "Cars land is amazing. It looks just like the films! Out kids loved seeing the characters from the movie as well as the regular Disney cast. It felt less crowded than Disneyland as well."], ["Reviewed 3 weeks ago", 3.0, "No discount from Disney", "Visited Califorinia Adventure Park last week with my family .\nTo find several big rides not in operation [grizzly river, californian screeming , mickys wheel.\nSo the other rides where very busy especially cars only one ride and gardians of the galaxy great ride but big ques.\nThe magic of colour show was very good and worth the trip.\nBut come on Disney there should be some discount due to 3 big rides out !\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Almost managed as poorly as the park across the way", "I am having such a hard time with the complete rip off these Disney parks really are. OUTRIGHT RUDE EMPLOYEES, AWFUL DIRTY BATHROOMS, CROWDED beyond belief, LONG line after LONG line.\n\nI contacted Disney Guest Services via email with serious concerns about our visit. The response lame, and I quote \"Thank you for your email regarding the Disneyland Resorts.\nI am very sorry for your disappointing experience at the Disneyland Resort especially with your experience with the parade viewing area. Your feedback is very important to us, and we truly appreciate that you took the time to send us your comments. It is through feedback, like yours, that we learn what we must do to ensure the Disney magic is preserved for everyone. Once again, thank you for taking the time to write. Your comments are invaluable, as we are constantly evaluating our operation. We do hope that you will have the opportunity to return to the Disneyland Resort and that your visit will be pleasant in every respect.\"\n\nIf I ever go back, it will be as a result of being out voted by the rest of my family.\n\nMy recommendation is that you go anywhere else to do anything else.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Disney does it best!", "This park is under massive construction right now, but it's still magical! Nothing beats Disney for the total experience!"], ["Reviewed 3 weeks ago", 5.0, "Great visit", "Hadn't been to California Adventure in 7 years and it's changed - definitely for the better. World of Color is fantastic, of course. Cars Land is great and Guardians of the Galaxy ride was better than expected. Can't wait to see what they do with Pixar Pier.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best family fun", "We stayed close to the entrance at Marriott hotel. Walking distance so you could go and have a break and come back for the wonderful night entertainment."], ["Reviewed 3 weeks ago", 5.0, "More Fun", "All I can say is I'm grateful for we stayed for a week. There were so many fun and exciting rides. Cars is a definite must - using the fast pass is essential but worth it!"], ["Reviewed 3 weeks ago", 5.0, "Disney the best", "The best theme park in the world. Great park for all the family. Nice, clean, safe, beautiful. Lovely place for parents and kids. Amazing shows and rollercoasters. Mickey Toonland full of beauty, color and tenderness. Fantasyland nice as well. Starwars Launch bay is great.\nNegative: expensive\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Park in the Heart of a great Place!", "Anaheim would never be the same without Disney California Adventure Park! It is an amazing place and believe there is no one like it. There are so many activities that suit all ages - from the very young to old people! It is great for families!\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Worst Amusement Park I have experienced.", "We've always gone to Disney rather than Cal Adventure but my daughter and her friend felt like doing \"Thrilling rides\" this time. So we went oCalifornia Adventures for the first time. The food and snacks were quite underwhelming both at the Cocina Cucamonga, and the booths along the Festival Of Holidays street. It was a nice idea in theory to set up booths with different flavors from different cousins around the world, however the execution was not quite there at least for the snacks we tries. We did try several snacks, like the Brussel Sprouts with toppings, and the Chocolate Yule log, and unfortunately they all ended up in the trash after the first bite.\n\nThe rides themselves were ok, the girls got fast passes for a few of them, however it was so inconvenient to walk miles between rides just to get a fast pass. And the most stupid thing of all????you couldn't get a fast pass if you already had one for another ride scheduled.\n\nWell, you park Geniuses, we got one fast pass at 2 which required us to return at 7 PM. This means that you wasted 5 hours of our time in between, because we couldn't get another fast pass. WE WERE PRISONERS OF LINES FOR THOSE 5 HOURS!!!!!!\n\nThen there was the Grizzly boat ride. Again, who are park genius engineers that decided it's a brilliant idea for people to have to stretch their legs and bodies in acrobatic positions in order to get into the wobbly boats while the rotund platform is spinning Non-Stop??? They should be fired. Very unsafe and very inconvenient. The ride itself was ok for the most part, until we got slammed so hard and almost thrown off the boat if it weren't for the seatbelts. I've been in 3 car accidents, where I got hit from behind, and none of that has given me whiplash or the bruises on my back that I got from being slammed back into the hard plastic seats of this ride. The park \"Geniuses\" need to pud padding to minimize the bruising impact of this ride.\n\nNext, we got on Racing Cars ride radiator springs, when the wait time showed 90 minutes. It actually ended up being 2 hours and 20 minutes because they had some type of malfunction and stopped the ride completely. We had been in line for 1 hour and 15 minutes by then, so we decided to wait. Very bad decision, it was a 2 and a half hours of PURE TORTURE listening to the most horrible CAT Screeching Banjo playing folk music or blue grass or whatever it is. Combined with the long line, and the bratty kids screaming and jumping every second like monkeys, this music was punishment of the highest caliber for an amusement park ride line. Couldn;t they at least play some country or even Christmas music like they did in the rest of the park?\n\nThen after over 1 hour at the Mickey Ferris wheel they tried to rush everybody through so we didn't even get our own gondola. The only ride I had been looking forward to, and we got stuck with an Asian Dad and his kids who wouldn't stop yapping for a minute, and keep asking us to take pictures of them. I didn't pay $123 for the Cal Adventure ticket, to play photographer for the asian tourists.\n\nWe will never, ever, ever, visit this park again, or bring any of our guests that visit annually from Europe, Australia, and Eastern USA. We will go to other places, like Disneyland, because every penny spent here was a waste and bad experience from 9 am to 9 Pm\n\nWorst amusement park I have ever experienced and that is no Joke!!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Had a great time, easy to manuever, can see most everything in a day, next to Downtown Disney and Disneyland", "Had a lot of fun for our first time to Disneyland. We are DISNEY WORLD passholders so we thought we would be disappointed by the size of the parks but we were actually pleasantly surprised and enjoyed both. Even though some rides have the same names as FLORIDA rides, most are completely different which was cool!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun visit! Lots of rides and refurbishment.", "Lots of rides were being refurbished, and the crowds were unfortunately still big, even in January. We still had a blast! Can’t wait to see the new Incredibles roller coaster!\nThe set up for and organization of the crowds for the night show were less than stellar. We were very excited to get tickets first thing in the morning so we could have a better shot at seeing the show this time. Unfortunately “world of color“ was still difficult to see with people shoved in here and there. The fact that it is a standing show means that adults stand up in front of small children. There really must be a better way!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Loads of Fun for Everyone", "An amazing park. Loved the world of colour show. Meet and greets with Groot, Sully, Loki, and more was awesome. Its smaller than Disneyland but we always start out with this park on our visits and then hit up Disneyland when we have a full day to get more out of it.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Not impressed", "If we had known that the coaster, the ferris wheel and several other rides and areas were closed we wouldn't have wasted one of our day passes going here! Seriously, there should be signs or notices outside the park or when you buy tickets of what is closed. I understand a day closure but these are under full overhaul.\nDon't think we'll buy tickets for here again .\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Love California Adventure even with all the ride closures", "It was the first time I came to Disney with a boyfriend. It was amazing going to California Adventure. Loved all the rides and the ride updates like Soaring over the world, Radar Springs racers and Guardians of the Galaxy.\n\nMargaritas on the pier were amazing!\n\nThe clam chowder in the bowl was great too!\n\nI wish California Screamin was working and Grizzly River Run was also closed too.\n\nFrozen lemonade is a must! I didn't get my favorite chocolate frozen banana but maybe next time.\n\nThanks Disney! I always have a great time!!!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Undergoing construction but still a lot of fun", "Most areas are under construction in preparation of Pixar’s 25th anniversary. But there still are a lot of fun activities to do at this park."], ["Reviewed 4 weeks ago", 5.0, "Not an average theme park", "Although there are plenty of rides and attractions this does not feel like a normal theme park.\nDisney and others may spend a lot of time and money on gardens in their other parks but they still feel like gardens.\nThis feels and looks more natural and rugged.\nThere are good restaurants as well as snack foods and the boardwalk area separates beautifully from the mountain area which does have the feel of a mini national park such as John Muir or Yosemite\nThe night time firework show was very good and I would say has the edge on the one at epcot.\nThe staff also seemed more helpful to people with disabilities which was slightly lacking in the 2 days spent at magic kingdom .\nOnly my second visit but {I am looking forward to the next.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great place", "Straight across from Disney land a little more suited to the teen age traveller but still plenty of things to do for people of all ages plenty of attractions food variety very good plenty of room to get away from the crowds fantastic night light show\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun in California Adventures!", "Visited with our six grandkids. Park not crowded first thing in the morning, but quite packed by noon on Veteran’s weekend in November. The park had just been decorated for Christmas so was quite festive! Lines for rides filled in quickly as the day went on, so it is imperative to get an early start. Restaurants were also crowded. Although the park was crowded, recommend visiting during the holiday season! These pictures were from a trip earlier in the year.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Loved it but Disneyland is the original, go for both", "The frozen show alone is worth it. But I also enjoyed rides like guardian of the galaxy - it is a drop ride with a good story and video, and the little mermaid - the animatronics were amazing for that one. A bit smaller than Disneyland but I loved it still.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A must see if going to disneyland", "There are some AWESOME rides here. I highly reccommend California Screamin, me and my family did it 3 times a day everyday for 5 days! There is lots to do there the whole family. Also reccommend the Up! adventure."], ["Reviewed 4 weeks ago", 2.0, "Disappointed", "Similar to review for Disneyland. Excessive number of people let into park meant HUGE queues for food & rides (the Radiator Springs Racer ride had a regular 2-3 hour wait the two days we were in Anaheim). If we hadn’t had the one hour early opening opportunity from staying in hotel we would have been lucky to get more than 4 rides in a whole day.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Lots of fun", "This park took my partner and I approx 4 hours to complete before heading across the way to Disneyland. Lots of fun!"], ["Reviewed 4 weeks ago", 4.0, "Fun", "Any visit to Los Angeles is not complete without a trip to Disneyland and Disney California Adventure. This year was no different.\nGot a two day park hopper and spent some time in each park. Tried out the new Guardians of the Galaxy ride, which I enjoyed better than its predecessor.\nHighly recommend a visit to anyone in town.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "My Happy Place", "This is my happy place. It never gets old. It's one of those things I look forward to everytime I travel to California."], ["Reviewed 4 weeks ago", 5.0, "A Taste of Hollywood Romanticism", "Everything you could imagine about the \"good old days\" of California are right in this park. Walking down Buena Vista Street transports you to decades long ago and, coupled with the Red Car Trolley Newsboys, it feels as if you're in the middle of a Disney film. I'm in love with this place.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "California Adventure Park", "Waste of money for seniors or people with disabilities. You pay the same as everyone but do nothing. I was there to watch everyone else."], ["Reviewed 4 weeks ago", 5.0, "Fantastic fun for all", "California Adventure Park is not just for the young - but also the young at heart! You don't have to enjoy the scary rides - there is plenty to do for those that just want to wander. This side of Disneyland is more about the older teens - with the rollercoaster 'Screamin'. The ferris wheel has two options - a stationery car or a swinging car - so all ages can go on. Definitely get a fastpass if you want to make the most of the rides.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Crowded but it's Disney - This is the Normal", "The great thing about CA Adventure is that they do serve adult beverages. Our family LOVES Disneyland and as the kids get older and want to be more independent this is the park we let them be a little more free. It is also a more grown up atmosphere from Disneyland. There is more for a family with kids and teens to enjoy together.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Great fun", "DCA is a wonderful change of pace from Disneyland. Still plenty of people, but it feels more spacious and comfortable to move around. Love the old Hollywood theming of much of it, and there is something there for all age groups. The Frozen stage show in the Hyperion Theater was amazing. I expected it to be a short show, but was rewarded with an hour of first class entertainment. Loved it so much we went back for the next show. There is much to enjoy here, and a great way to spend at least a day.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Fantastic day out", "Great rides , you can cover this park in a day , easy\nIt's winter so less people Get the fast pass it's a bargain\nAs we stayed at the Disney hotel we got into the park 1 hour early so we did some rides 3 times in a row with out getting off\nFood , it's ok for lunch , there is a definite effort to get some healthy item on menus, but not enough\nThe light show at nigh was amazing , make sure you get fast pass first thing as you enter the park to get a good spot\nMy only is taking video of the show be banned , we arrived got a good spot then two people just in front held there smart phone above there heads the whole show blocking our view , if this is your plan DONT it's available on you tube , far better than you can capture\nOver all fantastic\n\nShow less"], ["Reviewed 5 weeks ago", 5.0, "We loved it", "We enjoyed all the rides, the food, the drinks, everything. We liked it more than Disneyland. Soaring, the Carthay circle restaurant, the drinks of the festival of holidays, goophy, Cars (although the line was LONG), the raft. Need 2 days to enjoy everything"], ["Reviewed January 23, 2018", 5.0, "Wonderful", "We had a wonderful experience. I wanted to write this review because there were a couple staff members that stood out. One was Lexi on the Jungle Tour (boat ride) in Disneyland . She had the whole boat laughing so hard. She really made that ride so much fun. The other was Helmer in California Adventure. He was working in the food area by Ghiradelli. He had a smile on his face and was not only just cleaning, but picking up trays and clearing tables from guests. It's these small things these wonderful employees do that sets Disneyland apart from other amusement parks and this is why we will always come back. Thank you!\nShow less"], ["Reviewed January 23, 2018", 5.0, "Awesome place!", "We all loved California Adventure park. The cars ride was amazing- we did it several times day and night! The Colour the World light show was superb. We are at the Mexican takeout which was great value for dollar."], ["Reviewed January 22, 2018", 5.0, "Disneyland - The Best Holiday ever!!", "My husband and I (both over 60), daughter (38) and granddaughter (11). We each had a five day pass, access to early entry one day, and availability to get 'fast passes'. Spend the $ to get these upgrades.\nWe went on EVERY ride there was available - the ones we loved, 5 or 6 times - Indiana Jones, roller coaster mountain ride, etc.\nWe walked to the park every day, had breakfast at downtown Disney or Dennys, McDonalds and walked all day. My fitbit did overtime. 36000 steps was nothing.\nBought Christmas Disney ears and wore every day. We would have a good breakfast and then just water and an ice-cream for lunch and then go for dinner each night.\nThe park was busy. School had just gone back that week in California, but with the passes we had it didn't matter. The early morning got us on 3 rides that normally have up to 65 minute wait.\nThe fast pass, once you get the hang of it is incredible.\nEverybody needs to go to DISNEYLAND. We went on everything!!\nShow less"], ["Reviewed January 22, 2018", 3.0, "Many attractions closed!", "Well I have a few mixed feelings about this review. The park is under renovation so at least 4 rides were closed, mainly at the back of the pier. (Roller Coster, Wheel of Fortune, water attractions etc). For that reason the park was not full, but the price remained the same witch it seems not to be fair. So check witch attractions are open for the next few months.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Fun +", "Plenty of options for all the family-young and old. Numerous options for food of all types and suiting all budgets."], ["Reviewed January 22, 2018", 5.0, "Never failing to give happiness! (But I lost my Guardians of the Galaxy cap!)", "For two consecutive years I visited this park. The last time was last December 2017. What I can say is that it is always amazing! Walking can be fun because of the many highlights and festivities the park presents. The festival of international dishes made a new color and attraction.\n\nJust be careful wearing a hat or it might fly away while you're having fun in the Guardians of the Galaxy ride attraction. Sure enough my newly bought guardians of the Galaxy cap flew away from my head as the 'elevator' threw us up and down in our seats. The instant photo shot captured me still wearing it. We notified the staff, they searched for a while but nothing found. They suggested to make a formal notification at the park's gate. So we did. If found they will just send by mail. Up to now nothing arrived. Too sad.\n\nOverall it was a fun experience in DisneyCalifornia, as always!\nShow less"], ["Reviewed January 22, 2018", 4.0, "Lots of fun", "Nice theme park. Spent the day with the kids and grand kids. Not quite the standard of Disneyland which it is immediately adjacent to but a great day out nevertheless."], ["Reviewed January 22, 2018", 5.0, "More amazing than ever!", "The magic in these parks is indescribable. There were several closures but it didn't take away from our overall experience. We are actually super excited to go back and see the refurbished and re-done attractions. They've done great with those things thus far! (Guardians of the Galaxy is better than Tower of Terror, Matterhorn bobsled updates are awesome, etc) We will be going back to see Star Wars land and Pixar Pier!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Love the rides", "We loved Disneyland California adventure ,carsland is just out of this world so glad we spent a few days here it is a must for all families"], ["Reviewed January 22, 2018", 5.0, "A little trip down memory lane...", "Do not miss the Carthay Circle lounge. The best place at DCA to get a drink, an appetizer and relax before heading back to the park. It’s beautiful inside, dimly lit, service is impeccable, prices right in line with any upscale watering hole- so for Disneyland it’s cheap! We were surprised it was not a lot more! Go! You’ll love it.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Happiest place on earth !!", "This was a spur of the moment trip for us. We were still on Christmas vacation so we decided to head to Disneyland. Magical is the only word to describe Disneyland. My favorite was the Pirate's of the Caribbean. I love all the people and costumes and characters. Makes me feel like a kid again. We took the shuttle from the Motel 6 which was awesome as well. Not much of a line and we ended up by making friends with another family from the hotel. The kids went swimming the next morning together. Great place and beautiful people everywhere !!\nShow less"], ["Reviewed January 22, 2018", 3.0, "For the kids", "We went in December for the 3rd time in 2017 with our Grandkids. (7,5,3) as we got a great Veteran's 3 visit deal from the Military. Each time of course it was packed. Parking took forever, food is over priced, lines are long, and walking around is miserable with wall to wall people, but the kids always had fun. My main complaint is the Cars ride which is one of the best in this park is very unorganized when it come to the line. There is supposed to be a regular line and a line for fast pass/return time and all 3 times we have been to the park it has been a huge mess figuring out which line is which. You don't get a lot of help from the employees running the ride - they need to know how to make sure everyone knows which line is which. After all it's supposed to be a happy place.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Fun Time", "The more \"modern\" side of the Disneyland complex (not necessarily the better side) has lots of fun attractions such as Midway Mania, Soaring, and Guardians of the Galaxy...not counting the themed area of Cars. In January 2018, the company started a modernization/remodel of ~40% of the park for Pixar, which should be a nice upgrade to the existing park...they seem to be slowly removing the 'California' part out of the park, which in my view, is a good thing.\n\nCurrently, the Frozen show in the Hyperion Theater is not to be missed...just on the special effects alone.\nShow less"], ["Reviewed January 22, 2018", 1.0, "Dissapointed....felt like I paid $97 to enter a mall", "Wow...I have been to several Disney parks, Disney World, MGM, Epcot, Tokyo Disney, and Disney World.......But California Adventure was a huge disappointment. Best roller coaster was closed....and there was not a lot that interested me., Many more stores than attractions.......I have no desire to ever go here again.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Celebrating birthdays at Disney", "January is a great month to visit. The lines are shorter & the weather cooler. You also may encounter attraction closures as this is the time they refurbish & change areas.\n\nWe used the lockers for extra stuff and that is a great thing to use. You can use cash or credit cards to pay.\n\nThe live show is worth waiting in line. They have a Starbucks on the Main Street of the park.\n\nFast pass stations for the most popular rides are looking fated throughout the park. This park is all about California & highlights the state.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Fun!", "This is a great time to visit. Low crowds and wait times. Be careful though. There were no parades and some attractions are closed due to the time of year and changes that are coming. Can’t wait for Pixar Pier. The park is clean and the staff is always helpful and kind.\nShow less"], ["Reviewed January 21, 2018", 3.0, "Different", "This park caters more towards younger age groups however there are some fantastic and fun adult/family rides. A very colourful park with lots to see and do. Food a bit healthier and easier to access."], ["Reviewed January 21, 2018", 5.0, "Fun day at Disneyland", "Great place to visit with children both young and old. There were rides for everyone. Loved the ride, 'soaring around the world' and 'guardians of the galaxy'. Both these rides had long wait, the best is to get quick passes."], ["Reviewed January 21, 2018", 5.0, "Amazing place", "Celebrated my special needs Aunts 60th Birthday at the park. It was an amazing time. We enjoyed the park from the morning until closing. The World,of colours show was spectacular. I think my aunts favourite part was the Royale Welcome with Elsa and Anna, and watching the live performance. The cast members are amazing. My aunt was spoiled by all of them. It was the birthday of a lifetime. She will never forget it.\nShow less"], ["Reviewed January 21, 2018", 5.0, "So much fun!!!", "California Adventure is a bit smaller then Disneyland but has more for the adcults, i.e. good alcohol and scarier rides, without ever losing the Disney fun. It also reminds you of Southern California past which as a SoCal girl I love!!"], ["Reviewed January 21, 2018", 5.0, "Lots of fun!", "Looking forward to seeing the new Pixar Pier. As a frequent visitor, I really missed this part of the park on this trip."], ["Reviewed January 21, 2018", 3.0, "More like a shopping mall with rides", "Probably a decent park when all the rides work. Its going through MAJOR renovations until summer 2018 so don't pay more for it. Its really a side show compared to Disneyland as it jus doesnt have the same vibe. Mostly shops with a few good rides. OK on the 2-day park hopper pass if you must, but you'll soon be back at the other park.\nShow less"], ["Reviewed January 21, 2018", 5.0, "disney what else can you say", "excellent. great attention to details. characters roaming the park and fast pass available to maximize your time. love it."], ["Reviewed January 21, 2018", 3.0, "Frozen show first class", "check before going many good rides shut down in January, we were surprised it was still so busy thought it was slow time"], ["Reviewed January 21, 2018", 5.0, "Well worth a visit - don’t miss the Color light and water show", "Good to be able to visit in addition to Disneyland - don’t miss the evening show on Color with the water feature - very impressive. Loved the Guardians of the Galaxy tower ride and Pluto’s Adventure was an exciting roller coaster ride"], ["Reviewed January 21, 2018", 5.0, "FIRST VISIT EVER and NOT THE LAST.", "Arrived at the park entrance and was literally BLOWN away by the feel and love for Disney. Got our tickets and off we went. It was our HONEYMOON TRIP. First ride was Guardian of the Galaxy. Next ride was CARS.......OMG!!! The experience on both rides were absolutely more than AWESOME. WILL BE BACK.........ASAP. THANK YOU, DISNEY!!!!!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great first trip!", "We had a park hopper and so were back and forth between parks easily as it was just my husband and I. This side has more thrill rides than Disneyland I would say and the MaxPass made this side so much better, especially for the photos. It was really hot when we were there and Grizzly Falls went down a few times, trying to get into Soarin Over the World proved challenging (we managed once in three days), but we managed most of the big rise at least once a day and the lines were practically nonexistent. The fastpasses go quickly on this side and often run out early afternoon for some rides. We decided to do Radiator Springs as single rider to maximize our other passes. The single rider line goes quickly and my husband and I wound up racing each other, which was fun! Hubby also liked this side because we could have a margarita, which helped with the heat! We also did the World of color dessert party the first day we were there. Our feet were sore by the end of day one, so we really appreciated having a seat to watch the Show! Plus, if you don't finish all your eats, you can take them with you. Two adult beverages per adult and a cup that syncs to the music for the kids. Great time overall! Highly recommend this...looking forward to seeing what they come up with for the new pier.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Guardians of the Galaxy and Frozen show", "I remember when this was Tower of Terror and it’s still Good! Fast passed it so was great to just walk straight in 2 hours later. We had a 2 day park hopper ticket well worthwhile. A lot less crowded than Disneyland. We saw the Frozen show probably one of the best shows I’ve been to and we got to a lot of shows. Musicals are our thing and the singing with the acting ( Olaf is a hoot) and then add in the special effects and kaboom awesome. Fantastic. We also went to the animation academy and cos we all like to try drawing that was really fun. Off the the page store is different and has an artist drawing there and is very interesting. Shopping of course.What can I say?\nShow less"], ["Reviewed January 21, 2018", 2.0, "Not my fav", "Being a long time Disney fan this park is disappointing. I and my children felt we much rather be at Disney. Not a huge amount of rides, most of it was down and just not the Disney magic you expect. I would skip it and just go across the way to Disney\nShow less"], ["Reviewed January 20, 2018", 3.0, "Should be halfprice", "Recently we visited California Adventure only to find out much if the park is closed due to renovations. If you have small kids then it's fine since Bugs Land & Cars Land are open but California Screaming is closed & you cannot walk around the entire boardwalk. The Park was really crowded the day we were there. We got a fast pass for the Toy Story Mania but when it was our time the ride was closed. Very frustrating! We did ride Radiator Springs but we rode single since it was a 2 hour wait if we rode together. We saw the Frozen Show in the Hyperion Theater. It was really good. We also saw The World of Color. That show is amazing & a must see. We were dancing & singing the whole time. It was a nice day so we ate outside at Boudin. The clam chowder was excellent. We also had a delicious churro & coffee at Starbucks. Starbucks is a nice place to decompress & enjoy some much needed caffeine.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Like a kid again", "So many cool rides and things to do this place makes you feel like a kid again. I love theme parks and all the action and excitement that is packed into them. So much dreaming and imagination goes into every little aspect of this park"], ["Reviewed January 20, 2018", 5.0, "Fun park!", "On the other side of the ticket concourse from Disneyland this park has some big and exciting rides. These include the roller coaster, the tower of terror(now a Guardian of the Galaxy) and the Ferris wheel with swinging cabs. It is\nSomewhat like Disney’s Hollywood Studios in Orlando. There are winery’s and bars. It is more adult oriented, but still lots of kid rides. Lots of dining options.\nShow less"], ["Reviewed January 19, 2018", 5.0, "More Disney Wonderfulness", "California Adventure is just an extension of the main Disneyland park, with different worlds, but all of the same excellent features.\n\nThe rides were great. California Screamin' and the Cars coaster being my favourites.\n\nMy friend and I had the multi-park pass, which was definitely the right thing to do, as you could go back and forth. If you stay at a Disney hotel, you also get the extra \"Magic Hour\" in the morning, where you can enter the parks before the masses arrive.\n\nOverall, just like the main park, things operated really smoothly, and the place was well-maintained.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Yes this is why you come to LA", "Fun ride, parade, music, dancing, turkey leg, whats not to love. Oh yeah the line up, starts from the line up to park, then line up to search your belongings, line up to get into the front gate, line up for the rides. You spend pretty much 50% of your time lining up for things here. Please please get the fast pass, it is absolutely not worth lining up 2 hours for a 2 minute ride. if you get the fast pass the line up is probably less than 10 minutes, but I am not exactly sure how to get the fast pass. Believe you have to go to the ride and scan your pass and they will tell you to come back at a specific time. Other than the line up, the ride was fun and thrilling at the same time. The parade was a xmas parade for us and it was cool to watch. The turkey leg was a beast and it was tasty coming from a guy who doesn't like turkey that much.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Fantastic, fantasy, fun and a lively hoot!", "Fantastic, fantasy, and often just a great deal of action packed fun.playing second fiddle to the Magic Kingdom it just has to try harder. The Food and Wine festival is always terrific and the evening water and light show is great, just not as good as Fantasmic. Cars and Carsland is always a top notch attraction, nearly worth the price of admission to California Adventure. Soarin is always great, just remember to get a fast pass. Cars, just get into the single rider line as it moves very fast. The cafe near Soarin has good hamburgers and ribs, by Disney prices it is fairly affordable. Grizzly Rapids is best on a hot day.\n\nOverall a fun park. Not enough to do on its own. Best with a park hopper.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Great day great rides", "A day here is a must make sure you stay for the light water show, I actually thought it was better than fireworks"], ["Reviewed January 17, 2018", 5.0, "Loved the rides!", "We went to California Adventure Park first thing (around 9am on a Wednesday) which was really good because the park wasn’t too crowded.\nWe wanted to go on the main rides - mostly Guardians of the Galaxy, California Screamin’, Radiator Springs Racers, and Grizzly River Run. We went on all of these before lunch time, and even went on some twice because there were no lines.\nWe got a fast pass to the Guardians ride, which was worth it cause we went on a lot of other rides while we were waiting.\nTip 1: if you don’t mind going on a ride alone, go down the singles line to the Radiator Springs Racers. The wait was next to nothing and the ride is well worth going on.\nTip 2: try and wear a plastic poncho or jacket when going on the Grizzly River Run as you will get wet.\nHighlight: Guardians of the galaxy - it was well worth the wait.\nLowlight: some rides were down but it wasn’t that much of an impact.\nI definitely would visit again as the rides and atmosphere were well worth it. There’s also lots of stuff for kids to do as well and it’s very well designed for a fun day out.\nMake sure you walk around the whole park during the day, then again at night because you will see some awesome light displays that you do not catch during the day. It’s like a whole different park at night!\nWe got the 2-day hopper pass which was a perfect amount of time for both parks for us :)\nShow less"], ["Reviewed January 17, 2018", 2.0, "Off season = big part of the park is closed", "California Adventure was the least attractive park of the three (Disneyland and LEGOLAND were the other two) we visited during our vacation in California. We were me and my wife and just under three year old boy. In January a lot of the main rides are closed down due to offseason. For grown ups the only attractive ride was Guardians of the Galaxy. For the small boy there were 3 rides that were his taste mainly in Cars land. We were very disappointed that the playground was closed (trekking trail) not to mention a lot of the big rides for us grown ups. In Disneyland and California Adventure the crowds are just killing the experience. LEGOLAND at this time was empty and a lot of rides our boy loved. Maybe with teenagers it is much more worth it although I doubt it. Bad organization from Disney side as they need even with the fast pass system you have to spend most of the time waiting even on a weekday in mid January. Do not recommend spending time and money on this - you can get much more fun for the buck elsewhere.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Carsland, Guardiand of the Galaxy and Wonderful World of Color is a Must", "I was very surprised how many good attractions are here! The beer and food are excelent. And you can walk more easily than Disneyland. And after the refurbishment at the Pier, is going to be awesome"], ["Reviewed January 17, 2018", 5.0, "Great Park For All Ages", "Disney’s California Adventure Park is great for all ages with fantastic rides for all. At night the Mickey Wheel come to life with a spectacular water and light show and would highly recommend you seeing the show."], ["Reviewed January 16, 2018", 1.0, "Got whiplash and half the rides were closed. Don’t go in January and DON’T go on Goofy’s Sky School.", "Half the rides were closed (in terms of the good rides, two-thirds were closed!), with so much closed they should literally be discounted tickets. It was so pathetic. It also meant that the few rides that were open had hideously lines, even for Disney. Clearly they close a lot down after Christmas, I would not recommend going in January at all. However when you’re from Australia and only get certain time off work it’s not really in you’re hands when you can choose to go.\n\nDO NOT GO ON ‘GOOFYS SKY SCHOOL’ ROLLERCOASTER. THIS RIDE GAVE ME WHIPLASH AND BACK SPASMS. This ride is unsafe and awful. It’s zero fun, jerks you around and has all these horrible sudden stops that almost, or actually, give you whiplash. At the end of the ride we all said how horrible it was and then 30 minutes later my whole back and neck seized up and I was in agonising pain and couldn’t move. Had to leave Disney halfway through the day at 2.30. First aid weren’t very good and didn’t seem to be concerned at all at how severely dangerous one of the rides is. I’m a 27 year old fit and healthy female, this absolutely should not have happened.\n\nBefore that happened, because there was barely anything to do, went to order a beer and my boyfriend and I (who are both 27) got refused even through we had ID because they wanted our passports (we’re Australian) — as if I’m going to bring my passport to Disneyland!!!! This is not the law, or normal practice in California. Plus the girl was extremely rude about it.\n\nGuardians of the Galaxy is good though, not enough warning of how intense it is and that loose items NEED to be held onto (sunglasses, Mouse ears, and bags were flying around)\nShow less"], ["Reviewed January 16, 2018", 5.0, "So much fun", "This was my first time in this park. I have been to Disneyland plenty of times but this was my first time to California Adventure. I loved it! We knew going into our visit that a bunch of rides were going to be down – that is part of what happens when you go in January and its low season. While disappointing we knew that when we booked and we knew that would also mean the park would be less busy. We were right – the pier is currently under construction so be aware of that when planning. It’s going to be awesome when it’s done but right now it seems a little sad. But the rest of the park is awesome. I love the atmosphere. The rides are great. Its Disney I find you can’t be in the park and not be happy! Cars Land is probably my favorite part of the park. It’s like you are stepping into the movie.\nShow less"], ["Reviewed January 15, 2018", 2.0, "Half the park closed", "Came to Disneyland for a vacation. Spent $2000 dollars on tickets to Disneyland and California park,and im so disappointed that half the rides are closed.but they still charge you full price. I feel like ive been ripped off."], ["Reviewed January 15, 2018", 3.0, "A bit disappointed", "We came in the middle of January and we're excited as it was our first time, only to find out the rides were going to be closed a few days before. Being adults there was really only the Guardians of the Galaxy, and the cars ride that were some kind of exciting. I'm assuming because some of the other rides were closed that made the lines for the ones that were open even longer. In future I hope they have the future closures announced further in advance.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Great park, packed with attractions. Loved it!", "We have visited Disneyworld around 15 times so thought we would try the other coast. California Adventure delivered, just brilliant. Great theming, great rides and great fun especially on Xmas eve with the Big band. Paradise pier is just breathtaking, just loved it."], ["Reviewed January 15, 2018", 3.0, "Everyone Nice but half the park was shutdown", "We visited California Adventure park just at the end of Christmas from Canada. We booked our passes well ahead of time, there was no mention that half the park would be shut down due to renovation half way through our trip."], ["Reviewed January 14, 2018", 4.0, "Family and Friends", "Wow. Pack your walking shoes because this place is BIG and lines can be LONG. Otherwise, play it safe. Bring a backpack with snacks, water, pen, and papers. The rest of the stuff will be souvenirs like hats and shirts you will more than likely get for the memories. The fast pass is nice though not a necessity, but definitely nice if you are on a mission.\n\nThe best advice I can give is to plan a few days of fun so that you can take your time and enjoy the atmosphere.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Love California Adventure", "Spent 1 day at Disney land and 2nd day at California Adventure. I have a 6 year old son and 11 year old daughter. Both enjoyed CA. much more. Favorite ride was Soarin. Favorite food was the turkey leg."], ["Reviewed January 14, 2018", 4.0, "A bit above Disneyland park", "Make no mistake, I consider Disneyworld FAR superior to Disneyland or California Adventure Park, but this park was pretty good. A bit of a combinationMickey's Fun Wheel was kind of unique with the gondolas on an inner track so it sort of rolls back and forth add a bit extra to the ride. The California Screamin' roller coaster was one of the longest and smoothest coaster rides around. There was much more diversity of entertainment options in this park than in Disneyland Park per se and I found it superior. Plan on spending at least a full day there (if not two).\nShow less"], ["Reviewed January 14, 2018", 4.0, "Great rides for everyone", "Family of 9 visiting after 2 days in Disneyland.\n\nInitially we were all sadly disappointed that the big attractions were closed due to maintenance as it is their non peak season. The big roller coaster is closed, the Mickey wheel is closed and the river run as well. I know they need repair and maintenance but it is just not the same feel.\n\nWe all loved Cars Land!! Radiator springs was done so well. Every ride and store there was enjoyed by all of us.\n\nGuardians of the galaxy ride was the best there. Best to get a fast pass for this as the rides were very long.\n\nAlso great rides for the non thrill seekers. Ariel’s ride and the monsters inc ride were great!\n\nShow less"], ["Reviewed January 14, 2018", 5.0, "It took some time, but it is hitting its mark , on its own as a park", "The early years were a bore. But this park with re-theming has hit its mark finally. It has its own interest to visit, and not just because of its older brother (Disneyland).\nThe unique annual events, holiday theming, ect, really give you a reason to visit.\nThey are going to probably add more Marvel, re-theme the Pier to Pixar.\nMost of what made this park a bore in the early years, is gone. The more recent additions are most welcome for repeat visits. Cars land, Mission Breakout, Christmas and Halloween theming, Soaring over America, Screamin (a real rollercoaster), World of Color water display at night, ect. Several great places to eat like Smokejumpers café.\nYou have to visit.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Lots of chnages, but still a blast", "Had a great time, but construction everywhere. All of Paradise pier is changing to Pixar Pier...lots of walls up. Other areas getting refurbishment too. With Max Pass it is easy to do everything in the park in one day. Did some rides like Soar in, Racer, Gaurdians 2 times each in one day. (Thank you spell check for continually changing the names of the rides to be incaorrect) We didn't understand why anyone would use the standby if fastpasses were available. Max Pass was worth the few extra dollars to save time...were able to do 17 rides.\nShow less"], ["Reviewed January 13, 2018", 3.0, "Crowds and Wait Times = Not Fun", "This was our first visit to California Adventure Park. Expectations High as we had read about it and waited for the day. Well the day came and we entered the park. We had planned the rides and the fast passes earlier in the hotel room and for the most part this worked well. The rides were great if you did not have to wait more than 45mins, but with the app I got, most rides by midday it was anywhere from 45mins to 2hrs wait time. Management of the park need to relaise that the place is overcrowded and not alot of free space as people always jostling and pushing to get by. Food seriously overpriced and the lines to get the food were impossible. I understand that this is a business overall, but it does somewhat dampen the day when the crowds are\ntoo much, food is expensive, wait times are ridiculous. It will be a long time before Iventure to California Adventure Park again. Sorry Management you need to look at how to operate a park better in the future.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Great way to spend the day!!", "As Annual Pass holder, I like to start out at the Adventure Park before going to Disneyland because it adds the extra umph in my step, and this is why...\n\nThere is a nostalgic Hollywood feel upon entering...the upbeat swing dancing music that plays in the background, and the trolley filled with newspaper boys singing, then dancing in the streets make it oh-so-lively, and fun. Hollywoodland is a palm tree lined street which leads to my daughters favorite ride, Monsters Inc, and down the road to the Hyperion theater which features the dazzling live Frozen production.\n\nThis is a great place to take those memorable photos on front of Mickey's Fun Wheel where I also enjoy eating at the the Lucky Fortune! I get their Thai Coconut Curry bowl on a bed of white rice...then I make a quick stop to Ghirardelli, where they hand out a free piece of chocolate...or, when I am feeling REALLY bad, I opt for their Nob Hill Chill...a Chocolicious shake that makes me super happy! Sweet toothers, take a look at their menu, its all amazing to me.\n\nThe adorable Little Mermaid ride is here, and during the hot Spring/Summer days, we hang out at A Bug's Land, where the kids can get wet in the water play area...they love it. Don't forget the extra clothes, and shoes!! The kids are required to wear shoes/sandals in the water area, so pack accordingly...sometimes this is the highlight of her whole day!\n\nThere is so much here that I have yet to explore...I recommend going to the simulated gliders in Soaring, to take your breath away - and The Bugs Life 3D show...to to widen your grins! It may be scary for the wee ones, but for the young and old, its a whole lotta fun!!\nShow less"], ["Reviewed January 13, 2018", 4.0, "If only it didn't cost so much", "Really enjoyed the Coco inspired Dia de Los Muertos display and mariachis playing. Park needs more rides and better ride placement. The few rides at the park are grouped close together so they are very crowded. Miss Alfredo's large bumper tires which have been replaced by dancing cars. Bummed about the change of the Twilight of Terror. Ride is basically the same but the new Guardians theme doesn't do it justice.\nShow less"], ["Reviewed January 12, 2018", 5.0, "the rides here are awesome", "Must do in any day are the Cars Ride, Soaring and especially the Guardians of the Galaxy - a really fund day out"], ["Reviewed January 12, 2018", 5.0, "Love It", "We took our grand kids and parents to the Disney Resort for my granddaughter's 3rd birthday. As a long time Calif resident I love the old California feel of this park. Places I grew up with are here including a pier, a beach type little town, desert car races, etc. I like that it is not quite as crowded as Disneyland and is laid back. It has many good food places. We all had a wonderful time. We felt the same way at the Disney World Hollywood Studios. So reminiscent of times gone by. Make sure you plan well and get your fast pass tickets throughout the day.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Fun place", "Great place to spend a day. Everything is in good shape and service is good and friendly. Sun just loved the Radiator Springs."], ["Reviewed January 11, 2018", 5.0, "So fun!!!!", "Absolutely loved DCA. Rode California Screamin' over and over per my children's requests! We enjoyed the Dessert Party World of Color (review on that attraction). My husband liked that he could get a beer at this park and I liked that I could get a glass of Kim Crawford Marlborough Sauv Blanc. Nicely done, DCA. Every tour operator was friendly and engaging. We went during peak season (Jan 4-6) and did not wait longer than 20- mins in any line thanks to Maxpass. Would recommend getting Maxpass! Loved the Mickey wheel (spinning cart) quite a spin on a Ferris wheel. Had lunch at Paradise Pier, the Mexican restaurant there is good value and tasty food. Fully felt the Disney magic!!! Would go back in a blink.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Loved it!", "I could go on and on about how great DCA is but that's a given. Don't miss Turtle Talk with Crush, it's pretty hilarious, Animation Studios or Beast's Library in Hollywood Studios, they're hidden gems."], ["Reviewed January 11, 2018", 5.0, "Loud, Kinetic and Wonderful", "I love California Adventure. It's a frenzy of color, light and sound, happy hordes and great adventures with lots of fun and surprises"], ["Reviewed January 11, 2018", 5.0, "Come for the Festival!", "I was going to go here on a Monday. When I checked the park I noticed that their Sip and Savor Festival was ending the Sunday before! I quickly changed my schedule and started my vacation on Sunday! I LOVE their festivals! So much good food and drinks! Very satisfying and a great deal if you're an Annual Pass holder!\nShow less"], ["Reviewed January 11, 2018", 5.0, "Love California Adventure", "Love this place just as much as Disneyland itself. They have some great rides and we also try to hit this place in the off-season, it's much more enjoyable."], ["Reviewed January 11, 2018", 5.0, "Extra Magic", "California Adventure is truly its own kind of magic. When you walk from Disneyland to CA you dive in to a whole new world! There are so many things to do here. The rides are fantastic! Toy Story Mania and Soarin' are our favorite rides. Its a must!!\nShow less"], ["Reviewed January 11, 2018", 5.0, "AWESOME!!", "Guardians Breakout. What a blast! Toy Story Mania lots of fun. All of the rides were great. Hollywood town was a bust. Not too many places open except the Monsters Inc. ride which was fun. Food was outstanding."], ["Reviewed January 11, 2018", 5.0, "Amazing time, the kids had so much fun", "We had an awesome time, there is something there for kids of all ages (all the way up senior citizen kids!)"], ["Reviewed January 11, 2018", 5.0, "Fabulous", "My daughter and granddaughters favorite park! They loved the roller coaster and went on it several times. Also the Guardians of the Galaxy was a hit! Went on it (all of us) 7 times!!!"], ["Reviewed January 10, 2018", 5.0, "Two days with Grandson", "We spent two days at both parks with our 5 year old grandson on a trip from our home in Arizona. The weather was great and the crowds were small. We enjoyed the Christmas atmosphere."], ["Reviewed January 10, 2018", 5.0, "Loved Cars Land and the water show at night!", "There were things about this park I enjoy more than Disneyland! Cars Land is delightful! Love Soaring ride! Really loved the night water and lights show!"], ["Reviewed January 10, 2018", 4.0, "Some fun rides but not Disneyland", "We all enjoyed the time spent here and there are some good rides, but it is not as good as Disneyland. 5 hours here and we were done with everything we wanted to do."], ["Reviewed January 9, 2018", 5.0, "Great time at California Adventure Park", "Fun, great time with young kids. Love the California Sreaming ride :) Enjoyed the tacos in the main food market area."], ["Reviewed January 8, 2018", 5.0, "So much fun!", "I visited with my 12 year old daughter and we had a blast. We were there during a heat wave - it was 100 degrees when we visited, but it was still great. We went on California Screamin' 5 times in a row! I bought the fast pass option for $10 each - it was definitely worth it for us. We were able to do rides like Guardians of the Galaxy and Soarin' a few times each as well as any other ride we wanted to do. The parks were busy too - it was Labor Day weekend.\nShow less"], ["Reviewed January 8, 2018", 4.0, "It’s a lot of fun but they pack you in!", "Don’t even think about not going on guardians of the galaxy. Absolutely go on soaring around the world. If you enjoy getting completely soaked and go on the bear run. Ariel’s ride is a lot of fun and it’s a great way to sit down and rest. Looking forward to all the changes. Sad about the carousel though, it’s beautiful.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Fabulous Adventure Park", "Such fun exploring this park with the family. In need of a little TLC we felt as some rides etc looking a little tired."], ["Reviewed January 8, 2018", 5.0, "SO much FUN! Goodbye Paradise Pier", "Super fun festivities for the holidays. We had so much food. The rides are fun!! We were there for 2 days park hoping. We wanted to see the park before the transition so it was super fun!"], ["Reviewed January 8, 2018", 4.0, "CA is cool!", "Especially enjoyed Cars but wish they would return with Soaring CA. What does the world have to do with CA Adventure. Biggest problem with CA Adventure is they need to get some good restaurants.Loved the look this year with the holiday lights."], ["Reviewed January 8, 2018", 2.0, "Too crowded and too expensive", "We came last year, one week later and it was awesome. This year we came on January 4th, a Thursday and we had a horrible time. They jacked up the ticket prices from $99 to $124 due to peak time. We had to wait 30 min just to buy tickets. They apparently can’t figure out they they shouldn’t be selling season passes at the regular ticket windows because they have to answer a ton of questions which slows down the line considerably. This was after waiting on another,one to have our bags searched.\n\nWhen we finally were able to enter the park, tickets in hand It was 10 am. I then immediately tried to get some fast passes for the Radiator Springs ride and guess what? They were for 9 pm !! How ridiculous that by 10 am they already sold out of all the daytime fast passes. So therefore, the stand by wait times for the popular rides was ranging from 1-2 hours. What might have help would have been if I purchased the max pass ( extra $10 per ticket) which allows you to access the fast pass tix on iPhone app, so I could have at least reserved the first tix before we left the hotel room. Still, they only let you use it once every two hours.\n\nWe have three young kids, paid several hundred dollars for park tickets and actually only got to go on about 5 rides the entire day. The park was so crowded it was actually difficult to push a double stroller around without constantly bumping into people. It was a joke. God forbid there was an earthquake or fire, people would get trampled.\n\nDisney is clearly very very greedy, charged a 25% premium for tickets that day, let in twice the number of people they should have, they doesn’t give people access to the rides due to capacity constraints .\n\nWe were super super disappointed. Shame on you Disney, we won’t be coming back soon and we will share our experience with all of our friends with kids. FYI we went to LEGO land yesterday and it was leagues more accessible and we had a much better time there.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Great Trip With the Grandkids", "We took our grandkids to Disneyland the first week of January 2018. We stayed at the Disneyland Hotel which was nice but if I had it to do over again I would pay the extra $$ and stay at the Grand Californian to avoid walking through Downtown Disney every day.\n\nLines were quite long but it is what it is. We enjoyed all the rides we went on and the kids had a great time. Spent some time at the hotel pool and the kids loved that too.\n\nAs this was our granddaughters first trip to the parks we tried to line up things that she would enjoy but her older brother enjoyed everything as well.\n\nWe did a character breakfast at Goofy's Diner the first morning and our granddaughter was very excited to see all the characters. The next morning we did the breakfast at Ariels Grotto and she was thrilled to see all the princesses. We had lunch at the Cathay Restaurant, which is a bit higher end and we appreciated the quiet, as part of the Frozen performance and it was great. Show was good and it was worth it to get in and seat ourselves before the throng rushed in.\n\nWe had dinner at the the Trattoria as part of a package to see World of Color which paid off as they have a special area marked out for the diners and the kids had a great view of the show.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Family visit always fun", "Holiday season. Very busy but the staff was great and the rides fun\nThe new Defenders of the Galaxy was a long line but a fast pass made it worth it.\nSit in the middle of the Soaring ride if you can. No distortion on the video and very relaxing while exciting.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Better than Disneland for adults and teens", "If you no longer have very young children, if you want to avoid the baby stroller traffic jams and you actually want some gutsy rides, don't waste your time with Disneyland, go next door to California Adventure Park instead. If you have both young and older children, buy a flexible ticket that grants in/out/in /out entry to both on the same day. The Cars area is great, the Guardians of the Galaxy Ride is a cracker, and California Screamin is a very good roller coaster.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Well staffed for Holidays", "We were concerned about going the Friday of New Year's weekend but the park was well staffed and they handled the crowded park very well. Thank you!"], ["Reviewed January 6, 2018", 4.0, "Better than Disneyland park but no universal studios", "The guardians ride is awesome and I loved car town. Some things seem a little dated. But the roller coasters are epic, and so much of the designs were fun!"], ["Reviewed January 6, 2018", 4.0, "The Magic of Disneyland, but really crowded", "A different experience when your kids are young adults, but fun. The park was really crowded and Fastpass was useless."], ["Reviewed January 6, 2018", 5.0, "Very nice and wheelchair accessible on almost all rides.", "Super fun and tons of things to do. The cast members are always willing to help out with anything you may need."], ["Reviewed January 6, 2018", 5.0, "First visit to this park", "This was a fun extra day at Disney Land. Never been to this park and it has more of the bigger rides that teens like. Be sure to stay for the light show at the end of the evening."], ["Reviewed January 5, 2018", 5.0, "Had a great time", "We recently visited Disney California Adventure Park with our 14 year old son and 10 year old daughter. They loved the rides here, they are thrill seekers so the rides suited for the older children. We went in mid December, the crowds were big but most rides we only waited for 45 mins. To miss some of the lines we used the single rider line as we weren't concerned about riding together. The Fast Pass is worth it for the photo's they were good quality. Highly recommended the Light Show that occurs at night.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Our first visit", "This park has alot for every age group. Do yourself a favor and get the fast pass! Use it on the Radiator Springs Cars ride first! We waited 3 hours for a 3 minute ride! Great ride, not worth 3 hour wait. The Guardian of the Galaxy ride is Intense! My favorite rise is California Screaming coaster!\nShow less"], ["Reviewed January 4, 2018", 5.0, "Holiday", "Lots of rides and the magic of disneyland makes everyone feel like a kid again. So much to see and do. From modern rides to 50's style cafes and shows. You need at least 2 days to see it all."], ["Reviewed January 4, 2018", 3.0, "Worth visiting once", "This theme park is the right size. However, the number of rides is limited and always packed. The food variety is actually pretty good, but very very expensive. The characters are roaming around and are more approachable than at the sister park. This is an experience you have to do once for your kids, but be prepared for heavy spending. The marketing strategies used in this park are beyond perfection: out of a ride directly into the gift shop. Long queues for short duration rides. Personnel are very well trained and are very welcoming and warm to the guests.\nShow less"], ["Reviewed January 4, 2018", 5.0, "fun!", "using our early hour as a resort guest was well worth it. and the first hour park was open wasn't too crowded either. so, we got to do a lot of what we wanted with not very much wait."], ["Reviewed January 4, 2018", 5.0, "The best in the world", "My last trip to California Adventures, was awesome, place was great, my family and I enjoyed to the max. The hole experience was great."], ["Reviewed January 4, 2018", 5.0, "Fun and not overly crowded", "This is a great park... full of fun for every age. they are making some more changes to rides though and hopefully that will be a good thing!"]]}}