{"Dodger Stadium": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Dodger Stadium", "url": "/Attraction_Review-g32655-d615551-Reviews-Dodger_Stadium-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/29/8e/e7/los-angeles.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1716"}, "address": {"@type": "PostalAddress", "streetAddress": "1000 Elysian Park Avenue", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90012", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Best $20 ever spent", "Just got there in time for the 1 pm tour. ( I arrived 1.02 ) caught up with the lovely tour guide who took me on an amazing journey. This tour took me down to the dugout. I sat where all the players do on game day. We went up to the media centre where the reporters work their magic. Hall of fames, golden gloves, sluggers, the list just goes on. My tour was 90 minutes long . I always thought the music was recorded and they just pushed a button- no no no it’s real. There is an organist. Who knew. The souvenir shop is reasonably priced. I had a wonderful taxi driver waiting to pick me up so was quick shop ( just as well because there’s no room in my backpack)\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Take Me Out To The Ballgame", "Once known as Chavez Ravine, Dodger Stadium is just North of Downtown Los Angeles.in the Elysian Park neighborhood.\nThe ballpark is beautifully groomed and naturally during baseball season is very vibrant. The Stadium is easily accessible from all areas of Los Angeles County.\nI highly recommend taking in a game when in town.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Top of the desk", "Nice view ..front LA city West side..Hollywood sign Gift shop is clean, nice Staffs friendly You can stay with apples and coke. Cozy, enjoying."], ["Reviewed 3 weeks ago", 5.0, "Great stadium in Los Angeles", "The historic Dodger stadium is one of the gems of Los Angeles. Nestled in the Chavez Ravine in the downtown area is iconic. Dodgers have called it home for over 50 years. Easy in and out parking and plenty of good food to eat. If in town when Dodgers are playing is a must.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great ballpark, terrible dog", "Very fun stadium, there is only one way in and out but doesn't seem like it. My wife had a hurt leg so I paid about $20 for closer parking, that isn't bad at all. You enter the stadium from above and the field is below. Very fun atmosphere, great views, and you never know if you will see a celebrity.\nI always get the stadiums hot dog as that is key to a great afternoon at a ball park. The dodger dog wasn't great. It was just a foot long hot dog that you can get at any grocery store at $1 for a pack.\nStadium and atmosphere awesome, concessions terrible.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Big Baseball Fan", "I'm a big fan of the Yankees, so Dodger Stadium is where our nemisis lives. It's a really nice stadium, very big. And it sits ontop of a hill, so you can get a beautiful picture of the city at sunset if you wait.\nYou can take the tour, i didn't but i hear it's worth it.\nIt's the 3rd oldest stadium in the MLB, behind Fenway and Wrigley. That's hard to believe. I hope the Dodgers keep the stadium and upgrade it more, through the years.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Play ball !!!!", "Caught a dodger game . Beautiful weather for a game . Got seats in the lower level very comfy not a tight as other stadium I’ve been too didn’t feel like it was been smashed to the person next to me . Gift shop had everything . Took I nice walk to get to stadium from the rideshare drop off . They also have a ride share uber pick up spot which is great . Typical prices for ball park food . Grabbed a dodger dog, fries and a drink . Had little fun actives and giveaways too . Dodgers had just clinch the division the night before . Great ball park\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Birthday weekend at Dodger Stadium", "My two sons and I went to dodger Stadium for my birthday. The stadium is amazing. It has a variety of historical areas to see. The food is much better than most concession stand food. The dodger dogs are definitely worth it. It is a unique baseball experience and worth the travel.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Our Shrine to Baseball", "Dodger Stadium remains a time capsule, old but modern with a great site and view of downtown. New ownership has upgraded the entire facility."], ["Reviewed January 9, 2018", 5.0, "Stadium tour", "I did the stadium tour on Monday morning with Mark. The tour was very good value for money and shows you all the usually out of bounds areas. The guide was an encyclopedia of knowledge and was able to answer any questions I had. Thanks Mark!\nShow less"], ["Reviewed January 3, 2018", 4.0, "First time at the baseball.", "Get there early so you can experience everything from the national anthem to the crowds coming in. Take a hat and sunscreen as it get hot and don't forget to try a Dodger Dog. We took an Über from our accommodation and found it easy to get in and out of stadium.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Our USA honeymoon", "8.30 am Just landed in LA after a 14 hr flight, 7pm it was game time and what a way to start our holiday! You didn't disappoint guys we had a ball at the baseball! Dodgers lost but still a memorable night. Australia isn't big in baseball but what you guys have is unreal. Wish we could of caught more games while we were over there but time was lacking.\nWe will never forget the night and the awesome atmosphere your baseball has. Highly recommended to anyone that wants to experience a true slice of the USA\nShow less"], ["Reviewed December 21, 2017", 1.0, "A Biased Review but wouldn't you be biased after this experience.", "My middle boy loves baseball so Dodger stadium sounds like a great experience but this is a big stadium. We went with the boy scouts and I kid you not, nosebleed doesn't even begin to do these seats justice. Why you would not give youngsters coming as a group good seats to foster interest is beyond me.\n\nThe players looked like specks on the grass. The audio is insipid so the highlight of the game for the scouts was an overpriced Dodge Hotdog and chatting with their friends.\n\nIf you have good seats then you will have a completely different experience. It's California and the games can go long so wear your sunscreen If you were going to go this would have been the season to do it. Very exciting times for the Dodgers.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Such a Beautiful Ball Park", "Luckily, I went to several game in this beautiful, clean ball park this summer and fall. The Dodgers had a great season, going all the way to the World Series. I was at the 2nd game of the NLCS play-offs against the Chicago Cubs when Justin Turner ht his 3 run walk-off home run. What a thrill! 10/15/17\nShow less"], ["Reviewed December 21, 2017", 5.0, "One of Baseball's Most Beautiful Stadiums.", "Dodger Stadium is one of the last older stadiums left in baseball. I have heard many baseball players say it's their favorite stadium in which to play baseball. It's still beautiful, with its iconic view of palm trees past left field. There are many entrances so if you know the ropes, you can avoid traffic snarls on the way in, but everybody suffers on the way out. It takes forever, so go to the restroom before you get back in your car. There are many different levels of experiences, both seating and food wise at different ticket prices, but from the most to the least expensive, it's all pretty good and delicious. I just think they should be ashamed of their parking fees.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Stadium tour", "Unfortunately we weren't at the right time to see a game but the tour was great! We booked our tickets on line. We were scheduled for the 11:30 tour but got there early and we're able to join the earlier tour. Free parking was a bonus.\nShow less"], ["Reviewed December 14, 2017", 5.0, "what a great experience!", "We really appreciated the beauty of the place, and how organized and safe it felt.\nthe game was at 4pm so we saw the stadium in daylight and night time, and had a beautiful sunset to watch on top of the game.\nJust plan a lot of time to reach their parkings, traffic is really bad when there is a game!\nShow less"], ["Reviewed November 29, 2017", 4.0, "We loved watching a game at Dodger Stadium.", "We are baseball fans and always try to make a game whereever we go. We really enjoyed Dodger Stadium."], ["Reviewed November 28, 2017", 5.0, "My favorite of all the ball parks i viisted", "I have visited all but one of the current MLB stadiums and aside from Citi Field (personal bias) Doger Stadium is my absolute stadium. Beautiful location and a sense of history while you enjoy a great ball game."], ["Reviewed November 23, 2017", 4.0, "Fun and lively atmosphere, even if you're not a baseball fan!", "Watched a Dodgers game on our honeymoon from the UK. I've never watched baseball in my life but had the best time. Tickets were cheap and we booked the same day and views were still good. Great atmosphere. Worth visiting."], ["Reviewed November 21, 2017", 5.0, "LA trip", "We took a tour of the Dodger Stadium to kill some time till our flight time. It was more than I was expecting. Full of history and stories you will not want to pass this up for the cheap price of $20. Totally worth it. Highly recommended.\nShow less"], ["Reviewed November 19, 2017", 4.0, "had a good time at dodger stadium", "I went to watch the world baseball classic. If you are going go with time in advanced as it its not easy to get there and there will be a lot of traffic. There is free street parking available by the police academy. The stadium itself its nice but a bit old, not much for choice of food in the stadium itself.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Drive up to parking P section", "A excellent view from the top of the stadium to the field and the surroundings. Great service in the fanshop and caps in all custom sizes."], ["Reviewed November 14, 2017", 5.0, "Classic ball field with traditional character.", "Classic ball field with traditional character. It just feels like a baseball field. So many of the new stadiums are caught up in tourist hype. Not Dodger Stadium. Sure they have cleaned it up and put lipstick on it. But it’s an outdoor ball field with great views of the field. What used to be the cheap seats in center field are still fun. They used to give the seats away with the purchase of potato chips. No more. Just as everywhere these days nothing is cheap at Dodger Stadium.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great atmosphere!", "We came as a corporate group (they even welcomed our group on the electronic scoreboard) and had a blast. I’m from Australia and not a baseball fan per se, but really got immersed in the game and atmosphere and had a rollicking time. I even bought merchandise - an LA Dodgers t-shirt and couldn’t resist a famous Dodgers dog. Celebrities go - we saw Andy Garcia in the audience.\n\nA Dodgers game is a great way to spend 3 hours of your time in LA (the games are long!) and an experience you won’t forget. Traffic gets busy so give yourself plenty of time. Uber drivers have a special drop off/pick up points and is a good travel option (we got there with no major delays).\n\nMiami Marlins v Los Angeles Dodgers - May 18 2017\nShow less"], ["Reviewed November 9, 2017", 4.0, "FUN! FUN! FUN!", "Love going to the Dodger games and rooting them on while enjoying a Dodger dog smothered with mustard and relish, eating peanuts from the shell, and maybe ice cream or nachos. GREAT TIME ( unless the Dodgers lose)."], ["Reviewed November 9, 2017", 5.0, "Great place to watch a game", "Historic ballpark that's been remodeled for comfort. Great food options, including King's Hawaiian (yum!) I have also take a tour here in the past, and it's very worth it. You get a full behind the scenes view of the park."], ["Reviewed November 4, 2017", 4.0, "Historical Stadium", "As you probably already know this is the home of the Dodgers baseball team and the most recent Game 7 of the World Series. It's not the nicest stadium, but like many classic stadiums that represent a city, those from LA and baseball enthusiasts can overlook that and are happy to be watching whatever team they support play.\nDodger Stadium is unique in that the only stadium in the whole National League with a symmetrical outfield.\nShow less"], ["Reviewed November 1, 2017", 5.0, "World series game 1", "Dodger stadium is a beautiful ballpark, I have been going there for almost 50 years, I have seen a lot of great games and great moments, Rick Monday grabbing the American flag from 2 idiots that were trying to light it on fire in center field. I have seen over 10 stadiums and nothing compares to the setting of Dodger stadium in the mountains,\nShow less"], ["Reviewed October 30, 2017", 5.0, "Very well maintained", "This is a great stadium that is very clean and well maintained. It's he's to believe it's the third oldest stadium in the MLB. Everyone we came in contact with from the tour guide to the Dodger dog vendor were great. Speaking of Dodger dogs... you're not truly experiencing a Dodger game without one. If you like baseball you'll like Dodger Stadium.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Visit during playoffs", "Came to see a playoff game during a visit to L.A and we got lucky to find tickets since it was sold out! I have been to other baseball games but this was an experience! The atmosphere and vibe here are incredible true fans for real! Plenty to do in the stadium itself, you must try a dodgers dog it was delicious! Overall awesome visit!\nShow less"], ["Reviewed October 28, 2017", 4.0, "NL Pennant Series", "We attended two games and saw the Cubs play Dodgers during the 2017 playoffs. Stadium was very clean and lots of security. The personnel working were nice to visiting fans. Food was average, however, the Park has an overwhelming garlic smell wafting throughout. There was only one stand that had white wine for sale on the upper level. That was inconvenient to have to walk up two levels of stairs to get a drink. Parking was confusing and not well marked.\nShow less"], ["Reviewed October 25, 2017", 2.0, "Picturesque, but a nightmare experience.", "The stadium, itself, is an attractive place to watch a major league baseball game. Getting in, around, and out of it are a nightmare. It is located near downtown, so you have commute traffic to deal with for weeknight games. The parking lots are large but difficult to get to. The stadium concourses are woefully inadequate for the number of people that attend Dodger games. After the game, trying to escape is horrible. Escalators and elevators are few in number. Even stairwells are not numerous. Getting out of the parking lots takes an hour or more.I can see why attendees leave after the 7th inning.\nShow less"], ["Reviewed October 25, 2017", 5.0, "World Series!", "I had the best anniversary gift from my wife to attend Game 1 against the ‘stros! The stadium is not only a great venue for baseball but a significant piece of sports history. Parking is the only negative but isn’t impossible if you plan accordingly. And the Dodger Dog is the best!\nShow less"], ["Reviewed October 25, 2017", 5.0, "Old Time Feel", "Dodger Stadium feels like it is straight out of the midwest as opposed to being the stadium for the Los Angeles Dodgers and that is a good thing."], ["Reviewed October 24, 2017", 4.0, "A modern classic", "Now more than 55 years old, the place has gotten to be a bid dowdy. It has also become a legitimate temple to baseball, a place that's more old than new. Just remember that you'll have to fight traffic coming and going."], ["Reviewed October 24, 2017", 4.0, "Great Venue only one rude employee", "Stunning historic stadium, get there early as the parking is pretty tough. We were there for a Cubs Vs Dodgers playoff game and hadn't prepared for the 25-30 minute grueling last mile that took close to an hour. With 10,000+ cars all entering through a few gates and stopping to pay the $35. its understandable. I would advise going early parking a distance from the stadium or taking public transportation if there is any! We were wearing our Cubs Jerseys and didn't get a hard time from any of the other fans, just a little friendly ribbing. The food was good, except the garlic frys which had raw ground garlic, it was almost inedible, and I guess we expected the garlic to be cooked. The only person we ran into that was pretty rude was a parking lot traffic person who tried to point us in the opposite direction of our car when asked directions. We could tell he was lying and being sketchy, obviously our Cubs shirts didn't help! Overall I would gladly go see another game there and loved the view from our seats.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Wow! Wow! Wow!", "This was our first time at a ball game and what a place to start!! Being from AUstralia we don't have the baseball experience at home so this was a must do for us.\n\nWe were staying in hollywood so caught the metro to union and then the dodger express to the stadium for the game.\n\nWe entered the stadium at the top of the park. To say the view from the top of the stadium is great would be an understatement - it was amazing!\n\nWe had purchased our tickets through stubhub and got front or a section so that no one was sitting in front of us. Our seats were amazing.\n\nOverall a great experience for our family (kids 11 and 14) - right down to the 7th innings strength and a sing a long - take me out to the ball game....loved it\nShow less"], ["Reviewed October 15, 2017", 4.0, "First baseball experience", "We have fallen in love with baseball, it was such a great evening and the fans are so passionate, it's great to watch.\nWe had walked to the stadium from Wilshire which took about 50 minutes and as it was a very warm evening (and the stadium is atop a giant hill) we were tired by the time we arrived. Watching the sunset on the hill is incredible - it has the best views of Downtown.\nWe found our seats only to find someone else in them as people must sit wherever they like for the quieter games. They left a huge pile of nutshells and empty cups for us, it was very slobby.\nThe game went on for over 3 hours and started to get a little repetitive but we enjoyed it nonetheless. Do not order the nachos - they handed my partner a packet of chips and some jalapenos for almost $10. That does not mean nachos.\nWhen leaving the stadium we took the free express bus back to Union Station and walked to our apartment from there. While I wouldn't recommend doing this on your own, it was much better than sitting in traffic like those that had driven. We were out of the stadium and at Union within 30 minutes!\nShow less"], ["Reviewed October 11, 2017", 4.0, "Take me out to the ball game!", "This is such a fun stadium! The park is very clean & seats are great no matter where in the park you are! The pizza was delicious but don't waste your time on the garlic fries! ;) Getting out of the parking lot after the game was a little bit of a nightmare so paying the extra for preferred parking might be a good idea!\nShow less"], ["Reviewed October 10, 2017", 3.0, "Love the Stadium, hate the before and after", "I've been going to Dodger Stadium since the late 1960s and have seen a lot of changes. The stadium has been renovated, concessions changed and the overall fan experience updated as the times have changed. What hasn't gotten better though is the parking and traffic. Do not drive if you can either take public transportation or get dropped off and walk in and out. My most recent experience was the final straw. First playoff game, which took over 40 minutes just to get to the gates with my parking pass, literally moving maybe 500 yards. Then our parking pass, which wasn't cheap was useless because our lot was full.. How can you sell passes and not have enough spaces to accommodate them, especially at the prices they charge? Missed the first inning and a half when we were literally 1/2 mile away 30 minutes before the game even started. Why do Dodger fans leave early all the time? To avoid a slog of an exodus that makes going to a midweek game for anyone who works or has school a painful experience by getting home way too late. Would go to so many more games if it was a better situation but ....\nShow less"], ["Reviewed October 9, 2017", 5.0, "Great ballpark! Have to see a game here!", "If you love baseball and want to get to all of the stadiums, this one is a must visit! Very clean ballpark, lots of great food, friendly staff to help you get where you need to go, fantastic parking, and awesome views of LA depending on where you are sitting. Great seats pretty much in every part of the ballpark, not a bad seat in the place! Overall, very enjoyable to watch a game here! Must attend if you have the chance!\nShow less"], ["Reviewed October 8, 2017", 4.0, "Nice Stadium", "As an Englishman & a fan of the game, I experienced my first 'Ball Game' at Dodger Stadium, the night they won their division against San Fran. The stadium was a nice stadium, the price on things were expensive & they need to change their stance on ripping their fans off, but was a good place to visit. The locals were friendly & nice. 8/10\nShow less"], ["Reviewed October 6, 2017", 3.0, "Good enterntainment, sub par concessions experience.", "Seats were great, and had a great view of the sun setting over the top deck.\n\nGood evenings entertainment for a couple of tourists, even if we couldn't last the whole game!\n\nDodger Stadium DOES NOT ACCEPT a UK driving license as a valid form of ID for alcoholic beverage purchase, so a 30+ couple had to share a Coke. We tend to leave our passports in the hotel safe when travelling, and this is the only time I've been refused service in the US. On the plus side we saved a fortune on beer! $$$\n\nFood was average at best. Dodger dog looked bigger in the pictures! Would have gone down better with a nice cold one!\nShow less"], ["Reviewed October 5, 2017", 5.0, "WOW", "Came to a fan appreciation day last week, this was my first baseball game and it didn't disappoint. Friendly and helpful staff, clean facilities and easy to get to."], ["Reviewed October 3, 2017", 2.0, "A Dump", "Stadium is pretty dirty, or at least it feels that way. Crowd is unruly, unprofessional, and unfriendly. The fans are 70% gang members, and their actions support this. DO NOT SIT IN THE OUTFIELD"], ["Reviewed October 2, 2017", 5.0, "Bucket list - check it off", "First time to Dodger Stadium, been a fan for 60 years. And as luck would have it, Clayton Kershaw was pitching, was a great warm bright sunny day and Dodgers won 3-1. Had a dodger dog. Great seats."], ["Reviewed October 2, 2017", 3.0, "Dodger Fan Forever", "As a life-long Dodger fan, I took my wife and I to a Dodger game at Chavez Ravine last summer. The stadium is an outstanding venue to watch a baseball game, the concessions offer a great variety of food and beverages as well, but it was mind-numbing trying to exit the parking lot after the game was over. It took us two hours to get out of the parking lot and onto a surface street that would lead us to the freeway after the game. What an ordeal! We drove to the game from Temecula, and it was midnight when we got home that night. As a true-blue, died-in-the-wool Dodger fan, I will always love my Dodgers, but it will be a long time before I attend another home game at Chavez Ravine.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Dodger stadium is amazing!", "First time there, we went as a group. Work paid for everything, food, baseball caps, shirts and $20 bucks for spending as well!"], ["Reviewed October 2, 2017", 5.0, "Professional guides - good value", "Uber from Hollywood area to Stadium costs approx $12 and takes 25 mins. Tour guide was James who had an encyclopaedic knowledge of all things Dodger related. The tour lasted 2 hours and included sponsor boxes, press box, trophy room, pitch side and dug outs. Entrance via \"top of the park\" which incidentally gives great views over downtown LA and the Hollywood sign. On site photographer charges $20 for 2no 6*4 prints which is a bit salty. You are free to take your own and you can use the same locations. You are allowed 10% off goods at the club shop after the tour. Overall great value for the $20 fee.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Dodger dude trip", "One of the coolest MLB stadium experiences! It's easy to find your way around while seeing pieces of history."], ["Reviewed September 26, 2017", 4.0, "Dodger Stadium - A baseball cathedral", "I've been going to Dodger stadium since it opened in 1962. It is one of last of the mega stadiums built in the 60's and 70's. Thus, seating is 50k+ and the parking lot is huge and located as a stand-alone venue.\n\nIt is known as the cathedral of baseball stadiums based on the condition of the park, the layout and totally symmetry the way the diamond is built.\n\nRegardless of where you sit you can enjoy the game.\n\nThe biggest criticism by those who are not die-hard Dodger fans or baseball fans is the stadium is old and outdated. Therein, lays the magic of \"The Ravine.\"\n\nWhat is does lack are the ammenities many of the newer stadiums have. The concessions are barely acceptable and I attribute that due to the design of the venue. Staff is always courteous but they are slow or it takes a long time to get your refreshments.\n\nAll that being said, it is a once in a lifetime treat to see a game at Dodger Stadium. You are allowed to bring your food, water and even soft drink as long as it is in a plastic unopened bottle.\n\nFor parking, it is best to order online via the Dodgers website as you receive a nice savings. As for public transportation, unlike many of the new stadiums which are built alongside public rail, the best you will find is a Dodger Shuttle. It runs all of the time and you simply get it from Union Station (about 2 miles east). There is no charge to ride the shuttle. If you drive your car to Union Station and wish to take the shuttle to avoid the lines or charge, you can park at Union Station for $8 and simply walk to the Shuttle zone to be wisked to the stadium.\n\nFor those who truly enjoy exercising there is street parking but its a nice hike to the stadium which is not unbearable, as long as you have planned properly.\n\nThe key to going to Dodger stadium is to properly prepare for your visit. It is what it is, but for those who appreciate tradition you will love the vibe.\n\nOne more tip. If you are a first timer to the stadium BE SURE TO STOP by one of the guest service booths (at all levels) and pick up your personalized certificate signed by Magic Johnson.\nShow less"], ["Reviewed September 24, 2017", 3.0, "Disappointed", "Our 15th MLB park to visit. Having never been here, I checked out parking lots in relation to where I wanted to sit. Got my tickets and parking pass and away we went. No problem getting to the parking lot or parking in the preferred lot on the first base side. We were a little early to the park and were told that since we had field level tickets that we had to go to the right field gate. HALFWAY around the stinking park! When we finally got to our seats, we asked a concierge in the area about getting out when the game was over. He was very nice and told how to get to our parking lot not far from our seating section. Up escalators and elevators 5 floors instead of walking back up that insane hill where the park is built. Really need to train the employees better. Also had no Dodger Hall of Fame or Exhibit area. Only a small area in the hallway with no air conditioning and it was stifling hot there. Not one of my favorite parks for sure. Better than Rodgers Centre in Toronto, but far behind Fenway or Houston or St Louis. At least there were cup holders on the seats in front of us. Thank goodness for the savior concierge!\nShow less"], ["Reviewed September 23, 2017", 4.0, "A good baseball park", "This is a very good baseball stadium even though it is over 50 years old. Unfortunately many beautiful acres of park land were given up in order to construct this stadium."], ["Reviewed September 23, 2017", 4.0, "Dodger vs Rockies", "First time at the Dodger Stadium in LA. Went to see the Dogers vs Rockies game on a Friday night. The atmosphere was fantastic, full stadium with home team shown solid support. There are a lot of food and drinks stands as well as souvenirs to check out at the stadium. Recommend to arrive a bit early and leave early otherwise end up wasting a lot of time parking. Also missed out on Bobblehead giveaways as were a bit late to the game\nShow less"], ["Reviewed September 20, 2017", 4.0, "Great older baseball park", "We attended a game at Dodger Stadium on September 9th and had a great time inspire of the Dodgers coming up one run short of a win. We had seats in the Loge level, right field area. The stadium is well maintained and has good viewing angles. Speaking of views. The views of the mountains beyond the outfield is very good, but the views from the upper deck of Los Angeles is well worth the climb or wait for an elevator. The nachos and Dodgers dogs were as good as any other ballpark fare. If you have time while in LA, take in a game at this great stadium.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Game on", "What an awesome afternoon/night at Dodger Stadium we had . Billy Ray sang the national anthem ... while we stood in line outside waiting to get in , the wait time is quite long but once ur in it's a fantastic atmosphere, there's many bars and food places , we had good seats we could see everything. There's lots of restrooms and merchandise stands .\nShow less"], ["Reviewed September 13, 2017", 3.0, "Nice Park--Too Expensive", "Love baseball and this is a nice field but neighborhood not nice. Parking, food and beverages are wayyy too expensive. I'll watch at home for better view."], ["Reviewed September 10, 2017", 3.0, "A confusing stadium", "This was my first Dodgers game. The drive to the stadium was very slow, but that's LA. Parking attendants directed everyone to the parking so that went smoothly. Once inside my section was 140 so I went to the sign that said 139-141. I soon realized that there was no 140 there, it was 139 AND 141. I had to walk to the other side of the stadium for 138-140...\n\nThere were lots of food and beer stands. Also lots of merch shops. Beer was $15 a glass, I couldn't believe how much it was!\n\nVisibility from the Loge section was great. The Dodgers lost but it was still an enjoyable time.\n\nDeparting was confusing. There were no signs that clearly marked the exit to the parking sections. I went up and down stairs before finally making my way out to the wrong parking section. I was in section 1 so you would think it would be easy to find. Nope. I passed section M, N, O and then it changed to A, B, C! Finally I found 1. There is no logical sequence to the parking sections. For crying out loud stick with only letters or only numbers and order them sequentially. I know this is an old stadium so it wasn't built intuitively or efficiently. Hopefully they get a new stadium soon.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Must See Stadium", "I travel around the county quite a bit. I've been to about 20 baseball stadiums. I've been to this one (3) times. I would go again in a heart beat. This is a must see. It's historic and beautiful."], ["Reviewed September 7, 2017", 4.0, "Iconic baseball stadium", "This is an iconic major league baseball stadium that should be on the list of every baseball fan. Home to the Dodgers and their amazing list of great players, this is truly one of the best places to see a baseball game. Food is good too. Take public transportation if you can; lots of parking is available also but you may have to walk a bit and the stadium is close to downtown but is a little confusing on how to get there.\nShow less"], ["Reviewed September 7, 2017", 5.0, "The Dodgers!", "I've been to many ball parks and this one is very well run and California Friendly. Food selection-something for everyone. I go as often as I can."], ["Reviewed September 6, 2017", 5.0, "One of the Best", "Dodger Stadium is one of the oldest baseball stadiums in the country...but it is one of the best for viewing a game. Food is everywhere and not bad for a ballpark. Parking is plentiful but remember where you parked; could be a problem."], ["Reviewed September 6, 2017", 5.0, "Ball park", "Not my team but a must to go and see. Everyone need to see a ball game while in the USA. Very big stadium very good views from every seat"], ["Reviewed September 5, 2017", 4.0, "Great Spectacle .... Shame about the result", "Take in a baseball game at a great stadium and you'll get a crash course in American Culture.\n\nAs the third oldest MLB Stadium it's well worth the visit. To a Brit the Dodger's Stadium being built in 1962 doesn't feel old. Especially when I am older than the Stadium\n\nThe feel of the place still hasn't let go of the link back to Brooklyn Though the fans are not slow to let the players know their short comings\n\nMy top tip ... Take the free Stadium Bus from Union Station\nShow less"], ["Reviewed September 1, 2017", 4.0, "first time for a baseball match, and the dodgers won :-)", "It was the first time to see a baseball match for us, luckely we got seats next to a incarnated baseball fan, and she was very generous to share knowledge with these two rookie Danish. the stadium it self where very nice, though it was very pricy in respect to drinks and food. but after all go and see a match.\nShow less"], ["Reviewed September 1, 2017", 5.0, "Amazing stadium", "As baseball fans we just had to go to Dodger Stadium. We were lucky they had a home series against the White Sox during the few days we were in LA. The stadium is modern, capacity of 56.000 (biggest in the U.S.), has a lot of food and drink stands and shops.\nWe also had the luck of watching the Dodgers turn a 2-4 score in the bottom of the ninth, into a 5-4 victory (half the stadium was empty by the time it happened, so let that be a reminder that the game is not over until the last out).\nShow less"], ["Reviewed August 31, 2017", 5.0, "Bring Your Mit!", "Go early and sit along third base line; Pop flies galore! Even if you usually don't eat hot dogs, you have to have a Dodger Dog!"], ["Reviewed August 30, 2017", 3.0, "Friday fireworks", "Get tickets for a Friday game when they have fireworks. Their fireworks display is better than most July 4th celebrations. They also allow you to go on the field to view the fireworks.\nIf you plan to Uber, be prepared to wait upwards of an hour for your Uber pickup. The Uber pickup is in lot 11. You are corralled in a holding area with hundreds of other people waiting for their Uber or Lift. Cell service is spotty, so some dirvers have trouble getting in contact with the passengers. Positive side is they have a massive cell phone charging station in the uber waiting area.\nShow less"], ["Reviewed August 30, 2017", 5.0, "First Trip to Dodger Stadium-Epic!", "Loved Dodger Stadium. First trip and it was terrific. Built in 1962, but has wide concourses and escalators-ahead of it's time. Had a Dodger Dog-it was OK, not the greatest dog, but eating it in Dodger Stadium was perfect. Beer is pricey as you would expect as is parking, $50 for preferred-yikes! We have great seats first base line at field level. The team lost, but it was a great way to spend a beautiful afternoon in LA. If you love baseball you have to make a trip to Dodger Stadium!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Beautiful Ballpark, parking at Dodger Stadium can be challenging. Parking at Dodger Stadium. Views", "And, by the way, great baseball! I've been a Dodger fan most of my life. While teams come and go, the stadium is always a great place to visit! Stadium itself is easy to navigate and concessions are good. Some amazing seating exists, and some average seating of course.\n\nShow less"], ["Reviewed August 28, 2017", 5.0, "First game and it was amazing", "The first time we had been to a baseball game but felt we needed to see it as we really wanted to experience the real America and we weren't disappointed. Form the moment we arrived the place was electric with everyone being so friendly. We had great seats and soon got into the whole thing, we possibly looked like tourists as we were the only people at the stadium not wearing a dodgers shirt!!!\nIf your in LA rake the opportunity and go to a game it was excellent would certainly go back again\nShow less"], ["Reviewed August 27, 2017", 4.0, "Friday night Dodgers game!!", "Was lucky enough to make a dodgers game this year. I must say out of all the stadiums I have been to this is one of the best laid out barns. You do not feel packed in and it doesn't look like there is a bad seat in the place. Also washrooms everywhere!! Food and beer is way over priced, $6.50 USD for a dodgers dog and $12 USD for a bottle can of Budweiser . Overall a great experience 4/5\nShow less"], ["Reviewed August 27, 2017", 4.0, "Surprisingly comfortable", "As Rockies fans, we were a little worried about visiting Dodger Stadium. It was hard to get to, impossible to walk to, but once we were there it had a pleasant touch of Hollywood with palm trees and a mist closing in making you feel like you were on a set. It was a little raucous, I had nacho cheese thrown on me from the seats at the level above, but a nice stranger in front of me offered to help me clean it off. Overall it was like LA--diverse, passionate, star-studded and yet totally accessible and welcoming in a very urban sort of way. While it's hard to get to, the Uber zone home worked pretty well once we figured it out.\nShow less"], ["Reviewed August 27, 2017", 3.0, "Big Disappointment!", "As a baseball fan, I always wanted to catch a game here. There's \"classic\" and then there's just plain \"old\". This place is in need of a serious update. Traffic flow to game is brutal as well. I can cross this off my list now."], ["Reviewed August 27, 2017", 5.0, "Dodger vs Brewers", "If you visit LA and can catch a night game it is an absolute MUST SEE. The stadium is fantastic, a modern coliseum, the fans are passionate and well natured. The whole infrastructure is extremely well coordinated. Buy a hotdog and a drink and enjoy a great night.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Great American Pass Time", "We were able to but attend a home game where the home team lost. It was pleasant evening non the less. The Dodger Dogs were tasty and evening pleasant. The stadium has some nice history displays. Baseball is one of favorite activities and this stadium is reasonably priced.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Amazing!", "A fantastic experience to go through with friends or family. Even if the lines got too big or the traffic too chaotic to reach the stadium, the overall feelings about watching a baseball game there were very positive. The crowd is super friendly, the structure is really good and the stadium staff really knows how to cheer a crowd. The prices are really expensive, though, so you might prepare for that.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Mid century feel", "This was one of our stops on our 5 stadium trip down California coast. It is the oldest park west of the Mississippi and has a mid-century space age type decor. As a Seattle native it is similar to the Worlds Fair decor at Seattle center.\nThere is a proud tradition associated to this park and rabid fans bleed Dodger blue. They have a couple of unique food options (Hawaiian hot dog) was my choice.\nThe park sits in a bowl strategically facing a canyon. The seats are comfortable and park laid out well. It was built before the shift to all seats facing home plate but good views from all areas.\nIt is one of my favorite parks as it is unique. It is a must visit for any baseball fan.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Another great experience.", "We’ve been to Dodger stadium before and this year was no exception. I make it a point to see at least one game while I’m home in the summer. What set this apart from other trips is the Dodgers are simply awesome and almost unbeatable at home. One comes to this beautiful park expecting a wonderful and magical visit but this year we come expecting to win. The park is just wonderful and still as beautiful as ever and they sure did win. Go Blue!\nShow less"], ["Reviewed August 23, 2017", 5.0, "excellent atmosphere - great fun", "Definitely worth a visit, food is can be quite expensive in the stadium. The atmosphere is incredible"], ["Reviewed August 23, 2017", 5.0, "Go Dodgers!", "It's always fun to attend a game, especially when the Dodgers Win! I love going on Friday nights when after the game there's a great fireworks show synced to a particular theme. They had Star Wars and when we were there it was a hippies throw-back with The Doors, Jimi Hendrix and The Rolling Stones. Always a fun night at Dodger Stadium\nShow less"], ["Reviewed August 22, 2017", 1.0, "One game a year!!", "We only go to one game a year! We have such a blast having all the junk food..lol Dodger Dog, peanuts, cotton candy etc etc If you are just a vistor from another place and never been to an Major League baseball game.. go go you will have fun...\nShow less"], ["Reviewed August 21, 2017", 3.0, "Great view, but old ballpark", "When you are in the seats at Dodger Stadium, the view is tremendous. The view overlooking the mountains and Hollywood Hills in the early evening is outstanding. The food is overpriced as it is in all ballparks, but nothing outrageous. The one thing to note is getting from the Top Deck of the park to the lower levels can require some effort. First the exterior parking lots and entrances are scaled all over. There is an elevator to move about, but the escalators leave you 2 levels short of the top deck and lower bowl area meaning there's a lot of stairs to climb.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Classic", "Is there a better MLB stadium out there? I doubt it. Went to five games at Dodger Stadium from August 11th to 16th and as usual I loved every minute of it. Great people, games, food and beer."], ["Reviewed August 19, 2017", 4.0, "Let's Go Dodgers!!", "Always a great ambience in the stadium. What a great end of season playoffs game. Went excited to see them win and play well. Very crowded but courteous people coming from very different ethnicities and all cheering the dodgers."], ["Reviewed August 19, 2017", 5.0, "first baseball game!", "the staff and the security guards were so nice and polite and they made us feel welcome! the food was so good and trying a Dodger Dog must happen if you are to watch a game at the Dodger Stadium! everything was set up nicely and comfortably. overall, the atmosphere was great and highly enjoyable!\nShow less"], ["Reviewed August 18, 2017", 5.0, "Incredible experience - get to a game when you can", "We're big sports fans and regulars at English Premier League games - so baseball was something different to give a try.\nWe're glad we did - the Dodgers are flying this season and the whole experience (apart from the traffic - get there early) at Dodger Stadium was impressive.\nThis is a great family night (or day) out with plenty of entertainment on and off the pitch and good food, too.\nThe excitement of baseball is something we've fallen in love with - we'll definitely be back for more.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Old ballpark!", "We had great seats looking down the third baseline behind home plate. We purchased our tickets at the ticket window as the game against the Padres was not a sell out even though they were giving away back packs to children coming to the game. We took the Metro to Union Station in hopes of taking the Dodger Express busses to the park but we were 50 minutes early and the busses hadn't started running yet so we took Uber to the park. There are loads of food choices at the park including Tommy LaSorda's Trattoria behind center field as well as a BBQ restaurant just beyond that. You can find hamburgers, Dodger dogs, garlic fries, ice cream, peanuts and much more. Prices are high so be prepared. Parking fees range from 10$ to 50$. There is a taxi stand near Gate G and Uber/Lyft is located in Lot 11 and was very confusing/crowded after the game, took 20 minutes for a car. Ride shares need to come up with a better system.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Great games, great evening sky view and weather! Enjoy!", "Outstanding historic stadium with great weather and scenery! Come early to make the drive in and parking a lot easier plus watch some batting practice. Promotions and bobbleheads make it even better. Getting out after the game can be frustrating so leave early or late to ease that pain.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Best MLB Stadium there is", "The home of my favorite Baseball team, the Los Angeles Dodgers. Easy to get in and out of, lots of parking. Get a foot long Dodger Dog, some peanuts and a cold drink, sit back and enjoy one of America's favorite pastimes!!"], ["Reviewed August 16, 2017", 3.0, "Baseball is worth the inconveniences", "Not for people with ambulatory issues. Parking lot in a mish-mash of sections with elevation changes in some areas. This is an old ball park lacking the conveniences and organized layouts of more modern stadiums."], ["Reviewed August 14, 2017", 3.0, "1st Time Dodgers Game :/", "Excited to go the Dodgers vs. SD Padres for the first time :). Very disappointed that the PL level - Left Field did not have a Megatron for us to see up close. Even though the Dodgers lost, the crowd and the enthusiasms with Friday night home game fireworks were fantastic!!!\nShow less"], ["Reviewed August 13, 2017", 4.0, "Great Stadium and Baseball Game", "To really experience the USA we decided that we needed to take in a baseball game. The Dodgers against the the San Diego Padres was an exciting game even though the home team lost. The stadium is very comfortable with countless places to buy food and drink. Really recommended.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Full Count!", "First game back at the stadium in 30 years. We drove down from NorCal and saw the Giants almost win on a Friday fireworks night. Same Dodgers...always seem to win the game. A very pleasant experience. We were in the upper deck on the left. Very good sight lines for the entire game. They let fans onto the field after the game to see the fireworks in left field. We just sat in our seats. The crowd was family friendly. Purchase tickets online as well as your parking pass. We were first confused as to where we were sitting, but uniformed attendants helped us nicely. Parking was organized and exiting after the game was flawless. We stayed in Glendale and were back at our hotel in 30 minutes. Some negatives: We think the food fare needs to improve...more selections. I had a Dodger Dog and wolfed it down in seconds. It seemed smaller than years ago. And Dodger souvenirs and clothing will break your bank. For example, a Jackie Robinson T-Shirt is $72! I saw hardly any worthwhile hat pins and so didn't buy anything. Bummer. All-in-all, it was a good time. Go!\nShow less"], ["Reviewed August 13, 2017", 4.0, "Iconic venue for either baseball or music", "You cannot go wrong here. Plenty of good sightlines for either baseball or concert-viewing. Good acoustics for music. Plenty of parking if you arrive early. So much history, even though it only started in the fifties. Plenty more history in the near future, so: go, see, hear, cheer. Don't miss.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Great Fun", "Food is great, most seats are good. Drinks are expensive but they are also good. What's a game without a beer?"], ["Reviewed August 9, 2017", 4.0, "Nice ball park!!", "This is a very nice ball park!! Nice location, etc. The one problem is, I HATE baseball!! I have gone to some concerts here though..."], ["Reviewed August 8, 2017", 3.0, "Stairs + Parking = NO", "There are SO many stairs, it is overwhelming. The field itself is beautiful but the stairs and the terrible parking (which took me an hour to get out of last time) makes my experience worse. Also the vendors are mediocre."], ["Reviewed August 8, 2017", 5.0, "Hit it out of the park", "Going to a Dodgers game is a must. The whole family 8,10,15,18,20 and my wife and I loved it. This was a highlight of my trip. The atmosphere is electric. Service great. The food perfect. The game was awesome to watch. Entertainment plus."], ["Reviewed August 8, 2017", 5.0, "Baseball!!!", "Loved the ballpark!!! Amazing view!! The outfield is the mountains!! The ballpark has so much history! Super hard to get in and out of but worth it!!"], ["Reviewed August 8, 2017", 2.0, "Stadium is NOT impressive, but the fans are!", "Stadium is NOT impressive, but the fans are! Stadium is a concrete structure, nothing more. Is old and in need of renovation. I've been to 26 of the MLB ballparks and this one ranks at the bottom. Dirty and old, best description. Parking is ok, easy in and out. But the stadium reminds me of that concrete uninspired stadium called Qualcomm down in San Diego. Better bet for a true ballpark experience is with the Angels in Anaheim or the Padres in SD, now those are nice ballparks.\n\nNice thing here though is the fans, they are loud and rivaled only by the fans of the RedSox at Fenway. Good team spirit in all the chants and singalongs.\n\nSmoking areas available within the park. Food wasn't anything to be desired.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Come see 2017's best MLB Team. A record season, amazing weather", "If you are visiting Los Angeles, and want to experience what has been a Championship season, one for the record books come and catch a Dodger game this summer. The energy in the stadium has not been at this pitch since 1988"], ["Reviewed August 8, 2017", 5.0, "Classic west", "All is I can say is wow best concert experience I ever had the food was great reasonable price to expect employees were as helpful as could be for all those people very patient thank you"], ["Reviewed August 7, 2017", 3.0, "Baseball stadium tour", "My son and I are in the midst of seeing all the stadiums in MLB. Dodger Stadium was #26 out of the 30.\n\nThe good: It's the Dodgers and it's cool that it's the same place that Sandy Koufax pitched in the late 50's into the 60's and of course the 70's teams with Garvey and Lopes.\n\nThe bad: It's a 60 year old stadium with no mass transit, so it was like reliving a nightmare from my childhood as it was taking over an hour to exit the parking lot with 40,000+ in their respective cars merging into singular lanes in a massive traffic jam.\n\nThe stadium is OK, but it's not one of the cool, new ones recently built and it's no Fenway or Wrigley. I don't know what the answer is, but I guess they look at the rest of the country and say, \"hey, we live in LA and play in sunshine and 75 degrees all year, so take that\".\nShow less"], ["Reviewed August 6, 2017", 5.0, "Game day", "I love the Dodger stadium. The best food so far is at the king's Hawaiian restaurant. They drinks are good. This stadium had better drinks and the Angel's stadium has better food. I really enjoy the fans the best. They are loyal and energetic. They really know how to rally and show the team that they are behind them!\nShow less"], ["Reviewed August 5, 2017", 4.0, "A view of the diamond, a chance to buy merchandise, no lines & plenty of parking...", "If you'd love to buy some Dodger's merchandise, see the stadium and not have the hassles of crowded parking, long lines and ridiculously over priced tickets, you can visit the stadium & gift shop any day of the year except Thanks Giving & Christmas Day.\n\nAfter checking that it was an away game, and that no concert was on, we just rocked up to a close parking spot, popped in to the gift shop (they have everything from $2 stationery to $859 rugs!). You can see the diamond, buy some merchandise, and be out in half an hour!\nShow less"], ["Reviewed August 3, 2017", 5.0, "Great place to watch a ballgame!", "Saw the Twins play the Dodgers Wednesday night, 26 July 2017. Sat in the Top Deck (the highest part of the stadium). I love to sit in the upper deck, somewhere behind home plate. It's the best place to see all of the action, and I definitely did. Weather was perfect. A slight breeze blew through the stadium.\n\nIt's an older stadium, but it definitely has its charm. I liked the palm trees and the Union 76 sign behind the outfield, as I've seen so many times on TV. Great gift shop with quality (and expensive Dodgers souvenirs).\n\nConsider taking the Metro to the stadium. You will be sparing yourself much aggravation if you don't. The Metro goes to Union Station, then patrons transfer to a bus (Dodger Stadium Express) that gets priority from Union Station to the stadium. The traffic from Union Station to the stadium was horrendous, but the bus glided right through the traffic.\n\nIf you are a baseball fan, you definitely will want to include a visit to Dodger Stadium during your trip to Los Angeles. You will not regret it!\nShow less"], ["Reviewed August 3, 2017", 5.0, "Blue Heaven on Earth", "Nothing beats seeing a baseball game at Dodger Stadium (particularly this season). Very convenient to take the Dodger Stadium Express to and from Union Station. Free with ticket to the game."], ["Reviewed August 1, 2017", 4.0, "Good seats and great game", "Sat in seats with in the highest level but still had a great view People were nice and a lot of great food options If you're ever in the area I recommend going to a game"], ["Reviewed July 31, 2017", 5.0, "Put this on your bucket list and get here!", "Dodger Stadium is currently the oldest park west of the Mississippi, and the third oldest park over all. It is the largest MLB stadium as well. If you even like baseball you need to come here. You can stand where history happened. The Dodger Dogs are great too and that comes from someone who doesn't like hot dog's. The garlic fries smelled like heaven but I was too glued to my seat to get up and get some. Next time I will make sure I do though. I've been told I really missed out.\nShow less"], ["Reviewed July 29, 2017", 5.0, "What a view!", "My Wife was completely in awe of the stadium.\nIts so huge and seating banked so high.\nWe arrived early, parked for free in a street just outside the ground - where its perfectly legal to do so, just that only 100 or so cars could be along that stretch.\nWe walked in had a hot dog and then checked out the seats and took some photos,\nThe Dodger lost and gave up runs early which was a shame and damped the atmosphere (and of course you can see far much more of the action just watching on TV in a bar) but the big screens around the stadium helped.\nIts a really good place to go and quite a spectacle and good value for the ticket price.\nIt was a blistering hot day, so be sure to take some Sun protection.\nShow less"], ["Reviewed July 29, 2017", 4.0, "Great night out watching baseball", "We were in LA on holiday and I booked tickets to see the Dodgers. A great experience to see my first game of baseball in the USA, unfortunately the Dodgers lost. Great atmosphere, food and drink expensive for what it was. The stadium was great and the organisation getting the traffic in and out of the stadium was fantastic.\nDepending on the day and time of the game watch out for travel time across LA to the stadium. Ours was a Friday evening game and it took 105 mins to travel from Venice Beach to the Stadium.\nWorth experiencing.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Awesome Venue", "The setting is super cool. Mountains in the background and the views of downtown leaving the game are really neat. A must for a baseball fan. Don't forget to check out level 9, a must!"], ["Reviewed July 28, 2017", 5.0, "Great night at the park", "This was our second trip to Dodger Stadium, and we took our 4 children for their first Dodgers game. I have been to a lot of baseball games all across the country, but this may have been the most enjoyable. Even though the Dodgers lost, the fans seemed relaxed and were having a great time. It was a different experience than most games on the East Coast, and it just seemed \"fun\". We sat about eight rows back in the outfield along the first base side, and really enjoyed it. The people around us were really nice. We paid for parking ahead of time to save $10, so make sure you do that. Getting out of the stadium wasn't bad, but it did take us over 2 hours to get there from Santa Monica, but I was warned that may happen. It was worth it.\nShow less"], ["Reviewed July 27, 2017", 4.0, "Nice Evening for baseball", "there is a nice feeling in the Dodger stadiums as the fun really do make the experience better than it is as baseball to me is kind of boring. I went to the all you can eat section and it was pretty good with unlimited drinks, dodger dogs, nachos, peanuts and popcorn. In the end it makes up for the prices. I would recommend buying your tickets through Stubhub as they are very cheap compared to the Dodgers site.\nShow less"], ["Reviewed July 26, 2017", 4.0, "A must do but silly money", "Another LA 'Must do' but silly money for a baseball game that seems to be on every day for over a week! That said enjoyed whole experience and firework display at end was great - over 6 minutes long."], ["Reviewed July 26, 2017", 5.0, "Great fun and atmosphere", "This was our first time to Dodger stadium and it was super fun! Not only because they won, of course, but the employees were really helpful when asked to find out seats and at the concession stands. The fans are energetic and it was just a great time. The parking is kind of a mad house so I suggest arriving super early, or just a few minutes before the game starts.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Classic West", "Great experience. Accesible, easily, by car. Had great seats and a cool experience during the Classic West festival."], ["Reviewed July 25, 2017", 4.0, "Fun time", "Great venue, food is good but overpriced. Spend the $$ to sit in low rows, very close to the action. Easy to get in. Getting out with Uber was a little challenging. One driver accepted our request then dropped us after 8 minutes because of traffic. Next one got their quick, you have to call and ask what parking spot they are in so you can find them. Worth seeing a game there, very passionate fans but friendly to outsiders. In our case the good guys lost.\nShow less"], ["Reviewed July 25, 2017", 3.0, "An enjoyable evening at the ballpark", "We visited Dodger's Stadium as part of our 2 week California trip where we went to games at 4 different baseball stadiums. It was my least favorite of the parks we visited. The stadium was well kept and the staff were friendly. Dodger stadium has a lot of baseball history. The negatives were all of the steps between levels. No ramps or escalators at the stadium, there is an elevator to help those with mobility issues. Dodger Stadium for us gets downgraded because of its fans. The fans in our section were obnoxious, the worst we encountered during our trip at the four stadiums we visited. Unless you want a Dodger Dog, you really have limited food choices. Every stand sells Dodger Dogs but you have to hunt & climb stairs for the stands that sell something else. The food was good. I loved the Dole Whip for dessert. The giant bobble heads were fun to see. We left before the end of the game to avoid the crowd getting out of the parking lot. Getting parked before the game was super easy.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Let's go Dodgers", "Wow what an iconic stadium. First thing it's huge! So if you are buying tickets best to get low as you can go height wise or alternatively sit in the bleachers for cheap tickets.\n\nEasy to get to, it has a dedicated Uber pick up in lot 12. Best to wait till you are near before ordering as the walk can be 10 mins.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Stadium withstands test of time", "Can't find much to complain about. Great beer selection. Great food selection. Good sight lines. Tough to navigate from one level to another. Worth the trip."], ["Reviewed July 24, 2017", 5.0, "A winner for Baseball or Concerts ~ Park Outside", "I have been here for both baseball and recently a couple of concerts. This is an iconic setting, a wide open park set in the canyon. Get a Dodger Dog and some Garlic Fries enjoy. Some Tips:Right field faces west into the setting sun, so afternoon events can be a bit sunny. Left field has the afternoon shade. If you want to save a bit (a lot) on parking and don't mind a little stroll, take ACADEMY and park for free along the road. Did that for two nights, not only did we save money, but we avoided the parking lot grid lock and drove right out.\nShow less"], ["Reviewed July 24, 2017", 4.0, "It is legendary", "Awesome venue, tough to get to if you don't take the free shuttle. I love to walk but, hey, it's up hill from virtually everywhere. This place is BIG, security is similar to an airport (so heads up trying to 'sneak' stuff in). If you've never been, prepare for $15 beers (that's 24 ounces so really two), pricey and limited food options, unrelenting sunshine and heatstroke if you're on the 'wrong' side of the stadium...I was there for the Classic West concerts, was very impressed by the great sound, video screens...not so much the concession prices and accessibility. Do your homework, figure out in advance your access, egress, food budget.\nShow less"], ["Reviewed July 23, 2017", 5.0, "The Classic West in a Great Venue", "FIRST - if you are going to an afternoon event, sit on the west side of the stadium - otherwise you are in direct sun and will fry. We got lucky by accident and were in the 6th row on the west side in the shade, pitying those to the east.\nSECOND - If you're going to have a Michelada or other cocktail, know that the bars are CRAZY and the bartenders do not have time to mind their lines. If you are at a large event, you can wait 30-40 minutes. Look to the ends of the bars, where a more natural line occurs. Have cash for tips - they don't include them on your receipt. And if you're inclined - have the Michelada, which is rightfully legendary here. They are huge, have a great mix, super spicy and cost about $23.\nGREAT STAFF - everyone we dealt with from the gate to the concessions to the ushers, was incredibly nice and professional. People were so helpful! Don't hesitate to ask for assistance, these people are great.\nWHAT CAN I SAY ABOUT THE SHOW? It was as amazing as we hoped! We came primarily for Steely Dan and Earth Wind & Fire...who both served it up in spades. The Eagles were particularly captivating, and Fleetwood Mac rocked. Thank you to all the bands! I feel very lucky, very fortunate to have that experience!!\nShow less"], ["Reviewed July 22, 2017", 1.0, "HORRIBLE WAIT FOR TRANSPORTATION OUT OF STADIUM!", "We recently attended the Classic West concert on Saturday July 15th. The concert was excellent but trying to get a ride back to our hotel was a nightmare! See all the complaints on FB! Hoards of people waited for Taxi's - which never showed up. The bus line to Union Station was an hour long! Could not get an Uber and line at Uber station was ridiculous! The concert ended at about 11:30 PM and we did not arrive back to the hotel Omni until 1:45 AM and we were just a few miles away! Unacceptable public transportation around the stadium and needless to say we would never return to an event at Dodgers Stadium. See all the complaints on social media regarding the transportation for that event!\nShow less"], ["Reviewed July 21, 2017", 5.0, "Dodger's game", "We had a fantastic evening at a Dodger's game. We bought our tickets online. There was a good range of food, which we had fun exploring. The game was fun to watch and we enjoyed interacting with staff and the crowd. A great event if you are visiting!\nShow less"], ["Reviewed July 21, 2017", 5.0, "Best Away Game Experience", "My friends and I came here all the way from ATL to see our Braves play the Dodgers. It was a great game that the Braves won 6-3. The Dodger fans were great people and enjoyed talking to them through out the game. The stadium is super retro and has more character than any sports stadium I have been to. Food is great as well, must try is the world famous Dodger Dog.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Classic stadium", "As the third oldest MLB stadium, Dodger Stadium will delight passionately historical fans of the game. Its open air seating and scenery make this a memorable experience. Tributes to Tommy Lasorda, the Championship ring statues, and to Jackie Robinson are worth the admission. Traffic in and out of the stadium is atrocious (typical of all traffic in Los Angeles) and the food and beer choices are lackluster a compared the slew of modern era ballparks. In conclusion, a must see for the baseball historian.\nShow less"], ["Reviewed July 20, 2017", 5.0, "What's not to love?", "LETS GO DODGERS! I love this stadium. It is clean, well groomed, and a beautiful environment. If you attend an evening game, you get to see the sun setting and it is amazing. Only downer about this stadium is the parking. WORK ON THE PARKING!!!"], ["Reviewed July 19, 2017", 5.0, "Dodger Stadium", "Great baseball stadium. If you like baseball is a must see place. Great history. Parking is 20 dollars in general area."], ["Reviewed July 19, 2017", 5.0, "If you like Baseball..........", "To a lot of folks this is Mecca for the local fanatics. As you can guess I am not a fan.\n\nNow for some hints.\n\nIt gets very warm here. So watch your Beer intake as the L.A.P.D. frowns on public drunkenness.\n\nThe Fans can be rowdy\n\nThe Dodger Dogs taste great but are $$$$ Ditto for the beer\n\nThe place is well is set out and generally the staff are 1st rate and the place is pretty clean considering\n\nBring $$$ as everything costs\n\nCome early and leave early to miss the infamous traffic jams\n\nBe ready to have a hell of a good time\nShow less"], ["Reviewed July 19, 2017", 5.0, "Dodger game", "The Dodger stadium has changed so much! For the better. Easy to get in and out. The lines for food and drink are much smaller. You feel safe with a lot of police presence. Note on day games try to sit on the 3rd base side... much cooler as your not sitting in the sun.\nShow less"], ["Reviewed July 19, 2017", 3.0, "Good for baseball, maybe not so good for rock concert", "Just attended Dodger Stadium for Classic West concert. Having recently moved to the left coast from Boston, I was sort of shocked by how anachronistic Dodger Stadium is. I think it would be a good venue for a ball game (how could the weather be bad?), but the food was horrendous and ridiculously priced (they seemed to sell out of 'healthy choices') , and the transportation, unless you drove, was poor. We took Uber the first night, and hundreds, if not more were stranded in the chaos after the show; we walked halfway back then got a cab for $50 for the last 1.5 miles. The second night, the Dodger Stadium Express had nary a bus until nearly an hour after the show for a return trip. The employees were nice but had no clue about buses, taxis, or anything useful. Interesting, but overall disappointing.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Must see ballpark", "Dodgers are not my favorite team, but I do like them...being in Dodger stadium as a baseball fan is a bucket-list item for me. I wore a Mets hat to the game, and no one harassed me, which is a plus! Lol! The people who work at the stadium were very nice, friendly and genuine! We were directed by a security guard to a place to get a \"First Time Visitor\" certificate. Ended up being a great game, with a walk off in the bottom of the 10th!\nShow less"], ["Reviewed July 19, 2017", 4.0, "Great outdoor venue, but difficult to get too without a car", "Attended the Classic West concert which was AMAZING! We had great seats in the Field section (17) and lucky for us we had shade for the entire concert which was great. There is not any good public transportation option to get to the Stadium which was disappointing as our hotel was right next to a Metro spot. Both days we took an Uber to the stadium, but it was such a long line and wait to get in that we literally got out and walked about 1/2 mile from the line just to get into the stadium. All of the staff were friendly and helpful, but getting a better handle on the public transportation would be a plus for future large events.\nShow less"], ["Reviewed July 19, 2017", 3.0, "It's a baseball stadium", "It's crazy getting parked and worse trying to get out, with all the traffic! You want to sit in shade, if you can get it. Lots of food ops/variety, but why would you eat anything other than a hot dog, peanuts and popcorn, as the song goes?\nShow less"], ["Reviewed July 18, 2017", 5.0, "Classic West", "My family and I just attended Classic West and had an amazingly wonderful experience! All staff and security were friendly and helpful. The restrooms were very clean. This was surprising considering the amount of people that were at this concert. The beer lines went fast which was a major plus!\nShow less"], ["Reviewed July 18, 2017", 2.0, "OVERPRICED", "Evert hinge in this place from parking ,admission and food were totally absurd. 15.00 for a beer, 7.50 for an overcooked hot dog on a soggy bun, undercooked fries for 6.50. I could go on and on."], ["Reviewed July 16, 2017", 4.0, "The Classic West Concert", "The 2-day Classic West Concert at Dodgers stadium has been awesome. The seats are great, the food selection is average, and the parking is way over priced. What has impressed me the most is how quickly they are able to clear out the parking lot. Even with 50000 fans leaving at once, I was out of the lot and in the freeway in about 10 minutes. Kudos to the parking and traffic people in and around the stadium!\nShow less"], ["Reviewed July 15, 2017", 2.0, "boring for me", "I am not a baseball fans, so it is quite boring. Although I know nothing about baseball, the tour guide explains everything in the stadium clearly. The explaination gives me a brief understanding about Dodgers and baseball.\nIf you love baseball, you can go. If you dont, dont go.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Excellent Venue", "For an evening/night out it's the place to go. Great family experience, bit pricey for food and drink but all part of the event. Great \"audience\" participation and great party atmosphere. Easy to get to by metro and free bus shuttle to Venue. Worth ro read up on history of place too.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Great baseball atmosphere", "Don't let the third oldest MLB stadium fool you, you would hardly notice its age. The Chavez Ravine area is a beautiful area for the ballpark and there are some great views of the park and the city from the upper level. Being in town for the Freeway series added to the enthusiasm of the game. Great park!\nShow less"], ["Reviewed July 12, 2017", 5.0, "do a dodgers game", "we bought cheap tickets in Australia before we left - great seats always buy parking at stadium when you but your tickets if you are a first timer ask a friendly staff member where to get your special certificate as a free souvenir have a dodgers dog and an ice cream out of the players hat!! if your not sure what is going on the friendly locals will help. get ready to cheer with the organ and yell CHARGE!!!! Great fun.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Blue Magic", "It's the third oldest stadium in Major League Baseball behind Wrigley in Chicago and Fenway in Boston. When it opened in 1962 it was the newest stadium in MLB. That's how much times have changed and haven't.\n\nDodger Stadium is so intertwined with Los Angeles modern history - as is the historic relo of the Dodgers from Brooklyn to LA - it's almost impossible to describe in words. You have to feel it. You have to be there, perhaps multiple times, to grasp its full emotional significance.\n\nThe food is lousy and expensive but it doesn't matter. They let you bring in your own food and one sealed bottle of water per person. That is a gift most stadiums don't allow. Another secret is that you can visit the top deck store on non-game days, walk out the open back door, and eat your own brown bag lunch in the stands, overlooking the gorgeous emerald field. You want to feel magic? That's magic.\n\nOn game nights when it goes from light to dark, from no field lights to full field nights, you look out over the palm trees surrounding Chavez Ravine and remind yourself that prior to Dodger Stadium, palm trees and baseball did not mix. When MLB came to the west coast, the game became a truly national game with television and airline travel. With that came icons like Koufax and Drysdale, Fernandomania, Scully, and forever the spirit of #42 Jackie Robinson. It's all still there, and now Kershaw. You will feel west coast baseball as it should be: authentic, inspirational, and historic.\n\nIf you can't make a game, take the tour. But you need to come to a game. You will be back. Dodger Stadium is part of our home.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Take me out to the ball game...", "For a tourist it´s awesome to experience a Baseball ggme first Hand. I had a great day with my friends with Hot Dogs, Beer but I still have no idea how this game works."], ["Reviewed July 12, 2017", 5.0, "A GREAT Ballpark!", "This is one of the nicest ballparks I've ever seen - in fact, I'd be hard-pressed to name one nicer, but everyone has their favorites, I'm sure (I'm a long-time Tigers fan & have visited perhaps a dozen or so over the years)...The tour was EXCELLENT & very informative - highly recommending this one!\nShow less"], ["Reviewed July 10, 2017", 5.0, "One of the best ballparks in the MLB", "I spent a Friday night at Dodger stadium when the Dodgers took on the Royals. The stadium itself is very nice and manages to look modern and classic all at the same time. The stadium was almost at capacity but the wait times at the concession stands were very low. There is a wide selection of food to choose from, including the famous Dodger dogs, which are a must try. After a great baseball game, we were treated to \"Friday Night Fireworks\", and witnessed a breathtaking fireworks show that lasted for over 10 minutes. If you are planning a trip to LA during the baseball season, definitely make sure you go see a Dodgers game, you won't regret it!\nShow less"], ["Reviewed July 10, 2017", 4.0, "So fun, so hot!", "We sat in section 21 (third base side above dugout) on a Sunday afternoon game. Sunscreen sunscreen sunscreen!!!! Hat, Spray bottle to mist yourself, towel to wipe your sweat, sunscreen all a must! Did I mention sunscreen?!? Prepare yourself for a hot seat too (sat on a towel!!) with that said, great stadium, easy parking, and always a great game! Go Dodgers!\nShow less"], ["Reviewed July 9, 2017", 5.0, "Keep your little kids at home", "I was invited to a work event sponsored by Emirates Airlines in the BMW lounge. When you have free drinks and food in an air condition setting what more can you ask for. We had a great time but I wish parents would keep their little kids at home or take them to Chucky Cheese instead of bringing them to a game they don't understand.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Play ball!", "As fans of the visiting team, we were impressed with the helpful and friendly staff.\nPurchased our tickets from independent ticket site and had no problem with our mobile tickets at the gate.\nSecurity checkpoints were run smoothly and efficiently.\nLyft driver dropped us off at parking gate on third base side and it was a short walk to entrance.\nIf you're going to a 4pm game, highly recommend the third base side for shade - first base side is full on ☀️.\nBe prepared for expensive concessions - $9 large soda, $16 beers - ouch!\nAlthough antiquated, Everything was clean.\nFeeling of nostalgia being in an older stadium, but can't imagine thats worth sitting on bleachers in the outfield.\nUpon exiting there is an Uber pickup area that is well marked - we however decided to walk short distance (2.4 miles) to our daughters apt. Lots of local fans were departing on foot as well, so that was nice to see.\nShow less"], ["Reviewed July 8, 2017", 5.0, "DODGERSSSSS BASEBALLLLLLL", "I was here the last day Vin was doing the Announcements. it was awesome! There were some annoying people around us where we sat, but people are always annoying. Play ball! PS, garlic fries will make you immune to vampires for the rest of your life.\nShow less"], ["Reviewed July 7, 2017", 4.0, "Great fun and an 'authentic' experience", "We saw the Dodgers vs the NY Mets, great entertainment and good to do something that the locals do so very authentic experience. Getting there and back is a nightmare, we used Uber which was Ok and would recommend this if you are going.\n\nWe had a great family night out, good game to watch and all in an enjoyable event.\nShow less"], ["Reviewed July 6, 2017", 4.0, "Huge park-get there early!", "The park itself was great. It was huge and the atmosphere was great. My wife and I are Red Sox fans so we understand the fans passion. The amenities inside didn't match the parks luster. The lines were long no matter when you stood in them and the worst part was getting in. You have to get there more than an hour early or you will be waiting in your car to get a parking spot. Also, they don't have definitive driving lanes getting up the hill to the park, at least until you get to the main parking area. Because of that it is somewhat of a free for all to get up the hill. That and the random people trying to sell you dodger gear heading to your parking spot was kind of a turn off. All in all a good time though.\nShow less"], ["Reviewed July 4, 2017", 4.0, "What a Ballpark!", "I love older stadiums. Dodger Stadium is now among my favorites. We visited the stadium in advance of the game to shop unhindered. The gift shop is large with lots a great options. You must see the view into the field from the top level! It's one cool, historic stadium. Allow plenty of time to get to/from. If you Uber, be prepared to be corralled waiting for your ride home. That was bizarre, bordering on a cluster.\nA Dodger dog is a must!\nShow less"], ["Reviewed July 4, 2017", 4.0, "Classic ballpark", "Enjoyed our visit to Dodger Stadium. Third oldest ballpark in the majors, behind only Fenway and Wrigley. Bought parking online and saved money. Acres of parking, so you may have a little walk to the field. Nice setting among the hills.\n\nTeam is playing well, with some very good young talent.\n\nPrices for food and drinks are high, as expected with a MLB ballpark, but they will allow you to bring in food and water, so take advantage of that.\nShow less"], ["Reviewed July 3, 2017", 5.0, "A true blue fan", "Spend a day and enjoy the !st place Dodger team. They will not disappoint, the team is the best they have been in years with a lot of young talent. Best to order tickets on line and have a great day for the whole family."], ["Reviewed July 3, 2017", 5.0, "Dodger parking tip, awesome game and stadium", "Dodger's are awesome this year and the stadium is packed. So, here is one thing you can do to help with parking and getting in and out of the lots. Buy your parking ticket on-line, you'll save $5.00. Print the paper, don't worry about the lot #, it doesn't matter. Get on Sunset, turn onto Vin Scully Drive, takes you into the stadium, get into the right 2 lanes, at first they may seem slow, but it will move, the entrance to prepaid parking in on the right side (2 booths) as you enter the stadium, little to no lines! Everyone else on the left is paying to park, but for you, they just scan your paper. Then stay to the right, there is primo parking spot on the right side that is fairly empty and close. To get out, they direct you towards the freeway/Chinatown, we went to Hill Street and downtown. Have fun! Go DODGER'S!\nShow less"], ["Reviewed June 30, 2017", 4.0, "Baseball", "First time at a baseball game for me. Really enjoyed the atmosphere but lots of trafffic getting in and out of the stadium. Big crowd and the fireworks after were a nice touch"], ["Reviewed June 29, 2017", 4.0, "Classic ball diamond", "One of the great classics for taking in a ball game. Outside the stadium there are a lot of photo ops. Parking is outside the stadium and can be a bit of a walk in. Book on-line for a reduced price. Water bottles that are not open can be taken in the stadium.\nShow less"], ["Reviewed June 28, 2017", 3.0, "We won, but very expensive low grade food and beverages", "Family of five going for their first game. Uber transport worked really well, as did getting in. The searching of bags gives confidence in the safety. The seats on the top deck gave a good view for the cost. However, the cost of in excess of $250 for food etc was exceedingly high and not a good quality.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Pricey but a great experience", "I came here for a baseball game in late May and overall I was impressed with Dodgers Stadium, the atmosphere was great and the stadium offered great views over the surrounding area.\n\nThe only downside was the price of the tickets which is considerably more expensive then the equivalent tickets at Angel Stadium which is the other baseball stadium in the Los Angeles area.\n\nIf you get public transport to Dodgers Stadium I would recommend it as it takes a long time to leave the ground and parking is expensive.\nShow less"], ["Reviewed June 27, 2017", 4.0, "Great ballpark", "First time at a Dodgers game and it was to see them against the Angels in the Freeway series.\n\nThe ballpark it nice with a touch of old tine park mixed in. Plenty of concessions available all around the park and there is free wifi for the kids if they get bored.\n\nThe food and drink pices are a bit high. Highest I have ever paid at a ballpark. Not sure if you are permitted to take your own into the park, but if you are, then I would seriously consider doing so. $14 for a beer and $8 for a dog.\n\nGreat place and great atmosphere.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Bring your own food!", "Coming from the East Coast, we had not been to Dodger Stadium for about 30 years. The stadium is a great example of 1960's baseball stadium architecture, with a nod to its Southern California roots ina lovely setting. As with most ball parks, the food was largely forgettable (I had the Dodger Dog) and vastly overpriced. Unlike many ball parks, you can bring in your own food, and I would encouarge you to do so. We left after the 8th inning and traffic was minimal.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Dodger fans are the best!", "Although my husband had his Mets shirt and ball cap on, the Dodger fans couldn't of been more friendly and fun! The stadium is one big circle that does not take very long to walk around and there were fun things to do like get a shot of tequila for free, pose with a mascot or get a picture with the girls by the race car. The second floor has lots of Dodgers pictures and memorabilia as well. The food at the stands are somewhat limited with not a huge vairiety like some of the newer stadiums provide, but it's Dodger stadium, so who cares? Love the \"kiss cam\" and \"dancing cam\", but wear your Dodgers stuff if you want to get on it, or bring a funny kid with you. Plenty of places to get a beer and a mixed drink station was near us. Only one place served wine that we could find and it's very limited, Woodbridge, either Chardonnay or a Cabernet. It would be nice to have a little better selection of wine for the ladies! They also have a very large store to pick up a Dodgers jersey, but they are not cheap. I wish they sold bobble heads! Go early so you can take it all in!\nShow less"], ["Reviewed June 25, 2017", 5.0, "mid-century modern classic, great baseball", "Went for a game, was surprised how much I liked the stadium. I'm a sucker for the historical parks, and this one is classic 50s all the way. It's easy to navigate and had one of the best food/drink selections I've seen in a park. They also have somehow managed to run it so I never seemed to stand in line for an entire inning to get a beer. Took 5 minutes tops. Great views of LA too. Pain to get to!\nShow less"], ["Reviewed June 25, 2017", 4.0, "It is possible to walk there.", "My husband and I stayed in downtown LA and wanted to see the Dodgers v. Mets. We love to walk to see the sights. We were the only walkers we passed on our way up to the stadium and after the game. I just want others to know that it is possible to walk (even though I know LA is not known for walking.) However, there are no signs to help you along the way. Our trusty map and following the line of cars up to the parking are how we found our way.\n\nThe drinks are way overpriced, but that is the way it is these days.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Dodgers Vs. Nats day game", "I was a bit hesitant to go to a game at Dodger stadium because it is an \"older\" stadium and I wasn't sure what the experience would be like. Parking was easy and I think that the seat I bought for $23 had a great view. The ball park was really nice and people were friendly. Only negative part of the day was the guy that passed out and died outside of the stadium, but those things happen. Overall, a real enjoyable experience.\nShow less"], ["Reviewed June 24, 2017", 4.0, "Good fun", "Relaxed atmosphere and enjoyable even if you know nothing about baseball. Book parking in advance as it's half price. We left slightly before the end and leaving the car park was straightforward.\n\nFood and drink is on the pricey side, particularly the beer which was $15. You can bring in your own food and sealed soft drinks bottles so strongly recommend that.\nShow less"], ["Reviewed June 24, 2017", 5.0, "LA Dodgers vs NY Mets", "My family (we are from Australia) and I went to our first American baseball game on the 22nd June 2017 at dodger stadium and loved it! The stadium was clean and seemed in good condition with plenty of food options and amenities. Stadium seats were comfy, our seats had a great view and we loved the crowd interaction that was encouraged throughout the game. We were quite worried before the game about parking but that was so well organised and we had no issues or line ups getting in and out. Fabulous first place to visit for our first American baseball game.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Mets vs Dodgers", "Being from NY, we went to see the Mets play the Dodgers. Dodger Stadium is quite a nice stadium. Modern, clean and comfortable. Though the Mets lost, they did make it an exciting game."], ["Reviewed June 22, 2017", 4.0, "America's Pastime - Baseball!", "I'm a huge baseball fan, and Dodgers Stadium is the 4th stadium I've been to in the past year. It has that old school feel (think early 1960's, considering it opened in 1962....) which gives it tons of character. They've attempted to make some upgrades while maintaining the old school feel, which has its pro's and cons. Con: there is very minimal shade. Besides the concourse, I'm not sure we found shade anywhere else. Pro: there aren't any bad seats. Con: the concourse areas are small, and when everyone is trying to get out, its kind of hectic, especially with the pop up vendors still having their carts lining the walls. Pro: Dodger dogs!\nThey'll take your photo for you when you walk in the gate and deliver it to you by the 4th (I think) inning, when you can decide if you'd like to purchase it. I've never encountered this at any other stadium, so this was cool to me. They don't, however, do same-day game used memorabilia like the other stadiums I've been to, which is a bummer. Being able to purchase something that is game used while you're still there is pretty awesome, so I'd like to see them add this in the future. Everyone was super friendly and helpful, which you don't always find at events / ball parks. I'd definitely go back to catch a game.\nWe took an Uber to the stadium, so I can't speak on the parking situation, but I do know that you can catch a bus from Union Station in LA that brings you directly to the stadium and then it picks you up and brings you back to Union Station after the game - all for free if you have a ticket to the game. So I'd definitely recommend this option.\nShow less"], ["Reviewed June 22, 2017", 5.0, "What a fun day at the ballpark", "I have to say be prepared for EXPENSIVE beer. But besides that the stadium is amazing. Good parking system. Quick food and drink lines."], ["Reviewed June 22, 2017", 5.0, "Upper Deck and sunny", "We had plenty of sun, but we were near enough to concessions to take advantage of short lines any time we wanted drinks and snacks. Our view of the action and the surrounding city was perfect too. We paid a little extra for premium parking and that was totally worth it.It made getting in and out much easier.\nShow less"], ["Reviewed June 21, 2017", 4.0, "19th June 2017", "Had a great night. Dodgers won over Mets and we even understand a few rules. Ate dodger dog as recommended - OK. Difficult getting home due to über area long way from wifi and we don't have phone for USA."], ["Reviewed June 19, 2017", 5.0, "Great stadium!", "I travel to all of America's ballparks and thought this one was great! Lots of food choices, bar areas, areas to explore. Worth checking out if you are visiting LA!"], ["Reviewed June 14, 2017", 5.0, "Parking At Dodger Stadium", "You have your ticket. What about parking? if you don't have a parking pass, go to the official Dodger buy parking web site. You will save $10.00 for GA parking, which you can use to buy a Dodger dog and soda."], ["Reviewed June 11, 2017", 4.0, "Great view from the top deck", "Seeing all the MLB ball parks was always a thought, but of course if it's just a thought it doesn't rank high for priorities. This one makes 6. Make sure you check the weather because it was very cold from the top deck."], ["Reviewed June 10, 2017", 4.0, "Go dodgers", "First time at a baseball game. Loved the atmosphere but it's a bit slow at times. Probably one of the best teams to see and loved that so many families are there."], ["Reviewed June 5, 2017", 3.0, "Nice older ball park with great views", "Dodger Stadium is a nice ball park for an older facility. Beautiful setting but needs to be updated & food selection isn't very good for a major league park."], ["Reviewed June 5, 2017", 3.0, "Being the visiting team fan", "Well LA is definitely not Philly although there was one fan who heckled me like Philly heckles visitors. Citizens Bank Park allows fans to get field access until approximately 30 minutes before the game, that's not the case here. So,if you want to get some autographs get there at least 90 minutes prior. The food and beverage selection was very good but the prices will cause sticker shock if you are used to East Coast pricing. Our seats were great, along the first base line. They were in the shade too. If you are in LA and your team is visiting its well with the traffic.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Go Dodgers", "Had to catch a ball game while in LA, it just so happened there was one on!! Bought the tickets from stubhub and had great seats - the atmosphere was good, friendly, very family orientated and just relaxed and fun. Would go back...! :)"], ["Reviewed June 3, 2017", 5.0, "So much fun", "Wanted to visit an American baseball game and there is no better place than this. Lots of supporters and cheering for this grand game. And then there is the beer and hotdogs, but didn't go as far as having peanuts. For an American must see, go watch the LA Dodgers in their home turf.\nShow less"], ["Reviewed May 31, 2017", 4.0, "A Must", "Our group has hit all of the ballparks and we loved the history and the views. It's showing its age, of course, and doesn't have much of the finery that the newer stadiums do, but you've got to visit. Bring your walking shoes - parking is a hike.\nShow less"], ["Reviewed May 30, 2017", 5.0, "First Time Visit - Wow what history!", "Wife and I visited Dodger Stadium for the very first time as my Cubs visited for a weekend set. Although I knew that getting and leaving the ballpark would be a nightmare with LA traffic, the time spent between that was incredible.\n\nWhile not being a Dodger fan, it seemed that quite a bit of my baseball memories involved the history of this iconic ballpark. Seats were in the upper deck, first base side. Doesn't seem to be a bad seat in the house, however. Dodger fans were very welcoming and cordial. Is it just me or did I not notice any ushers here? Food prices are expensive, but that is expected.\n\nWhen my Cubs or wife's White Sox visit Dodger Stadium again, we will return! One of my favorite MLB places to see a game!\nShow less"], ["Reviewed May 30, 2017", 5.0, "Great Baseball Cathedral", "Took my kids, all under 10, to their first baseball game this month. Dodgers Stadium is still beautiful as ever. The food is okay and it feels a little worn in the nose bleeds but theirs a nostalgia about that place u can't replicate.\n\nTips:\n- Buy the parking online, saves have 50%\n- The entrance on Hill is the best find I've had. Normally I exit the 5 and pass the Academy, but the Downtown entrance is much faster.\nShow less"], ["Reviewed May 28, 2017", 4.0, "Great stadium with a lot of history", "Great stadium with a lot of history, one of the first few baseball stadiums built in the US. Lots of memorabilia and neat historic baseball stuff"], ["Reviewed May 27, 2017", 5.0, "I've been to close to 25 stadiums; Dodger Stadium is a classic!", "Been going to Dodger Stadium since I was a kid. They've made great improvements to food offerings. It was a fun, friendly atmosphere. If you're looking to save money, it's awesome they let you take in food and water. Only downside is parking can be a pain. Plus, unlike the new parks, Dodger Stadium is within walking distance of hotels, bars and restaurants.\nShow less"], ["Reviewed May 27, 2017", 4.0, "Game time...", "Continuing with my quest to visit as many stadiums and ball parks as possible.... with all the Brooklyn and LA history, I had to visit Dodger stadium. The positives... beautiful for an older park, great view of the hills, great sight lines and easy access to all levels (if you don't mind stairs as escalators can be very busy). The negatives... terrible parking setup, other parks such as Anaheim put LA to shame. The parking is made worse by the location of the park meaning you can't avoid LA rush hour. Another negative is the food, one of the worse hotdogs I have had at 16 different parks. Another negative is the prices, typical LA...be prepared to pay $50+ for two beers, two hotdogs and some chicken tenders.\n\nIf you are a baseball fan then go once for the experience.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Historic Dodger Stadium", "I enjoy seeing new baseball stadiums every year (especially older ball parks). Dodger Stadium was on my list, as it is the 3rd oldest ball park in the majors.\n\nI decided to take the tour of the stadium. and it was one of the more enjoyable tours I have taken thus far. The tour lasts 90 minutes, and you get to see areas of the stadium, sit in the Dodger's dugout, step on to the field dirt only), plus see all the awards etc. I highly recommend the tour (Dodger fan or not).\n\nThe seats I had for both games were great, I honestly do not believe there is a bad seat anywhere. They have a good selection of concessions, and I did not think the beer selection was bad either. The Dodger Dog was very delicious, and it was recommended by the stadium tour guide.\n\nI would visit this ball park again for sure!\nShow less"], ["Reviewed May 27, 2017", 5.0, "Great atmosphere", "Great atmosphere. Would really recommend visiting for a game if in the area for a true American experience. Great atmosphere on a Friday evening with fireworks at the end to top it off. Loved it."], ["Reviewed May 26, 2017", 4.0, "Great time!", "While in LA the Dodgers were playing so decided to catch a game. Traffic was horrible getting there, went on a Thursday night, so suggest allowing yourself plenty of extra time getting there. Had the nachos (in the hat) & was very disappointed. The cheese really didn't have a flavor, very bland. All the employees were nice & helpful!\nShow less"], ["Reviewed May 23, 2017", 3.0, "Incredibly difficult to get in to when seeing a concert", "While the venue itself was great for seeing the U2 concert recently, trying to get to the Rose Bowl and part are entirely different matters. We left Orange County at 1:30pm, got to our hotel at just before 4pm, left the hotel - which was 6.2 miles from the Rose Bowl at 6pm, made it to our seats at 8:30pm for an 8:45pm concert start. Crazy! We literally parked on the 9th hole about a mile out from the gates of the Rose Bowl. Don't know if we will ever/need to ever see another event at the Rose Bowl, but we did it and checked it off the list!\nShow less"], ["Reviewed May 23, 2017", 5.0, "Dodger fan from Michigan", "Absolutely loved going to the stadium. Found it easy I get in and out. We got there early and left after the game was over. Ticket prices varied from under $10 up to astronomical prices. Can't really go wrong not a bad view in the house. The seats are aged but not uncomfortable. The age is expected since it is the 3rd oldest park in the MLB. My wife went in for our first Dodger home game and guests services gave us a little certificate. And since we mentioned it was our 10th wedding anniversary they gave us a ball from batting practice. My one complaint is that the do not allow fans access to the wall for autographs. I've been to 4 ball parks in the mid west over the last few years and all of them allow fans access to the wall near the dugouts up to a certain point till game time. Oh one more complaint...regular draft beer $12 and $14 for a premium beer!!\nEarlier in the morning we came to the stadium for a tour. Highly recommend taking the tour. Getting to be in the dugout and on the field (dirt only) was amazing.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Great Ball Park But", "Too big a venue for concerts.. It's easy to get good seats but nearly impossible to see the teensy figures on the stage. It does have better acoustics than I would have expected and the music of Billy Joel was great, but even the jumbo screens were hard to see. My seats were above the home team dugout and Billy was set up in centerfield.\nShow less"], ["Reviewed May 22, 2017", 5.0, "baseball", "this stadium is amazing.I think its a must see for LA tourist.you can tour it til 5 I think..you can go in their souvineer shop and get you a gift for all those people you left home"], ["Reviewed May 22, 2017", 5.0, "Ebbetts Field in 1957 and now Dodger Stadium in 2017.", "Yes it was a long wait for me to get to Dodger Stadium, I grew up in Brooklyn and saw them when I was 10 years old. It has taken me 60 years to catch up, and well worth it. Don't wait as long as I did.\nShow less"], ["Reviewed May 22, 2017", 2.0, "A Night At Dodger Stadium", "Its a beautiful day for a Ball Game at Dodger Stadium except for the food & drinks cocktail 11:50 in a plastic cup no less!!! A bottle of water $5.00 The game was GREAT The stadium is beautiful but they over charge on everything possible."], ["Reviewed May 20, 2017", 3.0, "Go VERY early, traffic terrible", "Considering the fact that there are 81 games a year, the flow of traffic for parking was very disorganized and slow. We missed 3 innings!\nFood in upper deck was poor\nGood site lines, seats ok, very few attendants to guide first time visitors\nBut still worth visiting\nShow less"]]}}