{"Domaine Carneros": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Domaine Carneros", "url": "/Attraction_Review-g32766-d144811-Reviews-Domaine_Carneros-Napa_Napa_Valley_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/14/58/64/domaine-carneros.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1229"}, "address": {"@type": "PostalAddress", "streetAddress": "1240 Duhig Rd", "addressLocality": "Napa", "addressRegion": "Napa Valley", "postalCode": "94559-9713", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 6 days ago", 5.0, "Great sparkling wines", "As with most Napa wineries, be sure to make a reservation before coming here to ensure you get a tasting. If you enjoy sparkling wines, this is the place for you. My favorite was their popular Sparkling Rose. The tasting rooms and exterior are beautiful. The wines are also reasonably priced compared to other wineries in the area. I will definitely come back here again!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great place to visit and enjoyable setting and very good quality. \"BUT\"", "We are members at the winery because it is our favorite Méthode champenoise in the area. The Charcuterie etc is/are very good and so are the Pinot Noirs:: HOWEVER!! I told the server who apparently had been there of 10 years that the Pinot Noir was too warm. It was over 70F and started to taste like grape juice. He said nothing! I did buy a bottle of Great Gate because I know what it tastes like at about 65F or slightly less. However I will not order Pinots there again and go the Monterey County for what I need. We are in Napa 4-6 times each year\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Gorgeous Estate", "We really enjoyed our time here. The estate is absolutely gorgeous! We had a sparkling flight and a cheese tray and didn’t want to leave! *Tip: get here early! We came right at opening on a weekday and within half an hour, it was packed!"], ["Reviewed 4 weeks ago", 5.0, "Amazeballs", "Part of the Tattinger Family of wines, and what more can i say? Beautiful view and venue. Modelled on the tattinger chateu in france. Wines and platters were excellent would happyily visit again. And you must try the Famous Gate Pinot Noir!"], ["Reviewed January 18, 2018", 5.0, "Best methodis champagne", "The methods are true to tradition and the results are evident. This is a beautiful facility and a very educational tour."], ["Reviewed January 16, 2018", 5.0, "Beautiful winery", "We didn't have a chance to try wine tasting but we walked around the estate and it was very beautiful vineyard surrounding the building. With French style architecture, they want to show the visitor as they enjoy French atmosphere. They also sell French artisan from lavender soap, lotion and perfume aside from wine they produced from their vineyard, Location is in the main road which visitor can easily spot this place.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Great wine tasting experience!", "One of the best places for a wine tasting experience! Especially if you're in to bubbly! They have some of the Best!"], ["Reviewed January 8, 2018", 5.0, "Had a great time", "This was a very nice place to go. We enjoyed the great service we received. Cheese platter was good. Thank you"], ["Reviewed January 8, 2018", 5.0, "Always a wonderful and elegant experience", "We are members so really enjoy the members only section however; this is a great place for anyone to visit (the members section is actually tucked in the back on the side - great views but even better views are available in the non-members section. It is a very popular place so be prepared to set things up in advance.\nShow less"], ["Reviewed January 8, 2018", 4.0, "The grounds are very good...", "I gave them four stars for the grounds as they are beautiful. As for their sparking wines, we weren't really impressed. The customer service was not what it was at the other vineyards we visited either. It was more like the service you would get at a busy cafe.\nShow less"], ["Reviewed January 4, 2018", 1.0, "Canceled our tour the evening before", "I only had an evening and a morning in Napa, and out of all the wineries available in this region, I chose Domaine Carneros and Chateau Montelena. Carneros canceled my tour the evening before the tour would occur, saying they were under construction. (Montelena was great, go there!) Wouldn't they have known about this construction beforehand? It bothers me that they simply canceled my appointment without any consideration for my travel plans, and without any kind of acknowledgment to the fact that I traveled to Napa to visit 2 wineries, Domaine Carneros being one of them. Because of the extreme late notice, I was not able to book any other decent winery visits for that morning. The good wineries in Napa have to be booked in advance - I foolishly chose Domaine Carneros and I suffered the consequences.\nWe did stop at Domaine Carneros the same day our tour was canceled, because we had nothing better to do, and they were not very hospitable to guests. It appears this is the down season, and they couldn't care less about the people who show up at this time.\nAs a side, I am wine geek, and I love Taittinger. I have not had great experiences with Domaine Carneros wine, but I wanted to learn more about them, and I'm still giving their wine the benefit of the doubt. I've had their Tete de Cuvee, Le Reve, several times, and it's never measured up to the price tag. I feel similarly towards the rest of their sparkling wines - drinkable, good but not great, certainly not worth the price they are charging. That was why I wanted to go there and take a tour of the winery - to understand this winery which I have been unable to comprehend.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Wonderful Way to Celebrate New Years Day January 1, 2018 - Domaine Carneros", "We went for a tasting and cheese plate on New Years Day - January 1, 2018. The winery was very popular.\n\nThere was both seating inside and on the patio. We booked our reservation in advance and sat by the welcoming fire place.\n\nFor our tasting, I chose the Sparking Wine Sampler My husband chose the Grande Tasting which include sparkling wine as well as pinot noir\n\nEach of us enjoyed our wine flights.\n\nWe also had sparkling water.\n\nFor our food, we had their wonderful sparkling wine cheese plate.\n\nThe winery is beautiful.\n\nThe winery can be visited by both those tasting, as well as those who want to bring their children. They have some non-alcoholic beverages.\n\nWe also watched a bird as it flew in from outside to the inside dining area To us, it seeemed that this bird (or similar birds) were frequent visitors The staff knew how to ask it to go outside again.\n\nAll in all this is a wonderful place to go to taste sparkling wine and pinot noir.\n\nStaff is very nice.\nShow less"], ["Reviewed December 31, 2017", 3.0, "Great property, okay wine.", "You don't come here for the wine. You come here to check out the castle and the property. The property is lovely - wonderfully managed. The entrance is grand and is a great spot for pictures, as you will see every visitor stopping to take a pic. We had a party of 8, which would have taken over an hour for a table so we ended up splitting up in two groups of 4 so that we could sit right away. Some of us did champagne tasting while we just got a single glass for others. The champagne itself is not the best, so we were trying to limit the amount of money spent.\nHowever, it was a great place to spend an hour or two and people watch. Lots of people come dressed fancy considering the place looks fancy.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Beautiful with Amazing Sparkling Wines", "Going here is a MUST DO while you are in Sonoma. We headed here after Cuvaison and had some sparkling wines. I tried to stick with the Pinot Noir flight while my wife had the sparkling wines. They are a bit too sweet for my taste, but if I am going to drink it, I would drink it here for sure! The grounds are beautiful and we had our tasting outside on a perfect sunny day. It offers amazing views and the service here is excellent. If you like your sparkling wines, this is the place for you!\nShow less"], ["Reviewed December 26, 2017", 4.0, "Beautiful grounds.", "According to what price you want to pay will get you a decent selection of sparkling wines. Paired with a savory platter to enhance the flavor of your selection. Pricing $$ - $$$$. According to your taste. The grounds and chateau are amaxing with fantastic views of the Napa Valley.\nShow less"], ["Reviewed December 12, 2017", 4.0, "Stunning!", "Domaine Carneros kicked off a Girls' Weekend with me and my oldest friend. Neither one of us had ever been here before.\n\nIt was a great way to start our weekend!\n\nEveryone was friendly and helpful. The tastings and the food both were divine.\n\nThe two reasons I didn't give this 5 stars is the seating under the umbrellas does not block the sun AND the prices are steep. But then again, that's just nitpicking.\n\nAn overall amazing experience and yes, we'll be back to sit under the umbrellas to look at the view and pay those steep prices for the experience!\nShow less"], ["Reviewed December 7, 2017", 4.0, "Surreal landscape and refreshing champagne-brut", "We had a wonderful experience here in late August and would recommend visiting this vineyard in Napa. This estate was full of high energy groups and couples enjoying themselves, in the sun, with their sparkling drinks. I've detailed some of the pros and cons below to give you the most objective account of the experience there, rather than just saying everything was good.\n\nPros\n- Stunning landscape with great photo opportunities.\n- Ideal for those that prefer champagne-brut over wine.\n- Has a 'light bites' food menu which includes cheese, crackers and cold meats.\n\nCons\n- Got too busy, with not enough tables or staff to attend to newly arriving guests.\n- Their patio umbrellas didn't provide enough shade in the hot sun. We had to move our chairs around the table, and closer together, to get more shade.\n- Non-champagne drinkers, in your group, may get impatient with the tasting. This vineyard is also famous for their red wines, so the solution would be for them to order something from that list.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Our favorite place to visit", "We're long time members of the sparking club. We live on the East Coast so we don't get to visit very often. It's been three years since our last visit and they continue to improve and add to their property. They make us feel like royalty. We can't wait to see their sun room - under construction now.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Bubbles and a great view!!", "Slightly pricey.. but as they say..you get what you pay for. Have a flight of bubbles and sit on the veranda. Just stunning!"], ["Reviewed November 15, 2017", 5.0, "Short but sweet visit", "On our way from Napa to San Francisco. Made a stop here based on a friends referral. Stunning property. Shipped our selection home free. Beautiful view reminiscent of Tuscany. Highly recommend."], ["Reviewed November 14, 2017", 5.0, "Beautiful and Delicious", "This place is straight out of my dreams!! This was our first stop in Napa and it did not disappoint. The chateau and grounds are gorgeous both inside and out. The sparkling wines were delicious and our server was very friendly and knowledgeable. We loved this place and it was the perfect was to start our day.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Take the tour!", "I took my daughter to France in May and we spent a day in Reims, where we visited Taittinger among other great champagne houses. Domaine Carneros was created in partnership with the Taittinger family, so the sparkling wines produced here are method champanoise - produced in the same way as champagnes of Reims.\nWe had a fantastic host - Jeanna - who was funny and very personable. She led our large group through the tastings of several varieties of bubbles and explained the process of creating the wonderful vintages. Fun! And we learned a lot!\nThis winery also makes a lovely Pinot Noir, which we tasted at the end of our tour, accompanied by a lovely cheese, crackers and raisins. This was a really fun tour, well worth the extra cost and certainly informative.\nI'm a champagne girl so I really appreciated this visit. We left with a bottle of the brut rose sparkling wine and I look forward to enjoying it later at home - particularly since I know, courtesy of today's tour, that big bubbles equal big problems -- the tiny bubbles of these vintages only bring happiness.....\nShow less"], ["Reviewed November 9, 2017", 3.0, "Impressive to Look at", "The chateau style winery is gorgeous. Went last weekend with friends and loved the look of it. However it was very crowded as we were all packed inside even though the weather was fine outside (they could have let us outside for tastings in my opinion). Because of the crowd it was loud and not easy to hear our server but that was fine because he didn't tell us much about what we were drinking anyways. I had the champagne flight and thought it was just okay. Friends had wine and champagne and were just so-so with how they felt about what they had. Not sure if I'll come back but was glad for the experience to see such a lovely spot.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Amazing Tasting", "We had a fabulous andt fun time on the terrace of Domaine Carneros. We so enjoyed their sparkling wine and cheese pairing. Our server was simply amazing. A fun way to start our trip in Napa. So worth the visit."], ["Reviewed November 2, 2017", 5.0, "Wonderful", "Really enjoyed our time here. Very beautiful. The champagne and cheese plate were very good. Pleasant server, she was busy with other tables but she made sure we were taken care of promptly. Would definitely come back to try the pinot noirs next time."], ["Reviewed October 30, 2017", 5.0, "Relax, sip some wine and forget your troubles.", "Fairy tale like in ambience, I visited with my son who is a member. We enjoyed two wine tastings and shared a cheese plate and a charcuterie board. All delicious, served by attentive staff.\nWe sat on the veranda, overlooking the hills and valleys of the area on a clear, cool afternoon. There are rose gardens that lead up to the graceful building that add to the elegance and charm.\nI have added this to my \"do it again\" list when I return to this area.\nShow less"], ["Reviewed October 27, 2017", 3.0, "Average at best", "Didn't care for the sparkling wine here, but I did enjoy my time. The waiter was a pleasure to meet and he did recommend a couple nearby establishments we visited next."], ["Reviewed October 19, 2017", 3.0, "Champagne", "My husband and I have been to Napa valley multiple times and each time we come we do at least 1 champagne tasting. Our opinion of Domaone Carneros was that the champagne was good and the atmosphere was gorgeous but of the other Sparkling wine places this was our least favorite. Maybe it was too much of a formal atmosphere or maybe too touristy but we will not be returning. Nothing wrong with the champagne or service, just not worth the drive.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Beautiful stop in Napa!", "The bubbly was only mediocre but the views and friendly staff make this a must-do when in Napa. Even on a hot summer day, we enjoyed the shade and vistas from the shaded porch."], ["Reviewed October 17, 2017", 5.0, "Wine tasting", "Great winery. Nice place to gho wine tasting as you head from Napa to Sonoma. Very nice gift store as well."], ["Reviewed October 16, 2017", 4.0, "Gorgeous views and wines", "This was our third visit to this winery which was packed on Sunday with lots of well dressed young people, probably from SF or Silicon Valley. The winery had clearly become a big business over the years, but the staff were efficient and professional in handling the volume of visitors. We didn’t have a reservation which is recommended but they accommodated with one of the last tables outside with a gorgeous view of their vineyards. Their wines and tastings are rather expensive but worth it, the sparkling made in the French champagne tradition. My husband and I each had a glass of their pink sparkling wine which was fabulous. I bought a bottle. We ordered the cheese platter which was meant to pair with their sparkling wine and it was ample with several pieces each of three types of cheese. And they had gluten free crackers for my hubby!\nShow less"], ["Reviewed October 10, 2017", 4.0, "First Stop in Napa", "The views were stunningly beautiful. The property was amazing. Visually everything you would expect it to be. I has the sampler with 2 whites and 2 reds. All very palatable. We had the salmon, charcuterie and cheese plates to accompany all were very good and of course paired nicely. This was a great experience. The wait staff could have been a touch more attentive, but it was a beautiful day, we were seated outside and it was very busy!\nShow less"], ["Reviewed October 8, 2017", 3.0, "Busy, busy, busy....", "I dealt like I was at a restaurant, not a winery... Not what I personally look for when I go wine tasting, however, other must,as this place was packed. We did get right in though, a wait for outdoor seeting. Nice views, wine was good."], ["Reviewed October 6, 2017", 3.0, "Over the top and not a true tasting experience!", "Yes it has lovely views and a nice ambiance. However as a wine experience I can't recommend Domaine Carneros. One is given a flight of wines with a 30-60 second blurb about the four wines, then you're left to yourselves to work through them. Not once did our waitress return with 'have you any questions etc'. On a warm/hot day our 4 pinots (poured all at once) soon became too warm and alcoholic/unpalatable. The waitress also forgetting our food as well as being questioned by a staff member when I sat down if I had a reservation (despite being taken to our table by the waitress) also left a sour taste in my mouth!\nJust to busy and impersonal. If Im going to spend good $$ on wines, I like to think that money goes to a place that appreciates it!!!\nShow less"], ["Reviewed October 5, 2017", 4.0, "Beautiful Grounds", "This was a pretty cool stop on our trip in Napa. It makes for great photos. Service was pretty good but the highway is fairly close to the winery so it can be a bit noisy sitting outside. Overall I would recommend this as a stop if you’re in Napa.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Great Experience", "Arranged to arrive early and do Champagne tasting with salmon and caviar. View was fabulous, setting was perfect and food and wine were awesome. Great way to start my birthday!"], ["Reviewed October 1, 2017", 5.0, "Go early for wonderful views without the crowds!", "Domaine Carneros is a beautiful French style chateau overlooking wonderfully landscaped grounds. Per advice, we stopped here first thing - it wasn't too busy. Great stop for photo taking. Our server was accommodating of our tight schedule, so that was a plus as well. I'd recommend bringing a sweater, as it can get quite breezy on the outdoor deck they do their tastings on.\nShow less"], ["Reviewed October 1, 2017", 4.0, "Cant beat the view", "We stopped here without a reservation and were promptly seated on the terrace with an exceptional view. The sparkling wines and cheeses were excellent. We were not rushed and our server was very informative. Though the cost of the wine was out of my price range I highly recommend stopping in for a taste.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Fabulous setting fabulous tastings", "We were two couples visiting. We had a friendly greeting and the tour started with a history of carneros and a couple of tastings. We were shown around the immaculate working area. We ended our trip sitting on the patio with superb views sampling more champagnes and the cheese platter. We would certainly recommend visiting. The Château is the exact replica to Tattinger in France. Neil our tour guide was very informative and friendly. An added bonus was he originated from the same home town and one of our friends. As they say “it’s a small world!”\nShow less"], ["Reviewed September 26, 2017", 2.0, "Confusion in the tasting room", "Being an advisor for the catering company that provides food and beverages for a large European airline I was told when I made a reservation, and later, when we arrived by the hostess that we were entitled to 2 complimentory tastings and industry discount on any purchases. After we sat down for the tasting the server told us that the comps only apply for people who work for Napa Valley based companies. Workers in the hospitality industry outside the region only get a 20% discount. This is the first time I experienced this. I understand that they charge the tourists $30 or more for tasting to cover their cost, but people who's job it is to select beverages to be poured on flights and in airport lounges should be treated with more respect.\nShow less"], ["Reviewed September 24, 2017", 5.0, "A must!", "This is probably one of my favorite wineries. A wine region trip isn't complete until I've been to Domain Carneros. It's visually the most stunning winery I have ever been to and the view you get sitting on the terrace is second to none.\n\nIf your a Pinot Noir or a Sparkling Wine buff this is the place for you. The regular tastings are about $30 and you get HUGE pours. Make sure you pair it with one of their cheese plates. So good!\n\nI highly recommend a stop at this winery. I promise you won't regret it.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Wine tasting", "Delicious wine and sides elegantly served in a beautiful setting. It would be best to make reservations. Gorgeous grounds."], ["Reviewed September 19, 2017", 5.0, "Beautiful country setting; great service", "A coworker told us this was the best vineyard in Napa, so we made a reservation for a tasting. The phone call was handled very professionally. We arrived on the day of the reservation and were seated right away. We did have to wait about 10 minutes for our server, but the service was very good throughout. We chose 4 sparkling wines and 4 Pinot Noirs to sample along with a cheese and cracker platter. Wonderful cheeses from other countries...we even debated trying to find them once we got home.\nThe dining room is very beautiful; however, it was a little loud.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Beautiful View", "One of Napa best vineyard. We usually stop by here before we start our tasting tour or end the day here. I like to sit outside and enjoy the beautiful landscape and fresh air. During spring you can see yellow mustard flowers all over the hills and into the vineyard. Its very dreamy.\nShow less"], ["Reviewed September 17, 2017", 3.0, "Just okay", "The view and and grounds were beautiful. Unfortunately our the gentleman who brought us our champagne tasting and cheese plate was not very friendly. Made us feel rushed and like we were bothering him. Too bad cause it was a pretty place."], ["Reviewed September 15, 2017", 5.0, "Great Wine!", "Very delicious wine. Very beautiful chateau with beautiful landscape. Outdoor wine tasting is great minus the freeway in the view. Would definitely recommend this winery as part of your visit to the valleys"], ["Reviewed September 11, 2017", 5.0, "Great Experience", "An elegant setting for enjoying wine and snacks. Visit late in the afternoon so you can sit in the shade and enjoy the view over the valley. We had the premium wine flights and both the smoked salmon and cheese places. Large servings and very tasty.\nShow less"], ["Reviewed September 10, 2017", 5.0, "good champagne", "we had a glass of Champagne with goat cheese and crackers very delicious, breath taking views.....you can see Artesa winery in the distance....I remember when they built Domaine Carneros almost 30 years ago just a beautiful Champagne cellar....go you will love it...Artesa, Liana, De Rosa, Bouchaine, Etude Cuviaison wineries are in the area and are all good, I often taste on my bicycle it is a great area to ride in\nShow less"], ["Reviewed September 10, 2017", 5.0, "Great bubbles and the cheese plate was fantastic", "This is a great spot to enjoy some of the best sparkling wines outside of France. The vineyard is owned by Taittinger and the wines do not disappoint. Superb bubbles and their straight Pinots are very good. We did not book so got an indoor table. So if the weather is nice - call ahead and book!\nShow less"], ["Reviewed September 9, 2017", 4.0, "Wine tasting", "Incredible site, great sparkling and pinots, very full, they have 2 Parking's, huge retail shop, we try almost all they had in the list"], ["Reviewed September 8, 2017", 5.0, "Perfection All Around", "This winery's property is breathtaking! My husband and I stopped here for a wine tasting on the veranda on a beautiful day. We arrived early, but the staff didn't make us wait. We were seated immediately and experienced a perfect day. Settling on the Grand Tasting (2011 Late Disgorged Brut, 2009 Le Reve Blanc de Blancs, 2014 Le Ciel Serein Pinot Noir, and 2014 The Famous Gate Pinot Noir) and the Sparkling Wine Cheese Plate, we sat back and enjoyed the scenery. Our server was knowledgeable and polite without being pushy. She even let us try samples of other wines not on the tasting. We purchased the 2013 Vintage Rose and the 2014 Famous Gate Pinot Noir. Amazing experience! I'd come here often if I lived closer.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Beautiful Property!", "This property is stunning! Our group of four had never experienced a sparkling wine tasting, but we are glad we tried this. After spending the weekend drinking lots of wine, this was a great change of pace. Reservations are required so don’t show up with fingers crossed.\n\nPablo was our tasting host and he was helpful and informative. He had a very pleasant demeanor and seemed happy to answer all of our questions. They have an inside tasting area, as well as an outside patio area. They also have a nice gift shop area in the lobby.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Tasting", "Great views and fantastic bubbles. Our waitress was lovely and very helpful. She had a lot of knowledge on wine, the area and history. We love it here."], ["Reviewed September 5, 2017", 5.0, "Lovely veranda, nice sparkling wine", "We had a lovely sparkling wine tasting here on the pretty veranda overlooking the vineyards. Our server even brought out a couple of reserve tastings for us on the house. We liked the Vermeil Demi-Sec so much we even had a few bottles shipped home."], ["Reviewed September 5, 2017", 4.0, "Nice Wine & Architecture, Lesser Quality of Service", "We stopped in without a reservation but were able to sit on the patio and have a glass of sparkling wine. We also ordered some cheese and crackers. The wines were lovely, and very refreshing on an unusually hot day. The grounds, building, provided a nice backdrop to our experience. The was certainly the most corporate of the wineries we visited, and it showed in the service. We had better service at other wineries in the valley. it all felt very rushed. Also, our waiter did an unusually hard sell on buying bottles; it began 1/2 way through our tasting. As a result, we ended up not buying any bottles.\nShow less"], ["Reviewed August 29, 2017", 3.0, "Good wine but shame about the service", "Fans of Pinot Noir and sparkling white should take a quick stop at Domaine Careneros as their wines are fantastic. Sadly service doesn't match the quality of their wines. We were there (outside) for two hours in 90 degree heat and didn't have our waters refilled once. Descriptions of wines seemed scripted and lacked passion and to finish it off we were given our check with no pen to sign for it - after 10 minutes searching for our waiter (and a pen) we left without tipping!\nShow less"], ["Reviewed August 28, 2017", 4.0, "Excellent patio!", "We stopped in to domain Carneros without a reservation on a Friday afternoon. Although they were busy, we were still able to get a nice table on the patio outside. We enjoyed tasting the sparkling, as well as the salmon and charcuterie nibbles. Overall, a great experience!\nShow less"], ["Reviewed August 28, 2017", 5.0, "A Must in Carneros", "If visiting on a weekend expect it to busy. But it's totally worth it. It's beautiful and the sparkling is so tasty! Luis was our host and he was enjoyable to chat with. We did the sparkling flight and meat and cheese plates. The meat plate was AWESOME. 2nd time here and it will stay a permanent staple to our trips.\nShow less"], ["Reviewed August 27, 2017", 5.0, "The best value tasting we had", "This was the best value tasting we had in Napa Valley as you get full (small) glasses of four sparkling wines to try for $30. Service was warm and engaging. The views of course are lovely."], ["Reviewed August 23, 2017", 5.0, "A walkabout", "We stopped here as we wanted to see this Chateaux close up. It is such a beatiful building and the seating the views around the winery that one see all around it was just great. Sorry we didn't try any wines due lack of time."], ["Reviewed August 14, 2017", 4.0, "A Real French Chateau in Napa", "Go here when you just can't drink another Napa cab. Refreshing change-fun tour and learned a little bit more about champagne. Nice to walk around the grounds and take pictures."], ["Reviewed August 13, 2017", 4.0, "Beauty and Bubbles", "Detour! Had to swing back around to stop at the beautiful vineyard. Bubbles on the veranda, friendly service too. Definite stop! Cheers!"], ["Reviewed August 12, 2017", 3.0, "Ok. Overpriced and pretty.", "Come for the pictures and leave.\nLots of hype for this pretty chateau and Tattinger spin off winery, but it's right off a main highway (convenient , but loud and unsightly). The girl that sat us was short and stuffy. The other staff is not the best (nor are they certified or very educated in the field) and the wines are unique blends but not spectacular.\nTwo sparkling wines stood out:\nthe toasty notes and complex flavors of the 2009 Domaine Carneros Le Rêve Blanc de Blancs we're expensive and overpriced. ($30/glass if not a member. Wow not worth it)\nThe 2012 Domaine Carneros Blanc de Blancs had complex fruit flavors with. Blend of 36% Pinot Gris and 64% Chardonnay.\nThe 2012 Domaine Carneros Estate Brut Cuvée is very busy a\nthe 2012 Domaine Carneros Ultra Brut is super fresh. .\n\nThe 2015 Domaine Carneros Pommard Clone Pinot Noir really sang to me. This lovely, earthy, brambly Pinot Noir gave me everything I want from the variety. These are the flavors I first learned to love in Pinot Noir during visits to the Willamette Valley.\nShow less"], ["Reviewed August 11, 2017", 3.0, "Great view - wines are expensive", "This winery had fantastic views and plenty of opportunities to take photos. You have to have a reservation to get a table on the patio - we did not, but they were able to seat us as it was late morning. We did a wine tasting and while the wines tasted great, they were very expensive. We also order the salmon platter which consisted of smoked salmon and crackers/bread - also expensive. They do not serve soft drinks, only water, so if you go with kids or non-drinkers, hopefully they don't mind water. There are other wineries with better wine and prices, but if you want a view - then this is the place to go!\nShow less"], ["Reviewed August 11, 2017", 5.0, "Tasting our way", "We are members at Domaine Carneros and our host Olga guided us through a perfect tasting letting us decide which wines to taste and making great suggestions that resulted in a perfect experience...highly recommend Domaine Carneros wine club and Olga as host!"], ["Reviewed August 10, 2017", 3.0, "Wines were so so", "The wines here are so so but the prices are higher than comparable wineries nearby like Gloria Ferrier. They have a beautiful patio."], ["Reviewed August 9, 2017", 4.0, "beautiful", "I came here last Sunday with a group of 7 people. We had a reservation and a tasting already pre picked. We had 2 sparkling white wines and 2 red wines. I personally love my red wine as it's usually not as sweet as whites. We arrived around 12pm and the place was pretty packed already but we definitely were happy we made a reservation. The grounds are beautiful at the top of a hill. We were able to find parking at the bottom and walk up the stairs while taking in the view of the winery and vineyards all around. It was quite a fun place. The only complaint i had was with the restrooms. It is a portable building along the side of the main building, it was A/C inside and looked pretty nice for being portable but not sure how often they clean, it definitely had a smell to it.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Gorgeous!!!", "Make a reservation!!! Without you may have to sit inside and miss out on the gorgeous views! The atmosphere is very classy and sophisticated. The winery is know for its sparkling wines although my parents who like reds were able to find glasses they really enjoyed. The champagne flight was excellent!\nShow less"], ["Reviewed August 9, 2017", 3.0, "Good bubbly but...", "Visited Domaine Carneros for a tasting. The bubblies were good but not for the prices. We were seated outside in a no view spot against the building when there were plenty of great spots. There was also construction going on, loud jack hammering that was so disruptive. My biggest pet peeve was the washrooms. I asked at the front where the washrooms were, I was told go into the other room and someone will escort you there, went into the other room and they said go to the front and check in, I told them I had. They said ok wait here and someone should be back sometime to take you to the washrooms. Not good... at a winery you need proper washrooms, I ended up leaving because I waited for 10 minutes with no washroom escort. Would I go back, probably not.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Exceeded our expectations!", "Lovely and with a very knowledgeable server Francisco Started a little rough with knocking over my water glass but he quickly made amends with a wonderful flight and then some. We'll stop here again on our way out of town this week!! ❤️🥂"], ["Reviewed August 4, 2017", 5.0, "Great bubbles and more", "We stayed away from the large corporate wineries but this one has an impressive chateau and lovely grounds. Lots of photo opportunities. Loved the whole tour and tasting experience from start to finish. Staff was great and the sparkling wine divine. That's what we came there for and they delivered with flying colors.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Our First Stop Every Napa Visit", "Our routine, every time we visit the Napa Valley, is to stop at Domaine Carneros on our day of arrival, before we check in to our hotel. The chateau is gorgeous, and the large outdoor terrace the perfect place to relax, unwind, enjoy the beautiful views and sip fabulous sparkling wine. We each had the sparkling wine sampler and shared the sparkling wine cheese plate. My husband couldn't pass up the flight of caviar which he thoroughly enjoyed. When we can manage to, we also stop here as our last winery visit on our way out of Napa.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Bubbly Experience", "Great estate wine experience by the California version of Tattinger. The sparkling wines were great. The views are amazing and the wine guides were quite knowledgeable!\n\nBe careful in the gift shop. My wife found more than $400 worth of unique wine gifts she \"had to have!\"\nShow less"], ["Reviewed July 27, 2017", 5.0, "Great champagne with an amazing view", "Not only is this place gorgeous - the grounds are so well manicured with amazing plantings - the building you would swear was straight out of France- did not do the tour but did have a great glass of Brut on the veranda- it was great and it is such an excellent place to view the valley- great spot to take pics of vineyards. Elegant place and one of the best gift shops- not a huge shop but has lovely items. Great sparkling wines available for purchase or wine club.\nShow less"], ["Reviewed July 26, 2017", 4.0, "Beautiful and Tasty", "The setting cannot be beat. Like a movie set with the rolling hills of wine country you sit on a patio sipping bubbles and take it all in. I suggest before your visit ,driving the hillside behind the entrance to really see the vastness of he CA wine trade. Reservations are a must and the staff is efficient in getting you seated and wine in front of you quickly. The the bubbles are very good paired with a cheese plate.\nShow less"], ["Reviewed July 24, 2017", 5.0, "View and Sparkling Wine Unmatched", "I can not wax-poetic enough about the tastings at Domaine Carneros. It's the best sparkling in the US, imho. The view is beautiful. Time your tasting to end or beginning of day to avoid crowd and maximize weather. Staff is very professional. Olga is always a kick if you get her. The fake sheep are gone from across the street, but oh well, nothing stays forever.\nShow less"], ["Reviewed July 24, 2017", 5.0, "LOVE LOVE LOVE!!", "Whenever we go to Napa Valley, we always stop here! It is amazing! The venue for Domaine Carneros is gorgeous and is great for photo ops. They also serve delicious non alcoholic drinks so it is a great place to go for the entire family. We recommend this winery.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Fantastic Grand Finale of our Napa Weekend!", "Our group of twelve, family and friends, were in the Napa area to taste and learn more about the wines of the regions. Domaine Carneros was our finale stop on our last day together. What an excellent end to a great weekend of fun. Jean-Claude was our guide, and you know it was a great time when hugs were shared all around with this kind, smart and funny man before we left. In fact, they had a hard time getting us out of there because we were having so much fun. I was the reservation maker. It was a snap to make the reservation, and upon arrival, they knew exactly who we were and whisked us off to a tasting room to begin our tour and tasting. Jean-Claude immediately poured us all a glass of their wonderful bubbly and after a toast - and with a glass of champagne style wine in our hands, we began our tour. Jean-Claude is fascinating to listen to - he is one of those professors (he is a retired prof) that if he taught the phone book, I would take the class just to hear what he had to say. He easily fit in to our group ranging from some newly-minted 21 year olds to those of us in middle age. There were breaks throughout the informative tour to refill glasses and try other wines. I am a fan of Taittinger wines, so I loved learning about the process of making the wines in the champagne style and even about the variances in climate between Napa and Champagne. The cheese plate and Pinot Noir that ended the tour were excellent. Several of us joined their wine club because we were so impressed with the quality of what we were drinking. As I say, we were having so much fun that we didn't want to leave. Jean-Claude arranged for us to stay in a nice air conditioned room (it was a weird weather weekend in Napa with temps over 100 degrees that day, outside was not pleasant!) and helped us pick out a couple of bottle to open and enjoy. I would love to go back when the weather was more agreeable to enjoy the beautiful views off the front terrace with a glass of bubbly. I would highly recommend reservations during the busy summer season and the tour and tasting that we did. Everyone we come in contact with on the staff was friendly and agreeable. We want Jean-Claude and his wife to join us at all our future parties!\nShow less"], ["Reviewed July 23, 2017", 5.0, "Beautiful views & great sparklers", "This stunning winery offers sublime views and samples of excellent sparkling wines from their sunny terrace. It's a great place to begin a day of winery tours - or just relax and take in the scenery with a great glass of sparkling wine."], ["Reviewed July 23, 2017", 3.0, "Beautiful place but very expensive.", "Very high end winery with a beautiful chateau style building tasting are very expensive at $30 for 4. Nice outdoor and indoor seating but is more expensive than most in the Valley. Focus of winery is on champagne as well as some very good Pinot Noir's. Good knowledgeable staff who are very helpful and pheasant.\nShow less"], ["Reviewed July 22, 2017", 4.0, "Great tasting for sparking wines", "All round good experience. Was surprised by the high prices in general at many of the vineyards, especially when you compare them to South African vineyards. I was worried at first that it would be very formal based on the brochure, but pleasantly surprised at the relaxed easy going atmosphere. Staff were friendly, attentive and also gave you space with no pressure to purchase. They have good views despite the main road in front. I would highly recommend this vineyard, especially if you only have time for 1 or 2 tastings when visiting Napa. Thanks to the team for a lovely afternoon!\nShow less"], ["Reviewed July 20, 2017", 5.0, "Best Tour!", "We had an amazing time at Domaine Carneros! Our tour guide, Jean Claude, could not be beat! Informative and entertaining tour of this amazing facility. The sparkling wines were top notch and we loved the rose and Pinot noir. The only negative was the restroom situation which is outside and basically porta potties-very nice porta potties but still. I would definitely go back to this Winery.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Beauty and bubbles", "Gorgeous location. Delicious sparkling and bubbly wine. Yummy cheese and fruit trays. Absolutely worth a stop."], ["Reviewed July 19, 2017", 4.0, "Splendid views", "Great selection of sparkling wines! Wonderful outdoor sitting area with a view of the vineyards. Good service. Friendly staff. Only gripe - attention needs to be put on clearing the tables of food and drinks quickly because of the birds that tended to flock to the tables.\nShow less"], ["Reviewed July 19, 2017", 3.0, "More like a restaurant than wine tasting", "French inspired building. Decent outdoor views but not fantastic. Sterling for example, offers a much better view. Waiters will bring you to your table before presenting you with a menu. There are no free tasting. We had a $40 tasting menu which consisted of 2 sparklings and 2 reds, each about 2oz in volume. So $10 per half glass of wine. Cheese platter about $25-$35. Sparkling grape juice is $6. And because you are being served, you are expected to tip. So it cost us about $90 in total. Definitely like being in a restaurant rather than a winery wine tasting.\n\nI would not return as I find the pricing ridiculous for a fact that you're right at the source of production and they are charging you $10 per half glass.\n\nIt's amazing that the winery is able to charge more than full price in this manner though. I guess people suck up to the French ambience so I do see quite many people dressed up.\n\nIf you want to see and be seen, this may be the place for you.\nShow less"], ["Reviewed July 18, 2017", 3.0, "Great View. Great wine. Too touristy!", "We love wine and we wanted to go explore some vineyards while in Napa/Sonoma California. We heard about Domaine Carneros through our appreciation for Taittinger Champagne. Domaine Carneros is part of the Taittinger family of brands. The castle on a hill is incredible! The view of the ornate property is amazing. But when the parking lot has room for buses you know that this is all a good show. If you want to have a nice meal with great wine...go ahead. Enjoy (especially on a bright sunny day overlooking the property sitting under an umbrella at your patio table)!! However, if you just want a tour of a vineyard or to purchase some good wine, plan on a few hours. It is crowded and you have to wait your turn (unless you are of the fame and fortune crowd...and there were a few when we were there). Either way, it is a place to visit. Just don't mind us tourists....\nShow less"], ["Reviewed July 16, 2017", 1.0, "Pretentious winery with snobby receptionists", "Great location, nice view, a good spot for a wine tasting with food pairing. Well that was the plan until our experience with the receptionists who tried to seat us at a small table against the wall while more then half the regular 4 person tables are open. The other receptionist sat 2 people at one of the regular table while ours insists they have to save the regular tables and force us to sit in a small table by the walkway. So a nice afternoon of wine tasting with food and nice view got ruined by this bad experience.\nShow less"], ["Reviewed July 16, 2017", 2.0, "Beautiful but overpriced", "When you go to the larger wineries, you know you will lose out on the personal touches but this was a waste of time and money. Too busy to be able to provide any service and the wines are over rated."], ["Reviewed July 14, 2017", 5.0, "Beauroful", "Beautiful vineyard with lots of great sparkling wines. It is a gorgeous chateau with beautiful views of the rolling hills of Napa Valley."], ["Reviewed July 13, 2017", 5.0, "Gorgeous way to start the day!", "We had stayed overnight in Napa and headed out in the morning to hit some wineries in Sonoma. Someone had suggested DC to us and we decided to check it out since it was one the way. GREAT decision! Their specialty is sparkling wines, so it is the PERFECT way to start the day. We each had a glass of bubbly on their gorgeous patio overlooking manicured gardens and vineyards. Wish I could start all my days this way..\nShow less"], ["Reviewed July 11, 2017", 5.0, "Fantastic Property, Excellent Sparkling!!", "The connection to Tattinger is unmistakable when you arrive at the property with the French Chateau inspired winery followed by the excellent sparkling collection. All 4 that we tried in our tasting were above average and only personal taste made one preferred vs another.\n\nDefinitely a must stop on your visit to Napa\nShow less"], ["Reviewed July 10, 2017", 5.0, "Best champagne tour in Napa", "The tastings are very generous, a little crowded in the summer but very worthy. Beautiful grounds and wonderful service."], ["Reviewed July 9, 2017", 4.0, "Beautiful place, great wine, but full of tourists", "This is a wonderful winery with a beautiful estate and some nice sparkling wine. Unfortunately, these great things also mean that they are a huge tourist attraction which takes away from the calm, laid back winery vibe."], ["Reviewed July 8, 2017", 5.0, "Nice views", "Great views and terrace to sit and sip the sparkling wine. We would visit again. Stands out as a must visit from our wine tour of Napa and Carneros."], ["Reviewed July 7, 2017", 1.0, "Thankfully Desiree can't spoil your view or your wine, but don't let her spoil your reputation!", "Having visited this Estate on several occasions throughout the years with a lovely view and lovely service by the likes of some of your greats like Elvis and Peggy, it appears as if they have a new Sheriff in town named Desiree. Our own experience was totally unacceptable and something we have never experienced at any winery before including the previous times we visited here. Had we not witnessed others experiencing the same discontent we would have taken it personally, however, this is the new Domaine Carneros. And it is not just the customers who seem bullied by Desiree, Karla seemed to be her pawn to do the dirty work by asking customers (with reservations) to move two and three times and We as were also told by our Server that he was limited to what the \"girls at the front\" told him to do, which in this case was Desiree. I spoke with the Manager, Jeff, on duty who also seemed bound by Desiree. When I called to cancel my longterm account as a Chateau Society Member the woman on the phone told me that I was not her first call about Desiree. Too bad such a beautiful spot is being spoiled by one bad apple. I hope someone with some vested interest in the well being of this Estate steps. Thankfully Desiree can't spoil your view or your wine, but don't let her spoil your reputation!\nShow less"], ["Reviewed July 5, 2017", 5.0, "Go early!", "Great views and bubbles as everyone likes to say, but go early! We had reservations right at 10am and the place was packed! Sit outside on the patio to overlook the vineyard. Would be a good place for a special celebration or bachelorette party!"], ["Reviewed July 5, 2017", 5.0, "Great Sparkling Sampler!", "First of all, we loved the look & view, the place, the champagne! The service was excellent. We choose the Sparkling Sampler because we were driving to our hotel at 1:30 pm and felt we wanted something refreshing. It was perfect! Our favorite choice was the Vermeil Demi-Sec. They also give you like two extra special tastes. Highly recommended!\nShow less"], ["Reviewed July 5, 2017", 4.0, "Gorgeous Views", "My husband and I made this our last stop and the views did not disappoint. We both did the sparkling tasting and ordered a cheese plate to accompany it. The wines were pretty good and the cheese selections were tasty, but the views are what you want to come here for. It was crowded on the terrace, so I would recommend a reservation.\nShow less"], ["Reviewed July 2, 2017", 5.0, "you may think you are in the french country side", "One of the things to enjoy is sitting on the patio on a sunny day tasting either a wine flight or a champagne flight. or bottles with a cheese and meat plate to go with it you will enjoy the experience every time you go back . Being a member brings the discounts on all the things you buy well worth it\nShow less"], ["Reviewed June 29, 2017", 5.0, "Impressive Property", "The place to hob nob and be seen. The property is outstandingly beautiful. Great wines and elegant crowd. We didn't stay long but I recommend the cheese plate along with some champagne."], ["Reviewed June 28, 2017", 4.0, "Gorgeous grounds and wonderful champagne!", "The site as you pull up is amazing. Would highly recommend reservations. All different kinds of Champagne with different cheeses and plates to choose from. Wait staff was too notch. Extremely knowledgeable and friendly. So relaxing and peaceful . Could have stayed for even longer! Only small thing that was bothersome was that the Bathrooms were under construction and were a little gross.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Lovely patio!!", "Beautiful property. Great wine, great service. Will definitely visit again! Service was a little slow."], ["Reviewed June 25, 2017", 5.0, "Perfect morning stop!", "Stopped by Domaine Carneros because I adore bubbly! The drive from Napa downtown was scenic and quick. We stopped by early (10:30 am) and we were able to score a table on the patio with a shade umbrella without any problem and without a reservation. Service was excellent and attentive despite what other reviewers have experienced. Perhaps this was because we were there early in the day before the major rush. Time and attention were given to explaining the different bubbles in the flight. The sparkling wines were excellent (greatly exceeded my expectations, particularly the Blanc de Blanc and La Reve), as was the cheese plate. The view was breathtaking, and the whole experience was lovely and relaxing. Great change of pace after a couple days of touring multiple wineries. Highly recommend, but go early. Things definitely started getting busy by 11:00.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Beautiful winery - best sparkling", "This is one of the most beautiful wineries you'll find in the Napa Valley. It is always such a treat to go there and sit on the terrace and look at the views of the Napa Valley. Everybody that works there is so kind and so good and attentive. Plus the small plates of food that they offer go so well with the sparkling wines. How can you beat sparkling wine and caviar or sparkling wine and smoked salmon?! I just love this place!\nShow less"], ["Reviewed June 23, 2017", 2.0, "Terrible.", "We were in Napa for short winery trip. Having done Okanagon and Niagra on the Lake regions in Canada were excited to try Napa and Sonoma. Most of wineries here were enjoyable and laid back. Nothing positive at this place tho. Made a resrvation ahead of time. Once seated on the patio our server couldnt have cared less, attending to the other tables. Poured the $$ samplers and left without deacribing the wines- I suppose the laminated sheet describing the flight sufficed. 3 tables who were sat after us got served their wine & cheese plate well before us (after we ordered). Towards the end, he started rushing us all off the patio because there was an event maybe later that night? Was not even closing hour yet. But if that wasn't all the kicker, it was the fact their inside washrooms were being renovated and guests needed to use the outdoor fancy port a potties. I've used those at weddings and usually decent and that would be ok. These ones- tho -- never thought I would prefer to die holding my breath then trying to use these toilets-- in need of some TLC. Overall, wine good--experience I'd rather forget.\nShow less"], ["Reviewed June 23, 2017", 5.0, "A must stop", "This was the most beautiful place we visited in Napa and relaxing! Recommend highly! We arrived and got a table inside that overlooked the valley. We sipped on brut which was wonderful and shared the sparkling wine cheese plate-great experience!"], ["Reviewed June 19, 2017", 5.0, "Beautiful place", "This chateau has an amazing view from the terrace and all around. The best recommendation is make sure to do a reservation with plenty of time. They have an excellent choice of wine."], ["Reviewed June 19, 2017", 3.0, "Good place for afternoon tasting", "This is a nice place to taste some sparkling wine with a great view.enjoyed it but not for the serious taster"], ["Reviewed June 19, 2017", 5.0, "A trip to Napa is never complete without a trip to Domaine", "From the beautiful chateau like structure on the hill to the champagne tearing, this place is special. I enjoy sitting on the front porch, though members sit in a courtyard in the back. Love La Reve !!!"], ["Reviewed June 19, 2017", 2.0, "Started off rocky", "Beautiful grounds and fabulous drinks. They told us 4 times you must spend $30 a person. Thank you we got it the first time. A party of 12 people I do t think that should be your top priority. NOW thank you to Jake our server he changed the entire experience from bad to awesome. He really made us feel wonderful and like it wasn't just about the dollar. Would I go back? For the views not the attitude.\nShow less"], ["Reviewed June 19, 2017", 3.0, "Nice view, but a renovation miss", "Domaine Carneros's sparkling wines are a fun addition to a more traditional wine tour, but not the best wines you'll have in Napa, for sure. The setting was nice and the food options were impressive. We ordered charcuterie, cold salmon and a selection of cheeses and all were nice. Generous portions too. Three stars comes from their foyer/gift shop smelling like a bathroom! Their bathrooms are under renovation so they've set-up temporary restrooms outside, which is fine, but they need to do something about the smell they've allowed into the building as they renovate.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Sparkling with a view!", "Beautiful facility. If you are not a sparkling fan come for gardens and view. If you are a sparkling fan then you are at the right place! Great location and perfect place to begin your Napa experience! knowledgeable staff"], ["Reviewed June 14, 2017", 5.0, "Beautiful afternoon with good food", "The place is beautiful the food and wine amazing and the service it pretty good. Nice option for a relax afternoon"], ["Reviewed June 13, 2017", 5.0, "Incredible experience", "We were with a large group, and therefore had a reserved table with our tasting flights pre-ordered. Beautiful views all around. The staff was very knowledgable about their wine and the wine-making process and were able to answer all of our questions. We spent several hours here, and most likely could've stayed even longer! Highlight of our Napa trip.\nShow less"], ["Reviewed June 12, 2017", 4.0, "Sparkling visit", "Good quality sparkling wines served in a traditional French chateau setting.Probably busy all week/year but runs like a well oiled machine"], ["Reviewed June 11, 2017", 5.0, "The Best", "The view and wine is the best. I've been going there for over 10 years. It has the best tour of any of the sparkling houses."], ["Reviewed June 11, 2017", 3.0, "Great chateau, ok wine, so-so customer experience", "We had to wait approx 10 min for a waiter to come to our table once seated and the experience of waiting for service was consistent throughout or stay. Our waiter/sommelier did not seem to be passionate about telling us about the wines. No one tried to sell us wine either, seemed more interested in getting us from the tables to serve another party as soon as possible. Great premises, ok wine, but could work on customer experience.\nShow less"], ["Reviewed June 11, 2017", 1.0, "Worst service in the valley", "Its a real pity that such a beautiful place is over shadowed my its terrible service. i took my mom and aunt here to celebrate my moms birthday, the hostess was nice enough though she looked very tired when we approached, we were seated in direct sunlight and had to request and umbrella for shad. After 10 min out server Richard showed up, he is the rudest most unqualified person I've ever been waited on. not only could he not answer any of our question with any kind of depth but he treated us like we were inconveniencing him by sitting down. I could go on but suffice to say it was a horrid experience. I will not return nor would I ever recommend coming here.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Great Girl's Trip Outing", "We stopped by Domaine Carneros on a Saturday in June and boy was it crowded. I made reservations and we had to wait a bit to get seated but it was worth it. Our server, Paublo, was great, a little dry at first because it was so busy but towards the end he gave us a free birthday pour of Le Reve, which was amazing. I love sparkling wine and they give you 4 nearly full glass pours. The grounds are beautiful and great for photos. It's worth the $30 tasting fee so definitely stop by while in Napa\nShow less"], ["Reviewed June 2, 2017", 5.0, "Great!", "Loved this place. I think her name was Peggy! She was great. Wine tasting was good, views were amazing"], ["Reviewed May 27, 2017", 4.0, "Beautiful Winery and Wonderful Tour", "It's great that this winery has plenty of parking because it attracts a lot of people! The chateau and its grounds are lovely! We were able to sit at a table at the terrace while waiting for our tour and it was nice that our server didn't pus us to order drinks. Instead he offered us iced water and nuts! That was terrific service! And our tour guide was just as pleasant. Jana was very knowledgeable, funny and efficient. We had about seven tastings throughout the tour and at the end, we were served cheese, crackers and dried fruit to finish off the last red wine tasting. So, so impressive!\nShow less"], ["Reviewed May 25, 2017", 4.0, "Fantastic Fizz", "Well, call it Champagne and someone might correct you, but I can attest these bubbles are delicious. Made in the traditional method, these sparkling wines are among the best California has to offer.\n\nAlso available are small lot Pinot Noir and Merlot for those that only drink red wine.\n\nOrder a cheese and charcuterie platter, soak in the panoramic views of rolling vine covered hills; one could easily spend an afternoon here. Be sure to call ahead, tastings are by appointment only.\nShow less"], ["Reviewed May 23, 2017", 4.0, "Sure its lovely, but they quickly move you in and out.", "The 'Winery' was built very recently. It is beautiful, but its not a place where they allow lingering. $30 each sampler and $19 for a Chartuterie was OK, but it would have been nice if we were seated without waiting 15 minutes."], ["Reviewed May 23, 2017", 4.0, "Enjoyable tour and great champagne", "We took a 90 minute tour with tasting. It was a fairly large group, but our guide was fun and answered any questions. We got to taste 5 wines throughout the tour which ended in a tasting room where private tables were set up with snacks. The wines were delicious and we got to try the higher end bottles.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Wedding Anniversary Celebration", "Fantastic place to sit on the veranda and enjoy the beautiful scenery of Napa Valley. It is great to have a flight and try the different the different sparkling wines. We will return!"], ["Reviewed May 22, 2017", 3.0, "Beautiful chateau - a must stop, but don't expect a lot of attention or information.", "This chateau is beyond beautiful and perfect for that Napa picture. Make sure to schedule a tasting for the patio. We tried the sparking flight, red flight and cheese pairing. The cheese from Cowgirl Creamery - phenomenal. The sparkling flight was good, but I still prefer Mumm (maybe because the people are a bit more attentive there). The reds were so-so. The experience is very straight forward - your tasting notes are on the card presented to you and you'll get very little attention from your taster if it's busy (which it usually is). Good news is you can split a flight so you don't have to drink 4 glasses of sparking line.\nShow less"], ["Reviewed May 21, 2017", 4.0, "Fun start to our trip", "At the suggestion of a friend we started our trip at domaine carneros. The chateau is gorgeous and the sparkling wine and Pinot were good. The view is also amazing! Our only issue were the birds but our server said they usually weren't this bad."], ["Reviewed May 20, 2017", 5.0, "Sparkling all the way", "Great experience. Had sparking wine tasting. Great wines. Great views. Great service from Francisco, who made the experience more enjoyable."], ["Reviewed May 19, 2017", 5.0, "A must if you are in the area", "this was not our first time at this beautiful property. I am a lover of french champagne, with allergies to most Califonian wines, but, this one i can have. LOVE IT."], ["Reviewed May 17, 2017", 5.0, "Great winery to visit in napa", "We are so glad we carved out the time to visit Domaine. The grounds were beautifully manicured and the view was breathtaking. We were able to sit and sip on the porch, and it was such a great tasting. The sparkling wines were great....different from all the other tastings we had. Highly recommend!\nShow less"], ["Reviewed May 16, 2017", 5.0, "Wonderful!", "Great place to visit. Our tour guide was really fun and the bubbly wine was delicious! Highly recommend this place to visit!"], ["Reviewed May 16, 2017", 5.0, "Jaw dropping", "This place offers a fabulous view to their vineyards; their location is a chateau(castle) style and very inviting. Great service. This is a place to sample champagne and very good quality and good taste. Their cheese boards were my favorite, particularly the cheese, oh my, yummy.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Great experience", "It was a great experience. Awesome peppery. Got to know the entire process of wine making. They have 3 tours of 90 mins each everyday. Children are not allowed on the tour."], ["Reviewed May 2, 2017", 5.0, "Always a great stop!", "As Gold members, we always make a point of stopping here for \"lunch\". We had the cheese and salmon platters, plus the sparkling and red tasting flights. Live this place with their great view!"], ["Reviewed May 1, 2017", 5.0, "Sparking wines", "You do need to reserve ahead for their tasting. We had a lovely tasting of their sparkling wines outside on the veranda overlooking the vineyards. It's a lovely estate but it is located near the highway so you will have the hum of traffic present. They do offer a cheese plate if you wish to order with your wine. Our server was kind but did not spend much time with us. It was a very relaxed atmosphere in which to take your time and enjoy their very generous pours. I thought the taste was grand for a sparkling wine.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Best sparkling in California with the best view", "Cavier, champagne, charcuterie and ambience. Built after Versailles in France and heavenly. Eileen Crane head winemaker was voted most influential woman in napa valley"], ["Reviewed April 26, 2017", 4.0, "great if you like champagne", "Last of our trip to Napa as was on the way back to San Francisco. Had champagne/mixed wine tasting as I don't really drink much wine, only white or champagne. Saw many event type parties, there, engagements, bridal shower type stuff, birthdays. Sat on very large terrace, had champagne/wine tasting with husband and a cheese platter plus charcutterie platter for lunch. Beautiful spot to take pictures\nShow less"], ["Reviewed April 26, 2017", 5.0, "Elegant Building and Service", "We sat outside and enjoyed the weather and the wine tasting. The bubbly was excellent. The food was excellent as well. The caviar and bubbly were prefect together. If you enjoy champagne at an elegant location, this is right location for you."], ["Reviewed April 26, 2017", 5.0, "A must go to whether visiting wine country or if you live here!", "On 1st glance it looks like a castle on a hill. Up close? Same thing! From the amazing steps up where you're surrounded by a small man made lake, flowers and the trees you also have a direct view to vineyards as well. Walking around inside, listening to the servers explain the bubbly & history is easy and relaxing. All budgets for tasting & buying + the VIEW from the patio area = a great, relaxing experience.\n\nThere are other wineries in striking distance as well: Cuvaison across the street (higher end Chard is specialty, fantastic grounds and tasting room) and Acacia around the corner (fun, friendly people, relaxed tasting room near barrels + great wine deals) so you can spend a couple of hours in the same general area.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Bucket list, great find beautiful grounds and bubbles", "Gorgeous location and architecture, love the bubbles and the service, great vibe and view, also good service."], ["Reviewed April 21, 2017", 3.0, "Ladies trip!", "One person was a member so we got 2 free tastings. We asked them to bring us all 4 tastings so we could select our favorite. We chose 2 bottles of their Rose' which is their best champs in our opinion! We enjoyed our wonderful view in the patio! The service should have been much better we felt ignored and thirsty! I guess the server thought a group of 7 women might not tip well but what he got wrong was that we actually do tip well as a few of us are former servers and a 29% tip is minimum even for bad service ! Don't judge! We had fun regardless and it is a vineyard we'll come back to again!\nShow less"], ["Reviewed April 20, 2017", 4.0, "Who doesn't love Bubbly??", "Our first stop in wine country was for my favorite... Sparkling! Domaine Carneros was located in a picturesque location. We visited in the morning; however I think this would be better as an afternoon snack and refreshment."], ["Reviewed April 19, 2017", 5.0, "Sparkling Wine Tour & Tasting", "Excellent! Neil, our tour guide and wine educator, was phenomenal. We learned a lot and tasted extraordinary sparkling wines and Pinot Noirs. This was our favorite tour because we saw start to finish how they make their sparkling wines."], ["Reviewed April 16, 2017", 4.0, "Awesome Building, Setting & View", "We recently moved to Sonoma and were recommended to Domaine Carneros due to the sparkling wines and venue. We were blown away by the gardens, setting and vista. The French influence is obvious! We had reservations. All of which appear to be seated tastings at tables, either indoors or out. The tasting and pairing selections are varied and, for us, pricey. Today, we were hosted indoors by Nick who deserves 5-stars. We highly recommend this experience, at least once.\nShow less"], ["Reviewed April 16, 2017", 4.0, "Plenty of Bubbly", "The Domaine Carneros experience is more like the typical vineyard tour in Napa, however the addition of the patio seating area makes it seem a little more special. There are plenty of flight options (some even include non-sparkling varieties produced by D.C.) at different price points. Our server was quite knowledgeable and engaging, but at times I felt more like I was at a restaurant than a winery. Behind the scenes tours were not available even when booking more than a week in advance (maybe due to time of year) which was disappointing as we wanted to understand the sparkling wine process. Overall nice experience with good views of the valley.\nShow less"], ["Reviewed April 15, 2017", 4.0, "Easter weekend in Napa", "I made the appointment almost two weeks in advance. We enjoyed sitting in the terrace on a Saturday. We considered joining the membership but couldn't decide so we didn't."], ["Reviewed April 11, 2017", 5.0, "Great venue with great bubbly", "We started our Sunday with Domaine Carneros. It was a wonderful venue with a great flexible tasting of bubbly."], ["Reviewed April 10, 2017", 5.0, "Rose all day!", "This winery was beautiful! We went this past weekend for a bachelorette trip and the tour was the perfect pace. Glasses were never empty and the tour was interesting! It's hard to keep 14 girls all on the same track while drinking wine but it was perfect. Will definitely go back if ever in Napa again. The grounds were beautiful and the perfect place to take pictures before and after the tasting. We loved ever second of the tour! Many bottles of Rose bought from here, no regrets!\nShow less"], ["Reviewed April 10, 2017", 5.0, "Always a favorite when in Napa!", "I have been to Domaine Carneros many times over the last decade or so and I am never disappointed. The view from the veranda while sipping bubbly or one of their delicate wines is pure heaven. The staff is always courteous and helpful."], ["Reviewed April 10, 2017", 5.0, "Expensive, excellent and tasty - superb", "We were advised to go here by friends and we were so glad we did. The sparkling wine is superb and the cheese and charcuterie plates, although small are to die for! The view from the terrace was delightful and the staff were very informative."], ["Reviewed April 10, 2017", 4.0, "First Timers Need to Visit: Can't Beat the View", "Is it your first time visiting the Napa Valley and Sonoma? Taking a first-time visitor with you to wine country? Then Domaine Carneros needs to be on your must-do list. I love sparkling wine but don't drink it as regularly as I probably should (I'm a fan of big Napa reds), but this place serves up some seriously good sparklers. It's not my favorite (I'm partial to the offerings at Mumm), but the views are stellar and are, quite frankly, unbeatable.\n\nYou can make an advanced reservation online (which I highly recommend) for a table outside on the large terrace. Your tasting will have table service and sweeping views of the adjacent vineyards. It's a photo worthy experience and one that is sure to impress. The winery offers tastings in flights (where you get mini samples of several different wines) or you can purchase wine by the glass. They also sell caviar and pretty cheese plates. Expect to spend anywhere from $25 up to $75 per person.\n\nThe winery is built like a French chateau and the grounds and landscaping is truly gorgeous. There's a nice little gift shop too, and I've never felt rushed here which is a big plus. Try to come early in the day (around 10 am) to avoid crowds, as most people want to hang out here late in the day or around sunset.\n\nParking tip: don't park on the lower level in front of the chateau if you aren't physically equipped to handle steep stairs. If you drive around on the left side facing the front of the winery, there's a \"secret\" upper level parking lot that's stair-free. A great tip if you are traveling with an older person or someone who has a physical disability.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Lunch With a View", "This was an interesting structure purched on the side of a hill surrounded by vineyards. The wine tasting was reasonably priced and the cheese plate was matched well with the wine. This was a fun stop."], ["Reviewed April 9, 2017", 5.0, "Best winery tour!", "We celebrated our 40th birthday at Napa and visited Domaine Carneros as our first winery tour! We had reservations for tasting and Nick our server was phenomenal! We ended up buying 12 bottles of wine!! This is the only winery that gave our tastings for free because we bought wine! Best deal, and beautiful setting!\nShow less"], ["Reviewed April 6, 2017", 5.0, "Love Domaine Carneris", "If you like bubbles or great Pinot Noir, this is a must. Views are great... make this your final stop for a real treat."], ["Reviewed April 3, 2017", 3.0, "Disapointing visit", "I am a lover of \"bubbly\" but was a bit disappointed with our visit to Domaine Carneros. After visiting some smaller, family owned wineries, it felt a bit like we were in a cafeteria for our tasting. It was raining, so perhaps on a nicer day when you're able to taste on the terrace, it would have been a different experience. Felt very impersonal and hectic. Beautiful winery and grounds though - worth a stop on a nice day for the view.\nShow less"], ["Reviewed March 31, 2017", 4.0, "Absolutely Stunning!", "My best friend and I visited Domaine Carneros while on our Flex Wine Tour and we felt like royalty being there. The place stands out beautifully from the road, then when you pull up there's stairs leading up to the main Domaine with breathtaking views while walking up. The winery specializes in sparkling wines, which isn't my thing but it most definitely became my thing. We enjoyed a tasting and selected one from the tasting to purchase. The place is absolutely stunning, the service was alright not the best out of the nine wineries we visited during our Napa Valley stay but we were sure happy we experienced it.\nShow less"], ["Reviewed March 30, 2017", 4.0, "Great bubbly and grounds!", "We stopped in to Domaine for the bubbly. It didn't disappoint. Between the four of us, two did a champagne tasting and the other two did a Pinot Noir tasting. The tastings we did were at the tables outside with information cards (see pictures). It was a nice break from the sometimes rushed tasting at other wineries, but definitely less of a personalized feel.\n\nTheir building and outdoor patio are beautiful. This is a great stop if you like bubbly or Pinot Noir. Our server was a little disengaging, but not enough to ruin our trip.\nShow less"], ["Reviewed March 28, 2017", 5.0, "Beautiful view and Bubbly", "I thoroughly enjoyed the tasting, both because of the bubbly and the beautiful view. It was a great start to our day."], ["Reviewed March 26, 2017", 5.0, "Getaway Getaway with my daughter", "I drove up from Santa Cruz for a quick little getaway with my daughter. Even though it rained the whole way up, it didn't damper our visit. As we drove onto the property, the grandness of the winery was stunning. The grounds were impeccable, lush and green. We didn't have a reservation but we're accommodated right away. We thoroughly enjoyed our tasting and will come back again.\nShow less"], ["Reviewed March 25, 2017", 5.0, "Fantastic tour and dinner!", "Our group visited for dinner and tastings and were blown away by this place. A French chateau was built on a hill overlooking the valley with lovely views of the vineyards surrounding us. Immediately upon arrival we were given samples of the fantastic sparkling wines that are produced here and the fabulous Pinot noir as well. While we listened to our invited speaker, the chief vineyard manager, we were offered exquisitely prepared appetizers like a pear salsa served on radicchio, bacon wrapped dates with goat cheese, and cucumber with smoked salmon. Then onto dinner with a fall apart tender short rib and fluffy light potato mash and carrot and parsnips. Overall a amazing flavour experience paired with exceptional samples of their finest wines. I wish I lived close by so I could visit often.\nShow less"], ["Reviewed March 20, 2017", 4.0, "It was ok", "The chateau is beautiful but some of the staff were not really friendly. Our server gave us an excellent experience. Wine varieties are limited."], ["Reviewed March 14, 2017", 5.0, "Beauty, Birdies & Sparkling Wine!", "Fantastic experience at Domaine Carneros...a MUST stop if you're traveling through Napa! The wine tasting was informative and delightful. The building is beautiful and the little birds complete your visit :) Cheers!"], ["Reviewed March 11, 2017", 4.0, "Lovely Visit", "We were in Napa for a couple of days, and some friends from San Francisco drove up to spend the day wine tasting with us. We began at Domaine Carneros. It was lovely--the setting is stunning, with a very impressive building atop a hill. The weather was relatively mild during our visit, and so we sat outside; thus, I cannot comment much on the vibe on the inside. It was wonderful to enjoy the wines on a beautiful patio. Our table was ready at the reservation time, and the service was attentive. They focus on sparkling wine; a couple of members of our party had a glass, and a couple had a flight. All of the sparkling wines were of high quality; of course, we liked some better than others based on our preferences. The pace of the tasting was perfect; we felt relaxed and not rushed. The price was reasonable for the experience.\n\nIf you're a sparkling buff, you might end up comparing this to Mumm Napa. I'd recommend going to both, because they are very different vibes. I prefer Mumm Napa but still enjoyed our visit here.\nShow less"], ["Reviewed March 11, 2017", 3.0, "Not sparkled by the experience", "I unfortunately do not agree with all of the hype in the TA reviews. Having traveled throughout Europe, I thought Domaine Carneros would be the perfect start to our holiday weekend. We arrived for our 4:30 tasting time mid-week and even though there were not many tables occupied it took over 15 minutes to be acknowledged by the server and once he did start pouring the 'script' about the blends flowed out of his mouth so fast it was apparent he just wanted to get through the last hour of his day and out of there as fast as he could. Sadly the time we spent at Domaine Carneros was not at all the experience I was hoping for. This was the only winery out of the 9 we visited that we did not purchase any wine from. With hundreds upon hundred of other options in the valley for fabulous wine tasting, education and ambiance, I would suggest that you go support the smaller family estates who appreciate your interest. You won't be tasting sparkling wine but you'll have a much better and more personal experience.\nShow less"], ["Reviewed March 11, 2017", 4.0, "Fun tour to start our Napa trip", "We booked a tour for Domaine Carneros ahead of our arrival. Place is lovely and the tour was very informative. If you don't care how sparkling wine is made, the tour is a waste of time. But, I do care. The wine from Carneros is just ok. Even though Tattinger owns the property, they like just about all other western attempts at sparkling wine just don't cut it, particulary when compared to method champaine wines from France. The group size was about 20 or so. Still, a delightful way to kick off a trip to Napa. If you don't care about the tour, go for a wine tasting on the patio. This vineyard makes some decent pinot too.\nShow less"], ["Reviewed March 6, 2017", 5.0, "Sparkling wine!", "Beautiful winery set atop a bluff overlooking the valley. We had reservations but they weren't quite ready for use when we arrived. There is plenty to look at while you wait, however. Once seated in the lovely sitting area our service was attentive. Sparkling wine flight was exceptional. Cheese plate pairing was also delicious. I appreciate fine sparkling wine and this winery is now a new favorite. Outside seating would be lovely in the warmer months, unfortunately cool and rainy when we were here.\nShow less"], ["Reviewed March 5, 2017", 5.0, "Second visit and still has amazing views", "Great place with spectacular views. Wine flights are always good and the small plates hit the spot and keep your going. We liked it so much that we brought more people back for the second trip! Great place to start or end the day!"], ["Reviewed March 3, 2017", 5.0, "A Sparkling Experience!", "This was our first stop on a beautiful, sunny morning and a great first choice. This is an amazing place with stunning views. We sat out on the patio and enjoyed some really good sparkling wines and good food. The service was great and our server was very informative. I highly recommend stopping here, the place looks really amazing from the road, but is even better when you are on the grounds!\nShow less"], ["Reviewed March 3, 2017", 4.0, "Started the trip with Champagne", "On a rainy and windy day we started the trip with a toast. While the selection is not as broad as many vineyards, the quality is high. We tasted champagne and Pinot. Bought the Pinot. Price points are lower to mid versus other locations in NV.\nShow less"], ["Reviewed February 25, 2017", 5.0, "Great Tour", "The tour was excellent. The tasting was excellent. It was absolutely beautiful. It was raining the day we were there but the tour was indoors so it was fine. Very informative."], ["Reviewed February 23, 2017", 5.0, "Stunningly beautiful views!", "This was a very beautiful place! We thoroughly enjoyed the sparkling wines. The rose was our favorite and we took a bottle home! So relaxing to sit out on the patio sipping away!!"], ["Reviewed February 21, 2017", 4.0, "Fun tasting with my sister & cousin!", "If you like Champage/Sparkling this was nice! Liked the tables to be able to sit & enjoy the tasting. It was very very busy the day we were there. A beautiful location & grounds are beautiful!"], ["Reviewed February 17, 2017", 5.0, "Best tour, wine, and view", "My friend and I went on several tours/tastings in the napa region and this was by far our favorite. The wine was excellent and we even got a little cheese plate with some of it. The tour is fun and we learned a lot about the sparkling wine process. The estate is absolutely beautiful. If we had more time we probably would have stayed longer to enjoy the view and drink more wine on their patio as they have seating for that. The tour is a little expensive but well worth it if you like sparkling wine!\nShow less"], ["Reviewed February 16, 2017", 4.0, "Lovely estate and great wines", "This was our first stop on our wine excursion. We did the tasting and had 2 excellent Cheese/Fruit/Nut trays(extra for purchase but WELL worth it) The four of us split the Sparkling Wine Sampler(4 diff) and two of the Chateau Samplers. The 2 Cheese trays we got were well filling for the 4 of us and it was unanimous that the 2013 Estate Pinot Noir and the 2014 Avant-Gare PN were the best. The staff is very attentive and the gentleman who served us(sorry I forget his name) was delightful. Highly recommend this winery. Of the 6 we visited over 2 days I would pick this one as #3 for wines and #1 with the foods provided. None of the wines here are very sweet; no late harvest(Moscato like wines) but the samplings are very good.\nShow less"], ["Reviewed February 14, 2017", 5.0, "Awesome Estate", "The views from Domain Carneros are amazing on a nice day. Indoor and patio seating.\nYou can order several different types of sparkling flights, as well a still wine. Also offered are very small bites to enjoy with the wine. All with different prices.\nThe weekend is really busy all year round. No one wants to leave!\nShow less"], ["Reviewed February 12, 2017", 5.0, "Perfect tour. Ranking #1 of the region", "If I have to choose one tour, this would be the one. High quality sparkling wine with a bit of the winery history, a few explanations about wine making and a bit of fun To make it even better, the place is beautiful"], ["Reviewed February 12, 2017", 5.0, "First Class Tasting and Service", "We had booked via our travel agent a tasting here. We were welcomed and placed in front of the fire in the tasting room. The service was excellent as we tried various sparkling wines and pinots from the domaine with cheeses and charcuterie with the reds and smoked salmon with the champagnes- plenty of wine with back-vintages- what a great afternoon- thoroughly recommend- the staff were delightfully friendly and informative.\nShow less"], ["Reviewed February 10, 2017", 4.0, "Great tour experience", "Jana did an excellent job of educating us and teaching us about both Domaine Carneros and the process of making sparkling wine. Very enjoyable and informative. The views are fantastic also - see pictures below"], ["Reviewed February 2, 2017", 4.0, "One must Stop before going inside Napa Valley", "It's been awhile I stopped so don't know what really changed. You can seat anywhere you want but they do their best. So, don't seat anywhere you want, please check with the staff. It's always a pleasure to have a few bubble grape juice. This so refreshing and relaxing chatting with your friends or someone. The November weather was pretty good out here today. I wish they would offer some discount for tasting the sparkles wine for buying a few. Overall, the staff OK. After they bring out the Sparkling, and explained each of the wines and you are pretty much on your own and don't they bother you until maybe you half finish. The view of the Winery is perfection...\nShow less"], ["Reviewed February 1, 2017", 5.0, "Sparkles and More", "Stopped in here for my birthday. I enjoy sparkling wine but not my husband. Found some fantastic sparkling wines as well as the hubs finding some Pinot to enjoy by the glass while I enjoyed my tasting. Beautiful setting, impeccable service and amazing wines!"], ["Reviewed January 31, 2017", 5.0, "Beautiful Grounds and Wines", "Recommend the all champagne sampler. The tasting fees run 20 pp and up and they do have some nice small plates. The servers were excellent. We arrived at 10 on Sunday - so no crowds!"], ["Reviewed January 25, 2017", 5.0, "Great view...great staff....great sparkling wine", "We had a department dinner...Although we were a big group...The service was excellent...their hospitality was awesome... The sparkling wines were great... The dinner menu was great"], ["Reviewed January 19, 2017", 5.0, "Beautiful--- Fun Wine Tasting!", "Beautiful place, lovely views, great service, delicious cheese trays and wonderful sparkling wines! I highly recommend Domaine Carneros!"], ["Reviewed January 18, 2017", 5.0, "Great view. Get the caviar", "The wine here was pretty good! Had a great view. Get the caviar! Also take a photo with the gigantic wine bottles!"], ["Reviewed January 16, 2017", 4.0, "If you like Bubbly, you must go!", "If you enjoy bubby...this is the spot! After 2 full days of wine tours and talking with local winemakers- everyone agreed this is where you get you sparking wines in Napa (even the locals). The spot itself is a definitely touristy but I'm still glad we did it. We did the Sparking wine tasting which was 4 FULL pours for about $40 each. There are some great photo opps too which made the experience even better. Super friendly servers and affordable prices made this a WIN for us! They were offering $5 shipping so we were able to ship home several bottles to enjoy later as well :)\n\nWe made reservations as it was a busy time of year but you could probably get in without one but might have to wait a bit.\n\nWe were visiting from South Carolina as a Mother Daughter Birthday trip\nShow less"], ["Reviewed January 15, 2017", 5.0, "Exquisite", "Gorgeous setting, amazing sparkling wine, and Richard was the best at taking care of us. Sit outside if you can. The view is spectacular!"], ["Reviewed January 14, 2017", 5.0, "My favorite!!", "We are club members here. The tour was amazing! It was so informative and the cheese plate at the end was divine! I will be honest and say I am a total wine snob and for anyone who thinks Veuve is the only way to go because it's \"true\" champagne clearly has never tasted Domaine Carneros Brut! Love love love Domaine Carneros. Best service and quality. Don't get anything else, you will just be disappointed!\nShow less"], ["Reviewed January 13, 2017", 5.0, "Anniversary Trip", "Fantastic time and a must visit when coming to Napa. Very knowledgeable and friendly staff who guided us through the tasting process."], ["Reviewed January 1, 2017", 4.0, "Pretty!", "The building from the outside is beautiful. I liked the view. I liked that they brought almonds. Our lady server was nice. I enjoyed sitting there and the ambience was lovely. I enjoyed the tasting."], ["Reviewed December 30, 2016", 1.0, "Very rude", "If you dont have a reservation, dont go here the people who work there are very rude and arrogant. There are propertys more friendly like Chandon"], ["Reviewed December 29, 2016", 4.0, "Great stop on your way into Napa...", "We stopped at Domaine Carneros on our way into Napa from the Bay Area. It was a great way to get a 3 day trip to Napa started with some sparkling wine and a cheese platter. We enjoyed the tasting, it did take a bit longer than expected for someone to greet us at our table but once we had a server he was friendly and attentive and explained each taste as we progressed through them.\n\nWould recommend a visit as the grounds were beautiful and if warm enough would probably be great to sit outside and enjoy the sparkling wine and good weather.\nShow less"], ["Reviewed December 28, 2016", 5.0, "Great service and light appetizers", "Amazing place - if it's the only winery you go to while you are in Napa go here. Awesome place to take pictures, amazing views."], ["Reviewed December 28, 2016", 3.0, "Good Sparkling Wine", "Beautiful grounds and good service. The sparkling wines were very good while the red's were just ok. My wife and I have plenty of sparking at the moment so we did not buy anything. I generally prefer smaller wineries, but for a large operation, it was pretty nice. Likely a better place to go during the summer when you can enjoy the outdoor areas. The tasting room was a bit cold and harsh.\nShow less"], ["Reviewed December 23, 2016", 5.0, "Best bubbly in Napa!", "The moment you walk on to the grounds at Domaine Carneros, you'll think you're closer to France than California. The sprawling vineyards and gardens lead you up steps to a beautiful chateau where you'll be greeted with grace and elegance. It's no wonder they make great bubbly. My favorite was the blanc de noir. Every moment here will be one you'll cherish.\nShow less"], ["Reviewed December 21, 2016", 5.0, "Visit France without going there !", "Domaine Carneros is a magical place with beautiful views of seemingly French vineyards , gardens , and grounds . After taking in the outstanding outside experience you enter the large inside filled with wonderful wines , food , and gifts . The wines available for tasting are impeccable and the foods available compliment them . There is plenty of parking and the staff is friendly and knowledgeable. For an experience and not just another wine tasting I highly recommend the ambienance of Domaine Carneros .\nShow less"], ["Reviewed December 19, 2016", 5.0, "A great summer afternoon activity", "What a lovely place!\nWe had been recommended to go here by a wine buff friend of ours back in the UK.\nWe had travelled with our 12 year old daughter so we were unable to book ourselves onto the wine tour (I guess because it involved lots of tasting) so we booked a table for the 3 of us instead before we left home.\nWe booked a taxi from our hotel in Sonoma for the 10 minute car ride to the Winery.\nWe arrived at 12noon on a sunny August Wednesday (mid week is obviously easier to book a slot for compared to weekends) and spent an extremely enjoyable couple of hours experiencing our wine flights and cheese plate whilst we left our daughter in charge of the camera and exploring the gardens.\nI was obviously taken in by the whole ambience of the place and after 4 glasses of fizz and reading the menu cards (I clearly considered myself an expert at this point!) we walked away paying +$100 for 2 bottles of wine that were both delicious - but I can't help but think that this is where the money's made!\nThat said, we now have some brilliant photos of a beautiful day spent at a Californian Winery... thanks to our daughter who took her photographer responsibilities very seriously x\nShow less"], ["Reviewed December 18, 2016", 4.0, "Staff really turned our experience around", "We were sat by the host and then watched for 20 minutes as tables around us were helped. As we were deciding it was time to get up and leave one of the servers asked if we had been helped. We said no and that we had been there a long time. He apologized, explained they had assigned tables, and went to find our server. Less than a minute later the same gentleman was back and asking us what we wanted.\n\nWe ended up each getting a glass (the rose for my wife, and the estate pinot for myself) and shared the charcuterie tray. The rose was very good, crisp and refreshing. The pinot was a marvelous example of the carneros region, which we both love. Before we left our server gave us a taste of the ultra brut and the demi sec, and invited us to contrast them.\n\nThe next day we ended returning again, this time with perfect service from the start. I tried the sampler that comes with 2 pinots and 2 bruts, while my wife had the sparkling sampler. We shared a cheese assortment, which went perfectly with the sparkling wine, as promised.\nShow less"], ["Reviewed December 12, 2016", 1.0, "Great wine let down by arrogant staff", "Came half way around the world for this experience and was left extremely dissapointed by how rude certain staff members were towards us. Staff were more intetested in talking amongst themselves rather than interact with paying customers having to forego an $80 outlay.\nCompated to Sonoma region whete staff were delightfully knowledgeable and helpful this experience has left a bitter taste. We'll be back to Cali wine country but nowhere near here!\nShow less"], ["Reviewed December 8, 2016", 5.0, "Wine", "Michelle is super nice she took care of me I will remember the taste and smell of this place forever ."], ["Reviewed December 8, 2016", 5.0, "Lovely Winery", "this was a beautiful winery with lovely views. delicious champagne. they served almonds with the tastings- very nice touch!"]]}}