{"Downtown Disney": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Downtown Disney", "url": "/Attraction_Review-g29092-d207247-Reviews-Downtown_Disney-Anaheim_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/18/26/b7/downtown-disney.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "7777"}, "address": {"@type": "PostalAddress", "streetAddress": "Disneyland Dr at Katella Ave", "addressLocality": "Anaheim", "addressRegion": "California", "postalCode": "92804", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Downtown Disneymania", "Downtown Disney is very nice. I love the live bands that perform. Good variety of stores and restaurants. Very clean. Bring money because things are very expensive! Great easy access directly to Disneyland and the Disneyland Hotels."], ["Reviewed yesterday", 5.0, "Its an Experience", "We went to downtown Disney and it's definitely a tourists market. Everything is high priced, but there's no fees to get in, so it's a free for all. The food wasn't great."], ["Reviewed 3 days ago", 5.0, "Birthday Dinner", "We ate at downtown disney for my husband’s birthday dinner. Everyone was so nice and it was reasonably priced ☺️"], ["Reviewed 3 days ago", 5.0, "Wow!", "You thought you spent enough at the parks? Save some cash for Downtown Disney! They are really doing this strip right, a lot of new restaurants are currently being added. Make reservations at the restaraunts for after the parks; if not you are looking at 2+ hour waits.\nShow less"], ["Reviewed 4 days ago", 4.0, "Downtown Disney", "Downtown Disney is absolutely amazing! Crowded but amazing.... there is something there for everyone and no admission to Disney is needed!"], ["Reviewed 4 days ago", 5.0, "A nice place to spend a few hours", "Downtown Disney is a smaller version compared to Orlando but has the added benefit it is right next to the park. We exited the park and had food at downtown Disney and were able to return to the park after. Good food places and some shops to look around too.\nShow less"], ["Reviewed 4 days ago", 4.0, "Decent selection of restaurants and stores", "I wouldn't spend a ton of time here, as Disneyland and DCA are literally around the corner!! Great stops for breakfast though, or a late night drink."], ["Reviewed 5 days ago", 3.0, "I Always Forget How SMALL It Is", "Being a former wdw cast member, I'm so used to Orlando's version (which is even bigger now and just keeps growing). Parking is stupid now that free parking is all but gone. Yeah, you can validate, but I feel that it's inconsistent with wdw and their free parking to make you pay at dl. Disney Springs is way better and bigger and offers more variety. Location is super convenient to the parks and the dl hotel (which is worth a walk to), but the shops are less magical and Disney-themed and it's losing its appeal and the little justification there is to charge for parking. I can go to Sephora and Jamba Juice anywhere. If I have a choice, Disney Springs wins hands down.\nShow less"], ["Reviewed 6 days ago", 3.0, "It’s a small downtown", "We came down here a few times we did all our shopping here it was nice to get away from all the busyness. We had a nice lunch outside felt very chilled. It is very small downtown compared to Disney world downtown."], ["Reviewed 6 days ago", 5.0, "Nice", "Nice place to relax and kill some time with you the Disney feel. Large shopping area Great restaurants Access to monorail Movie theater and bowling alley present"], ["Reviewed 6 days ago", 5.0, "Well worth the visit", "We went for dinner one night, and some shopping. Parking was free since we ate there. Enjoyed every minute of our visit."], ["Reviewed 1 week ago", 5.0, "Loved Downtown Disney", "Our visit to Disneyland was so awesome. I loved the store World of Disney, that was my favorite place to go, lots of great places to eat and everyone was so helpful and so nice."], ["Reviewed 1 week ago", 5.0, "We enjoyed the sites and sounds of the entire downtown area.", "Very pretty, safe to walk at and we even felt younger and the sites made us feel better about each other."], ["Reviewed 1 week ago", 3.0, "After Disney", "This place is a disappointment especially when compared to its sister in Paris. I arrived late so all the places were shut but even if they were open it didn't seem like there was much to do. Also I went to universal city that looks much more great.\nShow less"], ["Reviewed 1 week ago", 4.0, "Always fun", "A visit to Disneyland is not complete without a stroll through Downtown Disney. Lots of great shops and eateries. Some great pin trading is to be had while you are there. Tortilla Joes is a great restaurant. And if you are looking for anything Disney you gotta check out World of Disney.\nShow less"], ["Reviewed 1 week ago", 1.0, "Disappointing", "I guess if you can't afford the sky high prices to get into Disneyland you MIGHT think this is the next best thing. I found the food expensive - WHEN you could get into a decent restaurant, the people rude and it is not even CLOSE to being the Happiest Place on Earth. I will definitely avoid this next time.\nShow less"], ["Reviewed 1 week ago", 3.0, "No Dinner for us", "After a long day at Disney we headed Downtown for supper. We stopped at 5 restaurants and the shortest wait time would be 45 min and only if we split our group of 7 into two separate tables.\n\nIt was a cold day and so less busy, as well as supposedly a slow time of year. What is the wait like when it’s busy?!\n\nThey could be encouraging texting reservations by having a sign up by the mono rail where we all waited for 30 min to come there to eat.\nShow less"], ["Reviewed 1 week ago", 4.0, "Expanded and better", "Good selection at the Disney store and several stores restaurants and booths along the way. Free parking but remember to bring your ticket and have it stamped where ever you purchase a 20 dollar item. Lots of parking available. It was a nice night out with my wife.\nShow less"], ["Reviewed 1 week ago", 4.0, "High-end, High Energy Hub of Disneyfied Fun", "Shops and restaurants on the slightly higher end - no shopping bargains here! Good free family friendly entertainment and fun people watching. The GIANT Disney store has nearly everything you can find in the parks. Marcelines Confectionery has the same sweet treats as in the parks. Your best bet for quick reasonable breakfast is at Starbucks (there are two!) get a bite to go while you wait in line for the parks. Or our family favorite for a budget sit down breakfast - White Water Snacks in the Grand Californian Hotel - good hot \"American\" breakfast for $8.\nShow less"], ["Reviewed 1 week ago", 5.0, "Good shopping", "Anaheim isnt great for shops, but downtown disney was had a nice variety. the disney store was huge and amazing. all that the two lands had in one place. You will need a full wallet for this shop. Every disney item you can imagine and more.\na good variety of places to eat and all in a beautiful setting. must go here.\n#if on a budget take the kids up the road to target and let them get some disney stuff there.\nAlso a good stop if park hopping\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome", "Lights, fun, excitement, like going to the fair without the bad crowd. Ice cream. Movies. Good food."], ["Reviewed 1 week ago", 4.0, "Very Nice and Clean", "I am just not a Disney person. Wer were in Anaheim to visit family. We had a free day and went to Disney downtown. It is very clean. Very crowded. Very expensive. I did really enjoy the Lego store. By the way, we saw many a stressed family on their way into Disney. I don't think it is the happiest place on earth.\nShow less"], ["Reviewed 1 week ago", 5.0, "Disney Home Store in Downtown Disney", "The Disney Home Store has lots of items to decorate your home....... in all things Disney.\nKitchen items aplenty. Frames and pet items galore. AP discount accepted.\nLoved the convenience of shopping here without having to go into the parks to shop,\nespecially for a quick gift or souvenir.\nShow less"], ["Reviewed 1 week ago", 3.0, "It's not what is inside the parks", "No reason to go unless you have time to visit both parks. Otherwise just a tourist trap with junk. Go to the park and enjoy all of Disney."], ["Reviewed 1 week ago", 5.0, "The place to go after parks close!", "Great dining choices and plenty of shopping! If you are looking for anything Disney related, the Disney Store should have it! Lot of thought and talent put into the beautiful flower arrangements around the area."], ["Reviewed 1 week ago", 4.0, "Great places to shop!", "We found everything we wanted in the parks conveniently located in Downtown Disney and then some. Great place for breakfast, awesome wood fired pizza joint and a place to build your own remote control car. Everybody loved Downtown Disney!"], ["Reviewed 1 week ago", 5.0, "Before or After", "Before or after your trip to Disney or Disney California there is a Downtown Disney Area with lots of shops, restaurants and ‘street vendor’ type food and treats to enjoy. It is located prior to the ticketing/ entrance area and you exit into it getting off of the trams from Mickey & Friends parking area. You may also take the monorail from the park there to eat or shop and then return to the Disney Park. Just be sure you have your Disney Ticket to return.\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice area", "Lots and lots of shopping and food. Went in the evening and ate outside. Done very nicely. Wide walkways and interesting storefronts."], ["Reviewed 1 week ago", 2.0, "Not Impressed", "A lot of construction and the Disney store didn't have much merchandise. Small compared to WDW. Buy in the theme parks."], ["Reviewed 1 week ago", 5.0, "Cool place bring your wallet", "Get through security which is easy and no park admission required to get all your Disney goods and hang out with thousands of people all with the love of Disney. Disney Home opened the day we were here everything Disney for you kitchen its pricey in my eyes but fun and good restraunts around to grab a bite from. Make sure you visit Downtown Disney when your here\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun visit", "It's fun to walk around Downtown Disney visiting the different shops and trying different foods at the variety of restaurants and bakeries. Beautiful flower displays - great to see after a dreary winter in New England."], ["Reviewed 1 week ago", 3.0, "Nothing really special - just expensive shops", "Downtown Disney in Anaheim is fairly small and very expensive. The primary reason to go here is to visit the World of Disney and pick up any shirts or souvenirs you might have missed in the park (and be warned they do NOT carry everything from the park). Other than the this one store, the rest of the stores can pretty much be ignored. Yes, there are restaurants here that are a convenient walk from the park so if your time is limited you can go here. However, if you have time go elsewhere in town to get a more reasonably priced (and better) meal.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Love walking around downtown disney!", "I love downtown disney and walking around. The house of blues was there and it was my favorite spot. I'm not sure where I will go next time I visit but hope that the replacement is good!!!\n\nI always get my silver chains at a store there!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A bit expensive", "our kids went to Ride makerz store to customize cars. Daughte had great time at Elsa Boutique make over. Lego store was good. You could easily spend day. also cinema we enjoyed movies there. Alamo car rental conveniently located at Disney downtown."], ["Reviewed 2 weeks ago", 5.0, "Fun place", "This was our fourth visit and we still love it. It’s not cheap but it’s worth the visit. I would definitely go again. This time was with a teenager and still had a great time."], ["Reviewed 2 weeks ago", 5.0, "Family atmosphere", "Great Disney shopping and tons of restaurants! Bowling allley (20 lanes) and movie theatre.... who knew? Great place to spend an afternoon."], ["Reviewed 2 weeks ago", 3.0, "Downtown Disney", "Very nice and clean. There are a lot of stores and restaurants to enjoy but as usual with any Disney property it is expensive. You do not need any tickets to get in as it is open to the public."], ["Reviewed 2 weeks ago", 4.0, "If you like Disney you need to be there", "Did spend an evening there, was fascinated by the crowd. A nice place to watch what is going on. Not necessarily a place to find good restaurants, but a lot of interesting stuff to see."], ["Reviewed 2 weeks ago", 4.0, "Lots of Restaurant and Shopping Options", "Our family enjoys coming to Downtown Disney on the first and last day we are on vacation. Example: We drive to Anaheim on a Sunday, arrive by mid afternoon, and instead of jumping right in and heading the parks we walk through the shops at Downtown Disney. Also a great idea is to have the Goofy's Kitchen Character Dining experience this day....you'll get all the Disneyland feel without doubly booking your time and $$ with tickets for the park that day AND a character dining experience.\n\nThere is a lot of construction going on right now (Winter and Spring 2018) but it's still nice.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Variety shopping and food", "Fun area to hang out in and see different things. They have a great big Disney store as well. Lots of shops and different food options. Also you walk through to get to Disneyland and California Adventures."], ["Reviewed 2 weeks ago", 3.0, "This used to be a great place to hang out...", "This used to be a great place to hang out...\n\nEverything west of the monorail is going to be demo'd for a \"new\" Disneyland hotel.\nIt is still a great place to leave the parks via monorail, to grab a bite to eat. Or just visit on your own, free 4 hours with sit down dining validation.\nBut AMC, Rainforest Café, ESPN Zone - are to close.\nBuild a bear, and ridemakerz were already closed out.\n\nNew bowling ally opened.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "The Downtown", "Check out all the shops and when tired there are some restaurants or food carts that offer refreshments. Great for shopping or just relaxing after a days work. Great for families and friends."], ["Reviewed 2 weeks ago", 3.0, "Place for the \"Shopper\"", "We did enjoy Downtown Disney but we did find that the items were overpriced!! My husband is a Goofy fan and he couldn't find a Goofy shirt anywhere in the park or Downtown to be found. He had to settle with a Goofy clip-on....We pay enough for the hotel and park fees plus the food...they should consider lowering their prices. I did most of my shopping at Wal-Mart the prices were more reasonably priced.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great start, end and break from the Magic of Disney", "Downtown Disney has all kinds of fun shops and restaurants to look at. We love going to the world of Disney store in the mornings to check things out\n\nThere are lots of options (food, clothing, souvenirs.) there are also a lot of fun little stands with characters artists, popcorn, pretzels. Nice break and a fun stop along the way!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Lots to do", "Even though there was construction going on and unfortunately 2 of the shops we wanted to visit were closed permanently (build a bear & ride makerz) we still found things to look at my son love the Lego shop."], ["Reviewed 2 weeks ago", 4.0, "great place to hang-out without themepark tickets", "Great shopping venue with Disney flair. Lots of fast-food eateries and restaurants to satisfy different groups, altho smaller in size compared to Disney Springs in FL,connects to Disney Grand California Hotel and Disney California Adventure Park"], ["Reviewed 2 weeks ago", 5.0, "Love the shopping and music", "This is a great place to shop for Disney items, get some snacks, eat, and relax with the themed music on the mall. Lots of fun."], ["Reviewed 2 weeks ago", 3.0, "Expected more", "Lots of food choices, a bowling alley and theater and a few retail shops. Considerably smaller then Orlando. Nice stop but not a destination on its own."], ["Reviewed 2 weeks ago", 3.0, "If you want to buy Disney stuff without going into the park...", "It's just a bunch of shops and restaurants, but its worth a stop at the Lego store, if only to see the giant Lego sculptures"], ["Reviewed 3 weeks ago", 5.0, "Fun fun", "We have a young infant who is too little to enjoy Disney so we ended our night by hanging out at downtown disney. It was very lovely with music, cute shop and yummy food. If you park there you can get your ticket validated by purchasing anything $20. Fun night.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "No rides, but lots of shops and restaurants", "I love to go to Downtown Disney. If you want to shop and eat without paying over $100 to go into the park, here you go. We shop at the World of Disney, where you can get almost everything that they have inside the park. There are lots of delicious places to eat, we enjoy the ESPN Zone, which had great food and full bar. If you want to enjoy a nice Lemon drop, sit at the outside UVA bar. They give great service and a strong pour. It's a true Disney experience and always fun. Try to go during the week to avoid crowds.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "World of color, if it’s not there you may not need it", "Many dining,drinking and dessert options. Just walking through is a delight for the senses. Not hungry -shop. Little pricey but for the quality offerings maybe splurge. Had fun just people watching and absorbing all the options. We walked from hotel, but did see large parking areas- not sure of cost. If your staying at nearby hotel worth a walk through.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "The Magic of Disney", "This had about anything you could ask for, the shopping, restaurants, and just fun scenery to take in. I really liked the huge World of Disney shops, but there is something for about everyone. The only thing missing I think is the nightlife similar to Pleasure Island in the old Orlando Downtown area, but I understand wanting to keep those areas separate.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great time", "We had a great time at this locale. The beignets were amazing. Great variety of food and things to do."], ["Reviewed 3 weeks ago", 2.0, "More Disney money-grubbing", "We are former locals who visited this place again after a couple of years away. The formerly free 2 hour parking now costs $12, unless you spend more than $20 at the shops or restaurants. We bought a couple of pounds of Starbucks coffee, which we needed anyway...so there, Disney. Grew up a few miles from DL and first visited around 1956, but the extreme money-grubbing is off-putting and we will likely never return.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Expensive But Fun", "Whenever I’m near Anaheim or Orlando I stop by Universal Orlando first and Disney second. Donald Duck is #1. Don’t forget that."], ["Reviewed 3 weeks ago", 5.0, "Absolutely love it!", "Love downtown Disney, lots of parking, shops & places to eat. Apparently the Disney store in downtown Disney is the biggest in the world. Entertainment fantastic. Lovely place to visit easy going nice vibe. I visit every time I on Orlando"], ["Reviewed 3 weeks ago", 4.0, "Here almost everyday", "Clean, happy, well maintained! Bought most of our gifts here. Nice clean restrooms. Plenty of shops and restaurants to choose from."], ["Reviewed 3 weeks ago", 4.0, "Expensive dining but nice change from the parks", "Lots of stores and food options here at first glance. And good change from the parks. But all fairly pricey for what you get. But it’s Disney! Movie theatre is quiet and good break from parks if you’re staying close by."], ["Reviewed 4 weeks ago", 5.0, "Napolini - A must for dinner", "If craving Italian, go to Napolini! It is super yummy! The chicken parmesan was light and yummy! The seafood pasta was great too! Even the complimentary bread with olive oil and balsamic vinegar was yummy! It is a bit expensive but compared to Blue Bayou which we wanted to go to, it is a great price!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Better than I thought it might be", "Stopped here to eat at rainforest cafe after business meetings and we were pleasantly surprised! Several places to see/eat/shop/browse. Loved the Lego store (Darth Vader was incredible!) Bought mouse ears, postcards and a couple pins for souvenirs from the big Disney store at the far end. Several places have penny machines and I even encountered my very first quarter machines here! Be sure to stop at one of the cart places in the middle that have churros. The fruity pebbles churro literally made the whole business trip worth it. <3 <3 Very clean and all the staff in the different stores were all very friendly and helpful. Make sure to get your parking pass thing stamped at one of the places you buy something from! (And seriously, try the fruity pebbles churro!)\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Lots of shopping lots of entertainment", "This is a shopping area between the Disney and California Disney. If you forget to buy something inside Disney, u can buy it here. Items are as expensiveness in Disney but the bonus is you have lots of restaurants, resorts and a movie many theatres."], ["Reviewed 4 weeks ago", 5.0, "Amazing place for people who are not going to the theme park", "this place is amazing, don't you ever listen to the people who will tell you that this place is lame, if you are a Disney fan then believe me, you will love this place.\nlots of restaurants and shops with Walt Disney characters and icons.\nyou can get the souvenir from there as well.\nif you are not going there to eat then you should spend between 1.5-2 hours on this place.\ntips:\nthe parking there is tricky, because it is free as long as you will buy something with 20$ or more, if you are not doing that, then the parking will cost you 14$ which is a lot.\n\nanother tip is that selfie sticks are not allowed so dont even bother and take it with you because you will end up going back to the car to return it or they will throw it away.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Good place to spend a few hours when you don't have a ticket for Disneyland on the day", "Good selection of restaurants and shops. We had purchased a ceramic mug at a souvenir shop and took that through security when we first entered the Downtown Disney district. We left that area to spend time at the Disneyland hotel, but when we tried to re-enter the downtown district at the Disneyland hotel entrance with the same mug we were told that it could be broken and used for a weapon so it wasn't to be taken back through there. I found that strange when there were knives being used in the restaurants but a mug was considered dangerous, and the same mug was OK to go through security at the other end. Apart from that, the area was a great place to have a meal and wander through shops.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Downtown Disneyland is free to attend.", "Times are changing when you have to go through a metal detector at Disneyland, but that is to keep everyone safe including Mickey Mouse. The stores for souvenirs are expensive and if you are on a tight budget, you might want to go to one of the shops on S. Harbor Blvd. to buy your Disney items. Overall this is a nice area to walk around and stop and get something to eat in one of the restaurants.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Plesent surprise", "We stumbled on downtown Disney by mistake but was surprised by the amount of things to do there from shopping to many places to eat catering for all types of foods just a good place to go and have a break from the hustle and bustle of the parks\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Disneyland Trip With Grandkids", "No visit to Disneyland would be complete without a stroll through Downtown Disney! Shops and restaurants abound and the atmosphere is playful! Our favorite restaurant is Rainforest Cafe! Favorite stores are LEGO, and Disney Store. The latter is a huge store with sooo much to look at and buy. Numerous cashiers are strategically placed throughout the store. There is a Starbucks nearby and a bakery/cafe. Mobile kiosks are located in park-like settings where there aren’t any buildings. Lots to eat, see, and buy! Don’t miss it!!!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Something for everyone", "There is something on this strip for everyone to enjoy! Lots of stores and restaurants to enjoy before, during or after your visit to Disneyland"], ["Reviewed 4 weeks ago", 3.0, "You’re Not in Florida, Toto", "If you think one Downtown Disney is like another, be forewarned that Anaheim is not Orlando! Fortunately, it was not the main reason for our visit, so when at Disneyland, enjoy the offerings at hand."], ["Reviewed 4 weeks ago", 5.0, "A Taste of Disney", "Whether or not you're visiting the Disneyland/California Adventure Parks, Downtown Disney is a must-see for all around the Anaheim area. It's enough for you to taste the Disney magic, but it certainly leaves you wanting more. Every time I visit, I'm thankful that I have tickets for Disneyland the next morning!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "1st visit on US arrival", "After 14 hour flight from Australia and check into hotel and walk to unwind, this was the choice to unwind..only short walk from hotel taking the in sights in preparation for next day Disneyland Park visit. Being Christmas, the atmosphere was exciting, colourful and certainly very seasonal. Casual walk in the evening, many options for dining and retail focus was is to be expected in such a location. Weary traveller happy to return to hotel after short excursion to Downtown Disney and lots of fun.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "DISNEY SHOPPING!!", "Don't spend your money buying souviners inside Disneyland or California - head to Downtown Disney! It is a lot cheaper! You could spend hours wandering through the stores here. There are food places, build a bear, ATM's, you name it."], ["Reviewed 5 weeks ago", 5.0, "So many ways to spend your money", "No-one does merchandising like Disney. A great atmosphere, plenty of options for offloading your hard-earned cash. Grab something to eat, watch a sporting event on the big screen, shop till you drop. What’s not to love?"], ["Reviewed 5 weeks ago", 4.0, "Lunch and a little shopping", "Disney store has everything and both restaurants we tried were good. You do have to go through Disney's security to get to downtown Disney so you want to give yourself a little time if you have a reservation or something."], ["Reviewed 5 weeks ago", 3.0, "Shops and over priced food", "Ok so we know what this is , the price of the food is over the top , great to grab a coffee but don't eat here as there are loads of great options just a short walk or Uber ride that's better at way less. Cost\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Huge store, fine shopping, good restaurants", "There is a huge store with almost everything of disney, The biggest Rainforest Café I know, Sephora, a bakery and, of course, a Starbucks. Open until 2am (but not all)"], ["Reviewed January 22, 2018", 5.0, "Mindblowing!", "So clean, like Disneyland.\nMake sure you book restaurants in the mornings to get a seat! We spent day one before we activated our pass to the park checking all the menus of restaurants, shops etc and knew then where and what we wanted to do.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Fun outside the Park", "There were so many shops and places to eay, drink and be merry. Of course with the Disney theme in mind."], ["Reviewed January 22, 2018", 5.0, "lots of things to buy", "If you want memorbilia, this is a good spot. Prices are high, but the items were bought at Disney. Great selection of items to choose from."], ["Reviewed January 22, 2018", 4.0, "Graet for a day or night", "Great selection of shops and places to eat. while on the overpriced side....there is something for everyone here."], ["Reviewed January 22, 2018", 4.0, "Great shopping & restaurants", "Well laid out area to shop everything Disney. You can go to a movie or checkout a comedy club. You must go through Disney security to enter Downtown Disney. Well landscaped with plenty of places to sit down and people watch after walking the parks."], ["Reviewed January 21, 2018", 3.0, "Shops and Restaurants", "Plenty of shopping and restaurants hasn't changed to much in 12 years. Well maintained, clean but a little pricey for food. Worth a look. Would like to see more shopping choices."], ["Reviewed January 21, 2018", 5.0, "Great shopping adventure", "I brought my special needs aunt to Disneyland for her 60th Birthday. On our last day there we spent it in Downtown Disney. The shops were awesome. My aunt was able to find everything she wanted to buy. It was the last day for the build a bear so my aunt was fortunate as she was super excited to go there. She made Olaf and Anna as she already had Elsa.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Fun, But Crowded and Expensive", "There's so much to do at Downtown Disney, where do you start? Tonight's adventure had us getting the allusive rose gold Mickey ears at a small cart outside World of Disney, shopping and doing makeup sampling at Sephora (I sat and waited outside), and dining at Rainforest Cafe (rumored to be removed by end of summer).\n\nThis place is always packed in the evening, and everything is overpriced, but it is part of a theme park, so I suppose you expect it.\n\nThanks to the new TSA-style security to in to Downtown Disney, there's never any weapons or gangs. It's a fun and safe place to take your kids any time of the year.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Very nice", "We love all the shops and restaurants here. Would recommend a visit for some good food and fun. Love the theatre. We enjoyed the decorations and atmosphere"], ["Reviewed January 21, 2018", 5.0, "Good eats!", "Easy place to get all your Disneyland shopping done at once. Love Tortilla Joe's and La Brea Bakery. Good date night area"], ["Reviewed January 21, 2018", 4.0, "Great window shopping", "Take a break from being crammed among crowds at the patk by doing shopping or grabbing a snack. Great restaurants or snack opportunities."], ["Reviewed January 21, 2018", 4.0, "Wow this is a cool place for shopping", "If you need a bigger store then there’s downtown Disney! We also tried lunch here at Catal and it was nice to sit in peace and quiet and have some table service. Lots to see and shop here. Worth going to."], ["Reviewed January 20, 2018", 3.0, "Not as good as Orlando", "The Anaheim downtown disney is really small and kind of boring compared to the Orlando version. We thought it was pretty pricey for just average food and barely no entertainment."], ["Reviewed January 20, 2018", 5.0, "A nice escape from the park", "There is nice little shops to look at, and a few little places to eat. These are a nice escape from the park. There is movie complex too which we enjoyed. It got very busy at night, making it difficult to walk around."], ["Reviewed January 20, 2018", 3.0, "Shopping Center", "Downtown Disney is ok if you are hungry or want to visit the largest Disney store in California. It is mainly so so restaurants with some stores mixed in. On some nights there is a live band down by Earl of Sandwich. There is a movie theater also but I can't imagine ever seeing a movie there since I am usually too tired from being in the Parks. I love that to get into Downtown Disney you have to go through security checks. They check your bags & make you walk through a metal detector. They aren't messing around. I only gave Downtown Disney 3 stars because for me it is just something to walk through to get to the Parks or back to the hotel.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Beautiful During The Holidays!", "Lights everywhere, Downtown Disney is a fun place to be right before the holidays! My kids and I had a blast walkings around and visiting the shops and getting cotton candy. Highly recommend if you need a break from the park!"], ["Reviewed January 20, 2018", 5.0, "Great place to walk around", "This region is free to public access, no Disney tickets needed, but you need to pass through security and have your bags thoroughly checked. Also parking is ridiculously expensive, so I'd recommend taking a taxi or rideshare instead. You can somehow get parking validated/redeemed at some shops (I know The Void does) up to a certain limit.\nThe Void and other shops, restaurants, entertainment outlets are in this District.\nShow less"], ["Reviewed January 19, 2018", 5.0, "For all your Disney shopping needs", "Very convenient, just outside the Park itself. Downtown has lots of restaurants, and plenty of Disney shops. It also has a really nice vibe - there were street performers in the evenings, and everyone seemed to be enjoying themselves."], ["Reviewed January 17, 2018", 5.0, "If you spend more than 20 USD parking is free", "Nice place to visit to get the Disney vibe without the money spent. Spend those on a good restaurant instead with the kids."], ["Reviewed January 17, 2018", 4.0, "Great place.", "Lots of shops, many places to eat. Some of the shops like the bear thing and the car thing where you can choose your own combination of a teddy bear or a remote controlled car, it could be a fun place by itself.\n\nThey are very stubborn about the parking validation, and my parking ticket wasn't properly validated when I bought something, so I had to go back, park my car get it validated and go out again, so be sure the check the parking ticket before you leave the store or the restaurant.\nShow less"], ["Reviewed January 17, 2018", 3.0, "Family get away", "We go every year. We go to the UVA bar. There street fries are delicious. It’s a fun place to hang out. Earl of Sandwich is a must for lunch because Disneyland food is expensive."], ["Reviewed January 16, 2018", 3.0, "Disney trip", "I really enjoy going to Downtown Disney. I am very disappointed that they are going to tear down the Rain Forest Cafe, and The AMC theaters. They are also taking out ESPN Zone and Earl of Sandwich. This is so they can build another over priced hotel at Downtown Disney. The reason I go here is to eat at Rain Forest and go to the movies. We usually end up doing other things as well which leaves more money at Downtown Disney. I will have no reason to go there anymore. Also building this hotel is going to cause surrounding hotels to raise prices. They can do that because the Disney properties are so expensive that other hotels have open season on price increases. I've seen hotel prices double in the past ten years. Even more when you add resort fees. What cost $69.00 ten years ago now cost $150.00 to $300.00 per night. Very sad.\nShow less"], ["Reviewed January 15, 2018", 4.0, "Charming.", "I grew up in Anaheim and i'm old enough to remember free entrance fees to Disneyland and the separate ticket prices for individual rides, rated A through E. Space Mountain was an E ticket ride when it first opened. Our family has lived on the Florida for the past 30 years about a two hour drive from Orlando. We have two kids, one 21 years old and the other 6 years old. We've done Disneyworld and Disneyland to death and continue to do it, because the quality of their parks have no equal.\n\nSo, how does Anaheim Downtown Disney compare to Orlando Downtown Disney? Anaheim Downtown Disney is compact. Since Disneyland is surrounded by a mix of hotel properties and residential neighborhoods, space is at a premium. The Anaheim location is easily half the size of the Orlando area. In Anaheim, the Downtown Disney serves as a prequel to entering either the Magic Kingdom or the newer California Adventure. There's no fee to enter the area but there is tight security. There's a movie theater, multiple shops and restaurants, a Disney store, etc.. The Orlando version is an entity unto itself with many more shops, stores and restaurants to offer.\n\nWhere Downtown Disney Anaheim loses to Orlando in size, since there's a more compact space, Disney's been forced to condense the magic (decor, iconic imagery, etc.) into a smaller location. This gives Anaheim's location a whole lot more charm. It feels much more like you're in Disney than the Orlando location, which feels a lot more spread out and pre-planned.\nShow less"], ["Reviewed January 15, 2018", 3.0, "Great place, lacked a bit of atmosphere but still awesome", "Love downtown in Orlando and this is not quite as good but still ok. We visited on Xmas eve and not quite hit the mark. Shops good and plenty of places to eat."], ["Reviewed January 14, 2018", 3.0, "Not really open until 2", "Went after park closed and grabbed a bite to eat. Then thought we would look around and shop walked into Grand Californian to look at lobby...very pretty,...and had to go through security to come out of hotel. Slow line. By the time we were through security almost all the shops were closing. Ended up going to the Void - which was fun - but even Starbucks was closing. By 10:30 It was a ghost town.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Family trip 2018", "Downtown Disney always have some kind of entertainment going on. Where it be live Bands or restaurants and stores. It's amazing to walk at night for sure!"], ["Reviewed January 13, 2018", 4.0, "I like it and here's why...(P.s. It's good not very good)", "This is solely designed to get your money coming and going from the park but for some strange reason, I like it. The park can get a little claustrophobic when its hot and the crowds are immense so here you have more variety of choices to eat, you can see a movie (why would you go to Disneyland and waste money watching a movie you can see anywhere) and you can buy the same merchandise in the main that you can in the stores. There are one or two notable exceptions to that store wise but in the main the t-shirts, towels, sweatshirts etc are overpriced swap meet quality. The one size fits all quality standard started under Eisner's tenure and hasn't really improved since. If you are a disneyland fanatic whilst you are here wander into the disneyland hotel and look at the shop there because you will find things you won't find in the park. I wouldn't buy desserts with your meal here. Buy those in the park because that really is part of the park experience and they have plenty of choices from ice cream to dole whips to chocolate to candied apples and candy floss.\nShow less"], ["Reviewed January 13, 2018", 3.0, "More of an annoyance than an opportunity", "High security at entrance....like at an airport. It is filled with shopping and restaurants, some of which are very good, but overall, basically it just separates you from the parks entrances if you are coming form the hotels (Disneyland Hotel of Grand California). Nowhere near as expansive or interesting as Downtown Disney at Disneyworld in Orlando. Good for people watching and has some great restaurants, but that's about it.\nShow less"], ["Reviewed January 12, 2018", 3.0, "Very disappointed in parking costs!", "My wife and I went to walk around Downtown Disney for date night. We browsed some shops, bought a cup cake and a cup of coffee and enjoyed our time together, but were absolutely SHOCKED upon leaving when we were charged $24 for an hour and a half for parking!! The attendant at the exit booth explained that it is $6 for every 30 minutes, BUT you are charged for full 30 minute intervals whether or not you stay the whole 30 minutes! As you can see from our ticket, it was stamped at 7:01pm, which resulted in being charged another $6 even though we were exiting!! If you stay ONE minute into the next half hour increment you are charged for a full thirty minutes!! Unbelievable!! The time clock starts the second you get your parking ticket upon entering the parking lot. What if after you get your parking ticket, you have to drive around for 10 minutes looking for a parking spot because you can’t find a parking spot? Too bad! The time clock is ticking! What if there are a lot of people going to Downtown Disney and takes 10 minutes to wait in the security line and another 5 minutes to get screened by security? Oh well! Time is ticking!! I usually LOVE Disney, but their parking at Downtown Disney is a downright SCAM! I will NOT be back to Downtown Disney and it’s strictly because of their parking policies and procedures!\nShow less"], ["Reviewed January 12, 2018", 2.0, "Don't expect the same as Downtown Disney Orlando Florida. Crazy Security inspection!", "Have been to DT Disney in Orlando FL many times , much bigger than here and is more than awesome.\nSecurity her was intense. I'm a Volunteer firefighter and carry a rescue pocket knife with a small 2 inch blade , seat belt cutter and car window punch with me at all times , they tried to take the \"Weapon\" she called it and I said no way I'll take it back to the car , grabbed it and did just that. They then proceeded to pull my wifes pursue completely apart including asking her to open her lipstick thing .. I also carry my badge in my wallet , it flipped open when I had to put it in the tray for the metal detector , the person manning the trays actually reached in the tray and closed my wallet before sliding it past the metal detector table. Seriously!\nShow less"], ["Reviewed January 11, 2018", 4.0, "A fun extra for your Disney trip", "Downtown Disney is a place where you can find some great places to eat and do some shopping. I would say definitely more eating then shopping. Would like to see more stores"], ["Reviewed January 11, 2018", 5.0, "All the shops that you need", "It’s perfectly located just off Disneyland and is open for a while longer than the parks so you can grab whatever you need after visiting the parks. Check for timings in advance though because it keeps changing"], ["Reviewed January 10, 2018", 4.0, "Love the big Disney Store", "We often shop at the big Disney Store outside of the park as it stays open after the parks close. Also nice to enjoy the Disneyland atmosphere without paying to go into the parks. Fun places to eat and live music in the evening."], ["Reviewed January 8, 2018", 2.0, "Too Small", "Not enough things to see or do. Disney needs to spend money on updating the site. Adding more stores, restaurants, shows, special events, etc."], ["Reviewed January 8, 2018", 5.0, "So much to see and do", "Best time to visit is mid day or non standard meal times. The World of Disney is incredible and you can spend hours there with all the selection. Don’t go at park closing. It’s nuts but open late. Find the churro cart and get a churro ice cream sandwich. Omg. Grab a drink, people watch and have fun. Yes it’s expensive. Make reservations if you plan to dine.\nShow less"], ["Reviewed January 8, 2018", 5.0, "A magical space and place", "We loved the atmosphere that downtown disney has - great shops and eateries and a magical vibe! Love the fact it is open late!"], ["Reviewed January 7, 2018", 4.0, "Alot going on that pleases everyone", "There is alot to do here. You can shop, eat, or sit and people watch. This us a fun place with alot to do without standing in line for rides."], ["Reviewed January 6, 2018", 5.0, "Amazing entertainment", "Very nice for families or solo. Great restaurants,shops and movie theatre. Totally recommend for you and your family"], ["Reviewed January 6, 2018", 4.0, "Good selection of restaraunts/cafes.", "Nice stroll through a mini-mall. Good selection of food, though a bit on the pricey side. ESPN Zone is a must just for the experience."], ["Reviewed January 6, 2018", 5.0, "Love this Downtown Disney", "Love the way they have the downtown Disney area between the two parks and has easy access for those not staying on the Disney grounds. Plenty of shops and restaurants, but not so big that you feel overwhelmed."], ["Reviewed January 6, 2018", 4.0, "Great live music!", "The crowds were awful. The parking was ridiculous. There were several musicians throughout the walking mall. This was THE BEST part of being at Downtown Disney. These people had skills! I could go just for the live music."], ["Reviewed January 6, 2018", 4.0, "Pretty Neat!", "On the day we went, the place was really packed. It was a few days after Christmas. I did not remember it being so crowded the last time I had visited. The Lego Store was pretty neat and had places where children could build. We went to Build-A-Bear and it was a long wait, but the staffers were very friendly. One even sang with my daughter. I am sure that when Disneyland is not at max capacity this place would be great to roam. We even saw a live concert that interacted with the crowd which was pretty cool too. We were staying in Anaheim with family and we took an Uber which was very easy.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Plenty to do", "Lots of variety. Not nearly as crowded as we expected it to be. Lots of places to spend your money. Several very good eating places. Easy park and walk in."], ["Reviewed January 4, 2018", 2.0, "Not worth it", "We walked around with my family and didn’t find anything of real value in roaming around. It’s mostly stores pushing Disneyland stuff, and very expensive. It is very clean, but not really worth it."], ["Reviewed January 4, 2018", 4.0, "great restaurants!", "We ate the Jazz, Italian and Mexican restaurants. Jazz was good, but the other two were excellent! Food and staff at Italian and Mexican were super."], ["Reviewed January 4, 2018", 3.0, "average opinion", "not enough good restaurant or choice of food, mostly fast food like. very crowded as expected but surprising for a Thursday evening the week after school start."], ["Reviewed January 4, 2018", 1.0, "Total ripoff with the new parking SCAM", "Used to be a nice place to walk around, get a coffee or beignet (so delicious!) and maybe a nice dinner. That was back when you got 2 hours of FREE parking. However, they recently changed their policy so there is no more free parking! You must pay $12/hour (thanks Disney!) for the \"privilege\" of walking around and spending money in their stores. Also, the $12/hour is in the FINE PRINT at the bottom of the parking sign, so you don't know you're getting RIPPED OFF until you actually leave. Oh, and to top it off, if you're there for 2 hours and 1 minute, they will round up to the next half-hour. Ridiculous, NEVER coming back here again!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Christmas Magic", "Downtown Disney was all lit up for the holiday. Great food and you can always buy great Disney stuff. There are artists to listen to."], ["Reviewed January 3, 2018", 4.0, "Mickey Who?", "The lack of Mickey and Minnie Mouse merchandise was a let down. We wanted to purchase a stuffed animal on our last day couldn't find one in the Disney store. Our local Disney store or online is where I'll purchase one."], ["Reviewed January 2, 2018", 5.0, "Fun place to wander", "We wandered around Downtown Disney two nights during our stay. Visiting the gift shop, eating churros, and checking out the sights and crowds. Very busy during the evenings we went but plenty to see and do."], ["Reviewed January 2, 2018", 5.0, "A touch of Disney and lots of shopping", "We went to Downtown Disney to get dinner while visiting Anaheim. I just love this area. It is a touch of Disney, great shops and great food. There is a Lego store, Build a Bear and different Disney themed stores. It was decorated for Christmas which was also really nice. It was fun to walk around. We really enjoyed our evening there.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Great place to experience a bit of Disney!", "I recently went to Downtown Disney with my wife and son. It was a really nice experience with a variety of things to see and places to eat a meal. The ambiance was really nice and the Holiday Decorations were stunning. You can also see the 9:30pm nightly fireworks at Disney from a viewing spot. I recommend parking at their lot and then either purchasing more than $20 of merchandise or eating at one of the many sit-down restaurants to receive parking validation. Try seeing Downtown Disney during the day and at night to gain a better appreciation.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Great Food and Shopping", "Like Rainforest Cafe, beignets, Christmas street decorations, and huge Disney store - lots of people watching opportunities"], ["Reviewed January 1, 2018", 4.0, "Outdoor Fun", "We enjoyed our evening at Downtown Disney! Our goal was to visit as many Southern California locations as possible while on vacation. The live music, food, and shopping made for a fun experience."], ["Reviewed January 1, 2018", 5.0, "Downtown Disney", "On a business trip and visited downtown Disney one night to kill time. It was so clean, lots of restaurants to choose from. They had live entertainment which was really good! People were dancing in the streets. Shopping was fabulous."], ["Reviewed December 31, 2017", 5.0, "Great meeting spot with kids", "We used downtown Disney as a meeting spot for friends and family when coordinating schedules across Southern California. Very easy to access via the highway, parking is ample, and there is a wide array of restaurants. If you eat at one of the restaurants the parking is comped. We had an 8 month old and all the restaurants are kid friendly with a plethora of stroller access. There q.v. is security across the entire area but it is not like TSA with the stroller.\nThe Lego store, the huge Disney store, and the hotels are our regular spots.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Great place.", "Lots to see, the restaurants are great some pricer than others. Best part is you don’t have to pay to enter."], ["Reviewed December 29, 2017", 5.0, "Good variety", "Although this Downtown Disney is slightly different from Florida’s Downtown Disney, we enjoyed our wandering through here. Spent 4 nights wandering around this area after days in the parks."], ["Reviewed December 29, 2017", 4.0, "Great for disney shopping and a good meal", "Good restaurants and world of disney store located here as well as other stores. If you park here make sure to get your parking validated or it's $12 an hour. Some of the stores and restaurants are being torn down to make way for a hotel disney plans to build.sad to see rainforest cafe go!\nShow less"], ["Reviewed December 28, 2017", 5.0, "Nice and crowded", "Shops and restorants. Great Disney shopping. Tons of dining options. Some fine dining and lots of street food. Starbucks as well. Not a very big area but very nice way to spend an evening."], ["Reviewed December 28, 2017", 4.0, "Nice shopping & eating area", "This is an outdoor shopping area several blocks long with all kinds of shops and restaurants including a movie theater. you can pick up the monorail here to Disneyland if you have Park admission ticket. It's a nice place with the lots of Disney decorations but also pricey. It's just outside the Disneyland Park admission gate area and you have to go through security. There's a limited parking lot that you can get your ticket validated ( if you buy something) so it's free but I think they keep it limited to keep down the number of people coming off the street. They were playing Christmas songs on the loudspeakers but none of the old carols that talk about the birth of Jesus.\nShow less"], ["Reviewed December 26, 2017", 4.0, "Interesting but small !", "After several trips to Orlando Disney downtown This is about 1/10 the size - pretty lackluster - pretty disappointed - better than nothing"], ["Reviewed December 26, 2017", 5.0, "Our Favorite!", "Shopping, eating and drinking! What more could one ask for...lol Plus fireworks, lights and whatnots!"], ["Reviewed December 25, 2017", 5.0, "Exmas eve", "It's cool to do a quick visit to my childhood on Christmas eve. The fireworks and the lights in the trees are so festive one cannot help but feel the spirit of the season. There's many stores and restaurants to experience without doing the full Disney park thing.\nShow less"], ["Reviewed December 25, 2017", 3.0, "Just shopping", "A great place to pay more than necessary for mediocre food. A wide variety of shopping and dining options."], ["Reviewed December 24, 2017", 4.0, "Mom and Son adventure", "This is the first chance I have had to visit since it was built. The map on line does not do this area justice. You have shops and restaurants. You have stands where persons are performing and singing. A few fountains. Our visit in December, it was supper busy. At times a challenge to maneuver a wheel chair. The prices in the shops are expensive. The prices in the Restaurants are high. There are good places Like the Rain Forest Café. There is a restaurant we went too, the food and service were terrible. The prices too high for what you received. We spent money in the Disney store. Got some shirts. But it was very crowded and expensive. We made three visits to Downtown Disney, during our visit to Disneyland.\nShow less"], ["Reviewed December 23, 2017", 5.0, "A good place to unwind, shop or have a meal.", "We visited during the day and in the evening . Wonderfully decorated for Christmas with a fun atmosphere. Downtown Disney is not cheap but has alot of stores , cinemas and restaurants to keep the whole family amused.\nI would recommend booking a restaurant in advance as they soon get full to capacity.\nThe Disney Store, Lego store and Sephora were visited often on our family holiday alongside The Rainforest cafe and Tortilla Joe's.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Outstanding food and shopping venue!", "This is THE place to go for dining, shopping, live entertainment, movies and all things \"Disney\". Downtown Disney stays open until 2am, so if you still have energy after a long day at the parks, there is still more fun to be had. The Wilderness Lodge opens into Downtown Disney, so for individuals staying on Katella or Harbor Blvd, this is a convenient shortcut at night.\nShow less"], ["Reviewed December 23, 2017", 1.0, "Selfie stick", "Just because of selfie stick, we were not allowed to enter unless surrendering the selfie stick without any promise to get it back. The security also works together with some old men outside the park for spying us. Very impolite and rude of the security."], ["Reviewed December 23, 2017", 4.0, "Nice place to get food and shop", "This is a busy place but offered a variety of food choices and bars. We enjoyed shopping here too. Bonus was the LEGO store."], ["Reviewed December 23, 2017", 3.0, "Nothing too exciting. Just an outdoor shopping mall", "This place mostly has restaurants and a bunch of shops with Disney gear. If you want to go shopping for Disney gear while outside the parks this is a good place. The Lego store is quite impressive but it does not have anything you won't find at another Lego store.\nShow less"], ["Reviewed December 22, 2017", 5.0, "The coffee and food courts say it all", "If you are hungry, there is so much to chose from. You cant go wrong. We spent a half day with our double stroller. Not bad."], ["Reviewed December 22, 2017", 5.0, "Crowded retail and food with an energy that can't be denied", "The downtown Disney area is a wonderful blend of busy Disney themed shops, family centric retaining some great dining destinations. If you're not able to get into the parks, Downtown Disney is the next best thing. Great people watching and plenty to keep the whole family engaged for what might be a two hour wait for a table to eat dinner. Downtown Disney is fun and exciting, and nearly always worth the crowds.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Night stroll", "Late night stroll with kids. We loved he DJ and the various entertainment. Beautifully decorated for Christmas. Lots of food and shops.Kids loved the LEGO store and masterpieces. Truly amazing! Bummed due to fireworks cancelled due to high winds. Overall enjoyable walk.\nRemember to validate parking ticket if you have a sit down meal. It will cover your parking for up to 4 hours.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Magical", "I love downtown Disney. You get all of the Disney magic packed into an adult themed and affordable day/night!"], ["Reviewed December 21, 2017", 4.0, "Clean and easy", "Parking and drop off for parks runs you thru downtown and it’s well done as only Disney can do. LEGO and surf shops, build a bear and restaurants ..something for everyone . Clean large and nice"], ["Reviewed December 20, 2017", 3.0, "Mainly restaurants", "This downtown disney is much smaller than the one in Florida and does seem to be mainly restaurants though it does have a Lego store and also a huge World of Disney shop. This DD only takes about an hour to experience unless you are seeing a movie. There is a D-Street store that sells a lot of star wars related gear.\nShow less"], ["Reviewed December 20, 2017", 4.0, "Restaurants and Specialty shops", "A great place to stroll with plenty of good place to eat. Not a very big mall and parking could be challenging. Be sure to validate your parking ticket, 3 hours free for 20 usd purchase from any shops, or 5 hours free for seated restaurant or movie (AMC theater). Lego store is not to miss for Lego fans.\nShow less"], ["Reviewed December 20, 2017", 3.0, "Our trip to the USA.", "Our only Disney experience is based on visiting Downtown Disney in Anaheim. It was interesting but we were overwhelmed at the degree of commercialism. We were able to have a drink and buy a few momentos but found everything very expensive and almost beyond our reach on our foreign currency.\nThere were lots to see and engage the senses. Children seemed mesmerized.\nShow less"], ["Reviewed December 19, 2017", 4.0, "First time at Downtown Disney District", "So many shopping centers and restaurants. It was nicely decorated. It was so packed as expected, I wished they had more entertainment options. Mainly a place to go shopping if you looking for gifts."], ["Reviewed December 18, 2017", 3.0, "Small", "Small and compact in comparison with its peer in Orlando. Nothing really stands out here as the restaraunts are all overpriced chains with below average food. Very crowded. Does look nice during Xmas time."], ["Reviewed December 18, 2017", 5.0, "A fantabulous time.", "OMG!!! Downtown Disney is so awesome. An unforgettable shopping experience. Will go again and again. Was able to find my favorite character, TIGGER right away and was able to buy EEYORE as well. An experience well worth the GO. THANK YOU DOWNTOWN DISNEY."], ["Reviewed December 17, 2017", 5.0, "Lovely for a stroll before or after the parks", "We didn't spent a lot of time at Downtown Disney but did take a couple of leisurely walks at the end of our days at the park and the morning before we flew back to Canada. Our final walk through was a nice way to get some Disney flavour without paying to enter the parks for just an hour. We had a nice meal, listened to some music, and made a fun stop at the Lego store. This is a great place to visit for some Disney flavour or shopping without heading in for the full park experience.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Beautiful", "Lots of choose and plenty of seating options. It was very clean easy to access. It was a nice place to stop between parks."], ["Reviewed December 16, 2017", 5.0, "Fun but bust", "Lots going on. Give yourself time & don’t go hungry because you’ll likely have to wait to eat. Went to the Jazz restaurant, it was good."], ["Reviewed December 14, 2017", 4.0, "Massive Disney store", "Situated between the two parks is Downtown Disney. I prefer to shop at the massive Disney store here, where I could get everything at once, as opposed to inside the parks. I couldn’t find the rose gold MM ears, but if you ask at one of the checkouts they were holding them there as they sell out in 2 minutes!!! Lots of other shops and eateries along this strip including Legoland, Starbucks, Sephora and Rainforest Cafe. Worth a visit if you want to escape the parks for a break. You may encounter wait times at restaurants during peak times.\nShow less"], ["Reviewed December 13, 2017", 4.0, "More affordable breakfast options here", "We were staying in Disneyland hotel and the breakfast buffet is very costly for a family of 4 at the hotel. We needed simple breakfast and would rather spend more time doing some souvenirs shopping before checking out at 11am. We feel 100% safe here in Downtown Disney with the tight security checks. Earl of Sandwich is good for simple breakfast. After shopping we could still steal some time at the hotel pool.\nShow less"], ["Reviewed December 13, 2017", 4.0, "Great shops!", "There were a lot of fantastic shops here with a lot of the same merchandise you can get inside the park without having to pay any entry fees. We had a nearby motel so we didn't have to pay parking fees, so that was nice too. It's super convenient to take the monorail there from the park too.\nShow less"], ["Reviewed December 13, 2017", 3.0, "Nice to walk through in holiday season", "A nice sense of Christmas and holidays during htis quick stop over but if you were looking for a disney shopping then Florida Disney downtown wins the race."], ["Reviewed December 10, 2017", 5.0, "Disney Magic without the rides", "Many shops and restaurants, and of course the Disney Store is included. Disney is amazing at marketing - I wanted to buy half the store! A nice way to shop if you just want souvenirs and aren't going in one of the parks - or even to have fewer/shorter lines.\n\nThere were no characters wandering around, but if you enter on the side between CA Adventure and Disneyland, you still get a bit of a feel for the parks. You can also view the fireworks from in between the parks! (There is another, less crowded, entrance on the other side of Downtown Disney - well worth it if you just want to eat or shop.)\n\nNote: Even if you are just going to downtown Disney, no matter which side you enter from, you have to have your bag checked by security.\n\nOf course the restaurants are a bit pricier than the surrounding chain restaurants, but not that much - and the service is Disney fantastic.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Shopping at Disneyland", "This is a fun place to shop and just unwind during or after long days at the theme parks. The Rain Forest Cafe is the best. The Disney store and the Lego store was our families favorites. we visited 2 times on our trip and had a great time.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Worth a vidit", "Downtown Disney is like a shopping strip littered with Disney and non-Disney stores like Sephora. We like coming here for lunch. There’s a restaurant with creole cuisine that’s really good and then the Mexican place isn’t bad either. It’s much easier than eating in either park.\nShow less"], ["Reviewed December 8, 2017", 5.0, "Holiday", "Cool place to wander round for the shops & restaurants. Ate at the Espn restaurant which was really good....so man tvs lol."], ["Reviewed December 8, 2017", 4.0, "Shopping and food !", "We visited Downtown 3 times this week! So enjoyed the build a Bear with Pokémon characters. LEGO store is amazing ! Lots of stores and bakery, shops for kids. There is also clothing, art, jewelry for teens and adults ! Be sure in the World of Disney store to ask for a pin if you have a birthday or your first visit. You can also ask any cast member to trade pins for your lanyard. Next favorite store is the Ride Maker where your child can help you put together a car wheels, tires, body and then pick after market items like a siren or spoiler. Such fun! If it’s a hot day there is ESPN to watch sports and a movie theater. Most reasonable price place is Earl of Sandwich with the best by far sandwich you will ever have ! Try the All American ! It’s thanksgiving on toast bread. Incredible ! Have fun\nAt Downtown !!! Now when you have a special occasion try Jazz Kitchen and order the chocolate bread pudding. Let me know how you like it!\nShow less"], ["Reviewed December 8, 2017", 3.0, "Not What I Expected", "I was a little disappointed in DD, we went to have dinner at Ralph Brennans , I guess it was not what I expected nothing at all like the Disney Parks."], ["Reviewed December 8, 2017", 5.0, "Awesome as always", "Downtown Disney has had some changes since our last visit. Slot of upgrades and all for the better. Kids loved the build a bear shop and Lego shop too. Will be back nxt time"], ["Reviewed December 7, 2017", 5.0, "Relaxing place to soak in the atmosphere", "We loved spending time in downtown disney , spending time people watching after a bit of shopping. It is a lovely place fo all those who love all things Disney. There was a girl and her band singing on evening we were there, everything was decked in fairy lights and it was quite magical to just enjoy it. The shops are outstanding and when you are all shopped out there are lots of places to enjoy drinks or something to eat. Great for all ages.\nShow less"], ["Reviewed December 7, 2017", 3.0, "It ain't Disney World", "This place is nice and all but in order to enjoy this park you must go here first THEN go to Disney World."], ["Reviewed December 5, 2017", 5.0, "Downtown Disney", "Awesome shopping experience .lots of dining and shopping experiences ,caters to everyone ,great atsmosphere ,seating,shops food restaurants"], ["Reviewed December 5, 2017", 5.0, "Great place to spend time", "Great place to stroll around. Lovely places to eat. Disney shop is fantastic. Highly recommend going to downtown Disney."], ["Reviewed December 4, 2017", 4.0, "Great Selection of Shops and Restaurants", "Its a nice break from the busy park to wander through and check out the food and entertainment. Lots of options for couples and family, clean and easy to navigate."], ["Reviewed December 4, 2017", 5.0, "Great way to experience some Disney without a full day in the park.", "Downtown Disney is a great place to just stroll- especially during the Holidays when the lights are up and the singers are out. Grab a latte and the hand of a loved one and take your time browsing the stores or taking in the lights and music. I love this place- some complain about it being too commercial or crowded- but if you go in without an agenda, have patience with the exhausted parents and kids coming out of the park, and just take in the magic it can be a lovely way to spend an evening.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Great place to visit on a Disney vacation.", "Such a cool place. I love that it costs nothing. Great eateries, stores, live music and beautiful ambiance. Always my first stop when on a Disney vacation. Hint if the crowds get a bit much, walk along the parking tram upper path which is much clearer.\nShow less"], ["Reviewed December 2, 2017", 3.0, "Much too Crowded", "Disney is ok and a wonderful place to visit, but not for very small children. Too many strollers, carriages, crying children who will never remember the trip."], ["Reviewed December 1, 2017", 5.0, "Fun", "Fun trip with friends. The place is clean and the workers are friendly. We went on a Thursday to Saturday... It wasn't too packed but busy"], ["Reviewed November 30, 2017", 4.0, "Good place to hang out while waiting for other things.", "I wouldn't call this a destination in and of itself, but we walked through on our way to the parks. It's good for snacks, and there's often live music playing. The decorations are nice, too. There is a Disney store that carries much of what the shops in the park carry, so you can pick up a few things quickly, and there's also a Lego store. Those are always fun.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Beautiful street shopping with free entertainment.", "We love shopping and eating in Downtown Disney. The free entertainment is fantastic as well, not to mention the great places to eat."], ["Reviewed November 29, 2017", 3.0, "Many shops", "Many great shops down this strip. Check out Lego store- cool designs. Huge Disney store for all your Disney needs. Restaurants are a bit pricy."], ["Reviewed November 29, 2017", 4.0, "Nice, safe walking area, bit pricey", "I enjoyed walking the Downtown area; I never felt unsafe walking by myself. There were several stores to look at and a handful of restaurants/eateries. Being Disney, it is all expensive, such as the $6 small Jamba Juice or a $25 basic pasta.\nI have been to the Magic Kingdom Downtown Disney in Florida and it is probably 3x the size of Anaheim. There just isn't the land to add to Anaheim to make it even close to comparable. Overall, it was a nice experience and an enjoyable place to hang out and rest.\nShow less"], ["Reviewed November 29, 2017", 5.0, "Good, shops, atmosphere, music and fun", "A range of shops and kiosks. A really vibrant atmosphere with live music in the evening. Lots of restaurants and food outlets."], ["Reviewed November 27, 2017", 5.0, "A fun day adventure", "We went to Downtown Disney for a \"fun\" walk, to check out the shops, get some fudge, watch a movie and enjoy a good lunch."], ["Reviewed November 27, 2017", 4.0, "A few updates here and there", "From about 2011 to 2015 not much has changed with Downtown Disney. I think Disney caught wind of the comments and started making some positive changes to make Downtown Disney more appealing. There are now two Starbucks' instead of one, more food variety/choices, and newer Disney stores/Disney themed stores. The majority of restaurants have stayed the same, except House of Blues will now become the new bowling alley (Disney Springs has this already in Orlando, FL.).\n\nAdditionally if you enjoy eating at the Rain Forest Cafe, get your fill now because the restaurant will close next summer to make way for the new hotel/resort addition.\nShow less"], ["Reviewed November 27, 2017", 5.0, "The new security makes is easy to visit", "I love the new plan for security before entering downtown Disney. It allows for a safer environment AND the option to hop from parks to down town without any crazy security lines. Earl of Sandwich is delicious, and so is the Jazz Kitchen!"], ["Reviewed November 27, 2017", 5.0, "Great Place Must See", "I was down on business. We loved the place and visited a couple of time between business meetings. We were all adults but still loved it"], ["Reviewed November 27, 2017", 5.0, "Plenty For Everyone at Downtown Disney", "From live music, to great food, and shopping to your hearts content, you can't beat the ambiance of Downtown Disney. You don't have to be at the Parks to feel like you're still part of the Disney Magic, Downtown Disney has you covered. There is parking specifically for your visit to Downtown Disney and almost any place you eat or shop will provide you with parking validation. There are Disney shops, other places to shop like Pandora (one of my favorites...) plenty of restaurants and food carts galore. They offer seasonal items too like personalized Christmas Ornaments on a cart near the Monorail. It's fun, vibrant and has something for absolutely everyone!\nShow less"], ["Reviewed November 26, 2017", 5.0, "Good place to find an Eatery", "We went to the Jungle Cafe it was really good. Great food very tasty. The children liked the animals and storm every half hour. Very busy so be prepared to wait."], ["Reviewed November 26, 2017", 5.0, "Always worth a visit", "3 or 5 hours of free parking if you buy something or eat at one of the restaurants and get validated, means hours of Disney fun strolling the shops and kiosks just outside the theme parks. No rides, but the prices are reasonable for Disney and it's fun just strolling around enjoying the atmosphere and options. There are no lines, too!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Fun Evening", "Dinner, shopping and Disney vibes. Doesn't get much better than this. Love spending the evening of our arrival exploring."], ["Reviewed November 25, 2017", 5.0, "Pretty cool", "Downtown Disney is a pedestrian walkway filled with restaurants and shops. There's something for everyone at DD, which has the parks on one end and the Disneyland Hotel on the other. The ESPN zone is fab for adults. All screens with sports, good food and an area upstairs that's a game room. Across you have The Earl of Sandwich. The Rain Forrest Cafe, the one with the moving animals and dinos? Don't go unless your kids are crying so hard they're coughing up blood. It's overpriced, noisy beyond belief and the food is not that good.\nBuild a Bear will soothe the child upset about missing that cafe. They not only have bears they have the dragons from How To Train Your Dragon.\nThere is a movie multiplex in DD.\nAnd there is the mother of all Disney Stores there. You can spend hours poking through this one store. It has everything Disney.\nDD also has seasonal outdoor entertainment and decorations.\nMultiple stores, lots of different restaurants. DD is a great place and you don't need a ticket to get in.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Fun Area of Disneyland Park", "Downtown Disney is a change of pace from the theme parks. Lots of sites and sounds to be enjoyed. Plenary of places to eat as well."], ["Reviewed November 22, 2017", 4.0, "Take a walk", "Just wanted to walk around here and see the stores (: I love the Lego store the most because it has big huge characters made out of legos that you can take photos with and they are just amazing. Plus I have siblings who love legos so I hook them up but it's a cute spot to walk and shop or even grab something to eat (:\nShow less"], ["Reviewed November 22, 2017", 5.0, "Fun night!", "Love to go to Downtown Disney and enjoy the entertainment on Saturday night, go for dinner or just walk around and do some shopping."], ["Reviewed November 20, 2017", 4.0, "Themed Shopping", "They do a good job making this shopping venue into an adventure of itself. Good for couples, kids or groups. The is a lot to see and do in between Disneyland and California Adventure, including an adult watering hole."], ["Reviewed November 18, 2017", 5.0, "shops, entertainment and food", "several good restaurants and ESPN. Shopping is ok. Security is better and it's more convenient to get through the metal detector lines."]]}}