{"El Capitan": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "El Capitan", "url": "/Attraction_Review-g61000-d139182-Reviews-El_Capitan-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/2b/b4/65/el-capitan.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1074"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "One of the most beautiful places in world", "Yosemite is a singular place for exceptional natural character, placed between two different deserts, that sierra is an lnatural life island. and the main protagonist is this stone sentinel. a huge granite slab faces the beautiful valley of the Rio Merced."], ["Reviewed 3 weeks ago", 5.0, "Just spectacular", "Of all things seen, this massive is the main picture we will take home in our minds. Good picnic sites in the forest below."], ["Reviewed 3 weeks ago", 5.0, "Majestic El Capitan", "Meadows around El Capitan make for a relaxing view of the majestic El Capitan. One of the beauties of Yosemite."], ["Reviewed January 20, 2018", 5.0, "One Of The Big Three", "El Capital, Half Dome and Sentinel are the giants which give Yosemite Valley its character. El Cap is the most imposing of them and sits in the land of climbing legends. It is an imposing monolith of about 1km of vertical granite walls. Not to be missed if visiting Yosemite.\nShow less"], ["Reviewed January 18, 2018", 5.0, "When in Yosemite, you have to see El Capitan!", "You can view El Capitan from various pull-outs along the road. You should at least do that when visiting Yosemite National Park.\n\nWe tried to go up close, parked in the El Capitan Pic Nic area and walked towards this impressive rock but the trail was blocked after a while because of \"dangerous conditions,\" according to the sign that was blocking the way. But we were able to appreciate the grandeur and take some good pictures from that point.\n\nWe were also able to see it from pretty close from a couple of the pull-outs, and from Tunnel View.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Most amazing rock on earth", "Read up on the geology of this pluton, and you'll appreciate the amazingness even more. This rock shocks. There's no way to explain it without seeing it. And photos don't do it justice."], ["Reviewed January 14, 2018", 5.0, "Hike The Loop Trail to Base", "One can’t help but view the massive granite face from multiple angles from throughout the park. Take advantage of the ever changing look of El Capitan throughout the day but also make time to park your vehicle and take the loop trail to the base of this monolith and take in the view from the base up close and personal.\nShow less"], ["Reviewed December 27, 2017", 4.0, "Magical Yosemite Valley", "We drove in on Route 41. The first view of the valley as we descended into (at Tunnel View) it was fantastic. El Capitan on the left, Half Dome in the back, Glacier Point to the side. A bit further as we drove further into the Valley, Yosemite Waterfalls show up, just adding to the entire ethereal experience of this place. We parker by the convenience store and walked around, took the short trail (above/behind the hospital and the court) a bit up the hill), strolled through the Village and concluded our experience by stopping at the foothills of the El Capitan. This last stop was a beautiful experience; staring up the sheer wall of it was humbling and amazing.\nPick your visit days carefully as you might easily get stuck in traffic on your way in our out. We took Route 120 out (towards Sonora). The ride out was easier than in on Roite 41.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Wow, What a Rock!", "Unbelievable! Just how big this rock face is. At your fingertips, yet So far away. Imagine trying to scale this sheer face."], ["Reviewed December 13, 2017", 5.0, "The Chief", "Beautiful from far but even more impressive up close. Bring binoculars and watch the climbers ascend the towering chief."], ["Reviewed December 12, 2017", 5.0, "Spectacular", "This is worth a visit. El Cap is awesome, as is the rest of Yosemite. There is a really nice, mostly flat walk from El Cap to Mirror Lake that is worth taking."], ["Reviewed December 1, 2017", 5.0, "A sight to behold. What a magnificent sight.", "El Capitan is the most amazing granite mountain I have ever seen. You can't imagine its magnificence from a picture. It is breathtaking in person. To stand below it, you feel so small. If you are lucky enough to enter Yosemite from the south entrance, you will be blown away at the view after coming out of the tunnel!\nShow less"], ["Reviewed November 26, 2017", 5.0, "Great Views", "Great photo shots from several areas in the park. We loved our Yosemite visit! Make sure you bring your good cameras!"], ["Reviewed November 26, 2017", 5.0, "A beautiful site, but a place that can be dangerous", "I was in the valley during the major rock fall in late September and saw the rescue team go down to try and rescue the injured and dead climber. Climbing El Capitan is the dream of many climbers, but it is also incredibly dangerous. It was quite amazing to see the huge rocks fall (rocks the size of multi-story apartment buildings) while climbers were still on their ascent close by. But it was very sad to know that a honeymooning couple were caught by the falling rocks. He died and she was seriously injured. El Capitan is a marvel of nature, but it also is subject to the whims of nature.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Wow, such a huge chunk of granite!!", "The Yosemite valley sights make you realize how large the world is. Hiking is everywhere. Food is abundant."], ["Reviewed November 23, 2017", 5.0, "HUGE!!! You can imagine how big this area is!", "People were actually climbing this area, but you can not see them! They look like ants on there! Awesome views!"], ["Reviewed November 17, 2017", 5.0, "Amazing", "This large rock formation is just amazing. We stopped here for photos for about 15 minutes, but you could easily spend more time. We spotted several people or groups climbing the mountain. It is just majestic."], ["Reviewed November 17, 2017", 5.0, "Climbed to the top (via Yosemite Falls)", "It was very windy at the top but well worth the hike just to say that you've been to the top of El Capitan."], ["Reviewed November 15, 2017", 5.0, "Stunning Rock Towers Above the Valley Floor", "Incredible piece of rock. Seemingly gong straight up from the valley below. Awesome place for pictures."], ["Reviewed November 12, 2017", 5.0, "Towering rock face", "It is always awesome to gaze upon this imposing cliff, particularly if you spot climbers set up their hanging bivies during their climb. However, this year, it was sobering. You can see two white gashes left after this summer's terrible rockslides."], ["Reviewed November 10, 2017", 5.0, "Fall 2017", "Soooo beautiful!! I couldn’t stop taking pictures!! A must see!! MUST!! Unbelievably huge!! Take binoculars so you can see the people up there mountain climbing!! They look like ants all over the place. Some even sleep up there as they climb!!"], ["Reviewed November 9, 2017", 5.0, "Spectacular!", "One of the most spectacular National Parks we’ve been to. Lots of hiking! No crowds at the end of October. Would come back in a heartbeat!"], ["Reviewed November 9, 2017", 5.0, "Beautiful park!", "I will not go down and list all the places in the park and rate them. The park is wonderful. I do have some suggestions. 1) Get there early in the morning! Later in the day , the tour buses come in and release tons of people , so every location is like a fire ant mound that has been stepped on! 2) bring a cooler with drinks and food , since in October some of the eateries are closed.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Amazing", "You really have to see El Capitan to appreciate it. Take binoculars to spot the climbers. At sunset El Capitan goes a wonderful pink colour, worth viewing from Valley View or Tunnel View."], ["Reviewed October 30, 2017", 4.0, "Huge!", "If you park up to go to Bridalveil Falls, you literally park with a great view of El Capitan. There seemed to be limited parking but amazingly still spaces! The sheer size of this will amaze you. Worth a visit for the photo opportunity; absolutely stunning.\nShow less"], ["Reviewed October 29, 2017", 5.0, "An impressive & unique mountain", "This is an impressive & unique mountain in Yosemite National Park. The best view of it is from a stop in the Yosemite Valley where you can get quick photos of it."], ["Reviewed October 27, 2017", 5.0, "No pictures can do this justice - seeing it for real is just amazing", "El Capitan dominates the Valley Floor and rises majestically over the tree line. When we visited there were climbers on the face. There are lost of parking spaces on route so don't worry you'll have plenty of opportunity to grab the shot you want."], ["Reviewed October 26, 2017", 4.0, "Impressive to see, and generally a quick stop.", "If you are a mountain climber, than I am sure El Capitan would get a 5 in your rating. For us, we drove to a good parking area with a view of El Capitan, got out and took a few pictures and were done. It is impressive to see and I can appreciate the crowds who come to take a look, but for us was a quick 10 minute stop.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Impressive...", "This is one the largest pieces of granite in the world, if not the largest. Take a telescope if you have one or at least binoculars. It is fun to see the climbers which you won/t see without aid."], ["Reviewed October 23, 2017", 4.0, "Can be viewed from many angles", "Like the half dome, this can also be viewed from many angles and places. The best place we thought is from sentinel dome. From here you can view the whole valley."], ["Reviewed October 19, 2017", 5.0, "Unrivalled", "There's no other place like this in Yosemite. It's a sigh to behold, and will make you feel like a small blimp in the universe. Bring binoculars and try to spot the climbers."], ["Reviewed October 18, 2017", 5.0, "Simply Majestic", "I do not think I have ever seen anything quite so compelling and mesmerising, remember to take your binoculars. We drove past and stopped twice once in the day and once at night, and we took the shuttle bus there to walk some of the trails taking is right along the valley floor beneath. There is a climber/ranger set up on the bridge with information for the general public, this included telescopes so you could see the \"little dots\" more clearly. You can spend hours just staring at rock faces looking for climbers ! At night there were just little head torch lights dotted across the face of the rock.\nCathedral beach is opposite El Capitan and worth a look. Do make sure you check the shuttle buses as although all the route buses pass this way the Green route bus refused to stop for us.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Absolutely Majestic", "El Capitan can be seen from various vantage points throughout the park but, in my opinion, up close and personal gives you a better idea of the grander of this rock formation. Taking the valley trail hike puts you right next to this spectacular peak. As we approached, the location of the recent section of rock that came down was clearly visible (it is huge). Everything in the general area was covered in rock dust (we assume from the rockfall). One can get an excellent feel for the shear size if this peak from the Valley trail and it is impressive.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Awesome, Yet Dangerous", "We went at El Capitan to watch the climbers through telescopes that were set up near the bridge so that the general public could get a close up look at the climbers in action. It was a beautiful place to be, and you could actually see the climbers working their way up the side of the cliff with all their gear, even though with the naked eye they looked like tiny specs that you could barely see. Unfortunately, less than 48 hours after we had been there, a huge part of the side of the cliff gave way and killed one climber and injured others. We had actually walked over toward El Capitan while we were there to try and get a close up view from underneath the climbers, but fortunately it was late in the day and we would have missed the only shuttle that would take us back to our lodge so we had to give up on what would have been a bad idea, anyway. The Trail to Bridalfalls is right across the street from El Capitan and Yosemite has a shuttle that takes you near the bridge and across from El Capitan and this trail, but that shuttle only runs every 30 minutes and stops running much earlier in the day than the other Yosemite Shuttles, so be sure and check the schedule beforehand.\nShow less"], ["Reviewed October 17, 2017", 5.0, "AWE", "The view of El Capitan was worth the long wait to get in the park on a holiday weekend. It was my favorite view, closely followed by Half Dome and Cathedral Peak. Outdoorsy daughter proud of her National Parks membership. Nature can be breathtaking in all its glory. Coming from Reno, we enjoyed the whole day driving all the way around in the park before going on to Sacramento and then Lake Tahoe.\nShow less"], ["Reviewed October 16, 2017", 5.0, "WOW", "after exiting the tunnel we pulled over to the viewing area. Incredible sight. The Yosemite Valley w/El Capitan, Half Dome, and the falls. There are no words to describe the incredible view. It was on my bucket list."], ["Reviewed October 14, 2017", 5.0, "Massive and Dangerous, but compelling.", "We were nearby the day before a huge chunk broke off and killed a young man from Wales as he and his wife were hiking beneath. Once again we spotted climbers ascending and descending. Take your binoculars as El Capitan is much higher and more distant than you might imagine. We were able to catch some reflections in the water beneath after an easy hike to get closer.\nShow less"], ["Reviewed October 12, 2017", 3.0, "better see it from distance", "it is more impressive to see from distance, like valley view or tunnel view. so skip it if you are tight on time."], ["Reviewed October 12, 2017", 5.0, "Fun To Watch Climbers", "The shuttle to El Capitan can only be caught at a couple of stops in Yosemite Valley. We caught our ride in front of the Visitors Center. Nice ride; very scenic. The driver recommended not giving off at the picnic area; that the best photos and views were the next stop, and soon we arrived at a stop near a bridge. Very beautiful spot. In the nearby meadow, several folks were already setting up big scopes to watch the climbers, and I understand that at certain times during the day the rangers set up more for the convenience of the tourists. We brought our binoculars and they served nicely. It was fun viewing all the nooks and crannies that make El Capitan, and it was a special treat to pick out groups of climbers here and there along the rock wall from different vantage points along the meadow area. Popular place - even at mid-morning, the place was jam-packed with cars and RVs all along the road for quite a distance. We enjoyed the morning there and actually caught the same shuttle later in the day because we realized it looped around to the Swinging Bridge after the El Capitan stop. Sadly, this journey was accompanied by multiple sirens because a large section of rock had broken free and aid cars and rescue workers were rushing to the scene. The people we picked up at the El Capitan stop were very shaken by the explosive power of what they had just witnessed, and we discovered later that one climber had died and another had been injured. The next day, a similar incident occurred. I had seen many people take trails that I think would deliver them closer to El Capitan. Never thought about how risky that might be. Locals told us that these rock breakages are not uncommon, so bottom line, enjoy the setting with a sense of respect for your safety.\nShow less"], ["Reviewed October 9, 2017", 5.0, "What a sight to see", "We went to El Cap meadow where there is a climber there with 2 telescopes. He will give you info about climbing El Cap and through the telescope you can see climbers. It was fun to then try and spot them with the naked eye."], ["Reviewed October 6, 2017", 5.0, "Famous for rock climbing", "This giant rock is beautiful to look at from the bottom of Yosemite valley or from tunnel view. We saw climbers enroute to the top. Record for climbing is 2 hours and most climb it in 4 days. Can't miss this impressive piece of granite!"], ["Reviewed October 4, 2017", 5.0, "The arrogant one in the distance", "It is majestic, elegant and beautiful at the same time, although you cannot wonder how dangerous is to climb it!!!! Great views, nonetheless."], ["Reviewed October 2, 2017", 5.0, "Largest Granite Monolith on the Planet!", "Standing in the shadow of this giant is very humbling. It's massive will amaze you. Right across the street in Bridal Veil Fall, so you get a twofer if you park here. Recommend a jacket as it's very shady and damp. Once you leave and get into the sunshine of the valley, you won't need it!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Minnesota Nice", "Bring binocs so you can see the climbers. The sheer magnitude of this site is a total wow. I cant even imagine climbing and sleeping on a sheer cliff!!"], ["Reviewed September 30, 2017", 5.0, "A big unstable rock", "We visited Yosemite in the midst of wildfires (breathing smoke), but before the recent rock slides. If you go to Yosemite, viewing El Capitan is a must. It can be effectively viewed from a meadow where some of the park rangers are assigned to help climbers. If you have very good eyes (and binoculars), you can spot climbers as they attempt their climb.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Breathtaking sight", "Yosemite doesn't really need any introduction as it is one of the most spectacular National Parks in America. El Capitan is probably the most famous landmark in the park along with Half Dome and the thrillseekers still want to climb it. It dominates the park so is very hard to miss.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Impressive!", "This trail will bring you to the base of El Capitan - and is an awesome spot to view this impressive mountain. Easy hike, be sure to take a peek!"], ["Reviewed September 24, 2017", 5.0, "It's hard to believe there are people up there", "Our guide spent about a half hour pointing out the climbers on El Capitan. They are so small, but every once in awhile you can see a reflection from their hiking gear."], ["Reviewed September 20, 2017", 5.0, "A must see", "While El Capitan can be seen from many places in the valley (and tunnel view), there are places in the meadows/picnic areas with very special views."], ["Reviewed September 13, 2017", 5.0, "WOW!", "This valley will have you wondering where to look next, but do not forget to check out El Capitan. A giant."], ["Reviewed September 6, 2017", 5.0, "The Captain / The Holy Grail for Climbers", "If you could only climb up one, this would be it. Takes 3-5 days for most to go up, but only a few hours down, but wait till fall or the sun will burn you to a crisp"], ["Reviewed September 6, 2017", 5.0, "You Know Your in Yosemite", "Spectacular sight to see and when the climbers are on the wall very exciting. Get out walk around to soak it all in and if time permits check out a sunrise or sunset."], ["Reviewed September 4, 2017", 5.0, "Take Binoculars!", "If you take binoculars on your vacation for no other reason than this, do it, it's worth it. It will take a little while to acclimate yourself to the scale but as you scan the rock face with your binoculars you'll start to see the climbers who've probably practiced for years to scale this immense rock. It's a wonder to behold, not only the rock itself but these tremendous climbers. If you have a telephoto camera, that will probably work too. Once you get a sense of the scale of the people and then the rock, it blows your mind. There a lot of marked parking places along the side of the road where you can stop. We even noticed a ranger who set up a spyglass on a tripod one of the days we were there so little kids could see.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Should stop and camp for a while", "Its on the way to the peak and one of the beautiful attractions in the valley. If you are not camping you can just stop there for a while too.."], ["Reviewed September 3, 2017", 5.0, "A must do picture moment", "This is an amazing sheer rock mountain. Pictures will never do it justice. It is a must stop and look on the road."], ["Reviewed September 2, 2017", 4.0, "Wow", "We stopped and watched climbers on El Capitan. It's amazing how people will climb it. It must be extremely satisfying to make it to the top."], ["Reviewed August 31, 2017", 4.0, "very nice", "You cannot miss El Capitan when visiting the Park. It is very majestic and give many photo opprtunities, especially in the afternoon. We liked the Half Dome a little bit more, hence only 4 points, but it is still very impressive!"], ["Reviewed August 30, 2017", 5.0, "OMG the best in the world !", "I travel the world, and this is the most awesome you will ever find. this is the favorite place in all the world for big wall climbers! If you are not a climber or if you are , stand back and look you will see the climbers on the face. OMG !\nShow less"], ["Reviewed August 30, 2017", 5.0, "Incredible, great place!!!", "Great spot to park your car and stayed for a cople of hours just looking at this impressive rock. It is a must that you should see when visiting Yosemite. You can use the shuttle to go if you leave the car in the parking zone or if you do not have a car.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Great photo opportunities", "We didn't climb this or get near other than from some fantastic vantage points through various parks, tunnels, etc. Depending on the light it can be very spectacular and adds to the overall appeal of this area. You will see this just because you are visiting in Yosemite.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Breathtaking wall in front of you", "When visiting Yosemite Valley, it's impossible to avoid the views of El Capitan. There are no words to describe this huge, giant wall of rock in front of you. You can stop and park your car and simply stare. Highly recommended."], ["Reviewed August 26, 2017", 5.0, "Still The One", "Standing there as always. No visible change since the almost 50 years since I had seen it before. Just as majestic and photogenic as it always has been."], ["Reviewed August 24, 2017", 5.0, "Amazing hike to the top", "We hiked from the backside, near Tamarack Camp to the top. Around 4 hours each way. The hike starts off pretty easy and then there are a few steep sections along the way, but the trail is well marked. Best to start as early as possible to avoid hiking in the heat. Take plenty of water, the views from the top are incredible. Even with the forest fire, the sense of scale is breathtaking.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Spectacular", "You should bring your binoculars to warch the climbers making their way up here! The sheer face of El Capitan is more than spectacular. Easy to see from the valley fllor (you cannot actually miss it!) but visible from many of the famous viewpoints (half dome etc)\nShow less"], ["Reviewed August 22, 2017", 5.0, "WOW", "I have visited a lot of mountains all over but the fact that this Rock just charges up to the clouds out of the ground is astounding.\nUsually you get hills then bigger ones climbing up to the maximum peak.\nThis is a wall of granite.\nA must on a natural world bucket list even if you are not a climber\nShow less"], ["Reviewed August 17, 2017", 4.0, "Beautiful at Sunset", "We were very busy all day, touring the fountains and the lakes and attending the briefing sessions etc, the free air conditioned bus was a welcome relief from heat and far more preferable to paying for the valley floor tour. We had an excellent day and then when leaving we were met with the sight of El Capitan - I could not help but take the photo of the sunset against it.\nLovely place all round.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Majestic", "The granite El Capitan is just spectacular. It is amazing to look at and even more amazing to watch climbers go up the face."], ["Reviewed August 16, 2017", 5.0, "Stunning -- what more need be said?", "How could one not notice and be impressed by El Capitan, the most iconic spot in Yosemite? Easy to spot from various vantage points and very much a photographer's dream."], ["Reviewed August 15, 2017", 5.0, "Spectacular", "This is my favorite. What an impressive and a great hike. It's easy to get to and worth the visit. If you hike around it, you need good hiking shoes."], ["Reviewed August 15, 2017", 5.0, "Required - And look from different points", "I question anyone who gives this less than 5 stars. Wherever you are El Cap presents an imposing view.\n\nAt dusk you can often see climbers and their twinkling lights getting ready to sleep on the rock before resuming their climb the next day.\n\nThe colored vertical striations mark granite that has fallen away and adds beautiful texture to El Cap.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Wow", "Another amazing view in Yosemite national Park that you must see. I still like the half dome hike the best for the most spectacular views. L Cappy Tan is just beautiful!!"], ["Reviewed August 14, 2017", 5.0, "Respect to the climbers", "So impressed with the climbers that we viewed scaling this incredible rock. It takes days to complete this rock especially the nose. Mind blowing"], ["Reviewed August 13, 2017", 5.0, "Impressive.", "If you stop on the north road around a mile after the El Capitan spot on the National Park map, you can walk out into the marsh land to take a picture of El Capitan in its entirety.\n\nYou can then cross the road, find the trail and walk up to the face of the rock. This trail appears on Google Maps, even without data. This take about 20 minutes up and 10-15 down. Well worth it, even if it is a little off the beaten track and it's rather steep and rocky!\nShow less"], ["Reviewed August 8, 2017", 5.0, "WOW!", "Such majesty in this valley. I can't believe people actually climb this huge mountain of granite! There is not enough to be said about the beauty and serenity. You have to see it for yourself"], ["Reviewed August 7, 2017", 3.0, "IMPRESSIVE ROCK FACE", "You can get many views of El Capitan from different vantage points along the road at its base. If you're the rock climbing type you can get a permit to scale it (not me, I'll admire from Terra Firma)."], ["Reviewed July 27, 2017", 4.0, "Only from the bottom", "We only experienced the great might of this 900m high rock face from the bottom, and it was impressive enough, let alone from its top. Ideal for rock climbers and base jumpers, but it is extremely tough to get to the top."], ["Reviewed July 21, 2017", 5.0, "Amazing!", "We viewed this on the way into the valley complex mainly because traffic was so backed up. The best for us was to view on the way in and out of the park."], ["Reviewed July 16, 2017", 5.0, "WOW!", "Just the view from the road coming into the Park is spectacular. Many people pull over to the side of the road and just gaze up and photograph this natural wonder."], ["Reviewed July 15, 2017", 5.0, "Impressive", "Yes, it is a most impressive Wall, knowing that it is frequently climbed. You get a good look at it driving into the valley, and it is an easy 15 minute hike through some bushes to get to the bottom of the wall on your drive out of the valley, to get a true Impression what a climbing is truely about.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Watching the climbers scaling El Capitan made our knees tremble!", "Awesome place.....the scale of it is difficult to describe ....every way you look the views are amazing.....so glad we made the trip"], ["Reviewed July 12, 2017", 5.0, "Awesome", "Picnicking under El Capitan is something everyone should experience at least once in their life. There's nothing like it!!"], ["Reviewed July 7, 2017", 5.0, "Love love love", "El Capitan is an awesome rock formation that is down near Yosemite falls. Not sure, but I think they allow hikers to climb this massive formation. Don't quote me on that tho. I do know one of the rocks there has a lottery ppl bid on to climb each year. It's peaceful near here and just a great site to see. It's a must for sure\nShow less"], ["Reviewed July 7, 2017", 5.0, "Stunning views", "Another wonderful place to visit. El Capitan is a vertical rock formation located on the north side of Yosemite Valley near the Western end. This area extends to around 3000 feet from the base to its summit and is another fantastic picture moment!"], ["Reviewed July 5, 2017", 5.0, "Amazing!!", "Most people have described it and they are not wrong, but only you can live the experience if you come here! It's a must to see when in Yosemite, the views are amazing and the idea of you looking at it with your own eyes will make you have your own description of this place! Come to Yosemite and experience why millions of people have come and will continue to come!!\nShow less"], ["Reviewed July 4, 2017", 5.0, "Awe inspiring", "When we visited we couldn't believe the sheer size of El cap. The photos don't do it justice. We could see people rock climbing it who must be crazy! This should definitely be on anyone's list when visiting Yosemite!"], ["Reviewed July 4, 2017", 5.0, "Awesome", "You stand in awe in front of this majestic view. It is truly amazing to see this rock rise from the valley floor. Never stops amazing me every time I return to Yosemite."], ["Reviewed July 3, 2017", 5.0, "Mother Nature has given it a heart", "The size is awesome you just keep looking up higher and higher, no photos will ever do its size justice. Once the Yosemite ranger pointed out it's heart which has been naturally carved out, it feels like it it's the centre of Yosemite."], ["Reviewed June 26, 2017", 5.0, "The Majestic El Cap", "If you're in the valley you won't be able to miss the majestic El Capitan, it is truly impressive. You will be in awe by its grandiose!"], ["Reviewed June 26, 2017", 5.0, "That's a nice boulder!", "I like the Indian legend regarding El Capitan and Half Dome. El Capitan is definitely positioned as the largest granite formation but also as a stubborn \"male\" whom beat several interglacial periods. Bring binoculars to watch the climbers. At night, they are easier to spot with their lights. Applause to those who climb it, especially at night.\nView from tunnel, meadow or off Merced banks on trails all do justice to this definition of a rock.\nShow less"], ["Reviewed June 20, 2017", 4.0, "Big Granite rock", "Big granite rock. We can reach by shuttle bus of the valley or by car. Parking must be tough on busy days."], ["Reviewed June 20, 2017", 5.0, "People climb this!", "You will be amazed by the sheer cliff up which people climb. We saw a climber the day we visited. There are a number of good spots from which to view it."], ["Reviewed June 19, 2017", 5.0, "Check in with Climbing Rangers", "There is a a program sponsored by the climbing rangers during the summer that is very interesting. It is on the east side of the road just south of the river. Climbing rangers have spotting scopes set up to allow you to see the climbers currently making the ascent of El Capitan. They have informative posters and are willing to answer any and all questions. A typical climb take 3-5 days. The very first ascent took 45 days. The fastest ascent was done in less than 3 hours.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Sheer GRANITE beauty!!", "El Capitan's sheer size and beauty creep up on you, it's unassuming until you come around the curve after the tunnel, and it rises out of the ground like the force of nature that it is!! It's absolutely breathtaking. The weather was clear and the sheer granite glinted in the sunlight. The water rushing in the river in front of El Capitan offered spectacular peaceful views, a great spot to take in lunch or just relax.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Stunning scenery - just take time to admire Mother Nature!", "My wife and I took a day just driving in and out of Yosemite Valley and El Capitan was one of the most visually striking parts of the journey...park up in one of the many spots along the roadside, get out of the car and just look around, and up...I took 20 minutes to stroll down to the river (where I saw some young deer playing) and walked around this area just taking photos and admiring what a wonderful place Yosemite is. Just take some time out to soak up one of the most spectacular sights in the national park.\nShow less"], ["Reviewed June 16, 2017", 4.0, "Very interesting", "Neat granite wall, fun to look for climbers. We saw a couple on wall. One night it looked it like we saw a light in the middle of El Capitan"], ["Reviewed June 16, 2017", 5.0, "AWESOME", "Yosemite is just inspiring. Great views, majestic peaks, and a sense of just being a speck within a larger universes. The key to Yosemite is getting there early before the crowds."], ["Reviewed June 15, 2017", 5.0, "This is it!", "Not a rock climber. I do appreciate El Capitan though & watching people climb it is a popular pastime from the meadow down below. There's a long pull out to accommodate those who want to watch the climbers. Remarkable how small they appear!"], ["Reviewed June 13, 2017", 5.0, "El capitaaaan !", "One of the best prts of yosemite valley ! Just enjoy the view and selfies from the tunnel point ! :)"], ["Reviewed June 10, 2017", 5.0, "Climbers from all over the world go to El Capitan", "There were 20 climbers while we visited El Capitan. A ranger had a spotting scope across the road and we enjoyed watching them. It takes 3 to 5 days on average for climbers to reach the top. It is an awesome mountain to look up and see people climbing it.\nShow less"], ["Reviewed June 10, 2017", 5.0, "majestic monolith monument", "can be seen miles away before you reach the rock and it is dazzling white from a distance, standing out even in the winter! seems to glow and emit a sparkling white light. very unusual with the rest of the outcrops."], ["Reviewed June 7, 2017", 5.0, "Massive, Lovely", "It really was jaw dropping to see this for the first time. We were there on a clear day and it is just magnificent."], ["Reviewed June 5, 2017", 5.0, "Talk to a Hiker each afternoon from noon-4pm", "Stopped by and talked to a hiker - volunteers from the Yosemite Hiking Association who have telescopes and are available to answer questions. Hikers are on El Cap every day. It's a 2-3 day climb. Don't miss the \"Talk to a Hiker\" on the bridge opposite El Cap\nShow less"], ["Reviewed June 4, 2017", 5.0, "Breathtaking!", "I viewed this massive block of granite from several different points, and was inspired by all of them. The size of it can only be appreciated in person."], ["Reviewed June 2, 2017", 4.0, "Attractive", "El Capitan is the most attractive destination in the Yosemite National Park. The mammoth cliff is mesmerising and instigates awe when you think that many people climb this giant."], ["Reviewed May 31, 2017", 4.0, "Rock climbers look like ants", "Lots of activity on the rock during our bus tour of the valley floor. Impressive sheer face of rock but not necessarily beautiful."], ["Reviewed May 30, 2017", 5.0, "El Capitan", "I love the name of this mountain formation. It is perfect. This is indeed \"El Capitan\". Now I have a picture of it sitting in my living room for all to see to show that I have been up close and personal with it."], ["Reviewed May 29, 2017", 5.0, "Breathtaking!", "El Capitan is a spectacular geologic feature and an awe-inspiring site. On the night of the full-moon, we were able to monitor the progress of climbers scaling El Capitan by watching their head-lamps/lights. Coupled with the nearby waterfalls and river scenes, Yosemite National Park is a must-see.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Incredible views", "Our shuttle bus stopped here. On our way the drive was very informative and told us about the rock climbers and special facts about them. It was away from the falls and was not as busy as Half Dome or Yosemite Falls. Was very peaceful. We arrived there in late afternoon and the sun was hitting the side of the granite perfectly. Our pictures were so perfect they almost did not seem real as though they are stock photos from postcards.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Key Monolith in The Park", "Said to be one of the largest chunks of Granite in the country it sticks up above Yosemite Valley as a landmark in the western Yosemite Valley. Favored by rock climbers the meadow below fills with observers watching the climbs, bring binoculars."], ["Reviewed May 26, 2017", 5.0, "Amazing to see the climbers", "Not just a magnificent sight, but amazing to watch the climbers. Take the tour then go back to see the site and walk the grounds."], ["Reviewed May 22, 2017", 5.0, "Amazing!!", "El Capitan was a stop along our tour route. Again, plenty of time to view and take pictures. Our tour guide pointed out climbers which we were able to see and photo."], ["Reviewed May 19, 2017", 5.0, "El Capitan", "Majestic granite mountain. People who are rock climbers often try the skills on the face (I think you have to get permission). There is a way to get to the top on the backside, pretty tough (not as bad as the front, you need to have good gloves and hiking boots). Standing below and looking up at the smooth surface is amazing.\nShow less"], ["Reviewed May 18, 2017", 5.0, "It IS The Captain", "Well, the largest, highest unbroken cliff face on Earth. The scale of El Capitan cannot be captured on film or digital media. I have tried many times. Here is what you have to do to really appreciate it. Park nearby (if you can). Go a good ways out into El Capitan Meadow. I mean 50 yards or more, not by the road. Bring binoculars and a portable chair if you have them. Now just sit and view this amazing cliff. You will catch a brief tiny reflection, something moving? If you have binoculars you will find them. Climbers. Probably several different teams of them on several different locations on the wall. What is ASTOUNDING is how tiny they are, even in your binoculars. Literally as grains of sand on the floor of a stadium. It is both surreal and beautiful. A place and a sight to linger beneath, to take in and revere, not just to snap a picture or 2 and leave.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Amazing!", "This mountain in Yosemite is absolutely stunning! Worth going to see... every minutes, what a site to enjoy"], ["Reviewed May 15, 2017", 5.0, "A stop dead in your tracks, wake me up I'm dreaming, monumentally beautiful piece of God's handiwork.", "When you first see it, you realize all the pictures you've seen are just that - pictures - providing you only a glimpse of what is before you. It is, quite simply, awesome. Whether you first see it from Southside Dr, Tunnel View, or from the meadow, it will leave you speechless. It is a very special place indeed - I hope you take some time to linger as I did. My favorite place to view El Capitan was the Meadow (El Cap Meadow). Across from the Shuttle bus stop, to the south, there is a large meadow. If you follow the trail along the river, you will come to some shade trees...I found this to be a great place to sit and take pictures, relax, eat lunch (or dinner, or breakfast, or second breakfast, or..) and just be. Great views of El Capitan can be had from many places in the Valley. Another great place to see EL Cap is from the Valley Loop Trail..the face changes as you make your way along the trail. If your fortunate, you'll come across one of the telescope viewing stations the park rangers set up to watch the climbers on the face. In my humble opinion, not as iconic as Half Dome, but right there...and much more accessible.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Amazing", "Amazing. Awesome. One of the cooler things that I have ever seen. And going in the spring when the water of flowing down makes it better. I had a beautiful day and a somewhat polished granite mountain is a site to see."], ["Reviewed May 8, 2017", 5.0, "Incredible site", "During our Yosemite journey we stopped on two different occasions to view this beautiful mountain. Take lots of pictures."], ["Reviewed May 5, 2017", 5.0, "Plain beauty", "After watching Valley Uprising I was so hyped to see El Cap for our Yosemite trip. My husband and I hiked almost to the base of El Cap from Bridalveil Falls. We found this to be an easy, flat, empty trail. Once we reached Cathedral Beach (also found this online referred to as Capitan Crossover) the river was so beautiful and tranquil. The plan was to go to the base of Cap but because we enjoyed the view from here so much and were able to see the climbers from our binoculars we opted not to continue. Next time i'd love to go up to it and just sit and watch the climbers do their thing.\nShow less"], ["Reviewed May 4, 2017", 5.0, "Everlasting Beauty", "Coming up from Oakhurst on US-41, you will pass through the tunnel. Be ready to stop right as you exit the tunnel. Park and be prepared for what is before you. Behold, the grandeur of Yosemite."], ["Reviewed May 2, 2017", 5.0, "awesome", "Well what can you say it was awesome and as it is the screen saver on my macbook it was great to see it for real."], ["Reviewed May 1, 2017", 5.0, "Gotta see it!", "You simply must see this (and you will) if you visit Yosemite. The fun thing is to take a pair of binoculars and look for climbers on the face of the wall. We spotted a yellow tent 2/3 of the way up and later saw the climber who had spent the night way up in the air. Unbelievable!\nShow less"], ["Reviewed April 29, 2017", 5.0, "Towering Iconic Rock Formation!", "El Capitan is an absolutely massive and iconic rock formation that towers above Yosemite Valley and is best seen from Tunnel View."], ["Reviewed April 25, 2017", 5.0, "You can't miss it..", "Coming in from California Highway 120 side you must go down to the valley floor to take in the massive Mountain, Wow what a view of a massive slab of granite. Once you're on the valley floor you will drive right by it you cannot miss this you won't have a choice you can use this as a Landmark if this is your first time here. I know I know you're going to take lots of pictures but it just does not do this mountain Justice as anywhere in this park the camera just does not give you what you actually see.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Get there early", "Our first day into Yosemite, we ran into a 2 hour wait to enter the park. We decided to turn around and start out early the next morning. We arrived the next morning 6:30 am and did not have any traffic or crowds. The park was quiet and peaceful and viewing El Capitan in the serene sunrise early in the morning was majestic. Watching the light slowly bounce off the granite and enjoying the peaceful serenity of nature at its most beautiful was the highlight of our trip.\nShow less"], ["Reviewed April 23, 2017", 5.0, "Magnificent Beauty", "El Capitan is absolutely beautiful, a truly awesome sight. Together with fellow iconic behemoth Half Dome, it towers above Yosemite Valley and makes for incredible scenery.\nI don't think anyone has ever come to Yosemite without being wowed by El Capitan, a majestic and stunning sight. Get your camera ready...!\nShow less"], ["Reviewed April 23, 2017", 5.0, "amazing", "we absolutely loved it, it is one of the key sights in the valley. one can take walks to go around it"], ["Reviewed April 20, 2017", 5.0, "Awesome!", "What more is there to say apart from awesome! Make sure you stop along the trail to take in the sheer size of El Capitan."], ["Reviewed April 20, 2017", 5.0, "Must See", "There's little to say except that if you go to Yosemite you must stop at El Capitan. We don't climb but we had to see this anyway. My family particularly enjoyed finding the spot used in the Star Trek movie and pretending to be Kirk, McCoy and Spock.\nShow less"], ["Reviewed April 16, 2017", 5.0, "El Capitan is the signature view of Yosemite.", "El Capitan is a high mountain with a sheer cliff face that is very popular with rock climbers. The valley roads and the Tunnel View give excellent views of El Capitan."], ["Reviewed April 12, 2017", 5.0, "Wish to climb El Capitan!", "Hahaha, in my dreams I wish to climb El Capitan but for now, it's enough to just admire the beauty and relax with family."], ["Reviewed April 9, 2017", 5.0, "Pictures may be worth a thousand words but being there is better!", "I am now retired. In second grade I wrote a report on El Capitan and Yosemite National Park. My whole life I wanted to SE in reality what I had only seen in pictures. Reality was NOT a disappointment!"], ["Reviewed April 6, 2017", 5.0, "Still the King of the Valley", "A road takes you right past this grand natures monument.\nOne cannot be at aw by this structure when you are next to it.\nI was fortunate enough to be next to it one early morning when not much folks are around you, it provided this powerful,soothing feeling in me that it was sensational. Like whatever trouble I have is minuscule, and we are just a small part of a very very long journey, so we should just solder on. Things will be fine.\nShow less"], ["Reviewed March 25, 2017", 5.0, "The Rock", "Sean Connery said it, but about the wrong rock. El Capitan is The Rock, and welcomes you into Yosemite Valley. It's amazing that it can surprise you upon entrance to the valley on 140. The first stop on the one way (also at Bridalveil Fall), El Capitan will dominate your left. Ribbon and Horsetail Falls bracket the monolith.\nShow less"], ["Reviewed March 7, 2017", 5.0, "Majestic El Capitan", "El Capitan is truly out of this world in its beauty! Watching El Capitan is totally exhilarating! God is so wonderful in gifting mankind this breathtaking beauty!"], ["Reviewed March 7, 2017", 5.0, "The King Of Rocks for Climbers", "The view of El Capitan can be seen all over the valley. The horse tail falls on the shoulder is where firefalls takes place for 2 weeks in February."], ["Reviewed February 20, 2017", 5.0, "Impressive sight", "The sheer size is stunning you don't realise how tall El Capitan is, especially from the valley flor"], ["Reviewed February 16, 2017", 4.0, "One of the most famous granite rocks in the world.", "You can hike up to it or you can take a tough hike up the backside to the top. OR....if you can really climb, straight up the face. Even watching the climbers from the bottom is very cool."], ["Reviewed February 15, 2017", 5.0, "Impressive!", "You can't really get the scope of its enormity until you have stood under it. (That's what she said.)"], ["Reviewed February 13, 2017", 5.0, "Exciting", "Take pleasure in the beauty of Yosemity National Park. Watch mountain climbers traverse the sheer sides of El Capitan. Exquisite waterfalls all year with some of them frozen in winter. Magnificent trees and scenery. Great hiking and camping. Enjoy Mother Nature at its best."], ["Reviewed February 8, 2017", 5.0, "Must See! Drive right up :)", "Once you see it, you'll know why it's named El Capitan! Way into the park with plenty of other stops inside and lots of geological formations. A great day of lots of pictures and just soaking it all in."], ["Reviewed January 30, 2017", 4.0, "Spectacular", "Spectacular vertical granite rock formation which dominates the view from Tunnel View. Apparently it is possible to climb to the top. One of the visual highlights of Yosemite."], ["Reviewed January 27, 2017", 5.0, "El Capitan", "Try going in the winter time. The view is spectacular any time of year. There are few visitors, so you spend less time navigating and more time sight seeing."], ["Reviewed January 16, 2017", 5.0, "Pretty Incredible View!!!", "October 12, 2016. Beautiful views of this majestic mountain as you enter the park and as you drive along the entry road you can pull over and get some photos underneath the mountain which are just as magnificent. This is one of those highlights of your visit.\nShow less"], ["Reviewed January 12, 2017", 5.0, "The Captain of the park", "Many things are not possible to capture on camera, and El Capitan is one of them. It's very noticable from many viewpoints of the park. The best, I think, is from Tunnel View. It stands there always still, so big and so strong, like watching everything. And it totally deserves it's name. For me it was enough just to admire it from far, but you can climb it if you want.\nShow less"], ["Reviewed January 2, 2017", 3.0, "Impressive", "The park service has telescopes and Rangers set up at a viewing area to allow you to track the progress of climbers on the face."], ["Reviewed December 21, 2016", 5.0, "Sheer rock face", "You can't miss it. The roads around Yosemite are all one way so make sure you pay attention to the signs! Without a doubt one of the highlights of Yosemite Parking is close"], ["Reviewed December 17, 2016", 5.0, "Stunning", "A drive though US National Parks is among the most spectacular things I have done touring the US, and I have done it more than once with family. Yosemite is iconic and El Capitan a reason for it, along with Cathedral Rocks, Glacier Point, Half Done, many others\nShow less"], ["Reviewed December 15, 2016", 5.0, "Watch the Climbers!", "Our afternoon treat was to drive to the meadow with our binoculars and start looking for climbers on the walls...the more we looked the more we saw. But remember your Binoculars!"], ["Reviewed December 10, 2016", 5.0, "Awesome", "Spectacular sight even though we did not climb it!! leave that to the experts. We could see two climbers on the day we visited."], ["Reviewed December 10, 2016", 5.0, "A wonder of the world", "El Capitan is one of if not the largest single piece of granite on the planet. To stand and look is always awe inspiring. I tell everyone who goes to yosemite to stop at every turnout and get out of the car and take the time to look in all directions. The views are incredible and the sight of El Capitan is mind boggling. With you Binoculars be sure to scour the face of the rock for climbers. They are always there, and the enormity of the face of El Capitan makes the first climber hard to spot. Then magically you can find many climbers. What a view, what a place, Yosemite\nShow less"], ["Reviewed December 6, 2016", 5.0, "Majestic!", "Photos cannot begin to truly depict the majesty and beauty of this gigantic granite mountain. We were disappointed and sad to see so many dead trees due to the five-year drought in the area, however."], ["Reviewed December 5, 2016", 5.0, "Monster of a cliff face", "This was the last stop of a day trip I had booked to Yosemite and it was an amazing way to cap it off. The rock face is gigantic with lovely surface colour. Fun fact: rope-free climbers who attempt it have to spend between 3 to 5 days on the cliff face to do so.\n\nHowever one of the biggest records held is by the climber dubbed \"The Human Spiderman\", he climbed El Capitan in just over 2 hours.\nShow less"], ["Reviewed December 1, 2016", 5.0, "Worth the drive, so worth the time!", "Shhh! Don't let this get out, that this is one of my favorite vacation spots in the world. Views of rocks are so incredible. We got there at dark and woke to incredible views!"], ["Reviewed November 29, 2016", 4.0, "Gigantic Rock", "As part of my day tour from SFO, the tour operator stopped here. The rock formation is gigantic. I believe a lot of rock climbers come and camp here. I walked close to the rock and came back. Saw a herd of deer grazing there. I am not sure how one could climb this. the tour operator told us that the first climb took some 45 days. (not sure how one would eat, sleep and pee while climbing for 45 days). the record is 2.5 hours it seems. I am not sure if there are trails to go to the top of the rock. Must be fascinating for rock climbers.\nShow less"], ["Reviewed November 22, 2016", 5.0, "Majestic rock formation", "I have never heard of Yosemite National Park before until my godmother told me about it and brought me there when I visited her last August. The road was long and winding from San Francisco to Yosemite but it was all worth it. This was my very first visit to a national park in the US and I never imagined it could be that magnificent. I was truly astonished by the beauty of the rock formations, the lush meadow and the serenity of the park.\n\nStanding tall among the rock formations is El Capitan which is located on the northern side of the Yosemite valley. It was a breath-taking massive granite monolith! I was told that it is one of the most challenging sites for mountain climbers and I can't imagine how one can go to its top considering its height. Definitely not one of my dreams to reach its top... I was more than happy to just have the chance to watch it from afar and to have taken some photos although the photos do not really give this wonder justice.\nShow less"], ["Reviewed November 20, 2016", 5.0, "He's a handsome fella", "If you get a chance, visit this handsome old chap on your next visit through the valley. El Capitan makes for a delightful feature in any of your photographs."], ["Reviewed November 15, 2016", 5.0, "One of the main granite monolith's in Yosemite", "It is something to behold. Gives you a respect for Mother Earth. You don't have to be one of the hardy climbers to appreciate this huge piece of granite. It is one of the main features of the park."], ["Reviewed November 15, 2016", 5.0, "Majestic", "Amazing! Brilliant! Beautiful! All the way up the mountain the views were spectacular, but this structured was amazing! We also got a glimpse of someone climbing it! A must see."], ["Reviewed November 14, 2016", 5.0, "The most imposing Granite structure in Yosemite Valley", "You can't miss it. Bring binoculars in spring and see if you can find rock climbers perched on the face."], ["Reviewed November 11, 2016", 4.0, "tall", "Of course we only looked at it from the bottom, but it was a majestic view of the giant. The shuttle takes you at its foot."], ["Reviewed November 11, 2016", 5.0, "You will only see this in books or in person", "Can't miss this and can't miss this.\n\nIncredible sight. We spent hours in the lower meadows picnicking and watching climbers through binoculars. Wish we had a telescope! Also met climbers roaming the area and viewing other climbers' progress.\n\nWhat we learned; early evening is amazing to view when climbers headlamps are on.\nShow less"], ["Reviewed November 6, 2016", 5.0, "OMG", "Seeing this for the 1st time is so overwhelming and very emotional. Speechless!! Got some amazing photos!!"], ["Reviewed October 31, 2016", 5.0, "Devil's elbow swim under El Capitan", "We swam in the Merced River under El Capitan at a section called Devil's Elbow which was in the shadow. It was incredible to look up at the huge formation and see it towering over the park. Breathtaking."], ["Reviewed October 30, 2016", 5.0, "Amazing!", "We toured Yosemite; El Capitan was amazing! It is breathtaking, and pictures do not do justice to it."], ["Reviewed October 28, 2016", 5.0, "Impossible to ignore", "Which ever route you take there it is! Definitely the show stopper. It really is incredible to see this rock at all it's angles. So majestic"], ["Reviewed October 26, 2016", 5.0, "Wow", "This is one impressive bit of rock - thank heaven no one was climbing it while I was there! Beautiful to behold."], ["Reviewed October 26, 2016", 5.0, "Excellent.", "You drive your car into the valley and are driving slowly along the road and suddenly, you see it. There it stands in all its glory, El Capitan. The day we were there the sun was shining brightly on it and it just seemed to sparkle, making it all the more outstanding.\nShow less"], ["Reviewed October 25, 2016", 5.0, "Hiking El Capitan via Yosemite Falls", "This is easily the most astounding hike I've ever done. I couldn't find many reviews anywhere or trail tips so here is mine.\n\nWhat we could find to read told us this hike was a 14 mile roundtrip; in actual fact it was about 17/18 miles.\n\nWe started in the valley, taking the trail for camp 4 towards Yosemite falls. It took us about an hour to reach the base of upper falls.. this section is pretty steady uphill but not too gruelling, and partially shaded. The section between the base and the top of upper falls is much more strenuous and we stopped often to sip water and snack.. it took another hour to do this section. The sun was on us the whole time.\n\nAt the top of the falls the trail sign said El Cap was 4.7 miles away. It was a welcome relief to escape the sun and head through the forested area, this section of the hike was an easy gentle up and downhill climb with some incredible vistas.\n\nWe went straight to El Cap and saved the 0.3 mile detour (which is absolutely worth it) to Eagle Peak for the return journey.\n\nBeing on top of El Capitan afforded us the best view of Yosemite I've ever seen.\n\nI had 3 litres of water and my friends brought between 4 and 5 and we had plenty of snacks and lunch.\n\nWe did the hike on October 22nd, the temperature high for the day was 77'f\n\nAbsolutely do this hike but be prepared that there is a LOT of downhill dusty rockery on the way back and your feet will not be your friends!\nShow less"], ["Reviewed October 23, 2016", 4.0, "Iconic", "You cannot miss this majestic wall when entering Yosemite Valley. Very impressive from down the valley floor and easily to be seen from the car."], ["Reviewed October 22, 2016", 5.0, "The Captain", "Along with about 10 other sites around the Yosemite Valley, this is also a must gaze and gaze, beautiful"], ["Reviewed October 22, 2016", 4.0, "Impressive", "A definite must see at Yosemite. Won't disappoint. Love the height above me. Even better than in the pictures."], ["Reviewed October 22, 2016", 5.0, "Bring serious binoculars or a telescope to watch wall climbers, or...", "This massive rock is impressive, as are the dare devils that climb it. You can watch from many viewpoints, but aside from the wall itself the main attraction is the climbers. They take days or even weeks to scale this 3000' wall. The Park itself offers telescopes for viewing climbers from one of the pastures in the late afternoon, and you can also see some of the equipment and chat with a climber. Feel free to help them out if they look hungry or thirsty. You may also want to view \"Valley Uprising\" and \"The ascent of Alex Honnold\", before and/or after your visit. They defy the notion of gravity.\nShow less"], ["Reviewed October 21, 2016", 5.0, "Awesome", "Just go and see it and prepare to be amazed at the huge scale and bulk of it. Over 3,000 feet of sheer granite makes for an impressive spectacle!"], ["Reviewed October 21, 2016", 4.0, "It's a huge rock - right in front of you", "You can see this up close on the Southside Drive, there's a stop on the along the road and you can't miss it. Another place to view this is at the Tunnel View."], ["Reviewed October 19, 2016", 5.0, "Look for climbers", "We were enjoying the view when we saw movement - a group of climbers going straight up! That made it even cooler to see!"], ["Reviewed October 17, 2016", 4.0, "The second of two iconic rock formations in Yosemite", "That is not as easily viewable is half down. The most impressive view is from the Tunnel view parking lot. Again, if you can arrive there at the desk, you'll have an awesome view and picture"], ["Reviewed October 17, 2016", 5.0, "Such a Beautiful Site", "I stand in Awe at your feet, and look up to your tops. I visited here last year and there was smoke in the Yosemite Valley, that blocked the Tunnel Valley View and Half Dome, but seeing El Capitan was a true highlight/"], ["Reviewed October 17, 2016", 5.0, "Wow - When You First Catch Glimpse", "One of THE sites you want to see when entering the Valley. Just an amazing slab of near vertical rock.Far better in life than on the best photo."], ["Reviewed October 15, 2016", 5.0, "You can climb this!", "We had to work around road closures to get to the bottom of this magnificent rock but it was worth every minute.\nNow when I was there I could see six sets of climbers scaling El Capitan. It takes years of dedication, training, skill, fearlessness and I'd hope kind weather.\nI spoke with one of the girls and her husband had climbed it after training for several years.\nShow less"], ["Reviewed October 14, 2016", 5.0, "Spectacular", "Truly awe inspiring. I am glad we made time in our trip to visit Yosemite and El Capitan in particular. There are plenty of places to park along the way and get out to take in the view and take pics. The view of El Capitan from the Majestic Dining room was something we will treasure\nShow less"], ["Reviewed October 13, 2016", 5.0, "Incredible", "There's a reason this is the image so closely associated with Yosemite. It is a breathtaking monolith. It towers over the valley and is incredible. The granite icon can be viewed from many of the most popular tourist spots. While viewing it with the naked eye is a treat, binoculars add a special experience. On most days you can see climbers making their way up the sheer face. It's pretty amazing to look through the binoculars in early morning and watch the climbers emerge from their sleeping bags or tents while dangling halfway up.\nShow less"], ["Reviewed October 11, 2016", 5.0, "Stunning", "Yes it really is that stunning and impressive. A must see. You pass it on the road to Yosemite village and there are plenty of places to pull up, get out and take photographs."], ["Reviewed October 10, 2016", 5.0, "Awe inspiring and Iconic", "I have been wanting to come and see El Capitan for myself since discovering the works of Ansel Adams 30 odd years ago. I wasn't disappointed in any way and wish I could of spent much more time here and the rest of the valley.\nThere are plenty of good viewing spots from the road and it is well worth while pulling over at the end of the day as El Capitan catches the light from a setting sun.\nShow less"], ["Reviewed October 10, 2016", 5.0, "Amazing to watch climbers! Bring binoculars!", "We didn't have binoculars but there was a small set up where you could \"ask climbers questions\" and they had two large telescope/binoculars set up and set up to view the climbers... it was nice they had that set up and you could view the climbers thru it. We enjoyed hearing about it.\nShow less"], ["Reviewed October 8, 2016", 4.0, "Good to see", "We had travelled on the 120 from Mammoth so had seen some fantastic views already. If you only you only go into the valley then this will impress. It a good view and impressive in size."], ["Reviewed October 2, 2016", 5.0, "Rock climbers", "El Capitan is a must see destination in the park. If you're lucky, you'll get to see rock climbers, but they're very hard to see unless you're real close to El Capitan. Might want to bring binoculars."], ["Reviewed October 2, 2016", 5.0, "Beautiful Mountain", "El Capitan is known worldwide as vertical granite rock formation that is challenging for rock climbers everywhere. It is also a true highlight at Yosemite National Park. It can take five days or more to get to the peak or just minutes to enjoy it from a safe distance.\nShow less"], ["Reviewed October 2, 2016", 5.0, "Natural wonder", "Loved this stop driving through Yosemite National Park, such a natural wonder of the world, not to be missed."], ["Reviewed September 30, 2016", 4.0, "Majestic", "Observed this from 3 locations - as soon as you enter the park and get on the circular trail. From across the mountain where there are telescopes and you can see climbers. from Sentinel dome - great view and hike. Maybe Tate's point could have been better but once you have done the Sentinel dome hike, it did not make sense to also do Tate's point.\nShow less"], ["Reviewed September 29, 2016", 5.0, "El Capitan - in the Top 5 Things to See in Yosemite NP", "From any angle, any viewpoint, El Capitan is truly a majestic marvel of glacially sculpted granite. You an see it when you first drive through the Tunnel as you make your way into the Yosemite valley...but El Capitan is also magnificent from many other vantage points throughout the valley. And it's almost impossible to take a bad photograph. Dont' miss !!! FYI, the best time to visit Yosemite NP would be in May, before Memorial Day weekend hits and the crowds start to become overwhelming; or in the fall, sometime after Labor Day weekend, when the crowds have thinned. But be advised...if you want to see Upper/Lower Yosemite Falls you will need to do this in the spring, when the runoff is still going strong...otherwise, by September, the falls are completely dry...the drought has really had a major affect on the water falls.\nShow less"], ["Reviewed September 29, 2016", 5.0, "The Captain !", "Yosemite Park mountain par excellence. The park is awesome but this mountain even more, must see, don't forget !"], ["Reviewed September 28, 2016", 5.0, "Awesome", "As a novice rock climber I just gazed in awe at El Capitan - thinking \"one day.....\" Its an amazing chunk of rock - whether you're lucky enough to climb some of it (hopefully next time I visit I'll get to do a bit) or just explore the area near the bottom.\nShow less"], ["Reviewed September 28, 2016", 5.0, "Memories", "Standing under the El Capitan watching the rock climbers takes your breath away at the sheer scale of this rock."], ["Reviewed September 26, 2016", 5.0, "Awesome!", "Take the time to walk to the base and watch the climbers - you can even hear them talking to each other. The walk to the base is beautiful!"], ["Reviewed September 26, 2016", 5.0, "Superb, climbers must be nutters!!!", "Our guide for the day said it takes 2 days for climbers to do the 3000 feet ascent, sleeping halfway in hammocks suspended from the rock.\n\nThey then hike out for 2 hours to a road, then hitch hike back to their transport, what a bunch!!!\n\nSeriously impressive stuff, the Rock dominates all around it, would have liked to get closer to it, but time was against us.\nShow less"], ["Reviewed September 25, 2016", 4.0, "Another interesting sight", "We really just enjoyed our self drive tour through Yosemite National Park. We slowly drove from spot to spot on the map provided by the park ranger.\n\nEl Captian was were we parked and enjoyed our morning tea.... What a great backdrop.\n\nMore to see so only spent half an hour here, enjoying the scenery...\nShow less"], ["Reviewed September 25, 2016", 5.0, "Majestic must-see spot!", "My husband and I loved sitting in the park and watching the intense climbers scale this mountain. It's a beautiful backdrop and must-see spot in Yosemite!"], ["Reviewed September 25, 2016", 5.0, "Get close to the rock to see the climbers!", "If you go off the hiking path and follow the path that the climbers take to get to the base of the rock, you get some great views of various climbers in the midst of their climbs. It's a beautiful and fascinating site."], ["Reviewed September 25, 2016", 5.0, "Absolutely amazing natural phenomena.....", "Breathtaking.... no words can describe this beauty... one has to see for oneself! We visited mid August and falls were dry x 4 days apparently, but still it was amazing! Comfortable shoes and insect repellant required!"], ["Reviewed September 22, 2016", 5.0, "Easy to Miss ... Amazing Sight", "We came across this landmark and may have confused it at first with another one. While you are driving along the road be mindful of the signs. It is easy to miss."]]}}