{"Elephant Seal Rookery": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Elephant Seal Rookery", "url": "/Attraction_Review-g33039-d3729608-Reviews-Elephant_Seal_Rookery-San_Simeon_San_Luis_Obispo_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/49/58/a8/elephant-seal-rookery.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "2547"}, "address": {"@type": "PostalAddress", "streetAddress": "Piedras Blancas", "addressLocality": "San Simeon", "addressRegion": "California", "postalCode": "93452-9715", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Don't Miss It", "What a wonderful place. It felt like we were in the middle of a National Geographic episode. Nature at it's best. The seals are animated and beautiful in their natural habitat. I will return every time I drive Hwy. 1."], ["Reviewed 2 days ago", 5.0, "Bizaarly awesome", "Elephant Seals are one of the \"why?\" questions of evolution, or creationism, for that matter. They are huge masses of quivering flesh. They are also very loud. The alpha males spend a lot of time chasing the young upstarts. The harem lie about, disturbed only when the bull decides he want to mate. Not a nice sight.\nNature is indeal wild and wonderful.\nShow less"], ["Reviewed 2 days ago", 5.0, "Amazing creatures!", "Definitely stop here and view these amazing sea animals. This is the only place on earth where they come ashore. Huge creatures with an amazing life story. Great viewing area and easy parking right along the beach."], ["Reviewed 3 days ago", 4.0, "Fascinating Opportunity To See These Creatures", "We did not get to see the elephant seals in the numbers that are sometimes present, but it was impressive none the less. Well worth stopping to get a glimpse of them in their natural habitat."], ["Reviewed 5 days ago", 5.0, "Amazing!", "We watched this in late February. Great to see so many elephant seals sprawled on the beach, doing what they do. I missed (but my wife saw) a large male bellow and (very quickly) head for a female and mate. Quite impressive, I guess!"], ["Reviewed 1 week ago", 5.0, "Simply put one of the most amazing things I have ever seen.", "In 37 years on this earth I have never seen anything like this. Always had a soft spot for seals and these were amazing, to see hundreds up close with pups was truly magical. Outstanding place to visit and clearly well maintained and loved by local guides.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fascinating view of elephant seals", "It was the time of the year when the elephant seals had birthed and were now nursing their young. And we saw male aggression towards other males who were trying to steal the females in their harem. We stood and watched for several hours and were so educated and entertained. Wish we had time to bring a chair and spend the whole day! If you are in the area, they are MUST SEE!\nShow less"], ["Reviewed 1 week ago", 5.0, "Love LOVE the elephant seals", "We arrived shortly after birthing season to see all the gang hanging out on the sand. Watching these impressive animals was spectacular and a joy to listen to them as well."], ["Reviewed 1 week ago", 5.0, "Wow - what more can I say", "The whole reason we visited San Simeon was to see the Elephant seals, and we were so glad we did, there is so many of them. This place is awesome and outweighed our expectations, we could have spent hours there. The volunteers are lovely and explain everything there is to know about these fantastic creatures. We just missed a birth by seconds, it was crazy to see the birds come in and eat the afterbirth, an amazing experience. If you're visiting the area, do yourself a favour and check it out.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great view of the seals and their babies", "Great seeing these creatures in there natural habitat. They were throwing sand on themselves and nursing with moms."], ["Reviewed 1 week ago", 5.0, "Way cool spot", "We stopped in the morning before there were too many visitors. Got to visit with a docent for about 20 minutes. He was very informative and loved his job. All the seals were crazy amazing. From the little babies to the great big bulls. It was a fun side trip after our visit to Hearst Castle. A definite must see if there between Jan. and April.\nShow less"], ["Reviewed 1 week ago", 4.0, "Look like logs on the sand", "The Elephant Seal Rookery on the beach at Piedras Blancas, San Simeon is home to hundreds of these 5000+ pound, 14 to 16 foot mammals. Stay on the upper walk as the signs read. The seals don't like to be messed with especially during mating season. They are ungainly on land but glide through the ocean with ease. As you drive on Highway 1, pull off and take the stroll to see the seals. They are directly off the road and hundreds of seals sleep like logs on the sand.\nShow less"], ["Reviewed 2 weeks ago", 5.0, ":0)", "Seals everywhere. Fun time to sit and watch them. Sign boards were informative. All around good time, plus you cannot beat the price. Free"], ["Reviewed 2 weeks ago", 5.0, "Amazing!", "This was such a unique experience! I have never seen so many seals in my life! I highly recommend this to anyone that wants to experience California coastal life at it's finest, or for anyone that just needs to brighten their day! Really fascinating!"], ["Reviewed 2 weeks ago", 5.0, "You'll Feel Like You're In A Planet Earth Episode", "How to describe a collection of 100s of wild animals in their natural environment and just short feet away. Absolutely amazing and memorable are too weak for this experience.\n\nThe beautiful elephant seals, their sounds (yes, and smells), their gymnastics, the amazing beach and ocean setting all combine to put you into a wildlife movie and it feels almost unreal.\n\nA bit of a downer for kiddies might be the lost pups that end up being gull food so take some care to watch out for this downside of nature.\n\nNot sure how much you have to detour to get this experience, but whatever it is, it will be worth it.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Just fabulous", "It's just wonderful to see these animals at such close quarters. If you can go as dawn breaks so you can see the big males come in from the sea"], ["Reviewed 3 weeks ago", 5.0, "Well worth the detour up the highway", "What a wonderful place. Beautifully laid out from the carpark. There weren't a massive amount of elephant seals but certainly enough to keep us entertained, think it must have been the mating season as there was lots of fighting going on. Never having seen an elephant seal before, I had not imagined them to be so enormous. Fabulous experience.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "View elephant seals up close", "We were lucky enough to be visiting this coast while the elephant seals were onshore and birthing. There are thousands of seals on several beaches. Parking is plentifully and free. Some have wooden walkways and \"guides \" to enhance your viewing experience. Take plenty of time to watch, take pictures or video. It's an amazing experience for the family.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "\"This was amazing\"", "Stopped at the Elephant Seal Rookery and couldn't believe how many seals were on the beach. Saw a baby seal being born which I hear is rare. This is a place you have to see. ."], ["Reviewed 3 weeks ago", 5.0, "Don't miss this....", "We drove here after visiting the Hearst Castle in early January and we were so happy we did.\nFirst off, keep in mind this rookery is wildlife in the raw, so it is not all sunshine and roses....but at the same time, the coastal scenery here is spectacular.\nThis rookery is very scenic, interesting and informative.\nThere are hundreds and hundreds of elephant seals (as far as your eye can see) roosting here and it was so interesting to stand on the viewing platform and just watch them in their natural habitat behaving like the animals they are.\nLuckily, we were here during birthing season so that was an added bonus - to literally see all ages and shapes and sizes of elephant seals, all at the same time.\nThe information boards are very interesting and informative so be sure to take the time to read them.\nAnd to end an already great day, we were treated to an incredibly beautiful sunset while we were here visiting the rookery.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Highlight of Our Trip", "While driving Route 1 from San Diego to San Francisco we planned a stop at Hearst Castle. Through Tripadvisor we discovered this Elephant Seal Rookery less than 5 minutes up the road and decided to include it in our day. Soooo glad we did! What an amazing sight during January. Elephant Seals for as far as the eye could see during their breeding season. Bellowing/dominating males, nursing/protective mothers, squealing/nursing babies and seagulls standing by and announcing a baby being born. A nature show at it’s best with free, front row seats from the boardwalk. If you love nature don’t miss this free attraction!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Hundreds of Elephant Seals near Hearst Castle", "Hundreds of elephant seals basking in the sun are a sight to behold. A helpful docent is there to assist!"], ["Reviewed 3 weeks ago", 5.0, "Love to visit this place..", "We always drive to see the Elephant Seals. Well worth the trip. Don't miss this!! There are docents there that will explain things to you. On the way, it is 4 miles south of Hearst Castle, look for the Zebras on the Hearst property. Yesterday we saw a baby Zebra. he was to far away to get a good picture, but I sure loved seeing him out in the wild. The Elephant seals are HUGE!!!! Fun to watch. Different seasons bring different activities from them. Yesterday they had their baby seals on the beach and the Males were searching out mates on the beach. Interesting.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Just awesome", "Don’t miss this if you’re in the area! It’s a beautiful way to see how California is protecting wildlife. There were dozens of elephant seals lazing on the beach. You’re only feet away from them. They are protected from the public by a guard rail on the foot path. We could have stayed and watched all day. Beautiful, hopeful and relaxing.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun to see", "You can stay just a couple of minutes or longer, and it is fun to see the elephant seals. Worth a short detour!"], ["Reviewed 4 weeks ago", 5.0, "Nature at it's best!", "We visited in late January. the Elephant Seals were still birthing. The information boards were excellent there were also volunteers on hand to enhance your visit. This stop is great for the Young and Old. It is seasonal, so watch your dates."], ["Reviewed 4 weeks ago", 4.0, "Interesting Creatures", "A must see and do whilst in the area. These creatures were enjoying a birth season so lots of babies to view - how they survive not being crushed is a mystery! They were funny tomwatch moving around and getting into the ocean."], ["Reviewed 4 weeks ago", 5.0, "We got to see all types", "We visited here on our way north. There were alpha males, young males, nursing females and new born pups. We saw some fighting among the males and some males attempting to mate. We had see elephant seals before input travels but never so many in one place. This is certainly worth a stop even if you have to backtrack because of the road closure alittle farther to the north.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Wonderful and unique", "A unique place rI got off the road. A few minutes or a couple of hours. The smell I excepted was not here when we visited. Amazing to see the power and grace of these huge animals. The sound these seals make is very interesting."], ["Reviewed January 24, 2018", 4.0, "Smelly", "Really cool to see, you can just stop for a few short minutes and admire these incredible animals..."], ["Reviewed January 23, 2018", 5.0, "Wonderful spot to view the seals", "This is an amazing place to visit when the pups are being born. We were here the second week of January and there was a range of pups from newborn to weaners. There is a great raised viewing walkway that allows you to see the entire beach from above and really get a good sense of the action below. Bring binoculars for the best viewing. There were members of an elephant seal group there to answer questions as well.\nShow less"], ["Reviewed January 23, 2018", 4.0, "worth seeing if visiting Hearst Castle", "It's very close to Hearst Castle. Really the only other thing to do out in that neck of the woods. Worth the look. We caught it at sunset and I was able to FaceTime my daughter and let her see it. She is in love with these creatures and thought they were cool.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Great event for the entire family!", "My entire family from parents in their 70's to my grand kids who are 9 loved this experience over Martin Luther King holiday weekend. We were able to see tons (literally) of pups and mothers who had just given birth from a safe distance away, but close enough to really observe their natural habitat. There were plenty of docents on hand to answer questions and they were very knowledgeable and happy to hang with us for quite a while.\n\nMy Mom walks with a cane and doesn't get around very easily and we were able to park right up close in a handicapped parking space with a very well maintained cat walk with handles and rails where she could easily hold on and walk along the beach side.\n\nAfter this we drove down the road to a killer sandwich/wine stop (on the beach side in front of the Hearst Castle). The food was great and the wine was really great too. Plenty of seating for everyone and once we were done we went a few feet down the road and let the kids run on the beach for miles.\n\nThis made our trip a most of the day event everyone enjoyed from start to finish!\nShow less"], ["Reviewed January 22, 2018", 4.0, "GROSS, STINKY, GORGEOUS - Everybody loves the seals!", "They call them Elephant Seals as they can grow as big as a car, weighing thousands of pounds. Don’t miss the free show they put on right next to the coast highway at this amazing rookery. You can get up close & personal on a safe boardwalk just above their beach. Mothers & pups, giant honking males are all there in enormous numbers everyday.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Astounding!", "I went during birthing season. It's amazing how close the boardwalk allows you to (safely) get to the seals and how many there are. Greatly exceeded my expectations."], ["Reviewed January 21, 2018", 5.0, "Big blubbery boys", "This stop to view elephant seals is very educational and is free... You are up close to them on a boardwalk... The makes are Hugh and the pups are small and vulnerable... Go see them."], ["Reviewed January 19, 2018", 5.0, "Elephant Seals Absolutely Fascinating", "We visited the rookery when the seals were calving. There were literally thousands of seals and their babies on the beach. The male seals were quarreling establishing dominance. The mothers and young were talking to each other. This sight is only available this time of year. I felt privileged that we were able to catch a glimpse of the miracle of nature.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Very interesting", "Interesting place. The females had their babies with them and the males are huge. Listened to an expert volunteer and learned alot."], ["Reviewed January 16, 2018", 5.0, "Friends of the Elephant Seal", "Just north of San Simeon on US HWY #1 is a parking lot for the Friends of the Elephant Seal observation. In December to March the large Elephant seals beach themselves to give birth. Males are up to 4,000 pounds and females up to 2,000 pounds. Watch them give birth and see something most amazing. Cost is free. Bring a lunch and some drinks with you as you will be staying longer than you expected. Ensure you use a bathroom ahead of time also. This will be of interest to the whole family.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Birthing was fantastic", "Lucked upon the beach right at mating and birthing time. The giant males would aggressively protect their territory. The naturalists on site were very informative"], ["Reviewed January 11, 2018", 5.0, "Educational", "This was the first time my date had been here, having passed by many times in the past. He was surprised at the large numbers of seals."], ["Reviewed January 9, 2018", 4.0, "Very interesting to see", "The place was not crowded and for sure if you are close by do go and see it. They are very cute and so many of them!! Note - not that many things around, so you might want to combine with something esle!"], ["Reviewed January 8, 2018", 5.0, "A great place to check out these cool animals!", "I love coming here and seeing these beautiful and interesting animals! They are always enjoyable watching and listening to them despite the crowds of people that surround you. Get there early to avoid the crowds and get a place to park!"], ["Reviewed January 7, 2018", 5.0, "Unbelievable Look at Nature", "Be sure to include ths stop on your trip in the area. During our visit we watched the battles of the alpha males, the protection of the mothers and the care of the new born pups. Amazing to see such a large animal move on the sand.\nShow less"], ["Reviewed January 5, 2018", 4.0, "So neat!!", "We absolutely loved seeing the elephant seals. You are able to get close enough to get a really good view. There was a volunteer there who was very knowledgeable. She said that the timing of our visit (early January) there weren’t that many seals on the beach, but February is an excellent time to come. But we saw hundreds of seals and still thought it was awesome!!! We would have stayed longer and watched them play and interact with each other but one of my kids had to use the restroom and there are none there. Go potty before you come ;)\nShow less"], ["Reviewed January 4, 2018", 5.0, "A Must See!", "There is nothing quite like a 5000 pound bull elephant seal charging across the beach to protect his harem. This can be a 10 minute stop or a three hour stop, totally up to you but you should not miss seeing these wonderful creatures!"], ["Reviewed January 1, 2018", 5.0, "An easy stop to see Elephan Seals", "This was an easy stop right off Hwy 1. There is plenty of parking and docents to answer your questions. I enjoyed watching the seals interact, flip sand and rest in the sun."], ["Reviewed December 31, 2017", 5.0, "This is a must see!", "I am so glad that we made the trip to see the elephant seals - they are pretty amazing. Their huge size (especially the full grown males) was surprising, but even more so was how quickly they can move despite their size. It was also really interesting to watch their interactions - moms with pups, younger males jostling for status, alpha males confronting beta males. It's worth it to stay awhile and watch them. We got there pretty early and there was plenty of parking, as well as a really helpful ranger who gave us lots of information on the seals. There is a long path and the majority of the seals are on the left side, but we found that there was a lot more activity on the quieter right side so make sure and check that out too.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Far beyond what we expected", "Wow. We had read this was a good spot to see seals and the pups, and so hoped to see a few, but wow, we were blown away. The beach was full of elephant seals and pups, lounging in the sun, fighting with each other, throwing sand on the pups to cool down, and doing everything they should left to their own devises.\nThere is ample car parking, and plenty of viewing areas even when it gets busy. It is worth bringing binoculars so you can enjoy the close up interaction between the seals. All of the family was happy and content to just watch and enjoy this wonderful scene. Highly recommended, regardless of age.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Amazing sea creatures", "Amazing to see all these huge creatures on the beach. A ranger there all the time, told us many stories about the seals. He was so interesting."], ["Reviewed December 24, 2017", 5.0, "Pups are starting / Big Males coming ashore", "We love coming up here at different seasons to watch the elephant seals for an afternoon.\n\nThere are still year old pups staying longer than ever per the docent / naturalist and the huge bull males are coming ashore now after months at sea.\n\nThere were also 6 births on the beach so all the cycles of life are in full action mode now (12/23).\nShow less"], ["Reviewed December 24, 2017", 5.0, "Wow ! Didn't expect that", "How amazing to see these mammals in their natural habitat, the way they should be viewed ! There were so many of them, I could have watched them all day, just fabulous !!"], ["Reviewed December 21, 2017", 5.0, "Free show of thousands of Elephant Seals!.", "Must watch if you are driving on CA-1 near San Simeon. Nice trails along the coast with stunning views of pacific, hills and off course the Elephant Seals."], ["Reviewed December 20, 2017", 5.0, "Marvel at the Size of the Elephant Seals!", "From the literature I have read, December-February is the best time to see the Elephant Seals, and we were not disappointed! This is definitely a must-see of the Central Coast and was one of the highlights of our trip. The rookery is located about four miles north of Hearst Castle and worth the short drive!\n\nThe Elephant Seal Viewing Point parking is easy to find and there was plenty of parking, even in the middle of the day. But don't just attempt to see the elephant seals from there! Keep walking south on the trail and boardwalk and you'll come upon a beach full of the majestic animals. We were treated to hearing the unique cries of a pup as well as the interesting way the adult males propel themselves.\n\nThis particular activity will take less than an hour but you actually feel like you could stand there and watch them all day long. It seems like if you leave you might miss something. There was a volunteer on the boardwalk (his shirt reads \"guide\" on the back) who strolls around making observations and answering any questions you may have. There are also signs and \"E-Seal News\" pamphlets available for more information.\n\nAs always, there is no feeding of the elephant seals or the nearby squirrels. Be careful when leaning on the railing, there are sometimes fresh bird droppings.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Super cool area to view the seals!", "We stopped here after touring the Hearst property and were so glad we did. There were several dozen seals (mostly adolescents) sunning themselves on the beach when we were there and although they were pretty much just relaxing, it was really interesting to see them and to talk to the knowledgeable volunteers about them\nShow less"], ["Reviewed December 13, 2017", 4.0, "Highlight of the Year", "Bring friends and family of any age to watch the seals either start to embark on their new journey or come to the beach to see new males dominating over their new female friends. Fascinating and very informative from the docents who work there."], ["Reviewed December 13, 2017", 3.0, "yeah, go see the seals???????", "Eh, what's the big deal? Only if you are in the area and driving by would I stop here for 5 minutes. Good reason to get out of the car and stretch your legs."], ["Reviewed December 11, 2017", 5.0, "It doesn’t get any better than this place", "I have visited the rookery on no fewer than twenty times. Each and every visit has been better than the previous one. The views are spectacular and the volunteer staff is incredibly knowledgeable, informative and helpful. Seeing hundreds upon hundreds of elephant seals is an experience that cannot be expressed in words. Some of these magnificent mammals weigh as much as 5000 lbs. yes, two and a half tons! They are fantastic to watch. Whatever you do, DO NOT MISS THIS WONDERFUL PLACE!!!!\nShow less"], ["Reviewed December 11, 2017", 5.0, "Fascinating beach watch", "You can stand and look down at the Elephant Seals just a few feet below you. Your have a great view and your presence doesn’t disturb the huge beasts. Higher tides smell better than low tides."], ["Reviewed December 9, 2017", 5.0, "Like watching \"The Puppy Bowl\"", "So interesting to watch the pups play and listen to the Bulls bellow! The trails are laid out nicely so that humans don't interfere with Elephant seals!"], ["Reviewed December 7, 2017", 5.0, "Elephant Seals are Amazing!", "We stumbled upon the Elephant Seal Rookery almost by accident. It is located just a few miles north of Hearst Castle right along Highway One. Unfortunately Highway 1 is currently closed at the north near Big Sur due to a bad mud slide last winter, so you can only access this area from the south.\n\nTo see the Elephant Seals is amazing! There were dozens of them on the beach when we visited in mid-November, but we were told by one of the guides there that many more would be coming in January when their mating season is in full swing. The Elephant Seals we saw were enormous, but we were informed that the November bunch were \"early\" and were the smaller seals. They all lie together on the beach, occasionally throwing sand upon themselves or moving to the water. There are also males in the shallow ocean near the shore, who \"fight\" for mating of the female elephant seal of their choice. The sounds they make are deep grunts and their do injure each other! If you get a chance to pull over within the next two months, you will certainly be amazed at this large creatures!\nShow less"], ["Reviewed December 4, 2017", 5.0, "Huge mammals lying around", "These Elephant Seals are up to 5000 pounds, and are pretty cute too. The viewing area is nice and allows you to get fairly close to them. The kids had a ball watching them wriggle around in the dirt like they do."], ["Reviewed December 3, 2017", 4.0, "Dozens of basking seals!", "This is a low key attraction, but if you like animals then be sure to stop off. We went just as the season starts so there were already plenty of makes in the beach.\nThey weren’t very active but it was a great site and a good learning curve about their habitat and regime.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Don`t miss it!", "If you are in the area, or after visiting Hearst Castle, you shouldn't miss the Elephant Seal Rockery.\nThe elephant seals were lots of fun to watch, as there were MANY of them, and they were all different and engaged in different activities. We saw huge ones, we saw small babies with their mothers, some were crying, some were sleeping, some were playing, some were fighting. There were also lots of birds and some squirrels which came very close to us. We spent around 20 minutes there, but probably would have even stayed longer had it been a bit warmer.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Wonderful natural spot - elephant seals & whale spotting", "Thanks to Friends of the Elephant Seals on spot, learned a lot about them. Also spotted whales spouting offshore. Excellent way to end day at San Simeon and wait for sundown over the ocean."], ["Reviewed November 30, 2017", 5.0, "Must see", "If you are going by you should stop and see these giants. They are amazing. The guides are very informative"], ["Reviewed November 25, 2017", 5.0, "In their natural habitat", "Lovely to see these huge creatures basking in the autumn afternoon sun. It is great to be able to view them without disturbing their natural habitat. Wonderful spot to see them. 2061"], ["Reviewed November 23, 2017", 5.0, "Amazing Park", "Was in San Simeon for Hearst Castle. Made sure I had time to get over to this amazing place. Actually had to engage in a business related conference call while here, so I sat in the parking lot overlooking the Elephant Seals rolling on beach while talking on phone. After business was concluded I emailed out a photo of where I was during call...just for the jealousy factor.\nIf you enjoy incredible views and awesome animals you will enjoy this Park.\nShow less"], ["Reviewed November 19, 2017", 5.0, "awesome nature with beautiful animals on the beach", "the beach has a parking lot and very informative nature guides. Try to see it for at least a short time. The seals always come back to this beach and are quite entertaining. Near Hearst Castle at San Simeon. We did both in one day."], ["Reviewed November 17, 2017", 5.0, "love to see wildlife up close", "very informative talk from the docent and you can get very close to the animals with out disturbing them"], ["Reviewed November 16, 2017", 5.0, "Amazing!!!!!", "A must see! Hundreds of seals all along the viewing area! No charge- just pull into the parking lot and there they are! Fascinating to watch them spar, vocalize, move about, and just chill! One of the highlights of my trip down the coast!"], ["Reviewed November 15, 2017", 4.0, "Up close and loud!", "Stopped by while on a road trip and let me say, this was amazing! Very glad we stopped, there were SO MANY seals!!!! Moms and babies and dads. And they were so loud LOL Occasionally you would even see two males fighting. The smell was strong so be prepared!\nShow less"], ["Reviewed November 14, 2017", 5.0, "Great place to see all the elephant seals sunning on the beach!", "Wow we saw so many elephant seals in one place! It’s all free of charge, just pull up and look over and there they all are. It’s truly a unbelievable site. You can see all the different personalities they have. The males have the longer noses and the females have the short ones. Great day on the coast!\nShow less"], ["Reviewed November 12, 2017", 5.0, "A regular grunt fest!", "Early November features younger males who \"haul out\" to hang out. They practice some of the dominance techniques that will be useful later for getting to mate. The grunting sounds of these big sea animals was fun to hear, reminding me of teenage human boys trying to burp the loudest. There is a fairly long boardwalk, which I would recommend hiking both directions in order to see beaches with many animals not fully visible from nearest the parking area. Binoculars are also helpful, if you can bring them.\nHighly recommended, for a nice hour with nature.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Amazing Mammals", "The annual migration of these amazing mammals at the same beaches of San Simeon and at the same period of the year is definitely a manifestation of nature's wonderful creation."], ["Reviewed November 8, 2017", 5.0, "A must see!!!", "Definitely worth a visit especially if you are at Hearst Castle. It is a free attraction and only 4 miles from Hearst Castle. There were hundreds of elephant seals across the beach when we were there. They are the cutest!!!"], ["Reviewed November 8, 2017", 4.0, "a must see", "After the another must see the Hearst CAstle, somebody told us about this place very happy we stopped by.. hundreds of Elephants ..."], ["Reviewed November 7, 2017", 5.0, "Must see", "We could spend hours watching the elephant seals, just fascinating. We also had the benefit of some local guides explaining rookery which was an extra bonus."], ["Reviewed October 31, 2017", 4.0, "Good Place to View Elephant Seals", "On a recent trip to Hearst Caste, we followed Hwy 1 a few more miles and arrives at the Elephant Seal Rookery. It was early in the afternoon and the seals were all lounging on the beach. Not to much action going on at the time. It was worth a few minutes to view the seals and take in the beautiful coast but that's about it. Perhaps it is better in other seasons or times, with more action. Well worth a stop if one is in the area. There is no charge but I believe they accept donations. A better site further down the road heading to San Simeon, there are Zebras grazing with the cattle on Hearst land. Descendants of the Zebras that were part of Hearst Castle's zoo which was done away with in the 1930s.\nShow less"], ["Reviewed October 29, 2017", 5.0, "A must do when in San Simeon", "Everybody talked about Hearst Castle but we chose to go to see the seals and we were not disappointed. So amazing to see them in their natural habitat and interacting naturally. Great photo opportunities."], ["Reviewed October 25, 2017", 5.0, "fun to watch", "The rookery is just north of Hearst Castle and about 15 minutes from Cambria. Worth the drive. The first sight is a surprise. From a distance, they look like piles of sand stacked on the beach. With a camera, a zoom lens is best."], ["Reviewed October 23, 2017", 5.0, "Just amazing - to see these immense creatures in a natural habitat", "Don't miss this! We saw probably 150 of these amazing creatures, and watched for about an hour as they lay in the sun, occasionally having minor disputes with each other - or moving slowly into the sea! This is such a special place!"], ["Reviewed October 17, 2017", 5.0, "Fascinating creatures to watch", "Stopped by here briefly to watch the seals. There were at least 100 on the beach sleeping and moving about. Plenty of vantage points to watch them. Went down about 1 hour before sunset and were a few people there but not too busy."], ["Reviewed October 16, 2017", 5.0, "Amazing site to see!", "Seeing these wild creatures all lying in the sun on the beach was really cool! The doscents on duty were knowledgeable and friendly. It was easy to spend time watching the elephant seals!"], ["Reviewed October 15, 2017", 4.0, "So many seals!", "If you are in the area, take the time for a visit to the Rookery. These big animals are fun to watch from a distance. There were information boards that told about their lives and habits. It is amazing how long they stay out in the ocean w/out coming to land. We were glad we stopped.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Highlight of my CA trip", "Almost skipped this in the interest of time, but so glad we made the extra drive after Hearst Castle to see/hear this! It was truly unique and I wanted to watch them for another hour if I could. (It was actually cold there in June!) So surprised how large some of this creatures are and the way they are able to move around in an out of ocean and spar with one another. Teenage boys watched intently too. There were so many seals out on the beach in close view from the viewing area.\nShow less"], ["Reviewed October 14, 2017", 5.0, "HUNDREDS OF ELEPHANT SEALS EVERY DAY", "This attraction is right on the 101 highway. There is a large dirt parking lot that even accommodates trailers and motor homes. The observation area is within feet of the parking lot and offers a fantastic view of the animals.\n\nThe beach is protected and no one is allowed beyond the viewing area..\nShow less"], ["Reviewed October 14, 2017", 5.0, "Seal Watch", "The seals were all sleeping on the beach. There must have been at least 200 of them. There is a walkway that goes along the beach so that you can see more seals as you go on. It was very entertaining and interesting."], ["Reviewed October 10, 2017", 5.0, "Incredible animals, God has made them all!", "Enjoyed the easy stop and just walked around looking and admiring these amazing animals. Lots of parking and easy walk too."], ["Reviewed October 10, 2017", 5.0, "Close up viewing of these amazing creatures and nice seaside walkway to view coast as well", "We stopped here after Hearst castle and I was glad we did. Even though we were not here at the peak time (Dec to March) there were still plenty of elephant seals basking on the beach and young pups playing in the surf. Free, easy to get good photos of the seals (and the ground squirrels who actually posed for us next to the path). They seem oblivious to the people and were enjoying their naps. Docents were on hands to share their knowledge, too.\nShow less"], ["Reviewed October 9, 2017", 4.0, "An incredible number of elephant seals", "In Antarctica earlier this year I saw a few elephant seals. Here was the opportunity to see hundreds of them shimmying down the beach, fighting in the water. Definitely worth a stop if you're going to Hearst Castle. You view them from above, not on the beach.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Beautiful place", "The Elephant Seal Rookery is free to visit and offers a unique opportunity to come very close to these special animals without disturbing them. Highly recommended!"], ["Reviewed October 7, 2017", 4.0, "fun to watch these creatures", "This is a pretty unique place to visit, just 4.3 miles North of Hearst Castle right of Hwy 1. Big elephant seals lazying around on a few small beaches but if your lucky enough you can see a few males that are courting the same female going at it. Plenty of parking and it's free.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Elephant Seal Rookery", "Hundreds of young elephant seals were on the beach. We also viewed whales in the distance. Berst viewing time would be in January and February."], ["Reviewed October 6, 2017", 5.0, "Yes they are there !!", "After a trip to hearst castle this is a 5 mile ride north on highway one to the elephant seals. On arrival no fee but maybe a tip to the volunteer s talking about the seals we saw at least 120 seals lying in the sand sleeping etc and only 15 metres away interesting and great to see\nShow less"], ["Reviewed October 6, 2017", 5.0, "Wonderful viewing opportunity", "We almost missed this incredible opportunity to these elephant seals up close. There were several dozen on the beach and nearby in the water. It was great watching and listening to them and seeing how they interact with each other. Definitely a worth while stop."], ["Reviewed October 5, 2017", 4.0, "Beautiful wildlife setting", "Just off Highway 1, 5 minutes north of San Simeon, you find these amazing creatures sun baking and playing in the sand. They seem totally oblivious to the crowds of humans just 20 metres away. What a great opportunity."], ["Reviewed October 5, 2017", 5.0, "Hundreds of elephant seals - fantastic sight to see!", "Close to Hearst Castle, this was another visit we made on the same day. We stood and watched hundreds of seals on the beach and took pictures. A magnificent sight. They each have their individual mannerisms and were fun to watch how they behaved with each other. It's an experience you don't get back in the UK.\nShow less"], ["Reviewed October 4, 2017", 4.0, "A sight to see!", "Birdseye view less than 30 feet (9 meters) from the seals! At certain times conservationists are walking around and available to answer any questions you may have."], ["Reviewed October 3, 2017", 5.0, "So many seals!", "Loved seeing all of the seals on the beach and playing in the water! Easy access off of the road. Large viewing area. Well worth the stop!"], ["Reviewed September 28, 2017", 5.0, "Just amazing", "Take your time and enjoy these amazing animals. It’s free and It’s easy to access. You can see the animals sleep, swim, play and fight in the water. Possible to donate."], ["Reviewed September 28, 2017", 5.0, "Amazing sight", "To go and see these wild animals is just fantastic. Great viewing area and a very knowledgeable volunteer who chatted to us with great enthusiasm about the elephant seals and their habits. If you're in the area, do not miss this."], ["Reviewed September 26, 2017", 5.0, "Wow!", "In spite of wind, worth stopping and viewing. You can hear about it and see pictures of it but until you experience it yourself, you have no idea...it is simply amazing. When we stopped, there were volunteers answering questions and providing information."], ["Reviewed September 26, 2017", 5.0, "So close its worth it...", "Just minutes from Hearst Castle it was a extra bonus to see these huge creatures up close and personal . We only saw maybe a 100 but in busy season we were told there will be 10,000 on the beach. Check out the Elephant Seal Rookery website and see when its best time to visit.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Seals get approval", "Stopped at Piedras Blancas (just North of San Simeon on Hwy1 / PCH a few years back and were absolutely captivated by the elephant seals, made sure to stop again when we were in the area again this year. Dozens, even hundreds of them, some up to 15 feet long, either lying on the beach flapping sand on themselves with their flippers, having mock fights or making loud 'farting' noises, you could watch them for ages. The car pull in area purpose you really near to them. Do not miss seeing them if you are anywhere near the area.\nShow less"], ["Reviewed September 25, 2017", 5.0, "A great place to stop and rest while on your way north or south.", "Our kids absolutely enjoyed this stop. Very entertaining to watch the elephant seals and squirrels. We watched during a time that the males were very aggressive towards each other which made the time even more entertaining. The smells were at times strong but the wind would blow that over quickly. It seems that parking can be tough during high traffic times.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Amesome Place to See Some Rare Creatures", "I can understand why this is the top rated activity in S.L.O. county. Here you can see a large number of these very unique animals and observe their behavior from a relatively close distance. Signs are posted around the park providing interesting and educational descriptions and there is a nice, easy walking trail. I was there on a Saturday afternoon and it was busy, but still plenty of parking and enough room for everyone to get a good look. The animals a pretty entertaining and I gather that the time of year determines their activities and behavior. In late September, they were largely resting on the beach, but would occasionally make their way in and out of the water and pick at each other. Very fun to watch...I thought it would be a quick stop but I ended up spending over an hour here. It's a must-see for a nature lover.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Great spot", "Enjoy the elephant seals from there, free and genuine spot. Often very windy but car park is allocated right there."], ["Reviewed September 24, 2017", 4.0, "Worth the stop", "The elephant seals are very entertaining and there are lots of them to see. Seals of all different sizes laze around in the sun and occassionally get a burst of energy to waddle toward the water. Great viewing area where you can safely see the seals but get fairly close also.\nShow less"], ["Reviewed September 24, 2017", 4.0, "If You Like to Watch Sea Animals Lounging, Go Here!", "There were over a hundred elephant seals basking in the sun and being playful....it was a scene right out of a National Geographic show. Most were sleeping, but a few were dueling it out for territory I suppose. A few were flipping sand on themselves to keep the sun off I suppose. Very nice to look at nature like this. Kudos for the fences that keep observers at a distance. Take all the photos you want; these guys and gals seem to be posing. This is a good spot to stop along the road to LA or SFO.\nShow less"], ["Reviewed September 22, 2017", 5.0, "A must see on Highway 1", "I've been here twice but I never bore of seeing these magnificent creatures in their own environment. What was quite helpful was there were guides here on this occasion which allowed me to understand the seals more and with the leaflet I was given I can now access a web cam from home to view them across the seasons.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Great Surprise!", "We were told that there is no guarantee that the elephant seals will be there in August, but we decided to give it a try after visiting Hearst Castle. We saw 40-50 of these wonderful animals. Some were playing in the surf, most were just resting on the beach and occasionally two males would wrestle. Some volunteers were present that answered questions and made the experience so much more enjoyable.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Surprising Number of Elephant Seals - so close to the Viewpoint", "After visiting Hearst Castle, it was recommended we also visit the Rookery four miles away. We were amazed that there were well over 100 seals on the beach, and a few in the water, in view less than 50 feet from the viewpoint. Very entertaining to watch and to photograph.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Amazing animals", "We could have stayed and watching these amazing animals for hours. The kids were fascinated by their play fighting, and the guides there were very informative"], ["Reviewed September 18, 2017", 5.0, "Nature", "Beautiful day on the coast and to see these huge mammals up close from the observation area was incredible. Recommend to anyone that appreciates wildlife in their natural setting."], ["Reviewed September 18, 2017", 5.0, "A quick and easy stop resulted in the best experience of the stay in Cambria", "Along the highway in what looks like just a site seeing stop an entire world of Seals lounge just feet below you. After you get used to the smell, you get to watch these guys, play, fight, lounge, nap, swim and talk all up close. Great and easy find.\nShow less"], ["Reviewed September 17, 2017", 5.0, "California a Road Trip", "The Elephant Seal Rookery we visited was near San Simeon on part of the Big Sur.\nIt was just off the Highway the seals were very nearby on the beach.\nThe sight was incredible, viewing the mainly young males posturing and mock fighting, preparing for when they mature and fight for an harem.\nThe whole experience was fantastic.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Must see!", "Just really cool to see the elephant seals! We watched the males fighting in the water and on the beach. We had our dogs with us so we didn't get to close."], ["Reviewed September 15, 2017", 5.0, "Elephant seals in the live - wow", "It was a pleasant surprise as we were early for Hearst castle and drove a few miles further north while we waited. We witnessed 50+ wild elephant seals of all ages lounging on the sand. Highly recommend it, especially for kids."], ["Reviewed September 13, 2017", 5.0, "You won't believe your eyes - FREE", "A beach FULL of gigantic elephant seals. Almost always there but more in certain seasons. Nice large parking area. Walk up to the viewing area - you are very close to the seals. Mesmerizing as the males pose and jostle with others. Lovely ocean scenery. A real treat for the kids and nature lovers\nShow less"], ["Reviewed September 11, 2017", 5.0, "So cool!!!!!", "A great experience observing the elephant seals!!!! They are so funny to watch! A must see!! It's about 3 miles north of Hearst Castle...."], ["Reviewed September 9, 2017", 4.0, "Delightful", "It is amazing to watch these magnificent animals in their natural wild habitat... So much better than at a zoo or animal park"], ["Reviewed September 6, 2017", 5.0, "Wild life at a stone throw distance", "First time visited back in 2013, followed in 2014, 2015,2016. I cannot get enough of the place. one of the best place to enjoy the wild life without disturbing the wildlife at such a close call.\nDefinitly recomend if traveling on Highway 1 traveling south from monterey to Morro bay or traveling north Morro bay to Monterey.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Much, Much Better Than Hearst Castle", "We swung by the Rookery in the morning before our scheduled tour at Hearst Castle, and I was like, \"Jackpot! This is my ticket to National Geographic.\" The problem is that elephant seals are large, sand colored blobs with no interest in being photographed whatsoever. Notwithstanding this fact, we had a great time watching them and the pelicans on the beach. It was so much better than our tour of Hearst Castle that we went back after!\nShow less"], ["Reviewed September 2, 2017", 5.0, "A must on the PCH", "You cannot miss this place, its a must if travelling the PCH. But don't stop at the big, crowded car park.\nGo a few hundred yards further (northbound) to a smaller, usually empty car park, and walk around the headland.\nYou will see just as many seals, but without the jostling crowds.\nThe views into the Pacific are beautiful, and the sea birds plentiful.\nA beautiful place\nShow less"], ["Reviewed September 1, 2017", 5.0, "So close to nature ..........", "Our 13 year old was very excited at seeing the elephant seals but we never imagined that they would be so close! Tom told us all about them as we watched 2 seals bellowing and squaring up to each other - a fascinating study of alpha males ....\nWe would recommend stopping at this site on route 1 - we had to travel north of the landslide detour but it was definitely worth it.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Nature At Its Best", "This is a free way to enjoy nature. The seals sun on the beach each morning. It's a wonderful place to take pictures."], ["Reviewed August 29, 2017", 5.0, "Superb Wildlife Viewing", "We stopped at the Elephant Seal Rookery on our California Coast Road Trip. There is a wooden walkway with viewing platforms along the beach a few miles north of Hearst Castle. There were close to 100 Elephant Seals at the rookery and also some Harbor Seals. When we were there, most of them were lying on the beach. The area is attended by volunteers during the day but you can visit at any time.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Must see and read the E-newsletter", "Just to see these seals is magnificient. There are docents there to answer questions also. I found it so interesting to read the newsletter about the lives of these seals. It is very close to Hearst Castle with plenty of parking so should be included as part of your day trip there.\nShow less"], ["Reviewed August 28, 2017", 5.0, "A priviledge to see them in their wildlife", "Very nice place to observ the elephant seals in the wildlife. A bit cold and windy but it is worth to be here. Thanks to the volunteers who kindly explain a lot about elephant seals life"], ["Reviewed August 28, 2017", 5.0, "Out of this world!", "We visited the rookery on our way out of Cambria. A lovely guide came over to speak to us and gave us loads of information about the seals. A sight to behold!"], ["Reviewed August 27, 2017", 4.0, "the most nice place in Cambria area", "you can see a two dozen of elephant Seals. in the morning most of them enjoyed the beach and only a few were in the water.\nRecommendations:\n- don't miss this attraction if you are in the area\n- after visiting it, you may go to the Ragged Point located ~10 miles to the north\nShow less"], ["Reviewed August 27, 2017", 5.0, "Excellent natural habitat", "We visited the rookery in August. All the signage and literature indicates that this is a time of year in which most seals are migrating, but some of the larger ones can be found on the beach. Well, they were exactly right! We saw some seals sleeping, playing, and swimming. It was very tranquil to watch these beasts in their natural habitat. There is a boardwalk from where you view them. You aren't too close, but close enough. The area has ample parking, there is a donation box to help support the maintenance of the area, and there are super friendly squirrels! They come right over to you. A guy was feeding one straight from his hand. The area is clean and well -maintained. This is a great opportunity to see these animals. Until I read about things to do in San Simeon I had never even heard of elephant seals. My kids were very excited to learn about this new species and to observe their behaviors. This is a must-do if in the area.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Great place", "Absolutely amazing to see those magnificent creatures gracefully lying on the beach. About 100 years ago there were nearly extinct , so we should really appreciate them."], ["Reviewed August 23, 2017", 5.0, "Must see spot- 'end of life' experience", "This place is probably extremely unique in the world. You pull over with your car on the HW and enjoy this fascinating view. We have been in August and then hundresds of seals been laying on the beach or swimming among of the see weed.Don't miss out if you driving on California 1\nShow less"], ["Reviewed August 23, 2017", 5.0, "Road trip stop", "Amazing to watch these beautiful creatures in natural environment was stunning. The volunteers were chatting very knowledgeably to everyone there. What an experience to see just off the main road, there were two large groups of seals chilling on the beach. So pleased we included this in our trip..\nShow less"], ["Reviewed August 21, 2017", 5.0, "Simply Amazing", "Stopping at Piedras Blacas to see the elephant seals is an absolute MUST! Just fascinating watching these amazing creatures!"], ["Reviewed August 21, 2017", 4.0, "Interesting to see such wildlife free", "A short drive from San Simeon and absolutely free to watch these creatures on their own. Good distance as one can watch them without disturbing. A unique experience of our trip."], ["Reviewed August 20, 2017", 5.0, "Amazing!", "What an awesome experience to see these behemoths sunning within 75' of the highway! A safe viewing area separating visitors within a few feet of these creatures in their natural habitat. A must see!"], ["Reviewed August 18, 2017", 5.0, "Mesmerizing", "I thought this would be a quick stop because most of the elephant seals were just laying on the beach but we found ourselves mesmerized and taking lots of pictures as they tossed sand on themselves. Some were in the water honking at each other and playing and there were even some pups. I am not sure why it held our attention so long. There are docents answering questions as well.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Awsome", "We absolutely loved the Stay at the rookery. Really cute seals , the staff onsite friendly an knowledgeable about the Seals. Definitely recommendable"], ["Reviewed August 17, 2017", 5.0, "Don't miss this! Worth the drive!", "We have been coming here for years. They are always improving it. Over the years they have added parking areas, signage, trails, and docents. It is so great to be able to ask questions and pick up a newsletter about the area. Don't miss this! There are motels not far away.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Not to be missed .... many seals", "Fantastic view .... many pups and grown up seals .... very entertaining to watch especially if you are lucky to see them coming out of water ... slow movements, forcing their way between other already relaxing seals who complain...There are plaques with plenty of information ..... it is free\nShow less"], ["Reviewed August 15, 2017", 5.0, "Definitely worth the detour.", "I loved my 2 visit here, well worth coming. The elephant seals are a delight. The walkway is a great place to see seals from. I wasn't expecting much considering it was August and we know most would not be in but we were really surprised at the amount of animals that were in. We spent quite some time here on each visit. I look forward to visiting again when in California next.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Hike with a view", "What fun to learn about elephant seals from friendly weekend docent (guide in blue jacket). It's free. We found plenty of them romping and teenagers sparing (mostly male in August though a few pups could have been females). There are informative placards along the trail if guides are not there.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Hearst Castle trip 2017", "This is worth the few minute drive away from Hearst Castle to see these huge animals just lounging on the beach this is a rare opportunity to see ocean creatures this large all in one place"], ["Reviewed August 9, 2017", 5.0, "Sooooo Many Elephant Seals!", "They were so awesome! Loved seeing the elephant seals! Some were swimming and playing. Most were lying in the sun being lazy! Some were making funny noises and moving their heads all around! It was a random stop we made on the side of the road! It was cool! Definitely worth a stop in the side of the road!\nShow less"], ["Reviewed August 6, 2017", 5.0, "So cool!!", "Elephant seals all over the beach and very active. The majority were laying in a huge heap and kept fussing at each other."], ["Reviewed August 6, 2017", 5.0, "The cutest and funny animals ever!", "We had a blast looking at sea elephants! They are so fun to just observe, and see how slow they are. I loved them, and would love to see them again sometime!"], ["Reviewed August 6, 2017", 5.0, "Elephant seals rock! Thank you Friends of the Elephant Seal!", "A wonderful way to spend a morning or any part of the day. Go to the Elephant Seal viewing platforms and also talk with one of the \"Friends of the Elephant Seal' educators. So valuable to learn about these wonderful mammals - the educators are great. Had a wonderful experience watching mostly male seals (this time of year) sparing with one other and also hanging out on the beach. They are huge and wondrous.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Worth a visit", "You get a pretty close view of heaps of them in and out of the water. The local volunteer staff who donate their time to explain about the seals are lovely, knowledgeable and worth talking to."], ["Reviewed August 4, 2017", 5.0, "Great experience", "Great viewing area - close enough to really experience the animals without being so close as to disturb them - of this stretch of beach where a small colony of elephant seals have apparently decided to live. We so enjoyed watching them sleep on the beach or frolic in the waves that we visited twice in a day. Great experience for all, and highly recommended.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Elephant seals all around", "We have visited the rookery many times and at various times of the year. Each time it is different and always exciting to see. The seals vary in number from a few hundred to thousands depending on when you visit. The rookery is about 10 miles north of Hearst Castle. Worth a trip anytime of the year. The seals range from small 5 footers to mighty 15 footers and weight hundreds of pounds. The main site has a good parking lot and volunteer guides are there to answer your questions.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Elephant seals in their natural habitat. Very cool.", "My family (wife and two kids aged 10 and 12) visited here in July 2017.\n\nWe had researched the area and were excited to see the elephant seals up close. There were dozens all over the beach - just lying on top of each other, throwing sand on themselves, and smelling really bad. :)\n\nWe watched and took pictures for about 45 minutes. There was plenty of parking at the adjacent lot.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Fascinating and a real spectacle", "Was not sure what to expect but we found this a truly lovely experience to see such wonderful creatures so close at hand.\n\nThe rangers on hand to provide some informative knowledge was great and we enjoyed even more when we went back the next morning very early when it was less crowded. Would love to see the big males fighting but was just great seeing this wildlife in all their glory.\n\nIs very non commercial as well which is even better!\n\nInteresting smell as well - all part of its charm\nShow less"], ["Reviewed July 30, 2017", 5.0, "Big, Beautiful Elephant Seals!", "The first visit to an Elephant Seal rookery! It was early summer, so the number of seals was less than winter...but there were many males to observe in the surf and on the sandy beach below the observation point! We were lucky to run into Tim, a very knowledgeable volunteer interpreter who took time answering our questions! It's very windy and cold on this promontory near the lighthouse in San Simeon-take a jacket!\nShow less"], ["Reviewed July 29, 2017", 5.0, "What's not to like?", "Elephant Seals and Sea Lions on the beach in their natural habitat. Some sunny days some very foggy ones too. These massive creatures put on a free show daily. Well worth the stop if you are in the area."], ["Reviewed July 29, 2017", 4.0, "Great & smelly", "The seals were amazing. Mainly the younger seals were there, but it was fascinating & educational. I would recommend it for everyone. The walk is easy & accessible."], ["Reviewed July 29, 2017", 4.0, "Cool!", "Worth the stop. Glad to see that visitors do not have access to these incredible animals. There is a boardwalk keeping humans off the beach. But great views and smells. Windy. Fascinating. Two juvenile males were in the water making a raucous. Females sunning themselves. A couple of seals there too.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Free and just at the side of the road...", "On the way down from San Francisco to Santa Barbra we just happened upon a lay-by at the side of the road which was rather popular. There was a just a road sign with a picture of an Elephant seal.\nYou park up, its free, you walk along a small area of boardwalk and there they are basking in the sun, the odd one has some energy to make it to the water and some of them try and fight, but you get to be your own David Attenborough and film the action up really close and in the wild - there is just the open see, there are no enclosures. Its excellent.\nShow less"], ["Reviewed July 27, 2017", 3.0, "Sweet", "The beach was packed with lazing elephant seals and a couple of young seals fooling around in the surf. Ample parking close to the beach. You can stop anywhere close as there were loads of seals."], ["Reviewed July 25, 2017", 5.0, "Incredible Viewings!", "Best location for close up viewing of Elephant Seals in large quantities. Great opportunity to watch mature Seals during molting season, lounging on beach and covering themselves with sand. Occasional displays. Wonderful!"], ["Reviewed July 25, 2017", 4.0, "Big Surprise!!!", "Fascinating! I wasn't expecting a beach full of elephant seals basking in the sun! They looked tranquil and menacing at the same time. Don't worry, the viewing area is a safe distance away. The only motion was the seals scooping sand on themselves to keep cool. Be sure to have the volume turned up to catch the unique sounds of the ocean and the seals.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Well worth a look if in the area.....", "This attraction is worth a look if in the San Simone region without a doubt but without me stating the obvious it is just a load of big howling Sea lions spread over a beach and not smelling great.\n\nIt's intriguing to watch for about 5-10 minutes but that's about it really, I would personally tie it in with a visit to Hearst castle as it's very near there and wouldn't really go out of my way.\n\nIt's very well set out and safe to look at the sea lions but like I said interesting but it is what it is.\n\nEnjoy.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Lots of fun and informative", "We just happened to stop by the rookery and found the site to be extremely interesting. There was a docent that shared a TON of information with us about the elephant seals.\nThe day we were there, roughly 90-100 elephant seals were sun bathing on the beach. During mating season, we were told that the beach could have thousands of elephant seals!\nCost is free, but they do appreciate donations!\nShow less"], ["Reviewed July 23, 2017", 5.0, "Fun and Great Experience For All", "My family and I LOVE going to see the elephant seals! They are great to watch and listen to when they get excited and grunt incessantly. On this trip, the elephant seals are molting...they're shedding their old outer skin layer. Also the juvenile males are starting to play fight each other and posture for dominance. It was a sight to see and hear!\n\nTo experience these grand creatures, you just have to take a scenic drive up to San Simeon. Here's the plus....IT'S FREE!!! Trip tips...get here early because parking gets full fast during peak hours. Bring binoculars for far viewing and a camera (or a good camera phone). Jackets are recommended because it gets kinda chilly and windy. Also, don't limit yourself to a particular area. Walk around a bit because there's always something different to see.\n\nWe actually saw a baby elephant seal on this trip! It looked like a small harbor seal...but was definitely a baby elephant seal. Its mama kept calling out to it when it swam too far away.\n\nSo if you happen to be in the Central Coast, go and see these gigantic elephant seals!\nShow less"], ["Reviewed July 22, 2017", 5.0, "Never seen this many wild elephant seals up so close!", "Tons of blubbery, muscular male elephant seals in July laying in the sand, molting, and sparring in the waves. Good for 20-30 minute stop to just observe and listen to their bellowing. The park guide said in May the females come to the beach and December was a great time to see the males engage in true battles for mating rights. Cool experience and the kids loved it!\nShow less"], ["Reviewed July 21, 2017", 5.0, "amazing", "Watching these animals is amazing. Lots of room to pull off the highway, Safe for children since it is fenced to protect the seals. Great picture spot and usually a ranger there to answer all your questions"], ["Reviewed July 21, 2017", 5.0, "Fascinating!", "My daughter loves marine animals, so we knew this had to be a stop. Amazing. There were easily 20-30 elephant seals on the beach. A docent was there to answer questions. We probably spent 45 minutes there."], ["Reviewed July 19, 2017", 5.0, "You MUST stop to look at these strange creatures", "Have to stop by here every time in the area. All males this time - different seasons bring different activities - haven't made it at calving time but hope to one day."], ["Reviewed July 17, 2017", 5.0, "Fascinating!", "This is a stop along the coast that is sure to thrill anyone! Elephant seals can be seen along the beach and in the waters from the boardwalk designed for viewing. The large creatures are fascinating to watch. During our visit there were volunteers there to answer questions and share their knowledge about the elephant seals and their habitat.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Easy to get to, uncomplicated to access", "What I liked most about this site was that you could just drive there and pull off the road and see the seals. Nothing to pay and no hike to make, it is just there and fun to watch them."], ["Reviewed July 15, 2017", 3.0, "Not really my thing", "Helen loved seeing the seals, hearing their calls and photographing them. For me not so much. Maybe I have no affinity for seals!"], ["Reviewed July 15, 2017", 5.0, "A Place of Wonder!", "If you haven't been, GO. If you have been go again! Seeing and hearing these huge animals is an experience I don't quite know how to word. Suffice to say you will never forget the experience."], ["Reviewed July 13, 2017", 5.0, "ONE OF THE HIGHLIGHTS OF OUR TRIP", "Anything along Hwy 101 is amazing. The blue water, blue skies and white clouds were amazing. We were able to see some surfers trying to catch some waves but the main attraction was the elephant seals. We were lucky enough to stand by an older gentleman wearing a blue vest. He has been studying the elephant seals for many years. He was able to tell us about so many things about them. He told us they could reach up to 5,000 lbs. They were lying on the beach in large numbers. Our knowledgeable new friend said they were lying on the beach to molt and to get ready to sire offspring. It was an amazing sight to see. It was a very peaceful activity. Some of the time we just spent watching them, looking at the beautiful coastline and feeling the cool ocean breeze. It was wonderful.\nShow less"], ["Reviewed July 12, 2017", 5.0, "watch them sun baking in the sand", "I have never seen so many seals lazing in the sun on the sand there were a few frisky bulls trying to fight in the water great or kids to see natural habitats"], ["Reviewed July 11, 2017", 5.0, "Fun stop", "We stopped here after visiting Hearst Castle and even though it was cool and windy, we enjoyed watching the Elephant Seals sleep, argue, kick sand, etc. Quite entertaining."], ["Reviewed July 11, 2017", 5.0, "Had to see the seals", "Had to see the seals. It was very cold but that was welcomed as where I live was over 100 that day. Seals entertain. Excellent experience that is free!!! Amazing time."], ["Reviewed July 10, 2017", 5.0, "Spectacular View of Seals and Ocean", "Was an amazing experience to see all of the seals on the beach in a natural habitat, free of charge which is unusual at most places. The views were spectacular!!"], ["Reviewed July 10, 2017", 4.0, "close up views of wildlife", "This place is great for all ages there's probably a couple hundred elephant seals just scattered on the sand beside the rocks and you can see more of them playing in the water and some making their way to and from the water. They're so entertaining, although they are smelly. When you park you won't be able to see them close so walk down a bit to get a good sight.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Fun stop!", "This was a fun spot to stop and observe the entertaining elephant seals! It was a huge hit with kids of all ages, and you can follow a well maintained boardwalk path for an easy walk. The Friends of The Elephant Seals were there to answer questions and educate tourtists about these massive seals! A great stop along Hwy 1!\nShow less"], ["Reviewed July 8, 2017", 5.0, "Baby seal!", "We loved watching the big males and also a tiny little baby coming out of the ocean! Very windy--so come prepared!"], ["Reviewed July 7, 2017", 5.0, "Seals naturally in the wild", "On the day we went to the elephant seal rookery, there must have been well over 200 seals on the beach. What a sight! I have never seen so many in their natural environment at such close quarters. Would thoroughly recommend a visit to this free attraction\nShow less"], ["Reviewed July 7, 2017", 4.0, "Elephant Seal Rookery Up Close and Very Personal", "This is a special rookery site where elephant seals relax and many mate. Be prepared to explain the facts of life to your child if you take a child because you are up close and they are getting very personal.\nIt is amazing how many of them there are and their SIZE is also amazing.\nIt can be very cold as with any coastal area, but for the nature lover, this is a must see\nShow less"], ["Reviewed July 6, 2017", 5.0, "Go see the seals!", "The seals are a must see if you're in the area. There are docents on site that are very knowledgeable and will add to your experience. How many seals you see will depend on the time of year you visit."], ["Reviewed July 4, 2017", 4.0, "It Will Put a Smile on Your Face", "The elephant seals look like they are really enjoying themselves, sunning on the beach. Plenty of picture opportunities and parking is just off of the road. The location is about four miles north of Hearst Castle."], ["Reviewed July 2, 2017", 5.0, "Free viewing of hundreds of seals on the beach; very easy to find as well", "We visited San Simeon a few weeks ago and loved this free attraction. Located just past Hearst Castle, right along the highway was the seal rookery. It was literally a beach covered in seals (see photos). I have never seen or heard so many seals in my life. Most of them were there to rest and if you stayed to watch, you'd see more coming and going from the beach. Well worth the stop. Educational too!\nShow less"], ["Reviewed July 1, 2017", 5.0, "Easy viewing of Amazing animals", "Easy to access to a great viewing area where you actually see the seals up close. Knowledgeable volunteers on site that are very willing to answer questions! Well worth the short drive from Cambria"], ["Reviewed July 1, 2017", 5.0, "Incredible!!!", "Hundreds of elephant seals on the beach and playing in the ocean. This was a sight and we felt like we were in an episode of National Geographic. The volunteers are very knowledgeable and interesting. This is a must. We stayed for about 45 minutes."], ["Reviewed June 29, 2017", 5.0, "great", "noisy, smelly but well worth a look - easy to park and is very safe for kids - information boards nearby"], ["Reviewed June 28, 2017", 5.0, "Not much to do but fascinating", "I was completely in awe! Although there isn't much to do around and about, it is definitely worth a trip & give yourself longer than you'd expect - we thought an hour would be fine, ended up wanting to stay much longer!"], ["Reviewed June 27, 2017", 4.0, "Was Neat To See - You Only Need 10 Minutes Here", "It was free! You pull off of the road and watch the elephant seals lay around on the beach. After 10 Minutes, we were back on the road. It was worth the stop."], ["Reviewed June 26, 2017", 5.0, "Do NOT Miss This Unusual Look into An Animal Habitat--Good for All Ages", "You might think at first that there are only a few pups on the beach but as you walk on you see larger and larger groups. It doesn't matter: in large numbers or small watching these animals interact or at rest is fascinating activity well worth an hour or more of your time. There is a naturalist on hand to answer your questions, explanatory placards, and you can buy some swag but mostly this is an opportunity to see animal in their natural habitat. We were there during molting season: we saw verbalization, some challenge to position, shedding of skin, some pups swimming, moving in and out of the water, large and larger pups (although not the larger ones, which are male, and not that prevalent when we were there). It is a must-see, unique, and thoroughly engaging look into our wildlife.\nShow less"], ["Reviewed June 26, 2017", 5.0, "A must visit", "Love coming here to see the Elephant Seals. You could spend hours just watching these amazing creatures. If you're even close to the area, you MUST stop by just to watch for as long as you can!"], ["Reviewed June 26, 2017", 4.0, "Definitely worth experiencing!", "This is a one of a kind experience to see these amazing creatures in their natural habitat along the beach."], ["Reviewed June 25, 2017", 4.0, "Worth a Visit", "It's def worth stopping hear not only to view these huge deals but to listen to the noise!\nThere were lots both in the sea and basking on the shore , some fighting whilst others basking in the sun.\nFascinating to watch do I'd definitely make an effort to stop even if it's only for 10 minutes.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Awesome", "We loved seeing the seals! It was a cool day and even though we were warned it could be smelly it wasn't. The seals were active, we saw a few 'play fighting' and even spotted a few pups."], ["Reviewed June 25, 2017", 5.0, "worth a stop if driving up to Big Sur or Hearst castle", "Its a one in a lifetime stop to see a place on the Central california coast where up to 20,000 of the world's elephant seal population call home. Great view of the seals in their natural habitat. The best time to go is in December/January. Great views of these magnificent animals.\nShow less"], ["Reviewed June 24, 2017", 5.0, "Seals as far as the eye can see", "Thousand of seals rest here, sunning themselves, sparring, and flipping sand onto their backs. You have an excellent view from above the beach along a boardwalk."], ["Reviewed June 22, 2017", 5.0, "Granddaughters adventure", "We left Morro Bay and took the granddaughters up here. They loved it. Hardly anyone there so we had it almost to ourselves"]]}}