{"Exploratorium": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Exploratorium", "url": "/Attraction_Review-g60713-d102775-Reviews-Exploratorium-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/bb/27/b4/get-hands-on-with-more.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2980"}, "address": {"@type": "PostalAddress", "streetAddress": "Pier 15, on the Embarcadero", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94111", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 4.0, "Educational!", "Hands-on place for young children, or those young at heart too.\nFree wifi and benches for you to rest your feet .\nVery well stuffed shop with various educational toys and games , books , T shirts and mugs and many more .\nIf you are strolling from the famous Pier 39 towards Pier 1 ( where the clock tower and Market place is ) this is a good place to stop for a break.\nShow less"], ["Reviewed 3 days ago", 5.0, "Amazing", "Awesome for kids and adults. My six year old had he best time! It was really busy but couldn’t tell really because of how it is set up and because there are so many exhibits."], ["Reviewed 4 days ago", 5.0, "Great for the 6 yr old AND the 12 yr old (AND the parents:) )", "Well worth the price of admission. It kept both my kids busy and informed throughout the day. We paid extra for the tactile dome (which we all loved-glad we did the hour session instead of the half hour). We also really enjoyed the Sea Glass cafe in the back.\nShow less"], ["Reviewed 5 days ago", 4.0, "Fun Way to Spend Time Together", "Five of us rented the antiquarians room and had a great time figuring out how to escape. All but one of us had done another escape room before. I like how all of us were able to contribute to getting out. We were told that this room has a 40% escape rate.\nShow less"], ["Reviewed 6 days ago", 5.0, "LOVED", "Our visit to the Exploratorium was the highlight of our time in SF. Our three kids, who are 13, 11, and 7, fully engaged with the experiences more than I have ever observed at any other museum we have visited. They, and I, stayed until closing time, planning to find out more about many concepts presented. Make it a priority!\nShow less"], ["Reviewed 1 week ago", 5.0, "Hours of learning and fun", "While the Exploratorium was quite busy at the weekend, as you’d expect, it’s a large space and people move on quite quickly from each installation - and there are hundreds for all age groups.\n\nThe only drawback was the rather expensive restaurant, just get your hand stamped and come back later, or join and return time after time if your local.\n\nMake sure you go upstairs and experience the camera obscura, and take care putting your hand in the soil that heats itself - insane.\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome place", "Great day for kids or adults! Lots of cool things to check out and do. Plus the worlds fair grounds outside are awesome."], ["Reviewed 1 week ago", 4.0, "Entertaining a Toddler", "This is a great place to take a toddler. You can let them run from exhibit to exhibit and touch and play as much as they like. Its a refreshing change from having to stop them from touching/grabbing everything most everywhere else that you go."], ["Reviewed 1 week ago", 5.0, "So Much to See and Do!", "My wife and our kids (8-6-1) spent 2 hours here and could have easily stayed for more. Tons to see and do. Tons of hands on. Great learning experience for the kids. Clean, friendly and even a cafe for food. Indoor and outdoor exhibits. Loved it!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Outstanding Place to Take Kids", "I didn't know what to expect but I have to say this far surpassed my expectations. The number of hands on exhibits to teach kids (and adults) about science is overwhelming. There is so much to see and do that it takes at least a whole day if not more. If you can I would suggest a membership where you can take in a few hours at a time. If not try and breakup your visit into 2 or 3 hour blocks. I guarantee you cannot get through this in one day because there is so much to do. Life sciences, time and motion, optics, electricity and magnetism and other areas. I wish I would have had days to experience this.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "So much to do", "Spent a morning here and the time flew by. Really hands on science exhibits which surprise and delight grown ups as well as kids. Loved it."], ["Reviewed 2 weeks ago", 5.0, "One of the best in the world", "Maybe one of the best if it’s kind in the entire world. Our 12 year old spent four hours in this wonderful hands-on museum on the water and saw less than half of what it has to offer. It is one of the highlights of our trip to San Francisco.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Hands On Science for Kids and Adults", "I recently attended the museum with a group of Interns from work. We enjoyed have our minds blown by all of the science.\n\nMy favorite exhibit was the giant curved mirror. It was nuts. I also liked the outdoor exhibit that demonstrated rain storms that have occurredin other parts of the world.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Experience to spend half a day with kids", "Our first day in SF with an afternoon to kill, we came here and was not disappointed. I've been to several similar science and technology hands-on experiences in different cities and this is one of the best. It's more costly than any I've been recently, but I think it's worth it.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Science, Fun & Views", "Located on the Embarcadero at Pier 15, it's just a few blocks walk from the SF Ferry Building. A newly renovated location has greatly increased the marvelous collection of \"interactive, hands on\" science exhibits for all ages. There's good parking right across the street but like all SF lots - $$. The SeaGlass Cafe' is easy for lunch or later afternoon snacks. The Gift Shop's a marvelous spot for fun stocking stuffers, kids birthdays and adults gifts!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "So much to do", "I was surprised at how much there is to see and do. You could easily spend more than 3 hours in this place. It's shaped mostly like a rectangle so it would be hard to get lost. There are things to do for almost all ages.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun for all ages", "My friend and i went to the after dark experience which was great and one of the highlights of our trip. If your an adult child the after dark session is perfect (exclusive to over 18s) as there are no pesky kids hogging all the fun stuff + there is alcohol. If you have the chance while in San Francisco definently visit this place.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "You have to do this. It's not just for kids, however there a lot of them.", "You have to do this. It's so fun. We, as adults, don't play enough. Spend a day here and come play with science!\n\nIt's not just for kids, however there a lot of them, sometimes.\nIf you have small children you've gotta bring them here. It's magical!\n\nIf you're tired of children then Exploratorium After Dark | Thursdays is for you. Come get a drink here and enjoy.\n\nWhen it reopened at this location my GF and I came to check it out and ended up getting a membership so we could come back a few times. Great for adults, too!\n\nParking is on the other side of the Embarcedero.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Excellent museum!!", "I had a great time at this museum during a trip for my physics class at school. It is a fairly large museum with MANY small exhibits to play around with. I visited the Exploratorium back when it was located at the Palace of Fine Arts as well and recognized a few of the exhibits they carried over to the new museum such as the marble funnel and the cone that blows air. The museum is divided into several different sections including biology, noise, electricity, and others. The coolest exhibit is the toothpick sculpture, \"Rolling Through the Bay.\" I did not buy food here or even visit the food area. The actual \"Exploratorium\" merchandise is quite limited and I found myself struggling to find a souvenir that simply said \"Exploratorium.\" Everything is also grossly overpriced. I finally settled on a neat kaleidoscope for 8 dollars. Overall a very cool place to visit. Highly recommended.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Family fun", "I visited her with my two children 12 & 9 to fill in a rare rainy day in San Francisco. We spent all day looking around and having fun. There is something for everyone here no matter what age. A hands on practical experience day that is well worth a visit.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Great place to take kids", "Very nice venue for kids to explore science. Located on Embarcadero it is a short walk from the Ferry Bldg. Should plan to spend several hours there to get the most out of the place. It does take time and can be crowded"], ["Reviewed January 24, 2018", 4.0, "Great for kids", "Came here with my 7-year-old cousin who had a great time. He'd been here before and was still occupied for hours. Plenty of places for adults to sit down as kids explore. A few things to interest even adults though I suggest bringing a book along to keep you occupied as can get tedious. Within walking distance of other Fisherman's Wharf attractions and restaurants.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Wonderful place for kids", "This place is a homeschool parent's dream. Our family (2 adults and a 7-year-old) spent a day here, and didn't get to everything. The hands-on exhibits are very well thought out and engaging for children. We particularly liked the cooperation area. We paid extra for the Tactile Dome, but it was too dark and scary for our daughter. Everything else was spot on.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Small vacation", "What a wonderful place to take a young child and or teenager. Lots of wonderful things to examine learn and investigate. And the view out the window as wonderful of the bay. Very clean warm friendly safe and good access to parking and transportation. And close to the wharf and other restaurants which makes it awesome\nShow less"], ["Reviewed January 22, 2018", 4.0, "Fantastic!!", "Almost 5 hours touring this interactive museum which is ideal for kids and adults alike. Lot of fun and lots of interesting things related to different science fieds.\nTip 1: start by the areas located at the back and walk your way to the front. You'll avoid crowds (for a while).\nTip 2: If possible, bring a snack or something quick to eat, so that you don't waste time at their fast food place (expensive and crowded!!).\nShow less"], ["Reviewed January 22, 2018", 4.0, "Great for kids, okay for adults", "I compromised on four stars because it is actually FIVE stars for kids and three stars for adults. Lots of great interactive exhibits for ages six or seven through pre-teen. Highly recommended!"], ["Reviewed January 21, 2018", 5.0, "So much fun!", "Went on the Thursday adults only night and it was fantastic! The interactive displays were so much fun and definitely not just for kids. It wasn’t too busy so there were no lines for anything. Would recommend."], ["Reviewed January 16, 2018", 5.0, "Definitely worth seeing", "This place is for all people who like puzzles and want to know how things work. All sorts of areas, sound and motion, life and water, social behaviour to name a few. It’s on Pier 15 and we got there after walking a few blocks after being dropped off by our hop on hop off bus. Good value and a lot of fun.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Yes, yes, yes!", "For so many reasons yes to this place! It is engaging, it is fun for all ages and it is so cool! The best part is that they love teachers so if you are a teacher you can get free admission! It kept my three year old engaged the whole entire time we were there. She loved playing with all of the different \"experiments\" and because it is very interactive it was easy for her to play with everything in there.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Science overload", "A visit to the Exploratorium was the last event on our SF family holiday schedule and it was fantastic. Lots to see and actively participate or interact with throughout the museum. Some of the more popular exhibits had small queues but crowding around an amazing science demonstration somehow added to the fun.\nIt cost just under $100 for a family of four and provided half a day of entertainment. Food in the Glassworks restaurant was good and gave a nice view of the yachts sailing in the bay. The night entry or night events look like they would be fun to try.\nHighly recommended for families.\nShow less"], ["Reviewed January 15, 2018", 5.0, "A great kids experience", "Wonderful for children and there Grandparents too. Lots of hands on. Lots of opportunity to learn. Great rainy day or any day adventure."], ["Reviewed January 11, 2018", 5.0, "What a fantastic place", "We only had a few hours to spend here, which was not enough time, you can spend a day here.\nThe kids couldn’t believe all the hands on stuff to do.\nThe kids learnt how things worked and how things happen.\nEveryone had a fantastic time.\nThis is a must do when visiting San Francisco.\nWe will be back on our next trip to San Francisco.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Go for after dark on Thursday nights!", "Visiting from out of town and thoroughly after dark on Thursday nights. So fun to be in a science museum with all adults so you can try out the exhibits without feeling like you need to defer to the youngest in line.\n\nParking across the street cost just $10 after 5:00 or $15 (with the Exploratorium code) if you spend the day in the parking lot, walk around the area (Filbert steps, the pier and ferry terminal are all close).\nShow less"], ["Reviewed January 11, 2018", 4.0, "Great for kids", "The museum is really interactive and informative, but I felt that it catered more to children than to adults (I'm 21). However, the experience was still great! Had I been younger, I think I would have thoroughly enjoyed my time here."], ["Reviewed January 10, 2018", 4.0, "Very educational", "The place was educational but not as good as the Science museum in Boise, ID (maybe because it was not as crowded and went off-peak there). Best exhibit was the Einstein/Monroe portrait. If you look far away it’s a portrait of Marilyn Monroe but as you come closer it is Einstein. There were some outdoor exhibits. Would recommend to be there 1-3 hours; does not give Veterans or AAA discount\nShow less"], ["Reviewed January 9, 2018", 5.0, "You’d be silly to miss it", "So it’s day three in San Fran, you’ve done the Bridges, you’ve done the Wharf, the kids are sick of walking and Mum & Dad are skint....\n\nI walked past twice and thought “please God no !” But yet I was convinced it was on.\n\nA very pleasant surprise. There is so much to do, see, touch, play with, learn and discover\n\nYou really would be silly to miss it.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Holy Cow!", "When I was a kid I used to go to the older version of the Exploratorium. This new building and exhibits are phenomenal!! Plan to spend an entire day as there is so much to see and do!"], ["Reviewed January 5, 2018", 5.0, "a fun and engaging outing", "if you are traveling with kids, this is great place to visit. the displays, activities, and experiments are just astounding keeping minds of the young and old alike electrified. though pricey at $29.95 per visitor, our young ones were quite agog with excitement. there are enough to see and do for all types of minds. the displays on magnets or gears shows experiments using various techniques and methods.. a great place to spend an afternoon. after you are done, you can stroll over to fisherman's wharf and get a taste of coney island of the west\nShow less"], ["Reviewed January 5, 2018", 5.0, "Put a grin on your face", "The best thing about a visit to the Exploratorium is that you can make the visit whatever you want it to be. Every visit is different because things are constantly changing. You can spend hours playing and watching. As we entered there was a group of middle schoolers having fun daring each other to drink from the toilet drinking fountain. We played with the magnetics experiments. Enjoyed watching students experiment with light. We did not watch it this time; but, the dissection of a cow’s eye is very educational. The tide columns were fascinating. Next to the columns was a geyser demonstration. We sat and watched them for maybe a half an hour. If you get hungry, there is a restaurant. Next time you are near the San Francisco waterfront, spend at least an hour exploring the Exploratorium. Be careful, you might find yourself there longer than you anticipated.\nShow less"], ["Reviewed January 4, 2018", 2.0, "Must have been a school trip!", "There must have been a school excursion on the day my partner and I visited because we were bombarded by hundreds of children, running around and screaming. Ruined our experience as we couldn’t see or interact with any of the exhibits. Sure it would be fun though on a quiet day\nShow less"], ["Reviewed January 4, 2018", 5.0, "Lots of hands on to do", "We were here with my 10 year old and there were lots of hands on things to do. It was a lot bigger than I thought it would be. They say there is over 650 exhibits. We probably spend 5 hours here including time for lunch. There are also some outside exhibits which should not be missed. We would recommend that you bring some lunch with you as the cafe is not that cheap for food and there are quite a few table inside and out to eat.\n\nWe would have wished that it had a reciprocal membership with our local science center because it is a bit pricy to go to for an entrance fee.\n\nOverall, we would go back again. Lots to do here for kids and adults alike.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Fun hands-on museum", "This place is massive, we stayed here for about 5 hours and we didn't get to touch everything. It's kind of a kids museum with basically a ton of hands on experiment stations. There are kids touching everything in site and no hand sanitizer so you might want to bring your own if you are concerned about germs. My niece and nephew had a lot of fun with the experiments. kids around 6ish probably won't understand the science behind the experiments but they have fun just the same. There is a restaurant and gift shop here too. There are parking lots around the pier with cheaper parking than down by Pier 39 so park closer to this. We found parking for $20 for the whole day til 830 pm which is the cheapest paid parking I've ever parked in San Francisco. This place deserves all the great reviews.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great and very interactive science museum for all ages!", "The Exploratorium is a great family friendly stop for a few hours. Many interactive exhibits and right at the waters edge meaning you can quite easily get to other attractions in the area. For a bit more adult fun, go on Thursday nights for Exploratorium After Dark where they have bars, snacks and speakers. Great date night!\nShow less"], ["Reviewed January 2, 2018", 5.0, "Amazing experience!", "Whether you go to Exploratorium After Dark or just on an idle day, its an awesome experience! Many scientific exhibits that make you think, enjoy, and ask for more!"], ["Reviewed January 2, 2018", 2.0, "An Unstructured Hodgepodge of Exhibits", "This museum has great intentions but too little organization to truly help kids understand the relevance of the exhibits. The museum would benefit greatly by having some sort of introductory or framing at the beginning of each exhibit area. Why, for example, are there exhibits on vision, hearing, and human cooperation? What do these exhibits say about what it is to be human, especially in relation to other life forms? Very expensive and not worth it.\nShow less"], ["Reviewed January 2, 2018", 5.0, "You must visit this place when you are in San Fransisco!", "Be prepared to spend the entire day.. there is more than enough to do, to see, and to learn. What a great place!"], ["Reviewed January 1, 2018", 5.0, "Awesome educational cavernous location, great for kids of all ages", "We bought the City Pass and this place is one of the spots available as part of the program. We ventured here one day and came away very impressed. This place is HUGE and has tons and I means tons of hands on things to do mixing fun and science all together for the kids to enjoy, as well as the adults. You can easily spend four to five hours in here if you're not careful, and it some cases, could take you a day or two to complete given your schedule. I feel that on our trip, we probably saw everything, but it was in a bit of a rush. Take your time when you come here, enjoy and see everything you can, because it can be overwhelming due to the size and wide array of things to see and do inside AND outside. Recommend this spot for anyone with children from 3 to early teens.\nShow less"], ["Reviewed January 1, 2018", 5.0, "LOTS to do!", "Wow this place is huge. There were so many things to do. You need many hours there and have lots of energy. Very cool place gif kids and adults. We were tired and had a heavy backpack so would have been better to get a locker.\nShow less"], ["Reviewed December 29, 2017", 5.0, "The Exploratorium has something for EVERYONE!", "I have been a fan of the Exploratorium for many years. The location it previously occupied (Palace of Fine Arts) packed a lot of fun into the space allotted. My kids always enjoyed going (even though the space was pretty bland). The new location on the Embarcadero is quite a change. The venue has been well thought out, and designed quite well. A visit to the Exploratorium is a full day event (IMO). My suggestion is to open the place, enjoy a few hours, take a lunch break, then come back for more. Although a bit pricey, I think the Exploratorium is well worth your time. The exhibits are most excellent! Truly an amazing presentation of science.\n\nFor the adults there is a rather upscale restaurant/bar at the far end of the venue. Although I did not indulge, I could see that the menu (both food and beverage) was extensive. If $$$ not a issue, I would encourage a stop for a latte or beverage.\n\nIn summary, if you have a desire to see scientific exhibits/projects, the Exploratorium is a must see.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Great experience for children and adults", "This museum is chock full of hands on exhibits that allowed children and adults to explore science thoroughly. The space is large, and this allows them to include exhibits that go far beyond the usual science museum basics of spinning chairs and plastic atoms. Theory have probability simulations, dozens of exhibits exploring the science of music, and a huge outdoor gallery of experiments on which kids can climb. There is a great exhibit now on the science of cooperation. We'll worth the price of admission.\nShow less"], ["Reviewed December 26, 2017", 4.0, "Good Experience for Children", "Lots of experiential areas in many areas of science. When I was there there were a lot of school groups all having a very exciting time. As an adult I wouldn't recommend it and very expensive"], ["Reviewed December 23, 2017", 5.0, "Tremendously engaging and interactive opportunities for all family members to enjoy", "Our family had a wonderful time there wondering through the many varied interactive centers. Worth the money to purchase a ticket!"], ["Reviewed December 14, 2017", 4.0, "Interestingly Cool", "Cool interactive museum that is great fun for all ages. We stumbled upon this on our walk along the Embarcadero and decided to visit. Only drawback was that it happened to coincide with a school excursion so it was packed with kids running wild."], ["Reviewed December 12, 2017", 5.0, "Plan to spend hours, it’s that fun.", "We took our 3 grandkids here, ages 11, 8 and 6. All of us had a blast. There are so many interactive and interesting things to explore and learn about here. Truly something for everyone."], ["Reviewed December 12, 2017", 5.0, "The best hands-on science museum in the country.", "Great place to experience the joy of science. Many great exhibits and activities. Unlike any museum you will ever visit."], ["Reviewed December 10, 2017", 5.0, "The best science museum we have visited!", "We were in San Francisco for a family wedding. We have been to several science museums on family vacations, and this was at the top of the list. We spent all day here, and still didn't have time to do everything! It is located on the pier, so the outdoor views were awesome too. The cafeteria was handy and it was hard to choose from the creative options. We have wonderful memories of this museum experience!\nShow less"], ["Reviewed December 4, 2017", 5.0, "A must try experience for kids!", "We brought our two girls for a short visit (45 min) to the Exploratorium (it closes at 5 pm). My girls were intrigued by the different exhibits and they tried any many as they could.\n\nGood to plan at least 2 hours for the experience so that you can make the ticket prices worth it.\nShow less"], ["Reviewed November 24, 2017", 4.0, "Informal science at its best", "This is the first I've been to the Exploratorium in its new digs. It makes great use of the added space; more exhibits, more activities, and lots more people. I especially liked the very careful explanations of various social dilemmas; though I do admit to being surprised by how people from different nations respond to surveys about helping someone who is blind, has had an accident, or has lost something. Quite an eye opener, that was.\n\nThe mathematics exhibits combine and draw from the many branches of math. Some explanations require a basic understanding of the underlying math; but the displays and activities remain engaging.\n\nThe Exploratorium can get noisy with families loudly talking to one another and kids' laughter of delight. As a result, I got a headache and had to leave before having enjoyed the place as much as I wished to. Maybe they'd consider installing some noise damping panels near the ceilings....still, a wonderful place to visit.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Highly interactive fun for all the family", "Science is fun! A great place for a family visit with lots of interactive displays covering a wide range of sciences."], ["Reviewed November 22, 2017", 4.0, "Good way to fill in a few hours", "Went to the Exploratorium one afternoon and spent a few hours there. Lots of hands on exhibits to try and workshops to sit in on. The kids had a ball. A bit on the pricey side so perhaps think about getting the City Pass for some savings.\nShow less"], ["Reviewed November 22, 2017", 5.0, "Amazing", "We went on Thursday night (the Exploritorium is open on Thursday nights from 6-10pm for adults only) and it was an amazing experience! We loved that you can have an adult beverage and walk around the place. There was so much to see, do, touch, smell that we almost needed a second day to take it all in! A great place to take a date!\nShow less"], ["Reviewed November 22, 2017", 5.0, "Head and shoulders above every other science museum I've visited", "Imagine if your high school physics class had an unlimited budget for lab experiments. You'd end up with this place. It's size, scope, and the creativity of it's designs is almost startling. They manage to cover just about every topic and concept in everything from physics to sociology. I recommend a minimum of 4 hours, but a full day is better. Just avoid the overpriced restaurant.\nShow less"], ["Reviewed November 18, 2017", 5.0, "The best Museum I have EVER been!", "OK, so I got to visit the museum for free as part of a conference I was attending, and it was the best part of the conference!! I am not a fan of museums at all, I have always found them very boring, but this one is truly something else.\nI cannot stress it enough: you have to visit this museum! Oh and in case you have kids?Don't worry, they'll love it too!\nShow less"], ["Reviewed November 16, 2017", 4.0, "Get there when it opens", "Great place to take kids of all ages. Get there when it opens and you have the whole place to yourself. Within an hour, school trips arrive and it gets very busy."], ["Reviewed November 16, 2017", 5.0, "Field trip for all ages!", "There's so much to see and learn in this place! Very entertaining and interactive for all ages -- definitely felt like I was back in school."], ["Reviewed November 15, 2017", 5.0, "Geek out fun", "This hands-on science museum is for kids of all ages. Originally housed in the Palace of Fine Arts area of San Francisco, the Exploratorium moved to its own building on a conveniently located pier along the Embarcadero, near the Ferry Building. It's a beautiful site and the permanent and special exhibits are worth hours of exploration. Good restaurants and gift shops too!\nShow less"], ["Reviewed November 14, 2017", 3.0, "Very enjoyable but not as we expected", "This place is a very entertaining place for young kids to enjoy an interactive experience. There are many unique displays for learning about sound, connections, sight, function, form, etc. We expected things to be a little more high tech with a little \"wow\" factor. Instead, the displays were mostly basic, slightly dated and one-dimensional. After about 1.5 hours we had seen enough to move on. Our kids are 7 & 8 did enjoyed their experience. It's worthwhile and interesting, but a bit expensive in our opinion.\nShow less"], ["Reviewed November 10, 2017", 5.0, "I felt like a kid again", "This place was really fun. There were plenty of exhibits that sparked my interest in science and learning."], ["Reviewed November 10, 2017", 4.0, "There's Lots More To Do Than Estimated", "Came here expecting a 1-2 hour trip with some exhibits, but we stayed almost 4 hours.\n\nWould HIGHLY recommend if you have kids and would HIGHLY suggest if you're without kids to go during their adults only night session. Plenty of school groups running around until 2-3pm so be warned.\n\nOtherwise, very informative and entertaining way to spend some time along the waterfront.\nShow less"], ["Reviewed November 8, 2017", 3.0, "It's not bad...", "It's not bad. I imagine for kids it's fantastic! As two 30 somethings we found some parts interesting and some parts not so much. I'd imagine the target audience is children though and it probably hits the spot there.\n\nFor us though, average and probably over priced for what we got out of it.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Beyond awesome!", "This was a perfect choice for spending the morning with family of all ages. We all loved it and it was great seeing the young adult cousins (19, 22) bond with the littles (6, 8) over the exhibits. My 6 year old loved that everything was hands on and he could, push buttons, move levers and touch as much as he wanted. Highly recommend!\nShow less"], ["Reviewed November 6, 2017", 4.0, "Interesting place", "It's a pretty amazing place to be considering it is both entertaining for both young and old. We didn't spend too long in here as we had other places to visit but i can only imagine if we had more time. There's too many interesting exhibits which you can play and experiment.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Science your kids!", "great spot for learning and fun. Science is explain via exhibits. There are all sorts of special event and the space is really fun. On some nights they have an adult event and there are drinks served. A great tourist or just fun for the family or science minded people.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Entertaining and 😜", "Went here with my brother. It was a blast. Where else can you drink on a tolilet water fountain, pretend skateboard, and explore psychedelic objects. It’s definitely a must go for families especially with older kids."], ["Reviewed November 3, 2017", 5.0, "Dun at any age", "We got there at 3 and they closed at 5... we could have easily stayed there 4 hours. It is just an amazing place and a must go to specially if you are travelling with kids."], ["Reviewed October 31, 2017", 5.0, "Fascinating for both young and old", "A science museum where you can touch more or less everything. We took our 2 year old grandson there and he was fascinated as were lots of other children, including teenagers, and adults. Well worth a visit but be warned there are lots of groups of school children there.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Hands On Tech Museum", "My first experience with the Exploratorium dates back to the early 1980's when I was doing some work out in this area. Back then I spent many hours at the museum and even maintained a membership for many years.\n\nFast forward to 2017 - the Exploratorium has a new home since the last time I visited and it seems even better than I remember.\n\nIf you like science and tech this is the place for you. This is also one off the few museums where you could easily spend most of the day. It can get crowded especially with families - and they host an adults-only evening on Thursday's from 18:00 to 22:00 (with a discounted price).\nShow less"], ["Reviewed October 25, 2017", 5.0, "So fun!", "I recommend they city pass this attraction comes included it’s so worth it! We were a group of four and we enjoyed every single minute of it."], ["Reviewed October 23, 2017", 5.0, "So many to see, to do, and to learn in this huge science museum!", "Situated on Piers 15 and 17 in San Francisco's Embarcadero, the Exploratorium allows visitors to explore the world via science, art, and human perception. The mission of the museum is to produce inquiry-based experiences to transform learning worldwide.\nThis museum is divided into six exhibits (of which one is outdoors), each with numerous exhilarating interactive displays for experiments to keep everyone engaged. Plenty to see, to do, and to learn! Plus, the not-too-expensive general admission fee is worth the price to spend several hours wandering around the museum.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Great place to take your imagination, a Willy Wonka Science Factory of a place!", "This is a great place for anyone, any age! Took my 2 year old grand daughter and she loved it. All the hands on exhibits are so interesting and definitely not just for kids. Ever wonder how something works, what makes something happen? Come to the Exploratorium to get all your questions answered. I could spend a week in this place.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Good fun, needed longer!", "I only had 3 hours as I had a flight to catch and I probably didn’t even get through half the exhibits! Lots of fun things to do and try. I also did the Tactile Dome which was a unique experience that is definitely worth doing as long as you aren’t afraid of the dark!\nThis Sunday was free entry - don’t know how often that happens but it made it a great bargain (as I only paid for the Dome).\nShow less"], ["Reviewed October 18, 2017", 4.0, "Thursdays after Dark!", "After our first full day in SF, decided to go to the Exploratorium for their adults only evening. What a great experience. I know that during the day it must be filled with children, but adults should make time to go to it. We were two couples in our 60's.\nI Believe that most of the others there at night were in their 20's and 30's, but that didnt stop us from having a lot of fun. Very much a hands on experience, and we wouldnt hesitate to come back.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Worth a visit!", "Visited during the \"After Dark\" one Thursday evening. Worth dealing with the crowds to get discounted admission. Make sure to check out the outdoor exhibits/experiments as well!"], ["Reviewed October 18, 2017", 5.0, "One of the Best Science/Engineering Museums in the US", "Our family of four (kids 13 and 10) went here in April 2015 during a family trip to San Francisco. We boated to Alcatraz, biked across the bridge to Sausalito, visited the Academy of Sciences and de Young Museum, etc. We'd never heard of the Exploratorium, but we had a City Pass that covered admission, so we gave it a try. Years later, we talk more about our day at the Exploratorium than anything else we did during the trip. Everything at the museum is interactive and fun. The place also has one of the best cafeterias I've ever seen in a museum. GO HERE.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Fantastic place for all ages", "This place is the best! We spent hours here. My kids loved it. So many cool things to see. Great learning experience for all ages. It's a must to see. Don't miss it. One of my favorites."], ["Reviewed October 17, 2017", 5.0, "lots to do", "A large Science Centre, there is lots of hands-on stuff. To our surprise we spent four hours here - without kids!"], ["Reviewed October 16, 2017", 5.0, "Fun for the scientist", "A 15 year old grandson chose this place. Mostly there were preschool kids and elementary school kids there, but all ages enjoyed the displays and learned a lot."], ["Reviewed October 15, 2017", 5.0, "Endless fun", "My kids (8 & 10 year old boys) loved visiting the Exploratorium. We spend several hours there and did not have time to see everything. It is at the top of their list for a return visit."], ["Reviewed October 13, 2017", 5.0, "A hands on experience", "If you have kids this is a must. Science is broken down into hands on interactive exhibits. Everything from sound waves to light to centrifugal forces. Trust me your kids will love it and you will spend hours here."], ["Reviewed October 11, 2017", 5.0, "If You Are Visiting San Francisco with Children, Do Not Miss the Exploratorium", "I grew up here, so I went to the old at the Palace of Fine Arts forever. This one is still delightful, remaining true to the philosophy of \"hand-on science museum\". I love the muons and could stand at the table where you spin various lead spheres for ages.\nI have come back again and again as an adult with new kids of family and friends, and with just adults. It is magical, and keeps you young at heart.\nShow less"], ["Reviewed October 11, 2017", 5.0, "So Much Fun!!!", "I took my teen age daughter who really didn’t want to go, but she loved it! Everything is hands on! This place reminds everyone how much fun science is in general. It feel’s like you are doing experiments through out the place. We will definitely return for another visit when we are in town again.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Hands-on museum for children", "When we went there were about 100 primary schools at the place on their day out and we can see why- there are a lot of hands-on exhibits that are designed an interest in the sciences in young minds."], ["Reviewed October 8, 2017", 5.0, "A must for any age", "My husband and I could have spent a few more hours if we weren't meeting a friend. We laughed, smiled and greatly enjoyed ourselves. I had been there as a child and now in my 50s."], ["Reviewed October 7, 2017", 4.0, "Regular attractions", "Nothig spectacular so I don´t recomend to spend a few hous here, there are more interesteing places to visit"], ["Reviewed October 6, 2017", 5.0, "A MUST GO", "An Extraordinary place for kids around 4 and up and an adult. I bet it is an amazing place to explore with the class. we did visit it as a family vacation day and we have only one day to explore. If you have enough time just expend at least 2 days. If you have limited time just go as early as you can and stay the whole day. They do have some food I did not look the prices but you can get in with snacks. It is very intense for the activities and things to do. I got the tickets through City pass.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Nice place to visit", "I was planning this trip for almost a year LOL. I booked tickets online in advance since I was planning my visit on a busy day - Saturday afternoon. But things didn't work out on that day, we would've spend only one hour there due to the traffic. So, I called the museum and a very nice lady was able to reschedule our tickets for the different date. We arrived around 11 and left around 4:30. I guess it summed it up: kids had a blast! We also had lunch over there, which was actually not bad for this kind of situation.\nBelieve me, we didn't even see all the exhibits. Highly recommend! My favorite was observing ice formation through the colored glass. It was breathtaking show that Mother Nature gave us as a gift, but colored glass took it to the next level.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Exploratorium - great hands-on science museum", "We went there with a family group... seniors, adults, and young children. There's something there for everyone! The new location on the pier is huge and wonderful, with both indoor and outdoor things to do and see -- we all had a great time. There's enough there to spend either a couple of hours or most of a day, depending on everyone's energy level.\nShow less"], ["Reviewed October 4, 2017", 5.0, "A must see science museum for all ages....", "I love this museum. I have been here a few times and each time seems like the first visit. You get to play with the exhibits and experience light, depth, sound and vision in new ways."], ["Reviewed October 3, 2017", 5.0, "Amazing hands-on venue", "This place is as fun for adults as it is for kids. Hundreds of hands-on stations that teach science and entertain you in the process. We spent two hours here and didn't see half of the exhibits."], ["Reviewed October 2, 2017", 5.0, "One of our favorites.", "My grandsons (9 & 11) LOVED this place and the adults did too. There were many very young children there with parents and they were also finding things they liked. You can't possibly see it in one trip."], ["Reviewed October 2, 2017", 5.0, "Fun learning for all ages!", "We visited the Exloratorium while at Pier 39 and had a blast interacting with all the exhibits! As a science teacher I was familiar with the concepts presented but the exhibits were entertaining for even non- geeks and had some serious cool and surprising phenomena represented. A must for your kids!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Monday Trip to Exploratorium", "The Gift Shop was open and incredible............ Almost made up for not clearly reading the \"fine print\" about the Open Hours of Operation for Exploratorium. This OOPS quickly ended my reign of Vacation Activity Coordinator."], ["Reviewed October 1, 2017", 4.0, "Fun fun", "It was very fun and interesting!! Kept walking for 2.5 hours and still haven't finished seeing and interacting with all the displays. We went on a Saturday and it was fairly busy. It'd be nice if there were hand sanitizer stations around since, you know, hundreds of people (lots of kids) touch those buttons, switches, etc every day.\n\nShow less"], ["Reviewed September 28, 2017", 3.0, "Pretty good", "Lots of stuff to see and do here and it is very interesting but there is almost too much! It was a little overwhelming but if you're into science you won't want to miss it!"], ["Reviewed September 28, 2017", 5.0, "Adult night. 3 hours gone in the blink of an eye!", "Thought this place looked excellent and an adult only evening would be the perfect way to explore. We arrived just after opening and it was already fairly busy, and it continued to fill up. Despite this, we never had to wait long to look at any of the displays.\nThere are literally hundreds of interactive displays to look at, all being fun to use and also educational, what more can you ask for! We lost all sense of time there and before we knew it we'd been there 3 hours and it was nearly closing time.\nSeemed like a good place for a date night as lots of couples were there!\n\nExcellent value for the evening, there was even a bar service with drinks at around $9-$10.\n\nWouldn't hesitate to recommend this place, for people of any age!\nShow less"], ["Reviewed September 26, 2017", 5.0, "Wish we'd had more time!", "Totally hadn't planned to spend time here, but had a free morning before our Alcatraz trip and teen boy wanted to check it out - and we wished we'd had more time! Lots of cool experiments to run, a great maker space to create cool science/art, and much more. Reminds me of some other cool hands on science museums we've been to in Wales and Paris where we went on a whim and wondered why people hadn't raved about them more to us so we would have known to a lot more time!! On a gluten free note, there is a small cafe on site that we ate at and they were able to walk through what my celiac son could have - he ended up getting a mission dog with no bun but all kinds of toppings.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Fun place for all ages", "My friend and I loved this place there was so much to explore. We spent a couple of hours looking around on the community day which was free to the public but we gave a donation, and we could have spent longer there. If we had paid I would have said it was definately worth the money. You get to explore through sight, smell, touch and hearing along with a few games for the mind, it was great fun and to be honest the adults were having as much fun as the kids.I can't say what my favourite activity was as there were so many great ones. This place is definately worth a visit. GO,GO,GO\nShow less"], ["Reviewed September 25, 2017", 4.0, "Kids young and old will love it.", "If you like \"hands on\" science, then this place is for you. It was pretty quiet when we visited but everyone was having a go at something and with different zones covering different scientific themes, there is a zone or two for all. Get there early as we lost track of time here and were kicked out at closing time, having been there for four hours.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Tactile Dome - wows grandson", "Our 12 year old grandson loved the exploratorium and went through the tactile dome three times. His mom had to come out before finishing. Tons of hands on learning experiences that were fun for everyone."], ["Reviewed September 23, 2017", 4.0, "Go on Thursday evening for a boozy science experience", "Fun night for adults if you go on a Thursday night, they serve booze. Science and booze were made for each other! Really fun experience. Tip: get there early so you don't have to wait in line to have a go at the activities.\n\nI'm not sure how much it costs as my cousin had 2 free passes with her bank. But I think it's around $30USD and bring ID.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Amazing", "This place was amazing. I visited this place with my 60yr old mum and she had a great time. Being a teacher I loved all the different ideas I was able to get just from the few hours we were there. I could have spent a whole day exploring each activity.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Awesome!", "Great place for any age. You are not able to try out everything, because there is so much to discover. You can easily spend half a day in there!"], ["Reviewed September 19, 2017", 5.0, "Fun for adults (even without kids), but very crowded", "I first visited the Exploratorium about 12 years ago when it was located near the Palace of Fine Arts. I remembered it being a lot of fun. I went with two friends and one of them took an amazing picture of the other one facing off with \"Albert\" (a lighted face that follows your movements making it seem sentient). Recently, my mother, husband, and I got the CityPass for our three days in San Francisco and it was worth the price (overall discount at multiple attractions, plus Muni pass). We visited the Exploratorium in its new location on Embarcadero on a Saturday morning and it was mobbed. We tried to move away from the entry exhibits quickly in order to experience the other exhibits without waiting in line. I'm a chemist and my husband is an engineer and we both found lots of interesting things to see and try. Our favorite was the giant mirror that inverted your image as you walked toward it until you walked \"through\" yourself. It's hard to describe, but captivating to experience. I was also pleased to see that Albert is stlil around. The Exploratorium is well worth the trip, but be prepared for big crowds, or better yet, plan to go at an off time (whenever that might be).\nShow less"], ["Reviewed September 19, 2017", 5.0, "we are all big kids", "If you like science, or even have a vague interest - don't think, just go! Make sure you go in the morning and spend as long as you want there to make the most of your ticket, I didn't give myself enough time as I was only in San Fran for <48hrs. I would honestly come back just for this museum. Don't be embarrassed to go without kids - science is fun for everyone!\nShow less"], ["Reviewed September 17, 2017", 4.0, "Fun but over priced", "The Exploratorium is basically a big warehouse full of machines with buttons, switches, pulleys, and lights. It can be educational but most of the machines teach concepts that are a bit complicated for younger children (i.e. photosynthesis, light refraction, sound waves...). The perfect age group is probably between 7 - 13. My 4 year old enjoyed it but it was mostly about pushing a button to see what it does. Sometimes he would run up to a machine and ask me what it does and I found myself trying to explain how a vacuum and pressure affect water temperature. I tried to find the simpler ones I thought he would like. There is a craft area which was fun. My only complaint would be that parents would leave their kids at a machine too long. Let them have a few tries and then move on. We would often be waiting at a machine and the kid would take one, two, three tries and that should be sufficient. One time a kid was playing with a scooper and sand and we watched him and waited for a few minutes waiting for his parents to grab him. We didn't see them so we took the scooper from him so my son could try it. All in all, it was fun and worth a visit.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Great museum, much above my expectations", "My husband and I (57 years old ) visited the Exploratorium during our first visit to San Francisco.\nSomehow, and very fortunately , right after entering to the museum we got to the Human Phenomena gallery, and tried some of the activities in there .\nMost of the things were really interesting, and led us to discuss our feelings and thoughts.\nAlso, as English is not our mother tongue language, I must note that the instructions are mostly short and very clear, and I almost didn't have to use Google translate...\n\nI wish I could spend much more time in there, but had I lot of other things to do in SF, so i hope to have another chance.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Brilliant museum with added Tactile Dome.", "Fascinating science museum with an incredible array of hands on exhibits. So much to see and do.\nDon't miss the Tactile Dome - a pitch black dome filled with chambers, mazes and slides, which you have to find your way through just using your sense of touch. The kids loved it.\nThere is a good restaurant with plenty of healthy options and a beautiful view of the bay. .\nThis museum is not just for kids. Thursday nights are for adults with added beer.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Incredible number of things to see and do", "We spent 6 hours here with it even noticing the time go by! There is so much to see and do, it is an incredible science museum that should be a must see for anyone with children or a slight interest in the sciences. I cannot recommend this enough, I'd recommend to get there as early as you can, as otherwise you may run out time and not have gotten the full experience.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Horizon School Field Trip", "We arrived at opening and left a closing. There was enough activities to keep both boys and adults happy all day long. The information they had out at the check in explains how to fully enjoy your experience."], ["Reviewed September 8, 2017", 5.0, "Mother of all hands-on science centres", "Although historically the Exploratorium claims to have been inspired by European models, it should be considered the mother of all hands-on science centres. Its exhibits are an endless source of fascination and it is not to be missed under any circumstances. Entry fee is good value. You can easily spend all day there. The cafe is excellent: simple roast chicken to good quality sushi.\nShow less"], ["Reviewed September 8, 2017", 5.0, "A lot more fun than I expected", "Part of the Citypass package, this is a place you should reserve 3+ hours for if you really want to try everything. Even adults will find enough experiments to play with (and ignore their own kids). The level of knowledge varies so it is appropriate for a wide age-range. Plus it looks like they change up the experiments all the time (they have a workshop that shows what they are working to display next).\nShow less"], ["Reviewed September 7, 2017", 5.0, "Day well spent!", "I have been to a few science museums including the one in Indianapolis. This maybe the best one I have been to. We spent all day while taking small breaks in between. A lot of interactive fun and learning and the views of the bay and the city was just amazing. The cafeteria had a very good selection of healthy food. I mean fresh juice/smoothies and everything. It was a very good day.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Kids' favorite thing about San Francisco", "Our elementary school age kids absolutely loved the Exploratorium. We read that we should plan to spend about 3 hours in the museum, but we were there for 6 hours and only saw about a quarter of the museum. Totally interactive, all sorts of experiments with light, sound, electricity, etc. Also a pretty sophisticated and gourmet restaurant on site--sushi and fresh smoothies instead of chicken fingers.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Great science museum", "Went w my science - curious 14 year old son. A tough demographic in my opinion. He was absolutely engrossed and engaged and we could have stayed for hours. The museum ca. Be enjoyed on a multitude of different levels and was not too simplistic for a young teenager. Walking distance to ferry building and pier 39\nShow less"], ["Reviewed September 4, 2017", 5.0, "Excellent science museum", "We have been to many science museums and this is one of the best. Our initial impression was not the best, since there was no star attraction. However, even though the museum consisted of many smaller exhibits, each was very engaging, well thought out, and very well designed. Even adults will find the exhibits educational and engaging. In the end, we spent almost all day here and were won over.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Fantastic", "We visited here using the go San Francisco cards, as the entry was prepaid, however from memory the door prices weren't unreasonable anyway.\n\nWe went in an hour before closing, and had nowhere near enough time to try everything out! There's loads of stuff to do.\n\nI imagine it's very educational for kids, but as a 22 year old I had equally as much fun!\n\nAlthough it was quite busy, there's so much to do and it's so spread out that there was never really a wait to try anything.\n\nGreat place to spend an afternoon, especially when San Fran gets so cold and you just want to be indoors!\nShow less"], ["Reviewed September 3, 2017", 5.0, "Great place to visit in SF!", "We visited the Exploritorium last week when we were in SF. We went on a Thursday evening and we had a great time there. There were so much to see, touch and feel. It's a great place if u love science! Our children Loved it a lot as both of them are very interested in science. Unfortunately we could only stay for a couple hours due to dinner plan with friends. Otherwise, we would have spent at least 4+ hours there!\nShow less"], ["Reviewed September 3, 2017", 3.0, "Not great for under about 8 yrs", "Went with my 4 year old. He wasn't \"bored\" but he didn't really enjoy it either. Just hoped from one thing to the other. A bunch of exhibits were open but not working. There's so many other things to do with little kids in SF, I wouldn't waste the money on this. It's for the older kid crowd for sure.\n\nYounger kids :\n\n- Bay Area kids museum (age 1-4 I'd say is best)\n- Aquarium in SF\n- SF zoo\n- Oakland zoo\n- Aquarium in Monterey (far but very good)\n- Santa Cuz Beach Boardwalk (far but very good)\n- Ocean Beach\n- Chrissy Field and Beach\n- Golden Gate Park playground\n- Habot center\n- berkeley kids gym\n- head over heels on saturdays\n- fishermans warf\nShow less"], ["Reviewed September 3, 2017", 5.0, "One day is not enough", "This was a fabulous day out. There was so much to do for kids of all ages from preschooler to high schooler. We didn't get everything done in a single day. Only disappointment was a lack of suitable eating place for kids."], ["Reviewed September 3, 2017", 5.0, "Great place for kids", "So much to do. Allow yourself enough time to experience everything. If I was a teacher, I would bring my class regularly."], ["Reviewed September 1, 2017", 5.0, "You don't need to go with kids", "Loved this place. So did the 10- and 12-year-old in the family. They like to be jaded tweens, but the Exploratorium grabbed them from the moment they walked in and didn't let go until it was almost closing time. But their parents were also enchanted. With literally hundreds of exhibits to touch or interact with, it's pretty much impossible not to.\nIt's unfair to call this a children's museum. It's appealing to the younger set even if it's not solely designed for them. But if you don't have a child in tow you'll never be bored. In fact, there's an adults-only session on Thursday nights. Big kids should have fun too.\nShow less"], ["Reviewed September 1, 2017", 5.0, "Great Adult Fun!", "I recently visited the Exploratorium After Dark which was a great experience. They restrict the museum to Adults only every Thursday which made the event very enjoyable without having children running around yelling. I had a great time with my friends, they have a couple bars open to get alcoholic beverages. While I am married, looked like a cool place to go on a date. The have very interactive exhibits that make you think in a fun way, making learning fun. I highly recommend going with families or just going to the After Dark and enjoy some fun as an adult.\nShow less"], ["Reviewed September 1, 2017", 4.0, "To do with kids", "Very interesting to do with kids. Adults and children can do loads of experiences about maths, physics, social behavior, etc."], ["Reviewed August 30, 2017", 5.0, "Lots of interesting, tactile activities for kids.", "This museum really provide some real amusement and STEM learnings and hands-on experience for kids, even adults. A must see if you have a family."], ["Reviewed August 30, 2017", 5.0, "I was a big kid for a day", "I love museums, working in the Museum Sector I have high expectations. I was not disappointed. The Exploratorium scores highly in terms of experience, learning, fun and is great for families. Everything is hands on, experimental and truly has some unique exhibits. I especially loved the area exploring human behaviour and psychology, not usually something featured in museums. Would highly recommend.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Demonstrating that education is fun", "We were a little unsure how this visit would go, but within minutes we had fallen in love with the size, choice and cleverness of the installations. It's all hands on stuff; electricity, power, balance, magnets and much, much more. You have to allow at least 2 hours to stroll around and get involved. Brilliant place!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Fantastic day out - not to be missed", "Have now been over 5 hours with children aged 13, 10 and 8! We've visited lots of museums around the world but this has got to be one of the best in terms of hands on learning experiences. The staff and volunteers are great and really engage you in the theory and practice. Can't recommend highly enough!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Worth a full day or 2 of exploring", "I took my 7 yo daughter here. We both enjoyed the hands-on exhibits focusing on different things like sight, sound, smell, touch, etc. and different living systems, electricity, etc. There is more to do that can be done in one day. The exhibits are close together and there is a lot going on which was a little overwhelming.\nShow less"], ["Reviewed August 28, 2017", 5.0, "A San Francisco Favorite Museum for Kids and Teens!", "The Exploratorium is a super fun educational museum that our teen kids and family loves! Whether you have an hour or a day this is a great museum in a fabulous location."], ["Reviewed August 26, 2017", 5.0, "A Child's Delight", "We took my two year old grandson to the Exploratorium. Although he loved everything from the color shadow makers to the magnet tools, his parents and us (grandparents ) loved it more. A blast for all ages. There is a great cafeteria and fabulous view from the back\nShow less"], ["Reviewed August 25, 2017", 5.0, "Absolutely worth it!!", "Having traveled a lot with four kids-this place is well worth the cost!! My kids ages 15 & 13 were entertained by all the hands on & educational activities. Before we knew it 4 hours went by! We've been to many science/hands-on museums & this surpasses them all!! Initially I thought it was spendy @ $79.00 for us 3 but once we finished; I realized it was well worth it!\nShow less"], ["Reviewed August 25, 2017", 5.0, "YES", "I was skeptical. It's expensive, and I don't enjoy science museums (even though I enjoy science and I'm married to a scientist). Filled with dry explanations and maybe-working-maybe-not experiments, most science museums are just not that engaging, but this one is different. Come. Bring your kids. And enjoy yourself. EVERYTHING WORKS (which is probably why is this place is expensive.) Pull a giant ball over your head and twist the dial to experience how different colors affect you. Play with optical illusions. Learn about gravity and momentum with a slinky treadmill. Wander through a small universe made entirely out of cardboard. Invent something. Discover a bit about what it might be like to be blind. The huge, pegboard build-your-own marble track alone is fantastic. We could have spent all day there with our six year old son building different contraptions. My only frustration with was that it was a little low on actually-educational explanation of the phenomenon. Science isn't a soundbite, and the way the world works doesn't fit on a placard. I get this, but I still think they could have done better job with explanations. That having been said, I also see the value of experiencing pure delight just in the way the world works. It is an excellent gateway to what Richard Feynman called \"the pleasure of finding things out\". If you want deeper explanations, bring a scientist along or pester the \"explainers\" for answers. This is really a delightful and worthwhile experience--especially if you have school-aged children. You can understand the stuff in this place on a lot of different levels.\nShow less"], ["Reviewed August 24, 2017", 5.0, "WOW Factor!", "This is a hands down place I could repeat over and over again. I would say this is a absolute to do whether young or old, single, or family. There is so much to do here and is quite interesting. From water fountain toilets, color spectrum walls, etc. I don't want to ruin the fun.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Brilliant day out", "My kids (aged 11 and 9) loved this museum, we spent the whole day there. They especially enjoyed the spinning sand art wheel and the free pinball machine. Highly recommended."], ["Reviewed August 23, 2017", 5.0, "After-hours adults only entrance is a must!", "I bought a Groupon for the adults-only after hours admission from 6-10pm and I had a great time! During the after-hours you don't have to worry about children running around, so you can let loose your inner child and have a great time! There are so many hands-on stations set up that I couldn't even make it through them all by the time they closed, and all of them were so much fun!! I don't drink, so I can't attest to the quality of the bar/drinks that are available for the after-hours admission, but I did eat at the Cafe there, and the food was delicious and not as expensive as you would think a museum cafe would be! I had miso soup and sushi for $18, and my sister had black bean tacos for $11. I would definitely recommend the after-hours admission if you want a different and interesting experience!\nShow less"], ["Reviewed August 23, 2017", 5.0, "Amazing science museum", "Spent 4 hours here with my 9 and 4 year olds. Tons of stuff to see and explore. Best museum cafe every. Sushi chef on site making sushi platters to order."], ["Reviewed August 23, 2017", 5.0, "Time with 8, 10 and 41 year old kids", "This is a great place to visit if the weather is not quite like you expected for California...for me it is how museums should be, all hands on and interesting. Only downside was $99 for family which for a museum is pretty expensive (compared to U.K. Anyway)\nShow less"], ["Reviewed August 22, 2017", 5.0, "For people of all ages", "One could spend many days here. There is an entrance fee: Rounded off prices :Adults $30 Seniors $25 children $20 Under 3 free.Took children of ages 9 and 7 to this place where they enjoyed the different activities. I saw many adults and teenagers engrossed in activities. We also tried some and had fun. You can spend many days here.\nShow less"], ["Reviewed August 21, 2017", 5.0, "A must if you have young children", "Science, art, the psychology of stuff and so much more, it's a must-do experience for young children; and parents/adults will find it fun/interesting too, because most of what you'll see or do there will be a first for you anyway."], ["Reviewed August 21, 2017", 5.0, "Terrific museum for families", "This is one of the best places to bring kids for fun. It's also educational for science enthusiasms (Math, Physics, Chemistry, Biology, Marine Biology, Geology, etc...). They have great exhibits with explanation on the side to allow visitor learn and appreciate science. The fun part is visitors can not only watch but play with the tools...so get ready to have some fun if you are visiting.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Very interesting and informative fpr all ages.", "We were surprised with lot of items, covering almost every topic in physics and almost everything you can touch and experience yourself. Good for explaining kids how things work.\nSmall tip. If you have multiple locations to visit in SF it will be a good idea to buy a SF Go card, which includes tickets to Exploratorium.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Makes Science Fun for All!!", "This place was fun for all! We got there early because there are a few things to do outside while you wait for it to open! The activities are easy to do and the explanations are easy to understand! You could easily spend 2 days here! Fun for all ages! They offer adults only nights which would've been great to do! Go!!!!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Loved It!", "My husband and I and our 12 year old grandson spent a wonderful afternoon here. The exhibits are captivating, interesting, fun and educational -- no matter what your interests, you're sure to find lots to like. The exhibits are well conceived and constructed, and everything worked just the way it should. There's so much to see and do that we were worn out before we could see everything. And for grandparents, we were happy to find lots of places to sit and rest for a few minutes, often with great views of the Bay. Be sure not to miss the outdoor exhibits.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Great museum for both kids and adults", "At first I thought it's just another run-of-the-mill science museum. I couldn't be more wrong! What makes this place unique is that every exhibit is hands-on. I consider myself a science and hitech guy and I have to admit that I actually learned a thing or two here. :)\n\nBTW, the food served at the cafeteria in the back of the museum was top-notch. There's one chef behind the salad bar actually poured his heart and sour in making your made-to-order salad. Definitely give that place a try.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Hands on fun", "Love this place so much! The best science we have been around the world. They don't just tell you the theory directly but let you learn the fun facts by playing with everything. My husband and I are both very into maths so we spent so much fun time in the maths section. It seriously has so much to play with we hadn't even finished it until it was closed at 5pm. (We were in for around 3-4 hrs) If we were living in SF we would get the membership there and play through everything. If you don't like too many children lining on and being on your way, the Thursday night adult only session might be a great choice!\nShow less"], ["Reviewed August 17, 2017", 4.0, "Great place for science fun - should be cheaper!", "This sensational, hands-on science centre invites visitors of all ages to “ask questions and question answers”. It’s a brilliant ambition and the exhibits are perfectly designed for this goal. The exhibits appeal to all ages and they allow visitors to explore all sorts of scientific and engineer principles whilst being immense fun. The only downside is the price. It costs around $80 for a family of 3. With the big bucks of Silicon Valley just a few miles up the road, it should be possible to bring this sort of inspiring fun to a wider audience by making cheaper or even free.\nShow less"], ["Reviewed August 17, 2017", 4.0, "A hit for all ages", "Museum was busy but was a hit with three generations including teenagers. Could easily have spent a day there with everyone being occupied."], ["Reviewed August 16, 2017", 5.0, "Just fantastic!", "I have been there with my kids ranging between 11 and 20. Everybody enjoyed their 5 hours there!! The place is very interactive, and makes all science topics so interesting. The best science music I have ever been!"], ["Reviewed August 16, 2017", 5.0, "Awesome", "Be prepared to spend an entire day. We can here the second day of our visit as it was raining and we did not want to roam around but my kids made me come the second day. You need one full day maybe more to roam around. This is good fun for adults as well. My 3 and 6 year olds were engaged and had fun. The place is very busy. They do let you leave for lunch and then come back again - which I think is a big positive.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Worth a visit", "My kids (7-9Y) enjoyed the experience and had ready interesting engagement with various sections. we have been to at least 5 children museums all around the States and this one stands out . Not to be missed!"], ["Reviewed August 14, 2017", 5.0, "Adult only Night! Booze and Science!", "Oh man! We love science and we love beer! This was a great stop on our trip in San Francisco. But hey, just because you can't go during the adult night does not mean you should not go. Loved the exhibits!"], ["Reviewed August 14, 2017", 5.0, "So much to do!", "My wife and I had a lot of fun here. There's so much to do we got tired before we'd exhausted it all. We went on a Sunday so it was pretty busy but the large number of activities meant this wasn't an issue at all.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Wow! A day well spent", "We have a great hands on museum in our area so I questioned whether this was a great use of time. It TOTALLY was a great additiin to our vacation. I do have a 4 year old and a 9 year old but the adults were just as engaged. Very interactive! Like most places it was busy during the middle of the day so get there right when it opens or stay til closing. The place is huge so even when it was busy it did not feel busy. Don't miss the weather room. Very cool. We used a City Pass to get in which I recommend. I liked this place much better than the California Academy of Sciences.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Brilliant place and put aside a day (or more!)", "Our kids (12 and 14) went thinking they'd seen this sort of place before, and we had to drag them away at the end of the day. It's such a wonderfully intriguing, educational, surprising, interactive/hands-on place - certainly not a museum although there are interesting exhibits to see, watch and feel. Covers physics, biology, meteorology, mathematics, psychology - all very broadly and in most engaging and interesting ways. Recommended for everyone - one of those \"preschooler through to old timer\" attractions!\nShow less"], ["Reviewed August 11, 2017", 5.0, "Spend a whole day!", "The whole family loved this place---14 yr old boy, and 12 & 7 yr old girls. Stayed busy the whole time and wished we had budgeted more time for it"], ["Reviewed August 11, 2017", 4.0, "Get ready to be entertained", "So much to do. Hard to do it all in one day. Very popular. Expect a lot of people and a ton of kids. Your senses will be tested. Take your time and enjoy. Get the City Pass and get a discount. The Exploratorium is expensive by itself.\nShow less"], ["Reviewed August 11, 2017", 5.0, "So much to see and do!", "I was there with my 18 year old son, we went during the adults only Thursday night and stayed until close. We saw and did a fraction of what was available. It was busy but there are so many stations there's no waiting around. If you're curious about how things work, and like to learn in a fun way - a definite stop!\nShow less"], ["Reviewed August 11, 2017", 4.0, "Fantastic place!", "Great place where you can spend all day. We spent a morning and saw only half of it. Lots of interactive things for children. Would highly recommend."], ["Reviewed August 10, 2017", 5.0, "A must!!", "Another option we took advantage of on our San Francisco go past that we purchased through Groupon. We spent three hours \"exploring\" and probably could've spent another three hours! A definite must whether you have little children, big children, parents, grandparents it was just amazing!"], ["Reviewed August 10, 2017", 5.0, "Great fun on Thursday nights!", "We went on Thursday nights when kids aren't allowed and really enjoyed the science exhibits and bars. Well worth the ticket price."], ["Reviewed August 10, 2017", 5.0, "Lots of exhibitions", "There was lots of things going on when I went and when we arrived there was a cloud along a bridge that you could walk past. Wouldn't recommend to children under 8."], ["Reviewed August 9, 2017", 5.0, "Interactive exhibits that are fun and entertaining while being educational", "We could have spent several more hours here in order to participate in all the displays. Sometimes I felt bad that I was competing against kids for time on the \"exhibits\" but there are more than enough things to do so you could always be active.\nShow less"], ["Reviewed August 7, 2017", 5.0, "fabulous for kids", "We spent several hours here. Our children are aged 7, 9 and 11 and had a fab time. There's plenty of displays and it is very interactive. Well worth a visit if you are travelling with kids."], ["Reviewed August 5, 2017", 5.0, "Absolutely worth it!", "Thursday Night is a great deal. In additon to all the exhibits, they have interesting hands on activities and lectures."], ["Reviewed August 2, 2017", 5.0, "great but noisy", "My husband went here with our two boys and it was great throughout. However, be prepared for A LOT OF people and noisy children. This is not a quiet outing, but yet again, why would you want that? Great enjoyment!"], ["Reviewed July 31, 2017", 5.0, "Hands on science", "Wonderful place to visit. It was almost too much for one day. We still had several exhibits left unexplored when we had to leave at closing time."], ["Reviewed July 31, 2017", 5.0, "Great hands-on museum", "Where science meets fun. Definitely a great visit with kids. Plan for at least a 3 hour-stay. There's a wealth of hands-on activities for kids and grown-ups curious about the physical laws of what surrounds us."], ["Reviewed July 29, 2017", 5.0, "Children of All Ages Enjoy", "Could have spent many more hours than we did, this is a must see for families in San Francisco. Many exhibits are fun for kids of any age"], ["Reviewed July 29, 2017", 4.0, "Great fun", "Loved it! 2 adults and a 9 yr old had a great time. Only thing we would recommend is go early and be prepared to dedicate most of a day. We arrived at 3pm and didn't get anywhere near all the way through sadly even with the extended summer Friday opening hours\nShow less"], ["Reviewed July 28, 2017", 5.0, "Tons of fun!", "My family (wife and two kids, age 10 and 12) arrived here after lunch on a weekend (so yes, it was very busy). We had City Passes (which includes entrance to the Exploratorium) but we still needed to line up at the ticket counter to enter.\n\nThis place is massive. And busy. And lots of fun.\n\nThere are far too many hands-on exhibits and experiments to describe. Suffice it to say you really won’t be bored here, unless you have zero interest in anything science. Even then, you’d be really hard pressed not to find many of the exhibits interesting or fun.\n\nWe left after a couple of hours but we hadn’t even seen everything yet. You could spend most of a day really.\n\nDefinitely a must-visit attraction in San Francisco.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Absolutely outstanding place for all ages - interactive learning and just plain fun!", "Three generations of us had a blast at the Exploratorium. The only problem was that we didn't have enough time. This incredible science museum needs at least a full day's visit to do it justice. There are so many things to do and see! One of the highlights for our grandkids (ages 10, 7, 5, and 3) was one of the simplest - an arch, constructed of 5 padded blocks. It required teamwork to put it together - one older child or adult at each side and one to put in the keystone in the middle. Once constructed, the kids could run across it and jump on it. They could experience how sturdy it was and then make it fall down by hitting it from the side, when no one was on top of course. They did this multiple times and taught other kids how to do it. This is only one example. It's a great place!!!\nShow less"], ["Reviewed July 27, 2017", 3.0, "For science/mechanical nerds :)", "Took my husband to this, he's an engineer and has a very mechanically wired brain..i do not, we had a good time trying some of the experiments but very much geared towards young kids. Worth poking around for an hour, but again, if we had a 10 year old tagging along with us, they probably would have loved it.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Great fun, but too many people!", "This is a great science discovery place full of kids too young to understand the principles being demonstrated. So if you really want to learn and experiment with the demos, do not visit on weekends!"], ["Reviewed July 27, 2017", 5.0, "Wow !", "Love love love it ! A great place. We went to spent a few hours and without realizing it we stayed 6 hours and still hadn't seen or \"played\" with everything. Very hands on, very interactive. You learn lots of stuff and laugh a lot. Went with my 2 teens, so not just for small kids. Took the F trolley there and back. Just wished we had more time, really a great fun place !\nShow less"], ["Reviewed July 26, 2017", 5.0, "Hands on science!", "Try a gravity swing, play with magnets, so much to do and it is all in one place. There is even a really good caf'e."], ["Reviewed July 24, 2017", 5.0, "Adults and kids can spend the whole day there", "A delightful and educational experience. The Exploratorium is along the Pier 15 and worth a visit or even a membership purchase. The set up is indoor and open concept, with experience stations over two levels. Play with sounds, matter, light and experience how science and nature are so intertwined. I particularly like the Out Quiet yourself - measure your fox-Trot to see if u can be as quiet as the fox in the woods. The Giant Mirror is Super intriguing. It's a large and highly curved mirror. Shows a 3D effect that allows u to do a high five or finger tip to finger with your reflection. Many many more intriguing displays that you can interact with! A recommend for anyone that has 1-2 hour to spare.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Hands on fun museum", "Family trip with 2 kids 12 and 9. This place has so much to explore. There are hands on experiments to learn about sound, sight, motion, color, math and ... The kids were excited and busy for the whole 3 hours. You could easily spend a day in there if you had the energy. It was a Summer Sunday when we went but there was so much to see and do that if one station was occupied you could just go the the next. It's informative and educational in a fun way. Loved it.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Such fun for all age", "There's so much to do, hands on, one never gets tired of the interactive displays. Make sure you have the whole day and get there before the rush starts."], ["Reviewed July 22, 2017", 4.0, "Not as fun last time", "I have been here a few times over the years. The last time was with young teenagers. I have to save, I got a little bored. Not sure what the issue was. I think that part of the problem is that the museum is so varied that if you go in a group, you spend a lot of time watching someone else interact with something, or looking at things you are not that interested in. Also, a lot of the exhibits have a science fair feel to them - not uncommon for things to be broken.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Fabulour", "Great example of a range of tecnology from basic mechanical to height tech digital working together to create a fabulous visitor attraction.\nThe best bits are the old school experiments that just work.\nGreat space and staff.\nThird visit now and still delivering\nThe city Pass is definitely the way to go...\nShow less"], ["Reviewed July 20, 2017", 5.0, "Experiment and have fun", "A fantastic way to experiment and explore with the kids. Great way to interact and have fun. A lot of hands on and a must see for the kids of all ages. Great learning experience while having fun experimenting."], ["Reviewed July 20, 2017", 5.0, "I'd rate it 10 stars if I could", "I remember going here as a kid, and it seems to have doubled in size since then. I went with my husband and teenage daughter. Both had a blast trying all the different experiments. We could have easily spent an entire day there. Only downside is that some kids insert themselves into the experiments as you're conducting them and kind of \"take over.\" It only happened a few times, and as long as you realize this might happen and have a good attitude about it, it shouldn't impact your visit.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Great surprise", "This kept my 5 year old busy for hours. Very pretty view of the Bay Bridge from the back. Good restaurant. Great place and worth the money."], ["Reviewed July 19, 2017", 5.0, "Really excellent - fun and educational", "It is hard not to gush too much about the Exploratorium for people with kids. It is like the world's biggest and most interactive science museum, and it is simply great. We were told that a day is not really enough, and that is probably right. We were there for about five hours and I don't think we even did a third of it. And most of the exhibits were extremely clever, extremely fun and fairly educational and informative. It was just gold for parents who like to combine good times with a bit of education.\n\nThe biggest downer on the day is the legions of bratty kids - most are fine, but it only takes a few poorly behaved children to ruin it for everyone. And the place gets packed, so there are plenty of poorly behaved children around. You can be sitting down at an exhibit and trying to explain it to your son and some kid will barge in from the side, grab part of what you were demonstrating, look at it and then either drop it or throw it, and then charge off to ruin someone else's fun. It didn't happen all the time, but it happened often enough to get wearing.\n\nOn the plus side, there are plenty of options for fun. Also on the plus side - at the far end (ie. the sea side) they probably have the best museum style cafe that I have ever seen at a tourist attraction. Everything from fresh sushi to racks of ribs. And not unreasonably priced.\n\nIf you have kids, you really should make time for this. You won't regret it. And make sure you leave plenty of time. It closes promptly at 5pm.\nShow less"], ["Reviewed July 19, 2017", 5.0, "best hands on learning experience for all ages!", "A fascinating lesson on all things science, in a fun, unstructured atmosphere! I am not sure WHO had more fun, the adults or the kids! The best I have been to!"], ["Reviewed July 19, 2017", 5.0, "If you have kids this is a MUST SEE!", "WOW...... It is like every hands on fun science experience at every science museum across the US all in ONE location. It goes on and on and on. Honestly so overwhelming because you can't say you saw it all ... seriously it would take multiple visits to do it all and enjoy it. Don't skip the outside area as you may not even realize it was there. 8, 10 and 15 year old all loved it!!! We had so much fun we went back a second day! If we go back to San Fran we will be visiting it again!\nShow less"], ["Reviewed July 19, 2017", 5.0, "My 3 year old LOVED it!", "Wow this place is very big! I expected to be there a couple of houre ( the most ) thinking my daugther would get tired... Well we where there for 4h and I had to drag her out!\nHuge place , not too crowded ( went on a Monday ). They have a restaurant.. Fun for the whole family!\nShow less"], ["Reviewed July 18, 2017", 5.0, "Challenging", "This is the second time we visited the Exploratorium, the first one being 4 years ago. As then, the Exploratorium is a science centre with a broader scope than an average one and via interactive games challenges preconceptions. A number of hours very well spent."], ["Reviewed July 17, 2017", 5.0, "This place is amazing!", "If you buy a city pass, this is one of the passes in the book. Absolutely go! Other than Alcatraz, this is the best thing we did as a family in San Francisco. There is sooo much to do. Fun for kids, teens, and adults. We spent 2 1/2 hours there until close. We could've spent another two hours there. Amazing exhibits!\nShow less"], ["Reviewed July 16, 2017", 5.0, "A must do with kids in San Fran", "I visited whilst in San Fran with my 5 and 9 year olds. They had so much fun here and learnt a lot. We were only there for 3 hours and could have stayed all day. The restaurant at the end of the pier, attached to the Exploratorium is also quite good with some healthy options.\nA must do with kids in San Fran.\nShow less"]]}}