{"Ferry Building Marketplace": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Ferry Building Marketplace", "url": "/Attraction_Review-g60713-d103851-Reviews-Ferry_Building_Marketplace-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/91/82/53/ferry.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "5941"}, "address": {"@type": "PostalAddress", "streetAddress": "1 Ferry Building The Embarcadero at Market Street", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94111-4209", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 4.0, "Nice shops", "I believe this market is only open Tues, Thurs and Sat - we were lucky to be there on a Tues, so we popped in for a peek - many shops weren't open though (maybe Sat only?) but those that were, were nice - a good variety of food stalls and other vendors. It's a beautiful old building.\nShow less"], ["Reviewed 2 days ago", 5.0, "Saturday farmer's market is worth a stop", "Every saturday they have an open air market with fresh fruits, vegetables, juices and crafts and the prices are reasonable. Inside there are several shops and food vendors; but very expensive. Good quality but pricey!"], ["Reviewed 2 days ago", 4.0, "Indoor market", "We visited the Ferry Building Marketplace on a Saturday afternoon and the place was so busy. Full of places to eat and drink. Great atmosphere."], ["Reviewed 4 days ago", 4.0, "Great for a quick bite and gifts", "We ate here twice during our visit...the Mexican restaurant was very good. They have a cute independent book store. I bought Roz Chast's \"Can We Talk about Something More Pleasant?\"...imagine my surprise when I cracked it open on the plane home, I discovered it was signed by the author!\nShow less"], ["Reviewed 5 days ago", 4.0, "Enjoyed the history, not the prices...", "It was well worth the walk to stop in and take a look at the very interesting looking restaurants and shops, along with a great view of the ocean. But for us, the prices seemed very high so we looked only. Also, very crowded when we were there.\nShow less"], ["Reviewed 5 days ago", 4.0, "Great little (expensive) shops.", "Great little place to sit with a cup of coffee and watch people coming in off the ferries to go to work. Also nice range of shops to buy some expensive treats from. We went for Mariposa to get some gluten free goodies."], ["Reviewed 6 days ago", 5.0, "Great Spot!", "Come check out the different shops, restaurants and wine bars inside. Or you can catch a ferry to Sausalito for $24 round trip. I didn't get to do that, because I found out too late! But its worth a stop in on a chilly windy day!\nShow less"], ["Reviewed 1 week ago", 5.0, "Food Mecca and More", "One of my favorite spots to eat and shop in San Francisco! Great restaurants, bakeries, bread, cheese, seafood, treats and gourmet shops galore! Amazing farmers market weekly too. If you have a kitchen to cook in during your visit, this is the place to stock up! And even if you don’t, there’s plenty to eat and drink and enjoy!\nShow less"], ["Reviewed 1 week ago", 5.0, "This is the tastiest place on the waterfront!", "The Ferry Building Marketplace is full of delicious spots to grab a bite with butchers, bakers, chocolatiers, breakfast bites, and even a mushroom stand. Take the time to nibble through the maketplace!"], ["Reviewed 1 week ago", 4.0, "Awesome breakfast", "We headed to the Ferry Building early on our last day in SF. we roamed through the stalls and selected empenadas for breakfast. Superb!"], ["Reviewed 1 week ago", 5.0, "Such a great place!", "I really enjoyed strolling through the marketplace! There’s food and shopping, what more could you ask for on a day exploring with friends? It was one of my favorite afternoons during my weekend trip to San Francisco."], ["Reviewed 1 week ago", 5.0, "Lots of food vendors, people watching and fun place to be", "This was a very interesting place. It was my first time there. Lots of different food places, different cultures, and lots of people watching. Everyone seemed very nice. It was crowded but if you had any questions, you could ask anyone working there and they would direct you to the right spot. I would visit here again for sure.\nShow less"], ["Reviewed 1 week ago", 5.0, "One of my favorite places to visit when I'm in the city", "I love the vibe in the market place then again I tend to like train stations and this is a boat station! The shops are unique and there is a lot of great food options. There is even a book store which is unfortunately becoming a rare find in this day and age. I recommend this place for all walks of life, young, old, solo, families are friends.\nShow less"], ["Reviewed 1 week ago", 4.0, "Saturdays", "Super crowded but fun to mill around. We didn't buy anything or dine there but enjoyed the views of the water and just walking around."], ["Reviewed 1 week ago", 3.0, "It's just a ferry building!", "It's a ferry building with a few shops, cafe's etc. Nothing remarkable really! It's near the water taxi's pier."], ["Reviewed 1 week ago", 5.0, "Exploring the ferry building", "A fantastic foodie haven with plenty of choices to choose from, go on the weekends when the farmers market is going on."], ["Reviewed 1 week ago", 5.0, "Always a destination when we are in San Fran", "The Ferry Building is a must do. Fabulous little shops. Terrific restaurants. A perfect walking destination Wheelchair accessible. Right on a fabulous walking/ biking path."], ["Reviewed 1 week ago", 5.0, "The fruit is is better than Italy!", "If you look for quality in life well, this is the place to go! The fruits and vegetables are simply amazing, got taken off of the trees! Of course it’s a little pricey, but you pay for what you get! :)"], ["Reviewed 1 week ago", 5.0, "Interesting building with a lot of shops", "An interesting older building converted to shops and food venues. Can be very crowded as when we were there, we pretty much stayed away from the thick of things. But a lot of food available and good location."], ["Reviewed 2 weeks ago", 4.0, "Sightseeing", "A working ferry pier with shops and restaurants. Very clean orderly. Something to experience on the waterfront"], ["Reviewed 2 weeks ago", 5.0, "Good", "Lots of things to see and eat - Chinese, American and Argentinian. Niche and quaint produce sold in the building too - chocolatier, sustainable honey, cheeses, candles"], ["Reviewed 2 weeks ago", 3.0, "Nice conversion", "Lots of different foodie treats in a lovely setting, it really is an impressive building. Probably too many people for the number of outlets but worth looking, but avoid lunch time as crowds are significant."], ["Reviewed 2 weeks ago", 5.0, "The Ferry Building is Foodie Heaven", "Many people that visit San Francisco go there for the food. If you're one of them, the Ferry Building Marketplace should be on your short list of places to visit. The best of California is here: Cowgirl Creamery Cheese, Acme Bread, mushrooms, chocolates, meat, wine, oysters, dim sum, pizza, tacos, coffee, pantries and kitchen/cooking items.\nMany choice of places to eat, from the freshest seafood to sophisticated gourmet dining.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Nice place to stroll around", "On a sunny day it is beautiful to stroll around and sit outside to enjoy the spectacular view to the Bay Bridge. In the Ferry Building there are variety food shops with specialties from the region. At some places it is possible to taste the products. I went in the middle of the afternoon on a weekday and enjoyed it a lot.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amongst My Favorite San Francisco Sites", "The Ferry Building is definitely in my top 3 spots to visit, both as a resident and when touring visitors. It's on the Bay and the architecture is gorgeous, so you get both indoor and outdoor views that are stunning. Plus, there's the food! Cheese, bread, olives, wine, chocolate if you want to sample and graze, and Slanted Door is delicious both for dining in and taking out. Oh, and the coffee and ice cream, grab the chance to try Blue Bottle and Humphrey Slocum. Wow. Watch the ferries arrive and depart, check out the Bay Bridge and Treasure Island. What's not to love?\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Cute place to walk around", "Reminds me of the forks, or of st Laurence market. A quick stroll is all you need but lots of great options to grab a bite."], ["Reviewed 2 weeks ago", 5.0, "Quintessential SF", "Touristy enough, but full of real inhabitants going about their daily life. Full of awesome shops and restaurants. Right on the water and a lively, bustling vibe, you can people watch or join in on the action. Grab fresh fruit from the Farmer’s Market, stuff your face with Hog Island Oysters, shop for whoever might be watching your kids back home, you can get a lot done here. Take Muni or Uber though, parking not fun. Leave your car at your hotel and you’ll be glad you did. A sweet place to run in the mornings and grab a coffee when you’re done. The Ferry Building is a place I never miss when I’m in the city, love it here and dreaming of it now as I write this review.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Very Popular Food Heaven", "A foodie's paradise, super-popular bunch of food stalls selling very high-quality goods. Some places to sit, outside and in, so one can put together a gourmet lunch. And a couple of good restaurants. A wonderful re-use of the old Ferry Building."], ["Reviewed 2 weeks ago", 5.0, "Great landmark", "Many shops here and a great view of the Bay Bridge. Catch the trolley here to ride along the waterfront to Pier 39 and beyond."], ["Reviewed 3 weeks ago", 5.0, "A great place to get your bearings in SF", "With stunning bay and city views, this marketplace and ferry terminal is beautifully and tastefully done. The food and bev offerings are amazing, including the SF location for Cowgirl Creamery. Every weekend there is a farmers market right on the the waterfront and Market St ends at the building which makes it easy to reach from anywhere. Especially fun on a weekend morning or late afternoon.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "take the time to stroll around", "a great start to a visit if you arrive by ferry! lots of spots to grab a treat, or do some serious shopping. We always pick up some Acme bread to bring back with us."], ["Reviewed 3 weeks ago", 5.0, "Every visit farmers markwt", "I just absolutely love the farmers market here on sundays. Either with friends or solo with an audio book it really is heavenly. Endless options of foods/ goods."], ["Reviewed 3 weeks ago", 4.0, "Lots Of Options", "Tons of shops, restaurants and people. It's always busy, and for good reason. Doesn't matter if you're looking for a meal, or to buy some wares (wine, cheese, etc) this is the spot for you. Lots of vendors selling a wide range of goods. Even if you aren't in the mood to dine or shop, swing by for the killer water views and some afternoon sunshine!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A must on Saturday!", "We visited the Ferry Building Marketplace/Farmer's Market on a Saturday morning, around 8am when they opened, with the goal of finding some picnic foods to take with us on our ride across the bridge to Sausalito. The market was so beautiful, so much to take in, so lovely, that we spend much longer there than we anticipated. Go with plenty of time to take it all in, no agenda, and a hungry belly! We ended up with citrus, rainbow carrots, biscuits, sandwiches, and a noodle/chicken meal in a jar for our ride/picnic, but then had to come back one more time before our trip ended. On Tuesday, before our flight, we returned - it wasn't the same as Saturday (nowhere near as many vendors outside), so do yourself a favor and make sure you visit on a Saturday. Still, we wandered and sampled and took photos and it was enjoyable anyway.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Don't people watch, bird watch!", "My husband and I went to the Ferry Building around lunch time on a weekday. It filled up with people from nearby offices getting lunch or a coffee.\n\nWe got some sandwiches and sat down looking out the windows near the Mexican restaurant. I highly recommend this. As soon as some people got up from their lunch outside, the birds swooped in and started eating everything. It was fun to watch them buy not so fun for the folks sitting outside trying to eat being stalked by birds.\n\nThere are a wide range of shops to grab some lunch or a snack or a gift here. It wasn't too crowded even with the lunch rush either. Plus it has some nice views and you can walk all along the piers up to the wharf.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Nice, but....", "Lovely setting-but bring your wallet. A great way to try a variety of foods, goods, etc.--but all come at a high price. Lovely to sit outside, watch the water and wait for the ferry."], ["Reviewed 3 weeks ago", 5.0, "What a sigth.", "I enjoyed just browsing all the stores inside. And the scene from the wharf looking out to the bay and view of the Golden Gate Bridge. I took the ferry to Sausalito it was beautiful."], ["Reviewed 3 weeks ago", 5.0, "Great place to wander, SHOP, and EAT!", "Whenever in San Francisco, I always have to stop by this place. In addition the to the street vendors across the street from this building, the Ferry Building itself is filled with vendors of all types from garden supply to cheese, to bread, to chocolate, to ice cream, to mushrooms, to fried crickets, to wine, to fine dining. An amazing place with typically high quality items...worth an hour or two just wandering and looking at the items available.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Such a brilliant morning", "The ferry building market was the first stop for us the morning after we arrived in San Francisco. The morning was stunning and the market was alive with locals and tourists. Whether you fancy breakfast/lunch or a coffee or perhaps just a few veggies, flowers to bring home, or soaps and creams to give as gifts, go to the market and enjoy the atmosphere and gorgeous food and bits and pieces. Soak up a bit of sun along the water or catch the antique bus up the road to the touristy bits.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Somewhat Disappointed in the Food", "I was so psyched to go here so many places had recommended to eat here but it was just so hard to find a place to actually sit down and eat and the selections wasn't all that good. We eventually decided on the Mexican restaurant and I have to say it was the worst i have EVER had. None of us enjoyed it, or even finished it. The rest of the place was quite interesting though, we had some Tea, tasted and bought some honey but it was just a jumble of places that was so unorganised.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great shopping, views, restaurants", "Great for browsing, eating, shopping. Patisserie, Asian food, bakery, ceramics, leather goods, book store, cheese shop ... plan to spend some serious time here. Don’t miss the views out the back doors!"], ["Reviewed 3 weeks ago", 3.0, "Nice architecture but pales compared to other sites nearby", "Granted I am a broke traveller, there isn't much to do here but eat and I didn't try the food. It is a quaint building but the food just looked ok. If you're there, check out the railway museum just a few minutes walk outside which is small but free and you can take a picture of you driving a cable car.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A great place to hang out for a few", "This is the place to go rather than pier 39. Lots of good shops with great food and the exploratorium is right next door. Go and enjoy and skip the pier."], ["Reviewed 3 weeks ago", 4.0, "A gem but getting sketchy", "I love this old world hold over. When they redid it years ago it was outstanding and it still is. It’s vibrate active and the shops inside are wonderful. However this trip I’ve noticed a lot of homeless hanging around and seems to be getting a bit sketchy.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Good place good food", "We went walking from our hotel and had tapas in a wine store. Excellent service nice choices of wine, very good ambiance of adult young people\n\nWe happened to have the chance to enjoy a local market outside the place with a variety of products\n\nWe loved it\n\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A foodie heaven", "This building was full of amazing places to eat and purchase food items. Must see when in San Francisco."], ["Reviewed 3 weeks ago", 4.0, "Lots of great food choices", "We visited on both a weekday and weekend. It is much busier on the weekend, but there are also a lot more vendors selling things. The people watching is exceptional. You will see all kinds of folks from all over the world. The crowd on the weekend was a bit overwhelming for us though.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Overrated", "Nice place to visit with the only difference from other cities is that there are fresh seafoods available."], ["Reviewed 3 weeks ago", 5.0, "Beautiful", "Way less touristy than Fishermans wharf. Views are beautiful. Can have food drink and enjoy the scenery."], ["Reviewed 3 weeks ago", 5.0, "Great vibe, local specialties", "Iconic place in the heart of Embarcadero. Great place to spend the weekend, try local goods (coffee, ice-cream, meats, cheeses) and enjoy the views. The only downside are the prices but quality of food is really good. You will also find here handmade products and souvenirs. The place's popularity is confirmed by a great number of visitors. A must see in San Francisco.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Worth the visit", "We wanted to experience as much as the city had to offer. Very easy to get to and it was fun walking around the different shops."], ["Reviewed 3 weeks ago", 5.0, "Delicious marketplace for the foodie and their families", "The San Francisco Ferry Building is a mecca of food, wine, coffee chocolate, restaurants and more centered in the heart of the most beautiful city on the planet (to me at least). This light open space is bustling with locals during the day, looking for a delicious bite, and a shot of hot locally roasted coffee, or a sip of wine! From famed chefs like Charles Phan (The Slanted Door) and Amaryll Schwertner (Boulette's Larder) to the perfect places to grab a bottle to go (Ferry Plaza Wine Merchants) this is a must-stop for anybody visiting SF. Make your plans! CUESA's farmer's markets are every Saturday (massive) with Tuesday and Thursday markets as well. The Building is open with the wonderful vendors every day, but for the extra special local's treatment, I would suggest visiting on a market day. On the market days, there are visiting chefs (Jacques Pepin has been known to stop by), plus restaurant pop-ups and more.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "I loved the Ferry Building", "If you go to SF you can not miss the Market Place. You can find many gastronomic options. As a celiac I found Mariposa Baking and Urban Remedy, but there are options for everybody. I loved it and came back several times."], ["Reviewed 4 weeks ago", 5.0, "Great view of the Golden Gate Bridge", "I walked down to see the sunrise and caught a great view of the Golden Gate Bridge. There’s no charge to simply view from the dock if you’re not taking the ferry. There are benches and some coffee shops open early in the morning. I walked from union square. It’s just over a mile but it’s relatively flat.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice vibe with local goods", "Located on the Bay, the Ferry Building marketplace offers an eclectic combination of small cafes and retail outlets highlighting local goods and California specialties.\n\nFood ranges from local pastries, coffee shops and other simple specialties for breakfast, lunch and dinner. Retail outlets range from novelties, wine and natural grocery products.\n\nA great place to visit, stroll through or stop for a relaxing moment to enjoy the view.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "In a good location", "It's a good place to take pics, has a good location, and good food especially right outside. You can actually take a ferry from the building as well."], ["Reviewed 4 weeks ago", 3.0, "It's a nice place to visit but not a must", "This space has been converted into a series of shops and eateries. In a city where the wind really blows and can get rain this is a nice option if you are tourist who wants shelter and sustenance. The food options vary in type and cost and you also can get a variety of mementos to commemorate your visit to SF.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "What fun!", "If you like to shop, eat,and enjoy sweeping views of the San Francisco Bay, then this is the spot for you."], ["Reviewed 4 weeks ago", 5.0, "Cool place", "Lots of shops with everything from ice cream to grow your own mushrooms! Spend some time while waiting for fairy back across the bay."], ["Reviewed 4 weeks ago", 3.0, "Pricier version of Faneuil Hall in Boston.", "This was a fairly average \"Street Market\" experience. Nationally they're becoming ubiquitous. Wine selection was very good, ice cream also, but the rest of the offerings were average. Need Blue Bottle coffee? Prepare to wait 20 minutes in line!!"], ["Reviewed 4 weeks ago", 5.0, "Girls weekend", "Didn't get to spend much time there. We walked through and the wonderful smell of fresh baked bread was everywhere! Definitely a place ti spend more time next visit"], ["Reviewed 4 weeks ago", 5.0, "Lots of food", "Different food shops, bars and some craft shops. Prices pretty high. For example, Talenti gelato that I get in the grocery store in FL for around $5 was $7.98 in a grocer in the Marketplace."], ["Reviewed January 24, 2018", 5.0, "My favourite ‘Foody’ place in SAN Francisco", "If you find yourself in SAN Francisco on a Saturday visit the Farmers Markets at The Ferry Building. I recommend The roast pork and chicken rolls for breakfast as they are delicious. There will be long queues but well worth any wait. Then find a seat and eat your roll while enjoying the views of Bay Bridge. The place is bustling on a Saturday morning with locals and chef’s getting their produce. There are many great shops and the place is filled with unique food experiences. We even had a ‘goodish’ coffee. You’ll find the coffee shop by the long queues. As Sydneysiders we are notoriously picky when it comes to coffee. There is also a shop that sells an array of gluten free products such as pretzels and chocolate croissants. The place is filled with unique food experiences. There are also some lovely restaurants looking out to the bay and other small eateries. We visited twice and it is a must do when in SAN Francisco for any foodie!\nShow less"], ["Reviewed January 23, 2018", 5.0, "So much to see", "I didn’t expect this place to be as large as it was once I got inside. We stopped for a treat here and there and eventually stopped for a cocktail before heading out. The old-fashioned time schedule for the ferry was a nice touch."], ["Reviewed January 23, 2018", 4.0, "Great food, a bit pricey", "Ferry building had great gourmet food stalls and an awesome book store. Definitely on the pricey side."], ["Reviewed January 23, 2018", 5.0, "Great place to go for a bite", "You get a lot of choices depending on what mood you're in. Great, quality food too. We had a soft crab po boy sandwich. Delicious. Then went for empanadas. Yummy."], ["Reviewed January 23, 2018", 3.0, "Tourism", "A few places to eat. Poor sitting. Not very crowded. We went and had wine with hummus the bread was ok."], ["Reviewed January 23, 2018", 4.0, "Well worth a visit", "Loads of eateries and lovely local shops. Have a good look around and then decide where you want to eat. A great mix of tourists and locals."], ["Reviewed January 22, 2018", 4.0, "Good food, nice environment, great food products to buy", "Shop and eat experiences here were really nice. Maybe expensivier than expected but still nice. Food products quality seemed to be high and variety great. I can onmly complain on prices about some of them"], ["Reviewed January 22, 2018", 5.0, "love Ferry Building", "I love the Ferry Building!\n\n1. There are great restaurants inside, such as The Slanted Door, Hog Island Oysters, and such.\n2. And not just restaurants, Miette bakery for cookies, Cowgirl Creamery for cheese, Acme bakery for bread, Humphry Slocombe for ice cream, Blue Bottle for coffee.\n3. Nice assortment of vendors that sell olive oil, mushrooms, etc. You can find some good gifts and if not, just fun to walk around and browse through all different offerings.\n4. If you venture outside or sit outside to eat, you get a beautiful view of the water. At night, it's also very pretty.\n5. Farmer's Market on Saturday, with all kinds of great produce and food trucks (gotta check out the porchetta sandwich at Roli Roti).\n6. People watching available anytime (for free!)\n7. The wine restaurant even lets you bring in outside food, how cool is that.\n\nAnyways, it's just a great place to walk around when visiting SF, and it showcases what I love about SF- diversity, great food, local markets, tight community, and beautiful view to boot. Gotta stop by if you're in the area for sure!!\nShow less"], ["Reviewed January 22, 2018", 5.0, "What a Find!", "This is a treasure trove of boutique eateries and vendors of local and gourmet items. You can find everything fro coffee, chocolates, olive oils, body/bath products, kitchen items, etc... Great for shopping or a quick bite."], ["Reviewed January 22, 2018", 5.0, "Excellent farmers market", "Many vendors, lots of great produce and food. Busy, so be patient. The brown butter ice cream is the best thing I've put in my mouth in ages."], ["Reviewed January 22, 2018", 5.0, "Magical", "The true San Francisco under one roof. Wonderful restaurant great cheese store and yummy ice cream. And SHOPPING"], ["Reviewed January 22, 2018", 5.0, "Lots of yummy food options", "We enjoyed walking through and seeing all the different local goodies. Lots of yummy treats and restaurants to choose from."], ["Reviewed January 22, 2018", 4.0, "Fun place to Stop in for some SF flavor", "Not too big, but full of nice stalls and stores worth going through. Easy hour visit. Very crowded the day I was there so I didn't stop for the good looking ice cream and chocolates due to the lines."], ["Reviewed January 22, 2018", 5.0, "A great place for Artisan shopping", "The old ferry building is a must see for locals and tourists alike. Eat and drink amazing food and experience organic food produced in a farmers market setting!"], ["Reviewed January 21, 2018", 4.0, "Good Shopping, Period Looks", "I watched an interesting Navy Band perform in front of the Ferry Building. There are many shopping and eating options there."], ["Reviewed January 21, 2018", 4.0, "Great Local Vendors, Not Very Accessible", "Spectacular views outside, loads of local vendors inside - it's a wonderful place, just don't go on the weekend if you use a wheelchair! I had so much trouble getting to most of the counters, through the throngs of tourists. I did find some really good SF stuff, Bee Kind honey products and many other very local vendors. Counters were high and I had to shout to be heard from my seated position. As a native I had trouble with the high prices and the packed building. Parking was far away and $20 for about 4 hours.\nShow less"], ["Reviewed January 21, 2018", 4.0, "It's not just for ferries!", "Good for freshly baked bread, coffee, freshly made biscuits (at the weekend), empanadas, fresh oysters, fish monger selling fresh fish, butchers shop, cheese shop, shops selling cakes, chocolates, honey, wine, beer, olive oil, ceramics, glassware, cookware, skin and bodycare products, books, maps, there's also a farmer's market on Tuesday, Thursday and Saturday and they even sell ferry tickets! Well worth making a visit just for the farmers market.\nShow less"], ["Reviewed January 20, 2018", 5.0, "My fav place!", "I love the ferry building and tell everyone they must go here if is SF. Even better on Saturdays for farmers market. I am here all the time whether I want to get seafood, mushrooms, wine, cheese, etc. they have it all. Plus great restaurants. This is the one place I tell every person coming to the city to go to. Make sure to come here before going to UGH fishermans wharf.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Come hungry, especially on farmers market days", "Historic building on the water with a bunch of shops and restaurants. Some of the shops give out samples of their goods. Especially busy on farmers markets days. I was there on a Saturday and loved browsing the farmers market stalls and food vendors that make for lovely lunches. Though it was very busy. Bring cash as some vendors are cash only.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Food Food Food", "There were a lot of food options, from deserts to fast food to sit-in restaurants. You won't leave in an empty tummy."], ["Reviewed January 20, 2018", 4.0, "The Whole Scene", "Cheese and charcuterie, Sur La Tab, outside market, restaurants, wine just the place for eating, buying, and planning."], ["Reviewed January 19, 2018", 5.0, "Another must visit", "The Ferry Building Marketplace is a place you must visit when you're visiting San Francisco. Make sure you go hungry. There are many places to get something to eat or just have a drink."], ["Reviewed January 18, 2018", 4.0, "Lively and Much Food", "This marketplace runs the entire length of the 1898 Ferry Building's ground floor and includes short side corridors. We first walked its entire length one Sunday morning, looking for a place to have breakfast before taking a ferry to Sausalito. We found it convenient to have this food hall so close to our hotel, because many breakfast places in the vicinity had yet to open or are closed on Sundays.\n\nThe main corridor offered mostly baked goods and coffee at 9:30 a.m. and the small number of visitors seemed to cluster at these shops. It wasn't until we turned onto a short corridor that we saw Frog Hollow Farms, where I was able to buy oatmeal, fruit and coffee. This eatery proved to be just steps away from where the Sausalito ferry departs.\n\nOn our return in late afternoon, crowds shuffled in both directions along the long corridor with visitors stopping at various stalls to look at the merchandise. That included honey, olive oil, pottery, cheese and books. Ice cream shops featured long lines and dozens of diners sat at an eatery focused on oysters. Vegetable displays enticed visitors into a small supermarket. Since morning, this had become a popular place.\n\nOutside, we turned to take one last look at the Ferry building itself. I like its Beaux Arts style and arched arcades. But the 245-foot clock tower remains its most distinctive feature. The tower displays four clock faces, each 22 feet in diameter.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Chow wow", "I was really hungry. I spent the morning playing at the Explorairium. Which is super. I strolled down to here and ended up at Side Kick. Where I wolfed down and turkey and cheese toasty. It was yum. And huge. And yum again. I don't eat carbs a lot because I get fat quick. Like the flash. But when I do eat carbs I prefer these type of carbs. Theres loads of great food choices and a lovely views of the harbour. Which are just as tasty.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Lots of food options", "All kind of local options to satisfy all last buds. Crab cake sammie, ice cream, local cheeses, and great bread. You can go wrong."], ["Reviewed January 17, 2018", 5.0, "Lots of yummy food places!", "Worth a visit for the food and drinks options alone... the view is also really good. Grab a cold brew and sit on the dock watching the world go by."], ["Reviewed January 16, 2018", 5.0, "Great place to visit", "We were here on Thanksgiving weekend. The open market was great with so many wonderful goodies. Most items are artisanal. Highly recommend. This is also a great place to stop after the ferry ride from Sausalito."], ["Reviewed January 15, 2018", 5.0, "Reasonable & good taste", "Breads, coffee, wine, meat, deserts, ... everything are reasonable price and good. You would like to go by renting Ford GoBike( rent-a-cycle)"], ["Reviewed January 13, 2018", 5.0, "A stunning piece of architecture", "We stepped inside this building after arrivng back to San Francisco one Friday night. We were immediately over-awed. Not only is the architecture breathtaking, the place is filled with busy artisanal food shops, coffee roasters and restaurants that you won't be able to say no to. Our quick look inside ended up lasting three hours and became the highlight of our day to Napa Valley.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Fantastic food", "plenty of choices to eat. price is quite reasonable. i would love to go back there again. can't wait to go back there."], ["Reviewed January 10, 2018", 5.0, "Lots of Restaurants", "We came here to have late lunch/ dinner. We had just flown in from Sydney so we were quite hungry. The Marketplace is full of restaurants. There are also some shops such as a book shop. It is located right next to the water so It is a great spot to look at the Bay. The Marketplace has a nice vibe to it. I would definitely like to come back here.\nShow less"], ["Reviewed January 10, 2018", 1.0, "Incorrect labelling could be dangerous", "We ordered a plate of lime and mango. The ice cream tasted overwhelmingly of Passionfruit - including the seeds! I could not detect Mango or Lime.\n\nI pointed this out to the waiter and the cashier but they totally dissed me.\n\nNot only is this ignorant but a food safety (allergy risk).\n\nUnacceptable !\n\n\n\nShow less"], ["Reviewed January 9, 2018", 4.0, "Good use for an old building", "Good to see old building given a new life and this will most likely be very successful in the long run. The busiest place seemed to be the oyster bar but i could not believe the high prices San Francisco expects for their oysters so we did not venture in to that spot (plus i have a major aversion to lining up for food).\nMarket included some interesting shops/eateries, a couple of which we tried and, as to be expected for this type of setting, some boring/way over-priced shops.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Typical City Marketplace that caters mainly to tourists", "While the ferry building and surrounding area is an interesting place to visit, the Marketplace is in my opinion, more of a tourist-centric attraction that locals rarely go to. Lots of vendors with over-priced products that are not really unique and can be purchased elsewhere for less.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Love this place!", "This place is a heaven for Food Lover. Nice to walk around get coffee and breakfast. And do shopping! Organic ingredients, bakery and Pastry, Chocolate and many stuff for Food Lover."], ["Reviewed January 8, 2018", 4.0, "Market place delight", "Apart from being the view point where I saw in the ‘Bells’ for New Year and watched the awesome firework display (and it really was awesome. A magnificent 15 minute display of pyrotechnical wizardry.) the Ferry terminal is also home to a fantastic artisan market place.\nThere are all sorts of items on sale from food and drink to trinkets, books and one off crafts. The food stalls are amazing - and expensive. (But then, everything in SF is expensive.) There is a great buzz about the place and a wonderful atmosphere. The whole ferry area is a must visit, from Pier 1 right along to Fisherman’s Wharf at Pier 45. The walk from end to end can take an hour but have a coffee and snack at the marketplace and then stroll to the other end and have a bread bowl filled with clam chowder. Another touristy must do.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Fun Marketplace in San Francisco", "The Ferry Building is a nice little marketplace on the Embarcardero. There are many different shops and stands in the market. It was quite enjoyable to window shop and look at all of the food and goods for sale."], ["Reviewed January 5, 2018", 5.0, "Great restaurant selections and Blue bottle coffee!", "Every time I am in SF downtown area, I make sure stop by Ferry building to taste some of the great food selection and end it at blue bottle coffee shop.\n\nBouli bar, I had a super tasty brunch created by famous chef Schwertner and she creates unique flavors with fresh ingredients. She even brings special mint from Turkey. I love this spot so much! Will recommend to anyone and make sure you have reservation.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Amazing breakfast, coffee and a bit of shopping too!", "I'd never been to the Ferry Building Marketplace and let me tell you, the breakfast we had there was insanely good! They also have a blue bottle coffee which was great, and a ceramics store that I couldn't resist. Definitely check it out if you're in San Fran! Bonus points if it's a Tuesday or a Thursday since they have Farmers Markets there!\nShow less"], ["Reviewed January 4, 2018", 5.0, "Great place to visit with the family", "Enjoy the market place at the Ferry building; try some new food, sample some olive oils, steamed buns, and hand-made ice cream. Wish I could have spent more time but we had to leave early. Will definitely come back."], ["Reviewed January 4, 2018", 5.0, "Fun place for foodies and boutique shoppers", "Buzzing but fun eating and shopping experience in the ferry building. We got off the Sausalito ferry and met friends at the FB for lunch. Long lines at Mijita, the Mexican place, but it was nice to sit by the water outside and eat our yummy tacos. Walked through FB taking in the (pricey) shops with local gourmet seasonings, pottery, clothing, and giftables. Highly recommend, if you like local craft and foods.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Lots of great food, coffee and wine", "I visited the ferry building multiple times over the week. Blue bottle coffee is dinner if the best coffee you'll get in SF.\nI spent a few hours browsing the various stalls and shops.\nBought some little products for gifts and myself.\nI spent a few hours at the wine bar. Had some beautiful California wine and tapas. Sat at the bar. Met some other solo travellers.\nHad dinner at the burger place Gott's Roadside one night. Good burgers.\nIf I lived in SF, I would be there all of the time!\nGreat vibe, awesome artisan foods.\nTried to add more photos but the app doesn't connect.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Good range of food but potentially a victim of it's own success", "Whilst the range and quality of outlets is great, at peak times there are queues >15 minutes for a lot of places which might not be worth it for a quick stop."], ["Reviewed January 3, 2018", 4.0, "Lots to see, great tourist vist!", "Great unique boutique shops and cafes. Across the street on the weekends there is usually an artist market & booths! Definitely would recommend to visit!"], ["Reviewed January 3, 2018", 5.0, "A great way to spend a Saturday.", "The Ferry building was a converted dock building into a small shops and booths where you can buy anything from meats to cheeses , trinkets to junk. People are great, and you can taste and try what you are buying. We hit it with the Farmers Market going on out side the bulding. There must have been another 100 booths set up selling produce, meat fish , organics , jellies and Jams and just about anything else you would need. Food trucks and booths supplied great sandwiches and food stuffs for you to eat as you walked around. There were some great values and some really great products. I would say that we spent a few dollars walking around and taking stuff back to NJ. Don't miss this experience, its right near the Bay bridge so a great place for pictures. Parking on the street, and just a good time.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Staycation or Traveler - for both!!!", "Was at the Ferry bldg between the holidays and it was busy with locals and visitors. If you are looking to grab a bite, shop and sightsee - come here! You have tea shops, coffee, wine bar, ice cream, gluten free, vegan, stores, markets and restaurants. It will suit anyone’s taste. Worth a visit and accessible by many means.\n\nWeekdays are good, weekend for the farmers market and access to the ferries - Larkspur, Oakland etc.\n\nPlaces to consider to dine-The Slanted Door (reservations required and book ahead) fun to go as a group to eat family style, Hog Island Oyster for oysters, a fabulous grill cheese sandwich with cowgirl creamery cheese - line up early since no reservation taken. Open around 11. Then there is chocolate to treat any sweet tooth for dessert.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Beautiful but..", "Boring, we took a tour of the city and stopped by for 20 min which was way to long, though it is a beautiful building."], ["Reviewed January 3, 2018", 3.0, "great food to be had but avoid weekends - madhouse", "The building marketplace and farmer's market have gotten very popular over the last years. There is great food and drink to be had but it is crazy expensive and impossibly crowded at times. Go early!"], ["Reviewed January 3, 2018", 4.0, "Great visuals and great gourmet food", "Have coffee, buy a book or eat at Slanted Door. Explore the Saturday farmer's market and sit at the deck in back, watching the ferries and water traffic. Better yet, take a ferry to Sausalito and back, or even to Vallejo, for an inexpensive Bay tour.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Variety of Culture and Food", "Spent an hour here after visiting the Rock! Interesting building from an architectural perspective. The pan handlers are aggressive so keep kids and valuables close."], ["Reviewed January 2, 2018", 5.0, "Lots of Fun Food and Culture of San Francisco", "Lots to eat, and see at the Ferry Building, not the tourist trap that most places are, seem to be more locals shopping and eating."], ["Reviewed January 2, 2018", 4.0, "Overpriced food, but the ferries are cool.", "Overpriced food and accessories and surrounded by homeless people day and night, the ferry building connects you to the places that matter (through the ferries) and brings you the best ice cream in the world!"], ["Reviewed January 1, 2018", 4.0, "Good for food and restaurants", "Came here for lunch at the Spotted Door right after Alcatraz, and took a stroll around. There's something to eat for all budgets and tastebuds, and it's a great place to visit if you're hungry or just want to chill. It's packed with both tourists and locals though, so if you're seeking peace and quiet, this isn't the place.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Interesting place", "You can walk from Fischermanns wharf in 20 min, it’s a nice place full with places to eat and buy groceries, easy to Reach union square in a 20 Min walk."], ["Reviewed January 1, 2018", 4.0, "Lots of Coffee", "There was not as much variety as i had hoped for. They steer clear of the exotic and concentrate on lots of variety of the mundane. Saying that it is an interesting place to spend some time."], ["Reviewed January 1, 2018", 5.0, "Acme, Blue Bottle, Repeat", "If you're in town visiting, and lucky enough to be close to the Ferry Building, you need go no further for great breakfast options. Acne bread offers a broad spread of options, from sourdough loaves to olive rolls to pumpkin or currant buns, all of which make great snacks to stock up on for the day. Blue Bottle's espresso can't be beat. The Market itself is an excellent place to but produce. Take your breakfast out back and watch the sunrise.\nShow less"], ["Reviewed December 31, 2017", 5.0, "A foodies paradise", "Wonderful place to wander around with many artisan and local gourmet foods available to get the taste buds tingling. While there try the Market Bar, great food and a barman who knows his stuff. Friendly staff and a nice menu, great salads and oysters too!"], ["Reviewed December 31, 2017", 5.0, "Go there when the farmers' market's on", "We went there on our first morning. I loved all the stalls inside and the actual market had an amazing array of organic vegetables...some we don't have in the UK. Everyone was happy to talk about their produce even though we couldn't buy any."], ["Reviewed December 30, 2017", 3.0, "Food!", "Took the F vintage bus from Market straight to the ferry building at the wharf. Lots of food choices for everyone. Breakfast and lunch. Indoor and outdoor seating."], ["Reviewed December 30, 2017", 4.0, "Nice Place", "I did not visit during this recent trip. I visited in 2015. I liked the variety of shops. Would definitely recommend to visit if you have the time."], ["Reviewed December 30, 2017", 5.0, "Great place to check out", "We were told to visit the Ferry Building and I'm glad we did. It's like a market place with many little shops and restaurants. We bought some oil and herbs from one of the shops. We also had to have a scoop of the ice cream from Slocombe's. This place is like a little treasure in San Francisco just a short walk from Pier 39.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Crazy busy but must walk through.", "We actually just stopped in to use the bathroom. Reminded me of Boston and Quincy Market area. Glad I saw it but way too many people for me."], ["Reviewed December 29, 2017", 4.0, "Fun few hours exploring the building", "We visited the Ferry Building when the market was open and enjoyed looking at the many stalls outside and inside the building. The shops can be expensive but there are some unique and different products on sale. A shame we had our luggage weight limit and couldn't buy a lot!\nShow less"], ["Reviewed December 28, 2017", 4.0, "Fun food market", "This is a nice place to visit. Good variety of food vendors, plus Sur La Table, and some restaurants. Though we will not be returning to Slanted Door (see review)."], ["Reviewed December 28, 2017", 5.0, "Great place to get lunch", "The Ferry Building is a great place to get lunch, people watch, see boats, and buy terrifyingly expensive artisanal food items. There are quite a few restaurant stalls, as we'll as places to shop. The building is also a terminal for the ferries from the East Bay. Downside: the prices\nShow less"], ["Reviewed December 27, 2017", 3.0, "Nice place to see", "Nice place to see if you're ever in the area. The place is packed with places to eat, and even a farmer's market. The downside: The place is expensive, and good luck finding a cheap parking."], ["Reviewed December 27, 2017", 5.0, "Archetypal San Francisco", "Water, Boats, Food, Books - all the things which appear near to a San Franciscan's heart are here in the Historic Ferry Building. Wander and enjoy and snack as you go at the wonderful array of fooie shops enshrined here"], ["Reviewed December 27, 2017", 4.0, "Take plenty of cash with you.", "The restaurants and stalls in the complex and unique but awfully expensive. We were there on a Sunday afternoon and the restaurants and bars were all packed with couples and families. But the prices in comparison to Fisherman's Wharf are high, but the quality of the produce and products available is worth it.\nShow less"], ["Reviewed December 25, 2017", 4.0, "Sunset watch", "Great for sunset watch and to refill bread, honey, coffee, etc. A bit cold outside, so make sure to bundle up."], ["Reviewed December 25, 2017", 5.0, "Amazing View", "If you want to take bridge pictures you should get of the tram here and have fun.. The best view is here !"], ["Reviewed December 25, 2017", 5.0, "Worth it.", "Saturday morning at the Ferry Building is really fun. It's an open air market with tons of tents cooking up a wide variety of tasty food, as well as fruits, veggies, flowers, etc. and it's an indoor market with mini stores offering, high end foods and treats to eat there or take home.\n\nViews of the Bay Bridge, huge tankers and ferries coming in off the bay. It's a neat way to commute to and from the city, without traffic.\n\nThere's a couple of great restaurants with bay side tables and one WOW restaurant - The Slanted Door which has really, really good Asian food and Asian Fusion food.\n\nAll humanity is there so it's also a fun people watching experience. Spend about 2-3 hours....you'll love it.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Nice farmers market, restaurants and good eats.", "Beautiful ferry building has lots of nice places to eat. We enjoy the farmers market on certain days."], ["Reviewed December 23, 2017", 5.0, "Great", "We walked they the Saturday Market and all thru the building. It was full of interesting shopping and food."], ["Reviewed December 22, 2017", 5.0, "Food fun! A vast collection of foods, wines,and nourishing treats", "Food fun! A vast collection of foods, wines, and nourishing treats. It’s a food hall, tourist attraction, bay views, and transportation hub. Fun to shop with your eyes and stop to taste anything that looks good."], ["Reviewed December 22, 2017", 5.0, "Lively Area", "Wish I had more time to visit this area. Strolled through on my morning run. Building looks like it may be historic. Very retro vibe. Will definitely visit again and highly recommend."], ["Reviewed December 21, 2017", 3.0, "Average waterfront market", "I've been to a lot of harborfront, waterfront, pier, dockside, markets and this is just another one of those. A couple of standouts like a unique ceramic shop and a mushroom store aside, the run-of-the-mill coffee shops, handmade crafts, and food spots are all there is to see. The farmer's market on select days add some fresh fare but not much. Still worth visiting but not more than once.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great place to be", "I was at the Ferry Building marketplace twice during my summer visit. First when we enjoyed embankment and surrounding, walking towards sea lions and looking for a place to eat. It was really great despite a lot of people around and I enjoyed views, buildings, sea lions and then food. Even plants on the windows of restaurants and offices on the way still are a part of impressions. Then I was there at the end of my trip visiting one of the companies located right there. And once again enjoyed endless space of the sea and the city. We had late lunch in the street on the right side from the ferry building entrance, chatting and lounging a lot. In the building you can buy everything in numerous food cores or to sit with a cup of espresso and to hang viewing the sea landscape like a movie with people, boats, birds, wind as the main characters and different scenes.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Europe style sunday market in SFO", "Everyday is like sunday, has Europe style open market running whatever raining or sunshining.\nA lot of hand-make little things, bread shops... just like some famous market in Europe. love this a bit crowded, warm place, take some breads/icecream insdie, sit outside of building, watching seagulls, bridge, ships, feel free to be there for a whole afternoon, till sunset\nShow less"], ["Reviewed December 20, 2017", 4.0, "Busy place", "This historic building houses a number of specialty shops and restaurants. Definitely a tourist place but fun to visit and get a quick bite."], ["Reviewed December 20, 2017", 5.0, "Great lunch spot", "There is something for everyone here and it's a great way to experience a lot of local cuisine. Everything we had was good, but the highlights were definitely the candied salmon, empanadas and Guinness Stout Gingerbread ice cream. The ice cream was without a doubt some of the best i've had and im not a fan of Guinness or gingerbread!!! The Bourbon Cornflakes(aka secret breakfast) was also delicious.\nBring your appetite and definitely leave room for dessert.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Amazing!", "Gosh! I loved the ferry building so much and love the little pop up stores and various eating places. They have everything here- breakfast, lunch, dinner and dessert. Such a great place to come with family and walk around choosing where to eat."], ["Reviewed December 19, 2017", 5.0, "Great place to catch up with friends", "Nice cosy high ceiling building, best bakery, a few popular restaurants but long queue. Great view from this historical building."], ["Reviewed December 19, 2017", 4.0, "food food and did I mention food!", "Amazing array of foods and food paraphernalia. Definitely worth a walk about. Check out the textures and fragrances from around the world."], ["Reviewed December 19, 2017", 5.0, "Packed full of small business", "A really great place to visit and perhaps pick up some gifts or stop and eat at the many restaurants, cafes etc. Really enjoyed just strolling around and looking"], ["Reviewed December 18, 2017", 5.0, "Farmers market -traditional and original", "Great place to experience the local food and wines - good for knowing about the locals and their produce- a lot of organic stuff that is truly glorious and trendy- loved the local food, ingredients, home cooking and above all the atmosphere- irreplacable"], ["Reviewed December 18, 2017", 4.0, "Quirky shops and restuarants inside", "A beautiful building worth visiting. Inside there are quirky shops and little restaurants worth visiting. Through the other side of the building, they often hold a market amongst a beautiful Gandhi statue, but I am not sure what days."], ["Reviewed December 18, 2017", 5.0, "Great historic building with shops/restaurants", "The Ferry Building is a great historic building located at the foot of Market Street. There are plenty of small boutique and food shops located inside along with multiple restaurants. You can easily spend a few hours browsing the halls, and then go out and enjoy the waterfront.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Just love this place.", "Every time I head to San Francisco I stop at the ferry building. The amount of shops, restaurants, coffee shops and by the way clean restrooms make this place a must see. The history of the building is fascinating and you can read all about it on the walls with great pictures of what it was in the older times. It’s a short walk to union square, the Ballpark, the mall, BART and many of the other piers. If you’re biking around the city it’s a great place to stop grab a quick bite then jump back on and attack the other side. Stop by and check it out you’ll love this attraction.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Farmer market on Saturday", "The ferry building marketplace is for those who enjoy organic food. They have a variety of restaurants, stores, cafes that serves great food. You can find great outlets such as the slanted door, blue bottle codffee, and table la sur at the building. Great place when in SF to visit.\nShow less"], ["Reviewed December 14, 2017", 5.0, "Fantastic shopping & dining", "Grand building worth visiting and taking a few photos of, especially the pier side that has Port of San Francisco displayed on it. The marketplace is also very nice to have a browse through with lots of dining options."], ["Reviewed December 14, 2017", 5.0, "A Foodie's Delight", "The array of eateries and small food purveyors is such an interesting mix. You get the wine and cheese thing but also real truffles, fresh meats and fish, amazing desserts, and unusual food ingredients that would inspire any chef to go and create. Cowgirl Creamery, Far West Fungi, Humphrey Slocombe, Prather Ranch Meat Company and San Francisco Cheesecake are just a few. Fresh fruits and veggies are available daily. If you are hungry, choose great eateries like the Slanted Door with amazing Vietnamese cuisine. It's all so good you want to bring lots of friends and dine family style. Marketbar Restaurant and Hog Island Oyster Company also great eats. Right on the water so great views are a bonus. Enjoy just the walk thru experience!\nShow less"], ["Reviewed December 13, 2017", 4.0, "Wondering around the markets", "Lots of good eats and bits and pieces to buy, ice cream is worth queue for as well as the pasties are an absolute must (we went back twice)"], ["Reviewed December 12, 2017", 5.0, "Beautifully restored, great history", "The ferry buildings are beautifully restored Very classic Brilliant when the markets are on there Beautiful produce"], ["Reviewed December 11, 2017", 4.0, "Cute indoor market place", "It’s like a mini Chelsea Market, but less crowded and good views of the bay and Oak bay Bridge. Hog island is good in here for oysters and mussels! you can sample food at almost every shop."], ["Reviewed December 10, 2017", 4.0, "Humprey Slocombe FOREVER", "This is a great place to people watch; and the sitting area outside gives a nice view of the bay and the Bay Bridge."], ["Reviewed December 10, 2017", 4.0, "Good food and people watching", "Cool place but expensive (maybe not out of SF norms). Our group split several plates from a few vendors and listened to some great entertainment."], ["Reviewed December 9, 2017", 4.0, "Nice place", "You can find many different shops and places to eat. Very convenient and by the sea... it is just at the end of Market street."], ["Reviewed December 7, 2017", 4.0, "Always Fun to Walk Through", "In the city for our anniversary we always enjoy a walk through the Ferry Building. Visiting the many shops and then stepping out back to the bay and watch one of the Ferry's come in and dock. Many specialty shops to visit from culinary needs to dried mushrooms to candy, cheeses etc.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Great place to walk around during the Saturday market", "We enjoyed all of the fresh foods and offerings at the Saturday Farmerʻs market. Many were enjoying coffee but we liked to see the fresh fruits and nuts."], ["Reviewed December 6, 2017", 5.0, "Gourmet delights", "The location near the Fisherman’s Wharf is superb.The more than a century old ferry building (there is a ferry station still there) has been cleverly converted into a warren of tiny shops and restaurants. As you breathe in the fresh ocean breezes you can wander around and buy or consume: gourmet coffees, gourmet breads and cheeses, gourmet chocolates, gourmet ice creams. Or you can wait in lines for an hour (on weekends and holidays) or longer for seating in one of the restaurants serving great sea food. Clam chowder, yum.\n\nFruits off the trees as well as vegetables are also available.\n\nOne of the great experiences of SFO!\nShow less"], ["Reviewed December 6, 2017", 5.0, "Fun & lively & on the water-what more do you want?", "We love it here. Weekends are particularly lively with open market & lots of vendors. Tons of great restaurants & bars to choose from. I never get tired of it & if you haven’t been, your missing out."], ["Reviewed December 6, 2017", 5.0, "Located at the Heart of Fishermans Wharf", "Similar to the Wharf of Seattle Washington, this place is just as tall as the Seattle Space Neetle, although this is just a very tall tower overtlooking the picturesque of the San Francisco, the fisheries and the famous Sea Food restaurants located along the wharf.\nSuch setting can be found on the east cost in Baltimore MD along the Chespeake Bay on the Atlantic Coast. San Francisco attraction is located on the Pacific Coast so is Seattle WA.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Amazing Marketplace", "You can spend an entire day at the Ferry Building Marketplace. There is so much going on, great people watching and excellent food."], ["Reviewed December 5, 2017", 5.0, "Amazing produce and fun to visit", "Yummy food offered here in the different market style shops and restaurants with a beautiful view towards the bridge. Stores of note Miette cakes, Sir la Table kitchen supplies and the Slanted door restaurant, fun for weekend - market type stores close at night time!"], ["Reviewed December 5, 2017", 4.0, "Lots of places to eat", "This is basically a food market with some restaurants and a few food-oriented shops. It's located on the first floor of the Historic Ferry Building, there are offices on the second floor. It's a reasonable place to go if you're looking for fresh food."], ["Reviewed December 5, 2017", 4.0, "Well worth seeing", "A nicely restored piece of old San Francisco with the interior reminding me a little of Seattle's Pike Place, but with more variety (a bookstore and so on). Walk through for great views of the ocean...."], ["Reviewed December 3, 2017", 4.0, "Nice restaurants ..quality food galore", "Another nice landmark that is worth the visit .. plenty of quality food options .. ranging from top end to takeaway...easy to get to .. nice way to spend an afternoon"], ["Reviewed December 3, 2017", 5.0, "So much to see", "Any day of the week this is a busy market site. With fresh produce, meat cheese and seafood. Has some great places to eat too."], ["Reviewed December 3, 2017", 5.0, "Great terminal. Gateway to ferry", "We stopped in before heading out to Sausalito. Acme Breads and Cowgirl Creamery is in there. Little ships, restaurants, etc. Just ignore the man arguing with his guitar and you'll be fine!"], ["Reviewed December 1, 2017", 5.0, "A Must for Everyone Visiting San Francisco", "We go to the Ferry Bldg Marketplace every time we visit San Francisco. You can find the best of everything, food and otherwise. Walking along the huge corridor, you can stop for the freshest oysters in town. I always find something to buy, from EVOO to gifts.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Beautiful building with lots of great shops", "We ended up here at night and the building is beautiful at night. There are many great vendors/stores in this place. There are also great restaurants near here."], ["Reviewed November 30, 2017", 4.0, "Afternoon surprise", "The shopping and food was fun, the food was good, and the parking ticket for being in the parking spot after commute time started... $109. So, I suggest paying the 25 bucks to park, or reading very carefully what the signs say."], ["Reviewed November 28, 2017", 4.0, "Wonderful variety of shops, mostly food.", "A great place to buy fresh meat or seafood as well as mushrooms and breads. Good restaurants as well."], ["Reviewed November 28, 2017", 5.0, "Something for Everyone -maybe not vegans", "What a must see experience this was! So much and everything you could want. Cowgirl Creamery was so delicious and had a wonderful menu with milk bar. I had the baked breakfast sandwich which was excellent with gruyere cheese. There was a beautiful mushroom market too with every mushroom i could think of and more! I had an ice cream sandwich from Miette Patisserie which was mos def the best I’ve ever had. Really you just have to go yourself and experience it. Too much to explain!\nShow less"], ["Reviewed November 28, 2017", 5.0, "Great Shopping and Great Views", "If you plan on driving to the Ferry Building, plan on parking a couple of blocks away and walking to the building. Car traffic gets very heavy close to the building. There are so many great shops and eating spots in the Ferry Building. You can get great burgers at Gott's Roadside. There is Hog Island Oyster co. My favorite spot there is Recchiuti Chocolate. There are great views of both SF bridges and Alcatraz. Warning, public bathrooms lines can be long.\nShow less"], ["Reviewed November 28, 2017", 5.0, "My favourite place in SF !", "It is the first place I go to whenever I come to SF. I love the vibe, people and food there. Always crowded in the afternoon and weekends but it is nice to walk in here while shopping from local stores and local market. You can take a walk up to Market Street very easily.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Number one!!", "One of my favourite places in the city. I love the market inside where you can get any kind of food. Specially the oysters. Also take a ferry to Sausalito!!! Just lovely plan in San Francisco"], ["Reviewed November 27, 2017", 4.0, "Saturday market highlights", "We visited on a Saturday morning and the farmers market was in full swing. The aroma of freshly brewed coffee and pastries added to the atmosphere the range of fresh fruit cheese and meat stalls along with the food trucks added to the atmosphere don't go there hungry the choice is too much.\nShow less"], ["Reviewed November 26, 2017", 4.0, "A must visit on a Saturday", "Unbelievable selections at this market! In addition to fresh farm produce, you can order breakfast or lunch from many vendors, eat inside or outside. The aroma from the sidewalk is enough to entice you to walk around the market."], ["Reviewed November 25, 2017", 4.0, "Roam and Eat", "If you like to browse a marketplace, test fresh foods and be by waterfront, then this is a great place to hang out for an early morning meal, lunch or early dinner. You can also catch a ferry to other locations across the Bay."], ["Reviewed November 24, 2017", 5.0, "Fabulous Place for a Foodie", "I love the Ferry Building since it’s all about food. I visit here often, dining at Hog Island Oysters if I have the time to wait in line. The Slanted Door offers delicious Vietnamese cuisine. There is a Sur La Table store and a smaller store, The Gardner, that has simply fun and unique wares. I always buy a cookbook, this last time Sweet, a dessert cookbook by Ottolenghi. One store offers various types of mushrooms and, of course, Blue Bottle Coffee. The best cappuccino outside of Italy.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Great Choice of Food", "Some really nice eateries, great bay views, seating inside and out, sit and while away the time with a glass of wine."], ["Reviewed November 21, 2017", 4.0, "Fun!", "You can step right off at Embarcadero street and walk into the Ferry Building, an iconic landmark of San Francisco. I love just walking around this building every time I visit! I highly recommend going and getting a few hot buns while you are in there; I usually go for the pork buns.\n\nAfterwards you can walk outside along the water or hop on a ferry and go on an adventure! This is a major hub in the city\nShow less"], ["Reviewed November 20, 2017", 5.0, "Sam Zell's gift to SF!", "I worked at EOP, who redeveloped the Ferry building way back, and Sam Zell used to always say it was his gift to SF, as it was so expensive to build, and was filled w/ local credit tenants. What a great gift. Spend some time and try some local fare! Also, great to walk around and just take it the sights, sounds, and tastes!\nShow less"], ["Reviewed November 20, 2017", 5.0, "Cool Building!", "There is lots to see and EAT at the Ferry Building Marketplace, but don't forget to take in the actual building architect - very interesting. Be sure to check operating hours as we were there early (5pm) on a Saturday and some merchants were already closed.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Nice place", "Walked around the ferry building last weekend and enjoyed the architecture as well as the atmosphere all around."], ["Reviewed November 20, 2017", 4.0, "Beautiful view, cool shops", "The building itself is gorgeous, and the view off the back on a clear day is amazing. The shops are cool, though expensive, as you'd expect from a tourist trap like this."], ["Reviewed November 20, 2017", 4.0, "very nice, lots of choices", "Has been modernized with lots of new shops and activities. Kept clean and tidy, easy to walk around. Shops are a bit expensive, but expected in this area now. Enjoyed just wandering around. Very busy on Saturdays, but with lots of extras activities and pop up stalls.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Free time", "Had some free time and thought I would grab a coffee and sit someplace by the water.\nWas recommended to go to the ferry building.\nReally cool food shops and artisan things.\nGrabbed a coffee at Pete’s and spent an hour or two catching up and people watching.\nThen did a little shopping. Overall very good.\nShow less"], ["Reviewed November 19, 2017", 3.0, "Best on Saturdays", "Several restaurants and markets - can be fun to walk around. But the restaurants are so-so and the markets are fine."], ["Reviewed November 18, 2017", 4.0, "Market tour and lunch.", "We went for a morning walk through the Ferry Building Market, lots of people which basically is the norm in SF.\nThe markets were great, with lots of interesting shops, cheeses, breads, pastries, wines etcetera. Sadly as we were staying in a hotel no need to buy anything, but if a local, Fantastic!\nWe ended up at one of the cafes in the complex to have a late breakfast, and it was great.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Visit the farmers market on Saturdays", "I love bringing my family here when they are in town. It’s a lot of fun to get brunch at the farmers market on Saturdays, get treats for later and also peruse the Ferry Building."], ["Reviewed November 18, 2017", 4.0, "Nice touristy spot", "Food is expensive as it is a tourist location. View is nice. You can look at the Bay Bridge! Good for coffee or ice cream too!"], ["Reviewed November 17, 2017", 5.0, "Drinks, food, and people watching", "So, I chose to check out the ferry building after the exploritorum, which is right next door. At first I just wanted to see what shoo were in there, and maybe grab a bite to eat before heading back to merit lake. There were many shops and eateries in this building, and since I had frozen trader Joes food back at my hotel freezer, I really didn't want to purchase an entrée. I decided to stop at El Portend Empanadas, for a empanada. The empanada was cold, and it would've been nice if the server offered to warm it up...but she didnt. She was more interested in her conversation with another employee. So, I ate my cold empanada, and once finished, I had a craving for a glass of wine. Luckily, Ferry Plaza Wine Merchant was 10 paces away. They are a wine bar and a wine retailer with fairly knowledgeable staff. I really love champagne, but wasn't willing to pay a premium for a dry bubbly, offered on this menu, so I ordered a rose, a chardonnay, and a sparkling wine. Not all together, but as I finished each glass. They were all good, I am writing this review more than 4 weeks after returning jome, so excuse my inability to remember the names of the wines. My day had come to an end, and within 5 minutes I had an uber waiting for me outside the ferry building to wisk me back to my hotel. So, my take is, check it out, but know that you will be paying a premium for everything.\nShow less"], ["Reviewed November 16, 2017", 5.0, "great place to browse and see localproduce and upsale merchandise", "Great place to walk especially on mfarmers market days. Severak good eateries...take out at the Slanted Door and Hog Island Oyster Bar being our favorites"], ["Reviewed November 16, 2017", 5.0, "Wonderful place", "Ferry building is a place where traditions, cuisine and culture meet. There is a wonderful atmosphere. You can have a super tasty grilled cheese, taste different kind of olive oil, grab some fresh fish or just walk around. Have fun!"], ["Reviewed November 15, 2017", 5.0, "2 fantastic visits", "The four of us enjoyed a couple of great visits to the vibrant, bustling Ferry Building Marketplace in October.\nSo many wonderful artisan food / cuisine stalls and shops, so many happy, friendly people. The covered inside market was complemented nicely by the (Saturday) market outside. Lovely outside views over the Bay, and seating too.\nDefinitely worth a couple of hours or more...eat and relax...the pie shop was fantastic, but we forgot the name!\nShow less"], ["Reviewed November 15, 2017", 4.0, "Old building with restaurants and touristy shopping", "We went to go the the slanted door restaurant and ate a very pleasant lunch. After lunch we wandered the building which has artisanal and pricey shops selling breads, cheese, candles honey , books, the usual stuff. There are good public toilets too.\nConsider taking the tram or trolley (not sure what the locals call it) along the Embarcadero to the end or just wander then head into the city. There are some art works on the opposite side which are rather ugly, big industrial and not pleasing to the eye.\nStill the ferry building was a stop off if you want to shop or eat as it has diners too.\nShow less"]]}}