{"Fisherman's Wharf": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Fisherman's Wharf", "url": "/Attraction_Review-g60713-d108678-Reviews-Fisherman_s_Wharf-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/2d/db/21/fishermans-wharf.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "15190"}, "address": {"@type": "PostalAddress", "streetAddress": "Jefferson Street Between Hyde and Powell Streets", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94133", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "best walking", "there are a lot store for souvenir and restaurants and the boat of the alcazar. this is a good idea for walking. good view to the golden gate view also."], ["Reviewed 2 days ago", 3.0, "Fishy...", "We stayed near Fisherman’s Wharf. It smells like fish lol! We walked through the wharf tons of times. It has lots of shops & restaurants. The guy that plays music on the corner at the wharf sign is awesome! Lots to walk around & see. Every tourist needs go!\nShow less"], ["Reviewed 2 days ago", 5.0, "Fantastic", "Fantastic place to go. I recommend going on a weekday. You will enjoy it so much more on a weekday due to the huge increase of people on the weekends. P.s. watch your wallet"], ["Reviewed 2 days ago", 4.0, "Take public transportation to Fisherman's Wharf", "If you come to San Francisco Fisherman's Wharf, don't drive a car. Automobile break-ins are a serious problem here. More than 1,400 break ins occurred last year. This lovely attraction is worth your time and is easily accessible by a number of options including the city's famous cable cars. Plenty of restaurants and other tourist stops are up and down the Esplanade. Dress warm as it typically cool at all times of the year around the Bay. Take advantage of the fresh catch offered in front of Alioto's. Fresh crab available on the street. Great views of the Bay available at McCormick and Kuleto's up the street at Ghirardelli Square.\nShow less"], ["Reviewed 2 days ago", 4.0, "Another Must See", "We walked to Fisherman's Wharf and explored the area stopping to eat and shop and take pictures of the cable cars."], ["Reviewed 2 days ago", 4.0, "Fishermans Wharf", "Very tourist of bars and restaurants to choose from. There is also lots to see including street entertainers but beware of pickpockets and beggars"], ["Reviewed 3 days ago", 4.0, "Nice scenery and food.", "Visit the Wharf to explore, grab great fresh seafood or browse the many shops along that way. The water views are nice to see. This is a heavy foot traffic area, so out on your walking shoes."], ["Reviewed 3 days ago", 4.0, "Touristy", "You can’t visit San Francisco and not go see Fisherman’s Wharf. There’s so much to see and lots of places to eat and drink. Nice for a stroll on a sunny day."], ["Reviewed 4 days ago", 4.0, "Tradition!", "A visit to San Francisco is not complete unless you visit Fisherman's Wrarf....the sounds, the smells, the street performer's...its electric, scenic and where there are old traditions from the last century are still alive today including the food vendors and famous restaurants."], ["Reviewed 4 days ago", 5.0, "Surprisingly not crowded", "Maybe it was the time of the year, maybe Thursday and Friday nights are slow, but we were surprised how few people were out and about. We stayed at a nearby hotel and ate here each night. Small crowds...oh well. A nice place to walk around nice views during the day. Great restaurants. Cheap souvenirs (really cheap sunglasses!).\nShow less"], ["Reviewed 4 days ago", 1.0, "Tourist trap", "Lots of tourists spending money of garbage souvenirs and overpriced subpar food. Beggars and hustlers roam here. Go just to see what it's all about and look at the water but save your money."], ["Reviewed 4 days ago", 3.0, "Busy place", "Fishermans Wharf is a cool place to visit with lots to see and do. It is dirty and very busy and the dining is overpriced and so so at best.\nWe’d recommend visiting and taking a walk along the Pier and taking in the sites - then leaving. Go somewhere else to eat after seeing what it has to offer. I would say it’s a must see - but a couple hours is plenty!\nShow less"], ["Reviewed 5 days ago", 3.0, "Typical tourist", "This is your typical tourist area. Lots of souvenirs, restaurants, goodies However worth a stroll to check out."], ["Reviewed 5 days ago", 3.0, "Been a long time!", "Boudin bakery All commercialized now but trip to Alcatraz a must do if never done before . It was nice seeing it all again but I was last here 20 years ago enjoy it better then when CVS wasn’t part of wharf."], ["Reviewed 5 days ago", 5.0, "Busy place, lots to explore", "This is a super busy area, it’s a market that offers so much, like fresh foods and souvenirs etc and there an arcade for the kids in all of us."], ["Reviewed 6 days ago", 4.0, "Typical tourist attraction", "Typical tourist attraction. Try to go not during \"popular hours\", early in the morning or evening it could be more pleasant)"], ["Reviewed 6 days ago", 5.0, "Visit in the evening !!", "I absolutely had a blast both nights hanging out at pier 39. The seals are a sight to be seen (cheeky as) but that's just the tip of what to do here, the shops are so various, a lot of different things to browse around. Lot's of places to dine at (including Bubba Gumps) and we even had a bit of fun riding on the carousel ;)\nShow less"], ["Reviewed 6 days ago", 4.0, "We really enjoyed our visit here.", "It was a fun afternoon walking around the area. So much to see and do and of course the seals were the highlight! If you go to San Francisco, you must come here. This was our second time."], ["Reviewed 6 days ago", 2.0, "Disappointed", "Touristy, pricey, dirty. We made this a destination and quickly kept walking on to Pier 39. Over crowded and disn't feel as safe with young kids as the other toutisty areas of the city. Tried it twice durign our week long stay in SF (Sunday was unbearably crowded, wed was much less crowded but still didn't have much). Lots of t shirt, touristy shops but Pier 39 has those as well. Ghiradelli square was a nice stop. Next time we visit I'd be fine skipping FW altogether.\nShow less"], ["Reviewed 6 days ago", 3.0, "Nice area lots going on.", "Nice area lots going on. Lots of places to eat and shop. Or just walk. Parking limited to lots nearby. Some offer early discounts if you park before 8am"], ["Reviewed 1 week ago", 3.0, "A Tourist Mecca", "Crowded, but well laid out, Fisherman's Wharf is loaded with small shops which sell everything from socks to chocolate. A must see while visiting SFO."], ["Reviewed 1 week ago", 5.0, "Nice day out by the shore", "This is definitely a tourist area, but I did not mind. It was relaxing walking around to see the shops and food. Go to Ghirardelli Square! I did not get to explore this area in depth, as I had to catch a flight later in the night I wish I had more time to explore Fisherman's Wharf. It is also a 3 minute walk from Pier 39, so I recommend doing these two areas in the same day. I would also a-lot more time than you expect to spend here when visiting this area because of all the shops and food that you will want to stop at.\nShow less"], ["Reviewed 1 week ago", 5.0, "San Francisco Landmark", "Spent Saturday and part of Sunday down here last weekend. Had a fun time shopping and eating our way around the wharf."], ["Reviewed 1 week ago", 5.0, "Business trip But day trip to SF", "I had business travel to Sacramento in October 2017. I wrapped up early and made the drive to SF to check the city out. Went to fisherman’s wharf with a buddy and it was super fun. Ended up being fleet week there so we got to see blue angels practice while enjoying atmosphere there. There are so many things to see and do here and food variety all over. A lot of the specialties I observed happened to be seafood/lobster sandwiches and sour dough bread. I sampled a lot of things and ended up having lunch and drinks at the Hard Rock Cafe. This place is obviously popular but it was rocking and fun during fleet week. Weather was good too. Definitely check it out\nShow less"], ["Reviewed 1 week ago", 4.0, "Ok, tons of tourist type stores", "It was ok, we ended up going to where the hog ilsand oyster restaurant is. There was better. Good stores, less crowded would be my recommendations"], ["Reviewed 1 week ago", 4.0, "Overrated Touristy but Still Interesting", "At one time this was \"the\" place to go for sea food and it still is not a bad place. Avoid the over priced restaurants if you can."], ["Reviewed 1 week ago", 4.0, "Good Shopping here!", "Lots of places to shop here and not too badly priced for sweatshirts and hoodies and souvenirs etc. Restaurants are aplenty and food prices not too bad but shop around if you looking for a good deal as some places charge more tax than others it seemed.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great place to spend an afternoon and evening.....", "We had a great time here, afternoon and evening spent schmoozing around, shopping and drinking cocktails. It's got lots of interesting little independent shops, plus some chain ones. There are lots of places to eat, but sadly not many vegan choices at all in any of the restaurants. It's great to while away the time here. December, not busy at all really, and remember to bring a coat, it's blowy.\nShow less"], ["Reviewed 1 week ago", 5.0, "A Must Do Especially for Families", "We were fortunate to live north of the city for four years and always brought all our guests (both U.S. and foreign) to the highlights of San Francisco. The sights, smells, street performers, shops, and attractions of Fisherman's Wharf just never got old to us. Each time was a new experience, different from the others. Beware of the \"Bush Man\" who is cleverly disguised and is apt to jump out at you :) Good laughs for those around to witness.\nShow less"], ["Reviewed 1 week ago", 5.0, "Funky place", "Loads of restaurants and stalls selling really fresh seafood. It is a really nice place, yes touristy, but one of the must sees in San Francisco."], ["Reviewed 1 week ago", 3.0, "Go have a peak.", "It’s a nice enough area. Definitely a bit of a tourist trap worth while poking your nose in wouldn’t stay all day though."], ["Reviewed 1 week ago", 5.0, "Much to do, see, and eat", "What a great place to walk around. Tons of shops and endless places to eat. Lots of street performers who were very talented but also not intrusive! We had two small children and while we didn’t use a stroller there was plenty of room for one. Easy access to many things.\nShow less"], ["Reviewed 1 week ago", 2.0, "Collection of tourist attactions", "Packed chock full of non-locals, this one of several local wharfs. There is seafood here, though there are plenty of other places with seafood in San Francisco. If you must see everything in San Francisco, this will be on your list. But, if you must skip one site to make room for another, this wouldn't be a bad spot to skip.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun", "Great place to walk around, grab something to eat, watch street performers, and people watch. Lots of restaurants, street vendors, and souvenir shopping. Weekends and holidays can get very busy with locals and tourists. I felt safe as I walked around."], ["Reviewed 1 week ago", 3.0, "To each their own, but not my favorite part of SF", "Very touristy, which is to be expected - but that kind of tacky touristy with Ripley's, Madame Tussauds, etc. If you're into seafood, this is probably a must-do on your trip, but as someone who doesn't eat seafood it was a little hard to find the right place to eat. Some conveniences, but everything is at tourists rates. Not a must-see in my opinion.\nShow less"], ["Reviewed 1 week ago", 5.0, "Busy day and night", "This area is full of shops bars and restaurants. Some open 24hrs a day. Choices of street food to fine Dining, but be prepared to pay. Street entertainment and musicians always putting on. Good show."], ["Reviewed 1 week ago", 4.0, "World famous but crowded", "This is one of the places you should walk around in San Francisco, but be warned, it is very touristy and very crowded. We had a very hard time getting around on a mild day."], ["Reviewed 1 week ago", 5.0, "Fisherman's Wharf is one of the Busiest Tourist Area of San Francisco.", "Fisherman's Wharf is San Francisco City's busiest Tourist Area. It starts at Alcatraz landing in the east, goes over to Pier 39 and Pier 43 and further to Ghirardelli Square and has a fabulous view of the Golden Gate Bridge, Alcatraz Island and the Bay Bridge. It has shops, restaurants, gift shops and places to stroll around. Lovely Place. Sea Lions also happen at Pier 39, part of Fisherman's Wharf Area. Enjoy the walk and experience of being there.\nShow less"], ["Reviewed 1 week ago", 5.0, "Was there for the Earthquake", "Stayed at Holiday Inn Express. Priceline gave us a room for $206 USD a night, Fed the gulls the bread bowls we didn't finish. There were bread bowls strewn all around. The gulls were pretty nonchalant. They feast on the wharf constantly. It was pretty fun on the wharf. Can't complain about being a tourist when clam chowder in a bread bowl is $5 USD.\nShow less"], ["Reviewed 1 week ago", 5.0, "Best part of San Fran", "I loved the fisherman's wharf. This was out first time in San Francisco and we opted to stay in the city but next time we come back we will definitely stay near the fisherman's wharf. So much to do, though expect tourist rates. Prices are a lot more expensive around this area sue to the large amount of tourists, though it seems to be the case all over the world\nShow less"], ["Reviewed 1 week ago", 5.0, "Loll before you eat.", "So many choices for food. Look around before you choose. Musicians and venders on the street and many little shops to take a trinket home. Take the time and stroll around."], ["Reviewed 1 week ago", 5.0, "A Must-see", "When in SFO, this place is a MUST-SEE place. Beautiful area to shop with LOTS of restaurants to choose from!"], ["Reviewed 1 week ago", 4.0, "Great Central Point For Adventures", "Everything seems to be at Fisherman’s Wharf, or so we felt. It’s a great place to begin a lot of tours and get your bearings. There is no shortage of restaurants and things to look at for free. Watch for charity muggers, they are sneaky."], ["Reviewed 1 week ago", 4.0, "It's so cute!", "If you like window shopping and walking around new places then you will enjoy this I promise! It was so great :)"], ["Reviewed 2 weeks ago", 4.0, "A San Francisco Landmark Worth Seeing", "Yes it is touristy but it is also a place that you need to see if you go to San Francisco. There are some good restaurants here as well as other attractions."], ["Reviewed 2 weeks ago", 5.0, "Visiting my son for thanksgiving", "Let’s start off with acknowledging that this place is touristy ... having said that I’ve been coming to SF every few weeks for about 15 years to go visit my son who lives in the area and I still enjoy walking around the wharf , looking at the seals , and dining/drinking at the restaurants that make up this part of SF. It’s a must if it’s your first time to SF and always fun is you’re a regular!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Worth Seeing", "The wharf area is worth seeing, but it is very touristy. We very much enjoyed taking a free walking tour of the Wharf area given by The San Francisco City Guides. Our guide was excellent. He was very knowledgeable and friendly. We spent about an hour and a half walking around the Wharf and learning about its history and getting great advice on current things to do and see in San Francisco. The Wharf area is bustling with lots of people and activities. Without the tour I do not think I would have fully appreciated the area and all it has to offer. There are numerous educational and recreational opportunities in the Wharf area including some which are part of the National Park Service. Aquatic Park includes a historic Maritime Museum, which is open to the public and offers interesting exhibits and has gorgeous views of the bay. There are two old Navy vessels open for tour as well as The Hyde Street Pier, which showcases an exhibit of historic ships. The Aquarium by The Bay and the Sea Lion Center are located in this area too for those interested in viewing aquatic life up close. There are numerous restaurants, bars, souvenir shops, and other entertainment venues. Fisherman’s Wharf is a fun area to spend time sightseeing. Just realize, it is but one part of San Francisco and not representative of all the city has to offer. The ambiance in parts is a bit tacky and it is swarming with tourist traps. Still - it is an iconic part of San Francisco and I am not sure a visit to the city would be complete without a visit to the Wharf area.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Another San Francisco must see and do", "Absolutely loved Fisherman’s Wharf.delicious fresh seafood, amazing shopping, street performers and ton of things to see and do. Absolutely a great experience in San Francisco!"], ["Reviewed 2 weeks ago", 4.0, "Iconic and full of History", "Fisherman’s Wharf, the clue is in the name, an amazing collection of seafood restaurants providing both cold and hot fish foods and others from steaks to burgers, from Italian to Mexican.\nA vibrant and lively place with Manny buskers, plenty of parking spots and local hotels.\nCriminal not to visit and try out the food if visiting San Francisco.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great place to people watch. Very touristy", "Definitely for the tourists. Interesting place for food and to see the sea lions. Very busy at weekends"], ["Reviewed 2 weeks ago", 4.0, "always fun", "This is a people watching, food eating, fun having place, if you have never been GO!!!! Seafood is fresh / people are interesting to watch , GREAT PLACE TO GO !!!"], ["Reviewed 2 weeks ago", 3.0, "Lots to see", "We visited here whilst visiting San Francisco for 2 days before travelling onto LA. We drove down from our Pacific heights motel. Plenty of parking. We enjoyed a nice meal out and got the ferry over to Alcatraz. Was pretty busy and lively with tourists."], ["Reviewed 2 weeks ago", 5.0, "Seafood for days", "Loved this area by they bay because of all the seafood and the aquarium wasn't to shabby either. Definitely a great place to visit."], ["Reviewed 2 weeks ago", 5.0, "People watchin", "3 times we have visited San Franisco and we always go to spend the day at Pier 39 good food choices, people watching and of course the Sea Lions🇨🇦🇺🇸"], ["Reviewed 2 weeks ago", 5.0, "Fun", "A lot to see and do here. From restaurants to street performers to gift shops and museums, there is something for everybody. The views out to the bay are great as well."], ["Reviewed 2 weeks ago", 4.0, "A quick visit", "It’s right at the end of the tram line from market street. You can see the Golden Gate from an angle. There are world war submarines and ships if you are into that. You end up walking to Pier 39. Plenty of eating areas. Great atmosphere.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Experiencing the Wharf", "The Fisherman's wharf was an enjoyable afternoon on a warm afternoon. There are many great places to eat and many things to do from biking tours to boat tours that will take you to see the Golden Gate Bridge and the Oakland Bay Bridge up close. Comfortable shoes is a must as there is a lot of walking to be done. Great place to sit down and enjoy some fresh fish or crab that are cooked and made right in front of you.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "The place to be !", "One of the typical hot spots in San Francisco, it has all what you need: bars, restaurants, street music, shopping, ... and the best views over the Bay!"], ["Reviewed 2 weeks ago", 5.0, "Fun for all ages", "What a nice place to visit while in San Francisco. Good food on every corner and a cool old amusement place located in the back. Had a great time. Everything you need in one place. Madame Tussaud’s and Ripleys is located right at the wharf."], ["Reviewed 2 weeks ago", 5.0, "So colorful! Perfect for people-watching!!", "Fisherman's Wharf is a must-see tourist stop for anyone coming to San Francisco. Loaded with creative musicians and artisans hoping to get famous. Lots of choices for eateries - and tons of seafood restaurants. A must-see during your visit to San Francisco!"], ["Reviewed 2 weeks ago", 5.0, "Lots to see and do.", "With lots of memo shops and touristy spots, there are plenty of good eateries local and pier 39 and other good locations are only a short walk away."], ["Reviewed 2 weeks ago", 5.0, "Nice area for visiting", "A must see place to visit, plenty of shops and eateries. Sea Lions at the dock also does not disappoint."], ["Reviewed 2 weeks ago", 3.0, "Meh.", "Lots of fresh seafood and entertainment around. Great place to people watch! Pretty dirty and stinky."], ["Reviewed 2 weeks ago", 2.0, "Same Sorry Story", "When you travel a lot you get to a place mentally and emotionally where you just can't hardly stand places like this. Just the same vulgar catchpenny strip tease! Everything's for sale except anything of any value or signifiants and the public there only to be fleeced. We will more people start calling this out!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Plenty to see at Fisherman’s Wharf", "The wharf is a large area and there is lots to see and do. Plenty of Buskers in the evening as well as lots of restaurants and shops. The Museum Mechanic is here and worth a visit. You can also see a WWII ship and Submarine here.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Day with my brother", "Always love coming to fisherman‘s wharf, it’s just get such a neat feeling about it and that has never gone away."], ["Reviewed 2 weeks ago", 4.0, "Famous tourist location", "This place is an iconic tourist spot, with several interesting outlets & stores nearby. A must for tourists."], ["Reviewed 3 weeks ago", 5.0, "Day tripping in city", "A great place to walk around see fantastic views of the Bay ... lots of pubs shops , we went on Cable Car from here all way up to Union Square fantastic day spent in Fishermans wharf"], ["Reviewed 3 weeks ago", 4.0, "A Must Visit In SF", "Tourist spot for sure, but you'll kick yourself if you don't check it out. A myriad of bars, shops and restaurants; no matter what you're seeking there's a strong possibility you'll find it here. Yes, there will be a huge crowd here pretty much no matter when you come so plan on committing multiple hours if you want to see most of what The Wharf has to offer.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must walk the pier", "This is a great place to walk all around the pier. It has allot of stores and food. It's always a nice place to walk you won't regret it."], ["Reviewed 3 weeks ago", 4.0, "Wharf Area Visit", "Your average tourist fisherman's wharf; but it was clean and no vegrants or homeless hanging around. There was some good eating places too. One different option, was seeing the seals sunbathing off the end of the wharf. Afew rides for the smaller children. Plenty of sweet shops and souvenir places.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A lovely day out not just for the shoppers but for all who enjoy a steady walk on a flat surface", "Pier 39 was so much more than shopping and fun fair it was an amazing view across the bay, the haunting sound of the sea lions basking in the sunshine a truely wonderful day out"], ["Reviewed 3 weeks ago", 4.0, "Lots to see and do", "We visited Fishermans Wharf after experiencing the cable car which finishes a short distance from the Wharf. The Wharf has lots of shops, restaurants and tourist attractions. There was also a street musician singing whilst we were there to add to the lively mood of the area.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "GREAT FOOD!", "We did a little trolley tour and had a blast.\nLots of great places to eat!!\nWe walked down and felt safe - even at night.\nAll the shop doors are open and each had a little \"different\" item for sale.\n\nChocolate Shops, Sea Food, Fast Food ... the options are endless.\n\nSUPER FUN!\nWe could have spent another evening at the Fisherman's Wharf!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Definitely a destination when in SF", "I always look forward to going to the Wharf. It’s fun location with lots to see, do and eat. When the sun shines, it’s the best."], ["Reviewed 3 weeks ago", 3.0, "Wharf stay and walks.", "Tooo many homeless ! I fed a few. Got smiles from them. The quality of the restaurants in general are declining. Walk away to north beach and the restaurants and vibe is excellent !"], ["Reviewed 3 weeks ago", 4.0, "SF Tourist attraction and more", "Fisherman’s Wharf is home to the famous Ghirardelli Square, where anyone can taste a Ghirardelli chocolate sample at the store. There are other sites and sounds to experience along the Wharf too, along with several boutiques for shopping."], ["Reviewed 3 weeks ago", 5.0, "Tourist Fun", "Busy tourist attraction on the water in our beautiful city. Fun to walk around, enjoy some treats, stands with soups and crab, etc if you are up for it......It does tend to get crowded so be in the mood as a local to deal with that and take the approach that you are a tourist for a day :) Come on, it's fun :)\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wonderful Place!", "You can't go to San Francisco without coming here to Fisherman's Wharf. It's easy to walk around, the street food (clam chowder in sour bread bowl is a classic), the shops and arcade makes is a fun environment, and it's just a wonderful place to be.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Lots to see!", "Great place to shop tourist trap type stores and find something to eat. The people watching is even better. Easy to get to via the cable car as well. Touristy but worth a visit."], ["Reviewed 3 weeks ago", 3.0, "Depends on the day of the week", "So arriving on sunday and staying nearby I wandered down to check out Fisherman's Wharf and all I was thinking was \"thank God I don't have the kids with me\".\n\nIt was alarming the level of police activity required for 4 seperate reasons I saw within a 90min period....\n\nSadly an awful lot of homeless people but the concern was the drug effected people who several are confronting and will yell/rant at you and as you pass and then you have the ones that are simply struggling to stand.....\n\nThe shops/restaraunts and mostly very touristy lacking quality however there are some gems mixed in.\n\nAll if that said, day one was Sunday.\n\nNight two I tried again and Monday evening (and there after for the week) it literary was like I was in a different place.\n\nMuch quieter, no need for the police but yes still you see drug effected people but all in all a plesant experience vs the Sunday.\n\nHaving spoken to a few people who live in S.F that week thay ALL said \"don't go to the area on the weekend, it's not where we'd ever go\"....\n\n*try a lobsters roll from Crabsters and a great hot sauce shop on the strip which was amaizng.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "My preference to Pier 39", "This is one place I'd go instead of Pier 39, although if your here, you'd most likely go to both. It has more of the historic SF water front feel along with historic restaurants I remember from 30 plus years ago. Your just a few blocks from Pier 39, so go and eat here first then wander over there.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Lots to see and do", "There is lots to see and do here. It’s easy to get around and navigate. We went during fleet week and it was packed but fun."], ["Reviewed 3 weeks ago", 5.0, "Cool Place", "You can find many restaurants there, souveniers stores, bike rentals, wine stores, there are so many options."], ["Reviewed 4 weeks ago", 3.0, "Chose your eating place carefully, there can be some real bad food", "Stick to the 'known' places as there are some dickey joints which don't serve \"fresh\" food. A good place to spend a few hours but beware of the hustlers who try and get your money in the name of charity."], ["Reviewed 4 weeks ago", 5.0, "Touristy but fun", "Typical tourist destination but it’s a must see. I just enjoyed walking around and soaking it all in. Beautiful veiws of the harbor await you. Restaurants of all kinds are within a 10 minute walk. We ate at a few and I can honestly say you will get better food in other areas, but you have to go at least once.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A nice place to visit and eat when in San Francisco", "Nice place to hang out and to grab a bite, there is always something going on, but in a weekend can be a little overcrowded."], ["Reviewed 4 weeks ago", 5.0, "Great place to \"mosey\" yet get all the mus-do tourist attractions", "The sea lions, the views, the shops - and don't miss the chance to go to the second level to wander through the sea lion museum!"], ["Reviewed 4 weeks ago", 5.0, "Fun", "It's one of the touristic spots with lots of restaurants and souvenir shops. It was pretty crowded but we had fun there. At Pier 39 you can see a lot of sea lions just laying there. We were there for the first time in Rainbow cafe and my daughter was amazed. It's also near that beautiful Ghirardelli square.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fisherman's wharf", "Busy spots with tourist moving about for various activities. Souvenir shops and restaurants are located all over"], ["Reviewed 4 weeks ago", 4.0, "Shopping and eats", "Bright lights and lots of food! Lots of shopping around here, but mostly chain stores. The place to go for seafood though!"], ["Reviewed 4 weeks ago", 3.0, "Worth one visit", "Fisherman's wharf is as touristy as it gets. It is worth seeing once, and the walk around the waterfront both north and south are really amazing. North to Maritime Museum and into Presidio spectacular and South to Ferry Terminal and Exploratorium for kids is great, but the wharf is just too much of a tourist trap.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Richard", "Not so impressed with Fisherman’s Wharf, quite a few crazies out and the far too occasional urine smell!!"], ["Reviewed 4 weeks ago", 5.0, "Great plac to explore!!!!!", "We visited the wharf on many occasions! It has everything you need!!!! There’s TONS of dinning options! There’s sea lions! There’s history! There’s tons of great souvenir shops! The wharf is a great place to hang out at and explore from end to end!!! I would go back again and again!!!!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "FOOD !!", "Some great food places can be found here ... The chowder in a breadbowl is awesome and the lobster rolls are huge .. Take a seat and listen to some local music"], ["Reviewed 4 weeks ago", 5.0, "The typical visit", "It's something that you have to see if you are in SF. It's a must... Don't leave SF without visiting."], ["Reviewed 4 weeks ago", 3.0, "Dirty", "I was deeply disappointed in Fisherman's wharf. The sidewalks were filthy with dog feces, the crab tanks had murky water, the parking was $15/every 15 minutes. We were able to find a clean restaurant, but the food was so - so. I have been to Boston and Rhode Island, and Connecticut and the seafood was amazing. This was no better than I get in Iowa. Very disappointing.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Awesome historic market by the water.", "A great atmosphere with plenty of choices of local fresh seafood. You’ll be spoilt for choice and all reasonably priced although you’ll find the odd Lobster roll’s for a good $20+. Its a very touristy populated area as it’s situated right by the water but it all adds to the atmosphere.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Best Food in San Fran!", "We visited the Wharf several times throughout our recent girls trip a few weeks ago! The fish and chips and clam chowder bowls were to die for!! So so yummy. The views are beautiful and is a fun place to hang out! Lots of shopping, dining and street entertainment as well!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice place for a stroll", "We were there on a week day so it was relatively quiet. It was very foggy so I can’t speak for the view but we had a nice time walking around."], ["Reviewed 4 weeks ago", 5.0, "Time for some serious fun", "Never a dull moment at the northern waterfront area, know as Fisherman’s wharf. Famous chowder and sourdough bread bowl at every turn, trendy restaurants, shopping or museums will keep everyone busy for hours. Easy access from the downtown SF via F street car or the cable car system, Fisherman’s wharf is a favourite tourist destination around the year\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Nice but touristy", "Ok to bike around for half an hour but its very touristic and the restaurants and shops are nothing special. One can see the roughness of the wharf which is nice."], ["Reviewed 4 weeks ago", 5.0, "Wonderful area for a walk", "Cute bay area shopping and entertainment district. Went to the vintage arcade and got dinner. Went in the winter but there were still a lot of people walking around."], ["Reviewed 4 weeks ago", 5.0, "Authentic Sourdough Bread!", "Wonderful experience with the simplest of food, Sourdough Bread. Never knew it was different from what I purchased from my local supermarket! We had Clam Chowder in a Sourdough bowl. The bread had a stronger sourdough taste. The soup helped because it was tasty and not overpowering with flavor. Thanks, San Francisco for this and Ghiradelli Chocolate!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "As Good As We Thought", "We have visited Fisherman's Wharf a few times and we are always glad to return. It is an interesting and exciting public attraction."], ["Reviewed 5 weeks ago", 5.0, "Fun to walk about", "Plenty of places to eat and shop. Great experience, the seals can be heard before they are seen. All tours buses are easily accessible and provide great service. Pier 39 is the place to go for a mixture of shops and sales. If you want a nice meal, visit the Hollywood Cafe, a short walk from Fisherman's Wharf. Will certainly visit again.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "San Fran 2017", "Right at the Fisherman’s Wharf\nOur hotel was 1/2 block away\nShopping shopping shopping!\nMany places to eat and be entertained!\n\nThe restaurant at Boudin Bakery was our favorite. But we also got really fond of a restaurant on the pier, all the way to the end, go through the game room and there is a fantastic bar with open air views of the harbor. They have the best nachos and oh we enjoyed some Long Island IceTeas, good thing we just walked over to our room from there.\n\nAnd do not miss the sea lions, oh you won’t miss the sea lions lol\n\nLots to do on the pier!\n\nShow less"], ["Reviewed 5 weeks ago", 2.0, "lots of tacky tourist shops", "Fishermans wharf is a must visit for the first time tourist in San Fran. Lots of seafood restaurants and tourist shops. A tourist trap.\nIt is not attractive, other than the sea views and being able to walk along the promenade. Very little landscaping or upkeep has occurred.\nIf you want to go shopping there are much much better shops in Union Square or in some of the more interesting suburbs around the city.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "A must!", "Different restaurants, amazing atmosphere in a amazing place. Don’t miss the special bread with seafood!"], ["Reviewed 5 weeks ago", 5.0, "Lots to do!", "This has such an amazing variety of shops and restaurants. It's fun to walk around and watch the sea lions. It's all flat and a great place to walk or go for a jog."], ["Reviewed January 24, 2018", 5.0, "\"Fun Place!\"", "Fisherman's Wharf is an awesome place to visit. It's been around forever and I never get tired of seeing it. They have the best crab and shrimp cocktails and a large variety of scrumptious seafood to choose from. Enjoy!!"], ["Reviewed January 24, 2018", 5.0, "A must do when visiting San Francisco", "When you visit San Francisco you have to come to Fisherman’s Wharf. Great seafood restaurants and cafes and lots of shops and souvenir shops. Fantastic views of the harbour and Alcatraz and all the beautiful seals in the Harbour. They are all so beautiful. Get there early if you can before all the tourists and crowds. Take the cable car and walk around. Easy waking for all fitness levels.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Bring Good Walking Shoes!", "If in San Francisco you must walk along Fisherman's Wharf! It is very busy so pack your patience and good shoes but it is worth the trouble. The view from the piers and getting to see the cable cars and trolleys is great! There are many shops and a ton of restaurants serving fresh seafood. Most of them you can either go inside and sit down (more expensive) or you can order from a walk-up counter and find a bench to enjoy your food (much cheaper). If you are a people watcher you will be in paradise!\nShow less"], ["Reviewed January 23, 2018", 5.0, "Seafood lovers delight", "Great area to sample many types of seafood. Great shops and all are reasonably priced. Go early to avoid the crowds."], ["Reviewed January 23, 2018", 3.0, "Bad experience", "My husband almost had his phone stolen. Not enough security. The views to the bay were nice. A lot of souvenier stores."], ["Reviewed January 23, 2018", 3.0, "You have to go...", "...but we just found that the eateries, attractions and shops were overpriced and not unique to anything else you find in the area. Go, and decide for yourself - you don't need to spend a penny."], ["Reviewed January 23, 2018", 5.0, "Busy area!", "Tonnes of restaurants, shops and people everywhere! Live music on the street, fresh seafood being cooked at many locations, many people doing the same thing as you!"], ["Reviewed January 23, 2018", 3.0, "Too touristy", "It’s clearly a spot made for tourists. You can find all sorts of restaurants, streets foods and a few museums. Nice to take a walk through but i wouldn’t recommend spending a lot of time here."], ["Reviewed January 22, 2018", 5.0, "Nice place", "Its a very nice place to hang out.. Have some shrimp and french-fries.. Going here by cable car. Lot of Restaurant.. Can see the golden gate bridge by Tour. Recommend if you going to SF"], ["Reviewed January 22, 2018", 5.0, "Fun Trip", "There were lots of places to visit by the water. Lots of side walk entertainment. Places to eat and souvenirs to buy."], ["Reviewed January 22, 2018", 5.0, "Okay, it’s touristy - so what?", "Yes Fisherman’s Wharf is touristy. But it is also really interesting. The fishing boats docked next to Alioto’s Restaurant are working boats that go out everyday and catch fish to feed the city. The restaurants serve really good food. And yes, there are junk shops, but there are also museums and aquariums and the sea lions and the cable cars, etc. The bottom line is that Fisherman’s Wharf is fun!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Touristy, but fun!", "I've been living in the Bay Area my entire life, and I still love to visit the place as a tourist at least once a year. It's the first place that I take out of town visitors as well. Lots of great seafood restaurants and activities, but the best (free) entrainment is people watching.\n\nThere's a never a dull moment at The Wharf!\nShow less"], ["Reviewed January 22, 2018", 5.0, "At the end of a long day...", "At the end of a long day, you have to eat! We spent the entire day looking all there is to see. We were tired. We were hot. We are not young! However, after this nice stroll and food, we felt refreshed enough to make it back to the hotel, where we collapsed...\nShow less"], ["Reviewed January 22, 2018", 4.0, "All the tourist", "Lots of places on the street or at tables to eat..sour dough bread, seafood, crab cocktails, beers, all the things to make an afternoon of a very crowded place..but you havent seen SF until you've been to the Wharf. Try it once..ghiridelli's is within walking distance..\nShow less"], ["Reviewed January 22, 2018", 5.0, "WOW", "So many things for the eyes to take in! Lombard Street for the first time, and I didn’t scream all the way down (😏), street cars, fishermen’s crab traps, and the Wharf! Have a wonderful day. Take your time! See it all!! ✌️"], ["Reviewed January 22, 2018", 4.0, "You Gotta Go", "Right next to Pier 39 it all kinda runs together through here. There is a lot to see, drink and eat all through here."], ["Reviewed January 22, 2018", 5.0, "Family hoilday", "We was over for a family hoilday and spend the day out we ended up at the Wharf it was quite busy but still plenty off room very clean area and lots to do"], ["Reviewed January 22, 2018", 4.0, "Lots to see and do. Bring your wallet", "Tons of food choices. Street performers want your cash. Parking wants a piece. The sea lions want to make noise. Still, it is a can't miss location."], ["Reviewed January 22, 2018", 4.0, "Boat tour of the harbor", "We enjoyed seeing the harbor and hearing all of the history of the area. Beautiful view of the Golden Gate bridege from the water, and the best part--we got to see a couple of whales!"], ["Reviewed January 21, 2018", 5.0, "Somewhat touristy", "Somewhat touristy but has some good fish stands and a couple of decent restaurants. Sort of a must see for a first time visitor"], ["Reviewed January 21, 2018", 5.0, "The Wharf", "First things first, it’s hilarious seeing the sea lions bathing in the sun. Apart from that, there is great restaurants and shops for all ages of people. Fine dining to fast food and everything in between. Had a lot of fun in this area"], ["Reviewed January 21, 2018", 3.0, "It’s Been Awhile ....", "I remember when there used to be seals. And you really saw fishermen unloading their catches. Now it’s just another overbuilt tourist area. Lots of restaurants and souvenir ships. Fine for a stroll or because it’s the place from which you’ll catch a boat out into the Bay. Otherwise, meh.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Get your walking boots on!", "A really lovely experience, just like going to any seaside town but with a really interesting museum with entry for free. GO"], ["Reviewed January 20, 2018", 5.0, "A must do and see", "We were delighted to have a lovely sunny day to visit. As always a great tourist spot. A must see is Pier 39 with the Sea Lions. Beware of the queues when returning by cable car. You can wait upto an hour at peak times."], ["Reviewed January 19, 2018", 4.0, "Tourist Attraction", "This is the place you have to go to during a visit to San Francisco. Great location for a walk, go on tours, watch the sea lions and grab some food."], ["Reviewed January 19, 2018", 3.0, "Average", "Like any seaside town really. Lots of shops, restaurants and activities to do. At night there’s a lot of people who hang around and will ask you for money so be careful."], ["Reviewed January 18, 2018", 5.0, "Great restaurants", "Nice shops here and a lot of places to eat and especially get fresh seafood. We did our shopping at Pier 39 first though and glad we did, more choices and better prices."], ["Reviewed January 18, 2018", 5.0, "Must visit place.", "Another must visit place when visiting San Francisco area. Crowded with locals and tourists looking for same stuff, chowder. The area filled with many seafood restaurants where you can get a taste of clam chowder in a sourdough bread bowl. Or grab that lobster roll or seafood cocktails and heading to a nearby benches and watch the world go by.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Enjoyed the ambiance", "We traveled in winter and loved the crisp air and the excitement in the air.\nYou can walk to anything that you may need in the air, eateries, shopping, souvenirs, parking and art. We did all of the above.\n\nYes it is touristy, but a must do when in SFO.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Definitely Visit while in SF", "Nice shops & restaurants, just beware that it smells like fish ... a lot ... everywhere :) Area is clean, provides beautiful views of the Bay."], ["Reviewed January 15, 2018", 4.0, "Good food not too expensive", "This is a nice place to take a walk if you want to experience the harbor's atmosphere. We ate there at one of the fish and chips restaurants: after checking out pretty much all of them, we concluded that it was the same price everywhere (which is around 10$ per plate).\nShow less"], ["Reviewed January 15, 2018", 5.0, "So Much to See and so Little Time", "We rode the cable car to thee wharf and walked around. We ate clam chowder soup and it was so good. Sorry I can't remember the name."], ["Reviewed January 14, 2018", 4.0, "Nice atmosphere im SF", "With lots of good restaurants, hotels and shops, a good base to explore San Francisco. Some restaurants will open till late night. Off course, famous San Francisco clam chowder soup found in this area."], ["Reviewed January 14, 2018", 4.0, "An open mall", "Although the place is a touristic place it is nice. It has several stores and restaurants. You can also book a boat tour around the bay in this area. Do not miss the Boudin Bakery."], ["Reviewed January 14, 2018", 5.0, "Great place to eat", "We spent the afternoon at the pier. I had my first Clam Chowder. It was delicious. A must !\nWe watched the seals, their Amazing & very loud. Had fun just walking around taking in the atmosphere. You don’t have to spend any money if you don’t want to. But it is hard with all the great food.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Nice walk with shops along the way", "What a great way to have an afternoon stroll. Great fish places long the way. Lots of souvenir shops and some other eateries. Boudin bakery further down. Nice look out in the water too."], ["Reviewed January 13, 2018", 3.0, "Interesting Visit", "This is typical American fare with too much batter, fat etc. The views from here are wonderful but were spoilt by homeless people hassling visitors for money. The night time lighting is poor and walking around after dark looking for a taxi left us feeling uncomfortable.\nShow less"], ["Reviewed January 13, 2018", 2.0, "Only reason to go here is to catch a ferry", "Nothing of value here except if you must visit a chain restaurant. The tourist shops are just terrible. If you like In-n-out this is the only place you can visit one in San Francisco. The city has so much. more to offer than this."], ["Reviewed January 12, 2018", 3.0, "Nice place", "I’d read this was a must-see place. We’re glad we went but I wouldn’t say it’s a must-see. There are cute shops and restaurants, and you can see the Golden Gate Bridge from here but if you’re going along the coast you’ll see similar type places.\n\nWe mostly went because our daughter wanted to ride a trolley and they go directly to Fisherman’s Wharf.\n\nIt was a good experience but we didn’t stay long.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Lovely views with great places to eat", "The pathway from the golden Golden Gate Bridge to Fisherman's wharf walking or cycling is a must. Stunning views. Lots of activities from fisherman's wharf and places to eat."], ["Reviewed January 11, 2018", 4.0, "Dinner at wharf", "Clam chowder at the wharf is best ever! It is served in a sourdough bowl and it is delicious .\nThis is a must do for everyone. Staff friendly and welcoming and food excellent and good value.\nAlso lots to see especially the Seal colony at Pier 39. Good tourist attraction.\nHappy to recommend.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Good seafood", "Our hotel was in walking distance. Had a good dinner there then came back next day for fresh seafood cups from the outside counter. They were delicious! Very much enjoyed the food."], ["Reviewed January 11, 2018", 5.0, "Neat for a quick visit", "This is essentially a large amusement park on the Bay. It's neat to walk around, and you could easily spend half a day here. Be sure to find the sea lions - best part of the area."], ["Reviewed January 10, 2018", 5.0, "Nice place", "You can walk eat drink and have fun with kids. All in one place. Kids can go to a mirror maze and a laser tag game and an arcade. A lot of places to eat outside so it’s very nice."], ["Reviewed January 10, 2018", 3.0, "Depends on what you are looking for....", "This was our first trip to San Francisco so I felt like this was a \"must see\" area. It is full of food stands and resturants. It is a very crowded and felt just like a tourist trap to me but that is just my personal opinon. I was surpised at how dirty the area was considering this is where most visitors spend some time you would think they would keep it cleaner.\nShow less"], ["Reviewed January 9, 2018", 2.0, "Crowded and touristy", "Didn't like this area at all - full of tacky tourist traps: poor shops and some poor food . I don't think it represents San Francisco well. So much more could be done on that site. A disappointment."], ["Reviewed January 8, 2018", 5.0, "A San Francisco Must", "If you're visiting San Francisco, this is a must stop. Lots of fresh crab stands, lots of souvenir shops, lots of people and just non stop action. A must for visitors. Take the cable car from Market Street to make this a complete San Francisco experience. Definitely stop a Boudins for lunch or just to buy a fresh sour dough loaf of bread. The best bread you will ever have\nShow less"], ["Reviewed January 7, 2018", 4.0, "Loved it", "I would stationed in Camp Pendleton California in the United States Marine Corps I lived in San Diego off base for a while I was out there for about a year-and-a-half and the furthest I had gotten up to was a trip to La I usually stayed in the San Diego and was also stationed at El Toro Air Base Marine Corps Air Wing which no longer exists that was back that was back in the early 70s and then in 2017 I got to go back to California to visit a friend and spent time traveling all over San francisco-oakland Alcatraz Fisherman's Wharf Tower Hill I just went everywhere I really enjoyed the trip\nShow less"], ["Reviewed January 7, 2018", 4.0, "Lovely both by day and by night", "If you're into shopping and eating or you simply love promenading, then Fisherman's Wharf of San Francisco is the place for you. It's constantly bubbling with shops and restaurants both by day and by night. It's fun to haggle with some stores in the area when buying souvenirs, to watch street artists at work, to indulge in both street foods and in those served at fine dining restaurants, or simply do window shopping while breathing the sea breeze from the bay. Across the street you'll find museums (like Ripley's Believe It or Not) and high-end accommodations. Both grown-ups and kids will surely enjoy this place.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Great for the family to visit!", "There are great gift shops and restaurants to visit here. This would be great to walk around for a couple of hours. They have a museum and the aquarium is nearby. Also, there is a great arcade that was in the movie “Princess Diaries”. It is old fashioned, but has new games too. Loved the view of Alcatraz too.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Crowded but Pleasant", "I was at the or during the summer last year there were some crowds but it's still very pleasant this time during the holidays there was a waiting list for mating of the restaurants but it was still very pleasant and it accessed to restaurants was plentiful. Despite the crowds you will have a wonderful time very peaceful very charming and plenty of good restaurants if you wanted to wait.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Family holiday", "Fishermans wharf is a must do if visiting san fran. A huge variety of shopping restaurants and history. Walk along all the piers and there is something for everyone. We found some amazing places to eat .. the more touristy places like hard rock cafe and bubba gumps but also the more authentic places that sold the most amazing clam chowder which you really must try. Fishermans wharf really does have something for everyone.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Fun for the Family", "Lots to do here. Like any other wharf it’s filled with trinket shops and restaurants. Everyone in the shops I went to were nice and polite, but nothing stood out to me at any of them. One super cool thing though is that the sea lions were hanging out there, so that boosted their rating for me. The wharf is definitely worth it to checkout, especially if you’re hungry for some food. It’s still fun to look at but unless you’re going to specifically buy something you could probably skip it.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Very touristy", "Busy tourist attraction but I would recommend to do it at least once. Have yet to find great food but most venue offers suitable lunch fair. We have seen sea otters lounging about while having a meal. That would be the highlight."], ["Reviewed January 7, 2018", 4.0, "Child friendly", "There was a lot of entertainment for the children, a beautiful caracul, plenty of food outlets, souvenir shops, you can book a boat ride out to Alcatraz, see the sea lions, The Golden Gate Bridge, the guide was very informative and it only cost $15.00 per person.we got some Great photos.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Fun for everyone!", "So much to see and do here! Lots of great places to eat. Great place to people watch! Lots of shopping, and the sea lions are fun to watch... with a great view of Alcatraz and the Golden Gate Bridge."], ["Reviewed January 6, 2018", 5.0, "Awesome for nightlife", "This one of the few spots for a good nightime with family of friends.. good food, very safe and excellent vibes.. must do place when in SF"], ["Reviewed January 6, 2018", 4.0, "Great Place for Tourist Items", "Fisherman's Wharf is a must for anyone visiting the San Francisco area. There are great sea food restaurants. On Pier 39 there are great shops to buy interesting keepsakes. The Pier 39 is very crowded so be prepared to spend some time there. Fisherman's Wharf is a great place to spend the day so put on your walking shoes and bring your appetite.\nShow less"], ["Reviewed January 5, 2018", 4.0, "must go spot in SF", "fun, entertaining and a bit commercial. great place to spot the sea lions in the harbor and to find a large variety of souvenirs in one place."], ["Reviewed January 5, 2018", 4.0, "Great fun", "My wife and I enjoyed exploring this area while in San Fran. The restaurants and sea lions were great. The only bad part we had was paying for all day parking. $45 dollars right next to the FW sign! Over all it was a great day!\nShow less"], ["Reviewed January 5, 2018", 5.0, "A must", "I kept asking about this place until I arrived. It is a very nice area with a lot of gift shops and cloth shops. The sea has a very attractive scene. Everything is clean and bright. I enjoyed my time there. You can spend a day especially that there is a water taxi, ships, and a lot of restaurants\nShow less"], ["Reviewed January 5, 2018", 5.0, "Great for seafood brunch!", "Got to this place via cable car from Powell. Try the nearby restaurants and food stalls for clam chowder, lobster rolls, and other seafood :)"], ["Reviewed January 5, 2018", 5.0, "Nice boardwalk", "This was a nice boardwalk, filled with good places to eat! The sea lions are the most amazing pet to me! You get a great view of them! The day we were there they counted 274 for that day. The guide said that they have seen as many as 600 on any given day.\nShow less"], ["Reviewed January 4, 2018", 4.0, "crowded, but worth stopping", "This place is brimming with activity, you will be surrounded with restaurants and eateries. You can grab a bite at a fancy restaurant or eat off a cart...There's something for everyone. Tickets for the boat ride to the Golden Gate bridge are also available here."], ["Reviewed January 4, 2018", 2.0, "Very touristy", "Ok area however has been turned into tourist area full of shops and large eating places .. I was not impressed ."], ["Reviewed January 4, 2018", 2.0, "Tourist trap. High prices and low quality.", "Ok views from the end of the pier, but as good as some points on the shoreline as you walk towards Golden Gate Bridge. Most restaurants here are very expensive compared to even a couple of blocks away and the quality of food and service is nowhere near as good. Visit it, but don't spend that much time here.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Must visit", "Another historic place to visit in San Fransisco. Easy to get to and very close to many other main tourist attractions in the area!"], ["Reviewed January 3, 2018", 5.0, "Tons of restaurants - delicious food & seafood!", "So much to choose from, something for everyone and lots of tourist gift shops as well. If you want fresh seafood, you will find it here."], ["Reviewed January 3, 2018", 3.0, "Great spot to enjoy a day at the city", "This spot got good seafood restaurants, lively people, and a great family atmosphere. We had a great time with so much to see and do."], ["Reviewed January 3, 2018", 5.0, "Fresh Crab and Sourdough!", "The street vendors on Fisherman's wharf can't be beat for fresh crab or shrimp and chowder and sourdough bread. Nothing like ordering fresh crab and sourdough and then trying to avoid the dive bombing seagulls along the wharf that are after your food. They are dropping as they dive bomb, so pay attention and try to find an overhang to protect yourself, or go to one of the restaurants serving the same fresh seafood.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Fun place to visit", "Fisherman's Wharf is an iconic place to visit in the city with this being said... The parking lot operators are making a huge profit on their lots. It is incredible that how much they charge for parking... if they were to lower the prices or offer more places/the ability to validate in more then one place then I would visit more often. I guess they are trying to get people to take public transit. Oh well. We visited a couple of attractions and had dinner,however, all of it was about the money. If you want a place to people watch and see street performers then this is the palce.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Iconic Landmark and delicious seafood", "Our hotel was located close by so we visited this spot many times. Always crowded but its the best place for seafood and you have to visit Boudin Sourdough restaurant and try their bread bowls."], ["Reviewed January 3, 2018", 5.0, "Why Wouldn't you Go?", "Great place to walk around and visit the restaurants. The smells from all the restaurant is amazing. The birds love to attack your plates."], ["Reviewed January 2, 2018", 4.0, "Great place for a walk and simply soak in the atmosphere", "Great place to bring the kids and adults alike for a walk. Ample choices for coffee, beer, meals, ice cream and so on."], ["Reviewed January 2, 2018", 4.0, "Fun!", "The culture of the wharf is fun, and chaotic, the food is amazing. Be sure to bring your appetite, and try the chowder, and bread bowl."], ["Reviewed January 2, 2018", 3.0, "Chaotic", "What a busy place. There is a considerable amount of activity. There are restaurants, bars, music and tourist shops. If you are not really into seafood, then your food choices become quite restrictive. If crowds and car congestion makes you crazy, don't go."], ["Reviewed January 2, 2018", 3.0, "Overrated but worth a stop", "After two visits, I've come to believe that the Wharf is one of the more overrated tourist sites in the city. As other reviewers have stated, it's overcrowded with tourists and many of the attractions and restaurants are both overrated and expensive. Still, it's worth a brief stop and there are a few good restaurants nearby. It's also a good place to meet up before a trip to Alcatraz or the Ferry Building.\nShow less"], ["Reviewed January 2, 2018", 2.0, "You'll like this only if you're a fan of very crowded, touristy and tacky attractions", "You'll like this only if you're a fan of very crowded, touristy and tacky attractions. Therefore, not appealing to me. Having said that, though, my kids really liked it!"], ["Reviewed January 1, 2018", 1.0, "Tourist Trap", "If you want a t-shirt this is the place for you. There are entertaining street performances, but the crowds are oppressive."], ["Reviewed January 1, 2018", 4.0, "Fun And Food", "Fisherman's wharf has plenty of food choices. The smells are amazing. Plan on at least 3 hours to enjoy this iconic San Francisco landmark. We ate, looked at the sea lions, walked through the shopping district and bought some sour dough bread before heading out."], ["Reviewed December 31, 2017", 4.0, "Busy busy", "Worth seeing. Busy place. Good food and sights to see. Like surfers paradise on steroids. Don’t eat clam chowder. Very over rated."], ["Reviewed December 31, 2017", 5.0, "Take your time", "At our first visit we missed so much. This is our second visit and we saw and experienced so much more. The food experiences we discovered second time round were so much more. Seafood chowder around here is top notch."], ["Reviewed December 31, 2017", 4.0, "The food, so much food", "Just the smells is enough to make me come back. So much food, even after you eat you just want to walk around and eat more."], ["Reviewed December 31, 2017", 5.0, "Just wander", "Eat some seafood and enjoy. Of course it's for tourists -who cares. Try the Dungeness crab!! - Sandwiches or crab cakes, both good"], ["Reviewed December 30, 2017", 4.0, "Nice place to walk around one afternoon", "We spent about an hour walking around the pier. Busy area full of families. Our favorite part was seeing the hundreds of sea lions hanging out on the pier."], ["Reviewed December 30, 2017", 5.0, "Just wandering around is fun", "OK – Visiting Fisherman’s Wharf is a touristy thing to do…and I do it every time I visit San Francisco. There’s lots to see, lots of things to blow your money on (including fast-talking panhandlers), lots of restaurants and it’s just fun to wander around.\n\nMy daughter and I were there recently on a pre-Christmas jaunt to the city, and I have to say the reduced crowd sizes and the ongoing holiday buzz added to our fun. The festive decorations provided an air of revelry you don’t see at other times of the year, and everyone just seemed happier than usual. We enjoyed just wandering around, shopping, eating and enjoying the sites.\n\nThis was my second December trip to San Francisco, and, frankly, it’s my favorite time to visit.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Holiday Xmas Vacation", "Yes this is a huge tourist attraction but lots of restaurants to eat all budgets and lots of people watching, a fun place to go!"], ["Reviewed December 30, 2017", 4.0, "Pretty cool to see", "It is pretty cool to see... but the food is not very nice and at lots of the street food stalls the food was cold."], ["Reviewed December 29, 2017", 5.0, "Fun experience", "Great place full of food and shops! Wish I could have eaten more! Stayed a couple blocks and made it easy to walk everywhere."], ["Reviewed December 28, 2017", 5.0, "Our USA honeymoon", "Lovely place to see a big tick off the bucket list. Lots to see and do we were just quickly running out of time. Would like to return one day"]]}}