{"Fort Rosecrans Cemetery": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Fort Rosecrans Cemetery", "url": "/Attraction_Review-g60750-d557349-Reviews-Fort_Rosecrans_Cemetery-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/01/1f/77/ajouter-une-legende.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1226"}, "address": {"@type": "PostalAddress", "streetAddress": "1800 Cabrillo Memorial Dr", "addressLocality": "", "addressRegion": "California", "postalCode": "92106-3601", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Very humbling...", "Had no idea this place existed. So glad friends took us to visit this Veterans' Cemetary. Absolutely beautiful location. The stunning views add to the beauty of this memorial cemetary. Thanks to all for their service."], ["Reviewed 5 days ago", 5.0, "Sunset", "After visiting the Cabrillo National Monument, we stopped here to watch sunset. It was absolutely amazing - quiet, contemplative, and an awesome sunset to boot. We were at the far southern gate, but we could clearly hear the trumpet songs at sunset. Highly recommended!"], ["Reviewed 6 days ago", 5.0, "SOMBER PLACE", "As a Veteran walking the paths of Fort Rosecrans is a humbling experience. This spot with the ocean views is such a beautiful spot. Any Americans that can should spend a few minute here with these veterans."], ["Reviewed 1 week ago", 5.0, "Impressive monument", "There are app. 118,000.00 graves of service men and women at this cemetery. The upkeep is meticulous. Worth a visit."], ["Reviewed 3 weeks ago", 5.0, "Walk into history", "We started out going to Point Loma Lighthouse (which the road passes right thru this cemetery) and were turned around because of the temporary US govt shutdown. On the way back, we decided to stop at the cemetary, which has great views both out to sea and inland to San Diego, and take some photos. What hits you immediately is the size of the cemetery. There are tens of thousands of grave stones, each with a story to be told. It was fascinating seeing what countries and states these service folks came from, which wars they fought in, which part of the military they worked in, and which family members were buried together with them. It is a beautiful, humbling, peaceful, and thought-provoking place to spend some time. And the views are spectacular.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Relatively unknown National Cemetery work a visit", "Fort Rosencrans Cemetery is on the way to Cabrillo National Monument and the Old Point Loma Lighthouse. You can visit it, or just drive past. It is a very well maintained National Cemetery with thousands of military graves marked by white headstones arranged in hundreds of rows. Just driving past, I find it difficult not to ponder the sacrifices these men and women made.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful scenery", "This cemetery is located in one of the most beautiful places in San Diego. It is also a idyllic location for a memorial to our servicemen. This is one of my favorite places to sit and reflect- and watch the sunset just a short drive down the road.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Impressive and humbling", "Worth the drive up with a stop at the light house. The cemetery is jaw dropping and well maintained, humbling to say the least."], ["Reviewed January 15, 2018", 4.0, "National Cemetery", "This historic cemetery reminds me of the cemetery in Vicksburg only this is on a rocky point along the coast instead of gently rolling hills."], ["Reviewed January 7, 2018", 4.0, "A Final Tribute to America's Veterans", "Fort Rosecrans Cemetery, on Cabrillo Memorial Drive, is truly a amazing spot to pay a final tribute to America's veterans who served this country so bravely."], ["Reviewed January 6, 2018", 5.0, "Patriots", "Stopped by on our way to the old lighthouse. Well worth it. Awe inspiring, very humbling. View to downtown San Diego breathtaking. Make a stop and be thankful for the U.S. Arm Services"], ["Reviewed January 5, 2018", 5.0, "Beautiful and moving", "The National Cemetery at Fort Rosecrans is simply extraordinary. The ocean and the Bay are visible on either side, so the setting itself is magnificent. Everything is meticulously cared for. It is a place all should visit."], ["Reviewed January 3, 2018", 5.0, "Beautiful location", "This is one of the most spectacular natural spots in the San Diego region. Located on the South Eastern tip of Point Loma the views span from downtown, the entire Coronado island, silver-strand to IB and lovely Tijuana. Most of the time you can also see the three Islas Coronados of the coast of Mexico. I've come here several times to visit the graves of family members. The groundskeepers do a great job keeping this place in tip-top shape; this past December there were wreaths on every grave.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Peaceful Vistas", "On your way to Cabrillo National Monument you will pass by the Ft. Rosecrans Cemetery that spreads across both sides of the road with fantastic views of both the Pacific Ocean and the San Diego Bay. Birds also like to hang out on this space. As with any national cemetery, the matching headstones appear to be standing in formation -- and during the Xmas season each one is decorated with an identical green wreath.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Very somber place", "We stopped here on our way to the Cabrillo Memorial. Whether you have served in the military, or have family that is, or has, or haven't, this is a very somber place, and will take your breath away."], ["Reviewed December 30, 2017", 5.0, "Classy, dignified military cemetary. A view forever!", "Very dignified and proper location to honor the departed veterans. Graveyard is well maintained. The view east across San Diego Bay towards downtown, or west out to sea is incredible."], ["Reviewed December 28, 2017", 5.0, "Heartwarming experience", "We recently participated in placing wreaths on the graves of Veterans as part of a Christmas ceremony. It is always very touching to visit this cemetery as it is a great example of the sacrifice that our fighting forces have made to keep this country free.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Amazing", "This is simply a beautiful, beautiful cemetery. The grounds are well maintained and the views are great."], ["Reviewed December 19, 2017", 5.0, "Beautiful setting - moving experience", "The grounds here are stunning and provide a beautiful setting to honor those who have served our country. Well worth a visit"], ["Reviewed December 15, 2017", 4.0, "Remembering life", "As this cemetery and if watch other too, used to think this much is the life time, no need to worry, anger much (little required in some cases). Very peaceful area (all are sleeping)"], ["Reviewed December 1, 2017", 5.0, "Humbling site", "My wife and I stopped here on our way out of the Cabrillo National Monument and tide pools.\n\nAs a U.S. Navy veteran, visiting here and walking around was very humbling. Standing anywhere on the grounds gives you a view of the sea and/or the harbor, but more importantly you will find a greater understanding of the sacrifices our servicemen and women make for your freedom. It is free to park and walk around.\n\nVisit here for an experience you will never forget.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Amazing", "I want to visit this site again. Only in a cemetery can one appreciate the many who have given their lives for our freedom. Melts my heart to think of these men and women who gave all for us."], ["Reviewed November 22, 2017", 5.0, "There are no words...", "Words really cannot describe the massive layout of headstones that memorialize the lives of men and women who have served our great country, especially when the backdrop is the beautiful Pacific and the city of San Diego.\nIt’s a great place to reflect near sunset. I love the trees.\nShow less"], ["Reviewed November 17, 2017", 5.0, "MOM AND PAPPA REST HERE", "My pappa rests here and my Mom rests here too, what is interesting is that my pappa and my mom are resting on top of my pa's first wife casket! It's all good as my pa's first wife died many years ago and my Mom married pa many years ago (they would of been married over 40 years if they both lived now). This place is so beautiful and the view is stunning. It is very peaceful and the front office if very helpful.\nShow less"], ["Reviewed November 10, 2017", 5.0, "VETERANS DAY", "We visit Fort Rosecrans every time we are in Pt. Loma. It is a beautiful and serene place. There are no words for the setting. It’s the best San Diego has to offer.\nThere is no better place to pay respect to our military than there. To see the rows and rows of grave markers set with such precision is a solemn reminder of the sacrifices made by the men and women and their families for our enduring freedom.\nMore than that if you walk the rows and read how old this military cemetery is. You can read the names of our soldiers and see how all nationalities and religions have always been represented in our military. Then multiply that across the nation at every military cemetery.\nIt is a very proud and thoughtful moment.\nShow less"], ["Reviewed November 9, 2017", 5.0, "National Cemetery Experience", "We visit Ft. Rosecrans National Cemetery on a fairly regular basis. It is a tremendous place of serenity and beauty. It has by far the best views of downtown San Diego and San Diego Bay. It is always impeccably maintained and decorated depending on the time of year that you visit. Given that San Diego is a military town, Ft. Rosecrans is a must see if you want to understand what being in the military is all about and that the sacrifices made for the rest of us are overwhelming. Highly recommend a visit!\nShow less"], ["Reviewed November 4, 2017", 5.0, "Family burial", "Every time I come back to visit San Diego I stop by Rosecrans to visit my parents grave site here. What a beautiful place to visit. It was my first time back in several years and they have changed the way you find burial sites which I found to be a bit more complicated, confusing and frustrating, but we finally found it!!! Still worth visiting!\nShow less"], ["Reviewed November 3, 2017", 4.0, "God Bless You Uncle Frank", "My Wife's Uncle Frank was a decorated Korean War Veteran how requested to be inturred there after he retired from his civilian career. We were not able to travel to his memorial service when he passed recently so we decided to add this on to our trip to San Diego. I am very patriotic so I definitely appreciate what this Veterans Affairs memorial garden truly represents in our country. Uncle Frank was about God, Country, Family and his family knew he wanted to be interred there.\n\nThis is not the type of location or event that you normally do a review of but Fort Rosecrans Cemetery far exceeds any expectation you could have for the final resting place for a loved one. It is an honor to be able to be interred there with other American war heroes who fought side by side for their country. Many of whom died in the line of duty.\n\nGod Bless You Uncle Frank!!\nShow less"], ["Reviewed October 27, 2017", 4.0, "Great views from this cemetery.", "Just took a drive around without paying the fee to enter the cemetery. Beautiful views of the harbor area."], ["Reviewed October 26, 2017", 5.0, "A must see.", "An incredible sight. Amazing location for the fallen. Well manicured and very serene spot. A must see when visiting San Diego."], ["Reviewed October 25, 2017", 5.0, "Pausing for a moment at family members burial site", "This is a very good place for reflecting on the value of life and liberty while taking in the views of the ocean..."], ["Reviewed October 24, 2017", 4.0, "Military cemetary", "My uncles was buried here hence the visit, the staff were amazing and couldn't do enough for you and full Mikitary honours so moving. However the cemetarycemetary itself is beautiful peaceful and overlooks the bay . Not sure a visit is a must unless you...More"], ["Reviewed October 22, 2017", 5.0, "Words can not describe", "My two kids and I stumbled upon the area while looking for touristy places while visiting San Diego. Truly at a loss for words."], ["Reviewed October 19, 2017", 5.0, "Beautifull spot!", "One of the most serene and beautifull cemeteries! Wow what a view on the bay and the base. I love to go there before or after a visit to cabrillo national monument."], ["Reviewed October 18, 2017", 5.0, "Very moving.", "So peaceful that that these thousands of military personnel are resting in a place that has a spectacular and natural setting."], ["Reviewed October 16, 2017", 5.0, "National Cemetery", "Very nice location of national cemetery overlooking the sea. Well kept grounds. Nice to see another national cemetery."], ["Reviewed October 12, 2017", 5.0, "Peaceful and beautiful!", "A nice stop to reflect and pay respect to our veterans and their families. It is a beautiful spot and it is kept very nicely. It is so peaceful, do not miss it."], ["Reviewed October 11, 2017", 5.0, "Well Maintained.", "A must stop to remember the Veterans who gave so much for their country. take time to read some of the head stones."], ["Reviewed October 11, 2017", 4.0, "Humbling", "Having seen the cemeteries in northern France ; this cemetery also leaves you in awe regarding the sacrifice made by so many so we can live like we do today."], ["Reviewed October 11, 2017", 5.0, "Such a Beautiful Cemetery", "What a beautiful resting site for our veterans. Cemetery is well kept. The area/location is so nice. Stop and pay your respect."], ["Reviewed October 4, 2017", 4.0, "Homage to Veteran's", "We drove thro' this Cemetery before reaching Cabrillo National Monument. The cemetery is located approximately 10 miles west of Downtown San Diego, overlooking San Diego Bay and the city from one side, and the Pacific Ocean on the other. Fort Rosecrans is named after William...More"], ["Reviewed October 2, 2017", 5.0, "Fitting and Solemn Rest for Heroes", "Any visit to San Diego should include a stop at this cemetery. It is a stunning sight to see these immaculate headstones in such a gorgeous setting. I took some friends here and we left with a renewed respect for our heroes. The views are...More"], ["Reviewed October 1, 2017", 5.0, "Stunningliy beautiful and well kept Cemetery. A sign of great respect", "This is an amazing war memorial cemetery. Very moving to read some of the inscriptions and beautifully maintained out of respect for these great men and women who died for us in service or died later after providing service to us all."], ["Reviewed September 24, 2017", 5.0, "Humbling", "We toured this cemetery as part of a US Navy reunion tour. White crosses stretch forever it seems. Very humbling and somber experience. I had no idea this cemetery was here and that it was so big. It's hard to stand in the presence of...More"], ["Reviewed September 22, 2017", 5.0, "Spiritual", "As you were driving to see Cabrillo National Monument, you will find Fort Rosecrans Cemetery on both sides of the street. Had to stop by and pay respects for the men and women that served and protect this great nation. It was spiritual. Some of...More"], ["Reviewed September 21, 2017", 5.0, "Breathtaking", "I had never heard of this cemetery nor did I intend to visit it but when I saw it from the side of the road,I just had to stop. It is just beautiful and,unless your heart is made of stone, incredibly moving. The scale of...More"], ["Reviewed September 20, 2017", 5.0, "Thank you for your sacrifice", "Knowing that these treasured men & women died for us makes this a somber yet beautiful place to visit. The grounds are immaculate & beautiful. Take a moment to appreciate the freedoms we all are blessed with because of the ultimate sacrifice of these solders."], ["Reviewed September 11, 2017", 5.0, "Beautiful", "We were headed to the lighthouse but it was closed for the day so we stopped at the cemetery. What a beautiful and serene resting place for our veterans and their families."], ["Reviewed September 6, 2017", 4.0, "on the way to the lighthouse", "we were on our way to the lighthouse and passed the cemetery. we were very surprised and unaware of the cemetery. it was so amazing and surprising to see our version of arlington cemetery. To see so many headstones from veterans of many wars. to...More"], ["Reviewed September 6, 2017", 5.0, "Humbling experience", "This cemetery is the resting place of so many soldiers dating back to early wars. It is humbling to walk and read all the ranks and wars. The views of downtown san diego are incredible and the care and exactness of the headstones is impressive."], ["Reviewed September 5, 2017", 5.0, "Vist my fathers resting place.", "I always try to get by here to see my father and other family members. The views and and history of Fort Rosecrans is always with a vist."], ["Reviewed September 4, 2017", 5.0, "Arlington of the West", "This place is absolutely beautiful! Such an honor to stop by and pay respects to the men and women who have fought for our freedoms! When I was in the 5th grade, I was blessed to see Arlington Cemetery. This place reminded me so much of that. Very welll kept! You really need to see this place?\nShow less"], ["Reviewed September 3, 2017", 5.0, "Peaceful & beautiful resting place for our heroes!", "The view from these beautiful grounds is overwhelming. I believe they are all Naval veterans who are buried there. Very close to the Cabrillo National Monument which is a lovely National Park to visit also. You will pass by these memorial grounds on your way into Cabrillo You have views of the Pacific Ocean and it's just so beautiful up on that hill. It would be an honor to be resting in this beautiful place. If there IS a guided tour, I would like to take it. I'm not sure that there is.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Row after row of white headstones", "It's quite the site to see and to realize just how many people have served our country and that this is not the only Cemetary in the country like this! Thank you all for your service so that I have my freedom and safety"], ["Reviewed August 31, 2017", 4.0, "DEFINITELY VISIT IF YOU KNOW SOMEONE THERE", "The cementery is very well maintained, looks nice and easy to drive to. However, some grave sites are harder to locate than others. When you arrive look for the flag pole over a medium size building. There you can obtain a map regarding the grave site you are looking for. Unfortunatly the map is not that easy to read depending where the site is located. But with a little help and if you ask anyone that works there, you will find what you are looking for.\nDefinitely visit.\nRABBIT\nShow less"], ["Reviewed August 25, 2017", 5.0, "Beautiful Veterans Cemetery", "Fort Rosecrans Cemetery is on Point Loma. The entrance fee to enter the park is $10 per car and the ticket is good for reentry for a week. Point Loma is quite popular and on the afternoon we visited there were approximately 50 cars in line waiting to get in. On the way up to the Point you pass Fort Rosecrans Cemetery. The cemetery is in a spectacular setting, one side overlooks the Pacific Ocean and the other side has a stunning view of San Diego. The grounds are immaculate and well maintained. Definitely take a few moments on your drive up Point Loma to stop and visit.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Beautiful and peaceful", "We visited my parents grave. It is on Point Loma and is so nice. One side overlooks the Pacific Ocean and the other side overlooks San Diego, the bay and Coronado. The grounds are kept immaculate and very well maintained. Small vases are provided for flowers. The grounds keepers go around daily and remove flowers that have died, so the ones that remain are nice. They do our veterans proud.\nThis is truely a peaceful place.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Stunning", "Some of the best views of the cemetery are south of the main entrance at the pull offs along the road to Cabrillo National Monument. There are two sides of the cemetery; don't miss the views on both the bay and ocean sides. The solemnity and stunning beauty of the headstones and the vegetation make this a must see on Point Loma.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Wanted to check it out.", "This military cemetery slopes down towards the open ocean. So peaceful and beautiful well kept. And all."], ["Reviewed August 9, 2017", 5.0, "Best view for this cemetery", "What a nice place to visit as it has the best views over the ocean... thinking of all the history to this, it was worth driving through here, not much time needed through."], ["Reviewed August 8, 2017", 3.0, "Nicely groomed cemetery", "You can just drive along the main road and see the graves along the way. keep going until you reach the lighthouse at the very end ( go thru the military gate that stays open)."], ["Reviewed August 8, 2017", 5.0, "A place for reflection", "We visited this cemetery based on reviews from trip advisor. It is located adjacent to the entrance to the Cabrillo National Monument. The grounds are lovely with impressive views of the city and the coastline. A visit allows the opportunity for peaceful reflection on the sacrifices made by members of the military.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Military cemetary overlooking the water.", "Well kept with the views of Coranado and Pacific. You can sense some the history of America from the last hundred year on the grave markers."], ["Reviewed July 21, 2017", 5.0, "A Beautiful Final Resting Place", "I am always amazed at how beautiful our Veteran's cemeteries are. I am a military mom so the gratitude I have for all the men and women that have sacrificed their lives for our country, is overwhelming. Fort Rosecrans has beautiful views of downtown San Diego and the ocean. Well worth stopping by when you visit the Cabrillo National Monument.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Sobering site", "If you're driving out to the lighthouse or Cabrillo Monument you go right past it. Take the time and stop. It is a very peaceful spot and it always takes my breath away seeing all the headstones that line up in seemingly unending lines. I have visited the site many times over the years.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Trees and Shrubs", "Very humbling even after you realise that it was not just servicemen who are buried here but also family members. Is a very prominent position on Cabrillo Memorial Drive providing excellent views over San Diego"], ["Reviewed July 10, 2017", 5.0, "A peaceful place to reflect", "Coupled the review with Cabrillo National Monument as I seldom do not stop here at this peaceful place with its gorgeous views of both the Bay or Pacific. A good place to stop and reflect on our many blessings in this country."], ["Reviewed July 10, 2017", 5.0, "Great views and beautiful grounds", "Ft Rosecrans is on a peninsula on the way to the Cabrillo monument. We enjoy birding and come here often for the great views to the north and south. After a rain or on a clear day the southern vista is a phenomenal view of the San Diego Bay. At the furthest reaches one can see the reflected salt mounds in the south and sometimes even the Tijuana bullring. Great spot to get a visual \"map\" of the San Diego area. Its free and open daily. This area is Point Loma and the Cabrillo Monument (fee area) is about 500 yds away.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Didn't know was on way to Mt Cabrillo", "Another reason to visit Mt Cabrillo is seeing this cemetery. wasn't aware of it until we saw it. like getting a two for one deal going up to Mt Cabrillo. Was awe inspiring. The west coast version of Arlington national cemetery I guess."], ["Reviewed July 8, 2017", 5.0, "Overwhelming", "This is truly awe-inspiring--to see the thousands of headstones cascading down the hillsides to the bay or to the ocean on the other side. It is peaceful to stroll the paths, read the headstones, and reflect on all the sacrifices of these service people."], ["Reviewed July 2, 2017", 3.0, "If you want to vacation in a cemetery...", "We stopped there after we discovered the Cabrillo National Monument was closed. It is a very large cemetery."], ["Reviewed July 2, 2017", 5.0, "Beauty serenity and peace", "Come to visit loved ones and pay my respects. The view of san diego bay and downtown was so wonderful. This is a san diego gem."], ["Reviewed June 27, 2017", 5.0, "Beautiful!!", "Beautiful place for our veterans to rest!! Lovely to visit here whenever we are in the area. They take good care of the grounds. Wonderful scenery here by the bay and ocean."], ["Reviewed June 27, 2017", 5.0, "Always a pleasure to visit", "I have visited Fort Rosecrans Cemetery numerous time over the past 30 plus years to visit the gravesite of my father-in-law. The location of this cemetery offers one of the finest views of the City of San Diego, the harbor, Coronado Island, and the ocean. Also, one must drive by, actually through, the cemetery to visit the Cabrillo Lighthouse and the tide pools below the lighthouse. To fully appreciate the beauty of San Diego, one should visit this location.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Breath taking", "This experience was eye opening and I left with a grateful heart fro all those who have served for our county."], ["Reviewed June 10, 2017", 5.0, "A Very Beautiful yet Emotional Spot.", "This is a beautiful resting place for our fallen hero's. When you drive up the hill and suddenly see all the white crosses and headstones on the well maintained green grass its an instant realization of what Freedom really Costs."], ["Reviewed June 9, 2017", 5.0, "A must see attraction", "As well as the military cemetery it is also the entrance to Point Loma National Park. Be sure to bring your camera and leave yourself plenty of time (at least 4 hours) to enjoy the breath-taking scenery."], ["Reviewed June 8, 2017", 5.0, "Well kept, beautiful cemetery", "This spot made me feel reverant. I had just lost my brother the previous month (he was a Vietnam vet). We should always remember the sacrifices that many men and women have made for us and our freedom!"], ["Reviewed June 5, 2017", 5.0, "Best view of either the harbor or the Pacific Ocean", "Parents are laid to rest there. At their niche in the columnbarium, just turn to the right, and there in front of you is a view of NAS North Island, Coronado and Downtown San Diego. Cross the street (Cabrillo Dr.) and there is one of the best views of the Pacific Ocean any visitor can see.\nAll this while honoring our nation's veterans.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Tranquil Spot off the beaten path!", "At the request of a friend who is a Naval Veteran and was stationed in San Diego, I ventured to the lighthouse, old naval barracks and the cemetery to take photos. The views of the ocean and of downtown San Diego are spectacular from the cemetery. It is also a good place just to sit and relax and enjoy some quiet time.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Beautiful solitude", "Stopped by the Fort Rosecrans Cemetery while visiting Cabrillo National Monument. Had no idea this national cemetery was here. The grounds are stunning and the views were spectacular. Visited with a very nice lady who was visiting her husbands grave and she told us about the cemetery and its history, but the best was her telling her husbands story of his life and service to our country. Bless all those who defend our country.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Best View in San Diego", "This is an amazing, free visit. You'll immediately feel reverence for those that have served our country and be in awe of the view of Downtown San Diego, Coronado and beyond."], ["Reviewed May 30, 2017", 5.0, "What a Great Memorial !!!", "This place is such a wonderful tribute to our fallen military personal. The rows and rows markers are all so straight and perfectly lined up. This place is well cared for."], ["Reviewed May 23, 2017", 5.0, "Beautiful", "We have been to many national cemeteries. This is on par with Arlington. Very peaceful and a great tribute to our heroes. The views are terrific. Must see."], ["Reviewed May 23, 2017", 5.0, "The View", "The cemetery had an awesome view! Very reflective place that all can appreciate and right next door is a visitor center that had a spectacular view as well."], ["Reviewed May 22, 2017", 5.0, "Richard's funeral", "Very beautiful place. I was very surprised when I heard that my friend's father had passed away. Fort Rosecrans is beautiful with incredible ocean views."], ["Reviewed May 12, 2017", 5.0, "Wow!", "This is a breathtaking cemetery. Well maintained, with a tremendous amount of history, but the view and placement of stones is remarkable."], ["Reviewed May 7, 2017", 5.0, "Dignified funeral.", "I came here for a family friends funeral. Our friend had been in the Navy during the Korean War. You arrive and are lead to a memorial park area with a cover and benches.\n\nThere was a brief service by the clergy man and in the middle was the presentation of the flag and taps was played. It was a dignified serve in a beautiful setting on the end of Pt. Loma. Probably one of the most expensive pieces of real estate used for a cemetary in the country. Seeing row after row of the same white colored tombstones made me think of all the men and women who have served our country.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Veterans Cemetery on the cliffs of the Pacific Ocean", "My in-laws are both buried here. We visit the cemetery and the USS Midway every time we go out west. A truly beautiful site."], ["Reviewed May 4, 2017", 5.0, "Thank you for serving!", "Came upon this wonderful Cemetary after visiting the two lighthouses. I was giving a silent prayer to those buried here for having served to protect our country, and the honor it is to walk among them."], ["Reviewed May 3, 2017", 5.0, "Beautiful", "We stayed on Shelter Island so this was an easy drive from our hotel. We visited at sunset and it was hauntingly beautiful. I highly recommend it."], ["Reviewed April 29, 2017", 4.0, "Great Views, A Beautiful Resting Place For Those That Served Our Nation", "Fort Rosescans is a national military cemetery located near San Diego on the beautiful Point Loma peninsula. The access road for the cemetery and Cabrillo Monument run on top of the ridge that separates the Pacific and San Diego Bay sides of the cemetery. The West side offers wonderful views of the Pacific and the East side has incredible views of San Diego Bay, San Diego, and Coronado. A beautiful but solemn location for those that served our nation.\nShow less"], ["Reviewed April 23, 2017", 5.0, "Fort Rosecrans Cemetery", "This is San Diego's Arlington of the West. What a beautiful sight seeing all of the markers in their straight lines. It always makes me grateful to be an American and thankful for all who have served our country to protect us."], ["Reviewed April 23, 2017", 5.0, "Rosecrans Cemetry", "We wee really impressed with our visit here the cemetery is really beautiful and the views across San Diego were absolutely wonderful"], ["Reviewed April 22, 2017", 5.0, "An Amazing Place", "It's difficult to \"recommend\" a visit to a cemetery, but much as Arlington and Normandy it's worth a visit for so many reasons. First of all, visit to pay your respect to those whose markers now lie in perfect formation. Honor them. Visit, too, for the history. Walk and read the markers. Some as far back as the Spanish-American war. Finally visit for the views. It is right and fitting that our service people should have such an eternal vista, but that doesn't mean that we cannot share it with them. The garden runs along both the bay and the Pacific side. The bay side offers fantastic views of North Island, the sub base, Shelter Island, and the downtown skyline. I wish dogs were allowed, but for obvious reasons, they are not. Walking isn't necessary, a slow drive is also very nice.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Unexpected and Very Moving", "You pass this cemetery on the way to Point Loma and the Cabrillo Monument. As you drive along, you see the massive military cemetery overlooking all of San Diego. It was started as a burial place for those soldiers lost in the Mexican American War started to annex Texas and California in the 1840s. It is interesting to see all the headstones lined up perfectly. A wonderful reflective location. Do stop if you head out to Point Loma\nShow less"], ["Reviewed April 6, 2017", 5.0, "Breathtakingly Beautiful, but so sad!", "You can't miss this cemetery as you drive into Point Loma, as the road intersects it and on both sides of the road you side row upon row of pristine white marble markers. The numbers are staggering! It is truly beautiful and yet so very sad. The view from this hilltop cemetery is spectacular. Well worth a short stop!\nShow less"], ["Reviewed April 3, 2017", 5.0, "Unexpected and beautiful", "To preface this- we didn't do much research on our way to Cabrillo Monument and when we 'stumbled' upon the cemetery we were so taken aback! Living in Arlington, VA, this was a gorgeous sight with an impressive ocean backdrop. Loved driving around the cemetery and saw some really beautiful birds while we were there too!\nShow less"], ["Reviewed April 2, 2017", 5.0, "My favorite National Cemetery!", "I have visited National Cemeteries across the country but this one is the most impressive. Good for photography or just meditating."], ["Reviewed March 29, 2017", 5.0, "Peaceful", "My father & mother in law are both interned here so we often visit this cemetery. They've recently planted new grass and with the recent rain, the place is very green. The ocean is on the west and the harbor on the east side. Great place for photographers. Very peaceful, especially during mid day when no one is around. Very serene which provides visitors opportunity to pray and meditate.\nShow less"], ["Reviewed March 27, 2017", 5.0, "Breathtaking", "This cemetery is on the way to Cabrillo National Monument. You literally cannot miss it if you are heading that direction because the cemetery will be on both sides. One side faces the ocean while the other side faces downtown San Diego. Driving through here is breathtaking. It very much reminded me of Arlington. The grounds were immaculate.\nShow less"], ["Reviewed March 25, 2017", 5.0, "Very moving", "A beautiful sight, huge impact of the setting by the sea. Worth going to see, even if the fog rolls in."], ["Reviewed March 20, 2017", 5.0, "Humbling", "It is very humbling to see all of the grave markers and know they are for the amazing individuals who gave their lives for my freedoms. Thank you to all who have served and are currently serving in our military!"], ["Reviewed March 16, 2017", 5.0, "Stop and look !", "Don't drive by without parking your vehicle and walking through this humble area. Very interesting and thought provoking."], ["Reviewed March 16, 2017", 5.0, "Brief Stop", "I stopped briefly to view from the gates while bike riding to & from Point Loma. It seemed well kept and is a very solemn place."], ["Reviewed March 16, 2017", 4.0, "honoring", "Only had time to drive by but it is beautiful and honors well those who have been lost. It has quite the feel of Arlington National Cemetery. Very clean and well kept as any tribute to service should be."], ["Reviewed March 15, 2017", 5.0, "Respect Veterans and Enjoy the View", "This is right before the Cabrillo Monument but so much better because it's free. There are several interesting memories here. It's a quiet place to have a smoke and look at North Island, Downtown and Coranodo all at once. The other side has a great view of the ocean.\nShow less"], ["Reviewed March 13, 2017", 5.0, "So Many Lives......", "This place is absolutely breathtaking. All you can see is tombstones for miles. It's on the way to the Cabrillo National Monument, so you can check it out when you go there. It's on both sides of the road."], ["Reviewed March 13, 2017", 5.0, "car club excursion", "Historic memorial cemetary, has nice visitor center at Cabrillo National Monument, great views of bay."], ["Reviewed March 10, 2017", 5.0, "Sobering and Beautiful", "We visited on a cloudless day. The contrast of the blue sky, green grass, and white granite tombstones was stunning. National cemeteries always leave one with the feeling of sadness at the many lives which have been lost while preserving our freedom. The sunset views are amazing from here.\nShow less"], ["Reviewed March 9, 2017", 5.0, "The western Arlington!", "I would say that many people have never heard of this military cemetery. If you go to Carrillo National Monument you will drive right through this cemetery. Stop and walk around a bit. It is well cared for and the views are fantastic. Google the history and you will appreciate it more.\nShow less"], ["Reviewed March 6, 2017", 5.0, "Thank You", "This has to be one of the most striking, haunting, humbling, interesting, yet abjectly beautiful places we have ever seen! We kept our voices low out of respect when we wanted to shout the praises of all these heroes. Whether we looked to the headstones, the sea on either side, or the cremation graves, we saw only beauty and honor. This holy place was already a burial ground when the government took it over in the mid-1800's. And now, it is overflowing ~~ no new applications are being accepted. Rather a sad statement on the losses our country has incurred to ensure our safety. At the same time, i am grateful for the gift of bravery each has so graciously given to me and my family.\nShow less"], ["Reviewed March 4, 2017", 5.0, "A Humbling Experience", "We were driving to Cabrillo and happened upon the Fort arose crabs Cemetery. We stopped and walked around. It is such a beautiful peaceful place honoring our fallen heroes. It was very humbling to look around and see gravestone after gravestone of men and women who had served our country.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Parents here, lovely setting", "My parents are buried here, actually cremated and placed in a wall. We had two mini family tributes here. Mom would hate that they are near the ground. Dad was proud of this place, was a 20 year veteran in the Navy and Pearl Harbor survivor. It is such a pretty view, the grass is green again, pretty trees, beautiful view of the bay. Too bad it is full for ground burials, may be a wall spots left.\nShow less"], ["Reviewed March 2, 2017", 5.0, "A Somber and Stunning Place", "A visit to this quiet and spacious place with thousands of perfectly lined white headstones becomes an internal experience. So many wars and so many lives lost. The stones give just a glimpse into lives that are no more. I feel the emptiness. It's lonely there.\nShow less"], ["Reviewed February 20, 2017", 5.0, "Amazing views and touching tributes to our deceased veterans and their families", "Found almost at the tip of Cabrillo Point in Point Loma, Fort Rosecrans Cemetery is an amazing location with the San Diego Bay on one side and the Pacific Ocean on the other. The Cemetery itself is very well tended with beautiful landscapes stretching to bay or ocean views that are beyond description. Take some time to walk among the headstones and reflect on the lives of these veterans and their families. You will be stunned by the variety of names, home states, service histories, etc. you will find on the grave markers. Truly an emotional and beautiful place to visit in San Diego.\nShow less"], ["Reviewed February 20, 2017", 5.0, "A very, very special place!", "This is, like I said, a very special place. A beautiful location with a beautiful view. I was told it's often referred to as the Arlington of the West. A very good description."], ["Reviewed February 19, 2017", 5.0, "Stunning Burial Place", "If I could be buried there I would. I don't know that I have ever seen a more picturesque cemetery. Truly an honor to the men and women who sacrificed so much for our country."], ["Reviewed February 15, 2017", 5.0, "Breath Taking ..... An Honouring Tribute", "I could not get over how many head stones there were and in such a peaceful location, with spectacular views of the ocean and San Diego. Such manicured grounds. What an honour and tribute to those that have served their country and have gone before us.\nShow less"], ["Reviewed February 8, 2017", 5.0, "Stunning find we did not know existed", "This was an incredible find on our travels. We happened upon this and were taken away by the beauty and impressive layout. Had the rainy and chilly weather not been a factor, we could have seen ourselves spending hours walking amongst this incredible cemetery. So thankful this was created.\nShow less"], ["Reviewed February 4, 2017", 5.0, "Visiting Tim", "I went to visit my son's crypt. The view is awesome with the beautiful grave stones all in rows and the ocean and Bay. The trees are beautiful too and the grounds are well-kept. It makes me proud to be an Americaqn and thankful for all those who served our great country.\nShow less"], ["Reviewed February 2, 2017", 5.0, "Outstanding", "This is breathtaking! The views from here are fantastic. I had no idea how large an area it encompasses. You get a chill looking at row after row of headstones and realizing how many gave their lives for us! A must see"], ["Reviewed February 1, 2017", 5.0, "Best view in San Diego", "Fort Rosecrans is a historic, beautiful resting place for veterans and spouses. The view of San Diego bay and surroundings is stunning. It's a place of reverence, that still encourages visitors to honor our vets and celebrate their lives at the annual Memorial Day program. This event is very well attended by the public. Consult their website for yearly details on the ceremony. Or just stop by anytime. You will not be disappointed with the view! And you can also visit Cabrillo National Monument and the Point Loma Lighthouse nearby.\nShow less"], ["Reviewed February 1, 2017", 5.0, "peaceful", "very peaceful place. Im glad we went almost didn't make it, its a drive to get there and check the time they are open"], ["Reviewed January 31, 2017", 5.0, "In Awe", "It is something everyone should experience at least once in their life time. Just to park and walk among the thousands of headstones gives you a respect for what people have gone through. At the end of the road, you will find Point Loma lighthouse which gives you a great view of the city and Mexico.\nShow less"], ["Reviewed January 30, 2017", 5.0, "Sunset", "A really touching place to visit and the the views over the water at sunset are amazing. Really clean and respectful to the people who lay there"], ["Reviewed January 30, 2017", 5.0, "One of the best National Tributes to Those Who Have Served", "This national cemetery is one of the United States' best tributes to those individuals who have served in the military for the US. Their spirits must be very happy with the ocean view."], ["Reviewed January 29, 2017", 4.0, "Impressive large Cemetery", "Even if you are not from the Area it is a place for meditation. Many entrances on both sides of road."], ["Reviewed January 29, 2017", 5.0, "Visit to CDR Bucher", "Visited grave of USS Pueblo CO while in San Diego quiet and peaceful it was a much needed time to say thank you to a great man."], ["Reviewed January 26, 2017", 5.0, "Best Views of the City", "If you are traveling from out of town, take an hour and go up to Fort Rosecrans Cemetery. The view is stunning and offers the best view of both the ocean and the city! GREAT Picture taking opportunities."], ["Reviewed January 23, 2017", 5.0, "Beautiful", "Visited my father's grave there. This is place is awe inspring. Well worth a drive through, whether or not you have a personal connectiion."], ["Reviewed January 20, 2017", 5.0, "Field of Reverence", "I didn't think I would enjoy this location so much. It's beautiful and peaceful and well-maintained, befitting the military men and women buried here. You can walk as little or as much as you want. It is bounded by the ocean on the sides and the grave sites are on both sides of the highway. The Cabrillo National Monument down the street was closing at 5, so it was suggested that we return to Fort Rosecrans Cemetery for a good view of the sunset. It was gorgeous.\nShow less"], ["Reviewed January 18, 2017", 5.0, "Beautiful, emotional, moving", "A perfect setting to honor those who have fought to defend our country. Incredible views of San Diego."], ["Reviewed January 18, 2017", 5.0, "Beautiful Spot Along the Cliffs", "Located near Cabrillo National Monument, this is a visually stunning place. I recommend getting out of your car and walking among the grave markers. You can appreciate the history and the folks that served in the military. A small glimpse of their lives."], ["Reviewed January 17, 2017", 5.0, "Beautiful", "This cemetery is a \"must see\", especially when combined with a trip to Point Loma and the tidal pools. I don't think I have ever seen a more beautiful place to be laid at rest."], ["Reviewed January 14, 2017", 5.0, "Serene", "On the way to Cabrillo National Park;/Monument the road passes through the Fort Rosecrans Cemetery. Lined up in formation gravestones face both the bay and Pacific Ocean. For a moving experience at no cost, check out this cemetery."], ["Reviewed January 12, 2017", 5.0, "Thank a Veteran", "This is along the drive to Point Loma. It is a lovely setting for the final resting place. Thank those who have served!"], ["Reviewed January 3, 2017", 5.0, "very Humbling Place", "it is really a great place to see the sacrifices of our men that have fought and served for our country, a lot of history to learn here as well,"], ["Reviewed December 30, 2016", 5.0, "Fitting memorial", "As a Veteran I was stirred by the same feelings as when I visited Arlington, this National Cemetery is very scenic and well planned out. A truly beautiful tribute to those who have served our country!"], ["Reviewed December 28, 2016", 5.0, "Flags, breezes, peace, Bay & Ocean views, trees for shade & peaceful resting.", "This is a great place! Many interesting head stones, and now the long memorial plaques and walls. Has Harbor/Bay views as well as the Pacific Ocean views, all the way to the Coronado(Mx) islands. Peaceful place to just rest, first past relatives/friends. Bring a picnic basket and bask in the glory of views, warriors, family/friends, and peace of place. Some tree and critters. Nice place to walk b/c of slow & little traffic.\nShow less"], ["Reviewed December 27, 2016", 5.0, "Tearfully Beautiful", "One of the most beautiful cemeteries overlooking the ocean, that I have ever visited.\nI could have spent the entire day there.\nThe views of the meticulously kept grounds and remembering the sacrifices made, are good for the soul and good for our country.\n\nVery quiet and serene!\n\nWell worth the stop!!\n\nThank you all for your service !!!\nShow less"], ["Reviewed December 26, 2016", 5.0, "Respect and Admiration", "Regardless if you are or against all the wars fought. when you see this cemetery you cannot but admire and respect how a country appreciates the sacrifice of their dead soldiers. The sight is just breathtaking."], ["Reviewed December 21, 2016", 5.0, "Honor for our military", "I love visiting Fort Rosecrans. I do not have any family buried there, but they are all heroes. What an honor to walk among their grave sites, and read their names, ranks, and honors. I thank these brave men and women for their service to our nation. My son and I love to find the MOH gravesite. There is a cemetery office with a database to find the sites. We take MOH coins and place them on the grave and take photos of the gravesite. This is our tribute to them. The views from the cemetery are awesome. It is on the peninsula of land that leads to Point Loma, and to Cabrillo. You can see out over the Pacific, the islands in the ocean, Mexico, and San Diego.\nShow less"], ["Reviewed December 16, 2016", 5.0, "Impressive National Cementery", "It's a National Cemetery in a spectacular location. The street to Cabrillo National Monument splits the cemetery. On the west side you see a wonderful view of the ocean. On the east side, a breath taking view of San Diego."], ["Reviewed December 15, 2016", 4.0, "A good place to contemplate those whom have given their all for this country", "I grew up close to Ft. Rosecrans and have an uncle buried there. I often bicycled past on my way to Cabrillo National Monument. Recently I stopped by. They have added many more graves. So sad to think of so many to have died for this country, yet a beautiful place to contemplate their sacrifice. Thank you to ALL veterans especially those that gave their lives.\nShow less"], ["Reviewed December 14, 2016", 5.0, "Beautiful serenity", "Ft Rosecrans is one of the most beautiful and well maintained National Cemeteries. Walking through and reading the headstones is a lesson in American history. The location and views of the ocean, bay and city skyline is spectacular. As the property is full burials are few and reserved for those with prior commitment and a few recent KIA.\nShow less"], ["Reviewed December 11, 2016", 5.0, "Very emotional place", "There is something very emotional about seeing this cemetery ... It's location is absolutely picture perfect, under deep sky, above the deep ocean, and seeing those countless graves, those people lived different lives at different times, but they all served their country and now they are all here and the identical white gravestones are just like uniform - unites them all in their last resting place.\nShow less"], ["Reviewed December 2, 2016", 4.0, "Touching!", "These kind of cemeteries make me always so sad. Imagining all these brave people who served this country and gave their lives. Besides, the grounds are well maintained and you have good view of the San Diego skyline."], ["Reviewed December 2, 2016", 5.0, "Beautiful place", "Pretty morbid but what a great view of San Diego and the bay. Cabrillo Monument is just up the road."], ["Reviewed November 28, 2016", 5.0, "Beautiful!", "Beautiful well maintained cemetery for those who served our country to be laid to rest. Amazing views of everything down below. Very emotional looking at all of the military plaques. So glad we decided to visit."], ["Reviewed November 27, 2016", 5.0, "Humbling", "If you want to stand in awe of the sacrifices mafde by others, this is the place, every tombstone meticulously kept up and in a line, makes you reflect on those that gave so others may enjoy the freedoms that TOO MANY PEOPLE TODAY TAKE FOR GRANTED. GO HERE AND REFLECT ON WHAT YOU HAVE because of the selfless acts of these brave men and women (and young boys).\nShow less"], ["Reviewed November 24, 2016", 5.0, "Arlington for the west coast.", "being a Marine Corps veteran, i do my best to visit and pay my respects to those that have paid the ultimate price. It is something we all should do once if not often."], ["Reviewed November 18, 2016", 4.0, "Beautiful!", "A walk thru to honor those who gave the ultimate sacrifice. On the edge of a cliff overlooking the Pacific Ocean, listen and give thanks to the souls resting here.\n\nPLEASE if you bring children here, remember this is a somber place, not a place for them to run around chasing each other!!!!!! We were so disappointed to see a family letting their children do this while we were there. So disrespectful!!!!!\nShow less"], ["Reviewed November 17, 2016", 4.0, "Very impressive", "Excellent memorial to fallen heroes. Nicely kept grounds and layout make it a beautiful final resting."], ["Reviewed November 16, 2016", 5.0, "Beautiful National Cemetery", "Peaceful and in a beautiful setting, a very appropriate place to honor those who have served and made the ultimate sacrifice. A must see while I San Diego."], ["Reviewed November 15, 2016", 5.0, "a beautiful memorial site", "We go to Rosecrans every year to honor those who paid the ultimate sacrifice. Our Son's cub scouts den places flags for every Memorial day and salute each grave. A beautiful view and great secluded location."], ["Reviewed November 14, 2016", 5.0, "Veterans' Day 2016", "While cemeteries are not everyone's idea of a tourist spot, the Fort Rosecrans National Cemetery is a beautiful setting for remembering our military veterans who have passed, and literally thank them for serving our country. There are conical \"vases\" in which to leave flowers...water is located fairly close to all markers if you are visiting friends' or family markers and wish to leave a remembrance of flowers ...\n\nThe setting is simple astounding, with views of San Diego Bay and North Island Naval Air Station to the south and the Pacific Ocean and tide pools to the north...a great spot from which to see the whale migration in fall/winter (south to the Sea of Cortes) and spring (north to Alaska). And a lovely place to enjoy the peaceful quiet.\nShow less"], ["Reviewed November 13, 2016", 5.0, "How do you rate a Cemetary", "I must admit, I am pondering how to write a review for a cemetery. This in has spectacular views, and the order and dress are even more impressive considering the layout that they have to contend with (it's easy to make a straight line of flat ground, on a hilly point, not so, but they do! Stop and pay respects to all who have served and those who have given their lives for our great country\nShow less"], ["Reviewed November 12, 2016", 5.0, "Never saw a cemetery arranged like this", "After visiting at Cabrillo National Park we drove through the cemetery. The views were spectacular. The arrangement of the markers was something everyone need to see. So unusual."], ["Reviewed November 12, 2016", 5.0, "A peaceful place", "This has to be one of the nicest cemeteries, the view is beautiful and very peaceful. The Cemetary is very nicely maintained and easy to get around."], ["Reviewed November 12, 2016", 4.0, "Remembering our fallen", "On the way to Cabrillo memorial. Always sobering to see the gravestones of those who have passed. Nice place to meditate on the price of freedom"], ["Reviewed November 4, 2016", 4.0, "Impressive", "The cemetery is on the way to/from Cabrillo National Monument. It is quite impressive as the headstones seem to go one endlessly and overlook the water. Very serene and an appropriate resting place for so many."], ["Reviewed October 29, 2016", 5.0, "A final resting place for roughly 100,000 of those who gave all!", "This meticulously maintained somber cemetery contains a monument to the 800+ lives of sailors and airman who were lost in this nation's greatest naval engagement, the Battle of Leyte Gulf, on October 25, 1944. On that morning, five of the 13 ships constituting the Taffy 3 task force were lost in the successful defense of the Philippines which forced the retreat of the overwhelming Japanese naval forces. The courage and bravery of these men-in-arms altered the tide of war in favor of the United States.\nShow less"], ["Reviewed October 26, 2016", 5.0, "Place of solemn beauty.", "Quite, peaceful, beautiful cemetery. The serene setting seams like the perfect place for the poor souls to be that have been laid to rest there."], ["Reviewed October 25, 2016", 5.0, "A must stop on Point Loma", "I grew up in Point Loma and never realized the real significance of Fort Rosecrans. A few things changed that. My Uncle who served in WWII was buried there as well as a good friends mother who served in WWII. Then I discovered that Scouts placed flags on all the grave sites the Saturday before Memorial Day. As a Cub Scout and Boy Scout leader, I got our Pack and Troop involved in this moving experience. If you happen to be around that Saturday in May, make a visit. Every day is special. Whether it is raining (rarely) or beautiful sunshine, this cemetery is really special. There is a small building on the west side that has a complete list of those buried or intererred with locations. There are numerous special monuments-- USS Bennington, USS Wasp. Visit the website for a tremendous amount of information. The views from here are camera ready as well as some amazing trees. It is a solemn and historic place.\nShow less"], ["Reviewed October 24, 2016", 4.0, "As close to Arlington as you can get", "Very sobering, reminding us all of the sacrifices that our military have given the ultimate price for our freedom. The views of SanDiego bay, downtown and Coronado Island are breathtaking! Its on the way to Cabrillo Point Lighthouse."], ["Reviewed October 22, 2016", 4.0, "Solemn and Peaceful", "The drive down Point Loma along the cemetry is beautiful. There are thousands of grave markers. The cemetery is beautiful and provides a lovely resting place for our veterans and their spouses. Walking among the gravestones was very moving for us."], ["Reviewed October 17, 2016", 5.0, "Many interred Heroes", "I have visit this place on many occasions, as part of a military burial with the Patriot Guard Riders. I also have visited to enjoy the serenity and spectacular views of the City, ocean and harbor. This cemetery is the final resting place for heroes of to many wars. It is a monument that children would find impressive and provide some good conversation opportunity. You can walk or drive thru, there is no charge.\nShow less"], ["Reviewed October 17, 2016", 4.0, "Meticulous Maintenance", "We didn't actually get to stop in but we drove past and it was humbling, to say the least. The grounds are meticulously maintained and it's apparent this hallowed ground is revered. I'd strongly suggest stopping in and taking a look at some of the headstones. There is quite a bit of history here.\nShow less"], ["Reviewed October 14, 2016", 5.0, "Solemn and Understated with Powerful History", "Remember, not everyone here that is buried actually died in battle -- veterans and their spouses are laying together for eternity. However, it is poignant to see how many \"KIA\" there are, and to look and find the more famous among the everyday soldier. Nearly all wars for the last 100 years are represented here, and to walk among the impossibly white marble headstones that are beyond straight on the green grass overlooking their eternal rest over the Pacific is a memorable and sobering visit. Please go, and go respectfully and quietly.\nShow less"], ["Reviewed October 14, 2016", 5.0, "A very moving place", "I have visited Point Loma many many times and I always enjoy seeing Fort Rosecrans Cemetery. It is so peaceful and reminds me of the National Cemetery in Washington, D.C. It is just beautiful overlooking the Pacific Ocean."], ["Reviewed October 13, 2016", 5.0, "Baeutiful to America's Finest", "Fort Rosecrans straddles the access road to the Cabrillo Monument which means there are breathtaking views of San Diego from both sides of the cemetery. It is sobering to walk among the headstones and read the names, some KIA, some came home to live out their lives, but here they are forever remembered for their service in defense of our country. The information office has an interactive screen that allows visitors to search for the specific location of graves.\nShow less"], ["Reviewed October 11, 2016", 5.0, "There Are No Words", "Was headed to the Cabrillo National Monument and was completely unaware of this cemetery. It was beyond breathtaking. There are no words for the feeling I had standing amongst the heroes."], ["Reviewed October 9, 2016", 5.0, "Breathtaking.", "Beautiful and well kept, this cemetery pays tribute to those who have protected our nation. Worth a few minutes to reflect and honor those folks. For me, a \"must see\" location."], ["Reviewed October 4, 2016", 4.0, "Beautiful and peaceful", "Have seen most places in San Diego as we have been coming here for more than a decade, but hadn't seen this site. Would recommend for a great viewing point and peaceful feel. Makes you think about those that have come before us and their contributions to our country.\nShow less"], ["Reviewed October 3, 2016", 5.0, "top of the Heap", "this is a fitting end for some of the nations true Hero's ,men who gave their lives for our everyday life, a wonderful, serene and gorgeous, final spot to spend the rest of time , enjoying their deserved desserts!. May the beauty of this Cemetery and the 360 degree view be a final destination for our loved heros!!\nShow less"], ["Reviewed October 3, 2016", 5.0, "Moving moment", "Beautifully kept site which should be visited as a reminder and in respect to those who served. The views over the harbour are fabulous."], ["Reviewed October 3, 2016", 5.0, "Special.", "Thank you to all that have served, and to those that have given the ultimate price! This is a really special place for so many in San Diego. A beautiful resting place."], ["Reviewed October 1, 2016", 4.0, "Very moving to see so many headstones.", "Beautiful views in a very moving setting. Every way you turn are the white headstones. The rows are perfect"], ["Reviewed October 1, 2016", 5.0, "A beautiful and humbling experience", "There are no words for the beauty and peace experienced when visiting this cemetery, viewing the rows of military graves and reading the headstones of our navy men/women and their spouses. The main office is very helpful with maps and locating the site of specific graves.\nShow less"], ["Reviewed September 28, 2016", 5.0, "Beautiful Resting Place with Gravestones Dating Back to the Mexican American War", "This beautiful cemetery covers rolling green hills overlooking the entrance to San Diego Bay. The visitor center personnel will help you locate a specific gravestone. My husband and I had difficulty finding the gravestone we were looking for, and were approached by the assistant director of the cemetery offering to assist. He helped us locate the grave, and shared some interesting history. It is well worth a visit, especially if you have any interest in military history.\nShow less"], ["Reviewed September 28, 2016", 3.0, "On your way to Point Loma's Lighthouse", "Hey, its a cemetery, but it has FANTASTIC of the ocean and San Diego's bay and skyline. Some of the graves date back to the Spanish American war. The new ones make me sad."], ["Reviewed September 23, 2016", 4.0, "Very Touching", "A tremendous reminder of those who have served America for all of our sakes. Beautiful views of San Diego on one side and the vast Pacific on the other. It is on the way to the Point Loma Lighthouse so take a few minutes to drive through on your back to the city.\nShow less"], ["Reviewed September 21, 2016", 5.0, "Beautiful", "A very peaceful and moving place to visit. We would highly recommend a visit here if time permits. It is vast and the view over water at sunset is stunning."], ["Reviewed September 20, 2016", 4.0, "Beautiful National Cemetary", "Has the same \"feel\" as Arlington. Awesome place. Beautiful. On the way to Cabrillo Monument and lighthouse. Go right through it. Worth a stop."], ["Reviewed September 17, 2016", 5.0, "Lovely Cemetery", "Thank you to the grounds staff for making visits to this cemetery pleasurable. It is always kept clean, the grass is mowed. The only negative thing I can say is that our flowers keep getting taken."], ["Reviewed September 17, 2016", 5.0, "Gorgeous", "Way out on the point with the road down the center and the cemetery on both sides falling off to the ocean. Great views and truly the most stunning National cemetery we have ever visited."], ["Reviewed September 16, 2016", 5.0, "The most amazing view of San Diego and Coronado Island", "You might wonder, \"why anyone would visit a cemetery if they don't have a loved one there?\"...but this place is a \"must-go\" while in San Diego. The view of downtown San Diego and Coronado Island are amazing from this vantage point."], ["Reviewed September 14, 2016", 5.0, "beautiful", "Stop here to the way up or down from Cabrillo Monument. It is somber, serene, beautiful and touching. Look at some of the current and very old gravestones and imagine what some of those buried here must have gone through as veterans."], ["Reviewed September 13, 2016", 5.0, "A solemn place", "A fitting resting place for those Veterans and their spouse/family members who served for us. The Cemetary has just been completely re-sodded and all the markers re-aligned. A new what a view they have: the Pacific on one side and the Bay on the other."], ["Reviewed September 12, 2016", 4.0, "similar to arlington but better views", "Free to visit, but if you have time its great to go to cabrillo national park which is just down the road."], ["Reviewed September 11, 2016", 4.0, "60,000 uniformly shaped gravestones in neat rows on top of hill with stunning views", "We stopped here on the way up to the Cabrillo National Monument. You drive right past it and should spend 30 minutes to an hour seeing it. If the weather is bad, it is a drive through but if you have good views on a nice day, spend some time to walk between some of the rows of stones and honor the souls who rest there.\nShow less"], ["Reviewed September 11, 2016", 5.0, "A beautiful place for rememberance", "A very serene and beautiful place to spend time remembering loved ones or paying tribute to those who served our country with honor. Spectacular views of San Diego Bay and the open ocean. Take time to read some of the headstones and pay tribute."], ["Reviewed September 11, 2016", 5.0, "Veterans National Cemetery", "On the way to Point Loma. This place is the final resting place for some of our heroes. Very quite and serene. Well worth the stop!"], ["Reviewed September 10, 2016", 4.0, "Quite, serene walking area with spectacular views of San Diego and harbor", "My wife and I had planned on going out to the Cabrillo National Monument and we saw this military cemetery along the way and decided to stop and walk around. We were immediately pulled in by the place; it's rows of white headstones, the green rolling hills of grass, the windswept trees and the awesome views of the Pacific ocean on one side and the San Diego harbor and city views on the other. It's easy to start walking down the rows and to start reading the headstones and thinking about the military men and women, and their spouses, who are buried there. One thing that caught my interest was the different symbols that the military uses for different religions. I took a bunch of pictures so when I got home I could go to Google and find out what they represented. I did that and now am knowledgeable about that subject.\nShow less"], ["Reviewed September 8, 2016", 4.0, "A dramatic roadside monument", "In among the graves of family members and veterans who never were in combat are those of men and women who died bravely in wartime. The contrast between the majesty and serenity of this site and the circumstances of their deaths give pause for reflection to pacifists as well as would be warriors. When juxtaposed with a visit to Point Loma's dynamic and enduring natural landscape, further down the peninsula, the effect is all the more impressive. A sobering place.\nShow less"], ["Reviewed September 7, 2016", 5.0, "heroes last stop our priveledge to pay respect", "amazing to look at NASNI Coronado and SD and realize all the people that paid for that privilege. B/Z"], ["Reviewed August 31, 2016", 4.0, "Great stop along the way to Point Loma/Cabrillo", "We did even know about this place until we passed it on our way to Cabrillo. It is a beautiful veteran cemetery with gorgeous coastal views. There are roads winding through various parts of the cemetery so you don't even need to get out of the car if you don't want to. Definitely take the time to drive through if you are going to Loma anyway.\nShow less"], ["Reviewed August 30, 2016", 5.0, "Beautiful - Solitude and Reflection", "This is a must stop for those who are moved by and wish to demonstrate respect for the many who have served our nation and ensured freedom for her citizens and strength for her allies. Talk a long walk --- this place is beautiful and serene; a perfect place to being together the wonders of creation, the beauty of service to one another, and the self reflection that brings out truths. Or, simply stop and photograph the beauty!\nShow less"], ["Reviewed August 28, 2016", 4.0, "Worth a stop to pay your respects and give thanks", "One of the most beautiful National Cemeteries anywhere. The sheer numbers quantify the price of freedom. Worth a stop to pay your respects and give thanks to those that served."]]}}