{"General Sherman Tree": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "General Sherman Tree", "url": "/Attraction_Review-g143050-d146450-Reviews-General_Sherman_Tree-Sequoia_and_Kings_Canyon_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/08/fd/75/7e/general-sherman-tree.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1758"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 weeks ago", 5.0, "Lifechanging", "While it is a bit of a hike down to this tree, it's well worth it! You really don't realize how small you are, until you see something this massive, that has lived for so long. It really took my breath away! I highly recommend anyone that visits the surrounding area visit the General Sherman Tree! The trail to the tree is not pet friendly, so you'll want to make arrangements for your pet if you plan to enjoy this adventure!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Honored to see this giant", "Amazing beautiful huge tree; bonus: we saw a dear grazing near it. Sooo grateful to have the opportunity to see this wonderful tree!!!"], ["Reviewed 3 weeks ago", 5.0, "Family Trip", "General Sherman Tree, is a veeeryyy biggg tree, worth to see, limited parking spaces, must take a trail to go to the tree,"], ["Reviewed 4 weeks ago", 5.0, "Absolutely must see", "You know this tree is big. You've read about it. You've seen it on TV. But nothing truly prepares you for the reality. Worth the visit on its own but do walk a bit further as well and see some more of these gentle giants."], ["Reviewed 4 weeks ago", 5.0, "Impressive", "The General Sherman Tree is obviously one of the most famous ones in the park and is indeed remarkable. Just be prepared for a little queue for photos"], ["Reviewed January 14, 2018", 5.0, "A must see", "Road to the tree is very winding and curvy... got a bit nauseous. The tree is beautiful, sadly there was a lot of graffiti and carvings on the tree and several other trees as well. There was also a bit of trash... sad that people aren't respectful of the area. Bathrooms were clean. Very limited parking... we ended up parking off the road and walking a bit.\nShow less"], ["Reviewed January 8, 2018", 5.0, "MUST SEE", "Must see General Grant and General Sherman. Unable to fully describe the beauty and grandeur or this natural wonder"], ["Reviewed January 6, 2018", 5.0, "Bucket List Attraction", "When visiting Sequoia National Park, this is a must see attraction. Not only is it the largest Sequoia tree in the park, it is also the largest tree (by volume) in the world.\n\nWe went on Jan 2nd which is a busy week because kids are off school. The small parking lot was full but we lucked out and got a space. There are bathrooms right by the parking lot. There’s a small loop which is a paved path that gets to the tree. It’s about a .15 mile walk to the tree.\n\nOnce at the tree, people were organized and were in line to take a picture with the tree by the name sign. The tree is amazingly gigantic and it’s as amazing to see how big the tree branches are hundreds of feet above you.\nShow less"], ["Reviewed January 2, 2018", 4.0, "What A Drive!", "The drive to see \"the Tree\" is not for the faint of heart! The road is steep in spots and quite winding. There was also a conspicuous lack of guard rails in some areas. I believe the elevation in the area of the tree is over 7,000 feet.\n\nI am not really into seeing trees but I must say the General Sherman Tree is amazing. It is a sight to see!\n\nWhile I do not see the need to go back, I would recommend that if you are in the area, you really should make the trip to see it!\nShow less"], ["Reviewed December 31, 2017", 5.0, "Marvel of nature", "Gotta see it to believe. Long drive. 4.5 hours from Monterey. But once you see the tree up close then it's all worth it. The shuttles from parking lot can be confusing because lack of signage."], ["Reviewed December 30, 2017", 5.0, "Must See", "- Was awesome to see these magnificent, huge trees :\n- Definitely drive upto the General Sherman Tree : 2500 yrs old and 250 feet tall\n- General Sherman is about 35miles from the entry into the Sequoia national park gate\n- its 35 miles of winding but beautiful driving as long as there is no snow\n- the $30 park entrance fee per car seemed a bit steep but still worth it in the end to experience these trees\n- lots of lookouts\n- parking near General sherman can be a problem\nShow less"], ["Reviewed December 28, 2017", 5.0, "Land of the Giants", "Long, winding road up to see General Sherman Tree. The views are amazing. The trees remind you of how small you really are."], ["Reviewed December 27, 2017", 4.0, "Amazing trees unlike anywhere else in the world", "The trip inside Sequoia Natural Park is not for the faint of heart or dizzy/nausea prone drivers. It has a large number of road turns on the way in, and the same happens on the way out (obviously). However the trip is worth the driving hassle. General Sherman Tree and the surrounding park is fantastic. we were there at the end of the day. The setting sun added a beautiful glow to the bark of this ancient giant. It is the larges tree by volume mass in the world and one of the tallest and oldest sequoias alive (2300 years old). The entire surrounding park has a magic energy to it that we felt only in a few places before (Sedona, AZ, Joshua Tree Park, CA,...). Magic and definitely a recommendation to visit.\nShow less"], ["Reviewed December 19, 2017", 5.0, "That's a big trees!", "It's massive and will not disappoint. I initially couldn't find parking at the site's main lot on the Generals Highway. After circling for a few minutes a spot opened up though, and more parking lots existed at an adjacent lot about 1/4 of a mile away.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Don’t underestimate the walk", "Although the distance to walk from the main car park isn’t far it is quite steeply downhill (going in) or uphill (coming out). Fortunately shady all the way. You could drop some of your party off at the bottom car park if needed but parking there is for disabled access only. Allow at least 45 to an hour minutes to appreciate the trees at the bottom of the hill.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Didn't ever want to leave", "Photos don't even come close to showing the enormousness of these beautiful giants! We planned out our California road trip to pass through these on our way to Yosemite- and ended up staying two days instead hiking amongst the seqouias. They are mesmerizing and hypnotizing! They draw you in and both my husband and I were reluctant to leave for the next leg of our road trip. If anyone asks, though, the Giant Sequoias, especially at General Sherman park, are a must see!\nShow less"], ["Reviewed December 3, 2017", 4.0, "Awe Inspiring", "A natural wonder. I have visited this location multiple times over the years and I never get tired of seeing the General Sherman tree. Be sure to utilize the many paths in the grove and take in the view from multiple angles. It is different from each perspective and you will appreciate taking time to take it in. For those who are limited in their physical capacities it is a short walk or wheelchair ride to see this natural wonder.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Largest Sequoia", "Just a short hike down hill to view the largest sequoia. An added bonus a park ranger was here giving a talk about the sequoias. They have a handicap parking lot that is a very short easy hike for those with mobility impairments. The regular hike is easy and not very intense. Very scenic trail\nShow less"], ["Reviewed December 1, 2017", 5.0, "In love with a tree", "I have been enthralled with the General Sherman tree since first I viewed its magnificence over 50 years ago. What a beauty! This tree is huge, but soft and beautiful. I stand in awe of a 2000 year old tree that has received injury in the way of lightning strike or fire that has repaired itself in grace, glory and beauty. I hope it continues to stand for future generations to admire. It is an honor to see it and I do try to see it every few years to remind myself of what has been here for centuries.\nShow less"], ["Reviewed November 30, 2017", 5.0, "sooo big", "its so big that you have to take panorama picture from bottom to the top to catch it. Its really big and tall"], ["Reviewed November 26, 2017", 5.0, "Worlds Largest Tree!! and still GROWING", "What a wonderful feeling living in Fresno and having 3 beautiful national parks right in your back yard and most only 2 hours or less away from the front door. In Sequoia National Park is the worlds largest tree the General Sherman and still growing.\nLocated about 2 1/2 hours from the entrance of the park and right past the Museum. You have to drive past the main entrance which is reserved for handicap parking. The Main parking area is located 1/2 mile up the road and the parking lot holds about 100 cars. From there you are approx 225 ft above the valley floor where the General sits which is about the height of the tree. The tree is the largest not the tallest. So you walk down exactly 225 ft to floor it is an easy walk down to the viewing area also called the Presidents Trail where there are other large redwoods to view and photograph. The General sits dead center and is viewed from anywhere in the area.\nThe Walk back can be steep so if you have problems walking back up, have someone in your party walk back and get the car while you wait at the Handicap parking lot located right near the Tree.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Awesome!!!", "We loved our visit to Sequoia national park and the General Sherman tree did not disappoint!! Be prepared to take a lot of time to get between attractions at the park - including getting to it. It is up in the mountains with lots of winding roads and passes, so you cannot go very fast. It is a beautiful, worthwhile trip though. Lots of orange groves on the way in to the park and other great views. We also drove through clouds which made visibility very low for a good part of the day we were there. Be prepared for the elevation and to walk up and down hills on the path to the big trees. Dress in layers.\nShow less"], ["Reviewed November 16, 2017", 5.0, "The largest tree in the WORLD!", "Need I say more? Get out there and witness the largest tree in the world with your own eyes!!! Truly a remarkable landmark"], ["Reviewed November 15, 2017", 4.0, "Impressive tree", "If you're in the park and pass the parking of the path to the General Sherman tree. Stop, walk, watch and enjoy. You'll be impressed."], ["Reviewed November 14, 2017", 5.0, "Sequoia National Park is Stupendous", "I love coming up to this area. The sequoias are so incredible and I love that they are immortal! They live for thousands of years and die by falling down. I am so in awe of these beautiful trees."], ["Reviewed November 9, 2017", 5.0, "Great place to see!", "If you want to see the largest trees in the world, you’ve come to the right place. There are paths down to the General Sherman with lots of other Sequoias along the way. Visitors seemed to be very good about letting everyone take pictures of themselves in front of General Sherman. I think there was a closer entrance for handicapped visitors.\nShow less"], ["Reviewed November 6, 2017", 5.0, "He is big you can’t show pictures to appreciate the mighty Sequioa tree", "They have been there a long long time and driving from Las Vegas for 8 hours to see a tree seemed like a long time ! But it’s worth it , after a night in a hotel in three rivers it is a short drive to the entrance of the park, and then me he’ll of a drive up one of the best and beautiful views as you snake up and up the mountain. Once your up 7000 feet it’s very well sign posted to ‘General Sherman’ you have to park about half a mile and walk down to see it but the walk back up the hill is hard work ! But slowly you make it back to the car park. The General stands proud among other Sequioa’s and other trees there is also information boards giving the history about how he got his title and why he is the worlds largest tree. Just would of liked to have seen a bear in the wild whilst we were there but sadly not that day. If you go to west America you must visit these great parks !\nShow less"], ["Reviewed November 5, 2017", 4.0, "Really impressive", "Really cool looking tree, doesn't look much bigger than many others, but has plenty of character, the top part is dead and it makes him look wiser than the others.\nThe path from the car park is paved the whole way I can't remember how long but not long, it was very busy to the point that it was actually hard to walk the path, for that reason I found general grant and the surrounding grove more serene and enjoyable.\nShow less"], ["Reviewed November 4, 2017", 5.0, "One Big Tree Among Others", "The Sherman Three is an enormous old Sequoia tree located in the midst of an amazing grove of Sequoia Trees. There is a wheelchair accessible path through the Grove, although it is on a hill. This tree is well worth the short walk from the parking for people with disabled plates or from the park shuttle stop( when it is running). There are bathroom facilities at the shuttle stop. Even if you’re unable to walk around the whole grove, check this out!\nShow less"], ["Reviewed October 31, 2017", 5.0, "Beautiful", "eneral Sherman Tree – Sequoia National Park is in my opinion, one of the most beautiful places on the planet - and I'm saying this after we had been to Yosemite National Park. With only part of a day to explore, we decided to visit the General Sherman Tree, and then go on to The Congress Trail, (see separate review), which leads beautifully on from where you are, and back around for one more look at the tree. My top tip for going here is to get in early. We were there about 8 am, were one of the only ones in the car park and had to wait in an orderly queue of three people, to take a picture by ourselves in front of the tree. After we'd returned from the loop, there were several bus loads of people there, so I felt blessed to not only experience something as magical as this, but to have the stillness and peacefulness of the setting. All pictures you take cannot do this tree justice.\nShow less"], ["Reviewed October 31, 2017", 4.0, "Nice to see largest living tree", "This is the largest living tree and is a good sight to see. As mentioned by others, the hike down the paved trail is easygoing, walking back up is a workout. There are other trails that venture off from here, such as the Congress Trail which are also nice to see. Plan a couple of hours if doing the Sherman Tree and Congress Trail together.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Amazing Tree", "Anyone can intellectually understand the concept of a giant tree, but I did not appreciate the emotional impact that seeing these trees would create. As you drive or walk through the forest and encounter a sequoia towering over and dwarfing the other trees it has a definite impact. They are, quite simply, awe inspiring. The General Sherman Tree is said to be the largest living thing on the planet; according to the park information it is over 2,000 years old – not the oldest Sequoia, but the largest. It is indeed awesome when seen up close. The General Sherman tree is a couple miles south of the Lodgepole area, or roughly 20 miles from the south entrance to the park. The parking lot for the tree is a short (1/2 mile?) walk but there is a handicapped parking lot that is much closer to the tree – south from the main lot – for those in need of assistance. During our visit in mid-October this lot was empty.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Joe G", "There aren't words in my limited vocabulary to describe how insignificant these giant trees make you feel. It's amazing that the General Sherman tree is a young tree, still growing, with peers that predate Jesus."], ["Reviewed October 28, 2017", 4.0, "Must Visit", "Claimed to be oldest known Sequoia tree and may also be the biggest Largest branch is almost 7 ft in dia Close to parking place but way down could be taxing"], ["Reviewed October 25, 2017", 5.0, "Worth the Visit", "From the main parking area (non handicap parking), the General Sherman tree can be seen after a downhill hike. There are a few educational signs in the area about Sequoias. Before making the steady uphill climb back to the parking area, take extra time to hike the Congress trail. This trail winds through several clusters of Sequoias. Take time to touch a Sequoia to experience the \"spongy\" feel.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Beautiful", "Gorgeous spot, probably the most crowded area in the park. Beware of steel trail. Thanks for protecting the giants!"], ["Reviewed October 22, 2017", 5.0, "4 days in the parks", "Worth stopping and the short hike to see this big tree. Keep on driving to the end of the road and stop often to see waterfalls and many great sights."], ["Reviewed October 21, 2017", 3.0, "Long walk to this tree", "The walk from the car park down is not the shortest. The walk back up to the car park is a killer. The tree is OK. Yes it is big but we were not too impressed."], ["Reviewed October 20, 2017", 5.0, "Unbelievable", "These trees are remarkable and the General Sherman tree is king of them all. I cannot do it justice to talk about it. You just need to go and see it for yourself. One piece of advice, get there early in the morning and you will have it all to yourself. It is truly a special experience.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Take a walk and see for yourself.", "This tree which is not the biggest but by volume is makes for a good stop and see. Walk around and read the signs, enjoy the amazing nature around you."], ["Reviewed October 15, 2017", 5.0, "Wonder of the world", "We walked among the biggest Giant Tree nature has to offer with awe. Look up , way up and the wonders of our world rise above us in all their glory. Absolutely breathtaking , beautiful and an inspiring experience which made me glad to be alive .\nShow less"], ["Reviewed October 13, 2017", 5.0, "A Big Tree", "The hike to the tree was nice. A little harder on the way back but a good work out. Totally worth it. It was crowded on the hike and at the tree."], ["Reviewed October 12, 2017", 5.0, "the natural highest monument to visit", "a spot to do when visiting california , not that it is that impressive , but still wanna do the biggest tree in the whole world , picture time , and some quiet time sitting on the chair just in front of it and admiring what can be the natural highest monument :).\nShow less"], ["Reviewed October 12, 2017", 5.0, "Mind Boggling", "Hard to believe tree is that old (1,000+ years) and that big (275 feet tall) . . . largest tree in world by volume."], ["Reviewed October 10, 2017", 5.0, "A must see impressive tree", "It's a classic, so we had to go there. We went just before dusk and after a short walk, past an already impressive marking on the floor showing its size, you end up at the base of the giant tree. Simply put: it's really big. Others around it are also big, but they aren't General Sherman.\nShow less"], ["Reviewed October 10, 2017", 4.0, "World's Largest Tree", "We enjoyed our visit to Sequoia National Park. Lots of twists and turns on road to get there so if you are afraid of heights you will be nervous driving. The highlight is the General Sherman Tree- world's largest by volume. Lots of other big trees too. Definitely worth the time to drive through the park.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Amazing", "To think that this is the largest tree in the world is amazing but the age is just as amazing. When ppl stand around the tree, there's a quiet because they're in awe. It's usually not crowded so you can take your time and be sure to bring your camera.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Worlds Largest Living Thing", "This gigantic and massive tree is so immense that you can not imagine it. You need to see it in person. And then you might notice that it is really very close in size to many other of these gigantic trees. You really should go if you have the chance.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Massive", "As I stood in awe of the massive tree standing before me, I realized just how small we really are in comparison. Another check off on my bucket list!"], ["Reviewed October 8, 2017", 5.0, "iconic", "The park has succeeded in making it not feel too crowded. You have to walk awhile, including an ascent on return, but well worth it. It is the largest living thing on Earth. How can you turn down a chance to see it?"], ["Reviewed October 7, 2017", 5.0, "California 2017", "I would recommend seeing the tree when a ranger talk is scheduled. We did, the ranger gave us so much information about the park , the trees and history. She passed out seeds of the tree and it was impressive how such a small seed can grow to such a massive tree. She also passed around a piece of wood from a Sequoia tree , surprising how light it was.\nFrom the top parking lot it was all down hill but a good climb up the stairs to return.\nThey have a handicap parking at the bottom.\nShow less"], ["Reviewed October 6, 2017", 4.0, "Giantness!!", "It's amazing what nature has to offer us, and we know so little about all the great things around us. However, that's now the case with Gen.Sherman tree. It is the largest tree in the world by volume and it makes you feel like a tiny spec. We visited on the 4th July weekend so there was a line for taking pictures with the tree. But, the path is pretty good and can be accessed by disabled as well. One must definitely take a look at this magnificence before returning back.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Quite a tree to behold", "The area around this tree and the tree itself are just amazing. There is a beautiful trail that leads to the main focus--the General Sherman Tree. They have a nice sign that you can stand by to get your picture and you can walk all around the tree and see just how massive it is. Nearby trees are just as magnificent and worth a long walk around. Thre is nearby handicapped parking or a short walk for non-handicapped people to the General. Check out the signs nearby and take in the views and piney fresh goodness of this area.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Must visit this park", "Great place to spend few days, walking thru the forest from sunrise to dusk. Lot of trails to take. General Sherman Tree is very impressive, you should take the time to admire from all angles."], ["Reviewed October 4, 2017", 4.0, "General Sherman", "Enjoyed the beautiful woods. Very nice walk, but take water and wear comfortable shoes. Be aware that high elevation could be an issue. The General Sherman tree was well worth the walk. So impressive and beautiful."], ["Reviewed October 4, 2017", 5.0, "Majestic", "It's an easy walk down from the main parking lot to the Sherman tree. It's not difficult going back up, just take your time while enjoying the sights. We saw a small bear busy foraging near the Sherman tree. The General Sherman and the other giant sequoias there are a sight to behold. After viewing the General Sherman, do continue on an easy hike on the Congress trail, right into the heart of the giant forest, where you can take your time walking among the massive trees and appreciate their beauty and majesty. We saw a group of deers prancing around in the woods there.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Not as busy as General Grant", "As we arrived via 198E and left via 180, we were surprised to discover that General Sherman tree's location did not have the long queue of people who wanted to take their pictures. In fact there were almost no people, as if location is 'darker' and busier with lots of trees.\n\nEqually is a majestic sight.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Amazing Work of Nature", "The walk to get to the General Sherman Tree is downhill (therefore uphill to come back) but very much worth it. It is not a hazardous walk, and we even got the added reward of a little black bear walking around digging up bugs and not bothering anyone in an area very near the tree.\nShow less"], ["Reviewed October 1, 2017", 4.0, "Day out", "General Sherman is fantastic but there were loads of people around so difficult to take photos. However, very glad I saw this magnificent old tree."], ["Reviewed October 1, 2017", 5.0, "Worth Every Step", "At first, walking half a mile downhill knowing you have to walk back up is intimidating when you are at 7000 feet. If you question whether it is worth it or not, I can tell you it is. This tree is beautiful and majestic. We were humbled walking around it. The walk back isn't bad if you pace yourself.\nShow less"], ["Reviewed September 30, 2017", 4.0, "Crowded", "Parking was very difficult, then it's an easy walk down to the tree. Once we got there, we found a huge crowd in front of the tree. We were able to find a clear spot further up the path to get some pictures and then moved on to Congress Loop. The walk back up wasn't too bad. I would look elsewhere in the park if you want to see many sequoias and avoid the crowds.\nShow less"], ["Reviewed September 26, 2017", 4.0, "fantastic but beware of the downward upward walk to visit it", "the trees are magnificient. definitely worth visiting.\nthe downside is that if youbdont have an handicap sticker, you are forçed to park up the hill and walk down to see the trees. beware, when you come back, the slope is so steep and long, you can hardly make it if you have health problems even tjough there are benches to rest on the path down there. i would not recommend that downward trail to general sherman for elderly people or overweight people or people with arthrosis.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Visit for a minute but spend your time at Grant's Grove", "Of course the tree was amazing and beautiful, and yes, the walk back from the tree was entirely uphill, steep, and challenging. The reason why I gave this attraction a 4 and not a 5 was that the area was very crowded and, unfortunately, many of the people were complaining about the trail being steep and arduous. Instead of being a serene place, it was crowded so we didn't stay long. Although it is definitely important to see the biggest tree on earth, plan to spend your time in Grant's Grove, where you can see the second largest tree (which looks about the same size), it is much more interactive for kids, and was significantly less crowded. I have reviewed Grant's Grove as well.\nShow less"], ["Reviewed September 25, 2017", 5.0, "WOW!!!", "Age! Mass! Height! Beauty! Worth the walk down the trail. Not easily accessible with strollers, walkers, etc, but I believe there is a special parking area with easier access for the handicapped."], ["Reviewed September 23, 2017", 5.0, "Huge and hard to photograph", "This tree is huge ! Let me strongly recommend that you get close to it so you can get the full perspective; from a farther place on the trail at a distance it does not look as big as it does up close. It is beautiful but I am not sure how you photograph it.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Amazing", "Hiked to General Sherman from Lodgepole campground. It's worth it. This tree is so big it's beyond belief! The paved path down to the tree once you get to the area is steep and very strenuous for many people as they hike back up to the parking lot. If you have any health issues you may want to be dropped off at the handicap lot which allows a gentle stroll to the tree.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Lovely grove of trees", "This is a lovely grove of trees, and General Sherman is pretty impressive but so are many of the others.\nWe were there yesterday and the summer shuttle was already no longer running meaning this walk would be pretty difficult for anyone with joint issues or mobility problems. The walk in is downhill and with several lots of steps all the way in to the grove but you then have to trog all the way back up again, and it's quite a long way. If you're out of summer season and couldn't manage this I would recommend instead the General Grant trail as it is short, easy and pretty flat.\nThere are lots of interesting info boards as you go around, including markers on the side of the path letting you know the equivalent height of tree you have walked.\nThere's great photo opportunities although Sherman is so huge it's pretty hard to get a feel for perspective unless someone stands in front of it, and then of course the whole tree won't fit unless you have a wide angle lens. To give you some idea it's so big around the bottom that it would take 20 people holding hands to encircle it!\nAt the bottom you can do an additional trail called the congress trail which goes past several named Sequoias.\nAs long as you can manage from a mobility perspective I would recommend this as a must see sight for your time in Kings/Sequoia. If mobility is an issue then do Gen Grant instead.\nShow less"], ["Reviewed September 19, 2017", 5.0, "2700 year old tree", "How could you not have the utmost respect for those a park? It is home to the largest (by volume) tree in the world and it is 2700 years old. Such an interesting place, accessible for disabled visitors, a must see for anyone visiting sequoia."], ["Reviewed September 19, 2017", 5.0, "Cool", "We enjoyed checking out this huge tree. It's really something to see. We also did the Congress hike that starts here. Too bad the walk back to the parking lot from Sherman is a killer! Very steep and not many resting benches."], ["Reviewed September 18, 2017", 5.0, "Hard to believe it is real", "Worth the walk, but be advised that the return trip is uphill. At least there are benches along the way. Go early to avoid crowds."], ["Reviewed September 14, 2017", 5.0, "Just had to do it", "One in my group could not make the walk down from the regular parking area. Remember to take your handicap car tag with you, as there is a handicap parking area close to the tree. We saw a fawn on the walk down, along with plenty of people! Yes, there was a line to take photos, but everyone was polite and quick. This park is so amazing in spots, that we spent much more time than we thought.\nShow less"], ["Reviewed September 14, 2017", 4.0, "General Sherman Sequoia", "This is the largest Sequoia in the world ....next to General Grant which is the second largest, also found in the Sequoia National Park.\n\nThe trees are colossal and we can barely see the tops. Some have lichen on them and generally they grow in clumps.\n\nThe General Sherman Sequoia made us look like midgets when we stood in front of it. Really felt fabulous in the forest with these awesome trees. Only wished we had spotted Bears!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Huge trees!", "Very large and very old tree! This tree is near the beginning of the Congress trail so it is very easy to get to."], ["Reviewed September 11, 2017", 5.0, "Tourist Tree", "Sherman attracts a ton of visitors so during prime time be prepared to wait for a picture. Ansel Adams with the cell phone who doesn't know how to take a picture will surely be in front of you. That aside you have to see it with your own eyes to believe it. It is one huge tree. On warm days bring water with you and take the Congress Trail too.\nShow less"], ["Reviewed September 10, 2017", 4.0, "Largest tree on earth, along with large crowds.", "There were about 35 or 40 people standing in line to get their picture taken in fron of this tree, and many of them took 15-20 minutes either setting up their camera's on tri pods, or swapping multiple family or friends, while everyone else waited. Too much of a hassle. We just took pics from the other side of the tree, there was no one there.\nShow less"], ["Reviewed September 9, 2017", 5.0, "World's Largest Tree", "The General Sherman is showing its age. The top has died and it's not a pretty as some of the other big tree, but it's still the biggest tree (by volume) in the world. The trunk has a huge girth. Go early and beat the crowds. From the trailhead, you have to walk down & back up .4 miles at 7000 feet altitude. There is a handicap parking lot closer to the tree, but you must have handicap plates or placard to park there. The shuttle buses weren't running after Labor Day, so there is no shuttle to the handicap parking for a shorter hike. However, if you are in the park, you gotta see this tree!\nShow less"], ["Reviewed September 7, 2017", 5.0, "Can't comprehend how big this is", "This is the largest, oldest tree in the world. I still can't comprehend how massive this thing is. There is a fence that rings the entire base of the tree with signs up telling visitors not to cross it. PLEASE DON'T CROSS THE FENCE. The sequoia trees have a very shallow root system which is surprising given their size. They don't anchor deep so walking on the grounds around the tree will lead to its death. Take lots of pictures and enjoy!\nShow less"], ["Reviewed September 7, 2017", 5.0, "Have you seen this tree? Its ginormous!", "Awesome and amazing tree. Go EARLY in the morning. I went at about 7:30AM and was one of about 20 other people on the trail and it was great. It is quite steep, but if you have health issues you can take a shuttle back up, or else there is disabled parking at the base. As a courtesy, please do not park on the road. It is dangerous for everyone.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Magnificent", "A humbling and unique experience walking by its side. The girth of the stem is huge and the tree is gigantic. You can learn a thing or two from its resilience."], ["Reviewed September 6, 2017", 3.0, "Yes it's big but tway too crowded", "Fun to see but we went to see The George Bush sequoia and we were all alone. There are other places in the area where you can see very huge trees but do it in a more calm setting."], ["Reviewed September 6, 2017", 3.0, "It was ok, but not the best thing to see", "We did this tour, and it's a big tree, but because it's so touristy it didn't feel that spectacular to me. There are so many other things there to check out that are way better."], ["Reviewed September 5, 2017", 5.0, "Huge!", "The world's largest tree (by trunk volume rather than height) and it's worth seeing.\n\nIt has its own car park (separate parking facilities for blue badge holders available) although you could take the free shuttle from the giant tree museum (about 3-4 miles away).\n\nFrom the car park, you have a short walk (c0.5mile) although it is downhill there / uphill back. Generally ok, but steep in places. There is a bench half way as it appeared hard work for the less able, particularly as the air is thinner at the high altitude. Definitely worth the effort.\n\nThe tree is fenced off for its protection, but still a great photo opportunity.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Loved it", "These trees are just amazing. You have to see them. Hard to even believe how big they are. Easy to take the shuttle to the attractions"], ["Reviewed September 3, 2017", 5.0, "Incredible!!!", "I have always wanted to see this since I was a child(55 yrs ago) and it was everything and more than what I expected. Well worth the walk."], ["Reviewed September 3, 2017", 5.0, "Worth the visit to see the largest living thing", "The short walk from the parking lot to the see the General Sherman Tree was crowded but enjoyable. The tree itself was impressively large, being the largest living thing in the universe, as far as we know. It was definitely a great site to visit."], ["Reviewed September 2, 2017", 5.0, "Beautiful day", "Had amazing and exciting adventure. Park is very clean and everything is organized so well (maps, shuttle buses, rangers) we had great time and definitely want to come back again some day."], ["Reviewed August 28, 2017", 5.0, "Family Trip 2017", "Ok so I'm not a huge nature person but this is a must see sight! It is incredible how humongous this tree is! I was traveling with a small child and I took the path instead of the bus down to the tree and the walk is nice but not really stroller friendly, there are a bunch of steps and so if you have stroller age kids take the complementary bus to and from the parking lot! It's totally free and worth it! It was a really neat sight!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Unbelievable", "It is truly a huge tree. You can't really understand how big it is until you see it. Amazing!! We went after lunch and there was a ton of people there. Wish we had gone earlier in the day."], ["Reviewed August 28, 2017", 3.0, "Not so bih", "Yes it is pretty impressive but if you just walk half a mile or so along the Congress Trail you see just as impressive sequoias and you can go up to them."], ["Reviewed August 28, 2017", 5.0, "Giant", "General Sherman Tree is an icon of Sequoia National Park. A nice walk since the car park between huge sequoias allows to get to this spectacular tree."], ["Reviewed August 27, 2017", 5.0, "Must see!", "General Sherman is the largest tree in the world! We got to the tree around 11AM and there were not many people there. We returned at 1PM and it was crowded.\n\nThe free shuttle drops off and picks up at two locations within walking distance to the tree.\n\nFree ranger talks are available at the tree. We had Erin and she was great! She gave us so many facts about the sequoias and answered all the questions we had.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Giant tree!", "One of the top attractions with in the Sequoia National Park. It is a good 25mnts. trail walk down to the foot of the tree from the parking lot. The trail will have people traffic but no big deal..keep going down and take a great picture in front of a great tree!\nShow less"], ["Reviewed August 23, 2017", 5.0, "Amazing, amazing, amazing", "2,200 year old tree, worth to go see it. Wheelchair friendly area, paved walkway down. 7000 feet up, air is thin."], ["Reviewed August 22, 2017", 4.0, "An icon worth experiencing, but try to avoid the crowds.", "Yes, visiting the General Sherman tree is a must if visiting Sequoia National Park; pictures simply do no justice to the awesome presence of this sentinel. However, I strongly urge visitors to come very early in the morning to avoid the crowds that will soon be choking Sequoia's winding roads and distracting from the surreal and humbling experience of being in the middle of Giant Forest. The General Sherman is one of many natural wonders in the magnificent Sequoia National Park, and I recommend visitors take the time to get lost (figuratively not literally) in Giant Forest, or head north to Kings Canyon National Park where there's much less tourists but the sites are equally as stunning. Though it seldom gets the press of General Sherman, the General Grant tree in Grant Grove is (in my humble opinion) a more enjoyable experience especially for the lack of so many people and distractions.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Crowded but still impressive", "A short 0.5 mile downhill paved walk from the shuttle stop. Crowded but still an impressive site. We carried on and did the Congress trail about 2 miles less busy and still see lots of other sequoias. Lovely and shaded. Bit if an uphill walk back to the shuttle stop. Less crowded the earlier you go. Use the shuttle buses as car parks get full quickly.\nShow less"], ["Reviewed August 19, 2017", 4.0, "Crowded - best keep going on the Congress trail", "Sherman tree is one of the major sights in Sequoia so the place gets crowded unless you go very early or late. The parking lot is huge so parking not be a problem - just a question distance from car to trailhead. The trail going down to the Sherman tree is wide and paved, a short easy walk but a bit steep - not a problem going down but remember you have to come back the same way (there does seem to be a shuttle back to the parking lot which we didn't use so not sure how well it worked).\n\nJust about all the trees in the base section around the Sherman tree are fenced off so you can't get close to them. To get a better feel for the magnitude and magnificence of the surrounding forest (and to escape from the crowds) it's well worth continuing the hike on the Congress Trail (so named for the two Sequoia groves further on, one is \"congress\", and one \"senate\"), a two mile easy-side-of-moderate loop, parts of it laid out in switchbacks - so there is uphill but not strenuous. You'll pass tons of trees similar to the fenced off ones down below except on this trail you can get close to them and have a fun time exploring the enormous roots and burnt out tree holes. The trail gets a moderate amount of traffic - you'll never be alone for long - but by far less crowded than the paved section. Star rating for the congress trail will be 5.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Fantastic - but do see some more", "The General Sherman Tree is of course stunning, but don't think you've been there if you do not take time to see a lot more of the forrest and the other giants."], ["Reviewed August 17, 2017", 5.0, "Awesome", "It is very impressive to view tress that are thousands of years old, survived many forest fires and have an appearance unlike any other on earth. There is little to say other than \"Wow\". Easy walk. Good parking. Good for a family as well."], ["Reviewed August 17, 2017", 4.0, "More of a tourist trail", "Yes, it's neat to say you've been to the biggest tree in the world. But this trail is extremely crowded as such. And unless you're handicapped, the trail down from the main parking lot is a bit of a hike. Parking is a problem if you come later than 10:00ish also.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Loved it!", "It was simply beautiful and educational for my children 6 year old and 14 year old. Spectacular location for pictures."], ["Reviewed August 14, 2017", 5.0, "A must see but go real early to avoid the crowds or you will wait!", "The tree is so popular that there are lines to take a photo in front of it. Be sure you are a good walker as it is a good hike down and back up. There are real nice trails in the area so don't miss taking a hike into the woods to see big trees up close. It gets so crowded that they have to bus people to the area but if you go real early or very late you can park.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Magnificent, but don't expect to hop out of the car, Take a picture and drive off again!", "Visited mid morning on a Saturday - we didn't have any choice given our itinerary but it was super busy. We had to park in the most distant car park and take a shuttle bus. The tree is awesome, and we'll worth the visit but best avoided at weekends.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Worth the trek back up :-)", "Loved seeing the oldest living tree in the country! There's a wide smooth asphalt path to the General Sherman, but it's probably a 1/2 mile and fairly steep grade. Not recommended if you have bad knees. Even if you don't, be prepared for altitude and grade to hit you on the way back up.\nShow less"], ["Reviewed August 11, 2017", 5.0, "A must see", "A beautiful tree and worth the hike. There is also an ADA entrance and a shuttle bus. The parking lot is large but it fills up. There is a ranger talk but it is mostly about the sequoia trees in general rather that the General Sherman tree. The walk down is wide and paved. Lots of stairs. It is also where you could do the Congress walk. Plan on large crowds and about 15 minutes from the parking lot to the tree.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Huuge !", "The drive up to the tree is full of views and twists and turns. The General Sherman tree is huge ! The trails around the grove are nicely kept and clean. Would highly recommend making the trip."], ["Reviewed August 9, 2017", 5.0, "AMAZING", "Worth the stop! It's a great .4 mile hike down to this spectacular work of nature, but when you're down, be prepared for the return trek up. It's not bad, but it is a .4 mile back up. NOTE: for those who have a handicap permit, there is a special parking lot that that uses a much more friendly trail.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Nice Trail", "This is the biggie must see in Sequoia NP - an incredibly large and ancient tree that dwarfs everything around it. The hike down is easy - just remember what goes down must hike back up! Trail has an elevation drop and gain of about 300 feet in less than 1/2 mile.\n\nWe combined this hike with the Congress Trail - which while not as spectacular as the General Sherman Tree was equally magnificent in its quantity and diversity of sights.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Natural beauty beyond words", "Natural beauty beyond words. Take it all in and be in awe of the size. Informative plaques help too."], ["Reviewed August 9, 2017", 5.0, "Awesome!", "This tree is currently the largest known (by mass), living tree on planet earth. It is truly nothing short of spectacular. Nearly as impressive is the hour long, winding drive from the park entrance to reach the tree. Go at dusk to see the occasional large tarantula cross the road in front of your car as you make your way. The woody smell in the forest is divine, as long as you're not an asthmatic sensitive to pollens. If you are, be sure to take Ventolin with you. It's a long way to the nearest pharmacy.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Wow", "There are several sequoia's in the grove along the trail walking down to General Sherman. The trail is semi-steep, but paved and meanders down to the base of General Sherman, then you can take the free tram back to your car if you don't want to hike back up. There's a cool spot along the trail that has the footprint of the tree marked out in bricks. There are railings along the trail to keep people away from walking up to the trees, erosion is the biggest threat to the big trees because of their shallow root systems (in relation to their height). Please respect the railings and stay back. You still get amazing pictures.\nShow less"], ["Reviewed August 7, 2017", 5.0, "It keeps growing and growing and growing. . .", "A must stop even if there are too many people around. . . General Sherman Tree is Impressive no matter which direction you look at it!"], ["Reviewed August 2, 2017", 5.0, "Amazing!!", "We hiked down to the tree with our 6 year old and 3 year old. The length of the hike is great for young kids. It's steep on the way back up but there are plenty of places to stop and rest if you need to. Bring lots of water. Lots of great views and amazing things to see. The trees are out of this world. Really not to be missed, there is nothing like it. There were a few signs around with info and history as well as park rangers to help with questions.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Slightly disappointing", "It's the biggest tree by volume in the world but somehow it didn't seem quite that big. The thing about sequoias is how thick the trunk is high up, but there are other trees which are considerably taller or thicker round the base and which are more impressive as a result. In fact, some of the other trees round about General Sherman are either taller or look taller because they start higher up the slope. The result is that the General does not really dominate the scene.\n\nDon't get me wrong, it is the biggest tree in the world, it is impressive and worth seeing but for us it lacked the wow factor.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Huge!", "You cannot miss this incredible tree! It is one of the tallest trees in the world and an ancient one in the Sequoia National Park. Highly recommended!"], ["Reviewed July 28, 2017", 5.0, "Wow", "Go go go! No need to stand I. Line to get a picture. Just go to another side. Definitely do the hike to all the other trees. Really take in the beauty. Bring water."], ["Reviewed July 28, 2017", 2.0, "I didnt make it ...", "We parked at the sequoia museum, and asked direction to the sherman tree. They gave us a map, and showed us the way.... The trail is extremely badly indicated, just a sign every 10-15 minutes walk.... At a certain stage the sign was sending us to cross a water point; we tried to go around it, but ended up in nowhere zone with no indications around. Extremely disappointed\nShow less"], ["Reviewed July 26, 2017", 5.0, "Biggest Tree!", "Based on overall volume, this tree is considered the largest in the world. (Likely also one of the oldest.) Hike down is the same drop in elevation as the height of the tree. Trail down is .5 mile, same distance and elevation back up. Trail starts at 8,000 plus elevation in case wall back up at elevation is an issue. Wonderful grove of sequoias.\nShow less"], ["Reviewed July 26, 2017", 5.0, "One of those things to see", "In the Sequoia NP side of the park there was not that many stops as I expected. This side of the park is definitely the more beautiful side to see. Driving slowly and walking among the giant sequoias is a must do. General Sherman tree as you know is the largest tree so its a must stop. But don't stop here - there are trails all around the area to see lots of trees to see.\n\nWe were there on Saturday in July so the crowds were out. Lines just to take a photo of you and the tree. We took pictures of the tree with us just 10 feet away - only difference is you do not get the sign with you in the photo. (I did get a photo between people). We had to park in a distant lot and use the shuttles to get to the visitor center, museum and trees with walking paths.\n\nThe one thing that really irks me is all the foreigners that do not respect the signs and with no rangers on site, idiots were constantly jumping the ropes and even picking at the trees!! I was tired of playing cop and telling people to stop! and not touch the tree and stay behind the ropes.\n\nA photo tip if you didn't know - do a panoramic photo of the trees holding the IPhone sideways and keep the arrow on the line and follow the line on the panoramic photo from the ground to the top of the tree(s). A steady hand a good lighting make for a great photo!\n\nPlease respect our National Parks and stay on the trail and do not touch !!\nShow less"], ["Reviewed July 26, 2017", 5.0, "Such a big tree", "This tree is just massive. Interesting reading about how it is growing rounder because the top is dead. Got our picture in front of it with the sign. So hard to imagine how old it is."], ["Reviewed July 23, 2017", 4.0, "A MUST see", "If you are going to Sequoia, you need to see General Sherman Tree. We were very lucky that the park was not crowded when we were there. We were still on East Coast Time so we got up early in the morning (6:00am) & went down to see the tree before it became crowded. There was NO ONE else around! We could walk around, explore & take plenty of pictures.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Breathtaking, spiritual journey back in time", "Call me a tree hugger - it's fine. There is no mistaking the regal beauty of this national treasure called the sequoias. What a majestic sight and truly spiritual experience walking among these sentient beings. Dating back greater than a thousand years before Jesus - yes you read that correctly. Over 3000 years old. Think about that for a moment. Living beings that have weathered how many storms, fires, natural disasters, humans - the list goes on. Being here is truly an unmatched experience. I cannot say enough about this place. Definitely worth the curvy trek up the hill to get here. I would personally not drive a motorhome but I saw others do it and they must have nerves of steel with the passengers hiding in the back with their eyes closed. Definitely a harrowing ride at some points if you aren't mentally prepared. Although a bit scary the roads are safe. Please take heed of the signs posted like icy road - yes it can be icy in 90 degree weather in June folks. Also when it says to down shift - do it. I saw a few people with their brakes smoking. Just use common sense and be aware of your surroundings. Make this a must see attraction the next time you are anywhere in Northern California. I pains me to hear how many locals have never been to this wonderful place.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Interesting", "It was interesting to see this large tree and all the trees around it. We went first thing in the morning and had no trouble parking. (We tried to go back later in the afternoon and the parking lot was full.) Walk down the paved trail to the tree. There is a parking lot right on the Generals Hwy, but it is only for people with a handicap sticker. Take your time coming back up the trail. It is all uphill coming back from the tree to the parking lot.\nShow less"], ["Reviewed July 21, 2017", 5.0, "amazing tree", "we couldn't believe the sheer size of this and neighbouring trees. The vast grandeur of nature was seen on this visit. Don't miss out, go and see them."], ["Reviewed July 20, 2017", 5.0, "Must See", "You cannot go to Sequoia National Park without stopping to see this tree. On the trail you walk through a downed giant sequoia tree which is huge. But the General Sherman is the biggest. Make sure to get pictures from a distance because it is so tall close up those pictures will not do it justice as you cannot capture the whole tree.\nShow less"], ["Reviewed July 19, 2017", 5.0, "My daughter's dream", "She is a fan of General William Sherman and she couldn't wait to see the tree with his name. She was not disappointed. Nor were the rest of us. A beautiful path leads to this magnificent tree. But don't stop there. Walk the trail and go by the Congress and Senate trees, the McKinley tree, the President tree. Not too many people, gorgeous trees, quiet and the smell is so fantastic. The sequoias are not to be missed.\nShow less"], ["Reviewed July 18, 2017", 4.0, "Now That's a Big Tree", "There are a lot of sites to visit while you are in the Sequoia and Kings Canyon National Park, but this is one of the top attractions in the park. Don't forget to visit, Tunnel Rock, Tunnel Log, Moro Rock and Grant Grove. All of these round out a long day in park.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Largest Tree in the World", "General Sherman is the largest known single tree in the world when measured by volume. It is fenced of so that the roots don't get trampled around the base. Even staffing back away from it you still can't get the whole tree in a photo without switching to panoramic mode. It has a height of 275' and a circumference of 103' at the base. It has a paved path leading to it from either of two shuttle stops. There are also numerous trails that connect nearby including the Congress Trail. Don't miss this giant. This is what you came here to see!\nShow less"], ["Reviewed July 17, 2017", 5.0, "A salute to General Sherman", "Our little boy said: a huge tree & a must see!! There simply are no words to describe this experience, we truly felt humbled & privileged to see the old tree. The trail was easy & offered 360 views."], ["Reviewed July 16, 2017", 5.0, "Family trip with adults", "Give yourself plenty of time, we went at dusk and ended our mile hike out in the dark, kinda scary for a city girl... I'm laughing now"], ["Reviewed July 15, 2017", 5.0, "Salute the Earth's Largest!", "Largest tree by volume in the world. Pretty cool to see. Apparently has stopped growing taller but continues to grow in girth. Easy walk on paved surface to viewing area and then down around base of tree as well."], ["Reviewed July 14, 2017", 5.0, "immense!!", "Although it got crowded in the area, we were glad that we stopped. Pictures do not do justice to the size and scale of these giant trees. General Sherman is majestic and awe-inspiring!"], ["Reviewed July 14, 2017", 5.0, "Very Impressive", "Great experience to meet the giant of this world, easy accessible for everyone and nice trails around the tree to see other giants as well."], ["Reviewed July 12, 2017", 5.0, "Really Big Tree :)", "We all enjoyed seeing the biggest living thing in the world. We did have to wait in a long line for a picture. A group several families in front of us seemed to have an entire photo session during their turn at the tree which took about 10 minutes. The trail is shorter and on sidewalks which I was not expecting. We took the shuttle from the parking lot.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Must See", "Easy walk with minor elevation change. First bus stop coming from the museum is closest to the tree, but the trail is uphill. Second stop, in the parking lot, is farther to walk, about half mile, but is downhill with some steps. If you want it all downhill, get off at the second bus stop and back on at the first. The trail loops around the grove. There are other big trees to see and a cut tree showing how they can determine the age of the tree.. I found it interesting that this is neither the tallest tree nor the widest, but is the largest by volume.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Humbling", "As we drove through the park I truly felt small. Walking the trail to the largest tree on Earth I was overcome with history. It was awesome to be surrounded by thousand year old trees."], ["Reviewed July 11, 2017", 5.0, "A tree worth driving for", "We visited General Sherman Tree in May and were a bit surprised to find out that it was snowing when we reached the parking lot. We weren't the only ones changing our gear there though.\n\nIt's around 10 minutes walk to the tree from the parking lot during which you see many other giant sequoias, including the twins that you really should check out. The around 2500 years old & world's biggest tree is really something to see but so is the whole area in general. Hence, go there if you have the chance.\n\nWe were driving from Lone Pine to Oakhurst (Yosemite) and visiting this tree added 4 extra hours to our trip (including 4 sight stops)\nShow less"], ["Reviewed July 10, 2017", 4.0, "It's big!", "For those who walked down the steepish descent to The General from the top car park, fear not - if you don't feel like hauling yourself back up the paved trail, there is an air-conditioned bus, which as part of it's Museum/Gen. Sherman/parking lot LOOP route, deliver you back - suitable chilled and refreshed to your car. Yay! and then you can do it all over again!\nWe saw, on our June '17 trip a family which sort great pleasure in rushing down the tree-lined slopes, vaulting fences, near-missing ordered walkers to get to the General, ride the bus back up, only to repeat said action. Guess they didn't care much for people, the trees or soil erosion.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Vacation", "Beautiful. Highly recommended you use the bus system in the park it's free and you don't have to wait very long."], ["Reviewed July 9, 2017", 4.0, "Taller than the Space Shuttle Launch Vehicle!", "The greatest, and most massive living object on Earth. The superstar sequoia tree in the center of Sequoia National Park. You lose your perspective though, since it is surrounded by trees that are over 150 feet tall! This beast is one of Sequoia National Park's attractions that cannot be passed up. From the main parking area, the trail is a paved, downhill, (with steps), one mile hike to the base of the tree. It is magnificent since there are plenty of other sequoia trees in this grove to observe. This is also the location of the \"Congress Trail\", another superb hike in SNP. (There is handicap parking area near the base of the Sherman Tree, two miles south of the main parking area, directly off of the General's Highway.) The maintenance of this trail and the adjoining Congress Trail are high quality. It is family friendly, and strollers can easily make most of the paved trails in the area. Bring water, but there is a filling station at the start of the trail. While descending the trail, there are markers that signify how high you are on the trail in comparison to the height of the Sherman Tree. The best picture spot is a nice trail-balcony at the halfway level of the tree. The trail continues further down to the base, where you can see a display of a sequoia tree cross-section, great for pictures also. Near the base is another set of twin sequoias that the trail squeezes between. Set aside two hours for just hiking down to the tree and back up the trail to the parking lot. Plan for three hours to all day if you want to tour the entire grove, including the Congress Trail. (Totally worth it!)\nShow less"], ["Reviewed July 6, 2017", 5.0, "LAKE TAHOE, YOSEMITE, SEQUOIA TRIP", "We started at the handicap parking lot, which is only a few hundred feet from General Sherman. You can park here with a H/C placard, or you can drop off and pick up by shuttle bus. On the way to tree you can walk thur a fallen tree, a good photo-op. General Sherman is a must see if you are in Sequoia Nat. park. The main parking lot is one-half mile each way.\nShow less"], ["Reviewed July 6, 2017", 5.0, "June 3rd visit.", "My daughter and I visited on June 3rd, around 10am. It was fairly busy in the parking lots, but we found a couple open spots in the lot near the Sherman Tree trail trailhead. The trails in this area were very busy and plenty of people were trying to get photos with the tree. We did our walk around the area, and then we decided instead of riding the shuttle bus to Moro Rock, we hiked the trail from the General Sherman Tree to Moro Rock. That hike was very nice and relaxing, no where near the amount of people in the General Sherman Tree area.\nShow less"], ["Reviewed July 6, 2017", 4.0, "For Nature Lovers", "We drove 3 hours to get to Sequoia National Park and it was a winding road getting there, no regrets though. Nature at it's best, most trees in the park are impressive as well aside from the Sherman. It was like I was on the set of Lord of the Rings, surrounded by Oaks. Taking pictures though we had to queue, there are lots of visitors like us. Overall, a good place for family and friends.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Massive", "Just one of several amazing sites to see. Short walk to the tree among other incredible forestry. There is a restroom facility. Various other trees are near and visible from the parking area which make for great foto opps."], ["Reviewed July 4, 2017", 5.0, "Amazing Majestic Living Tree", "Went twice to see it as it stuck in my mind as such a majestic sight. hike the 2 miles of the Congress trail with it...you see the named trees such as the Chief, President, McKinley etc."], ["Reviewed July 4, 2017", 5.0, "Awesome Tree", "The Sherman Tree is right off the main road. On a light day, you can park right across, otherwise you can go to a remote parking lot and take the free shuttle. In any case, this tree in its beautiful setting is definitely worth the visit.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Great stop but lots of people.", "There are a LOT of people. I was really more amazed when in the less populous areas. These trees are truly giant! But there are also a lot of them. So while there is some significance to seeing this particular tree, be sure to wander off a bit and just enjoy the forest. It's definitely worth it.\nShow less"], ["Reviewed June 30, 2017", 5.0, "One big tree", "This is a must see attraction handicapped or hiking. You drive above it to hike 1/2 mile down to it or park just below it to handicap access it. In the same area you will see a fallen sequoia and several other sequoia. I suggest a water bottle with the increased heat.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Massive", "The main parking lot is large, but fills up as the morning progresses. The trail is paved, but there's stairs. It's .8 miles there & back. There is a handicap parking area closer to the tree. Get there early, before the tour buses!\nThe tree is indescribable! So large it's hard to wrap your head around.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Biggest tree in the world", "General Sherman is the largest tree in the world by volume. It is huge and the trunk is columnar--almost as big around at the top as at the bottom. There is a parking lot near the tree, but you are better off taking the free shuttles. They run every 15-20 minutes and you won't waste time looking for a parking spot.\nShow less"], ["Reviewed June 24, 2017", 4.0, "It's a big tree!", "This is a nicely laid out site to view the old big General Sherman. Be ready for a bit of a walk up and down then hill, but it is straightforward to access and enjoy a glorious forest. ...Trees on an epic scale!"], ["Reviewed June 21, 2017", 5.0, "You can't imagine the scale", "You get a strange sense of feeling very little (literally and figuratively) around the area. There are Always a lot of people waiting to take picture. If pressed for time, go to the back and take one. There is a small hike to get to the tree, and the climb is not too bad, but can be strenuous. PS: the tree is so big I needed to use panorama to get the full tree in the frame.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Moderate hike, but worth it!", "The hike down is fairly easy and mostly shady. You descend about 200 ft so keep that in mind because you will be climbing back up the same trail. Just take your time on the way up and you should be fine. As Floridians we didn't have any issues with the over 7000 ft elevation. Bring plenty of water if you are visiting in the summer! There is a special parking lot and trail for people with a handicap placard.\nShow less"], ["Reviewed June 21, 2017", 4.0, "Just breath deep and endure the crowds.", "The size of this tree is just overwhelming. And, the thought that it has been around for over 2,000 years is even more overwhelming. This is one of those places that you just have to visit, but you also have to visit with hundreds of other park visitors. Our strategy with the highlights of any national park is hit the popular attractions early or late. We arrived late to the General Sherman Tree but we still had to share him with lots of other visitors. Please remember when visiting any national park to obey all signs and rails. Fence rails are there to protect visitors and the natural wonder of these parks.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Awesome tree in beautiful park!", "Beautiful views on the way up to the tree. Definitely pull over and look at the the racing rapids below. The road is EXTREMELY WINDING. Prepare yourself in case you have someone who gets carsick. The trail itself down to the tree is beautiful. It's paved and has stairs which makes for a nice walk. There are plenty of benches along the way to stop and catch your breath either going down or coming back up. It's a half mile walk down to the General Sherman. The giant sequoias are amazing to see! I'd recommend going first thing in the morning to beat the crowds. You'll definitely want to take pictures of these beauties!!\nShow less"], ["Reviewed June 19, 2017", 4.0, "Nice to see the world's largest", "Interesting although travelers wondered if this really was the largest tree. The hike up back is steep with many benches along the way. However there is a nice quick shuttle that takes you back to where you started (and your parking lot). We took the shuttle as we saw the rest of the hikers and kids look exhausted on their way up (which was our way down) so we didn't dare go up. The shuttle arrives every 10-15 minutes. Our arrived pretty much in 5 minutes and the next one was also there waiting.\nShow less"], ["Reviewed June 18, 2017", 5.0, "A great little hike with the family!", "We parked at the top of the hike and walked down..maybe a half mile total walk? Ample parking up top and you can get shuttled back up top to your car. Or shuttle to other locations and leave your car there. There are a bunch of little trails all over once you get to the bottom. It was beautiful! We just got back from there and it had snowed during the night and it was in the 40's and 50's during the day. Chilly for sure! But a great hike regardless!\nShow less"], ["Reviewed June 15, 2017", 5.0, "Photos and words are not close to adequate", "You MUST experience it in person to get it! Even then, it is too immense to actually take it in. Definitely worth the trouble to get there and the hike to see it.\n\nThis tree is one of many. Plan to take the time to walk the trail to see more of the forest. Take your binoculars.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Huge Trees!", "This is a must see in the Sequoia National Park! Its a famous place to take your photo for sure. Its an easy walk down to the tree & quite a climb back up the hill to the parking area. There are plenty of benches to rest along the way. Go early because its very crowded!\nShow less"], ["Reviewed June 15, 2017", 3.0, "Vacation to CA", "We were not sure about having problems with the altitude change, and I did get a wicked headache and tired.\nBut I am glad we were told it was an okay talk.\nYou can get pretty close and take lots of pictures.\nThe return trip is all up - 250 feet but you start at 7200 feet.\nBut take lots of breaks and you should be ok.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Great tourist site", "This is a must see if you're going to the National Park to see Sequoia's. There are no words to accurately describe the massive size of this tree. Just remember the hike to this is easy going down but quite an endurance test to get back up. This is not for someone who has any health or mobility issues. I understand there is a parking area for those with handicap permits so it would have to accommodate easier access.\nShow less"], ["Reviewed June 13, 2017", 5.0, "We needed snowshoes", "OMGosh. What a big tree. So fantastic to see. The snow was deep and not firm. Many had sunk a long way in!!"], ["Reviewed June 12, 2017", 5.0, "Good views close by", "It's not very busy and there are plenty of spots to take photos. It's also very easy to get to which is good because it was cold when we visited."], ["Reviewed June 12, 2017", 4.0, "Very cool", "Amazing how large the tree is. However, it was very busy when my family went and it took awhile to get pictures even on a foggy day."], ["Reviewed June 11, 2017", 5.0, "Largest Tree On The Planet", "This tree is incredible. The crowds were huge. We should have gone early in the morning but we we went in the afternoon. We didn't wait in line for a pic but we took one from the back side. Mother Nature certainly blessed this area with these great sequoias.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Spectacular", "WOW!!! To stand beside a tree whose base is 35' across, over a 1/3 of football field around, and 275' tall. Absolutely spectacular. You have to see it, to understand just how amazing it is."], ["Reviewed June 9, 2017", 5.0, "Big.....and wide", "A well thought out and environmentally friendly set up which enables visitors easy access to the General Sherman tree whilst protecting the local area."], ["Reviewed June 7, 2017", 5.0, "Big Boy In The Park", "The trunk is 130 feet in diameter and he's 2200 years old. He was named by James Wolverton to honor his commander in the Civil War. He drinks about 1200 gallons of water a day. He happens to be the biggest tree in the world. If you were going to guess the General Sherman tree, you'd be right. He's a short walk from the parking lot bit the return trip is up hill. You'll pass Sherman if you Hike the Congress Trail.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Still shocked", "When you coming to Sequoia National Park you have to see the General Sherman. I know what people are going to say it's just a tree........No it's not. This is so incredible, words can't describe what you're seeing. When you get to the parking lot you are going to be taking a good 10-15 minute walk so take your time the air is thin.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Amazing", "Nice stroll to tree. We parked in main lot and walked to tree. If you have issues walking there is a lower entrance that you can take with shuttle bus and makes it closer walk. Amazing how big this tree is."], ["Reviewed June 6, 2017", 5.0, "Massive ent of the forest!", "We went to see the Sequoia in Yosemite before coming here. I'm glad we did because this place was packed with Sequoias and the best of all it had the massive General Sherman. There was plenty of opportunities to take pictures in front of this massive tree as there was lots of on lookers willing to take a picture.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Outstanding!", "Standing under the largest tree (by volume) in the world is really awe inspiring. Words can hardly do justice to it. Most of the people seem to be most interested in standing behind the General Sherman sign to have their pictures taken, but we enjoyed it best by walking all around it and seeing it from all sides.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Unbelievable tree", "The General Sherman Tree was unbelievably large - pictures do not reflect what you see while gazing up into the air at this huge, beautiful tree."], ["Reviewed June 4, 2017", 4.0, "It's a Hike!", "It's definitely work seeing, but it's not the type of attraction where you park your car, walk 20 paces, take a picture and continue on your way. It is a paved walk way, with steps (strollers had problems), but is over half-mile ... all down hill. The tree is 275' tall, and that's about how much you descend from the parking lot to its base. Worth the effort.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Family trip", "It was an amazing experience! Being near these amazing trees was a humbling.... Can't wait to go again."], ["Reviewed June 2, 2017", 5.0, "AMAZING!", "The hike trail to the General Sherman Tree was easy to get to. Just follow the path. Going back up you might have some trouble. But it was totally worth it. Such a site. And we actually saw our first bear on the hwy to the tree. And a Chipmunk while we were going up the trail. The smells of all the trees and just being among these giants is just all too humbling. This is a must on your trip.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Fine tree", "What a fighter. This tree is dead on the top and still growing. There is only one so go see it. The teenagers weren't appropriately impressed, but I was. Strongly recommend."], ["Reviewed May 31, 2017", 5.0, "Memorial Day Weekend to Sequoia", "My family and I recently visited The General Sherman tree and it was amazing. It doesnt get better than this, to get to witness the oldest living tree in the world. It wasn't easy finding parking here since it was a busy weekend, we had to walk about 1mile from were we parked. But on a non busy day, they do have a lot of parking spaces. As u walk down the trail to the GST you get to see other large sequoia's around the area. Once at the end of the trail and after seen the general Sherman, there are busses/shuttle's that can take you to other locations and then drive you back to the same spot you left you car. This is a very useful service specially if parking is limited. I hope my review helps. Thank you.\nShow less"], ["Reviewed May 31, 2017", 4.0, "Amazing experience to see this tree.", "General Sherman tree was very impressive due to the enormity. Good information and pathways, though from the parking lot it is a medium level uphill climb going back."], ["Reviewed May 31, 2017", 5.0, "Must see", "I parked at the museum and hiked over. Then took the free shuttle back. Great hiking and a magnificent sequoia!"], ["Reviewed May 30, 2017", 4.0, "The tree is amazing.", "Actually all the sequoias amazing. The walk down to the tree was nice. The walk back up to the parking lot was interesting. A lot of people had trouble because even though it is a short walk the elevation is at 7000 ft. Definitely worth walking to a lot of the other trees that are around the area.\nShow less"], ["Reviewed May 29, 2017", 4.0, "Obviusly a tourist attraction, but amazing nonetheless", "This tree is huge and well protected. It's best to get there early if you want any pictures in front as it's the first and most popular attraction apparently."], ["Reviewed May 27, 2017", 5.0, "Exciting to see the largest living organism on earth today!", "The General Sherman Tree is awesome! There is a wonderful path all around it, but you are not able to actually touch it. If it filled with lots of tourists, it may be a little difficult to get your photo taken alone with the tree...but you can see it well from many places along the path.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Bucket list", "Our trip here was all I expected. We were able to see all areas of the park that were open. The walk to the tree is enjoyable and the trek back a little challenging. Seeing these awesome natural places is really a treat. I encourage everyone to cross this off your bucket list also.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Big tree", "long uphill hike back up to parking lot is a bit strenuous. If you want to see Sequoias with less effort go to Grant Grove."], ["Reviewed May 26, 2017", 5.0, "Truly impressive tree", "The General Sherman tree is the world's largest tree by volume. It is not the oldest, tallest or widest. It's really impressive to see how the girth of the tree does not taper towards the top. We visited with friends and a 2 year old. The hike down is quite long and steep for a toddler or anyone with knee/joint issues. There appears to be a drop off for disabled closer to the tree but I don't know if this extends to toddlers. :) Regardless of the hike (paved entirely), it was a sight to see and we would definitely return.\nShow less"], ["Reviewed May 26, 2017", 3.0, "BIG TREE", "Amazing that these trees are so old. Nice overlook for Gen. Sherman Tree, walk down a paved pathway to the valley with a grove of giants."], ["Reviewed May 24, 2017", 5.0, "A special treat", "If you have not visited Sequoia and Kings Canyon National Parks, you are in for a treat. These majestic Giants watch over the forest fauna and flora... One can not imagine living to an average age of 2500 years... but this is the life span of a Giant Sequoia. Only 1 of the 3 species (Coastal Redwood of California and Dawn Redwood of China are the other two)... it is a not to be missed icon. The General Sherman tree in Sequoia National Park is the tallest of the trees and one is dwarfed by the size. In the area are also many other Sequoia trees where you can get closer. Best times to visit are before or after the summer crowds. There are plenty of places to picnic and camp... not too many places to stay (i.e. cabins) or resturants inside the park. However, if you pick up a picnic lunch at Moes to Go in Visalia (Mooney Blvd) and take it up with you, you can enjoy a special picnic under the trees.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Sequoia National Park", "If you want to see an oldest living thing in the world, this is the place. Giant Sequoia trees with trunk as big as 10 meters and height of more than 250 feet. They are massive, beautiful and indescribable. The hike to the General Sherman Tree is 0.4 miles but so breathtaking that you are lost in time. Drivable distance from Westlake, a lovely small town full of fruit orchards, plan for a full day. Start early and plan on spending at least five to six hours exploring the groves and then depending on your appetite you can do as many trails as you like. Kings Canyon is about two hours round trip from west entrance and Is a lovely drive through the canyon. Once in a life time place. If Redwoods of Muir Wood and Big Sur amazed you, this will appeal much more!!\nShow less"], ["Reviewed May 20, 2017", 5.0, "Fantastic", "A must see for nature lovers. The views are spectacular and never ending. Be prepared for a hike uphill upon your return. Take your time and enjoy the views!"], ["Reviewed May 19, 2017", 5.0, "Magical", "Driving into the park is just so beautiful. . The park is open 24 hours. Get up really early on a weekday and there are no problems with crowds. Walk down is easy. Walking back up may prove challenging for people who have never experienced walking uphill in higher altitudes. Plenty of places to sit and bring heart rate down. Take it in sections if need be but don't miss it. There is evidently a shuttle that can bring you back to your car if you want to skip the uphill return. It don't miss the experience!\n\nAlso if your phone has panorama use this feature to capture the sign, your subject and the whole tree. .\nShow less"], ["Reviewed May 19, 2017", 5.0, "WOW, so massive.", "It maybe a little strenuous of a walk back up to the parking lot for some, but there are bench's to rest on. It well worth the effort. There is a handy cap lot on the main road. You must get a picture in front of this magnificent tree.\nShow less"], ["Reviewed May 19, 2017", 5.0, "Awesome", "If you have a handicap sticker, it is easy access and worth the stop. If not, take your time and enjoy the stroll to the tree. There are plenty of places to stop and rest. It was amazing."], ["Reviewed May 19, 2017", 5.0, "The biggest tree in the world!", "Inside the Sequoia National Park, California have a the biggest tree in the world: General Sherman! The tree have 87 meters height and 10 meters diameter! This is a Sequoia with 2000 years old! Unbelievable! Fantastic! Magnificent! Unmissable!"], ["Reviewed May 18, 2017", 5.0, "The Largest Living Organism on Earth", "The simple fact that the above is true is humbling. That I stood in its shadow is even more so. This is a remote and demanding place...it's 7000 ft above sea level and only accessible by a two lane road with a speed limit of 40 mph. One does not see this by simply taking a quick exit off the freeway. It is a very important place and worth the time and energy...we saw a grizzly bear in one of the meadows and a golden eagle along the roadside. Go.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Handicapped parking on main road, other parking still takes you fairly close", "We passed the handicapped parking and felt as though the drive to the general parking lot was far away. However, the road looped back around toward the grove. The parking lot was huge, there were public restrooms and a beautiful wide walkway that led back to the General Sherman tree.\nIf you want a picture in front of the tree, and you know you do, you may end up waiting awhile. We had a family in front of us that took various group shots, individual shots of each person, then multiple planned poses, etc. Of course I had to remind myself that this was a once in a lifetime opportunity, so I tried to be patient. It is difficult to take pictures that truly create an understanding of the magnitude of the forest.\nThe grove of trees around the General Sherman Tree was magnificent. There is also a beautiful stream.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Something to behold!", "The size of this tree is incredible! There are many opportunities for photos. We entered the forest from the lower level and it is a very short easy paved walk. The people who came from above had a steeper descent and climb out of the forest.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Breathtaking!", "Wow wow wow. Amazing giant trees left and right keep your jaw dropped. I've always wanted to pay a visit to Sequoia National Park while living just a few hours south in LA for a few years. Finally set up a trip there with a friend and wish I had visited sooner.\n\nOur first stop was to General Sherman Tree. It's a relatively easy walk but is heavily trafficked as it's a touristy spot. Besides that, the views are worth the visit. Seeing the tallest tree in the world was an amazing experience. Definitely crossing off the bucket list for sure. The trail has some other cool views along the way such as a \"footprint\" of a large tree stump.\n\nHighly recommend stopping by this area while visiting Sequoia. Take lots of pictures!\nShow less"], ["Reviewed May 15, 2017", 5.0, "You have to see it to believe it", "This park is gorgeous, pictures do no do it justice. We visited the General Sherman tree on a weekend so it was very busy, I would recommend visiting here during the week or early in the day. Super easy walk from the parking lot, easy to travel with strollers.\nShow less"], ["Reviewed May 15, 2017", 5.0, "An absolute must", "The largest tree by volume and can really only be appreciated in person. There is a handicap parking area that still is a challenge to walk from it to the tree. The normal parking seems to be over half a mile away and while the path is paved it is no fun in inclement weather. Still you must make every effort to get close and marvel at this special product of nature\nShow less"], ["Reviewed May 14, 2017", 5.0, "Incomprehensibly Big", "We visited Sequoia for 2 days as part of a 3 week honeymoon road trip and would give everything we saw there 5*s but the General Sherman area would be the true highlight.\n\nGeneral Sherman itself, even more so than all the other surrounding Sequoias, is incomprehensibly big. You almost need none of the other trees to be there, a \"normal\" sized tree next to it or a platform to understand its real size.\n\nHowever, whilst impressive in its own right, we would recommend doing some of the trails arround the General Sherman sight to get a true appreciation of this amazing place. This also comes with the added benefit of getting away from the large amount of people that flock to the central attraction, and really helps make you feel that you are actually in nature.\nShow less"]]}}