{"Ghirardelli Square": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Ghirardelli Square", "url": "/Attraction_Review-g60713-d104680-Reviews-Ghirardelli_Square-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/a0/09/3d/these-sundaes-are-to.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "3003"}, "address": {"@type": "PostalAddress", "streetAddress": "900 N Point St At Polk Street", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94109-1192", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Ice cream - yummy", "My husband & I enjoyed walking around Ghirardelli Square. The area is beautiful. I got mint chocolate ice cream in a cone & my husband got a sea salt Carmel quake shake it was amazing! We got our order to go & ate out by the mermaid fountain. People were playing corn hole & lights were hanging in the trees - such a nice area! The Ghirardelli Store give a piece of Easter candy to each person who entered which was a nice little gesture.\nShow less"], ["Reviewed 2 days ago", 5.0, "CHOCOLATE", "We stopped here to buy souvenirs for home and to have one of their delicious sundaes. The staff was very friendly and helpful."], ["Reviewed 4 days ago", 4.0, "Thought there would be more", "My wife loves dessert so I thought I'd win husband of the year for this. We had dinner at fisherman's wharf and then walked the four blocks to Ghiradelli Square. The first 2 blocks were fine, the last two were near deserted. Once we got to the square it was pretty empty (We were told Saturday night is the busy time-we were there on a Thursday night). The square is nice, but the dessert was nothing special-don't get me wrong, it was good, just nothing special. We then walked two mostly deserted blocks back to our hotel. The buildings are nice, but beyond the photo op, meh.\nShow less"], ["Reviewed 4 days ago", 4.0, "Not our thing but worth stopping at...", "At the end of a long day we ended up here to see what it was about. It's a cute, trendy shopping area with high end shops and restaurants and if that's what you're looking for it would be just fine. We walked around for a little bit and went thru the Ghirardelli chocolate shop as they were handing out samples which were very tasty. Even if you don't like the shopping, there are plenty of benches and restrooms so great place to recharge and rest if needed.\nShow less"], ["Reviewed 5 days ago", 5.0, "Yummy, yummy", "So may stores in the square for souvenir shoppers, but the Ghiradelli store offers so many chocolates. They give you a sample as you walk in. Very good chocolate."], ["Reviewed 6 days ago", 3.0, "Neat but not my cup of tea", "I walked to Ghirardelli Square from Fisherman’s Wharf. It is a nice collection of upscale shops and Ghirardelli chocolate stores. It smells amazing. The shops weren’t really my cup of tea but it is a nice shopping venue."], ["Reviewed 6 days ago", 5.0, "Do you love chocolate?", "Great place for an ice cream and soda treat! Wonderful soda fountain with awesome sundaes! The Ghirardelli chocolate is amazing and the store offers wonderful chocolate treats!"], ["Reviewed 6 days ago", 4.0, "Great chocolate, smells amazing!", "Best ice cream and hot fudge. We went twice! It is a tourist trap, but our kids loved it and it was walkable from Lombard Street."], ["Reviewed 1 week ago", 4.0, "Pretty Darn Good Chocolate and Ice Cream", "This is another one of those got to go every time we are in San Francisco places. Hint - order a single scoop and get the free chocolate chips and save $$. You probably can't ( or shouldn't) eat the sundaes anyway by yourself... even though they are really good! There are other things besides chocolate and icecream here too.\nShow less"], ["Reviewed 1 week ago", 5.0, "Super packed but delicious!", "There are three stores which is good to know bc the lines can be out the door at the two on the upper level. Go to the small one on the lower level as (if you are ordering) it has all the same things!! Got chocolate was smooth and delicious. Ice cream comes and sundae’s were also good! They give out free chocolate samples to. If they are not out just asked for one.\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice Treat", "We had good timing, only waited about 10 - 15 min. to order. Once we ordered, it wasn’t hard to get a seat and our sundae came fast. It was good, but nothing amazing. My daughter and I shared."], ["Reviewed 2 weeks ago", 5.0, "Out of this World Desserts", "We had a dessert at the Original Ghiradelli's and all I can say is \"Well Done!\" It was absolutely fantastic! I honestly don't think you can go wrong with a dessert at this place. The staff were extremely helpful and went out of their way to make everything perfect. I would give this place a \"Must Visit\" if you're visiting the city!! BRAVO!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Chocolate chocolate chocolate", "We stopped at in and did a little sweet shopping. Upon arrival one of the employees gave us a free chocolate to try while we shopped, it convinced us to buy a few tins of pre wrapped bars as well as a couple other small things. Decent pricing and great chocolate we enjoyed our stop. Pro tip- if you arrange them good you can fit 3-4 more chocolates in a tin than most people, and the caramel chocolates are really tasty but take up double space.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "You Can Get The Chocolate Anywhere!", "It's cute. The chocolate and the ice cream are very good. But it's not really worth a trip out of your way to get chocolate you can get in your local grocery store and ice cream no better than you can get in a lot of other places with more local character. There is a little bit of fake chocolate making display in the store, but there is no tour or anything - it's basically just a store in a nice outdoor mall area.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "If you love chocolate...", "Chocolate lovers will find refuge in this historic shop by pier 39. You are sure to satisfy your sweet tooth with plenty chocolatey options on the menu. The staff is friendly and there are lots of samples to help you find your favorite flavor. You can find a bit of chocolate history as you wander around tasting the goods.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun place for chocolate lovers", "Two Ghirardelli stores, some fun boutiques, live music, corn hole games, and free samples at the Ghirardelli store. We ended up here in the early evening and it was great to walk around and wind down from a busy day exploring San Francisco. Cute stores to browse. Can watch chocolate making machinery in action too.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Time for dessert", "My brothers in town and just had to come over to get our dessert on! They also have a neat little square with some shops (including a puppy dog accessory shop.)"], ["Reviewed 3 weeks ago", 5.0, "Free samples and cute stores", "We enjoyed our free samples and a yummy Ice Cream Sundae. I wish we could have found more info about how they make the chocolate, but all we found was where we could purchase it. I'm sure they have something somewhere, but we missed it. We loved the little shops, and played a game of Corn Hole.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Chocolate galore", "This place is great. Always a large selection of gifts to bring back to family. Variety is enormous for all taste buds. Can be pricey if you buy any of the gift tins and such but they usually have some half off deals with a larger quantity purchase. Or just buy large bags of what you need. The have small and large amounts of all their chocolate. Cafe tends to get crowded during certain hours but I haven’t noticed a pattern.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Chocolate For Days", "Ghirardelli Square is your mecca if you're a chocoholic. Their entire product line is available for purchase here, usually over a couple scoops of ice cream or in a milkshake. There are many restaurants in the surrounding area, but most people forgo their options for dessert and grab something here. If you're unsure what you're looking for, I advise heading upstairs to the tasting room and trying a few different examples of their chocolate squares to see what flavors appeal to you. After you tickle your taste buds, grab a few squares to go in one of their festive tins.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best chocolate - ever!", "Ghiradelli-SanFrancisco-what else is there to say? A must do! Have the ice cream sundae. Get your free sample at the door. So much chocolate, so much deliciousness!"], ["Reviewed 3 weeks ago", 5.0, "Chocolate! Lots of it!!", "Well, where do I start. To me, the Wharf means you need to see the Ghirardelli shop, get something chocolate to take home and eat something chocolatey.\nWe did all that. The Ghirardelli mall is new (at least to me), lovely, lots of shops and great chocolate items.\n\nDon’t miss it. Save your calories for the day to eat something there or you will have missed an excellent opportunity.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "The smell sucked us in", "If you like chocolate, I would recommend a stop. The sundaes and mochas are excellent, but a bit pricey."], ["Reviewed 3 weeks ago", 5.0, "Chocolate!", "Best cup of hot chocolate anywhere, best sundaes in the world. And a beautiful building and patios to stroll around. On top of all that free chocolate square samples..."], ["Reviewed 3 weeks ago", 4.0, "yummy chocolate", "Every visitor to SF should see this place once.If you are staying in the Fisherman's Wharf area,then there is no excuse not to visit this place.We went here during Christmas and the place was packed.Line was long and getting a table was difficult.However,it was worth it.Their chocolate and icecream was delicious.Some may find it overpriced.If you don't like their food or chocolate,then do walk down to the beach.Its very relaxing and one can take great pics.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A fun place to pop into to.", "You always get a free square of chocolate here when you visit. It smells wonderful inside and should always be part of your \"walking path\" when in San Francisco."], ["Reviewed 3 weeks ago", 4.0, "Good chocolate", "We visited it during Christmas holidays.Nice decoration.Variety of chocolates and tasty ice cream.We enjoyed our afternoon coffee there.One of the places that every visitor of San Francisco must go."], ["Reviewed 3 weeks ago", 3.0, "Center is all but abandoned", "We were so sad to see that almost the entire center is empty. Almost all shops are closed, so walking up to the Ghiradelli store is kinda sad. The store was empty, so it should not have been a surprise that the cookies were not fresh. The staff is still wonderful, but the atmosphere is not the same.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Good but chaotic busy", "This place was good. It’s chaotic busy and finding a table can be a challenge. We went during fleet week so it’s possible that it’s less busy at other times of the year."], ["Reviewed 4 weeks ago", 5.0, "Best chocolate ever", "We spent a week in SF and almost every day we would return to Ghirardelli Square where we enjoyed in most delicious chocolate and ice cream."], ["Reviewed 4 weeks ago", 3.0, "Good for pics, not so much for the food", "This place is good for pics but the chocolate and icecream were over priced and nothing special. Be sure to Walk down to the beach from here to get more great pics."], ["Reviewed January 24, 2018", 5.0, "No better place to stay at San Francisco", "No better place to stay at San Francisco\ngreat location;nice building\nservice is excellent ; people working at the hotel are very helpful and professional and you feel pampered\nalso the « house car » takes you any place within two miles and drivers are friendly and of good advice\n\nour apartment was just amazing , very comfortable and well equiped , you could imagine live here forever\ndon’t forget to go to the terrace and enjoy the view sitting next to the brazier.\n\nbreakfast is very good too\n\nwe’ll definitely stay here again\n\nPascale &Pierre 78 Marly Le Roi France\nShow less"], ["Reviewed January 24, 2018", 4.0, "Chocolate Paradise!", "Ghirardelli Square is very nice to walk around and explore. The old buildings are neat to see and when we were there is was December so all the lights and decorations were beautiful. If you love chocolate it is a great place to wonder into all the shops! We even got samples! If you have the time to stand in a LONG line for the ice cream it looked amazing (we weren't up for the wait).\nShow less"], ["Reviewed January 24, 2018", 3.0, "not worth it at all", "So boring, nothing was open or did not open on time - we went to the Ghirardelli stores - nothing exciting - just skip it!"], ["Reviewed January 23, 2018", 2.0, "Aside from the Chocolate - Waste of Time", "This area is way too busy and there is absolutely NO PARKING and parking in the nearby garages is expensive. If you're a fan of chocolate or simply a fan of Ghirardelli Chocolate then great, try to limit your time, otherwise it just over packed."], ["Reviewed January 23, 2018", 4.0, "The place to go if you love chocolate!", "Ghirardelli Square is basically a bunch of little shops all together, most of which involve chocolate. There are ice cream shops and lots of chocolate shops. Most of them offer you a free Ghirardelli square as you enter."], ["Reviewed January 23, 2018", 4.0, "Mmmmm chocolate!", "I did not try their deserts or ice cream (looong lines - be prepared) but did try a few of their chocolates!\n\nI’m the restaurant, head to the back of the room and look at melting chocolates being prepared!\n\nChocolates are all quite delicious - especially the ones with sea salt! Yum!\n\nLoved their hot chocolate too!\nShow less"], ["Reviewed January 22, 2018", 3.0, "Chocolate and more", "Lots of Ghirardelli chocolate available. Lots of people wanting to get more of it. Nothing great about it.\nThe beach just off the square was quiet and a nice setting.\n\nTip: The great mall has a Ghirardelli Outlet store. Much cheaper than the square and enough variety.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Lovely Christmas Tradition", "This iconic stop in San Francisco is a few blocks down from the Alcatraz tour. We did the tour, ate at Boudin and walked down here for dessert!\n\nThe sign is neon and pops out above the building looking over the water. The walk is flat till you approach the building on a small hill.\n\nThere are shops and the main ice cream shop/cafe upstairs. There are steps and the elevator is a bit hard to find but it is there.\n\nWe walked around the main level and enjoyed the chilly air, and lovely decorations and lights and made our way to ground level for our ice cream treats where the line was shorter. We had delicious sundaes and milkshakes. The shop help was handing out samples and there were many chocolate gifts to purchase. The outdoor seating was brisk but quieter. Highly recommend.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Free Chocolate at Ghirardelli shop!", "We popped into Ghriradelli Square before heading back to our hotel one evening. When you walk into the Ghiradelli store, a charming, happy woman was passing out Strawberry white chocolate ~ yum! Neat area with restaurants & shops & cafes near Fisherman's Wharf."], ["Reviewed January 17, 2018", 5.0, "Delicious Fun!", "I think that if you want to be a total tourist and enjoy a delicious treat this is the place to go! Not only do you get to enjoy a delicious sundae, but the square itself has some cute little shops to visit and check out. I definitely recommend this place.\nShow less"], ["Reviewed January 16, 2018", 3.0, "Pretty", "Ghiradelli Square is a pretty little area down at the port - just along from Fishermans Wharf. It's very easily accessible because the trolley turnaround is just round the corner. There is a small shopping mall of specialty shops including the famous chocolate shop with the eponymous name.\nShow less"], ["Reviewed January 13, 2018", 5.0, "What a fantastic way plce", "Lots of boutique type places and wineries and chocolate factory. Beautiful old brick architecture. Restaurants and good rest rooms.We are staying at the Fairmont and so we are in a prime position. Love the wee shops."], ["Reviewed January 12, 2018", 3.0, "Not the Same", "Ghirardelli Square is a shadow of what it once was. We've been coming here for over 20 years and every time we visit, more shops have closed."], ["Reviewed January 12, 2018", 5.0, "Sundae", "Went to Ghiardelli store and had a sundae...what can I say except that it is an experience not to be missed, as it is to die for!"], ["Reviewed January 11, 2018", 2.0, "Disappointed", "Very disappointed. Giant tourist trap and all inside. Nothing exciting except for chocolate lovers. Overall an overpriced waste of time"], ["Reviewed January 10, 2018", 5.0, "Chocaholics Heaven", "Where it all started for Ghirardelli. From drinks to take home chocolates be sure to drop in for your chocolate fix."], ["Reviewed January 9, 2018", 4.0, "Nice stop, not necessary", "Ghiradelli Square is a nice place to stop if you like chocolate or have extra time. The lines to get ice cream were very long so we couldn't actually get ice cream. We still managed to walk around the gift shop and got a free chocolate. Outside, the decorations were really pretty and festive. It's a nice area to visit, but by no means is it must-see.\nShow less"], ["Reviewed January 9, 2018", 1.0, "Overpriced", "Don't know why so crowded. Can buy these chocolates at Walgreen for less. Only one samples when you enter."], ["Reviewed January 8, 2018", 3.0, "An OK Stop", "There are some shops and a Ghiradelli chocolate shop here. If you have hit Fisherman's Wharf and you're tired of shopping, you've seen enough. If you want to still shop, walk to Ghiradelloi Square. The chocolate shop is nice, you can have lots of chocolate or a chocolate treat Other than that, more shopping an the huge \"Ghiradellli Square\" sign. The sign is impressive at night.\nShow less"], ["Reviewed January 7, 2018", 3.0, "Quick stop for ice cream", "Kind of a tourist-trap, but their ice cream was really good. The line was long, but moved pretty fast. I wouldn't stop there for anything else. Just a couple chocolate shops which didn't seem to offer anything that special from what you can find in a typical store. We basically went there to get some ice cream and left.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Cute", "When you come in you get a candy cane chocolate at the front door which makes your day. The place is cute to walk around."], ["Reviewed January 4, 2018", 1.0, "Pass on this", "There is really nothing to see here. We walked up from Fishermans Wharf, and it was wasted time. There are 2 Ghirardelli chocolate stores... and thats it... You can get their chocolate at any store, including Target and Wal Mart. They have some great shakes and sundaes but otherwise the square is pretty much empty. Just pass on this stop\nShow less"], ["Reviewed January 4, 2018", 4.0, "for chocolate lovers..", "If you have a sweet tooth and/or love chocolates, then this is the place to be. Let us not forget that you also get to try some samples for free ;).\nThere is a small cafe in the shop and you can order from a wide variety of desserts...\nShow less"], ["Reviewed January 4, 2018", 4.0, "Hard to say no to chocolate!", "Very tourist type attraction. But the ice cream is pretty good and you can usually find a deal on their chocolates. Be prepared to overpay for ice cream, but if you're on vacation, enjoy the moment!"], ["Reviewed January 3, 2018", 3.0, "Gift shops and underwhelming hot fudge", "We went to Ghirardelli Square for the compulsory tourist hot fudge sundae. It was underwhelming and overpriced. There are a several stores chock full of Ghirardelli candy and merch, and a couple that aren't focused on that. I think there are a few restaurants, too, but overall it's easy to cut this from your itinerary if you are running out of time on your visit.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Best Sunday in S.F.", "Ghirardelli Square is a must eat stop in San Francisco. Downstairs in front is the candy store and upstairs in the back is the ice creamery with their famous Sundays and great views across the bay if you get a window table."], ["Reviewed January 3, 2018", 5.0, "Iconic treats in San Francisco", "No vacation to San Francisco is complete without a stop for ice cream at Ghirardelli Square. The line is always crazy long but moves faster than you think. The sundaes and treats are themed after San Francisco landmarks and are great. I usually get the Crissy Field and share it with my husband. Definitely share the big desserts. They are way too big to eat alone. There are usually coupons in the tourist guide books or online. There is a little chocolate making demonstration by the kitchen so you can see how their chocolate is made. There is also a retail store that sells the squares, hot chocolate powder, baking chocolate, etc. The is usually someone in the retail store giving out free squares of chocolate. If you go around Christmas time they will give you peppermint bark squares, It's touristy and crowded but it's part of the feel of San Francisco. And ice cream!!!\nShow less"], ["Reviewed January 3, 2018", 3.0, "Too Much Hype", "We went here to have some ice cream at Ghirardelli. It was extremely crowded. There is not much else to do there except walk through a few small shops. I think there were one or two restaurants. The line for Ghirardelli was long to order (30 min). Then, there was another 30-40 minute wait to get the ice cream ordered. They yell out your name to have you go up to the counter. You have to push your way through the crowd of people waiting to get your order.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Gretr ice cream sundaes but very much a tourist place.", "Ice cream sundaes were delicious but long lines to get in. Went at night so day may be better. Bought some chocolate bars too and they were good too."], ["Reviewed January 3, 2018", 4.0, "Interesting shops, and of course Ghirardelli chocolate and ice cream", "This is a busy area full of tourists. It was beautifully decorated for Christmas and Hanukkah. The Ghirardelli shop and ice cream restaurant was packed all the time."], ["Reviewed January 2, 2018", 5.0, "YUM!", "This was a delicious stop! We had to hit this place twice. We stopped at the take out place downstairs and got the ice cream to go, just as good and the lines were not as long."], ["Reviewed January 2, 2018", 4.0, "Great stop and place to grab ice cream", "Ghirardelli Square has a nice range of high-end shops and the centerpiece of the square, the Ghirardelli ice cream parlor. The ice cream is incredible and the hot fudge sundaes are not to be missed. It's crowded and a bit expensive, but it's good for all ages. Recommended.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Great ice cream", "Nice area. Long lines. But worth the wait. Parking is difficult. The area has many sea food restaurants. Try Alioto restaurant."], ["Reviewed December 31, 2017", 4.0, "Had Ice creams at Ghiradelli Square", "Visited Ghiradelli Square and shared two ice creams - Butter Scotch & Chocolate Hot Fudge. The first one was average with a one-inch layer of Butterscotch sauce. The second one was good. At the end, not sure of its worth in standing in for a long Q, waiting time for a long time for the service and finally paying a premium price for these!\nShow less"], ["Reviewed December 30, 2017", 4.0, "Great place for dessert!", "We love coming to Ghiradelli Square to have dessert, listen to live music and do a little shopping. It’s really festive in December as they set up a giant Christmas tree and holiday lights are everywhere. Enjoy the samples of chocolate that are handed out as you enter the Ghiradelli Marketplace. Grab a coffee, hot chocolate or a bag of chocolate to go!\nShow less"], ["Reviewed December 28, 2017", 5.0, "Who can miss this?", "When you are in California, how can you miss on going here. A space loaded with chocolates that will make you go mad!"], ["Reviewed December 27, 2017", 3.0, "Amazing stop during the holidays", "Ghirardelli Square has a unique charm. I didn't do any research on it prior to arriving as I kind of wanted to surprised in what we encountered. I think I was expecting a mini-historical tour of the chocolate factory coupled with this extravagant store display. 1 out of the 2 isn't bad. The actual storefronts were pretty amazing. Despite the weather being 51 degrees, we decided to try their world-famous fudge sundaes inside of their heated seating area. What a treat! The girls absolutely loved it and it was such a good memory for us as a family. Beyond the storefront and the mini historical display, Ghirardelli Square is pretty much a outside shopping center with an ok restaurant on the premises.\n\nFirst impression: Loved the Ghirardelli stores and being able to sit down and just embody the environment. Not blown away with all the extra places to shop. Kind of took away from the experience, IMO.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Chocolate to die for", "Our international friends were visiting SF from NYC and we finished off our evening with dessert at Ghirardelli. The sundaes are pricey, but delicious and definitely big enough to share and be satisfied. The line went quickly and was actually quite short. The service is quick as well. Enjoy getting your chocolate on!!\nShow less"], ["Reviewed December 26, 2017", 5.0, "Great chocolate shop and soda fountain", "This square is a fun addition to other wharf tourist attractions. The Ghiradelli shop is fun to browse and the ice cream sundaes while pricey are delicious. Getting a table and service is kind of a challenge but worth the wait. Tip: when the line is long upstairs in the square, the shop down on Beach Street is a better option.\nShow less"], ["Reviewed December 26, 2017", 4.0, "It's all about chocolate here.", "Ghirardelli Square is the hub for the brilliant minds that produce the Ghirardelli brand chocolates which are my favourite. If you enjoy their product then you'll enjoy an hour here. Not much else going on unrelated to chocolate."], ["Reviewed December 22, 2017", 5.0, "If you're a chocolate lover you have to go here!", "As an avid chocolate lover, we visit Ghirardelli Square at least twice when we're in San Francisco. It's chocolate heaven for me!"], ["Reviewed December 22, 2017", 3.0, "Cute place", "The Ghirardelli store was awesome. Great hot chocolate and ice cream. The shopping center was fair. A few good wine bars. Kids enjoyed playing bean bag tosses the most."], ["Reviewed December 21, 2017", 4.0, "Chocolate, chocolate, chocolate!", "Built at the site of the original Ghirardelli chocolate factory (1893), Ghirardelli Square offers several shopping and dining opportunities, but it wouldn't be complete without stopping at the Ghirardelli shop or the Ghirardelli Market. You can buy great hot fudge sundaes, drinks, and many other chocolate confections in a wide variety of packaging. You will be offered a piece of chocolate to sample each time you enter the stores!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Chocolate Heaven!", "I've had a Ghirardelli chocolate sundae in Chicago but nothing compares to trying to squeeze in to the tables at the original SF location and watching the chocolate flow.\n\nProtip: There are so many entrances to different parts of the square and they give you a free sample of chocolate at ALL the entrances. But do also order a sundae because this is the greatest chocolate syrup around.\n\nIt's a fun area with shopping, live music and lots of chocolate. Just be prepared for a crowd and when you see a table, grab it!\nShow less"], ["Reviewed December 20, 2017", 5.0, "Delicious Chocolate", "Extremely popular. We faced long queues on the 2 occasions we visited on our stay in San Francisco in October. Hot fudge sundaes were fantastic and the Golden Gate Banana Split I had on our second visit was also yummy! Extreme indulgence on our part!"], ["Reviewed December 20, 2017", 5.0, "Go to the Ghiradelli Market for HOT FUDGE SUNDAE", "up on the main plaza, get into the Ghirardelli Market- they build and serve a number of delights- the best hot fudge sundae is amazing- lots of tables looking out on the bay - a great place to relax and add calories. MMMMMMM"], ["Reviewed December 19, 2017", 4.0, "Chocolate Awesomeness", "Ghirardelli Square is an area with several shopping and dining opportunities, but it wouldn't be complete without stopping at the Ghirardelli shop. It's not a big store, but the area itself has a lot to offer. You can grab sundaes, candy, drinks, and many other chocolate confections here. Grab some treats and explore the area shops to wind down one evening.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Awesome sundaes!", "A must stop every trip tot he area. We always have to get a giant sundae before shopping in the store to bring home our chocolate fix. It is not cheap, but it is well worth the treat! Serve was fast and friendly."], ["Reviewed December 18, 2017", 3.0, "Smells of chocolate!", "A mall with shops and places to eat. The main attraction is the Ghirardelli shop where you can get all the chocolate your heart desires."], ["Reviewed December 17, 2017", 4.0, "A chocolate lovers dream", "Yummy sundaes sold within a cute shop. Very busy inside, luckily it was warm enough to enjoy our ice creams outside. If you're a fan of chocolate then you'll be in your element!"], ["Reviewed December 13, 2017", 4.0, "Yum", "A must stop for their many chocolate delicacies. Friendly staff and alaways a free sample. Other shops nearby to explore as well."], ["Reviewed December 13, 2017", 5.0, "Best Chocolate", "A place you definitely want to visit to get your chocolate fix. Watch hot chocolate being made as you grab a cup for yourself. You will definitely want to take some home with you. You can also get your favorite Ghirardelli Squares and some extra for gifts. My favorite . . . Dark Chocolate Sea Salt Caramel!\nShow less"], ["Reviewed December 13, 2017", 5.0, "Chocolate!", "A hot fudge sundae is a must. Get a free sample at the store then pick up some chocplate treats for your stay."], ["Reviewed December 10, 2017", 5.0, "2 words: diabetic coma", "If you are a chocolate lover, then this is the place for you especially if you are into dark chocolate. If you are a diabetic and you love chocolate, well...this is still the place for you, just bring your insulin."], ["Reviewed December 7, 2017", 5.0, "Delicious Place!!", "This place is great- the chocolate is a little pricey, but there is nothing that you could want, chocolate wise, that they don't have. And, they are always at the entrances handing out samples!! Get the dark chocolate sundae- it is my favorite sundae on earth so far that I have tried!!\nShow less"], ["Reviewed December 6, 2017", 3.0, "Miss the ambiance of the old area", "Ghiradelli is modernized. It seems kind of lonely to me in its current state. Of course, we got our chocolate but no real reason to hang around to us."], ["Reviewed December 6, 2017", 5.0, "Yummy", "Went to Ghirardelli with the family on vacation. Bought some chocolate to go and we all had a sundae. Line was long but moved quickly. Sundaes were out of this world delicious!!! Definitely need to try them if in the area."], ["Reviewed December 3, 2017", 3.0, "Many Tourist Shops", "We visited here on Thanksgiving Day, but many of the stores were open. Naturally, there is a shop where you can buy Ghirardelli chocolates; there are other shops where you can buy various souvenirs."], ["Reviewed November 30, 2017", 5.0, "A MUST for any chocolate lover!!!", "Be prepared to stand in line and be prepared to die happy! LOL. Ghiradelli is always busy - if you're willing to just buy some chocolate bars or squares and walk on your merry way, that's the simple way to go. You'll get a free sample just for stopping in...but you'll want more, trust me! If you're willing to stand in line a bit - they have a dessert shop - shakes, brownies, ice cream sundaes, sundaes with cookie crumbles..... My husband thought we'd get something quick and go.....he was so wrong, but so worth it. We had the brownie sundae and the mint shake - delicious!\nShow less"], ["Reviewed November 29, 2017", 5.0, "Nice Ice cream Sundae's", "The Sundae offerings here are really nice with nice caramel and chocolate sauces.. The portion size is big.. It also has a display of the chocolate making process, which is interesting. The place tends to be crowded and we may need to wait to get a seat, but a trip there is worth it.\nShow less"], ["Reviewed November 29, 2017", 4.0, "Crowded but Neat", "We went on a holiday weekend so there was an enormous amount of people in the square, but the old buildings are neat and when we went they had a giant Christmas tree and live music."], ["Reviewed November 28, 2017", 5.0, "Go and buy some chocoate!", "I'd bought Ghiradelli chocolates in Florida before but it was great to go to Ghiradelli Square to buy them! I spent a fortune on chocolate to bring home."], ["Reviewed November 26, 2017", 4.0, "Delicious!", "Delicious but expensive treats. Serving sizes are HUGE! So I guess it's not so expensive if you are sharing. Quick service and no crowds early in the morning."], ["Reviewed November 26, 2017", 3.0, "Former headquarters of Ghirardelli Chocolate Factory", "Ghirardelli Square is a public square not far from Fisherman’s Wharf.\n\nIn the late 1800s to early 1960s this building was the headquarters of the Ghirardelli Chocolate Company. In order to preserve the historical Ghirardelli Square it was listed on the National Register of Historic Places.\n\nThe 5 star Fairmont Heritage Place Hotel is located on this site as well as restaurants, bars and Ghirardelli still have a store selling their famous chocolates.\n\nNote:Best to buy chocolates from Walgreens where they can be purchased much cheaper.\nShow less"], ["Reviewed November 26, 2017", 3.0, "Souvenirs!", "Great place to purchase some delicious souvenirs, but there really isn't too much to actually do in the square. Lots of chocolate for sale, and you can have an ice cream sundae, but I wouldn't consider Ghirardelli Square a must see. There are pretty views from the square, and a walk along the water afterward was great.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Fun, neat area!", "This is a great, fun neat area! This is actually where you board the cable cars. Street entertainers and great desserts! How can you go wrong with this?"], ["Reviewed November 21, 2017", 3.0, "Great place for your sweet tooth", "The square has a few restaurants, but we were there for the hot fudge sundae. We waited in line for 20 minutes which was OK as we knew it was just part of the experience. They also have a shop to buy items to go home with. We did see the same things at SFO when we were leaving. Enjoy.\nShow less"], ["Reviewed November 21, 2017", 4.0, "Very interesting. Had heard a lot about it. Yummy chocolate. Good place for souvenir goodies.", "Interesting to see some of the workings which are apparently original. Staff friendly and helpful. There is a very nice courtyard area to relax in. Walkable from fisherman's wharf. Every kind of chocolate imaginable. Worth the visit."], ["Reviewed November 20, 2017", 5.0, "What's not to like.... Chocolate", "I love my chocolate so for me this was a little part of heaven for me. I enjoyed shopping and eating here..."], ["Reviewed November 18, 2017", 4.0, "Had to check it out", "Kept seeing the sign in the distance but finally made it there. Checkeed out the shop and bought some chocolats on special. Very busy so didn't stop for an ice cream here!"], ["Reviewed November 16, 2017", 5.0, "Get the chocolate sundae", "We came here on our honeymoon and shared a chocolate sundae. We had been warned how big they could be but we hadn't had any lunch and so we probably could've eaten one each. But the dessert was delicious. We ate outside and it was such a chilled out place to stay and eat. Thoroughly enjoyed it. Plus you get a free piece of chocolate when you go into the store!\nShow less"], ["Reviewed November 16, 2017", 5.0, "Great shops & Galleries", "We loved walking around this area & shopping. It has a lot to offer & reasonable prices as well, a definite to do is to pop into The Buena Vista Cafe for their famous Irish Coffee's!!! Amazing!!"], ["Reviewed November 15, 2017", 5.0, "Delicious!!!", "This is a must do if you have a sweet tooth. Great store to buy a souvenir in or grab a seat and enjoy a delicious dessert."], ["Reviewed November 15, 2017", 5.0, "Mouth-watering Goodies!", "The chocolate selections are delicious and there are a number to choose from! They have seasonal products too! Amazingly good!"], ["Reviewed November 15, 2017", 5.0, "Chocolate and ice cream. What more do you want!", "Great place to relax and take a ice cream break. Many shops to see too! Ghirardelli is the best to go to. The chocolate is the best."], ["Reviewed November 14, 2017", 4.0, "Friendly Staff", "We dropped in to buy a little chocolate. The girl who helped us out was very friendly, and very generous allowing us (me) to sample quite a variety. So, we ended up buying a lot of chocolate."], ["Reviewed November 14, 2017", 4.0, "Chocolate and ice cream", "If you want ice cream or chocolate this is the place to go! There are a lot of restaurants and shops and lots of interesting architecture to see."], ["Reviewed November 13, 2017", 4.0, "For All You Sweet Lovers!", "Ghirardelli is known for it's high quality chocolate. Here you will find so many varieties of sweets to meet your needs. Take your significant other, family member, or simply treat yourself to a delicious dessert.\n\nTraveler Tip: It does often get crowded and sometimes there are not enough cashiers so just be aware and make extra time if you need to be somewhere at a specific time (ie. like catch a ferry or show).\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 13, 2017", 2.0, "Not sure what the fuss is about", "Stayed at Fishermans Wharf prior to a cruise and I was so looking forward to a stop at Ghiradelli Square. We went on a Sunday morning. Ghiradelli was open and there were several shops bit not much else. I was disappointed."], ["Reviewed November 13, 2017", 4.0, "Chocolate", "Family had to stop and have a Chocolate Sunday. Excellent and worth every calorie. Good place to pick up chocolate for later too."], ["Reviewed November 13, 2017", 1.0, "Horrible Staff. Never coming back again!", "I visited San Francisco for a day. I decided to stop by Ghirardelli because I had to wait for my husband to get to the city from his meeting. I got a hot chocolate and some cookies. I knew my drink was supposed to come with a Ghirardelli chocolate, when I asked for it, it was just given to me without a word. Keep in mind it was not busy. Since I was traveling all day, my phone went out of battery, my portable charger went out of battery, and I literally couldn't leave the store because I don't know the city. I asked a couple of the people working at the store, NONE of them \"had an Iphone charger\"... In the meantime, a bunch of homeless people walked in some screaming... Overall terrible experience, none of the people that work there care about their customers. I am really glad I moved to Asia, I do not miss the American hospitality (only nice when you have a tip) I lived in Chicago for 9 years, and I heard from friends that people in California are nicer.. I guess not. I never experienced this in China or in Taiwan. Where they actually treat people like people. Have fun keeping loyal customers.Never coming back again. Plenty of other amazing chocolate companies in the world.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Earthquake all the way", "There was 5 in our party and the Earthquake, was the best for us all to try 8 different ice creams and toppings. We all enjoyed it and would recommend it to any large party."], ["Reviewed November 12, 2017", 4.0, "Walk around or just sit down or find a good restaurant or just look at the architecture of this old chocolate factory", "Ghirardelli square has much to offer, not only good restaurants and a hotel located in this old chocolate factory. its just two minutes walk from the famous, open trams going by a wire or 5-10 minutes from fishermen wharf or 10 minutes walk from Golden Gate. Enjoy!\nShow less"], ["Reviewed November 12, 2017", 4.0, "Classic place to check off your list", "Look, we all know it's overpriced. And no one goes here looking for health food. But it's Ghirardelli. And the chocolate is outstanding. You can buy it cheaper in any retail store, but there is something about enjoying a hot fudge sundae made with Ghirardelli fudge, looking out at Alcatraz from a viewpoint above Fisherman's Wharf. The free peppermint bark squares were a hit, too!\nShow less"], ["Reviewed November 12, 2017", 5.0, "SWEET TREATS!", "You can't go wrong ordering anything here! Everything is delicious. On a chilly night, try the hot steamed milk with add your own chocolate candy for a wonderful hot chocolate! WOW!!!"], ["Reviewed November 9, 2017", 5.0, "What’s not to love!", "Calling all chocoholics...this is your happy place! Huge bats of chocolate to view and enjoy while you enjoy your own piece of chocolate. And the hot fudge sundaes are enormous."], ["Reviewed November 9, 2017", 4.0, "Chocolate, Restuarants and Shopping", "The iconic clock tower is visible from the street. Definitely a tourist stop for many and it's usually crowded. The shops are varied. I thought the prices were high but no worse than the rest of the city. The historic building that housed Ghiradelli chocolates is now a place to shop and dine.\n\nPrepare to wait in line wherever you go. I recommend parking in a ramp.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Outdoor fun", "Fun area for entertainment, resting in green space, eating delicious ice cream & walking along boardwalks."], ["Reviewed November 8, 2017", 5.0, "Must on every traveller's iternary", "We visited Ghirardeli square to enjoy Ghirardeli icecreams. All icecrems are home made and the taste is awesome. One must visit the point to taste the most famous icecream brand of SFO."], ["Reviewed November 8, 2017", 5.0, "Don't skip this place!!", "I started coming here when I was 18 and on a high school choir trip. Since that time, every time I go to San Francisco I make sure to go by the Ghirardelli Chocolate Factory. They have amazing chocolates, but even more amazing ice cream sundaes. If you visit on a weekend or during a popular time, expect long lines; however, it's worth the wait.....\nShow less"], ["Reviewed November 8, 2017", 4.0, "Historic Site", "It was nice to walk around the buildings where the original Ghirardelli Factory was. It presently is occupied by the Fairmont Residences, many other local stores and 3 or 4 Ghirardelli retail stores selling various goods and ice cream. If you want the shorter line go inside the courtyard and there is a Ghirardelli store there that sells sundaes, milkshakes and chocolates. There is seating for patrons to enjoy there purchases.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great place to go", "We stopped here twice for our chocolate souvineers to bring back home. Even got a free sample as we walked in."], ["Reviewed November 8, 2017", 5.0, "Don't Miss Ghirardelli!", "My family and I come to the square every year we're in San Francisco. First make a stop at the chocolate store where they hand out free samples of chocolate, and then head over to the restaurant and order the brownie sundae. It is one of the best things you will eat in your life!\nShow less"], ["Reviewed November 8, 2017", 3.0, "Love chocolate? Get out your $$$", "Fun to visit and see. It is, however, mostly a place to purchase. You can buy ice cream, hot chocolate, chocolates to take with you, to eat, to share. But it was fun to stop here."], ["Reviewed November 8, 2017", 4.0, "How sweet it is!", "Our stop to Ghirardelli Square was was a chocolate tasters delight-from the samples to get your mouth watering to the actual purchase of some of the famous candy."], ["Reviewed November 6, 2017", 5.0, "Never miss Ghiradelli", "Love this place even though it is expensive for what you actually get\nQuality is apparent but the serving size seems to have gone down a little alot of foamy whipped cream on top of the sundaes and a little less ice cream but you have to go as both the chocalate and the ice cream are wonderful\nShow less"], ["Reviewed November 6, 2017", 3.0, "Ghirardelli Square", "We did not find anything there for us. we had an ice-cream and sat for a while. took a couple of photos"], ["Reviewed November 6, 2017", 5.0, "MUST MUST GO!", "Ghirardelli Square is home to the most amazing chocolate and fudge. Yes, you can find their chocolates around the globe, but nowhere is it as fresh as at their own restaurant! The world famous Chocolate Hot Fudge Sundae is out of this world! There are many charming shops in the Square as well, making it a highlight of a visit to Fisherman's Wharf!\nShow less"], ["Reviewed November 4, 2017", 5.0, "Great chocolate!", "There were queues out the door for the cafe so we didn’t get to try their famous hot chocolate, but we did pop in the shop to purchase some chocolates to take home. We also got a free sample which was a nice touch. Fab chocolate and well worth a visit!\nShow less"], ["Reviewed November 4, 2017", 2.0, "Ghiradelli Square used to be a fun place with a variety of small shops and restaurants.", "Now that the the Fairmont Hotel Ghiradelli Square has become the principle tenant, the square has lost its appeal of finding unique little places with unique offerings. Years ago, there was a store there, The Two Virgins, and they specialized in gourmet mustards. Now it's difficult to find a public bathroom unless you're there for the hotel offerings. Sad, but that's business today..\nShow less"], ["Reviewed November 4, 2017", 5.0, "Samples!!!", "Who doesn't like free chocolates?! They were giving away free samples here. I think they do it regularly. Also, a very pretty place to walk around, not far from the pier. The sundaes looked amazing! We didn't partake. Too full from the generous handouts. A fun place not to be missed in SF.\nShow less"], ["Reviewed November 2, 2017", 4.0, "Chocolate Capital of World", "I find visit to fisherman's wharf incomplete without a visit to Ghirardelli Square. The variety is amazing and I have just touched tip of iceberg in last 8-9 visits, will come back for more"], ["Reviewed November 2, 2017", 4.0, "Beautiful square.", "Home to Ghirardelli candy,free samples as soon as you walk in. This is an expensive square with upscale shops. It is clean and modern. Although it's near the wharf they have no homeless and worth the trip."], ["Reviewed November 1, 2017", 5.0, "HOT CHOCOLATE", "I was told by a friend to go and get the hot chocolate so we walked from the pier to see what the hype was about. We ordered hot chocolates and a hot fudge brownie sundae. The hot chocolate was absolutely amazing!!! It was worth the walk and the climb. We ended up buying some boxes of the hot chocolate to bring home with us.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Wow -- chocolate heaven!", "This is truly chocolate heaven. So many delights to choose from it was difficult. The entire shopping area is so nice too with great restrooms. You just have to go and try the ice cream!"], ["Reviewed November 1, 2017", 4.0, "Chocoholic Paradise", "You smell the chocolate before entering the building, where we were given a small sample at the door - a small café is available and plenty of chocolates. It was interesting to see an exhibition of how the chocolate as we know it is manufactured from the cocoa beans - educational for the children.\nShow less"], ["Reviewed November 1, 2017", 5.0, "chocolate, chocolate and more chocolate", "It is exactly what it is a BIG chocolate shop with lots of choices to buy that friend or relative a present and the free samples are always great"], ["Reviewed October 31, 2017", 4.0, "Great views of Alcatraz!", "There are good restaurants in this area, as well as a lot of shops. The latter are 'tourist' attractions, where the prices are higher than you will find in other areas of San Francisco. Before you purchase something, shop in another location to see if you can find it cheaper...and in most cases you will.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Yummy !", "When we lived in San Francisco we used to have a hot fudge sundae at Ghirardelli. Visiting the city again, it was the right place for our after dinner dessert. We also picked up some chocolates to take back home."], ["Reviewed October 30, 2017", 4.0, "Seems like every other store was empty.", "Having been to the square before, I wanted to take my daughter there. The chocolate store was very blah with their lackluster handing out of the same tired salted caramel tiny square and then the rest of the stores in the shopping square were either closed or just boring Knick knacks. We were both very dissappointed after having walked there from downtown.\nShow less"], ["Reviewed October 30, 2017", 2.0, "Not impressive...", "Relatives wanted sundaes at Ghirardelli which was expensive. Not much open on the afternoon of Oct 26th, and I would've liked a beer, but no bars around. Expensive little shops abound, but just not my cup of tea. Not impressed, so met my expectations which weren't high to begin with. Public bathrooms were ok - not very clean but usable.\nShow less"], ["Reviewed October 29, 2017", 5.0, "We went back twice!", "Parking is available both on street and in garage here. Cute shops, beautiful views, two wineries, restaurants, and of course the Ghirardelli shop! Expect a line to get their famous sundae, but it's worth the wait and calories. Not overly crowded (we were there Saturday and Sunday) which was nice. We had a stroller and it is accessible, but finding the ramps and elevators can be tricky traveling between levels.Public restrooms were clean.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Chocolate!", "Normally when businesses leave the city their buildings go into disuse, crumble and become eyesores. Thankfully someone had the idea to revitalize the Ghirardelli works into a trendy area. Been here many times - usually to make an ice cream sundae or get some chocolate. Enjoy the other shops and restaurants here as well - great night time views out over the bay and Alcatraz. Yes, it is touristy but with class.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Best Tourist Trap", "When I was a teenager I used to have a hot fudge sundae at Ghirardelli. There were no tourist lines in those days. It's different now, but they still have the best hot fudge sundae ever, just not a big. Just as well, I suppose. My body doesn't need all that sugar. I wish they sold hard fudge.\nShow less"], ["Reviewed October 27, 2017", 3.0, "not a big fan of their chocolates", "not a big fan of their chocolates or touristy places.. not sure how i ended up there but i did.... you can find much better places in his beautiful city.."], ["Reviewed October 27, 2017", 3.0, "Free chocolate square is nice touch", "You should go once. Every guest is greeted and handed a free chocolate square. Nice touch in today’s world. Ice Cream parlor yummy selections."], ["Reviewed October 26, 2017", 3.0, "Ghirardelli OK, square not so much.", "We arrived a little after 6 in the afternoon. The Ghirardelli portion was open and hopping, but the rest of the square was mainly closed, with very restrictive opening hours posted. A couple shops remained open, but if you're looking for that special \"different\" souvenir, better go elsewhere if you're around the dinner hour. This place shuts down.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Sweet spot", "Pretty little shopping area. Enjoyed wine tasting at Wattle Creek Winery. A little confusing and overwhelming at the Ghiradelli store to see where to order/pay. Nice to get free samples!"], ["Reviewed October 25, 2017", 5.0, "Cocoa Float!", "Obviously this is a huge tourist trap but I live no where near a Ghirardelli so I had to stop and grab a cocoa float. The line moves rather quickly here but it will take a minute for your order to come up. There’s a gift shop in the same area you order food/drinks that has all of the trappings you would expect.\n\nIf you’re not a huge fan of Ghirardelli I would honestly skip it, but if you’re looking for an awesome treat after dinner this is a great spot to walk over from Fisherman’s Wharf.\nShow less"], ["Reviewed October 24, 2017", 3.0, "Choc-o-holic !", "If you like chocolate and don’t mind getting in a huge crowd of people waiting to spend your $15.00, give it a shot."], ["Reviewed October 24, 2017", 3.0, "Strictly for the Tourists", "I wasn't really impressed with this attraction. Lots of shops with overpriced T-shirts and San Francisco memorabilia, as well as unoriginal restaurants designed to get you to spend your hard earned cash on average quality food. Lots of neon, lots of garbage, lingering, unpleasant smells....I'd skip this attraction - It just isn't what it used to be!\nShow less"], ["Reviewed October 24, 2017", 5.0, "Just go for the chocolate!", "We just went for the chocolate. The place is pretty small and geared toward the tourist to buy. Outdoor seating only. Service was quick and very polite."], ["Reviewed October 23, 2017", 3.0, "A little way out", "We didn't find this ace too appealing. There are shops but they don't seem to attract us. We don't really go for ice creams. We don't really shop so. A little quick wander around was enough for us before we moved on. Not really happening."], ["Reviewed October 23, 2017", 4.0, "Fun, Tourist Trap", "Would highly recommend indulging in a way-too-sweet sundae and hot chocolate, followed by a walk around the square. Nice night out for out-of-towners and locals. There are also some neat bars nearby."], ["Reviewed October 23, 2017", 4.0, "Chocolate and more", "A handful of various shops and restaurants, but of course we had the world famous hot fudge sundae at the Ghirardelli market (this is the perfect size to share). Great views, also has a large park area where people were having picnics and playing in the water.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Chocolate, Chocolate, Chocolate!", "If you love chocolate, ya gotta check this place out. Besides the great candy, you can get ice cream, sundaes, cocoa, anything chocolate. And it's all really, really good. There are also places to eat and lots of cute shops. But really, it was all about the chocolate for me.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Lots more than chocolate", "There is chocolate, of course. There are also shops and food. It's close to other attractions and activities."], ["Reviewed October 22, 2017", 4.0, "Amazing ice cream", "Nice place with good View. Lots of Chocolate shops and places To eat ice cream. The ice cream Is amazing - definitely worth a visit"], ["Reviewed October 22, 2017", 4.0, "Chocolate lovers paradise", "Great ice cream sundaes, free samples in the shop , good selection of chocolate . Don't miss here if you are visiting San Fran"], ["Reviewed October 21, 2017", 3.0, "Chocolate hunt", "We walked there because it was a big tourist area. Not a lot to see that we were aware of since they no longer make the candy there."], ["Reviewed October 21, 2017", 3.0, "Chocolate store only thing impressive", "The Ghirardelli Square itself is really nice, and the chocolate store is quite a treat for adults and kids! Other than that, nothing out of the ordinary- standard shops and restaurants...."], ["Reviewed October 20, 2017", 3.0, "Kind of fun to look around.", "They gave us a free sample of chocolate so that was nice. They have some interesting food and souvenirs."], ["Reviewed October 20, 2017", 5.0, "Heaven for chocolate lovers", "This place is amazing for chocolate lovers! They have very delicious sundae(s). Don't forget to buy chocolate gift packs for friends and family from the gift shop. There was a huge queue to get a place inside but it was moving quickly."], ["Reviewed October 18, 2017", 4.0, "A Great Day in San Francisco", "We went into San Francisco to spend the day with our kids. We didn't really have a solid plan but as it turns out it was Fleet Week and the Blue Angels were scheduled to perform. We decided to go to\nGhirardelli Square to watch the show. It was already crowded but we found a spot to watch. The square was easy to get to and there was plenty of room for the crowds. We also walked up to get a sweet treat and even though there was a line out the door, we were in quickly and had out order brought to our table in no time. Everyone was pleased with their treat and I had the best chocolate shake I've had in years! It was expensive, but EVERYTHING in SF is expensive! That being said, I'd go back next time I'm in the bay area.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Lovely village and great for chocoholics!", "Although we were too full from breakfast to have any ice cream or chocolate, there were lots of people tucking into what look liked amazing deserts.\n\nA massive selection in the chocolate shops and lots of lovely independent shops. I would strongly reccomend the dog shop! Very knowledgeable and great products.\n\nEveryone was very friendly!\nShow less"], ["Reviewed October 16, 2017", 4.0, "Must do experience!", "Unfortunately they were out of the chocolate chip cookie sundae I wanted to try, but this place is AMAZING! Honestly, it is worth trying at least once. The original sundae with the brownie was amazing."], ["Reviewed October 16, 2017", 5.0, "Chocolate ring a bell?", "Once you enter the store you be in for a treat, lots of sweet treats. Ghirardelli's chocolates plus. so much to try."], ["Reviewed October 16, 2017", 4.0, "Grab an ice cream", "Walked to Ghirardelli to get some ice cream before catching the cable car. It’s pretty busy but they do their best to get everything out. The more complex the ice cream the longer it takes. There is some seating, but not a ton. The ice cream was good, the toppings were plentiful. The bigger chocolate store is on the upper level along with more food and drinks.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Bit too touristy", "Stopped off here on the way back from visiting Golden Gate Bridge. A very interesting building with some nice niche shops, the best of which was definitely the Ghirardelli Chocolate Shops (albeit quite expensive). We were asked to taste some new chocolate cookies which was nice and very tasty. We ate at Lori’s Diner (see separate review) and loved it\nShow less"], ["Reviewed October 16, 2017", 5.0, "Chocolate!", "Ghiradelli Square has a soda fountain at this location and we ate here twice! It was delicious! You can watch some of the chocolate making process as well. We got the brownie sundae once and a chocolate dipped cone. Both were super yummy!"], ["Reviewed October 16, 2017", 4.0, "Chocolate lovers paradise", "Great place to have a famous ice cream sundae or banana split. Lots of people here look pre-diabetic, so go easy on the sugar if you don't plan to exercise."], ["Reviewed October 15, 2017", 5.0, "One word: chocolate", "One of my favorite reasons to stop in San Francisco. This chocolate is the best. A can't miss if in San Francisco."], ["Reviewed October 15, 2017", 4.0, "YUMMY", "Really, no other words are necessary - but there is a minimum count here, so my advice to chocolate lovers - come see this place!"], ["Reviewed October 15, 2017", 5.0, "Must visit", "What a great place for chocolate lovers. It’s fantastic range of chocolate has to be seen and it’s fab quality."], ["Reviewed October 14, 2017", 5.0, "For the sweet toothed", "This is the old chocolate factory. It is now been made into eateries of chocolate. As you walk in through the doors, there is a member of staff giving chocolates away."], ["Reviewed October 13, 2017", 5.0, "Delicious treat!", "We both had a Crissy Field which was absolutely amazing! Really, one between us would have been better as it was so big."], ["Reviewed October 13, 2017", 4.0, "An ice cream lovers idea of heaven", "No stop would be complete without visiting Ghirardelli ice cream parlour and chocolate shop. It is expensive but the ice cream is delicious and they give out free samples in the shop."], ["Reviewed October 12, 2017", 4.0, "fun shops", "it is a nice area to have lunch and dessert, the only dowside is that parking is crazy expensive. so i would try your chances on parking on the street. we were here only two hours and had to pay $21 for parking."], ["Reviewed October 12, 2017", 4.0, "Delish, delightful.", "Don't pass on the ice cream treats, just grab two spoons. The demonstration was a little weak but the chocolate made up for it."], ["Reviewed October 11, 2017", 5.0, "Yummy", "Had a sundae. Delicious and quite large. Very nice atmosphere. Also visited the candy shop and enjoyed the free sample of chocolates. So good I bought some to bring home to my grandchildren"], ["Reviewed October 11, 2017", 5.0, "THe Soda Shop is Great for Families", "Lot's of choices ranging from traditional (e.g. bananna split) to trendy (pumpkin caramel shake). Everything was excellent quality. The service was fast, albeit impersonal due to the volume of people. My family ejoyed the experience very much."], ["Reviewed October 11, 2017", 5.0, "Go for the chocolate, try the Painted Ladies!", "I agree with Caribbean757 that there's not a tremendous amount to \"do\" at Ghirardelli Square, but it is still worth the visit. An easy walk from Pier 39, it is a pretty square with lovely sculptures, fountains and architecture. The chocolate is world-class, but you have to try the Painted Ladies, an assortment of ice cream sundaes in tall glasses. Worth the trip all by themselves. Have dinner in one of the restaurants overlooking the bay, and try to time your trip so you're there at sunset - the pictures you get as the lights come on are terrific. Highly recommended!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Ghirardelli square", "Really cool place to stop and have a dessert! Watch them make chocolate and order ice cream or shake. Worth the pit stop."], ["Reviewed October 11, 2017", 4.0, "Expensive", "This is a famous Square, and very busy. The stores, selling Ghirardelli goods takes advantage of this, and the lines for ice cream, or chocolate, are out the door. However, the cost does seem higher than other stores selling their goods."], ["Reviewed October 10, 2017", 4.0, "Chocolate…and lots of it", "We stood at the long queue to get a table and it was worth the wait. The signature ice cream delight, brownies and chocolate drink could energize anyone who had to wait long to get seated. Added attraction is a small chocolate making machine with milk chocolate flowing all over.\nShow less"], ["Reviewed October 10, 2017", 5.0, "yum", "We visited both shops and got or free sample of pumpkin spiced chocolate - oh it is so good. We also went for ice cream - yummy."], ["Reviewed October 10, 2017", 5.0, "Most amazing ice cream", "The most amazing ice cream and chocolate shop, supposedly very famous and I can see why! A visit is a must 👍"], ["Reviewed October 9, 2017", 3.0, "Interesting building, not so much to do", "Other than Ghirardelli chocolate, not much to see. Very few shops. Very much a tourist place. Building is interesting in a historic way but not much other than that."], ["Reviewed October 9, 2017", 5.0, "Choicest Ice creams at Ghiradelli", "Last Saturday afternoon , after our visit to SFMOMA , we walked into the famous Ghiradelli Ice cream shop . They are very famous in San Francisco for a wide range of ice cream flavors and some good chocolates which you can carry home for gifts to friends and relatives. A great place to unwind.\nShow less"], ["Reviewed October 9, 2017", 3.0, "A lot of hype", "Meh. A lot of hype for a lot of expensive chocolate. $11.95 for a chocolate sundae. Not all that impressive. Next time we'll skip it."], ["Reviewed October 9, 2017", 5.0, "Do not miss Ghirardelli's!", "We had the best sundaes ever and only propriety kept us from licking the dish. It was very busy that day, but our service was very prompt. And, of course, our sundaes were excellent!"], ["Reviewed October 8, 2017", 4.0, "For all chocolate lovers", "We went here and wanted to buy all 😊 it is only for chocolate lovers and all the chocolates are soo tasty"], ["Reviewed October 8, 2017", 5.0, "Delicious chocolate with generous samples", "There are actually 3 ghiradelli shops here! Love their full size samples as you walk in the door! That's why I bought two bags of their pumpkin spice caramel...delicious!! Easy walk to the waterfront."], ["Reviewed October 8, 2017", 5.0, "National Historic Landmark worth a visit", "Now a National Historic Landmark property, Ghirardelli Square dates from 1864. First a factory for making Civil War uniforms, and after 1893 a chocolate factory(sniff the bricks because you can still smell the chocolate), it is now a multilevel mall with restaurants, shops and exclusive condominiums. The Ghirardelli Chocolate Company operates an old fashioned ice cream parlor where the line for service is always out the door. The Nob Hill sundae and hot fudge sundaes are worth the stop.\nPanoramic Views of the bridge and bay are excellent. At night the stings of lights around the buildings are lovely. There are frequent street performers at the fountain area and plenty of places to enjoy a drink, including an outdoor beer garden. The Hyde Street Cable Car line stops one block from Ghirardelli Square.\nShow less"], ["Reviewed October 8, 2017", 4.0, "Holiday", "This is a good place to go for chocolate lovers there is plenty of free samples to taste there is shops and resturants here ."], ["Reviewed October 7, 2017", 5.0, "Chocoholic's heaven", "Here and other locations throughout the city, you can enjoy a delicious chocolate shake or decadent hot chocolate. Samples of the season's pumpkin spice were passed out. Of course, we chose a sample package to bring home and savor. Several specialty shops offered souvenirs."], ["Reviewed October 7, 2017", 5.0, "If you have a sweet tooth...", "...this is the place to go. There is often a line, but having an ice cream at this classic eatery is a must for all tourists to San Francisco. Easy access to the cable car system, although the line is often very long."], ["Reviewed October 7, 2017", 5.0, "One of the best places for ice cream in San Francisco", "The Ghirardelli name has become world famous for their world class chocolates and ice creams. A visit to San Francisco is never complete without eating ice cream at Ghirardelli square near Pier 39.\n\nTry their mint bliss (dollop of green mint chocolate and dark chocolate) chocolate sundae with fudge in a chocolate coated waffle cone bowl - simply yummylicious! ($16). Each serving can be shared by 2 people unless you are possessive like me about your ice cream! A must visit!\nShow less"], ["Reviewed October 6, 2017", 4.0, "Chocolate paradise", "Historic facility done right. Consists of a number of boutique chocolate shops and ice cream parlour. Nice sitting areas and drinks patios. The smell is mmmmmhhhh!"]]}}