{"Giant Forest": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Giant Forest", "url": "/Attraction_Review-g143050-d146441-Reviews-Giant_Forest-Sequoia_and_Kings_Canyon_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/12/db/21/looking-up-from-inside.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1458"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 weeks ago", 5.0, "Amazingly beautiful", "To fathom that these trees have been around when Jesus walked the earth and before him in Roman times blows my mind. They are so incredibly impressive and beautiful- o am in awe and deep gratitude to have had the opportunity to spend time with them!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Family Trip", "Giant Forest, beautiful place to visit, many places to stop and take trail, definitely recommend, must see, worth to go there"], ["Reviewed 4 weeks ago", 5.0, "Stunning", "The Giant Forest is one of the most remarkable forests you’ll ever see. A beautiful and peaceful walk will surely leave you in awe"], ["Reviewed January 22, 2018", 4.0, "A wonder of nature worth seeing", "Hard to impress our teens these days but the giant sequoias really impressed them. The Giants are very awe-inspiring. Many places to pull off and take a trail to be amongst these massive trees. The museum/information center is also a 'must see' stop. Definitely recommend."], ["Reviewed January 18, 2018", 5.0, "Stunning", "Nothing prepared us for this view. It was stunning. The park in general is well kept, ample parking and very clean"], ["Reviewed January 16, 2018", 5.0, "Little human stading between legends.", "I don't know how to explain what you feel when you look up to a sequoia, but is absolutely and experience you need to have at some point in your life."], ["Reviewed January 13, 2018", 4.0, "Autumnal walk through giant trees", "We enjoyed walking through the forest admiring the amazing scale and size of these giant trees. We enjoyed exploring a number of different trails during our day trip through Sequoia NP, one trail towards Moro rock, another around the crescent meadow, one at grant grove, and we drove through tunnel log.\nShow less"], ["Reviewed January 8, 2018", 5.0, "AMAZING!", "This is definitely a must see, bucket list visit. Beautiful, preserved environment, wonderful views, fabulous paths/trails."], ["Reviewed December 28, 2017", 5.0, "Nice walk and good info along the path.", "Paved path. Relatively short walk for hikers, but with a slope that will work you if you're not in shape. Good info placed along the path. Beautiful views of the forest and significant trees, of course."], ["Reviewed December 18, 2017", 5.0, "Amazing", "Beautiful surroundings. Easy to navigate without a map. Many photo ops. Loved it here. Cant wait to return"], ["Reviewed December 6, 2017", 5.0, "“Trees Out of Time”", "Pictures can’t do it justice. Seeing giant sequoias is a breath taking experience. They are giants out of time and it is hard to believe the largest ones existed for over 1,000yrs! Their future doesn’t seem bright primarily due to global warming. I highly recommend visiting this humbling place.\n\nThere are many trails you can stroll through. I recommend starting early and strolling further out to beat the crowd.\nShow less"], ["Reviewed December 3, 2017", 4.0, "Lots of Trails and Giant Sequoia’s", "There are many giant Sequoias located within the grove and many trails to wander and take in the natural beauty of these wonders. These trees are amongst the oldest and largest on earth. Take time to explore this area and enjoy some of the treasures of nature.\nShow less"], ["Reviewed November 26, 2017", 4.0, "A most for those who have never seen the Giant Redwoods", "Some the of the biggest trees in the world, The Biggest: General Sherman is here, The 2nd Largest, Grant and the 4th largest tree is Lincoln located all in the park.\nThe Giant Forest may not have the water falls and dooms of Yosemite but it has 1000 Year old trees that are still growing and can be viewed year round unlike falls that can dry up or freeze over\nShow less"], ["Reviewed November 20, 2017", 5.0, "a serene day trip", "My partner and I took a day trip to Sequoia NP and it was quite beautiful! If you love getting out into the fresh air and communing with nature, then this park and this forest will not disappoint! It was not overcrowded like most NPs can be (I think people forget about it?), which only added to its serenity. Go see for yourself!\nShow less"], ["Reviewed November 16, 2017", 5.0, "Highly Recommend visiting this place at least once in your life time!", "This place is amazing I was in awe of the beauty and peace this place brings! Good for the whole family to visit but it gets chilly so make sure you bring your sweater or jacket! Also be prepared to walk a lot! And make sure to fill up on gas before entering the park! There no gas station inside !\nShow less"], ["Reviewed November 6, 2017", 5.0, "weekend trip to John Muir Lodge", "Giant forest in Sequoia National Park is a beautiful place to visit enjoying the benefits of camping, hiking or staying in a lodge."], ["Reviewed November 3, 2017", 5.0, "Majestic trees", "We drove up from LA to visit the Park. We had never been there . It was around a 4-41/2 hr drive. Be prepared after you go through the entrance booth for a winding , curvy, road with hairpin curves, many switchbacks as you drive 19 -20 miles of beautiful scenery . You have to drive carefully, but there are cutout spots to get out to take pictures all along the \"General's Highway. Then they start appearing after the 4000' elevation . The Sequoia's are amazingly awesome. Must see the Tunnel,The Sentinel, The Gen. Sherman tree.and more. The fog and clouds got very thick around the Tunnel Tree on a overcast day, but defiantly worth seeing.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Amazing Trees", "The Giant Forest is an area with a high concentration of giant Sequoias; I think I read there are over 2,000 of them here. Apparently, the soil and climate are ideal for these trees. There are many trails running through this area and you can see many of the trees from the General’s Highway as well. The center of the area is the Giant Forest Museum, which is roughly 20 miles north of the park south entrance on the General’s Highway. Although Sequoia NP is huge and has many miles of hiking trails, the Giant Forest is arguably the best area to see these amazing trees. Anyone can intellectually understand the concept of a giant tree, but I did not appreciate the emotional impact that seeing these trees would create. As you drive or walk through the forest and encounter a sequoia towering over and dwarfing the other trees it has a definite impact. They are, quite simply, awe inspiring.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Joe G", "You stand surrounded by neck-stretching giants, like a midget in a biker bar. Inspiration everywhere you look."], ["Reviewed October 26, 2017", 5.0, "Trip of a lifetime!", "If you enjoy nature at all, this place will be a dream come true. I literally was awe-struck at the magnificence and beauty of these massive trees.\n\nThey are incredible to look at and pictures just cannot do justice for the girth and height of these! Definitely come see them in person!\n\nIt was a bucket list item for me - and I couldn't be happier we were able to visit.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Lovely", "A beautiful spot and less crowded than general Sherman. You can get closer to the trees and see them in all their different stages of life"], ["Reviewed October 21, 2017", 3.0, "Prefer the redwoods", "Nice to experience the giant trees but after a while it is all the same. Not as impressive as driving through the redwoods."], ["Reviewed October 20, 2017", 5.0, "Stroll through the forest", "Since these trees only grow in only a few places on earth, to be able to walk among so many of them in one place is almost a religious experience. Don't just rush in to see the General Sherman tree and then leave. You will miss the truly remarkable grove of giants that many prople will never see or even imagine in their lifetime. Besides, we saw multiple types of wildlife the further we distanced ourselves from the main tourist attraction of the General Sherman tree.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Impressive", "These trees are amazing and after stopping to the Giant Forest Visitor center learning more about them made all that more amazing."], ["Reviewed October 18, 2017", 5.0, "Picnic in Sequoia and Kings Canyon National Park.", "Spent most of a day exploring the woods and admiring the tall red woods. Make sure you have a cardigan or jacket as it is chilly in the woods. Amazing place"], ["Reviewed October 17, 2017", 5.0, "Magnificent Trees- Winding Road to the Forest!", "We thoroughly enjoyed our time in the Giant Forest. We only had one day so we used a tour company and being tired from travel across the country, we were truly happy to sit back and enjoy the views versus concentrating on driving the 100's of turns. Favorite stops were Sherman's Tree - spectacular but also VERY busy. You may want to try the morning to get a pictures without waiting. We enjoyed climbing Moro Rock. It take 15 - 20 minutes and almost everyone was huffing & puffing on the way up (approx. 6500 altitude at top) but on a clear day the views would be amazing. We had smoke from the Napa fires so the view was hazy but still worth the climb. It's a fun climb as it winds around, with passes that only one person at a time can navigate. The way down was easy & quick (not tough on my bad knees as some downward climbs). We stopped and took pictures at tunnel rock, the auto tree and other designed tourists areas when the park was first open. The true enjoyment is looking at the beauty of these trees - really awe-inspiring. If you are looking for wildlife, this park has black bear warnings but we did not see any and our guide said she has seen perhaps 10 all year. Take precaution but other parks on Montana & Wyoming would be more appropriate if wildlife viewing was a goal.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Pictures and Words Can’t Do It Justice", "A must see... that’s all I really want to say..\nBut I have to say more....\nStunning... Beautiful.... Otherwordly....\nStanding among these giants really humbles our place on the planet.... I’d have to say this ranks up there Uluru, The Grand Canyon, and Victoria Falls as a place that filled me with awe....\nShow less"], ["Reviewed October 13, 2017", 5.0, "Beautiful Trails", "The trails were very beautiful with giant trees. It reminded me of a fairy land. We hiked right by a bear. He didn't seem to care. Think he was taking a nap because he just looked at us and went right back down to sleep."], ["Reviewed October 12, 2017", 5.0, "simply amazing", "it is just simply amazing to see these giant trees, from a small seed to a giant. learn how they grow from fire and turn it into their advantage."], ["Reviewed October 11, 2017", 4.0, "Kings Canyon", "we did this park on the way to Yosemite on the advice of a friend. WHAT a find! this park is small, but the punch it left on our souls will never be forgotten. We stayed in the park lodge and saw a black bear the 2nd morning within 100 yards of our door. The trees were AMAZING - these sequoias are huge in diameter though not as tall as the northern coastal redwoods. i am so glad my friend suggested this park - what a shame it would have been to have missed this on the way to Yosemite.\nShow less"], ["Reviewed October 10, 2017", 5.0, "I would highly recommend it", "This is a very easy trail and would highly recommend it. Very peaceful setting and had several interactive signs along the way to read. Starts out at the museum ends in the parking lot"], ["Reviewed October 9, 2017", 5.0, "Favorite hike within the Sequoias", "This was our favorite of the hikes we did within the park. Plenty of giant sequoias to see and easy trail. We also got the privilege of seeing one of the local black bears while we were hiking."], ["Reviewed October 9, 2017", 5.0, "Amazing", "If you've never seen these trees, you're in for a treat. I've seen them before but the size still amazes me when I see them. While they are huge, the age is also unbelievable. A walk among giants."], ["Reviewed October 9, 2017", 5.0, "Big trees that you have to experience first hand to appreciate", "You have probably seen pictures of these magnificent trees, but if you haven't seen them in person you can't imagine what the experience is really like. They are so big and magnificent that it is just not possible to appreciate them without a first hand experience. If you have the opportunity to go and if you love trees and the outdoors, you should go.\nShow less"], ["Reviewed October 8, 2017", 5.0, "It is indeed a giant forest", "Plan some time to see this place. Look at maps ahead of time. Get out and walk the trails and see the largest living things on Earth."], ["Reviewed October 7, 2017", 5.0, "Amazing trees!", "Fantastic trees to be seen here, very quiet when we visited, easy driving. $30 to enter the park. Very few facilities the only shop/restaurent we stopped at was closed and the shop had limited food and the restrooms were shut. We took advice to take food and drinks in with us which is a good idea as there is very little if anything there. The walk to General Shermans tree is very steep on the way back up. There is disabled parking at the bottom which is very close to General Sherman. Because traffic was light it was easy to stop and take photos. This is a very natural are unspoilt and wonderful to drive through.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Amazing walks among history", "The giant forest is something to behold. Luckily, this national park is not nearly as crowded as some I have been to, so you can walk amongst the giant trees in peace and just relax and take in all the beauty. Trails can be as short as a walk around the \"major\" trees or you can take hours and walk all around. Bring your camera and take your time--it is an unforgettable place.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Walk in the Land of the Giants", "There are lost of trails around the Forest Museum parking area where the Giant Forest is located. Most of the trails are well marked and you'll be surrounded by lots of tall pines and redwoods (Sequoia) tress. The trees here are massive and you'll really feel like you were walking in the land of the giants with some big boulders nearby with some resting by the trees. A great place to visit and I'd recommend it to my friends. It's worth the trip.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Spectacular up-close hiking through the Giant Sequoia trees", "Highly recommend a hike on the Congress Trail after viewing the Sherman tree. The trail is about two miles, paved, and relatively flat. Lots of opportunities to get up-close to the giant sequoia trees."], ["Reviewed October 4, 2017", 5.0, "Sequoia, finally!!!!", "As I learned about these trees since I was some 6, 7 years old and almost the other side of the planet, I always wanted to visit and check them close up.\n\nTrust me, you are not let down if you love nature and unique things in general.\n\nMy partner bought the park tickets online and how inspired that was, as, accessing the park, there is a queue of cars on the left and on the right you can follow the cars of the people who work in the park, thus only showing your bar code for them to scan and access the park. However, buy your drinks and food to get you by as:\n- you drive some 50km (the first 20 is probably only dangerous road as you go up towards the mountains where the Sequoia trees are)\n- we realised we having been in the park some 4h, without doing any hiking, in order to visit most of the things mentioned here\n- most of the 'attractions' mentioned here are grouped together, with the exception of General Sherman tree which is some 20km away from General Grant (where most of the people seem to go and take their pics)\n- as we arrived at General Sherman's tree there wasn't almost anyone around\n- do not keep food and water in the car for wild animals to see as there are bears etc, as the signs tell you\n- there are no gas/petrol points in the park so fill in the tank before you access the park. I also noticed the petrol prices seem to be a bit higher in these little towns before reaching the park - it is their way of making their money, right?\n- however there is a petrol station at Yosemite park, by contrast (we visited this the next day)\n- be prepared for lots of very slow driving of up to 5miles/h, also even in September (on a lovely day though) there were some queues and you could not even turn around!!!!\n- you cannot even overtake the very slow drivers if they cannot be bothered with the queues they produce\n- I would expect at weekends, on lovely days, or summer time this place to be packed - which you might want to avoid\n- as a driver it can become very tiring following all the twist, turns in the road etc. If I was to do this as a child probably I would have thrown up all the time\n- we arrived via 198E, coming from Visalia, which was rather busy but we left via 180 after visiting Kings Canyon on the way to our hotel in Fresno\n\nYou will see lots of amazing trees, several thousands years old, lots of trees affected by the recent fires, lots of people stopping in the small parking lots just because you stopped (!!!!?????) and you will be intaking lots of fresh air as it can be some 10 degrees Celsius lower than outside the park.\n\nI enjoyed it and I would do it once again if there were even less people around.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Wonderful to finally see these icons of history.", "So worth the drive to see these natural wonders. Path for General Grant tree was paved so easy walking."], ["Reviewed October 2, 2017", 5.0, "Majestic!", "Trails for just about anyone, from easy to difficult. So beautiful and peaceful here. Loved walking among the groves and just looking up. What a spectacular place to be!"], ["Reviewed September 29, 2017", 5.0, "Amazing Trees!", "Walking in the Giant forest is like going on another planet! we could drive through a tree! A real novel experience."], ["Reviewed September 25, 2017", 5.0, "Wonderful", "Thoroughly enjoyed this trip! Make sure to take drinks With you and a sweater as it's colder a little higher up the mountain. Drinks Bottles Can be refilled in the car park with safe drinking water."], ["Reviewed September 25, 2017", 5.0, "Awe Inspiring", "You just don't get how big the biggest trees in the world are until you stand next to one. In the Giant Forest, home to more than 1,000 Giant Sequoia, walking amongst these giants is an unforgettable experience. Go!"], ["Reviewed September 23, 2017", 5.0, "Redefines forest-gigantic and beautiful!", "This is a beautiful area you can walk throughout and take beautiful pictures of the trees. The forest smells are incredible. So many beautiful places to stop in this Park!"], ["Reviewed September 20, 2017", 5.0, "Outstanding natural beauty", "Well pleased with the choice of visiting Sequoia National Park while on holiday in Las Vegas. Will be back camping next time for few days or to stay in picturesque Kernville 26 miles away"], ["Reviewed September 20, 2017", 5.0, "Incredible items to see", "The giant Sequoias make this an amazing place to visit. There are many things to see in the Giant Forest area."], ["Reviewed September 19, 2017", 5.0, "A truly must see", "These trees were growing whilst humans were still mucking around with how to make fire consistently, and are a fantastic example of natures grace. The were a bucket list item for me, and they certainly did not disappoint.\nI am certainly not a tree hugger, but the sight of these trees make you want to just go and wrap your arms around them (I amd a decent size bloke and I cannot) just connect with something truly majestic.\nGo see them, please\nShow less"], ["Reviewed September 16, 2017", 5.0, "Like stepping into another world...", "The Sequoia National Park is so awe inspiring that it makes you feel like you have landed in another world. Standing among the trees makes you feel so small and actually will have you asking yourself \"is this real\". This park is an ABSOLUTE bucket list item for anyone!\n\nThe park is well maintained and the staff is super friendly and informative. Be sure to ask a ranger about the tree's that burn from the inside out.\nShow less"], ["Reviewed September 14, 2017", 4.0, "General Grant's Giant Forest", "The Giant Forest is a Sequoia forest with the most famous of them called General Grant. There is a wonderful walkway through the forest going towards \"General Grant\". On the way we pass through groves of so many more Sequoias! Squirrels are making their sounds in the trees and are jumping around you. Nature is at its best here.\nShow less"], ["Reviewed September 11, 2017", 5.0, "Must Visit at Least Once", "Mother Natures power and grace on full display. You may wait a few minutes during busy times for a shuttle but so worth it. Go first thing in the morning to avoid the crowds. Most skip this trail when visiting General Sherman which really is a mistake. Take water on warm days.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Amazibg place", "To see the Sequoia trees in person is just awe inspiring. Picture do not do them any justice. However, the shuttle buses are quite a problem. We waited for crowded full bus after crowded full bus after another. We waited for 4 buses to get a bus with space to board. This is just not at all acceptable to the people that take these buses. But, if you want to see the Sequoia's, you have to wait a long time for an available bus. At least they're free.\nShow less"], ["Reviewed September 9, 2017", 5.0, "You gotta see theses giant trees!", "The giant forest is a miraculous sight with huge Sequoia trees at every turn. At one point you may see a huge lone tree, then farther up the trail a family group or a double tree. The worlds largest tree is here too, the General Sherman. The trees are awe inspiring and you have to see them to believe it. You can't capture their grandeur in a photo! All Americans should experience this place.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Longer Trails Less Traveled", "Amazing forest and the longer the trail the better so less people around as busy as this park is. Walking among the trees is lovely and peaceful. Definitely worth the time and attempt to take long hikes."], ["Reviewed September 6, 2017", 5.0, "Nature at its most grand show", "Had a great and humbling experience walking among the giants and seeing some of the biggest living things on the planet. Pretty magnificent and majestic. Great place for everyone to see. Must do thing."], ["Reviewed September 6, 2017", 5.0, "Awe-inspiring!", "This has been on my bucket list for along time. Words cannot do it justice. A must see for anyone. The sequoias are the most beautiful trees I've ever seen. The colors are rich and the sky is so blue and no filer is required on your camera. We loved walking amongst these giants. The park has a nice paved walk for handicapped access and strollers. It's well maintained and thoughtfully laid out. We did stop at the museum first to read up on the trees. It wasn't too crowded or hot. We did publicly shame some tourist for blatantly disregarding the rules and climbing over the fence to stand near some trees that were posted off limits. Except for those 3 tourists everyone else was quite and respectful. It was like being in natures library. So incredibly beautiful.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Amazing environment", "It's a very powerful experience to walk around here. Huge trees! Parking is a bit of a hassle if you don't come early. It's a good idea to park somewhere and take the bus around the park."], ["Reviewed September 5, 2017", 5.0, "Simply stunning", "The Sequoia's are huge, and are beautiful with red bark and green foliage. Really awe inspiring the forest, and the entire park, is worth going to. There is a lot to see and do, all near the giant forest and museum. A real must."], ["Reviewed September 5, 2017", 5.0, "Simply Magical", "The giant forest area of Sequoia NP can only be described as magical. It's like a fairy tale setting with the big trees. Pictures don't do it justice. Seeing one for the first time was jaw dropping, and to think some of these trees are 2700 years old and predate pretty much all of modern man is mind boggling. The area has a extensive network of trails for all ages and types and has abundant wildlife. Just book your trip already and come see it now.\nShow less"], ["Reviewed September 3, 2017", 5.0, "I love this place", "The beauty and ginormous size of these trees is better that anything I expected. I loved this place and it was nice that it wasn't crowded."], ["Reviewed September 3, 2017", 5.0, "Incredible", "The giant trees are a sight to behold. It reminds us just how small we humans are in this world. Look closely at each tree as each one is unique. If the trees could talk, no doubt they would have incredible stories to tell about their scars or burn marks.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Truly amazing hike in one of a kind forest", "We hiked through the Giant Forest and had the most amazing experience. It was not crowded at all, and in fact most of the time we were all alone in the forest. The giant sequoia trees were monumental in scale, and we never got tired of seeing them. There is no other place like this in the world.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Fantastic", "The Big Trees are even bigger than we imagined. Quite incredible . Access and parking are good but avoid weekends and holidays which will be too congested"], ["Reviewed August 28, 2017", 5.0, "Amazing", "We visited Yosemite National Park a few years ago, but because of we didn't have time enough, we couldn't go here.\n\nSo this year, in our round trip, one 'must' of our visit was Sequoia National Park and, between the several attractions, Giant Forest was the place to walk: AMAZING.\n\nYou can see the photographs, but it is when you walk between the sequoias when you realize how huge are those trees.\n\nParking in the entrance, and 5 minutes driving of the restaurant and village store.\n\nNear you can find Three Rivers, a convenient village to overnight close to the park.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Big trees!", "Loved the trail! There was a lot of people on the trail so taking pictures was a little difficult. But the view was very beautiful!"], ["Reviewed August 23, 2017", 5.0, "Incredible", "This is an indescribable place. Must come and experience these majestic giants. Beautiful. We ended up seeing lots of deers and a pretty good size bear."], ["Reviewed August 22, 2017", 5.0, "In awe . Loved it.", "If you Go later in the year it might be too crowded . Spring time was excellent since we had no problem getting a campsite at Azalea campground and for only 14 $ a night . The trees are breathtaking . The forest is peaceful and comforting making you want to never leave. Lots of walking which gets you into a mood of tranquility. Amazing. Unforgettable.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Great visit but difficult to get there", "We spent a great day in the Sequoia park. On our way from San Francisco to Vegas, we Toguri 'twas better accessible. It's amazing and greener all sherman worth seeing but be advised that it takes April 2 hours to get there from the north entrance\nShow less"], ["Reviewed August 20, 2017", 5.0, "MAGIC", "Everyone should go here at least once in their life. The trees are massive. Later in the day, there are less tourists."], ["Reviewed August 20, 2017", 5.0, "Giant Forest is a Giant MUST DO", "This is a must do stop in Sequoia National Park.\n\nFirst, everyone else knows it is one of the key places to visit in the park - so be prepared for lots of cars and a possibly full parking lot. Don't get frustrated like Melissa R appears to have done - see earlier review. There are options like parking at the Giant Forest museum where there is much more parking and taking a shuttle or even parking there and walking the trails all the way up to the General Sherman Tree from there.\n\nRegardless of where you park or how you get there - this is a place you want to go. And DON'T just stop at the General Sherman Tree. At least walk the Congress trail and get a little further into the forest where you can experience the awe of the natural world.\n\nMany descriptions have been written to try and describe the feeling when you are among the giant sequoias but none of them truly do it justice. You just need to experience it for yourself. It is a bit like visiting a cathedral or other religious building, but one without walls and where God is truly the builder of the chapel.\n\nThe walk down from the parking area is a bit steep, but it is paved the whole way and there are steps. Once you get to the General Sherman tree area - KEEP GOING and explore further. From here the trail is mostly flat meandering up and down and looping around and around. There are literally 100s of trails so I would strongly recommend a map to help.\n\nWe came earlier in the season on a weekday and found parking right away - but if I had it to do again I would park at the Giant Forest museum and then walk along the trails up into the forest, stopping at the General Sherman tree before looping around to come back.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Breathtaking trees!", "There are wonderful trails in this area to showcase these beautiful giants. Big Trees was our favorite. The only negative is that the only parking is at the museum and the lot is simply not large enough to accommodate everyone who comes. We arrived by 9:00 a.m. and it was pretty crowded already. If you come later in the day, you may be driving circles for awhile to find parking!\nShow less"], ["Reviewed August 13, 2017", 3.0, "It was ok", "First of all, I'd like to let people know things that no one else wrote about. Once you pay your fee ($30 per car), there is a 17 mile almost the whole way there all winding road ( at 25mph) to where most activities are. So if you are prone to motion sickness do yourself a favor and prepare for this. There was about a 10 minute wait to even get to the entrance. Also, there is currently construction on the main road and in one area a one lane road where we waited 8 minutes for a light to change. Once we arrived to the area of general Sherman tree parking area there was no parking spots, so we were forced to create our own. Also, I checked ahead of time online to see if dogs are allowed, we got to the hiking trail only to find out pets are NOT allowed on ANY trails. Lovely, this would have been a great fact to know PRIOR to spending 4 hours getting there. The trail was well kept and the tree was nice to see. Be prepared to add about an hour to your journey due to lines, construction and winding roads.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Magnificent", "A popular attraction and for good reason. To see these giant trees up close is truly breathtaking. The trails are paved and easy for walking. This is definitely a bucket list item."], ["Reviewed August 11, 2017", 5.0, "A majestic forrest", "We parked our car at the museum and then walked the Huckleberry trail. This circular trail starts just under 1 mile from the museum and you will leave the crowds behind. The trail leads along families of sequoias and past beautiful meadows. Stunning!"], ["Reviewed August 11, 2017", 5.0, "Family cross country trip", "The General Grant grove in Sequoia National Park is a must see. The age and size of these trees is awesome and inspiring. The gentle walk among the paths of living giant trees and the hollowed out and exposed roots of downed trees is majestic and serene. The path is accessible, close to parking and near the Big Stump entrance for a quick get in and out of the park experience if you don't have a lot of time.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Sequoia", "Cool place. Glad I went. Takes time to see it all give yourself plenty of time and enjoy the beauty."], ["Reviewed August 8, 2017", 5.0, "Cool, Quiet & Majestic", "Follow Generals Hwy to Wolverton Rd and the summer parking lot for Giant Forest. If you have an ADA parking sticker/placard, you can continue further on Generals Hwy to a parking area with ADA accessibility to General Sherman tree. From the summer parking lot, we followed a 1/2 mile paved path with 200ft elevation change down to the tree. It may not sound bad, but it’s a pretty steep walk back out for anyone who isn’t in good shape, although there are several rest areas along the way. There’s a really cool viewing area just above General Sherman where the trail crosses a brick “footprint” matching the base of the tree. It provides a real perspective of just how big this tree is. Once at the base of the tree, we took the Congress Trail, a paved 2 mile loop that took us through many beautiful trees. It was one of my favorite “walks”. The forest was cool, quiet, and majestic…not to mention the wonderful aroma of pine. There are several other short trails nearby making this is a great place to piece together a longer loop with other trails, if you want a longer hike.\nShow less"], ["Reviewed August 7, 2017", 5.0, "A must see at least once in your lifetime", "I like trees. I would not go so far as to say I am a tree-hugger, but Ive planted my share, can identify numerous different species, and have always admired the stoic majesty of a mature specimen. I had visited Sequoia National Park on my own years ago and it held such a place in my memory that I had to take my wife back to see it in September 2016. She likes animals but does not have the same nature connection that I do. That being said her eyes about popped out of her head as we were driving when we first started to see the \"big\" trees.\nWe walked a number of the trails around Giant Forest and other areas of the park. She was worried about bears and I tried to minimize her fears with proper bear protocol as well as the fact that I had never run into any in my 20 years of outdoorsing. Wouldn't you know she was walking a bit ahead of me on the trail and came walking back pale in the face saying \"Bears in front of us!\" I half thought she was kidding but wouldn't you know a mom and two cubs were walking the trail toward us. We backed out slowly without incident and left with a great side story.\nThe size of these trees puts a lot of things into perspective -- you realize just how little and young you are next to one of these thousands of year old giants.\nShow less"], ["Reviewed August 5, 2017", 4.0, "This is the pace to see trees", "A limited choice of hotels round here. Access to the giant trees is good - no need to walk all the way to the base, good view points about halfway. Walks to/ round the clearing/ meadows in the trees are easy, with plenty of wildlife. Visitor centres are good\nShow less"], ["Reviewed August 3, 2017", 4.0, "Incredible to see", "It's a painful car journey to get there (especially with the roadworks) so I'd suggest you got there early, but it is an incredible sight to see.\nTwo tips would be 1/ ensure you take drinks and snacks as for some reason they just don't have any facilities there (I can't believe they couldn't have something at the museum without destroying the environment) and 2/ go straight to the museum and use the bus shuttles to get around. Parking elsewhere can be a pain, and shuttles are free and run frequently.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Once in a lifetime", "Great for the fan or if just looking for a little solo solicitude. Great experience...a must see, considering there are no other trees as large in circumference as these!"], ["Reviewed July 26, 2017", 5.0, "Walking between the Giants", "This is an area where you just walk slow, look up, down, left and right and take in all the natural amazing views. We walked through several trails to see lots of trees. There are lots of trails in the area so take your time to take it all in.\n\nPlease stay on the trails and respect the National Park - we saw too many people walking over the ropes and picking at the trees! Shameful!\n\nUse your iPhone to do a pano shot by holding your phone sideways and shooting from the ground up to the top of the trees. With good lighting and a steady hand you will get great photos you can't get with even a wide angle lens of an SLR camera.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Great Hike 2.5 mi. Lots of up & down", "I'm an overweight, middle aged mom & teacher who lives at sea level. I still loved this hike though it took me about 2.5 hours due to the altitude and steep hills. It is paved almost all the way which is great. The trees are magnificent and magical. I strongly recommend bringing some trail mix and more water than you think you'll need for this one. Our favorite trees were \"room tree,\" and the Senate/House trees. These groves looked like the Ewok forest in Star Wars! Amazing!\nShow less"], ["Reviewed July 22, 2017", 5.0, "The experience of a lifetime...", "The Sequoia trees are the most beautiful and breathtaking trees you'll ever see! We were in awe and couldn't stop admiring them. They have a delicious scent and the most beautiful trunk. We also visited The Giants Museum and it was very interesting and very hands on for children. There is also a little gift shop and restroom area.\nPlease be aware of the following: it costs $30 for each car and it takes about 1 hour from the entrance to the giants forest.. and is one hour of curve after Curve and up a mountain with little or no protection. There are not restrooms on the way and no gas stations in the park. Finally, go because it's so worth it!!!\nShow less"], ["Reviewed July 20, 2017", 5.0, "Awe-Inspiring!", "An exquisite spot that fills you with a sense of awe at the grandeur of trees and gratitude for their conservation. Every American should visit to appreciate the beauty and power of this ancient alifornia gem(and non-Americans are eagerly encouraged)!"], ["Reviewed July 18, 2017", 5.0, "Beautiful & Breath-taking!", "This place is a must see if you love nature and trees! Just the sheer size of the trees is unimaginable if you've never seen them."], ["Reviewed July 17, 2017", 4.0, "Amazing!", "The Giant Forest encompasses about 3 square miles of forest with some of the best examples of Sequoias in the park. The General Sherman Tree is a part of this forest as is the amazing beautiful and peaceful Congress Trail. If you have time to hike the 2 mile Congress trail it is an incredible hike on a paved trail showcasing trees including the President, and the Senate and House clusters of Sequoias. It is worth the hike. The trail even goes through one of the trees.\nShow less"], ["Reviewed July 16, 2017", 5.0, "Family with adults", "Amazing to walk among these giants. I've learned so much about protecting our natural resources, I'm grateful they are still here for my children and I to see and touch, and I learned how a few (John Muir...) realized and spoke up over a century ago that the giant sequoias needed protection from business/humans using the beautiful trees into extinction. I Wish everyone could experience time with these old growth giants, it puts protecting our environment and global warming into perspective only enhanced by the drive to and from the national park from Los Angeles during the drought stricken environment and oil fields we saw.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Bucket List worthy!!", "Our family gasped loudly and our jaws dropped when we came around the corner and caught our first glimpse of the giant trees! Even though the area around General Sherman was crowded, we were glad that we visited there and stopped at the visitor's center. We had a delightful picnic at a designated area. The smell in the air was incredible and exhilarating, as was keeping our eyes open for bears. We were happy to encounter a black bear crossing the road before we left. Our favorite experience was hiking on some of the trails away from the crowds. Being alone with the green canopy above and the green ferns on the forest floor, and the sequoias above with us so small was an absolutely spiritual experience! Photos do not do this place justice!\nShow less"], ["Reviewed July 14, 2017", 5.0, "Impressive forest", "Nice to do a little walk around and see how small we actually are in this world. the Congress trail and Bear hill trail are nice little trails you can easily do without to much other tourists walking around"], ["Reviewed July 5, 2017", 5.0, "Mindblowing to walk amongst the giants", "Giant forest is one of the largest sequoia groves in the world and home to the General Sherman Tree - the largest tree by volume in the world. I parked in the Sherman tree main parking area and walked the 1/2 mile trail down to the General Sherman Tree and the other areas nearby including a crosscut which shows the rings of a sequoia that is 2000 years old. There are a couple of trees you can get really close to, but most of the giant trees have a little railing around them to protect them from the millions of people that visit each year. I also hiked the Congress trail that splits off of the General Sherman trail. This trail is 2.1 miles and took over an hour to hike. It is a easy walk on a pretty good path that leads out through many tall trees. I saw lots of birds, squirrels and chipmunks as well as a short-tailed weasel that was hauling a dead chipmunk home for his dinner. This trail is less crowded than the General Sherman Trail and offers moments of solace among the giant trees.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Amazing two days", "A lot to see. General Sherman Tree, Congress trail to see the named Sequoia's. Well run park, efficient free shuttle."], ["Reviewed July 3, 2017", 5.0, "First stop and it was super!", "This is where we parked our car and went on free shuttle buses to the rest of the park. Being Memorial Day weekend, it was a good plan as the parking areas get full quickly. The Giant Forest was jaw dropping and so beautiful. It was on my bucket list and lived up to every imaginable dream I had of it!\nShow less"], ["Reviewed July 2, 2017", 5.0, "MIND BLOWING", "The majestic trees will blow your mind.What an experience to be with the biggest living things in the world. Museum is a must visit. And do not forget to take a snap in front of General Sherman, the biggest tree in the world."], ["Reviewed July 1, 2017", 5.0, "Needs to be on your bucket list", "Similar to the Grand Canyon, words cannot describe wondering through the Sequoia's. You will want to spend at least a couple of days. We stayed outside the park, drove in early morning and spent the day - stayed at the Wuksachi Lodge (woke up to 8\" of snow the next morning, June 12) and finished up the next day. An overall great experience and a must see for your children, they will never forget.\nShow less"], ["Reviewed June 30, 2017", 5.0, "Wonderful!", "Even if you don't hike, the Generals Highway cuts right through Giant Forest. Not sure about the reviewer who gave this 1 star & said there was only \"one big tree\". There are dozens. They are fabulous!"], ["Reviewed June 30, 2017", 5.0, "Worth the drive", "Driving through these giant sequoia trees leaves you feeling like you are driving the trails of an enchanted forest. Roll your windows down and enjoy every second."], ["Reviewed June 29, 2017", 5.0, "Giant for a reason!", "The best museum/visitor center in Sequoia is located here, the Giant Forest Museum. There are several displays, and a gift shop. The Giant Forest itself has many sequoia tree trails and the \"Big Trees Trail\", giving you plenty to explore. Spend anywhere from 10 minutes to all-day here, depending on how much you want to hike and explore. Bring water, and there is a refilling station and bathrooms near the Giant Forest Museum. Parking fills up by 11am on weekends. Utilize the shuttle if you can.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Trip to see the giant red woods", "The trip was amazing everything I expected and more the sight of these great giants was breathe taking"], ["Reviewed June 26, 2017", 5.0, "Check off your bucket list.", "Do not read the reviews. Do not look at the pictures. Neither can even start to capture the experience. The majesty of nature is on full display in a very accessible environment. Even the drive up is amazing."], ["Reviewed June 26, 2017", 5.0, "Awesomeness!", "You have to see it, feel it, and hug it to experience it. Photos and stories tell nothing to the experience. The stature of these trees are amazing and breath taking. It cost $30 to enter the park. During cold weather they do make you carry snow chain and is a requirement though they don't check unless you get pulled over. It takes some time to drive up through the mountain before arriving at the first sight of the Sequoia's. The roads can be narrow but the view is amazing. The giant forest sneaks up on you fast once you are at the top. The elevation is around 7,500ft and the weather is way different then at the base of the canyon. I actually almost got stuck on top of the mountain in a snow blizzard and heavy fog but was barely able to evade natures grasp. The beauty and splendor was and is forever etched in my heart.. A must experience for all..\nShow less"], ["Reviewed June 25, 2017", 5.0, "Breathtaking", "Pack your hiking shoes and camera. These trees are AMAZING! Don't miss the Grant Grove Trail and do the Ranger program through Grant Grove if possible!"], ["Reviewed June 24, 2017", 5.0, "Unbelievable!", "We absolutely loved the Giant Forest. We took a long hike which we will always remember. Loved it. This place is simply beautiful and peaceful and worth the trip."], ["Reviewed June 21, 2017", 4.0, "The whole park was worth the whole day", "These two parks were way more peaceful than Yosemite for us. The Redwoods either single or groves, had so much beauty to offer. From the height of them or width at the base. The day was so much more slow paced, just nice to take your time and enjoy each site around the next curve.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Gorgeous forest!", "Absolutely beautiful drive! Just prepare yourself for the numerous switchbacks when driving in from the southern entrance from Three Rivers. It was about 15 degrees cooler inside the forest than in town and the fresh smell of pine is intoxicating!"], ["Reviewed June 20, 2017", 5.0, "Giant Grove Sequoia National PArk", "This it the best of the best of the giant trees. Get up early and go before the crowds so you can enjoy it. There are some paths to hike by a little waterfall. You can park on the side of the road if it is early enough. It gets crowded later, especially high season.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Beautifyl enchanted forest", "A must see....you'll be transported to another worl of giant trees. Truly amazing. Pictures cannot capture it."], ["Reviewed June 15, 2017", 5.0, "A life-long dream come true", "Go! Plan to spend longer than you thought you would. If it is summer, go early to beat the crowds and the heat. Plan to hike a few trails.\n\nBe sure to fill with gas before you get to the park. It adds to your peace of mind. Take food and water as there are not many places to get them once you get there.\n\nGo!\nShow less"], ["Reviewed June 12, 2017", 5.0, "Lots of trees close by", "There were plenty of trees to get a photo of near the roadside. It was foggy when we visited so there wasn't great photos, but the trees were amazing nonetheless."], ["Reviewed June 11, 2017", 5.0, "You have to see these trees", "The trees are massive and there are no words to describe how small you feel standing beside one. We enjoyed the shady hikes through the groves."], ["Reviewed June 11, 2017", 5.0, "Silent giant", "Just loved this quiet walk among the gentle giants. Nice walk and well worth it. Please remember to stay away from the base of these trees. I want my grandchildren to enjoy someday"], ["Reviewed June 6, 2017", 5.0, "Beware of bears!", "They don't call this forest giant for no reason. We saw two bears while looking for parking in the Giant Forest. We obviously stayed in our SUV but took pictures and just watched them stroll by. Afterwards, we drove to the parking lot of General Sherman Tree. It was well worth the trip and pictures I took of the family. Definitely it was worth coming to see and enjoy. Family had a great time!\nShow less"], ["Reviewed June 6, 2017", 5.0, "Magnificent!", "The walk around here was a great way to get close to to giant sequoias. It was really humbling to be among so many beautiful and massive trees."], ["Reviewed June 6, 2017", 5.0, "Gaigantic 🌲", "Walking over the huge trees by observing trees which are taller than other .. walking is the best way to look around the park. Getting parking is bit tough on holidays.. we visit in the long weekend so be prepare to get parking slot.."], ["Reviewed June 4, 2017", 5.0, "Magical Forest", "You must see in person in order to experience magic. Bring lots of water and find a path away from people. You will see deer, birds, amazing plants and maybe even a bear."], ["Reviewed May 29, 2017", 5.0, "Breathtaking", "These trees are simply an amazing site to see. Walking through the giant forest gives you an idea of how different they are, and the burn marks were to interesting to learn about. This is an excellent spot for a picnic and for some reason, actually wasn't busy at all. We had it almost to ourselves once we left the Sherman tree.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Great time at this park", "Visited Sequoia National Park and Kings Canyon National Park on Saturday of Memorial weekend. Not great timing but the trip went very well. Found parking at every location but tough at times. Lot of people and traffic but it moved unlike at Yosemite. Love the park. No long waits for the shuttles but we took the trails whenever possible and that helped. Plenty of bathrooms around. Not many places to eat but we brought our own. Saw a mother bear and 3 cubs on one trail. quietly made a detour around them. Moro Rock is a \"must see\" but the climb can be daunting but worth it. The visitor center was great and the employee very helpful as we mapped out our visit. I would recommend arriving before 9am for sure. We had no wait at all on memorial weekend saturday arriving at 8:30am. If you are a senior you can get a lifetime pass to all federal parks for $10 that allows your car and everyone in your car into the park. Otherwise it is $10 per person in the car. Active duty and family members are free. Trees are amazing.....the Sherman tree and Grant tree and Roosevelt tree and many others. Live talks about the history of the park at various times, very informative. I liked Sequoia park much better than Yosemite. We did not have time to make reservations for lodging ahead of time so everything was full up for Memorial weekend. Stayed in Fresno.\nShow less"], ["Reviewed May 27, 2017", 5.0, "WOW!!!! These trees are AWE-INSPIRING!", "You must get out and stand next to these ancient treasures to enjoy their size! To think that they may be up to 3000 years old is incredible...and to learn of their survival is so interesting. A GREAT place for a nature lover to visit."], ["Reviewed May 23, 2017", 5.0, "Budget about 4x the time you think you'll need", "Fill up with gas before getting there or you'll be out of luck. Bring a snack and water. There are no places to buy supplies. BUT budget enough time because No one in your group will want to leave"], ["Reviewed May 20, 2017", 5.0, "AWSOME", "awesome beyond imagination must see generals Sherman and grant. drive through tunnel log grizzly falls is a must"], ["Reviewed May 20, 2017", 5.0, "Unbelieveable and no words to describe it", "Go there and see it for yourself; you need to walk the Giant Forest Trail and the way how you see nature and especially trees will change forever. 2000 - 3500 year old living species in a size that is unbearable to your mind. One of the best places I have been in my live.\nShow less"], ["Reviewed May 19, 2017", 5.0, "Should be on you Bucket List", "Magnificent! Stopped at most of the sites. General's highway drive ect.. When planning our trip to Yosemite we looked on line and decided to spend 2 nights here. So glad we did."], ["Reviewed May 19, 2017", 5.0, "Simply Astounding!", "Everyone visiting Sequoia National Park must visit this amazing grove of Sequoias. You will be awed by their splendor."], ["Reviewed May 19, 2017", 5.0, "Sequoia National Park, unmissable!", "The right nature place with giants trees (Sequoias), inside the park with many safe trails where the 4 main trees biggest in the world! Sequoias with 2000 years old live in forest! Magnificent place, unforgettable, unmissable!"], ["Reviewed May 15, 2017", 5.0, "Magical drive!", "Take your time to enjoy this magical drive. We saw many deers, big and small. I prefer driving early in the morning while sun is out, and leave before it gets dark."], ["Reviewed May 13, 2017", 5.0, "Amazing.", "This is one of the places where \"words are not adequate\" is accurate. The Sequoias are one of the most special things on earth. It is simply staggering to stand among them and just be. I place it in the top tier of the amazing parks that make up our NPS.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Humbling", "I said to the park ranger \"so where is the giant forest\" and he laughed. Said go down this road and you can not help but see it and laughed again. Well, sure enough soon the car was surrounded by huge inspirational natural wonders."], ["Reviewed May 11, 2017", 5.0, "Incredible visit", "Pictures do not do these trees justice compared to experiencing them in real life. A must see bucket list."], ["Reviewed May 9, 2017", 5.0, "Magnificent!", "This place is amazing! The forest is something to dream about! We saw and experienced more than we ever dreamed. For us, it was a once in a lifetime opportunity!"], ["Reviewed May 8, 2017", 5.0, "Pictures will never due, you have to go see these wonderful trees.", "Plenty to see and do in a two to three day stay. The views are unforgettable and a must do bucket list item. Plenty of places to pull of the road and take pictures."], ["Reviewed May 6, 2017", 5.0, "Beautiful and well maintained", "This is a lovely easy walk to see many, many big trees. It was a little wet this time of year and not at all crowded."], ["Reviewed May 2, 2017", 5.0, "Amazing trees", "Check this one off of your bucket list, these are the oldest trees on the planet at over 2,000 years old for some of them."], ["Reviewed May 1, 2017", 5.0, "Giant", "Not lying when they say giant forest. Had trails to walk on with your family, friends or just going solo. Seems safe and no wild animals have very came at me. I have been here quite a bit."], ["Reviewed April 30, 2017", 5.0, "Incredible nature", "It was our most impressive event during our two weeks trip to California. Still a lot of snow above 6000 feet. We had beautiful views on the Grant tree and trail. Unfortunately it was misty at higher levels of the park. And we saw a bear. The one with earmark 100.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Giant Act of Nature", "You have to see it in person to appreciate the enormity of the trees. My wife and I have come from Florida to see the trees for ourselves. If you go, be ready for strange weather."], ["Reviewed April 28, 2017", 5.0, "Amazing!", "Just absolutely amazing! It's hard to wrap your mind around just how massive these trees are until you are standing at the base of them and looking straight up. So beautiful! The Big Trees trail was our favorite! It still had quite a bit of snow on it in late April when we were there, but it was still very accessible on foot with basic footwear (we were both in sneakers). Definitely a must!\nShow less"], ["Reviewed April 25, 2017", 5.0, "Utterly Serene and Mesmeric", "We just loved the Great Sequoia National park, the trees are just magnificent and stately. They are so grand and have lived for so long on this earth!\nThere are so many amazing sights, the Giant Forest really is a beautiful walk among these massive trees. So peaceful and serene and I really couldn't speak highly enough it the place.Absolutely recommended.\nShow less"], ["Reviewed April 23, 2017", 5.0, "True giants", "There's a handicap access trail to the General - otherwise you'll have to walk quite a downhill paved path to Sherman - but SO worth it. We visited in March and there was still snow on the ground - such a beautiful trail with great information about the history of these beautiful giants. Be sure to check out General Grant as well - much easier, non paved, level trail and more dense collection of giants.\nShow less"], ["Reviewed April 20, 2017", 5.0, "Just amazing", "The giant sequoias are beyond belief. The drive to the top is terrifying but seeing these mighty trees is well worth it."], ["Reviewed April 14, 2017", 5.0, "Unique Place to visit.", "Nature is always impressive. To see how the forest recovers after fires is impressive. I wonder how animals were affected."], ["Reviewed April 13, 2017", 5.0, "Incredible and breathtaking scenery", "We took our 8yo daughter on the longest hikes of her life, and this was her favorite! The forest is incredible and magical and quiet."], ["Reviewed April 12, 2017", 5.0, "A Must See", "If you love our national parks, this is one you will need to add to your bucket list. Although it is just south of Yosemite National Park and in the same Sierra Nevada mountain range, these parks are completely different. The Giant Forest with the magnificent giant sequoias are breathtaking.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Fabulous", "Unbelieveable trees and forest. Everyone must see at least once in lifetime. Would love to return again for peace and solitude."], ["Reviewed April 8, 2017", 5.0, "This was a part of my Review on the General Sherman Tree.", "The walk through the Giant Forest is easy and awesome! Make sure that you read the history of the trees and their basis of survival...Forest Fires. I know that it does not seem logical, but it is the number reason for their thousands of years that they have been on earth....Never will forget that hike!\nShow less"], ["Reviewed April 6, 2017", 5.0, "Redwoods", "This area has many beautiful redwoods including the General Sherman tree. The hike is downhill going to the tree but very steep returning to the parking area."], ["Reviewed April 5, 2017", 5.0, "fab experience", "When we visited it was nice and quiet, only a class and some very nice old ladies. the trial is short 20-30 min tops, you can visit it with kids."], ["Reviewed March 30, 2017", 5.0, "AMAZING!", "Definitely worth the trip. Went in the winter. plan to visit in summer as well. seeing the sheer magnitude of these trees is awe inspiring."], ["Reviewed March 21, 2017", 5.0, "You'll be amazed!", "When you first approach the Giant Forest you think \"Wow, these trees are big\", but then you are among them and you think \"WOW, THESE TREES ARE HUGE!\""], ["Reviewed March 20, 2017", 5.0, "Lovely", "Quaint and lovely parks. Few people in March. That was nice. The sequoias were amazing. And a lot softer to the touch than we expected."], ["Reviewed March 19, 2017", 5.0, "Great experience!", "It was my first time in the snow. The park is beautiful, in the the road I was able to see some deers, the landscape it's astonishing and I was amazed by the length and age of the sequoias"], ["Reviewed March 18, 2017", 5.0, "Great place to snowshoe", "We recommend the Congress Trail for snowshoeing-start at the General Sherman Tree. If you don't get there early, you might have to park in the \"summer parking area\" as there is limited parking by the highway. The trail starts just to the right of the General Sherman tree and you can snowshoe to many groups of big trees on a relatively flat trail. There is not always enough snow in March for snowshoeing but this year there was plenty!\nShow less"], ["Reviewed March 17, 2017", 5.0, "Will blow your mind", "Really special place, to be surrounded by living trees over 2200 years old was incredible and beautiful. We were there in off season which was great, no huge crowds, it was almost like we had the place to ourselves."], ["Reviewed March 13, 2017", 5.0, "Winter wonderland", "The sheer height and girth of the sequoia trees is breathtaking. The snow-covered trees made for a very scenic drive along General's highway."], ["Reviewed March 10, 2017", 5.0, "Humbled by the Trees", "When visiting Kings Canyon and Sequoia National Parks we were simply humbled by the majesty of these arboreal giants. There was a time when the rest of the world did not believe such magnificent trees could even possibly exist. Well, they do and if anyone has a chance to visit these two national parks it is highly recommended that they do so. No one could be disappointed by viewing and walking among such life!\nIn case seniors are not aware, they can purchase a National Parks Senior Pass for $10. to visit all the nation's national parks for this one time fee... for the rest of their lives! What a deal.\nShow less"], ["Reviewed February 27, 2017", 5.0, "Amazing Sequoia", "This is a very large area with lots of walking but well worth the effort. Hundreds of amazing, massive trees that are among the largest in the world. Wonderful experience and should be on anyone's bucket list."], ["Reviewed February 22, 2017", 5.0, "If you like big trees, this is the place", "Hired snowshoes and went walking in the forest. Saw lots of birds and no people! Beautiful trees, some suffering unfortunately from previous wildfires, drought and bark beetle but fantastic none the less."], ["Reviewed February 6, 2017", 5.0, "Giant trees all over", "Great place to take the kids if ya'll enjoy trees and nature. We enjoyed our visit here walking and sightseeing."], ["Reviewed January 23, 2017", 5.0, "Giants!", "Absolutely stunning trees! So beautiful and gigantic! Feel like you are back in the prehistoric period. Must see!"], ["Reviewed January 12, 2017", 5.0, "These giants will amaze you.", "You have no concept of how big these trees are. It is hard to even image that these trees can get so big. They have stood here forever. Image all the centuries they have survived and witnessed. Image who stood at the foot of these giants. To be here is to be in awe.\nShow less"], ["Reviewed December 30, 2016", 5.0, "Gorgeous, ancient trees", "This is a wonderful forest to wander through, termed the \"Giant Forest\" by John Muir back in the day. Stately and gorgeous Sequoias on trails surrounding meadows!"], ["Reviewed December 27, 2016", 3.0, "Beautiful place", "We went on december 27th. We wanted to go to sequoia national park and drive through to Kings Canyon. This was not possible because the road was closed. We recommend going early in the morning. There are no long waiting lines to enter the park or on the mountain. You need to have chains with you. Buy or rent them. Even if it is not necessary to put them on you must have them with you. Rangers made us put on the chains well before it was necessary. This is really not good for the tires but ok. Up on the mountain there was Lots of snow and beautiful sights. The small museum is good for a short visit. On the way back down we took of the chains quite soon. We also had to wait 10minutes because the police was stopping the traffic for god knows what reason. So one big recommendation: go early because it gets very busy!!!\nVery nice pictures of this beautiful spot.\nShow less"], ["Reviewed December 20, 2016", 5.0, "Incredible", "We drove in at night, but even then, having the headlights shine on the enormous trunks really built our excitement for going back the next day. It's so beautiful and incredible. Highly suggest the big trees trail as well as General Sherman Tree. Both easy with young children. Our daughter is seven months.\nShow less"], ["Reviewed December 18, 2016", 5.0, "BIG TREES!", "What can I say...these trees are huge! Definitely a must see in Sequoia NP. If you like solitude late fall/winter is a great time to be here, especially a few weeks before Christmas. We felt like we had the place to ourselves which says a lot if you have been here in the summer.\nShow less"], ["Reviewed December 14, 2016", 5.0, "Huge trees", "This is a once in a lifetime experience. Until you see these trees you have no concept of large. These are the largest trees in the world. If you're entering via the north entrance through kings canyon, stop at Grant Grove. This was my favorite part of all, better than general sherman. It felt like a magical forest and lots of deer that walk just feets away. We stayed 2 nights in the park at Wuksachi lodge but one night is sufficient. Be careful driving, these are all mountain roads with constant switchbacks.\nShow less"], ["Reviewed December 7, 2016", 5.0, "Disconnected", "There is no way to think about the office, when you are surrounded by these giants 2,000 and more years old. Winter services and accommodations are sparse, but the peace and beauty of an off season visit are worth it."], ["Reviewed December 7, 2016", 5.0, "Breathtaking trees!", "It is tremendous trees! You feel like in prehistoric era, so gorgeous and beautiful, but also quiet and peaceful!"], ["Reviewed November 30, 2016", 5.0, "These trees are a few thousands years old", "Walk amongst the giants of the world in Californias woods with trout fishing around and nice campsites but watch of for the hungry bears that like to peep around your camp site if they can smell any trace of food.\nMeadows, creeks and towering woods abound.\nIf you go in early spring or fall when it gets below freezing at night you don't have to worry about the pesky mosquito as they don't do well in cold weather.\nShow less"], ["Reviewed November 26, 2016", 5.0, "Amazing!", "Words can not express the magnificent beauty of this place. The grand scale of these beautiful trees is breathtaking . We were not able to see the grand Sherman tree, the oldest living tree in the world because we had our dog with us. Most of the park you'll be able to bring your pets in a leash... just not this particular trail.\nShow less"], ["Reviewed November 26, 2016", 5.0, "Brilliant", "Stunning trees making you feel humble at natures beauty. Good access even if your not the fittest person, and space to chill on your own and avoid the crowds. Definitely worth a visit any time of the year"], ["Reviewed November 25, 2016", 5.0, "Have to stop and visit", "If you have entered the park form the South (three Rivers) you will come to the Giant Forest in about 30 minutes. Stop here and take your first hike around these magnificent trees. If it is in the summer you can hike all around. There is a big parking lot there. There is also a road close to there that takes you to the Moro Rock trail, which is also very interesting. In that area is also the CarLog, a fallen tree that car used to be able to drive on. Now you can walk on it!\nShow less"], ["Reviewed November 18, 2016", 5.0, "Must see", "This is nature at its best. The trees are wonderful, even driving through the NP alone is amazing, but do get out of the car to do some short hikes or walk around to really admire the beauty & the greatness of these trees"], ["Reviewed November 17, 2016", 5.0, "Don't miss", "View is fantastic steep climb is well worth the time highly recommend this adventure for a unique time"], ["Reviewed November 14, 2016", 5.0, "peaceful Sunday morning on a beautiful day", "This is a must do on a visit to Sequoia. The trees are what's happening. Easy walking on a nicely maintained walk that includes wood decking for easy use for wheel chairs."], ["Reviewed November 11, 2016", 5.0, "Biggest trees", "To see so big trees at one place is very amazing. In visitor center you will learn a lot interesting things about life crycle and importance of fire. Worth to visit...maybe you will also sea a bear."], ["Reviewed November 10, 2016", 5.0, "My Favorite National Park", "Not sure why I am even writing a review, because it is clear that this place is amazing. But here is our visit in a nutshell...\n\nDay 1 - 5 hour hike from the museum down around the meadows via Huckleberry Trail, until the High Sierra Trail, down and up Moro Rock, and back to the museum via the Soldiers Trail\nDay 2 - 5 hour hike from the museum towards the General Sherman Tree via Alta Trail and then Circle Meadow, coming up to the Senate and House groups etc., and then returning via Rimrock Trail.\nDay 3 - 2 1/2 hour hike from Crescent Meadow with a go and come back along the High Sierra Trail\n\nHighlights:\n- The trees obviously! You can travel the world visiting beautiful mountains and forests, but the Giant Sequoias are so unique and so impressive, it truly takes your breathe away at every corner.\n- The wildlife: deer, squirrels, birds, and even saw a black bear cross my path on the last day!\n-The peacefulness: with so many trails, the moment the you get away from the main tourists trails, you find yourself alone amongst the trees. We walked several times over an hour with crossing anybody.\n-Trails: the trails are well maintained and easy to navigate. Also, there is not a very big elevation change throughout the park, so you can walk for hours and not be exhausted. It is basically like the ultimate nature walk!\n\nRecommendation: if you want to do some hiking, buy the $3 map at the museum, it is totally worth it.\n\nWe also wanted to visit Crystal Caves, but the tour was cancelled at the last minute because some rocks had fallen across the path and was deemed too dangerous. (This is why our Day 3 hike was only 2 1/2 hours!!:) Buy your tickets early, because it will sell out!!\nShow less"], ["Reviewed November 9, 2016", 5.0, "Breathtaking", "The hikes thru the forest have everything: giant sequoias at every turn, dogwood trees (yellow and red when we were there), fir and pine trees, granite outcrops, spacious meadows, and fields of ferns (pale beige when we were there)"], ["Reviewed November 8, 2016", 4.0, "Natural magnificence", "The size and age of the giant sequoias is awesome. October is a good time to visit with fewer people and no traffic jams or mosquitoes. We had excellent weather and the changing colours of the trees added to the scenery."], ["Reviewed November 7, 2016", 5.0, "Giant Forest", "We visited in November which was perfect. Great weather and not crowded at all. The Giant Forest is incredible. I wish everyone could experience viewing these majestic trees at least once in your life. If in the area and if you have the opportunity do not miss!!\nShow less"], ["Reviewed November 5, 2016", 4.0, "Beautiful", "The Giant Forest is amazing. The General Sherman tree is in the Giant Forest. It's a bit of a hike, down a big hill, to the grove. It isn't far but it's over 200 feet down from the parking lot. That doesn't sound like much but the altitude is over 7000 feet. There are benches along the path so people can rest. We definitely recommend seeing the Giant Forest. It's one of the highlights of the park.\nShow less"], ["Reviewed November 2, 2016", 5.0, "Spectacular!!!", "The most amazing and beautiful trees will capture your heart and soul. Driving through the park was lovely, but hiking down to see Gen. Sherman was astounding. The trees are so very old and beautiful. Majestic really. I don't know of anybody who does not love to come to this great park. This is a beautiful place to visit, plus the tranquility just soothes your soul.\nShow less"], ["Reviewed November 1, 2016", 5.0, "the colors off the forest", "it was beautiful the whether was great,did not have enough time to see it all,the highway were very safe to drive and the scenery was just great"], ["Reviewed November 1, 2016", 5.0, "Hike it!", "We hiked it and it was so beautiful. You can skip Sherman if you want, too much pavement around it. Any hike will do as long as you loop through the Giant Forest area. There is nothing else like Giant Forest in this world."], ["Reviewed October 31, 2016", 5.0, "Awe inspiring.", "An amazing place to visit. These ancient trees are simply amazing. You only appreciate their size when you get up close and personal. The park is well maintained."], ["Reviewed October 31, 2016", 5.0, "Incredible, even when it's raining", "We faced torrential rain, but stopped at the Wuksachi Lodge and got a coupe of rain ponchos for $4 each. Even with the crazy rain, it was totally worth the visit."], ["Reviewed October 30, 2016", 5.0, "The largest population of these enormous trees!", "We really enjoyed Grant Grove but we were in awe with how many huge trees are together here in the Giant Forest! You must see these trees!"], ["Reviewed October 29, 2016", 5.0, "Beautiful and awesome trees.", "Great place to visit and stay. Staff very good and when out and walking trails marked well. Nature at ti's best"], ["Reviewed October 29, 2016", 4.0, "wonderful", "Loved the big trees. Once you find the start of the trail it is an reasonable walk and makes you think about survival and the cycle of life through fire, drought, and wet. However after two days of big trees we became a little jaded and were ready to move on to something else.\nShow less"], ["Reviewed October 28, 2016", 5.0, "Just beautiful", "If you are a tree lover you have come to the right place. Trees for days. Some of them look a bit sad and it is evident there is a drought. but still so majestic"], ["Reviewed October 28, 2016", 5.0, "Breathtaking views", "We visited both and were amazed at the size of the sequoias. We followed many trails leading us to through both national parks we came upon such stunning views by just climbing trails to top and the views were well worth it. Sequoia was well signposted for walkers and cars. Would not have missed this for the world the General Sherman tree and the Giant Forest Museum were excellent. Don't forget to climb the 400 stone steps to the top of Moro Rock the views from there were breathtaking. You can't leave before you drive through the Tunnel Log another photo opportunity.\nShow less"], ["Reviewed October 27, 2016", 5.0, "Unique experience", "Between 5000 and 7500 feet above sea level the Sequoia grows in a zone of modest moisture and to great size and age, up to 3000 years. The drive or hike through the forest is inspirational. Fall is a best time to go."], ["Reviewed October 26, 2016", 5.0, "Sequoia Trees are so amazing!", "Walking among such giant trees was incredible! so peaceful! We went in Oct 2016 so the crowds were not bad and the weather was perfect. 70 and Sunny!"], ["Reviewed October 25, 2016", 5.0, "incredible trees", "a most incredible site with those old & huge trees. one feels like a dwarf & thinking of their age... unbelieveable & very impressing."], ["Reviewed October 24, 2016", 5.0, "Thie trees are majestic, noble and awesome", "Words can't even describe how magnificent these trees are to stand among. These trees stand to the glory of God who created them and thankfully there were men with wisdom who worked hard to preserve them from men of greed who sought to chop them down. Now these trees stand for all to see and enjoy.\nShow less"], ["Reviewed October 24, 2016", 5.0, "Must see", "All visitors will go here, but when we went, really not too crowded. Great to unblievable trees and you can walk all you want."], ["Reviewed October 24, 2016", 5.0, "Amazing forest", "The Giant Forest is the most amazing place to visit. We are so small compared to the giant trees. It is very humbling. There are trails for everyone to enjoy. Loved driving through the park. There is a new beautiful sight at every turn."], ["Reviewed October 21, 2016", 5.0, "Wow", "The trees are amazing the fact that we we her with some fall colour only added to the experience. With mist one day and sunshine the next we were lucky to catch it in all it's beauty. The rangers talk that we had,at the Forest Museum,was very informative.\nShow less"], ["Reviewed October 20, 2016", 5.0, "Amazing Park - Everything you need to know", "Sequoia & Kings Canyon National Park (California)\nQuick Facts\nBest hikes: General Sherman & Congress Trail, Panther Gap via Long Meadow, Moro Rock\nWhen to visit: This park gets quite a lot of snow and closes a lot of its trails in the winter months, summer is the best time to visit.\nDo I need a hiking permit? No.\nSequoia is a very picturesque National Park with an abundance of wildlife including black bears, marmots, deer, chipmunks and squirrels. A lot of the popular sites can be viewed by car and require minimal walking, however if you are interested in something more challenging you can take on Panther Gap. This hike weaves its way up the mountain and provides spectacular views of the valley, provided the clouds aren’t low lying like they were the day we went.\n\nLove National Parks check out my post on Americas 10 best National Parks at Forever Chasing Wanderlust\nShow less"], ["Reviewed October 16, 2016", 5.0, "Impressive", "Nature never ceases to amaze me. This Forest is a reminder of how small and young humankind is. Absolutely love to drive through here. Make sure you have a full gas tank before entering Sequoia since it gets packed and you will ve driving around looking for an available campsite. Totally worth it though!\nShow less"], ["Reviewed October 15, 2016", 5.0, "Whoa!!", "This place is absolutely amazing. It gives you a new appreciation for nature to see these behemoths that dwarfs everything else around them. We were even lucky enough to see a bear!"]]}}