{"Glacier Point": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Glacier Point", "url": "/Attraction_Review-g61000-d139187-Reviews-Glacier_Point-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/11/82/aa/hanging-over-it-all.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "3990"}, "address": {"@type": "PostalAddress", "streetAddress": "Yosemite Lodge Resort origin", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 6 days ago", 5.0, "Magic", "Make sure you are early enough to grab good spot to view the sunset. And use facilities before you drive up there. Stay away from toilets at the top if you want to live."], ["Reviewed 1 week ago", 5.0, "Highlight of Yosemite", "best view point in the valley.\n\nAlthough it was a long drive up from the valley. And sometimes parking can be a problem.\n\nglacier point is a good place for star gazing when there is no moon. they have rangers program at night during summer to talk about astrology and star constellations. It was educational for adults and kids alike.\nShow less"], ["Reviewed 1 week ago", 5.0, "Love the View", "We had a great experience here - no crowds- awesome views of Half Dome and waterfalls - amazing colors at sunset. It was worth the drive for us - of course we are pretty local and have visited the park many times so we pick & choose what we want to do on a given visit.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing Views!", "This place is the best place to see Half Dome if you do not want to hike. You can drive right out there in the summertime. Winter it is closed due to snow. An Amazing view that you will never forget!"], ["Reviewed 1 week ago", 5.0, "Awesome", "This place was magnificent. Worth the drive to the peak. Stunning views. I am so glad we had the opportunity to see nature’s beautiful views in Yosemite."], ["Reviewed 2 weeks ago", 5.0, "Among the most spectacular views I've ever seen", "Don't miss this vista point. It is truly spectacular. We stayed for quite a while just soaking it in. Hard to describe - just beautiful."], ["Reviewed 3 weeks ago", 5.0, "Best view ever!", "There are not words to describe the view from Glacier Point. Every direction we looked was amazing.Well worth the drive or bus trip up to it. A must stop while visiting Yosemite."], ["Reviewed 4 weeks ago", 5.0, "Hike up the 4 mile trail", "The hike is so much more rewarding than just arriving by car. It's a view that is a must in Yosemite obviously. Incredibly surreal. If you're athletic, take the panoramic trail to most falls and come down that way and make a day of it."], ["Reviewed January 21, 2018", 5.0, "Amazing Views", "We spent a day in the Valley and then drove up to Glacier Point early the following morning.\nTry to get there off peak otherwise it gets very busy and it's a surprisingly long drive from the main road.\nWe were there at the end of May and there were still field laying under snow at the very top.\nThe view over the valley was amazing and it really put into perspective where we'd trekked the day before.\nTake a good camera.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Sunning, Amazing, and beautiful", "This was simply magic, the views are out of this world, and seeing squirrels was an added bonus, they are tiny and so inquisitive. Really was a beautiful day for us New Zealanders"], ["Reviewed January 7, 2018", 5.0, "Connect with nature", "This place symbolizes the grandness of nature. Breathtaking views which are unique to Yosemite National Park. Visit the place early as the place has a very limited parking. You might have to wait for hours to get the shuttle to this point."], ["Reviewed January 3, 2018", 5.0, "Gorgeous View", "Worth the drive or hike for the gorgeous view. Take binoculars. Go early soz you can find a parking space!"], ["Reviewed January 1, 2018", 5.0, "One of the best views", "In my opinion, this is one of the best views in the entire park. My sister and I rode the hiker's shuttle to Glacier Point, as we intended to hike back down. The shuttle itself was very unpleasant, and the workers were exceptionally rude; however, Glacier Point itself is worth it. The view is very dramatic and gives you a good view of Yosemite Valley, the waterfalls, and Half Dome.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Great sunset", "If you have the chance to enjoy the sunset at Yosemite National Park I hardly recommend you to choose the Glacier Point to chill. Be aware that many people do the same, so arrive around one hour prior to sunset during summer time and 20 minutes during low season.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Amazing vista of Yosemite Valley", "This is a truly breathtaking spot. You can see all across the valley - I'm very glad we made the trip. It takes ~40 minutes from the valley to the top, beware that the roads are often shut in the winter."], ["Reviewed December 17, 2017", 5.0, "Better than the drive down to Yosemite Valley", "Take your time on the 35 mile drive from Wawona Road to Glacier Point. Stop for at least 45 minutes at Sentinel Dome Parking and Washburn Point. Enjoy the views of Yosemite Valley without fighting the gridlock traffic down below. Take a picnic lunch (and take your crumbs with you.) Please, don't feed the wildlife. A morsel fed to a wild animal most often results in a change in their natural behavior which will lead to their death by starvation or extermination (if it becomes a dangerous nuisance). If you are lucky, the view to the west from Sentinel Dome area can include the Santa Cruz Mountains - about 150 miles West! On a clear day in Yosemite Valley, you can see reflections in the river and the lakes and ponds, climbers on the rocks, and hikers on the trails - bring a good pair of binoculars. Take only pictures and memories, leave only footprints.\nShow less"], ["Reviewed December 15, 2017", 5.0, "This is It!", "No matter what, do not miss going to Glacier Point. It is the most iconic view of Yosemite Valley and the opportunities for photography are unparalleled. There is a store at Glacier Point if you are hungry, thirsty or need provisions."], ["Reviewed November 30, 2017", 5.0, "Best view", "we stayed for 3 days in the park and I am sure this was the best view and photo opportunity in all the trip"], ["Reviewed November 27, 2017", 5.0, "Best view around!", "Worth it, especially in November when its usually closed for the season. Go picnic there, take a short hike, or stay for sunset over Half Dome. Takes about 45 minutes from the Valley floor."], ["Reviewed November 26, 2017", 5.0, "A MUST for ANYONE VISITING YOSEMITE FOR THE FIRST TIME OR 100 TIME", "If you travel to Yosemite and the road to Glacier Point is still open, you must go and see the views. If you only have about 2 hours to spend in Yosemite for some strange reason and you want to see what Yosemite has to over with out hiking, walking, or moving from one spot more than a few feet then you must go to Glacier Point.\nGlacier point is about an 1 hour and 30 minute drive from the main gate and is only open from late Spring to Early Fall depending on snow fall.\nOnce you reach the main parking lot you have a Store, Restrooms and two viewing locations. The first is the Main one showing Half Doom and all 3 of the main Water Falls in the Valley; Vernal, Nevada and illilouette Falls.\nThe Second Viewing area located to the left of the first is named Glacier Point and it gives you a birds eye view of the Valley Floor and Upper and Lower Yosemite Falls. Curry Village and The Majestic Hotel. It has a 3 mile hike to the valley floor from here it is all down hill and then a 3 mile walk back up hill since there is no bus service from the valley floor to Glacier Point\nShow less"], ["Reviewed November 26, 2017", 5.0, "So, OK you have to go there...", "The view is amazing of Half Dome and the Yosemite Valley. It is a crowded tourist spot, but you will be glad you went nonetheless. It is best to arrive there after a hike around the top of the valley and a visit to Sentinel Dome. Just great.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Wonderful at sunset", "36 mile drive up from the valley floor but so worth it when the sun sets, the colours at are amazing, a must when visiting Yosemite."], ["Reviewed November 23, 2017", 5.0, "Beautiful Area!", "This is a breathtaking view of Yosemite! Make sure you stop here during your visit to Yosemite. Have your cameras ready!"], ["Reviewed November 18, 2017", 5.0, "Speechless", "We have been blessed to visit many breathtaking locations but only 2 have left me speechless: the Grand Canyon and Glacier Point. i couldn't find words to describe the beautiful view. We kept scurrying from spot to spot to compare the vistas. It is somewhere I will hold in my memories forever.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Spectacular views", "We took the tour up to Glacier Point on a bus operated by the park service. Beautiful views as we rode up to the point, but when we got to the point what we saw on the way could not come close to comparing. The views are simply amazing! This is a must see for anybody.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Stunning views!", "We started the Pohono Trail from Glacier Point so didn't spend very long there but the view of Half Dome and down the valley was incredible. Beautiful start to our hike!"], ["Reviewed November 15, 2017", 5.0, "Awesome view!", "See almost all of the park from this point. Easy walk from parking area to Glacier Point. Also has restrooms, gift shop and snack shop! Take lots of pics!"], ["Reviewed November 14, 2017", 5.0, "A must visit on a trip to Yosemite!", "Amazing views of the valley from here. The road to get here is a bit difficult to drive, but well worth it."], ["Reviewed November 13, 2017", 5.0, "Great views!", "Worth the drive, we combined it with stopping at the trailhead to hike out to Taft point and then over to Sentinel dome. Left the valley early in the morning and after hiking, enjoyed lunch at Glacier Point. Watch out for those bold squirrels, they come right up to your back pack! We went midweek, so minimal crowds.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Amazing view", "If you enjoy a great view, you have to see this. Every time I'm in the park, it's a must see. Can be very crowded in the middle of the day so if you can go early or late, it's better. You can see the valley, many of the falls, Half Dome and the view is spectacular.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Drive up to Glacier Point", "It is about an hour drive up here, be aware that there are some big potholes close to the Point. You are rewarded with expansive views of the magnificent Yosemite Valley."], ["Reviewed November 9, 2017", 5.0, "WOW!", "TONS of people , bathrooms closed! jiffy johns 2 available! like a toxic waste dump! views are wonderful"], ["Reviewed November 8, 2017", 5.0, "CA Trip 2017", "Glacier Point has awesome views! Plus you get a great view of Half Dome. Was with Road Scholar trip and was so surprised at the gorgeous views!"], ["Reviewed November 8, 2017", 5.0, "Best place to watch the su set on half dome", "This place was recommended by a ranger as \"The best place in the western hemisphere to watch a sunset.\" He was right. brought a couple of bottles of wine and we were not disappointed."], ["Reviewed November 7, 2017", 5.0, "Wow", "Fantastic place, it's very much uphill so make sure you have a full tank of fuel before going up the mountain as there is no fuel up or down. Very beautiful drive with loads of stopping places to take in the scenery. Love the place it's great\nShow less"], ["Reviewed November 7, 2017", 5.0, "Don't miss views", "It's a long drive, but you really don't want to go to Yosemite and fail to see this. There are several viewpoints so you can see a lot of the park.\nBe sure to take your own food and drink with you. The concessions were closed when we went in October.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Amazing views", "A must see at Yoaemite. Worth the drive. Gives a different perspective. My favourite views. Photos are fantastic."], ["Reviewed November 6, 2017", 5.0, "The best view! Fantastic!", "The best view! Fantastic! I am so glad I came here. This is something I will remember the rest of my life."], ["Reviewed November 6, 2017", 5.0, "Stunning views", "After a bit of an 'interesting' drive along a pretty narrow road, the views from the viewing areas were stunning. I would definaitely recommend going here if you're in the park"], ["Reviewed November 4, 2017", 5.0, "A bit of a drive. ..", "Make sure you start off earlier and know what time the roads close by going to the visitor centers. You will want to keep stopping on the way so you need to allow an hour there and a bit less back (going down hill)"], ["Reviewed November 4, 2017", 5.0, "Amazing scenery & stories.", "Bill our tour guide was great fun & masses of information & tales. Like all guides, he clearly has a great love of the park"], ["Reviewed November 2, 2017", 5.0, "Breathtaking!", "Start or end your trip to Yosemite at Glacier Point to get a sense of the grand scale of the park. The vista will give you a real appreciation of what John Muir saw in the early days and why he was so determined to protect this beauty for generations to come!\nShow less"], ["Reviewed November 1, 2017", 5.0, "Go here right now", "We hiked the 4 mile trail from the valley floor to Glacier point and it was truly amazing. Don't be fooled though, 4 mile trail is longer than 4 miles and you'll climb from 4000ft to about 7200ft so it's quite a hike but I can highly recommend it. You can drive to Glacier point, but the hike makes the views from the top so much better. I would live here if I could...\nShow less"], ["Reviewed October 31, 2017", 5.0, "You won't get a better view in the park.", "Having pre bought the tickets for the glacier point tour we parked up in the Yosemite Village car park and walked the 20 mins or so through to the Yosemite lodge meeting point.\n\nThe tour guide Bob Fontana was more than passionate about his job and the park. What he doesn't know about the history, the flora, the fauna, the wildlife, the geology isn't worth knowing.\n\nWe got to the car park after about an hour, and walked up to the vista point, from here you can see glacier point, the waterfalls, the valley floor I am sure you can see if you can brave looking over the edge.\n\nToilets and snacks available.\n\nVery memorable visit enhanced by Bobs expert tour.\nShow less"], ["Reviewed October 29, 2017", 5.0, "A must see", "We booked the Glacier Point bus tour for during our visit to Yosemite and were so glad we did.\n\nOur Bus driver was very chatty and friendly and made the journey fun and, Glacier point is simply stunning - words cannot describe the views, you have to go there yourself and see them.\n\nThree of our party chose to walk the trail down and their experience was amazing, the scenery is breathtaking: word of warning though, this walk is not for the feint hearted as it is quite steep in places, but if you are able to, definitely worth the effort.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Just Do It", "If the road is open take the trip up and spend some time up here. We did both Olmsteat and Glacier point. There is so much more to do on Glacier Point. Some shops, trials, food, and the scenery is breathtaking. Loved it in every way. Get an early start parking fills up quick.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Stunning views", "The point is at the end of a short trail that is easy to walk to from the parking lot. The parking lot is large & there are restrooms & a small visitors center here. You get the best view of Yosemite Valley and the area surrounding it from here. Allow 2 hours to drive in & out on the only paved road that ends at the point.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Absolutely breathtaking!", "If you only have time for one stop in Yosemite, then choose Glacier Point! This is amazing and a unique experience up there alongside Uluru and diving at GBR (in Oz)."], ["Reviewed October 25, 2017", 5.0, "Great Sunrise", "Best spot to watch the sunrise! In case you plan on hiking up that 4.6 miles of Four miler trail- Be cautious its long & steep but having this view at the end is worth it!"], ["Reviewed October 24, 2017", 5.0, "The View at the Top", "We spent about half of the day at Glacier Point and the nearby Sentinel Dome trail. Go early in the day and enjoy majestic views of the entire Yosemite Valley. There is a gift and quick food shop at the Point."], ["Reviewed October 24, 2017", 5.0, "Best place in Yosemite if only traveling by car/bus/rv", "Glacier Point is an amazing place. It's so huge and gorgeous that it's hard to take it in.\n\nEvery different angle, provides whole new view point of the valley. Absolutely amazing.\n\nLots of parking space. The first area is usually crowded, but if you drive through that, more parking spots will appear.\n\nThere are bathrooms up here, all though there's no water. So they are not the most cleanest ones. But once in Yosemite, you'll get used to these.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Yosemite. Beautiful if you can avoid the crowds.", "Just adding my voice to the stream of reviews that should have already convinced the reader that Yosemite is one of the most spectacular places on the planet. Huge amount of scenery in a small space and Glacier is one of the best outlooks anywhere on he planet. Well worth the effort but for he newbie be aware:\n1. Glacier is only open for part of the year. Check the dates and be prepared.\n2. When it is open it can be very busy and if you are driving up that means traffic jams and waiting.\nThe crowds don’t help the experience so avoid if you can. Simplest way is to go early or late, avoid weekends and especially long weekends. But make sure you go. It’s a view worthy of you’re wall at home.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Magnificent Views From Glacier & Washburn Points.", "Visited last week of September.\nGlacier Point is One of the best viewpoints of Yosemite Valley,it is accessible from Wawona Rd (Hwy 41) about 16Miles,1 hour drive south of the valley floor,quite a bit of a drive, but its definitely worth it for the spectacular view.\nOther way to reach Glacier Point, 1-you can hike the Four-Mile Trail from the valley to Glacier Point. 2-by a paid bus that you can take to Glacier Point.\nWe arrived early(9AM)by Car and were able to find parking and the crowds were limited.The two Glacier Point Lookout are a very short walk to get to from the Parking Lot.\nThe Panoramic View of Yosemite valley from here is amazing and great for\npictures,you can see Half Dome, Upper and Lower Yosemite Falls,Vernal falls,Nevada Falls and many other points of interest.\nThere are Free Telescope viewer faces Half Dome at observation stations for viewing sights,you can see people climbing up Half Dome.Also there is a small geological display Box help the visitors to identify what they are looking at.\nThere is a Gift Shop that sells souvenirs and snacks,also there are restrooms as well,but no running water(absolutely disgusting!).\nTraveling on Glacier Point Road be sure to stop at Washburn Point before you get to Glacier Point,it is just off the road.You can get the same view of the surrounding areas, but from a slightly different angle,which is almost an equally impressive viewpoint.The views of Vernal and Nevada Falls are slightly closer from Washburn Point than from Glacier Point.\nIf you go to Yosemite, Be Sure to stop by Glacier Point and Washburn Point .Go early to avoid the crowd and take your time to admire the view from there,and take a lots of photos, it's spectacular.\n\n\nShow less"], ["Reviewed October 23, 2017", 4.0, "Amazing views", "The views are amazing from up here. Almost 360 and looking down to the valley as well as across to the half dome and nevada falls. Quite a few things to see and stops to do."], ["Reviewed October 22, 2017", 4.0, "Outstanding views", "It a fairly long drive to Glacier Point, but it is well worth it and is highly recommended. The views are terrific, and It is a sizable tourist attraction. Try to get a feel for the bet time of day to visit as it can get crowded.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Amazing", "Worth the drive or walk if you are feeling energetic. Amazing views over the mountains and down in to Yosemite valley"], ["Reviewed October 21, 2017", 5.0, "Top of the world!", "The view from glacier point is well worth the drive! Watch out for deers crossing and apparently bears (didn't see any bears). It's about 16 mile feom turn off but as i say, well worth it! Windy road as are all roads in Yosemite. Stunning!"], ["Reviewed October 21, 2017", 4.0, "Stunning views, a lot of people.", "While not as crowded as the Yosemite valley, this area is also popular with anyone visiting the park. It is a beautiful area but arrive early because once the parking lot fills up you will have to be shuttled in to the area. We arrived by 9 AM and had no problems with parking. After returning from our 5 hour hike, the parking lot was full. There are a lot of people who just walk around the point, but if you can hike some, you can get away from the crowds and really see some stunning vistas.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Stunning", "Definitely go here after your visit to Yosemite! It is a fair drive of 30 minutes but the views are incredible. We went just before sunset and it was amazing!"], ["Reviewed October 20, 2017", 5.0, "Glacier Point", "Took the 4 hour Glacier Point tour and the driver/ tour guide was fantastic he was so knowledgeable. He talked from beginning to the end and I would definitely recommend this tour. The views on the journey and when you reach the top are breath taking, It can get a little cool at the top so make sure you have a jacket.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Take time to visit this breathtaking overlook.", "If you have time during your visit to Yosemite, and the road to Glacier Point is open, you won't want to miss this opportunity. You can drive up within an hour to this viewpoint, and learn about the history of the Yosemite Valley and the formation of the peaks. If you're interested, you can walk up or down to this area. There are buses from Yosemite that drive here (check the schedule), but there's also plenty of parking. We were here in mid-October, though, and the parking lot was full to capacity. Picnic areas, restrooms, and snacks were available on-site. The view is amazing. The drive is challenging for larger vehicles.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Glacier Point is one of my favorite spots in Yosemite!", "I love arriving in the night to Glacier Point and camping in the parking lot. I always make sure to setup a time lapse of the stars over Half Dome during the night. Then I wake up early to catch sunrise, again over Half Dome. You can't beat the views from this spot and this is also where a lot of classic, epic Yosemite photos are taken.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Breathtaking views - Yosemite in all its glory", "You can reach Glacier Point via the Four Mile Trail, via car, or via one of the park's guided tours. The views are absolutely astounding, and I think that anyone visiting Yosemite for the first time has to come here. I wasn't able to this time, but really want to experience a sunrise or sunset here next time. Keep in mind it will be crowded.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Great hike", "Walked up to Glacier Point from Yosemite Valley. It’s pretty monotonous in terms of the continual switchbacks but views en route are great! Downside for us was the wild fires which caused entire valley and summit to be shrouded in thick smoke meaning breathing was difficult. Quite a long walk there and back. Road was closed when we hiked it due to fires. Would do again just for the views which we didn’t get to appreciate fully. Worth doing though if you’re feeling fit enough.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Views at sunset amazing", "We drove up here for sunset arriving about an hour before the sun went down, this was full of photographers with tripods. Amazing view of Half Dome, Mirror Lake and the valley floor below."], ["Reviewed October 16, 2017", 5.0, "Yosemite Rocks", "We bought two souvenirs here at the gift shop with the words \"Yosemite Rocks.\" These rocks are an unbelievable sight. We spent a bit of time here just taking in the view. I'm still amazed when I look at the pictures we took. I've wanted to come here for a long time, and it was even better than I imagined. The gift shop has good souvenirs and refreshments.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Wow!", "We took the one way Glacier Point tour originating at Yosemite Valley Lodge and hiked the 4 mile trail (actually closer to 5 miles) back down to the lodge. The views from the top are not to be missed. Our bus driver, Bill was fantastic. Funny and informative at the same time. Even the kids enjoyed his Yosemite history lesson.\nIf you don't want to take the tour, you can drive to the top yourself. The parking lot was not too busy when we were there, but it is the off season. Either way, do not miss Glacier Point during your Yosemite visit.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Beautiful view, especially at sunset!", "A must side trip when visiting Yosemite Valley. The drive takes time, but it is one of the best views of the valley."], ["Reviewed October 16, 2017", 5.0, "Totally worth your time - WOW", "We had one full day in the park so we did the valley floor tour followed by a drive to this point. Incredible views and very worth your time. Even a shop on top which offers snacks and warm drinks!"], ["Reviewed October 15, 2017", 5.0, "Amazing views", "The views from this attraction are just stunning! Well worth the drive up the mountain as you will be rewarded with an awe inspiring view. Parking was a bit of an issue and it took us about 30 minutes to find a spot. A must visit in Yosemite.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Glacier Point Visit", "WOW! The views from Glacier Point are outstanding. The park is amazing! Must see! I would recommend a one way bus pass to Glacier point, then hike down Glacier point (4 miles). The views are breath taking!"], ["Reviewed October 13, 2017", 5.0, "Spectacular", "The drive to Glacier point is well worth it for the views of the valley, Yosemite Falls, Half Dome and Vernal/ Nervada Falls. Glacier point is well equipped with restrooms and a shop/ cafe where you can buy souvenirs and light snacks (sandwiches, crisp and ice creams, hot and cold drinks). There is quite a large car park but in peak season it would get full rather quickly therefore we recommend going early; if you have an RV drive through the loop car park and there is space for approx 6 RVs at the top before you rejoin the road you entered on. The trails to the main view points are short and accessible for all abilities and can accommodate strollers/ wheelchairs.\nShow less"], ["Reviewed October 12, 2017", 5.0, "best view of the valley, sunset included", "it offers the best view of the valley, half dome, falls, great place for photos. parking is limited but you should be ok before 10am. there are guided tours to watch sunset."], ["Reviewed October 12, 2017", 5.0, "accessible by car - come for the sunset", "- accessible by car - great views - also do washburn point on the way - c 35min drive from Yosemite Valley - make sure you stand on the rock outside the marked area for a great picture"], ["Reviewed October 12, 2017", 5.0, "Stunning just do it", "Took the tour from the Yosemite valley lodge.Winding road up with the reward of amazing views when you get there."], ["Reviewed October 12, 2017", 5.0, "Spectacular View of Yosemite, In All Its Splendor", "We were delighted to find out we could drive to the top of Glacier Point because we thought we would have to make the long and difficult hike if we wanted to see it. We opted to drive there as we were leaving Yosemite, heading to Sequoita and Kings Canyon so that we wouldn't have to move our car while we were staying in the park and lose our valuable parking spot. This is one place that the shuttles do not go. You are able to see the Majestic Yosemite Lodge, the Vernal and Nevada Falls that we were unable to hike to because of the degree of difficulty, and an unsurpassed view of Yosemite National Park! Driving certainly is not for the faint of heart due to the winding and narrow roads, but the reward when you arrive at the top is unbelievable.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Beautiful Vistas - but Plan Carefully", "You cannot beat the views up here. It, however, gets very crowded quickly. Make sure you plan to head up early if you want to park and hike. Also note - the bathrooms are not, great, up there (July) and the mileage on the signs is not accurate but a best guess. Make sure you account for elevation in your hiking time and even if its a cool summer day in the shade, the sun can be brutal so bring enough water.\nShow less"], ["Reviewed October 9, 2017", 4.0, "Great view but crowded and a bit of a drive", "Glacier view is a great spot to understand the size and geologic features of Yosemite. You can see Nevada and Vernal falls, Half dome and and many other features. But it is crowded. You have to wait your turn to get your pictures and have to wait even longer to get the front row view from the railing. After about 10 minutes of fighting crowds and waiting our kids were ready to move on to something else.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Great spot for a view", "If you don't feel like hiking up the mountain, drive up it to see the valley at Glacier Point x) (or you can hike here too if you want lol)"], ["Reviewed October 9, 2017", 5.0, "Excellent views", "We took the one way tour from the Valley Lodge to Glacier Point. You get an excellent view of lots of the landmarks in the park. It's an easy walk in this area. There is also a small snack shack and restrooms. From here we hiked 8 miles down to the Valley floor. It starts out an easy hike around the rim. It's very pretty and scenic. Then we passed Illiouette Falls, Nevada Falls and Vernal Falls. They are all different and each beautiful. Towards the end the hike got more difficult. Going down can sometimes be just as hard as going up. It took us about 6 hours to hike, but we stopped and each falls (I like to take a lot of pictures) and we also stopped for lunch break.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Excellent viewing area", "The views of half dome, the waterfalls, and the point itself are astounding. A must go for everyone who is inspired by nature’s majesty."], ["Reviewed October 8, 2017", 5.0, "Must to go", "Beautiful views, feel close to nature. There are some trails but we didn't try it because my kids would not make it. My sons are 4 and 6 and we need to watch them closely because can be dangerous close to the edges. Arrive early, after 10 am was getting crowded. Super recommended\nShow less"], ["Reviewed October 8, 2017", 5.0, "Stunning Views", "Quite a bit of a turn on the road to get to the carpark but drive carefully and it's okay. Not much of a walk takes you up to the viewing platform. You can see Half Dome up close and more stunning views. Lots of people go for sunset as the Half Dome turns an orange colour but we didn't want to drive out of the park in the dark so got there for early afternoon. Loved the views and appreciate how stunning they must be at sunset. Must visit here if you do visit Yosemite. There are restrooms in the carpark.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Triple Wow", "There is plenty of nice scenery in Yosemite Valley, and the average tourist can get very attached to the shuttles that take you to these attractions. But...and this is a big but...you would be well advised to set aside a morning or afternoon to hop in your hot rod and drive up to Glacier Point. My trusty GPS did a great job of taking us along the winding roads that got us to the rest stop along the main highway toward Wawona. Be sure not to miss it; we got so used to winding and rocking and rolling that we almost drove past it. The road to glacier point takes off from the rest stop. It is extremely steep and winding, and you had better not have a weak heart when it comes to heights. Because of recent fires, we bulled our way up and skipped the viewpoints on the way up. Glad we did. The last 2 stops are the best. The one right before Glacier Point is absolutely awesome and we spent a lot of time there (wish I remembered the name of the viewpoint). Glacier Point is awesome with very good facilities, It is a tour bus magnet, but well worth the stop. There are few places that can rival the view from these 2 stops. Be ready to be awed. The best advice I can give for The Glacier Point stop itself is to go the full loop and park near the exit end of the gigantic parking area. When it gets busy, tour buses block you when it is time to leave, all the losers that have to stop in the middle of everything to put eyes on people that may or may not be walking to their cars, will block your way in their quest for the perfect parking spot. In fact, this place is so busy, it probably could use more parking, so that would be the one negative. Also, be advised the further down the loop you go, the less time you will spend in line waiting to use a restroom. So there; free advice from a crabby old dude with a weak bladder. Wonderful place! Take your time driving down the hill toward the main highway; the journey is more difficult downhill on this narrow road. We did not spot very many viewpoints worth pulling over for once we had been to the top of the world!\nShow less"], ["Reviewed October 7, 2017", 5.0, "Better than you can imagine", "Breathtaking views at Glacier point, where you can view Half Dome and many fantastic views that photos just can't do justice to. We had to queue at the bottom before we were allowed to drive up as there were a lot of cars there. There said an hours wait but actually was only about 15 mins.\nOnly down side were the restrooms which were not very pleasant!\nShow less"], ["Reviewed October 7, 2017", 5.0, "Spectacular Views", "Even if you don't enjoy hiking, this is a must see area of Yosemite. The only walking you will need to do is the very short walk from the parking area to the lookout which provides a breathtaking view of the valley, surrounding peaks and even several waterfalls.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Not to be missed", "A spectacular overview of Yosemite Valley and surrounding mountains and falls. But be warned, if you aren't in the car park before 10am there's a good chance you'll be stopped half way down the mountain and have to wait up to 90 minutes for a car park.\nAlso don't feed any of the squirrels and chipmunks, there is a $5000 fine if caught.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Expand your view of Yosemite", "Most people stay in the valley and don't go beyond. Glacier Point is a great way to see this incomparable place from another vantage point. We went up here to see the sunset and do a little stargazing. What a spectacular way to see the sunset, slowly see the light fade on Half Dome and the Sierra Nevada Mountain range. Come up here, go to the High Country or spend some time in the Mariposa Grove once it reopens. Yosemite has so much to offer. One of the most beautiful places on the planet!\nShow less"], ["Reviewed October 3, 2017", 5.0, "Scenic view from over Yosemite valley", "This is a must see- even before going to Yosemite valley. Drive is a bit intense as the 35 mile drive is curvy and narrow but the view from the top is worth the effort- or go by bus from the valley lodge . View of the valley, half dome and the waterfalls are spectacular. Must do it!\nShow less"], ["Reviewed October 3, 2017", 5.0, "Arrive early!", "This was our first choice place to visit so we went there first thing, arrived a little after 7am to fresh fallen snow (yes in September). Our car was the third in the lot. We spent an hour plus looking around and snapping photos. By the time we left the parking lot was filling so arrive early.\n\nAs for the viewpoint: one of our world's greatest vantage points. Absolutely spectacular! Enjoy! Love looking straight down into the valley and seeing all waterfalls and sites we planned to visit later in the day.\nShow less"], ["Reviewed October 3, 2017", 5.0, "A superb national park but avoid peak season", "We spent 3 days in late August visiting Yosemite but the centre of the park in Yosemite Village even with their one way traffic system was clogged with traffic. However the eastern side of the park and the separate Glacier Point roads were relatively traffic free.\nGlacier Point is well worth the visit as it overlooks Yosemite valley, Half Dome and the high Sierra mountains in the distance. It also allows spectacular views of 2 great waterfalls Vernal and Nevada. It's about a 30 mile drive from the turn off on a well paved road with some good viewpoints and stopping off places on the way. It is also the starting point for some demanding hikes, including one down into the valley floor.\nI suspect that the National Parks Service correctly in my opinion, does not want glacier Point to become commercialised, as a result you have just one snack food outlet selling a limited range of snacks and ice creams and the ice creams were reasonably priced, unusual for a vendor with a virtual monopoly.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Beautiful Views, but So Crowded", "Anywhere there ends up being a line to take a photo, it's just too crowded. Don't get me wrong, the views are absolutely stunning, but this is somewhere I'd really make the effort to get there early in the morning. Not a ton of parking either, so there's another reason to hurry out there.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Grand Canyon of Yosemite", "Be sure to Yosemite Valley BEFORE you drive to Glacier Point. It's a 16 mile drive, and you will come out on top of the world, looking straight across at Half Dome and beyond. I'm a local who goes frequently, and it's always a joy!"], ["Reviewed October 2, 2017", 3.0, "Nice views, but head to Sentinel Dome instead", "The view is excellent from here, of course, and it is an easy short walk from the car park to get there. But, via a short (1.5 mile or so) walk from further down the road, you can reach the top of Sentinel Dome, which is not only even higher, but - unlike Glacier Point - offers a complete 360 panorama. We went there first, and thought the view was overall better (and it's a lovely walk). Also, it was infinitely less crowded!\n\nAs with all of Yosemite, traffic is a huge issue. They should really keep the shuttle from Badger Pass (where there is a huge car park) to Glacier Point running beyond Sept 5 - why they don't, I have no idea. Be prepared to wait for some time.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Spectacular view", "We climbed 4 mile hike to this overlook, well worth it. The view of the valley and half dome are worth every step up. You can also drive up via Glacier point road."], ["Reviewed October 2, 2017", 5.0, "A must see", "Even though I had been to Yosemite before this was my first visit to Glacier Point - an absolute must for any visitor, we just loved being able to hear the waterfalls despite them being in the distance and of course the views are stunning. Booked a glacier point tour via the park - great value 4 hour trip, tour guide was informative but with a lovely soft and gentle voice that didn’t intrude. Seeing snow and the remnants of the latest forest fire just added to the trip. Excellent value for money.\nShow less"], ["Reviewed October 2, 2017", 5.0, "One of the best view points of the Park", "Ideal spot to view the Half dome, El Capitan and valley. One can see the Half dome and also the water falls including the Bridal falls,"], ["Reviewed October 1, 2017", 5.0, "AMAZING views", "This place should be on your bucket list. Here you can start the Panorama trail or eat lunch and stare at the park for hours. If you want to do the panorama trail book a shuttle bus from the valley even day before. Also remember that it takes 1,5 hrs for the bus to take you there so go early.\nShow less"], ["Reviewed October 1, 2017", 5.0, "On Top of The World!", "Beautiful views of the Yosemite Valley and falls. Get here early for the best parking and eliminate the crowds..."], ["Reviewed October 1, 2017", 4.0, "Fantastic views, hoards of people", "Pro: Magnificent views of the Valley with little to not effort\n\nCon: Hoards of tourists viewing right there with you\n\nAfter climbing Seminal Dome, seeing almost the same views, yet having it nearly to ourselves - this felt like a circus. Still worth the drive if you can't hike Sentinel Dome, or even if you have it's so close to the trailhead that you might as well check it out anyways. There's not a lot of serenity & solitude, but go with this in mind and you won't be (too) disappointed.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Minnesota Nice", "This was our last stop in the park....totally impressive and as others have stated...words can not describe. I have a feeling this place is packed in prime time. Handicapped acccessible and the views are the best."], ["Reviewed September 30, 2017", 5.0, "Beyond impressive", "Can't put into words how good the view is from here, pictures just don't do it justice. Completely worth the drive. Plenty of parking and a large area at which you can view it from. There's also snacks for sale and a gift shop."], ["Reviewed September 29, 2017", 5.0, "Beautiful drive; gorgeous view!", "Excellent for those who can't hike around the park. You can see amazing views of all the highlights of Yosemite Valley."], ["Reviewed September 28, 2017", 5.0, "One of the highlights of our 3 day Yosemite Visit", "We visited Glacier Point on our third day, the morning we were leaving the park for Sequoia. This was a great capstone to our visit, and a trip worth taking. Spectacular views at the beginning and end."], ["Reviewed September 26, 2017", 5.0, "Do the hike", "Take the 4 mile trail rather than driving up, you will have a much better overall experience. Very pretty."], ["Reviewed September 25, 2017", 1.0, "Poorly managed!", "We tried to access Glacier Point around 1pm on a Monday in September. As the website warned us, the road was blocked at Badger Pass. However, the website also CLEARLY states there is a free shuttle from Badger Pass to Glacier Point. When we got to Badger Pass, cars were being packed in and then sporadically released to go down the road to Glacier Point. No shuttle!!!! We opted against the wait and never even got to see Glacier Point. Don't know why there wasn't a shuttle.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Beautiful !.... but so sad there was a lot of smoke... 2017", "Due to the many forest fires there was a lot of smoke and smog in this beautiful national park! As a result, we do not have really beautiful pictures of the beautiful rock formations ... this is in fact one of the most beautiful parks in the U.S. is ... we will have to go back again. Only ... the restaurants are very expensive and do not really give quality food. Fast food restaurants are enough. But the beautiful nature is more than worth the money ... sure if you are in california !!! Input price: $ 35.00 per car! for 7 days. Do you buy more than 1 park than the Anual Park pass.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Like all other reviews, an absolute must!", "Views are incredible!! Absolutely amazing place... can get busy (obviously!) and finding a parking space can be a pain.. this is the number one attraction for a reason in Yosemite, do not miss!!"], ["Reviewed September 24, 2017", 5.0, "GORGEOUS VIEW", "Although it's a bit of a drive up the mountain, this is an amazing view and can NOT be missed when visiting Yosemite."], ["Reviewed September 24, 2017", 5.0, "Most amazing site no photo can do it justice", "Our host at our B and B advised us to visit. We were so lucky because it had been closed for weeks by the fires. But it reopened the day of our visit. We had to drive past warnings of fires which we saw burning by the side of the road on our way up.\nWhen we arrived at the first view point our breath was taken away. One of the most amazing sights of our lives. No photo can ever do justice to the splendour of Glacier Point. We progressed onto the main viewing area to take further pictures\nCertainly one of the highlights of our visits around the world\nShow less"], ["Reviewed September 23, 2017", 5.0, "Amazing view of Half Dome", "If you are in Yosemite. Take the time to make this drive. Amazing views of Half Dome and the valley. As well as a couple easy hikes with breath taking views."], ["Reviewed September 23, 2017", 5.0, "7th trip to Yosemite and 1st time up to GP", "After a 4 day backpacking trip (which should have been 5 days but a forest fire cut it short) we had a day to kill in the valley and we're too beat up to hike 4-mile trail so we drive to GP. Wow. What an amazing place. After visiting we wound up taking a 5 mile day hike up there to Sentinel Dome and Taft Point. I would recommend both... HIGHLY. Starting from that trailhead on GP road it's a relative flat hike or you can make it a longer hike starting at GP.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Amazing views", "As all the reviews indicate this is a do not miss! Wonderful views of the park and lovely drive. We were her in mid September and they were still struggling with fires. I can only imagine how beautiful on a clear day."], ["Reviewed September 16, 2017", 5.0, "Awesome View and Hike", "This was one of the most epic hikes and views at Yosemite. If you miss this one, you have missed the best part of the park. We hiked up the 4 mile trail and then did the panoramic trail past the Nevada and Vernal falls. 14+ miles and worth every step\nShow less"], ["Reviewed September 13, 2017", 5.0, "Best view of Yosemite!", "Amazing view of the park, highlight of ending a day of hiking! Can get a little busy at times with limited car parking spaces nearby. Best to be viewed when it's a bit less crowded to get the best experience."], ["Reviewed September 11, 2017", 5.0, "Absolute highlight", "This was an absolute highlight of our time at Yosemite. Totally worth the effort to get here. The aspect from so high up off the ground is breathtaking. Yes it can be crowded but we always managed to grab a spot on the edge and get some great photos. Do not miss this!\nShow less"], ["Reviewed September 8, 2017", 4.0, "Beautiful landscape", "A couple of hours' drive through thick forested road from the Yosemite Information Centre takes you to the glacier point. The view from the edge of this point is breathtaking. You see the half dome and many gigantic waterfalls that look like little streams from the distance. You cannot camp here but if you have a camp close by, it's a great way to spend a morning, just hiking up this promontory and filling your eyes with breathtaking scapes of rocks that merge with clouds.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Glacier Point", "You've thought about it - Just Do It This place is truly inspiring . The West is The Best - Get here, and we'll do the rest."], ["Reviewed September 6, 2017", 5.0, "Stuuned", "Way up there with finest sights in the world. An atmospheric, fearsome demonstration of nature in the raw. And the view puts the depth and scale of Yosemite Valley into perspective. Go."], ["Reviewed September 6, 2017", 5.0, "Gorgeous views very crowded", "My husband and I started at the 4 mile trail which is really 4.8 miles to the top of a strenuous hike. But when you get to the top the view is incredible. You can always take a shuttle bus to the top of Glacier point but if you are a hiker it definitely is a challenging hike with gorgeous views on your way to the top. Glacier point is very crowded. Get there early if you can. Big tourist attraction. Definitely worth seeing\nShow less"], ["Reviewed September 6, 2017", 5.0, "\"The View\"", "Great drive through a tunnel with winding roads and great scenery. The views from Glacier Point can't be beat. Half Dome takes on a very ominous view from Glacier point and has to been seen from that vantage point. Lots of hikes start or finish there as well.\nShow less"], ["Reviewed September 5, 2017", 5.0, "This Drive is A Must!", "The Park offers a star gazing at night and it was wonderful. The drive to Glacier Point was beautiful, one can see the whole valley from there. The scenery is amazing. This drive is a must!"], ["Reviewed September 4, 2017", 5.0, "Stunning Beauty", "A one-hour drive from Yosemite Valley but well worth it. A huge parking lot and rest rooms sit at one end of a paved walkway to the vista point where the panoramic views are breathtaking. Elevated layers of sandstone make great places to sit and take it all in at your own pace. My wife and I were a bit nervous that so many 20-something-year-olds were climbing the fence and walking to the very edge of the cliffs. One false step or slip and it's an unforgiving 3,000-foot fall to the valley floor below. Nevertheless, Glacier Point is beyond beautiful and there are a number of vantage points, one from the rocks, another from the amphitheater, and another from a stone tower on the grounds. A beautiful place any time of the day, but especially at sunset.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Sunset & stargazing", "We drove up for sunset and the view was spectacular. (This time of day a nice group of people gather) Ended up staying for a Ranger talk and then for star gazing.\n\nThe sky was clear and there were so many stars. As it got darker we could see the milky way. Stayed for about 1 hour and laid back on the rocks and enjoyed the peace, solitude and beauty.\n\nIt was smokey in The Valley that day and one Ranger told us it will either be beautiful due to smoke or we won't see a thing. Talked to hotel staff and they told us it would be a waste of our time. So glad we went as it was one of the most beautiful sights Ive ever seen.\n\nThe drive is long and very windy from The Valley; but worth all of it.\n\nGreat location to view The best of Yosemite. Bathrooms and gift shop are available at the top.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Amazing place, its the peak of the place and would ideally go with nice cams", "Amazing place, its the peak of the valley and you will really enjoy the pace, carry good cams to shoot the pics."], ["Reviewed September 3, 2017", 5.0, "WOW", "Breathtaking views, we went during the day and were blown away by the spectacular views. It's amazing that for all man made objects in the world, its Mother Nature that takes our breath away. We went back up to Glacier point on the night, one of the rangers gave a talk on the stars and planets. I can't explain how good this was: Cost $0. Brilliant.\nShow less"], ["Reviewed September 2, 2017", 5.0, "You Can Reach Out and Touch The Stars", "We took in the Starry Sky's session on Sunday, Aug 27, 2017. A Ranger describes the Constellations, provides background folklore and scientific facts.\n\nBring flashlights, but use them intermittently so you don't foul up your night vision. You'll be surprised how much you can see in the dark.\n\nGive yourself an hour to drive up there. It's a combination of climbs, switchbacks and straightaways.\n\nAt night you can hear Vernal and Nevada Falls down below.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Stunning vantage point for views of the valley", "A great location for getting some sweeping views of the valley, including El Capitan, Half Dome and various waterfalls. Toilet facilities on hand and a nice gift shop that also has ice creams and refreshments."], ["Reviewed August 30, 2017", 5.0, "A must-do stop, iconic, classic, great views with a fun rock perch for stunning photos", "This is a very well-established lookout point with a gift shop, snack foods and plenty of restrooms (pit toilets mind you, hand sanitizer is a must). It's a very short walk to get to the view points. The drive to get here is rather long with tons of curves (read car sickness). Parking is plentiful but almost always nearly full. Directly across from the gift shop towards the side that faces the falls and half-dome, there is an outcropping of rocks (before you get to the railing) that you can stand on to get some awesome effect shots.\nShow less"], ["Reviewed August 29, 2017", 5.0, "One of the best views in Yosemite", "If you can, get there before 10 am as they now have people park near Badger Pass ski resort and take a shuttle to the parking lot once it is full. You can walk to several different viewing areas for amazing views of the valley and 3 different waterfalls. We bring a picnic lunch and enjoy the views from a quiet spot away from the crowds. It is also nice to walk part of the way down the 4 Mile trail towards the valley. It is a shady walk, usually not two crowded, and has some beautiful views. We walk down a little while and then head back up. We always end the stop with ice-cream from the visitor's center.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Very easy to get to and worth the stroll", "There is a restaurant/cafe on site for those that don't want to do the additional trails, there are additional trails that are amazing for those who want to step up their nature-ness but for those who can only do bare minimum, this is worth doing and very easy. Has a small incline for the last 50m and then you are there. If you are lucky there will be a ranger telling the idiots to stay inside the guide ropes but to also answer your questions. The area is full of interesting facts; eg. It is glacial, you are standing on volcanic stones; time frames, the spectacular heights of some of these giant trees, the valley, the river, etc. Read up or ask the questions. Brilliant with the kids. Can even take a little picnic to enjoy on the rocks and just bask in the sun. Toilets are back at the restaurant (5mins).\nShow less"], ["Reviewed August 27, 2017", 5.0, "No picture can capture the magnitude of this view!", "The drive is worth it. The view is just breathtaking. It will be busy, but worth waiting for a car park space. - A 'has to be seen' view!!"], ["Reviewed August 27, 2017", 5.0, "Spectacular", "If visiting Yosemite National Park is an experience itself, Glacier Point is one of the places you can't miss when staying there."], ["Reviewed August 27, 2017", 5.0, "Amazing view!", "Visiting Yosemite park, you cannot avoid reaching this point! The view is simply spectacular: the falls, Half Dome... You have the impression to be over the clouds!"], ["Reviewed August 26, 2017", 5.0, "Simply breathtaking!", "Having read some other reviews, we set out early to tackle the climb, starting at 7.15am. We were lucky enough to meet the mother bear and cub (photographed) on the path on the way up. At the time of meeting the bears, we were a group of 7; which once we started making noise they very gradually made their way off the path.\n\nThe walking guides says \"strenuous\". We are a family with 14 and 11 year old children. We made it up in just under 3 hours, taking lots of time for photos and water stops. We walked back down, but there is also a bus. Most of the bus trips sold are a bus up and walking back down. I would very much recommend the walk up early morning. By the afternoon it wasn't the same sharing the path with so many other hikers.\n\nThe views are simply stunning. I don't think I have ever taken so many photos in a day!\nShow less"], ["Reviewed August 26, 2017", 5.0, "Highlight of The Park", "Take the time to drive on out or take the free shuttle. This one is a must! Do as little or as much hiking as you want, all with a million dollar views. Sizable snack bar with fast food and ice cream."], ["Reviewed August 26, 2017", 5.0, "Amazing views, unbeatable", "We took the glacier point tour bus up from the valley lodge and walked back down the 4.3mile trail.\nWow, for such an easy coach drive up to the top, almost lost for words at the amazing views, especially across to half dome.\nThe walk down took us just over 2hrs with plenty of photo stops, mostly a decent surface and not too steep though aching calf muscles the next day.\nCan't recommend this highly enough.\nShow less"], ["Reviewed August 26, 2017", 4.0, "Beautiful vistas-also lots of people!", "We drove up early as they stop traffic and you need to shuttle up to glacier point when it gets crowded- good thing we did as we were traveling with our dog and they aren't allowed on shuttle. Strangely enough dogs welcome on paths up to viewpoint. Wonderful view of half-dome, yosemite village and the falls.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Hike to Glacier Point", "The most beautiful views in the park. Don't miss it. We used \"Lasting Adventures\" guide services to make sure we got off the beaten path and truly enjoyed this day the most."], ["Reviewed August 25, 2017", 5.0, "Magnificent View of Yosemite National Park", "The long drive to Yosemite National Park is all worth it when u reached Glacier Point. We got a free entry pass to the park. Night driving is not recommended in the park."], ["Reviewed August 24, 2017", 5.0, "A must do on sundown", "We visited Glacier Point on sundown. It was a very romantic setting with a spectacular scenery but you have to endure all the other guests and children who don't always appreciate the spectacle. The ranger give a nice explanation and had some real added value."], ["Reviewed August 23, 2017", 5.0, "What a view.", "Must see. We were trying to catch the sunset on top of the point but unfortunately missed it by about 30 mins. None the less beautiful. We saw some epic sunset vista driving up. Will have to come back up again."], ["Reviewed August 22, 2017", 5.0, "We enjoyed it very much!", "It really depends why you come to the Park, are you into hiking, river rafting, or just relaxing etc. We explored the park quite thoroughly and this was one of the many, many sights that we enjoyed very much despite the long drive there. We loved the sunset and the walk in the dark and seeing the lights of the valley.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Jaw dropping", "One of the great vista points on planet earth, rocky formations, waterfalls, clouds, snowpack, snowmelt."], ["Reviewed August 21, 2017", 5.0, "Outstanding views of Half Dome", "Terrific place to go to to get a view of Yosemite NP. It's about a 2h hike up from the Valley floor, or a 1h drive. Mame sure you go in early summer while the waterfalls are flowing hard and the snoky wildfires haven't started."], ["Reviewed August 21, 2017", 5.0, "The most beautiful view!!!", "We spent a few days in the national park and this was our first stop. Stupidly we arrived at 11am so there was no parking anywhere near Yosemite village, so we decided to take the road to glacier point instead. By the time we got there the glacier point car park was also full, so we had to park in the overflow car park a 15 minute drive to glacier point and catch the free shuttle bus. We had to wait almost an hour to get on the bus as the queues were so long, I would really recommend arriving early to avoid all of this.\nThe view from glacier point is breathtaking, one of the most beautiful viewpoints I have ever seen in my life. There's a shop there so you can buy snacks which was handy. The lookout is very very busy as you would expect. If you walk 10 minutes down the panorama trail you will be completely alone and the views are just as amazing!\nShow less"], ["Reviewed August 20, 2017", 5.0, "Great view - Don't miss this sight", "We saw the valley first but this was the place to really see the park. From this vantage point you can see at least 4 waterfalls, El Capitan and Half dome. It is a fair drive on the windy mountain roads but it is well worth it. I would recommend going early as it gets crowded and parking at the point can get full\nShow less"], ["Reviewed August 19, 2017", 5.0, "Worth the drive", "The drive up to Glacier point is long, but you will be rewarded with magnificent views. On a warm summer day, ice cream bars and popsicles were hot sellers at the gift shop."], ["Reviewed August 18, 2017", 4.0, "Beautiful view but .....", "It is an amazing view but the crowds really stifled the enjoyment for us even though we got there early. The walk up to Sentinel Dome was a good thing to do and much less crowded with really good views both ways down the valley. Much preferred this to Glacier View. I guess it's a view you have to say you have seen.... The best light for photos, apparently, is later in the day.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Wow. Wow. Wow. Best view on earth I've ever seen!", "The title says it all. It's a fair drive. The road is windy at the end. The traffic and parking could be challenging. But assuming you get a clear day like us - this view is one not to be missed. Makes you feel small. Makes you praise our Creator God who made such a beautiful place.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Fantastic nature", "Fantastic nature From Glacier Point you get an amazing view of the falls and the Dome We reached the point by bus because the parking space was full The buses went all the time so we didn't have to wait for a long time to get up or down\nShow less"], ["Reviewed August 16, 2017", 5.0, "Awesome views all around!!!", "it's hard to pick favorite areas inside Yosemite NP since there's quite a few of them but this is definitely one of my favorites places to just chill and enjoy the view! you get a chance to see portions of the valley and get a magnificent viewpoint for Half Dome...it is a must see if you're in the area!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Excellent Vantage Point", "Our B&B owner in Fish Camp recommended that we visit this first thing our first day to give us a view of the valley and such remarkable sights as Half Dome and the two Falls. Great advice as we were able to get some wonderful photos.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Beautiful Views", "The only reason this didn't get 5 stars was that it's just so crowded and the bathrooms are atrocious. I'm used to put toilets in the parks, but these were beyond bad."], ["Reviewed August 15, 2017", 5.0, "Spectacular", "We were part of a bus tour and that made the journey easier. No parking hassle. The smoke was not as bad in the afternoon so we got some good pictures. Easy walking around the area and a store for an ice cream break. Definitely worth the time.\nShow less"], ["Reviewed August 15, 2017", 5.0, "A must stop, especially on full moon nights", "Great place to visit and a must stop on your Yosemite adventure. Have been twice. This trip did full moon and had a picnic dinner while watching the sun set. Great opportunity to see Half Dome up close, as close as you can without climbing and on a starry night or with a bright moon. gorgeous.\n\nJust be aware of the CRAZY foreign tourists. I am sorry to rant, but numerous visitors, desperate for a photograph from the ledge or precipice looking down would climb up and inch out.\n\nI am sorry, one slip and your dead. One misstep and its 8000 feet down. Not only will you ruin your trip, you go home in a coffin, but you ruin the experience for everyone who will watch your stupidity.\n\nI was actually glad one or more \"older\" americans called out these people.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Just awesome", "It is a fairly long drive from the valley to the viewpoint but it is absolutely worth it (you could always hike up of course). The views are just stunning. Yes it is busy, but what do you expect - good idea to get here early to beat the crowds and be able to park. There is a shuttle bus from the ski station which is used when the carpark at the Point is full.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Stunning! But, arrive early...", "Staying at the Evergreen Lodge, just outside the National Park, we left at 7AM to get us to Glacier Point by 9AM. We are so glad we did this as the was very little traffic, plenty of parking at the location and photos were a lot more pleasant.\n\nThe views here are incredible. Slightly hindered at the moment due to the smoke from the forest fires, but beautiful nonetheless.\n\nYou should probably give yourselves about 30 minutes minimum up here.\n\nAlthough there are toilets, if you can avoid going you'll be thankful - they're not the most pleasant... Enjoy!\nShow less"], ["Reviewed August 12, 2017", 5.0, "Fantastic View Point", "We went to Glacier Point on our first day in the Yosemite area. The parking lots were full so we took the free shuttle - we appreciated having someone else do the driving so everyone could enjoy the scenery on the road. Our driver was excellent and stopped several times as we encountered wildlife including two bears on the side of the road.\n\nThe views from Glacier Point were incredible - we got there the day the Detwiler fires started - visibility was just fine bit deteriorated rapidly over the subsequent three days. Glad we went early!\nShow less"], ["Reviewed August 12, 2017", 5.0, "Stunning", "We went up for sunset and night photography and wow! Despite there being forest fires so lots is smoke the seeing is excellent for the milky way"], ["Reviewed August 11, 2017", 5.0, "very good visit but big line for the bus", "i recommand you to visit glacier point, very good view, it is wonderfull, only one negative point : a very big line for the bus, too many people, i recommand you to visit early the morning, for pictures the best time is sunset, but many times it is cloudy and it is difficult to manage the delay on the road to glacier point\nShow less"], ["Reviewed August 10, 2017", 5.0, "Glacier Falls", "Beautiful and worth the drive. Lots of hiking, handicap accessible. My husband was able to use his electric scooter and we were able to park right at Glacier Point instead of waiting for a bus (need handicap accessible license plate or placard)."], ["Reviewed August 10, 2017", 5.0, "Glacier Point", "Beautiful views of Yosemite. Once you are there it is worth taking the hike to the top of Sentinel Dome although it can be a bit steep at times.\n\nFor an even greater challenge, start in Yosemite Valley and hike to Glacier Point via Four Mile Trail. This can be quite strenuous but the views are spectacular.\n\nAs always, go early in the day to avoid the afternoon sun and crowds.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Fantastic view point", "This is one of the best high points in the park that provides a panoramic view of the landscape especially north dome and half dome. An easy point to reach as you can drive up and park at the top, no real hiking required on the paved path. Although if you want to hike some there is the four mile trail, worth hiking just a bit down and back to get a different perspective of the scenery - including a slightly closer view of Yosemite Falls.\n\nWe got to the top around 10:30 am on a week day (in July) and while the parking lot was pretty full there were still plenty of spaces. On weekends might have to get there earlier to ensure parking. There are bathrooms up there, as well as a gift shop with drinks and snacks, and drinking water station to refill your water bottles.\n\nIf you have time and energy left, on the drive down be sure to stop at Sentinel Dome/Taft Point trailhead - each hike is a two mile roundtrip, with the view at Taft Point being the more dramatic.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Spectacular", "Seeing Half Dome from Glacier Point is well worth the drive! Most reviewers recommend going early in the day and I think that is true for this location."], ["Reviewed August 8, 2017", 5.0, "Go here after you hike Mist Trail!", "It takes about an hour to reach Glacier Point from the valley, without any stops. We drove up many curvy roads to 3200 ft above the valley. Glacier Point provides phenomenal views of Vernal & Nevada Falls, Half Dome, and many other points of interest, including the valley below. An early evening visit to Glacier Point was the perfect way to end our day. The sun lit up half dome and the valley to showcase a multitude of colors. In my opinion, you should wait to visit Glacier Point after hiking Mist Trail. It is humbling to stand at the top of Glacier point and see how small Vernal & Nevada Falls appear from this vantage point, while reflecting on the personal effort it took to climb them. The Glacier Point visitor area is very nice, including a visitor center, parking, an amphitheater, and paved paths to the overlook. There are some fantastic photo ops with half dome in the background. We followed a short path on the left of the main viewing area where we could view the face of half dome. By this time, it was approaching sunset and there were many photographers perched here waiting for the perfect photo.\n\nWe opted to head back down to the amphitheater to attend a ranger talk about Peregrine Falcons. After visiting 20 national parks, this ranger talk was by far the most interesting one we’ve attended. Our son is an avid birder and the peregrine is his favorite bird of prey. Even he was impressed with the wealth of information, 1st hand stories, and amazing photos the ranger was able to share.\nShow less"], ["Reviewed August 8, 2017", 3.0, "Better views of half dome and less busy elsewhere.", "Very busy and crowded. Plus, it's the main tourist attraction. Instead, hit sentinel dome for sunrise and thank me latter. Now, that's a marvel of nature. You'll see half dome in its full glory, with only a handful of people."], ["Reviewed August 7, 2017", 5.0, "Highlight of our Yosemite Visit", "Visited Glacier Point for the first time -- in years past Id visit the park earlier and snow was still heavy/blocking access. Incredible view. . . even if you do not like heights (like me!) Smoke from controlled wildfires taking place on the day of our visit cleared out just in time for our arrival.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Breathtaking views!", "Awesome views! One of the natural wonders of USA! El Capitan, Half Dome, Yosemite Falls and many more captivating places here Definitely going back here soon!:)"], ["Reviewed August 4, 2017", 5.0, "Well worth the drive", "Absolutely stunning views, highly recommend this as an addition to any Yosemite trip! Parking can be tricky when busy"], ["Reviewed August 3, 2017", 5.0, "Beautiful Vistas, Night Views and Great Trail Head Access", "Glacier Point allows virtually anyone to experience high country vistas of the Yosemite valley as well as access to the Four Mile Trail, Panorama Trail and other outstanding day-hiking and backpacking trails into the back country.\n\nAt night, the sky views are breath-taking. The Milky Way spreads across the sky and allows one to enjoy the majesty of God's creation.\n\nConsider the tours that are available - one-way and round trip. My family and I chose one way for two mornings during our recent stay and we hiked back down to the valley. There are several hiking options in this manner which allows you to cover reasonable distances and enjoy spectacular views even in the hot summer months.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Worth the effort - amazing", "About 30min drive out of the main Yosemite Valley area (if you avoid the traffic), Glacier Point is totally worth it. Amazing views. So glad we persevered to visit here; spectacular"], ["Reviewed August 2, 2017", 4.0, "Exceptional views- Park Service needs better shuttle bus system", "Highlights:\n▪️Views of the various waterfalls at peak flows for many years.\n▪️Great view of Yosemite Valley.\n\nLowlights:\n▪️Shuttle bus system needs work. More frequencies would help.\n▪️Too many private cars were waved through while we waited for a shuttle bus. Manage in a consistent, fair way.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Words cannot describe it", "There are many places people say, \"you have to see it to believe it\" and this is one of them. After a hair-raising drive up the narrow road, this view is spectacular. We had spent the previous days along the valley and getting to see the spots we visited from a bird's eye view was just awesome. And much to our surprise, when we looked through the free viewfinder at the point we could see people walking along the top of Half Dome. Go early to avoid the crowd and take your time and lots of photos, it's spectacular.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Must see", "Best view of the entire valley and worth the drive to the top. We had two teens and one preteen all boys and they thought it was worth it."], ["Reviewed July 30, 2017", 5.0, "Magnificent Views", "Loved seeing the views from Glacier Point. It was over 100 in temperature but a nice breeze kept things enjoyable for us all. Loved the gift shop & had lunch with a gorgeous view. Our 1 year old loved the time we spent here."], ["Reviewed July 30, 2017", 5.0, "Stunning!", "Absolutely LOVED this spot! There are 360 views of Yosemite and it is absolutely stunning. They have a little gift shop at the top too. Not to be missed!"], ["Reviewed July 29, 2017", 5.0, "Smoky but still beautiful.", "We went up to Glacier point in the morning and had no problems finding a parking spot. Due to the Mariposa fire the park was smoky and the views from the top was not as clear as it normally would be. That being said we still enjoyed our time there and we were able to see Yosemite falls etc. would love to see it again when it is a clear view. It is quite a drive up. There was a pretty meadow on the way that had pretty purple flowers in it.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Glacier Point is breathtaking", "I've been to many National Parks. This one particular spot will rival any other favorite for best views in America. The longer hikes to and from there were not able to be done although wished we could have, but the time spent on the lengthy drive up and lingering about up top absolutely worth it.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Phenomenal View But Overcrowded", "There is no denying that the view of half dome, the high sierra and the valley floor from glacier point is incredible, but that, unfortunately, is its downfall as streams of tourists head up the road to this one point and it is therefore very difficult to appreciate the wilderness and sheer natural beauty on offer.\n\nStill a must see if you're willing to drive from the valley floor\nShow less"], ["Reviewed July 28, 2017", 5.0, "Amazing view!", "Amazing view of the valley and the Half Dome. There is a parking area near the point. Highly Recommended"], ["Reviewed July 28, 2017", 5.0, "Should be on your bucket list", "Whether you're a photographer or simply a lover of great scenery, you have to be at Glacier Point to enjoy one of the greatest views on earth - Half Dome at dusk. The Park Rangers are one hand to give a great talk about the valley, as well as advice about evening and night photography. Stay a bit later, for a fascinating talk about the stars.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Well it's there", "Too busy and crowded to enjoy properly however, I can see the attraction. The park was sorely distressed due to many closures. The heavy snowfall during the winter months had collapsed roofs and damaged roads. The southern portion of the park was closed due to fires. These are realities of life and must be dealt with respectfully. However, it may be a wise decision to defer vacation plans until more of the park is available which would reduce the overcrowding of the current open areas.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Phenomenal views!", "Well worth the trip up to see these uncompromised views! You can find a quiet space, or take the photo of a lifetime!"], ["Reviewed July 26, 2017", 5.0, "Best part of our trip", "We went up for sunset. Definitely worth the trip - beautiful views especially of half dome. You can see all of the beauty of the valley"], ["Reviewed July 26, 2017", 5.0, "Glacier point", "Best view in the park! Awesome place for great pictures. Waterfalls, snow, lakes.....it is all there."], ["Reviewed July 25, 2017", 5.0, "well worth the hassle", "a fabulous view of most of the valley. You can see Half Dome, Vernal Falls and Nevada Falls. There is a little shop where you can buy snacks and souvenirs. Well worth the hassle. Although the regular park shuttle doesn't run up this road, if you can't park at the top (generally after 1 pm the top parking lot is full), you can get a shuttle bus from the ski parking lot which also stops at Sentinel Point.\nShow less"], ["Reviewed July 24, 2017", 5.0, "great view of the valley", "We stop 1st here by car, was not to crowd early in the morning and you have a wonderful view of the full valley"], ["Reviewed July 24, 2017", 5.0, "Amazing views", "We were preparing for Glacier Point to be super crowded but when we got there at 9am it wasn't busy at all. I imagine it gets much busier at sunset. The views from this place are spectacular. A ranger also told us we could walk down the Four Mile Trail about a half mile for great views of El Capitan. The trail goes downhill quite a bit but coming around the corner to an unobstructed view of El Capitan was worth it. We also treated ourselves to some ice cream which wasn't over priced given the location.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Amazing scenery - a must see in Yosemite", "The drive up to Glacier point has some amazing view points. The road is two lane all the way but as your near the point the road gets very windy and low speed is essential. Buses etc go up and down to the point so be careful if you are driving round a hairpin bend.\n\nAt the point there is a large car park, then its a 2 minute walk to the visitor centre and from there its about 5 minutes walk to the point itself - this is an easy walk and there is a route for wheel chairs.\n\nOnce you arrive at the point the views are simply amazing.\n\nFor the really energetic there is a four mile walk down to the valley floor. We walked down a little way with no intention of doing the full walk, Most of it appears to be through woodland but there are good views through the trees.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Fantastic View", "Our guide drove up to the point and it was fantastic. Yosemite Family Adventures provided us with a wonderful guide that planned our day and took us to the point when the crowds were small. Breath taking views!!! Well worth the trip up"], ["Reviewed July 21, 2017", 5.0, "Breathtaking beauty!", "Glacier Point was recommended by a friend to see before leaving Yosemite. A must see when visiting Yosemite!"], ["Reviewed July 20, 2017", 5.0, "A Must See", "The views from Glacier Point are amazing and well worth the drive to get there. It is one of the few places that you can see Yosemite Falls, Vernal Falls, and Nevada Falls at the same time along with an awsome view of Yosemite Valley below. Stop along the road and hike to the top of Sentinel Dome for a better view of Yosemite Falls. (even more fun if there is still snow on the Dome)\nShow less"], ["Reviewed July 19, 2017", 5.0, "No words to describe the beauty", "How can there be so much to see in one relatively small area? You can't even begin to wrap your mind around all the gorgeous landscape. I could have stayed here for hours. My 13-year-old daughter thought we were abusing her by making her stay here. The 16-mile drive is totally worth it. I was totally consumed with the beauty and the miracles that are visible. Do not miss it--as long as it is open!\nShow less"], ["Reviewed July 19, 2017", 5.0, "A Must See in Yosemite", "If you go to Yosemite and don't go to Glacier Point then shame on you for 6 weeks! This is a must see, one of the most stunningly beautiful vistas in the world.\n\nWhen you take pictures it just does not do it justice, seeing Half Dome and all the water falls is just amazing.\n\nIf I ever make it back to Yosemite I want to come up at night. It's like you are up in the sky, I can just imagine how many stars you could see. A woman we ran into on one of the other trails in the park said they went at night and the stars were unbelievable as she was from New Jersey and you don't see any there.\n\nGives me a reason to come back!\nShow less"], ["Reviewed July 19, 2017", 5.0, "A \"Must See\" in Yosemite", "If you only have a short time to see as much as possible, you need to head to Glacier Point. I recommend getting there as early as possible, or the parking lot will fill & you'll have to park down below & ride the shuttle. You can see most of the valley, El Capitan, Half Dome, Nevada Fall, & Yosemite Falls. It's the best view anywhere! There's also a couple trails you can access from there, as well as a small store with a few menu items, including ice cream.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Easy, accessible, worthwhile", "Definitely a great choice for people with different levels of athleticism. My mom and step father, (older and less athletic) did it with ease and the views are worthwhile for the people expecting to hike!\n\nIt's just a complete drive! And then a 5 minute walk.\n\nTips:\nGo early because the parking lot gets full. I followed directions from a poster who said get to the parking lot before 930 you're safe. Was completely accurate!\n\nBring $$ for ice cream at the gift shop. (Ice-cream truck-style)\n\nA selfie stick is helpful. Lots of people make it difficult to keep a good photo spot people-free for long.\n\nBathrooms are outhouses. They were quite gross when we went. I suggest using the women's room at the entrance of the park first!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Bird's eye view of marvelous nature", "This is worth the drive up to the top. You can also take a shuttle up, but if you arrive at the shuttle area -clearly marked upon entry- after 10:30 AM, not only will you have a great deal of trouble finding parking but you will be waiting for your shuttle quite awhile.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Should have a restaurant or cafe", "Magnificent views, great spot to enjoy the valley from above. Gets very crowded for sunset. Drive up and down is quite long and tiring, but well worth it. Restrooms need much better servicing, could not use because too smelly and dirty beyond a normal roadside stop expectation. Believe the shop closed at 7pm, so there should be more option with a cafe or restaurant\nShow less"], ["Reviewed July 18, 2017", 5.0, "Worth coming...great spot to oversee valley", "Love this place. Fantastic views. Yosemite must see. It's a drive to get here but worth it. We came late in the day when it was cooler"]]}}