{"Glass Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Glass Beach", "url": "/Attraction_Review-g32400-d103760-Reviews-Glass_Beach-Fort_Bragg_Mendocino_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/10/f9/21/glass-beach-touch-the.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1717"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Fort Bragg", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Beautiful place", "I absolutely loved this beach. I wish the glass was never ending, but you can tell with all the people who visit and take a piece, it wont be around forever. Its just so beautiful."], ["Reviewed 2 days ago", 5.0, "That's a lot of glass....", "If you've never been to glass beach you need to make the time. We've been to many beaches were you need to avoid the broken glass but not here! At Glass Beach your ankle deep in most of the lower portions of the beach and it's quite accessible. Lots of parking and bathrooms too. Enjoy!\nShow less"], ["Reviewed 4 days ago", 5.0, "Beautiful sight", "Reading some if the reviews I didn't expect to see any glass but there was glass to see and to think it used to be a dump site."], ["Reviewed 5 days ago", 5.0, "Bucket list", "I have been wanting to visit this beautiful beach for years. I'm so glad I didn't listen to all of the people saying that there was no glass left. There is tons. If you look really hard, you will find many interesting treasures such as pottery shards, copper windings etc. embedded in the rocks. Like others have stated, be sure to check the tide charts and go at low tide. There is plenty of useful information at the Sea Glass Gallery and Museum.\nShow less"], ["Reviewed 1 week ago", 4.0, "Please don’t take the glass!", "As much as we LOVED Glass Beach, the amount of people we saw taking glass infuriated me & my husband. We were sure to tell our boys nice & loud in front of people stealing (yes, it is stealing) the glass how horrible & selfish it is to take it. Even our boys know that if people take just a little of something, but a lot of people do it over & over, it adds up to a lot. I encourage people to say something to people stealing the glass. (People were full of excuses, like they got it at a different beach, please.)\n\nThe beach is beautiful and our boys explored there for a few hours over 2 days and could have stayed longer if we’d had the time.\nShow less"], ["Reviewed 1 week ago", 4.0, "Pretty area.", "Underwhelming at first, couldn't see much glass, but it's there, you just have to really look for it."], ["Reviewed 1 week ago", 5.0, "Impossible to look up!", "I have to admit I love rocks but Glass Beach is the best. I had a hard time looking up at the surrounding scenery! There were tiny bits of smooth glass everywhere. I saw a spark plug embedded into the black rock. Pools of baby crabs and fish all over. People were wandering around everywhere picking up glass? I would go back in a heart beat.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun and worth the stop!", "The important thing to remember is which beach you should go to. Beaches 1 and 2 have the me most glass left and are fun to explore while beach 3 is the easiest to access.\nMake sure you follow the rules and don’t take glass from areas you aren’t allowed.\n\nIt’s best to make a treasure hunt out of it trying to find the rarer colors and shapes.\nIt’s fun and worth a stop if you are in Fort Brag but unless you are a sea glass enthusiast it wouldn’t be worth a trip to the town.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Beaches", "We really enjoyed the beaches here and it was a wonderful experience to see all the glass! We are fascinated with the history of this area and how the glass ended up on the beach. Well worth seeing."], ["Reviewed 2 weeks ago", 4.0, "One man's junk is another man's treasure", "Glass beach once was a dump site many long years ago. What remains are the miracle workings of the tide and sandy beach that has turned the discarded and broken bottles of yesteryear into beautiful, smooth pieces of sparkling color. While one must look harder these days to find, they can be found. Come make a memory and take a piece of history home.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful", "Always love the ocean even in the rain and wind. Had not visited some I was a kid and it was worth the visit."], ["Reviewed 2 weeks ago", 5.0, "Love the ocean", "I’d never heard of glass beach, until we came here. The glass pieces are beautiful. I was thrilled at the small pieces & so many colors.\nI was more interested in looking for shells. I enjoyed hunting in the tide pools & watching the waves crash on the rocks\nBeautiful beach\nShow less"], ["Reviewed 3 weeks ago", 5.0, "An amazing place", "From what once was the city dump, the churning ocean has transformed into a cove of sparkling gems. A nice parking lot leads to a trail down the cliff to the beach."], ["Reviewed 3 weeks ago", 2.0, "Sad", "So many people have stolen (yes I sad stolen) thst it is no longer a glass beach. People just can't leave beauty alone, they have to ruin it. ☹"], ["Reviewed 4 weeks ago", 4.0, "Beautiful place to walk with excellent sunsets", "Walking trails and beach access a great place to enjoy the coast. Plenty of walking trails and tidal pools to explore. Can watch the whales go by and enjoy the birds and wildlife."], ["Reviewed 4 weeks ago", 5.0, "Fun, Fun, fun", "you will have a blast looking for the beautiful glass that the ocean made smooth and frosted, try and hit Fort Bragg , Mendocino and surrounding areas in the summer months."], ["Reviewed 4 weeks ago", 4.0, "The power of nature", "Once a collection of discarded bottles, nature shattered them along the rocky shoreline and polished by sand and sea waves the shattered glass turned into millions of small colored glass gems! Not as plentiful as before but still a nice beach to visit with white seals resting on the rocks!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Super Cool", "Really nice place to vist and bring dogs and children. Watched abalone hunters and got to learn the history of the beach."], ["Reviewed January 20, 2018", 4.0, "Cool place", "Nice place to visit, former garbage dump that the sea has smoothed out all the broken glass. Very scenic site"], ["Reviewed January 16, 2018", 4.0, "Beautiful View", "Spent an afternoon in Fort Bragg and visited Glass Beach. Beautiful setting, saw a number of sea lions The glass on the beach is underwhelming- but worth a visit"], ["Reviewed January 9, 2018", 3.0, "expected more glass", "it was beautiful here just expected more glass on the beach. would have been nice if there would have been an easy access to the lower part of the beach. plenty of parking which was nice."], ["Reviewed January 8, 2018", 3.0, "Not what I expected but still beautiful", "From the pictures and the reviews I have read about this place I guess I was expecting something a little different. Still a beautiful beach."], ["Reviewed January 7, 2018", 4.0, "A Sparkling Gem", "From the moment I read an article about Glass Beach in the AAA Via magazine, I'd wanted to visit it. When my husband and I planned a trip to the area for our 30th wedding anniversary, we added this destination to our itinerary. Since we were married in December when folks aren't flocking to the shore, we had the beach pretty much to ourselves. I hadn't factored in the tides, and due to our time schedule, we weren't able to be there at low tide when more glass is visible. Even so, there was still glass to be seen on the rocky shore. We admired the sparkling show, tossed the colorful bits of glass back into the sea and spent some time snapping pictures of the beautiful coastline. This makes a nice stop when coupled with other attractions in the area, but I recommend checking the tide schedules when planning your visit.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Still Tons of Sea Glass", "I have read the reviews that say that the beach is completely picked over and that there is very little sea glass left. That's true if you go to beach number 3 which is the farthest beach to the north, but if you walk just a few hundred yards to the south you will see a beach that is still filled with sea glass. Here's how - from the parking lot, walk down the paved path towards the beach, once you get to the beach there is a sign that says, easiest way to the right and difficult to the left. Turn left towards the difficult direction and stay on the paved path, once you get to the first bench, cross the cable fence and walk south on the dirt path on the ocean side of the wire fence, you will see a sign that tells you not to take the sea glass and a trail that leads down the beach - you have arrived at your destination. Enjoy.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Beautiful Scenic Vista", "This is a great place e to stop for a visit and spend an hour. The ocean front views are great and, of course, it is a great family opportunity."], ["Reviewed January 3, 2018", 3.0, "Interesting but crowded", "It was good, but way too crowded. With the number of people, I worry about the integrity of the cliffs and beach in the future. It was nice that there was a Park Ranger with a table providing educational items with touch-and-feel specimens."], ["Reviewed January 3, 2018", 5.0, "Sea Glass lovers bucket list; BUT", "As a sea glass collector it has been a bucket list destination for years. There are many pictures on the web that shows solid glass, not like that any longer. For years it has been picked over, there is still quite a bit. There are many rules and regs. Don't take, or you can take. I took, but not by the bucket full. At one time there were fining with a $500.00 ticket, but I believe they stopped that. I have been there several times as I live in So. Cal. and Fort Bragg is in No. Cal and day and half drive. I will not be making it my destination place, but if I happen to go by again I will stop. The last time I was\nthere was a couple years ago, alot of political stuff going on since. (Had to put a date, but it has been longer than that).\nShow less"], ["Reviewed January 2, 2018", 2.0, "Glass Beach", "I have to say I was disappointed by the beach. I saw some beautiful pictures online and was looking forward to seeing it, also having read nice reviews.When we arrived, we really couldn't see why this was called \"glass beach\". there is hardly any glass. a lot of the glass pieces are either gone or hidden under sand. Having said that, there are a few patches with glass and when the light was good, close up pictures came out nice.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Glass Beach", "Enjoyable area to walk. The glass is not very abundant so don't think you will see like you see in many photos. Just make the kids believe."], ["Reviewed December 30, 2017", 5.0, "Close walking distance!", "Just a short walk away and the sound of the waves welcome you, take it in.Completely worth the drive!"], ["Reviewed December 20, 2017", 5.0, "Fun attraction", "The original inhabitants of Fort Bragg dumped their garbage right in the ocean. Over the years, glass items were broken and tumbled by the surf. The resulting beach is not sand, but multicolored glass nuggets.Fascinating for the whole family!"], ["Reviewed December 18, 2017", 3.0, "almost gone", "I have wanted to visit Glass Beach since I saw photos of it many years ago. I had heard that there wasn't much glass left because people have been carting it off for years. We saw people pocketing some of the small pieces that are left. It was an amazing warm sunny day the little shards of glass were glittering in the sand. Too bad it is not what it used to be.\nShow less"], ["Reviewed December 8, 2017", 3.0, "Nice beach, glass absent", "This is a nice scenic beach, but scavengers have all but eliminated the glass for which it's named. You have to look long and hard to find large pockets of multi-colored glass."], ["Reviewed December 2, 2017", 5.0, "Beautiful Glass Beach & dramatic waves", "It was a beautiful day at the beach. Lots of beautiful glass, shells and tide pools and very dramatic wave action. Hours of fun on the beach. Just be careful of the waves you can get caught and get very wet. I could have sat there all day and enjoyed the huge waves coming and going.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Just Amazing!", "We have been lucky enough to stop here and see another wonder of our great country. This is one of the most humbling things that we have ever seen. This is a fantastic place to stop and just walk around and take in the power of the ocean and all its sights and sounds.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Beach Adventures", "Pure beauty! Amazing shorelines,trails and views. The sunsets are breathtaking! If you’re looking for therapy, you need to visit Glass Beach."], ["Reviewed November 19, 2017", 2.0, "There used to be glass at this beach.", "Don't let the pictures fool you, the pea sized glass pieces can only be seen on your hands and knees. The locals say it used to be spectacular, but when they made it easier for tourists to access this beach, they came by and each took \"just a few pieces\", contrary to the posted prohibitions. So now you see people combing through the sand, butts in the air looking to carry off the few remaining pieces. Another sad tale of destruction by tourists who just can't leave things as they are without carting away a \"few stones\" and now its ruined. Thanks!\nShow less"], ["Reviewed November 17, 2017", 3.0, "Nice place to visit", "Great sight and good place to visit. Not much in terms of glass pieces to see. Very relaxing and nice place to walk about."], ["Reviewed November 17, 2017", 5.0, "A beautiful place", "A great “beach” with awesome views and very cool sand littered with little pieces of glass. Definitely worth a visit to get some awesome shots of the place."], ["Reviewed November 16, 2017", 5.0, "How another man's trash has provided a treasure.", "The best time of day to see the beautiful colors of the glass is in the afternoon. You need the sun to the west to be able to fully see the colors of the glass."], ["Reviewed November 14, 2017", 5.0, "So unusual!", "October of 2017 was the second time that my wife and I were able to see this beach. Its so strange that \"way back then\" people used to push all their trash off the cliff, and now all that's left is beautiful glass pebbles."], ["Reviewed November 11, 2017", 4.0, "Must see for yourself to appreciate", "I understand that it does not contain all the glorious glass colors that it once had, but I would still recommend that you go see it. It is much better in person that you have to see and experience it for yourself. From far away it just looks like sand, but when you get close you see that all the little bits and pieces are worn glass-sparkling and glistening in the sun. The trail to get down to the beach was not accessible for grandma, but she still enjoyed the views of the coastline from up above on the bluff. Amazing that all that trash turned into something so pretty for once.\nShow less"], ["Reviewed November 11, 2017", 4.0, "Relax and be a kid again!", "Although Glass Beach is just an hour away, I had always heard it was disappointing and not worth the stop. On a recent trip to Fort Bragg, I found it to be just the opposite. While the beach doesn't have the large sea glass beach like it used to, there is plenty of sea glass in smaller sizes. My wife and I sat on the beach and spent a good hour or so just digging through sand and polished glass, looking for different colors and sizes. We soon got lost in our treasure hunt and had fun showing each other what we had found. Although you are supposed to leave the glass on the beach, you can spend an hour gathering up a small collection for a keepsake, or like some folk for jewelry or other crafts ... all without damaging the beach. Treat yourself and get lost in a little treasure hunting.\nShow less"], ["Reviewed November 8, 2017", 5.0, "bucket list", "I love sea glass! I have sea glass from all over. Coming here was something I always thought would be awesome. FINALLY MADE IT! There is so much glass I could literally be PICKY about what I wanted. Totally awesome. It is rocky and a little hard to get down to the freeeezing water. so wear something other than flip flops & a bathing suit. Its chilly!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Glass Beach", "Lots of beach glass but its very tiny. The walk along bike path is awesome and dog friendly. Being there in November, very few people and weather was great."], ["Reviewed November 4, 2017", 3.0, "Okay", "The Beach was very rocky and beautiful. Very few pieces of glass around. I guess people scavenge here quite often. Ocean was crazy. Better beware. Several people were surprised by the surf and were knocked down. Watch out for the homeless."], ["Reviewed November 1, 2017", 4.0, "So many glass fragments", "Very unique beach! Lots of small glass fragments that have been polished by the rocks and pounding surf. Easy access with ample parking and public restrooms in the parking area."], ["Reviewed October 30, 2017", 3.0, "Confusing area to visit. Not a lot of Glass left!", "Very hard to navigate and we went on the Easy side. I did see a few small pieces of glass but not much. The smell went a bit beyond the normal ocean smell. It smelled of a garbage can there. ICK. I would avoid unless you are driving by and need to kill time. Not the best\nShow less"], ["Reviewed October 28, 2017", 5.0, "just a fun thing to do - polished glass, sandy beach, ocean waves, fun people", "if you go to Glass Beach make sure you go at low tide because when it is high tide you usually can't get down close enough to even walk on the beach."], ["Reviewed October 25, 2017", 3.0, "could use alot more signage", "we walked all over trying to figure out where to walk, no one seemed to know where the actual glass beach part was. it was pretty but not worth all the hassle"], ["Reviewed October 25, 2017", 5.0, "From Trash to Treasure!", "The ocean has ground and polished glass refuse at this old dump site into beautiful, smooth gems that cover this little portion of beach. I'd visited in the 1980's and there were mounds and mounds of polished glass gems of all colors, which have diminished in size and quantity over time - and perhaps by those taking souvenirs. Most of the glass is clear/white and green, very few spots of blue anymore, but still gorgeous to see and feel. The walk down is steep, so wear sturdy shoes to get back up.\nShow less"], ["Reviewed October 25, 2017", 3.0, "What a dump!", "Glass Beach used to be a dump. Seriously. Now they're itsy bitsy pieces of Glass on the beach it's kind of interesting but you're not supposed to take any of it. The scenery is pretty and trails are well marked and accessible to all levels of fitness. Go down to mackerricher State Park if you want pristine and less traveled beaches.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Beautiful", "This is a very interesting area. the whole beach is covered in glass. Before you ask IT IS SAFE. The ocean and sand has smoothed out the rough or sharp edges. This is a beautiful area. We spent a couple of hours just exploring the beach and walking the trails.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Just beautiful", "Love the waves and water. Beautiful coastal scenery. Love the walking path that connects the coastline. If you want a great walk and a feeling of peacefulness wear tennis shoes and enjoy the sites and sounds of the coast along the walking paths linked."], ["Reviewed October 18, 2017", 4.0, "Glass Beach", "Unusual and seemingly desolate despite right in Fort Bragg. Good photo ops. Very easy strolling. Be a great place for post car-sitting jog."], ["Reviewed October 16, 2017", 3.0, "Glass Beach?", "This a beautiful place. But not sure where all the glass is. Nothing like photos. Maybe we were not in the correct spot but we did walk all over the area. Not hard to find and you can get down to the beaches. Which is not always easy in this part of Northern California. We did see lots of squirrels. Lol\nShow less"], ["Reviewed October 14, 2017", 4.0, "Collecting ocean polished glass", "Glass Beach is kinda fun without a lot of strain. Sure getting down to the beach can be a little tricky only if you are not 100% but my wife and I got down to some glass collecting and she isn't too nimble when it comes to climbing. You can find the glass laying right on top of the sand but if you go at a low tide you will have more to look at. When we were there the ocean was not too angry and it was quite relaxing and we got a little baggie of glass to take home.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Beautiful place to see California coast at its best!", "This is more than a beach...make sure to stop at the Glass Museum to learn more about the reason the glass is here! The location is A+ and offers one the chance to sit or walk to collect various colors of glass everywhere!"], ["Reviewed October 13, 2017", 3.0, "Small and dirty", "The hype about glass beach is real, but romanticized. The beach is really small and littered. The sea glass is cool, but don’t plan on hanging out there. And watch out for new glass that’s still sharp!"], ["Reviewed October 11, 2017", 5.0, "Wonderful Area to Find Treasured Sea Glass", "We visited the Fort Bragg area the first week in October, 2017. The signs weren't well marked, but I had previously found some information online as to where to search. You are not suppose to collect sea glass in the official beach area, so we searched to the west of that beach. We were able to find some nice pieces (mostly whites, but I did find some greens as well). You may not find the treasured reds, pinks, purples, or blues, but it was a very fun day anyway!! A little hint (bring some gloves), and be willing to lift up the sea weed. I found several great pieces under those!!!\nShow less"], ["Reviewed October 11, 2017", 3.0, "\"Colored glass searching\"", "We walked into the area known as Glass beach and were given the option of a hard trail or easy trail down to the beach. Neither were easy! We did find a way to get down to the beach by climbing down rocks. There were several little coves where you could find little colored pieces of wash up smooth glass. People were digging or picking up these pieces to take home to make jewelery orto use for other crafts. It was an interesting adventure.\nShow less"], ["Reviewed October 8, 2017", 4.0, "Bring Your Binoculars!", "Great path along the beach. There was an area with abundant beach glass and many collectors sifting through it. Make sure you bring your binoculars - it was an excellent bird watching area."], ["Reviewed October 5, 2017", 2.0, "We were a little bit disappointed", "Due to reviews in the internet we expected more than a few small coloured pieces of glass mixed into the sand."], ["Reviewed October 4, 2017", 4.0, "Refreshing morning walk", "While there wasn't a whole lot of colored glass on the beach anymore, I did enjoy walking on the well maintained trails above the beach. I could see how the trails would be good for a morning run along the coastline."], ["Reviewed October 3, 2017", 3.0, "Treasures in the Tide", "If you visit this beach with an open mind you will find it enjoyable. It is an easy walk down to the water for most people with both a graveled path and a paved option. While the vast majority of glass has been removed the tide still provides a few trinkets for the treasure collectors. Mostly green, clear and amber glass to be found.\nShow less"], ["Reviewed October 3, 2017", 3.0, "Not much left", "Beautiful scenery but very little of the bright colored glass left. People still filling bags with it to take home I assume. The ocean and rock formations are nice though."], ["Reviewed October 2, 2017", 3.0, "Lots of small glass mixed in with sand", "We were close by, so we took a walk on this beach. Lots of people on weekends, and the scenery is wonderful, with big rugged rocks, grainy sand beaches, clean, chilling breezes, and gorgeous color. I think 99% of the big glass pieces are long gone. Lapidaries make tumbled \"beach glass\" anyway, and it makes rather dull adornments in my opinion. Go for the walk, that bracing fresh air with the icy edge, and take a look at the sand, but don't anticipate anything extraordinary.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Interesting", "Stopped a couple of times, because apparently the first time we didn't see the best part of the beach. Interesting bit of history there, with a rather unique story of the ocean returning the glass to the shore. A good place to stop at."], ["Reviewed September 28, 2017", 5.0, "A seaglass collectors dream", "This place was really neat. Lots of sea glass to collect. Place can suck you in for hours! A short walk from the parking area."], ["Reviewed September 27, 2017", 2.0, "Sparse glass at Glass Beach.", "The photographs shown in the literature about this beach are now quite misleading. The beach is rather ugly as there is a conglomerate of glass and metal refuse that has been thrown onto it over the years. Since people have always been allowed to take glass from the beach it's now very sparse. There is also a dearth of different colors, consisting of small ground fragments of green, brown and clear bottles; I could find no red, blue or purple glass. I would not go out of my way to visit this beach as there is so much beauty elsewhere up and down the coast. However, if I was in the area I would go, especially if I had children. They would enjoy searching for little gems.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Very cool", "My daughter had done some research and found that the beach used to be a land fill. Was a little nervous going down but seeing how the ocean has claimed the scraps and turned them into rocks and the glass to pebbles was awesome"], ["Reviewed September 23, 2017", 3.0, "Pleasant enough for a walk", "We spent a pleasant hour walking along the grassy headland above the numerous inlets and gazing out over the ocean. That said, unless you're keen on hunting for small particles of weather polished glass (We weren't) there are other equally or more attractive beaches and coastal walks in the area.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Beautiful visit", "I'd wanted to go here for a very long time. We visited on our way down the California coast. The sea glass is neat as it's mixed in with the pebbles.\n\nWhen we visited it was overcast. Beautiful sea, cliffs, plant life. We saw seals lounging around on the rocks. Seemed as if they were putting on a show for us.\n\nI'd love to visit on a sunny day to see the glass shine but that'll be on another visit. Definitely go if you're in the area.\nShow less"], ["Reviewed September 23, 2017", 1.0, "Glass?", "Coastline is nice but is seems like most of the glass has been souverniered away from the beach... or Maybe my expectations were too high. But it was waaaaaay more sand and pebbles than glass..."], ["Reviewed September 22, 2017", 5.0, "True to its Name", "Ft. Bragg used the sea as its dump up to the 1950's and the coastal currents do not carry anything away, so unless it dissolves it stays and over the many years the broken bottles, crockery and other material have been polished by the action of sea and sand, creating tons of glass and crockery pebbles in the coves under the bluffs. Of course the easily accessible beaches have the least glass, but there are others that are harder to get to. This is particularly true since Ft. Bragg has now declared much of the area where the small beaches could be access to be closed to allow restoration of the flora and fauna, with a substantial fine for trespass. Be advised that if you can get to the water line without trespass, you can walk below the mean high tide line and pick up as much as you wish. The glass is mostly clear, brown or green, with small blue pieced available. Other colors are much rarer.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Most Unique Beach I've been to", "If you love searching for glass on the beach- this is an amazing place!!! However be polite and leave some glass for other people to enjoy!!!\n\nWhen speaking with the locals- they seemed hesitant to give out any info about this small beach seeming as the glass is dwindling down!!!\n\nSo go take pictures, put your feet in the Glass/ Sand/ Gravel etc. Enjoy the day- and leave the glass for others to come and see!!!\nShow less"], ["Reviewed September 21, 2017", 4.0, "Beautiful beach", "But not much glass left because it was all fenced off when we went but if your a climber it'll be fine."], ["Reviewed September 19, 2017", 5.0, "Glass Beach", "Relatively small parking lot at head of hiking trail but RV parking just up the street. Flat level paved trail along cliffs looking down at the pounding surf. Great free facility to experience the outdoors."], ["Reviewed September 18, 2017", 2.0, "Bummer!", "Most of the glass is tiny tiny! All gone! Too many people glued to the tiny pieces looking to take them."], ["Reviewed September 18, 2017", 5.0, "Unique beach!", "What a cool spot. Close to town, with newer paved parking lot. Its a little bit of a walk to the beach depending on how close you can park, and some steep sections to get down depending on which section you are trying to get to. Hard to believe in today's world that people used to just back up the truck and throw garbage over a cliff into the ocean. Now all these years later that gave us this attraction. The tide pools are great, so time your visit to see those. To see spark plugs, crank shafts, and other materials now part of the landscape and partially absorbed by mother nature is fascinating. A lot to see and enjoy here. Can be crowded at times, especially on the weekends. Doesn't have to be a one time visit, we go each time in Fort Bragg to tour the tide pools and watch the crabs\nShow less"], ["Reviewed September 17, 2017", 4.0, "Enjoyable Sand Fleas", "Lots of fun seeking the funky little pieces of sea glass for all age groups. Fairly easy access, very scenic, lots of nice features. Plenty of stinky piles of kelp, which keep the sand fleas buzzing in droves. Still, not a serious deterrent. Plenty to enjoy here.\nShow less"], ["Reviewed September 17, 2017", 1.0, "What a waste of time", "I don't know how anyone can say this was worth it. As a collector of beach/sea glass, I was so looking forward to seeing this beach. What a total disappointment and waste of time. There is NO colored glass here! And what was more disappointing was seeing families with bags removing - I'm not sure what - from the area. Don't bother. Really.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Surprise Beach in an Industrial Location", "You will drive through town, through what looks like an old lumber company, in an industrial area - to find a nice parking lot with a bathroom - walk down the path and there is the beach - yes, it is all made up of beach glass - - BUT -- and I am a beach glass lover - - the cliffs, the views, the climbing, the paths - were exceptional - -worth the stop for sure in downtown Fort Bragg.\nShow less"], ["Reviewed September 15, 2017", 3.0, "Not much left", "There is still a bunch of very small glass pieces, but don't expect to find much bigger than a pea. It is also very smelly and full of dead kelp."], ["Reviewed September 14, 2017", 2.0, "Yuck", "Glass Beach was a local dump, which is where all the glass came from. Overall it was pretty scuzzy and not the best smelling place in the world."], ["Reviewed September 14, 2017", 3.0, "Disappointing", "After seeing the pictures, we were excited, but it seems picked over. It's pea gravel with a little clear glass pebble mixed in. Unless you just want to see a pebbly beach, definitely not worth going out of your way."], ["Reviewed September 14, 2017", 3.0, "Not what you expect", "When I think of glass beach, I think of brightly colored glass pieces covering a sandy beach as depicted in many older photos. This is not the case. The glass is virtually all gone so it is just a typical looking rocky beach. Don't get me wrong, the ocean and its beaches are always awe inspiring and enjoyable. What I mean is that you could stop at any of the wonderful beaches in the area and have the same experience.\n\nIt was busy when we went but not overrun. Parking is free and right by it. Easy to access the beach.\nShow less"], ["Reviewed September 13, 2017", 3.0, "Very Different", "We arrived on a day that was overcast, so that made the beach look kind of dull. I was expecting the beach to shine, and maybe it would on a sunny day. The beach has been very picked over, so it was difficult to find an area where there was any glass. The paved walkways made it a nice walk along the edge. I guess I just expected more.\nShow less"], ["Reviewed September 12, 2017", 3.0, "2017 Vacation", "Hadn't been back to Glass Beach in a few years - it's pretty picked over but we enjoyed ourselves and met some nice people."], ["Reviewed September 12, 2017", 5.0, "Great new walk along the coast", "Great new walk along the coast. Created in 2015, this is an easy stroll along the bluffs on a paved trail, and worth the walk on a sunny day."], ["Reviewed September 12, 2017", 3.0, "The pictures of the past is what perseved this beauty", "Well I have always wanted to visit glass beach since I saw the first picture years ago. I finally visited this beach on my road trip. I was a bit underwhelmed. Yes there is Sea Glass......not in abundance like in the old pictures. Yes its more than your average beach but this beach has been picked of the good pieces. Also people still come in and pick up sea glass and take it home by the bucket. Do yourself a favor come and visit before it is all gone.\nShow less"], ["Reviewed September 11, 2017", 4.0, "A treasure", "Be prepared to climb down the path to get to the beach. It's worth it! There is an option to the easy side or the difficult path, you must go to the difficult paths if you want to get the full experience of this beach."], ["Reviewed September 10, 2017", 5.0, "Returned visit. After 20 years. Still the same but much improvedToilets paved parking and accessable", "Returned visit. After 20 years. Still the same but much improvedToilets paved parking and accessible"], ["Reviewed September 10, 2017", 1.0, "How disappointing ..!", "We travelled so far to see the glass beach and the pics seen on tripAdvisor. In reality, only some small pieces of glass every now and then, far from what we expected to see. Area: no real restaurants, feels like a region where much is closed. Sad to have travelled 10hours 2-way to see this\nShow less"], ["Reviewed September 8, 2017", 5.0, "absolutely beautiful!", "It's a beautiful little cove and many families were enjoying it. The views are new and different on every beach point. None were disappointing."], ["Reviewed September 7, 2017", 3.0, "Searching for unique stops along Pacific Coast", "Traveling along Pacific Coast, Glass Beach did have plentiful sea glass, but very small. However, the rock formations along the beach were GORGEOUS! Worth a stop!"], ["Reviewed September 6, 2017", 2.0, "very disappointed", "Had been so looking forward to this. Unfortunately we got there closer to high tide than low tide. The place was a zoo! You had to climb down the cliffs to actually get to the beach. We stayed 5 minutes and left."], ["Reviewed September 5, 2017", 3.0, "Not much glass left to see!", "I came here with a group of friends and was so excited to come here to see glass pebbles around. It sounded so wow but was a huge disappointment. There is hardly anything left to see, probably all taken away as a souvenir by the visitors. The glass pebbles were supposed to be the highlight of our trip but sadly the sunset view became the highlight. One can stop here to see the left glass pebbles but this is not a place to base your entire trip on.\nShow less"], ["Reviewed September 5, 2017", 3.0, "In Town but worth going to", "Worth going to . Glass is picked over and tiny. Alot of people. Beautiful at sunset. Close- ie right in town"], ["Reviewed September 5, 2017", 5.0, "Please don't take the glass!", "I have been visiting this beach for many years and have seen it grow up around itself. With the addition of the coastal trail winding through the old mill, it's the perfect place for a walk or bike ride. I would urge anyone who visits, however, to take only photos and leave the glass for future generations to enjoy.\nShow less"], ["Reviewed September 4, 2017", 4.0, "People are ruining Glass Beach", "We went to Glass Beach on the last day of our visit. It is beautiful, but it was sad to see people filling up bags of sea glass to take home with them. There won't be much glass left to admire if people keep doing this. Take pictures, not souvenirs guys, please.\nShow less"], ["Reviewed September 3, 2017", 1.0, "Don't bother", "For all intents and purposes, this is a glad beach in name only. All glass had been packed, lots of trash everywhere, feels very unclean. It's only redeeming quality is the lovely view of rugged rocks and crashing waves. Turning back to see Ft. Bragg behind you is a harsh shock, as it looks like a post-apocalyptic town. Go to Mendocino instead. Don't waste your time.\nShow less"], ["Reviewed September 2, 2017", 3.0, "Stripped bare", "There are far better beaches all along the West Coast but the draw to this one is of course the eroded glass.\nPhotos online look amazing but if you limit your visit to the first part of the beach you'll be disappointed. People have filled and continue to fill their pockets with the glass pebbles.\nAs such, it's not as you might hope.\n\nIt may be that walking further afield addresses this.\n\nInteresting to visit but really not worth the effort\nShow less"], ["Reviewed August 30, 2017", 2.0, "Not Worth a Detour", "We had heard a lot about Glass Beach recently, and were traveling along US-101 and decided to take a detour to take a look. The detour added 1.5 hours over winding roads to our overall trip.\n\nThere is hardly any glass to be found on the beach. The Glass Beach might once have been a wondrous spot years ago, but all you find today are scarce tiny pieces of polished glass rocks. You might get a nice picture if you put your camera on the ground (photo: shoes of a five-year old is for proper reference). You’re better off looking for images from years ago, than actually visiting this spot.\n\nIf it weren’t for the tide pools, the detour would have been a complete waste of time. If you happened to be in the Mendocito/Fort Bragg area, Glass Beach is worthwhile visiting, but we wouldn’t recommend going out of your way for it.\nShow less"], ["Reviewed August 30, 2017", 1.0, "MAJOR DISAPPOINTMENT!!!!!!!", "Where do I begin. If I could give it a zero I would. What a waste of time. Way over crowded. No beach. I repeat NO BEACH!!!!!!!. No glass except tiny tiny pieces. The city of Fort Bragg is right there. Waste water pipes coming out of the ground with some kind of water pouring into the ocean. No easy access for disabled people to get down to the water. Plus the stench of sewage. DISGUSTING. Go to the Sonoma coast instead. Beautiful beaches, easy access no where near as many people and no city on top of you.\nShow less"], ["Reviewed August 29, 2017", 2.0, "Not much glass left", "Wind swept, rugged beach. Nice but we were hoping to find beach glass. It is well picked over. We talked with some locals & it just became so popular only very small pieces are left, mostly clear, some green."], ["Reviewed August 29, 2017", 3.0, "Disappointed", "Pictures show wonderful glass on beach and lovely beach but when we got there it was not at all like pictures . Access to beach was difficult and although view was nice I would not return."], ["Reviewed August 28, 2017", 3.0, "Slightly Disappointing", "The main beach was very hard to find. The entrance to it was behind a fence since the stairs had washed away in a storm the previous winter. However, we made our way down to the beach and it was well worth the trip. The trip from San Francisco was beautiful as well.\nShow less"], ["Reviewed August 27, 2017", 5.0, "You have to see it to believe it!", "Besides the gorgeous rocky coast and crashing waves, the sea glass on the beach and trapped in the rocks is just amazing to see."], ["Reviewed August 22, 2017", 4.0, "Nice beach, good tide pools", "Kids had fun on the beach collecting the glass. The tide pools were good but there was a lot of sea weed which made viewing difficult. Saw some sea lions in the distance."], ["Reviewed August 21, 2017", 4.0, "Little glass", "I had seen the photos and really wanted to go to the Glass Beach. The bits of glass are very small but you can still see them. We were told by some locals that you have to dig a little hole and that way you can see more. I believe that the glass comes from bottles that have been dumped into the sea in Asia and the currents grind and polish them and eventually it ends up in Mendocino. Don't forget to see the beautiful seals sunning themselves on the rocks too! Worth a visit!\nShow less"], ["Reviewed August 21, 2017", 2.0, "They need to have a glass restoration project for the beach", "Been there; done that. Glass Beach is a very small beach; people have been taking the larger glass pieces from the beach as souvenirs, so that all that is left are the very tiny pieces on a very small beach."], ["Reviewed August 21, 2017", 2.0, "No longer the great Sea Glass Beach it once was", "Just three years ago I made my first ever trip to Sea Glass Beach. It was amazing to see all the different colored glass that made up the shore. If you were to scoop up the shore in your hand, you could find so many different and unique colors of old glass particles... Now, is a different story.... I walked out and noticed most of the people sitting... Sifting through large areas of the shore, picking out the glass they want to keep... in a 20 foot area, there were about 15 people, digging and sifting... By the time I realized what they were doing... I looked down to the ground, grabbed a handful and found that 90% of what I was holding was plain white glass and rocks... All the beautiful, unique colors have been sorted through.. Pretty sad state to see... I am just glad I got to see it years ago... when it was majestic and beautiful..\nShow less"], ["Reviewed August 21, 2017", 4.0, "Glass Beach", "Glass Beach used to be a dump; literally. When we first went it was full of glass; at least a foot deep. Now it is sparse in most areas, but still worth visiting for the dramatic beach views. Walk and sit and enjoy the surf. Great place to visit any time of year but we love the fall when the sky is blue and the surf is up.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Sparkly and picturesque", "I wish I had more time to spend here when I went. It is fun to look for the little pieces of glass, but don't only look for glass because a lot of people missed the seals stunning themselves, beautiful birds flying, and other little animals running around, not to mention the gorgeous views and paths to walk high above the coast. BTW, YES you can take the glass you find home.\nShow less"], ["Reviewed August 19, 2017", 2.0, "Not at all like in the pictures", "Excited to catch a glimpse of what we saw in pictures and read about Glass Beach and only to end up in a depressed, abused by selfish Tourists who stripped the beach of everything you see in those pretty pictures from long ago.\n\nShortened the trip by one day and spent two days too many, not including drive time to and from, that could've been better spent somewhere else along the coast.\n\nThe only highlight was meeting a local at the laundromat who was in total agreement with the above Who shared with me a \"locals only\" (I'm sure others know) secret that revealed to us the most beautiful redwood forest we had seen. Extremely enchanting. Exactly like out of a children's story book, maybe even more than that! And less traveled then the Avenue of the Giants!\n\nBut back to Glass Beach. Thank you, but no thank you.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Wonderful example of nature turning garbage into beauty", "There is a lot more glass on the beach than you realize at first, as most of the pieces are pretty small and mostly clear or white, though you can find brown and green as well. Reds and Blues are almost all gone by now. Though there are a number of \"glass beaches\" around the world, the Mendocino Coast is very nice anyway, and the drive along Hwy 1 is beautiful.\n\nFor those people who go here to collect the glass: please note that there are signs asking people not to do this. At the current rate, unless they approve the dumping of more glass onto the beach, most of the glass will be gone in another 10 or 20 years. Please don't take the glass. Just enjoy it for the novelty that it is and as an example of nature turning garbage into beauty.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Family trip", "Beautiful view, you can get some amazing pictures. This is a must see...hunting for the glass was fun to see what you can find. You can't take it but it was still fun to see what you could find."], ["Reviewed August 14, 2017", 4.0, "Nice place, really astonishing", "It is a nice place to spend time with kids and family. There are lot of sea glasses. But mostly white, transparent glass, small brown and small green glasses. You will find lot of blue shells. We tried to search red glass and big green glass. We were successful to find big green glass but not the red one. It was really fun. If you are not ready to step into water, you can take costal trail. Nice view overall. But be careful while finding glasses because lots of broken bottle glass also are there.\nShow less"], ["Reviewed August 14, 2017", 3.0, "It's a Nice Beaqch", "If you like to collect shards of ocean smoothed glass then this is for you. Otherwise it is a typically scenic beach on the Mendocino coast."], ["Reviewed August 14, 2017", 1.0, "Nothing special", "It was a foggy evening when we went to the beach so it was nothing great. Maybe had the sun been out the beach would have looked much better."], ["Reviewed August 14, 2017", 4.0, "Beautiful", "Glass Beach isn't necessarily how it looks in the pictures online; unless you can access the older dumping ground of the beach by ocean kayak or doing some climbing into areas that are allegedly prohibited. On our recent trip we found a decent area of one of the newer depleted areas of the beach. Next visit I'd like to scan the coastline to find the older sections that are supposedly ankle to knee deep in sea glass. Beautiful views and area to visit whether you find the glass or not.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Tons of glass", "Not much of it large or different colors but it was also the middle of summer. Winter is the best time to hunt there. It has some nice wildlife also."], ["Reviewed August 13, 2017", 5.0, "It really is covered with glass", "Now, be aware that the glass pebbles are small - most smaller around than a penny - but it's true that the sand is covered in sea glass, and an amazing sight. But don't just go there for the glass - go also for the beautiful ocean view and the walking trail up on the bluffs (in fact, it can be helpful to walk along the path up a cove or two or three to avoid the crowds along the main beach). I also recommend going early in the morning and/or during low tide - more of the beach is exposed, and fewer people are about.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Wow!", "Amazing! Fort Bragg is not the easiest place to get to, but if you are nearby... this is a MUST. I read a few reviews that were helpful and I feel the need to repeat a few things. First, LOW TIDE is a must. Second, the beach is NOT closed. You can access it. And third the glass will be there. The whole beach is small glass pebbles and a foot deep.\n\nHead toward the beach from Dennys in town and park at the end of the street. Walk to the bluff and turn left! Walk on the trail BETWEEN the ocean and the fence until you see a steep path down to a large crescent shaped cove. This steep path would be difficult for people with mobility issues. However, I am 50 and not athletic and made it. Totally worth it!\n\nEnjoy!\n\n\n\nShow less"], ["Reviewed August 11, 2017", 1.0, "Just a beach", "Was quite excited to visit this beach after seeing pictures I had my own picture in my mind and when we arrived I must say I was so disappointed. It's just a normal beach although popular as there were lots of people there. Free parking. I did see a whale which was fantastic.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Mostly gone", "Most of the sea glass is gone because people carried it away (stealing actually). They toted it away in buckets and bags. I live in Fort Bragg and watch this over and over again. So that is why you don't see much anymore. The opening of this new section of coastal trail made it super easy to get to the secret coves and carry it off. There are lots of interesting and beautiful places, beside Glass Beach, on the Mendocino Coast so check them out instead of getting disappointed.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Sea Glass Beach", "Came here with my mum and sister. My mum absolutely LOVES sea glass. It was well signed and easy to get to. We came at low tide which was very important! There was still lots of sea glass but all small pieces. I had hoped there would be some bigger pieces. My mum said she could have spent hours walking around the beach. An item checked off her bucket list for sure! Also, there is a bathroom in the parking lot!\nShow less"], ["Reviewed August 10, 2017", 5.0, "You've got to visit if in Fort Bragg", "Beautiful place for all ages. Look for the Noyo Headlands trail, and remember to leave glass where it is. Spectacular views of the coast. Trail is flat and accessible."], ["Reviewed August 10, 2017", 2.0, "Shouldn't be called Glass Beach", "Pictures online were deceiving. Really cool rocks to walk out on and snag some photos of crabs. Very, very few pieces of glass left. Definitely a great place to stop and check out, with great views, but if you want to see the glass it's known for, it's no longer here.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Fascinating place", "Best time to go is after a high tide with rough water. More glass gets exposed that way. Friends will enjoy the scenery handpicking up a few beads."], ["Reviewed August 9, 2017", 5.0, "Wonderful Area", "Glass Beach is a must for any visitor in the Fort Bragg area. Everyone looking for treasure and going home with little pieces of polished glass. Kids were everywhere enjoying getting their feet wet. The water is cold and I would suggest water shoes. I go there every time we visit. Make sure to visit the Glass Museum.\nShow less"], ["Reviewed August 8, 2017", 5.0, "I loved this place. Some small pieces of glass left, but no large pieces left.", "I loved this place. Some small pieces of glass left, but no large pieces left. It was fun to go there (during low tide is the best) and treasure hunt for little treasures. Even Grandpa had fun doing this."], ["Reviewed August 8, 2017", 5.0, "A must-do if you're in Fort Bragg", "Stopped here with our 6 and 8 year old girls after breakfast at Egghead's and the Skunk Train (you can do all of this in one day and more.) Park at the lot or on the street at Old Haul Rd. & West Elm St. then follow the trail to the beach. Originally hoped to visit the tide pools at MacKerricher State Park but were short on time so we combined Glass Beach with the tide pools here--they were great. We brought our water shoes with us and they were super helpful so I highly recommend it. There are small rock outcroppings you can climb so make sure your shoes are fairly thick and sturdy. If you don't plan to get wet, good sneakers are fine (leave the flip-flops at home.) Saw crabs, some small fish, a harbor seal, wild flowers, different kinds of sand. The actual glass was pretty small but still cool to see. It's tempting to take but do your best to leave Mother Nature alone, poor girl's been through enough.\n\nWe spent about 90 minutes exploring with our girls and had a blast--didn't want to leave. NOTE: Make sure you look online to find out when Low Tide is that day and arrive 30-60 minutes prior, you'll get the most out of the visit.\nShow less"], ["Reviewed August 6, 2017", 1.0, "Don't bother", "The glass has all been picked up by people. It is not the spectacle the pictures show on line. Don't bother."], ["Reviewed August 4, 2017", 2.0, "Disappointing", "There was very little glass left on a very small beach. If you don't look close, you can't even tell there are glass pieces in the sand. The midst interesting thing was a small tide pool which housed some small crabs. Don't go out of your way for this beach.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Nice trying to find all different colours", "We had a lovely walk above the beach first and then walked down to the beach. It is only a little stretch of beach. Where my 16 year old and I tried to find as many different colours of glass. My 14 year old and husband went off to explore all the rock pools. We had a really nice time!\nShow less"], ["Reviewed August 4, 2017", 4.0, "Not so much glass on Glass Beach....", "Although this is still a very popular attraction, the glass that remains from the 60's dump site has mostly been removed by years of scavenging. What you will find are layers of small, pea sized glass pieces that can extend several feet deep, in places. The glass is primarily clear in color, although some colored glass is still to found, if enough time is spent digging around. The State Park has requested no taking of glass but that appears to be mostly ignored. It's still worth the hike down to the beach for exploration.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Pleasantly Surprised!", "After reading reviews from different sites I told my 16 year old son that it probably wasn't going to be all that great. He was obliging my planning of my birthday day. Some of the reviews made it seem like there was not a piece of glass to be found. Truth is, it was everywhere! Were there huge beautifully polished pieces? No but it's silly if that was the expectation. Mostly green, white, and amber which is the common colors of bottles so, again, for folks to give a negative review for that is a little silly.\n\nNot a beach for playing in the sand or swimming but a great place for tide pooling, climbing on the rocks, and spending an hour or so. We went on a Tuesday and while not crowded, the parking lot was full. Spaces empty quickly seeing most people don't stay all day and there is also street parking. The public bathroom at the end of the lot was clean and there are water fountains there as well. The beach is dog friendly - we brought ours and there were a few others as well. There are no poo bags so please bring your own!\n\nDefinitely check the tides and go when the tide is out.\nShow less"], ["Reviewed August 2, 2017", 2.0, "It’s just about all gone, sigh!", "This was one of my must see stops on my coastal road trip. We finally made it here and like the reviews say, the glass beach is hardly anymore. There are a few very tiny pieces of glass left but that’s about it. Many people had bags collecting the little tiny bits they could find. One guy had a whole empty 2 liter bottle of soda filled with sand and glass. Why do people do this? It was very disappointing. We looked around and left after about 30 minutes because I couldn’t stand seeing people take away the glass. I imagine it will completely be gone in a short while.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Cool Experience", "This Beach was on my boyfriend's bucket list. Though it did take a bit to figure out where to find the \"glass\" when we first got there, it was really cool when we did. The trails were fun, and it will be even better when the \"Difficult\" trail is finished!\nShow less"], ["Reviewed August 1, 2017", 4.0, "Cool spot. neat history. Not knee deep sea glass... but cool none the less.", "My kids had fun here... couple god tide pools... lots of people TAKING sea glass which is why there is less and less... although you still see a TON... just smaller pieces. really neat spot."], ["Reviewed July 31, 2017", 4.0, "Neat little stop!", "We spent about 30 minutes walking the beach and finding pieces of glass. It is worth the stop and neat to see sea glass scattered along the beach."], ["Reviewed July 31, 2017", 2.0, "Picked clean", "Sadly over the years this once fascinating place has had all its pieces picked clean by human scavengers. Pretty soon glass beach will just be known as \"beach\". The surrounding area is nothing special either"], ["Reviewed July 31, 2017", 4.0, "More glass than I expected", "With all the people going here to collect the glass, I thought it would be hard to find, Nope, its all over the place, just a little tough to get to if you can't get around the cliffs. We found some nice pieces, mostly clear and green, but lucked upon a few flakes of blue as well.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Too beautiful for words!", "Glass Beach was my first up close experience with the Northern California coast. Stunningly beautiful!"], ["Reviewed July 26, 2017", 3.0, "Underwhelmed", "I have been wanting to visit here for so long! I was a bit disappointed because after following the signs for the difficult trail we reached a dead end. Upon further inspection we finally found a tiny sign that informed us the stair access was closed until November 2017. Also the northern part of glass beach was very much picked through and does not look like the classic photos that you see of this area. With that said, I still was amazed to see as much glass as there was and enjoyed it!\nShow less"], ["Reviewed July 26, 2017", 4.0, "Cool!", "Glass beach was really fun. They have trails, easy and difficult, that take you down to the water where the sea glass is. It is fun to search for and find different colored sea glass chunks. My only problem was that it seemed like there weren't as many big pieces of sea glass as there were in pictures.\nShow less"], ["Reviewed July 26, 2017", 4.0, "It looks underwhelming until you see it close up.", "The glass bits are tiny, but there are still enough around for this to be legitimately called Glass Beach. The shards are tiny, but pretty and unusual. If you are in the area its worth a go, especially since its so easy to get to. Good for kids.\nShow less"], ["Reviewed July 24, 2017", 2.0, "Walked to Glass Beach", "Beautiful coastline not much glass to see. It's been picked over by tourists....the ones that can't read the signs."], ["Reviewed July 24, 2017", 3.0, "Nice view from up top, not very impressed with the glass aspect.", "I think the views of the ocean are great from the top of glass beach. The surrounding areas are old industrial stripped concrete slabs and the glass part of glass beach was not too impressive. There are pieces to see but from what I read, you have to kayak to a part of the beach with ankle deep glass. I probably wouldn't go out of my way for this particular beach.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Unique Beach with lots of treasures to find", "This beach is unlike others it has so many neat little treasure to hunt for with the kids. It is a great place to relax on or spend hours searching through the tons of glass comparing colors with the rest of the family.... So much fun!\nShow less"], ["Reviewed July 23, 2017", 2.0, "Disappointment", "We arrived at Glass beach, admission free. Parking is limited but found a spot. We walked along the cliff and climbed down to one of the beaches. The beaches were so picked over - no sea glass. There were way too many kids running around unsupervised. It was probably very nice years ago. There are too many other wonderful parks to view in tge area.\nShow less"], ["Reviewed July 22, 2017", 5.0, "The Amount of Sea Glass Varies With Tides And Storms", "Glass Beach is worth a visit anytime. There are a couple rocky coves here that were once the town dump. The amount of polished glass, ceramics and pieces of metal will vary with the level of the tide (low tide is better, lowest tides are best.) The amount is also affected by storms. Major storms can scour the treasure, long period swells can push it back up the beach. It is hard to predict and yes, the size and amount diminishes both from treasure hunters and from the action of the waves over time. The cove to the south of the access trail also has sea glass and is more difficult to climb down the trail.\nFor abalone divers and spear fishers: The south cove is a fair abalone picking spot at low tides and may be dive-able when the waves are too big to dive at other spots. I'm not suggesting this is always going to be a safe spot for you to dive for abalone or spear fish. When more exposed spots are not dive-able hover, the south cove at Glass Beach is slightly more protected from swells and MIGHT allow determined and experienced divers to get in the water.\nShow less"], ["Reviewed July 22, 2017", 4.0, "Go for the views", "Enjoy the views of the ocean and rocks and breaking waves - glass where we were was small pebbles but when you think of what it once was (trash/garbage dump) and what Mother Nature did to it over time its pretty cool. Where else can you say you walked on a beach of glass pebbles barefoot with no injuries. Nice walking paths and tide pool. Just enjoy nature and getting away from the heat inland and have a good time\nShow less"], ["Reviewed July 22, 2017", 4.0, "Actually was quite a bit of glass.", "We visited the beach around 8:30 AM on a weekday. Not many tourists around. We went do a slightly steep cliff side. Once on the beach, we were able to scoop up handfuls of glass mixed with the stones. No.... we didn't take any. If you stand on the cliff, you won't see the glass. You have to get down on the beach.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Beautiful Garbage to Treasure.", "Amazing how the ocean has made an old garbage dump a thing of beauty! Our children loved looking for the bits of glass along the beach."], ["Reviewed July 21, 2017", 2.0, "Not Much Glass", "We were doing a cross-country move and were going to be in the area so we opted to get off highway 101 to 1 and stop here.\n\nIt didn't help that it was a gloomy day but this is one of those places that maybe I should have left the grand illusion in my head alone. Yes, there is glass here but there's a reason that all the pictures you see of it are of really really close up shots. There is not much glass here but it sounds like years ago, there used to be. I choose to not take any pieces with me so others could enjoy it and I encourage you to do the same.\n\nIn the end, It's beautiful and interesting but not worth a stop. Stay on I-5 or Highway 101 and keep on driving.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Nice tidal pools", "We were there at low tide and were able to see the tide pools. You can walk as far as you want above the ocean and there are several areas to access. Did not see much glass but it was a beautiful beach"], ["Reviewed July 21, 2017", 1.0, "Not worth the walk", "Two trails lead to Glass Beach: one \"difficult\", one \"easy\". Due to the unstable situation at some places of the coast, there are lots of fences, stairs are closed for renovation.\nThe beach itself is not worth the walk. There are only microscopic pieces left of glass with limited colors. The main reason seem to be the people who pick up every little shiny thing and let it disappear in their pockets. Even families with small kids are crawling over and under the fences and harvest the beach, leaving nothing behind for the next visitors. What kind of an example are those people giving to their kids? Ignoring signs which warn about concrete danger and ruin the Beach for good? Not quite what I expect from responsible tourists. Sorry, that short trip was a waste of time.\nShow less"], ["Reviewed July 20, 2017", 1.0, "Pass it by", "Not worth the two minute walk. The advertising pamphlets did not represent what we saw. What we saw was a fairly dirty beach with some green glass flecks occasionally. The good news it is free but not recommended"], ["Reviewed July 18, 2017", 4.0, "Beautiful beach, glass is sadly lacking", "I remember coming here as a kid and all you really saw was glass. Now, years of tourists taking pieces and locals collecting it to sell, the glass is a lot less. It's still there and beautiful, but you don't get the striking effect that is often presented in photos and travel books. If you come expecting predominantly glass you will be disappointed, but if you go to enjoy the views and enjoy finding glass among the rocks and sand it's great!\nShow less"], ["Reviewed July 15, 2017", 4.0, "Sea Glass Everywhere", "We arrived around noon and the beach was already filled with people, all ages, digging and searching for glass. Even on the beach, the glass was easy to find, although most was small in size. For the balanced challenged or wheelchairs, you could get close but no stairs so walking was required. I have balance problems but with a cane I got down on the beach and waded in the icy waters to take pictures. A few sea creatures were stretched out on the large rocks, occasionally vocalizing interruptions in nap time. Beautiful day, beautiful views, a few good picnic spots, well worth the time it took us to climb down. Bathrooms at the parking lot. Lots of broken sandals left behind so wear something sturdy, not dime store flip flops. The Sea Glass Museum is a good pre-beach visit.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Lovely Walk and Parking...BUT", "For people heading for Glass Beach, be aware on July 13, 2017 we went expecting to go down to glass beach on those scary steps...no sign at beginning of walkway to inform you, but when you get there it is all sealed off with sign saying due to Cliff erosion too dangerous to use steps down to beach.\nShow less"], ["Reviewed July 13, 2017", 3.0, "Lovely rugged beach area but not a lot of glass beads", "Has a great walking trail system to explore the many little beaches and tide pools. However, if you're expecting to see lots of pretty glass beads littering the beach, don't count on it. The glass scattered throughout the unusual beach sand/rocks. However, you will see spectacular scenery, lots of rocks and shells and even some sea animals. It is a great place to explore, but be sure to wear good walking shoes because the rocks are sharp and uneven.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Mommy Vaca", "What can I say... what a beautiful place! Tranquil and relaxing. We went to Glass Beach right after sunrise and there was only one other family there so it wasn't crowded at all. Highly recommend if ever in this area"], ["Reviewed July 12, 2017", 3.0, "Big Hype, Small Glass", "Glass Beach is one of those places that you go to to say you have been there. The \"good\" glass is long gone. You want good pieces of sea glass, get yourself a rock tumbler and make your own or go to a craft store and buy it.\nThe walk/hike around the area is good exercise, and you can decide whether you want an easy or hard hike. There are rocks to climb on and a guide to the flora of the area, lots of places to take pictures.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Not that great", "Had walking trails all over, but you have to really look hard to find glass, but still very nice view of the ocean"], ["Reviewed July 10, 2017", 4.0, "Must see!", "This is the most famous beach in the ares although most of the bigger pebbles of colored glass have been taken away by tourists but fine grains remain and make it look exotic. Worth a visit."], ["Reviewed July 10, 2017", 4.0, "R&R", "Okay to walk around and look at. Stairs closed. No easy access to beach. Need to climb down to. Had injured foot in walking boot so I was not able to. It is fairly picked over so not near the glass as 30 years ago. Was much better then.\nShow less"], ["Reviewed July 9, 2017", 2.0, "Beat the heat motorcycle run", "I have visited Glass Beach a number of times before it was turned in a state park.Years ago one couldn't take step without stepping on the glass. Now that it's a park it's hard to find any glass. Too bad it was a nice place to visit in Fort Bragg.\nShow less"], ["Reviewed July 8, 2017", 4.0, "Please leave the glass on Glass Beach", "Beautiful area, sadly most folks were taking Glass home is baggies & buckets.\nIt's a shame... not sure why people can not just visit, appreciate the beauty, take a photo & leave. Didn't spend much time on the beach with the \"scavengers\", but did enjoy walking the trails & ocean views.\nThere are tide pools too, which was fun to explore.\nShow less"], ["Reviewed July 6, 2017", 3.0, "Nothing like the pictures", "It was fun to go and see all the glass but its a really small area with really tiny paths. Looks nothing like the pictures you see online."], ["Reviewed July 5, 2017", 5.0, "Thoroughly enjoyed my visit", "Many reviews were disappointed with glass beach but I found some wonderful little pieces. I walked down around 7pm and only a few beachcombers remained with the tide coming in. Absolutely breathtaking scenery which could never disappoint."], ["Reviewed July 5, 2017", 3.0, "Nice area to walk w/ kids", "The glass beach was disappointing- expected larger pieces of glass after seeing pictures. It's ok but the walk along the bluffs was nice-level, ocean view, nice breeze."], ["Reviewed July 5, 2017", 5.0, "Beautiful views", "The glass beach has beautiful views and lovely trails nearby. Yes, there's very little glass left on the beach but you can still find some for picture purposes. There are fun rocks to climb on to take in the views and pictures. It's definitely worth a stop if one is in the area.\nShow less"], ["Reviewed July 4, 2017", 5.0, "What the heck are people complaining out--this place is amazing!", "I can't figure out what everyone is complaining about. This is a great place--gorgeous views of the ocean and tiny beads of sea glass where every other beach has sand! I went to site 2 which is to the south of the parking lot just a short distance. Crawl under the ropes and follow the short trail behind the fence. You can get down to site 2 through a steep trail with a rope. They clearly do not want people down there but nobody said anything to the few of us that were there. That beach has ONLY sea glass-no sand or rocks. Yes the glass is small but it is so amazing to look for the rare colors.\n\nMy hubby was less adventurous and stuck to the open beach area--which was still incredible. He found about ten small bits of orange glass which is one of the more rare colors. (and yes to all the crazies --he took a picture--not the glass....)\n\nIgnore those people who said it used to be better....just go and enjoy this amazing place.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Fun activity finding diminishing glass rocks", "There's Not much glass there anymore :). But a good activity with kids to keep them busy. We 4 year old brought small glass rocks for his collection."], ["Reviewed July 2, 2017", 4.0, "Discover the beauty", "This is a beautiful place that will show its beauty if you are will to go exploring at the right time. A must see before the ocean takes what is left."], ["Reviewed July 2, 2017", 5.0, "Read the regulations!!!", "A note from California State Parks regarding Glass Beach at MacKerricher State Park: “All park cultural features are protected by law and may not be removed or disturbed, including glass found at Glass Beach.”."], ["Reviewed July 2, 2017", 4.0, "Great time!", "Gorgeous view. Your luck in finding larger and rarer colors of glass seems dependent on where you explore and what time of day. If you've got time to just relax and search (especially at low tide) you'll enjoy yourself more. There are lots of white, brown and green pieces of good size but we also found smaller blue, red and bright yellow pieces.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Not what I expected", "A lot of people have commented about it going down hill- I can not compare because this was my 1st visit. But I did expect it to be more spectacular. From above the beach you can't really tell that the glass pieces are on the beach. We accessed the beach thru an area that is blocked off - once down the steep hillside and onto the beach it truly is pretty and colorful.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Go for the views", "What you've heard/read about the glass, or lack of, is correct. There's not much and what you do find are tiny pieces. Despite that, we enjoyed walking and exploring all the crags and pools. It is beautiful! There were leashed dogs there too. Had I known, I would have brought my dogs along.\nShow less"], ["Reviewed June 27, 2017", 5.0, "A must see", "Spent hours exploring, beautiful views of the water from the trail head and easy to access for the whole family! Unique and amazing place."], ["Reviewed June 26, 2017", 3.0, "Small pebbles", "It is worth visiting but just know that, though there are millions of glass pebbles all over, pretty much all of them are no bigger than a pinto bean. It's still fun to be able to say that you walked on broken glass in you bear feet. ;)\nShow less"], ["Reviewed June 26, 2017", 2.0, "Barely any glass left", "The only thing left of the Glass Beach is it's reputation. There are barely any glass pebbles left, and the ones you can find are very tiny. I wouldn't go out of my way to visit this attraction."], ["Reviewed June 25, 2017", 5.0, "Beautiful!", "Really enjoyed going to this beach and looking at all the sea glass. We found several different colors. A very relaxing, unique place to be."], ["Reviewed June 25, 2017", 5.0, "Amazing", "This visit did not disappoint, it was absolutely amazing. I would not allow my kids to remove glass from beach. And it was sad to see a bunch of women raping the beach of glass."], ["Reviewed June 21, 2017", 5.0, "Looking for treasures", "I enjoyed looking through all the sea washed glass. Only tiny bits left but still sparkle in the wet sand. Worth an hour or so."], ["Reviewed June 21, 2017", 5.0, "Beautiful", "Glass beach! Gosh, it's so sad to see it these days! My first time visiting, 5 years ago, it was abundant with glass. A magical place, full of colorful, large chunks of smooth glass.\n\nThese days, the glass is sparce. Tiny pieces, mostly white. I've watched people fill shopping bags with glass, and take it home. It's hearbreaking. Someday, there will be nothing left.\n\nThe beach is absolutely breathtaking. Glass, or no glass, the cliffs and rocks are nothing less of spectacular! You will see many little crabs all over the rocks, and sea lions, sunbathing out on the rocks in the water. It's a beautiful place to visit.\n\nThey have a nice size parking lot, and the paths leading to the water, are lined with wildflowers. So beautiful here!\nShow less"], ["Reviewed June 21, 2017", 4.0, "A lovely place to visit, but please don't take the glass!", "I really liked Glass Beach, but it saddened me to see how many people were filling up buckets with glass pebbles. There will be none left at this rate! So please visit and enjoy Glass Beach, but leave it how you found it. The coastline in Fort Bragg is spectacular. I visited in Autumn and the weather was crisp, but lovely. Highly recommend this stop along along the Pacific Coast!\nShow less"], ["Reviewed June 21, 2017", 5.0, "Different", "Always love sitting for hours at Glass Beach! We love to go when its less crowded and just sift through the glass. I remember my first time to glass beach the pieces were much larger and there were so many different colors of glass. Now red and blue are very rare and oh so tiny. Still enjoy it though.\nPeople PLEASE pick up your trash. On our last visit their was a pull up and wipes stuck in a rock ledge. Terrible.\nShow less"], ["Reviewed June 21, 2017", 3.0, "Bit disappointed", "Nice parka d view and paved paths to beach but the sea glass is broken down to pea sized bits nice colours when you zoom in on your camera but not what I expected."], ["Reviewed June 20, 2017", 4.0, "Don't Miss the Trestle", "Glass Beach is interesting but the must do activity is to go to the northern most glass beach, and follow the road north to the dead end, which is a few yards from the beginning of the walk to the old train trestle. The trestle has been rebuilt to be safe for walkers and crosses high above Pudding Creek. It is quite a treat and is safe but hang on to small children. The Coastal Trail continues north to McKerricker State Park on the other side of the trestle.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Here's the DL on the Glass Beach", "To anyone wanting to visit the Glass Beach, here is the review you want to read:\n\nFirst off, the glass is perfectly legal to take (according to the sign and legal explanation outside the Sea Glass Museum). Still, the park rangers request that you don't take any.\n\nNext, there is more than one glass beach. There are actually three of them; the touristy one is \"site 3\", that's the one that has signs leading to it, and is the easiest to find. There is plenty of surface-level sea glass here, and it's beautiful, but you really need to go in the morning during low tide. We got there at 7:30am and we had long stretches of beach to ourselves (even in the middle of June on a weekend). When we came back around 3 though, the beach was packed and it was hard to find much glass.\n\nSite 2 is less frequently visited and has a LOT more glass; the entire beach is probably around 90% glass, and even in the afternoon we had the whole beach to ourselves most of the time. Here the glass went at least 6 inches deep. I won't tell you exactly how to get there, but it only took a bit of research online to find it. If you really want the exact location, there is a map outside the Sea Glass Museum.\n\nI can't say much about site 1 and I didn't personally visit it. As of 2012, it was only accessible via kayak, but the new path may run next to it now. It was a dump site for longer than the other 2 sites combined, and it's harder to access, so I would imagine that it has the most glass of the 3 sites. However, according to what I've read, site 2 is the prettiest of the 3.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Beautiful views!", "Great trails and views - lovely rocky coast and the glass was so neat to see. Dog friendly for leashed dogs. Picnic tables if you want to bring lunch and a parking area with restrooms"], ["Reviewed June 17, 2017", 5.0, "Where has all the glass gone?", "I Wish Fish and Game or Parks would give fines to people taking bucketloads of glass from Glass Beach. I think Parks did a beautiful job fixing it all up and making wonderful paths, but it is disappointing not to find as much glass as we used to on the beach. The day we Wrnt, I saw a family of 6 taking bucketfuls of glass rocks off that Beach. It's kind of sad. Oh well it's still a beautiful place to view the Ocean, take a Walk, enjoy the smell of salt ocean water and the plants and just have a lovely picnic time and a hike or a rest. People leave the glass on Glass Beach.\nShow less"], ["Reviewed June 16, 2017", 3.0, "A little underwhelming", "You have to wind through an industrial area to get to this very small beach area. We've seen rally picturesque photos of this beach and it really didn't match the expectation once on site, it is just some slightly different colored sand particles.\n\nJust up the dirt road (by a cemetery) there is a place to walk out on the rocks (if you are adventurous) and it has some cool cutouts in the rocks that make some neat blowholes and pools.\nShow less"], ["Reviewed June 15, 2017", 2.0, "Meh", "Visited Glass Beach recently, and found it.....very average. crowded (though it was the weekend) and showing its wear from too much love. And while there may have once been glass floating up on this beach from distant places, it is unlikely anyone will ever find any. Still, beautiful views and a pleasant place to walk the paths. Better tide pooling can be found at MacKerricher State Park\nShow less"], ["Reviewed June 14, 2017", 2.0, "What Sea Glass?", "Unfortunately the years have taken their toll on Glass Beach. Once a unique spot to see years of trash glass tumbled by the sea, there is now little to see as people continue to search the shore for glass to take away."]]}}