{"Golden Gate Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Golden Gate Park", "url": "/Attraction_Review-g60713-d311684-Reviews-Golden_Gate_Park-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/44/04/42/conservatory.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "8295"}, "address": {"@type": "PostalAddress", "streetAddress": "501 Stanyan St", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94117-1898", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "This park has everything!", "We spent our last day in San Francisco walking around Golden Gate Park. It's beautiful! The section by the ocean was very windy but fabulous. The soccer field were pristine. The polo grounds were a great place to walk or bike. I loved this park and I'd be there often if I lived nearby!\nShow less"], ["Reviewed 2 days ago", 4.0, "You gotta go there", "Beautiful grounds and features. Carve out time for the Academy of Sciences, de Young Museum, Japanese Tea Garden, Conservatory of Flowers, and Botanical Garden. Check ahead for entrance fees. Nice café in the de Young Museum. Or, if it's a nice day, just pick a spot to chill, watch people, and maybe think back to the summer of love--or not.\nShow less"], ["Reviewed 3 days ago", 5.0, "Love Golden Gate Park", "An awesome and diverse park right in the middle of SF. Lots to see and do...from sports to museums. Spend the whole day or more. Beautiful"], ["Reviewed 4 days ago", 5.0, "Beautiful", "This is like central park but less crazy homeless people. Go for exercise sight see and entertainment. The have art segway tours cute dogs a flower conservatory tea garden and food trucks. All reasonable priced. You literally can spend the whole day here if you only had one day in San Francisco then just go here.\nShow less"], ["Reviewed 5 days ago", 5.0, "Great outdoors for a sunny day", "You’ve got to love this big park, where there is so much to do for anyone. I have visited the park so many times with my kids and each time we found new things to do.\nThere are the botanical gardens and across the street are the Japanese tea gardens. There are the science museum and the De Young museum. There are playgrounds, concrete slides and an old carousel. There are puddle boats, ponds and bisons. On the west part there are windmills and lots of trails for runners and strollers.\nIt is a perfect place to fly a kite on a windy day of hold a picnic on a sunny morning.\nShow less"], ["Reviewed 1 week ago", 5.0, "A green and diverse space in the center of The City", "There are so many different little sections to the park....The Academy of Sciences, De Young museum, Japanese Tea Garden, Music Concourse, Shakespeare's Garden, Stowe Lake, The Windmill, Bison Paddock, Conservatory of Flowers....so much more. What is nice is that one can visit all year round. Street parking can be a challenge, so get there early if you don't want to park in the garage.\nShow less"], ["Reviewed 1 week ago", 4.0, "Lovely Park - Good for a quiet stroll", "This is a beautiful park even in February. The sun was out whilst I was there so the walk around the park made it even better. It's nice to get away from the hustle and bustle."], ["Reviewed 1 week ago", 5.0, "Large and Well Maintained", "I live in NYC and this park definitely put Central Park to shame in terms of size and activities offered. This is an extremely large, open, and well maintained park with museums and playgrounds. It even has nice little unique things like a Japanese flower garden.\nShow less"], ["Reviewed 1 week ago", 5.0, "Lot's of Activities or Just Relax", "We made the mistake of going here on the \"free\" Calif Academy of Science day - kind of overrun by the hoards of people since it is normally a pricey place to visit. Great place regardless."], ["Reviewed 1 week ago", 4.0, "Yeah house", "The Japanese tea house and gardens are a trip to Japan without leaving San Francisco. Beauty and serenity abound. Commune with nature than head to Haight Ashbury"], ["Reviewed 1 week ago", 5.0, "Huge", "This park needs a day. So much to do and see. It was so green and beautiful. So very large. So many people out with friends, family and pets enjoining this beautiful space. The the time to enjoy it."], ["Reviewed 2 weeks ago", 4.0, "Huge park, a lovely change from the city!", "Big park, with lakes, picnic tables, toilets, bison and other attractions. Doesn't get 5 stars as many of the extra parts of the park require you to buy tickets to get in e.g. the botanical gardens"], ["Reviewed 2 weeks ago", 3.0, "Quick Visit", "It's a great park. Lots of open space and nice place for a stroll. Everything in here costs money! Unless you are a Art/Museum buff and really want to take it in then maybe it's not the ideal tourist attraction."], ["Reviewed 2 weeks ago", 5.0, "Fabulous few hours", "We hired bikes from Bay City Bikes just a short distance from the park along Haight Street.\nWe spent about 4 hours exploring the park by bike.\nWe visited most of the main sights including: National AIDS Memorial Grove, Japanese Tea Garden, Stow Lake, Bison Paddock, Dutch Windmill, Conservatory of Flowers & Ocean Beach.\nMake sure you stop off at the de Young Museum where you can go to their 9th floor observatory for free & see 360 degree panoramic views.\nWe stopped for lunch at the Cafe by Stow Lake, great food & reasonable prices, even had vegan options.\nYou could easily spend all day here. There were great cycle paths & not too many hills! Would definitely go back.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Very cool", "It’s a must to just tour the area lots of sight seeing in this location!! Make sure you have on walking shoes. It’s also good to rent a bike !!"], ["Reviewed 2 weeks ago", 5.0, "Very relaxing and family friendly", "Nice place to get away from the inner city and relax. Great for families and lots of trails for jogging or exercise."], ["Reviewed 2 weeks ago", 5.0, "Fun for everyone", "There are so many endless things to do and enjoy at this park, I frequent it often either alone or with friends, it's full of life and perfect for a picnic, photos, riding bicycles, and so much more. Gorgeous and clean."], ["Reviewed 2 weeks ago", 5.0, "Hidden Gem in San Francisco", "We spend Sunday here - watched the runners finish the half marathon, saw the windmill, walked to the ocean, used restrooms at Beach Cafe, looked at diorama of the park, saw another windmill, walked/drove to Stow Lake for lunch, paddle boated around the lake, drove to the carousel and playground. Lots of fun, memories, and outdoor time with beautiful scenery. Didn't have time to do the museums - will have to do that next visit.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Something for Everyone", "The park has everything from the DeYoung Museum of Art to the Academy of Science to the Conservatory of Flowers. There is a lagoon with ducks and even a pasture with a herd of bison."], ["Reviewed 2 weeks ago", 5.0, "Great place to relax!", "Great place to relax, view the wonderful flower garden and take great pictures! Really enjoyed the serene atmosphere and low crowd level. It's close to the Golden Gate Bridge, so you may want to head to Golden Gate Park, afterward! Especially at sunset!"], ["Reviewed 2 weeks ago", 4.0, "Walking tour of the Japanese Tea Garden and Botanical Garden", "The Japanese Tea Garden and Botanical Garden in the Golden Gate Park are both fantastic to see. Both places smelled amazing as both flowers and trees had some new blooms and were absolutely amazing to view. Wear some comfortable walking shoes and soak in the sun on a nice warm sunny day!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Huge park lots to see", "Very large park with lots to see inside and lots of nice green space. We didn’t make it through the whole park but you could spend a long time doing it. The windmills near the beach are very neat. Cliff House is just down the road.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Always crowded, but so worth it!", "This park is always crowded with tourists wanting to have their photos of the famous Golden Gate Bridge, but it's so worth the wait for a parking spot. You can't possibly leave San Francisco without a stop here. All FREE!!!"], ["Reviewed 2 weeks ago", 5.0, "Beautiful and love watching the cable cars turn", "Got to see the cable cars turn and then walked into the park more. Sat on a bench and just enjoyed the view! They even had vendors out! It’s quiet and serene. Even got a pic of hubby standing in front of the Ghirardelli sign. A must stop on a waking adventure in SF!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "LOVE in SF", "I so very much love this park!\n\nWander around, visit the bison herd, stroll around the various lakes, explore the California Academy of Sciences and the de Young Art Museum, go through the Botanical Gardens, find peace in the Japanese Tea Garden, walk through forested areas, hang out on hippie hill, play in the playgrounds, ride the carousel, smell the flowers, quote Shakespeare in Shakespeare Garden, watch soccer, row your boat on Stow Lake, examine the statues, watch lawn bowling, catch a concert, check out the windmills, lay on the grass and watch the fog or clouds go by ...\nShow less"], ["Reviewed 2 weeks ago", 4.0, "An enjoyable walk from the sea to the hills.", "Plenty to see and enjoy. Disappointed by so few Bison. Paths we'll laid out and signposted.The museum and gallery were great to experience."], ["Reviewed 2 weeks ago", 5.0, "Beautiful gardens", "Strolled around before a drive to Mendocino, had a great afternoon enjoying the park and all the gardens"], ["Reviewed 2 weeks ago", 5.0, "Must visit spot in San Francisco - Make a day of it!", "There is so much to see and do in Golden Gate Park. It is so huge that you could spend hours here.\n\nThe Japanese Tea Garden is beautiful, but does have a fee to enter. Have tea or a meal in the cafe within the garden to make the most of it.\n\nWe rented bicycles from a stand near the Music Concourse and rode through the park all the way to the ocean where we were able to see some whales spouting.\n\nI recommend the bike rental if you want to see a lot of the park since it is so spread out it would be hard to walk it all.\n\nIf you want to hit the highlights - Stow lake and the rose garden are classic stops, and you must see the windmill.\n\nOr, just pick a nice spot, spread a blanket and relax for a while!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful park and gardens overlooking the ocean", "Beautiful green area with lots of hiking trails. Great for dog walking. The Kew Gardens replica is amazing with lots of beautiful plants. Stunning views of the Golden Gate Bridge and ocean."], ["Reviewed 3 weeks ago", 5.0, "A haven of fresh air in the heart of San Francisco", "A wonderful day to spend a day or more enjoying nature with marvelous flowers, lakes and the unbelievable scent of eucalyptus as you go through it. If the weather is not good, you may stop in at the DeYoung museum or the Science Centre or just go all the way to the ocean beach and look at the windmills.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Lungs of San Francisco", "One of the best parks in the USA, fantastic design. This is a huge park and is full of all sorts of things, museums, lakes, arboretum, kids' areas, horse riding, and even some buffalos and windmills! Focus on what you like the best. Can be very foggy.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wonderful park, so many things to do", "Stretching from mid San Francisco at the panhandle to the Pacific Ocean is an iconic park with so much to offer. Home of the aquarium, deYoung museum, Japanese tea garden, Bison corral, running/biking paths, botanical gardens, and open grassy fields. Even being in a crowded city like San Francisco, GG Park never feels that way. You can always find peace and tranquility. The SF marathon and Bay to Breakers run through the park. Parking is free.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Idyllic Huge Beautiful Park", "GGP is one of the reasons I live in this city. It’s full of natural wonders. There are endless surprises, gifts and secrets to come upon. It’s simply magical. On Sundays, they close off JFK Dr. to cars and you can bike, walk, skate in the middle of the street, stop to watch or join the skate dancers at 6th Ave or continue a few blocks to Lindy in The Park, where there is a free swing dance lesson every Sun at noon. It’s pure joy!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing Park", "From the Dutch Windmills to the Japanese Gardens to the disc golf course to the botanical gardens, this park has plenty to do whether you stay 30 minutes or all day. There were quiet forest trails and open meadows and anything else you'd want in a park.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great spot", "Great place for a picnic or for kids to play. Also a great location for viewing fleet week. It was a less crowded area than fisherman’s wharf and has an equally good view."], ["Reviewed 4 weeks ago", 4.0, "Beautiful park", "We came early to play in men's league baseball game, so the parking was easy in the parking garage and on-street at the garden. One field at the complex had players and umps dressed in old time baseball gear using old time bats and gloves. Unfortunately, later we had an injury needing an ambulance which came down the hill to the field. The traffic was horrific and it took us a good deal of time to get to the ER at nearby UCSF Hospital. We did have a chance to stroll the Botanical Gardens and would love to go back under different circumstances\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful park!", "We spent hours walking through here on a sunny, cool day. There are so many places within the park to stop and check out. The park itself is well maintained, has lots of areas to sit and take a break, and plenty of signs updating you where you are. You could easily spend a day here or just walk in for a quiet break from city bustle.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "San Francisco's Green Gem", "1017 acres, the largest man-made park in the United States. What a gem! It has just about everything: two windmills, a bison paddock, a botanical garden, several lakes, a music concourse, the oldest public Japanese Tea Garden in the United States, one of the oldest wood and glass conservatories (built in 1879, and survived the 1906 earthquake), a world class art museum (the De Young), a planetarium, laserium, natural history museum, rain forest and aquarium all under one roof (the California Academy of Sciences), and so much more. It's hard to believe that prior to 1869, there was nothing here but sand dunes and fleas, but it's true. Many thanks to park superintendents' William Hammond Hall, the \"father\" of Golden Gate Park for creating this wonderful park, and also to John McLaren, the \"Godfather.\" Come to this green gem and enjoy it all year long!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "You need a whole day!", "This big,beautiful, gorgeous gem is the perfect representation of the fabulous city. There are gardens, museums, buffalo (!) windmills, big open green spaces and history - the site of the 1967 Human Be-In. We didn't have nearly enough time to explore everything, Maybe you need more than one day, but we'll def be back!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Awesome City Park", "It is a great recreation area and you could spend hours in the park. There are many nice trails and lots to do. This time I have chosen the later afternoon for a visit and went in from Ocean Beach to see Murphy Windmill, the Bison Paddock and walk a bit on natural trails. Before sunset it was a fantastic time to go to the Bison’s. It was feeding time and they moved a bit around. To walk on the trails at this time was great. There were not a lot of visitors anymore and I could enjoy the silence and had the luck to see my first raccoon, some squirrels and more. Don’t miss the Golden Gate Park.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Stowe Lake", "Many fond memories of picnics and Row boating at the lake in GG park. The area still does not disappoint. Take a rowboat or paddle boat out for an hour and do a loop around the island. See pagoda and waterfalls. Concession stand has limited menu so consider a picnic at the boat dock. The yellow jackets are docile and will leave you alone lol. A classic SF afternoon. Stroll over to the tea garden if not too late. Be prepared to walk if you take Muni. 44 from Forrest Hill KLM lines will save a long walk to the N Judah.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Morning run", "Lovely location for a run to the Pacific. Much to see, but some traffic from cars Best on sundays I recomend"], ["Reviewed January 22, 2018", 4.0, "It Would Take Days", "Even though it was raining and we spent little time outside of the tour bus, I can tell we could spend several days here. I can only imagine what the park looks like in the spring. So much to do and see."], ["Reviewed January 22, 2018", 5.0, "great place", "there is something for everyone in Golden Gate Park. Food, museums, gardens, music, field, trails, You name it. Great for all ages and abilities."], ["Reviewed January 22, 2018", 5.0, "Even nicer on Car Free Days", "Easy access to restaurants and coffee and snacks, lots of space to walk and be alone. We hoofed it down to see the Bisons as well."], ["Reviewed January 21, 2018", 4.0, "Wow - just do it", "The park looks big on the map to be sure but its just huge. Take your time and be sure to check out the Japanese Tea Gardens and the Science museum. I think I spent about 3 hours there and barely saw a 1/3 of it.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Beautiful Park", "Golden Gate Park needs to be on your must visit list when you're in San Francisco. It's very large, with many things to see and do. At the very least take a walk in some part of the park."], ["Reviewed January 21, 2018", 4.0, "For when you have more time", "Choosing how to spend your time in SFO is difficult enough, however if you do have time, stop by and take in the fresh air and the surrounding beauty."], ["Reviewed January 20, 2018", 5.0, "Huge park", "Beautiful large park. Golf, art museum, Presidio, and gardens, and views of Golden Gate and city. Nearby shops and restaurants."], ["Reviewed January 20, 2018", 4.0, "Colosssal", "Don't make the same mistake as me with Golden Gate Park! I went there at the end of my day in Haight Ashbury and really didn't leave anywhere near enough time to take any of it in before dusk fell. It;'s HUGE and there's an awful lot to see. I had a bit of an aimless wander around before I walked along the perimeter a short way and caught a trolly to Ocean Beach so at the least I saw the length of one edge of it. It stretches for miles!\n\nBe prepared - make a day of it, if you're interested. It's not an add-on to another activity!!\nShow less"], ["Reviewed January 19, 2018", 5.0, "Gigantic, gorgeous green space great for jogs, hikes, many activities & sights", "This is a wonderful park in constant use by residents as well as a draw for tourist longing for some physical activity in a lovely setting. It's so large that it never seems crowded under normal circumstances. I understand they sometimes have concerts here and we observed many joggers, bikers, archers & soccer players among many activities on a normal day.\nShow less"], ["Reviewed January 17, 2018", 5.0, "The park with everything", "GG park has something for everyone! From the Japanese gardens to a great play area for children and everything in between! We love visiting the park when in San Francisco."], ["Reviewed January 17, 2018", 5.0, "Lovely park", "Awesome man made Park. The story behind its creation is fascinating. Lots to see here. From disc golf to flowers to statues."], ["Reviewed January 17, 2018", 4.0, "Strawberry Hill Boats", "When I used to live in San Fran we went to the Strawberry Hill to rent boats and paddled around it. It was super fun."], ["Reviewed January 14, 2018", 5.0, "Beautiful Park", "We went here one of our last days in the city, and it was beautiful. My daughter loved the carousel, and loved playing on the playground that’s right next door. You can rent bikes here, all day I believe. Great little place to spend some time.\nShow less"], ["Reviewed January 13, 2018", 1.0, "Hostile, argumenttive bicycle vendor", "This park might be worth going to if you stay away from the bicycle vendor at the foot of the park, who chased me down after I decided I did not want to rent two bikes after all. He started screaming at me that I can't have the \"contract\" I filled out, that the piece of paper was his \"property\" even though he gave it to me. He totally ruined a sunny day. Please rent bikes up the street, near the corner of Haight and Ashbury. Don't let a hostile vendor ruin your vacation.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Great place to relax", "The Golden Gate park is bigger than Central Park in New York, so you can spend hours walking, biking and at the end enjoying the beach. There is so much to see and discover."], ["Reviewed January 11, 2018", 5.0, "Amazing", "A lot of thing to see, absolutely gorgeous. The Japanese garden is so relaxing and genuinely tranquil."], ["Reviewed January 11, 2018", 3.0, "Beautiful grounds", "The park houses numerous great venues / things to do but we just toured around and enjoyed the grounds. Apparently the area was all but sand dunes just over 100years ago. A very nice job of reclaiming the land and creating a green space for the city.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Whole day activity", "It’s massive and there is loads to do here, we got a bike to ride round that allowed us to see more things, it’s hard work but it’s worth it!"], ["Reviewed January 10, 2018", 5.0, "WONDERFUL Place.", "Huge variety of things to do, in a beautiful place. Free to expensive. Golden Gate Park is an amazing piece of land cutting right through San Francisco. It stretches from the shore where you can visit the ancient Dutch style windmills that originally provided water for the park, to far into the city with great play areas for kids and Keisar Stadium. Also BUFFALO, an amazing arboretum and just amazing walks and drives. In the middle is the California Academy of Science - a spectacular natural history museum, and the De Young Museum, as wonderful art museum. Right next to the De Young is the Chinese Tea Gardens. The museums and the tea gardens have an admission fee, but they are well worth it.\nShow less"], ["Reviewed January 9, 2018", 4.0, "A superb visit", "We had a grand time relaxing at the park today. What a fun way to wind down at the end of our trip. Must visit again!"], ["Reviewed January 7, 2018", 5.0, "Family holiday", "We visited golden gate park as part of a tour so didnt get a huge amount of time here. I can say the park was stunning and if we had longer would love to have walked around more. I would definately do this if i revisit san fran.\nShow less"], ["Reviewed January 6, 2018", 4.0, "One of the iconic places of the USA.", "The view was astounding. the experience was traumatic . The trails around the park to see the bridge lacked the needed security for small children , lacked proper directions, poor parking spaces and too far away. The line to cross the bridge were about 2 hours for just to cross it walking. The view is astounding !!!!! If you are planning to cross it in bicycle be prepared to cross it on foot due to the amount of people walking on it. Nevertheless, the experience is valuable for all in the family !\nShow less"], ["Reviewed January 6, 2018", 5.0, "Enjoy and Relax", "After lots of sight seeing in the city, my family always enjoys a relaxing day at this park. There are lots of museums here, but we have found them overpriced. When our kids were younger ,we loved renting a family bike to explore the park and spending time at the carousel. Another activities we enjoy is renting a boat and rowing along on one of the small lakes. This year, given that our kids are teens now, we rented Segways and explored the park. It was amazing and a MUST Do! We rode across the whole park, stopped to enjoy the Bison and windmills, as well as the ocean view! We rented the segways on our own time, not a tour. Well worth it!\nShow less"], ["Reviewed January 6, 2018", 5.0, "Great Park , Bay views , the best Golden Gate views", "Make sure you wear comfortable shoes and pants. It takes 1 to 2 hours, and you need to move to the area, but really worths . Highly recommended"], ["Reviewed January 5, 2018", 5.0, "Huge recreational park", "Golden Gate Park is virtually next door to the Haight-Ashbury area and not too far from Twin Peaks.\n\nIt covers an area of around 1,017 acres with beautiful gardens, playgrounds for children, lakes, picnic areas, and trails for walking.\n\nA great green area to see when visiting San Francisco.\nShow less"], ["Reviewed January 5, 2018", 5.0, "There's so much to do", "There are a lot to do there, and every attraction on site is extremely pretty. Do yourself a favor and get a city pass, and you'd get to visit gardens and museums for free."], ["Reviewed January 4, 2018", 5.0, "Plenty to do in this grand park", "Thank goodness we happened to visit on a holiday so we could take advantage of the free shuttle, as it's 4 miles end-to-end! City maps greatly truncate the area which would take 2 hours to traverse on foot. Playgrounds and gardens abound in a carefully crated outdoor public space excellent for biking and picnics.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Sunny day at GGP", "Definitely worth a visit. We walked around the park on a nice sunny day, ate a hot dog, tried to find bike rentals (could not find, but sure they are there somewhere), climbed the tower at the DeYoung museum and took in fantastic views, gazed in fascination at the living roof of the museum of science across DeYoung, walked through the hyped Japanese garden (not the season for it) and you have to pay (but cute enough). Much fun was had.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Scenic Park", "Visited Golden Gate Park after my visit to Pier 39, the park is a more relaxing and peaceful spot to have a rest and enjoy the scenic view of San Francisco Bay. When the weather is clear, the park will be a great place to have a picnic at.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Conservatory of Flowers Light Show", "Last night we went to view the light show that was displaying onto the exterior of the Conservatory of Flowers building at Golden Gate Park. It was a spectacular mesmerizing show of colorful lights, graphic displays including huge flowers, forest-like ambiance, among other delights . It was nice just to sit on the bench and watch the whimsical effects. It captures the essence of our wonderful park. It begins at sundown during this holiday season so catch it while it’s still around. One should admire it both from the path at a distance, and then walk up to it. Btw, classical music accompanies the light show. What a rare treat on an evening out in our great city!\nShow less"], ["Reviewed January 3, 2018", 5.0, "really pretty", "we took a bike ride around a part of the park because it's too big to go all around it. we stopped on some of the grass and let our daughter roam around. It's really pretty and the trolley tours there are also quite good."], ["Reviewed January 3, 2018", 5.0, "Wonderful Park- Especially on car-free Sundays!", "Golden Gate park is a great escape from the hustle and bustle of the city-- especially on Sundays when they close the main road that runs to along the northern edge of the park, JFK drive, to cars. It's easy to get lost (in a wonderful way) amongst the trails in the park. One minute you're walking by the conservatory of flowers, next things you've found yourself in a little peace garden. There's plenty to do from leisurely strolls and taking your time enjoying the gardens, to exploring the Academy of Sciences or the De Young Museum.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Something for everyone at Golden Gate Park", "From the De Young Museum to the hall of Science, to the botanical gardens, to the Japanese Tea Garden, there is something everyone will enjoy when visiting the world famous Golden Gate Park. There are so many hiking tails, azaleas, lakes and ponds also. Have a great day exploring this beautiful oasis.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Full Day Visit", "This park is simply unbelievable! I think its one of the most intriguing places in SF. So much to visit and take in."], ["Reviewed January 2, 2018", 5.0, "Incredible place", "So much to see, there were so many different things going on at the park. The park has so many different climates all in one place."], ["Reviewed January 2, 2018", 2.0, "Nice Park, But Actual Attractions are Expensive", "We went to the park for the purpose of seeing the Japanese Gardens. Although the gardens are quite pretty, they are very small and crowded with people. Plus, the price of admission was quite high. Didn't feel worth it. And didn't go to any other attractions in the park because they are all costly. Otherwise, one can stroll around the free, open areas of the park, which are certainly nice but not terribly noteworthy per se.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Something for everyone!", "There is a lot to see and do in the Golden Gate Park. You can visit museums (de Young or CA Academy of Sciences), the Japanese Tea Garden, the Botanical Garden or you can just drive/bike or walk through the park. The park has several playgrounds, huge areas for events, two very large windmills, a bison area (yes, bison), a waterfall (at least at certain times of the year) and several ponds/lakes. Even if you don't have time to stop, it is worth just driving through and looking at the beautiful scenery. The only downside of the park is finding parking near the top tourist sites. You may want to arrive early and/or consider taking public transportation. We saw a Golden Gate Shuttle bus, but I didn't ask where it stops.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Pretty", "Great park, lots of green, trails, bikes, a great way to spend a day. You can walk up to the bridge or the gift shop."], ["Reviewed December 31, 2017", 4.0, "So much to see!", "The park is enormous and is apparently the 5th most visited national park in the U.S.. the grounds are very well maintained and I would give this attraction 5 stars if the activities were not so overpriced. I suppose it would be ok to spend $50 per person on a science museum if you're gonna be there all day, but alas we opted for the flower conservatory at $9 and were in and out in an hour or so. Still a wonderful experience and so much to see.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Beautiful", "Absolutely beautiful. Wear running shoes and enjoy the scenery. I highly recommend going to the Japanese gardens. Grab a coffee and enjoy the beauty that sits in a crazy city. Hard to believe!"], ["Reviewed December 30, 2017", 4.0, "Nothing outstanding", "The park outside is good but nothing outstanding. The flower garden is minimum, may be due to climate"], ["Reviewed December 30, 2017", 4.0, "Get away from the people!", "There are so many trails and hidden places in this park you can get away from the bustle of the city. We walked this from east to west and it is a very long park. Not a scenic as Central Park but more rustic and a true park. Very glad we made the walk. The pan handle at the beginning may have been my favorite part.\nShow less"], ["Reviewed December 29, 2017", 5.0, "There really is something for everyone!", "Golden Gate Park houses many of the attractions that helped make San Francisco such an endearing city. The Conservatory houses a fabulous tropical collection of plants. There are several other museums as well within walking distance of the Conservatory, some more affordable than others, so plan ahead.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Review based on drive through", "Absolutely gutted didn’t get to do a full tour of this park especially disappointed we missed the gardens. There was so much we had planned to see here but we were concerned about returning our hire vehicle on time so just drove through. Did get to see a few monuments & the bison. Definitely on the list if we return.\nShow less"], ["Reviewed December 28, 2017", 2.0, "Allot of walking.", "Its is soo long that it takes 10minutes by car to drive from end to end. We were pretty tired after walking all this way. Won't do it again tho"], ["Reviewed December 27, 2017", 5.0, "My favorite park in the world for its variety both in biodiversity and for human diversity. I used to live nearby. ❤️SF", "Best part of San Francisco in my opinion is Golden Gate Park. Swing dancing on Sundays and music festivals in the summer make this place my favorite destination to bring out of towners."], ["Reviewed December 26, 2017", 5.0, "Very nice and calm", "The park has a lot to offer. We visited the museum and found it very interesting. If in the area I would say worth the visit. Great place for a family with children ."], ["Reviewed December 26, 2017", 3.0, "Lovely park but fournd it difficult to find my way around", "It was going to be a highlight walking through the park but I found it very difficult to find my way around and after walking in circles for a couple of hours I gave up. I did enjoy the area I covered. One disappointing thing was that you had to pay to enter most named sites such as the botanical gardens and tea gardens even though my guides made no mention of it. I think this more a park for the locals to enjoy or visitors to particular attractions.\nShow less"], ["Reviewed December 25, 2017", 4.0, "Beautiful park", "Nice park for a quiet walk. Lots of little food cars and a Japanese tea place in the Japanese garden."], ["Reviewed December 23, 2017", 5.0, "Segway tour", "We had an excellent Segway tour of Golden Gate Park. It was our first time on Segways and the lesson was easy to grasp. The tour took us all around the park. Guide took pictures and took our camera to take pictures. He was very knowledgeable about the Park and it’s rich history. We recommend this to everyone.\nShow less"], ["Reviewed December 22, 2017", 5.0, "History of 60’s rock and roll played out in Golden Gate Park.", "History of 60’s rock and roll played out in Golden Gate Park. Others think of the gardens and museums, which are fantastic. I walk the park and think of what was rather than what is. Janis, Jimmy, and the Grateful Dead. Love ins and the free kitchen. Yippies before yuppies. It remains a wonderful open space that is walking distance from much of San Francisco.\n\nTerrific place to walk, wander, and create memories.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Beautiful Park", "Golden Gate Park is an extremely beautiful especially after rainfall. My favorite part of Golden Gate Park is the Conservatory of flowers which is well-maintained and a great place to take photographs or to have a picnic between the flowers.\nAnother favorite spot of mine is the De Young museum which hosts some beautiful Exhibitions.\nAnother beautiful place is the large windmill which is located by Ocean Beach. The flowerbeds are well-maintained and a perfect place for young children who want to run around and observe the pretty flowers. The botanical gardens are also a wonderful spot for young children to walk around.\nIt has a pretty pond with a nice array of wildlife for children to observe. The botanical gardens has flowers trees and plants from all of the world. They are cared for by local volunteers as well as the city Workers. Every year they host an open air concert icalled flower piano. Musicians exhibit their music for visitors amongst the flowers\nShow less"], ["Reviewed December 21, 2017", 5.0, "A must", "Having recently returned to SF, I had forgotten how vast and beautiful this park really is. There are so many events and so much to do. Or I've simply gone on a picnic in a wooded secluded area. This park has it all."], ["Reviewed December 21, 2017", 4.0, "Fun! Fun! Fun!", "Golden Gate Park in San Francisco is such a wonderful place to visit! There is a wide variety of things to do, and it is such a great oasis in the middle of a bustling city. Cultural, nature, picnic spots, and clean and safe. Who could ask for more?!\nShow less"], ["Reviewed December 19, 2017", 5.0, "Nice escape from the city", "Peaceful walk and a nice way to escape the city. The Japanese Gardens were nice, though at 9USD per person quite pricey. You can walk al the way to the beach which is a rewarding way to end a nice walk. There are rest rooms throughout the park.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Big Park - Dont Hire the Quad Bicycle", "This is a hug park in the middle of the city with amazing views. We made the mistake of hiring a quad bicycle, that mad for one hilarious hour of our life."], ["Reviewed December 18, 2017", 5.0, "Paradise amid the city", "You should walk along the well kept lawn fields and admire the different points and attractions along this big park. Special attention to the Japanese Tea Garden ( tip: free entrance before 10:00 a.m on wednesdays and fridays)"], ["Reviewed December 17, 2017", 5.0, "It is amazing to find such a peaceful and varied setting in the middle of a huge and bustling metropolis!", "Begin by eating at the Beach Chalet Brewery and Restaurant if this is your first visit. Good food and very interesting building and history. The nice diorama there gives a perspective of the whole park to guide your selection of what to do! Next to the Beach Chalet is the Dutch windmill which is a nice beginning.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Enormous", "This place is huge. Quite frankly, if you want to visit, you would need to allow at least two or three days to see everything properly.\n\nWe tried to squeeze in as much as possible into one day and only really managed to see three attractions.\nShow less"], ["Reviewed December 16, 2017", 4.0, "Beautiful Park to Enjoy right in the Center of San Francisco", "Love walking around this park. There are a few “special parks” within this park, like the Japanese Tea Garden and the Botanical Garden, which have entry fees. We opted not to visit these this time (we have in the past) but simply strolled around the park - for free. We went by several musicians playing instruments along our walk, enjoyed a nice waterfall, perfect for photos. The DeYoung Art Museum and a Science Museum are also right there. If you like, you can even rent bikes or mini-carts (holds 4-5 people) to move around the park if you like.\nShow less"], ["Reviewed December 14, 2017", 4.0, "Centarl Park of SF", "This is a nice park to walk around. The garden, flowers and trees are lovely to explore and you could walk here for hours and just enjoy the peaceful environment. There are restrooms and small streetfood wagons here and there to buy something to eat."], ["Reviewed December 13, 2017", 5.0, "Did You Know?", "Of course there's the Academy of Science, the Japanese Tea Garden, Stow Lake with its paddle boats and the DeYoung Museum . But did you know you there's a Pentanque court near the Buffalo Paddock, opposite 38h Avenue, and that lawn bowlers can enjoy their sport in the west corner of the recreation grounds situated close to Sharon Meadow? Have fun exploring the nooks and crannies of this gorgeous oasis in the middle of a very busy city.\nShow less"], ["Reviewed December 10, 2017", 5.0, "great place for a walk to enjoy the spectacular views", "there is lots to do in the park - one can visit the Presedio (old military establishment) or one of the museums or just walk around and enjoy the scenery"], ["Reviewed December 10, 2017", 5.0, "Fun park, good views", "This made for some great hiking and scenery. Parking is tough but I thought it was worth the wait. Definitely walk down to the pools."], ["Reviewed December 10, 2017", 4.0, "Reminds me of NY Central Park", "Dog friendly park. The overall park is free but the Japanese Tea Garden has an entrance test fee and does not allow pet. :( But the park is big enough so we there are plenty to do."], ["Reviewed December 8, 2017", 5.0, "One of the most amazing public nature spaces in the World", "I love Golden Gate Park. Hike the walkways through forest and meadows. More exhibit areas than you can see in a day. The natural beauty is awe inspiring. The down side, as a visitor you aren't usually accustomed to the many homeless who are camped in the bushes. Stay on paths. You will be approached by drug dealers, Just Say No! It is sad commentary of modern urban life. Don't let it distract you for the awesome beauty of this national treasure.\nShow less"], ["Reviewed December 8, 2017", 4.0, "Nice, but can not tell this is the \"Must see\" place", "I have been there on November, this park looks exactly like I thought, palm trees, jogging people, people with dogs."], ["Reviewed December 4, 2017", 5.0, "Lovely to visit", "A perfect place to spend an hour or two whether you're interested in planting plans or exotic species. Nicely laid out and easy to navigate throughout the park."], ["Reviewed December 3, 2017", 5.0, "amazing oasis", "An amazing park\nLarger than Central Park in New York\nThe park has an amazing array of activities\nmuseums, polo field, bison, botanical garden, soccer fields, pony stables and even fly fishing ponds with its own \"Anglers Lodge\"\nJust an amazing oasis in the middle of the city\nNot only that, when you get to the end of the park you are at the Pacific Ocean\nShow less"], ["Reviewed December 3, 2017", 5.0, "Always so lovely.", "This was a very busy sunny weekend day that I visited the Botanical Gardens. Parking took a couple of passes until we sevured a slot, but it's free and it can be had with a little patience. Highly recommend!"], ["Reviewed December 3, 2017", 5.0, "Still some grooviness left in San Francisco.", "If there is any 60's soul left in San Francisco, then I reckon you can find some of it here. It could be the community of homeless people living around the park, or the occasionally free festivals that still capture the spirit of free love and oneness with the earth. Whatever it is, there's a reason those things feel different in this park.\nShow less"], ["Reviewed December 1, 2017", 5.0, "A Must See", "Anyone traveling to San Francisco must visit Golden Gate Park. The park has so many attractions to see, but especially the DeYoung museum. A wonderful park to stroll and take in all the wonderful sights. Get a map of the park and wear comfortable footwear for strolling.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Beautiful place to stroll in San Francisco", "My family spent a beautiful, sunny afternoon walking through Golden Gate Park in San Francisco over the Thanksgiving Day weekend. We started from Oak Street on the Eastern end and strolled through about one-half of the park for about 2 1/2 hours. The park is beautiful, with interesting flora throughout. There are all kinds of paths to take that are all well marked. There are gardens, a beautiful observatory, lakes (with peddle boat rentals), ponds, museums and a Japanese tea garden. It's a truly beautiful park. I can't wait to explore the Western half, but that will have to wait our next trip to SF.\nShow less"], ["Reviewed November 29, 2017", 5.0, "Beautiful area to just take a walk , picnic or ride your bike", "Just a wonderful spot to take a long walk or have a picnic or ride your bicycle with friends and sightsee. The area is pristine and clean with lots of great views and tourists walking and riding everywhere, Lots of space so you don't feel crowded\nShow less"], ["Reviewed November 28, 2017", 2.0, "Not great", "The Golden Gate Park is really big and I walked around it for a couple of hours but it wasn’t anything special. There’s a lot of greenery and memorials/displays there but unless you just want to walk around for a few hours with not much going on, it’s not worth the visit.\nShow less"], ["Reviewed November 28, 2017", 5.0, "A centrally located oasis of playgrounds, trees and grass", "Well worth a visit strolling along the park paths, including the Botanical Gardens and Japanese Tea Garden."], ["Reviewed November 26, 2017", 5.0, "Busy Place", "Took awhile to get a place to park, but lots of things to do at this location. We visited the Science Museum, had lunch, and toured the Japanese Garden. A great way to spend a day in sunny San Francisco."], ["Reviewed November 25, 2017", 5.0, "Beautiful Park- Stunning views", "We did the Golden Gate Park Segway Tour. My girls and I were scared at first but our instructor Bryan was the greatest. We all received a tutorial and time to practice before going out in the park. He took us all around the park and we learned so much of its history. This tour was the highlight of my daughters' vacation. I would recommend the tour for all adventurers.\nShow less"], ["Reviewed November 24, 2017", 5.0, "A beautiful park in San Francisco", "My wife and I walked Part of this park after visiting the de Young. It was beautiful, and we felt very safe. As it got dark, we encountered a few groups of homeless people calling out to passers by, but that is to be expected. Loved seeing all the people out exercising, strolling, and walking their dogs!\nShow less"], ["Reviewed November 23, 2017", 5.0, "Full of Options!", "Contrary to its name, Golden Gate Park does not actually have any views of the Golden Gate Bridge (unless you take the elevator to the 9th floor observatory in the DeWolf Museum..no entry fee required). It does have PLENTY of options for single folks, couples or families with children. The Academy of Sciences was where I spent most of my day and it was fantastic. I also did the 9th floor observatory at the art museum but I did not pay to enter the museum itself. The Japanese Tea Garden was exquisite - photograph opportunities around every bend. Also, the botanical gardens, while not in bloom, were peaceful and refreshing. Sadly, the ONE thing I missed was the white building shown in this photo - which is NOT part of the botanical garden. I ran out of time.\nIt is worth noting that EACH attraction has it's own entrance fee. The Academy of Sciences and the DeWolf Museum are the most expensive (about $35/person each). The botanical garden and the tea room are about $7 or $9 each.\nShow less"], ["Reviewed November 22, 2017", 5.0, "Beautiful", "A huge beautiful park close to the Golden Gate Bridge. Lots to do here. Plenty of trails. Watch the swans/ducks in the pond or have a picnic in one of the many shaded areas"], ["Reviewed November 22, 2017", 5.0, "Golden Gate Park", "A day trip to Golden Gate Park is a great way to see one of San Francisco’s most beautiful outdoor attractions.\nThe GG Park is quite a bit larger than Central Park in New York so give yourself plenty of time if you want to get a true flavor of this wonderful natural resource. Your first stop should be to the California Academy of Sciences and the nearby De Young Museum, both well worth a visit and you can get discounted tickets if you arrive my MUNI bus (take a #5 bus from Market Street and get off at 8th Avenue and Fulton.)\nFrom there there are cafes beautiful lawns, the Japanese tea gardens, Stowe lake is a 20 minute walk.\nThere is so much more to see, the beaches and restaurants on the beach to mention just two.\nGo and check it out, you won’t be disappointed.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Great park for a run in middle of city.", "Went for run twice in GG park while in SF. Beautiful scenery, great paths and trails but easy to get lost! Lots of friendly people to ask directions though."], ["Reviewed November 21, 2017", 5.0, "Great park", "There's tons to do and lots of attractions from museums to varied gardens. Really had a great day there"], ["Reviewed November 20, 2017", 5.0, "My Favorite Way to Spend A Day in San Francisco", "This is probably my favorite city park in the United States because of its variety and the quality of its museums and horticultural variety. My favorite activity was the time spent in the Botanical Garden, including the prehistoric plants and the fragrance garden. Every aspect, even in November, was fulfilling.\nShow less"], ["Reviewed November 18, 2017", 4.0, "Golden Gate Park is a must visit place in San Francisco", "If you find yourself in San Francisco you must visit the Golden Gate Park as there are many things to see. The walking around is nice in itself. we visited the japanese tea garden and really enjoyed the history. There are plenty of things to do at the park and nice to just walk around and get lost for 4 hrs or so. Just be careful where you park as there have been break ins.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Nice area, lots to see and do", "You can walk around or take their shuttle bus, visit the Botanical Garden or California Academy of Science or..."], ["Reviewed November 18, 2017", 5.0, "Beautiful!", "So I am not a huge fan of parks but I am definitely recommending visiting this one. I don't know if it was because I was lucky enough to visit SF when there was no fog or rain but I really enjoyed walking around the park. It is huge (so be prepared for a LOT of walking) but there are some really cool things to see and do.\nShow less"], ["Reviewed November 17, 2017", 5.0, "A Fine Jewel in a City Of Jewels", "An amazing amazing park filled with splendid beauty, art, flowers, trails, paths and people!\n\nWe’re serious runners and I’ve been running here for years when visiting the city - coming from Colorado -still each time I’m reminded how amazing this piece of nature is.\nSolo, couple, families, whomever - get outside and go.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Family", "Visited tea garden and botanical gardens\n. Flew to San Francisco from Laguna for a quick visit. Arrived Monday afternoon at 1pm. Stayed at hotel zephyr. Checked out the city via street cars Monday afternoon. Hotel is right on fishermans wharf at pier 39. Lots of shops and tour places. Hotel is nice but doesn't have any restaurant. It does have a food truck in yard and microwave and fridge in room and coffee maker. Hotel has lots of places to lounge , game room, fire pits in yard with seating areas. Concierge is very good and can make arrangements for anything you need. Took tour of Muir Woods to see redwoods and Sausalito Tuesday, alcatraz Wednesday , golden gate park Tuesday.\n\nShow less"], ["Reviewed November 16, 2017", 4.0, "Bison were in yard, Japanese garden beautiful", "We chose a great day to go through this park. I was hoping to see bison grazing but they were in a fenced section like on a farm. The gardens are beautiful though and enjoy the museums and areas."], ["Reviewed November 15, 2017", 5.0, "World-class", "With so little time in San Francisco, we only had around 90mins in which to stroll around part of this fabulous park.\nA wide variety of plantings, borders, nooks & crannies...sports, a museum, wide open spaces...if only we could have spent a whole day there...a lovely vibe, so friendly...\nSo naturally my tip is: research the Park before you go, and prioritise your visit to take in the areas that you are most likely to be interested in...or just stroll around and enjoy the sights and surprises!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Great outdoor relaxation or exercise.", "Beautiful! Nice walking paths. A little annoying the amount of young people passing you either out and out smoking it or reeking of pot smoke.\n\nVisit the model yacht club if it’s open. If not there are likely folks sailing theirs in the little pond.\n\nMany activities but mostly just enjoying God’s creations in lovely outdoor conditions. So great to be somewhere where you can be outside and not sweat your fanny off.\nShow less"], ["Reviewed November 15, 2017", 5.0, "A wonderful oasis of natural slendor within the city", "Hiking through this park is a must while visiting SF. Glorious plants, flowers smiling at you in every corner, and the fresh air coming from the ocean- hard to beat for a city park!"], ["Reviewed November 14, 2017", 5.0, "A 'Must' on tour SF visit", "So much to see here - some of it you have to pay for:\n\nConservatory of Flowers\nJapanese Tea Garden\nSan Francisco Botanical Gardens (free at certain times)\n\nBut the best parts are free, being:\n\nLily Pond\nStow Lake\nStrawberry Hill\nNational Aids Memorial Grove\n\nSo this is a great part of San Francisco in my opinion and you can easily lose yourself for half a day here. (see also my reviews for the above sections)\n\n1975\nShow less"], ["Reviewed November 14, 2017", 5.0, "Loved the park!!", "So many things to do and see here! You can ride bikes in the park, go to all the different attractions in the park, some do cost money but they are worth it. Japanese gardens are amazing. Take a picnic, enjoy the park scenery and go visit one of the attractions. You could be here all day if you wanted. Just go!\nShow less"], ["Reviewed November 14, 2017", 5.0, "You could spend an entire day here!", "This place is a gem. Yes, it is off the beaten path, a serious cab ride from central downtown locations, but so worth it. You can do it all here, but it will cost you, admission fees for each stop (Academy of Science, Art Museum, Botanical Gardens), but you could also have a blast (weather dependent) by renting bikes and touring along well marked paths soaking up the lovely greenery and awesome architecture. A lovely oasis. If you are only choosing one admission, go for the Botanical Gardens, they have a mini Redwood Forest, so if you don't have the time for Muir Woods, you can get your dose here.\nShow less"], ["Reviewed November 13, 2017", 4.0, "A vibrant community park", "We decided to walk from one end of the park to the other, on a sunny day. Along the way we encountered a group from the \"Church of Eight Wheels\" leading an outside roller-skate dance and exercise class that anyone could join in on. After enjoying that for a bit we rented a \"quad\"cycle and the four of us went cycling together, two in the front and two in the back. We had a great afternoon together.\n\nThere are also lots of museums adjoining the park.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Relax in this Beautiful, Big Park", "This is a great place to go if you simply want to get away from the commotion of the city and relax for a bit.\n\nTraveler Tip: This park is BIG so remember landmarks so you don't get lost while exploring.\n\nTraveler Tip: If you enjoy tea gardens this is a Japanese style garden within the park that is nice to see if you enjoy this type of landscape.\n\nTraveler Tip: Order some food to go and bring the food and a blanket to the park if it is a nice day. Set up a picnic for your significant other, family, or by yourself to just relax and enjoy the beauty of SF.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 13, 2017", 5.0, "Beautiful surroundings", "Well worth a visit on a sunny day. Beautiful gardens and places to walk, sit and watch the world go by or grab a coffee. Within the park there is a great hidden Japanese garden which has an amazing tea shop in it that's worth visiting. Quiet expensive to get in though.\n\nThe grounds are huge and have little shade. If you are spending the day, go prepared in the summer for constant heat and sunshine.\n\nThe tour buses pick up and drop off in the park so easy to access.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Vary Large Park with Lots of Attractions", "This is a very large park that will require time and effort to walk from one end to the other. Take a car if you have limited time although traffic seemed to be heavy on internal roads on the day I was there. Mostly a place to do things rather than see things. Sporting fields, golf course, playgrounds etc.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Gem of San Fransisco", "At the end of the day our favorite park in SF. Science museum...DeYoung art gallery...Chinese tea garden. ..get the SF pass at one of the attractions...it will save you money.... includes bridge cruise and cablecar.. etc. Etc."], ["Reviewed November 11, 2017", 5.0, "A little piece of heaven tucked away in SF", "This is great place to visit in SF. You can easily spend an entire day here as the park is that big. You can cycle around or chose to walk around. The California Academy of Science is located inside the park and there is a Japanese tea garden also. It has lovely gardens, walking trails and peddle boats on the pond. Statues are installed all over the park. It has an amazing variety of flora and fauna. You can spend couple of hours here or spend the entire day.\nShow less"], ["Reviewed November 11, 2017", 5.0, "So much to offer", "I have visited this park on two separate occasions on two separate trips to San Francisco, and I'm convinced that I could never see all that it has to offer. It is a truly beautiful spot. We visited the California Museum of Sciences the last time we were there a couple of years ago, and that was spectacular. This most recent time we rented bikes and biked the length of the park down to the beach and back. I will say that it is a tricky bike ride if you are not totally confident on a bike. And also tiring. Would love to see the botanical gardens, Japanese garden, de Young museum, and more on a future visit.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Great park!", "I cycled around this park and would thoroughly recommend it. Tonnes to see, including the bison. Very easy to cycle. A lot bigger than it looks on the map but took me about 40 mins to go from East to west with stops."], ["Reviewed November 10, 2017", 5.0, "LOTS TO DO FOR ALL THE FAMILY", "Well worth a day out there is so much to do , please visit the California Academy of sciences and the lovely Japanese tea garden and enjoy a cup of tea or a light lunch"], ["Reviewed November 9, 2017", 4.0, "All day activities", "Great pal for bike riding, strolling or jogging. Enjoy sitting and watching the birds or buffalo. Enjoy the musicians who perfect their craft, see Christopher Parker Smith in the tunnel opposite the botanical garden and wait until nightfall for a lovely light show on the building.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Perfect place on a Sunday", "Gardens, walking, polo field , model boats, and of course the peddle boats on the pond make for a spectacular Sunday afternoon.... If it rains, go to the beautiful museums. If it is chilly, stop in the Japanese garden for Tea :)"], ["Reviewed November 9, 2017", 5.0, "Such a large, beautiful park", "There is no way you can see everything this beautiful park has to offer within one day. I recommend coming back at least twice during your stay in SF to really take in all that the park has to offer. There are handy little maps stationed around the park for your convenience\nShow less"], ["Reviewed November 9, 2017", 5.0, "Excellent park with marvellous views", "We visited this excellent well maintained park which is huge with lots of kids playing around from nearby locality & adults resting all over the park. It has variety of flora & fauna."], ["Reviewed November 8, 2017", 5.0, "My Favourite Park", "So much to do and see in this park from Stowe Lake ,the Carousal the gardens the amazing walks and bike tracks this is my favourite park in the U S\nUnlike Central Park N Y there is nobody harrassing you to go on bike tours or sell you things along the way ,just go and have a lovely day in Golden Gate Park something for everyone here\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great Park", "Lots to see and museums to visit. Closed to traffic on Sundays so it's a perfect day to ride a bike. (Lots of bike rentals just outside the park).\n\nDo get out of the park by dusk as it gets very dark with minimal lighting. Mostly homeless folks remain.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Amazing", "When I was there in San francisco, I went for a trip around the bay and crossed under the bridge with a boat and it was amazing to be very close to the bridge"], ["Reviewed November 8, 2017", 5.0, "Lovely", "We spent a morning exploring a small portion of the park, with visits to the Japanese Tea Gardens and de Young Museum. So much to see and do, as this is a huge park. We unfortunately didn't get back to explore more, but definitely on our next visit.\nShow less"], ["Reviewed November 8, 2017", 5.0, "My FAVORITE park in the world", "I lived within a few minutes walk of Golden Gate Park for over 25 years. It was a dream for a city dweller. Quiet, dark and at night, one could see coyotes, raccoons, owls, and foxes running and jumping. During the day, there are endless numbers of places to explore and discover. Stowe Lake, the Hall of Flowers, de Young museum, the Windmills, Strawberry Hill, the Arboretum, The Children's Playground -take a ride on the Carousel!! And, don't miss the buffalo! So much to enjoy\nShow less"], ["Reviewed November 8, 2017", 5.0, "Take your time lots to do", "This is a gorgeous park that is kept in excellent condition, very groomed and clean, we absolutely need more parks like these in San Fran where families can spend an entire day visiting museums and more. We are going to come back soon to do more exploring!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Something for everyone", "This park is not to be missed! Flowers trees birds and BISON,! You can go paddle biking or rowing on StoweLake,Biking all over,wonderful children's playgrounds.Concerts on Sunday at the band shell and sometimes impromptu dancing! Come and enjoy!"], ["Reviewed November 7, 2017", 5.0, "Beautiful park", "This park is spectacular and there are so many things to do there. We underestimated how much time we would need there. We loved the museums and the aquarium and look forward to going again"], ["Reviewed November 7, 2017", 4.0, "Nice park!", "We enjoyed the Japanese Tea Garden and Botanic Gardens. Its a great way to spend a couple of hours! Worth visiting!"], ["Reviewed November 2, 2017", 2.0, "San Francisco has a big homeless problem", "We were happy to walk any where in this town. The biggest problem, the homeless. They are always asking for something. There mental issues are even bigger. All the locals seem to to go with it. Most parks in other states we linger a bit but you can here.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Some many things to do", "There is literally a dozen things to do at this park. Everywhere that you look there is something pretty to look at. Several different little attractions within this park that makes it great. There is also a couple of museums within the boundaries too."], ["Reviewed October 31, 2017", 5.0, "Super park", "Enjoyed strolling up JFK Avenue from the beach all way through to the top. Very relaxing, enjoyed a coffee stop at the museum"], ["Reviewed October 30, 2017", 5.0, "So many things to see and do at the park", "We had been to a picnic in the park on a previous visit and wanted to take our daughter back. We were told about the over 21 tour at the Acadmey of Sciences and this being halloween week, with the theme of Creatures of the NIght we thought this would be fun, we were not disappointed. It was beautiful the visitors were festive and the cash bars added to the festive air. It was so fun sitting under the giant grouper and sharks watching all of the costumes walking by. We then went the next day to the Tea Garden and it was stunningly beautiful. We enjoyed a tea break and the peace and serenity were all over the place. We then walked to the music concourse and a young man was playing his own piano computations which were just lovely accompanied by the SF art guilds displays; I truly recommend anyone with time to spend going to the GG Park\nShow less"], ["Reviewed October 30, 2017", 5.0, "Nature in the middle of the city", "Everyone needs to visit the park, it's absolutely amazing. The gardens and flowers are beautiful. A great place to relax and enjoy a long walk in nature. The Japanese Tea House was our favorite place to visit."], ["Reviewed October 30, 2017", 5.0, "Hours of fun and relaxation", "A beautiful park offering many attractions and quiet spots to relax. The Japanese gardens are lovely activites and band stand absorbing. A great place to have a hired bicycle and safe to tour around. A must with children."], ["Reviewed October 30, 2017", 4.0, "Enjoyable way to spend an afternoon.", "We rented a surry which is a bicycle built for four. Had a great time riding through the park visiting several sites. The park is huge and we only had time for a small portion. There is so much to do and see. The trees and trees are so beautiful. It was a wonderful way to spend an afternoon.\nShow less"], ["Reviewed October 29, 2017", 5.0, "A big park", "Golden State Park is a very large park. There are lots of places to stop and walk of take in activities. Get there early on the weekend if you want to park somewhere specific. If not try the underground parking off the north side of the park. Get place to have a bike.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Lose yourself in Golden Gate Park", "Golden Gate Park is absolutely enchanting - you can easily spend an entire day or more because of the wealth of attractions - art museum, natural history museum, the gardens, biking, boating."], ["Reviewed October 29, 2017", 4.0, "visit park on tour of san francisco", "Lots to do at the park, great walking paths, etc. Highly recommend take the time to at least drive through the park and check out the beach and baths areas.."], ["Reviewed October 29, 2017", 4.0, "Beautiful", "Its great if you have plenty of time to walk around and visit all the beauty. The botanical garden, the Japanese tea garden is great. Walk through the sequoia trees and follow the trail to the windmill."], ["Reviewed October 28, 2017", 5.0, "Conservatory of Flowers", "Great last minute trip to see the plants and a butterfly exhibit. Perfect end to a San Francisco tour! Bought myself a framed butterfly in a gift counter."], ["Reviewed October 27, 2017", 3.0, "Smash and grab epidemic", "We arrived at the park, walked around for 20 minutes and came back to a back smashed window. 7 other cars also had their windows smashed and stuff stolen. We unfortunately had all our stuff in the car because we had checked out of our hotel and we're heading out. We had just this one day in SF and instead spend the rest of the day in a glass repair shop to the tune of $700. The glass repair shop said these thiefs keep them really busy. It was very well orchestrated with 3 cars full.of people and pedestrian look outs. We called the police to fill out a police report but they were too busy to come take our report. Talked to a bunch of locals that stopped to tell us how sorry they were. They said this happens DAILY. that the are not enough police in the area and these thiefs just keep getting away with it. Honestly I have no desire to cover back here anytime soon.\nShow less"], ["Reviewed October 27, 2017", 3.0, "Not Cheap", "Had looked forward to visiting the Park . Was surprised however by the prices being charged to visit the various places in the Park . We were a party of 4 & if we had paid to go in them all it would have been a very expensive day out\nShow less"], ["Reviewed October 27, 2017", 4.0, "Big, beautiful park", "We walked a few hours in this park and we really enjoyed it. There is a lot to see and a lot to do. We definitely will spend more hours in the park when we're travelling to San Francisco again."], ["Reviewed October 26, 2017", 5.0, "We didn't have long enough!", "We only had a couple of hours to spend in the Park and we really wished we had at least half a day to a full day. What we saw in the short time we were there was fantastic. The Japanese Gardens look gorgeous from the entry- we didn't go in as there was an entry fee; the de Young museum looked fantastic, but again didn't get more than a cursory look- building itself is something else! The Academy of Sciences looked awesome and the area between this building the Museum was just lovely to stroll through, complete with people practising Tai Chi. The Conservatory of Flowers was a stunning old building and it's just incredible to think that the Park was all planted across what was a barren area of land- it is really a beautiful place. Great for people of all ages, including children and would be lovely to ride around.\nShow less"], ["Reviewed October 26, 2017", 2.0, "Only thing \"golden\" about Golden Gate Park is golden opportunity for car break-ins.", "I live in San Francisco and often go with my husband to walk from one end of Golden Gate Park to the other (6+miles). On its own merits, the park itself is quite beautiful with its massive Blue Gum Eucalyptus, Monterey pines, redwoods, and Monterey cypress. A cluster of museums offers good exhibits (de Young, California Academy of Sciences) with further pockets of interest like the Japanese Tea Garden and Conservatory of Flowers.\nHowever, the park in recent years has become a magnet for car break-ins.The worst area is along Martin Luther King Drive in close proximity to the de Young museum. Time and time again my husband and I stop to console distraught tourists whose cars have just been broken into (it takes thieves less than 30-seconds handiwork).\nFor insurance purposes (especially for rental cars) we send visitors to the nearby Richmond Police Station at 461 6th Ave. to report the incident. Unfortunately, the police really can't do a lot given the sheer volume of car break-ins throughout the city (plus the fact that the crime itself is considered a \"misdemeanor\").\nWARNING: leave absolutely nothing of value in your car should you visit.\nOther downsides: parking can be difficult and there are limited eating establishments (Beach Chalet at the ocean side of the park is the best but a good distance from the main attractions)\nShow less"], ["Reviewed October 26, 2017", 4.0, "Beautiful", "We were unable to get parking except near the bison. But just the drive though the park was nice. It is a place I will go back to but I will give myself plenty of time to enjoy the park"], ["Reviewed October 25, 2017", 5.0, "Nice place to spend some time", "Recently visited on a Hop on Hop Off tour and I am thrilled we did. Great history and beautiful grounds including the Botanical Gardens, Art Museum and the California Science Museum, a must see! Will definitely come back! Make sure to bring water and a lunch!\nShow less"], ["Reviewed October 25, 2017", 5.0, "Beautiful and huge", "Such a big park. Many drive around the park, yet others cycle like ourselves. It is t big to walk. The hop on and off buses come here.\n\nSo much to do and see. So much happening. Didn't see any bison in the bison paddock. Nice lakes etc.\n\nThe park opens up to the beach and Pacific ocean at one end. Amazing.\nShow less"], ["Reviewed October 25, 2017", 3.0, "A quick visit, seemed a good family space", "We quickly walked through a very small part of Golden Gate Park at the end of our day after Pier 39 and Haight Ashbury. What we saw, the drumming circles, the family events and kids sports happenings were all gorgeous. It's a place I'd love to go and have a picnic when we're back in San Francisco.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Beautiful, large city park", "Aside from its location near the famous bridge, this park appeared to be readily accessible for locals with automobiles as well as tourists like us who arrived by taxi. As we cruised around the park on Segway scooters on a Tuesday morning, there were lots of available parking spaces that I could readily observe.\n\nTourists should know that you won't see the Golden Gate Bridge up close from the side of the park where the museums and popular gardens are. This is a huge park. It's much bigger than New York City's Central Park, for example. A tour is probably a good idea if you want to see many parts of the park, though it would be easy to walk in one section and enjoy a day outdoors on your own.\n\nIt wouldn't have been obvious to me without our Segway tour guide's advice that one can ride up to the De Young Museum's tower without buying a ticket to the museum itself. That's one way to get a glimpse of (just the top of the towers of) the Golden Gate Bridge from the park.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Allow plenty of time to explore Golden Gate Park", "Massive park with lots of different areas to explore.\n\nMy favourite place is the Japanese Garden which offers a lovely respite from the hustle and bustle of the city. It is worth the couple of dollars entrance fee. The Drum Bridge is fascinating although I don't have the sense of balance to walk over it, I did enjoy watching others do so. Not at all keen on the iced green tea though - a bit too genuine for a lightweight tourist like me :-) Try to get a seat overlooking the water for a really calm and serene experience.\n\nOther attractions include a flower conservatory, the science museum, a herd of buffalo and a reputed million trees.\nShow less"], ["Reviewed October 25, 2017", 4.0, "So pretty.", "I would definitely recommend to get the San Francisco city pass. We went to the golden gate park and you get discounts and the book comes with different activities you could visit the museums inside the golden gate park. Overall it’s a must visit."], ["Reviewed October 25, 2017", 5.0, "Favorite place", "You can literally do anything there: from running, concerts, enjoy the sun, play sports, its one of my favorite places in San Francisco."], ["Reviewed October 24, 2017", 5.0, "Visit", "It’s a huge park lots to do and see there like the Japanese tea gardens and the flower exhibitions well worth the vidit"], ["Reviewed October 24, 2017", 5.0, "amazing", "We went to the japanese garden and the science museum.It was really worth watching and we really enjoyed there."], ["Reviewed October 24, 2017", 5.0, "Well worth a visit - get a bike!", "Had a great time bike riding around this huge park and exploring everything it has to offer, from the museum to gardens. It doesn't take long to find yourself completely alone in a big city! Good bike paths and given its size best to hire a bike to get around.\nShow less"], ["Reviewed October 24, 2017", 3.0, "Massive and confusing", "There were places in the park that were like stepping into another place and there was a little something for everyone. While I rated it as average, the size alone is above average. We found it rather confusing and had to constantly search for the maps. We did go to the Chinese Tea Garden and it was very beautiful and peaceful. Not sure I would suggest paying the $18 for two of us again, but it was beautiful. While the park is free, the botanical gardens, conservatory of flowers and museums could cost you a small fortune before all is said and done. As such, that didn’t seem to be park like, other than the proximity. Coming from the Midwest, the “lakes” were more like dirty cement ponds, where again, you could pay to paddle boat and such. Best part of the park for me was seeing people enjoy nature and each other playing tennis, rollerblading and picnicking. The other positive is a lot of free parking all around the park.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Fantastic Views", "Beautiful park that offers fantastic walking routes. The walking routes offers lovely views of the bay.\n\nIf you look closely you can watch the whales in the bay which was amazing.\n\nIf you enjoy photography you can do a lot in this park too.\n\nThis place is decently a must be prepared to spend more than half a day here.\nShow less"], ["Reviewed October 23, 2017", 5.0, "A little something for everyone.", "Golden Gate Park offers a lot. There is the DeYoung Museum, the Academy of Science, the Japanese Tea Garden, the Botantical Garden, the Conservatory of Flowers, the Polo Fields, and Stow Lake.\n\nOne has to decide what to see and do. You can get to the park by public transportation - 5 Fulton or 44 O’Shaunhessy lines. There is a parking garage off of Fulton under and nearby the DeYoung Museum.\n\nHave fun and enjoy the park.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Such a vibrant park, so much to see and do!", "Our hotel was right on the edge of the park, and in a matter of minutes we were experiencing a carousel, soccer players, the conservatory, succulents gardens, lawn bowling, an art show and basic park activities."], ["Reviewed October 23, 2017", 5.0, "Awesome.", "This will be a very short review so I'll get to it. Golden gate park is absolutely worth visiting. I wasn't aware that it is actually a little larger than new yorks Central Park. You can drive through a great deal of this park which helps because you can pick and choose where you want to get to a lot faster. The park will even take you right to the Pacific Ocean. There are endless things to see and do here, if you have time go here for sure!\nShow less"], ["Reviewed October 23, 2017", 5.0, "Beautiful and Tranquil. You wouldn't know you were in the middle of the city.", "Like Central Park in New York, this place can make you forget you re in the middle of a city. The Science Academy is located here and that is where we went on this visit. What a great rain forest. If you love butterflies, this is a must see place.\nShow less"], ["Reviewed October 23, 2017", 5.0, "academy of science is a must visit location", "brilliant facility with rain forest, planetarium, aquarium, earthquake simulation and various other exhibitions to see. easy to access from public transport"], ["Reviewed October 23, 2017", 4.0, "Lovely walk", "We strolled thorugh the park one afternoon. There's loads to see, but some of the areas you have to pay to get into. We went into the Japanese Tea Gardens, which were lovely."], ["Reviewed October 23, 2017", 5.0, "If the weather is good.....", "this place is stunning with a huge amount of history as well. Allow lots of time as it is huge (1000+ acres) and has lots of variety. We were blessed with a great day."], ["Reviewed October 23, 2017", 4.0, "Vast and well kept park", "We took an Uber out from the city centre to Golden Gate Park, and it was well worth the trip. The park is a lovely antidote to the hustle and bustle of the city. We didn’t do any of the paid activities (science museum, Japanese tea garden), as there is plenty to explore for free. If we had chosen to do anything it would have been to rent a pedal boat at Stow Lake - these looked fun and the setting is beautiful.\nShow less"], ["Reviewed October 22, 2017", 2.0, "Lost in the park", "We took Uber to the park address, which happened to be some random small street in the park. I am sure that was my fault not theirs. Anyway, we get out and start looking for “the park.”\nWe found an antique car show- kinda cool, then we found a soccer complex and then a casting contest. We used our phones to find the bison area. They were far away from us. We walked another 20 minutes and found a shuttle sign. It promised a shuttle every 15 minutes. Sure enough after 15 minutes, the shuttle drove by. We waved to the driver and he looked at us and kept driving the partially filled shuttle.\nBack to walking.\nFound another shuttle stop after 10 minutes, waited 15 more and call Uber.\n\nNever saw a rental bike the whole time.\n\nKids were bored, wife was tired. Not a great afternoon.\nShow less"]]}}