{"Golden Gate Bridge": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Golden Gate Bridge", "url": "/Attraction_Review-g60713-d104675-Reviews-Golden_Gate_Bridge-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/b2/0f/a6/golden-gate-bridge.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "41342"}, "address": {"@type": "PostalAddress", "streetAddress": "Lincoln Boulevard, near Doyle Drive and Fort Point", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94129", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Beautiful", "Definitely a sight to see at night and in the day if you have the time.. you must come here if you’re in San Francisco.."], ["Reviewed 2 days ago", 5.0, "A masterpiece", "Beautiful place and a must visit place if you go to San Francisco. Takes around 30 mins to reach there"], ["Reviewed 2 days ago", 5.0, "Must visit by foot", "It is everything they say it is! A magnificent structure that you must walk on or go on a cycling tour. It gets super windy though, so don't forget to take a jacket!"], ["Reviewed 2 days ago", 4.0, "Obvious must see!", "Great views and great for photos. My wife and I walked the approximate 3-1/2 miles across and back. Walkway is shared by pedestrians and cyclists in opposite directions, so it's a bit crowded. Avoid peak times if you can. You can rent bicycles for around $30/day, or $8-10/hour. Nice gift shop. Parking is a little hard to find.\nShow less"], ["Reviewed 2 days ago", 5.0, "amazing views but very windy", "Be sure to dress for windy and cold weather; but it is well worth it! Extra parking if you go past the very small first lot and go underneath to extra parking. Then walk back to the visitor center and don't miss the informative displays before you head to the bridge to walk over. Plenty of spots to take pictures with Alcatraz in the background and then half way you can take your photo with the giant pillars of the bridge in the background.\nShow less"], ["Reviewed 2 days ago", 5.0, "Stunning and Awesome!", "Walk or bike across if you can. We parked in the north parking area an walked about a third of the way across and back. The view of the north tower and rocks and water below is fantastic. I suggest driving a bit farther up the north hill to the Marine Mammal Center for a nice drive with great views and see the efforts to save injured sea lions a nd seals.\nWe also took the bay tour boat from the pier at SF wharf and it goes under the bridge for more outstanding views.\nShow less"], ["Reviewed 2 days ago", 5.0, "Photo ops galore!", "Quite honestly, it is a bridge. But an engineering marvel that can be appreciated. We took a self guided bike tour and there were an abundant photo opportunities and The scenic views were gorgeous. A must for sure."], ["Reviewed 2 days ago", 5.0, "You gotta go", "Pretty scenic. Great experience to be there, could go back anytime. The view from the mountain was super cool."], ["Reviewed 2 days ago", 4.0, "a must see", "Obligated visit when in San Francisco. You can cross it on foot, bike or car. Excelent picture opportunities/"], ["Reviewed 2 days ago", 5.0, "Highlight of my early morning run", "I was staying at a hotel in the Fisherman's Wharf area and wanted to make running the Golden Gate Bridge part of my run route before I left. It was a challenge because I was meant to catch a cab to the airport at 8am. I was out the door at 5:30am, passed the marina, passed Crissy Field and made it to the bridge when it was still dark. It was nice to see the bridge while it was still lit up for the evening. As I ran the bridge from one side to the other, the sun was starting to come up and it was lovely to see it as the day broke. By the time I made it to the other side, I was able to get lovely photos of the bridge from Crissy Field. Even though it was early and I was by myself, there were lots of runners and cyclists on the path and I did not feel alone. A highly recommended experience.\nShow less"], ["Reviewed 2 days ago", 4.0, "Symbol of the city...", "We did the walking tour with San Fran City Guides and learned quite a bit about the bridge. Highly recommend doing this FREE tour!"], ["Reviewed 2 days ago", 5.0, "Cycle over it!", "It's really worth cycling from San Fran to Sausilito and then getting the ferry backk. A memorable ride."], ["Reviewed 2 days ago", 5.0, "Great Walk", "We didn't set out to walk across the Golden Gate Bridge. We visited Fort Point (worth it!) and planned to hike in the Presidio along the Coastal Trail. It was a nice day, we were there, so we decided to walk the bridge. It was a lovely walk and not nearly as windy or cold as we thought. The sun kept us warm. Walking is done on the Bay side of the bridge; biking is done on the ocean side of the bridge. Unfortunately that keeps you from getting views of both sides of the bridge. Would love to have walked on the ocean side. Round trip walk is almost 3.5 miles. The views from the bridge are lovely and the structure itself is fascinating. Definitely worth the walk!\nShow less"], ["Reviewed 2 days ago", 5.0, "Nice views but didn’t get information how to pay tolls", "The Golden Gate Bridge is the landmark of San Francisco and is a must when you visit the area but when it comes to tourists with rented cars, should have been gone more information about tolls and how you get charged. Vista areas available where you can park your car and take some pictures!\nShow less"], ["Reviewed 2 days ago", 4.0, "Cycle the Golden Gate", "We rented bikes and cycled the Gate. The day we did it it was very windy and busy. Be aware that walkers drift into the bike lanes without looking cos they fancy taking a selfy. Also if you rent a bike check it out thoroughly before leaving the bike shop. The first bike I was given the saddle post kept slipping down and the gears kept jumping\nShow less"], ["Reviewed 2 days ago", 4.0, "Majestic¡¡¡", "REally enjoyed a day on this place, it was huge, bigger than what I was expecting, I rented a bike and I just decided to ride all the coastline, that was a wonderful idea."], ["Reviewed 3 days ago", 5.0, "Golden Gate Bridge View from Crissy Field", "Wonderful place in the morning to view the Golden Gate Bridge, see sea lions and have a beautiful walk along the bay."], ["Reviewed 3 days ago", 5.0, "Enjoy the ride. Bile across. Ferry back", "Rent a bike. Enjoy the ride along the bay- and coastline. Ride across on the bridge and down hill to Sausalito. Ferry back to SF.\nNote: Bring water, snacks, fruit. Sunglasses. Allow plenty of time to enjoy the stunning views on SF side of bridge. Be aware of traffic on Bridge. Cars. Bikes. People walking.\nIn Sausalito enjoy coffee, lunch, ice cream. Enjoy the views. Hint: Bike parking by the ferry. Walk back through and around in the village. Buy ticket in machine and wait in line for Ferry. Loads of Bikes! on the Ferry. Would prefer to be last on board with bike.\nHint 2: You can also enjoy longer ride beyond Sausalito.\nHint 3: Check ferry travel times and also bridge open hours for bikes!\nShow less"], ["Reviewed 3 days ago", 5.0, "Iconic bridge", "Get the public bus out to the Golden Gate Bridge and walk as far as you can over it. Watch out for the cyclists! Great views of the city."], ["Reviewed 3 days ago", 4.0, "A little surprised", "The Golden Gate Bridge was not exactly what I expected. It looks way more massive in pictures. We rode on top of a double decker tour bus and even on a nice sunny day in February, it was very very cold! Dress accordingly! I'm glad we did it because I couldn't come to San Fransisco and not cross this bridge. It was just smaller than I expected.\nShow less"], ["Reviewed 3 days ago", 5.0, "It`s A Bridge!!", "Great piece of engineering to visit, great views from both sides and centre of bridge. We walked to/from fisherman's wharf lovely trail along bay to the bridge just watch out for the cyclists!!"], ["Reviewed 4 days ago", 5.0, "Beautiful", "Always beautiful, we were in San Francisco for 6 days and the Golden Gate Bridge remain one of the best thing to visit here, one day we also rented bikes and we biked all the bridge till Sausalito, incredible experience"], ["Reviewed 4 days ago", 5.0, "A Must Do!", "Lived in the Bay Area a long time. The Bridge is a MUST DO when in the city. Ride bike or walk - just do it. It has awesome views and really gives you a sense of what SF is all about."], ["Reviewed 4 days ago", 3.0, "It's a bridge", "If you see it from a distance congrats you saved yourself an hour of your life. There is no reason to go see it up close unless you are driving over it and prepare to pay a toll. The only thing you'll remember is not the orange color but that people love to kill themselves on it. Oh you didn't know that? Well you do now. Move on there are better things to see in San Francisco.\nShow less"], ["Reviewed 4 days ago", 5.0, "Great view", "We biked across. While it was busy we had no problems biking. We were able to stop and take pictures. We even saw Orcas below! The bike ride after the bridge into Sausalito was a bit nerve racking as there is not much of a shoulder but there are so many bikers that cars know to look. We biked into Tiburon. We loved the view for 85% of the ride. I heard the wait for the ferry out of Sausalito could be quite long so we rode an extra 10 miles. Just a few areas not scenic. We biked with a 9 year old and they had bike seats for toddlers. Neither complained. 17 miles! And it took us hours with the 9 year olds speed. But it was great....one of my favorite things we did.\nShow less"], ["Reviewed 4 days ago", 5.0, "Perfect way to end your day in San Francisco!", "We visited the Golden Gate Bridge because it's a must in San Francisco. It was amazing! We saw it from the visitor centre and we then headed to walk it through. We got many pictures. From the bridge you can see Alcatraz, the city, and we were lucky to also see the sunset. It was the perfect way to end our first day in San Francisco!\nShow less"], ["Reviewed 4 days ago", 5.0, "Amazing experience, try with a bike", "Try a trip from SF to Sausalito with a bicycle, there are plenty of rental companies all around SF. You can get back by ferry to SF."], ["Reviewed 4 days ago", 5.0, "Incredible Bridge", "The Golden Gate Bridge is Incredible.It looks so beautiful,the View of it is so nice.We Rode Bikes on the Bridge and the feeling was amazing,we felt so free.If you are in San Francisco,you MUST Rode Bikes on the Golden Gate Bridge.(:"], ["Reviewed 4 days ago", 5.0, "Golden Gate Bike Ride", "The Golden Gate Bridge is so breathtaking. My boyfriend and I rented bikes at Pier 39 and road them across the bridge to Sausalito. It’s took us about 2 1/2 hours and it’s was dusk. Just an overall amazing time."], ["Reviewed 4 days ago", 5.0, "The best thing you’ll do in SF♥️", "Hire a bike and take a wonderful bike ride from Fisherman’s Wharf, across this magnificent bridge, down into Sausalito. On a clear day.......you know the song......you can see forever. Spectacular views. Gorgeous vistas along the way. A real achievement making it over. A few granny gear hills, but this 51 year old made every hill without getting off to push! Sausalito is divine, and you could spend the rest of the day there. Catch the ferry back to FW. You can take your bike on board, then sit back and enjoy the calm ocean breeze and surrounding real estate overlooking the bay. My favourite day in SF ♥️\nShow less"], ["Reviewed 4 days ago", 5.0, "Take a walk...", "We took the tourbus up to the bridge and then walked across. Pick up by the tourbus on the other side of the bridge. Pick up times not very precise (and the bus might already be full!) so plan enough time (specially if you have ticket reservation for the afternoon trip to Alcatraz)\nShow less"], ["Reviewed 5 days ago", 5.0, "Awesome", "If you are going to San-Francisco, you must visit Golden Gate Bridge! It's amazing! Sunset time just insane from pier!"], ["Reviewed 5 days ago", 5.0, "Cool to see but can get very crowded", "As stated in title, can get VERY overwhelmingly crowded. Would recommend to go in early morning. Was very cool to finally see a popular iconic landmark in real life!!"], ["Reviewed 5 days ago", 4.0, "Gold times at the Golden Gate Bridge", "The icon of San Francisco. The one and only Golden Gate Bridge, though not painted gold (red/ orange actually), still glows brightly in the bright Californian sun . We rented electric bikes and managed to ride on the bridge itself where so many movies had scenes with the bridge.\nSpanning a total of 2km in length, a walk on the bridge will provide you with beautiful scenic views of the bay and San Francisco.\nSurely an activity not to be missed !!!\nShow less"], ["Reviewed 5 days ago", 5.0, "California's Gem", "Goden Gate is famous among new comers to California. I went there in mid night with my friends in his car and it was amazing view. Loved it...Thanks for my friends"], ["Reviewed 5 days ago", 5.0, "Walk or bike over the bridge", "We were lucky and went on a crystal clear day. The bridge is beautiful. If you love photography, this is a great place to take pictures. We walked over the bridge. It was windy, but it was easy to walk over. There are a few places along the bridge path where you can take pictures of the city. Don't miss the opportunity to walk or bike over it. You can rent a bike at the visitor's center.\nShow less"], ["Reviewed 5 days ago", 5.0, "Fantastic eye candy!", "Just happen to have a car so we drive 49 scenic mile drive stopped many places and from many view points on sunny clear cold day Golden Gate Bridge is fantastic from All views"], ["Reviewed 5 days ago", 5.0, "Great to see up close", "We saw the bridge whilst on the ferry to Alcatraz. Decided to catch a cab across the bridge and explore it. Recommend a visit"], ["Reviewed 5 days ago", 4.0, "You have to don't you?", "Yeah it's just a bridge but it's an iconic bright known around the world. How could you go and not walk across some way of it?\n\nIt's a bit far from the City so maybe an Uber or bus is called for but you have to have the photos.\nShow less"], ["Reviewed 5 days ago", 5.0, "It’s a beauty, amazing to see", "The Golden Gate Bridge is really nice to see in person, it’s such an icon for San Francisco. It’s unfortunate that it’s not well lit up at night."], ["Reviewed 5 days ago", 5.0, "Take the Tour!", "The SF Public Library offers free tours of the bridge, check their website--well worth it, we got to walk to the first tower along the bridge, talk about its history and enjoy the view!"], ["Reviewed 6 days ago", 5.0, "50th birthday family holiday", "What an amazing experience from start to finish. A little cold perhaps but a coat helped ( better footwear which was purchased from the many shops) the sights the people can’t capsulate the beautifully this place .. you must visit"], ["Reviewed 6 days ago", 5.0, "Just like the movies", "A must see in San Fran. It's free and you can walk from one side to the other. Monstrous bridge. Damned high. And if you are lucky you will see a helicopter tour fly under it and up over the top."], ["Reviewed 6 days ago", 5.0, "Definitely a must do!", "So far this is the most amazing experience we had during our trip to San Francisco. Highly recommend to combine this with a bike trip from San Francisco."], ["Reviewed 6 days ago", 5.0, "Beautiful bridge!", "The park is wonderful to walk through and the views are outstanding. Everyone should make a point to visit Crissy Fields."], ["Reviewed 6 days ago", 5.0, "Iconic must do for any trip to SF", "This is one of the most recognizable landmarks in the United States and is one of those must sees. There are tons of options for photographers to get some amazing pictures. If you are there in the evening, walk the trails that go east towards Chrissy Field to get the sun setting behind the bridge, in the morning, north/east of the bridge there are small beach areas and hiking trails where you can get great sunrise pics. Of course you should walk or bike across it at least once and hike up to the top of the hill on the other side for the quintessential selfie over the bay with the bridge and SF city in the background. It does get cold and windy here pretty much year round so come prepared with a jacket and joggers you can throw on if needed.\nShow less"], ["Reviewed 6 days ago", 5.0, "design feeling beautiful experience living in the movie", "Probablythe best city in USA and place to live in our opinion.Cosmopolit, european, clean, magical, you feel like beeing in the movie, streets of San Francisco :) people kind everywhere, you feel free, and without fear to walk around the city ."], ["Reviewed 6 days ago", 4.0, "Arrive at Sunrise to get the best views and photos", "We drove and arrived at sunrise to get the best views and photos for both the Bridge and the city. Its must see in SF and there are many points to view it from that offer differnet and good views"], ["Reviewed 1 week ago", 5.0, "Must do!", "A visit to the Golden Gate Bridge is a must do!! Amazing structure and amazing views.\n\nIt's worth walking across it for the views of San Francisco and Alcatraz.\n\nThe fencing, signs and telephones remind us that people have taken their lives jumping from this bridge and we must do more to support people when life just doesn't seem worth living anymore.\nShow less"], ["Reviewed 1 week ago", 5.0, "Always a great sight to see!", "No matter how you choose to experience the Golden Gate, you will enjoy it. Whether biking, walking, viewing or driving by car, it’s an iconic landmark that can’t be missed! My kids always get a kick out of driving over it, and I do recommend sturdy strollers for trekking it with kids in tow. Even my 5 year old sits in the stroller for the walk over it and seems to prefer it that way at this point... though she never uses the stroller anywhere else unless she’s exhausted. I think she’ll try to walk it all the way in the next year or 2! It gets windy up there, so dress appropriately and bring hats and cozy blankets that will stay on!\nShow less"], ["Reviewed 1 week ago", 5.0, "Simply breathtaking", "I should give this review a one for how much the toll is now, I grew up in the area when the toll was a dollar and a real person still took it from you. Still, there really is no place in the United States as iconic and as breathtaking as the Golden Gate Bridge. Photos taken on a clear day from the cliffs at Vista Point or Marin Headlands are simply stunning. Driving over it on a foggy night is really cool too. If you are in the area visiting this is a MUST see. Really, take the time to walk across it and take some photos, you might even catch a big ship passing far below.\nShow less"], ["Reviewed 1 week ago", 5.0, "Make sure you Hire Bikes", "This is iconic San Francisco. Great views back to the city and fun riding a bike over to Saucelito. We hired bikes and rode over the bridge which was lots of fun. You can also walk but its a long walk. Definitely worth doing whilst in town. Lots of great spots to grab a tourist pic too.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very great", "Such a great experience absolutely recommend. The fog was out and it made the bridge look amazing. Must see"], ["Reviewed 1 week ago", 5.0, "Awesome Engineering", "An extraordinary work of engineering, I think it is impressive when one can see the scale and magnitude of human engineering}"], ["Reviewed 1 week ago", 4.0, "Definitely worth the drive", "As a tourist, it was fun to drive across this bridge. Just know that you drive through the toll and pay online later. I was taken aback when I drove through the toll gate and was not stopped and there was no way to pay the toll. I hope you are on your way to visit Napa, Marin Co, or Muir Woods!\nShow less"], ["Reviewed 1 week ago", 5.0, "Sunset", "Not only the sunset view there are gorgeous, also light of the city bland with the seaside, it looks perfect match together. However, I'm not really like environment there because of crowded most of everywhere and things are expensive."], ["Reviewed 1 week ago", 5.0, "Suspension Bridge", "My second visit to this great bridge. It amazes me how this was built and thanks to those who in part or whole built this bridge."], ["Reviewed 1 week ago", 5.0, "Amazing", "We cycled over the bridge and it was fantastic. The cycle wasn’t too difficult and the majority of it was flat. This was definitely an amazing experience and one I will never forget. If you are going to San fransisco this is a must"], ["Reviewed 1 week ago", 3.0, "It's a bridge!!", "We got here accidentally while trying to find somewhere else on the bus. It is an impressive structure, but there are some other, what I would consider, to be better bridges further inland. It is one of the sights of Sand Francisco, but to me, I am afraid it was just another suspension bridge.\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautiful - a Must See when visiting SFO", "A United States Landmark and engineering masterpiece. A must see when you visit the city. I suggest you take the cruise around the bay so that you can see the bridge from the underside."], ["Reviewed 1 week ago", 5.0, "One of the Signature San Francisco Sights", "This is the iconic San Francisco bridge that never fails to elicit a positive response. The way to see and experience this is to bike it - bike over it if you can. Or at least bike near it - you will enjoy."], ["Reviewed 1 week ago", 5.0, "30 years later it’s attraction has changed and it’s much more well catered", "Compared to what we’ve seen about 30 years ago things had really changed in terms catering to tourists and souvenirs and information, and it’s commercialised in a good way. We love all the explanation right at the mouth south end of the bridge. If you have time it’s a Long walk to the other end but I think traffic makes it not so pleasant and air quality for the much heavier traffic not worth the walk for us.\nShow less"], ["Reviewed 1 week ago", 4.0, "Spectacular", "Caught the big tourist bus over from Fishermans Wharf & then walked back over the wonderful bridge- busy with cyclists but no problem took about 30 mins easy walking. Took time for photos & seal spotting in the bay. A bit breezy but sun was shining-rewarded ourselves with a hot coffees & clam chowder. Walked the Bay trail along the bay with great views -towards the Palace of Fine Arts where we picked bus up again to city at bus stop 14 on main road . Very chilly or we would have walked all the way back.\nShow less"], ["Reviewed 1 week ago", 5.0, "Must see!", "This place is very cool! First off there are lots of things to do around here great for families. I was only looking to see the bridge but right there at the wharf you can go crabbing! There may be a lot of people but ample space to enjoy the day. The restaurants are clean but can be somewhat of a wait in line. There are opportunities to see a sea lion barking away because of all the people fishing and crabbing. That was awesome! You can only keep the rock crab and must throw back dungeoness. Many sailboats to enjoy seeing and alcatrez at a close distance! Great time! You must pay for parking about a 1.25 an hour.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fantastic place to walk, see the city, enjoy the boat traffic", "Surely a treat to walk the Golden Gate! Or even bike it. There is a separate side of the bridge for bikes. Make walking so much more pleasant. Done it twice and will do it again. A great walk for people of every age..."], ["Reviewed 1 week ago", 5.0, "Iconic", "We were fortunate enough to visit in a day with glorious blue skies and sunshine.\nWe walked all the way across the bridge, spent some time at the viewpoint on the other side and then walked back towards the city.\n\nOther people hired bikes to cycle across, but I felt walking gave us far more time to take on the view and the general atmosphere of being on one of the world’s most famous bridges!\nLoved it!\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth the trip", "We did not rent a car so we were unsure of how to best get to the Welcome Center. We finally took an Uber from Fisherman's Wharf and then took the bus back.\n\nBe sure and get there early for the best photos and wear a jacket if walking across the bridge.\nShow less"], ["Reviewed 1 week ago", 5.0, "It's a must do!", "We did the open top Bus Trip, organised by our friend! Brilliant to go over the GGB....but December? It’s windy, and if you’re slightly suffering a cold, or prone to ear aches, do wear a headscarf. Hats will blow off never to be seen again. It’s a lovely tour which goes from SF FW over the Bridge and stops for a toilet break. You can alight here and get back on the next bus. Worth doing definitely.\nShow less"], ["Reviewed 1 week ago", 5.0, "Always beautiful", "The Golden Gate Bridge is always a favorite of ours to visit and take pictures of. Driving across it is fun and there’s a great vista at point points."], ["Reviewed 1 week ago", 5.0, "Awesome biking tour", "We love to bike. So we had no doubts. We would cross the bridge on bike.\n\nAlong the way you have many chances to take fantastic pics of the bridge and great selfies.\n\nIf you do not wanna bike back home you can take a ferry.\nShow less"], ["Reviewed 1 week ago", 5.0, "Stunning", "This is the symbol that says \"San Francisco.\" Make sure you see this on your trip; it was more spectacular in person than from the air!"], ["Reviewed 1 week ago", 5.0, "Well it is one of the things to see in San Fran", "I went on an organised city tour and so this was a stop. It is one of those places you need a photo..."], ["Reviewed 1 week ago", 5.0, "Bikes across", "We rented bikes from blazing saddles road down the boardwalk and across the bridge and took the ferry back. Note it’s a much longer journey than you think"], ["Reviewed 1 week ago", 3.0, "Visit", "This is one of the best landmark of San Francisco so we never forget to see it.. lots of tourist are taking opportunity to take a picture either way of both ends of the bridge. You can still get a closer look at the Alcatraz from the bridge though you need a binocular to see more clear.. But the worse thing if you have your own car / vehicle every time you passed unto the bridge you have to pay.\nShow less"], ["Reviewed 1 week ago", 5.0, "Iconic bridge", "Every time I think of San Francisco I think of 3 things, golden gate bridge, Lombard street, and pier 49. It's truly a sight to behold and a symbol to the city. A must visit!"], ["Reviewed 1 week ago", 4.0, "Must visit", "If you are in SFC, there is no reason to skip this place. From up hill you can enjoy great view as well."], ["Reviewed 1 week ago", 5.0, "Beautiful!", "Spectacular view driving across. Bridge is an amazing feat but view of the city is also great! Tolls due only in direction towards San Francisco."], ["Reviewed 1 week ago", 5.0, "At least drive it, if not more...", "At least drive the bridge, but you can walk or bike it safely. You can’t go to San Francisco without going to see the bridge. It is very windy over the water, so dress accordingly if you plan to get out of the car."], ["Reviewed 1 week ago", 5.0, "Take a walk over the bay.", "Spend an afternoon walking across the bridge. Sun and wind on a clear day. There is a great park on the Sausalito side. Excellent place to take pictures and rest. There are pay phones and rest rooms."], ["Reviewed 1 week ago", 5.0, "A historic visit", "I had never visited Gold Gate Bridge in all the years I had visited SF and my friend had the bridge on his bucket list. We drove up as close as we could to the bridge to take pictures"], ["Reviewed 1 week ago", 4.0, "Fun and windy", "Great fun, but very windy so hold on to your sunglasses and hats. Good stop at the other side, do it with a guide, makes it more fun"], ["Reviewed 1 week ago", 4.0, "Fantastic experience", "You must walk the bridge. The feeling is so amazing. We arrived at the end of the bridge and then we moved to Sausalito sea village which was a picturesque place. We took the ferry from tSausalito and went back to SF to Pier 39."], ["Reviewed 1 week ago", 4.0, "A must see . .", "I have seen many photographs of the bridge and also seen it featured in many movies but there is nothing quite like seeing it for real. It has to be one of the most amazing structures that mankind has ever built. It is hard to comprehend the real size of it until you stand below it, dwarfed by this iconic piece of architecture.\n\nWell worth a visit if you are in San Francisco.\nShow less"], ["Reviewed 1 week ago", 4.0, "Walking down the sun!", "It is good to walk and check the beautiful view. There is parking spaces but not that close, snickers are very good choice for this sightseeing."], ["Reviewed 1 week ago", 5.0, "Beautiful day!", "We walked all the way across, it's about a 1 1/2 miles. Sun was shining and sailboats were out. Bikes were on one side of the bridge, pedestrians were on the other. That made it safer. Definitely come here if you visit SF!"], ["Reviewed 1 week ago", 5.0, "Always an adventure", "Took my husband to San Francisco and being a Friday afternoon everything was open and available to us all day. Loved his expression as we crossed back and forth across the bridge."], ["Reviewed 1 week ago", 5.0, "Fulfilled a long-standing ambition", "For many years I have wanted to visit San Francisco and see the Golden Gate Bridge. I am now very happy I have been able to fulfill a long-standing ambition. The bridge is spectacular as expected, and we were able to rent bicycles and cycle the bridge to the other side and back. We didn't get much of a sunset view as the fog had rolled in by the early evening, but for the whole afternoon we were able to stop at various places to take in the beautiful views.\nShow less"], ["Reviewed 1 week ago", 5.0, "Took a bike ride over the bridge - views along the way", "When visiting San Francisco, we knew we had to check out the iconic Golden Gate Bridge. We rented bikes and crossed the bridge, which was really fun to do. Watch out for local bicyclists - they go fast, and sometimes tourists forget about sharing the lane and can be a bit scary. Otherwise, it's definitely worth seeing and gave us some great memories of our trip to SF.\nShow less"], ["Reviewed 1 week ago", 5.0, "A must during your visit to San Francisco", "A real land mark to see and such a marvel invention of its time. You can get by local bus, hop on hop off bus red route or drive yourself. You can walk the bridge, take advantage of the open space around there. Toilets and cafe there.\nShow less"], ["Reviewed 1 week ago", 4.0, "Amazing", "One has seen the golden gate in countless photographs, but when you see it live, it takes your breath away.You can spend a long time just gazing at it, and it looks even spectacular when it's lighted up in the night"], ["Reviewed 1 week ago", 5.0, "Boom", "Rode a bike over the bridge which was truly amazing. I hired the bike from Blazing Saddles on Pier 39 and they give you a video to watch of the route to take. A great experience"], ["Reviewed 1 week ago", 5.0, "A Icon you must see", "I have always loved trying to photograph the Golden Gate Bridge. There are so many ways to view it, so many times of day and so many weather changes. You learn to love this bridge if you live here."], ["Reviewed 1 week ago", 5.0, "Beautiful views", "Very nice view of the city and the bridge from the viewpoints. Easy access, good facilities, free parking. Would definitely recommend!"], ["Reviewed 1 week ago", 5.0, "Passed under and rode over it", "We arrived into San Francisco on board Arcadia so we sailed under the bridge just before day break.Then took an excursion which took us across to the Northern side.\nGreat experience.\nWe stayed on in San Francisco for a further 3 days so took the hop on hop bus which goes to the South Side where you can change to a smaller bus.Travelling across in this is a real experience as it is open to the elements upstairs,which we chose,and downstairs.\nYou need to hang on to your hat and glasses believe me.Great fun and fantastic views\nboth sides.\nIf you are in SF you have to go across this iconic bridge which is a wonderful site from wherever you can see it\nShow less"], ["Reviewed 1 week ago", 5.0, "What to say....awesome!!!!", "Well everyone knows that it is a reason why people come to San Francisco. Go there, check the most stunning bridge in the world, take a couple of photos and remmember that moment !"], ["Reviewed 1 week ago", 5.0, "Simply Iconic.", "I love the Golden Gate Bridge. Its great to view, to walk on to ride a bike across....even to drive. Whatever you do...you can't miss it."], ["Reviewed 1 week ago", 5.0, "Beautiful", "This is a site to see. The water, the infrastructure, the history and the city behind it is absolutely amazing. There are places in the hills to go to a grand view of the beauty of SF."], ["Reviewed 1 week ago", 5.0, "A true beauty", "This bridge is beautiful. The size and color was beautiful but not golden lol. We were taking a tour to Muir Woods and we had a short stop at the promenade below. What a view! We were also able to view it from the ferry on the way back to San Francisco. A must see. Did not know it could sway so much.\nShow less"], ["Reviewed 1 week ago", 5.0, "World Famous Classic", "What can you say in a review of a world famous classic? It has stood the test of time. Nothing much to say but just go see it and experience the Golden Gate for yourself."], ["Reviewed 1 week ago", 5.0, "Amazing Iconic Landmark", "I grew up watching American movies like Dirty Harry and Starskey & Hutch and it was always a dream of mine to see this iconic landmark. Drove over it at midnight and the exhilaration was something to be experienced, the slight eeriness and the lights of the bay in the background...the night was clear. The next morning, driving over the bridge again was an entirely different experience, with clear views over the bay, seeing Alcatraz clearly and the Bay Bridge off in the distance. You can travel to the bottom/ shoreline for a great view of the bride overhead which gives an entirely majestic perspective.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful!", "Such an iconic bridge, best viewed from baker beach early morning as no one else is around apart from local dog walkers!"], ["Reviewed 1 week ago", 5.0, "Golden Gate Bridge", "It was very interesting to go over the bridge and to the North Point vista. We used the Big Bus service to get around"], ["Reviewed 1 week ago", 5.0, "Beautiful", "I was skeptical about going here because I though it would be just another touristy thing, but I really did love it. We happened to go on a day that was sunny and 75 so it was gorgeous. The Golden Gate Bridge really does take your breath away. There are lots of trails that you go for walks or ride a bike on. We went underneath the bridge and watched the sunset over the ocean on the other side. I could have spent hours there. I wish we had brought lunch or something because there were picnic tables! Very very beautiful and lovely.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Lovely walk over the bridge", "We walked from fisherman's wharf to the other side of golden gate bridge. It was quite a long way! We thoroughly enjoyed it as it was a beautiful day, and the bay area is gorgeous! By the time we had reached the other side of the bridge our feet were hurting so we got a bus back to where we had started!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "The San Francisco Landmark", "If you have never seen it or been across this famous landmark it is a must do while visiting the area. It is quite impressive."], ["Reviewed 2 weeks ago", 4.0, "Starting wine tour", "After we started our tour the first stop was at Fort Baker. On the Sonoma side of the the bridge there are multiple locations for catching the right picture. It is safe so you don't have to worry about footing or walking on rocks"], ["Reviewed 2 weeks ago", 5.0, "Famous for a reason", "This is an obvious must see in San Francisco. Probably one of the most beautiful pieces of architecture I've ever seen. Take a tour bus ride across for great views"], ["Reviewed 2 weeks ago", 4.0, "Stunning views", "Join the crowds and walk or cycle the Golden Gate Bridge. It can get quite busy, but the views across the bay are spectacular.\nGoing from the San Francisco side we walked from Fisherman’s Wharf which is about 3.5 miles, then it’s 1.7 miles over the bridge. You can then continue on to the lovely little towns Sausalito, where you can jump on a ferry back to Fisherman’s Wharf.\nTake your time strolling over if it’s your first time and get some photo’s of the city skyline, the bay & Alcatraz.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Grand", "A very grand and brilliant experience. It’s certainly worth it, I took a bike along the beach too and was the best part of the day."], ["Reviewed 2 weeks ago", 4.0, "San Francisco Golden Gate Bridge.", "Though red bridge is grand and nice, I personally liked bare bridge better. To me, the Golden Gate Bridge was one of the roads leading to Sosalito. But I'm sure it's cool."], ["Reviewed 2 weeks ago", 5.0, "what wind?", "caught the bus to the start of the bridge walk, beautiful day, clear skies, no wind. on the bridge passing traffic caused a gust or two but still no wind. watched the air display as we walked. walked down under the bridge to Sausalito. longer walk than anticipated and a hot day but beautiful views across the harbour. air display was great viewed from this side but caused a few problems with ferries to get us back across. little bit chaotic. even more problems SF city side as transport was restricted. replacement buses broke down and noone seemed to know how we could get home. one bus driver saved the day, have passed his details to the city for recognition. this was Sunday. the day before the Nappa Valley fires.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome Experience", "Over the summer we had the opportunity to both drive and pass under the bridge in a boat, and we were not disappointed with how pretty the bridge truly is. It really is a sight to be seen."], ["Reviewed 2 weeks ago", 5.0, "Excellent choice", "One of the best things i did in SF! Just rent a bike around pier 39, it is very cheap, than make this beautiful bike ride trough the landscape of the SF bay! Crossing the bridge is very safe ‘cause the bike lanes are separate from the cars but be careful ‘cause you need to share with the people!\nTo come back after visiting Salsalito take the ferryboat with your bike (its also very cheap) and enjoy the sunset! Awesome! Check my pictures!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Must see. Not much else to it", "The Golden Gate Bridge is a functioning, busy bridge. It's noisy and crowded with tourists. Despite this, it's a monumental structure and a must see. You don't necessarily need to walk across it, or even get very close to it, but there are nice little trails leading up to it and a great beach nearby too.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Amazing engineering", "Iconic gateway from the Pacific, a great piece of for sight and engineering.\nBuilt back in the 1930s the visiting Center on the south side provides wonderful views of the bridge. Take a walk through the scenic gardens down to the water front provided great views across the bay of the Bridge, Alcatraz and SAN Francisco.\nDon’t forget to go for a shirt walk into the bridge from the south side, allows you to experience the sheer size of the amazing engineering facility.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Bike the Bridge!", "Great way to get close to this iconic structure. We made an afternoon of it, biking through the piers and park, over the bridge, into Sausalito, and then back on the ferry. Awesome!"], ["Reviewed 2 weeks ago", 5.0, "amazing", "I visited in February and the weather was lovely, no wind and I just sat on crissy field enjoying the lovely view of the bridge and water for about 2 hours. I definitely reccomend and there are a lot of amazing places to get good views and angles of the bridge.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wonderful Walk", "We were looking forwart to walking across the Golden Gate Bridge on our trip to San Francisco and were not disappointed. The advertised 1.7 mile walk was beautiful on a wonderful February day - not a cloud in the sky and approx 65. Be sure to stop half way and take pictures. It was a delight - highly recommend walking the bridge.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awe-inspiring!", "My first sight of the magnificent Golden Gate Bridge brought tears to my eyes. Crossing it was an amazing experience."], ["Reviewed 2 weeks ago", 5.0, "Day Trippin", "Walking the Bridge is surreal. You can stroll casually as plenty of room along divided walking path. From the city side we walked to the half way point enjoying the views and people watching."], ["Reviewed 2 weeks ago", 5.0, "Great!", "So wanted to visit San Francisco for years! This bridge is of course such an iconic landmark.\nI was rather excited when I saw it approaching lol having only ever seen it on the tv.\nIt's huge. Amazing. My partner drove us over. We drove up the opposite hill and took some lovely photos.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Extraordinaary", "Probably one of the most beautiful tourist attractions. Driving across the bridge, viewing San Francisco, the ocean, and piers is an experience well worth the time."], ["Reviewed 2 weeks ago", 5.0, "Awesome photos", "Love this bridge and the photos you can take from its park are amazing. Definitely going to go back to visit again."], ["Reviewed 2 weeks ago", 5.0, "As iconic as the media portrays", "The bridge was beautiful. I would highly recommend if you can, to hire a car because this enables you to drive on the pacific ocean side and up the Marin Headland. The views are beautiful from this side but a word of warning - DO NOT GO ON THE WEEKEND - it is packed. We went on a Saturday afternoon - nightmare with traffic - and then again mid week and this was awesome - there were only a few vehicles on the whole road so you could easily stop at each viewing point and take your photos.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Nice views", "Nice centre and café, nice to walk on it to see it close up and good views from it. Noisy and crowded"], ["Reviewed 2 weeks ago", 3.0, "Terrible", "I went there with my family by car. We parked our car in the parking area but I think the area is no for visitors only. We had a violation note in front window. It was very hard to find where to park for visitors, only us?\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Anniversary", "Absolutely breathtaking. Fun to drive across. You could Evan walk or ride a bike across. But we didn't do those as my husband is not a fan of heights. Great overlook on the Northside of the bridge for taking pictures."], ["Reviewed 2 weeks ago", 5.0, "One of the top landmarks in the US", "After visiting San Francisco for my first time this past weekend I had high expectations for this bridge. They were met. There are many areas to catch different views and angles of the bridge in San Francisco. For example: Baker Beach, Fort Point, Golden Gate overlook, etc. I recommend to drive across the bridge, park, and then run the bridge. When I ran my watch showed around 1.74 miles one way. It is definitely a flat, easy run if you are into running!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stunning!", "Bridge is huge. We drive over it and took a boat ride under it. The water is beautiful in the bay. Bring a jacket as it’s quite breezy out on the water!"], ["Reviewed 2 weeks ago", 5.0, "a fantastic bridge", "Last time we visited San Fran we couldn't see the bridge as it was wet and foggy, so this time it was amazing to see it. We drove across it in a bus, it was busy with runners and walkers alike and what a view it was. A fabulous experience and wow\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome place that would be a huge pity to miss while in SF", "I was lucky to have great 16 degrees in November and sunny and warm weather.\n\nI hiked from the downtown to the bridge and to Vista Point and if you have enough time, that is what I recommend.\n\nThe bridge itself is an amazing landmark. As you are coming closer, you are more and more amazed by its beauty and magnificence. You can walk at your pace, get amazing views, just beware of cyclists, the shared pavement can be narrow at times. Once you have made it to Vista Point, enjoy the views of the city and soak up the atmosphere.\n\nOnce you have crossed the bridge on your way back, Roundhouse Cafe is a good place to deal with your hunger.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Spectacular view on the bay", "A must expirience with a stunning view . For the sportive ones I can suggest a wikd jogging from side to side and return . The ocean will hold you . Don't miss"], ["Reviewed 2 weeks ago", 5.0, "Well worth a trip. A great wonder of the world", "Visited the Golden Gate Bridge whilst on the hop on hop off tour.\n\nDidn’t get chance to walk across but would consider if we went again.\n\nSome great opportunities for once in a lifetime pictures and selfies, but take a coat as it can get very very chilly.\n\nWe were lucky that the sun was out revealing all the bridge from the mist, but the wind was something else.\n\nStrap down your wigs!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So awesome!!", "The Golden Gate Bridge is iconic for American architectural buffs and tourists alike. So beautiful! A definite must-see (and drive-over) for anyone visiting San Francisco!"], ["Reviewed 2 weeks ago", 5.0, "Excellent views", "The Golden Gate Bridge was one of the two things we had specifically set out to see while in San Francisco, and it did not disappoint. We got there via a Hop on Hop off bus, and spent about an hour at the view point before walking across the bridge. There are ample spots to take pictures and enjoy the view. It is of course crowded with tourists, but the line for the washrooms wasn't too bad, and no one really obstructed our view. The food at the cafe is overpriced but not too bad, and we were able to have our lunch with a view outside since the cafe was crowded. We would definetly recommend this activity.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Something You Have To Do Once", "It is a pretty thing to look at but I felt like when I saw it for the first time it had almost lost its sense of wonder. I've seen so many pictures of it online or in television that I felt like I had seen it before if that makes sense. It's a bucket item crossed off the list.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Drive Accross an Iconic Bridge", "If you are in the SF area you will see, visit or experience the Golden Gate Bridge. We drove across and visited some great attractions while taking spectacular pictures of the bay. Be certain someone is with you to take pictures while you drive. The bridge now has a cashless tolling system when retuning to SF. I guess if you are driving a rental car it is going to be billed to them. How that affects you I don't know, but there is no way to pay with cash any longer. I saw many people walking, biking and jogging across the foot path along the side of the bridge. I hope to do that one day.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stunning", "We decided to walk across the bridge which took approx 30 minutes . The weather was very cold and windy so our photos are not the greatest although they do say you are lucky to catch the whole bridge without a little bit of mist covering it lol\nShow less"], ["Reviewed 2 weeks ago", 5.0, "The Golden Gate Bridge is one of the greatest monuments of all time, Privileged walking on it both ways.", "This International Orange marvel of engineering-a graceful, elegant environmental sculpture-stands as a powerful symbol of American ingenuity and perseverance. The Golden Gate Bridge represents the triumph of optimism over doubt and a willingness to take risks that continue to inspire.\nWhen I came to know that I would be going to San Francisco I desired to see this iconic bridge which is one of the most photographed places in the world. As we were based in Berkeley we could see this Bridge every day from my room window in the distance. Though unwell, on the only weekend I had, I went to San Francisco and made it a point to view from vicinity and be at this bridge. As weather was good that day, we walked the entire length of the Bridge two ways, first early in the evening, with fantastic views of the Bay, the famous Alcatraz Island, the city of San Francisco and Berkeley in the distance. While returning the length we saw the San Francisco city lit up with lights.\nIt was a unique feeling walking and seeing the most famous Bridge in the World which was built in 1937 and which is crossed by millions of vehicles every year.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Never gets old.", "Today was a sunny warm day on the Bay, so the light on the bridge made it glow. We headed to Sausalito directly after the bridge. Another gem. Very well signed, it's impossible to get lost once you exit/enter the bridge."], ["Reviewed 2 weeks ago", 4.0, "Great view from the bridge.", "This was my wife's first place she wanted to visit in America. And why not it's quite iconic. We took a walk over the bridge and got some great pictures of the surrounding area of the city and Alcatraz. But not sure she was as impressed as I which was funny because at first she wanted to see it more then me. Glad we did. It was pretty cool to be right up to it instead of seeing it from the plane like I usually do. Definitely an engineering marvel.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "nice", "nice view of the city, passing the bridge is an unforgettable experience. You have to pay for the trip to the city"], ["Reviewed 2 weeks ago", 5.0, "Walk over Golden Gate", "We walked from the SF side of the bridge to the scenic viewing area on the far side. It is an easy 30 minute walk with great views. Foot and bicycle traffic were light on the Monday morning that we were there. After traversing the bridge, we took a taxi to Sausalito (about 10 minutes), had lunch, and then returned by ferry to SF. It was a delightful and inexpensive way to see the bridge, harbor, and shops. Highly recommend it on a nice day.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "a must see for your bucket list!!", "The Golden Gate Bridge is even better in person, we looked at it for five days out our motel window and never was it closed in by fog. Driving across it is amazing!!"], ["Reviewed 2 weeks ago", 5.0, "Iconic..", "Just the most amazing bridge and so iconic! Worth going around sunset by taxi and then walking back over the bridge."], ["Reviewed 2 weeks ago", 5.0, "Free?", "The bridge is very big and beautiful! We drive over with our car and were told it'll Cost $7. Had a rental car and never got to pay."], ["Reviewed 2 weeks ago", 3.0, "We biked it!", "It was uphill both ways, literally. Navigating getting on and off to bike paths could be confusing but blazing saddles map made it much easier."], ["Reviewed 2 weeks ago", 5.0, "Fantastic view and walk", "The walk from one end to the other is longer than you'd expect. It's worth every step. Keep enough of time to walk at a leisurely pace, regularly stop to absorb the views and leave enough time to spend at beautiful Sausalito (if you're starting from the SF side).\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Golden Gate Bridge", "Wonderful views of the world’s most famous bridge! Feeling the cool, breezy air was great on this tour with Bay Voyager."], ["Reviewed 2 weeks ago", 5.0, "As amazing as I always thought it would be", "Probably one of the most beautiful views I've ever seen. We looked at the bridge from Crissy Field and then drove over the bridge and viewed it from Bridge Vista Point. Both views were amazing. You CAN'T take a bad picture at either place!"], ["Reviewed 3 weeks ago", 5.0, "The SF Monument", "A visit to SF without seeing the iconic monument is not realy a visit. A walk from either side to the other is simply a must."], ["Reviewed 3 weeks ago", 5.0, "Iconic for a reason", "This gorgeous bridge is visually stunning but also crucially important to commerce and traffic in the bay area. It's history is rich and complex and it is worldwide iconic in the way that the Sydney Opera House is. Great to cross by foot or car, but make sure to stop at the fort on the north side in Marin for the most amazing views of the Pacific, and looking back at the stunning skyline of San Francisco, the bridge and the bay.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Scenic", "Golden gate bridge is a great landmark to indicate that you are in San Francisco. Although there's nothing special about it being just a common bridge, it is very visually appealing on how the structure was built and how far it can reach."], ["Reviewed 3 weeks ago", 4.0, "Cycle the Bridge", "We took e bikes over the bridge to Sausalito. The bridge has Art Deco designs and the views are amazing. Sausalito is a lovely town for lunch. Recommend doing this trip but take an e bike as there are hills and the help of the electric bike will make it more enjoyable.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Well worth the walk", "Parked at the bridge ( you can only park for 2 hours).Had a great walk over the bridge and back, as it was January it was a little cloudy ,but still a fantastic view. Well worth doing in the morning before the helicopters arrive."], ["Reviewed 3 weeks ago", 1.0, "Golden Gate Hassles Southbound", "Totally frustrating and terrible experience. Be sure to use their prepay options. We did not and were on an extended trip when we crossed going southbound at night so there were no views. Unfortunately, this is the direction for which they \"collect\" a toll via the automated FasTrak \"system\". By the time we saw the bill in our held mail, they had jacked up the $7.75 toll to $25. Fortunately, the operator was able to reduce the payment to the actual toll = $7.75; a payment which I made. Ok to this point; HOWEVER - Now more than a month later, I have received a \"SECOND NOTICE OF DELINQUENT TOLL EVASION VIOLATION\" and a demand to pay $25.00 yet again and a threat for $ 70.00 due after 2/17/18. This is a deeply frustrating and incompetent operation. AVOID CROSSING THIS BRIDGE SOUTHBOUND, especially if you are from out of state.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must SEE!", "As we drove towards the bridge headed to Sausalito we stopped before crossing the bridge and parked and walk along the trail at the foot of the bridge! The pictures are amazing, they also have picnic tables if you like to take a snack."], ["Reviewed 3 weeks ago", 5.0, "Summer holiday 2015 and 2017", "After watching you on TV, Movies, picture, books and have been on my bucket list for decades it was a dream come through in 2015 when I first cross over you. First, I had a guided bus tour than I drove my dream car from Alamo Rent a car. It was a GMC Yukon several time to and from. Therefore, when I came back into San Francisco in 2017 I had to cross you again. I love you and your history, I’m glad that I have been able to be a part of you and to have my story of you. Until we meet again thanks for the experience If you havent been here you have to go\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful Weather for a walk", "Took the normal tourist route to get us to the Bridge on a Sunday, it was quite busy but no great crowds or queues. Take your time and look out over the Bay towards the City and spot Dolphins and Seals swimming. It’s an easy walk, and breezy on a calm day.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fantastic Views", "Beautiful Views loved every minute of my day trip drove under it for great views and lots and lots of pictures , then we got to drive over bridge it was amazing windy fantastic , could see for miles ..... Do It its Fantastic"], ["Reviewed 3 weeks ago", 5.0, "Must do!", "We drove from the San Francisco side to the Marin side and parked at Vista Point. The drive over the bridge is jaw dropping for out-of-towners! We went early on a Sunday morning (9:00) and easily found a parking spot. We walked maybe half way across the bridge. It was incredible. Amazing to see how big it is in person. Pictures do not do it justice. It was funny to stand and just watch the cables vibrate as the cars passed by on the bridge. It was hazy that morning so did not get a great view of the city but it was still beautiful. If I lived there and I was a runner, this view would definitely put me in the mood to run!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great to walk", "We walked over the bridge from the visitors centre. It is two miles long and took us just over 30 minutes. We then walked down to Sausalito which took a further 30 minutes. Well worth the walk. You can then take the ferry back to San Francisco.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "How can you not rate the Golden Gate Bridge 5-stars???", "I mean, it's the Golden Gate Bridge!! As iconic as the Eiffel Tower in Paris, and Lady Liberty in NYC.\n\nYou can walk, bike or drive over it. The views, as you would suspect, are sublime. I won't go into the history of the bridge, you can easily look it up on other sites, but just to be there was thrilling.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun afternoon", "Don't pass this up while in SF! Definitely check out viewing points at fort point and Marin headland. Also, if you go to Lincoln park and the Legion of honor the view is very nice there."], ["Reviewed 3 weeks ago", 5.0, "DO NOT LEAVE San Fran without seeing this GEM", "It's a GEM for sure, an icon of SAN FRAN and let me say if you do not go there you will miss out. Just a beautiful spot to visit. I loved being there, the views, the significance of this bridge, the history. Def go check it out and get the most epic photos.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A \"MUST SEE\" ...", "We thought the Golden Gate Bridge was a must see!\nWe drove across (toll fee of less than $8) ... don't fall for the car rental company telling you that you need a Toll Pass!! You don't! You cannot pay cash, but they give you lots of options for paying, either on-line or over the phone.\n\nI wish we could have driven slower over the bridge ... maybe walking would have been more fun.\n\nBut we were happy we made the trip!!\n\nHave lunch on the other side - make it a day. :-)\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must see!", "While going on a trip to Sausalito which is close by the San Francisco Golden Gate Bridge, and also the pathway to get there, we brought our friends to visit the Bridge and they thoroughly enjoyed it! They felt it was a must see while visiting San Francisco and took many spectacular pictures-\nShow less"], ["Reviewed 3 weeks ago", 4.0, "a real touristic point", "The Golden Gate Bridge is the real touristic point of San Francisco.\nI suggest you take the most sunny day to go there. You can have a walk, or take a bike ride all over the bridge.\nYou can rent a bike on Lombard street, and it is not so cheap, but you can walk if you want.\nIt is good for friends, lovers, family, I am just not sure about taking small kids to it because it is pretty windy and you have to walk a lot.\nIt is pretty beautiful.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Bus Tour Big Red Bus", "Used Big Red Bus and did a tour accross the bridge and back again it was a great way to see the city during the day and get your bearings. We went back and did another one at night but different areas."], ["Reviewed 3 weeks ago", 5.0, "Awesome views and pictures!", "Went here at night to check it out. We went to a pull off and an overview look. Both views were stunning! I didn't go on the bridge to walk but enjoyed the distant view with less traffic and visitors. It's also a staple of San Francisco and well worth the time!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must go", "A must go that will provide great pictures. We loved cross the bridge. See the bay, Alcatraz and San Francisco"], ["Reviewed 3 weeks ago", 5.0, "Best View is at Fort Point", "We went here on a tour and they took us to Fort point. We where able to get some photos from further away and closer at the Fort. Entrance to the fort was free, they do ask for donations however. We were able to take photos at the fort and some amazing photos of the bridge\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Incredible!", "See the bridge in as many ways as possible - cycle, walk, drive, take a boat. It’s an incredible feat of engineering and brilliance to say nothing of being stunning."], ["Reviewed 3 weeks ago", 5.0, "Beautiful architecture", "What an icon. Very nice to get to see it in person. No toll to drive north across it but there is a toll coming back into SF. For a good view stop at the park just to the south east of the bridge, paid parking here everyday. For free parking go to the abandoned military complex on the cliffs to the west and you get a different angle.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Another iconic attraction", "Have sailed under it, rode over it & walked over it! Still magical and has to be seen & visited! Lots of people here hire cycles too & ride over the bridge to Sausalito & catch the ferry back to Fisherman’s Wharf, Great"], ["Reviewed 3 weeks ago", 5.0, "AMAZING", "Out beautiful and amazing suspension bridge spanning the Golden Gate. Linking San Francisco to Marin. It's a beautiful site and a definite must see to anyone visiting the bay area. You can walk, job or bike across if you so wish which is a cool experience as well.\nAs locals we do't enjoy it in a leisurely way as much as we should. It's nice to be reminded of the beauty that surrounds us and how we should stop to \"smell the roses\" a bit more often. If you are local as well, do yourself a favor from time to time and approach our city as you would if you were a tourist and take in all we have to offer :)\nShow less"], ["Reviewed 3 weeks ago", 3.0, "alright", "It's a bridge. Nothing too special. Drive up to Marin Headlands after dark to get some good photos with the city in the background. Keep in mind that there is no tollbooth, you have to go online and pay afterwards."], ["Reviewed 3 weeks ago", 4.0, "Nice experience", "+cool place to take pictures. + accessible to everyone one. + no charges required unless you wanna cross the bridge. + this bridge toll do not accept cash."], ["Reviewed 3 weeks ago", 5.0, "Lovely view, iconic San Francisco.", "Take a walk and enjoy the view, go to the gardens below, eat a hot dog, spend quiet time with friends and family and breathe the fresh air."], ["Reviewed 3 weeks ago", 5.0, "Cycle it!!!", "You feel like the king of the world and it is iconic. I highly recommend biking it because it takees a short amount of time and the wind is beautiful cycling it.\n\nSausalito across the bridge is okay but if you suck at cycling up the humongous Hill back, you can get the bus back. It costs six dollars and is not included in a muni passport, is runs on a different system. You can use a clipper card.\n\nI think the Golden Gate Park is more fun then sausalito. But sausalito looks like a little Greece and is quite quaint. Not too much to do besides a the historic centre, food, and oh the model of the bay is pretty cool!!\n\nAnd some house ships but they're hard for me to find, I didn't see any up close. Apparently there is a taj mahal ship but I couldn't find it.\n\nIf you're at Golden Gate Park, don't miss the wave organ, it is really cute!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "An Icon worth the visit", "This bridge is an icon of the city and its greatness. A walk across the bridge is an experience worth treasuring!"], ["Reviewed 3 weeks ago", 4.0, "Famous bridge", "This is a must-do in San Francisco. Best views are at the west side, on the opposite of the city. But be aware of the toll cost. You have to pay toll, only when entering the city. You can’t pay cash, only pay-by-license."], ["Reviewed 3 weeks ago", 5.0, "a must see", "On our visit we had to see the Golden Gate Bridge. I was so happy we did. I was so surprised there was not a lot of traffic . About the only place there wasn't traffic"], ["Reviewed 3 weeks ago", 5.0, "Spectacular Views, plus exercise. What can be better?", "On a one-week trip to San Francisco I walked this bridge 5 Times - it is that beautiful. Twice I hiked up from Pt Lobos, twice I walked from Ferry Building, and once I hiked up from Sausalito. All approaches provide great views of the bridge, the wate, Alcatraz and the city. Often it is very windy but that only increases its attraction for me. It is about 1.7 miles long, less crowded on weekdays and early morning. Always a great attraction. And it is free!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing", "Rented a bike and went all the way from downtown San Francisco to the bridge.\nThe bridge is beautiful and crossing it on a bike is a unique experience.\nThere are rest stops along the way, and the view of both sides is amazing!\nI highly recommend.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Breathtaking", "This is a must see if one is visiting SanFrancisco for the first time.Its crowded and the parking lot is small,so best is to take one of the tour buses.The bridge looks spectacular at night.Looking at the bridge is first hand is totally different experience than seeing it in pictures.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Can't miss the magnificent spectacle of the Golden Gate Bridge!", "Any time of day or night, The Golden Gate bridge is the iconic photo op of San Francisco. No vacation to the City by the Bay is complete without a good look. You can see it from many places and angles, but a quick trip to the National Park shop and the displays regarding the building and structure of the bridge is well worth a look.\nAt the very least, drive across the bridge (currently $5 toll) and back (or walk, though it is a hike), but that does not give you the same opportunity to soak in the vista. Have a sweater or windbreaker with you - it's usually pretty breezy most of the time and the ocean air is chilly.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Duh! Yes!", "Driving across the bridge is fun, but better yet, rent a bike and ride across! Its especially fun when the fog rolls in! Also, if you care to get a bigger view, drive up the hill to see it from up top!"], ["Reviewed 3 weeks ago", 5.0, "Typical Tourist Attraction", "A pretty basic tourist attraction but something you'll do. No wifi at the bridge information centre which makes it really hard to order and uber if you are travelling and don't have internet access. A nice easy walk across the bridge and lots of opportunities for photos\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Unbelievable view", "I took a very early bike ride across the Golden Gate Bridge. It was spectacular. The sun rise over San Francisco was stunning. If you are SF, rent a bike and go."], ["Reviewed 3 weeks ago", 4.0, "Boat trip and drive", "We spent a couple of days in SF and took a boat trip too the bridge which was actually very interesting.On completion of our 2500mile road trip we took a detour so that we would get to drive over the bridge on way back to airport ,an experience not to be missed.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Iconic and not to be missed", "It’s a must see attraction and I felt it was well worth the trip, having been here several times before I still made the trip the bridge and the surrounding area. The lovely park settings are amazing on a sunny day"], ["Reviewed 3 weeks ago", 3.0, "Ok", "Walked here from fisherman wharf which is was quite taxing but the disappointing thing was that there was nowhere to buy drinks until the other side of the GG bridge. There is nothing to advise you of this and on a hot day it could be difficult for certain people.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful sight", "This is an experience I think everyone should have. We visited day and night. It’s crowded in the day & the parking lot is small, not to mention you have to pay for parking. At night parking is better, the bridge looks golden but the views are limited. Not to mention you can’t walk the bridge at night. Time spent is up to the visitor. We spent no more then an hour. I highly recommend visiting at day & night.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wow!", "I felt like I’d jumped into a postcard! Such an incredible spot to visit! We arrived at the National Park shop and walked down to the bridge viewing area, then walked down the pier and saw it from a different angle. Really well appointed spot too with toilet facilities and a cafe.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "It's just a bridge. But it takes your breath away. I don't know why.", "Maybe it's because we've seen it in pictures a thousand times. Perhaps because it's the emblem of the free-spirited San Francisco or California laid-back sunshine lifestyle we all want a bit of. Dunno. But seeing this bridge up close - again - still takes my breath away. It's only a bridge. It's not the Statue of Liberty. Or Michaelangelo's David. It's a toll road connecting two spits of California headlands into the Bay. But it's gorgeous. So lovely. A massive, metal sweep that's still gracious and gentle. How does an arc of rope and two towers do that? I gawped and gawped again. As I did in 1995 when I first saw it. There's some deliberate, delicate, delicious architecture going on here which I will never understand the reasons behind, but goes to show that if you let designers fulfil their brief, no matter what the opposition or cost-cutting (as was the case here), then you can end up with something magical. It's only a bridge. But what a bridge. Sail under it on a Bay tour and look up. Walk across it, and occasionally look up. You really should.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Bike ride or walk over it is a must!", "The Golden Gate Bridge is just as beautiful as all the pictures portray it to be. We did a bike ride over it and loved it!"], ["Reviewed 3 weeks ago", 5.0, "Best on a bike", "Loved renting a bike, $32 per day or $8 per hour. Road along bay front bike path to the bridge and back. You can continue over the bridge and take a ferry back from Sausalito. Also can get nice pictures of tje bridge from Alcatraz."], ["Reviewed 3 weeks ago", 5.0, "The bridge", "I have wanted to see this for sooooo long. My daughter and myself were lucky enough to take the bus over, then walk back over.. Then.... Drive over in a V8 mustang, with the top down !!!!! Beautiful engineering marvel"], ["Reviewed 3 weeks ago", 5.0, "Besutif", "This is a beautiful place to take pictures. It looks just like you’d expect it to look! There’s a park before you cross the bridge where you can take photos."]]}}