{"Grace Cathedral": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Grace Cathedral", "url": "/Attraction_Review-g60713-d116450-Reviews-Grace_Cathedral-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/c2/df/22/grace-cathedral.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1067"}, "address": {"@type": "PostalAddress", "streetAddress": "1100 California St", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94108-2244", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "beautiful, welcoming place of worship", "no matter your religious preference, it is worth a stop to view this magnificent building on the inside and outside. It is very peaceful to sit down, take a rest from walking; and enjoy looking at the amazing stained glass, labyrinths and sculptures. It is right on the cable car route, so you can easily hop off and walk in to soak in all the beauty.\nShow less"], ["Reviewed 1 week ago", 5.0, "All of San Francisco is down hill from here", "As gothic as it gets in the USA. Stop. Look. Then walk to the labyrinth on the right. Enter. Slow down. Breathe and listen to San Francisco all around you."], ["Reviewed 1 week ago", 4.0, "Lovely place day and night.", "I've taken photos of this beautiful cathedral both during the day and at night. It's beautiful. It's got lots of great, contemporary art features if you pay attention and it also has a lot of quaint little gardens and flowers out in front. It's hard to miss if you are staying in Nobb Hill which is typically where I stay when I'm in San Francisco.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Amazing cathedral - a peaceful place", "The Grace Cathedral is just beautiful. It is a great building with wonderful stained glass window. It is a peaceful church to sit down and enjoy the atmosphere. I went on a Sunday afternoon and had luck to hear an amazing organ player. It is easy to get there by Cable Car, the Californian line stops just in front of it.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "This is an amazing place", "Me and my husband come here often, it is just such a beautiful place to spend some free time. The music is wonderful, and the atmosphere is very peaceful."], ["Reviewed 3 weeks ago", 5.0, "Beautiful", "A beautiful cathedral with some interesting history. We walked in on a Sunday and were greeted by a quartet opera performance in progress. This cathedral seems to have regular Sunday events! Worth a visit."], ["Reviewed 3 weeks ago", 5.0, "Awe Struck", "We were in San Franciso for a Company event and while there had some extra time. We went to see Grace Cathedral and were awe struck. The building was beautiful. While there, the pianist came in (I'm guessing to practice for Sunday Eucharist) and the pipe organ was just amazing. Almost made us want to stay for Sunday just to listen to that.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "My favorite church!", "It's a bit of a walk to Grace Cathedral unless your hotel in nearby, which mine usually is. I like to start my mornings at Grace Cathedral walking the labyrinth inside. There is also one outside, but the inside labyrinth seems more intimate because the church is so quiet and peaceful. It's a wonderful place to go to pray or think. Take along some Kleenex....it's a moving place.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Elegant Architecture", "Beautifuly kept Cathedral in the heart of Nob Hill. FREE! Although donations are gratefully accepted. NIce art installations, and the stained glass is a beautiful as Notre Dame."], ["Reviewed January 23, 2018", 5.0, "Beautiful place of worship", "Beautiful building. We arrived as evensong was about to begin, but we were still given a warm welcome when we explained we were only there for a look around. Some beautiful artwork and architecture, so you are likely to enjoy it whether you are a Christian or not.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Wow!!! Stunning Cathedral", "Wow! This place is HUGE and magical. I love to photograph historic Churches and this one does not disappoint."], ["Reviewed January 21, 2018", 5.0, "Christmas Eve was splendid!", "Grace Cathedral is a very stately church. The concerts are always terrific. No matter your beliefs, treat yourself to either the indoor or the outdoor labyrinth. So peaceful! There's a reason people from many different cultures have built and walked labyrinths for millenia. You will not regret it. And great views of SF from Nob Hill.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Similar to Notre Dame in Paris but smaller", "Near the Fairmount Hotel and 'Top of the Mark' Grace cathedral has a similar external look to Notre Dame in Paris with its two towers and central spire.\nOutside the bronze and golden 'Gates of Paradise' doors are made from a cast taken from the original doors in the Florence Baptistry designed by Lorenzo Ghiberti are magnificent.\nInside the labryinth on the floor, the murals including the 1906 earthquake mural, stained glass windows including one celebrating Albert Einstein and one called the 'Gift' which depicts the Milky way set within a cloaked human figure, and the Rose window, even a memorial to Winston Churchill. All of this and the peacefulness inside make this a very worthwhile visit.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Must see!", "I love Grace Cathedral for faith and beauty, must go! If you are episcopal or catholic or just faithful, you must visit. It is on the top of Nob Hill and I love being there. I like the Sunday 6pm service but up to you what works for you. They also do yoga on Tuesday nights which is very popular!\nShow less"], ["Reviewed January 19, 2018", 4.0, "A beautiful cathedral", "This cathedral is modelled on the Notre Dame Cathedral in Paris. Grace Cathedral is a fine building but do not expect it to be quite like any of the beautiful medieval cathedrals of Europe. For a start, it is small in comparison.\nGrace Cathedral sits on a commanding site at the top of Nob Hill. If you are walking, it is a real climb but the California Street Cable Car takes you right to the Cathedral.\nOutside, there is an impressive view of the towers from Huntington Park and then cross the road and enter via the east end. Here there are Ghiberti doors which are reproductions of the doors of the Florence Baptistery. also, before you go in, visit and walk the outside labyrinth which is just to the right of the entrance.\nInside, the Cathedral is bathed with blue light from the stained glass windows and there is an uninterrupted view up to the high altar. As you go in, you immediately encounter a second labyrinth.\nThe modern stained glass windows are really quite beautiful and when we visited, there was a light installation representing Jacob's Ladder called Jacob's Dream.\nWe attended Choral Evensong in the Grace Chapel. Although a lovely service, it was no patch on the uplifting, beautiful Choral Evensong services that are characteristic of the Anglican Tradition and sung in all English Cathedrals.\nDownstairs, the cathedral does have restrooms, a coffee bar and a small souvenir shop.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Really beautiful modern strained glass windows worth a visit", "Pretty cathedral with beautiful strained glass & a really clever at installation representing Jacob's ladder when we visited"], ["Reviewed January 15, 2018", 4.0, "Classic European Look", "The architecture of this grand 90-year old church is similar to those found throughout Europe. The Cathedral is a San Francisco monument with its prominent location at the top of Nob Hill. Due to time constraints we could do no more than walk the perimeter of the building. But, with our next visit to the city we would definitely be interested in taking one of their weekday tours.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Beautiful and serene.", "I loved to visit this cathedral. Many beautiful pictures inside and out. The architecture and history is too vast to put here in one review. Definitely recommend!!"], ["Reviewed January 1, 2018", 5.0, "More than a church", "For years we have visited Grace Cathedral and found it beautiful and comforting. Our granddaughter was baptized here and we make sure to visit before Christmas. We feel his presence here."], ["Reviewed December 26, 2017", 4.0, "Modern Notre Dame", "It may have been built in the 1800's but it is a lot more modern than it's European cousins, the exterior almost looks like it was built in the last 50 years. The interior is also updated and from what I understand gets updated every so often. Takes away the historical fell but it's still a beautiful cathedral.\nShow less"], ["Reviewed December 25, 2017", 5.0, "Lovely church", "Lovely church in a lovely square/park. The bells sound beautiful and toll frequently. Worth a visit."], ["Reviewed December 21, 2017", 5.0, "Do the Self Guided Walking Tour", "Do not miss the Doors of Paradise, the beautiful stained glass, the labyrinth and the statue of St. Francis. Nice to just sit and take time to reflect. Well worth a visit. Small gift area in the basement along with restrooms."], ["Reviewed December 21, 2017", 5.0, "Absolutely beautiful", "I love old buildings and this is amazing. Its amazing how much time people put into making this beautiful Cathedral."], ["Reviewed December 18, 2017", 5.0, "Absolutely stunning", "A smaller replica of Notre Dam this is situated near Nob Hill and close to The Fairmont Hotel. The door to the cathedral has to be seen to be believed, its so ornate. A beautiful place to visit."], ["Reviewed November 24, 2017", 4.0, "Surprise spot", "Wandered in on the top of nob hill and was shocked at the beauty. Start by seeing the replicas of the Gilberti baptistery doors you see when visiting Florence. If you'll never get to Florence, this is your chance to see historically significant artistry. Inside you will see a labyrinth, beautiful stain glass windows, tapestries and a history of California depicted around the walls.\nShow less"], ["Reviewed November 16, 2017", 3.0, "Underwhelming", "I visited at dusk and it was quite dark inside. This cathedral does not have the grandeur that many (most) of the european ones have - that is for sure! 2005"], ["Reviewed November 12, 2017", 3.0, "Ordinary Cathedral", "It's just like other Cathedrals. There's nothing special about it --- infrastructure-wise. There are places around the Cathedral where you can just sit and relax."], ["Reviewed November 9, 2017", 5.0, "San Francisco's Norte Dame", "Fantastic example of high gothic architecture. A monument to AIDS and the deletion to love and tolerance characteristic of San Francisco. Don't miss the maze."], ["Reviewed November 9, 2017", 5.0, "Beautiful historic building", "Wish we had time to take a tour of the inside of the building. Absolutely gorgeous and not far from China Town."], ["Reviewed November 7, 2017", 5.0, "Gothic architectural treasure surpassed by its welcoming, inclusive perspective", "It's a majestic and soaring piece of Gothic architecture. It is a prime location atop Nob Hill. Equally captivating are the people outside walking the labyrinth at every hour of the day or doing Tai Chi on the Cathedral grounds.\n\nOn a Sunday morning it can seem like a throwback to a stuffy mainline club. But dont be fooled by that for there is more. Their concerts are astounding - look for the annual concerts by Dorothy Papadakos - and their Sunday morning discussions are intellectually stimulating.\n\nThe Keith Haring altar piece in the AIDS Chapel is a beauty to behold and meditate in front of.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Beautiful", "We popped in here as we were passing and although there was a service going on (it was Sunday) the lady as we went in was really friendly and invited us to join in if we wanted and told us about the beautiful stained glass window above the front doors and the labyrinth which is the replica of the one at Chartres in France. Downstairs there is a cafe and toilets which you wouldn't know about. Well worth a visit.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Lots of Wow's were said.", "The Cathedral is beautiful. Unbelievable stained glass windows. Wish we had more time to study the paintings on the walls."], ["Reviewed October 30, 2017", 5.0, "Delightful mix", "Quiet and beautiful. Some modern representations as well as older styles. Super history of the main events of the city around the walls. The walk to the cathedral was well worthwhile though it is on the cable car route."], ["Reviewed October 29, 2017", 4.0, "quick visit", "interesting cathedral at the top of san Francisco so get a cab,cable car or a steep walk but worth it"], ["Reviewed October 26, 2017", 5.0, "Stain Glass Gothic atop Nob Hill", "Grace Cathedral, the principal Episcopal church in San Francisco, is located on the top of Nob Hill. It was begun in the early 1900s and is a beautiful example of Gothic architecture. All the windows are stained and the walls are generally decorated with mid-century murals detailing the history and peoples of the area. Many nice architectural details. Chapel of Grace to the left of the altar at the crossing is a beautiful miniature version of the Gothic style.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Worth the hike", "On top of yet another SF hill. Mock Gothic in te European tradition. Note the doors (copy of Florence), the labyrinth, stained glass telling the story. Oasis of calm, even when preparing for 100 people doing yoga! Services regularly with good choir."], ["Reviewed October 22, 2017", 5.0, "Peaceful", "Walked through this church as it was between our hotel and other sights. We did not do any tour, just a peaceful 5 minute walk around to see the beautiful architecture and stained glass windows. Worth the walk through if you're in the area."], ["Reviewed October 20, 2017", 2.0, "As a concert hall, the acoustics are awful", "This review is only about Grace Cathedral as a concert hall. Yes, it's a gorgeous piece of architecture; take the tour! And come to services, and just sit and get in touch with your meditative side. But if you come here for a concert, be prepared to be disappointed. I came to hear the SF Gay Men's Chorus and the Oakland Interfaith Gospel Choir -- both huge groups with big sound, and I never thought they'd meet a hall they'd get swallowed up in, but even with microphones Grace Cathedral absolutely muted them. Huge disappointment for us in the 15th row; I can't imagine what the sound was like way in the back.\nShow less"], ["Reviewed October 16, 2017", 4.0, "A place of sublime reflection and spiritual comfort", "Not a practicing religious person, I do however love the solstice of sitting in a pew early mornings reflecting on the grace of life and peace we all desire. Grace Cathedral offers a great place for moments of reflection. The vast building offers a sense of purpose and direction for those who take the time to be in the moment and take in the collective spirit of those who have graced this magnificent structure. Its a stop I make each and every time I visit San Francisco.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Beautiful", "If you love beautiful churches, you have to see Grace Cathedral. In the heart of the City, worth the time and effort to go see."], ["Reviewed October 6, 2017", 4.0, "Monumental 20th Century architecture in the Gothic Style", "Grace Cathedral is a monumental gothic style church built of reinforced concrete but resembling the stone cathedrals of Europe. Constructed on the site of the Crocker Nob Hill Mansion, I Rember when the Cathedral was completed and dedicated in the 1960's. Replicas of Ghiberti's bronze \"Doors of Paradise\"at the Bapistry in Florence, Italy, marvelous stained glass windows, the AIDS Memorial Chapel, and the triptych altarpiece by Keith Haring are noteworthy. The cathedral doors are open every day to everyone for reflection, prayer or touring. The California Street Cable Car line runs right by.\nShow less"], ["Reviewed October 2, 2017", 4.0, "beautiful church", "short walk from our hotel, Very classic style cathedral on nob hill, well worth the visit to this location"], ["Reviewed September 30, 2017", 4.0, "Reverential", "Episcopalian church with short history but already place to go to in San Francisco download app on site for audio"], ["Reviewed September 28, 2017", 5.0, "History/Religion", "The person that was doing volunteering was very knowledgeable about the Cathedral, charming and helpful. We had a good time admiring this piece of art.\nA unusual place to stop by for coffee.\nThe music was just part of the atmosphere that bring you in to the time of the apogee of the Wonderful Cathedral.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Serene place for reflection", "Grace Cathedral effortlessly combines old (Gothic-style architecture) with new (reinforces concrete). It has a wonderful sense of peace and acceptance inside, highlighted by the memorials to those who died of AIDS. We enjoyed watching the 'Jacob's Dream' installation currently in the north aisle."], ["Reviewed September 24, 2017", 5.0, "So new, yet it feels centuries old", "Such a beautiful cathedral. The stained glass is memorable and includes modern day subjects. This catedral has a very interesting history."], ["Reviewed September 24, 2017", 4.0, "Peaceful and the right balance", "Despite the fact that the cathedral has weddings in it, you can still enter and partake of a great balance between grandeur and personal space. The stained glass is stunning, you can go anywhere, and there is enough to satisfy for a quick trip. The cascade of light down the high tech Jacobs ladder is mesmerizing.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Road Trippin'", "Walk the labyrinth. It really gets you mind working. Beautiful church. Stayed and listened to the very amazing choir."], ["Reviewed September 13, 2017", 4.0, "Beautiful landmark in the City", "This Cathedral is beautifully located at the top of Nob Hill and well worth a visit if you like this type of architecture. Very close to the Powell Street cable car line and downtown - or walking distance from Union Square if you are in a good shape to make the hill!\nShow less"], ["Reviewed September 11, 2017", 4.0, "A beautiful Cathedral that matches any in Europe", "After visiting Lombard Street, we continued on to Grace Cathedral. we had visited a number of cathedrals in Europe over the last couple of weeks and Grace Cathedral certainly can stand proud with those cathedrals.It is interesting seeing the murals on the walls depicting the life of the cathedral. I enjoyed being about to sit quietly, look up at the lofty ceiling and enjoy the organ music that played on the day we visited. There is a requested donation of $10 to enter the cathedral.\nShow less"], ["Reviewed September 10, 2017", 4.0, "Wedding visit", "I attended a wedding here this weekend.I have never visited before despite living in the bay area for several years.The cathedral is an impressive building,and reminded me somewhat of cathedrals in my native England.Very nice wedding service too.\nWorth a visit if you are in San Francisco.Very close to downtown area and attractions.\nShow less"], ["Reviewed September 9, 2017", 3.0, "Weird cathedral", "All in all this is a pretty weird cathedral, worth visiting for its curiosity value. It appears to be concrete gothic. There is no vault on the nave, it is just open to the roof. There is a copy of the Chatres labyrinth. The stained glass has peculiar iconography, including E=mc2. There are various icons around the church, including Martin Luther King (who appears to have been beatified) and John Donne (likewise)! Keith Haring altarpiece (AIDS). The west organ case is under-sized (not that I am picky ...). Didn't coincide with a service. Cathedral is in a nice area of town, but walking distance from downtown.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Beautiful church", "This cathedral is sitting on top of a hill. The architecture is amazing and reminded me of the Notre Dame Cathedral in Pairs. The stained glass inside is very beautiful too."], ["Reviewed August 30, 2017", 5.0, "Massive Cathedral at the top of Nob Hill", "It's worth the walk up to Nob Hill to see Grace Cathedral. The Cathedral is massive, has beautiful unique stained class windows (find FDR, Einstein, and others in the stain glass windows) and beautiful architecture. The cathedral hosts yoga once a week and frequent concerts. It's worth the walk up Mason from the Powell BART station. While there check out the Fairmont Hotel and the Mark Hopkings Hotel.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Take a short break", "The cathedral is a wonderful place to take a break from walking the hills and sit and enjoy the feeling of this place"], ["Reviewed August 27, 2017", 5.0, "Tune to the spirit you hear", "A wonderful Cathedral. A house of prayer for everyone. Not to be missed also are the many works of art, and windows and murals which tell the story of the early settlers, the 1906 earthquake and endeavours of many well known Americans."], ["Reviewed August 23, 2017", 5.0, "Beautiful!", "The cathedral is beautiful with many large stained glass windows.\nThe high point is the labyrinth (actually there are two, one inside and the other out) where you can walk meditatively to the center and out again. I always enjoy staying in the center a while and looking around at the splendor of the sanctuary.\nShow less"], ["Reviewed August 23, 2017", 4.0, "Beatifully Calm", "Worth taking the time to visit this site.\nA massive religious building at the highest point of the city.\nStunning architecture from the outside ; fabulous stained glass windows inside.\nVery welcoming to people of all faiths or non.\nLucky enough to visiting just as a wedding party was leaving.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Wonderful welcome at this Anglican Cathedral", "The worship was upliftling and the music superb - a welcome presence in this bustling city. I was warmly welcomed by congregation and staff alike. Their commitment to inclusiveness is heartening."], ["Reviewed August 17, 2017", 4.0, "A different cathedral !", "This beautiful cathedral justifies a visit - not so old , located at a high point and it has a special story that you better hear from an expert !"], ["Reviewed August 16, 2017", 3.0, "Quite interesting", "New cathedral so can't really compare with the greats in Europe but we enjoyed our stroll round accompanied by The Enigma Variations as the organist was practising. The murals were special to San Francisco"], ["Reviewed August 13, 2017", 4.0, "Classic Church with majestic interior", "If you want inspiration or mediation. then a visit her will meet your need. Beautiful stained glass and vaulted ceilings."], ["Reviewed August 10, 2017", 4.0, "walk the labyrinth", "At Grace Cathedral one can walk an 11-circuit, Chartes style labyrinth either outside or inside. Most people either didn't know or didn't care about taking a meditative walk, but doing so can help restore one after the busyness of visiting downtown San Francisco."], ["Reviewed August 8, 2017", 5.0, "Amazing", "Donation of $10.00 is accepted to view the inside of the Cathedral. Well worth it, for taking some photos and to say a prayer."], ["Reviewed August 8, 2017", 5.0, "Beautiful!", "I walked into this cathedral on a whim because we were staying nearby. I have been to San Francisco many times but never thought to come here. It reminds me of the beautiful old churches in Europe with incredible stained glass windows, little chapels on the side, soaring ceilings and beautiful details throughout. I went on a Sunday afternoon and there were only a few others inside so I was able to sit quietly and appreciate the beauty. Definitely a must do if you are in the area.\nShow less"], ["Reviewed August 6, 2017", 5.0, "A modern antique", "Worth a visit even for nonbelievers, this fairly new Cathedral (completed in the early 60's) is designed in an antiquated style not unlike many of the great Cathedrals--Notre Dame, for instance.\n\nFrom the street, you'd guess it to be several hundred years old. Then you get inside and see stain glass windows that celebrate recent achievements--like John Glenn in space. It's a real trip--and what could be better in San Francisco than that? Don't miss it!\nShow less"], ["Reviewed August 4, 2017", 4.0, "Can't miss", "Touristy but a must do when in San Francisco. Pier 39 is actually a bit better but there are just certain places you have to see and this is one of them!"], ["Reviewed August 3, 2017", 5.0, "WOW - spectacular", "This was a great way take a moment and reflect during our busy vacation. What a spectacular place.. the architecture, stain glass windows and the amazing music were simply awesome. Really glad that me made time for this!"], ["Reviewed August 1, 2017", 5.0, "Something different", "I am an atheist but Cathedrals are often fascinating places to visit. This is no exception. As a European, I am used to Cathedrals that have a long history and date back from very different times. Being a young country, American cathedrals are different and Grace Cathedral, despite the traditional architectural style, is actually a pretty modern building. Construction started in 1927 and was largely completed in 1964. It combines old and new with stained glass windows depicting copies of ancient European glass and astronaut John Glenn, for instance.\n\nThe Cathedral reflects a rather different view of life and religion and actively welcomes people of different faiths and none. It has been used by many key historical figures to give their messages to the people with Martin Luther King, Desmond Tutu and the Dalai Lama all having preached here. It has an AIDS interfaith chapel. It is an interesting place and provides an oasis of tranquillity to reflect on where this chaotic society is headed.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Stunning", "Worth a stop. Spectacular stained glass and stunning architecture. Be sure to check out the brass doors on front of cathedral"], ["Reviewed July 22, 2017", 5.0, "Worth the climb up the hill", "We arrived on foot from Montgomery BART station - its a long steep climb - you could get a cable car most of the way. The Cathedral inside is stunning. There is a lot of stain glass including a new installation this year. The painting on the walls are also worth a look - one commemorates the found of the UN in San Francisco and one the earthquake and fire. There is no admission fee as such but a donation is requested,\nShow less"], ["Reviewed July 22, 2017", 4.0, "Beautiful", "Nob hill location with a nice green park across the street.\nLarge space with an open feel. Stained glass windows and murals line the walls. There's a labrynth at the entrance. The outside has some church related buildings and a courtyard. Yet another labrynth here.\nI enjoyed the visit. No fee to enter, but you can make a donation.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Beautiful cathedral", "We followed a 'lonely planet' walking tour which took us here. It was a beautiful oasis of calm and felt a million miles away from the rest of San Francisco. If you're I've got time and your in this part of the city then you must see it.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Graceful Grace Cathedral", "An historic cathedral, dated back to Gold Rush year of 1849. It is rebuilt from 1927 with Gothic style, since the original one was destroyed in the earthquake and fire in 1906."], ["Reviewed July 19, 2017", 5.0, "European inspired beauty", "A peaceful moment of escape from the city, this beautiful church is a must see if you appreciate religious architecture. Atop Nob Hill, near the Mark Hopkins and Fairmont Hotels."], ["Reviewed July 19, 2017", 5.0, "Gorgeous inside and out", "I attended the 8 am service in the beautiful chapel and then had plenty of time to tour the cathedral ahead of the next mass Art work, old and modern,i s amazing, particularly Jacob's Ladder. Loved the gardens too."], ["Reviewed July 18, 2017", 5.0, "Be Sure to Check Out the Labyrinths", "Enjoy visiting this beautiful historic church atop Nob Hill, with its outside and inside Labyrinths."], ["Reviewed July 14, 2017", 5.0, "Beautiful Landmark of the City and the Nob Hill", "This is an active Episcopal Cathedral, so you can visit services if you wish. It is located within a walking distance from Fairmont Hotel, The Ritz-Carlton Hotel, Pacific-Union Club( men only), Huntington Park, and The Masonic Grand Lodge of California. Stop by on Sanday at 11.00 am or 3.00pm, or on Thursday at 5.15pm for the services and to enjoy live choral music\nShow less"], ["Reviewed July 10, 2017", 5.0, "Wow", "You don't have to be religious to visit this amazing Cathedral. It says it's a place for all faiths...and that's rare these days. I was moved by the wonderful tribute on display to those who have lost their lives to AIDS...a beautiful memorial quilt. Go and see it...and be thankful to advances in medicine and for a more tolerant society.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Grace Cathedral-huge", "I am born & raised in San Francisco and finally had the opportunity to visit Grace Cathedral a few months back. What a beautiful church. Worth the visit!--Finally"], ["Reviewed July 7, 2017", 4.0, "Solemn, large, beautifully constructed church from a few decades ago.", "This was a stop on our bus tour and was a beautiful sight to take in. The interiors we're quote, solemn and open to the public."], ["Reviewed July 4, 2017", 4.0, "Beautiful Architecture", "My husband and I took a long walk from Union Station and came across this beauty. The light of the golden hour shone upon her making her architecture gleam. In the courtyard, a man was doing tai chi. It was beautiful watching him practice his art in the shadows of the cathedral. I could tell the church was active by the people waking around and going in and out. I know this stop will not be for everyone. However, it was very beautiful and peaceful for me.\nShow less"], ["Reviewed July 4, 2017", 4.0, "The architecture is worth a visit", "This is a huge and beautiful church. The architecture is worth a visit. There is a Labyrinth inside and outside the church where one could go through. Its a great place to take a relaxing break to enjoy this site. It is on a busy commercial street.\n\nTIPS\n-The California Cable Car line runs directly in front of the cathedral.\n-There are restrooms that may be used by the public inside the cathedral.\n-They do ask for a suggested donation to enter, but its your choice. Its not mandatory.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Beautiful building", "A beautiful cathedral inside and out. Lovely stained glass with historical context, mural display inside of war heroes, display information about the history of the cathedral."], ["Reviewed June 26, 2017", 5.0, "Absolutely Beautiful", "This cathedral is one of a kind and worth the walk from wherever you are staying. Beautiful Tiffany glass with towering ceilings. Come and meditate for a few minutes or make a prayer request. If you are in town on a Sunday go to a service.\nShow less"], ["Reviewed June 25, 2017", 5.0, "The best parking near the Fairmont!!!", "Grace cathedral had the best parking near the Fairmont. $33 a day and it's covered parking. You get to park your own car and keep the keys. You can't go in and out but if you don't need to this is the best place to go. Friendly personnel too. Crocker was horrible!! $40 and your car is left in the sun and comes back smelling. They keep your keys there too. I don't like that.\nShow less"], ["Reviewed June 21, 2017", 4.0, "Worth visting for the interfaith AIDS memorial chapel.", "The cathederal itself is pleasant if unremarkable. What is definitely worth a visit is the interfaith AIDS memorial chapel. It is a quiet place to reflect and think of those people affected, including the artist Keith Haring, whose last work was a spectacular altar which sits in this chapel. They also display segments from the AIDS memorial quilt which I think they must rotate periodically.\nShow less"], ["Reviewed June 21, 2017", 2.0, "Not much to see", "Maybe I've seen too many churches & cathedrals in Europe so am biased, but this was not a very pretty church. It is very dark and gray on the inside. The stained glass windows are pretty but everything else is very plain. Not sure it's worth a visit.\nShow less"], ["Reviewed June 18, 2017", 4.0, "Beautiful!", "I love the meditation maze, and there is a duplicate outside if you can't access the one inside. You can buy a small replica in the gift shop, too. This cathedral is lovely!"], ["Reviewed June 17, 2017", 5.0, "Absolutely beautiful landmark", "As we walked up to the Grace Cathedral, we were immediately struck by the gold gilded doors and the engravings on them. The church is huge, very old, adorned with stained glass. A truly impressive site."], ["Reviewed June 15, 2017", 5.0, "A Nob Hill Icon.", "Don't miss to visit this multi denomination church in Nob Hill. It depicts the history of SFO in the paintings on the wall. The stained glass are stunning and the copper plates design on the church doors are similar to churches in Europe. Outside the church facing the city is a wonderful photo op.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Stained glass central", "Grace Cathedral is an amazing experience with the Rose window designed from a window in the Chartes Cathedral. It is a quiet oasis right at the top of Nob Hill. There is a labrynith in the center where people can walk or there are yoga classes taught there.\nShow less"], ["Reviewed June 9, 2017", 5.0, "Extraordinarily lovely.", "Just a short way up Nob Hill from The Fairmont and The Mark Hopkins (if you are going by cable car to either of those, get off at Grace Cathedral and after touring the Cathedral, walk DOWN the hill to the hotels - much easier!), this lovely cathedral, serving an active Episcopal congregation, is a jewel. Exquisite side chapels to view, plus murals along both walls in the sanctuary that the artist painted with a layer of gold before he did the actual pictures. When the sun hits those murals with that gold background and highlighting, the effect is stunningly brilliant. Stained glass windows are under repair/renovation and there is a fascinating video available detailing just how this process works. Amazingly enough, every single little piece of stained glass is removed, cleaned, and replaced. Just so much to see.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Stunning", "Stunning building built in the style of Notre Dame and Chatres Cathedrals in France. Stained glass is spectacular. Catch a choral evensong on Thursday evening - a wonderful musical experience. Easy ride on the California street Cable Car stops right across the street. Free entry, donations requested.\nShow less"], ["Reviewed June 5, 2017", 4.0, "This will remind you of the great cathedrals of Euope.", "This beautiful cathedral is worth spending some time in absorbing the atmosphere and the quiet. It is or should be a spiritual time for visitors."], ["Reviewed June 3, 2017", 4.0, "Beautiful inside", "It was part of our tour and very interesting. The stained glass windows were beautiful. It is free to tour and the grounds were also very pretty."], ["Reviewed May 30, 2017", 4.0, "Wonderful", "While this Cathedral did not have the same impact on me as St Mary,s it is a superb building and well worth visiting ,a great space,with its mix of the old and the new, the Jacob,s Ladder installation was memorable.A place where one can feel uplifted.\nShow less"], ["Reviewed May 27, 2017", 4.0, "Beautiful gothic cathedral", "I adore European churches for their architecture and found Grace Cathedral to be equal or surpassing many of the fine churches in which I have found peace and serenity. It is a beautiful place. I was fortunate to be staying in a hotel only a block away so very pleased that I could visit it more than once. Stunning stained glass windows. Quiet serenity during the week. In fact, I was alone on both occasions. I understand this is a tourist stop so try visiting on off hours. Highly recommended.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Beauty", "There are two labyrinths at Grace Cathedral, one indoors and one out. Although it is a tourist stop, the Cathedral's function as a place of worship and service is visible everywhere. Walking the indoor labyrinth was an amazing experience."], ["Reviewed May 24, 2017", 4.0, "Quiet and serene", "Beautiful church with fine art and stained glass windows and interesting history. Stroll around the exterior and see one of its two contemplative mazes, the other is inside. Take it all in as a part of a walking tour of the Nob Hill area."], ["Reviewed May 24, 2017", 5.0, "A Nob Hill Beauty", "This beautiful gothic cathedral stands almost defiantly in a city whose bus tours tout naked skateboarders and Haight-Ashbury stoners. From the trompe l'oiel stairs to the medieval labyrinths to the carved wood quire it is a place of many virtues. Enjoy the small park across the way, too--a good place to sit and people- and/or dog-watch.\nShow less"], ["Reviewed May 23, 2017", 5.0, "A stunning peaceful spot in the middle of the city", "I love cathedrals and this is one of my favorite American ones. Huge, gothic and beautiful. As I did on my last visit I walked the labyrinth outside and then sat in the park across the street and watched the dogs play. A calming and restful hour.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Beautiful", "This Church is so amazing. Lots of history and beauty. Beautiful Stain glass and architectural. Statues and it makes you fell so safe."], ["Reviewed May 18, 2017", 4.0, "Very nice and great location", "We enjoyed this cathedral very much. It is a beautiful old cathedral. The stained glass inside is particularly memorable. It is located on the top of knob hill. Beautiful view. Stop on the grand steps outside and take in the view and the excellent feel of this non-denominational cathedral. Very nice.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Wonderful sacred inspiring", "After a stay at the ritz and indulgence we went to this sacred church not guilty just inspired wonderful choir moved to joy"], ["Reviewed May 13, 2017", 5.0, "Take a step back in time", "Unbelievable to visit this historic monument and we enjoyed a Sunday service that included the Grace Cathedral Choir of Men and Boys. What an amazing experience and the best part is it's free. The boys are professional musicians they are amazing to listen to voices like butter. The church is very welcoming to everyone and it is incrediable to sit in such a majestic place and listen to the voice of angels. Thank you Grace Cathedral\nShow less"], ["Reviewed May 13, 2017", 5.0, "Heavenly Treasure in San Francisco - Jacob's Dream a Luminous Path", "Grace Cathedral was a couple of blocks from my hotel and I went early to take a peak inside. This cathedral quickly transports you to medieval style European cathedrals, with the climbing concrete arches, artistic stained glass windows and recessed sanctuary, typical of Episcopalian style churches.\n\nUpon climbing the steps you will see the golden door complete with tin stamping of the history of the founders. Inside the baptismal font is at the back, near a labrynth for walking meditation for prayer. The morning sun came through the artistic stained glass windows making a pattern on the floor and drawing attention to the wall murals which tell the history of California, the missions and founding peoples of this church.\n\nThis church was very ecumenical - it had an open chapel area devoted to Mary and an arched hallway beside with small candle lit prayer kneelers, along a hallway reminiscent of a castle walk way, with hanging tapestries and a feeling that King Arthur would walk through at any moment.\n\nOne chapel that moved me was the chapel dedicated to those who have passed from Aids - with the religious symbol for every denomination on earth, to all those lives who have been touched by this tragedy. There one could light a candle and spend time in prayer for lives lost.\n\nThe artists in residence had a hanging luminated ladder - Jacob's Dream a Luminous Path hanging in the church. The lights shining from the stained glass really brought it to life, but until i looked at it from the other side that is what moved me the most. The light showed a pattern of souls walking down the ladder to greet the souls coming up the ladder - it was breathtaking and perhaps the most moving experience to see this work of art. Took my breath away.\n\nAlso - there is another meditation labrynth outside of the church as well. Parishoners were meeting there as friends and walking it together - beautiful. Inspiring\n\nGrace Cathedral is a must see - next time I will be there for a church service. No entry fee, just request a donation.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Beautiful and peaceful oasis in the city", "Although this looks like a typical gothic cathedral from outside it has some interesting features within. The labyrinth is worth taking time over. There is also some new stained glass that we appreciated. You will be rewarded if you take time out here."], ["Reviewed May 9, 2017", 5.0, "nearer to God", "a wonderful monument to religion great location - great history - worth seeing - well executed - read the history -"], ["Reviewed May 3, 2017", 5.0, "What A Surprise", "This is a reproduction of a mediaeval-style British cathedral in concrete. Built after the 1906 quake. Stil unfinished, it is light and airy and has a wonderful philosophy and a great vibe. Volunteer guide ( Judy)was incredibly knowledgeable, welcoming and open to information about European cathedrals. some great modern art there particularly an installation about Jacob's Ladder. Stunning.\nShow less"], ["Reviewed May 2, 2017", 5.0, "The sung eucharist was a soulful treat", "Went a few minutes late but wad graciously welcomed. The boy and mens choir is such a gift to the soul. The choir director uses the stone of the cathedral to bounce sounds off for voice blending and contrasting.\n\nThe AIDS chapel has a Keith Haring triptych on the altar which is very moving.\n\nAccessible bathrooms, cafe, poor gift shop.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Architectural Gem", "It's great to see that the U.S. has architecture to rival Europe. This cathedral has beautiful stained glass window, marvelous woodwork, with intriguing entry steps."], ["Reviewed April 28, 2017", 5.0, "Magnificent cathedral featuring artists in residence & contemporary Jacob's ladder", "During our visit, we were thrilled to experience \"Jacob’s Dream: A Luminous Path\", which is an installation of light and moving images designed to evoke a pathway between earth and heaven, between the visible and invisible. To find such a work, inside an already famous Episcopal cathedral was exciting. The cathedral is known for its mosaics by Jan Henryk De Rosen, a replica of Ghiberti's Gates of Paradise, two labyrinths, varied stained glass windows, Keith Haring's AIDS Chapel altarpiece, medieval and contemporary furnishings, as well as its forty-four bell carillon, three organs, and choirs. You can be a student of architectural and/or civic history when you visit, or you can just walk the labyrinth and contemplate. When you visit, you will not be disappointed; you may even find out more about yourself and who you really are. For a small donation ($0.25), you can purchase postcards of the cathedral, its current art installations etc., far below what you'd pay at local markets or gift shops.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Beatiful Cathedral", "This is a beautiful cathedral. Gorgeous high altar and chapel which were decorated with Easter flowers. Well worth a visit."], ["Reviewed April 24, 2017", 5.0, "Peaceful respit", "I was not disappointed with my visit to Grace Cathedral. I wanted to go especially to walk the labyrinth. It was a profoundly moving experience. As a recent widow I was looking for a spiritual experience while vacationing. This cathedral is a marriage of the traditional and the modern. The stained glass was magnificent and provided a contrast to many of the modern sculpture, especially the contemporary Jacobs ladder. I was especially impressed by the mural around the walls. I loved that there was an picture of Martin Luther King Jr.. The AIDs chapel was a wonderful tribute to those struck down by the disease. The gift shop and cafe were great. lastly I was able to light a candle for my dear husband.\nShow less"], ["Reviewed April 16, 2017", 5.0, "spectacular cathedral", "very beautiful Cathedral with vibrant colorful windows. What I liked best was that it is all inclusive and actually also has a memorial for the AIDS epidemic. very serene and peaceful."], ["Reviewed April 16, 2017", 4.0, "Beautiful stop near Wharf area", "Grace Cathedral was a splendid stop on our way from Union Square to Wharf, however, having seen it I would recommend people to make it a pitstop and not just a random chance occurence. The architecture is really amazing and the surrounding area with all the greens and the beautiful backdrop make it a worth the visit. The stained glass at the cathedral is marvelous and very photo-worthy.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Beautiful and solemn stop", "It's a beautiful cathedral on its' own, but well worth visiting simply because of the beautiful stained glass windows, the labrynths (inside and outside) and the AIDs chapel. Nice gift shop and coffee station downstairs."], ["Reviewed April 11, 2017", 5.0, "A peaceful respite from the world outside", "We are not church-goers but we loved spending some quiet, contemplative time in this beautiful edifice. It offers a peaceful respite from the world outside. The stained glass windows are marvelous, as is the architecture around them. We enjoyed walking the labyrinth inside."], ["Reviewed April 10, 2017", 4.0, "Meditation", "Quiet, serene, and inspiring. Not quite Norte Dame or St. Patrick's cathedral, but breathtaking all the same. The one element missing was a docent to share information about the church and background. The labyrinth was worth the \"walk\" to meditate as you strolled the path. We also were glad we headed downstairs to the gift shop to learn more about the leaders of the church and the labyrinth. Jacob's Ladder was also an added piece of work to compliment the stained-glass windows and alter work.\nShow less"], ["Reviewed April 7, 2017", 5.0, "Graceful.", "Right on top of Nob Hill the cathedral is a touch of Europe set down in California. Take time to check out the murals detailing Californias history along the walls and linger in the AIDS chapel with the Keith Herring altar piece. Look out for the huge nativity scene placed high up on the wll of a side chapel.\nShow less"], ["Reviewed April 4, 2017", 5.0, "So blessed!!!!", "We wandered into this cathedral intending to take a few photos and move on...but we were in for a surprise! Inside there was a magnificent concert going on! We were allowed to enter the cathedral, where we stood at the back, mesmerised for 20 minutes as we listened to angelic voices in a magnificent choir - singing without microphones, yet the acoustics in the cathedral projected their voices perfectly! Someone played the pipe organ too - WOW!!! We'd seen plenty of pipe organs in cathedrals throughout our travels, but had never before actually heard them being played...WOW!!!!\n\nWe were so blessed by this experience!\nShow less"], ["Reviewed April 3, 2017", 5.0, "Beautiful and welcoming.", "Welcoming and well done informal service. (Times probably Vary but the website seems updated.) We were pleasantly greeted by friendly people in a beautiful space. It is hard to welcome tourists and worshippers at the same time and they seem to have a great ministry of hospitality.\nShow less"], ["Reviewed April 2, 2017", 3.0, "Peaceful place to rest for a moment while walking around the city", "This was a peaceful place to sit and rest, and ponder a bit. It is a lovely church, and quite striking in its scale, compared to the buildings around it."], ["Reviewed March 23, 2017", 4.0, "Grand Cathedral", "This is probably San Francisco's most grand church, classic gothic architecture. Very dignified and worth a quick visit."], ["Reviewed March 21, 2017", 5.0, "Where the U.S. labyrinth movement originated", "I take the cable car up to Grace Cathedral every visit to San Francisco to walk the labyrinth. Afterwards, I stop in a t the small park in front to people watch before taking the cable car back to Union Square."], ["Reviewed March 21, 2017", 5.0, "Beautiful Space", "Grace Cathedral is an Episcopal Cathedral that sits atop Nob Hill. The Cathedral is beautiful and well maintained. If you enjoy meditating while walking a labyrinth, Grace has two, one indoor, one outdoor. I would also recommend attending a worship service. The ushers/docents met in the back of the church after the 11:00am Sunday service I attended in order to give a tour of the cathedral. There is also an app that you can download to take a self-guided tour or brochures in the back that tell more about the stained-glass, statues, and other items of interest. Check their calendar, too, to see if there are any concerts at the cathedral. The acoustics are amazing.\nShow less"], ["Reviewed March 19, 2017", 5.0, "Gorgeous, peaceful place", "Full disclosure: I am not a religious person and tend to stay away from churches. But I was in the area and had heard it was beautiful so popped in. I met several staff who were very friendly, smiling and welcoming. It had a very open, caring feel to it. Inside the church itself is utterly gorgeous with old, dramatic stained glass windows plus newer things like a labyrinth that was being used consistently in the 20 mins or so I was inside. They also had a light art sculpture of some sort that caught my eye. They seemed to be trying to reach out to anyone looking for a faith connection. It was lovely.\nShow less"], ["Reviewed March 18, 2017", 4.0, "Geat Place to Attend.......", "services, I am sure, but we were there for an organ concert. The acoustics are great, the architecture is amazing and the famous indoor labyrinth is great for meditation (when no tourists are walking and hopping through it)."], ["Reviewed March 13, 2017", 5.0, "Beautiful church", "We happened by the church as we were on our way to the Golden Gate Bridge. There is a park across the street so we parked and went inside. It is worth the trip if you like visiting churches. We did not attend a service."], ["Reviewed March 13, 2017", 4.0, "Not just a church", "Grace Cathedral is Nob Hills landmark cathedral. It doesn't matter what faith you are to experience the exquisite architecture . The majestic design. Do go for the circular meditation floor Mandela. Tuesday early evening Yoga sessions. What a great place to do a mediative yoga session. Get there early as it does fill up quickly. You can rent a mat or bring your own .\nShow less"], ["Reviewed March 12, 2017", 4.0, "Kewl", "This is a kewl old building and one of the pretty jewels of the city that makes me smile every time I drive past it."], ["Reviewed March 12, 2017", 4.0, "Despite the religiosity of it, there was a non-judgmental feeling to the place.", "Quite worth a visit for a number of reasons: 1. Architecture 2. Grandure 3. Welcoming 4. Maze 5. Live music on Friday 6. Free 7. Great location"], ["Reviewed March 3, 2017", 4.0, "E = mc²", "Built in the glory days for San Francisco and when more people still believed in God.\n\nA truly beautiful Episcopal Cathedral with some of the most beautiful and interesting stained glass windows I have ever seen. I dare you to find the Einstein window which features the famous E = mc². If you do not ask where it is, you will end up exploring and being amazed by all the unhidden treasures in the church. The Rose Window will remind you of the best in London or even Chartres in France.\n\nSo lucky was I to happen a visit last night at 5:15 when the Grace Cathedral Choir of Men and Boys, one of only a handful of remaining Episcopal men and boys cathedral choirs, entered the Choir and filled the cathedral with song.\n\nPossibly walk the inside or outside labyrinths and meditate why it is there....or why you are.........\nShow less"], ["Reviewed March 1, 2017", 4.0, "Peaceful Oasis", "Grace Cathedral provided a peaceful and contemplative oasis in the middle of a day of conferences at the Fairmont. I was lucky enough to be visiting the Cathedral while the organist was practicing and enjoyed sitting in the chairs and listening to the music. It is a lovely cathedral and worth the time to visit.\nShow less"], ["Reviewed March 1, 2017", 5.0, "Stunning inside", "Heard the bells long before I found this cathedral. It was beautiful inside. The windows were incredible. When I was there the choir was practicing, which made for a surreal experience that I was lucky to stumble across. Worth visiting for a few minutes or more.\nShow less"], ["Reviewed March 1, 2017", 5.0, "Beautiful landmark of SF", "Take a break, and enjoy a quiet moment in one of SF most beautiful churchs. Great history - do some homework to really appreciate what you are seeing - before you go!"], ["Reviewed March 1, 2017", 5.0, "Beautiful, Inspiring, Surprising!", "My first visit (and there will be more!) to Grace Cathedral was a spur of the moment decision. I was amazed by the beauty of this cathedral. And the beautiful art installation (lights) called \"Jacob's Ladder\" was a thought provoking feast for the eyes."], ["Reviewed February 28, 2017", 5.0, "Lovely!!", "If you're in the city, do try to visit race Cathedral. Beautiful interior in the European style, and a very memorable chapel to remember those who left this earth far too early due to the AIDS crisis. The space brings a sense of tranquility, something that we need at this time in our crazed world.\nShow less"], ["Reviewed February 18, 2017", 4.0, "Great according to US standards", "When I compare this cathedral with other churches I've seen in the States it's a beautiful church. The stained glass windows are impressive and when you're lucky the choir has a rehearsal. So, eye and ear will experience the profound atmosphere in this cathedral. But please don't compare it with an awful lot of European churches. The often medieval atmosphere is really different. You see and feel the age of such a church with often the damages of centuries visible as a token of old age. Here you see a beautiful church where all is perfect and perhaps that's a major difference. But still the Grace Cathedral is absolutely a place worth visiting!\nShow less"], ["Reviewed February 11, 2017", 5.0, "Could Be in Europe", "After many visits to San Fran over the years, finally made it to this iconic destination (closes at 6 weekdays, which is why historically have not been able to visit)...if you can walk up all the hills and then the steps to the cathedral and still breathe, all good inside from the flying buttresses to the incredible stained glass windows. Just a magnificent architectural wonder reminiscent of the best of European cathedrals. Worth a visit.\nShow less"], ["Reviewed February 5, 2017", 4.0, "Beautiful", "Wonderful to just check out the building. A beautiful place to worship - always something happening here"], ["Reviewed February 4, 2017", 4.0, "Magnificent Cathedrals", "At the top of the hill. Majestic. In a lovely area. Have a look and head downhill to Chinatown. We did the all uphill from Fishermans Wharf up Taylor Street which, as expected, was quite a walk!! If you don't want that take the Cable Car or Uber. Worth the visit.\nShow less"], ["Reviewed January 27, 2017", 5.0, "Visiting Family Tour of San Francisco", "Grace Cathedral is a place that I always recommend to tourists visiting. It is incredibly beautiful and rich in history. If you are trying to attend yoga there, best get there very early as space is limited."], ["Reviewed January 26, 2017", 5.0, "Stunning church", "We were in the city for a trip and decided to stop here. This church is huge and breathtaking. There are many details and candle lighting areas. The stained glass is gorgeous!"], ["Reviewed January 23, 2017", 3.0, "Labyrinth and stained glass", "With all respects, but living in and traveled all over Europe this Cathedral counts into average ones. It is nice, built in Gothic style and it reminds on Paris' Notre Dam on a lower scale.\nIt is right opposite the famous Fairmont hotel across a nice park. The California cable car line runs beside so it's easy accessible.\nBest parts are the stained glass windows and the labyrinth at the entrance.\nShow less"], ["Reviewed January 21, 2017", 4.0, "Beautiful (Check out the audio tour app)", "Located in Nob Hill area, this place is beautiful. They also have an app with guided audio tour to know more about the Cathedral."], ["Reviewed January 19, 2017", 5.0, "Beautiful building, great music performances", "We stayed at the Fairmont Hotel, which is about a block from the church. We visited the church during the day and had an enjoyable chat with Rev. Stanford. His knowledge about the building and congregation was great. The church has become a place for the community to do more than attend worship. The community yoga class has an amazing number in attendance. The church has several music groups and also special concerts, so check their website for events. The building itself is great for pictures both day and night.\nShow less"], ["Reviewed January 16, 2017", 5.0, "Grand Episcopal Church", "amazing colorful glass window! they have in house artist that show casing the art works. have a good small boutique selling cool stuff."], ["Reviewed January 12, 2017", 5.0, "Beautiful and relevant", "Even if you don't like churches, I reckon you might like this one. Inclusive and non-denominational, Grace Cathedral fits it's community perfectly. The labyrinth and stained glass make this just a little different and the Jacob's Ladder light installation sounds weird but is absolutely stunning. I'm glad we stopped in.\nShow less"], ["Reviewed January 11, 2017", 5.0, "\"Grace\" is the perfect name for such a stunning cathedral!", "Grace is the perfect name for such a stunning cathedral! From its architectural beauty to its mission of being an \"open and accepting\" community this is a must on any trip to San Francisco. The current cathedral is descended from Grace chapel which was founded in the year of the gold rush; 1849. From there it has been rebuilt after the 1906 earthquake and the current building was begun in 1927 and finished in 1964. This cathedral was built in the French Gothic style by architect Lewis Hobart.\n\nStart by climbing the imposing steps to the front doors of this majestic cathedral and see the \"Doors of Paradise\" which were molded from Ghiberti's Baptistery doors of the Duomo in Florence, Italy. From here, enter and pick up a brochure from one of the docents at the information desk. In front of the information desk is an inlaid Labyrinth; one of two that can be found at the cathedral (the other can be found in the outdoor courtyard). Next, head to the AIDS Memorial Chapel which holds a rotating portion of the \"AIDS quilt\", tritych alterpiece by artist Keith Haring, and the symbols from many world religions.\n\nFrom here head down the nave and look at the wonderful murals which depict San Francisco city history (notably the 1906 fire). Also look up to the majestic stained glass windows which have a range of biblical, social, and also scientific themes. Look for the Einstein window and the \"universe\" window! Walk up to the front of the cathedral and look at the various pieces of art in the cloisters and notable the pulpit which has hosted the likes of the Dali Lama, Doctor Jane Goodall, Rev. Dr. Martin Luther King Jr., presidents and Desmond Tutu.\n\nCheck out the website or ask a docent for a schedule of choral and evening song worship to be able to hear the majestic organ and Grace choir. Last and not least, make sure that you visit the gift store (the staff was extremely friendly) and cafe on the ground level for some mementos and interesting gifts!\nShow less"], ["Reviewed January 10, 2017", 5.0, "Beautiful Cathedral", "The cathedral hosts a resident artists. The current project is called Jacobs ladder. It's a led light display interpretation of the biblical Jacobs Ladder. I found it very interesting. Look at it when you arrive and check it out again before you leave, as the colors and video change.\nShow less"], ["Reviewed January 2, 2017", 4.0, "Beautiful modern take on Gothic architecture", "Built of steel and concrete in the early to mid-20th century, this cathedral has some absolutely magnificent stained glass windows. Those who have been to Chartres Cathedral outside Paris will recognize the labyrinth as a copy the one there. Another version is outside in the lovely garden where you can either walk the maze yourself, or sit quietly and observe others in their meditative walks. We went on a Sunday morning about an hour before a service and may I applaud the welcome extended by several volunteers scattered throughout the space. I was raving over a large stained glass window that was a solid gold color in class that varied in thickness and texture. A volunteer overheard and was nice enough to tell me that this was a temporary window, there while the real window was being repaired. We laughed about his having helped me avoid sending people to SF to see this marvelous gold-colored window!\nShow less"], ["Reviewed January 2, 2017", 5.0, "Gorgeous cathedral with history", "This cathedral is worth walking in and viewing the stain glass and reading the history. The architecture alone is a site to see. If you walk, it is easy to find but up one of San Francisco's traditional steep hills."], ["Reviewed December 29, 2016", 4.0, "Modern Cathedral", "Travelled past this a number of times and decided to step off the cable car to have a proper look. Very glad I did. Very peaceful compared to the noise and mayhem outside! Lovely interior and vast. Check out the modern take on a labyrinth. Good modern stained glass windows with vibrant colours. Do not miss a look at the ceremonial external doors. Good history display. Well worth stepping off the cable car.\nShow less"], ["Reviewed December 23, 2016", 3.0, "Pop in if you have a chance...", "Nice Cathedral, lovely stained glass. I guess Im spoilt by living in Europe! But if you happen to go past (and one of the main cable car rules does take you there) drop in for some tranquility. They have concerts there and I happened to hear an orchestra rehearsing which was lovely...\nShow less"], ["Reviewed December 18, 2016", 5.0, "Wow!", "Located high on a hill, Grace Cathedral offers you a stunning view of San Francisco, but what is inside is even better. A labrynth where you will see people walking in meditation, religious art and a beautiful place to worship. The history of Grace Cathedral captures the mind.\nShow less"], ["Reviewed December 12, 2016", 4.0, "Christmas at Grace Cathedral", "What a beautiful Christmas concert at Grace Cathedral. Not only is the Cathedral gorgeous but the concert was entertaining and would definitely recommend it for anyone that has young children (babies-10), and it's also joyful for adults too. Christmas songs, watching the little ones interact with the performers during the show...delightful.\nShow less"], ["Reviewed December 7, 2016", 5.0, "visit to Grace Cathedral", "Great way to use the cable cars for actual transportation. Get the cable car near Fisherman's Warf, take it to within a couple of blocks of Grace Cathedral, walk to Cathedral. When you leave the Cathedral walk to Chinatown for some food and grab a cable car back to The Warf or to Lombard Street.\nGrace Cathedral is magnificent to see. Absolutely beautiful, and so large on the inside you have to catch your breath when yo first walk in.\nShow less"], ["Reviewed December 5, 2016", 5.0, "Beautiful church!", "Absolutely gorgeous. Definitely something to see. There is a \"recommended\" donation of $10, but not really enforced."], ["Reviewed December 1, 2016", 5.0, "Beautiful Church!", "This church reminds me a lot of the churches I've seen on travels to South America. They are so epic in terms of their construction and fine architectural detail. We didn't have the chance to go into the church, due to lack of time, but took plenty of pictures of the outside.\n\nThere is a park abutting the church grounds where you can picnic and relax. There are also some great restaurants surrounding the church within walking distance.\n\nI'm glad we made it a point to visit. You should too!\nShow less"], ["Reviewed November 29, 2016", 5.0, "Beautiful", "Happened to stop in while the choir was practicing for the 3pm choral service. Beautiful angelic voices were heard throughout the building."], ["Reviewed November 28, 2016", 5.0, "Breathtaking", "Massive cathedral inspired by French architecture. Built shortly after the fire. If you like architecture, history, art, etc you should check it out."], ["Reviewed November 27, 2016", 5.0, "Lovely", "Lovely..great pice of art...fantastic in and out...great location opposite of lovely park..so beautiful"], ["Reviewed November 25, 2016", 5.0, "Amazing, modern cathedral", "This is a pretty amazing, modern cathedral. It a giant cement building on a beautiful hill in San Francisco. Outside it's pretty basic, but definitely imposing. On the inside it's huge and cavernous. Tourists and locals should go out of their way to visit this place.\nShow less"], ["Reviewed November 23, 2016", 5.0, "Beautiful & Unique Cathedral in the Heart of Nob Hill", "I used to work near Grace Cathedral & it was not until recently that I decided to venture in. I am not a \"religious\" person but was raised Catholic so I can really appreciate a good cathedral. Grace Cathedral does not only offer wonderful masses, but they also have an amazing holiday choir that performs, along with Yoga classes, etc. Its very inviting and the interior is beautiful. I would highly recommend it, even if you are just sightseeing in San Francisco.\nShow less"], ["Reviewed November 22, 2016", 4.0, "Great music and Historic Setting on Nob Hill", "We went to the 11 am service on Sunday. A German choir sang before the service and the men and boys choir at the service. This is the full high church smells and bells treatment, but great music and setting and really nice people."], ["Reviewed November 21, 2016", 5.0, "The Architecture is unbelievable!!", "If you are looking for a picture perfect place to do some photography, then this is the place. Just be prepared for the hills you have to drive up/down.."], ["Reviewed November 21, 2016", 5.0, "Evensong", "Unforgettable Sunday Evensong at 3 p.m. Uplifting moments. The Coir did wonderful job, the holly message targeted us deeply. Thank you!"], ["Reviewed November 18, 2016", 3.0, "Beautiful Cathederal", "We stopped by for a few minutes to see the cathedral as we domino ,ost cities we visit. Itnisnquitw beautiful on the top of one of San Francisco's many large hills. Was quite taken back that was assign going into the cathedral that said they suggested a $10. Donation to visit the cathedral. I found that offensive. What's with asking people to pay to come into a church for a few quiet moments to be thankful for our many blessings. A donation box might not have been bad, but asking everyone to pay $10.....really?\nShow less"], ["Reviewed November 17, 2016", 5.0, "Beautiful Cathedral", "Grace Cathedral is beautiful. The architecture is awesome. The visit is very welcoming and inspiring."], ["Reviewed November 15, 2016", 5.0, "A stop on the Hop On/Hop Off night tour - worth doing.", "We stopped on the tour and were able to get off and inside the cathedral. They have a 'maze' on the floor and there was a yoga class being held - lovely to see, and the acoutics were amaxzing."], ["Reviewed November 13, 2016", 4.0, "WONDERFUL CATHEDRAL.", "a very nice place to visit, we stayed in china town so a 10 min walk, a park in front, nice to sit and have a rest, but beware tramps hanging around\ncathedral well worth a visit, lovely inside ,stained windows wonderful ,architect brilliant, was told Marilyn Monroe married and after went and visited the cathedral\nyou can light a candle for $5, worth a visit.\nShow less"], ["Reviewed November 13, 2016", 5.0, "Beautiful and inspiring", "This is a gorgeous, inspiring cathedral, with a labyrinth both inside and outside. I did the labyrinth, and it was most peaceful and calming. I will definitely return to visit the next time I am in San Francisco."], ["Reviewed November 8, 2016", 5.0, "Don't forget to do the walk", "Architecture of the building is worth hiking up the hill. Once inside take time to complete the walk on the floor."], ["Reviewed November 6, 2016", 3.0, "Beautiful!!", "Grace Cathedral is better than most similar churchs in the U.S. but falls short of European likenesses."], ["Reviewed November 1, 2016", 5.0, "Make sure you visit", "Take the cable car as it stops very near to the cathedral. The murals and windows are incredible - use the guide so you can appreciate all the history of each one.\nThere is a labyrinth inside.\nIt is a fascinating cathedral an unlike any other I have visited in any country. You get caught up in the atmosphere and need to take the time to appreciate the cathedral in all its glory.\nThe shop is downstairs along with a coffee shop and restrooms.\nAll the staff very friendly, polite and helpful. The gentleman in the shop was especially friendly and I will be looking out for his book about St. David, which I hope he will get published.\nEverything about the cathedral including the name, Grace, is just right.\nShow less"], ["Reviewed October 29, 2016", 5.0, "Beautiful Cathedral!", "We visited on a Sunday during a service which was not planned but interesting to observe service in progress. The acoustics inside are amazing. The murals and stained glass windows are breathtaking. A must see in San Francisco modeled after Notre-Dame. It's an active church, beautiful piece of architecture, artwork and history all rolled into one.\nShow less"], ["Reviewed October 28, 2016", 4.0, "Beautiful Cathedral", "On top of Nob Hill you have this beautiful cathedral from out side and from inside. The brass doors are beautiful, they are copies of the the Cathedral in Florence. The have a labyrinth as you enter that is so great to follow it as you pray or meditate. Loved going there.\nShow less"], ["Reviewed October 26, 2016", 4.0, "A monument for the church lovers", "One of the most beautiful churches around and a wonder if Gothic structures. The windows are one if the most unique around with fewer choice of colors typical to this style.\n\nThe street is site to many beautiful buildings and place of the very first cable car transit system so consider walking or a cable car. Button of this hill you can dine at the famous Cathay Chinese Restaurant.\n\nThe California road is also home to many famous Hollywood movies.\nShow less"], ["Reviewed October 25, 2016", 4.0, "Breathtakingly Beautiful", "I parallel the wonderful Grace Cathedral to the National Cathedral in Washington, DC. The exterior architecture is magnificent and, once inside the Cathedral, I was overwhelmed with its beauty and the peace and serenity which it gave me."], ["Reviewed October 19, 2016", 5.0, "Sublime Cathedral", "A wonderful place of meditation that accepts all faiths and creeds. Its truly a sanctuary for all to share. They have a fantastic free Audio Guide. I make a stop here every single tie that I visit San Francisco. A must see in Nob Hill."], ["Reviewed October 17, 2016", 5.0, "Amazing Architecture", "Worth the look inside. The stained glass from interior is exquisite, far surpasses the exterior view. The light from outside makes all the colors come to life. The structure will put you in a state of wonderment imagining how this place was constructed. Fascinating."], ["Reviewed October 17, 2016", 5.0, "Peaceful Pitstop during your San Fransisco daylong excursion!", "I have not been to many churches, but what I most like about church is peaceful moments!\n\nI had planned Grace Cathedral visit when I was exploring San Fransisco walking from Union Square.\n\nI really liked it. Few moments spent here were perfect for quick rest and mental peace.\n\nI would highly recommend it. Plus you can hop on to tram right outside of it.\nShow less"], ["Reviewed October 17, 2016", 4.0, "It beautiful", "Its in the heart of the city! Its beautiful inside loved all the murals and stained glass. Yes there are some homeless around but that everywhere in the city I would see it for sure if you are in the area"], ["Reviewed October 14, 2016", 3.0, "Just o.k.", "My daughter and I were staying in the area and we were walking by and decided to stop by. It was just o.k. nothing grand just o.k."], ["Reviewed October 11, 2016", 4.0, "Large", "This is a lovely, large cathedral on top of Nob Hill. It's worth a walk-by, even if you don't have time to go inside."], ["Reviewed October 9, 2016", 3.0, "I was disppointed - not as grand as I was expecting", "For the second or third largest Episcopal cathedt0ral in the US I was expecting something more imposing and grand. I was also disappointed that the cathedral appeared to be focusing more on raising money for itself than being involved with the community - particularly the very obviously needy street community. Maybe I am doing them an injustice, but in comparison to their counterparts in New York, this difference struck me very strongly.\nShow less"], ["Reviewed October 7, 2016", 5.0, "Beautifu Church l, all religions welcome", "This is a very beautiful church. Everybody is welcome to cherish its beauty and peacefulness. Lots to see here or just come in and enjoy the quiet time. Donations are suggested."], ["Reviewed October 6, 2016", 4.0, "peaceful place", "we were very fortunate that the organist was tuning the organ and it lent to the atmosphere. very unusual murals around the walls of the history of San Francisco linked to the cathedral. the only discordant note was both my husband and I were approached separately by a man who got up close and personal and then yelled \"hungry\" in our faces. we had both been walking the maze at the time. however, it is really worth a visit!\nShow less"], ["Reviewed October 4, 2016", 4.0, "See for the \"awe\" factor and stunning beauty", "Just go in and be awed by the sheer majesty of this beautiful Episcopal Cathedral. We were staying very close to this church so we were able to see it both day and night. Stunning."], ["Reviewed October 3, 2016", 4.0, "Episcopal Cathedral", "We can't forget that not only Catholic cathedrals exist. This is spectacular; we went during service, and they had a procession, child & adult choir, full church organ player. Long history pre dating San Fran earthquake."], ["Reviewed October 2, 2016", 4.0, "Super stained glass windows", "People visit places and things for all kinds of reasons - I personally enjoyed the visit to Grace Cathedral for its stained glass windows more for their artistic works of art rather than their religious meanings. The light shining through on a sunny day made for some stunning photographs.\nWhatever the reason for your visit to a Cathedral enjoy the feeling and surroundings and leave with nothing but memories.\nShow less"], ["Reviewed September 30, 2016", 4.0, "Beautiful", "I'm not sure about inside we just saw it from the outside but it was beautiful and much larger then I imagined. I absolutely loved the labyrinth and the garden. A must see and spectacular building. Loved it!"], ["Reviewed September 26, 2016", 5.0, "Worth visitiing", "The cathedral is beautiful. I wish we had been able to attend a service there as I'm sure it would be inspirational."], ["Reviewed September 26, 2016", 5.0, "Amazing!", "We were here off a cruise ship. We took a day tour and this was part of it. We had about 30 minutes to spend here. It is huge. It is beautiful! The stain glass windows to the huge organ pipes. A must to see"], ["Reviewed September 23, 2016", 1.0, "If you want to arrange a Grace Cathedral docent guide", "I have visited Grace Cathedral many times and I thoroughly enjoyed it.\n\nThis coming October, I am bringing a group of 28 people visiting San Francisco and Grace Cathedral will be one of the highlights of our visit. I read the website that they have docent giving free tours.\n\n\"Docents are usually available Mondays, Thursdays, and Fridays from 1-3 pm, Saturdays from 11:30-1:30 pm and Sundays after the 11 am service.\"\n\nI called the docent line given to me by Grace Church. So far I left 3 voice messages in the past 2 weeks. No one has returned my call.\n\nThe app GraceGuide has Rt. Rev. Marc Handley Andrus emphasizing Grace being a welcoming community. I sure do not feel welcoming at all. The building is beautiful. But their personnel?\nShow less"], ["Reviewed September 23, 2016", 4.0, "Beautiful interior.", "The location beautiful. We were a bit put off by the \"suggested\" 10 fee if one wanted to move just past the front door. I would have hoped for some sort of tour for that fee level."], ["Reviewed September 22, 2016", 5.0, "Amazing and very welcoming.", "We visited the Cathedarl to see the inside light and the labyrinth on the floor.\nI had seen it on a review before I left and wanted to take my daughter there. She is into yoga and I thought a picture by this building would be great.\nThe outside is pretty, but the inside is really striking. I tried my camera out with an old lens and the lighting ended up beautiful. She did a few poses inside, and we walked the labyrinth maze. Everyone was so nice. Lots of information about the building too.\nShow less"], ["Reviewed September 21, 2016", 4.0, "Beautiful.", "Such a beautiful spot. This is a quiet place in front of a little plaza, an next to the most awesome hotels I saw in SF. It's a shame there wasn't a cafe nearby to experience this zone!"]]}}