{"Griffith Observatory": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Griffith Observatory", "url": "/Attraction_Review-g32655-d116887-Reviews-Griffith_Observatory-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/2e/01/59/griffith-observatory.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "15960"}, "address": {"@type": "PostalAddress", "streetAddress": "2800 E. Observatory Rd.", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90027-1299", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Beautiful Views", "Took my mom here for a visit, parking (on a Wednesday afternoon in Feb) was easy— just a short walk up to the building. We looked at all the exhibits and went up to the rooftop see the skyline and Hollywood sign. Looking forward to coming back to see one of the shows!\nShow less"], ["Reviewed 2 days ago", 5.0, "Beautiful Architecture and Great Exhibits", "Most recently featured in the film “La La Land” the Griffin Observatory is a Hollywood landmark rivalling the nearby hillside sign. In addition to spectacular views and classic architecture, the attraction hosts a series of excellent astronomical exhibits; has a theatre; and has a working Tesla ball, which sends out electric charges into the air (reminiscent of the device used in “Frankenstein” and “Young Frankenstein”). We were disappointed to find the restaurant closed for renovations and the parking near the observatory is a challenge, but overall we were very impressed.\nShow less"], ["Reviewed 2 days ago", 4.0, "Important source of education and timeless archetichture.", "Really educational all around. There is so much to learn from this historical observatory. It is important to understand all the great exhibits that this observatory has to offer. Some are self guided and others are paid. Lots of movies, videos, and commercials are filmed in this location. Great part of history and timeless.\nShow less"], ["Reviewed 3 days ago", 5.0, "Great Views overlooking LA", "I went there last March great views but went during the day so cannot comment on checking out the scope, I took an Uber up there too check it out but bare in mind that there is not much phone coverage up there managed to get enough coverage on the right hand side as you face the building to grab another ride back down to Hollywood, has some great history check it out.\nCheers Brett from Hastings Point Australia.\nShow less"], ["Reviewed 4 days ago", 5.0, "Spectacular way to spend a day!!", "This is a spectacular attraction! You can send most of a day here and easily over three hours. The museum exhibits cover every aspect of space, the universe, and our solar system. Many of the exhibits show the affects that the sun, moon, and stars have on life on earth. These include tides, moon cycles and seasonal changes animated in an incredible display. Hours can be spent viewing and reading this information. I was fortunate enough to be there for three shows in the Samuel Oschin Planetarium; 'Water is Life', 'Light of the Valkyries' and 'Centered in the Universe', all three amazing!! The live narrative given by Doug was brilliant! His knowledge and delivery was a work of art. The shows lasted about 30-40 minutes and are an absolute must while visiting the planetarium. The cost is $7. but there are student and senior discounts available. As an added bonus the views of Los Angeles, Santa Monica and the Pacific are breathtaking. Watching the sun set over the city was mesmerizing and seeing the lit up skyline was nothing less then magical. Go! Plan on spending a lot of time. Parking available for $4. an hour. \nShow less"], ["Reviewed 5 days ago", 5.0, "Great Place to Visit", "This is a little out of the way but worth it. We got an Uber there from the zoo and a taxi back to our hotel as there was a line of taxis waiting outside.\n\nThere are a number of things to do here. There are some very interesting science displays about the stars, tides, moon, planets, etc. on the first floor and in the basement. There is a planetarium showing various shows throughout the day. The Nimoy theatre shows a very interesting 20 show about the observatory itself.\n\nThere is a nice cafe and gift shop as well.\n\nBut the best thing about the Observatory is the views. It’s got the best view of the Hollywood sign. The sunset is spectacular. And the view of downtown LA all lit up at night is fantastic.\n\nBut the best view is through the telescope. Yes, you get to look through their huge telescope. Queue up about a half an hour before sunset. There is a long line so get to the roof early.\n\nIt is very busy most days here. To do everything, I’d plan at least 3 hours.\nShow less"], ["Reviewed 5 days ago", 5.0, "Amazing view of the city!", "After a long day, we decided to make our way to the Griffith Observatory to relax and take in some views. Whoa! This place was amazing. Although there were a lot of people around, it was still a calm and relaxing atmosphere. The skies were crystal clear and the views of LA were incredible. The best part of this place, is that it'a free to roam around! If anyone is in the area, I'll totally be recommending this place!\nShow less"], ["Reviewed 5 days ago", 5.0, "Fascinating Place.", "As well as being a great place to visit, it is also a good spot to see the Hollywood sign and get a superb view of the city. If you know nothing about the cosmos and believe that the planet was created 5000 years ago, then this place will give you a dose of reality. I particularly found the 'Big picture' awe inspiring.\nShow less"], ["Reviewed 5 days ago", 5.0, "Fun for the whole family", "I couldn't believe how many people were there! The observatory itself is amazing, but so are the views around LA. Amateur astronomers set up their telescopes on the lawn and you could look at the moon or planets, for free! There's a nice cafe downstairs along with interesting exhibits.\nShow less"], ["Reviewed 6 days ago", 5.0, "Amazing views", "I ended up at the observatory after hiking up the trail. It was a very steep hike and to be honest I almost stopped a couple of times but I kept looking up at the observatory and knew that I wanted to make it to the top. And if I’m honest there were people that were older than me passing me up this hill and I knew that I just couldn’t give up. The views are absolutely amazing great view of the Hollywood sign and of downtown LA. I took advantage of going into the planetarium, mostly to rest before I walked back down, and saw a great half an hour show. I would totally recommend it just be prepared if you’re hiking up the mountain wear comfortable shoes and know that you are going to get dirty because it’s a very sandy/dirt trail. But I do believe you can drive up to the observatory\n.\nShow less"], ["Reviewed 6 days ago", 5.0, "Nice view of LA", "Great place to see LA night view and take your time to visit observatory. It is introduce a lot and good to re-learn the astronomy in here."], ["Reviewed 6 days ago", 5.0, "Aussies on the go", "The trip to the Observatory was uneventful- took Lyft as couldn't work out the correct bus - DASH. Entry is free with large amount of information provided. Need to book in fir the Observatory presentations for a small cost. In the lower level - you can see the planets and compare your weight to your weight on a particular planet.\nWell worth the visit.\nShow less"], ["Reviewed 6 days ago", 5.0, "Visit to Griffith observatory", "its on a hill to overviewing LA city. its a beautiful and well made place and must go for all ages. The movie 'La La Land' got a whole scene shot here. this place takes you to origins of astronomy and metallurgy. The founder ensured that its built in a manner so as to face the test of time and wear & tear. must visit. will take you at least few hours. on weekend expect a jam on the way and quite a walk for parking\nShow less"], ["Reviewed 6 days ago", 5.0, "Most Beautiful View", "I have dreamed about making it up here. You see it in all the tv shows and movies. This is where you realize that LA is a beautiful city. On one side you can look at the Hollywood sign and mountains, the ocean on the other on a clear day, and the sweeping city all the way around. It is incredible. There are miles of great hiking trails as well.\nShow less"], ["Reviewed 6 days ago", 5.0, "Must go to the Planetarium!", "We really enjoyed going to see The Griffith Observatory. The drive up there is pretty nice and then there’s the beautiful views of Downtown LA and the Hollywood sign.\nMy favourite part was the Planetarium which is well worth paying for as it is a unique experience. Especially if you love science! And it’s not expensive either.\nYou will be required to pay for parking and it was pretty busy when we visited.\nShow less"], ["Reviewed 6 days ago", 4.0, "Crowds but Must Visit", "We went here on a Friday morning thinking it may be quiet - it wasn’t lots of kids and tourists. Parking is available as you drive up the hill. The observatory is interesting and the views over the city are amazing."], ["Reviewed 6 days ago", 4.0, "Great place for views of the Hollywood sign", "The observatory itself is OK but what makes it worth the visit is the location. It offers some lovely views of LA and the Hollywood sign"], ["Reviewed 1 week ago", 3.0, "Interesting but inaccessible.", "There is practically no parking at the observatory. One has to park at the foot of the hill at a place called the Greek Theater and ride a bus up to the observatory. At the end of the visit, you take the bus back to the parking lot. Round trip, $1.00. At the observatory, you can see the 12\" refractor telescope, a sun watching telescope and star show inside. I endured a lot of aggravation to get to this place only to see an old observatory that is past it's prime. Even the view of downtown was obscured by thick haze.\nShow less"], ["Reviewed 1 week ago", 4.0, "Hollywood sign", "The observatory itself was pretty good, in a good clear day, you can see the Hollywood sign, the downtown, the ocean etc, parking was limited and it's a good hike !"], ["Reviewed 1 week ago", 5.0, "Great Views Outside, Great Exhibits Inside", "Our LA tour bus stopped at the Griffith Observatory at about 2:45pm on Thurs. 21 Sept. 2017. Plan to go in good weather because there are great views of the Hollywood sign from the front lawn and of downtown LA from the back balcony of the observatory. We found many of the exhibits to be informative and nicely done, especially the ones on star types, the sun and the Foucault pendulum. The docents were very helpful with explaining the exhibits. There are some beautiful murals on the ceilings. A real treat both inside and out!\nDid this review earn a “helpful” vote?\nShow less"], ["Reviewed 1 week ago", 5.0, "History of the Universe", "If you ever wondered about our atmosphere or even wanted to see the sky and stars in abundance, this is the place for you. The guides are very knowledgeable and can answer any questions you may have. In addition, there is a show that you lay back in your seat and watch as the sky passes above...very cool.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing!", "We loved our time at the observatory. This is the best way to view the Hollywood sign and L.A. The observatory is wonderful as well, we learned a lot. They have wifi everywhere, helpful staff, and the DASH bus is also super helpful. You can take the bus to and from the observatory (the first and last stop is close to Sunset Boulevard) and the one-way bus ride costs 50 cents. Just make sure to have coins, the driver cannot give you your change back.\nShow less"], ["Reviewed 1 week ago", 5.0, "Planetarium show", "We watched \"water is life\" and it was beautifully done. Our preschooler was with us and enjoyed the experience as well. The observatory has a ton of exhibits for all ages. The views of LA and the surrounding landscape are lovely. Also good for hiking."], ["Reviewed 1 week ago", 4.0, "Stunning views of Los Angeles", "Griffith Park Observatory is somewhat of an icon. Even if you are not into astronomy it is worth heading up there just to take in the spectacular views. On a clear day you can see all the way from the ocean across Santa Monica, mid-wilshire, a tremendous view of downtown, and even further east to the mountains.\nShow less"], ["Reviewed 1 week ago", 5.0, "A Must See at Night", "This was on my son's must do list and so we trekked up to the Observatory. I am really glad that we went. Even though it was extremely cold on the night we went, we were lucky to have a clear night. We could see for miles. The exhibits inside held the attention of my tween and teen. Incredible learning opportunity for all.\nShow less"], ["Reviewed 1 week ago", 5.0, "Best views of Los Angeles", "Don´t miss this place if you´re going to LA. The road up there is beautiful, and the full panoramic views of LA are really amazing as you get to see the whole city from above. The parking can get crowded, but the two times we´ve been there we still had no problem finding a spot. If you´re there on a busy day you can also park down the road. Take a walk around the observatory to see the views from all angles and also to find a place less crowded. We brought food and had lunch in the sun overlooking LA. Beautiful!\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautiful location.", "Easy to get to by bus although most people seemed to drive. Great views and an interesting observatory. We didn't have time to explore the miles of trails in the surrounding park unfortunately but did have a coffee overlooking LA"], ["Reviewed 1 week ago", 5.0, "An excellent informative visit", "A shining example of what a scientific exhibition should be, plus the added attraction of the beautiful views. We would have paid for more parking had we known and plan to return for an after-dark visit."], ["Reviewed 1 week ago", 5.0, "Great day family trip when visiting LA", "Our DIL took us out on a field trip and it was an amazing weather day to visit this observatory, walk around and take pictures. packed on weekends and if you are taking an Uber/LYFT make sure your driver knows pick-ups and drop-offs are allowed all the way inside. Amazing views inside and a cafe for snacks.\nShow less"], ["Reviewed 1 week ago", 4.0, "Crowed with a nice view", "Nice place to visit - came on a Sunday and it was packed and parking was a long walk from the top - so make to calculate that in to the trip. Good view and nice museum!"], ["Reviewed 1 week ago", 4.0, "opens at 12 noon", "we took an Uber to the observatory in the morning only to find it opens at noon. Never he less it was worth the trip for the view of the Hollywood sign and across Los Angeles. We took a hike trail down which took about an hour but was very beautiful.\nShow less"], ["Reviewed 1 week ago", 5.0, "The best view from LA", "Is not easy to visit special in the weekend is very busy and hard to find a place to park but the view paid for all effort."], ["Reviewed 1 week ago", 5.0, "Night visit", "Visited at night, what a great view, beautiful. Lots of interesting information inside, my son studying science so loved it."], ["Reviewed 1 week ago", 5.0, "Great views of Los Angeles, CA", "We spent an afternoon enjoying what this observatory offers, great views, nice park and trails. I definitely recommend it."], ["Reviewed 1 week ago", 5.0, "Must see", "This place is to must visit. All area is clean, the vie of LA and Hollywood sigh is just amazing. Inside the observatory is so much to see and the shows are really good. DASHH bus takes you up there and back for 1$ and it stops just outside the red metro line Vermont/Sunset stop, exit Vermont.\nShow less"], ["Reviewed 1 week ago", 5.0, "Last minute trip, excellent decision.", "So we finished with a conference in San Diego and booted our way up to LA. We wanted to make the most of our time, so we stopped at the Griffith Observatory. Got there really late, but after the trek up the hill it was amazing to be there for around an hour. Interesting inside, beautiful on the outside. Look up inside to enjoy the architecture.\nShow less"], ["Reviewed 1 week ago", 4.0, "View from Griffith Observatory", "Must visit place in Los Angeles. View is fantastic from Hollywood Hill to Newport Beach. But more importantly, this is a place for junior and high school students to visit and learn more about the universe. Visit the place at night is also very interesting.\n\nOnly issue is parking. Prepare to be patient to get a parking spot.\nShow less"], ["Reviewed 1 week ago", 4.0, "Amazing views", "The observatory wasn't open. We weren't sure why but the views were unmissable. Easy to get to using a dash bus whoch was very cheap and a must do if u visit LA and can't or don't want to hike to the Hollywood sign!"], ["Reviewed 1 week ago", 4.0, "A must to visit", "High up with great views, this is well worth a trip and look around this magnificent sight and walk around"], ["Reviewed 1 week ago", 5.0, "Fab Views", "When we went it was Martin Luther King Day so the observatory was closed but the views from the grounds were amazing. Definitely recommend going here if you have the chance. I plan on returning to do the observatory. Walking from there to the Hollywood sign boasted some fab views. Highly recommend.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful", "Great view, parking is affordable ($4 an hour). You have to get there early if you want close parking. Otherwise you're walking quite a ways up to the observatory. It gets a really busy around sunset."], ["Reviewed 1 week ago", 5.0, "Amazing !", "Amazing view of the city. Night view is breathtaking. Shows are just awesome. One of their kinds. I saw all 3 of them. Favorite was Centered in the Universe. Kids will love this place too. So many interesting models at display."], ["Reviewed 1 week ago", 4.0, "View of the city", "Good points: + free admission. + great view of the city, including the Hollywood sign. Tips: - park at the base near the Greek theatre, parking is free and is an easy 10mins hike up."], ["Reviewed 1 week ago", 5.0, "Best views of LA", "Directions: Take the Metro red line to Vermont Sunset Station, exit from Vermont Ave and take the Dash Observatory bus ($0.50, cash only no change will be given, pay on board). The bus will alight you just in front of the Observatory in about 15-20 mins depending on traffic.\n\nThere is a walking trail here so those who love the nature and hiking should plan for a full day trip here. This place also gives a clear, unblocked, slight side view of the Hollywood sign.\n\nBe sure to catch the programmes in the Samuel Oschin Planetarium, especially Centered in the Universe. Tickets are sold at the counter (on the left when you enter the Observatory), $7 per adult and $3 for children below 12yrs of age. And seating begins 15 mins prior, no late entry is entertained.\n\nHere’s a tip: don’t go for front row seats, you’ll get a better view from the back rows as it's a dome shaped projection screen on the ceiling inside the Planetarium.\n\nTouring round the rest of the Observatory is free and they’ve got quite some interesting displays. Lots of detailed explanations from the time of the Big Bang to the galaxy, the universe, the planets and stars and even history of time telling. The exhibits are also interactive, with videos, microscopes and even weighing scales where one can see how much you'll weigh on the different planets.\n\nIt’s a great place to view the stars, in a huge unblocked wide sky. Suggest you come in the early afternoon around 2, which will give you sufficient time to go through the exhibits, catch the programmes in the Planetarium and stay through till night so you can capture the beautiful skyline from day, to Sunset, to Dusk and then night.\nShow less"], ["Reviewed 1 week ago", 5.0, "Go here for the view - it's awesome!", "After years of traveling to LA I finally went to the Griffith Observatory - and what a treat it was! The view at night was spectacular! Be sure to put this on your \"to do\" list when visiting the city. The museum portion is \"okay\" - by no means Smithsonian quality , however the view is what you want to see. Parking is limited, so be prepared to walk or catch a shuttle at the bottom of the hill.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing setting and worth the drive", "Part of the fun in visiting the Griffith Observatory is driving up the mountain through residential areas to get there. The visit doesn't take long and parking is very easy and convenient. Fun family outing. The lightening exhibit was amazing."], ["Reviewed 2 weeks ago", 5.0, "Observing the Observatory", "My visit with my husband to the Griffith Observatory was great! We parked in the free areas below and hiked the rest of the way. The Observatory park trails were a little intense if you are not an active person so please keep that in mind. The views are fantastic. You can see the Observatory, the LA skyline and the Hollywood sign from up there. Coming down we walked through the Observatory which is free. Very nice and educational for kids. I would definitely do it again.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stunning", "This is a must! Beautiful scenery and wonderful views!!! Just beautiful!!! Parking is free is you go before 12. There is also trails that lead you up to the observatory as well."], ["Reviewed 2 weeks ago", 1.0, "No Parking. Too Crowded.", "Don't know if this place is nice or not because I drove around for 45 minutes and never did find a place to park and finally just gave up and left. So thick with people you can't move."], ["Reviewed 2 weeks ago", 5.0, "Great Visit & amazing views!", "This was my 2nd time to the Observatory. We arrived late on a Thursday night (8pm), but were able to find metered parking. The best time to visit is sunset for a spectacular view of the Hollywood Sign, but we could not make it that early. I love the observatory, so we went anyway and really enjoyed the night time view over all of Hollywood and Downtown LA. The Observatory itself is very interesting if you like Planetariums. I am a self-proclaimed science nerd, so I find it quite interesting, especially the lower level exhibits. You do not need a lot of time here, but expect to spend at least 1.5 hours. I highly recommend this to anyone visiting the LA area!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Free of charge", "This place offers a nice view of the city of Los Angeles: if you are able to, just go and visit the place !"], ["Reviewed 2 weeks ago", 4.0, "Crowded", "Out to one side the parking ticket and the crowds, the trek getting there is absolutely worth it. The views across to the Hollywood sign are about as good as you can get. Additionally the Observatory and the museum are worth a visit, understanding the history of the building and Griffiths himself is enlightening\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Los Angeles and Griffith Observatory goes almost 'hand in hand'", "If you are visiting LA, don't miss this place. If you loved La La Land, don't miss this place. If you trust my review, don't miss this place :)))"], ["Reviewed 2 weeks ago", 5.0, "Interesting, educational and spectacular view", "My kids took me here on my recent visit to Los Angeles. I have been to LA many times and heard of Griffith Observatory, but have never been. It was a wonderful experience in so many ways. Parking was reasonable but there was free parking if you are willing to walk up the hill. The museum has free admission but there is a fee to get into some shows. There is plenty to see and do free of charge. Very educational. The views of the city were incredible. It was a great activity for all three generations of our family. A must-do if you are in LA.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "What a view!", "If you're looking for the perfect place to see Los Angeles in all its glory then a trip to Griffith Observatory is the place for you! Amazing panoramics of L.A. and views of the Hollywood sign. Parking is limited so get there early. Otherwise it's quite a walk up the hill\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Science and Space", "Enjoy this place for having knowledge and view of space. This is a must go places. Also a starting point for someone who would like to hike till Hollywood sign."], ["Reviewed 2 weeks ago", 5.0, "Great place to visit", "We bussed up on the observatory bus which starts directly out from the stairs from Vermont/Sunset metro station. The metro tap card system was unreliable so we had to pay cash for one of us. It was a clear Saturday and busy but we got tickets to two shows to the planetarium which we really enjoyed however the two shows did overlap content. The cafe was good with outdoor seating with great views of the city and Hollywood sign.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Very informative!", "This place exceeded my expectations as we were only at the park to hike to the Hollywood sign. Very fancy and cool museum type place with so much information. I would return."], ["Reviewed 2 weeks ago", 5.0, "a Must Do in LA!!", "On a clear evening when the sun has set view a beautiful sky through the telescope!\nThe building is a piece of history and movie trivia!! The architecture is very unique to any I have seen and I found it charming.\nThere are lots of interactive things to experience. The Tesla coil is there!\nIf you LOVE photography it is a very special place to get creative.\nThe restaurant is not very good, so I would eat before or after a trip to the Observatory.\nThe planetarium is quiet nice and perfect for children.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful view, nice hike, and interesting attraction", "It took us about 45 minutes through a maze of trails to get to the top of Griffith on foot.\n\nThe hike began at Griffith Park, situated in the northeast area of hollywood.\n\nThe hike was nice, many people were there as well on a beautiful day about 25 degrees celcius (im canadian). The way up is a bit physically demanding, but not difficult. This is well worth the visit and should be done by foot for the full experience!\n\nAs for the attraction itself, once we reached the top we found out how beautiful this place actually was. The building is detailed, and provides much info/visuals for visitors to enjoy and learn about some astronomy.\n\nThe view from the very top is outstanding and worth the visit. Well probably go again if we return to LA.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Well worth the visit", "Only drawback is parking, there never seems to be enough. Very informative, their star history show is so amazing, and everything is well kept. Great places to take pictures of the surrounding area too."], ["Reviewed 2 weeks ago", 5.0, "Tour visit", "Had a great time at Griffith Park and Observatory. Went there with a tour group and explored the place. Just wish we could have gone at night to look at the stars through the telescope. Great place for pics and the price is right. It is the largest city park in the U.S. Came home and watched the movie La La Land which shot quite a few scenes there.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Worth the Hike!", "Hiked up the mountain to get to the observatory. Free museum and beaufitul grounds - was totally worth the hike up and down. Be prepared to go to bed early though, as the hike is exhausting if you are not used to it!"], ["Reviewed 2 weeks ago", 5.0, "Best to go there in the evening", "Awesome place. Do not hesitate to make a little hike above the observatory. The observatory is for free."], ["Reviewed 2 weeks ago", 5.0, "HollyWOOO", "We went just this past Monday and they were filming a tv sitcom at that time so we had to walk from the lower lot which still was not too bad. very scenic place. Not sure if the museum is closed every Monday or because they were filming. I would recommend going to see sun set with THe observatory lit up. Pack a lunch and have a picinic. Restrooms are conviently located too. There are some other walking path's as well, wish we had time to check them out but we were on our way to The Sequoia National Forest. I would certainly spend more time here on my next trip. That way I can really soak in all the beauty from this vantage point. spend\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Do not go there during Christmas week, it is crazy busy!", "Do not go there during Christmas week, it is crazy busy! Especially in the evenings when people go to see the view. We spent an hour in traffic to get to one of the parking lots (there are like 10 of them) and then walking in the dust to the top. It was unrealistic to get inside of the observatory, stay away and don't go inside, it is so crowded it can be dangerous. The view of the city is still nice :)\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Griffith Park Observatory", "This place was crazy!! All the way from driving around and around and around for a parking spot that costs minimum of 15.00 to the crowds. It was cool to see but not really interesting for little ones."], ["Reviewed 2 weeks ago", 5.0, "Wednesday evening post sunset", "Beautiful views, friendly helpful staff... A lot of very interesting exhibits. I thoroughly enjoyed my visit. There were of course a lot of tourists, so if you can just ignore the craziness of that part - you are sure to enjoy your visit. We were able to park in the main lot of the observatory.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Museum and Views", "This was an interesting experience with great views of the Hollywood sign. The Tesla Coil exhibit although quick was very cool. There is quick a bit to see in this Observatory. It was very very crowded (but we went on a Saturday afternoon). Parking was a bit crazy. It’s free at the bottom of the hill and you can take a shuttle for $0.50 each way. Otherwise it’s $4 per hour.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A good attraction for the last day in LA", "We went to the Griffith observatory on our last day in the city. It was very thrilling to get The Who,e city and valley view after we drove through it in the past days. There is no entrance fee. Just 4$ for parking."], ["Reviewed 3 weeks ago", 5.0, "Observatory", "My fiancé and I did the short hike up to the observatory and the views of LA during the hike were amazing. The hike was mostly on gravel or sand and the angles were a bit steep at times, so proper footwear is recommended. We arrived at the observatory about an hour and a half before sunset, which gave us enough time to look around the facility and take a lot of photos. We then had a bite to eat at the cafeteria while we sat looking out at the Hollywood sign. The most spectacular photo were taken during sunset and the period just after. It was worth the drive and the walk and excluding the food, it was all at no cost. A great way to spend the evening.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A fantastic view!", "We had the privileged to get to the observatory on a clear day with magnificent 360 degrees views from the top. The walk up the hill was all worth the hard work and the Hollywood sign was seen better as ever before. The stroll through the park where one can have a picnic was something to experience. If you want a view of Los Angeles, nothing can beat the Observatory on a clear day.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "So much we don’t know!", "What an experience got a chance to learn a lot about our solar system, space and season changes!! The best part was the breath taking view‘s of LA!!! Thank you smart people for coming up with this!!!"], ["Reviewed 3 weeks ago", 5.0, "Great facility", "There's a lot more here than a planetarium and a telescope there's a lot to see and it is very well set up it is one of the more interesting museum type facilities in the Los Angeles area"], ["Reviewed 3 weeks ago", 4.0, "View only on this trip", "We did not have time to actually go into the observatory but we did drive up to it in order to see the Hollywood sign, James Dean memorial and a panoramic view on Los Angeles."], ["Reviewed 3 weeks ago", 5.0, "A true highlight of LA", "Amazing foresight by Mr Griffith to gift the land and build the observatory so we can look over all of LA. Certainly worth all the accolades in all the reviews. Parking is a challenge as everyone’s noted."], ["Reviewed 3 weeks ago", 4.0, "Beautiful views", "This place has the most stunning views of the city. Great hiking area Mountain View city views. Definitely something everyone should see"], ["Reviewed 3 weeks ago", 5.0, "Beautiful view of LA", "There is nothing more beautiful than the view of LA from the observatory. Very busy the evening that we went. Maybe try to go at an off time."], ["Reviewed 3 weeks ago", 5.0, "Great building, great views!", "Yes, you can park for free and walk up the hill, and its worth it, as you get exercise, you get views as you're walking up, and you appreciate it more when you get to the top!\n\nIt just gets bloody hot on a beautiful autumn day in the full sun without much shade.\n\nOf course it leads to brilliant photos of the building and the views in all directions. You can see the Hollywood sign from a different angle, you see the CBD of LA and views all over the city. You can see the Hollywood Hills and the Boulevard.\n\nAnd the Observatory itself is interesting on its inside, especially with its underground exhibits.\n\nA must visit in LA.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best Free Date in LA", "My Fiancé and I stopped by here one of our nights in LA since we are pretty young so we were on a budget- it was spectacular! We ended up parking way way way down the hill (like probably half a mile or more) down the hill because we went on a Saturday night, coif you can use there I suggest it. Regardless, the walk was scenic and once we got there we never wanted to leave. We ended up paying to watching something in the IMAX- I can't remember what it was called, but it was one of the best experiences of my life. They let you recline back in the IMAX room and suddenly the whole room is covered in the stars and galaxies. I hope everybody gets to experience the magic that is the Griffith Observatory at least once in their life!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Hills & Views.", "From the observatory you will get a great view off Los Angeles, be amaized over its size and long straight blvds. Climb the hill top for the great 360 degree view of whole area."], ["Reviewed 3 weeks ago", 5.0, "best free deal in LA", "one of our go-tos when visitors are here, gets super crowded on sat night, should try other times, actually it kind of sucks on sat it is so crowded. one option is to park below and walk up, not a bad walk"], ["Reviewed 3 weeks ago", 3.0, "Good views", "Been here lots you get a good view of thecity andthe hollywood sigh, parking can be an issue, it should havebeen a quiet day in mid winter, but it wasnt"], ["Reviewed 3 weeks ago", 5.0, "Morning Walk", "If you want to see the Hollywood Sign without obstruction and dont want to hike all the way up, then this place is enough. Great views from the deck and nice place to stroll around."], ["Reviewed 3 weeks ago", 3.0, "Good to say we've been", "After a long wait for opening in very little shade, we explored the observatory. It was interesting for my space crazed husband, but we soon ran out of interest.\nThe view was amazing though! Best view of the Hollywood sign.\nParking is bad - take an uber\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Wonderful", "The views were spectacular, but, as with all well known places, it was crowded. Due to crowding, we did not bother going inside except to use the restroom."], ["Reviewed 3 weeks ago", 5.0, "Must see", "One of the most beautiful places in LA! The view of the city is spectacular, plus you can see the Hollywood sign as well. Unfortunately, there is non free parking on top, but it is definitely worth it! Admission to the observatory and grounds is free. The shows at the Planetarium are great!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Incredible views", "Traffic to get there can be a significant cultural experience but once you drive up it's just magnificent. On a hazy day views can be a bit toned down. Parking can be difficult certain times of the day during tour times"], ["Reviewed 3 weeks ago", 5.0, "Stunning Views, Must go!", "Absolutely stunning! You must checkout if you're in the area. Amazing views all around and the inside of the building is just as beautiful!"], ["Reviewed 3 weeks ago", 5.0, "The Quintessential LA Experience for Tourists and Locals", "Not many landmarks can beat this place. Why? Because it is a museum, scenic view, nature hike, and planetarium all rolled into one.\n\nI have taken my kids here numerous times over the past 12 years. One time they had their birthday party here. As soon as we arrived I purchased the planetarium tickets. We took a hike on the mountain and returned for some museum exploration, saw the planetarium show, and then had a picnic on the big lawn. I brought large glow sticks as party favors that they used like light sabors when the night fell. It was a full experience and the kids loved it.\n\nGo to the website and check out the dates for the star parties. Those are certain evenings each month when they invite people to bring their personal telescopes for viewing to share with the public. They have knowledgeable guides telling you what you are seeing in the sky.\n\nThe general admission and parking is free, as well as the Leonard Nimoy film about the restoration of the observatory. The planetarium costs money and is well worth it. There is a cafe and a nice gift shop.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "LA must see and it's free!", "I've been here previously and I know that the iconic Hollywood sign is visible from this location. This is undoubtedly an LA icon with great views both day & night.\nWe went on the monthly star party where volunteers had telescopes set up on the lawn and you can come up to look. The volunteers are all glad to help and answer questions. The observatory was also open so we went in to look at the exhibits and were in time to see the Tesla Coil demonstration.\nI underestimated the attendance and we ended up parking down the hill & had to walk up. Shuttle buses were running but they were all full in both directions.\nI would highly recommend visiting even on an ordinary day/night. If the observatory doesn't interest you, you can't go wrong with the panoramic views of LA!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Million Dollar Views", "An L.A. must see. Gorgeous views of L. A. and the Hollywood sign. The building is old and a must see in itself. Wear comfortable shoes because you might have quite a hike from where you’ll probably park."], ["Reviewed 3 weeks ago", 5.0, "Historical Icon “Must See” in Los Angeles!!!", "The Griffith Observatory provides an awesome opportunity for education about Space for the whole family. The excellent interactive learning, guided stories, and movies opens up your entire perspective. The experience was enhanced by the private telescope owners allowing you to look into space. The architecture of the building and dome housing the permanently mounted telescope are a must to see. Public transportation is the best method to get there. Use the red line then the bus that takes you directly there. Get there early and expect long lines and crowds.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great for adults and kids", "This is a marvelous experience for children and adults. The planetarium shows are very well done. The hands-on exhibits are fun and educational. Go early if you want a parking space on top. Our grandson loved it."], ["Reviewed 3 weeks ago", 5.0, "Took a chance", "I had been to LA once before. My coworker wanted to see the observatory. It was kind of cloudy and the Uber driver said it wasn’t a great day to go but we went anyway.\n\nThere is no cell signal up there. They do provide free WiFi. Some Uber drivers are not from the area so they had problems picking us up for the return drive. The driver who took us was from LA and knew to change it over to WiFi.\n\nThe views from up there are stunning!! A clear view of the Hollywood sign and watched the sunset turned as everything turned a pinkish color. We didn’t stay late enough to view through the telescope but took a ton of pictures of LA from above.\n\nWell worth the trip up there!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "MUST SEE ICONIC LANDMARK!", "Refurbished and amazing...Even natives need to take the time to see this gem. While you are there, take a hike to the Hollywood sign!"], ["Reviewed 3 weeks ago", 5.0, "A true wonder", "We did not spend as much time as we would have liked, yet it is a place to remember and re visit. It offers one of the best views of the Hollywood sign. The inside is magnificent, both appealing to the eye and informative. There is also a small cafe with indoor/outdoor seating.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Well done!!", "The Observatory is probably the best Observatory in the US. Lots of variety and information and great view of Hollywood sign and LA."], ["Reviewed 3 weeks ago", 4.0, "Great LA views", "Great LA views . Parking and drive up can be slow process during peak times. Walk or hike a bit and take a small tour, don’t Forget the camera"], ["Reviewed 3 weeks ago", 5.0, "My favorite place", "Since my first time in LA I fell in love with this place. Go there even just for a walk, or visit the museum, or go into the planetarium, which is magical. Don’t forget to wait for the sunset!"], ["Reviewed 3 weeks ago", 5.0, "Great views. Educational and cheap parking.", "This is a great trip for the whole family , with friends , or even by yourself. Some people hike all the way up to the oberservatory, but it is quite a steep walk. Parking at the very top is $4.00 for 1 hour. This is more than enough time if you are just going to take in the views. The observatory is free, and you are able to pretty much wander around the whole place- there are plenty of activities some at additional cost, and it's very good for kids because there is plenty of opportunity to touch/ see . You get to see all of Los Angeles and you get a glimpse of the famous Hollywood sign. My favorite was the sundial, so amazing!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing view", "The best way to see Los Angeles from above and to understand its size.interesting exhibits.A car is needed for the visit"], ["Reviewed 4 weeks ago", 5.0, "Another popular tourist attractions", "Another popular tourist attractions, atleast you spend half day to explore Griffith Observatory lot of valuable information and things to see and touch. Must buy souvenir from this locations. Ample parking, good food and fun."], ["Reviewed 4 weeks ago", 4.0, "Great spot for locals and tourists", "I can’t really say enough about his spot! The views are amazing - I could spend all day here. The only downside is parking."], ["Reviewed 4 weeks ago", 5.0, "Beautiful views", "Great place to view the Hollywood sign and overlook of LA! Perfect place for science bluffs and astronomers!! So much inside, if you are into astronomy you will love this place!!"], ["Reviewed 4 weeks ago", 5.0, "A Must-See Attraction", "We visited Griffith Observatory in Jan 2018 & really enjoyed this attraction. There’s a lot to see and take in for all ages. Expect to spend 4+ hours to take in the full experience.\n\nBe sure to arrive while the sun is still up so you can view it inside the observatory. We missed it. Bummer.\n\nYou have a great view of L.A. & the Hollywood sign from the front lawn.\n\nIt is all pay parking up top, but worth the free admission to the Observatory IMO. If you’re planning on parking below for free and walking up, be sure to read all signs so you don’t get a parking ticket after sunset like we did. HaHa\n\nWatch a short movie of the upgrade process of the Observatory hosted by none other than Leonard Nimoy in the theatre named after him.\n\nWatch one of the Planetarium movies or look through a telescope at the moon after 7:00pm.\n\nSummary: This is a must-see experience you will want to share with your loved ones.\n\n\nPS: If you don’t want to wait forever in a long line on the roof, there’s usually a couple telescopes on the front lawn available to look at the moon that are nearly as powerful optically.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful View of Los Angeles", "If you are ever in LA, you must make your way to Griffith Observatory. It is definitely worth the drive. Traveling up to Griffith was a struggle as we were stuck in traffic, but once we got up there, we were able to find parking quickly. We went at night, and there happened to be a stargazing event that night, so all the lights were shut off and the Hollywood lights was off; but it was definitely worth it as you were able to see the beautiful night time sky and all the city lights.\n\nI definitely would go back and this time during the day to get the daytime view.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Classic LA | Incredible Views", "The Observatory feels like classic LA. The charming architecture, the winding road to the top, the views of the Hollywood sign and the sprawling urban grid below.\n\nThe Good:\n- The position of the observatory affords you incredible views of both city and nature. The hills reach out below the overlooks and the Hollywood sign stands just above.\n- Entry onto the grounds and into the exhibit is free.\n- The architecture and views provide great photo opportunities.\n- There is also an opportunity to hike the hills, providing you a solid afternoon of activity and sightseeing.\n\nItems to Consider:\n- Parking can be limited, and traffic can move slowly up the hill. If you are capable, consider parking at the bottom of the hill or lower down the hill and walking/hiking up the to the observatory. You will want to take your outfit choice and the heat the day into account.\n- There is a bus that provides pick-up and drop off at the observatory.\n- There are shows that run throughout the day. There is a fee for these and the box office line can sometimes stretch a bit.\n- The observatory can get crowded, especially on a weekend. Be prepared for the crowds and consider a weekday afternoon.\n- Sunset is a beautiful time to visit. You get the approach of golden hour and can get beautiful shoots.\n- The lawn or outdoor seating is a great place for a picnic. Be sure to bring water if you are hiking or visiting during a hot day. There is a cafe available if you did not pack your own food or beverage.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A must for La La Land fans", "Stunning view of downtown and the Hollywood sign and Basin. Lots of staff on hand to assist. A peaceful haven away from the bustle of the city,"], ["Reviewed 4 weeks ago", 4.0, "Great views and interesting exhibits", "The views of the city and Hollywood sign are incredible, but parking is very limited. Inside the observatory there a some really interesting exhibits and the planetarium is great. There are a number of walking trails to do from here also."], ["Reviewed 4 weeks ago", 4.0, "Great views", "What a wonderful place to visit, and I highly recommend a stop if in LA. The Griffith Observatory sits atop the hills near the Hollywood Sign. The view could be spectacular on a clear day but even on a hazy, smoggy day it is still nice. This would be a great place to pack a lunch and take a hike around. We did not have a lunch or plan to hike but we had fun. It was busy on the weekend but we found a parking spot without a lot of pain and for free. After parking we walked around the outside of the observatory enjoying the 360 views. We then went inside to check out the exhibits. There is a planetarium inside (for a small cost) that has shows often. We did not see the show but instead walked around all the exhibits on space, stars and how the observatory works. Our kids had fun pressing buttons and looking at the models of planets and the moon. Neat stuff! The also offer a chance a night to look at the stars through the telescope. Our only complaint was that some of the exhibits leave much to be desired, with most of the information so basic that is feels like reading an elementary school textbook. A minor detail in what was otherwise a very enjoyable and memorable experience.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Beautiful views", "We had a hard time knowing where to park or what route to take which is why I would rate it 4 stars but once you are there, the view is amazing!"], ["Reviewed 4 weeks ago", 4.0, "astronomical experience", "location- 4/5 you have to be early if you want a parking slot near the observatory especially for those who were not hiking going there\ncontent- 5/5 very interesting since it was my first time to go to an observatory. they have exhibitions about the planet, moon and sun.\nstaff- 4/5 they are friendly.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Very good", "A beautify LA day! This place is free and educational and if you don’t like that then at least you get closer to the HOLLYWOOD sign! There are not many “landmarks” in LA .... but this has to be one of them! Great views !"], ["Reviewed 4 weeks ago", 5.0, "Great views but crowded", "There are amazing views but beware, it gets very crowded, very quickly (both indoor and out). Inside is a pendulum, a museum, a planetarium, and some other cool interactive exhibits worth checking out. The telescope has a schedule, views are great, and parking has a fee (or park down the hill and walk for free). Definitely worth visting and bringing guests new to LA.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Awesome view", "wonderful view of the city and the Hollywood Sign. It is free to visit, you can view the stars or moon with the high power telescope."], ["Reviewed 4 weeks ago", 5.0, "amazing view for eye not camera", "if you are going there to take a picture with the Hollywood sign, then believe me you will be disappointed, because it is far far away from the sign, however, it is a very good place to see the sign with your eyes.\none problem there that it is too crowded and with very little parking spots, so what you have to do is to park at the Greek theater which is like a mile away then you take the shuttle which will cost you 50 cent ( you must have cash with you and in the exact amount), the bus will take 10-15 mins although it is super close, or you simply walk.\nthe observatory is great from inside with so many information about the solar system. one more advantage of this place is that you will be able to see the whole LA Area from a high place which is beatiful\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Unbelievable", "Some of the greatest views ever. Really wanted to go there during the night but my Uber driver didn't know what he was doing. So next day I decided to go and I wasn't even mad about what happened a night should since how amazing this place is. Will visit again when I'm back in LA\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful views of LA", "Awesome views, don’t go too late or you’ll have to park 5 miles away! If you like to walk/hike go prepared, stay hydrated. Don’t forget LA is always hot! You’ll have to pay the parking in advance ($4.00 per hour) and enjoy the views, the building and the exposition inside. If you want to pay, there are more info inside the observatory.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful views", "Parking is usually terrible at night but the view of the city is worth a walk up the hill. I've been here several times and will always return when in LA."], ["Reviewed 4 weeks ago", 4.0, "Great views & knowledge center", "Amazing view of stars, with the old telescope. The place is full of interesting info about all planets. Also offers amazing view of the city."], ["Reviewed 4 weeks ago", 5.0, "City views, fun facts", "I didn't see the show as the last one is at 8.45 and 9pm so make it before then even though it closes at 10pm. View of the city is amazing and exhibits are informative and fun. I liked the seismograph as it showed me making an earthquake. You actually can see the sun if you go in the day and I didn't see any stars even though I was there at night\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing!", "I read the history of Griffith and I’m so impressed with him as a man! He is an extraordinary genius who happens to have a generous heart and a love for life and education.\n\nThe fact that there is no charge to come here, because that’s how Mr Griffith made this so, is wonderful. He wants everyone to come and enjoy, learn and get excited about learning.\n\nIt’s a beautiful building, with great exhibits and wonderful views of LA and the Hollywood sign! Extra bonus there! Our 9 and 11 year old grandsons enjoyed it very much!\n\nThere are telescopes to view the planets after dark. And again, no fee! That’s how Mr Griffith wanted it.\n\nI wish I could have met this kind man.\n\nCome see! Come learn! Come fall in love with the moon and the stars!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "fantastic", "Fabulous views of Los Angeles from her. But best of all there is a whole new world inside the observatory and all for free. The exhibits in the observatory are very interesting and some with hands-on fun."], ["Reviewed 4 weeks ago", 5.0, "beautiful views", "We visited here on a trip to LA. We had heard great reviews so had to have a look for ourselves. We parked in the car park outside, the sign on the way up had said full but there was constantly people coming and going so plenty of spaces available. You had to pay for the car park which was a couple of dollars. We went and had some photos taken with the hollywood sign in the background as you had great views from here. Then we went to the top of the observatory it was a very hazy day which made it difficult to see the view of LA. We went and had a look at the telescopes and then went downstairs to where there was a section on the planets.\n\nWe visited the gift shop which was priced as you would expect of souvenirs. Then we went into the restaurant, this was very expensive so we decided to go elsewhere for food on the way back to the hotel. Definitely worth a visit.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful Sunset Spot", "Great place to watch the sunset. The lighting was great for photos with the Hollywood sign (albeit small) in the backdrop. However, coming just at sunset means that you will not be able to see some of what the Observatory has to offer as you need sunlight for that.\n\nOnce inside, a film showed the Observatory's history and its reconstruction, which was very cool to watch.\n\nTip: If you are on T-Mobile, may sure you check what you need before heading up to the Observatory as I lost signal the whole time I was there. Not sure if others had the same problem.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great views", "Stopped here in the early morning before opening time. So didn't actually get to go inside, but instead enjoyed the great views out to the Hollywood sign and L.A.. However, the whole of L.A. is covered in a thick layer of smog, so views are somewhat limited.\n\nThe building itself is stunning, with wonderful architecture and arches.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great views of the city - and the sun!", "This is where you need to go for an easy selfie with the skyline and the Hollywood sign. There's plenty of free wonders in the observatory - my favourite being the telescope that lets you view the sun without burning your eyes out... I saw some nice solar flares. My tip would be to catch the shuttle at the bottom where there is free parking, you just need some change.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Wonderful", "Beautiful views of LA from the observatory. The drive up is also very lovely. On a clear day you can see all of the great architecture of the city and of course the Hollywood sign."], ["Reviewed 4 weeks ago", 5.0, "Great experience, not just a view of LA ...", "I went there with my family mostly interested on the view of LA and Hollywood sign from there, found something else. The building itself is beautiful, great architecture and the interior is fantastic. From a science perspective it offers great options including a lot of information about the Cosmos and solar system planets, my kids loved it. Did I mention that the entrance is free ? We went there in the morning as parking spaces are limited close to the building, but there are a lot of tour options as well. And the panoramic view from LA is excellent from there. A very good experience, you should not miss this place in your trip to LA.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful iconic place", "Definitely worth the track for a beautiful view, incredible sunset (if the weather allows it). The observatory is also interesting. Difficult to park!"], ["Reviewed 4 weeks ago", 4.0, "Quick drop by during the day", "Nice quick drop-by during daytime. Interesting and small enough to appreciate as a “last hurrah”. Beautiful view of LA but must be better at night with all the city lights on. Make sure you book your ride back before you arrive as the network signal disappears as you reach the area.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Worth going", "I went with my daughters, thinking they would find it quite boring. I was surprised to see them very interested in everything. It shows and explains in a very interesting and easy way. I would love to go back with more time."], ["Reviewed 5 weeks ago", 5.0, "Great learning facility and fantastic views", "What more can you ask from a facility that is free. I would say that science and space lovers will get the most out of this experience but the view of LA at night would probably be worth it for anyone. Space exhibits are well thought out. Facility is clean and well maintained. The place is huge. Give it two hours if you want to do everything including planetarium and telescope.\nShow less"], ["Reviewed January 25, 2018", 4.0, "A must see in LA", "This provides great views and a relaxing environment to hang out. Parking is an issue, so wear your walking shoes."], ["Reviewed January 25, 2018", 5.0, "Awesome views", "Great opportunity to see the Hollywood sign as well as an expansive view of the LA area. Traffic is a bit of a nightmare and it was very crowded inside the observatory. Still worth the time and effort."], ["Reviewed January 25, 2018", 4.0, "Great view", "Very busy and van be hard to get a parking space. That said the view of the city out to the Pacific is stunning even on smoggy days. If you want a giod photo of the Hollywood sign there are better vantage points."], ["Reviewed January 24, 2018", 4.0, "Great view", "I hiked up to see the observatory and even tho it was closed I got a great view of the city and the Hollywood sign"], ["Reviewed January 23, 2018", 4.0, "To be seen", "Was their for à to short 20 Minutes on à city tour as our limited time in LA , very impressive view of the city , a must for every visitor even for a few times ."], ["Reviewed January 23, 2018", 5.0, "Nice & Romantic at Night", "Wonderful time! Haven't been there since I was a teen! Still as awe inspiring as before. LOTS to see every one there seemed to enjoy themselves as much as we did."], ["Reviewed January 23, 2018", 4.0, "Excellent for children", "We took my husband's grand niece and nephew, and they loved it. We do recommend it if you have children."], ["Reviewed January 23, 2018", 5.0, "family hike and visit", "Had a visit from all three sons and one grandson and hiked up to the observatory and then spend about 2 hours inside looking and reading. My 10 year old grandson loved it and said things like Oh that's what our teacher taught us this year. Fascinating.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Perfection in one building!", "This has always been on my bucket list to visit, and lets just say that it did not disappoint. You begin with a long and winding road which takes you up the mountain. Upon arrival, the building is straight ahead of you which displays all of its glory. I would highly recommend making your way to the viewing areas at the back of the observatory, as this would allow you to make sure that you take the best photos in the day. We were lucky as we arrive prior to the sunset, so we were able to take day photos and then made our way inside. It is like another world inside, as there is so much to see and do which could take you hours. We then made our way outside to the roof balcony, where we were able to see the sun setting over the Hollywood sign which truly took my breath away (I know this sounds cheesy, but honestly it is amazing). After taking a ridiculous amount of photos and videos, you are able to see how the city transforms by night and how it lights up.\nWe asked locals about the best way to get back down to the city, and recommend the bus as it had several stops on the way down. I would recommend keeping an eye on the time, as you may miss the last bus back down to the city. The bus only took about 10 minutes to arrive back into the city, and caught an UBER back to our apartment in Hollywood. Overall, this is a must see if you are visiting Los Angeles and is on my list of things to do when I return.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Top 10 attraction in LA", "Nice place to visit and to view Los Angeles. Beautiful but educational as well. A lot of things to do there."], ["Reviewed January 22, 2018", 4.0, "View of Hollywood sign", "Once we got through the line of cars and parked we enjoyed the views of the city and Hollywood sign although it was a little overcast. Hint: Lines for the bathrooms were long. Free except for $4 an hour parking. There are activities to do in the park nearby.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Very good place.", "This is a very beautiful place.Paid Parking is available and costs$ 4 an hour.There is a cafe, you can grab a coffee and enjoy the gorgeous view. Not far is a free place is Runyon Canyon Park, and Park Lake Hollywood. Parking on the street free.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Only went for viewpoint - did not go inside.", "Me and my partner visited the Griffith Observatory to do some skyline photography - we didn't pay to go inside the observatory so cannot comment on this.\n\nThe area was extremely busy for a Sunday evening and we were suprised by this, however it didn't stop us from being able to take some beautiful photos of the city's lights!\n\nDefinitely worth a visit! Parking was $4 an hour, we only stayed for one hour but it was well worth it.\n\nOn the drive up to the observatory's main car park there were a lot of people parking roadside and we weren't sure why as there were plenty of vacant parking spaces in the car park above!\n\nI would recommend a visit here even if it is just for the photos!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Even if you live in LA...", "The Griffith Observatory is beautiful as an outside destination, with stunning grounds and spectacular views of the city and ocean (sunset is gorgeous). It is also beautiful as an inside destination. Make sure to catch at least one planetarium show while you're there. The cafe is vegetarian friendly (much appreciated) and the exhibits are educational and engaging for people of all ages. We've gone as a family, as a school field trip, and my daughter also had her 13th birthday party with friends there. Even if you live in LA, it's not just for tourists. You'll be so glad you went! The lot fills quickly, so just give yourself time to park on the road a little ways down and walk up. Also bring a warm jacket (even in the Summer) it gets cold up there once the sun goes down.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Beautiful views from everywhere", "Beautiful sunsets, amazing view of LA downtown and Hollywood sign (please note that there are no lights in night for the Hollywood sign). If you have time, do check out their shows - they are worth your money. The museum is also nice. Would recommend going there at dusk - so that you can enjoy both the light and the sunset. The observatory looks beautiful in the night. The other thing to note is that the phone network is very poor in Griffith, so you might not be able to book an Uber. Catch the shuttle from Griffith that drops you back to downtown and has a good frequency.\nShow less"], ["Reviewed January 22, 2018", 3.0, "Good", "One should visit in the evening just before sunset to enjoy set and also lights after dark. Visit for the landmark and if staying in Hollywood not to far away"], ["Reviewed January 22, 2018", 4.0, "Great views of the city in the day, but traffic and parking are a grind", "This is a must for those with even a passing interest in science (and/or local history) It's never not busy, so prepare yourself for that."], ["Reviewed January 22, 2018", 5.0, "A must-visit for tourists and locals alike!", "A must see for any tourist visiting LA. I live in LA and still love to visit once a year. In addition to visiting inside, this is a great location to take in views of the LA basin and a multitude of fireworks displays (personal face) on the 4th of July. Parking can be tight in the small lot at the top, but I’ve always been able to find a space when visiting during the day, during the week.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Amazing destination ..except during Christmas week 😢", "The observatory is FREE to visit and well worth the ride up the hill to go visit ...also, get tickets for the other 2 shows at the planetarium and theater .\nIf you can , do NOT visit during the Christmas Holiday period , it is totally swamped with people , you cannot park,,,it's difficult to enjoy the exhibits ...any other time is fine .\nIt is a MUST see if you are in LA,,the location alone is worth the drive up .\nShow less"], ["Reviewed January 22, 2018", 5.0, "A must for the visitor to LA.", "Even if you don't remember the famous last Act in 'Rebel Without A Cause', James Dean's first major role, this is a must for all visitors to LA. There's everything for the enquiring mind as to the nature of our Universe, even a Tesla Coil and the view of LA is spectacular.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Fantastic Los Angeles but be aware of parking and the GREEK", "I am a native Angelino, and I feel that this is a must see place in Los Angeles. The parking is tough, it's sometimes horrendous. If you have a motorcycle, I suggest you ride one up because there's front line Motorcycle parking. Great place to see LA. If you can be fortunate to come up here on a clear day, eweather gods must be on your side. They're cracking down on filming things, I'm not sure why. Pictures you can take whatever pictures you want to. Great views, great for your instagram. There has been a recent trend of people sitting in the front lawn and just hanging out, which is COOL but they're bad about sharing space. It's free. Share the space share the road.\n\nFew ways to get up, and also, watch out for events at the Greek that might slow down your commute up to the observatory. Great landmark, great must see for LA visitors.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Ooh so wonderful", "We had a perfect day visiting Griffith Observatory. The weather was beyond fine, there weren’t lots of people and the hiking made everything even nicer. And the views!!! Breathtaking, fantastic!!"], ["Reviewed January 22, 2018", 5.0, "Great place to visit to see the snow capped mountains", "Two weeks ago Los Angeles had several days of rain and as a result the San Bernardino mountains had a lot of snow. We visited the Griffith Observatory the next day and the views of the snow capped local mountains were breathtaking as were the views of downtown LA and so much more.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Family Night", "It has been maybe 10 years since my last family venture up here at the observatory, the remodel looks nice , but please be ready to wait at least 30 min to go up the hill and find parking. The scene is beautiful, but very cold during the end and beginning of the year . Make sure you leave enough time to find parking. P.S a lot of tourist that don't know how to navigate thru the winding road .\nShow less"], ["Reviewed January 22, 2018", 5.0, "An Amazing Place", "We got here on foot and as soon as we walked in we were stunned by the detail of architecture of the interior. The lines for tickets can be a little long but that gives you time to take it all in. Scenic view of Mount Lee (Hollywood Sign), Downtown LA, the LA basin and all of the Socal LA area.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great!", "We weren’t seeking easy way to get to Observatory and went up the hill) not for everyone recommended but it was ok. We came early - at 10:30 am, and Observatory opens at 12pm so we had time to look around and it was interesting to see the orbits of the planets on the ground and other. Then we came in and bought the tickets to the show The center of the Universe - it was interesting experience. Observatory is total free except the shows so before the show we had time to learn about the Sun, Tesla coil, stars etc. there are a lot of interactive expositions, so we tried to press and move everything we can:) And taking into account that we 30+yo and it was really interesting to us, could only imagine how the kids are interesting in it:)\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great day tour", "This is an incredible place. We went there with a LA City tour, so we had limited time there. I certainly wish I had more time to spend there. This is the best that LA has to offer. We were stuck in traffic going up the hill. but while there we looked at the pendulum and the view of the entre City of Angels!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Unforgettable!", "My teenage son and I are very much interested in space and the world we live in. Being able to surprise him by taking him out of school and driving to California to go to the Observatory for our first time was an experience we will never forget.\nIt is an extremely large and beautiful building. Walking in we felt that everything wasn’t cluttered and easy to navigate through. We saw one of the Star shows they had which was really exciting informative and fun. The Tesla Coil was one of my favorite parts as well. Then lucky us, after getting a snack down at their snack station we were able to go outside and watch the beautiful sunset across the valley. How amazing!\nShow less"], ["Reviewed January 21, 2018", 5.0, "This is a must visit place in LA!", "This is one of my favorite spots ever. Its incredible on a clear day. You can see the whole LA and Hollywood areas. There is an excellent view of the Hollywood sign from the grounds also. The museum at the observatory is excellent including a large display of the solar system. I love the planetarium shows. At night the whole place becomes magical with one of the most impressive views of LA and it's sprawl you can see anywhere. Also at night is of course the giabt telescopes.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Great day spent at observatory during winter break", "Overall we enjoyed our trip to the observatory. It was informative, interesting and entertaining for my 2nd grader and her friend and also for me. We loved to learn about planets, to weigh ourselves, to learn our weight on the moon, to see giant telescopes, and overall to witness Tesla coil in action. The best part that it’s fee! The views of Los Angeles are impressive and the architecture of the observatory is very enjoyable.\nWe didn’t like the trafic going up and down the hill! It took about 40 mins to go up and about an hour to get down. It was Infernal! We ended up parking at the Greek theatre and had to walk up the hill to get to the observatory itself. The cafeteria At the observatory is also very crowded. This trip reminded me of my experiences of international travel from and to LAX airport in terms of traffic, parking and food quality but I guess we are in LA! So this is the price to pay for it!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Griffith Park", "A wonderful place to go. See all the stars but no autographs. Spend the day looking back into the past. Way back."], ["Reviewed January 21, 2018", 4.0, "Definite must visit", "Of course you have to visit the Observatory for incredible views of the city and the sky. You can also use it as a base for some incredible hikes. There is parking next to the observatory. There are some public nights where the observatory is free to visit, do not come then because it gets incredibly crowded and parking is not available and often times you will be sent away.\nShow less"], ["Reviewed January 21, 2018", 4.0, "An iconic stop for the views.", "The Griffith Observatory is an icon and has some of the best views of LA and Hollywood. The grounds are well kept and nice, but the museum and observatory itself are a bit dated. Some of the exhibits were malfunctioning or broken when we were there. We still enjoyed ourselves and would like to return for one of the night viewings.\n\nParking is a hot mess and I am not sure there is a good solution. I recommend coming at least 30 mins or more before opening hours to get a decent parking spot. We arrived as the museum opened and ended up parking almost a mile away. For this reason i would also recommend good walking shoes.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Amazing views of Los Angeles", "I always take all my friends and family to the observatory. It's a beautiful view of Los Angeles. There is no admission into the observatory. You could hike for free. Kids can learn a lot from the observatory. It's a place for all ages. We always have fun there.\nIt's one of the best places to see in Los Angeles.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Day to explore.", "Not is this one of the must see when in Los Angeles. But one of the best things and it’s FREE. Children and adults all have a wonderful day. This is a hands on experience of science and wonder."], ["Reviewed January 21, 2018", 5.0, "great Observatory with an incredible view of LALA Land", "We had so much fun there with the grandkids last july Parking was a bit of an issue,. We had to climb the Hill but it was well worth it. Great view and awesome displays of the planets inside"], ["Reviewed January 21, 2018", 5.0, "Outstanding!", "My wife and I always enjoy going to the observatory. The view of the LA basin is magnificent! The science is unbelievable!"], ["Reviewed January 21, 2018", 5.0, "Love it!!", "I would recommend a visit. Family friendly. It can get crowded but, it is LA. There’s plenty of parking and the views are beautiful. Very informative"], ["Reviewed January 21, 2018", 5.0, "Great, if smoggy, views of downtown LA", "A 'must do' place to visit when you come to LA/Hollywood. A lot of parking on the roads to/from the observatory. Easy walk up to observatory and many areas to have great views of the Hollywood sign and downtown LA Definitely recommend"], ["Reviewed January 21, 2018", 4.0, "Best view in all of Los Angeles", "You can’t beat the view from the Observatory. It feels like you can reach out to touch the Hollywood sign on one side, from the south side, you can see all of the city.\n\nMany, many trails to hike as well.\n\nThe only problem? Parking. Lots fill up quickly as well as parking on the roads. It is a somewhat a stressful experience to find a spot and lots of morons that are jockeying for spots. My advice is to go really early or off hours. Don’t go on a holiday. If you’re up for a hike, park in the lower lots and hike up to the top.\n\nStill, it’s worthwhile to visit.\nShow less"], ["Reviewed January 21, 2018", 3.0, "Views", "Beautiful views. Classic California This is a very iconic place and has the most amazing views. A must see LA place."], ["Reviewed January 21, 2018", 5.0, "A trip that surprises the whole family...", "It is well worth the trip to the Griffith Observatory. The view alone is breathtaking and the telescope, exhibits, architecture and grounds offer delight to everyone in the family. As a local Los Angeles resident, I need miss taking my favorite guests to the observatory."], ["Reviewed January 21, 2018", 4.0, "Hike to this was great!", "Very busy when it is a holiday or weekend. Hike up there is fabulous and gives a view unlike any other in area. Would recommend it despite crowd..."], ["Reviewed January 21, 2018", 5.0, "Love this place", "Went there at sundown - Can highly recommend this time of day, you can see the lights & sights of the city while spending time in nature"], ["Reviewed January 21, 2018", 5.0, "A must see", "The view from here is amazing! My friend lived in LA and this was her favorite place in the city. The drive up there is pretty as well."], ["Reviewed January 21, 2018", 5.0, "Observatory, Planetarium and great views to the \"Hollywood\" sign!", "A fantastic \"must do\" activity in LA with great views of the city and the famous \"Hollywood\" sign.\nThere is a small charge to visit the Samuel Oschin Planetarium which is reputed to be the finest in the world - we were enthralled with the \"live\" narration.\nWith a cafe, beautiful walks and hikes you can certainly spend the better part of a day here.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Well worth the trip", "Fascinating place set in a great park for hiking Good for kids and adults alike. Great views over the city"], ["Reviewed January 20, 2018", 5.0, "Nice building and area to have an overview of Los Angeles", "It's nice to get up to walk around the building itself, especially you can have a nice overview of Los Angeles and Hollywood sign!"], ["Reviewed January 19, 2018", 5.0, "Fabulous - and free!!!!", "Catch the Dash bus from outside Sunset/Vermont metro and for the sum of 50 cents they will take you to Griffiths Observatory where entry is free. This is probably the best place to get a decent photo of the Hollywood sign and the views over the city are great. Inside you can spend hours reading, watching demonstrations and learning about the universe. For the sum of $7.00 you can attend a live \"show\" which I highly recommend, and when you are done head to the cafe for a tasty snack before heading back on the bus (they run every 20 minutes)\nShow less"], ["Reviewed January 19, 2018", 5.0, "The observatory was closed, but the views are worth the climb", "We walked up from the Trails Cafe to find spectacular views from the surrounds of the building, views across LA and the Hollywood sign."], ["Reviewed January 19, 2018", 4.0, "Great views of LA, Fascinating Observatory", "Interesting exhibits about tides, eclipses, the sun, meteors, etc. plus a planetarium. Well worth the trip."], ["Reviewed January 19, 2018", 5.0, "Always a Delight", "No visit to this gem in LA's Crown ever disappoints. This visit was no exception. A wonderful sunset view. A visit to the Planetarium. A glance through the main telescope into the furthest reaches of space and the illuminated cityscape creating a dazzling carpet into the distance. Just a few of this visits highlights. My only complaint is the recently introduced parking fees on the approach roads. My discovery was the free parking at the Greek Theatre from where you can hop on a shuttle bus for a few cents. Just make sure you have change. I think it was 50 cent each way. Will always visit here when in LA day or night a must do destination.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Wonderful planetarium and museum", "I visited the observatory one day in winter, and it wasn’t as crowded as I expected. The museum/exhibits were all free, and very interesting to look at. The view, both of downtown LA and the Hollywood sign was amazing - I managed to go on a day with no smog. You could see clear to the sea. However the highlight of the visit was the planetarium show, we saw “Centered in the universe” and both my friend and I enjoyed it. It was entertaining and drew you in - I didn’t want it to end! Next time I go, I will be seeing another show there.\nShow less"], ["Reviewed January 19, 2018", 5.0, "A must place to visit", "This a great place to take in the view of LA and the surrounding mountains which of course have the famous Hollywood sign on them. The observatory itself is very interesting with some great architecture and fascinating facts. You can’t miss this great attraction."], ["Reviewed January 18, 2018", 4.0, "Lovely night views", "My husband and I went around 5:30pm in January to see the night views from Griffith. Parking was difficult as the top lot was full. We parked lower down by the Greek Theater and then had to walk up (we would NOT recommend this if you have trouble with inclines or have a fear of heights). The views at the top were great though and definitely worth the \"hike\"! We were disappointed that we couldn't see the Hollywood sign since it wasn't lit up, so we'd recommend going during the day if that's what you're hoping to see.\n\nThe museum itself was small and VERY crowded so all we did was walk through it. It is free, we would not have paid to go inside.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Amazing views - and the science is pretty good too!", "We last visited Griffith Observatory early on a rainy Friday and managed to beat a lot of the crowds that the weather hadn't scared away. The views over LA are spectacular and though it's the path well-traveled, it's still one of my favorite vistas in the city. On better weather days, I highly recommend taking some serious shoes and enjoying the hiking trails in the grounds.\n\nInside, the exhibits are thoughtfully presented and there is a pleasant oldschool feel to the layout that matches the grandeur of the venue. The Tesla coil is a showstopper, of course, but we loved the planetarium and the space exploration exhibits on the lower levels - some great artifacts and very thoughtfully presented.\nShow less"], ["Reviewed January 17, 2018", 3.0, "Office outing", "If you like this kind of stuff I guess it's a good choice to pick. Got to take some cool pics of Hollywood sign."], ["Reviewed January 17, 2018", 4.0, "Beautiful", "Great views, but why do people throw their garbage down the hill? Parking is always a mess up there."], ["Reviewed January 17, 2018", 5.0, "Griffith Observatory is Out of this World!", "It is more than a planetarium; rather, it presents an overarching introduction to the cosmos, as well as panoramic views of Los Angeles."], ["Reviewed January 17, 2018", 5.0, "Beautiful LA sights", "Worth the trip. I did a walking round trip from the Bowl to the Observatory and it was so worth it. Sightseeing and exercise for the price of free. While I did not go in, the outside views were very nice."], ["Reviewed January 16, 2018", 5.0, "Another must-see for everyone!", "This is definitely another must-see of LA and you should either plan going two days or staying the whole day, here is why: Its great to go during the daytime and enjoy the views of Los Angeles but at night-time its pretty breath-taking to see all the lights of the city go on and check out the stars! There tends to be a line so be ready with comfy shoes! And if there is a concert, be ready to be stuck in traffic on your way there. Parking can be tricky, be patient!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Cool building, amazing views", "Great nighttime views of LA from beautiful building and grounds. Interesting exhibits. Parking is tough, plan ahead."], ["Reviewed January 16, 2018", 5.0, "A must in LA", "If you are not a fan of trekking its important to take the bus as is always full and you my have to park far away. Once you are there enjoy the view!"], ["Reviewed January 15, 2018", 5.0, "Out of this world", "The observatory show is both literally and figuratively out of this world. Highly recommend it. If you love movies this place plays home to many classic scene, and features a bust of James Dean.\nParking is a bit rough but if you have time there are hiking trails up that are for all levels\nShow less"], ["Reviewed January 15, 2018", 4.0, "Star light, star bright, the first star.....", "Alright, what other type of catch phrase can you use to capture the attention.\n\nSo our day comprised of up early, and hike to the peak point above the observatory (~ 1 hour) from the parking lot at the Greek theatre. From there in the morning on a beautiful blue sky morning, you can see the city from a multitude of directions, as well as some great views of the Hollywood sign. Then a 40 minute hike down to the observatory (which is free to tour around). Although the Planetarium charges for their feature. The observatory has some great information, and observation tools. It comfortably will take 2-4 hours to make your way through this observatory. Then a 20 minute walk back to the base parking lot, and you are away.\n\nOne way to experience the observatory!!!\nShow less"], ["Reviewed January 15, 2018", 2.0, "Over rated", "I was told this was the place to see all of LA. No one mentioned how super crowded it was. Huge crowds and limited parking. Thankfully shuttles to top of you can find parking. When you get to top, it’s super crowded. Biggest disappointment was the smog obscured almost all of LA making for poor pictures. I would recommend viewing city from Hollywood sign instead.\nShow less"]]}}