{"Griffith Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Griffith Park", "url": "/Attraction_Review-g32655-d129312-Reviews-Griffith_Park-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/1c/4d/e2/griffith-park.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2795"}, "address": {"@type": "PostalAddress", "streetAddress": "4730 Crystal Springs Dr", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90027-1401", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Lovely", "I liked it so much. View was great especially in night. I love to sit there, in mute and noiseless and look at the busy city"], ["Reviewed 3 days ago", 4.0, "Great Vista point for L.A.", "Came up here just before leaving L.A. It's the best view point to see all of L.A. However, if you want the Hollywood sign, you're better off going to Lake Hollywood park, as it is far off in the distance here. Plenty of parking, for a fee, or on the cuhrb for free as you go up the hill. Easy to get to.\nShow less"], ["Reviewed 6 days ago", 4.0, "Great exercise, well maintained trails, gorgeous views", "I hiked from Roosevelt's cafe (grabbed a sandwich for the trip) at the bottom up to the observatory then up to the top of Mt. Hollywood, and finally over to the Hollywood Sign. The sign is not on Mt. Hollywood, so if you are going to do one or the other, this is helpful to know. Once you leave the observatory there are no bathrooms or places to get water, so go at the observatory and take plenty of water with you. I recommend a bar or small snack as well. Bring a camera for fantastic photos. Wear comfortable walking shoes. Trails are a bit slick from dust, but otherwise, well maintained. Layer so that you can take things off when you get warm, but have a long sleeve ready for the times when the wind blows.\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice hike to the Bat Cave", "We had a good, short hike to Bronson Cave which is the Bat Cave from the original TV series. There is not a lot of parking and the port-o-potty is disgusting. Otherwise, good stop."], ["Reviewed 2 weeks ago", 5.0, "Equestrian Fun!", "Griffith Park is a magical place...full of opportunities to learn while having fun as you learn. Not only is there an Observatory for studying Planetary matters, but there is also an onsite Equestrian Center for renting and riding horses. If either of these two things don't interest someone, there's the option to simply going hiking through nature on one or several of the many trails within the park. Terrain is a bit robust so be sure to have plenty of bottled water on hand, along with sunscreen, bug repellent and a hat & sunglasses. Parking is sometimes limited, but is still free and easy to access. Parking is also allowed along the curbside on the main road leading up to the Observatory. Make a day of visiting Griffith Park soon!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Very Busy", "A great park to visit also great views over LA from the top also good photo opportunity for the Hollywood sign . It was rammed packed on a Sunday in January we had to park near the theatre and walk up."], ["Reviewed 2 weeks ago", 5.0, "Beautiful and very peaceful", "Griffith Park is very beautiful and peaceful place to visit. We took a nice long stroll through the park. Definitely a must see if you are in town."], ["Reviewed 2 weeks ago", 5.0, "Beautiful", "My experience at griffith park was lovely. We don't have squirrels back home, and hoped to see them during our stay in the states.\nI could have watched them all afternoon. The park had plenty of tracks to explore, toilet facilities, seating and playground. I was very happy to have found it, and would recommend it as a nice relaxing outing.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Good Hike", "We hiked up and viewed the Hollywood sign and then back down. Probably a 40 min hike from where we parked up. I'm in decent shape and got a little winded, it's a steep hill. Great view of the Hollywood sign and of LA. I probably could have spent more time here hiking other trails. The trail system looked like they went on for miles! We were on a time crunch so didn't have all day to explore.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best view of LA", "We came here to visit Griffith Observatory and the view both at sunset and at night was absolutely incredible."], ["Reviewed 3 weeks ago", 5.0, "Over and over again", "I just LOVE this place. It is kind of magical. Take a hike to the Griffith Park Observatory Trails Peak and enjoy the view! It is by far my favorite thing to do in busy LA."], ["Reviewed 3 weeks ago", 3.0, "A nice piece of nature in a big city", "Wellyou haveto go in here on the way to the observatory or the hollywood sign. Butyou could see lots of walking paths, good for locals but not sure if tourists would be bothered"], ["Reviewed 3 weeks ago", 5.0, "Massive fantastic park", "Griffith Park is a must visit in Los Angeles, not only is it home to the Griffith Observatory but it offers stunning views and scenery and some great walks. You can even get close to the Hollywood sign walking around here. It's best to plan what you want to do before you come here though as the park is so big that different areas have there own parking sections.\n\nBy warned parking on busy days around this park is a complete nightmare so try and come at a quieter time if possible.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fits all your needs", "Great view, great walk, great observatory with interesting explication for all astral phenomenas.\nFascinating for children as well as for adults.\nWatch the panorama of Los Angeles on the sun set what we did. We parked along the street and had the all .\nWas great even if we came back in the dark .\nRecommend as the must in LA\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Lots of trails", "Lots of trails snake through this park. Nice views of the Hollywood sign farther up. If this is a first visit for you, Make sure you study the map good so you don’t get lost. Also be sure to read all parking signs so you don’t get a parking ticket like we did. (No parking after sunset sign was missing.) As long as you leave before sunset, you could park for free and walk up to Griffith Observatory.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Must for LA", "There are so many things to do here. The trails are great but beware, there is not much shade for hiking. Be sure to check out the abandoned zoo, the Hollywood sign, and the view (night and day) of LA, the valley AND the ocean."], ["Reviewed 4 weeks ago", 3.0, "Good City view from the observatory", "Didn't have much parking space available for this park but i enjoyed the city views from this park. I was able to capture good city landscapes from here."], ["Reviewed 4 weeks ago", 5.0, "Awesome views", "amazing views of LA and the Hollywood sign, free to visit and beautiful would highly recommend visiting."], ["Reviewed 4 weeks ago", 4.0, "So much to see!", "This park is bigger than Central Park but it’s different.\n\nThere are so many different things to do here. The history is so interesting and anyone who visits here should read up on it so you can appreciate it.\n\nOur little kids enjoyed the pony rides. We toured the abandoned zoo, which I could have spent hours there!! So interesting!!!\nWe didn’t go to the LA Zoo. We just didn’t have time to do everything!\n\nWe did go to the Autry Museum! Really great! Beautiful!\n\nSome of the areas of the park were a little scary and needed attention. We were there the end of January and the Christmas decor near the pony rides still had not been taken down. This area needs an update. Slightly trashy. It’s a state park, so this surprised me.\n\nThe observatory is a must see! See my review for that separately.\n\nAll in all a great place. But I’m a history buff. You could go here everyday for a month and not be satisfied that you’ve seen it all.\nShow less"], ["Reviewed January 21, 2018", 5.0, "What a place to hike!", "This is a huge and fun place to hike...so many choices and places to go here. So many views and so much beauty. Highly recommend it!"], ["Reviewed January 15, 2018", 5.0, "Beautiful Park to Take In Sights & Hike", "This park offers great trails to hike and beautiful views of downtown Los Angeles. This park also has the Griffith Observatory that I feel is a \"must see\" if you visit the Los Angeles area. The best part about everything is it's free except parking. There is no entry fee for the park or the Observatory. At the Observatory there are fees to view a special exhibit or hear a speaker but overall everything is complimentary. The Observatory does offer a cafe and a gift store and wonderful views including the \"Hollywood\" sign.\n\nDepending on the time of your visit the traffic going up to the Observatory can be slow and bumper to bumper and the only criticism is finding a parking space and having to pay for parking (don't remember the charge) and you have to put the receipt on your dash in the vehicle.\n\nIt's hard to say how much time you will spend up there because it depends if you hike or not or how long you take to view all of the exhibits in the Observatory but plan on at least a few hours.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Science Geek", "Great place to go learn more about our universe! There are shows to watch and you get a great view of Los Angeles from the balconies!"], ["Reviewed January 10, 2018", 4.0, "Challenging Hiking experience", "We started from the Canyon Drive entrance. First we visited the Bronson Caves. Then, after walking up slope for 2 miles we reached a view point below the Hollywood sign to take pictures. Then we continued upwards and reached the radio towers above the Hollywood sign. We did not stop there. We continued to ascend along a steep dirt trail to Cahuenga Peak and the Wisdom Tree, before returning.\n\nThe hike was a wonderful experience. It was quite challenging for me but it is good for my health. Also, the view near Cahuenga Peak and the Wisdom Tree is wonderful, from which you can overlook a large area of LA. The condition of the trail is less than ideal since most of it is loose dirt, some mixed with horse waste and urine.\nShow less"], ["Reviewed January 9, 2018", 5.0, "The Only View of Los Angeles!", "We decided to go to Griffith Park on New Year's Day and wow! what a workout. We climbed the hill from the bottom (we are true hikers) to the observatory first. It was tough and it will test your limits - especially the more steep inclines, not to mention the WATCH OUT FOR RATTLESNAKES SIGNS - but well worth it. Bring lots of water and be prepared to be amazed at the views. The observatory was closed but at non-holiday time you can go in and see a planetarium type show. There are bathrooms at the top. Bring a picnic and enjoy with the older child family. Young ones may have problems climbing but you can always drive up to the observatory. We continued our climb to the peak and saw some breathtaking views not to mention amazing spots to take pictures of the HOLLYWOOD sign. Make it a must on your next trip - it will take you a half day approximately and it is FREE!!!!\nShow less"], ["Reviewed January 9, 2018", 4.0, "Center of Outdoor Activity", "Griffith Park is where much of LA residents go for outdoor activities. Within the park are outdoor music venues, running paths, picnic spots and more. It's a nice place to visit on your way up the hill to the observatory."], ["Reviewed January 4, 2018", 5.0, "Science view", "Good for science lovers and education point of view. Also good to walk from the bottom to top under the trees. Well maintained and tones of information."], ["Reviewed January 4, 2018", 4.0, "Great outdoors", "Few options to spend a day with family or hike, jog,.. The area could be a gem with more rain fall. I visited twice but dry grass with predominant. Nevertheless it is worth spending few hours."], ["Reviewed January 3, 2018", 4.0, "Very nice area !", "With over 4,000 plus acres - plenty to do - largest urban park in America - take time to explore all facets from Observatory- bird sanctuaries- Theater - horse back riding and trails !"], ["Reviewed January 3, 2018", 5.0, "Amazing Views", "Came at sunset and were treated to amazing views. Was very crowded trying to get up the hill but well worth it. A must do if you are in the area"], ["Reviewed December 31, 2017", 5.0, "So big you need to drive around it and hike in it", "Quite a few things to do here, pony rides for the kids, the merry go round, the Griffith park observatory, travel town and the L.A. Zoo. You just have to pick a place here that suits you interest for you, your friends and/or family."], ["Reviewed December 21, 2017", 5.0, "Breathtaking views of LA and the sky!", "It was dark when I arrived, so I can't speak to how lovely the exterior is during the daylight, but the exhibits and the telescopes and layout were top notch. Oh, and the views of the greater LA basin were fantastic. I saw people of all ages and types enjoying the same great view that I was. There were a few \"mobile\" telescopes set up in the lawn that were attended by staff and the public could use to peer at heavenly bodies. There was a well appointed snack bar downstairs. There was also a designated pick up area for cabs and Ubers that was very helpful.\nShow less"], ["Reviewed December 15, 2017", 4.0, "Go for a drive for an amazing view of the city", "As you drive up towards the observatory, you get an idea on how large LA really is. Park on the side of the road and head off for a hike, or follow the road to the end and visit the observatory.this park is huge and diverse which gives you so many options on what to do.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Great place to use Hollywood sign!", "Take a few minutes to go here to see the Observatory and Hollywood sign! Two great iconic places in one stop!"], ["Reviewed December 8, 2017", 5.0, "One of the most wonderful places in LA", "This never gets boring. I could visit every week. Calm and magical atmosphere, beautiful view through the telescopes and to the horizon."], ["Reviewed December 2, 2017", 5.0, "A stunner of a place!! Absolutely must see", "We went 2x! in a DAY :P yes, we went in the morning to see the Hollywood Sign and were very impressed with the Griffith Observatory - they even offer free public viewing from the telescope - TOP!!"], ["Reviewed November 30, 2017", 5.0, "Great place for bikes", "I've ridden the Griffith Park loop a few times and really enjoyed it. Starting at the bottom by the LA Zoo you ride around the Roosevelt Golf Course up and over the hill along Grifith Park Dr. The hill is long and steep at the end but not too crazy. Then you have a long, fast descent to the Railroad Museum and back to the Zoo. Its a nice ride with a lot of great scenery.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Grandbaby the delights with the lights", "Took my granddaughter there on the train light for the Christmas lights at Griffith Park had a wonderful experience. However this is a few things you need to know one you cannot buy tickets online. To get there at least an hour early there will be a long line to buy tickets and then you need to get in line for the train. It is on the chilly side so bundle up the little ones. The grandbaby and the family really had a great time well worth the wait.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Great view. Gorgeous art deco building.", "I love every to do with astronomy and it doesn't get much better than the Griffith Observatory. Housed in a lovely, perfectly preserved art deco building. With a great view of the city and the Hollywood sign. Definitely worth a visit to both the observatory and the surrounding mammoth park.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Great place to visit.", "Dash bus from Metro takes to the Observatory. Great views of LA on a clear day. A short walk towards the Greek Theater puts you on a bird watching trail up a canyon . Very good short walk. Loos at the start of it.\nAll around you hikers are on trails. Dash bus back from Greek theater to Metro.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Not your average park.", "This is a huge oasis sort of at the edge LA. Entering from the south the park seems like wild canyons and hills and this includes the mt where the observatory is located. The eastern edge along the expressway is more traditional with golf courses, a zoo, picnic spots etc.\nTip: bring some change to feed the telescopes for gazing out over the city. I plan on returning at night to see the city lights.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Favorite Hiking Park", "Almost 70 miles of hiking paths in the wonderfully scenic and historic Griffith Park. Plenty of mixed trails , easy to difficult , and almost everyone provides “ sanctuary “ from cars, noise and the city. Views on the Pacific , and on some days , Santa Monica. Come the greening that happens due to rainy season , some of the trails will remind you of the land of the Hobbits...highly recommend getting a map and try a few trails...\nShow less"], ["Reviewed November 17, 2017", 3.0, "Beware of Heights", "Like most folks, I was excited to see the views, hike and get near the Hollywood sign. I was not prepared for the dramatic heights while driving up the narrow mountain to the observatory. I will certainly take a shuttle or tour the next time around. Otherwise, the experience was great!\nShow less"], ["Reviewed November 16, 2017", 5.0, "my sanctuary", "my favorite place in los angeles. you can send all day there and never get bored. there are pools tennis courts basketball courts, a carousel where walt disney sat, horses sunsets views the observatory. the list goes on. perfect for a family a date or just to go and hang out.\nShow less"], ["Reviewed November 14, 2017", 5.0, "What a view", "We wanted to get close to the 'Hollywood' sign and oh boy did we!! the walk is easy and worth every moment getting to the top and to be within feet of the Hollywood sign was very special. The view all the way was spectacular...we got to the top just on sunset and was very magical but it's not a walk to do in the dark! so make sure you give yourself enough time to get down. You can do this climb by horse if you wish.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great hike and view", "Try to go early for best views and if you can spare the time, hit the observatory as well. Beautiful LA landmark."], ["Reviewed November 7, 2017", 3.0, "Well Known LA Park", "This park is well known by many residents of LA. It offers a green space to get away from the city for a picnic, walk, movie night (check event listings), theater (check listings), or to just relax. In comparison to other LA parks I would rate this as one of the better ones. But since this is Trip Advisor and for travelers, when comparing it to all the beautiful parks throughout the world, that's why I rated it as average. This is not one of those parks you drive to a city just to see.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Good day out", "Nice walk to the top and fantastic views from the top. Can see the whole city of Los Angeles.GREAT VIEW OF THE Hollywood SIGN"], ["Reviewed November 5, 2017", 4.0, "Great park", "It is huge. Home to the Observatory and the Greek theater. Located in the suburbs of LA. You can go hiking, biking and horse back riding in the park."], ["Reviewed November 3, 2017", 3.0, "Bring your Hiking Shoes.", "Rugged area....nice...great for birders. Bathrooms were a challenge to find. It was extremely hot that day and needed shade to enjoy. Be prepared."], ["Reviewed November 3, 2017", 5.0, "Great view", "What more can I say it's a great park with a good view, perfect for walking and seeing los Angeles city"], ["Reviewed October 31, 2017", 4.0, "Bird eye view of LA", "To visit this park, you need either uber or to travel on foot. I walked all the way from LA red line metro to griffith park and it took me 30 minutes (2 miles walk). Park is very well maintained and it gives a bird eye view of LA. A must visit place in LA.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Great view of Los Angeles (if it's not smoggy)", "This was part of a half day city tour. A great place to see the iconic Hollywood sign. Unfortunately is was terribly smoggy the day we were there but it was still a nice experience"], ["Reviewed October 27, 2017", 5.0, "Worth the effort", "On a beautiful hot day we walked to Griffith Park. We expected signage to guide us there, but sadly, no. It seems in LA for those who choose to bike or walk their way around the city you need to consult a map...anyway, we made it to the right entrance almost by chance and then enjoyed the long hot walk up to the Observatory. It is worth the effort, the views across the city are memorizing, even with the evidence of some smog.\nWe didn't get to see any rattlesnakes, despite the warning sign, but did enjoy getting fairly close to a squirrel who was enjoying a nut snack as we wandered by.\nThe many trails offer hours of exercise and a chance to enjoy this wonderful park. If possible, don't drive into the park...take the opportunity to walk or bike.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Hiking trails", "There are hiking, biking and horse trails all over Griffith Park. There is also a small train and pony rides!"], ["Reviewed October 25, 2017", 5.0, "An oasis in the northern part of LA", "If you want to hike, ride hoses, see wildlife, take a shortcut driving to avoid the highways, you have to visit. It's massive, so much to do. a real gem"], ["Reviewed October 25, 2017", 5.0, "One of the best views I've ever seen", "One of the reasons I'm jealous of people living in LA is that they can get to Griffith park whenever they want! The view is great and the park is really good if you are interested in hiking or running. If you are visiting LA (like I was) this place is not to be missed!\nShow less"], ["Reviewed October 25, 2017", 5.0, "Great park, closed on Mondays, but still worth the visit", "We loved this park- the views of LA, Hollywood sign, and beach were amazing! We went on a Monday when the Griffith Observatory is closed, but turns out I think Monday is a good day to go, because less traffic getting around, easy to park, less crowds at the observatory so we could get some cool pictures/ video. Looked like a nice park for hiking as well, but we didn't have a lot of time. Would go again!\nShow less"], ["Reviewed October 24, 2017", 5.0, "Awesome View", "Aside of being historical observatory, the view is fantastic and breathtaking. Planning to go back there at night to try those big telescope and see the beauty of the skies! Thumbs up!! Make sure you have a car it’s quite far. It’s on the Top\nShow less"], ["Reviewed October 24, 2017", 5.0, "Don't miss this view !", "A must if you want a fabulous view of LA and its surroundings-stunning at night as well and the observatory is fascinating. Definitely worth a visit."], ["Reviewed October 21, 2017", 5.0, "Run / hike trails galore", "I ran about 3 hours here and it was fantastic ! I recommend parking at visitor center and getting a trial map. There isn’t much water so bring a camelback or bottle water to refill. They have water fountains but you have to plan a little bit. There are porta Potty’s in main park areas with some flat dirt trails to run. No bathrooms on hard hikes so bring a poopy bag! Tons of trash cans. Wonderful views!!!!!!\nShow less"], ["Reviewed October 19, 2017", 5.0, "Great Views", "Great views of the city, it was really beautiful to see the views from the park! Great trails to walk or jog around."], ["Reviewed October 18, 2017", 5.0, "Night dream", "If you are romantic you should go there and see the city from the top of the world, like in La La Land."], ["Reviewed October 18, 2017", 4.0, "Don’t go on a weekend!", "If you want to go to Griffith Park, and especially up to the observatory, do it on a weekday. But beware, the observatory is closed on certain days. We tried to go there on a Sunday and it was a mad house. There was literally no parking and the park police were having people drive right on through and exit. There were no good options.\n\nSo we went back on Monday. There was parking and the views were great but the observatory was closed. We did not know that would be a thing. We did not even check if it had days it wouldn’t be open.\n\nSo for the logistical nightmare I would give this a 0, but on a normal day when you can park and walk around and see the views, it warrants a 4 simply for awesomeness and uniqueness.\n\nI cannot comment on the observatory since it was closed. The parking was easy. It is pay parking up at the observatory.\n\nIf you are in LA you should not pass this up.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Great running paths", "We stayed by Griffith Park during our stay in LA. It’s pretty tough finding time to run but with paths like these it’s actually a fun part of the vacation. Felt safe during the morning hours."], ["Reviewed October 17, 2017", 5.0, "Amazing views of the city", "I had never been to Los Angeles before and I can say that of everything I saw, Griffith Park was my absolute favorite. It offers stunning views of the city (on a clear day) and has wonderful hiking. Of course the Griffith Observatory is just as cool. I’m a photographer, and I just went crazy with my camera because the view was constantly changing.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Great place to run", "The park is outstanding place for running and spending the day with nature surrounded by squirrels and birds."], ["Reviewed October 16, 2017", 5.0, "hollywood sign", "came to griffith park and hiked to see the hollywood sign.. the neighborhoods are so nice with nice big houses! you could also see a great view of all of LA from the hilltop and see the famous skyline also while turning around and seeing the hollywood sign . a must go\nShow less"], ["Reviewed October 16, 2017", 4.0, "Park and observatory", "Very nice place to visit. Great views of the LA skyline and the Hollywood sign. The dash bus from the metro up to the observatory is only 50 cents!"], ["Reviewed October 16, 2017", 5.0, "Big oasis in the city", "Lots here with the Autry museum, zoo, many trails, Griffith observatory. Don't forget the merry-go-round near the ranger station. Operating on weekends and a few other days - even has old time music: both the young and young-at-heart will enjoy it! Treats for sale too."], ["Reviewed October 15, 2017", 4.0, "Huge park with fantastic wide trails", "This is a great park with lots of opportunities for walking and cycling with play areas and other activities for younger children. You will either need a car or to have researched what you want to do here before you set out to get best benefit. The easiest hike to the Hollywood sign is probably from the observatory about 4 miles. You will need to arrive early to get a parking space at the observatory or face a further 1 mile uphill walk from the Greek theatre if you aim is the Hollywood sign.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Great Views on a Clear Day", "Griffith Park is a perfect place for a run, walk or hike. Wear the appropriate shoes, pack water and let another know that you’re off on an exclusion. I’ve found that letting little kids run around on the grass is great for some outdoor time. Then, there is the observatory!!\nShow less"], ["Reviewed October 12, 2017", 5.0, "Bit of a hike but worth it in the end", "Griffith Park is absolutely huge and there is so much to explore. If you have a car there is various parking available but it comes at a price. We saw one for $2 every 15 minutes.\nIf you walk up from Hollywood it may take a while as there are some steep sections but is worth it fir the experience. The nearest metro for Griffith Observatory is probably Vermont/Sunset and will take about an hour to walk up. There is a supermarket on Franklin Avenue for drinks etc. And there is a cafe just before the entrance to the park.\nThe views are so worth it. If you time your visit well you will see LA during the day, during Twilight and at night!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Nice view", "Great view of the city! Lots of people! Getting to the top on a busy day is crazy--then no parking anywhere."], ["Reviewed October 11, 2017", 5.0, "Ready for nature?", "Griffith park offers a bunch of really cool trails and stuff. It’s a great place to go on a hike or have a picnic. The observatory is close too so you can also stop by if you want to see some cool aliens and stuff. 10/10.\nShow less"], ["Reviewed October 6, 2017", 5.0, "An amazing experience!", "Loved all the educational exhibits, shows, scenery and ambiance. What a wonderful observatory! I would definitely go back again as there is so much to see and do. I loved seeing the Tesla coil demonstration."], ["Reviewed October 5, 2017", 4.0, "A fantastic break from the hustle and bustle of LA", "We tried twice to get up to the Observatory to watch the sunset, but both days we ended up in grid locked traffic and ended up having to walk a fair bit of the way up - no biggie, but we never made it up in time to see the sunset - I guess we'll have to do that next time we're in LA.\n\nBut I really liked Griffith Park, it's an oasis right in the middle of all the hustle and bustle of LA, my favorite part was probably Amir's Garden though - a tranquil garden on top of one of the hills, with beautiful flowers and humming birds buzzing around. It's a small hike up there, but it's worth it.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great & must see during LA trip", "Went with family on a Sunday afternoon, was patient and found parking at the top. The view of the city & Hollywood sign were great as was the Observatory. Live view of the Sun & some great exhibits."], ["Reviewed October 2, 2017", 5.0, "Great place for couples, groups, picnics, hikes", "Nice hiking trails- pretty moderate when it comes to how strenuous they can be. You can start at the bottom and hike all the way to the Observatory. Or you can drive in and have a picnic at many of the picnic tables scattered around. It's a huge place with many points of entry. Look at a map to see all the options!\nShow less"], ["Reviewed October 2, 2017", 2.0, "Total Trafic-jam", "We planned to visit the observatory late afternoon. And It became a living trafic hell. When we finally reached the observatory (by car) we just hoped to get out of that hell as quickly as possible.\nNext time we should consider going to this place, we will walk.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Get a local's view of LA", "The largest urban park in the US, if not in the world with many hiking trails. Park at the bottom and hike up to the Observatory to get the best views of the skyscrapers of DTLA. The more adventurous can continue onto Mt. Lee and the Hollywood Sign\nShow less"], ["Reviewed September 28, 2017", 5.0, "Stunning view", "It is a hike to the top but well worth it. The views at the top near the observatory are incredible."], ["Reviewed September 28, 2017", 5.0, "summer visit", "if you are coming here during the summer.... prepare for traffic and prepare to park really far away and \"hike\" along the road up to the top where the observatory is. Especially during the later afternoon/evening. Same for the weekends. there is no fee to enter the observatory.... awesome views, you can see DTLA/Hollywood and the Hollywood sign is behind you/K-Town/West LA from the Observatory. You can roam all around the different levels of the observatory. if you go later on at night, there may be parking spaces opening up at the very top... but depending on the night, the parking attendants may not let you drive up that far. dress comfortably.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Excellent views", "It offers stunning views of LA city, Hollywood sign and mountains. Place is filled with tourists , and offers almost 360 degrees views. It's free and you can easily spend few hours here. Restrooms are available and so is parking."], ["Reviewed September 27, 2017", 5.0, "Real Tribute to 'Griffith'", "Had read about J.Griffith's contribution of 3000 acres of land to the park in 1896. Felt like offering 'Real Tributes' to such a personality. With his foresight, today it holds an Amphitheater, Observatory & a Planetarium too. It has witnessed four major fire accidents in 1933, 1961, 1971, 2007. Even if we remember these aspects on visiting the 'Griffith Park'; It would be a tribute to #Great Souls#\nShow less"], ["Reviewed September 21, 2017", 3.0, "Beautiful views", ".. but slow busses. It wasn't clear that you could park at the top. Therefore we parked at the Greek Theatre and took the bus to the top. However the line was long and there were not enough busses. There was even a traffic jam. It would be better to make sure the busses get priority lanes or something similar to get faster up top and back down.\nShow less"], ["Reviewed September 20, 2017", 5.0, "One of the largest city parks in America", "Named after the man who donated the land, this is a beautiful park which separates Los Angeles from the San Fernando Valley. You can ride a small train, ride horses, hike, picnic, play golf, or look at Traveltown where there are old train cars. It is a good place to take the children, or where you can get some peace and quiet.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Everlasting gobstopper of a park", "Everlasting gobstopper of a park. Something for all and individual treats throughout Griffith Park. Great hiking and one of the best bike rides in Los Angeles goes from the Planetarium to Travel Town. The hippie love ins were on the Merrygo Round meadow and the abandoned zoo is now simply a place to eearily explore. The new zoo is a hidden gem that few seem to have embraced. The Audrey museum is another place that has yet to capture the publics imagination.\n\nIf Griffith Park were in New York it would be embraced in the same fashion as Central park. Los Angeles has yet to view it as a whole rather than a collection of small parts.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Great walks", "This is a beautiful park but very vast and hilly so get fit and take some comfy shoes and plenty of water , great if you have a car so you can spend a fair bit of time and great for picnics as tables and benches all round also some great hikes and trekking trails\nShow less"], ["Reviewed September 18, 2017", 5.0, "Hiking", "I took a guided tour through the mountains and through the park. There is free parking at the bottom till 1pm so up hike your way up."], ["Reviewed September 16, 2017", 5.0, "Amazing Views", "We happened to go on a very clear day and you could see for miles. There were a lot of people so you have to park a good ways and walk up the hill."], ["Reviewed September 14, 2017", 5.0, "Awesome Hike, Better Views", "Hiking at Griffith Park was one of the more surprising highlights of my trip to LA. We decided to hike the trail shortly after I got off the plane so I could see a good view of the city and the Hollywood sign and it definitely did the trick.\n\nThe drive up to Griffith Park was beautiful! The homes were stunning and was a very lush oasis in an otherwise desert arid climate.\n\nThe hike we chose was the most difficult path, but while it was tough going up, the view at the top was its own reward! We were treated with a panoramic view of LA and a close up look at the Hollywood sign. It's even above the Griffith observatory, which I would like to stop off at next time.\n\nOverall a great hike for a novice hiker looking for a unique adventure!\nShow less"], ["Reviewed September 14, 2017", 5.0, "dream as seen on new stations, movies, etc", "although I didn't get to fully enjoy the telescope, I did enjoy the the views and just being there gave me goosebumps. I happen to have had my bicycle in the car, so found me a quick parking spot, which kindly enough, the people leaving gave me their parking receipt for a few more hours, so I paid it forward by giving them a few dollars, and passed on the receipt to others when I left.....but back to the bicycle: I rode up the rest of the hill and was in complete awe. *an extra: The Greek Theater at the bottom of the hill exiting the Park. big fan of all concerts/music held there.\nShow less"], ["Reviewed September 10, 2017", 5.0, "fascinating!", "a free museum and view. The exhibits on the eclipse and the close up pictures of the sun were really fascinating!"], ["Reviewed September 6, 2017", 5.0, "Quick trip and would like to go back", "This was a very interesting area and we didnt have much time so I definitely would like to go back. You can see the Hollywood sign from here to."], ["Reviewed September 6, 2017", 5.0, "Beautiful views", "Los Angeles largest central park has many hiking trails and great variety of venues of thing to see and do."], ["Reviewed September 4, 2017", 5.0, "Love this park", "Great park to go to. Its huge with lots of activities to do. There is games and other activities to do while you are there. The park is big and lots of space to walk, run, climb, practice sports etc."], ["Reviewed September 1, 2017", 4.0, "Amazing views", "We came here to visit the observatory, but it was the day before the solar eclipse and the observatory was packed\nWe decided to have a walk around the park, it was then we appreciated how big it was\nThe park and trails are well maintained\nThe views are stunning\nYou can walk to the Hollywood sign from here as well - just take some sturdy walking shoes and plenty of water\nShow less"], ["Reviewed August 30, 2017", 5.0, "Sunset Time to Go", "I took a hike up here with my friend and was so pleased with the walking trails as well as the overall view from the observatory. It can get steep in places, but I saw that there was actually a road to drive up! So it is good for people of all ages. I'd highly recommend coming up for sunset.\nShow less"], ["Reviewed August 29, 2017", 5.0, "OMG I love this place!", "Due to jet lag we arrived to the park early morning around 7am. It was a glorious day, very sunny and later on pretty hot. We hiked a couple of different trails. We also went to see the back of the Hollywood sign (which wasn't worth it).\n\nThe park gives you wonderful views and it is very relaxing and beautiful out there. I hope I will be able to come back. Loved it!\nShow less"], ["Reviewed August 28, 2017", 3.0, "Great city views", "You can get a good view of the city and the exhibits are interesting, parking is terrible unless of course you find a spot on the street when someone is leaving even then its a good 5-8 minute walk to the observatory, even on a week day\nShow less"], ["Reviewed August 27, 2017", 4.0, "Iconic park you must enjoy!", "As soon as you enter the park you will be surprised at the many associations you already have with it."], ["Reviewed August 24, 2017", 5.0, "It's more than just a park", "Here you can hike, go on mini train rides, rent a bike, have picnics galore, go the Zoo, The Autry Museum, restaurant facility. It's large and has various entrances. Try getting a map of it before you go so don't get lost or miss things. Great place.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Beautiful Sunset Location", "Wow - it's worth the effort getting up here and finding a place to park for stunning sunset. The views over LA are incredible with the setting sun behind you. It will get cold so bring a jumper! And don't expect to see lots of stars - unless you're watching one of the movies in the planetarium. A great place for timelapse photography as day turns to night. If it's a concert night at The Greek be prepared for even more traffic and access to the Observatory may only be via one route - we found this out the hard way!\nShow less"], ["Reviewed August 20, 2017", 5.0, "Amazing place in Griffith park", "Absolutely amazing Autry museum of the American West located in Griffith park is an obligatory must see in LA!!! Please, dont waist your time and money for primitive museums on Hollywood bd, this is even not a poor copy of the original Tusso's and Guiness museums, but AUTRY will excite you with the first minutes of your visit. You will see the unique collections of costumes from legendary films, old luxury guns, handcrafted masterpices, and a lot of other amazing things, including special exhibition dedicated to the 20th century toys:) Also I'll recommend this place for families with children.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Beautiful overlook, plan to arrive at 11:30", "The views from the Griffith Observatory balcony are stunning, the exhibition is very intelligently arranged -- interesting and not at all childish or simplistic. I think that for younger children, the science-oriented exhibition probably goes beyond their grasp. It's much more suitable for older kids and teenagers.\nThe two planetarium shows were WONDERFUL. With a live-person narrating the 45 minute shows skillfully, interestingly, and with a beautiful voice and sense of accurate drama.\n\nThe box office opens at noon, and the place gets VERY crowded. Plan on arriving early, parking your car at 11:30 tops (parking can become an issue -- you'll need to park far away and walk up the hill for a while). In the high season (summer), if you arrive at, say, 14:00 in the afternoon, the planetarium shows will be sold out.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Griffith Park Amazes", "We were only able to visit for a short time with our \"A Day in LA\" tour, but we very much look forward to a return trip."], ["Reviewed August 13, 2017", 5.0, "Beautiful view of LA & Hollywood Sign", "Went to Griffith Park for the view of the Hollywood sign and the view did not disappoint. This is a popular location, so getting to the top of the mountain by car takes some time. If you're not there first thing in the morning you will likely have to park further down the mountain and then walk up towards the Observatory for the views. The walk can be long and hot, but it's worth it. Note that you have to pay for parking.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Hiking Trails", "Griffith Park has a variety of hiking trails, throughout the park. The area near the Observatory has trails that wind through the hills, with spectacular views of the city below. Near the golf course and the Zoo, the trails climb into the hills that give views of the Los Angeles River, Glendale, and Burbank. Be sure to bring water, and check the map at the trailhead for an estimate of the hiking ability necessary and directions.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Beautiful", "Worth going. It's a nice place, beautiful park, great view, and well Maintained go there if you have couple hours"], ["Reviewed August 10, 2017", 4.0, "Park here...and HIKE", "We parked near the observatory and began our 3.5 mile hike (7.0 miles total) to the back of the Hollywood Sign. The trail is safe and clean (except for horse poop). It's a must do if you can spare a few hours. Bring water!!!! You get great views of LA from above and it's quiet. Like a hidden gem above the city.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Beautiful, be wary of parking!", "Absolutely amazing views for sightseeing and photography. It's gorgeous. I'd recommend for anyone visiting LA. Be wary of parking though- I got a 95 dollar ticket for parking on the side of the road. There weren't any signs- it gets crowded with vehicles. So take some patience along with the cameras, tennis shoes and picnic boxes.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Amazing", "After seeing this place innumerable times in the movies and on TV, I had to go in person.The views ar amazing, especially downtown LA. I had seen that view often on the screen, but there is also a nice view of the Hollwoood sign."], ["Reviewed August 8, 2017", 5.0, "The top of the World", "To start with a down -on site parking is almost non existent, you get filtered off down a 'country' lane and we had a 15 minute walk uphill to get there. Get there early. Once there it was fantastic, wonderful views and the exhibits inside were even better. This holiday seemed to have been very science orientated but everything is presented so well it becomes exciting, not boring\nShow less"], ["Reviewed August 7, 2017", 4.0, "Essential for your L.A. visit", "Everything about this place is magical- the views, the hiking, the observatory, the location to everything else. You may have to look for parking and walk a bit til you get to the observatory, but once you're there, you're set. Great photo spots of the city too!\nShow less"], ["Reviewed August 7, 2017", 4.0, "Park surrounding the observatory", "Whilst the observatory probably is a lot more interesting, the park surrounding the observatory is also very nice. If you want to take the hike up through the park, use the ample parking at the entrance of the park and take the hike up. Parking up at the observatory is very limited, and recently they changed it all in a one-way circular system, which increases the flow of traffic, but it makes it a lot harder finding a spot by driving up and down.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Wholesome Outing", "This is like a huge oasis in the middle of a large metropolitan area. Here you can hike, bike, picnic, play tennis and many other outdoor activities and not spend any cash. Of course there is also the zoo, observatory, theater, golf course...this place is great! The\nShow less"], ["Reviewed August 4, 2017", 5.0, "Breathtaking views and an exciting observatory tour", "We were amazed by the breathtaking view we got of the city up at the observatory, to top it off we also got to enjoy a beautiful sunset next to the Hollywood sign. In the observatory you can get exciting facts about our solar system. And be sure not to miss the movie in the Leonard Nimoy Event Horizon theater.\nShow less"], ["Reviewed August 3, 2017", 4.0, "Beautiful landmark with stunning views", "We took the shuttle bus up to the observatory for a taste of LaLa Land. Brilliant views over the city and a nice cafe to sit and soak up the atmosphere. Only downside was volume of traffic causing congestion and delays getting up to the summit and back but worth it.\nShow less"], ["Reviewed August 3, 2017", 4.0, "Great day", "Spent some time here relaxing from the rigors of LA and Hollywood. Pony rides and wide open spaces to enjoy. Bring a lunch and drinks lay down a on a blanket and enjoy the peace."], ["Reviewed July 30, 2017", 5.0, "Sunset", "Best LA spot for the sunset view. Park your car in front of the greek theatre and take a shutle that costs US$ 0,50 p.p. the view is amazing. You can see the city of Los Angeles and the Hollywood sign on the mountain. It have also free viewing telescopy that you can use to see the moon, jupiter and saturn. Inside there is a planetary, and a lot of rich information about astronomy. I recomend a visit.\nShow less"], ["Reviewed July 30, 2017", 4.0, "Decent hike", "It was a decent place to get outside for the day. Wish the signs explained the trails a bit more. Not enough signs to know which way to go. Your kinda on your own for that."], ["Reviewed July 30, 2017", 5.0, "Beautiful views", "Griffith Park is well worth visiting both daytime and night - it has fabulous views of the city. We walked here from Hollywood - took about 40 minutes - but probably better to drive at night."], ["Reviewed July 29, 2017", 5.0, "Amazing", "Great views from the park and an amazing observatory. What a great way to spend the day. There is lots to see and do!"], ["Reviewed July 28, 2017", 5.0, "Best City Park in the United States for 100 Reasons", "As someone who's visited Griffith Park literally hundreds of times since 1967, I had to make mention of \"Angelenos' backyard\" at least to post a photo or two. So much to see and do, including its famous hiking trails and historical sites -- if you haven't been, I recommend starting with a short stop at Ferndell then proceeding up to the Observatory. Then consult any online guide to get directions to its other treasures: The carousel, pony rides, Disney's barn, Travel Town, LA Live Steamers, Bee Rock, the Hogback trail, Dante's View, Amir's Garden (try to ignore the surly caretaker), the soccer fields, Autry Museum, LA Zoo, the Old Zoo (non-natives love to write about this \"secret\" \"hidden\" landmark ad nauseum, but natives know it's hardly secret, and it's sitting in plain sight just west of the Crystal Springs playground.) Visit Los Angeles Resident Tourist on Facebook for actual hidden sites, additional photos and tips. Thanks!\nShow less"], ["Reviewed July 25, 2017", 5.0, "Always worth the drive", "There's so much to see and do at Griffith Park.\n\nYou can go here to catch a show at the Greek Theater. You also go here to visit the Observatory and check out amazing views of Los Angeles and the Hollywood sign. You can go here with kids for pony rides. You can also check out the old zoo and take some creative photos. You can come to different parts of the park to try different hiking trails including several that leads you to the Hollywood sign. I think there's a summer camp and a ranch here as well.\n\nTotally worth a visit and a treasured LA landmark.\n\nShow less"], ["Reviewed July 24, 2017", 5.0, "For Angelenos and tourists alike", "Loved our drive through the park, great scenery (several movies have shot scenes there). Our tour only drove up to Griffith Observatory and back down -- would love to have stayed longer and learned more about the ecology."], ["Reviewed July 24, 2017", 5.0, "Beautiful Oasis with Easy Access", "This is a great place for a picnic and hiking. Let the kids run. It is in the canyon so the scenery is very close in and natural as opposed to the Observatory above which carries wide expansive views of the city. Easy access and parking compared to the observatory on weekends.\nShow less"], ["Reviewed July 21, 2017", 4.0, "IF YOU LIKE RUNNING", "I have been running up the hill to the Observatory two times, for me was a tough one, from LA city up to the Observatory is over 200 meters... not bad. Then once you arrive at the top you feel you have reached a good target and you can see the all city from above, pretty extroversion. Try yourself!!!!\nShow less"], ["Reviewed July 19, 2017", 4.0, "Escape from the city IN the city", "Like New York's Central Park, Griffith Park isn't a place where you can breeze through the whole place in an hour. It's an urban oasis with flora, fauna, assorted hikes and strolls, a great zoo, children's activities galore and plenty of space to plop down a blanket, open your picnic basket and catch the breeze or some rays. Even when it's crowded, it's peaceful and green and soothing.\nShow less"], ["Reviewed July 19, 2017", 3.0, "Nothing Special", "We drove down from the Observatory through this park, and we ate our packed lunch there. It didn't look anything much to see or do that we're aware of. There only a couple of tables. Parking is free."], ["Reviewed July 17, 2017", 5.0, "A regular visit for me everytime!", "Great views and don't forget the lighting show inside the main building. Can get chilly and a scarf always needed for the ladies."], ["Reviewed July 17, 2017", 5.0, "Bring your walking shoes", "Every time I visit LA I come to Griffith park and walk right to the top to take in the incredible views all around. I love to watch the sunrise and see the day start far below. This is my favorite part of the world. When I die I want my ashes scattered right from the top.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Sunset Hike to Hollywood Sign", "This is my first time visiting and it certainly was an amazing journey, with magnificent vistas of the sunset atop the hills on the trail. The trek up to the sign itself was packed with different types of terrain and it definitely took some time going from the parking area near the Griffith observatory to the top. If you want to get to the sign quicker I would suggest starting from another spot.\n\nUltimately this is a must-do if you're in the area and sunset is a great time to go.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Spectacular views", "A must for one-time, and some time, visitors to Los Angeles. A very clear 300 degree view of the whole of LA County - smog permitting - all the way to the Pacific. Great opportunity for photos and the perfect view of, well, everything."], ["Reviewed July 14, 2017", 4.0, "Amazing park", "The Griffith Park is an amazing park to spend time in it. At the very top of the park is the Griffith observatory."], ["Reviewed July 13, 2017", 4.0, "Parking is a nightmare", "Lovely place, you just have to see the sunset after climbing up but driving there and parking your car is an awful experience. Observatory is great and very interesting, however. And the view is spectacular."], ["Reviewed July 13, 2017", 4.0, "Beautiful But VERY Busy!!", "The park itself is incredible with amazing views of the city. Unfortunately, our most recent trip put us there on a Sunday and it was impossible to find parking for the observatory. We would have had to park miles down the road and hike uphill to get there. Fortunately, I've been in the observatory before. If you want to get into the observatory, you might not want to go there on a weekend.\nShow less"], ["Reviewed July 12, 2017", 3.0, "AND, if you go off the trails, you just might find a body...SO awesome!", "And if you go off the trails, you just might find a body...truly an awesome LA souvenir you don't want to pass up!\n\nI was brought here by BLA-BLA land, which I found SO disturbing that I needed to give my 2cents about it. The Emma Stone character decides to go up to Griffith LATE AT NIGHT. What a great idea! And then, they went dancing by themselves with no one else around...HOW romantic! I bet all the LA serial killers wet themselves watching that part of the movie.\n\nThat place is dark. It's considered a serial killer play ground, to this day. Look up its history, people. It's a place where bad people go to do bad things. Don't go by yourself, as it's isolated and no one will hear you scream, and don't go late at night. Stay safe...\nShow less"], ["Reviewed July 12, 2017", 5.0, "a sunset must stop", "Two important things to know: first, parking is an absolute nightmare the closer to sunset! Make plans to get there an hour or two prior to sunset in order to park anywhere close. If you have to park on the street leading up to the Observatory, be prepared to walk uphill. Second, going for sunset is a \"must see\". We also did the planetarium show while we were there and enjoyed that as well!\nShow less"], ["Reviewed July 12, 2017", 5.0, "I Love Griffith Park", "More than a Park. Griffith Park is an experience. So very much to do there. I have hiked there many times. Climbed the hills also. It's a huge Park. There are wild animals and wild people in the park, I have never had a problem. Fun place to visit.\nShow less"], ["Reviewed July 11, 2017", 4.0, "Pretty good park. Regular but still good", "Can't say much special except it's a pretty good park in a good area. It was soooo hot the day I went and I'm not from Cali so it was crazy hot. It's close to the zoo and old zoo. Overall I enjoyed it. Great park for nature friendly people\nShow less"], ["Reviewed July 10, 2017", 4.0, "Cool place with the view but pain with parking and crowd", "Lots of people hike nearby and of course tourists come here for the great view and the HOLLYWOOD sign as well. Just beware of the pain of finding a parking. I would come here early to avoid the crowd!"], ["Reviewed July 6, 2017", 4.0, "Large park with loads of trails. Pleasant countryside in the city", "Griffith park gives you the opportunity for some hillside rambling in the city. Can be busy getting there and finding a parking place but after that it's a very peaceful place to wander around. I saw a bird of prey catch a small snake while I was there.\nShow less"], ["Reviewed July 5, 2017", 4.0, "fun places to explore", "We mainly headed here for a ride on the carousel, or merry go round as they call it. I wanted to see it for its history involving Walt Disney taking his girls there and coming up with Disneyland while he sat on one of the benches. My family enjoyed the ride. There were also many birthday parties going on all around us.\nShow less"], ["Reviewed July 5, 2017", 4.0, "La La Land", "Excellent view of Los Angeles. Nice exhibitions / especially interesting for kids also. Usually very crowded. Do not go in the middle of the day because it could be very hot. Nice setting for photos. Car parking $4 per hour."], ["Reviewed July 3, 2017", 5.0, "One of the best overviews of LA", "The views on the way up and down of the city are the best. Access is best via Fern Dell Drive and the Western Canyon Road - less traffic. Plus get great access to parking on Western Canyon Road. Plan the time and day of your visit well, to escape the LA's smog and fog that reduce visibility\nShow less"], ["Reviewed July 3, 2017", 4.0, "Amazing Views!", "I loved seeing the views from around the Observatory after sunset. It was fairly packed but you did have room to move around and there were plenty of bathrooms outside."], ["Reviewed June 29, 2017", 4.0, "Great trails and views", "A terrific location for a hike. Lots of options, with wide maintained trails. Great views throughout."], ["Reviewed June 29, 2017", 4.0, "So Much To See & Do!", "Griffith Park is a huge park right in the middle of the city. There are a lot of different things to do there depending on interest and ability. One can easily spend 2-3 days exploring. We spend 2 days in May visiting the observatory, zoo, Travel Town and Walt's Barn. In addition to these attractions there are also miles of hiking trails, pony rides, golf, and picnic areas. The Autry Museum features exhibits about the history of the Western U.S. You can rent a bicycle or take a train or carousel ride. Admission to the park is free and so are many of the attractions. Check the website before you go because the different activities have varying hours. It's well worth the visit - just be aware (as others have noted) that parking can be a challenge. We did not have any trouble parking at the zoo and Travel Town (we arrived at both just prior to opening), but the observatory was another matter. We did manage to get a parking space and see it (8:30 on Saturday morning) but it was congested and traffic was slow. Consider taking public transportation if possible - there's a bus that goes to the Greek Theatre and the Observatory from the Vermont/Sunset Metro Station.\nShow less"], ["Reviewed June 27, 2017", 5.0, "A MUST if you're in LA!", "I was in LA for a few days and really only had time for one good hike; so after some research it seemed Griffith Park was my best bet. Considering the Observatory at the top of the mountain (GO THERE TOO!) was also on my list of things to do it made the decision pretty easy. I'm a pretty new hiker so I was weary to do the hike alone however I said screw it and took the Western Observatory trail. WOW! Such gorgeous views of LA the whole hike and it was nowhere near as crowded as other reviews warned. Overall it was pretty physically demanding but as a young guy I didn't have much trouble making my way to the top. I imagine this would be an awesome hike with some friends or a significant other, so I plan on returning with more people :)\nShow less"], ["Reviewed June 25, 2017", 5.0, "You can never go wrong with a visit to Griffith Park.", "Hiking, star gazing, picnicking, geocaching......outdoor fun awaits! Definitely a valuable resource of Los Angeles."], ["Reviewed June 24, 2017", 5.0, "Busy but worth it", "Very busy so tricky to find a parking space but worth it for the views. Track down the tunnel from Back to the Future, loved it."], ["Reviewed June 24, 2017", 5.0, "Amazing", "What an interesting place set high in the hills of LA! It is a beautiful building in itself. Seeing and learning about what they do there, the moon, stars and the worlds beyond is amazing. The entire area is used not only for the observatory but hiking, climbing, picnicking, golf you name it. Would love to have been able to go back and see the stars at night, must feel you can touch them. This is a great family place especially for teenagers and up to learn,\nShow less"], ["Reviewed June 21, 2017", 5.0, "GREAT HIKE and Views", "A really hot day, but so nice hiking up to the observatory. Who knew there was a sweet museum on top? The views were amazing."], ["Reviewed June 21, 2017", 3.0, "Crowded!", "First, this attraction is free. Second, because it is free, it is very, VERY crowded. Traffic was like a slug on ice, and parking was like winning the lottery: you have a chance, but not a good one. And while the grounds are free, parking is not. There is a four-hour minimum fee, even if you only plan on sticking around an hour or so. So that's where they stick it to you: $16 bucks. Ouch.\n\nAs far the actual place goes, it's iconic and offers some of the best views of LA. So bring a camera. As for the observatory itself, it's just okay. Many of the exhibits were dated or not working at all. And because of the crowds, we were lucky just to get to a few of them. In all fairness, we went on a Sunday; which was probably a bad idea.\n\nStill, the views are great, so check them out. Just be prepared to face the standstill traffic. Welcome to LA.\nShow less"], ["Reviewed June 18, 2017", 5.0, "The hike!", "So worth coming to this park! It was a very challenging climb because we are not used to hills, so be prepared and bring lots of water."], ["Reviewed June 14, 2017", 5.0, "The views!", "This park is a major tourist spot but it is worth going because the views are so awesome! The observatory is closed on Monday so try to go then since the crowds are manageable and you can get a parking space. Good spot to see the Hollywood sign.\nShow less"], ["Reviewed June 14, 2017", 4.0, "Personal Hike", "When coming to LA I knew I want to hike Griffith park. The park is not hard to find with GPS. The hike was everything I thought and more. The views of the Hollywood sign were an added treat. The bathrooms are a bit \"used\" but with the amount of people using them I guess that is to be understood.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Looked great - sorry didn't have time to enjoy more", "Drove through Griffith Park en route to Griffith Observatory near top of mountain. Impressed with hiking and biking paths. Very impressed with foresight of Griffith to donate 3000+ acres so many years ago to enable such a great park, now in the middle of L.A. metro-plex.And it's FREE!\nShow less"], ["Reviewed June 12, 2017", 5.0, "Marvelous Sunset and the Holly Wood Sign", "Went there for sunset - the drive was quite a long one (keep going uphill takes plenty of time).\n\nReached at approx 7pm (sunset at 8pm-ish) yet its super struggle to get a parking spot. Have reshuffle a few loops to get one spot.\n\nThe view was magnificent - you just can say no to that. and a tiny 'hollwood' logo will be spotted around the sunset area.\n\nTotally worth the drive and the time. Just a bit chilly up there.\n\nMake sure you go probably 2hrs before to make sure you get to park your car. The road is kinda one way (in a loop) so you may have to make couple loops if you don't have space to park.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Great views", "We hiked up the Cahuenga trail to the wisdom tree and then to the backside of the Hollywood sign. It was amazing!! Highly recommend @RangerTedLA_ to lead you on this hike if you're not a hiker."], ["Reviewed June 11, 2017", 5.0, "Amazing views - an absolute must", "The views were incredible - the Hollywood sign and the vastness that is Los Angeles. Lovely spot away from the busyness of the city - wish we had had longer to enjoy the trails. Parking a bit of a challenge but you should persist."], ["Reviewed June 10, 2017", 3.0, "Great views, interesting drive ALWAYS crowded", "I have been several times on different days of the week and different seasons. It is always crowded. Everyone is trying to get to the Observatory or to see the Hollywood Sign (see it from Canyon Lake where less crowded) so traffic is bad. The park is nice place to relax and kick back if you can get a place to park. There are some spots in the park with amazing views.\nShow less"], ["Reviewed June 8, 2017", 4.0, "amazing views...", "This place is one of the best attractions of LA. It offers a great view of the city (LA) as well as of Hollywood sign... it offers a lot of knowledge (for nerds) and the architecture of this place is also amazing... It is a must visit place...\nShow less"], ["Reviewed June 7, 2017", 5.0, "Classic LA!", "I grew up in the valley just a few miles on the other side of the hill and remember that we often came on a night with clear skies. the views and lights are spectacular! I recently revisited and it brought back so many memories."], ["Reviewed June 7, 2017", 5.0, "Wonderful", "Walking or hiking through the park is relaxing and wonderful. Even when busy, there is lots of room to enjoy nature. Don't miss the \"wishing tree\" just as you begin the hike."], ["Reviewed June 6, 2017", 5.0, "griffith park car tour", "Excellent park but very busy. We left before the park closed to avoid a traffic jam leaving the park."], ["Reviewed June 5, 2017", 4.0, "Amazing views", "Great views from the top. Must visit when you are in Los Angeles. Parking can be problem on most days"], ["Reviewed June 5, 2017", 5.0, "Views", "Great place to check out and see the Tesla coil. Wonderful view of the city. Also caught a show in the planetarium. Not too expensive for the show."], ["Reviewed June 5, 2017", 4.0, "Beautiful views", "The park provides beautiful views of the city, along with the Hollywood sign. Of course, there is the Griffith Observatory up at the top but there is also quite a number of attractions within the park, as well as hikes."], ["Reviewed June 4, 2017", 5.0, "great for a hike", "The park is huge and really makes you feel at one with nature. Parking can be a little hard on the weekends."], ["Reviewed June 4, 2017", 5.0, "LA's Awesome Premier Park!", "Having gone to Griffith Park since I was a little girl, it holds a special place in my heart. So many things to see and recreational opportunities abound! First, and probably the most well-known is the LA Zoo. It's a wonderful, modern zoo, with so many animals to see. Young children and the young-at-heart will enjoy a visit here. There are a number of hills, so taking a tram ride may be in order.\n\nOther things to do include golf, horseback riding at the equestrian center (where I spent many a Saturday a.m. riding as a youngster and teen), and even watching the local rugby teams, Plenty of places to picnic, walk and hike, play ball, and explore. (You need to be careful as there is wildlife living in the hills.)\n\nWhat would a summer's evening be like without taking in a concert at the Greek Theater? A really nice venue with a modern sound system, smaller than the Hollywood Bowl. Nestled within the pine trees, it's a terrific \"smaller\" venue (compared to Dodger Stadium, unless you want to take in a game), and the Forum or Staples Center. Check the schedule online and you can even buy tickets as well.\n\nThere are plenty of other attractions as well: The carousel, and Travel Town, and if you take a hop across the Ventura Fwy, you can visit the Gene Autry Museum of Western Heritage.\n\nIf you're in the LA area around Christmastime, you can thrill at the driving tour of Griffith Park with their spectacular light displays. Fantastic, but be prepared to \"take your time\", as you'll be there with many other visitors, along with people from the LA Metro area who also want to see what's become a holiday tradition.\nShow less"], ["Reviewed June 3, 2017", 5.0, "The view is amazing", "Standing at this lookout, you can really appreciate the scale of Los Angeles. It's nice to see the sun go down and the lights start to illuminate the sky."], ["Reviewed June 1, 2017", 5.0, "Great views! Historic place", "I came here the first time with my family on vacation in 1956. I now live here and return often. In fact I used to take my son, and now I take my grandsons."], ["Reviewed June 1, 2017", 5.0, "Good Hike", "Griffith Park is extremely beautiful! I knew that this was a must visit when I visited LA for the first time in January 2017. There is so much space for hiking and adventures. You can also see the Hollywood Sign in good view from the top!\nShow less"], ["Reviewed June 1, 2017", 5.0, "Great hiking with beautiful views!", "My family and I spent several hours here hiking and taking in the beautiful views. We saw lots of lizards and several humming birds!"], ["Reviewed May 30, 2017", 3.0, "Beautiful park, but scarce parking", "We went with the aim of getting out at Observatory but it was such a busy day that there was no parking so we just drove around and enjoyed the scenery. Didn't get a chance to go back unfortunately. The views are lovely though"], ["Reviewed May 27, 2017", 4.0, "Interesting", "Intersting place in Los Angeles, picnic areas, hiking trails, Greek theatre, Obsrvatory to see. Great place to enjoy your day."], ["Reviewed May 25, 2017", 5.0, "Best view", "If you want to have a nice view of L.A at night it's the best place! Always beautiful.. I really love this place!"], ["Reviewed May 24, 2017", 2.0, "Nightmare Park", "I wanted to see the Hollywood sign and read that this would be a good place to go to see it - we headed there after dinner on May 13th - what a nightmare - the traffic was HORRIBLE and the people directing traffic seemed to have no control or idea what they were doing . . . there was a concert at the Greek that evening - so I figured that could be why traffic was backed up - took us over an hr. to get to the top and by then it was dark so you could not even see the Hollywood sign . . . when we asked where to park - we were told it was like this EVERY night because people come there to see the lights of LA - not worth it to me\nShow less"], ["Reviewed May 24, 2017", 5.0, "Great surprise to find Pony Rides", "Taking a drive through Griffith Park with grandkids and found \"Pony Rides\"!! What a treat!! We were there during the week and no lines. Grandkids 3 & 5 had a blast. Both were first rides on a pony! For $5 you get a choice of pace and two trips around the circle ring!! Buy extra tickets because once on your kids will want to go again!!! Plenty of places to get good photos of their happy faces!!!!\nShow less"], ["Reviewed May 24, 2017", 4.0, "Arrived her at night to see the lights", "Arrived her at night to see the lights over the City and we were not disappointed took many photos to remember it by"], ["Reviewed May 22, 2017", 3.0, "Hollywoos sign, Observatory is beautiful.", "We were taken here by our driver on our LA Tour for a phot opportunity - it is a good spot to take pictures of the Hollywood sign. We went into the observatory and spent more time than we ever anticipated. You could easily spend half a day here. You do not have to be into astrology at all, it's an interesting place.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Griffith Park", "Love Griffith Park - The Views are awesome and the horseback riding is so much fun. They also have a train for the little ones, great place to spend the day"], ["Reviewed May 19, 2017", 5.0, "Better than expected", "This park is huge! Definitely walk to the Old LA Zoo! Worth the walk. Fun for the whole family climbing and exploring!"], ["Reviewed May 16, 2017", 4.0, "Great hike", "We had a great hike up from adjacent the Greek Theatre to high up in Griffith Park. The hike was challenging, but the views over LA and the Valley were fantastic. There is plenty of parking and restrooms at the bottom. A great walk."], ["Reviewed May 15, 2017", 4.0, "Beautiful hike to a sweet view", "I hiked for about 10km up and down to the Hollywood sign. Well i didn't actually get all the way to the sign, i decided the beautiful view and the great nature around me was just worth more than 9 giant white letters."], ["Reviewed May 13, 2017", 2.0, "You have to be in good health", "The trails are steep and long. These trails are for hikers. They are dirt trails over hills. At the start of the trail they have nice bathrooms. No food or drinks near by you have to go back toward the residential neighborhood. Not very much parking and in some places you have to pay the meter for 4 hrs.\nShow less"], ["Reviewed May 12, 2017", 5.0, "Respite from Elvis, Marilyn and Chewbacca", "While in Hollywood on business, took a side trip to Griffith park. Hiked the path from near the Greek Theater to the top of Mt. Hollywood and then down to the observatory.\nThis was a great and welcome break from the tinsel and crazy of Hollywood blvd.\nThe guide told us about the history of the park and the Griffith family and pointed out distant items in the spectacular vistas.\nWatch for actors as you go. A gal in our group said that a jogger who passed us (twice) was the lead in one of her favorite TV shows. The guide had a long list of stars she has seen on the trails.\nShow less"], ["Reviewed May 11, 2017", 5.0, "I can see why James Dean came here!", "Now it use to be that this place was run down and stuck in some sort of 1950's educational time warp. But now it has had a huge influx of money and ideas. Which for once was not wasted.\n\nWe took some of our British Friends here and they had a wonderful time. That and the views were just stunning!\nShow less"], ["Reviewed May 6, 2017", 5.0, "Great View", "Amazing place to check out the Hollywood sign and a great LA view , and the observatory was such an interesting space experience . It would be a good option if you are into hiking also ."], ["Reviewed May 6, 2017", 4.0, "Great views, great observatory", "Fantastic views of LA and a very good building with much information about space. Definitely plan some time as it it took us an hour to get up the hill with traffic and find a parking spot."], ["Reviewed May 5, 2017", 2.0, "Dirty and littered", "What a perilous shame! This once was a lovely park but now -- littered and destroyed. Dangerous, as well. Stay away."], ["Reviewed May 4, 2017", 5.0, "Great for a hije", "Took an uber up to the Observatory and decided to hike back down. Around 30-40 minutes. Super cool just to see the nature and walk down!"], ["Reviewed May 3, 2017", 5.0, "Brilliant", "The best free place to visit in Los Angeles. The show was amazing around 7 dollars. The views are breathtaking, well worth a visit. Can be busy on the weekend but only to be expected."], ["Reviewed May 2, 2017", 5.0, "Very nicely done", "You should definitely check this out.\nIt is insightful. You learn alot about everything that has to do with the observatory. From the telescopes they use to the stars and the whole history between them.\nIt was only 7$ for a ticket for the planetarium show and best 7$ spend! The lady who told the story did it with such charm that you could listen to her for hours!\nNice views too!\n\nOnly minor negative point was the parking that felt a bit chaotic.\nShow less"], ["Reviewed May 2, 2017", 5.0, "Beautiful green space in LA", "Large park. Walking/running paths. Great views of surrounding sites which include the observatory, Hollywood sign, downtown LA skyline."], ["Reviewed April 30, 2017", 5.0, "Awesome view", "We hiked up the park. After sunset the view from the top was awesome.. Can see the entire city from up there.. There is a planeteriim up there.. We also got to see the moon and the jupiter through the telescope"], ["Reviewed April 29, 2017", 4.0, "An insight into astrology", "Great place for kids and adults. Amazing views of the city and huge telescopes open at 7pm for viewing. Easily reachable by the Griffith observatory route, but the wait at the top for buses took 45 mins due to the traffic. We got to see the sunset with the Hollywood sign as the backdrop. So bonus for us.\nShow less"], ["Reviewed April 27, 2017", 5.0, "A must!", "Amazing afternoon hike! Close to the city but all you see is nature. Trails can be steep in places but anyone in average shape can do it. It is so worth the effort for the views of the city & Hollywood sign. Great photo ops!"]]}}