{"Haight-Ashbury": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Haight-Ashbury", "url": "/Attraction_Review-g60713-d103856-Reviews-Haight_Ashbury-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/73/8d/4e/haight-ashbury.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1197"}, "address": {"@type": "PostalAddress", "streetAddress": "Haight Street between Masonic and Stanyan", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94117", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 4.0, "Worth Seeing", "If you visit San Francisco then Haight-Ashbury is worth a stroll. The sight of the summer of love, a lot of the 'inhabitants' I think don't realize that its no longer the 70's."], ["Reviewed 3 days ago", 5.0, "Love this street corner!", "Going here always brings back the memories of being at this intersection in 1967, and listening to the song, \"If your'e going to San Francisco (be sure to wear some flowers in your hair\" blasting from a nearby sound system. Now the area is trendy and cool, and tie die t-shirts are sold for $40 which I guess is progress. If you're visiting San Fran, I recommend making the trip to this cool area of the city.\nShow less"], ["Reviewed 1 week ago", 5.0, "GO!", "So...I left my heart in SF and specifically in Haight Ashbury! If you have a love for the sixties/seventies and all things hippie and vintage, you will love this area. However, if you really want to get the full experience, plan on spending a full day here! I ended up here close to sunset and had only about an hour to explore. Just practice common sense, like going in a group and being aware of your surroundings, like you would anywhere else you travel! However I do think it requires a certain personality to really enjoy and appreciate this area. You will know that’s you if you get here and feel at home! With the little time I had I knew I wanted to pick up a vintage piece to remember my time in SF. I stopped into Held Over which has so many unique and fun pieces, at reasonably good prices. This isn’t the kind of “thrifting” that you have to spend hours digging for something good, they’ve already done all the searching for you! Overall I really enjoyed the little time I had here. It wasn’t long enough but it was better than nothing at all!\nShow less"], ["Reviewed 1 week ago", 4.0, "Hippy haven", "The older I get the less tolerance I seem to have for H.A. It's a great place and I do recommend it if you've never been, but I've been there so much over the years that I do't bother going anymore. The last time I was there, I found a BIG bud of marijuana on the curb. I gave it to a musician playing banjo in the park and he started playing \"Oh Happy Day\"! That is a perfect example of the Haight!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great place for a couple of old hippies to stroll", "From the reviews I read they said there wasn't much going on down here anymore and that is was basically ho-hum. Well, we were only visiting the area for 3 days and we went there twice. There is a huge difference in going on Sat. afternoon versus Mon. night. On Sat. we jumped off a Big Red Bus, which stops all over the city and picks you up again about every hour - so we didn't have to worry about parking our rental car. Always an issue in San Fran, you see. The streets were crawling and all of the cafes were full.\n\nYou could easily imagine the flower children of the 60s here and the buildings probably have not changed much. It made me wish I could've been there \"back in the day\" of free love and flower power and all that stuff. But we did\nmeet a lot of friendly young locals in the many and varied shops ranging from vintage clothing, Indian trinkets and clothing, photo creation, head shops a plenty, and cafes and bars - some spilling onto the street. These young artists and entrepreneurs were all about \"now\" and a \"renaissance\" happening there. There were, of course, a smattering of pan handlers here and there. I noticed the same ones on Mon. night as I did on Sat.\n\nWent back on Mon. night to a place called Club Deluxe that claims to have music every night starting a 6:00. We saw an off the wall jazz trio perform here. You know the kind you can't figure out what song they're playing until you catch a bar about halfway through? If you're a wine drinker - I do not recommend doing so here. We did some\nshopping and had some fun here. We actually could park the car on the street on Monday night.\n\nMy hubby and I would recommend this area if you are into this sort of thing.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Which Haight-Ashbury?", "This is not the Haight-Ashbury of the 1960s, but it's still a fascinating place and you can sometimes capture that old spirit, as well as some new spirit.\n\nThere are plenty of places to shop in, plenty of restaurants to eat in, plenty of bars and cafes to take a break in, plenty of people watching to do, plenty of Tibetan stores, plenty of cool houses, plenty of art, there's an anarchist bookstore called Bound Together and some other bookstores, and it's near Golden Gate Park for all sorts of other cool activities.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Flashback to 1968", "We rode through here on the hop on hop off bus. Much to see in this historic district. Many murals, great old architecture and ambiance."], ["Reviewed January 24, 2018", 4.0, "An interesting part of town!!", "This is a walk in the history of Flower Power and in particular The Summer of Love in 1967. The area is very colourful and you could people watch all day. My kids were fascinated!! The wander around this area will be more significant if you do a bit of research first so as you don’t miss out on some of the landmarks such as Janis Joplin’s the Grateful Dead and Jimmie Hendrix houses, Delores park, views from the posher end at Buena Vista Park and a visit to Golden Gate Park. Have a wander up the streets to see some examples of beautiful Victorian rowhouses.\nThere are a few boutique shops and if you love old vinyl records there are a couple of good shops. My 20 ish year old kids visited a couple of venues in the area at night time which had great dj’s!! We had dinner at The Magnolia Gastropub which was excellent. There is some interesting graffiti that is always changing. The street gets grittier the further you walk and there are some sad sights such as homelessness. An interesting way to spend half a day and to get a feel for the different areas of SAN Francisco.\nShow less"], ["Reviewed January 22, 2018", 5.0, "My Kind Of Place", "I could spend a full week just at this area. So many things to do, look at, and be a part of. It's almost like a whole lost culture into it's self. I really was not prepared, but the next time I will be."], ["Reviewed January 21, 2018", 4.0, "Cool little blast from the past area", "My husband and I visited the Haight Ashbury strip while on a trip to SF. Growing up I was pretty into the hippie vibe, even though that was a bit before my time, my husband...not so much. BUT, we both really enjoyed visiting this area. There are plenty of cute shops to stop at. Most shops had more of a spiritual vibe, versus the tie dye, dead head, hippie feel. I was slightly disappointed with that. I had hoped to find my teenage daughter a cool faded tie dye hippie tapestry for her room, but to my surprise I couldn't find any! One shop (the most colorful store on the strip) had some hard core bright tie dye ones but they were severely overpriced. Like ridiculously overpriced. The rest of the shops had spiritual looking ones, rectangular/scarf like (meditation, budha-ish maybe?). I also expected to see more original dead head type jewelry (hemp & beads) but sadly only saw beaded looking jewelry that you can find everywhere these days. We did stumble into a t-shirt shop that was pretty awesome. You can find a Grateful Dead shirt in just about any color or design there, plus tons of other artists/bands, and reasonably priced too. Staff wasn't the most friendly or helpful but eh... Overall we probably spent a couple hours there, mostly because we were looking for a tapestry. For anyone going to SF you should make a quick stop here even if just for the change of scenery.\nShow less"], ["Reviewed January 21, 2018", 5.0, "A slice of history", "This area is very much a slice of history. Walking around the shops where one place is cooler than the next was fun even for someone like me who hates shopping. If you are old enough to know the story of the area you won’t be disappointed. If you don’t know the history, just stop and talk with some of the locals and they will fill you in.\n\nA must stop if you are in the area.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Vibrant cultural gem of SF", "The Haight has history; important history. This is where the Summer of Love happened in 1967, and the Haight has never gotten over it. Yes, it had bad/sad times in the early '70's, but it's now a place that honors and respects its history (tie-dye, murals, head shops) while keeping current (vegan burgers, John Fluevog shoes). Visiting the Haight is a great way to spend a few hours window shopping, grabbing a bite to eat and enjoying the past…right now.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Cool As You Think It Is!", "I really didn't expect Haight-Ashbury to be as big an area as it is! It goes on for miles so plan your day accordingly to see it all. Amoeba Records is a must stop, my Sons & I spent over an hour there & all bought something, it HUGE! Super cool vintage clothing stores beautifully arranged! Stopped in for a cold one at the Historic Magnolia Brewing Co and it was magical!\nShow less"], ["Reviewed January 17, 2018", 3.0, "Nice", "Nice place to visit if in the area. However, I wouldn’t go out of my way to come here for the hippy vibes."], ["Reviewed January 7, 2018", 5.0, "Family holiday", "This was one of the places i really wanted to see on our visit. We went through haight ashbury on our first tour but didnt stop so decided to go back on our hop on hop off bus day. Its like stepping back into the 60s all the shops and even the feel of the street really takes you back in time. Also gave us the opportunity to get photos of the famous street sign. A lovely hour just strolling along the street and glad we went back to explore.\nShow less"], ["Reviewed January 7, 2018", 3.0, "Neat to See the Intersection", "Pretty houses, lots of head shops. It wasn't my favorite spot in San Francisco, a little seedy for my liking, but it was neat to see the Grateful Dead House, the Hells Angels house across the street, and Janice Joplin's house. I'd recommend a tour of the area with Wild SF Walking Tours, it makes the stroll more meaningful and engaging.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Be a hippee for a while", "We enjoyed the stops at Haight-Ashbury. Really neat shops with vintage clothes & such. Interesting people to watch. Lots of colorful storefronts. Just fun overall."], ["Reviewed January 4, 2018", 4.0, "Fun place", "A fun place to people watch, lots of unique and interesting shops and places to eat. Parking in tough to find however. Also be prepared to walk through a few clouds of marijuana."], ["Reviewed December 8, 2017", 5.0, "Vibes were cool man.", "We went here looking for a guitar store but stayed for the sheer awesomeness of the street. It seems like each of the stores is trying to out cool each other. I have never seen more effort put into the look of the outside of a head shop or clothing boutique. Fun stores and fun people. A visual treat.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Hippie culture", "This area is based upon the area around the intersection of Haight and Ashbury Streets.\n\nThis is the birthplace in the 1960s of the hippie movement.\n\nThe area has lots of very colourfull Victorian styled homes.\n\nAt Upper Haight Street you will find clothing boutiques, record shops, bookstores, bars and restaurants.\n\nOne should drop into this area which attracts a very diverse audience.\nShow less"], ["Reviewed November 24, 2017", 4.0, "Still Got Some Hippie Vibe", "I'm sure a lot of it is more than a little contrived but there is still enough of the hippie vibe to interest visitors. Aside from that it is a buzzy neighbourhood with interesting shops and streets to explore. A little research is worth it to find some of the sights from the late '60s that are still there - houses once occupied by Janis Joplin, Charles Manson and the Grateful Dead among others. Not hard to get to or from, a number of busses run down Haight Street.\nShow less"], ["Reviewed November 21, 2017", 4.0, "A lot of fun!!", "Haight-Ashbury is a fun way to spend a day! Lots of great sights, interesting shops, a relaxing and energetic feel to the neighborhood. Glad we spent a couple hours exploring!!!"], ["Reviewed November 15, 2017", 5.0, "great experience", "must stop at SF, 50th anniversary to 67 is celebrated, Amoeba Records is a great store for music lovers, great vibe, beautiful shops, beautiful people, took the public transportation to get there, very easy, started our golden gate park walking tour there."], ["Reviewed November 15, 2017", 5.0, "Hippy Turnover", "Hippies are gone, except for those I saw looking after their grandchildren!\nThe look has remained and the fringe replacement people are ubiquitous in this area - Fine during the daytime but not so at night! I'm not so sure it has been a great swap.\n1983\nShow less"], ["Reviewed November 2, 2017", 4.0, "Transform yourself back to the 60's", "There are a couple of thing you absolutely have to do when you are in San Francisco, going to the Haight Ashbury neighborhood is one of them. Quirky, eclectic, hip, strange, and these are just a few of the words to describe it. Small local shops and cafes line the streets. The buildings are colorful and the people even more so. Definitely worth spending an afternoon.\nShow less"], ["Reviewed November 1, 2017", 4.0, "Flower power remembered", "being an old hippie and Dead Head this was a must stop...walked to 710 Ashbury which was the house the Grateful Dead lived in during the sixties...the rest was just ok..but had to go make love not war"], ["Reviewed October 23, 2017", 3.0, "Interesting and fun", "Not quite what I was expecting or hoping as all the hype made it out to be. Quite dinghy. Colourful."], ["Reviewed October 23, 2017", 5.0, "Looking for the old Haight-Ashbury?", "If your looking for the old 60's Haight-Ashbury, you might not find it here. I guess it's still there under the surface though. Ben and Jerry's is still there. You can still buy love beads in the shops. You can still take your picture under the Haight and Ashbury street sigh, though it will be a selfie. Lots of shops and interesting people but, this is not the 60's era Haight-Ashbury. Still worth a visit though.\nShow less"], ["Reviewed October 21, 2017", 4.0, "Fun to visit", "We rode public transit, cruised the strip, had some Hippy Thai, walked to Golden Gate park and called it a day. A nice way to spend a beautiful fall day."], ["Reviewed October 16, 2017", 5.0, "A must do", "We had been here once before but enjoyed showing the area to my brother-in-law and sister-in-law. There I.S a great vibe and it I.S amazing how many “hippies” are still her. There is also a never ending smell of marijuana!!! There are a great range of diverse shops, bars and oddities and given this is the 50th anniversary of the Summer of Love it was very apt to visit\nShow less"], ["Reviewed October 12, 2017", 4.0, "A walk through Haight Ashbury,San Francisco", "A very interesting locality in Upper Haight is the Haight Ashbury . The home to the 1960 Hippie culture in San Francisco , this vibrant place is dotted with old Spanish style apartments in rows , many eateries, fun clubs and gift shops. One can come across many hippies still on the road either taking drugs or relaxing aimlessly . Some of them occupy the nearby Panhandle park and almost stay there throughout the day and night. A place famous for launching many hippie artists and theater personalities , a walk through the locality is good fun.\nShow less"], ["Reviewed October 8, 2017", 3.0, "Interesting Wonder", "We went done here on it's reputation, took ages to park but once we did it was an interesting wonder. Plenty of gift shops, which my wife took advantage of! Glad we experienced it, but do feel it's living on it's stories. 7/10"], ["Reviewed October 7, 2017", 5.0, "Fun vibe and great for vintage clothes shopping.", "Whether you will like or dislike Haight Ashbury really depends on your personal taste. I love the retro vibe, and when we went on a Saturday afternoon it was active and busy. I don't know what it's like early in the day or at night. From other reviews it sounded anywhere from boring to seedy, but I didn't find it to be either one of those things. There are lots of cool, quirky shops. Even if you don't want to go in, just check out the buildings. Very fun! There are also coffee shops, bars, and my favorite part: the vintage clothing stores. If you are into that (especially the 60s and 70s hippie look) you will love this area! If you have really young kids, I'm guessing it wouldn't be that fun. I didn't see much that would appeal to them. Mine are tweens and they are old enough to put up with me for short time periods. I could have spent hours browsing the shops, but I had to limit myself since I was with the hubby and kids and they don't really \"dig that scene\".\nShow less"], ["Reviewed October 5, 2017", 4.0, "The 1960's live on!", "I specifically went here to photograph the street sign and see where the 1960's revolution got its start. The place still has a Bohemian vibe that sets it apart from the rest of San Francisco. It was unfortunate that we were there at the end of a long day as I would have liked to had more time to explore and interact with the locals.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Like being in a film!", "I always wanted to visit San Francisco and especially Haight-Ashbury because of it's musical history and it didn't disappoint! Wonderful vintage clothes and jewellery shops, fantastically cool cafes, even cooler bars and of course Golden Gate Park at the end of the road!"], ["Reviewed September 30, 2017", 5.0, "Haight-Ashbury festival", "Super cool festival and fun vibe on the street. Expect clouds of weed smacking you in the face but there's great music and cool stalls and bars for drinks. Would love to go again!"], ["Reviewed September 28, 2017", 3.0, "Didn't quite get the hype", "Haight-Ashbury is super famous and more than one person said I should come here, so I was a little disappointed when I saw that there is really not that much going on and not a lot to see or do. That said, I did arrive in the morning well before 11a.m when everything was shut so maybe H-A really comes alive later in the day when the hippies, alternative characters and eccentrics come out of the woodwork and the shops pop open. I would say it is worth a visit, but it is not going to take up a huge amount of your time unless you are into hippie clothes, psychedelia, 70's inspired streets (you'd swear nothing has changed here since then) and bright pastel coloured buildings (these are actually really cool). The upside is Golden Gate Park is right nearby so you could come here first, have a poke around, and then check out the Park which is huge is worth more of your time in my opinion. If I was to come back to Haight-Ashbury, I would come in the late afternoon/evening as it may be a 5 star experience at that time of the day when the please has woken up. 11am/morning is pretty dull.\nShow less"], ["Reviewed September 27, 2017", 1.0, "If homeless vagrants and drug addicts are your thing - then this is your place", "What a waste of time to visit this area. Read the other one star reviews. Creepy homeless hippy types. Drug trash in the tree boxes. Like someone else said, no shops you can't find at other cheesy tourist locations. Urine smell in a lot of places.\n\nIf you can convince yourself that this was some historically significant place then it might help you get past all that. The truth is it wasn't really that significant and isn't today.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Great experience", "Such a nice street. You must see it and don't miss it! Lot's of nice stuff and shops to see. Really great place. At the end of the street, you'll get to the Golden Gate park."], ["Reviewed September 26, 2017", 5.0, "Don't miss it by dismissing it. It's part of The SF experience.", "Haight-Ashbury. Think about the image that the words create in your mind and you won't be far wrong. A tour guide once told us that most of the districts of San Francisco have changed over time to become what they are now, except Haight-Ashbury which is time-warped. Guess you can't visit SF without a 'pilgrimage' here. Hippie shops, psychedelia, smoke shops, Grateful Dead and Santana t-shirts, yes it's from another age, but it is one of the things you think of when you think San Francisco. Don't miss it by dismissing it.\nShow less"], ["Reviewed September 24, 2017", 4.0, "OLD IS GOLD", "This area remains same for a long period of time. You will find some shops still serve in the old fashion. They are cool open late and close early. If you a fan of things in late 50 s and 60 s worth a visit. I f you have some time better to see the beautiful color painted houses. Some of them are familiar because they were shown in movies and dramas. Its hill area so think twice to walk around.\nShow less"], ["Reviewed September 23, 2017", 5.0, "cool strip", "went down and chilled exploring some of the coolest shops in SF in my opinion, was in the lead up to Burning Man and punters from across the world were busy buying costumes, get up and you could smell their excitement. was one of our highlights of this city\nShow less"], ["Reviewed September 22, 2017", 3.0, "Wasn't too impressed with the area", "During my recent trip to SF, my husband and I went to check out the area. He was there 10 years ago and wanted to re-visit the area (it was my first time). We took a bus from Market/Powell and took us about 15-20mins to get there. We arrived a little before 11am so many of the shops were not opened yet but my first impression of the area: bit run down, dirty and weathered. My husband commented that it's seen better days. We had brunch in the area and checked out some of the stores. I guess if you are a big 60s/70s music fan, then go and check it out but otherwise, maybe it's not worth your time.\nShow less"], ["Reviewed September 20, 2017", 1.0, "Wished I liked this area more", "This was one of my must sees in San Francisco and unfortunately was a huge let down. I love the 60s and 70s, the music, fashion and culture and really wish I would have been around to visit this area then. It's mainly a bunch of smoke shops selling pipes and bongs with a couple of cool tshirt shops and a couple music stores. We explored the area and saw the grateful dead house and Janis joplins house. Decided to skip Beuna Vista park due to the sheer amount of homeless sleeping in it. I'd say if you must see it, drive through it instead.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Coolest street in SF", "We spent two nights at Haight street and it was probably the best part of our SF stay. The GOlden gate park and also the GOlden gate bridge are nearby and street also offers wide range of cool shops and cafes. Definetely go there."], ["Reviewed September 18, 2017", 3.0, "We drove by", "My husband and I were on a fast pace trip, we drove out from Michigan on our way to visit friends in Vegas. We took the long way round, so we crammed as much of the city as we could in 48 hours. Amazing what you can do on 48 hours when properly motivated. So I said all of that to say this, it's definitely worth your time if all you have time for is a drive by photo of the street sign. You're getting a twofold experience the hippie revolution and the Thrill of driving the streets of San Francisco.\nShow less"], ["Reviewed September 15, 2017", 4.0, "A place in history", "This area will be forever associated with Flower Power and the hippie era and there are still some of that era around, dressed to fit. While at times the area can be a but run down, other parts are fully spruced up and the shops are interesting as well. Above all, however, it is the associations of the 1960s which linger and for those of us prone to a bit of nostalgia, this is a great place to be reminded and to in a sense, relive what was before. History has made its mark!\nShow less"], ["Reviewed September 15, 2017", 2.0, "Overrated", "I stopped here on my recent trip to San Francisco and I must say I didn't get what everyone was excited about. I took a cab here from Union Square which cost me $15 just to be dropped off in front of tie dye store where 3 men were actively smoking meth. Wow!!! Not worth being in the that environment. Fortunately as I was exiting the tie dye store the police were on scene. Driving by is better no need to spend time here.\nShow less"], ["Reviewed September 15, 2017", 3.0, "We should have went at night.", "We were here in the afternoon and heard later that it would have been much better at night. Bars were playing 70's and 60's music and the place had a great hippy atmosphere."], ["Reviewed September 13, 2017", 5.0, "60's", "You or your parents are 60s kids or not this areas architecture is historic! Put a flower in your hair and walk thru the streets of Haight / Ashbury - The Victorians are beautiful and some are perfectly well kept…"], ["Reviewed September 6, 2017", 4.0, "interesting", "This is an interesting place to drive around and see the different styles of architecture and brightly colored houses."], ["Reviewed September 4, 2017", 5.0, "Good morning starshine", "I got a big kick out of visiting Taught Ashbury. I went to college in the 60s and walking on the street was like going back in time. There were hippies and pot. Funny to see kids dressed like hippies today. Some fun stores with period clothing to browse. Bought a cute tee at a T-shirt store\nShow less"], ["Reviewed September 4, 2017", 4.0, "60's and 70's History", "The Haight can be a bit ragged at times, but there are enough interesting shops and vibes to warrant a short visit. This was the epicenter of San Francisco's Hippy Generation. The street runs right into Golden Gate Park on the West end (also worth a visit).\n\nAnnually there is a street fair in the summer. Remember, in the summer, it can be cold and foggy so check ahead and wear something appropriate.\n\nA number of stores carry period clothing ('20's through '50's) of very high quality.\n\nOne block south, near the GG Park, you will find a printer's shop which also houses perhaps 30 pinball machines! You can go in and spend your quarters!\nShow less"], ["Reviewed September 3, 2017", 5.0, "30th Anniversary Trip", "We loved Haight-Ashbury. We're in our 60's so it was music & experiences that made us remember things from our teen years. Seeing where Janis Joplin & Jimi Hendrix lived was amazing & knowing it was the 50th Anniversary of the Summer of Love made it more special! It was very cool! ✌\nShow less"], ["Reviewed September 1, 2017", 4.0, "Made Me Want to Tye-Dye Everything!", "We took a Big Bus Tour of the city and decided to explore Haight-Ashbury! It was so much fun... from the graffiti to the Hare Krishnas walking about. The shops were expensive, but affordable souvenirs could be found if you looked. The scent of marijuana was pervasive and gave a nice, mellow vibe to the area. I will definitely return with my daughter on a future visit.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Cool hip area", "Really cool hip area with a lot of second hand stores, vintage and other interesting stores. Good eating and places with good selection of craft beer for beer lovers. There is a lot of poor people on the street, but nothing too enoying."], ["Reviewed August 30, 2017", 4.0, "Quirky shopping district", "This is were you want to go to buy your halloween costume. There are many funky shops here, (kind of expensive, but it's San Francisco, nothing is really cheap). There were great steam punk style clothes at a few stores, a really cool 80's clothing shop (really a thrift store with actual clothes from the 80's separated into categories like \"80's prom dresses\"!) I bought some earrings at one of the shops. There is a hippie store with tons of crazy bright colored flare pants and boas and a store with everything tie dye, that store was called \"Love on Haight\", hahah! The buidlings are colorful and there is the famous one with the legs sticking out of the upper floor window. The Grateful Dead house is close by as well. The parking is difficult, we just drove around the neighborhood and found a spot a few blocks away and that's the best you can hope for. Haight-Ashbury is a little out of the way from the touristy spots so it's little off the beated path. I wouldn't stop here if you were short on time, unless you are feeling nostalgic for 70's/80's attire.\nShow less"], ["Reviewed August 27, 2017", 4.0, "Interesting", "This is an interesting neighborhood. The tie die store was particularly interesting. There are many shops here as well."], ["Reviewed August 24, 2017", 3.0, "Over rated", "Visited here as my mother in law grew up here in the 60s and we've heard loads of stories. It seems like an obvious tourist trap that is really selling the flower power vibe for extortionate prices. Busy with a few quirky shops however there were many homeless people and obvious drug, alcohol and mental health problems. Very underwhelming.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Pretty, quirky neighborhood", "As most of San Fran, the area is hilly. Centred on Buena Vista Park. Some very nice homes here, and I just loved the Victorian era achitecture"], ["Reviewed August 19, 2017", 5.0, "Haight-Ashbury", "We pass y haight and Ashbury on our city tour. An informative and Educational tour. We also drove by as we rented a car."], ["Reviewed August 17, 2017", 3.0, "Historically it is more interesting than going there", "i missed the summer of love, not sure if it was 1969 or 70 i walked there and it was burnt out, guys in stairwells saying speed acid,, what ever they were selling and now, it is mostly crowded and not that great. I did have good Bloody Mary's at a bar there, i have bought a koolaceous bolo string lizard tie at Ardvark's on Ark,, i like the warm spinach salad and Sangria at Cha Cha Cha's\nShow less"], ["Reviewed August 17, 2017", 5.0, "50 years since the summer of love..", "Having wanted to see the original hippie paradise for years it was great to actually get there. still a lot of hippie groove around."], ["Reviewed August 15, 2017", 4.0, "Truly a blast from the past.....", "This is now 50 years after the \"Summer of Love\". The Haight-Ashbury are retains the feel and look from the late 60s less the \"Hippie\" crowd. Interesting blend of historical Victorian houses along Haight St, local restaurants, various types of local shops. You want something from the 60s, you will find it here. Always an interesting walk to imagine how it was during the Summer of Love.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Loved it!", "I'd read several journalistic reviews of SF which suggested giving H-A a miss. However, it's part of the Big Bus tour route and took our fancy, so we got of for a look. It's terrific! Lots of quirky shops, with cheaper souvenirs and t-shirts than at Fisherman's Wharf. Great architecture and the spirit of the 60s lingers on. Do it!\nShow less"], ["Reviewed August 12, 2017", 4.0, "Absolute fun !", "Great place to stroll, shop, eat and try to imagine what it was like back in the 60's \"Summer of Love\". Fun shops, interesting old buildings and interesting people make this a fun place to hang out for several hours or shoot pictures. Combine this with a walk over to nearby Golden Gate Park with it's museums and you have a pretty full afternoon !\nShow less"], ["Reviewed August 5, 2017", 5.0, "Haight-Ashbury was a lot of Fun to Visit", "Haight-Ashbury still has a little of the 60s feel that I was hoping for. They have fun shops with a hippie feel. We purchased a few tie dye shirts and a few others things. We tried the Cha Cha Cha restaurant and it was great. At the end of Haight Street, is Golden Gate Park, so we visitied both on the same day.\nShow less"], ["Reviewed July 30, 2017", 4.0, "Interesting Scene. Not for Families", "Haight-Ashbury is where the counter culture hippie generation was born 40 years ago. For that reason, it's worth a visit while in San Francisco.\n\nThe streets are lined with colorful clothes stores, head shops and coffee houses just as you always imagined. There are also artists and street performers putting on a show. It's a lot of fun for adults!\n\nHowever, there are a lot of homeless people, stoned people and apparently mentally unbalanced people there too. If that seems unnerving to you, You should avoid Haight-Ashbury. And I strongly discourage bringing children to the area. It's not for them!\n\nOtherwise, enjoy!\nShow less"], ["Reviewed July 26, 2017", 4.0, "had to go", "Not as had expected, some quaint shops, but a little dirtier than I thought it would be. We knew we had to visit though because for my husband and I it brought back memories of our younger years. It is a very colorful area...we did make sure that we got a photo of the Haight Asbury street sign.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Great shops!", "Love this area and we stumbled upon it on the way to the park, so glad we did as it was way better and on the way back we spent more time here going into some crazy cool shops. loads of cafes it really is a feast for the eyes and sense and a great piece of history and culture for the city.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Gotta see it once", "Lots of fun, trendy and interesting shops. Make sure to get a pic of the corner Haight/Asbury street sign"], ["Reviewed July 22, 2017", 5.0, "This is more like it", "Away from the tackiness of pier 39 this is more like the real San Francisco. What a great place to visit literally is full of colour and colourful people. Get yourselves up there"], ["Reviewed July 20, 2017", 5.0, "Fun and nice neighbourhood", "Nice (hippie) place. Many fun and interesting shops makes it a nice afternoon or evening walk. Recommended"], ["Reviewed July 19, 2017", 4.0, "I wished we'd had more time!!", "We only passed through this area of the city on our big red bus tour and I sorely wished wed had time to explore the area properly as it looks really cool and interesting. Unique pained buildings, fun looking shops and amazing restaurants and cafe's. I think it would be perfectly suited to a young couple wanted to have a relaxing time in the city and next time we visit we will be looking to stay in this area so we can properly explore it\nShow less"], ["Reviewed July 13, 2017", 5.0, "Of course!", "Growing up in the sixties and seventies, we could not pass up hopping off of the tour bus at Haight-Ashbury. Yes, there are still hippies sitting on the sidewalk and I'm pretty sure some of them never moved since the sixties. Such a cool little area to just walk around, browse and peek into weird little shops. The smell of dope is evereywhere.... Not that there's anything wrong with that. You can Google a little history about your rock stars and find places that they hung out or lived . We are definitely coming back just to take a walk and gawk If not anything else.\nShow less"], ["Reviewed July 11, 2017", 4.0, "A fly by night", "Drove in to check out the Janis Joplin house at dusk. Went to a bar to use the toilet but chased out as i left my I D in the car. What is that about? I am a bit unsure. Great bookstore and had delicious Ben & Jerrys. Some shops have closed but the area looks cleaner than I remember\nShow less"], ["Reviewed July 11, 2017", 5.0, "Very Cool", "We made a stop here to grab some coffee and a quick snack on our way out of town. I wish that we could have spent more time down here. The streets were full of art and locals. I wish that we could have had some more time to spend here.\nShow less"], ["Reviewed July 9, 2017", 4.0, "A nice street to visit", "It's a nice street to visit with plenty of quaint shops. Plenty of shopping to do but it can get quite expensive with the more established shops. Plenty to eat as well and a recommendation would be to eat at the Cuban restaurant. Its always crowded and so the wait time is a fair bit but worth the wait.\nShow less"], ["Reviewed July 7, 2017", 4.0, "definitely worth at least a drive-by", "This neighborhood has always been of interest to me, so naturally I had to visit while in San Francisco. The buildings on Haight Street still have many \"hippie\" shops. They are very interesting to look at, and are definitely remnants of the Summer of Love. If you have time to stop by, I would recommend walking through the shops. A lot are unique to the area, and definitely shouldn't be missed.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Very interesting place to see", "Don't miss this hippie area to see. We took lots of pictures and i purchased a scarf. The staff were lovely. We also ate in this area for lunch."], ["Reviewed July 2, 2017", 4.0, "Transported to another time", "I thoroughly enjoyed my time discovering and browsing the streets here. The shops were unique and diverse. This girl of the 70's felt as though she was reliving some of her childhood. I"], ["Reviewed June 29, 2017", 4.0, "Summer of Love", "San Francisco is celebrating the Summer of Love, 50 years ago.... this area was a great place to visit to get a vibe of time and see how close it was to the Golden Gate Park. My husband's parents met 50 years ago during the Summer of Love so it was great nostalgia for him to see the places he lived and to understand it more as adult. We really enjoyed going into some of the record stores, I didn't realize how much I missed just looking a record covers in a record store... that was fun. There are some neat little bars and shops up and down the street, you don't need a lot of time here to enjoy it.\nShow less"], ["Reviewed June 27, 2017", 4.0, "Not too many hippies around anymore...", "Another must-see spot in San Francisco... the Haight-Ashbury area. Lots of colorful shops, psychadelic murals, tributes to Hendrix, Dylan, Joplin, Baez, et al, the occasional mid-twenties \"hippie\", or rarer an actual holdout from the 60s keeping his store. It was neat to walk the area filled with so much history. It was so clean and devoid of crowds, it was difficult to imagine what it was actually like 45 years ago. Colorful nonetheless.\nShow less"], ["Reviewed June 25, 2017", 4.0, "Wonderful part of the city", "What a cool, hip, historic and vibrant part of San Francisco. Lots of alternative shops, particularly relating to clothing and music (not surprisingly).\n\nThe street is pretty cheap to get to via über/taxi or it also seems to be on the routes for the sight seeing double decker busses.\n\nLots of beautiful Victorians around the area too.\n\nWorth a visit if you like music history, tie dyed stuff, vibrant inner city culture and colour.\nShow less"], ["Reviewed June 18, 2017", 4.0, "It Was Fifty Years Ago Today", "I'm a big Beatles fan so, on visiting San Francisco, really had to check out Haight-Ashbury on Sgt Pepper's 50th birthday, if only to have my picture taken under the street intersection sign. It was fun to walk along glancing in all the varied (some tacky) shop windows and look out for the odd weird character passing by. Music was all around from either the shops or street musicians. A must do when visiting is to go to Amoeba music which is near the end of Haight Street near Golden Gate Park. It is housed in an old bowling alley so is quite a large store with an enormous stock of music, merchandise and movies to get lost in. It was wonderful to see so many customers in the store and queues at the tills - just like the old days of record buying.\nNot essential but worth a couple of hours of your time!\nShow less"], ["Reviewed June 12, 2017", 4.0, "Back in Time....", "A must do in San Fran. See how 60s and 70s were. Fun shops and restaurants. Take time on this back in time walk."], ["Reviewed June 12, 2017", 5.0, "Psychedelic fun", "We wandered across town late Sunday afternoon and all the street was pedestrianised and full of music and food smells. There were many interesting shops and stores but nothing more interesting than the colourful people. It was busy but not threatening. There were people offering free hugs (we didn't take them up on this occasion) and a man wandering around completely naked save for a top hat on his head and a well placed 'sock' to maintain some modesty. One guy was walking on stilts. There were stages with music on at each end of the street. Good vibrations! Well worth a visit.\nShow less"], ["Reviewed June 11, 2017", 4.0, "Flashback time machine to the 60's and 70's", "Do the walk from the west end of Haight Street, many fun and interesting shops along the way to bring back memories from many years ago. Some characters you'll see probably never left after their first visit in the 60's. Remember don't leave valuables in your car anywhere in SFO.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Go wandering", "Fun shops and restaurants, always crowded on the weekend though. A classic SF experience, worth walking through when you are in town."], ["Reviewed June 1, 2017", 5.0, "A must for anyone who remembers the sixties!", "The aroma on the street took me right back to my youth! We wandered around aimlessly for a couple of hours marvelling at the buildings, shop windows and generally enjoying the ambience. A must visit place for any oldie"], ["Reviewed May 31, 2017", 3.0, "Still Special", "Another essential place to visit ,many beautiful buildings and a special place with its cool record shops and characters who help maintain this area as still a really cool place to spend a few hours"], ["Reviewed May 30, 2017", 5.0, "Come \"hang out\" with the Hippies!", "The Haight-Ashbury is known for the peace, and free love \"Hippie\" movement of the 1960's. This still lives on in this district of San Francisco to this very day. Yes, it can seem a bit cliche and \"touristy\" however, it is worth coming to this area to experience the vibe. Unique shops, colorful people, painted houses, and lots of \"one of a kind\" experiences await you as you stroll past incense and cannabis fumed air, sitar/guitar players and people making art. Groovy!\nShow less"], ["Reviewed May 29, 2017", 4.0, "Cool to see", "My mom is disabled. So walking the district wasn't an option. We hopped in an uber and drove around the neighborhood. Still got a good sense for it from a car window. I would come back on a future visit."], ["Reviewed May 29, 2017", 3.0, "Could be interesting for tourists but certainly not the charm that it had in the '60's", "A couple of interesting shops, highly gentrified, a few stores owned by individual owners and some food. Amoeba music shop about the biggest attraction on Haight St. Good for a stroll would take an hour at the most."], ["Reviewed May 29, 2017", 3.0, "A piece of SF history.", "A visit to Haight-Ashbury is a must for anyone versed in San Francisco's impact on '60s culture and the world music scene. Today, it's a mix of cafes, head shops, vintage clothing stores, and sadly, the occasional big brand store ('Burton\" for example). Amoeba Music is one of the last of the great record stores and a must for any music lover. The streets are filled with both tourists and not a small amount of folks who have sadly seen better days. Lots of homeless kids, drunks and unfortunate souls. And more than a few aging hippies as well. But the eye candy (both living and non-living) is priceless.\nShow less"], ["Reviewed May 24, 2017", 3.0, "Enter the Summer of Love time warp", "To be fair, some people will love this place and others will not like it that much...thus the average rating. If you can, take the walking tour as it makes it more fun to know the history. It is easy to imagine that some of the stores have not changed one bit since the late 1960's....the place is full of used and vintage clothing stores, head shops, record stores, coffee shops, specialty stores and relatively inexpensive restaurants. I enjoy the food and beer at Magnolia's, where Magnolia was a madam in years long gone. Former hippies and hippy-wannabes hang out on Haight Street.\nShow less"], ["Reviewed May 18, 2017", 5.0, "\"Groovy\"!", "Ok, we had no idea what to expect from \"the Haight\". Was it still a \"Hippie Mecca\", was it now just an upscale neighborhood with old memories or was it a tourist trap? While there are certainly elements of each of these in the Haight currently, it is definitely worth a visit. You don 't have to be a Dead Head or even a flower child to feel the very cool \"vibe\" of the neighborhood. Lots of interesting shops and eateries. Parking can be found. Great for people watching. Buena Vista park is just a couple of blocks away and is a very nice stroll. Tie Dye not required! Make the scene. Different and enjoyable.\nShow less"], ["Reviewed May 13, 2017", 4.0, "Go beyond Hippy central to see amazing houses.", "Fun just to wander the Summer of 69 area for the colour and flashbacks. To be honest, I didn't notice the homeless as much as others ( in San Francisco in general as well) But go beyond, towards the Buena Vista Park and you'll love the grandeur of the house fronts, far more varied and grand than the Painted Ladies.\nShow less"], ["Reviewed May 10, 2017", 5.0, "You've got to go here!!", "For those of you that love the quirky things in life this place is a must see! So many quirky little shops, including thrift shops, record stores, clothes shops, art shops, places to eat. This place has a real hippy, relaxed vibe! Be sure to take spending money when visiting this area!\nShow less"], ["Reviewed May 5, 2017", 5.0, "Back in time", "Walking on these streets it's natural to think about the people that live here in the past.\nHendrix, Joplin, also Charles Manson take a place here.\nIt was a long time ago, but it's yet possible to smell the same atmosphere.\nThis is the San Francisco wild side.\nMove it and remember the time.\nShow less"], ["Reviewed May 3, 2017", 2.0, "Grungy", "You can get a nice picture of the Haight-Ashbury street sign but other than that it is just a dirty gross part of the city. Lots of homeless people, probably hippys that went in the 60's and never left. I would not waste my time going if I was to visit San Francisco again.\nShow less"], ["Reviewed May 3, 2017", 4.0, "Hippy heaven", "A little over-hyped and predictable but it`s worth a stroll through to look at the incredible murals and funky shops, a lot are ridiculously overpriced but hey...this is San Francisco. The smell of hash is overpowering everywhere you go and there are a lot of homeless here too which is distressing to observe. We saw a man eat directly out of the bin!\nShow less"], ["Reviewed April 28, 2017", 2.0, "Birth of the hippies", "So this was where the hippie movement was born. From seeing the place, it seems that the movement never ended for some people.\n\nWe ended up nearly being stoned ourselves from the passive smoking we were doing from all the potheads hanging around - The place was stinking of it!\nShow less"], ["Reviewed April 24, 2017", 5.0, "Spectacular Architecture", "Some of the finest examples of Victorian architecture in SF can be found in the Haight, so wander off of Haight St. and enjoy. This is now an upscale neighborhood, very lively."], ["Reviewed April 22, 2017", 3.0, "Good Food. Bad for Homeless.", "This is an incredible area rich with History. We went through it while on a SF tour. The guide was really outstanding and knowledgeable about the area and past few decades as the area had continued to reinvent it's self over the times.\n\nThere are a lot of outstanding little places along her to eat, but unique single owner hole in the walls as well as a few chains here and there like Baskin Robbins. If you have ever went to L.A. and been to Venice Beach, this would be the S.F. version of that. However, with considerably more homeless to deal with.\n\nWhile most generally keep to themselves with the signs, I found this area to have some who were a bit more in your face. I am a bigger guy, so I am not really worried. But I think it is something that you want to keep in mind as a female. Or make sure you go down there during business hours where it is not so much of a concern.\n\nThat being said, this is a place I would recommend you check out all the same. A lot of unique little shops and eateries with awesome food and smells as you walk the blocks looking at the murals and famous places 60's musicians and alike lived.\nShow less"], ["Reviewed April 21, 2017", 4.0, "Where the 60's hippie movement was born...and still continues!", "Colorful, bright, intriguing. Home of the hippies. I haven't smelled that much weed since I was in college in the 70's. Had to smile at the tie dyed clothing, peace signs, etc., that marked that era. Brightly colored buildings, lots of crazy fun resale shops."], ["Reviewed April 18, 2017", 5.0, "Love the Haight!", "The Haight is a MUST if you are visiting SF. The food is fantastic all over the Haight. People watching is the best, colorful window displays (please tell Mr. Magoo hello for me), great weird and whacky shops, vintage clothes, Amoeba Records and so much more. Parking can be difficult to find but so worth it. I have visited this area since the 60's and will always go back.\nShow less"], ["Reviewed April 17, 2017", 4.0, "Yes, I am a hippie at heart", "I turned into a 4-year-old at a toy store while strolling through this area. If you don't know much about its rich history, do a basic Google search to read more about it. It's beautiful, it's fun, it's a throwback to the 60s, and it was once a popular location for performers like Jefferson Airplane and Janis Joplin.\n***Warning: I saw many people openly using marijuana. This doesn't bother me, but I know there are certainly some people out there who don't want their kids to see it.\nShow less"], ["Reviewed April 12, 2017", 3.0, "Nice stroll", "Not as \"groovy\" as we expected, but a nice stroll before the park. Lots of good reclaimed shops for vintage shopping."], ["Reviewed April 9, 2017", 4.0, "YOU SHOULD VISIT IT AT LEAST ONCE", "My wife and I have visited San Francisco several times over the years and while we have driven through the Haight - Ashbury area, we have never taken the time to stop and look around. Yes, there are a lot of homeless and people with 'altered' states however, there are many unique and interesting shops that have just about anything you can think of from the 1960's and 1970's. There are also several second hand shops that have vintage clothes and collectibles as well as other items of interest. While this is not someplace that I would necessarily come to every time I visit San Francisco, it is an interesting and unique way to spend a couple of hours while in town. One negative is that while there is open street parking, it can be difficult to find a place to park. You do need to be careful not to block a driveway to one of the old one-car garages or not to park in a red zone as the parking enforcement officers are out and ticiketing/towing vehicles, even on a Sunday. I would recommend anyone coming to San Francisco to do this sight at least once.\nShow less"], ["Reviewed April 5, 2017", 3.0, "Cool to visit but...", "It's an interesting historic area to visit and take a pic at on the corner with the sign to say you did it. There's some fun shops there, but other than that...pretty dirty, lots of homeless people in the area."], ["Reviewed April 3, 2017", 4.0, "Nostalgia!", "Had to stop here and get a photo at the Haight-Ashbury intersection and drive down the street of the old Dead house. It was nostalgiac for my husband and I. If you weren't into the Grateful Dead or the hippy scene, it probably isn't worth it, but we loved walking around.\nShow less"], ["Reviewed April 3, 2017", 4.0, "Great area to walk in!", "Our walk included the Haight Ashbury area. Many shops, cafes & restaurants. Very near to GG Park all within close walking proximity."], ["Reviewed April 2, 2017", 5.0, "My favorite neighborhood in San Francisco", "This is simply a must-see if you come to San Francisco. There are a lot of great restaurants in the area and a few shops worth checking out. Highly recommended."], ["Reviewed March 20, 2017", 2.0, "Hippie", "My husband and I thought we would go for a walk along Haight St cause we were told the shopping was good. Well, we couldn't have been more wrong. The shops sold out-dated clothes, more like opp shops and hippie type clothing. And the atomsphere is very dim and full of homeless people. Didn't enjoy my walk at all.\nShow less"], ["Reviewed March 18, 2017", 5.0, "A must!", "This place lived up to all my expectations. The colour, the vibrancy, the cliches, the street art and of course the people trying to sell you weed and lsd! Not a place for a night visit perhaps but wonderful on a sunny afternoon."], ["Reviewed March 16, 2017", 3.0, "What's all the fuss about!?!?", "Was very disappointed in Haight-Ashbury. The \"Painted Ladies\" were neat to see, so that was a good ten minutes. Then....\n\nWe wandered a bit and looked around the neighborhoods. Okay. Checked out a few shops. Eh. Finally wandered into a small restaurant and grabbed a beer. Again, nothing special. No vibe. No buzz.\n\nTake this off the list of things to do. There's plenty of other worthwhile stops.\nShow less"], ["Reviewed March 15, 2017", 2.0, "Not that great any more", "Went 11 years ago and I was keen to return. The area was not how I remembered with a noticeable gentrification but also a marked increase in people trying to sell you drugs. Also got harassed a bit when not giving to the homeless people in the area.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Probably not a kid thing...", "Things are a little more run down than they used to be. I suppose that happens with time. There is always something or someone to look at. Grab pizza by the slice and go for a walk to the park at the end of Haight (to the West). You can park on Fell off of Octavia from the 101 if you are coming from the East Bay. It only took me 400 years and 37,000 trips (rough estimate)...well and GPS to figure this out. There is some parking, but plan to walk to and from, that is the best part anyway.\nShow less"], ["Reviewed March 9, 2017", 5.0, "A Piece of History", "If you are a baby boomer, Haight Ashbury brings back memories of Hippies and Flower Power. Today it has some great some restaurants and coffee shops"], ["Reviewed March 8, 2017", 4.0, "Colourful & eclectic Hippy town (not quite)", "The heart of the hippie movement in the 60's & 70's - or so they say and a colourful stop on the tourist trail.\n\nThe place is bright, colourful and at times psychedelic with lots of interesting places to take money off visitors and locals alike. Obviously there are the usual tat shops with over priced T-shirts, while the vintage/retro clothing stores are horrendously expensive but great to browse through. We didn't bother with any of the smoke shops but the smells coming from were 'interesting'.\n\nI do love SF architecture, so different to my home town/country and you see some lovely decorated buildings here. There are a number of good eating places and vegetarians are generally very well catered for.\n\nUnfortunately an area originally noted for being anti establishment has become very commercialised and with a significant number of homeless folks.\n\nI would certainly suggest a visit if you're in town.\nShow less"], ["Reviewed March 1, 2017", 5.0, "A Must see when visiting SF", "Make sure to take time to see part of SF history, and the beauty of this neighborhood. So much has been done, over the years, to upgrade homes you won't see in any other part of the USA."], ["Reviewed February 27, 2017", 1.0, "Lower your expectations", "Looking beyond the overpriced vintage stores and overwhelming smell of urine, what was most disappointing was the feeling that I could have been in any-beach-town-USA with the smoke shops, cheesy t shirts, and the large pungent vagrant population.\nThe love is gone, in fact the feeling that permeated was one of desperation like 'this isn't fun anymore but it's too late to go home.'\n\nShow less"], ["Reviewed February 27, 2017", 5.0, "Beautiful history", "I took a city tour and it included Haight-Ashbury. I took some awesome photos of the graffiti/artwork on the buildings. The homes and businesses are cool to the nth degree."], ["Reviewed February 24, 2017", 4.0, "Nice jaunt for senior hippies", "Nice walk around and pricey shops.Enjoyed poking around arts and crafts shop with prices reasonable with large selection. More trendy than alternative."], ["Reviewed February 23, 2017", 2.0, "Somewhat seedy and uninteresting", "A few blocks of shops and restaurants. Would not go out of my way to visit. The 60s ended a long time ago, they don't live here anymore."], ["Reviewed February 15, 2017", 5.0, "Nice Walk around the Area", "Haight and Ashbury are the names of 2 of the streets in this area. It's amazing just to walk through Haight and see the vintage/hippie/old unique shops (and incredible music and bookshops), and to watch the true hippie-thing happening. We read in a book that this was a hippie area, but we never thought we would actually ser so many hippies on the streets! Some of them are really friendly and even tell you \"good morning\" and play cool songs on their guitars. You rarely see a bad crazy man screaming and threatening people, but that can maybe happen. It's amazing to see their clothes and way of living - takes you back to the Flower Power days. We followed a \"walk\" suggested by our Lonely Planet book and got to see some special houses, like Janis Joplins'.\n\nAfter going through Haight, go take a look at Hippie Hill, in the Eastern part of the Golden Gate Park. Try to spot the \"Janis Joplin Hair\" Tree.\n\nWe started in Buena Vista Park, where you get great views of San Fancisco, but you can do the other way around (from Golden Gate to Buena Vista).\nShow less"], ["Reviewed February 15, 2017", 5.0, "Pretty homes . . . typical San Francisco scenes", "Neat views and great place to sample the architecture San Fran is famous for. Crazy real estate prices !"], ["Reviewed February 15, 2017", 4.0, "Colorful", "Beautiful area to experience the culture. Unique and colorful. Full of shops and restaurants. Walk and enjoy"], ["Reviewed February 10, 2017", 3.0, "Fake Hippies.....", "This place obviously has incredible history. Some of the best musicians of all time even lived here and I respect that. With this being said, it's now just a street of young homeless kids that are pretend hippies. I have no reason to go back. They had your stereotypical overpriced head shop stuff up and down the street. There's some decent food in the area, but again I wouldn't go back.\nShow less"], ["Reviewed February 3, 2017", 5.0, "Awesome Neighborhood", "The Haight-Ashbury changed over the years, but it's still THE MOST eclectic and wonderful neighborhood in San Francisco. It's got everything, hippies, heroin addicts, LGBTQ, tourists, stoners, professionals, homeless, beautiful homes, pizza, burgers, tapas, bars, groceries, record stores, everything. Few places in the world are like the Haight.\n\nParking is a bear, so just find a public lot. Every Bay Area local MUST spend at least one day a month here. Every tourist must dedicate at least a half day to visit the Haight.\nShow less"], ["Reviewed February 3, 2017", 5.0, "Great area to explore!", "My husband and I had a wonderful time exploring this area! So many neat things to see and so much culture!"], ["Reviewed January 27, 2017", 4.0, "Great area to visit", "Lovely area to walk around and experience the culture. Vibrant, friendly and colourful. Cute shops and restaurants."], ["Reviewed January 25, 2017", 4.0, "Hippies and beautiful houses", "Most tourists visit only several blocks of Haight section of this legendary 60's hippy area, but there's more around.\nIn that part you're about to see old records and book stores, stores of 60's clothes fashion, many bars,....people on the street playing music, but also many homeless, junkies and drunks, which isn't a nice scene, specially if with kids (my kids - teens, didn't like it and wanted to leave asap). Anyway, I felt safe there, no one intruded us and there was a lot of police (also medics for assisting the overdosed). That part can be covered in about an hour.\nWhat most people don't see in this area are fab houses, just few blocks from there. These Victorian houses are more beautiful than the famous Painted Ladies, so take a walk around.\nShow less"], ["Reviewed January 21, 2017", 3.0, "Old hippy neighbourhood", "Drove by on our hoponhopoff bus tour. Saw Janis joplin's prior apartment and on the other side was Jimi hendrix's. Then stopped here to catch a bus. Lots of cafes and shops in this area. Flower power still very much alive here. Saw in September 2016.\nShow less"], ["Reviewed January 19, 2017", 5.0, "My favourite area", "So cool! You feel collar just being here. Retro. Bohemian. Chilled. Great bars and restaurants and the vintage shopping along here is awesome ! From cheap stuff to designer vintage stuff for everyone. Love love love it here"], ["Reviewed January 12, 2017", 5.0, "I was there in the \"DAY\"", "Oh yes as a very youngin' I did witness all the FLOWER CHILDREN durnig the HIPPIE revolution It was quite a memory!!! I still like going to the HAIGHT!! I's KOOL!"], ["Reviewed January 8, 2017", 4.0, "Flower Power is still alive in this street !", "This area has so much character . If you lived through the Flower Power years, you need to take a visit to this Haight Street ! Lots of interesting shops, ranging from vintage, ethnic and modern clothing, music and costumes. Even though you may not buy anything, just walk into these shops and take a look.\nShow less"], ["Reviewed January 8, 2017", 5.0, "Hippiedom, Gentrified!", "Wasn't sure what to expect when visiting the corner of Haight and Ashbury, the epicenter of hippie culture in the late 60's. What I found were some charming gift and general merchandise shops, a few edgy tattoo parlors, a lot of trendy eateries, and in general, a neighborhood in which I would like to spend more time exploring. I remember seeing the news reports as a kid about all the \"freaking out\" that was taking place here -- this appears to be a model for gentrification without losing some of the charm of what made the neighborhood famous in the first place.\nShow less"], ["Reviewed December 31, 2016", 5.0, "Channel the Inner Hippie", "If you don't have an Inner Hippie, just walk around and enjoy the wild side of things. Crazy colors, interesting assemblies, beautiful park, and well, hippies. I can't ad lib much more here!"], ["Reviewed December 31, 2016", 4.0, "A tourist destination must", "If you are wanting to see one of the best neighborhoods in San Fran, take a stroll here. The shopping is wonderful, and the restaurants are many:). People watching is also a pleasure. If you love the hippie or counter culture you should check this place out for sure.\nShow less"], ["Reviewed December 31, 2016", 4.0, "A special place in San Francisco's cultural history", "One of my favourites from past years but doesn't have the same allure - it was more of a trip down memory lane but I still love the feel of history and the wonderful buildings"], ["Reviewed December 30, 2016", 4.0, "Memories of the 60s", "My parents never let me come here in the 60s! I read a bit about the history and buildings before driving through, just to see what I'd missed. I did enjoy seeing the fishnet-clad legs protruding from the Piedmont shop near the intersection and found it amusing that Ben & Jerry's has an ice cream store right there. I'm glad I came, and my parents don't even have to know...\nShow less"], ["Reviewed December 29, 2016", 5.0, "The heart and soul of 1960's San Francisco hippie culture", "If you know, experienced, or have read about the 1960's and San Francisco, then Haight-Ashbury definitely has to be on your \"must do\" for any visit to Bay Area. A number of interesting shops in the area now, but you just can't beat the historical vibe.\nShow less"], ["Reviewed December 28, 2016", 3.0, "Tourists and drugs", "What is this neighborhood? Hipster stores, homeless people, junkies, drugs, a few good places to eat, and tourists. Moodidoo indeed."], ["Reviewed December 27, 2016", 5.0, "super", "I didn't want to go there but my girlfriend convinced me. It was great decision. Totally different part of the city. Nice architecture, very unique and original shops, lots of bars and cafes."], ["Reviewed December 21, 2016", 5.0, "Flower Power time!", "This street is very exciting for all of us who has seen films with hippies walking, running or dancing in the Haigth street! Or perhaps you were dancing there yourself!nn? The Ashbury aerea with its colorful houses is really a sight for your eyes. Do not miss it for the world, with the music from the film HAIR in your head you should dance through the aera perhaps with some flowers in your hair !?\nShow less"], ["Reviewed December 11, 2016", 3.0, "Just an intersection", "As a child of the 60's this was always and iconic address for me, however, as an older adult, it was just an intersection in a quirky part of town! Worth taking a picture of for posterity, but not much to do in the area."], ["Reviewed December 11, 2016", 4.0, "a hippy steps back in time", "i remeber the 1959 summer of love and this was the epicenter still has a good record shop down the road from here and the buildings and locals maintain the vibe though now toned down the f.b.i. didn't like the acid man."], ["Reviewed December 6, 2016", 3.0, "You can feel the hippiness!", "This was a place I wanted to come back and visit and take more notice of.\nI came across an old picture taken on the corner of Haight-Ashbury of the flower power days which was interesting to see. Along the street was lots of Bohemium type shops if you wanted to buy something quirky\nShow less"], ["Reviewed November 29, 2016", 3.0, "This is at most 30 minutes to 60 minutes of walking around", "This is a nice pocket of town to see some nice houses, sample some unusual stores and smell a lot of pot. I would not plan my whole day around this area. There are some good places to eat but I would spend my time in other parts of the city if I had only one day.\n\nBe warned that if you have small children the smell and air wafts with pot. I wouldn't bring small children here just for this reason.\nShow less"], ["Reviewed November 26, 2016", 4.0, "Pure nostalgia", "For those of us of a certain age, Haight-Ashbury is a must-see. There are still a few head shops and hippie-inspired places, but they're more of the same from one's memories. Nevertheless, I'm glad I got to see it. Probably won't go back, though."], ["Reviewed November 25, 2016", 5.0, "A blast from the past", "Hey man, this is a must see if you're a Boomer. Yes, it has changed from the Sixties, but the city and shopkeepers have done a nice job of recreating some of the vibe. Lots of weird and wacky stores, unusual eateries, and a t-shirt shop where you'll find the likes of the Beatles, Jefferson Airplane, and the Grateful Dead emblazoned on psychedelic tees. Groovy.\n\nOh, and there are still plenty of street people who may not be authentic hippies but sure dress like it.\n\nWorth a visit.\nShow less"], ["Reviewed November 24, 2016", 3.0, "Go only if you have the time", "It is definitely not a must go, but a quirky neighbourhood with a few shops. They say it was the birthplace of hippie movement in SF but we couldn't find much sign of that (unless you consider tie dye clothes and tibetan stores). I would only suggest a visit if you have time to spare.\nShow less"], ["Reviewed November 19, 2016", 5.0, "Must see for those who have a hippie soul", "I have always wanted to see the Haight Ashbury sign as the hippie culture started here! This is it folks! California has recreational marijuana now, that made the experience much better. Life is great on Haight Ashbury, definitely a must see if you are in the area. Tons of food to choose from, and lots of touristy shops.\nShow less"], ["Reviewed November 19, 2016", 2.0, "aged and dirty", "Very few remnants of the iconic history of the area. I was disappointed. Very few stores to harken back to the hippie days. Wasn't worth spending much time here. Stay on the bus and just ride through."], ["Reviewed November 16, 2016", 4.0, "Great shopping", "We visited Haight and Ashbury St as we heard it was a cool place to check out.\nWe arrived at 5:30pm. The shops are very different, they sell stuff that you wouldn't find in usual stores. They're pretty funky. Great if you're into vintage and specialty items.\nI think it may be nicer to visit during the day as you would have more time to look at the shops. There were a lot of homeless people asking for money when we were there. We felt a little uncomfortable as some of them were pushy.\nMust try the restaurant Parada 22, amazing food!\nShow less"], ["Reviewed November 14, 2016", 3.0, "Wow man! The Haight! Hippiedelic!", "OK, this place has lots of history, and back in the '60s it was the most iconic hangout for hippies in the country, to say nothing of the legendary amount of 420 smoking. Any musician of any \"noteworthiness\" could be found there at one time or another. It is still very colorful, and some of the old landmarks are still in business. But I have grown up. Go there, so you can say \"I've been there.\"\nShow less"], ["Reviewed November 13, 2016", 5.0, "Historic and cool place to go", "Lots of history here, area has incredible Victorian houses and cool shops and restaurants/bars, Its a must visit, learn about the start of the San Francisco counter culture homes of Grateful dead, Hells angels , Manson and Janis."], ["Reviewed November 13, 2016", 4.0, "Shopping and People Watching", "This is a great place to shop for \"normal\" things and oddities.I found everything from all kinds of stones to Bohemian clothing. The diversity of people here was also amazing to just sit by and watch. Well worth walking through if you like out of the ordinary.\nShow less"], ["Reviewed November 11, 2016", 5.0, "If you know the names The Doors, Greatful Dead, Janis Joplin, Charles Manson, Jim Jones - A MUST DO!!!", "This area has been built up to be touristy, but there is still enough history there, that was a highlight to the trip! But first do your history - we overheard in a unique store (can't remember the name) where the store attendant was giving history about the area, that Jim Jones and Charlie Manson would get high on LSD in the back of a bar, while some of the mega stars - before they were icons, were singing in the front. Find a historian to take you on our tour or do your own digging into the local haunts. Both Charlie Manson and Greatful Dead resided just off Haight - Ashbury for some time. The history of sex, drugs, rock and roll is here on this street - a must do!\nShow less"], ["Reviewed November 10, 2016", 3.0, "Colorful, yet...", "... due to its reputation for being full of weird people we just quickly took a walk through it. Maybe unjustified judgement? Nobody tried to be intrusive or anything, but we nevertheless did not feel comfortable even about taking the photos. Saw some nice victorian architecture there though.\nShow less"], ["Reviewed November 10, 2016", 3.0, "Worth A Look-See", "The Haight-Ashbury is legendary. So you have to go. Maybe once.\n\nMaybe my age is showing, but I have limited tolerance for screaming crazies, which are very present here in the Haight. No, it's intended purpose is not to be shiny and new. For better or worse there are plenty of vintage or second-hand stores. And plenty of head shops for better or worse.\n\nGo to the Haight, especially if you're a fan of pop culture, browse around, have a coffee or beer. There you've done it. Plenty of other things to see and do in SF.\nShow less"], ["Reviewed November 9, 2016", 5.0, "Quaint village", "Slightly hippie with ornate shops and restaurants. The home of the famous painted ladies, however there are many Victorian homes similar without the traditional 3 or more colours. Visited pre Halloween and the decorations on the homes were outstanding."], ["Reviewed November 8, 2016", 4.0, "colorful", "Drove through this district on a city tour. We were in a vintage VW van. Many clothing stores and restaurants, coffee houses and bars. It was a very colorful neighborhood with well kept buildings."], ["Reviewed November 6, 2016", 4.0, "Flower Power!!", "Steeped in culture and ambience...\"flower power\" eminates from the Haight where back in the sixties, Volkswagen vans, teens in braids and tie dyed clothing wandered aimlessly...probably under the influence to music, activists and free love."], ["Reviewed November 2, 2016", 5.0, "It's the history of the place...", "The appeal of this place will largely only apply to those interested and aware of the significance of it historically in terms of its musical and socio-cultural relevance. It was good to see, and to imagine a bygone time..."], ["Reviewed November 2, 2016", 5.0, "Must see spot", "Came for some shopping with a friend. There's so many great thrift and vintage stores, with great choices. A lot of great boutiques as well. Plenty of places to eat and drink. Nothing was super overpriced either. Definitely worth visiting!"], ["Reviewed November 2, 2016", 4.0, "Hippy on the Haight", "Another must do part of San Fran - go to the Tie Dye shop, they sell just about everything tie dyed and all done locally, few other shops, all very much in the \"Hey Man\" mode, almost like a smaller version of Camden Town in London,\nShow less"], ["Reviewed November 1, 2016", 3.0, "Interesting?", "I'm not sure what sort of vibe you are supposed to feel in this neighborhood. But \"hippies\" and \"60s\" isn't exactly what I felt.. Junkies, Homeless, and sketchy is what you will mainly experience here.\nIt feels like that 60s vibe died off long ago and is replaced by sketchy bars, overpriced shops and a few record stores and tattoo parlors. Some of the buildings are cool and I had lunch at an amazing Puerto Rican restaurant.. but that's about it.\nShow less"], ["Reviewed October 22, 2016", 5.0, "Visit 2012", "Went for a stroll through the area on the way to the park. Like stepping back in time to the sixties. Great atmosphere and very much part of the culture of the city"], ["Reviewed October 21, 2016", 4.0, "The haight of success", "This was a gem of a place we found by accident whilst passing through one day. A knock back to the summer of love with hippy shops and laid back atmosphere. Loved the vinyl record shop with over a million records to browse through, the Jim Hendrix house, and the various facades of beautifully created buildings. Take the time to get a little further out of SF centre and pay a pilgrimage to the great neighbourhood.\nShow less"], ["Reviewed October 21, 2016", 5.0, "Couples trip", "Very cool, loved the paintings on the buildings. Lots of musical history there. Just felt cooler walking around! lol"], ["Reviewed October 18, 2016", 4.0, "Trippy!!", "I see things have not changed much since the hippy movement! When the tour bus dropped us off we were in front of a \"clinic\" where you could apply for your medical marijuana card. The line was quite long. There were people standing around all over sharing weed on the street. We had to stop and eat at a sidewalk cafe just so we could people watch, freaky!\nShow less"], ["Reviewed October 13, 2016", 3.0, "Kings Cross of San Fran", "After seeing heaps of photos of this district I was slightly disappointed, very dirty with drug dealers offering you weed. Some great murals are around the Main Street and quirky shops are there if your into the alternative. The park down the end of the street was full of homeless people which is also off putting if you want to head to the tea rooms.\nI wouldn't rush there as plenty of nicer areas to be seen.\nShow less"], ["Reviewed October 9, 2016", 4.0, "Old hippie joint good to walk about and dine", "It was the original hippie joint, now still hip, but replaced by some modern decor. Have a walk about, dine in the many restaurants, diners and enjoy the world go by.\nShops abound for the retro stuff and a nice market selling fantastic array of food stuffs. Spend some time wandering in this area and you will be pleasantly surprised by the many arty work found here.\nShow less"], ["Reviewed October 8, 2016", 3.0, "Visit through a tour!", "Safe yourself a lot of hassle and book a tour, Haight has a lot of dangerous areas and you've really go to know where you're going or you'll end up in some drug den."], ["Reviewed October 3, 2016", 5.0, "A good walk for old times sake.", "A walk back in time to the 60s to remember Janis Joplin, Jerry Garcia, Jefferson Airplane and the hippie generation. Great shops. Good eats. Great stop - Ben and Jerry's at the corner of Haight and Ashbury - also a great photo spot."], ["Reviewed October 3, 2016", 4.0, "Weed, weed....", "It was a really interesting experience to see all these people cheering and smiling to you. I've never been to a place where so many people ask me if I want to buy some weed...that was strange ;)"], ["Reviewed October 2, 2016", 5.0, "loved the houses around", "We tried to reach here by car but we could not find parking space and we drove around the streets. May be you dont believe me but it was very good to get lost in the streets around here because streets and houses are very impressively beautiful. We fall in love with them.\nShow less"], ["Reviewed September 30, 2016", 5.0, "Coolest part of San Francisco - literally", "Was only intending to walk through, but spent hours there. Like walking back into the 60s. The place has a friendly, quaint buzz about it. Steeped in culture and history. great shops, restaurant and cafes."], ["Reviewed September 29, 2016", 2.0, "Sketchy, skip it", "As a child of the 60's, I should have liked this more. It was dirty, and the only place I did not feel safe. Skip this and hang out in the Castro district."], ["Reviewed September 24, 2016", 5.0, "Love and peace", "Have dreamt of this place forever. Home of my heroes and Revolution. It's changed from the summer of love but still worth walking in the famous/infamous footsteps."], ["Reviewed September 24, 2016", 5.0, "Decades converge", "Haight - Ashbury is a must see for visitors to San Fransisco. A convergence of old world charm and new age hip. This place brings all people together."], ["Reviewed September 20, 2016", 4.0, "Not too many hippies left, but tons of classic rock history", "See The Deads house, Jimi Hendrix and Janis Joplins. All from the outside of course. Sadly there are many overpriced clothing stores, but they are worth a look if you are window shopping. Lots of bums, some hippies left. I talked with some the other day and they played a Grateful Dead song for me before I left, but these people are sadly rare on this street now. Lots of trash and pretty run down. I really hope that someone helps revive the true counter culture of the 1960's and brings back life to this famous street.\nShow less"], ["Reviewed September 19, 2016", 5.0, "Great place to shop", "Every time we come to San Francisco we always stop at haight street and shop and look at the stores I love the stores they are fun"], ["Reviewed September 17, 2016", 3.0, "Nice architectual", "If you've time, this is the place to drop by and enjoy the nice architectural with colorful paints on the building."], ["Reviewed September 15, 2016", 4.0, "lavable", "Like Castro I can't imagine someone who arrives in San Fransisco and doesn't go to this historical hippie beehive wher the ''Summer of Love '' happened 1967"], ["Reviewed September 15, 2016", 5.0, "Haight", "We visited the haight area we had a lot of fo visiting the shops got some fab sunglasses and had a ice cream in the original Ben and Kerry's ice cream shop was delicious there is a fair amount of harmless homeless they didn't bother us though don't miss out a visit to this part of San Fran\nShow less"], ["Reviewed September 12, 2016", 2.0, "Really disappointing. Very tacky", "There's no doubt that the heyday of Haight Asburu is long gone. All of the shops are really tacky and are trying to live of a reputation that was established in the 1960s. Avoid!"], ["Reviewed September 11, 2016", 5.0, "Itinerary around Haight-Ashbury", "I started walking at Civic Center this morning at 10am. Walked past City Hall, Public Library, music hall.\n\nWalked along Hayes Street or Golden Gate Avenue. Interesting buildings along the way.\n\nTurned into Fillmore and walked towards Japantown. They had Farmers Market / street performance at Fillmore.\n\nIf you appreciate Japanese culture and crave for Japanese food; Japan Center / Peace Pagoda worth your time! Not to mention that it is a rainy activity...\n\nIt is only a 9 minute walk from Japan Center to Cathedral of St Mary of the Assumption.\n\nAfter that, you could have a picnic at Jefferson Square Park if weather permits.\n\nI subsequently walked along Golden Gate Ave to Haight Ashbury. It was a 45 minute workout.\n\nI ended my walk at Amoeba Music. Haight Ashbury is filled with quirky shops, people and buildings.\nShow less"], ["Reviewed September 11, 2016", 4.0, "Happy hippie movement", "This area is associated with the hippie movement of the 70s\nIt is full of little shops, vintage clothing, tie-die shirts and dresses, non-conventional souvenirs.\nLots of places to eat and drink, cheaper than other areas of SF.\nStreets smell of pee and weed.\nInteresting enough even for a non-hippie to spend a couple of hours wondering the streets.\nShow less"], ["Reviewed September 9, 2016", 5.0, "Interesting", "Went there just to feel the hippy vibe and certainly felt it. Smells like pee, lots of shops (great souvenirs if you're tired of magnets)"], ["Reviewed September 8, 2016", 4.0, "A must whether you are an ex hippy or not.", "Historical area associated with the hippy movement of the 60s and 70s. Now reasonably well preserved with restaurants, shops etc , but does retain a quirky alternative feel , spreads out for more than you think and worth spending some time to explore properly."], ["Reviewed September 7, 2016", 5.0, "Lots of boutiques and restaurants", "Great place for shopping for young people mostly and just a happening kind of place.. It does have a vibe that tries to authenticate old times like the sixties."], ["Reviewed September 4, 2016", 4.0, "Tie dye?", "Ok so I've been around the world and I have to say, this is probably the only place left on earth that still sells tie dye and people still wear it too. SF is a love it or hate it type of city and the sanctuary of this place is a welcoming trip.\nShow less"], ["Reviewed September 1, 2016", 2.0, "Disappointing", "The area has a lot of history, which sadly isn't really apparent if you don't know it going in. It is actually a bit dirty and unless what you are really looking for are a plethora of places to buy a glass pipe, you can probably skip it.\nShow less"], ["Reviewed August 31, 2016", 2.0, "Dirty and Disappointing", "Caught the number 7 Muni bus to the area and was immediately disappointed by how filthy everything appeared in this area. Saw some lovely old properties on some of the side streets but the Main Street was a collection of stores selling very touristy tat or beggars and supposed homeless people shouting inane things at each other with their hands out. Maybe this place was the happening area in the late 60s but it's certainly had its day. Couldn't find a place in which we felt comfortable to eat and we walked from Masonic to the Golden Gate Park. When we arrived at the entrance to the park we were greeted to a large group of beggars lying on the grass area through which you are expected to walk a gauntlet. SFPD had a heavy presence in this area....... We declined to walk in the park. My advice is to look at pictures of this place and go somewhere more pleasant like Marina or Pacific Heights.\nShow less"], ["Reviewed August 27, 2016", 4.0, "Quirky", "This is a nice, quirky \"bohemian\" place to visit in SF, with lots of nice independent shops and cafes. It has a really nice feel to it."], ["Reviewed August 27, 2016", 3.0, "60s Nostalgia", "I was born long after the Summer of Love, but I'm still well aware of the significance of this neighborhood in American culture. My husband, his ten year old son and I set out way too late in the afternoon for Haight-Ashbury. The main goal of our visit was to go to Amoeba Music (my better half loves records) and take in the sights. We hopped on the wrong MUNI bus (NBD - we got to see more of the city that way) and so it was dark by the time we reached the Haight. Most of the funky looking shops - unfortunately including Amoeba - had closed for the night. We walked to the end of Haight Street (at Stanyan), observing the very busy, not very groooooovy Whole Foods.\n\nI live in a city (DC) that many people consider dangerous. I've visited many cities in the U.S. and around the world. I don't consider myself particularly \"streetwise\" - just exercising common sense when it comes to walking around cities, especially at night. SF, like most, is a big city with big city problems. I mention this because I felt somewhat uneasy walking around Haight Street at night. We walked around other neighborhoods at night in SF but I didn't have that same feeling of menace. Lots of homeless people about, not very well lit streets. I was especially disturbed by the number of really young people - like late teens/early twenties - who seemed to be living on the street, intoxicated, almost like they were trying to recreate some Summer of Love/Hippie thing. I guess Haifht-Ashbury is the place to live that dream.\n\nAnyway, Haight-Ashbury is definitely worth a stop - during the day!\nShow less"]]}}