{"Half Dome": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Half Dome", "url": "/Attraction_Review-g61000-d139183-Reviews-Half_Dome-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/2a/e7/da/starting-up-the-cables.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1272"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Do it once before you die", "The Half Dome experience is not as intimidating as people have depicted. This is assuming you visit Half Dome when the cables are up.\n\nThere are sturdy steps to put footing along the cable going up Half Dome. I dont feel any moment that it was dangerous. I would rather say the the view along the cable was breath taking.\n\nWent up on the mist trail, after the Nevada falls the scenery is quite boring, until you hit sub dome. Park ranger would check your permit at base of sub dome.\n\nAnd the hike gets very interesting and scenic after that. Check the weather before heading up. Avoid when storm is approaching.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Yosemite Beauty", "One of the majestic views in Yosemite. It is easy to remember and locate in the views throughout the park. Great view of it from Tunnel View."], ["Reviewed 4 weeks ago", 5.0, "Quite scary but amazing", "In a fit and athletic young male and the hike up was easy enough. The cables however was scary. There are gloves at the base you can use- definitely use gloves. Well worth it. If you don't like heights or aren't 100% mobile this isn't for you- it's pretty full on and scary\nShow less"], ["Reviewed January 21, 2018", 5.0, "Worth the trip, if you can do it!", "A Long difficult path but SO rewarding once you make it! Just over 8 miles up and 8 back, plan an entire day and leave from the valley early!"], ["Reviewed January 12, 2018", 5.0, "Half day's hike", "Well worth the view. Start early so you can make it back down before dark. It's awe-inspiring. The \"back\" way is more scenic, up past Vernal Falls."], ["Reviewed December 17, 2017", 5.0, "Half Dome - Gotta Do It !!!", "If you can only do one hike/climb at Yosemite this is the one you want to choose. It is epic but make sure you are physically ready for the challenge and have proper gear. Hiking boots with good vibram soles are a must. You will be climbing up granite and you can't afford to slip on this one. Parts of the last 400' are at a 60+ degree angle so it is challenging. That being said, make sure you bring gloves for the cables. Your hands will thank you. Most of the time when training for a trip you concentrate on legs and endurance. This one is a little different. Make sure you arms are ready for the climb up the cables. Legs are important but your arms will either make or break the climb.\n\nOne last very important piece of advice. When climbing up or down make sure you face Half Dome. If you slip facing the rock you'll go to your knees first and have a chance to catch yourself instead of sliding all the way to the bottom. If you face out and slip you'll go head first with little chance to save yourself and may possibly take others with you.\n\nChallenging but beautiful and rewarding.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Half Dome Hike, challenging but worth it!", "I have been planning this hike for a couple of years and it was very challenging and strenuous but had some amazing views on the way up and back. We saw a bobcat that walked a metre in front of us on the path!\n\nThe cables was tough, especially after the strenuous hike. Make sure you enter the lottery and get your permit as there was a guide checking you in at the base of the rocks before doing the switchback to the base of the cables.\n\nThere is a pile of gloves at the base of the cables which is a must if you don't have your own. It is good for that extra grip. You will be using a lot of upper body strength to pull yourself up the cables as it is pretty steep and almost vertical. Take your time and you will have some breath taking views at the top and great memories.\n\nVery challenging but worth every minute. It requires a good level of fitness to be completed in one day.\nTotal time for us was about 8.5 hours round trip. We left at 6.30am and got back just before 4pm.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Wow - what a view", "From the valley floor - dramatic view, lots of photos! There are at least 2 paths to walk / scramble up the top if you have the gear and the time. (usual warnings - weather and bears!)"], ["Reviewed October 29, 2017", 5.0, "An impressive sight", "This impressive formation can be seen for miles & miles in all directions. I have not seen any other mountain like it in the world."], ["Reviewed October 23, 2017", 4.0, "Yosemite icon", "This can be viewed from so many angles and places. The is icon commands the valley and the national park. It is called half dome because it is like a half dome. It is huge."], ["Reviewed October 18, 2017", 5.0, "Superb views", "This should be on your bucket list to add your name to the lottery and get a permit, you will need a strong stomach for heights though. The view of it can be enough and viewing the=is from Glacier point is something else. This is a photographers dream.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Amber Glow is Something to Behold!", "This majestic work of nature is amazing in itself, but we were told by our tour bus operator to go to a nearby meadow overlooking Half Dome just before sunset to see the amber glow on the dome. What a sight! it even photographs better than when you actually see it because it is so beautifully golden. We got the added plus of a little fox coming up from the meadow and walking right by us as we were waiting for the sunset. I am not physically able to make that type of strenuous climb to the top, but my husband would have loved to do it. You have to be prepared and put your name on the lottery list to even have that opportunity because they regulate the number of people climbing Half Dome.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Too huge to imagine or take in", "We loved the views of half dome and we were able to spot some climbers on it. We walked from behind the Majestic Hotel on paths and bike paths that allowed us many different views. We passed over bridges above some lovely streams. There were only a few other people on most of this walk, so we were able to enjoy the quiet of nature.\nShow less"], ["Reviewed October 12, 2017", 5.0, "do it if you get lucky w the lottery", "- need to win the ‘lottery’ to go up. Apply 48h before (to 1pm), you will get a response by midnight if you have won.$10 per lottery and if you get lucky, another $10/person for the permit.\n- make sure you enter a second group leader\n- there is a link on the homepage that shows the likelihood of getting the tickets based on last year’s total requests.\n- we applied with two accounts for a group of 2 each and got lucky with the second attempt (= 2x $10 attempt 1 + 2x $10 attempt 2 + 2x $20 permit = $60 in total)\n\nhike:\n- not as difficult as marketed by the Americans (if you are used to hikes in the Alps). The cables at the end are a lot of fun.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Achievement to remember!", "If you are into hiking and love it,you should definitely do this.As once done you will love what you did.Just few points to keep in mind when planning:\nPlan ahead and try to stay in curry Village,its the closest stay to Start your hike.\nHave a strong mindset for strenuous hike of 10-12 hrs,go slow/fast as per your comfort zone in entire hike\nStart Early,few hours before sunrise;have at least 1 gallon of water + Snacks, and keep eating +Drinking at regular interval.\nFirst secure your permit than secure your stay as per your permit.\nDo it with Good hiking shoe.\nDon't give up after seeing the cables they just look scary but actually the EASIEST part of Hike! ,\nif possible try to do some practice hikes of 10 miles-just to condition your body to work for that long.\nThe hike is perfectly safe and doable,just be patient and keep going. I completed it with my pulled leg muscle -which i got at the very start of hike on mist trail.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Half Dome", "wonderful national park, but oh soooooo crowded. Enjoyed standing in the meadow and watching rock climbers - I could NEVER do what they do"], ["Reviewed October 10, 2017", 5.0, "A Top Hike of my Lifetime!", "I have been on many, many hikes in my life, but Half Dome is certainly one of the most rewarding. The views at the top and the feeling of accomplishment upon finishing are some of my favorite things about hiking, and Half Dome was no different!\n\nFirst of all - apply for your permits in March. They have a day by day chart of how many people apply vs how many get them, to help you plan your trip. My husband and I backpacked in the night before our permit and stayed about 4.5 miles in, which made for really nice timing day-of. Up on the cables before almost anyone else, we were able to hang out for a couple hours and have lunch up there, and less mileage in one day. 100% would recommend doing this, but you obviously need the equipment and you need a separate permit.\n\nYou NEED gloves. Yes, you can try to be tough and do it without them, but why? They protect your hands and a rubber palm grip is helpful, as there's lots of arm involved as you're going up the cables. Yes, there's usually some at the base, but they're essentially trash. Bring your own, pack them out.\n\nI did the hike in athletic shoes, but brought boots in my pack to switch into after the subdome. Extra weight, but I'm glad I had them because the rock under the cables is slick. Imagine how many people go on the same path day after day wearing it smooth? The extra grip was really helpful.\n\nPro Tip - Reward yourself with some pizza and a Firefall Red at the pizza place in Half Dome Village when you're done. Really hits the spot after a long day of hiking! :)\nShow less"], ["Reviewed October 9, 2017", 5.0, "How to do Half Dome if you're a potato (like me)", "I am not a fit person, I don't exercise regularly, I didn't train at all for this and I hiked half dome this weekend. As long as you are willing to go through some pain to do it and you have the will you can probably finish this hike and then brag about it to all your friends and check it off the bucket list.\n\nTricks I used to make it:\n- Apply for permits. Recreation.gov has a lottery for getting permits to go up the cables at the end. You can apply pre-season or 2 days before the day you are trying to get the permits between midnight and 1pm. You may have to try several times to win (weekend odds of winning are like 12%). If you have a bigger group, get each person to enter the lottery once to increase your group's odds (group size up to 6). I applied for Saturday, lost and applied for Sunday and won.\n- Sleep in the park the night before and after if possible. Even if all the sites are full, you can keep refreshing the search and wait for cancellations (which is what I did because I booked this trip 3 days before leaving). This will be harder to do in the middle of the summer.\n- Bring at least 4L of water (after Vernal Falls footbridge because it's the last place to fill up). Water reservoir sacs are best because they are light.\n- On steep sections / stairs, pace yourself or you might get too tired (ex. I might do 5 stair steps, rest for 4 seconds. On steep hills, take 12 steps, rest for 4 seconds). This will prevent your legs from every getting too tired to have to stop for longer breaks.\n- Bring GLOVES. Palms should have rubber grips. Sometimes there are some at the bottom of the cables, sometimes there are not.\n- Wear 2 layers of socks and apply moleskin to parts of your feet that regularly blister.\n- Make sure your backpack has a chest strap to reduce back pain\n- Bring a lot of snacks, you're going to burn like thousands of calories. Also make sure to eat even if you're feeling nauseous. You won't make it if you don't have regular caloric intake.\n- Bring some toilet paper in case of an emergency bathroom break. There are bathrooms at Vernal falls (bottom & top), Nevada falls, and the backpackers campground. You have to bring back all your toilet paper with you if you go anywhere else, and don't use the bathroom near the trail.\n- If you don't want to do the steep stairs at Vernal or Nevada falls... take the longer but much less steep John Muir trail that branches off shortly after the Vernal Falls footbridge. If you do the Vernal falls stairs and decide you don't want to do the Nevada ones after, you can branch off to the John Muir trail between them too.\n- Subdome is very steep and impossible to avoid to get to the top. At some point the stairs will just end and then you have to just walk up the rocks the rest of the way... so you can't avoid *all* the stairs.\n- Bring headlamps, you are almost definitely going to end up in the dark at some point. It took my group 7 hours to get to the top of subdome, 5 hours back down, and an hour total on the cables but we also spent an hour on top of half dome and a bit on top of subdome.\n- Leave early, the earlier you get there, the less people will be there. We left at 3:30am at the trail head and we arrived just at the beginning of the main crowd. Fit people usually arrived at the same time as us if they left at 5:30am.\n- Take your time on the cables, don't let anyone pressure you to go faster than you are comfortable with. There are rest stops every 5-10 feet (wooden planks).\n- You need shoes with good grip for the cables, like newer running shoes or hiking shoes. Unless you want to be slipping the whole way up and down (you might slip a bit going down anyways).\n- It's going to hurt for a few days after so don't plan more hiking the next day lol\n\nOverall this hike is an amazing accomplishment and I recommend that everyone should do it. It's hard and it's scary but that is why it is special. If you have the will to do it and a positive attitude you should be fine.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Like be the dome", "Whenever I visit Yosemite Park I always smile when I see Half Dome. It's so stunning. I love him. He dominates the view.\nI am not a climber and so do not know anything about climbing the dome but I just love looking at him whenever I visit the park.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Cables are Scary", "I hiked this with my sister on October 3. The hike itself was not as hard as we were expecting but still very tiring. We had been preparing throughout the summer. It took us 12 hours and we started at 4 a.m. in the dark. The cables were harder than I thought. They are steeper than many of the pictures we had seen. We went up slow and stopped on each board. We felt bad for the patient guys (at least they acted patient) behind us. Going down the cables was much easier for us. Overall, it is definitely a hike that I will always remember. It was a challenge and I felt a great sense of accomplishment when I was done.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Great granite rock", "Amazing how you can see Half dome from anywhere in the Valley. It is so hugh and beautiful! Nice description of how it was formed in the visitor center exhibit. Great to take photos or it or climb from the back."], ["Reviewed October 4, 2017", 5.0, "Simply amazing", "We only checked this from the base as I was not prepared to waste my limited energy on hiking it but I would highly recommend it to people who camp overnight here. Great view, however dangerous."], ["Reviewed October 2, 2017", 5.0, "A right of passage for everyone", "My wife and I prepared for this hike doing 8 miles every weekend for 8 weeks before we went. It was just barely enough. But after you get down from the experience and have picture proof of the adventure every single step coming up and down that trail becomes worth it. 17 miles round trip in 13 hours. Altitude gain of just about a mile going the 8.5 mikes up.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Amazing", "Viewed this from different locations of the park starting from Tunnel view to Glacier Point. It is amazing............ It leaves you speechless. No words or photos can actually do justice."], ["Reviewed October 1, 2017", 5.0, "Beautiful at Sunset", "Had the opportunity to watch the sunset \"light\" up the dome. Was a wonderful sight! Watched it from the path between The Majestic and the main village."], ["Reviewed October 1, 2017", 5.0, "Another Amazing Sight in a Breathtaking Place!", "We were in Yosemite Valley and decided to go walk around the Majestic Yosemite Hotel. I may be getting the landmarks confused but am pretty sure it was Half Dome we saw while driving in. Incredible to think people climb these rocks! If you are a nature lover or spiritual, this is such an inspiring sight to see.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Minnesota nice", "Best location to view is at Glacier Point. I have no desire to climb it but people do....scary! Bring binocs to view climbers."], ["Reviewed October 1, 2017", 4.0, "Hiking half dome - pictures and videos do it no justice", "We finally got our permits to ascend half dome's cables!\n\nWe were staying in Mariposa and knew we needed to get a really early start for this hike so we left our hotel at 5.45am and got to half dome village trailhead car park at 7am. There were still plenty of spaces left for parking, but I would imagine by 9am it might be a little more difficult to park up there. We visited in the middle of September on a weekday.\n\nWe took the Mist Trail up which included walking alongside Vernal and Nevada Falls before ascending through the forest to get to sub dome. During this grueling hike I was on the lookout for the ranger who is supposed to check your half dome permits but they were nowhere to be seen! So we effectively wasted our money paying for this hiking permit because it didn't get checked anywhere - even on our way back down there were no rangers anywhere checking permits.\n\nSub dome - this was tough and after already hiking over 3.5 hours, it's a steep section of unforgiving switchbacks with a short section of no switchbacks where you just need to make sure your shoes are grippy to get you up the steep rock.\n\nAfter getting to the top of sub dome and reaching the base of half dome, this is where you question your sanity. I can't stress enough how looking at other peoples photos and videos still doesn't prepare you for just how steep this climb is. Gloves are pretty much a must for grabbing on to the cables - there is a pile of gloves just by the start of the cables at the base to use if you haven't got any with you. You will be hauling yourself up this mountain so a good grip and grippy gloves are required, your legs don't do much work.\n\nMy husband and I came here to hike up to half dome together but I got half way up before shuffling my way back down. I just didn't want to continue, it was way steeper than what I expected and combined with the traffic and negotiation of people coming back down with a little bit of wind blowing too, I needed to get back down and plant my feet firmly on the ground haha!\n\nMy husband managed to get up there though and when I asked him about the overall experience he said, and I quote \"it was horrific\". He said the views were decent at the top but you're stood on-top of the thing that makes a great photo from other viewpoints in the park.\n\nIt was still an enjoyable experience for me sitting at the base and watching others make that climb. I wasn't the only person who turned away. There were others that didn't even attempt the cables and just walked away. I did witness one of the poles coming loose and swinging against the mountain which made a loud noise, before someone jammed it back into position. I also witnessed somebody's metal water bottle falling and banging against the rock right next to where people were making their way up - it's wise to make sure everything in your bag is in zipped compartments to stop this from happening.\n\nThe hike overall was around a 16 mile round trip which we did in a day. We took the John Muir trail back down. It took around 9 hours to complete.\n\nIf you're going to do this hike in a day please take enough water, especially in the warmer weather and also ensure you have enough food such as energy bars and fruit to give you that extra boost to get through this. We probably should've had a bigger breakfast!\n\nI would recommend the half dome hike to anyone visiting the park with an interest in long, grueling hikes. Just make sure you have good grippy shoes, a pair of gloves, plenty of water, food and a sensible approach to the climb. There were some people who were coming down so fast they were slipping and making it dangerous for others.\nShow less"], ["Reviewed September 28, 2017", 5.0, "See this rock from as many different perspectives as you can", "There is a minimum number of words to write a review, but frankly, this mountain, which I love, leaves me speechless. I hiked to its summit when I was 23 (cables were down), to the quarter dome at 40, to the sub-dome at 68, shared a balcony yesterday with a couple who was hiking it in honor of his 70th birthday. For my 80th, I'd like to walk around the Valley and look at it from below from as many angles as possible. Half Dome has my whole heart.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Amazing", "Unbelievable piece of rock. I especially enjoyed the story about how it was formed told by Danni, our tour guide. The old woman's face is still there!"], ["Reviewed September 22, 2017", 5.0, "Awesome", "Like most views within Yosemite National Park the view of Half Dome is awesome - great to see it from several angles which gives great perspective"], ["Reviewed September 21, 2017", 5.0, "beautiful views, not for those scared of steep slopes", "I climbed this for the second time earlier this month, and it was once again a fabulous experience. My first time was before they limited access to those with permits, and the cable was jammed with people going up and down. That was very unpleasant, and not very safe, so I am a big fan of the permit process. You might get up and down without a permit - but don't try it. the rangers check on a random schedule.\nThe first time I did it, I was with a bunch of teens, so I fashioned harnesses out of rock climbing webbing and <real> carabiners. Each of us then had an approx 6 foot loop of webbing with another two carabiners on it. If you know what you are doing - only if - you can in this way be clicked into the cable at all times, which lessens the anxiety you might feel about clinging to a cable on a very steep rock slope. I did not use it the second time - just two of us - and I kind of missed the assurance that the harness gave me.\nYou'll need good legs, lungs and heart to make the approach hike, and you'll need reasonable arms for the climb up the cable. At least I found my upper body got quite a workout.\nI cannot overstate how tricky and aggressive the rodents are at the top. Leave no food unattended for ANY amount of time. We lost a bag of nuts that was 2-3 inches from our hips, between us.\nAlso bring plenty of water, and a means of filtering or purifying water from above Nevada falls. If its a warm day, many people find themselves running short of water.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Incredible Experience", "Joined the lottery system in March to get permits to hike the cables for myself and my husband. Third year trying & I finally got them! And for our first choice -- our 24th anniversary on Sept 18. Unfortunately a few days before we were to leave, my husband took a bad fall on his bike and needed crutches -- so I took my sister. Now, we're both in shape, work out most days and knew the elevation wouldn't bother us BUT this hike was still extremely hard!! 19.2 miles up and back. We stayed at Half Dome Village and left at 5am with headlamps on. We decided to take the John Muir Trail up instead of the Mist Trail -- which I read was quite grueling & could really tire you out with 15 or so miles to go. The JMT was beautiful and from it we were able to see the sunrise over Nevada Falls! We continued on stopping for 5-10 minute breaks to eat high protein & carbs -- you definitely need lots of snacks to fuel you for this hike. As well as at least 3 liters of water in a camelback. We passed Little Yosemite Campground - after that is when the ascent starts again. Relatively gentle at first, then excessively harder for a few miles. Just when we thought the hard part was over, we reached the Sub Dome, which I think is the most difficult part -- even more so than the cables. It's a very steep granite rock which starts with switchbacks, very deep steps and then finally morphs into just plain granite -- no steps and very steep with drop offs on both sides. We stuck to the middle and were grateful for our very grippy hiking boots! At 9:30 am, we reached the cables -- awe inspiring and quite scary looking! We watched a couple people ascend and witnessed may people around us making the decision not to go up -- but I hadn't hiked that far for nothing. We started and again were very thankful for our grippy shoes AND our cheap rubber gardening gloves -- don't need expensive climbing gloves -- the rubber ones work the best. This portion takes a fair bit of upper body strength as you are mostly using your arms to pull you up the cables. I'm not afraid of heights but I can see why this may freak many people out. I think it took us about 15 - 20 minutes to get up to the top but when we did we were blown away. Its as if we were on top of the world. Photos doesn't do this justice, you must experience it to get the full effect! Breathtaking, exhilarating -- words can't describe it. We stayed up at the top for about an hour taking it all in & then descended the cables. It was much more crowded with people coming up so it took much longer to get down as you have to let people pass -- and its very narrow, so that's not very easy. Took 30 minutes or so and many people go down backwards so they don't have to look straight down, however, I went sideways part way and then forwards the rest. I just loved the view and wanted to keep on looking at it! We rested a bit on top of subdome and then continued back. I found hiking back much harder -- my feet started getting uncomfortable and your knees take a pounding going down. When we reached the Mist Trail, it was pretty uncomfortable for my knees -- Very very steep and lots and lots of deep steps and switchbacks. It was also very crowded since the afternoon crowd was walking up to see Vernal Falls. Felt much much longer than hike up. But after 11 hours 10 minutes round trip I was happy to celebrate our achievement with a bottle of wine and 11 hours of sleep!!\nShow less"], ["Reviewed September 20, 2017", 5.0, "Amazing", "Not in physical shape to attempt a hike, but still an amazing site to see. Took several photos from behind the Majestic and others from near Sentinel Bridge."], ["Reviewed September 19, 2017", 4.0, "Scary, strenuous, exhilirating, and stunning views.", "I went backpacking this past weekend to summit Half Dome. I am adventurous and in great physical shape and I still found this hike to be incredibly strenuous because of the high elevation. The cable section is steeper than I could've imagined. I'm not afraid of heights, but the angle is quite vertical and with no ropes or harness it can give even the most adventurous a scare. The views are stunning from the top, so it's a great summit, but I recommend only people in peak physical shape and zero fear of heights attempt to make this climb.\nShow less"], ["Reviewed September 13, 2017", 4.0, "Exciting view of monolithic structure!", "Wow, what a great experience viewing the half dome just from its base! The weather was so pleasant, over 20 degrees less than nearby cities at MSL, making the trip so nice!"], ["Reviewed September 9, 2017", 5.0, "Amazing Geography", "Really, really cool example of physical Geography that is far better in real-life than in the textbooks. Well worth a visit to get to grips with glacial morphology and other key concepts of geography!"], ["Reviewed September 9, 2017", 5.0, "scary, strenuous and exhilarating", "one of the best but strenuous hikes in california, half-dome is a bucket list item if you are a hiker of any sort or strength. 16.5 miles to and fro once u park at the trailhead, the actual 'cables' part is a kind of mountaineering effort where you pull urself up that requires good knee and wrist coordination. but thats just for a 300ft... rest of the hike is 2 parts, one filled with steep steps knocking ur knees.. and the other half is a cakewalk in the sand thru the valley. Vernal and Nevada falls will mesmerize you but the sprinkling water would solace your body and soul for sure when u r about to finish this extreme hike.. I just love it and keep going there again and again..\nShow less"], ["Reviewed September 7, 2017", 5.0, "Definitely a bucket lister", "13 hours later and totally exhausted - it was amazing. Definitely want to plan a little when doing this hike/climb. Went with a group and it was worth it. Started at 5:30am and got back at 6:30pm. We needed all the daylight we could get.\nIt was hard to fathom what we accomplished when done - the views etc. it was amazing.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Half Dome Hike", "If you haven't been, you've got to go. Done right, this trip can change your life. Half Dome hike is an absolute must that takes you Close to the Edge ( thanks Jon )"], ["Reviewed September 6, 2017", 5.0, "Must Do for the Adventerous", "Depending where you start in the park the hike can be from19 to 22 miles return. You need a permit for the cable section and you apply five months in advance. Some cancellations do become available online and in the park. Did the John Muir trail section up and down to avoid being wet through the mist trail. Easier on the knees but a little longer. Lots of nice people and great scenery too including a close encounter with a bear. Bring rubber gripped gloves for the cables it helps a lot. Views from the top outstanding and throw in the eclipse and you can't beat it.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Amazing!", "It is absolutely worth it. I would definitely recommend going early in the morning. The cables are not as scare as they look once you get closer to them. Bring gloves! They are vital, especially for going down. Good shoes are also important."], ["Reviewed September 4, 2017", 5.0, "Awesome!", "It was amazing! Up the mist trail down the John Muir. Started in the dark to finish by 630. The cables were harder than I expected. One spot in the middle we had a little freak out moment, but coming down was pretty easy. Everyone was considerate. Glad the number of permits are limited. Make sure you have identification if you are leader or co leader. Ranger gave us a little grief.\nShow less"], ["Reviewed August 31, 2017", 5.0, "impressive", "You can see the half dome from several points in the park. You do not have to climb it in order to appreciate its majesty and how it almost towers over the Yosemite. We loved seeing it and taking many many photos."], ["Reviewed August 30, 2017", 5.0, "Like a giant sentinel standing watch!", "the 1st time you see Half-Dome one cannot help but marvel at this awesome humongous rock which seems to stand guard and watch over the valley...Make sure to bring your camera when you visit...You'll definitely find lots of photo ops here!!! if you want to climb to the top you'll need to plan ahead as there's usually a line waiting to go on it...don't miss this spot if you're visiting Yosemite Valley for sure!!!!\nShow less"], ["Reviewed August 30, 2017", 5.0, "Best hike ever! but..", "you need to be in good shape it is over 22 miles round trip. so it is not for those who are not in shape, make sure you wear good hiking shoes, have a camel back for water !"], ["Reviewed August 29, 2017", 5.0, "Climbing to the top only by lottery", "We entered the lottery as we arrived with 4 days available. Decided to opt in. First time cost us lottery entrance fee and we didn't get it (no refunds); 2nd time we paid again but got it. 2 of our party went up the next day. You must take your permit with you to summit. There is a point where the rangers are on standby as many who win the lottery get to the bottom of the ladder and decide not to climb. It is long and arduous. Only 300 people per day are allowed to climb. This is much safer. Also make sure your pockets are empty or they will be and people lose keys and mobiles all the time. It is a vertical climb on a narrow chain ladder. To get to the bottom of the ladder is about 3hrs through at least 3 waterfalls and some spectacular forest where for the most part you are alone. All though if you sit long enough, many people are coming through the whole time. You will need to start at sunrise to make sure that you are not on the rock in the heat of the day or when it has warmed up - although some people still do. They just stay well protected. Loads of water, Loads of water, Loads of water - also a few toilets along the way at access points near the waterfalls as many tourists will manage at least the first two. After that - up to you. Also recommendations are not given lightly in the information section of the online website or under the lottery terms. Almost 30-40% get to the ladder and decide not to risk life and limb.\nShow less"], ["Reviewed August 26, 2017", 5.0, "There Is Only One", "It never ceases to amaze me, each time I see it. Even this time when it was very hazy throughout the park because of a controlled burning. There has been a very significant improvement of traffic handling since the last time I was there. You can pretty much stop at the places you want since road and parking facilities have been upgraded.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Epic Climb!!", "We climbed it at night and the sunrise was fantastic!! The cables were kind of nerve wracking but it was well worth it. The views were amazing!!"], ["Reviewed August 26, 2017", 5.0, "Only for the best of climbers", "Be ready for a very long climb Start early and bring water Patience please, most of the climbers who think they can climb it Quit about the half way mark. You have a lot of people moving south!"], ["Reviewed August 23, 2017", 5.0, "Stunning piece of granite stone!!", "You can view the rock from the Half dome parking lot. There are hiking trails but permit may be necessary. Reach out to the park office if you need one. Yosemite is just great!"], ["Reviewed August 23, 2017", 5.0, "Terrific Climb-- A must do!", "Brilliant! The Half dome hike is one of the most challenging ones I have encountered so far. The hike to the base camp 'the little yosemite valley campground' was just outstanding, the waterfalls were lovely and very refreshing! Nature is really the best therapy for anything :)\nPlan on leaving early even from the base down (we started at the John Muhir/Happy Isles trail head) before 3:00pm because the afternoon time is when the thunder storms kick in. One of the days we left at 3:00pm and had to turn back due to hail and heavy rains, next day we started at 12:00pm and made it to the little yosemite valley campground in time, slept the night there and left early morning at 5:00am to Half dome.\nI am not in superb shape but I took my time and rested along while doing the hike , so its totally doable. Water and protein bars are a must to keep your energy levels high because you will need loads of energy!\nFor permits, we stood in line at 3:00am outside the wilderness office and luckily scored them. You need to be early in line if you really want that permit to do Half Dome.\nThis trip was perfect for my husband and me :) An adventure tale that will go down in the books of life!\nShow less"], ["Reviewed August 21, 2017", 5.0, "Yes do it!", "Myself and several others aged 15-42 did this hike and had a blast!!! Some were scared, some opted out of hiking the dome, but all had fun and enjoyed the view along the way! None of us are athletes or ninja warriors, but some did a bit of preparation training (stairs and lunges) and ALL were very prepared with water, snacks, poles & gloves. It is a very doable hike, and the Dome part is challenging, but if you hit the trail head super early (we opted for 4:30/5am) you can pace yourself and take your time. If you're blessed to do this on a clear day, the views will knock your socks off! Be sure to watch the movie on the Yosemite website for valuable tips... and ENJOY!!!\nShow less"], ["Reviewed August 17, 2017", 5.0, "The big one!", "This is climbers paradise! Fabulous granite rocks that every climbing aficionado wants to climb. Unfortunately, we didn't get to climb it, but next time ....."], ["Reviewed August 16, 2017", 5.0, "Amazing", "I could write the same review about every location in Yosemite. Half dome is amazing and watching the people climb is just so fascinating. A beautiful site on any day."], ["Reviewed August 15, 2017", 5.0, "5 times a charm", "We have claimed this amazingly difficult hike five times now. Make sure you are in tip top shape because it is one of the most difficult things you'll ever do. When completed though it is an amazing accomplishment in the way up is incredibly beautiful and the things you will see are amazing.\nShow less"], ["Reviewed August 14, 2017", 5.0, "An epic trek and cabled ascent, but be prepared - read this!", "This was my second time on this epic trek and cable-assisted climb and I tweaked my kit and approach from what I'd learnt from the first one. Both ascents have been done in high summer.\n\nFirst, water and food. 4 litres of water is right, and I swear by a high quality water bladder with drinking tube as it encourages you to drink little and often; it's far easier to carry than multiple bottles as it moulds to your body and spreads the weight (trust me, 4 litres weights a LOT); and you don't 'stop and chug' all the time like you do with bottles, so making you absorb water steadily and keep a good, steady pace. Food- easy: carbohydrates and salts are the best, so some muesli type bars and a few bags of crisps did me great.\n\nSecond, footwear: I've worn a STURDY pair of cross-trainers both times and I swear by them. Unless you've weak ankles, boots are a weighty extravagance that will just add to your fatigue over the 16/18 miles (old hiker's maxim: \"an ounce on the foot is a pound on the body\"). However, DON'T wear ordinary trainers - stones and rocks will stab and prod at the base and sides of your feet and could injure you.\n\nThird: DOME ASCENT GEAR. I strongly urge you to take a proper climbing harness, a 24-36 inch sling, a 'pear' shaped (not ordinary) carabiner and a pair of leather gloves or strong gardening gloves. With these, your ascent and descent on the dome face is MUCH easier and MUCH safer. Remember, you think you might not fall but there's always the plonkers above you and if one of them goes and whacks into you - goodnight. The pear crab is needed because the cable thickness makes it fiddly and difficult to clip ordinary crabs onto it. We lost count of the number of folks who said they wished they had our gear as we ascended and descended.\n\nstart EARLY. I mean, SO early that it's still almost full darkness, which was 4.30 am for us in late July. You're not missing anything as the best sights are well on in the walk; also,you're minimising the time exposed to the direct heat of the sun; and lightning storms, if they do come, nearly always bubble up in the afternoons by which time you're well down on your descent - w\n\nKeep a steady, comfortable pace adjusted to the slope rather than stopping for breath lots of times. So long as you do have a water bladder, you won;t have to stop to chug bottled water all the time and can save breaks for 2-3 hour intervals - so when you do have those stops, have a GOOD one. Find shade, get your shoes off and your feet up and take in fluid and food for 15-20 mins at least. You'll feel re-invigorated, refreshed and enjoy the whole experience a lot more than just walking yourself into the ground.\n\nLastly, I'd advise going down the mist trail on your return trip as well as up rather than the John Muir. I did the Muir first time down and as well as being longer - which it is - I found it in poor condition and hard going in my tired state. They say don;lt do the mist trail because it's busy but in taking it this time I found it easy enough as well as it being a much better maintained route and about a mile shorter- to me, the mist trail on both ways was a no brainer.\nShow less"], ["Reviewed August 11, 2017", 5.0, "very nice visit", "i recommand you to visit half dome, it is a wonderfull dome, very big, the view from glacier point is wonderfull"], ["Reviewed August 9, 2017", 2.0, "Not worth the time", "Move on....it's difficult to get a good picture and the hiking trails are very crowded. There were too many young folks running along the trails, causing an issue for the old folks that were less stable."], ["Reviewed August 8, 2017", 5.0, "Impressive and Magnificent!", "It was a couples outing. We visited Half Dome, and were awed and humbled by the beauty and magnificence of this natural wonder. The enormity of the Dome is really something to experience, whether just sight seeing or to actually climb (we didn't). This is something if you appreciate the great outdoors to put on your bucket list. Enjoy!\nShow less"], ["Reviewed August 6, 2017", 5.0, "Spectacular, Rewarding, Grueling", "If you prepare correctly, hiking Half Dome will be one of the highlights of your life.\n\nBut with all the lore about Half Dome and \"the cables\" it's easy to lose track of what a long, long day hike it is. At high elevation. In a way, the cables were one of the easiest parts of the hike for most of the people in our group.\n\nWhen you arrive at the base of Half Dome, you have already hiked 9 miles, gained approximately 4500 feet in altitude and scaled Sub-Dome, which everyone we encountered thought was the hardest part of the hike. Then you have to descend the cables, descend Sub-Dome and hike 9 miles back down.\n\nIn our group of 6 moms and 6 teenaged girls, 3 were pretty freaked out at the cables. 11 out of 12 of us made it all the way to the top. 9 of us thought the cables were fine or even fun. But all 12 of us thought it was a shockingly long hike. Especially going down. The mileage just doesn't communicate how far it feels.\n\nAlso, 9 out of 12 people in our group ran out of water. The ones who ran out had Camelback hydration packs and an extra water bottle, so it's not like they were skimping. I had a full gallon of water ( 100 ml bladder and two water bottles) and that was about the right amount for me on an August day with not too much sun.\n\nIf you are a fit person, I would absolutely recommend this hike. But take it very seriously. Train. Get good hiking shoes, get gardening gloves with rubber grips, bring more water than you think you might need and drink all of it, bring some electrolytes, snack all the way up and down, consider renting trekking poles.\n\nThen you will have a memory to treasure for the rest of your life.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Iconic Landmark in Yosemite", "Undoubtedly, Half Dome is the most recognizable landmark in the Yosemite NP valley. It is a difficult climb to access as a very, very grueling day-hike; much better to think of it as an overnight excursion; of course, that brings its own complications (i.e., extra gear, food, water, etc.) And, I think that with the ropes fashioned for the ascent, the experience of climbing to the top is not the same as free climbs in the Rockies or the Alps. Instead, it is much more a \"manufactured\" experience. Crowds can be thick during the summer months.\n\nDespite the downsides (the fixed double-ropes that make it more an exercise of endurance rather than skill and creativity as well as the mileage to and from the peak and the crowds), the beauty of the peak and surrounding country cannot be discounted, hence my five stars.\n\nNote that one can gain a varied perspective of the peak by traversing the Panorama Trail (9.2 mis one-way from Glacier Point). From this vantage, you can consider whether it is worth the time, effort and crowds to take on Half Dome before committing to the route itself.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Challenging but worth it.", "Train for this hike if you are going to do it in a day. Our group obtained the permits and set out at 5:30am, we did not return to the parking area until 10pm. It is a relentless uphill trek, if I were to do it again I would camp and break it into two days. Sub-dome was the most difficult part for me, steep steps and nothing to hold on to. Once you made it to the cables they were easy as long as you are not afraid of heights. Be sure you have enough water, I recommend 4-6 liters and a head lamp in case you make it down after dark. We ascended via the Mist trail and descended the John Muir. Breathtakingly beautiful at every turn, a must do with preparation.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Amazing experience", "This is the hardest hike I have ever done by far, but the most amazing as well. We hiked in July so we were at the trailhead around 4:45 and made it to the top by 9:15. I would suggest to be at the trailhead even earlier, if possible. It is so nice to hike in the shade and arrive at the cables before the masses. Bring rubber gardening gloves for the cables and wear your grippiest shoes. Trekking poles helped my knees on the long way down. If you are lucky enough to get a permit through the lottery, you must do this hike!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Unbelievable Hike", "What can I say? The entire trip was totally worth it. If you've been thinking about it, do it. If you're planning a trip down the road then start training for it, and DO IT. It was absolutely worth the long day hike. Let me also say that it is NOT easy. Don't let people who are top athletes convince you it is... For some it will be, but for most - probably not. Make sure you have prepared with exercise/nutrition a couple of months (at least) in advance. For me, the toughest part was sub-dome and getting up the half dome, but SO worth it. The hike itself didn't seem too difficult, although there are one-zillion steps. It's all about preparation. Not only Half Dome, but the beauty you see along the way is breathtaking. Although you'll be VERY tired when you're finished, it will have been worth every second. This was a bucket list adventure for me. So thankful to have completed it!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Geologically unusual", "Besides the view, it was interesting to learn that it was probable formed as a half dome, and not sheared off."], ["Reviewed July 18, 2017", 5.0, "I've got a picture of this in my office", "Half Dome...so iconic of famous Yosemite. A picture of it from Ansel Adams hangs on my wall next to me reminding me of the beauty and coolness of this sleek structure. Almost like God took a spoon and scooped up some stone and then tossed it across the valley glued to another structure....LOL\nShow less"], ["Reviewed July 15, 2017", 5.0, "Staggering", "Immense, awe inspiring, staggering, how many superlatives can I drag up? This is just something that you need to see."], ["Reviewed July 14, 2017", 5.0, "Half Dome", "An amazing feature of the valley that can be seen from many places inside the Yosemite National Park."], ["Reviewed July 14, 2017", 5.0, "Awesome, must see/do experience.", "13.49 hours, 18 miles(we parked a mile from the trail head and went off to the river, etc..) train by step climbing...path is a lot of stone/dirt steps and dirt path. Ending is spectacular!"], ["Reviewed July 13, 2017", 5.0, "Majestic", "You can't mess this up! From any position, this spectacular rock is worth the time to view.\n\nThe vista from Fat away to closer up changes with extras to see along the way: bears & deer.\n\nGet the annual pass for $80. to see all national parks. Best to go during the week and get there early. Traffic is horrendous late morning and on weekends :(\n\nThere are many side areas inside the park. If we go back we'll stay in the park at the resort as there are soooo many things to do there.\n\nThe visitor center is large with food court, grocery & souvenir stores--great for everyone!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Majestic", "There's really nothing that we can say about this breathtaking sight... everyone should see it sometime in their life"], ["Reviewed July 10, 2017", 5.0, "Beautiful Hike, but lots of Stairs", "We went up the Mist Trail and then up to Nevada Falls. By then I had seen enough steps. From there is was through Little Yosemite Valley which was nice. Surprisingly, the trail through the valley was mostly sand. After the valley, it is a constant climb with a decent number of stairs. When you get up to the should (just prior to the dome), there are hundreds of more steps. towards the top of the shoulder, I was having a difficult time lifting my legs. The cables were next and they were actually easier then I expected. Getting down was so much faster and we went down the same way we went up. Overall it took about 11 hours\n\nI would do this again, but I would make a couple of changes. Next time I will take the John Muir Trail up to Nevada Falls. I would bring more water (I brought a quart and a half) and I would stay the night in the valley to get used to the altitude (I drove up that day from sea level and did the hike)\nShow less"], ["Reviewed July 9, 2017", 5.0, "Do it!", "We backpacked to Little Yosemite Valley then did Half Dome the next day. Used climbing shoes for better traction, and roped into the cables. Watch out for bad weather."], ["Reviewed July 6, 2017", 5.0, "Hiked to the base of Half Dome on June 5th.", "My daughter and I hiked to the base of Half Dome on the morning of June 5th. We did not get Half Dome permits during the lottery, so our original plan was to hike to Clouds Rest and see Half Dome from that vantage point. But that plan was shot due to winters heavy snow and the Tioga Pass road still being closed. Unable to get to the trailhead. So we decided to at least get a good hike in and get to the base of Half Dome. Since we were not going to go to the top, we did not get up at the crack of dawn to start our hike. We still started fairly early though. It was not super busy with hikers when we hiked from our campsite at Upper Pines Campground. The water flow was very high and fast. With raincoats on for some of the mist trail, we stayed somewhat dry. It was still quite the mist. We got to the base of Half Dome around noon. There was a Ranger? stationed there, checking for permits. We did have a lady offer an extra spot on their permit to hike the cables, but we did not want to break up and risk not getting both of us up to the top. We were happy with how far we did come and knew we could finish the hike on another visit. On our trip down we decided to take the JMT part, to go around the mist trail and all of the slippery steps. That was all well and good until shortly after we departed the mist trail and got on the JMT. A big time waterfall was dumping huge amounts of water right on the trail and we got soaked. Thankfully it was hot out and we, along with our trail runners and socks, dried fairly fast. It felt good. The hike down from there was by no means easy. Our up and back hike lasted just over 9hrs. It was fun most of the time, but the last hour or so down seemed like it took forever. It was a beautiful hike and I hope to do it again someday. I thought I had plenty of water for the hike, between a bladder and 2 bottles, but I still could have had 1 more bottle. I realized at 1 point heading down, that I had a water purifier that I could take the water directly out of the river and drink from the filtered bag. Duh! So, bring plenty to drink and a lot to eat. I loved it!\nShow less"], ["Reviewed July 5, 2017", 5.0, "LOVED IT!!!! MUST SEE HALF DONE FOR SUNSET!", "Loved it! I can't believe I actually went! You must stay from 5-8pm :) half dome lights up at sunset! Great spot for relaxing, taking pictures, and being with friends!"], ["Reviewed July 5, 2017", 5.0, "Make sure you know what your in for before climbing up. need strong arms and legs.", "Also be warned if climbing with young kids like i did.. constantly praying for safety for your children until they make it to the top and make it back down safely to the bottom !!!"], ["Reviewed July 4, 2017", 5.0, "Stunning!", "Half dome practically takes over the valley floor and you can see it from dozens of viewing points. The sheer size is breathtaking and for photography enthusiasts the light gives different photo opportunities during the day."], ["Reviewed July 4, 2017", 5.0, "Bring your Lightening Rod!", "Another beautiful site in Yosemite. I only wish they would keep people off it. Dangerous place when a sudden thunder storm rolls in! (often)"], ["Reviewed July 3, 2017", 5.0, "So big you can see it from all over the valley", "It's huge, you can't miss it and when the clouds hanging over it then it clears it amazes you again with its shape and size. It stil had some snow on the top !"], ["Reviewed July 2, 2017", 4.0, "Half Dome from the Clacier point in the evening", "Though you have to drive quite a bit to reach Clacier Point, it is all worth it. The view to Half Dome is spectacular in the evening. We started from Wawona at 7pm and reached the top around 8pm - just the right time for sunset. Strong recommendation :-)\nShow less"], ["Reviewed June 29, 2017", 5.0, "Beautiful, but bring binoculars for even more!", "You can't beat the views of this natural phenomenon, but you'll see even more if you bring binoculars- we cold see people hiking and climbing. Incredible!"], ["Reviewed June 26, 2017", 5.0, "Watched the sun set on Half Dome and did Glacier Point view", "Massive formation and in awe when first set sights on. The colors of sunset on the rock is simply worth hanging around for. We did it from the banks of the Merced river near the Majestic Hotel.\nNext day, we visited Glacier Point and had many more takes on it.\nLater, I discovered that domed or similar shaped rocks are common in the Sierras. So this could be a trek idea altogether. I wonder how easy it would be to climb... after getting that permit.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Get clear view of half dome", "We were lucky to have clear view of half dome as on our 1st day visit it was not visible because of heavy fog. It's beautiful."], ["Reviewed June 19, 2017", 5.0, "Probably the most iconic hike in the US, some tips", "Pretty much every hiker in the US has heard about the famous Half Dome trail. There is a lot of things making it so well known. Stunning views of Yosemite, the lottery, the cables and the fact that Apple decided to use the image of Half Dome on their computer screens doesn't hurt either.\n\nSo a few tips if you want to go:\n\n1. Yes, you need a permit. Play the lottery, the chances to win Saturdays are skim, so try Sunday or other days. If you're local - try daily lotteries.\n2. Ideally you want to stay close, but it's hard. the camps are booked and the hotels in the parks are expensive. But you can stay a couple hours away and drive in the morning. That means you need to get up early, like 4 am.\n3. In summer it's not uncommon to see thunderstorms and rains and that means the cables will be not safe. But they tend to happen in the afternoon. So you should try to start your hike before 7 am. That also helps to find a parking spot.\n4. Waterfalls. This year there is a lot of water and the trail goes by the waterwalls. So you may get really wet and the water is cold. Consider bringing a plastic poncho.\n5. Altitude! This is a high altitude hike, so consider sun damage (bring a lot of sunscreen and UV protective glasses) and you may feel sick, so keep the food simple (sugar-based (fruits, sugary drinks) rather than fat/protein).\n6. You need non-slippery shows and gloves for the cables.\n7. The cables can get crowded, some people bring a cord and carabine so they can hook to the cable and have some rest, but unless you know how to use them - probably not worth it.\n8. The very top portion is very hard, so a lot of people leave their backpacks and go up light with a bottle of water. The squirrels will be happy to byte through your backup and take the food out. So either keep food in some tough containers or be ready to lose your food.\nShow less"], ["Reviewed June 17, 2017", 5.0, "For all to enjoy!", "No, we didn't hike it. 14 miles, extremely strenuous. Need a permit. Not for the middle aged, over weight flatlanders. However, anyone can admire it from a distance ;)"], ["Reviewed June 16, 2017", 3.0, "The joke became where is half dome", "With all of the road construction it was not easy to see half dome. Probably the best view was from glacier point."], ["Reviewed June 13, 2017", 5.0, "One of the best days of our lives!!!", "If you have the determination and stamina and a permit- GO FOR IT! We lucked out with a gorgeous day and started hiking from the Upper Pines Campground at 6am since we were day trippers. We'd been told to get to the cables by noon to avoid the crowd.\nVernal Falls is especially active this year (as are all of the falls) so we took water shoes and ponchos to pass along the falls. We were really glad we did because we kept our hiking shoes dry for the day.\nThere are parts of the trail that are super steep and challenging but there is also a flatter portion after you pass Nevada Falls, so you have a nice variety of terrain.\nRangers recommend 1 gallon of water per person. Listen to them!\nWe packed more food than we needed as well- not knowing how long the day would be.\nPulling yourself up the cables is doable because there are wooden planks across each post where you can catch your breath and let people pass. You definitely need gloves.\nWhile the permit process is tedious- it took us 3 tries- apparently there are hefty fines if you're caught at Half Dome without one. Having said that, we were amazed that we never saw a ranger until we got back to the Happy Isles Bridge at 4pm.\n\nOther than birthing our 3 wonderful children, Half Dome is probably one of my proudest accomplishments!\nShow less"], ["Reviewed June 13, 2017", 5.0, "Can't beat the views!", "A beautiful spot to see from afar and up close. I would never tire of this view. A must see and can't miss in Yosemite Valley"], ["Reviewed June 7, 2017", 5.0, "Awesome!", "We were here on a beautiful day. We were able to get parking along the road and just admire the mountain from the meadow. There were no climbers as far as we could tell, but I like that we just got to see it at its best to be admired for its sheer beauty and size.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Not being a mountaineer", "Or even particularly healthy the thought of trying to climb this remarkable monolith exhausted me. In another life, perhaps!"], ["Reviewed June 4, 2017", 5.0, "Strenuous and picturesque", "Hiked up Mist Trail. Despite staying at half dome village (aka Curry village), we drove to the trailhead parking lot, which is still more than a half mile from the actual trail head itself. Shuttle service will get you to the actual trailhead, but doesn’t run until 7AM. Do not start that late. Met some folks that started before 4AM. We were at the trail head around 630am, and didn’t get back till well after 7pm. Bring lots of water (>3l recommended, Vernal falls has last potable water to refill, only 1 mile into the 8mi one way hike), a flashlight with extra batteries. If you plan to hike the cables pack rubber gripped gloves and note a permit is required. Hiked John Muir trail back (instead of Mist trail), which adds distance but is easier and offers unique scenery of its own. Saw a bear. On the cables, decent is most easily done backing down with both hands on one cable. Plan for a ‘down’ day afterwards – it’s a lengthy, strenuous hike.\nShow less"], ["Reviewed June 3, 2017", 5.0, "THE photo spot", "Half Dome and Yosemite go together like peanut butter and jelly. You can't miss this spot when planning your Yosemite trip!"], ["Reviewed May 31, 2017", 5.0, "Look Straight Up To Heaven...", "Sit in the meadow and stare at this magnificent wall of rock. Bring some binoculars and watch the climbers. You will be among a LOT of visitors, but just enjoy."], ["Reviewed May 31, 2017", 3.0, "Too many people!", "We've hiked this twice in our lives. Once about 30 years ago when it was crowded, but not insanely crowded like it is today. We recently went back to hike this with our sons and the change was so sad. It's something you need to do at least once, but it's too crowded to do it any more often. If the park would stop advertising around the world (just stop completely), maybe that would help naturally reduce the number of visitors, but I'm sure they are addicted to the money so regardless of how crowded it gets they'll keep on doing what they're doing:-(.\nShow less"], ["Reviewed May 30, 2017", 4.0, "Awesome!", "We were staying with Evergreen Lodge and had booked the Range of Light tour. We had to go 3 hours both ways out of our way because of the road closure due to the rain but I am still glad we did it."], ["Reviewed May 27, 2017", 5.0, "WOW!", "I was lucky enough to drive by this amazing mountain on my trip to a most beautiful part of our country! I snagged a great photo of this monster. I have always seen it and read about it, and what a beautiful site to see in person! I highly recommend you add this spot to experience to your bucket list.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Great.", "It's an amazing place and the view of Half Dome is great. It's a wonderful way to spend a day. Especially if you get a sunny day."], ["Reviewed May 26, 2017", 5.0, "Popular Climb with great views", "We decided to climb up Half Dome by the Snake Dike route. We spent the night in Little Yosemite Valley after hauling our gear up from Yosemite. The next morning, we made an early start to the base of Snake Dike which was easy to find due to the well marked trail and helpful cairns along the way. The technical climbing of Snake Dike is the first three pitches. After getting to the actual dike, the climbing it self is easy. When we reached the broken ledges after the technical climbing areas, we had lunch and stripped down to work on our all over tans then hiked the 1000 plus feet up to the top of half dome. After taking a bunch of pictures and answering a ton of questions from tourists, we descended by the Cables and ran down to Little Yosemite to pack up camp and get back down into the Valley proper for our next adventure.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Very majestic", "Beautiful Rick to see, especially if you get there on a bright blue sunny day. The greenness of the valley and the grey from the mountain is awesome. Planes seem to always fly right over the centre of it as well which makes for a cool photo\nShow less"], ["Reviewed May 22, 2017", 5.0, "One of the most unique mountains in the world", "Unique and beautiful mountain, recognisable across the world as the symbol of Yosemite. The cables were down while we were in the park, but someday I hope to climb to the top of this amazing peak."], ["Reviewed May 17, 2017", 5.0, "Impressive piece of rock", "We spend whole day in Yosemite and just loved it there. Went there in the morning around 9AM and left at 9PM. The grounds are beautiful, the views stunning. We saw a bear enjoying a little meadow near the Half Dome village."], ["Reviewed May 10, 2017", 5.0, "Yosemite", "Just spectacular! Everything in this national park is just beyond beautiful. Half done is just beautiful to look at!"], ["Reviewed April 30, 2017", 5.0, "Impressive", "What an impressive mountain / rock. Unfortunately I did not had the gutz to climb the stairway to the top."], ["Reviewed April 30, 2017", 5.0, "Massive piece of granite", "okay so you're at Yosemite and you decide you want to go claim up this Rock by the chain ladder provided by the park. After all it don't look that bad. I would highly suggest you to do some reviews on YouTube of people going up and down this big piece of granite rock. You may need gloves lots of water depending on the time of year and you better be at least a little bit in shape.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Impressive Iconic Rock Formation!", "Half Dome is an absolutely massive and iconic rock formation that towers above Yosemite Valley and is best seen from both the Yosemite Valley and Glacier Point.\nIf you look closely from Glacier Point you may be able to see the adventurous Hikers climbing Half Dome using the cables!\nShow less"], ["Reviewed April 28, 2017", 5.0, "Great view", "This is not a hike for the weak or people who are afraid of heights. It is mostly up hill then downhill. Be prepared with food & plenty of water, first aid kit, hat and good attitude. It is an amazing view once you reach the top and quite an acomplishment.\nShow less"], ["Reviewed April 23, 2017", 4.0, "wonderful", "this is one of the spectacular part of the park - it is rather amazing and definitely a must if you go"], ["Reviewed April 23, 2017", 5.0, "Amazing Beauty", "Half dome is utterly breathtaking as it towers above Yosemite valley. It is just majestic and impossible to take your eyes off. We hiked up towards the base of it and it's so quiet and serene there. To be honest, the views are better from afar where you can get a better appreciation of its size and majesty.\nIn an area full of amazing sights, half dome is up there with the best of them. Captivating.\nShow less"], ["Reviewed April 22, 2017", 5.0, "You know the \"North Face\" logo? This is the real thing...", "The premiere hike in Yosemite, this hike is listed as \"extremely strenuous\" - and for good reason. Get a good dinner and go to bed early the night before this monster because you're gonna need it! The trail to the summit of Half Dome has a bit of everything..dry, damp, sand, stone, scenery, highs and lows. Be prepared for anything on this hike - Yosemite weather can change quickly. Doing this as a day hike can be very challenging. I've seen more than a few people of Sub-Dome feeling the effects of being unprepared. If you want to go all the way to the top - apply for that permit early, and don't forget it the day of!!!! Views from the top are amazing - take you time and enjoy it. This is one of those places you want to linger and reflect on what you've just done - and what is before you. If you're lucky, you will witness climbers coming up over the edge as I did. Getting up the cables can be a trick, just remember to bring gloves - the cheap rubberized palm versions are the best - you don't need expensive leather gloves. Watch your step, take your time and don't look at the scenery and climb at the same time - you'll thank me when you make it back to camp safe that afternoon. Get a big dinner and a drink - you've earned it!!\nShow less"], ["Reviewed April 22, 2017", 5.0, "Such a stunning location", "It's difficult to not just be speechless by Yosemite and the various rock formations.\nHalf dome was the first one we saw, and things just got better as the day went on.\nWe didn't have time to climb up but we spoke to some others that had who raved about it!\nNext time.....\nShow less"], ["Reviewed April 22, 2017", 5.0, "Great hike with beautiful view", "Great hike that enables a lot of great views in the valley. The earlier you start the better it is as it is a long and enduring hike and it can get very hot in the afternoon. Not recommendable for unexperienced people that are not so fit.\nShow less"], ["Reviewed April 13, 2017", 5.0, "Toughest hike we have ever done", "We did this hike in September 2016. Hiking Half Dome requires a permit. We watched lots of videos, read lots of advice and most importantly worked hard in the gym many months before hiking Half Dome.\nBest place to stay the night before the hike is in Yosemite valley. We camped in Upper Pines Campground, which is about 10 minutes walk to the trailhead.\nWe planned to get up very early, around 4 AMto start the hike. However, due to a very restless night in the campground (people arriving late, pitching tents and talking), we didn't get any sleep until 4 AM. There was no way we could hike to Half Dome without gettting any sleep.\nSo we made the decision to catch up on sleep until about 9 AM and start the hike at 10AM.\nWe knew it wasn't recommended starting the hike so late, but we really wanted to do it.\nWe decided to take the longer trail, John Muir trail which is 26.5km (16.5miles),because we knew it has a more gradual climb, rather then taking the Mist trail. We strongly recommend taking this route.Firstly, it is not busy at all,unlike the Mist trail, which has tons of people going to the waterfalls and secondly, the switchbacks are more gradual.\nThe trail rejoins Mist trail at the top of Nevada falls, where you have a great view of the waterfall. The trail will now flatten out a bit, you go through Little Yosemite valley which is a sandy trail for a mile or so. This is the only flat part of the whole hike. After this, you start going uphill again. The good bit is that this section of the trail is mostly in shade. There are warnings about bears here so watch out for wildlife. We encountered a rattlesnake here.\nThe climb will seem never ending here, so take breaks as often as you need. We just took it really slow, stopping to catch our breath. Eventually, you will reach the bottom of the Sub Dome. Your permit will be checked here. This is also the last place with tree cover, so expect to be exposed to the sun from now on. (it was a very hot day, 90 degrees F)\nHave a snack at the bottom of the Sub Dome, you will need the energy to climb it.\nLike everyone else said, you will already be really tired, but this is where the hard work begins.\nSub Dome is a series of VERY steep switchbacks for about a quarter of a mile. We had to keep stopping to catch our breath and we just took it really slow, one step by one.\nPlease note, that we are a couple who regularly work out (3 times a week) and Sub Dome completely destroyed our legs.\nAlso, this section can be quite terrifying if you are afraid of heights. At the start there are uneven stairs you follow but towards the end there are no stairs/trail at all, you just walk up the granite. I found this section very scary.\nFinally, you reach the top of the Sub Dome and you get your first view of the cables.\nWe arrived at the cables at 1.30 PM, starting the hike at 10 AM,but please note that we are quite fast hikers. Also, starting the hike so late in the day, we knew we had no time to waste and wanted to be at the top latest 2 PM.\nOnly one of us climbed the cables. Coming face to face with them, I found them terrifying, the climb looked incredibly steep. I decided to hang around at the bottom of the cables with a bunch of other hikers, who also changed their mind.\nMy boyfriend made the climb and said the beginning of the climb is not too bad but as you go further up there is a very steep section and that is the scariest part. The climb took about 20 minutes, but there was hardly any traffic there.\nJust take it easy and don't rush. Coming back down is harder than going up.\nWe started the long way back just before 3 PM. We decided to take the Mist trail so we could see the waterfalls. It was really tough on knees as you go downhill the whole time.\nWe got to the parking lot at 6 PM. It took us 8 hours to hike Half dome, including stops. It was the toughest hike we have ever done, but it was worth it too. We hope to hike it again one day.\nShow less"], ["Reviewed April 5, 2017", 5.0, "Stunning", "What a beauty! We've traveled around the world and have seen rocks in almost all shapes and sizes, but Half-Dome was one of the most interesting sights."], ["Reviewed March 25, 2017", 5.0, "An icon of the National Parks", "Easily the most identifiable image of the American west and the National Park System. Stunning in the morning sun, but incredible at dusk. Visible from the air when flying into Oakland, and is a jaw dropper up close."], ["Reviewed March 15, 2017", 5.0, "Bucket List Hike", "Seriously, DO NOT under estimate this hike. You should definitely go to the visitors center and find out the hiking conditions before you even plan on going up. After you see it is safe, you have to apply for a pass to go. These passes are given out by lottery, and you need to apply online and you will find out that night if you will get the pass for the following day, or the day that you pick. There is no guarantee that you will get a pass to go, and there are rangers that do check. They limit hikers to preserve the beauty of this hike.\n\nWe did this hike in ONE DAY, this really isn't recommended if you are an armature hiker, as you do not want to be stuck up in the mountain without a tent or supplies after the sun sets\n\nI did this hike with my boyfriend, cousin and parent - total of 4 people. We woke up by 4AM, ate breakfast and at the trail head by 5AM. BRING A HEAD LAMP or some form of light, as it will be PITCH BLACK when you start. Bring enough water, we also brought a portable water filter. Lunch and snacks. After both falls, you'll get to Little Yosemite, there is a bathroom there. That is the LAST bathroom you'll see on this trail, so either bring baby wipes and a small trash bag if you dont think you can wait to get there and back on the way up or down.\n\nGetting to Little Yosemite seemed easy, but between little yosemite and the cables is A LOT longer than you think. You will be going through the forest for a couple hours, with a lot of switch backs and stairs. Once you start getting to ROCK, you sill are NOT close to done.\n\nOnce you reach ROCK and stairs, that goes on for another excruciating amount of time. Take a break before the cables. BRING GLOVES. When we went, there were NO GLOVES at the bottom of the cables (previously people said there was a pile of gloves that are borrowed, there are not)\n\nThe cables we a little scary lol, especially in the middle it gets REALLY steep MAKE SURE TO HAVE GOOD TRACTION on your shoes! my boyfriend slipped but was able to catch himself, it can be very dangerous.\n\nGetting to the top, it was very windy (be careful of not losing hats, etc.) With the wind, it was very difficult to breathe, so take your pictures and head out!\n\nGoing ALL the way back down (we stayed in Housekeeping) was excruciating. BRING TYLENOL or some mild pain reliever, as your knees and entire body will be HURTING from the walking on hard rocks, uneven terrain. Starting at 0500, we did not get back until 1700-1800. Be sure to give yourself PLENTY of time.\nShow less"], ["Reviewed March 7, 2017", 5.0, "Not To Be Missed at Yosemite", "Half Dome looks different in the distance than when you get up close. The Indian Woman's face on Half Dome is a sight not to be missed. Get the story from the rangers."], ["Reviewed February 26, 2017", 5.0, "Be Prepared", "Requires planning and good health. Make reservations early. Check on-line for information. Don't go when thunderstorms are forecast, as there are lightning strikes. Take plenty of water and have a water filtration method if you don't want to carry it. I took 3.5 liters which was enough for my small frame for the round trip hike. I recommend toilet paper, trash bag, food, sunscreen, hat, lip protector and whatever else you think you might need. This hike can be both a mental and physical challenge and a big commitment but very rewarding and definitely something to remember\nShow less"], ["Reviewed January 30, 2017", 4.0, "Imposing structure", "Imposing geological structure which is awesome to behold. There is a demanding hike to the top, however, due to time constraints, we could only admire it from a distance."], ["Reviewed January 27, 2017", 5.0, "Just Do It! Not as Scary as it Looks", "We did this hike on the last day it was available, and couldn't be more satisfied. This hike is thrilling, spectacular, and a real adrenaline rush. Just to get there you'll probably need to do a 2 day backpacking trip which builds up the suspense. The woods are beautiful and the trail is nice and laid-back for the most part. Then, you start climbing towards half-dome. It gets steeper and steeper, and soon you're greeted with warning signs and the huge face of Half Dome, and you start to question your decision, your courage starts to flounder, and you wonder what the hell you're doing. But don't worry. At the foot of the wall you'll meet many disheartened souls who've made it all the way up there but can't quite convince themselves to climb the last stretch. Don't let them scare you. It's MUCH easier than it looks, and immensely rewarding and satisfying when you reach the top. Going down is a lot easier than going up as well. The view from the top is unreal, and completely panaramic, and you'll feel like a Greek God on Mount Olympus when you reach it! Awesome experience!\nShow less"], ["Reviewed January 12, 2017", 5.0, "Very impressive rock", "We got to see it only from a viewpoint, we didn't come close to it or climb it, but it was more than enough. Very impressive, very big rock formation. We saw it the best at Glacier point."], ["Reviewed January 5, 2017", 5.0, "Bucket-list Hike", "We left the cabins in Curry Village at 4:30am wearing headlamps and returned safely to the cabins at 5:30pm feeling wonderfully exhausted. The best part is the feeling of accomplishment once you are near the end of the cable and the rock has finally flattened out. As everyone says, being plenty of water and snacks. You'll need the fuel for the round-trip. We spent about an hour on top eating lunch and taking photos before heading back down the cables. All eight of us had permits, but they were never checked.\nShow less"], ["Reviewed January 5, 2017", 5.0, "Don't Let People Scare You", "This is a very hard, all-day hike, but you can do it. Start as early as you can stomach (4:30 am-ish), bring headlamps, wear several layers of clothes, and as much water as you can carry. We didn't \"train\" for this hike, but everyone in my group regularly goes to the gym or runs (we were 3 young twenty-something girls). It took us a solid 11 hours, but we took several short breaks and a long lunch break at the top.\n\nWhile on the trail, make sure you carefully read the signs. While we were never \"lost\" per se... we did accidentally add a few miles. But you don't need a map - the paths are well marked. People will be hiking with you, so make friends, offer help, and support each other. You'll be seeing a lot of the same people as you leapfrog up the mountain (because you'll all rest and hike at different points) and you'd be surprised how much you'll end up needing one another. The hike up is very hard - so take your time and rest often. You'll come down twice as fast as you went up, so try not to stress about time. As long as you're keeping up with most of the other hikers, you'll be fine. We opted to take the shorter, more challenging path up (The Mist Trail), and the longer, more gradual, John Muir trail down - and that seemed like the right thing to do. Don't let people scare you out of The Mist Trail. While it's true that was probably one of the scariest parts (be sure to bring your rain jacket!), it was one of the most memorable.\n\nStrong hiking shoes (with good tread), gloves, a hat, a camera, and some sunscreen are a must. I'd also suggest a banana - there were quite a few people nursing leg cramps on the way up. There are no amenities once you get past the really touristy part, so bring everything you might need.\n\nSo... what are you waiting for?! Apply for your permit already!\nShow less"], ["Reviewed December 29, 2016", 5.0, "Must do at least once.", "Breathtaking nature. The ever changing landscape as the hike ascends is incredible. Bring gloves for the cables and plenty of water."], ["Reviewed December 29, 2016", 5.0, "Great hike, amazing views", "My friend queued up outside the Wilderness Lodge at 5am to get us a Half Dome permit after 2 failed lottery draws. We didn't actually get the permit until 10am, so we had a late start to our hike. We made it to the peak by 4 in the afternoon (via the Mist Trail), by which time were the only ones there. The view from the top is incredible, and I really enjoyed climbing the cables, although it was pretty terrifying! The hike is long but the scenery is really nice. Would definitely recommend.\nShow less"], ["Reviewed December 26, 2016", 5.0, "Climb it!", "It's a long walk but, totally worth it! We climbed this on our anniversary and loved it! The cables may be a little scary at first but you get used to it. Of course, always climb only if you feel you can do so safely. Understand the risks involved in mountaineering and be willing to accept them. The views from half dome are phenomenal. I would definitely pack lots of water and food and any kind of safety gear to ascend the cables. We used lightweight climbing harnesses, slings and carabiners to provide protection. It would keep us connected to the cables if we were to slip. Be sure to climb with your permit, if you don't you actually risk a serious penalty. Wonderful adventure though and I would recommend it to anyone who can hike a long distance and climb with practical judgement.\nShow less"], ["Reviewed December 23, 2016", 5.0, "GET A PERMIT AND DO THIS HIKE!!!", "By far the most important thing to do on your trip to Yosemite! You need to have a permit to climb the cables and if you get there without a permit and a ranger is there checking, you will be upset you just hiked that far and have to turn around! The wasn't a ranger there when we went but we got to Sub Dome around sunrise. We left the valley floor at 1:30am with intentions of making Half Dome for Sunrise. Poor trail markings and maybe a bit of navigational errors caused us to miss it by 45 minutes. Breathtaking views! This is a tough climb but so worth it. Start early! When we were coming down from Sub Dome, the trail was filling up with uphill hikers. We had the cables to ourselves. Not sure how safe it would be with uphill climbers and downhill climbers wall to wall. Verizon service at the top so you can share your views with the world!\nShow less"], ["Reviewed December 23, 2016", 5.0, "A true crown jewel", "Being one of the crown jewels of the national park system, Yosemite proves itself to be just that. The day I was there was very busy day. So patience is the key."], ["Reviewed December 21, 2016", 5.0, "Must See", "The main reason we went to Yosemite (and probably yours too!) Half dome can be viewed best from either the valley or from glacier point. Staggeringly beautiful"], ["Reviewed December 20, 2016", 5.0, "Beautiful creation of God", "It was spectacular to see this specially after reading so much about it. Managed to see Half Dome from different- different view points. You wont be able to stop yourself from clicking more n more pictures. Hats off to people who dare to hike this mountain!!\nShow less"], ["Reviewed December 14, 2016", 5.0, "Bring gloves and harness for cables", "I bought gear from REI so my 13 year old would feel comfortable on the cables. About 1/3 of the climbers use gear. Many of the folks without gear would look at us and comment that they wished they had thought to use harnesses. I saw some guy trying to tie himself in with shoelaces! Daughter loved the hike and felt a great sense of accomplishment afterwards. We had permits, although there was nobody in authority checking. It is a long day, so bring plenty of food, water and sunblock.\nShow less"], ["Reviewed December 2, 2016", 5.0, "Challenging Hike to be taken Seriously", "It's one thing to appreciate Half Dome from the valley, but it's totally something else to obtain the permit and hike to the summit. When I hiked, you did not need a permit but now you do. Therefore, if you want to accomplish this goal, you must plan ahead. You should also train for the experience and prepare your pack. It will make for a better, more enjoyable experience. This is a difficult hike. It takes a full day and when you think you are done, you then need to ascend the granite steps and switchbacks to the cables and walk the cables up to the top.\n\nThe photos do not do the experience or the grade any justice. In fact, if I were to do it again I would buy and pack a harness and \"clip on\" to the cables. It's not me, it's being taken out by other people that I'd worry about. Just an added safety measure.\n\nThis hike is not a joke. I've had acquaintances who have needed assistance off the mountain because they did not prepare. Take this seriously. Prepare.\n\nThis hike is a great accomplishment and a unique journey. If you can, check this one off your bucket list.\nShow less"], ["Reviewed November 25, 2016", 5.0, "Breathtaking", "Absolutely gorgous, so totally overwhelming from somebody coming from Australia, a must see visit for anybody, even the kids were taken back."], ["Reviewed November 20, 2016", 5.0, "All part of the magic", "One of the unique natural structures in the Yosemite National Park, the half dome is to be admired and appreciated as part of your next trip through the valley."], ["Reviewed November 15, 2016", 5.0, "A great nature monument", "I was in hurry, so didn't climb on the summit, but a view is enough. It's a giant masterpiece of nature which looks unnatural by it's shape :) Definitely worth of seeing."], ["Reviewed November 14, 2016", 5.0, "Literally breathtaking", "I am 61 years old and this is the hardest thing I have ever done but it was worth every step just for the bragging rights let alone the amazing sights that I would have never seen if I hadn't done it. 53,000 steps to the very top and back on my fitbit.\nShow less"], ["Reviewed November 11, 2016", 5.0, "WOW", "Hard to miss when entering the park. But then, on your first visit, it is like you are thrown into the eye of the storm. Everything at once. Did not climb. Only viewed from the low grounds, and very satisfied. What an amazing sight."], ["Reviewed November 9, 2016", 5.0, "Beautiful, thrilling hike", "I did the Half Dome hike solo in September. It is still very fresh in my mind because it was such an exciting experience! Here are some helpful tips:\n\n1. It is important to have previous hiking and/or some sort of cardio experience to have the endurance and strength to do such a long and strenuous hike.\n\nMy training involved climbing two 14ers in the previous months and running 4 times a week including 8-10 mile runs once a week in the several weeks leading up to the hike. I also did yoga twice a week for upper-body strength training.\n\n2. Have gloves and shoes with good grip for the cables.\n\nI used the gloves Mr. Half Dome recommended- less than 5 dollars \"Atlas Gloves.\" I got a few small blisters that went away within hours of the cables which I thought was pretty good considering my extreme death grip.\n\nSo, I had good gloves, but apparently not good enough hiking shoes. I was fine going up, but coming down was was scary- basically slipping and sliding from one plank to the next while hanging on for dear life. Thank goodness for the gloves!!\n\n3. Bring lots of water and then another extra bottle more than you think you need.\n\nI took less than recommended because I thought I could ration it and be able to carry less weight. I ran out of water completely on my way back with about 6 miles to go. I refilled at Vernal Fall before the last 2 miles so I avoided dehydration, but have never been thirstier in my life.\n\n4. Take the John Muir Trail down.\n\nI had planned to take JMT down but since I had run out of water I thought I should take the shorter route of the Mist Trail, the same way I had gone up. Well, I bet it took me even longer because I had to go so slowly due to steep rock stairs and slipperiness.\n\nDespite my mistakes, my hike was successful and a great experience! I made it up to the summit with no real issues and got to enjoy the view of a lifetime.\nShow less"], ["Reviewed November 1, 2016", 5.0, "The view from the top is unparalled", "You now have to pull a permit to climb the cables (picture you see is of the cables to the top). I have been on top 10 to 12 times. They used to let you camp on top."], ["Reviewed October 31, 2016", 5.0, "Amazing hike to get to the top", "This is a trail that is definitely not for beginners. My wife and I started around 8 AM. The walk from the parking lot to the trail head was almost a mile. It doesn't take long to start climbing. We took the Mist trail up and all I can say was this very hard. The amount of stairs is amazing. You climb very steeply. Its not many miles to the top of Nevada Falls but the steps are a killer. I will say it was worth the hike its just exhausting. There is another way up if you want to skip the steps of the Mist Trail. The John Muir Trail is a lot easier. You don't climb as steeply as the Mist Trail. Once your done with the falls you do get a little bit of a break. The terrain is relatively flat for about 1/2 mile as you follow the Merced River. Once you reach Little Yosemite Camp grounds you start to climb again. You will climb up switch backs for the next few hours. Its a nonstop climb for the next 3 or so miles until you reach the sub dome. You need a permit to continue up to the cables. There is a park ranger checking them The sub dome is also a tough climb but once you get to the top of the cables the view is worth it. We ate lunch before we tried to climb the sub dome. We needed all the fuel we could get. I will also say make sure you have enough water with you. We drank nearly two gallons of water. If it was much hotter we would have needed more. The high for the day was only 52 F. It was around 28 deg when we started. It took almost 9 hours to make the round trip. I have to say this was one of the best hikes I have ever done. I look forward to bringing my kids when they are older.\nShow less"], ["Reviewed October 24, 2016", 5.0, "Come prepared and you will have an awesome time!", "Things to expect:\nThe nearest parking lot is super far to the trail entrance like a mile or more! The nearest parking is the Mist Trail parking lot and it gets filled up right away.\nYou will take lots of breaks so start early, based on my Strava I was active for 8 hours and non active for 4 hrs, meaning I took 4 hrs break?! which didn't even felt that much to me. But we are all in a different physical fitness state, if you're curious, I'm 33 yrs old and only started working out a month prior to this hike, only worked out for an hour everyday doing 30 mins of cardio and 30 mins of stair master. My longest hike was 6 miles just to break in my hiking boots two weeks before half dome. So yeah, I am not the most athletic, some could definitely do this whole hike in less than 12 hours. Don't forget to also take your time in between and enjoy the scenery since that is the whole point.\nIf you take the Mist Trail, it is mostly all stairs, you will pass two waterfalls the last one is called (Nevada Falls) after that you get a break from all the stairs then you will start the climb again when you reach sub dome. After sub dome then you get to do the big finale which is the cables.\nLooking at people doing the cables will be very intimidating to the point where you want to turn back and not do it so don't contemplate for too long. Eat a small snack, take a caffeine shot put on your gloves and just go. It is a lot more intimidating from a far. It's not so bad once you get up there.\nGoing down the cables, go backwards and put pressure towards the cables. Going down is easier than going up, unless there is a hold up.\n\nWalking back to the parking lot is going to be a b*$@\n\nTips:\nI took 3L and 1 large water bottle and still ran out. So bring plenty! and keep snacking, eat every two hours. bring sugar gels or cliff caffeine shots. Take caffeine shots before doing the cables, it helps. Bring salty nuts and trail mix.\n\nI highly suggest taking the Mist Trail going up and coming down, it saves you 4 miles going back. The Mist Trail is a lot of down hill staircase but your trekking poles should be able to help you with that.\n\nIf applying for permit, have you and your partner apply at the same time. It increases your chances of getting one.\n\nDrive towards Glacier Point and stop at the Washburn Overlook and you will spot the two water falls and the half dome, basically the whole entire hike that you just completed!\n\nGood luck! You won't regret it! It is definitely an experience of a lifetime!\nShow less"], ["Reviewed October 23, 2016", 5.0, "Awesome experience", "Started from 7am and ended at 7pm. A 12 hour hike. Different terrains made it interesting, but was exhausted at the end. Be sure you are in perfect physical condition before you hike it. the view is spectacular."], ["Reviewed October 22, 2016", 5.0, "Sweet", "The key to half dome is to view it from a few different angles, from the meadows, the valley, and glacier points and the roads around the valleyy"], ["Reviewed October 18, 2016", 5.0, "Quite Awsome", "Hats off to those reviewers who climbed this monster. My desire was to see it in the \"flesh\" and it did not disappoint. If you can find a good valley floor viewpoint it is spectacular - just move around and you will get the perfect photo. Better in real life than any photograph.\nShow less"], ["Reviewed October 17, 2016", 4.0, "One of two iconic rock formations in Yosemite", "Capable of being seen from numerous places within the park. Try to be well inside the park (just past the tunnel view) at sunset for phenomenal view and photos"], ["Reviewed October 17, 2016", 5.0, "Half Dome", "Only observers. We saw Half Dome from differernt angles. From the High Country on Taoga Pass you can see the people ascending to the top via the cables. You do need binoculars. You need a permit to climb and it is very strenuous hike in and onto the top. In my next lifetime I want to do this I am to old. We saw Half Dome from Glacier Point. Glacier Point is a drive but worth the time because it give you an entire different vantage point. A look down into the valley from above too. Then we saw it from our hotel window. Perfectly framed by the trees. What a sight to see. Have fun!!\nShow less"], ["Reviewed October 17, 2016", 5.0, "Amazing!", "To look up from the valley to this spectacular rock is breath taking! There are many fantastic views of Half Dome from the valley to be discovered. The closest view is from Glacier Point, this is where most set up for sunset photographs of Half Dome.\nShow less"], ["Reviewed October 16, 2016", 5.0, "A must for outdoor enthusiast!", "I will never forget my hiking/climbing experience of Half Dome. It was difficult but you're rewarded with unbeatable views of Yosemite National Park (valleys and peaks). For some tips, eat breakfast before or within 2 hours of the beginning of hike; pack a sandwich (with protein) for lunch on top of Half Dome; bring rubberized gloves when tackling the cables (there are gloves up there but you can't be sure if there would be any when you got there); trekking poles are good for stability for the rest of the hike; take John Muir Trail on the way to Half Dome if hiking in the dark (less tricky than Mist Trail and can conserve energy); be respectful and keep your trash; and breathe and enjoy the experience.\nShow less"], ["Reviewed October 15, 2016", 4.0, "Spectacular", "It is an amazing sight on what was a fantastic day. To look at the mass of rock that dominates the landscape was rather humbling."], ["Reviewed October 14, 2016", 5.0, "Beautifu site", "I had hiked to the top when I was much younger, but as an 83-year-old I was content to admire it from afar. And it is truly admirable. Yosemite is one of the prettiest area in the world, and Half Dome is the icing on the cake.\nShow less"], ["Reviewed October 13, 2016", 5.0, "Incredible accomplishment", "Climbing to the top of Half Dome was a bucket list item for us and is well worth the effort. It is incredible to view Yosemite from the top. We made it a multi-day event by hiking to Little Yosemite campground and then doing a shorter day hike from the campground, to the top, and back. We live at high altitude, were well prepared, and it was still a very difficult hike for us. We hiked up the Mist Trail with our packs to the campground and while it was beautiful we learned that backpackers should go up via the Muir Trail; climbing the Mist Trail with 35+ packs is tough. We were more than ready to set up camp and rest after that portion. The next day was a relatively moderate hike. The cables get most of the attention, but the climb up the granite of sub dome was the hardest part. It should not be treated lightly. Definitely bring gloves for the cables and expect delays as people inch their way up and down. The first 14 miles of the hike is all uphill and strenuous, but the last portion up the cables is all about upper body strength because you literally pull yourself up the steep granite surface. We climbed at the end of the season and though we had permits there was no ranger checking for them. The beauty of Half Dome is evident from every viewing spot in the valley, but it achieves a more profound beauty when you experience it close-up. Don't forget that after to reach the top you still have to hike back down the mountain.\nShow less"], ["Reviewed October 10, 2016", 5.0, "2nd time to the top!!", "When we were putting together a roadtrip for the NPS centennial we had to include Yosemite & its gruelling but awesome Half Dome hike! This was our 2nd time to get up there & it never disappoints. It was very hot in the valley the week we visited so we chose to start hiking at 4am to get a lot done before it heated up! This was a great decision as we made it to the cables around 10am & they were pretty quiet with a great chatty crowd of hikers. When we came down around 1pm it was getting very busy with lots of people not knowing cable etiquette.\nAgain we chose to go up & down the mist trail making the hike around 15 miles. Altogether it took us around 11hours hiking with an hour & half up top!\nAwesome hike but now having done it twice, I'll probably move onto other long valley hikes next time.\nShow less"], ["Reviewed October 7, 2016", 5.0, "Everybody loves Half Dome", "I would love to hike Half Dome - I like to think one day. In the meantime, I am loving seeing it from as many different angles as I can. My favourite, still, is on the drive up to Glacier Point. That first glimpse. The sight of it has been etched into an intangible part of me. But, in truth, it's awesome from anywhere and everywhere. See it from the valley floor and see it from Sentinel Dome.\n\nBest advice, find a quiet place and sit with it a while.\n\nPS. If you have never seen it, check out Alex Honnold's free-solo climb of the face of it. It will blow your mind.\nShow less"], ["Reviewed October 3, 2016", 5.0, "Simply Amazing", "We decided to hike half dome in a day in late August of 2016. We stayed outside the park in Groveland (approx 1h) and drove in in the morning around 5am. We began our hike on the Mist Trail at about 8am. The hike is very long and is very strenuous at times. We made it to Sub Dome in about 4 hours. Sub Dome and Half Dome are no joke. If you arent in shape or arent used to hiking I wouldnt even recommend taking this hike. You need gloves for the cable section of Half Dome. This part of the hike is pretty dangerous for your average hiker, but once you make it to the top the view is worth the struggle. We made it back down to the valley floor in approx 10 hours round trip hiking. I believe it is about 20 miles up and down. We were gassed! So worth it though. I recommend wearing a CamelPak with at least 2-3L of water and bringing food. It will be a long day! Youre pretty much on your own once you leave the valley floor so be prepared for anything! I wouldnt recommend hiking half dome in any type of weather i.e rain, snow, severe wind as it is very dangerous at the top. If you slip you will fall far and mostly likely injure yourself severely. If you fall off the cables you pretty much will fall to your death, no joke.\n\nAlso you need a permit to hike the cable section which you can apply for on the parks website.\n\nOverall, this was one of the longest and toughest hikes I've ever completed but I would do it again and again just to be at the top.\nShow less"], ["Reviewed October 2, 2016", 5.0, "Stunning", "We drove to Glacier Point to see Half Dome. Lots of good vistas along the road to take pics. Arrived at Glacier Point and the views of Half Dome and the valley's are just breathtaking. The had a managed fire in the valley the day we visited, which made for some very interesting, but still beautiful pics. Enjoyed watching the wildlife and going to the gift shop. Fairly long drive, slow speeds, but well worth the time.\nShow less"], ["Reviewed October 2, 2016", 5.0, "Impressive!", "The unusual geologic shape of Half Dome is a thing of beauty. I assume that many people have climbed to the top, but it's much safer -- and enjoyable -- to just admire Half Dome from a distance."], ["Reviewed October 1, 2016", 5.0, "Hardest yet most rewarding thing I have ever done", "Just went to Yosemite and drove up to Glacier Point. Reminded me of the hike to Half Dome 10 years ago. It was a long difficult hike for me but worth every painful minute once I was standing on top of the Dome. You need to get a permit now to go up there. Not sure the process but make sure you get one before trying to hike it\nShow less"], ["Reviewed September 30, 2016", 4.0, "Viewed from Glacier Point - Maybe someday will attempt to climb!", "Glacier point is the best view - great uplifting talk by ranger there on how she climbed Half Dome. Should also be a wonderful sight during full moon. Mirror lake has a good view but not as spectacular."], ["Reviewed September 29, 2016", 5.0, "Fantastic site", "The view from the Yosemite Valley floor are amazing as from the top at Glacier Point. Pictures do not do justice."], ["Reviewed September 29, 2016", 4.0, "Awesome !", "Very nice mountain, I was on the Viewer point just in front to Half Dome and was very impressive, not recommended for people with vertigo."], ["Reviewed September 28, 2016", 5.0, "Awesome", "We weren't in Yosemite long enough to hike or climb Half Dome this time but I already know I'll be back to do just that. Half Dome is an awesome rock and I did gaze up at it longingly on this trip and explore the base but I am just itching to go back and climb it.\nShow less"], ["Reviewed September 28, 2016", 5.0, "Worth the effort", "I was able to do a hike from Glacier Point to Half Dome this past weekend and it was an amazing experience. We camped below Half Dome and left our camp at 3:45 and were up on Sub Dome at sunrise which was spectacular. The climb up the cables onto Half Dome wasn't the hardest or scariest part of the hike though. Getting up the granite \"steps\" to Sub Dome was far more nerve wracking for me. Memo to those who are avid hikers and are thinking about doing this. We saw many people making their way up with canvas shoes and light running shoes on. Wearing shoes with a good grip will make your climb a lot \"easier\" for you...probably safer too. Also, if you don't have a permit you may find it was a lot of effort for nothing if the Ranger is there asking for them.\nShow less"], ["Reviewed September 28, 2016", 5.0, "Be ready!", "This is a must, it is very hard to do (imo) but very worth it. Be ready to walk and walk and walk! you will be begging for a bed, but we loved it"], ["Reviewed September 28, 2016", 5.0, "Memories", "My wife and I had a fantastic view across the valley from Glacier Point of Half Dome. The views are priceless."], ["Reviewed September 27, 2016", 5.0, "One of the best hikes ever", "Half Dome is one if the elusive feather that you would want in hiking crown.\n\nHike: The trail is long, can be shorten down using Mist trail instead of John Muir trail, however this trail is very steep. We went up using Mist trail and took John Muir trail on our way down. It's especially useful, if your knees are complaining.\n\nDifficulty: Extremely strenuous, especially if you are a new hiker.\n\nPrecaution: Take at least 4 liters of water with you and have a water purifer with you, so you can refill at stream near Nevada fall (Do not fill water without water purifer). from the fall). Have ample amount of food and head lights are a must. One of our friends are felt had extreeme knee pain while ascending and we had to hike down in the dark.\n\nShow less"], ["Reviewed September 26, 2016", 5.0, "Magnificent", "Get up the trail early - I mean really early ~05.00 or so. Esp if you don't want to end up part of a long procession through your day."], ["Reviewed September 22, 2016", 5.0, "Ticked off bucket list", "Since I visited yosemite last year, hiking half dome has been on my bucket list. I was delighted to achieve this ambition this summer.\nI applied in the march lottery for a permit and was gutted not to get one. Luckily I was staying in the valley for 5 days so I had plenty of chances with the daily lottery and got one on the second attempt. There's plenty of info on the NPS website on how to do this.\nOnce I'd got my permit I made sure I was prepared (I'd been doing research for months in advance). I had a camelbak with 2 litres in, a 500ml bottle of water and a 500ml Gatorade. So 3 litres of fluid and I used it ALL! Make sure you come prepared! There is no more filtered water after the vernal falls footbridge, which is only about 1 mile into the trek. I filled up here on the way up and way back, so probably consumed about 4 litres total and could probably have done with more. I know some people bring filtration devices with them. Other than fluids, I had loads of snacks and a full lunch to eat at the top. I also had a compass just in case, my phone, solar power charger, head torch, torch, gloves with rubber palms, energy gels, go pro, hat and suncream! Like I said, be overly prepared!\nMy day started at 4 am for breakfast and I left at 5 as I wanted to be back for lunch. The shuttle isn't running at this point, so I walked from curry village to the trail head at happy isles, which I'd estimate is about a mile. It was dark until about 6am, so I was walking the trail in the dark up to the top of vernal falls. Was spectacular seeing the moon set and and sun rise!\nI went up the mist trail on the way up and it was almost deserted (used John muir on the way back as the mist trail would have been very busy). There are then toilet facilities at the top of the falls.\nIt's fairly easy to follow the trail, just look for what looks like the most obvious route, and when you've crossed the footbridge in between vernal and Nevada falls, if you're not sure, just just take the left(ish) route.\nYou're given a little respite from the incline when you get to little yosemite valley, which is about half way. Here you walk through the woods, which is a bit sandy, so stick to the side to avoid wasting energy. You then weave up through the woods and eventually break through the tree line. I saw more people here as they camp over night in little Yosemite valley to give themselves a head start.\nNext is the switch backs up the subdome, which I found hard work! The reward is that you get to see half dome in all its glory. The 360 views are quite ridiculous too and some of the best and most awe-inspiring I've ever seen. Take a little breather if you need to and get those gloves on ready for the cables, even with gloves I still got blisters and calluses on my hands. If you do forget them, sometimes people leave old ones at the bottom of the cables, but I wouldn't rely on that. I wore trail running shoes and they were just about sufficient for the steep and smooth granite surface. I'd imagine trainers wouldn't cut it and hiking boots would be best.\nAs it was still early, there were only a handful of people on the cables, however it's important that you're sensible around other people on there - give them time, don't rush them and make sure you manoeuvre around them carefully if necessary. Do not go up there if it's raining or could rain, that's very dangerous and there is a sign explaining this. Once you reach the top, you realise the sheer size of it, its is HUGE. So huge in fact, I put my bag down, went for a wander and couldn't find it again! Spent at least half an hour looking for it, so be careful. Super views of Yosemite valley and glacier point from up here. I spent a while relaxing eating my lunch ready for the return trip.\nGoing down the cable is HARDER! I went backwards/sideways. With both hands on the left cable I lead with my left foot sideways and took the pressure on that and eased/shuffled/slipped my way down. I hate walking down hill, so once off the cables and off the subdome I walked/ran whenever I could to maintain the momentum and save my knees. Worth noting that the nearest toilet on the way down is at the top of Nevada falls. Taking the John muir trail down seemed to take forever.\nI got back at 12:55PM so achieved my aim of getting back for lunch. Obviously the shuttles were working by this point so I could take that back to curry village.\nSome people take 10-12 or even 14 hours to do this hike, however I was only travelling for about 6 and a half hours, so you can do other stuff for the rest of the day too. This kept me out of the sun for too long too!\nBefore I forget, when I got to to cables (about 8:30AM) there was no ranger to check permits, however when I was heading down, he was there at the base of the subdome to check, a printout or a screenshot on your phone is fine.\nWith my additional walk at the start, wandering around a lot and taking the John muir trail back down, the 15-16 mile hike turned into a 20 mile hike. You don't need to be superman by any means, but at least have a basic level of fitness.\nSuch an adventure and would do it again in a heartbeat.\nShow less"], ["Reviewed September 21, 2016", 5.0, "Amazing", "We started our morning at 5:45. Hiked in the dark until daybreak. Among others which was really cool. It was a long and grueling hike but worth every minute. We took the Mist trail up and the John Muir down. I personally didn't hike the sub dome or cables due to my fear of heights but 4 in my group did. They are still talking about it today. Highly recommend the hike if you're up for it\nShow less"], ["Reviewed September 21, 2016", 5.0, "Most awesome thing I've ever done besides getting married having kids and accepting Jesus in my heart", "I was not fully prepared for the idea of hiking half dome but thankfully I was in shape. 6 hours of 5000' elevation gain over 8-9 miles which on paper is possible ...many do it in two days but alas we did it in one. There are many hours of uphill grueling grind and then moments of flatlands ... It is so beautiful and you will take lots of pics. After about hour 5 and you're tired and ready to give up you round the corner and the cables come in to view. The next hour though is the toughest. You climb sub dome and your legs are fried and then get to the cables and use up all your grip strength... Nobody clips in as you would have to clip and unclip on the cable too often but man I'm surprised you don't have to clip in ... It's awesome on the top with amazing views and great photo ops. FaceTime your friends if you have Verizon it's a great signal! Ok you need to get down... It took about 5 hours down. We went slow and had great convos ... Don't get hurt going down because your body is tired at this point ... Just take your time and watch your footing. I saw many shapes and sizes, not sure who all made it but many were struggling. If you are are afraid of heights the cables may be a no go for you but would suck to hike 5+ hours to find out you can't finish the last 30 minutes! I met young old women men who did not do the cables as they were too scared . Keep that in mind. Pack 4 liters of water at minimum. I brought Gatorade and about 3000 calories of different hiking foods. Have fun be safe take amazing pictures ... Oh and you need a permit to climb the cables ... Lottery system\nShow less"], ["Reviewed September 19, 2016", 5.0, "Prepare to Be Inspired", "Ascending Half Dome can be accomplished by just about any one - but prepare to be challenged on your way to the top.\n\nThe hike up Half Dome trail gives the lungs a workout, and the sub dome switchbacks may make you second guess your ability to summit this majestic Yosemite landmark.\n\nOnce your reach the cables, don't sit and ponder whether or not you can reach the top of Half Dome. Just put on some gloves and start going. If you think about it too hard and don't climb to the top you will regret your decision because the views at the summit are incredible.\nShow less"], ["Reviewed September 15, 2016", 4.0, "Good Glacial Point view", "The view of the half from glacial point is good. We could see the valley. The ranger explained that the solid rock was formation with follicles from the bulge of lava."], ["Reviewed September 15, 2016", 4.0, "Unique Rock Formation", "Fun to see and learn about. Didn't climb it but got good photos from different parts of the park. Is a must see when you are there."], ["Reviewed September 15, 2016", 5.0, "Half Dome hike", "This is a very long and strenuous hike for one day. We start are hiking at 6:00 Am and got back at 5:30 pm. We started at Happy Island this was paved to Vernal Fall this is your last chance for water.1. 6 miles. For Half Dome recommend 3 to 4 liters of water. Then the Rock stairs start up to Nevada Falls around 5.4 miles from start. You will hit the John Muir trail. Dirt and rock stairs. Up to Half Dome. There is a cable climb the last 400 ft up you should have a pair of gloves with rubber although there are a bunch in a rock next to the cable climb. This requires arms and legs strength. The views from the top is fantastic and well worth it. This was a 18 mile round trip took up 10 1/2 hours. Lots of beautiful sights. If you are a backpacker I recommend breaking up the trip.\n\nShow less"], ["Reviewed September 14, 2016", 5.0, "Majestic", "From any angle the half dome is instantly recognisable, it just above the landscape from nearly every vantage point. Seeing rock climbers scale it from every face is astonishing."], ["Reviewed September 13, 2016", 5.0, "Massive Rockformation", "It is breathtaking to look at this gigantic rock formation. Half Dome takes on a special glow at sunset. It is a sight to behold!"], ["Reviewed September 13, 2016", 5.0, "Half Dome Climb", "I completed Half Dome as part of a week long backpacking trip. I started my hike on Sunday and made it to Half Dome on Thursday. We averaged about 10 miles a day, camping out each night along the way. We set up camp Wednesday at Sunrise which placed us about 4.5 miles from Half Dome. The 4.5 mile hike to Sub-dome/Half Dome was fairly easy. (However at that point, anything seemed easy without a 50lb backpack on! I only took a day pack with water, a camera, snacks and some gloves.) I had been anticipating this hike and was somewhat nervous about the Sub-dome climb--more so than Half Dome itself. Sub-dome was tiring, but not scary at all. It is narrow with a lot of steps. I just focused on the climb and was at the base of the cables before I knew it. When we arrived at the cables, only a handful of other climbers were there and they were about 3/4 of the way up. We were able to get right on the cables and start climbing. Admittedly, I didn't look around a lot as I climbed. I really just focused on getting from one board to the next. Every time the person in front of me moved up a board, I moved up a board. We kept a decent pace, resting briefly on each board. Next thing you know, we're at the top admiring amazing views! We stayed at the top for awhile and then it was time to head down! Eeeek! This is what I was most nervous about! I decided to use a deadlift grip* on the cable (*left hand underhand grip, right hand overhand grip) and sort of go down sideways (somewhat facing the cable and somewhat facing out). It was a piece of cake! I actually took time to look out and admire the views on the way down which I didn't do on the way up. Going down was the same as going up...when the person in front of me moved to their next board, I moved to mine. Good flow. I was disappointed when I made it to the bottom. I was not ready to be done.\n\nYou definitely need good gloves. I used my mountain biking gloves. I would imagine your hands would get burned from the cable without some type of gloves on.\n\nGood grip boots are good too. The good grip helps going up, but coming down, you really end up sliding. Which is why the gloves are also important!\n\nHaving good upper body strength will definitely help. More so than leg strength, having good ankle flexibility will be important!! Your ankles are in full flexion climbing up and full extension and supinated/pronated coming down! Work on calf strength and ankle flexibility!\n\nFor those that complete Half Dome as a day hike, I can imagine it may be more taxing doing the 16+ mile round trip hike. Since I was backpacking and set up camp only 4.5 miles away, I only had a 9 mile round trip hike.\n\nIt's definitely worth the check mark on the bucket list! I would do it again.\n\nI think anyone can successfully complete Half Dome with some simple preparation.\n\nNow go do it!!\nShow less"], ["Reviewed September 11, 2016", 5.0, "Half Dome", "Yes, I got to the top. Yes it was hard. Scarier than I expected, but worth every second/step.\nThe hike from the valley is a long one - over 8 miles one way. And of course it's up - 4800 of climb along the way. But despite that elevation gain, there were plenty of moderate parts to recover. The famous cables get all the attention, but for me the worst part was the climb up the sub dome. It's unsupported and very narrow. I was worried about being too tired to come back down safely, but the return trip had better footing than expected (and I was still on an adrenaline high), so there were no problems. I would not attempt this if there were any moisture at all on the trail.\nThen the cables. The wood rails between the metal poles holding the cables give you an opportunity to rest, but your hands/forearms will be screaming. Was able to work my way to the summit at my pace, but the crowds arrived while I was up there and it took forever to get back down. The views are, of course, amazing. But they are just as great from the sub dome or even before that. So if courage fails you, it's still worth it.\nThe great thing about hiking in Yosemite is the variety you experience on each hike. So thoughout the eight miles, you're constantly seeing different stuff. You go through Little Yosemite Valley (or you can camp there making this a multi-day hike but with more weight), you pass Vernal and Nevada Falls on the grand staircase, and you pass through numerous types of topography. Be sure to use the Muir trail instead of the Mist trail. One is wide scenic, the other is a million steps that keep your focus pinned to your feet.\nIf you can get the necessary permit - do it.\nShow less"], ["Reviewed September 10, 2016", 5.0, "Great Hike - Some Tips", "It is a very rewarding hike – filled with waterfalls, cables, and outstanding views. Some suggestions –\n\n1) Need a permit – either months in advance or as the “daily lottery” which is actually 2 days ahead – for example, for the daily lottery – if you want to do a day hike on Saturday, you need to put in your reservation starting 12:01AM on Thursday. If you can manage it – fall or spring mid-week will likely give you a high chance of success. There’s a separate process if you want to make this part of a backpacking trip – example – overnight in Little Yosemite Valley – the direct overnights from Glacier or Happy Isled are extremely popular – you likely will have more success if you make it your second night if staying the first night elsewhere.\n\nSome parties going up the dome don’t seem to have permits- we hiked on a Saturday in September and ran into two parties w/o permits- luckily the Ranger was not present – we gave them our permit on the way out – although in retrospect this was a bit risky as it has your name and address.\n\n2) Leave early – we left at 5:30 am – was at the cables by 9:45 am – light traffic and not too hot (this was mid September 2016). Saw lots of crowds on the way down when we left at 11:15 – plus the day got a lot hotter.\n\n3) Water – the other reviews and recommendations are right – best to have about 4 Liters per person. However you’re trading a lot of weight for this necessary water – one or two options as a workaround– bring a water filter – you can filter water at Little Yosemite Valley – so possibly you could go down to 3 liters then counting on this refill. You could also “stash” a bottle in the forest below the sub-dome (above little Yosemite) if you want to reduce weight and come back to it later.\n\n4) Half Dome Cable needs – gloves, ropes and carabineer to lock in. If you want an extra sense of security – do recommend bringing a rope / carabineer to lock yourself into the cables as you climb – my 15 year old did this and felt much more comfortable on the route. Gloves – my kids did this with your standard kitchen rubber gloves you can buy at Target– no problem – there’s also a pile of gloves at the base of the dome. Its advised to bring gloves – however on my way down I took off the gloves and just used bare hands (actually stood on the outside of the cables and “rappelled” – personally felt more secure holding onto the cable with my bare hands over gloves).\n\n5) The hike – it is a very long day and can be very difficult based on your fitness and experience. Hiking with a 13, 15, and 19 year old – left at 5:30am and was on top by 10:15 (4:45 hiking time). For me personally – the two most difficult portions of the hike (a) the stairs below Vernal Falls – very steep at 6am – takes your breath away and knowing you had still 6 miles to go was disheartening at the time, and (b) hiking through the forest above Little Yosemite Valley before the sub-dome – this portion of the trail seems to go on forever and does not have the visual highlights of the other trail (or a view of ½ dome with the anticipation of getting closer). As to the sub dome – my advice is to set a comfortable pace – hike a certain number of steps and stop to rest, then repeat – in manageable “chunks” the sub dome is very doable (despite the visual prominence) – As to the cables – it's a lot of upper body strength – I was dehydrated but not tired – my kids were very tired – its likely you will be waiting regardless due to crowds so as long as you are comfortable with your grip and shoes – shouldn’t be an issue.\n\n6) Shoes – advise using cross trainers or hiking shoes - check the tread– however all three of my teenage kids wore running shoes (one with a very worn out tread) and managed it – although more tread and support would have helped.\n\nOverall a very satisfying hike – not as hard as Whitney (or Shasta) – but the trip has a lot of payoffs (outstanding views from the top – passing two waterfalls – the uniqueness of going up the cables).\nShow less"], ["Reviewed September 9, 2016", 5.0, "Part of Lasting Adventures Trip", "Personally, this scared me half to death but it was still a great experience (other people had no issue doing this, some were more unsettled than I was, it's unique to each person). Our guides were great at walking everybody through the techniques and coaching us through to completion. Even being as scared as I was, I would definitely recommend giving it a go\nShow less"], ["Reviewed September 9, 2016", 4.0, "One of the must-do walks", "Thid is one of the must-do walks at Yosemite. It can be physically challenging - I made it all the way up to the sub-dome, but as my upper body strength is not up to scratch I made a quarter of the way up the cables to the half dome and had to turn back. My partner made it all the way up to the half dome and I spent slightly over an hour admiring the views from the sub dome, resting and people watching.\nRemember to bring gloves for the ascent to the half dome, and recomendation is 1 gallon (approximately 4 litres) of water. Last water refill is Vernal Falls.\nTake plenty of pictures on your way up, as I find that I'm too tired on the way down to think of photos. On hindsight, walking sticks will be good, especially for the descent.\nShow less"], ["Reviewed September 9, 2016", 5.0, "An amazing experience and accomplishment!", "We hiked Half Dome with our two boys ages 17 and 14. I hiked a lot in the White Mountains of NH to get in shape for this hike (about 7 times up different mountains, some quite steep, but the longest hike I did was only 9 miles) so I was worried about whether I could do 17. FYI I am 55 y/o and I saw many others around my age and older on the trail. Everything we read estimated 10-14 hours to complete so we started early. We parked in trail head parking and began our trek with head lamps on at 5:00 am and took the Mist Trail. The hike was beautiful and varied. It starts out steep and ends steep but isn't so bad in the middle. You hike through Little Yosemite Valley which is actually flat'ish in the middle with large Ponderosa trees etc. The different scenery distracted me and made the hike go by quickly on the way up. The sub dome is very steep but fun and the cables aren't for those with fear of heights! We actually had a permit, but no one ever checked for it. When we were up there we were told by other people that if you get to sub dome early ( we were there by about 9:00am) there isn't always a ranger there yet to check permits. Gloves are a must for the cables more for going down than going up in my opinion. The challenging part of the cables is that people are going down while you are going up and it gets tricky! I do not have a strong upper body but was able to pull myself up those cables...don't worry it isn't that hard. Only a little scary when my feet lost grip occasionally but so worth it!! The return hike started to seem endless from the waterfalls down. We finished by 2:30 (only 9 1/2 hours)! Our boys could have been done much earlier, but waited for us at top and at trail junctions along the way. Do it! Don't be afraid! Rise to the challenge! It's beautiful!\nShow less"], ["Reviewed September 7, 2016", 5.0, "Beautiful, but get your permit!", "Hiked half dome in July. Took us 11 hrs via our campsite in Upper Pines. It was a nice day to start. But it got hot in the later afternoon. Take a hat and sunscreen. Plenty of water and food to keep you fueled. I bought garden gloves with rubber on the palms. So glad I did or my hands would've been raw on the cables. Take a headlamp for the early morning ascent and just enjoy every step. You will pass beautiful places along the way. Savor it! I'm already planning on doing it next year! Sub dome is a challenge, but fun and scrambling along on some of the rocks was awesome! Be in shape-this hike is hardcore. You will love it! Make sure you have a permit, the Rangers will be there to check.\nShow less"], ["Reviewed September 3, 2016", 5.0, "Journey to Half Dome with Lasting Adventures", "If you get an opportunity to travel to Yosemite and venture into the mountains, make sure you expand your horizons by making the climb up Half Dome!! It is definitely one of the most challenging after climbing Cloud's Rest and Mt. Hoffman in the days prior. Don't forget to have plenty of water and sticky gloves to help pull yourself up this granite mountainside!! It will test your strength both mentally and physically, but the experience and epic view from the top is totally worth every bit!! We got to see the sunrise on our trip with Lasting Adventures and was perfectly coordinated!! Enjoy❤️\nShow less"], ["Reviewed September 1, 2016", 5.0, "Epic Hike", "We decided to attack this hike and could not be happier. It's a very difficult hike but worth it. Make sure to get a permit to climb the cables."], ["Reviewed August 30, 2016", 5.0, "A stunning example of God's creation!", "Half Dome is absolutely beautiful. You must go see it! The rock formations in Yosemite National Park are breathtakingly beautiful, and Half Dome is no exception!"], ["Reviewed August 29, 2016", 5.0, "Strenuous Hike/Climb but the Experience of a Lifetime", "My boyfriend and I were fortunate enough to secure a permit to ascend the cables to the top of Half Dome. We took the Yosemite Valley Shuttle to stop 16 and followed the Mist Trail to the top. This is a very strenuous and long hike that will take you at least 10 hours to complete--it took us 13 hours as we stopped to take pictures and have lunch. Climbing the cables was nothing compared to the last 900 feet of the trail which was very strenuous and steep. I didn't find the cables to be too difficult but they are not for someone who has a fear of heights. The hardest thing about climbing the cables was that other hikers were coming down when we were going up and vice versa. At times we had to swing to the outside of the cables to let others go by. I would recommend a thin pair of gardening gloves as they helped me grip the cables and prevented metal splinters. You may also find it helpful to clip yourself to the cables for added security.\n\nThere is only one stop for water on the trail and it is located in the beginning near Vernal Falls. We had plenty of water between us but still ran out due to the difficulty of this hike so pack extra. Before we left for our trip, we heard that other hikers had spotted a mama bear and her cubs on the trail so we attached bells to our packs to alert them to our presence. Fortunately, we had no encounters with bears but we did encounter a surprised rattle snake which could have ended badly.\n\nWhile this hike was very long and strenuous, it was well worth the views and was an experience of a lifetime. I would recommend it to anyone who has the physical capability to do so.\nShow less"], ["Reviewed August 29, 2016", 5.0, "Incredible.", "The hike to half dome was incredible. Well-worth the strenuous, steady climb to the top. I will definitely be back very soon. This place was magical.\n\n*Major, major key alert*... LEAVE EARLY, like 3AM. It's worth leaving this early. You get an incredible view of the night sky and milky way. The temperatures are mild and there are fewer and fewer people out. It was a nice break from the hordes of people we encountered getting back around 1PM.\nShow less"], ["Reviewed August 29, 2016", 5.0, "Inspiring", "We had permits for the cables and completed our ascent on 8/22/2016. This was a beautiful experience, but certainly challenging. Don't let the cable section intimidate you too much, it's really not too bad. It's really just the overall longevity of the hike that makes it strenuous. My father at 69 years old was able to make it to the top, and although he was tired, he was perfectly fine. Bring plenty of water (at least 60oz.) and be sure to pace yourself properly. You won't regret this experience.\nShow less"], ["Reviewed August 28, 2016", 5.0, "Difficult hike, only one of us made it to the summit", "This is a very demanding hike, both physically and mentally. Some people make it all the way to the cables but can't make the climb up to the summit because the cable climb is pretty intense-looking. It took us 15-1/2 hours which us longer than it should have taken but I experienced terrible leg cramps due to dehydration which slowed us down a lot.\n\nOne of us made it all the way to the summit, one about halfway, I made it about 30 feet up, and the other two did not attempt it.\n\nThe falls were not flowing very strongly (late August) so they were not super impressive, but that was okay since it meant we didn't get all wet either.\n\nThe most important things to remember if you want to do this hike:\n1. Take twice as much water as you think you will need! This. Is. No. Joke. We ran out water on the way down and there isn't a place even to filter water until you get below the falls.\n2. Take some packets or tablets along to replace lost sodium and electrolytes. I thought the food I packed would provide enough sodium but it did not.\n3. Start early! We started at 5:30am and probably would have been done by 7:30pm if it wasn't for my leg cramps.\n4. Go with people who help and encourage each other! This was a very important part of our experience.\n5. Make sure you have a permit. I would hate to go through all that effort only to turn back around without attempting the summit for lack of a permit.\n\nThis is the link to my full trip,report.\nhttps://www.tripadvisor.com/ShowTopic-g61000-i315-k9820276-Trip_Report_Half_Dome_Hike_8_25_16-Yosemite_National_Park_California.html\nShow less"], ["Reviewed August 27, 2016", 5.0, "Beautiful nature", "Absolutely stunning, this park on the whole is so worth spending a couple of days visiting. If you are going in school holiday time then make sure you go early to avoid fighting over parking spaces at trail heads and view points."], ["Reviewed August 27, 2016", 5.0, "Proper scary", "Just remembering the climb up Half Dome makes my palms start to sweat! We did this as part of an organised trek and it was one of the most memorable moments. Our guide had sorted out the permits and it was just as well as some people were being stopped by park rangers for not having a permit. As a British family of two parents and two teenagers who do sport we are pretty fit. We have also walker and done trekking before. How hard can Half Dome be?\nThe truth is that it is really quite scary due to; the steepness, the polished granite underfoot and the fact that if you trip over or lose your footing you will quickly slide down the cliff to your death.\nWe started the summit at sunrise when it cool and there was no-one about. I can not recommend this enough. My 13 year old son could not make it up due to nerves and it took all of my will power not to bottle out when I was half way up and my wife was struggling with the height. To deal with all of this when it is 30 degrees and there are people pushing past you to overtake would be horrendous.\nThe views from the top are fantastic but it is the feeling of relief and accomplishment of over-coming the fear that makes the summit worthwhile.\nShow less"], ["Reviewed August 26, 2016", 5.0, "Rocky Giant", "They say some climb it, this is freaky. For us, we were more than happy to enjoy the view of it from Half Dome Village ie stop 13 or 21 on the shuttle circuit and stop 11 ie Sentinel Bridge. Both offer an outstanding view on Half Dome.\nShow less"], ["Reviewed August 25, 2016", 5.0, "A long day, but worth it", "Having seen pics of the pre-permit days with hordes of people on the cables, it was very nice to have the day be relatively crowd free. The new permit system seems to work for that (and rangers were out checking permits - don't try to do this without having a permit). It's a LONG day. Roughly 16 miles minimum, maybe more depending on route and where you park. Keys to success, take enough water, start early, keep moving, and pace yourself. Also, gloves for the cables. The crowds near the falls on the descent were the worst part of the day, by far.\n\nThe cables get all the attention, but the 'stairs' up the sub dome take some effort as well, and have a bit of exposure. Some on the cables had climbing harnesses and were clipping on to the cables. While the odds of not falling are good, the consequences are severe. I'd consider doing this if I were there again.\nShow less"], ["Reviewed August 25, 2016", 5.0, "A highlight of trekking in the Sierras", "We climbed Half Dome as part of a 7-day backpacking trip in Yosemite with a wonderful guide from International Alpine Guides. As part of the trip, IAG got the necessary permits. Instead of hiking from the Valley, we hiked in from our camp along Sunrise Creek, so our round trip was a manageable 6 miles to the top of Half Dome (although we then hiked another 5 miles after returning to camp). The views of Half Dome on the approach, and especially from the top of the dome, are simply spectacular and well worth the effort to get to the top. The hike and climb are strenuous but manageable for anyone in decent physical shape (I'm 57 years old and found other parts of the trip much more strenuous than this climb). Not for someone with a fear of heights, however. You don't want to carry any more than a day pack on the final climb. Recommend going up as early in the day as possible, both because it will be less crowded and to give you more time at the top.\nShow less"], ["Reviewed August 24, 2016", 5.0, "Major Bucket List", "After trying for many years to get permits, we were successful. Prior to going read as much as you can to make sure you are fit both physically and mentally. Good boots, thin grippy rubber garden gloves and upper body strength needed. Must be a dry day. If you freak out from heights don't go. It's not for everyone but the reward is a 10+. I'm a bit surprised that it's open to the public (just a permit for crowd control) with any qualifications. Tip - don't look to the sides going up or down.\nShow less"], ["Reviewed August 23, 2016", 5.0, "Just look at picture", "A picture is worth a thousand words - and here it is of me precipitously standing at its edge (thank you stranger friend for taking the picture). It's nearly 14 hrs round trip if you're hauling butt up this strenuous hike for a day trip. Most people are more reasonable and camp halfway up. Bring grippy gardening gloves haha\nShow less"], ["Reviewed August 23, 2016", 5.0, "Amazing bucket list hike to the top!", "I had tried for years to get permits to climb Half Dome. This year on my second try, I scored 4 permits! I requested a 3 day wilderness permit from Happy Isle to Little Yosemite and with it I was given access to climb Half Dome. We hiked up the John Muir Trail with 35 lb backpacks. The hike up was steep and difficult, but worth every drop of sweat! The views are amazing. We sent up camp at Little Yosemite and enjoyed the rest of the day playing in the river. We were up with the sun the next day and made the hike to the sub dome and then up the cables to the top of Half Dome. You should not attempt this climb if you have any fear of heights, or if you do not have plenty of upper body strength. We hiked from Little Yosemite up Half Dome and back to camp in 5 hours, but we moved very quickly. The next morning, we packed up camp and backpacked down the Mist trail back into the valley, this took us 3 hours. I am so glad we broke up this hike into 3 days. Had we done the 11 hour round trip hike from the valley up and back, I don't believe it would have been as enjoyable. We loved every minute and this trek is a MUST DO!!\nShow less"], ["Reviewed August 21, 2016", 5.0, "Best hike ever", "I hiked half dome all the way to the top and took me about 12 hours round trip. I was lucky to get the permit thru lottery back in April. Started 5 am and got to the cables around 11 am. Cables were not busy at all. They look tuff but as long as you keep your hands on the cables you should be fine. The granite is very slippery and half dome wil be very very difficult without cables. This hike was the most strenuous hike I had ever done. The hike is very scenic route and you pass Vernal and Nevada fall on your way to the half dome. I also encountered a brown bear with her 2 cubs in the forest between subdome and little Yosemite Valley. So be careful. One of the best hikes I have ever done !!\nShow less"], ["Reviewed August 21, 2016", 5.0, "A MUST if you like trekking", "This Is the best of the best in Yosemite. For those who really like to walk. 11 hours as a round trip from the valley. Super recommended. Great views, nature, animals and ending in a huge rock that really puts your focus at another level. Take lots of water and food with you. It is a challenging walk and you dont want to start it unprepared. Be sure to apply for the lottery to climb the last part (2 days in advance). A water purificator can be usefull if you do not want to bring so much water with you. One of the best experiences I had and definitely my favourite trekking in USA\nShow less"], ["Reviewed August 19, 2016", 5.0, "Giant structure", "Massive rck structure. Great views from different angles in the beautiful park . Stunning on a clear blue sky backdrop."]]}}