{"Hearst Castle": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Hearst Castle", "url": "/Attraction_Review-g33039-d207444-Reviews-Hearst_Castle-San_Simeon_San_Luis_Obispo_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/31/0c/00/indoor-pool.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "5813"}, "address": {"@type": "PostalAddress", "streetAddress": "750 Hearst Castle Road", "addressLocality": "San Simeon", "addressRegion": "California", "postalCode": "93452-9740", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Amazing place to visit", "Set in beautiful countryside, it's great to visit here. This was our 2nd time and we tried a different tour - the Upstairs Suites tour. Our tour guide was simply fantastic - the group size was also really intimate, too - made it more special.\n\nDo not hesitate to visit here - something for everyone.\n\nNote though that once you're on the bus to the top, there is no food and you can't take anything but water. Be warned!\nShow less"], ["Reviewed 3 days ago", 5.0, "Fabulous Glimpse Into A Different, Bygone World", "Right from the start, visiting the Hearst Castle, as it is popularly called, impresses. The film shown in the visitor’s centre, narrated by Donald Sutherland, is shown on a large format screen, appropriate to Hearst’s out-sized character. The tour itself is excellent, thanks in large part to the quality of the guides. You are free to wander around the grounds after the formal tour has finished - well worth doing, as the vistas are breath-taking. This was my second time here and I can say without qualification that they have improved the experience.\nShow less"], ["Reviewed 3 days ago", 5.0, "Great tour", "Enjoyed Hearst Castle especially the Cottages and Kitchen tour. The guide was great, very knowledgeable and entertaining."], ["Reviewed 4 days ago", 5.0, "Fabulous tour of the private quarters", "Lynn Anne was terrific—extremely fun and knowledgeable. The house itself is amazing. We chose an early morning tour and there were only six of us which was perfect. The tours are pricey and the extra $8 per person fee is annoying but in the end it was worth it. When booking a tour select one with the most available tickets and perhaps you too will get an almost private tour.\nShow less"], ["Reviewed 5 days ago", 5.0, "Just astounding!", "We loved visiting! The tour (we did the grand rooms one--there are several) was very nicely done. Simply beautiful! And the fact that you can hang around as long as you like outside and look around, take pictures, etc., was wonderful. We'll be back."], ["Reviewed 5 days ago", 4.0, "Interesting", "We took the grand tour. Beautiful trip up to the castle and good guiding in the bus. Spectacular view when we reach the castle. The guide was good and he gave us an personal guiding through the grand rooms. It was quite satisfying!"], ["Reviewed 1 week ago", 5.0, "AMAZING!", "We went on a tour to the Hearst Castle. Magical place! 15-minute scenic bus drive to the Castle, very interesting tour of the Grand Rooms and lots of walking and and overlooking the ocean and mountains from the estate. BEAUTIFUL trip! A lot of historical elements on the tour. Amazing architecture! The weather was just perfect for the tour. Views from the Castle are so beautiful and peaceful, it kind of brings you into the days of Mr. Hearst when Charlie Chaplin, Clark Gable and other celebrities stayed at the Castle as guests. So much to say about Hearst Castle! But to see it would be the best! :)\nHopefully we will be back for the other tours.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful Look into History", "We really enjoyed our visit to Hearst Castle. When I first arrived at the visitor center I was concerned when I saw the huge crowds. I went off season and in the middle of the week. Fortunately, the busses and tours worked out so that it did not seem as crowded. We took the 45 minute \"Grand Rooms Tour.\" Our Tour guide gave us a wealth of information on the history of the estate as well as the life of William Hearst. The Neptune Pool was under construction and our tour guide gave us details on the progress and challenges faced with the reconstruction. We were able to wander around the grounds for a while after the tour to take photos of the beautiful grounds. I highly recommend seeing this beautiful historic gem.\nShow less"], ["Reviewed 1 week ago", 4.0, "Nickel & Dime Charging", "It is amazing what people with money will spend it on! The castle was huge and the little bit we saw was awesome. I was put out by all the partial viewings. It was a charge to see the big rooms, a charge to see the kitchen, a charge to see the cottages, a charge to come view at night. How about one fee to see it all?\nShow less"], ["Reviewed 1 week ago", 5.0, "3rd time visiting!", "Toured the upstairs suites which were amazing. Beware though, there are many stairs to climb and there are no elevators! Guide was informative and animated giving us a fun time with banter. Next time I'd like to experience one of the tours whereby they dress in period costume!\nShow less"], ["Reviewed 1 week ago", 5.0, "Oh my, the splendor and the art!", "Impressed beyond words at this wonderful estate. The buildings, the art collection and certainly the views were beyond description.\nArriving at the visitors center was quick, with adequate directions from Hwy 1 and ample parking. The guides and all other staff inside the visitors center where helpful and cheerful, making you really feel like you were welcome there. The exhibits in the visitors center were amazing.\nShow less"], ["Reviewed 1 week ago", 5.0, "What money can buy!", "This is a destination if you haven't visited Hertz Castle before. We hardly recommended as you will sell them see a more spectacular Castle, including a fantastic View."], ["Reviewed 1 week ago", 5.0, "California Vacation", "This mansion is a \"must see\", unlike any other house that you will tour in the United States including the Vanderbilt House in North Carolina and the mansions in Newport Rhode Island that we have visited. Huge house, spectacular ceilings, fantastic works of art that you won't find anywhere else, and breathtaking views of the ocean and surrounding mountains. It is really impossible to take it all in unless you had a week or more, but it is sure fun to see all you can in the allowed time. If you are in this area of California and don't visit you should kick yourself!\nShow less"], ["Reviewed 1 week ago", 5.0, "An awesome place.......", "A really beautiful location high on the hill overlooking the ocean. Awe inspiring, and neat to see how the really rich lived many moons ago!!!!"], ["Reviewed 1 week ago", 5.0, "A Trip Back in Time", "Never having been to Hearst Castle, my wife and I decided to take a short holiday in San Simeon. The Castle great rooms tour was excellent and full of historical pieces. Our guide (a retired teacher) took us on an oral and visual trip through the important rooms of the Castle. The highlight of the tour though was the indoor pool with its mosaic walls and beautiful designs.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful and so interesting!", "This is a very interesting tour! We definitely want to go back to take some of the other tours, but we just did the basic grand rooms tour. It's a beautiful drive and view from Hearst Castle and a lovely place just to walk around outside. A definite must-see if you are in the area.\nShow less"], ["Reviewed 1 week ago", 5.0, "Two tours of Hearst Castle", "Hearst Castle is a fascinating place to visit. Allow a day to take in a couple of tours, spending time in the fabulous gardens while enjoying the magficent views and the excellent documentary at the end. The tour guides are really historians who have a wealth of information to offer. The Castle is filled with exquisite objects d'art and is a major achievement for its time. We did the grand tour and the private rooms and would have loved to have time to tour the kitchen and wine seller. Allow a day to enjoy it all and visit the Sea Lions afterwards.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing arcitecture!", "We didn't purchase tickets in advance but got them the day we arrived. We did go on a Monday in February. Amazing story of a man and his dream of a place way out in the middle of no where. Everyone we came in contact with were very friendly and informative. Don't miss the museum at the bottom.\nShow less"], ["Reviewed 1 week ago", 5.0, "Well worth a few hours", "This is an amazing attraction. It is not as large as the Biltmore in North Carolina but is more opulent. It is Ludwig's Lindenhof to his Neuschwanstein. Smaller but with more sparkle. We took the Grand Rooms tour as well as the Upstairs tour and were not disappointed. It is amazing how one man could envision this and have the means to build it. The views of the Pacific ocean are stunning from the top of the hill. Looking north, you can see a mountain top thetas part of the 250,000 acre estate.\n\nThe day we toured was sunny and 70 degrees. Perfect weather.\n\nWe will return again to take the other tours.\n\nTIP when you are finished, drive across Highway 1 into San Simeon to Sebastian's for burger.\nShow less"], ["Reviewed 1 week ago", 5.0, "Returned after 52 years", "We just revisited the hill top after 52 years. They have opened up additional areas for the public's view and the view out over the ocean and hillsides are still outstanding. We saw zebra and cattle on our drive up from the visitor's center where there is an outstanding 3D film about the construction and history of the development of Hearst Castle and as a boy. As we had seen the main floor many years ago we took the upstairs and cottage/kitchen & wine cellar tours. The guides were knowledgable and made the tours pass very quickly. A must see if you are in the area.\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Unfriendly staff", "The castle was great, but the staff was very unfriendly. We were a group of four and I'm partially disabled and need a little folding walker to lean on, but can climb the stairs. I wasn't allowed to take the walker with me to the tour, even though we explained the situation several times to the several staff personnel. They suggested that we should wait for an accessible tour (over 1,5 hours), where only two of us could participate. We didn't have time to wait for so long. So I had to go to the tour without my walker, and with a help of my friends I somehow managed to survive through the tour. Luckily there was some chairs in some of the rooms. The rules should be flexible in the cases like this. We were very upset and had a bad feeling after this visit.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Worth the visit", "I took my mom on a road trip along highway one in January during the rainy season. We were very lucky that it was not raining on the day when we visited Hearst Castle. The collection at the Castle is very vast and impressive. Our tour guide was very knowledgeable, friendly and passionate about the castle. The Roman bath at the end was our favorite part of our visit as it was simply magnificent. Also, you would get a chance to walk on gold gilded ground. That said, the collection and the buildings are not very coherent at times. The place reminds me of Romanesque structures in Europe. It is definitely worth a visit nonetheless.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "An unbelievable gem worth your afternoon", "The backstory alone on this extensive estate is worth the trip to San Simeon. Sitting atop the hills overlooking the ocean, the grounds are filled with zebras and other animals as the shuttle ferries you up to the castle. I was on limited time and opted for the Grand Rooms tour at $25.00 US. The estate gardens were my starting point and then we were invited inside to the main salons/dining room of the castle. Exquisite art and architecture surround you making for great Insta opportunities. I was on property three hours toddling through the gardens, Grand Rooms, pools and then back down at the visitor center with gift stores, etc. There is a restaurant and snack venues in the Visitor Center, but I would recommend heading into San Simeon to find lunch or dinner. If you enjoy art, architecture, and a bit of history, this excursion will be worth the $25.00 US or more (depends on the tour/combination of tours you select).\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Gloriously over the top!", "Initially visited 15 years ago and just had to go back. It is as over the top and as wonderfully tasteless as remembered. WR Hearst had money, wasn't afraid to spend it and this place is a fabulous monument to everything money can buy. If you have got it flaunt it must have been his motto and deepest sympathies to his architect on having to find a way to show his (to be polite) eclectic collection and the \"put as much as you can\" into one room directions.\nWe took two tours and the upper house one was by far the most interesting. It would be interesting if a Collection tour could be added to the itinerary. The gossip about what went on in the house is fun to hear but the pieces are often just ignored. I'm sure it wouldn't just be European visitors that would really like to know where the works had been collected from etc.\nWhen the tour is finished take time to wander around the terraces-you won't regret it.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must see!", "As it was 'winter' (beautiful warm day!), there were few tourists and the sky was somewhat hazy from Californian bushfires, but the view to the coastline was dramatic and beautiful. Loads of parking available at Visitors' Centre, some excellent merchandise at reasonable prices inside the vast area, as well as eateries. A bus took us up to the Castle where we went on the rooms tour. Our tour guide was exceptional, knowledgeable and funny and left us with a great understanding of the exterior and interiors of Hearst Castle. A great experience, thank you\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Tours at Hearst Castle", "The tours are very informative by the staff giving them. Took the bus from the visitors center to the Castle. Beautiful morning."], ["Reviewed 3 weeks ago", 4.0, "Interesting piece of history", "I really enjoyed Hearst Castle. I actually enjoyed walking around the grounds on my own more than the main room tour. If I had to do it again I would have done the guest house tour instead. Most of what they tell you on the main tour you get from the movie that is included with your ticket. Overall I would say this is a must see if you are in the area.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing Hearst Castle", "From the beautiful Visitor Center, to the bus drive up to the Castle, to the Castle tour, this is a Must See Stop if you are near San Simeon. We visited in January which had lower visitors in attendance which made for a more personal, more comfortable experience. We had 11 on our tour which in the busy season can accommodate 50. The downstairs tour is important for an overview, but the upstairs tour should not be missed. Upstairs you visit far more rooms of the Castle and they are absolutely beautiful.....libraries, sitting rooms, bedrooms etc. I would highly recommend doing both. We toured downstairs in the morning, ate lunch and saw the movie in the visitor center and then toured the upstairs in the afternoon. It was a perfect schedule with time to relax and really enjoy the beauty of it all. A highly recommended stop on any itinerary near San Simeon. We were based in Moro Bay....about a 30 minute, easy drive.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A beautiful mansion to visit", "We have visited several ancient traditional European castles during our travels, so to us this wasn't a castle but more like a beautiful mansion built in a stunning, castle-like setting....but to have the chance to see this in the US was a real treat!\nWe had pre-booked our tickets a couple of weeks in advance which worked out well, but what we hadn't considered when booking is that you don't know what kind of weather you will awake to on the day of your tour.....on the day that we visited it was initially quite foggy so we didn't have much of scenic view on the drive up nor once up at the castle. The fog did burn off a bit while we were inside having our tour so we didn't miss out completely on admiring the exterior setting on which this place was built...and the picturesque view from it.\nBTW, you are only able to see this place up close via a guided tour, which includes an ~5-mile bus ride up to it from the parking lot and visitors centre at the bottom of the mountain. If you do prebook tickets, the time on your ticket is not the time of your tour but the time at which you catch the bus up to the castle. Our tour guide met our bus when it arrived at the castle and began our tour almost immediately. Following the tour we were able to spend as much time as we wanted exploring the exterior areas and gardens (we spent ~1.5 hours) and then waited at the designated area to catch a bus back down the mountain.\nWe chose the 1 hour tour of the Grand Rooms and it was very enjoyable. Our tour guide Catherine was very pleasant and knowledgeable and made the tour very interesting and informative.\nOverall our visit here was very enjoyable.\n\n**A few tips when you visit here......make this a full day outing because there is more to see in the surrounding area:\n#1 go see the Piedras Blancas Elephant Seal Rookery (~4 mile drive north on Hwy 1 from the castle)\n#2 walk along the pier in San Simeon Bay\n#3 stop and check out the herd of black cattle ~0.5-1.0 mile south of the castle entrance turn off -- there is also a herd of at least a dozen zebras mixed in with them\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A California Landmark", "We chose the grand rooms tour. Our tour guide was informative, approachable and knowledgeable. Any question you asked, he'd be able to answer extensively.\nOf course, this estate was super-impressive. Both pools were so extravagant (even though the outdoor one was under construction) and the Gothic interiors have surpassed the grandeur of their inspiration.\n\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must Do!", "A truly exceptional trip to one of America's iconic snd controversial dynasty's home. Lots of tours to choose from, to suit all finances, interests, durations. A great visitors centre with all manner of unassociated items for sale, to tempt the tourist. The tour guides were exceptional in their knowledge. A brilliant trip and so glad we wrnt. Recommended.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "visit to the hearse castle towers and upstairs bedrooms/sitting rooms", "You can't go to san simeon without visiting the hearse castle. IT exceeded my expectations and is a must for the shear construction feat, let alone one of the largest collections of world historical antiques and collectables.\nstay at the Cavalier Oceanfront Resort and visit the restruant for the best prime rib in california\nShow less"], ["Reviewed 4 weeks ago", 5.0, "PCH 1 to The Castle - May, 2015", "What a drive up the Pacific Coast?\n\nDon’t miss the opportunity to drive this highway..\n\nWhen you get to the tour entrance for Hearst castle.. what a wonderful climb to history.. if you let your imagination run wild.. you can only imagine the parties with Hollywood elite and very wealthy!! Think the “party at the Top of the Hill”.\n\nEach step back in history is amazing.. each room had its very own style.. I didn’t see a duplicated room.. The Neptune or Roman Pool..oh what opulence! They have 3-4 different tours at least.. I’ve gone on 2 - Grand Tour and Upstairs Suite Tour. I understand that the Evening Tour is a must, it’s also 100 minutes, the other tours are about 60 minutes.\n\nEnjoy the drive to the castle and the view on the hill!!! It’s a breath taking view of the Pacific Ocean on a sunny morning.\n\nIf you have time, do the 17 mile drive In Monterey, California.. just down the road from Hearst Castle. Pebble Beach, the Lone Cypress and The Pacific coastline is breathtaking!! You will see seals and possibly a whale or 2 migrating either north or south, depending on when you travel.\n\nDon’t miss either opportunity, you will want to return again and again!!\n\nSorry for incorrect date, couldn’t put in my correct year ..\n\nHappy travels!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "took the tour", "We took the Disabled tour this time and were very pleased with the service and the information given. This is an incredible place and the guides were very knowledgeable. The views are incredible. The movie was also helpful in putting it all in perspective."], ["Reviewed 4 weeks ago", 4.0, "Make a stop if you're driving up Pacific Coast Highway", "You may want to book tickets ahead of time, just depending on when you plan to go. We tried to come recently during the holiday, and all the tickets sold out! (We came late in the afternoon). During off-peak travel seasons, the place might be fairly empty and easy to visit.\n\nOnce you park, and pay for tickets, there is a specific time slot where you can take a bus shuttle up to Hearst Castle. The bus plays audio, voiced by Alex Trebek of \"Jeopardy.\"\n\nThe downside to Hearst Castle is that one ticket will not allow you to experience all of Hearst Castle. You'll only get to see sections, depending on which tickets you chose to get. Most first time visitors should get the tour that explores most of the exterior of castle, the outdoor pool, the interior living room and dining room, the theatre room, and the indoor swimming pool. The guest rooms and bedrooms are shown on separate tours.\n\nAs you'd expect of a tourist destination, the food offerings are so-so but at higher prices. There's also local beef and wine that can be had, sourced from the local ranches.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Don't just drive past", "Well worth it, you must organise in advance to make visit seamless. Once you have a ticket arrived at correct time and you are bussed up to the Castle. It's beautiful to see even if you only do 1 tour. We we're here on an extremely hot day, so if you visit in summer plenty of water and the biggest hat you can find it was blisteringly hot..\nShow less"], ["Reviewed January 23, 2018", 3.0, "Off the beaten path", "It is a little pricy for what it offers but I understand why. First things first, you can't just drive up to the castle. I didn't research properly and didn't plan, so that is on me. We got behind schedule because you have to buy tickets then wait for a shuttle to get up and back down. It is very pretty. A neat site to see if you're wanting a day drive away from everything. While you're in the area check out the elephant seals.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Family road trip", "Was really interesting. The views from there were amazing. We went on all the tours. The thing that bothered me was they asked on the bus trip to make donations after we were already paid for the tours"], ["Reviewed January 22, 2018", 5.0, "Real life version of some colossal stageset from Hollywood’s Golden Age", "One of CA’s “can’t miss” attractions. The fabulous Neptune Pool is currently under renovation, but this monumental folly/fantasy is still worth a visit. Especially in high tourist season, you’ll want to make advance reservations. It’s pricey but well worth it as you’ll never see anything like it.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Go back in time at the Central Coast in California.", "This is the second time I visited Hearst Castle. I very much enjoyed the film in the visitor's center. I would advise seeing this film before doing any of the tours. I wasn't impressed with the grand rooms tour as much as walking the grounds and seeing the phenominal views. Just lounging around the grounds on a beautiful sunny day is sufficient for me.\nShow less"], ["Reviewed January 21, 2018", 5.0, "To Hearst or not Hearst ??", "Spend the night in Cambria - take the tour of the rooms - a beautiful 24 hours ! Amazing location and beautiful views... even the zebras were a surprise"], ["Reviewed January 21, 2018", 5.0, "Well worth at least one tour", "I'm cynical and wasn't expecting to be impressed, but Oh My! This is well worth the price of at least one tour (at $25 it's not inexpensive), which also allows you all the time you want to wander around the outside grounds. The Grand Rooms Tour and the grounds are astounding in beauty and taste. It's a glimpse into luxury few of us can imagine. And so much history, both in Hearst and company, but also in all the antiquities that make up this place.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Wow look what a rich guy did work his money", "This Castle is very interesting... But I kept wondering why this person built all this out in the middle of nowhere. They did not seem to be a rhyme to the inside room, but the prominayde was nice... Indoor pool was magnificent... Go check it out yourself...\nShow less"], ["Reviewed January 19, 2018", 4.0, "Hearst Castle, Museum on the Hill", "I have travelled through California several times the last few years and never had time to tour Hearst Castle. It takes at least half a day and if you take all the available tours and view the movie almost all day. We only took the tour of the grand rooms walked the yards and skipped everything else. The Castle is worth the entrance fee just to see the majestic vistas from its patios , inaccessible without a ticket. The Hearsts are such a formable family in American history it’s interesting to hear how they made their fortune in mining and still own a significant part of the land surrounding the Castle today. The interior of the Castle is filled with fabulous art. One can imagine the rich and famous playing and partying at the Castle in the thirties. Certainly worth a trip to see how America’s wealthy lived.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Worthy place to visit", "Amazing work, makes one realize what real wealth can buy. Arrived at 8:45 for a 9am Grand rooms tour. Enjoyed how empty it was this early. Plenty of food options but a bit pricey. Plan on a minimum of three hours, more if you do multiple tours. Well worth the visit.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Truly unbelievable", "The scale and intricacies of the castle were truly spectacular! The history was fascinating, and was a wonderful way to spend the day. Highly recommended, though would have liked to see more of the rooms on the GR tour. Thanks!"], ["Reviewed January 14, 2018", 5.0, "Always a good visit", "Tour guide was incredible - made you feel like you had a personal tour with Randolph Hearst. His knowledge was great and his presentation even better. The castle itself is spectacular."], ["Reviewed January 12, 2018", 4.0, "A Hearst Home of History and Grandeur!", "We went to Hearst Castle on a beautiful and clear California winter day. I have a family of seven so going to see Hearst Castle is not one of the cheaper activities to do. The price was $25 for adults and $12 for children 5-12 for the Grand Ballroom Tour. This is considered the \"beginner's tour\" since you see the main rooms of the bottom floor of the castle. The price includes the shuttle up to the castle and the 40 minute IMAX movie in the visitor center. Definitely see the movie. The quality is great and it's more of a movie than a documentary.\n\nOne thing to keep in mind, the Neptune Pool is closed for rehab until approximately March. The \"helpful\" volunteer at the entry of the visitor center inconveniently left that fact out. To me, the Neptune Pool is one of the most photographed areas of the castle. i inquired if the tour included the pool. He said \"Oh they let you walk around after the tour to see things.\" It seems to me that he intentionally did not mention the pool's condition. Indeed, if he had, I might have toured another day.\n\nThe entire Hearst Castle is considered a museum, including the floors that you walk on. Basically, you are not able to touch anything anywhere at anytime, with the exception of the designated strip of carpet you are walking on. There are plenty of people everywhere to watch you and tell you \"don't touch.\" My 9 year-old learned this the hard way, twice.\n\nWe took about two hours total for the entire tour. The opulence and outstanding collection of history, art, and architecture cannot be overstated when you visit the Hearst Castle. It is probably the most amazing residence I have ever seen. And yes, when you finish whatever tour you are doing, you are free to walk the grounds and check out everything and take advantage of many photo ops.\n\nI did feel that the tour was a little rushed because there are tours following right behind you. We were clearly rushed too much and, sure enough, we got backed up by the tour in front of us. I know there are millions of visitors to this place but they need to time their tours a little better, especially in the winter when the visitors are not as plentiful as in the summer.\n\nOf course in the visitor center there are restrooms, concessions, drinking fountains and the obligatory overpriced gift shop. There are some really cool souvenirs there, though. I hope this has been helpful!\nShow less"], ["Reviewed January 12, 2018", 4.0, "Well worth the visit - but take a raincoat if wet weather", "Hearst castle is really interesting and worth the drive to get into. (With the coast road still closed we couldn’t access the castle from the south and so stayed in Cambria and went in and out from the north.)\n\nWe did the grand rooms tour. The rooms are grand alright and our guide Amanda was great - she had answers to all the questions from our group. I was disappointed not to see some of the bedrooms but that required another tour and we only had time for one tour.\n\nYou get a bus from the check in area to the castle which is on top of the hill. It was wet and cold the day we were there and we got saturated getting to and from the bus to the castle itself. I was really surprised that we weren’t offered umbrellas or warned at the bottom of the hill that we would get wet. For the ticket price I would have thought they could have loaned guests umbrellas on wet days - especially as there were lots of elderly people in our group.\n\nAs an unexpected bonus we saw zebras grazing with the cows in the grounds around the castle. Hearst used to have a zoo and the zebras were released and continue to roam the local area.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Opulence!", "We took the \"Grand Rooms\" tour this time and it was very interesting. The video at the visitor center is very educational."], ["Reviewed January 11, 2018", 3.0, "Twilight Tour Review - All depends on your guide", "Our feedback was on the \"Twilight Tour\". We were exited to get in on the last day as this is a limited time tour.\n\nThe tour until we reached the castle was great, our tour guide could have been better, friendly and probably discuss things about the castle rather than talk about current events.\n\nOverall a good experience\nShow less"], ["Reviewed January 9, 2018", 5.0, "Always worth the visit", "Hearst Castle is always a great \"Thing to Do\" when around the central coast region. The amount of artifacts in and around the grounds are amazing, with so much history. The Docents are the real reason the tours are so interesting. I've been to Hearst Castle a few times over the years, taking different tours obviously with different Docents. These individuals are truly that individual. You won't see them reading off a script and every time it's different. They are engaging, usually funny, and share so much history of the castle, William Randolph Hearst, his guests, the remaining heirs, and of course \"Citizen Kane\" comparisons. Also, if you visit the castle, be sure to get a bite to eat in the nearby town of Cambria, which not only has plenty of choices, but is really quaint.\nShow less"], ["Reviewed January 9, 2018", 5.0, "A Californian Highlight", "This turned out be one of the highlights of our six week trip on the west coast and the so called \"Castle\" is somewhere I would highly encourage a visit to. We did the Grand Rooms tour and our guide was knowledgeable and managed to paint a picture of how life was there in it's heyday. After the tour you can spend as much time as you like in the grounds and enjoying a view that seems to go on forever before heading to the theatre and seeing a movie about the Hearsts and their early years in San Simeon. Oh, and the trip up the hill to the castle is something you won't quickly forget, trust me. Very highly recommended.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Worth the tour!", "This was a great tour and a great historic place to visit! It's very beautiful inside and out! Make sure you book in advance if possible and get there early to avoid the crowds! You park and then a shuttle bus takes you up to the house and brings you back down when the tour is over.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Interesting Attraction", "We visited the Hearst Castle on a Wednesday at 9:30, but all of the tours were sold out until after 2:00.There was a semi-private tour available for $100 per person so we took that because we had another place to be that evening. So it might be a better option to buy tickets in advance if that’s available. There were 6 people on our tour and it was very interesting. It focused on all of the art and architectural details in the house. We were able to go into areas where the big tours couldn’t go.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Not a castle but nice to visit...", "Great place but the tours need serious review.\n\nGrand Rooms - 1st tour\nOur 1 hour tour started at 12:20pm and by 13:00we drove to the property and the guide kept repeating stuff already told on the bus. Then wasted another piece of time asking people where they from and talking about Hearst and how he made money, when family passed away, when he died, etc... etc.... . No grand room to be seen as yet...\n\nYou can find that on Google.... very frustrating.\n\nAt 13:15pm we are still outside listening to a guide who know a lot about ‘Mr. Hearst’ but most information is either obvious or useless.\n\nThe rooms are a large collection of stuff. Nice individually but together it is just a collection on antiques pretty bad put together.\n\nA lot of church old side chairs and a monastery style tables. A lot of Italian tapestry combined with Spanish artifacts and French mantelpieces.\n\nMaybe it made sense in 1939-1950’s but also clouded by the fact that he was very rich and being a guest here was a ‘place to be’.\n\nThere is a reason the family donated all this to the state of California. Who on earth would want to use it....\n\nWorth visiting, I guess, but only if you are in San Luis Obispo already. Driving 4-5 hrs from San Francisco or Los Angeles.... not so sure.\n\nShow less"], ["Reviewed January 6, 2018", 5.0, "America's castle! Just amazing.", "This is a California State Landmark. Reservations are recommended. La Cuesta Encantada ( the Enchanted Hill)or Hearst Castle was home to WR Hearst. The artifacts in this collection are amazing. The view from the hill cannot be beat. There are several tours of the property and grounds. Cattle still feed on the grounds as well as goats and zebra. I won't tell you any more because you really must see this for yourself. The tours are all docent lead and very informative. There is plenty of parking with a bus ride up to the castle on the hill. We visit each time we are in the area.\nShow less"], ["Reviewed January 5, 2018", 5.0, "beautiful views!!", "went up here on a whim while recovering from an injury so was limited to the ADA tour, but really enjoyed the whole experience!! the tour was enjoyable, but the free time in the gardens was the most enjoyable!!"], ["Reviewed January 5, 2018", 4.0, "Beautiful castle and property", "I came to the Hearst Castle for the daytime tour which was great. A little disappointed that the tour did not include the other houses on the property. Our tour guide was not very enthusiastic about what she did, so this made the tour long and unbearable. She did not go into great depth about the property or the owner, so it was difficult for myself who did not grow up in the area.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Worth the Trip!", "I have been to Hearst Castle several times and it is always incredible to see and ponder the wealth, art, lifestyle and vision of Hearst. I do recommend seeing the movie if this is your first time going, it gives some nice background to what you will see.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Spectacular Home", "Worth every penny. Grand Rooms tour is the most visited. Guides were all very knowledgeable and friendly. Art work is beyond phenomenal. Egyptian statue over 3,000 years old. Upper rooms Your is very interesting especially the the room at the top under the bell tower. This is one home worth the tour if you never tour another home!!\nShow less"], ["Reviewed January 2, 2018", 5.0, "Don't miss this attraction", "There are so many tours to choose from that you'll find something for everyone. Be advised that the beautiful Neptune Pool for which the Castle is so famous, is under renovation until sometime in early 2018. Best to choose a tour which doesn't focus on the pool.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Holiday Twilight Tour", "I took the daylight tour several years ago so I decided to try the holiday twilight tour this time. If this may be your only tour, I would go for the daylight tour. In the daytime, you get a movie on the making of the castle and you get to see the impressive views as you take the bus to the house along with information about the grounds. On the twilight tour, you only get music on the dark bus ride. Also, the restaurant was closed when we got there at 6:30 for our 6:50 tour and we had planned to get a quick bite before the tour. The Starbucks was open so there were a few food options. I had expected to see some exterior holiday lights but there were all on the inside. The trees and decorations were historically accurate for the time so perhaps exterior lighting wasn't done as much. It was a different feeling to walk around in the evening and I enjoyed the tour and information from our guide. The outdoor Neptune pool is currently being renovated so you do miss that and the fountains are also off in the evening.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Fascinating place. Spectacular scenery.", "We did the Christmas twilight tour, which includes the main level of the house. The interior has huge rooms, with a lot of dark wood. In some areas, the main level rooms look like the interior of an old hotel or a church, definitely not warm or inviting. It was designed to impress. Having huge Christmas trees and other holiday decorations gave it some warmth, but not a feeling of a place where one would want to be alone or with just a few people.\n\nWhen we were checking in, the very helpful and friendly agent at the ticket booth recommended that we buy tickets to tour the Upstairs Suites. We are very grateful to her for the suggestion. This part of the house is great! The rooms are warm and friendly, and are very inviting. It is a place where one would love to spend time - including looking out the windows at the views. One should do this tour, in addition to seeing the main floor - you will get a much better feeling about the house!\n\nUnfortunately, the spectacular outdoor pool is still under reconstruction and is empty. However, the interior pool is magnificent.\n\nOne should have at least an hour to walk around the exterior of the house and the grounds. The house looks even better in the light at sunset.\n\nOne should make reservations in advance.\n\nIt is amazing that the Hearsts acquired around 250,000 acres of land there.\n\nThere are a limited number of hotels in San Simeon. It might be more interesting if one could find one on the ocean side of the highway there. The restaurant choice is even more limited, and there are no gas stations. However, these places are only about ten minutes away from the entrance to the Castle.\nShow less"], ["Reviewed December 30, 2017", 3.0, "California dreaming", "Nice but not spectacular. Overhyped maybe. Still worth visiting, but don’t expect too much. Beautiful views."], ["Reviewed December 29, 2017", 4.0, "Museum quite nice history of media in the early 20th Century", "We arrived and it was all sold out so he took a visit of the museum which is wonderful not only to find out about the amazing person however about Hollywood in the early 20s and the newspaper industry — Also the drive is beautiful going from Cambria to the castle\nShow less"], ["Reviewed December 29, 2017", 5.0, "Amazing Castle", "We did 4 tours and were completely worn out but the trip was amazing. The Castle and grounds were breathtaking. We had wonderful and very knowledgable guides. It was well worth the trip."], ["Reviewed December 29, 2017", 5.0, "Hearst Castle at Christmas", "The main reason for our trip was to see Hearst Castle during the Christmas season. After arriving from San Diego we went on the Twilight Tour which was mainly the Grand tour at\nnight James was our tour guide and we both enjoyed it. BUT if you ever get the chance to do the a 'Art of San Simeon Tour' I highly recommend it. We paid the additional $8 online to\nensure we have the tour for the next day. Lynn was our tour guide and we were extremely lucky just to have the two of us. It's normally for eight so it was more of a private tour. I find it amazing how some people complain about the Castle and the price of the tours. Comparing it to the amusement parks it's a great tour and you get a chance to appreciate the history and the foresight of William Hearst and Julia Morgan. Now if only those walls\ncould talk.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Holiday Twilight tour is lovely", "I've been to Hearst Castle a few times and enjoyed each of my visits. I had heard from friends about the evening tours at Christmas and decided to try it out. It was so worth it. Wear a jacket since it does get cold (by California standards) and be willing to ask questions; it will be much more informative and enjoyable. Our tour guide had a wealth of off-script information that really enhanced the experience.\nShow less"], ["Reviewed December 25, 2017", 4.0, "Nice but no must", "Like quite a number of years ago I booked the grand tour for Hearst Castle and again I was surprised how little material information is being provided by the professional guide. Objects around the Neptune pool were commented upon by their age only, no mention whatsoever about the origin, how it ended up in Hearst Castle etc. Nice to know I would say. Same for quite a (limited) number of objects in the castle itself, identified by their age only. No details about the installations, how much advanced they were, just touching upon Mr Hearst's advanced commitment to the environment. How did that translate in the building? Nothing about impact of the the frequently mentioned \"power\" Mr Hearst wielded throughout the years etc. etc. A missed chance, at least for people who are not that much impressed by merely hearing a date. What is the quality of the painting for example? With some more technical information the tour could be made interesting for teens as well in stead of hearing all kinds of visitor names that do not ring any bell. Please adapt your tour to the 2017 public.\nThe 40 min film in the auditorium was excellent and informative, reason why I rate the castle visit with 4 starts and not with 3.\nShow less"], ["Reviewed December 25, 2017", 5.0, "Holiday Treat", "We took the Holiday Twilight tour and the Upstairs tour. The tour states people will be dressed in vintage, holiday attire, but we did not see any. The evening tour was romantic and lovely. The day time tour includes the movie, which is great. If you can only do one tour, do the Grand House in the day time. The upstairs tour includes Hearst's office. Our guides were very knowledgeable. They were happy to answer questions. Ask about the mustard and catsup on the dining table. Ask about the lampshades. The Neptune pool was under construction, so that was disappointing. But the indoor pool is ridiculously amazing. You have plenty of time to roam the outdoors and take many wonderful photos. Before you enter the line for the bus, you get a photo taken for souvenir pictures. Only $37 for a few prints and digital files. We went for it. The second day, we skipped having the photo taken. You can get lots of great photos on the tour, though. My mom loved this place. Wish she were still around to share my own memory.\nShow less"], ["Reviewed December 24, 2017", 4.0, "Amazing but expensive and dark", "We decided to stop on the way from LA to San Francisco.\nOne can not drive up to the castle. There is bus that takes one up to the castle. One needs to reserve a time to go up during high season. Fortunately, we did not have to.\nOne caution - eat before you go. The price for food was insanely expensive. About $7 or $8 for a small slice of pizza.\n\nIt’s impressive to see the extravagance outside. Indoors it was a bit dreary.\n\nWhile the tour guide was entertaining and the info was interesting, one is not drawn to come back.\n\nIt is more of checking off a bucket list.\n\n\nShow less"], ["Reviewed December 24, 2017", 5.0, "What an amazing place !", "First visit here, what an amazing place, it's a museum of extraordinary imagination, wherever you look you see something different ! Guides are excellent, and a visit to the indoor pool is a must - great value for money"], ["Reviewed December 23, 2017", 5.0, "Nighttime Christmas Toyr", "This special seasonal tour is a real treat! Being on that hill at night with the castle lights is breathtaking. The tour with all the Christmas decorations and docents dressed as partygoers was wonderful."], ["Reviewed December 21, 2017", 3.0, "Excellent View of Pacific Ocean, Over hyped castle", "Over priced tours. Visitors need to take 3 tours to see the whole castle. Not because it cannot be done in one hour but to charge the visitor three times. Drive on CA-1 is beautiful. Must stop at Elephant seals bay which is 2 mile away from Castle entrance. If you ever been to Europe , this castle will disappoint.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Excellent Castle visit", "After 30+ years, we went back to Hearst Castle. This time, we took a private Art of Hearst Castle tour. Only 4 of us on a private tour through all the guest cottages, the main residence, up the many private rooms on the tower, the kitchen, etc. Basically all the many places at the Castle that you have to take at least 4 tours to cover. Even thought the tour lasts for 2 hours, you progress with an art experience guide at your own pace so there is a lot to see, which the previous time (only 2 tours), we only see part of the Castle. Once the tour completes, you are free to roam the outside as much as you want like any other tours. This tour is best for those loving art and history, as well as those wanting to see everywhere in the Castle. There are many nice rooms higher up the tower and the highest terrace just below the bell tower. It is a bit pricey, $100/person but if you add all the 4 tours, the total price is higher and it would take you much longer due to wait time for each tour. Yet, I am not sure if those tours cover in detail and all the rooms we have seen due to time constraint as well as the size of the group. Also we can walk around the indoor Neptune pool which other tour seems to allow to see on one side. As a photographer, I like to take picture from all sides, and of all the rooms without people in the picture. A plus for photographer.\nShow less"], ["Reviewed December 19, 2017", 5.0, "iconic architecture, local and national history, standout views", "Have been here several times. Once before it was open to the public (rushed), and on a private tour by a docent friend. Family has connections because of purchases out of warehouse (Alabaster staircase piece- now at the Madonna Inn [going upstairs to the gift shop] and a stone tithing barn from England circa1400s. There is a film of Hearst and Julia Morgan walking around the tithing barn in England circa 1928, before it was deconstructed and shipped to San Simeon at a cost of $100,000 n 1929.\nJulia Morgan (the castle architect) is just as interesting because of her many beautiful and stately California projects-including The Monday Club in nearby San Luis Obispo. if you like classic structures don't miss the studies of her works.\nThis is a fabulous peek at excess, the Movie, \"Citizen Kane\" a Hollywood take on Hearst (notice I've said H'wood) only adds to the mystique. Great gift area, many seaside hotels. Make advance reservations!\nShow less"], ["Reviewed December 19, 2017", 5.0, "Beautiful Buildings and Views", "I'm not sure exactly what I was expecting, but I was totally wowed by the beautiful buildings and the lovely views at the Hearst Castle property. We did the ground floor tour only on this visit and I definitely want to go back to see the upper rooms and the ancillary cottages as well. The views were just stunning from the top of the hill looking out to the sea. It would be easy to spend the entire day on the property.\nShow less"], ["Reviewed December 18, 2017", 5.0, "little taste of europe", "Reminds of the many homes and castles i visited in Europe. Enjoyed hearing about hearst history and seeing the grandiose architecture and decorating. outdoor pool is under construction so real bummer. expect months more prior to opening. indoor pool was open and beautiful and reminds me of roman bath houses. there are many different tours offered each $25 per person. if time perhaps see more than one if can afford it. i only did grand rooms. but bedrooms and others offered.\nShow less"], ["Reviewed December 17, 2017", 3.0, "Holiday Twilight Tour Hearst Castle", "As relatively new residents of the central coast, a friend and I took the Hearst Castle Holiday Twilight tour, expecting a unique, magical evening with staff dressed in period costumes and lavish holiday decor. We had both previously visited during the day on several occasions. And really looked forward to this special evening tour.\n\nThe bus trip up to the castle seemed a bit hair-raising at a fast 50 mph clip on the winding, very dark road. We exited the bus and began the climb up to the castle. The group was quite large, as we were included with the prior tour group, as apparently there was room on the bus.\n\nOur guide, Colleen, (dressed in all black and knee-high boots) struggled to make herself heard over the howling wind and provided very little information. Although she explained that the holiday decorations were “as they were in photos of the time,” she provided few details about what the Christmas experience was like- it would have been fun to hear more about the traditional celebrations, food, music, children, etc. She also could have benefited from a microphone!\n\nThe tour included the empty outdoor Neptune pool (almost invisible in the dark), one of the cottages, the Casa Grande rooms, the kitchen, theater, indoor pool and tennis courts. There was limited exterior lighting and few holiday decorations outdoors. There were some nice holiday decorations in a few rooms in the Casa Grande.\n\nWe saw no one dressed in period clothing (especially the security guard in his fluorescent green vest, lurking behind us constantly). It seemed like we were rushed through each room and we could hear more information being provided by the other docents before and after us.\n\nWe finally stopped at the theater to watch a short black and white film of Bing Crosby singing “White Christmas” (with “some actress at the time” that the docent did not recognize or remember).\n\nMy favorite part, (and this part was spectacular,) was the indoor pool at night. Overall, it was OK, but not what we expected.\nShow less"], ["Reviewed December 15, 2017", 1.0, "$30 TO CANCEL!", "Our granddaughter gave us 2 tickets as a Christmas gift which totaled $66.00. There was a death in our family which caused us to cancel the day before our tour & we got a $36.00 refund so we were charged $30.00 to cancel. Each ticket was $25.00 + $8.00 registration fee when purchased so it cost's more than the price of a ticket to cancel! What a rip off!! I've lived 30 miles from Hearst Castle all my life & was excited to finally visit but this just really left a negative impression for me, so now this is one place I no longer care to visit! $30 just to get a cancellation # that took all but 5 seconds is a bit extreme. Disgusting!\nShow less"], ["Reviewed December 13, 2017", 5.0, "a Visit back in Time", "I've been here several times over the years, yet always marvel at being back. Yes, there are many things that I remember, vividly, yet there are many new observations and the context of the tour guide enhances the visit.\n\nThis time we took two tours, and spent time at the visitor center. Watching the film is a MUST. I recommend seeing it BEFORE going on the tours, even if it means getting there early.\n\nBest to purchase tickets online, in advance of your desired visitation.\nShow less"], ["Reviewed December 12, 2017", 3.0, "Don't ask me for a donation", "Ok, great place in its time but sadly showing signs of age. Swimming pool under major constructions, broken tiles in the pathways. Many antiquities \"shoved\" into smaller rooms.\n\nGrounds very well kept up as such but what a shame place is run by California Parks and they collect all tour revenue only to hand back a minute amount for upkeep.\nSo 2 points\nChannel some of this revenue back into the Castle and surrounds\nDon't ask me for a donation to fund the\"plaything\" of one of the richest families in the US- let them put their hands in their deep deep pockets\nJust saying\nShow less"], ["Reviewed December 11, 2017", 5.0, "Legacy of Great Wealth", "William Randolph Hearst used his wealth to pillage estates in Europe. He brought his treasures to Hearst Castle for display. Ostentatious doesn’t even begin to describe it. Unbelievable grandeur ripped from many historic places and melded into this. Still an active cattle ranch. There are several tour options. Taking several is worth doing. Wear comfortable shoes.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Must see!", "A gem on the Central California Coast! A must see if you enjoy Architecture- a creative collaboration of Art and building- treasures from Europe worked into a desirable central California coast landscape. The views are magnificent. Hard to take it all in on one tour. You may want to allow time for more than one tour.\nIf you take one of the special Night tours you may want to find out what time the Gift SHop closes- after our tour- all the shops were closed so you couldn't buy a pretty gift item or book or nothing...\nAlso be sure and book tickets early for your desired dates- tours do sell out- so don't plan on just showing up last minute if you are only in the area on specific days.\nThere is a tour for those that are mobilly challenged so be aware of that as well.\nShow less"], ["Reviewed December 9, 2017", 4.0, "Regal castle", "Amazing regal essence and royalty reflecting everywhere. We took the Grand rooms tour and were amazed at the passion with which the castle was built. Definitely to be visited at least once."], ["Reviewed December 8, 2017", 5.0, "Magnificant Castle on the Hill", "The Hearst Castle has always been a favorite destination, we have been there four times. The setting is so lovely perched on a hill above the Pacific Ocean and rolling hills. The structure is a modern day castle with all the exquisite art work and history to go along with it. It is where the newspaper mogul, William R. Hearst entertained his Hollywood buddies. It has been donated to the State of California and is maintained impeccably. Each time we go, we see more and more areas that were not previously open to the public.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Great piece of modern American history", "It is the second time I visited the castle on my US visit it doesn’t disappoint. No expense spared in making this a home for the mega rich Hearst who invited many of the celebrities of the day to many parties. Lots of stories well told by the guides.\nShow less"], ["Reviewed December 4, 2017", 4.0, "Opulence-Bring a Jacket!", "This place is ran by California State Parks and they have taken very good care of it. There are quite a few steps no matter which your you pick. Bring a jacket because it is windy and cooler than down by the visitors center where you catch the bus to the castle at. Lots of great gift store items and nice area to familiarize yourself with the Hearst Family before the tour starts.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Beautiful Views!!", "This is a must visit if you're in the area. The views are amazing. Very well kept house. The tour is very informational. A place you will not forget you visited."], ["Reviewed December 3, 2017", 5.0, "Enchanted castle feeling, I liked it", "I would like to react on the negative comments which said that it is hardly a castle, and it has ridiculously arranged artifacts from different places and ages all over the place, and lacks taste. Don't let these negative comments discourage you from visiting the place.\nI am from Europe and did a lot of traveling in Europe and saw many of the most famous old historical castles and palaces there. I agree, that Hearst Castle is not like those and it is not a castle in the European sense. But I think if you are visiting the United States, you probably shouldn't expect to see old European style castles. I actually found it quite interesting how eclectically everything was organized, to me the whole place had a little bit of a surrealistic feel to it, it felt like visiting an enchanted castle, where everything turned upside down, or a little bit like a movie set of a fantasy film, or as if I just had walked into one of my favorite childhood tales. You could never see anything like this in Europe, just like you will never see an actual 500-year-old royal castle in the US. So I think that is why it could be very interesting to visit here.\nThe owner, Hearst was also an interesting figure, if you know a bit more about his personal history, you will also appreciate Hearst Castle more. And if you like films, you will be excited to know that Xanadu in \"Citizen Kane\" was actually inspired by this place.\nAfter your tour inside, you can take your time to wonder around the big garden and the pools, which could be really pleasant in nice weather.\nOverall, I enjoyed the visit, I think it was a unique experience.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Art of San Simeon Tour - good for private visit, disappointing on art side", "I didn't want a \"mass\" experience, or to have to choose between either the grand rooms or the cottages or kitchen. As it was, we got to see all of that and more, with a guide who was extremely friendly. However she wanted to show us so much, we didn't get much time in any room, or much explanation of the art. In fact, I didn't get the impression that it was an \"art\" tour - the people in the group knew as much if not more about the art we were being shown than the guide. Still worth the extra, just for the \"insider\" experience. And the place certainly is a show-stopper, the views fantastic, and the story too much. So all in all I recommend this tour nevertheless.\nShow less"], ["Reviewed December 2, 2017", 5.0, "One of my favorites", "I have probably been to this beautiful spot 20-25 times. I never get tired of going and I always learn something new. This trip was no exception. We took the \"Kitchens and Cottages\" tour this year. Our guide Chuck was great, as the majority of the guides are. They have added a fun feature, now after you finish your day time tour, you can stay and walk around the garden areas. They have provided wicker type furniture with umbrellas for you to sit and enjoy the hilltop. Such a simple thing but yet so wonderful! Next year I'm bringing a book so I can sit and read on one of the benches! When you are ready to go you head to the indoor pool and catch a bus back down. Go see it and watch the movie in the visitor center.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Unique setting and facilty - Great in off-season", "We intentionally visited the week after Thanksgiving when their are no crowds or crowded roads. The entrance fees ($25 per person, lower for children) may be a barrier for some, but the $8 in-advance reservation fee per person is outrageous. It was implemented this past summer by a new management organization that took over the administration of the facility. Unless you go during the peak summer season, there is no need to reserve tickets.\nThe entire staff - reservation clerks, bus drivers, tour guides, security guards, and maintenance personnel - were all very competent and friendly. The bus rides both up and down the mountain were breath-taking -- we visited on a very clear blue-sky day with not a cloud in the sky. As mentioned by other reviewers, our one-hour tour guide leader for the Grand Rooms was entertaining, funny, knowledgeable, and responsive to any inquiries made by our group.\nBecause of the partial closer of Route 1, north of the castle, we were told tourism is down 15-20%. We took route 101 fro SF area and cut across on Route 46.\nIt is certainly a unique facility and worth the trip.\nShow less"], ["Reviewed December 1, 2017", 5.0, "A must see for anyone who visits California or the US!", "I can not describe it in words. Utterly wonderful experience and get to see priceless arts and rare objects..the view from the castle is spectacular.\n\nI randomly chose a month and an year but I visited many years ago...but have sent many a friend and visitor there. All of them loved it!\n\nAll I can say is just go there!\nShow less"], ["Reviewed November 30, 2017", 5.0, "What can you say it's Hearst Castle", "This place is awesome. It is what happens when the owner has to much money. I is a must see for everyone."], ["Reviewed November 28, 2017", 4.0, "A tour of the Castle", "We arrived too late to get a tour, but the lady at the information desk was very helpful in finding a place to sleep that night. The next day we toured the Hearst Castle for about two hours. We walked around the outside as the tour guide described the grounds. We went inside and toured the lower rooms. Back outside we could walk around as much as we wanted. The outdoor pool had been drained for repairs. You could not go into the guest cottages, but could look through the windows.\nNone of the cottages had any cooking facilities. Mr Hearst expected everyone to dine together in the big house.\nThere are three different tours you can take.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Do not miss this castle! highly recomended.", "This was the first time for wife and i at hearst castle and we loved every minute of it - from the friendly couple at the help desk, trough the movie that explain hearst family's history and finaly the great tour inside the castle with all the details that spice the tour plus an absolutely amazing view.\nShow less"], ["Reviewed November 26, 2017", 5.0, "The Castle By The Sea", "An estate steeped in history and intrigue. It’s located in the mountains of central California on the Pacific coastline. The experience reveals stunningly beautiful architechture in a dreamlike setting. Pure California. Happy trails."], ["Reviewed November 25, 2017", 5.0, "Christmas at the Castle!", "This was my first time at the Castle and I absolutely loved it! I took the Holiday Twilight Tour and loved the Christmas decorations that were up! It had two big beautiful Christmas trees and poinsettia arrangements though out the rooms we toured. The tour guide was very knowledgeable and had a great personality. I will definitely be returning to take a day time tour of a different part of the house and to see that beautiful Neptune pool when it is finished! (It has been under restoration). I would also love to see the view of the ocean from the Castle!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Holiday Tour Is Amazing!", "We have done several tours over the years of the castle but this one was the best. Going after dark is a real treat. And seeing the rooms decked out in holiday decor was really special. We highly recommend this tour!"], ["Reviewed November 25, 2017", 5.0, "Loved it", "My friend and I absolutelty loved Hearst Castle. We did the Grand rooms tour and our guide was really knowledgable and friendly. We pre-booked our tickets for the 9:40am tour but we weren't really sure where we needed to be at that time. Turns out the bus leaves the main centre then so make sure you are in the queue to collect tickets well before your tour time because they will leave without you.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Everything and MORE", "I grew up on the East Coast. Hearst Castle was a long time goal of mine. It did not disappoint.\nSo much to see, try setting up time for 2 of the walking tours, each goes to different rooms and have different focus.\nAs you walk try and imagine the castle filled with brilliant minds and glamorous people socializing.\nEven the bus ride from hospitality center to the castle is fun.\nShow less"], ["Reviewed November 21, 2017", 4.0, "Hearst Castle is worth a visit", "Reservations that can be made online are highly desirable. We made them the night before and were able to get on a 10 am tour of the great rooms the next morning. There are many different tours, but for the first time the great rooms tour is recommended. There is quite a bit of stair climbing but well worth the visit. The rooms are huge and are filled with imported ceilings, furnishings and painting from Europe. The house was 28 years in construction and still not finished.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Spectacular House! Spectacular vistas!", "My wife and I recently toured Hearst Castle. We took 2 separate 1-hour tours - The Grand Rooms and the Upper Rooms. Highly recommend both. Years ago I took the kitchen and cottages tour. I also highly recommend that tour. It's a spectacular site. The rooms are unbelievable. The furnishings and art are incredible. The history of the place and its connection to American history are without parallel. The glamour of the place and the movie stars who used to part there is amazing. What's especially incredible is that the vast majority of the place is in its original state from when it was occupied by William Randolph Hearst. I've been to many castles and chateaus that have been rebuilt or re-furnished to simulate its original state. Hearst Castle is one of the few where almost everything is original. And then there are the spectacular views and the incredible drive up to the mountaintop where the castle is located. Wow! It is definitely worth a visit and count on spending a few hours there. Don't miss the 45 minute film on the building of Hearst Castle at the visitors center. It's shown on a 5-storey tall screen! The clarity and production values are unbelievable. A lot of serious money was spent making the film and it is very, very interesting. Also check out the exhibit on the history of Hearst's media empire that's located at the back of the visitor's center. Also very interesting with lots of fascinating photographs and equipment from the early days of radio and newspapers.\nShow less"], ["Reviewed November 19, 2017", 4.0, "The \"castle\" at night...", "We went on the day time tour many years ago and thought we would try the night time tour for a different vantage. The fun part of this tour is hearing the stories of the Hearst family while imagining living \"in the 1930's\". This is accomplished by volunteers who dress up in 1930's attire and roam the many opulent rooms in the \"castle\". The tour guide was very informative about the history of the family, construction, etc and was always happy to answer our questions about this fascinating family. My recommendations in the fall is to wear a warm jacket, comfortable walking shoes due to the many steps, bring a flashlight to see the outdoor statues better, and eat before you get to the visitor center. There were only cold food items when we took the 6:10pm tour and no food, or drink (other than water) is allowed. Currently the large outdoor pool is still under renovation.\nShow less"], ["Reviewed November 19, 2017", 5.0, "quite the amazing residence", "I really loved seeing this \"dream\" residence of WRH. I wish I could go again and take other tours (took \"Grand Rooms\"), but after the tour they allow walking about the grounds for vistas & pics. WORTH the time."], ["Reviewed November 18, 2017", 5.0, "Sheer Indulgence ... Highly Recomended", "I visited Hearst Castle as part of a tour .... It was interesting to hear about how it was built and you can imagine what it would have been like in its hey day with its famous. guests wandering through the rooms. The indoor pool is straight out of the Roman Empire. Definitely worth going to see!!\nShow less"], ["Reviewed November 17, 2017", 5.0, "Amazing", "I recommend tickets in advance as they do sell out. There are several tours to chose from. Once the tour is finished, you can walk the property. Definitely see the video before the tour. It's about 20 min. and gives you some background into Randloph Hearst. Gift shop is also worth checking out. You can also get food there.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Upstairs tour was great!", "This was our first visit to Hearst Castle. Most people start with the main downstairs tour, but the upstairs is cool because it has all their intimate living spaces- bedrooms and the very cool libraries. We took the last tour of the day, so it was nice and cool, and very few people. We had a great tour guide Jeanette- entertaining and informative. Unfortunately the main pool is being renovated, but the indoor pool was fun to check out. On the bus up from the visitor center there is great narration by Alex Trebec. There is also a lot to see at the visitor center, with a 40-minute movie.\nShow less"], ["Reviewed November 14, 2017", 5.0, "We did the upper room tour! Best way to see the castle at sunset! 3:20pm tour highly recommended!", "My wife and I missed the tour from the day before so we had to go back and book a tour of the castle the next day. We bought our tickets online. They charge you a extra $16 online. They also have 3 different tours for $25 each per adult. You can’t see the entire castle in one day. We booked the upper room tour that was awesome to see the sunset above the clouds looking down on the ocean. Walking threw the castle you can feel all the energies and parties that went on there. You can take all the pictures you want ( with the flash off) inside and outside the castle. We only had about 8 people on our tour on a Monday afternoon. You can definitely go back in time by seeing all the historical art and items in the castle. If you want to know the real facts about the Hearst castle google William Hearst Illuminati and all the true information they don’t tell you will make the experience a little more of a eye opener! Thank you to all the employees of the Hearst Castle that made our tour a great one!\nShow less"], ["Reviewed November 13, 2017", 5.0, "Well worth the effort to get to", "It's about half way between San Francisco and Los Angeles and takes some time and effort to get to but it is quite a spectacle and well worth it especially for anyone with an interest in Hollywood and entertainment history. The main building and cottages are very well kept and National Parks as always does a great job looking after the site and running tours. The web site encourages you to book ahead and there is an extra change for booking online but unless it is high summer you can probably just turn up like we did and buy tickets on the day of the day before. Neither tour we took was fully subscribed. The views from the castle are awesome and the whole area and the coast are lovely.\nShow less"], ["Reviewed November 13, 2017", 3.0, "Excessive FEE-GOUGING would make capitalist Hearst proud!", "Online purchasers are charged an exorbitant nearly 30% fee for tickets, and the same again to change them. Hearst would certainly approve of ReserveAmerica's \"hookers and scotch\" sweet-heart back-room shady political deal to fleece the citizens of California-who own the place to begin with! Just Google \"ReserveAmerica scam\" if you don't believe it. Other than that bit of robbery, it was a great trip! Monitor the tours on the web-page and buy tickets on site if you don't want to contribute to straight-up graft.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Great tour guide at an exquisite attraction", "This is just a fantastic attraction. From the drive up to the castle where we saw a multitude of zebra grazing with the cattle to the castle to the indoor and outdoor pools everything is top notch. Our tour guide was one of the most informative I have ever run across. He made it sound like he was a close confidant of Mr. Hearst. For pure opulence this is in the same class as the castles of Europe and the Biltmore in North Carolina. Great attraction for all ages.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Evening Tour", "We did the evening tour, after sunset. So you do miss seeing much of the gardens and grounds that are not illuminated. However, there is an appeal of seeing the buildings at night, especially the Roman pool with the alabaster lamps."], ["Reviewed November 12, 2017", 5.0, "A must to see", "An extremely well organised facility. Well worth the $25 cost to view this eccentric millionaire folly."], ["Reviewed November 10, 2017", 5.0, "A place to visit", "The garden is gorgeous and so peaceful and we could stay there as long as we wish. The visit is well organized and informative. We especially love the inside pool."], ["Reviewed November 9, 2017", 4.0, "Interesting", "My husband and I did the Grand Tour with our birthday girl grandaughter (6). The tour was really nice and informative, lovely areas to see and after the group tour you are free to roam the grounds. Our granddaughter was fine for the 3 hours we spent there but I would not highly recommend this for children.\nMy husband and I hope to do some of the other tours soon. Two thumbs up to this fabulous castle and the story behind it.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Fascinating", "Very interesting place to visit. You are touring a museum with all the architecture and tapestries and signs of exaggerated lifestyles. They give great tours, we did the main rooms and you see a lot. Highly recommend,"], ["Reviewed November 8, 2017", 4.0, "Amazing!!!", "Truly an incredible castle! Was $25 per person for the tour of the Grand rooms. The grounds are stunning with beautiful flowers everywhere, gorgeous pool and tennis courts and a spectacular view of the ocean. Bummed that the Neptune pool is closed, that is the best site at Hearst Castle.\nShow less"], ["Reviewed November 8, 2017", 5.0, "An astonishing showcase for great art.", "This wasn't at all what we expected. We thought it would be an example of nouveau-riche excess, but it was closer to a museum of European art and architecture. Hearst demonstrated a great love and knowledge of art and it shows in every room. Each has been carefully planned to display his vast collection of artefacts\nIt was well worth paying for the tour of the grand rooms and the tour of upstairs rooms. The guides were knowledgeable and friendly and the tour groups well organised and small enough to make the stroll from room to room easy and unhurried.\nI found it very hard to stop myself from diving straight into the beautiful indoor pool.\nThe whole experience was slick, well timed and comfortable. The film is worth watching. It doesn't really matter whether you see it before or after your tour.\nThe one warning I would give to future visitors is to have a really good breakfast and plenty of water. It can be very hot in the grounds in good weather. Take water with you. Nothing else is permitted up at the ranch, but the cafe at the visitor centre is well stocked.\nShow less"], ["Reviewed November 8, 2017", 2.0, "Go before more degradation", "I last visited Hearst about two years ago, and again this Oct. I noticed quite a bit of changes ( for the worse) or should I say deterioration with the main building and the indoor pool.\nMy mother visited Hearst castle in the early 70s and her pictures of the main house once again show a much different ( brighter, less deteriorated) image from today.\n\nSo go visit this legendary place and experience the history before it get even worse.\n\nThe Great hall tour is a huge tour. One tour guide with I would say close to 70 people. So much so that not everyone can be fitted on the obligatory grey carpet and we all have to stand on. Try to hear the tour guide, forget about it if you are towards the end the group. So be aware of that.\n\nThe Upside stair room is a gem. Much smaller group, the tour guide usually have more time to explain and add on his or more expertise regarding Hearst and the pieces he purchased. There are a lot of story written about Hearst is there is not much addition a tour guide can made, but for those who have not read them, this is a good tour. For example, this time, our lady tour guide told us that the guest do not really sleep in their beds, their party all night. She was referring to Clark Gable and Lombard (sp)\n\nSimilarly with the cottage and Kitchen tour. You get to know the man and the designer much more.\n\nI noticed that there are quite a few of younger tour guide this time, count yourself lucky if you have one of them as guide in your group. I found that they are much more enthuse and express genuine interest in ensuring you are happy with the tour.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Historical and Iconic Landmark", "We took the Grand Room Tour which was highly recommended for first-time visitors. I'm not a first-time visitor but my family guests are. Nonetheless, I'm still awed if not inspired of the whole experience. The staff members from the visitor center, ticket counters, tour buses, movie theater and museum, and tour guides are warm and accommodating, genuinely friendly and helpful. The more than three hours road trip from the Bay Area to San Simeon is all worth it even for just visiting the Hearst Castle. The $25 admission fee per person is more than reasonable and worth it. If you or your guests are physically challenged, make reservation for the ADA accessible tours. Extra care and attention are provided to ensure that the physically challenged visitor enjoys the same areas inside and outside the castle without taking the stairs. Advanced reservation is highly recommended.\nShow less"], ["Reviewed November 7, 2017", 3.0, "Interesting & grand but tour should include more of the property for the high price", "The price you pay per person is for only 1 section of the property. If you want to see the entire property, it will get expensive. As for the tour, I couldn't hear very much because there were too many people plus listening would have prevented me from actually taking it all in. I would have preferred to have an ear piece and to go at my own pace, or an informative handout. They make a big deal about the architecture and decor, but to me it looked like a mix of way too many conflicting styles, and someone who just wanted everything fancy and grand in one place regardless of how it meshed together. The buildings don't match at all. Anyway, I liked the movie and wished I could have seen more of this type of material - photos and movies of the property being used back in the day. For example, show images or movies of the zoo animals in their zoo area, or the horseback riding adventures on property. I can't give it a very good since the price isn't justified. The tour should include more of the property for the price and content was missing about how this place was used.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Cottages and Kitchen tour", "I think Disney is wrong as this is the most magical place! Our third visit and the last tour we hadn't done and it's just as good as the others. I really love this place and couldn't imagine not visiting when in California."], ["Reviewed November 5, 2017", 4.0, "Good activity", "We took the Grand room tours and it lasted 45 minutes. The guide was dynamic and well informed. Beautiful place with a nice story behind it. I would recommend to view the movie before taking the tour.\n\nI couldn't help but to notice that no french or spanish guided tours are offered. Might be a problem for tourist or people who have difficulty with the language.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Beautiful, historical place, prepare to stay at least 3 hours.", "If you a driving far to come here and then turn around know that you'll want to allow for at least 3 hours or so for your visit. This place was bigger and more grand than I expected and the experience more elaborate as well. You show up at the visitors center to buy your ticket (there are multiple tour options). Each tour is 25 each which helps keep up the property. If you've never been the Grand Rooms your is recommended. You board a bus that takes you on a 10 minute or so drive up the hill. The tour is about and hour and is informative. After the tour you are allowed to wander the grounds at your leisure. To board the bus back down the hill you walk through the underground pool which is a great finale. The art, sculptures and details everywhere are amazing. Back at the visitors center there is a 40 minute movie that is included with the price of your ticket. There is food you can buy there too at the visitors center. I look forward to coming back again!\nShow less"], ["Reviewed November 4, 2017", 5.0, "Everything I hoped for", "Traveling @ 7 months pregnant with my husband and 3 boys ages 8, 6, 3. We initially planned to just do the Grand Rooms Tour, but decided to add the Upstairs Tour and I'm so glad we did! I was initially intimidated by the # of stairs on each tour but even doing the two back to back tours I could have done more. The stairs are pretty spread out so they weren't a problem at all. The guides were very knowledgeable and animated which kept my older boys (and my) interest the whole time. There is no food allowed after the visitor's center so advise eating before catching the 15 minute bus to the top. Also if you buy your tickets right there at the VC you save $8 per ticket due to the online processing fee. I kept checking the website for tour availability to make sure we would be OK waiting until the day of to buy our tickets. Children can also get a booklet at the VC and earn a Junior Ranger badge during the visit.\nShow less"], ["Reviewed November 2, 2017", 5.0, "WOW! A bucket list must see", "Coming to Hearst Castle is an exciting experience from the minute you step on the bus and wind up the mountain to this historic landmark. We took the rooms tour and was amazed at the opulence of this powerful family. The artwork, statues, and tapestries were incredible and if you are an art lover well worth the price of admission. Our guide was extremely informative and answered all of our questions. If you are in California you must put Hearst Castle on your bucket list.\nShow less"], ["Reviewed November 1, 2017", 5.0, "A one of a kind attraction", "Hearst Castle is one of the most fascinating places in California. It can be overwhelming, because there really is so much to see. Firstly, it's impossible to do it in one day, so make sure you choose one of the tours that best fits your wants.\n\nAs you walk across these grounds, you'll see amazing architecture, wondrous works of art and amazing pieces of history. It's really like being transported to another world.\n\nIf you're driving down the California Coast, you need to stop here. I can guarantee you won't regret it.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Absolutely Amazing Property", "There are not enough words to describe how amazing this Estate is. Had an extended, smaller tour which was awesome and SO informative. This attraction is worth the amount charged for admission and more. So hard to comprehend how someone could live in this amount of wealth! Loved every minute of the tour. Will remember this tour for a long time!\nShow less"], ["Reviewed October 31, 2017", 4.0, "Glad We Went but No Need to Go Back", "On a recent trip to Monterey we decided to take a day trip a couple hours south and see the Hearst Castle. When I was a child, many years ago, I saw photos in a book of the castle and still remember them to this day, Now, finally, decades later I was going to see it. We booked tickets ahead of time to make sure we were able to take the Grand Rooms tour. The tickets are $25 per person, per tour. We booked only one of the tours. There is an outrageous fee of $8.00 per ticket when you book online which I believe is really out of line (first complaint).\n\nWe drove to Hearst Castle along the 101 as Hwy 1 is still closed. That's my second complaint although it has absolutely nothing to do with Hearst Castle. Following the coast from Monterey to San Simeon would have been much enjoyable. Before going, check with the State of California DOT before setting your route.\n\nWhen you arrive at the visitors' center, one exchanges the voucher for the tickets. In our case, we had time to view the included film about Hearst's childhood and the building of the Castle prior to our tour. The film is a bit less then 45 minutes. My husband enjoyed the film more than the tour.\n\nAfter viewing the film, we boarded buses to take us up the hills to the Castle. The drive is steep and winding but the drivers seen to have it down to second nature. Upon arrival, one meets the tour guide and it's off to visit the main rooms of the main house. Here's complaint three and four. Three: The Grand Rooms tour is too big, approximately 50 people and that means waiting, The read that the bedroom tours and the other tours offered are about 15 people max. That seems more like it. Four: There are no combo tours. We would have probably taken a combo if they offered it, like Grand Rooms and Bedrooms if it was offered. Since we didn't know how the time would go, we didn't book back to back tours. A combo tour would have come in handy.\n\nThe castle itself is very impressive especially already having seen the film. The Grand Rooms are certainly grand. I enjoyed it very much. My husband less so as having toured Buckingham Palace and other castles, he wasn't overly impressed. He said it was alright and he was glad we did it but there wouldn't be a need to return.\n\nComplaint # 5, the outdoor pool which incidentally was one of the photos I saw as a child is still closed for repairs and isn't expected to be completed until January 2018. We did get a chance to see it but it's empty and there is a lot of construction materials around.\n\nAfter the tour, one is allowed to wander the gardens as long as one likes as there is no set return time for the bus. They run every 15 - 20 minutes, Of course, one can only wander so long without guidance to know what one is looking at. Then it's back on the bus and a return to the visitor center. We thought about eating there as it was past noon but decided to look for something off property after viewing the selection and the (over)pricing.\n\nPositives: The guides are very friendly and knowledgeable. The main house is very impressive and the history is well worth the price. All in all, I am glad that we went and I was able to see some of those photos from my childhood in reality. We won't go back but we're glad we went.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Absolutely amazing", "If you like gorgeous grounds, tons of art, and decadent houses, you will love this place. Watch the 40 min movie in advance of your tour and you will enjoy it all more. We took the Grand rooms tour and it was great. Hearst was a bit nutty but he sure had a vision and the conservation on his home is great. They are truly keeping it for future generations to enjoy. If you don't like heights, don't sit on the window side of the bus that takes you from the visitor center up to the house, scary and twisty ride!!\nShow less"], ["Reviewed October 30, 2017", 5.0, "Highlight of our vacation", "We loved this tour of the castle. We took the upstairs tour of the suites and bedrooms. This also included the pools. There is a lot of stairs so if you have trouble walking then this might not be the right tour. We had a couple of people in our group that shouldn't have taken this tour. They were having trouble with the stairs. They do have a tour on the ground floor that might be better. Each tour is $25 a person. Eat before you go. To give you an example of the prices of food an egg salad sandwich is $10. Soft drinks were over $3. They will take your photo for $32. You get several pictures but it's not worth $32, The gift shop is expensive. They do have some key chains that are affordable. A bus will take you to the castle. It is a curving road and takes about 15 minutes. The tour is a little over an hour. You can spend as much time as you want walking around the castle. This was so enjoyable. I would do it again if we are ever in the area .\nShow less"], ["Reviewed October 27, 2017", 5.0, "A \"Must-See\"", "We took the Grand Rooms tour which basically allowed you a guided tour of the grounds and 5 (I believe) rooms on the ground floor. The tour, which begins at the visitor's center, starts with a bus ride to the top of the mountain, where you are greeted by your tour guide. It takes about an hour and there are many stairs involved. I have had two knee replacements within the last year and made it fine. There are also several opportunities to sit down during the tour. Our guide, Mary Ann, was warm and professional. She imparted a lot of interesting information and was open to questions throughout the tour. After touring the grounds and rooms, you are then allowed to wander the grounds at your leisure. The views from the top are awesome. I am so glad we exited through the indoor pool, because it is a show-stopper. Note: the bus ride up and down can cause some consternation if you are a squeamish passenger like me.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Amazing property", "Being British, we had never really heard of William Hearst, but it seems as though he was very well known in the US. In today’s terms the guy would have been a billionaire, and he got rich from a media empire he built in the early 20th Century. He used his wealth to build an amazing stately home at top of a massive hill, overlooking San Simeon bay.\n\nWe took the “Grand Rooms” tour. There were others, but we found this one was the right length. The tour guide was very knowledgable and gave a very interesting talk as we walked around the property. The house itself is huge and it would probably take several visits to adequately explore all of the property.\n\nWe turned up at 9:30 AM and were told there were no tours until 11 however this turned to be in advantage as we went to the theatre and watched a movie about William Hurst and his life while we waited. The movie theatre is something to behold in its own right. It’s the biggest non-IMAX screen we’d ever seen, and the film about Hearst is a multi million dollar production, shot on location in the US and Europe. Definitely would recommend seeing this prior to your tour if possible.\n\nShow less"], ["Reviewed October 26, 2017", 5.0, "Must see, but book in advance", "If you in the area, you mast visit Hearst Castle. We took a Grand Rooms tour and loved every moment of it. Our tour guide Elaine C. was very knowledgeable and told us many interesting facts and stories about the castle and people who lived there and visited this place by owner's invitation.\nThe view form the castle was spectacular.\nSpecial thanks to all staff: drivers are highly professional ( the road to the castle is very curvy!) and the rest of the crew were extremely nice and helpful.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Great Kitchen and Guest Cottage tour", "This is our third trip to Hearst Castle. The tour of the kitchen and guest quarters permit us to see the behind the scenes operation of the castle. The wine cellar has original bottles and tells a story of the life. We have enjoyed all the tours.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Awesome Views", "My family and I did the grand rooms tour which enabled us to see all of the largest rooms in the main area. Before we even got to the tour though the view driving up to the castle is amazing."], ["Reviewed October 23, 2017", 5.0, "Still Awesome", "There is always something new and interesting when we tour Hearst Castle. The Visitor Center is excellent. THe movie is a must see before you tour the castle."], ["Reviewed October 23, 2017", 3.0, "Tells a good story ...", "The film is an excellent introduction to the story of how Hearst came to his riches, and why he built the 'castle'... We felt it a shame that you couldn't wander around the whole place in your own time, instead you have to opt for one of several trip options.\n\nOur guide was good, though to be fair we thought that he was only repeating a lot of what we had seen in the film. The story is an interesting one, the position is stunning and the buildings and their contents certainly live up to the story of creating a treasure trove of decadence for the delight of Mr Hearst's many famous guests.\n\nFor me the highlight was the beautiful indoor pool - which ironically was not part of our chosen tour.\nShow less"], ["Reviewed October 22, 2017", 5.0, "A complete WOWZER!!!", "It's a must-see site, even if you only have time and money for one tour, it's truly a must. If you go in high season, advance reservations are recommended, but I must say that paying $8.00 / per ticket for an advance reservation is highway-robbery!! Shame on the California State Park System for charging such an exorbitant price. Fortunately, we visited in October and not in the high-season, so we decided to take a chance and not buy advance reservations on line ... and we saved $32.00!!! Get with it, State Park System and stop gorging the public!!!\nShow less"], ["Reviewed October 22, 2017", 5.0, "A real gem of the Belle Epoque times", "This Castle is a real jewel of the old good times.\nIt used to be the residence of the tycoon William Randolph Hearst!\nThe architecture of the castle is just wonderful and from the top of its hill you can enjoyed a wonderful view of the bay!\nI highly recommend a visit. The tour is also very accurate and you can learn a lot about its history and celebrities who use to stay there.\nShow less"], ["Reviewed October 21, 2017", 5.0, "If you do nothing else in San Simeon you Must do Hearst Castle", "To say this place is AMAZING is an understatement. I could go on for hours about the place but it has to be seen to be appreciated - so go do it if your anywhere near the area, you will not regret it. We booked the morning 'Grand Rooms' Tour, actually turned up the day before we had tickets for but the staff were so helpful they just put us on the next tour! We loved it so much that when we returned to the visitor centre we asked if there was availability for the 'Bedrooms' tour, there was for the early afternoon so we just had time in the shop (some lovely souvenirs & very nice t-shirts) & then had lunch there in the restaurant which was extremely good. The afternoon tour was as good as the morning one & I would go back again if ever in that area. The gardens & statuary alone are worth the visit.\nYou really need to watch the film in the visitor centre about how it all started before you do the tour though.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Amazing", "Hard to believe he started this project at 58 years old! You need to watch the film clip about how it all started before you do the tour. Breathtaking rooms, over the top in furnishings. The gardens are beautiful , have to check out the marble indoor pool. Well worth the trip.\nShow less"], ["Reviewed October 19, 2017", 1.0, "Overrated with unfriendly staff :(", "Overpriced with unfriendly staff. Very disappointing given how far we had driven to visit this place today. A local San Luis Obispo resident advised us not to waste our money, we should've listened.\nTips to improve... get the staff to lighten up, extend the shop/cafe hours so the last tour can have some food and drink after the tour, given its banned in the castle, increase the access during the tour - a wander through a few gardens and a couple of rooms is hardly a tour :(\nShow less"], ["Reviewed October 19, 2017", 5.0, "WOW...what a compound!", "It was our first visit. When we purchased our ticket, we asked what tour would be recommended. We did the Grand Room Tour. I have to give the ticket agent the nod as she could have recommended them all & it would have cost $$$$$$$$ as there is an additional cost for each tour. The reason for that is, there is SO much to see! The area in which we toured was something else. Randolph must have been quite the individual. Would have been fun to be his \"guest\" back in the day. The outside pool was under construction during our visit. Would be nice to see it when completed. If you plan to visit in the summer, there is NO air conditioning in the buildings. After the tour, you are free to spend as much time as you like on the grounds. Glad we took the time to visit!\nShow less"], ["Reviewed October 19, 2017", 5.0, "Amazing Place", "I didn't know what to expect after visiting castles in Europe. To think one person's vision is Hearst Castle is beyond anybodies imagination. Our tour was of the ground and first floor of the building. To see anything further is another admission price. One room was more over the top than the next. Carved wood ceilings and tapestry from all over the world. This is a place that cannot be evaluated monetarily and to think the family donated it to the state of California is extraordinary. A definite must see.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Checked off my bucket list", "I have wanted to visit here for 20+ years. While the day we visited was HOT (100 degrees), we very much enjoyed learning about the homestead and the people who lived there."], ["Reviewed October 18, 2017", 2.0, "Here's to you, Randolph!", "Made an involuntary 33 USD donation to this monument of conspicuous consumption on Oct. 16. Everybody talks about the need to make reservations. So I did. Nobody talks about the Big Sur road closure and the 4h30 detours to San Simeon. Driving in from Monterey I learned about this at the Big Sur gas station. Everybody else seems to know. Me, studpid foreign tourist didn't know. Hearst castle refused a refund.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Excellent", "We have visited Hearst Castle many times and have done all the tours. We did the Cottages and Kitchens today and our docent was Beverley. She was so knowledgeable but presented the facts with a brilliant sense of humour. It was great being on her tour.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Interesting but perplexing", "Good organisation , helpful staff , wonderful views, we loved the museum and the background information. We talked about the actual building and furnishing and it was that that perplexed us and made us feel uncomfortable. So many artefacts from other countries and cultures and all mixed up. Not sure what the aim was for the Hearst family .\nGood talking point .\n\nFood and drink was expensive and I suggest you take a picnic and eat in the grounds .\nShow less"], ["Reviewed October 17, 2017", 4.0, "Beautiful buildings, great tour", "Had a fabulous tour of the Great Rooms and self guided tour of grounds. The pool is still under construction and seems like it will be for a while yet. So many pieces of art jammed into one place and can be hard to take that all in.\n\n\nOnly thing I didn't like was the $8 fee per person for the Great Rooms tour when booked online. Only applies to this tour.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Spectacular!", "We did the Grand Rooms and the Second Floor tours as well as wandering the gardens and seeing the movie in the theatre. We spent about 5 hours in total and it was a wonderful afternoon. We had the same tour guide for both yours and she was fantastic- knowledgeable and very interesting. Highly recommended! Bring your water bottle.\nCostly but well worth it. It would be great if there were “tour bundles” at a discount.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Love, Love Hearst Castle", "I have been to Hearst Castle many times before and yet each experience seems different than before. Perhaps it is the changing weather, the tour guide or who I am with but with every visit comes a new discovery. From the drive to the castle to all of the incredible interior and exteriors, I highly recommend this California treasure to all. Enjoy\nShow less"], ["Reviewed October 16, 2017", 5.0, "Crazy but unmissable", "Everything about this place is a testament to wealth and excess. The juxtaposition of medieval church pews in a dining room is almost madness. The setting atop a mountain overlooking the Pacific is simply magnificent and parts of the estate are quite beautiful even though at times the eclectic miss mash of antiquities doesn't seem to be in harmony.\n\nMad King Ludvig of Bavaria couldn't have done a better job of assembling a building and artefacts in a more crazy or exciting way. Its the history and past use by famous people which adds the extra interest.\nOverall this is one place that any visitor to the Californian Coast really must try to find time to see, And the countryside around is so attractive with rolling hills and vineyards worth visiting.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Splurge Worth It", "We booked the 2 hour art tour. Essentially, we figured it was a once-in-a-lifetime trip for us, and my husband had been to the Hearst Castle, and I had not . While the price of $100 per person gave us pause, it was worth it. Our guide (sorry can't remember this lovely lady's name) was so interesting and showed us areas not generally seen on other tours. The casitas or guest houses where much of the living and partying occurred were fascinating. Our guide went into so much more detail as to the art (no surprise), architecture, history, and many other topics such as repatriation of art. Having seen many palaces throughout the world, this place is beyond belief as to craftsman's artistry, the massive collection of religious and other art,ugly centuries old furniture, and great Deco lamps. But loved the indoor Roman pool--what a Deco gem!\n\nPlus film at the end is very well done. There is a PBS documentary on the Hearst Castle that is worth seeing before touring the Hearst Castle.\nShow less"], ["Reviewed October 15, 2017", 5.0, "I love this place!", "We have been to Hearst Castle several times & we have enjoyed it every time. There is so much history in this place! So grateful Hearst acquired & preserved all the art, ceilings, furniture, statues etc., etc.! The State has changed the tour format over the years - tours used to be longer, but are now divided into shorter 45 min tours. The guides are very knowledgeable and personable. The grounds around the Castle are amazing and you are allowed to wander around after your tour. Spectacular views from up top! We love this place!\nShow less"], ["Reviewed October 14, 2017", 5.0, "Great tour - Marty is the best!", "After a small harrowing drive up to Hearst Castle (I don't care to drive on the edge...) the place is very well-preserved and tour just the right size (Big Rooms tour) for a family of 4 with 2 teenagers. Marty was our tour guide and added the right tone and presence for the tour. So glad we happened to get him. Amazing views when at the top and just in awe of all that Hearst managed to acquire in his lifetime.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Well worth the time!", "Visited Hearst Castle on 10/12/17. We booked the Grand Tour. The guide was awesome, so knowledgeable and funny! The rooms, grounds, art work and architecture are just stunning. Be careful if you call to order tickets. I almost paid an $8 per ticket service fee. Luckily, we went during the week and had no problem getting tickets. FYI, no AAA or senior discounts and the America the Beautiful National Park pass won't get you in free either. We arrived at 8:50am and got on the 9:20am tour. The Neptune pool is still under construction and is supposed to be completed in November. The indoor swimming pool is stunning though! The opulence is jaw-dropping. One tip, mornings are cold so bring a scarf or jacket! Even if it gets hot during the day, be prepared if you are on one of the early morning tours!\nShow less"], ["Reviewed October 12, 2017", 5.0, "Incredible!", "Our family loved! Expensive!!! Happy we only did a one hour as our kids were restless by 45 minutes standing and listening to things they didn't care about. But they loved seeing Hearst Castle and are ready to go back.\n\nFamilies with small ones, babywear!!! Life saver for this experience.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Spectacular home", "I finally got around to visiting Hearst Castle after living in Southern California for 25 years, and it did not disappoint.\nThe house is spectacular, of course. We took both the Grand Rooms tour our first evening, and then the Upper Suites tour the following day. If you were only going to take one tour, I'd recommend the Upper Suites, if only to visit the library and Hearst's office. Unfortunately the Upper Suites tour isn't wheelchair accessible - you have to climb very narrow circular staircases to get from one floor to the next.\nOur guides on both tours were incredibly knowledgeable and engaging. Also, on the Upper Suites tour when our guide was asked a question he couldn't answer, he made a phone call and immediately got the answer for us.\nAfter the tour take some time to wander around the grounds and go see the front of the cottages. When you go back down the hill to the visitor's center, give yourself enough time to go see the Building a Dream video - it's about 40 minutes long and very well shot.\nAnd while you're in San Simeon, be sure to go see the elephant seals on the coast. The visitor's center has information about what time of year the seals are there, and the vantage point is only about a 5 minute drive up the coast. Well worth seeing them if you can!\nShow less"], ["Reviewed October 10, 2017", 4.0, "Amazing place. Offers special tours for mobility impaired, too. One man's dream...", "This \"ranch\" is a unique property. The art deco era, Moorish decor, Medieval touches, Gothic---you name it--- all come together in a bizarrely beautiful way. The details of the purchases of these artifacts (ranging from Spanish choir lofts to Egyptian statuary to Belgian tapestries) is really interesting as is the efforts to marry the old with new. A fascinating glimpse into one man and his dream. The grounds and views alone are worth it. Free film screening comes with the tour. Docents are knowledgeable. Lots of rules so keep your kids under control. Accessible tours available for the mobility impaired. One caveat---there are several tours and you have to pay $25 for each. One is the Grand Rooms tour (recommended for 1st visit), also the upstairs suites, and Kitchen and cottage tour (there are three 500 sq ft \"cottages\"). And don't forget the zebras and the indoor pool with gold on the floors.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Great Place to See How The Other Half Lived", "There are several tours, by area, thru the mansion. I have been on the main level and Pool tours. Grounds are great to see. And you can still see several Africa animals, zebra and such, roaming the hill sides."], ["Reviewed October 10, 2017", 3.0, "Nice but...", "This place is an interesting piece of history. One rich man's idea of how to entertain and impress his friends and associates. Quirky of course, and quite opulent for the day but just like modern Hollywood, over the top and self-indulgent. It is a spectacular mansion and surrounding buildings, that is what one gets to see. However, to see more one has to pay more. The extra payments to get upstairs and the closed off areas diminishes the event markedly. And their suggestion for the first time visitor to just see the main rooms indicates a lack of understanding that most visitors are not local and are likely not to return. The tapestries are worthwhile but otherwise the art is not significant. Also, a lot of time is spent waiting for the bus to take you from the visitor center and for the return.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Very interesting place to visit!", "Very interesting place to visit. Different tours can be booked back-to-back. Tour guides are very passionate about the castle. The bus ride up/down takes about 15 mins each way. The walking tour has many stairs so wear comfortable shoes. Castle isn't air conditioned, so dress in layers.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Wonderful experience!", "My husband and I went to Hearst Castle Grand Room tour for our Anniversary weekend for our first time ever and it was beautiful. We enjoyed the view of the castle and the rooms. Neptune Pool was drained and being repaired. But got some great photos. We'll return when done for the Upstairs Tour.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Amazing property and valuable museum", "This was my first visit to Hearst Castle and really didn't know very much about William Hearst's family history. But after the tours, gained a new level of knowledge. The guides were very accommodating (we had 2 in our group who needed ADA access). There were beautiful gardens, cottages, pools and architectural designs. You were provided a brief history of Hearst's family and history in a movie at the visitor center. The gift shop was extensive and had a great variety to choose from. The ride up the hill to the castle gave an overview of the vast acreage the family had purchased many years before. I wished I could have done more tours - we did two but I would have liked to have seen the upstairs rooms. Well worth the price if you are in the area !\nShow less"], ["Reviewed October 9, 2017", 4.0, "Hearst Castle", "This place is really cool, but I don't think I go again. If you have trouble with walking, this might not be a good choice for you. If you have trouble with stairs, this might not be a good choice for you. And if you have trouble with following directions, this is not a good choice for you. When the guides tell you to stay on the carpeted area so you don't damage the original hardwood floors, you stay on the carpet. When they tell you not to set your stuff on an 18th century column of marble, don't give the guide a dirty look. But if you can behave, then take this tour. The views up on the hill are spectacular!\nShow less"], ["Reviewed October 9, 2017", 5.0, "Like it so much that this was my third visit", "If it's your first visit do the Grand Rooms Tour. Take the time to watch the movie about the building of the castle. Second visit was the evening tour where they have people dressed in the period that Hearst entertained many of Hollywood's best known stars. This tour was the Cottages and Kitchens. The docents are very well informed and bring to life what it was like to visit here. Be sure to get there early to have time for the movie and be transported up to the castle via bus.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Wonderful Tour of Upstairs Spaces", "My first time to the castle. Chip was our tour guide and did a phenomenal job. I loved seeing the intimate spaces and learning about the history of so many elements of the castle.\n\nAm looking forward to a return visit when the outdoor pool is completed.\nShow less"], ["Reviewed October 8, 2017", 4.0, "Incredible Property/Tour", "Visited Hearst Castle with my family in June 2017, and we call enjoyed our tour.\n\nHearst Castle is located near San Simeon. There are 4 different main tours, the daytime tours are $25 adult/ $12 children. The evening tour is longer and cost a little more and is only offered the last quarter of the year. The main tour is called the Grand Room tour and gives you a great overview of the entire property.\n\nAll of the staff and tour guides were super friendly, and very knowledgeable.\n\nYou start at the Visitor Center, which has free parking. You can purchase your tickets, shop at the large gift shop, grab a bite at the snack bars. There is a free 40 minute IMAX film, which is free with your paid tour ticket. The film runs every 45 minutes, and is a great way to start your Hearst Castle Tour.\n\nFrom the Visitor Center you’ll take a tour bus to the top of the hill to the Hearst Castle for your tour. The tour was awesome. The property was beautiful and well maintained. The tour guide did a great job of providing lots of information about the property, the design and the building of the property.\n\nThey also take a green screen photo before heading up for the tour. When you return you and look at and purchase the picture if you like.\n\nIf you are in the area, taking the Heart Tour is well worth your time and money. I’m looking forward to returning with my family for the evening tour.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Must visit", "Hearst Castle is one of our favorite places to visit when we have friends in town. Nice to see what money can buy you when your filthy rich. You stop at the visitors center and a bus takes you up to the enchanted hill. On your way up Alex Trebek tells you about the history of this landmark. Once you reach the castle the guided tours take about an hour and after that you can take as much time as you want to roam around and visit the magnificent pools. Beautiful art ,spectacular gardens. Being in shape helps, quite a few steps to conquer.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Amazing and inpressive", "This was an incredible day out. We had a tour of the ground floor and from the start of the bus drive up there we were learning all about William Hearst and Julia Morgan. The place itself is so impressive and as you wind round the mountain towards it you get this fantastic feeling of the 1930s. We were met by our tour guide (the wonderful Chuck Walker) who taught us all about the owner, architect and history of the artefacts inside and outside the building. He was a brilliant tour guide and really friendly and helpful, making the tour really fun. The tour is well worth the price, I would however suggest watching the film at the visitors centre first to get some background as I think we could have then learnt more of we had done that. Food in the visitors centre was definitely pricey, we got 3 drinks, 2 sandwiches and a muffin for $30 which I felt was definitely overpriced. Putting that aside though, this was an amazing day out\nShow less"], ["Reviewed October 6, 2017", 5.0, "Hearst Castle Visit", "Absolute amazing place with a lot of history which is related by the outstanding docents and guides. It takes at least for hours to do justice to this beautiful place."], ["Reviewed October 6, 2017", 5.0, "A must do", "On highway one 25 miles from morro bay book the grand tour rather than the others or maybe what you fancy whatever you chose allow 4 hrs . Tickets I got at the car park reception-$25 . Suggest watch documentary film first expertly produced and very interesting. Then out to catch bus for r a 25 min ride up 1000 feet to the opulent castle amazing artifacts statues opulence it was like a film set but real if you know what I mean. Gary our guide was clear and concise tour around 50 mins guide and then free to walk the gardens . This trip was worth it go for it !!!\nShow less"], ["Reviewed October 6, 2017", 4.0, "An American Original in Southern California", "The stories around Hearst Castle are fabulous with all of the wealth, movie stars and international glitterati of the 20's and 30's. The castle itself is larger than life and makes for an absolutely intriguing and awe-inspiring tour. The views of the ocean and the surrounding mountains are what caused William Randolph Hearst, one of the richest men in America, to build on the site.\n\nTip: Since the property became a California State Park, the amenities and programs have been substantially upgraded from a previously deteriorated state. There is an IMAX theater, knowledgeable guides and lots to see. If visitors haven't been there in recent years, they are probably out of date.\nShow less"], ["Reviewed October 5, 2017", 3.0, "Money spent but no Style", "Hearst Castle, first is not a castle at all but a large folly of a house built on a hilltop overlooking the Pacific Ocean on land acquired by George Hearst, Randolph Hearst's father who made his fortune from silver mining. Randolph the only son inherited the land from his mother on her death in 1919 and together with the architect Julia Morgan began the construction and development of what is today known as Hearst Castle. By this time Randolph was a newspaper publisher and movie producer, the Rupert Murdoch of his day an extremely wealthy man able to lavish a fortune on his pride and joy.\nHere I would comment that no amount of money necessarily buys you tasteful style and in many respects this is one man's mausoleum. Building continued throughout Hearst's life until his death in 1951 and remains uncompleted to this day.\nIt was to this house that Hearst invited the great and the good of his era to join him where they could wallow in his lavish benevolence.\nExternally the house has some nice design features the front features 2 towers based on the cathedral at Ronda in southern Spain but the inside it is dark with enormous tapestries covering the walls and inlaid carved dark wooden ceilings. The walls are lined with church pews. An eclectic mix of ideas trawled from medieval times and totally lacking in any style whatsoever. There is a giant dining room, games room and huge over the top indoor and outdoor swimming pools and private cinema where guests would be entertained.\nThe surrounding land 80,000 acres is today owned by Hearst Corporation and is a cattle ranch. The Castle itself was donated to the state in 1957 and is now an historical monument run and managed by the state.\nThe state runs a number of tours covering various parts of the building. the tours which last about an hour are conducted by quite good ranger guides and cost $25 per person, which is about right. Overall its quite well run.\nIts worth seeing for what it is.\nThe visitor centre has food and gift areas and a further cinema which offers a film about the castle on a giant IMEX screen.\nShow less"], ["Reviewed October 5, 2017", 4.0, "Definitely worth visiting.", "We stopped in Cambria on our Californian road trip and visited Hearst Castle. We opted to the grand rooms tour. This included about five very large rooms where Hearst would entertain his guest, many of whom were from the film industry. They were full of refinery, statues, Persian carpets and rich furniture. I imagined the film stars who had visited like Clark Gable, Charlie Chaplin, Carole Lombard Bing Crosby etc. and put myself in their position had I been one of the guests at the time. It was fascinating and the guides were brilliant in the stories they told. There is a worthwhile film to watch as well. 2/3 hours required overall including the surrounding gardens and pools.\nShow less"], ["Reviewed October 4, 2017", 4.0, "Hearst Castle Trip!", "It's a wonderful place to visit, the tour guides are very informative and friendly. I love the history of this castle, and the many stories of the very rich and famous celebrities that have stayed at this wonderful castle. The indoor/outdoor pools are magnificent. The great rooms tour was amazing. Lots of walking and climbing stairs. This was on our bucket list, we are so glad we came to Hearst Castle.\nShow less"], ["Reviewed October 4, 2017", 4.0, "2 tours", "Very interesting and beautiful, we went on two tours first guild was awesome the second guild not so much but it really doesn't matter because the art in the castle is breathtaking."], ["Reviewed October 4, 2017", 4.0, "Living a Dream!", "Hearst Castle gardens and pools were amazing! For European travellers the castle architecture has been influenced by Hearst's early childhood trips with his mother...a real hodge-podge of styles.\n\nOnline booking system is a rip-off though! Users must pay an $8.00 online booking fee per ticket ($25.00/ticket/tour) and then an additional $8.00 transaction fee bringing your total cost for two to $74.00. If you purchase the tickets on-site, you pay $25.00 each with no additional fees. I submitted a complaint with the ticket office.\nShow less"], ["Reviewed October 2, 2017", 5.0, "What a great place to visit", "This is one great place to experience. You can not believe the beauty of this castle without being here. The movie before tour is a must to get some background of the castle. The tour guides are very good and can answer your questions. Is well worth the time and something you will not forget.\nShow less"], ["Reviewed October 2, 2017", 5.0, "I love this place! Great history and a beautiful view!", "We loved the great rooms tour, and are looking forward to coming back for a night tour. They are only offered certain times of the year and we heard from other guests that it is well worth it. The coast is so perfect in this area, lots of beaches to explore, and not too crowded.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Impressive and overwhelming", "The Castle is amazing and stands at the top of a hill overlooking the Pacific. Frustratingly there are about 5 different tours with no single catch all tour. Doing all of the Tours would mean spending about $125! We did tour No 3 for $25 which included upstairs bedrooms and indoor swimming pool. Guide was brilliant. Entrance to the attraction involves a 20 min bus ride up the hill.\nShow less"], ["Reviewed October 1, 2017", 5.0, "2017 California Visit", "A must visit if your nearby . Mr. Hearst's vision was beyond the years back then. A bus takes you up to the castle which is on a hill in the middle of a valley which was all his land too. You will listen to commentary which is very interesting. The view is spectacular both up and down the valley road. The castle was very impressive but do not touch anything because the staff will let you know about it. The pool is being renovated but still nice to see. The castle has a lot of maintenance issues but overall a nice tour to go on.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Our second visit!", "We took my mom to see the Hearst Castle for the first time and she loved it. This was the second visit for my husband and I. We did the Grand Rooms tour, but don't stop with that. Do the Upstairs Suites to really get a taste of the opulence of La Cuesta Encantada. Hopefully the Neptune Pool will be finished next time we visit. They were working on it 2 years ago on our last visit.\nShow less"], ["Reviewed September 30, 2017", 3.0, "Spectacular view! Desk staff need training.", "Made the mistake of asking desk staff about entry and given two options.\nWatch the 40 minute movie for $8 or take the guided tour followed by free time to go back over the grounds etc at $25.\nSeemed good value and took the 2.20pm tour, taking the bus up to the main house.\nAfter touring the ground floor the tour was finished. I asked why I could not see the rooms above, main apartment, tower, separate villas or kitchens and was told those tours are all extras.\nIf we wanted to see any of them we would have to take the bus back to reception, buy additional tickets at about $25 for each separate tour and come back up on the bus.\nThis was now not possible as it was too late in the day!\nDisappointed as it is a must see.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Unbelievable folly", "You have to visit here just to try and understand the grandiose plans of Mr Hearst. Worth booking in advance but more than enough places if you turned up. A bus takes you up the hill, worth listening to the commentary. There are different tours you can take. The grand rooms tour gives you a good introduction. It is a bit mean not to have more rooms on the tour. The swimming pool is being renovated but due for reopening begin 2018, though looked far from ready. Nice to take your time wandering around.\nRestaurant was expensive and not that good. In general the visitors centre was not that nice, shame really, given the setting and the grandiose no costs spared house. Go see the elephant seals afterwards.\nShow less"], ["Reviewed September 29, 2017", 5.0, "A great attraction to visit", "We visited Hearst Castle after driving from Monterey. The tour of the house was brilliant and very well organised with a bus from the visitors centre up to the castle. The castle is wonderful both inside and out and definitely worth a visit."], ["Reviewed September 28, 2017", 5.0, "Excellent", "This is an excellent tour to take if you are in the area. The history is interesting and the estate is really fantastic. It's amazing to see what a lot of money and dreams can build."], ["Reviewed September 28, 2017", 2.0, "Overpriced and over hyped Grand Rooms tour.", "For me, Hearst Castle proved a disappointment. $25 each got us transport up and down the hill and an hour's tour which introduced us to the history of the place, showed us a couple of the terraces, the outdoor swimming pool and 5 downstairs rooms. The tour guide was personable and delivered her information well enough but, for me, was too long winded! She stressed the house was a museum and we were to stay on the grey carpet and not touch anything on several occasions - rather as if she were talking to a party of school kids.\n\nYes, the house is interesting. Yes, it is a folly rather than a castle (in the traditional sense) but to charge $25 for 5 rooms and then ask a further $25 to see upstairs and yet another &25 to see the outside guest houses and kitchen is crazy. We commented on this to one of the folk in the welcome centre who told us that people don't have the stamina to look over the entire house!\n\nStamina aside, I wouldn't imagine most people have the cash. Not a way to encourage families to enjoy your heritage.\n\nTime wise, you have to wait for a tour before leaving the welcome centre (we waited 40 mins). The transport to the castle is 15 mins each way. The tour is an hour and then allow a little more time to wander the grounds, see the tennis courts built over the indoor swimming pool and wait for the bus down (every 10 mins). There is a 45 minute film to watch - we skipped that as the timings didn't work for us and we were travelling on. The welcome centre is well equipped - restrooms, coffee, restaurant and shop. We had our photo taken on our way up to the castle for purchase on your return. Actually the pictures were good but $30 for the pack?! I don't think so.\n\nFor my $25, I would like to have been able to wander the rooms at my pace and see a lot more than I did.\n\n\n\nShow less"], ["Reviewed September 27, 2017", 5.0, "Awesome...there are no other words for this place.", "Would have liked to have stayed longer,but the tour took one and half hours and we were heading to LAX for our flight home.\nSuggest you plan to stay there for at least 4 hours as there is so much to see.It was an amazing tour with so much history.\nThere are still some of the animals such as Zebras roaming with the cattle which I found fascinating as these are left over from his private zoo.\nWe stayed at the Cavalier which is just down from the gates to the castle.I would highly recommend staying 2 nights so that you can have a good day just wandered around.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Bucket List!", "This is an amazing castle in the sky. You walk in and are filled with historical pleasures for the eyes. The pools will leave you in awe with their amazing craftsmanship. The exterior of the castle is a work of art! Every inch is finely detailed. This is a definite must see!\nShow less"], ["Reviewed September 26, 2017", 5.0, "A highlight of our visit to California!", "Our visit to Solvang for a week allowed us to make the two hour drive to Hearst, something the two of us have wanted to do. A perfect, clear day was in our favor. After reading reviews and comments, we decided to make reservations several days in advance. We booked both the Grand Rooms and the Upstairs tours. The tour guides are very informed and give a lot of information in a short amount of time. There is a lot of walking and time on your feet. It is incredible and worth any amount of time you spend there.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Impressive but....", "The location makes it stunning and the castle itself is nice and we appreciated the logistics of building on the top of the hill.\nWhatever you do EAT BEFORE YOU GET THERE as they charge a OUTRAGEOUS price for everything. A simple candy bar is $2.99 n potato chips are the lil lunch size bag you put in kids lunches and they charge $2.99 as well.\nWe understand pricing but this is borderline thievery and I was shocked people were buying anything.\nShow less"], ["Reviewed September 25, 2017", 5.0, "The bungalow got out of hand", "Hearst's original plan for a small bungalow on the hill got a bit out of hand ! There are several different 1 hour tours (see the website). Book a couple of tours (you can stay up at the castle between tours if you time them both right : the help desk or online support will help you time this, saves going back down the hill then back up again). We booked the Grand Rooms tour and the upstairs rooms tour (particularly enjoyed the upstairs rooms tour). Tour guides were very informative and mixed in just the right amount of anecdote and humour.\nShow less"], ["Reviewed September 25, 2017", 5.0, "WOW", "Very informative tour of a legendary facility. Well done & efficient operation. We only did the Grand Room tour and the movie, but still spent over 3 hours on site. Well worth the price of admission."], ["Reviewed September 25, 2017", 4.0, "Nice venue to visit", "Interesting to see the views from the top of the hill and to do one of the tours. The amazing exterior pool is being repaired but the interior pool is stunning!"], ["Reviewed September 24, 2017", 5.0, "Fantastic", "A must do if you are in the area.\nWe had been previously and toured the main house so this time did Cottages and Kitchen followed by Upstairs Suites. Lots of walking and stairs but well worth the effort.\nGuides are really knowledgeable and friendly.\nOutside areas and gardens can be roamed at your leisure after your tour so allow additional time.\nViews from the Castle grounds are amazing.\nShow less"]]}}