{"Hollywood": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Hollywood", "url": "/Attraction_Review-g32655-d648331-Reviews-Hollywood-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/9f/31/11/getlstd-property-photo.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1338"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 2.0, "It's more scary than needs to be", "So as you can see from what everyone else has said. It's all built up in your mind. The place is quite bad and scary for anyone. We arrived around 4 ish. We walked around from the Hollywood Highland metro station but when we reached the world famous Chinese theatre it was closed as a film premiere was happening at 7. We took photos of the street and Hollywood sign walked all the way to where CVS pharmacy was. We then walked the back all the way past the church of Scientology. All we saw was famous people name on the ground and people taking photos of it. We couldn't see the handprints and footprints hollywood as that whole area was shut down for the movie.\n\nThe good: we saw from across the street the premiere of \"game night\" and managed to spot Jason Bateman. We saw the famous names on the street. We walked a bit and went to the Disney chocolate store which is great. The lovely people who dress up as superheros and others who offer you jokes as you wait for the lights to turn, sometimes it feels weird but they mean no harm.\n\nThe bad: there are people trying to sell you all kind of things from tours to t-shirts to their cd albums and so on. We had people come up to us asking us to take a \"free personality test\" which is basically a way to introduce you to the church of Scientology. AVIOD this. The street was not clean and felt dirty even the air around it felt worse than London's \"polluted\" air. Honestly it took the image I had of Hollywood that was in my mind and destroyed it.\n\nThe whole place gives you a bad vibe and you just feel scared even though you are perfectly fine and law enforcement is around so you shouldn't. I lost my sibling for a second and the whole plot of taken 1, 2 and 3 played in my head.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "No glitz, no glamour...", "I was pretty disappointed with our visit to Hollywood. The highlight of the trip was seeing the hand and footprints outside of Grauman's (now TLC) Chinese Theatre. I thought the walk of fame was pretty boring as there was no personality to it. Too many people trying to sell you something - how many Spidermen can be in one location at once??? We can say, been there, done that but didn't buy the T-shirt.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "As weird as it gets!", "We are glad we went and will not go back. The outside of the Chinese Theater was the highlight. The outdoor mall by the Lowes Hotel was a welcome surprise and ate lunch there. I did not feel safe the entire time we were there. Drugs, panhandlers, etc. Drove 48 miles to get there, which took 2 1/2 hours each way. The traffic was horrible. We only lasted 3 hours there including lunch and then we had just had enough.\nShow less"], ["Reviewed January 19, 2018", 3.0, "Fun to See", "It is fun if you like movie history. The walk of fame is fun too, but we were with kids under 10 and they were bored. There are lots of characters dressed up for pictures and lots of people.trying to peddle their music cds and other items. We ate at Mel's Diner. That was funish.\nShow less"], ["Reviewed December 24, 2017", 3.0, "Tourist trap and very busy...Ok if you are into that kind of thing.", "The sites are iconic, Hollywood Star Walk, Home of the Oscars, clubs great to see if you did not have to put up with the traffic."], ["Reviewed December 15, 2017", 3.0, "Not All It's Cracked Up To Be", "Hollywood is good fun in a gaudy over the top glitzy way but it's a bit tacky and grotty too to be fair.\nWe loved the walk of stars and the razzmatazz of the strip. But the dingy souvenir shops and lack of depth does get to you after a day or two.\nIt's like a theme park; great until you get tired of the rides and good fun while it lasts.\nShow less"], ["Reviewed December 10, 2017", 4.0, "Neat area!T", "This is a really neat area, but it can be a little sketchy! The Loews Hotel and attached mall is the bright spot! The stinch of marijuana takes over certain spots of Hollywood! Beware if you take your family!"], ["Reviewed December 9, 2017", 3.0, "Ticked off the bucket list", "Hollywood is one of those places that you need to tick off your bucket list.\n\nWhen one thinks of Hollywood one thinks of richness, movie stars and glamour. It's not always like that. You will encounter scammers like the old cd scammer and beggars and poverty.\n\nSure there are some sights to see like the TCL Chinese Theatre and star-studded Walk of Fame but overall Hollywood isn't what everyone thinks it is.\n\nI'm glad I have visited but wouldn't return.\nShow less"], ["Reviewed December 7, 2017", 2.0, "Ugh", "Drugs, prostitutes, hustlers, tourists, chain stores, failed actors, poverty, conspicuous consumption."], ["Reviewed November 21, 2017", 4.0, "One of the highlights of the US", "Hollywood is one of my favourite US cities. It's vibrant and full of things to do and see. However, there are a lot of homeless people and it's a bit dingy."], ["Reviewed November 17, 2017", 3.0, "Hollywood is NOT the place of the past.", "The Chinese Theater is a good place to visit but the rest is just a old city with Stars on the sidewalks and panhandlers."], ["Reviewed November 11, 2017", 5.0, "How can you miss a visit?", "Well, not much to say , it is better to go there and see rather than to write something about it . Hollywood is one of the most famous places on earth. It is a neighbor in LA but one road is the most famous and most projected road worldwide. Stars are shining and you need to get a glimpse of them. Obviously you will not see the real stars but still you will fill special . There not much do it or to spend hours there but definitely this is a visit that you need to do .Busy , lot of tourists, very touristic...but hey it is Hollywood!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Crazy busy but fun", "I really enjoyed visiting Hollywood. Felt safe walking round the busy areas as a single female. Even at night. Our hotel was about 2 blocks away. Lots of restaurants, shops, the famous hand prints etc."], ["Reviewed November 5, 2017", 3.0, "Depends where your from and what you are looking for!", "If you’re not a well-traveled person, you might find this place fascinating. I mean you have to at least visit once I guess. It’s very touristy, very commercialized, Lotta scoundrels looking to take your money along the way. Walk of stars might not be something bad to do, if you can get around the 500 million people trying to take the same picture and the look at the same star you are. Keep your eye over your shoulder there’s some shady people walking around. Homeless too.\nShow less"], ["Reviewed October 31, 2017", 4.0, "Must see once in your life...I personally love it!", "I personally love Hollywood. It's something that everyone should see once in their life. I personally love the quirkiness of it. The Hollywood Walk of Fame, the Chinese Theatre and all the crazy characters out in front of the theatre. Here's a tip...you can actually see the Hollywood Sign from Hollywood Boulevard if you go up the escalator by the Kodak Theatre and it's a clear day. Lots of souvenir shops in Hollywood, lots of opportunities to people watch, and I just love it and think everyone should see it once in a lifetime. I just like to go back and see it again because it's not something you see in every day life...wherever you're from!\nShow less"], ["Reviewed October 27, 2017", 4.0, "Must See At Least Once", "Hollywood is one of the most famous neighborhoods on the planet and is a definite must see if it is your first time. Be prepared for tons of tourists."], ["Reviewed October 25, 2017", 3.0, "Must see once in your life", "It's a tourist must see but most people still leave disappointed and say \"is that it\". I'd avoided it for years but revisited it just to see if was different. To most international visitors LA is Hollywood, or vice versa. I did the compulsory tourist haunts again but in many ways they are best seen on tv or the movies where they have more of a mystique.\nShow less"], ["Reviewed October 21, 2017", 3.0, "Very scruffy", "Lots to see and do; Chinese theatre, walk of stars, Hollywood sign. However, it is pretty scruffy and dirty with lots of homeless people and lost of street vendors. Glad I've been, but wouldn't go back."], ["Reviewed October 17, 2017", 5.0, "Walk of Fame (Stars)", "First Day in Hollywood and Wow, just WOW ! My sister and I both had our A List of stars to find and managed to do that within the first few hours. Marilyn Munroe and Jeff Dunham ..... Yeah"], ["Reviewed October 16, 2017", 5.0, "Dont dare to visit LA without visiting Hollywood", "Amazing and perfect place for spending the day with your partner/friends, gift shops, restaurants, the amazing walk of fame and hard rock cafe. it's #1 must visit for your trip."], ["Reviewed October 8, 2017", 4.0, "Loved it", "It's big, totally over the top and great fun! So many tours to taste the famous and rich. Fabulous shops flowing with everything glitzy and glam. Lots to experience, fame, great restaurants and Amazing food and great bars... Every age, size, gender and sexuality is welcome here... Take the open top bus tour cost affective and informative!\nShow less"], ["Reviewed October 2, 2017", 3.0, "Disappointing", "My wife and I came here expecting much excitement but instead we're faced with loads of homeless and crack heads. Other than the sign viewpoint, I would go anywhere else in Hollywood."], ["Reviewed September 27, 2017", 5.0, "Excellent", "The place is vibrant and buzzing with tourist. Streets are colourful with lots of street performances and bars where you can sit facing street and do people watching.\nMain attraction is off course the famous walkways in both sides of street with names of Hollywood biggies and even Donald Trump. There are few world famous theatres also.\nMust visit.\nShow less"], ["Reviewed September 25, 2017", 3.0, "Bit over hyped", "Its good to explore the area .. shopping streets etc. but overall its overhyped. Its crowded in the fun way to watch hundreds of people walking or not walking only taking photos of everything they find around. Alas they are in Hollywood."], ["Reviewed September 24, 2017", 4.0, "Must Do Cali Tourist Thing to See", "As part of the Ultimate Hollywood Tour, we went through Hollywood and our tour guide Kelly pointed out many famous locations such as places from movies, clubs that music stars started in, famous comedy clubs, and of course the Hollywood Star Walk of Fame."], ["Reviewed September 23, 2017", 5.0, "A must see for visitors", "Some of the old theaters are still standing including the CHINESE where foot and hand prints of several film stars are embedded in cement. Unfortunately the Brown Derby Restaurant which was on Hollywood and Vine, is gone."], ["Reviewed September 19, 2017", 3.0, "OK", "Busy, shabby and quite tacky. This was really not as I expected. Worth seeing but no need to linger."], ["Reviewed September 17, 2017", 4.0, "best to walk in the morning", "Many interesting things in one place. Restrooms in shops (eb LaLaLand shop). You may also buy organised trips. On the street you may watch street artists and their shows."], ["Reviewed September 7, 2017", 5.0, "SO MUCH TO SEE & DO", "On my vacation we spent almost 2 days in Hollywood but if I could do it over again I would spend much longer. It's hard to see all there is to see in only 2 days. We walked along Hollywood Blvd, took pics and a tour. This is a place to see!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Just an amazing city", "Whilst now old, this has to been of the coolest places in the world. It has everything, from a great history through to famous people. Hollywood Boulevard is brilliant!"], ["Reviewed August 30, 2017", 3.0, "OMG", "Can't believe this is real life. Worse than the Gold Coast in beautiful Queensland. Bling...hype...spin....rap....and crap."], ["Reviewed August 28, 2017", 3.0, "Over hyped and crowded", "Crowded, but interesting venues if you research the history of various buildings. Street performers and characters to pose with for $. If you like crowds...this is your place"], ["Reviewed August 22, 2017", 5.0, "Enjoyed the walk!", "Lots of people, street entertainers, hall of fame, Dolby theater, gift shops, eateries....stroll from one end of the steer to the other. Lots of photo opportunities."], ["Reviewed August 19, 2017", 3.0, "visit to hollywood", "the hollywood on TV is VERY different than the one in real life. Very busy, but that is to be expected, but very smelly and dirty. lots of people on sunset\\hollywood blvds trying to sell you their mixtapes. would recommend going there for a day trip and then moving on.\nShow less"], ["Reviewed August 19, 2017", 4.0, "Good for a 30 minute walk around, then get the heck out of there!", "When in LA you have to see the stars in the sidewalk, etc. That's about all this area is good for. A lot of history here as well, so read up before you go and you'll enjoy it more OR take a tour.\n\nWARNING... if you take a photo with or of the people dressed in costumes they will harass you for money. They want tips. And ignore the guys trying to give you a music CD. They'll autograph it and put it in your hand before you can say no, and then demand $20 from you. In short, ignore anyone who tries to stop you for anything.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Hollywood is So Hollywood", "Hollywood is one of the best places in LA to people watch. You get to see all the freaks of LA and tourist come together. Hollywood is a dream machine and it seems like everyone is on stage trying to make their big break though most of them will fall through the cracks and get eaten up by the Hollywood machine...\nShow less"], ["Reviewed August 16, 2017", 5.0, "Very touristic", "Very touristic, at least around the Boulevard. Nice neigborhoods on the hill, crowded, noisy street around Walk of Fame."], ["Reviewed August 10, 2017", 5.0, "Hollywood was amazing!!!", "Hollywood was fun as many Americans live to visit it at least once. There is so much to do there. You need to plan to be there all day!!!!! There were so many people visiting that it was very difficult to get you favorite stars. Everyone should visit at least once. Parking is convenient and affordable. I would make sure that I purchase the City Pass because it makes everything so much more affordable.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Hollywood ~ Experience the Vibe!", "\"Hollywood\" conjures up a thousand meanings. I can't think of another word that stirs up so many images to people the world over. The curiosity of those who have not been there to experience it must spawn a lot of daydreams.\n\nI find the nonstop activity irrestible, like New York, the City that never sleeps. I can feel the energetic creative vibe. The more time I spend in Hollywood, the more fascinated . . .\n\nHaving family & friends who live there makes it real, not just make-believe. Sharing their experiences gives me an insight into & appreciation of the unique & hard-working individuals who can mesmerize us for hours, lift our spirits, make us laugh, make us cry, entertain us, add another facet to our lives.\n\n••••••••••\nI took awesome photos, but a glitch in TA's App would not allow me to Choose them. Sorry.\n••••••••••\nShow less"], ["Reviewed August 8, 2017", 5.0, "Boulevard of dreams", "Hollywood is world famous, do not miss a visit to all the famous places that you can see. Take the metro rail and enjoy walking Hollywood Blvd."], ["Reviewed August 8, 2017", 5.0, "A must see!!", "This is a place that everyone should visit at least once in their life! There is just so much to see and do! I will definitely return and make sure I have more time to explore. There is so much history and the Walk of Fame is amazing!! I never expected it to be as long as it is! There is something for everyone to experience here!!!!\nShow less"], ["Reviewed August 5, 2017", 4.0, "Interesting place", "The Walk of fame, the Chinese Theater, the stars on the sidewalk, everything is very cool. It is a crowded place, with lots of people trying to sell you things and charging you money for pictures. Watch out your steps!!"], ["Reviewed August 4, 2017", 4.0, "Great place in LA", "Hollywood is one of the many places that tourists must visit in Los Angeles and get a taste of fame."], ["Reviewed July 27, 2017", 4.0, "A Crazy Busy Place.", "Wow very exciting place. Lots of people with lots of diversity. Lots of traffic, restaurants and shops.\nMany tour groups in the area.\nThe Walk of Fame is 15 Blocks of Hollywood Blvd and 3 blocks on vine street.\nLots of Beautiful homes in the area.\nIt was overwhelming how crowded it was.\nWe live in Florida and have a lot of homeless people.\nWe saw many pretty obvious homeless people.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Edgy and Commercial American Culture and History at it's BEST!!", "O.K. So - there's allot of foot traffic and cars. O.k. so there are some homeless people. It's real American Life! Go at night when it's a bit cooler - the lights are fantastic. It's LA's Time Square. The little shops are really interesting. Check out the Scientology Center. It is a true melting pot.Most of the restaurants and bars are really good quality and cheap, compared to the rest of Hollywood. It is a sociological and cultural experience. It is truly American! Get Some...................\nShow less"], ["Reviewed July 25, 2017", 4.0, "A lot of free attractions to walk around and see.", "We stayed in Hollywood for two days and there are plenty of tours that run through the area that you can get on and a lot of free attractions to walk around and see. Jimmy Kimmel is filmed off of Hollywood Blvd so you can see a taping if your 18 and older and grab some tickets.\nShow less"], ["Reviewed July 20, 2017", 3.0, "Cliche pictures", "You must go there to see the theaters and see people dressed up as movie characters, and the stars with big artists names on the sidewalk floor. But that's all. Take your cliche pictures and go to the next attractions you have on your list."], ["Reviewed July 9, 2017", 5.0, "Great place to visit", "theres plenty to do and plenty to see.A good start is the city sightseeing bus tour which gives you a good tour of the city"], ["Reviewed July 5, 2017", 4.0, "Walk of stars", "Our older teen really enjoyed the stars and Chinese theater foot prints etc. Very crowded during the summer day so four stars only"], ["Reviewed July 2, 2017", 3.0, "Not what expected", "It's good to see it but be aware the area isn't the nicest - smells bad, lots of homeless people and isn't a place I'd like to hang around at night time!"], ["Reviewed June 29, 2017", 5.0, "We wanted to see the city.", "We saw much more of the city with Carlos as our guide that we would have on our own. He knew \"his\" city and showed us some hidden gems."], ["Reviewed June 29, 2017", 3.0, "Wasn't a fan", "If you are in the area and don't mind crowds would recommend. The fact that there were always street people trying to sell you something (i.e. cds, bus tours, etc.) did not appeal to me at all. Would recommend parking at Highland and Hollywood. Parking is $2.00 for 2 hours. Take your ticket and have it validated at one of the local businesses.\nShow less"], ["Reviewed June 29, 2017", 2.0, "A bit of a dump and a tourist trap", "If you are coming to Hollywood expecting it to be glamorous then think again, Hollywood is very downmarket and is a tourist trap with lots of over priced exhibits. Good to visit to say you've been there but it is not a particularly nice place."], ["Reviewed June 29, 2017", 1.0, "Massive Disappointment", "Look at the positives - at least you can say you have been.\nWalk of Fame is a huge disappointment, was expecting so much more. Yes, there are loads of 'stars', however, lots of them are either broken, or, sidewalk is uneven and cracked. Rock Walk is in better condition, but is something you can visit in about 10 minutes, and, is a bit of a hike (through a quite poor neighbourhood). Loads of shops selling Hollywood tat, and, all a bit dirty and cheap. Hollywood is overall a bit grubby, loads of beggers and homeless.\nWould I go back - no, I am glad I've been - probably yes, but hugely disappointed.\nShow less"], ["Reviewed June 26, 2017", 3.0, "Expecting more", "I felt a bit underwhelmed with my Hollywood experience. It didn't have that magic that I thought it would have had.\n\nA positive was that there was lots of opportunities to buy souvenirs. However a sour negative note was the aggressive street vendors who constantly tried to pass CDs onto tourists & then become offended when tourists didn't take them on.\nShow less"], ["Reviewed June 26, 2017", 1.0, "Cheap and dirty", "We arrived by car and drove to the walk of fame to see the stars. The street wasfull of tourists, all was really dirty and the impression was bad. We tried to park our car but for $ 16 for every 20 minutes it was not funny at all.\nWe saw the sign of hollywood but it is simple and unimpressive.\nNice restaurants or clubs were not availabel so we left extreme disappointed.\nShow less"], ["Reviewed June 24, 2017", 3.0, "Not To Be Missed But Not What You Expect", "You visit Hollywood expecting glitz and glamour but leave feeling let down. You've got to go to see the Walk Of Fame, Capitol Records Building, The Chinese Theatre, The Roosevelt Hotel and all the other attractions but, once you've done so and got your photos, you're glad to get away. The whole area just feels run down and dirty with it's tacky shops and fast food outlets and having tour flyers thrust at you every 30 seconds or so gets annoying.\nA must do but just the once.\nShow less"], ["Reviewed June 21, 2017", 3.0, "nice to see", "the area is still a little distracting lots of homeless people harmless but still a concern, seems a little run down and dirty but you have to see it at least once in your lift, lots of fast food joints, a few pubs and a brand new shopping centre, its fun to see the name plates for actors and to watch the free show of people dressing up as movie characters\nShow less"], ["Reviewed June 18, 2017", 3.0, "It is what it is..", "Hollywood is a bucket list item, but make sure to manage expectations. I don't want to paint a doom and gloom picture, because I think it's worth the trip to visit, just to inform so travelers are aware.\nThe area has many historic and notable sights, but it's not very well kept.\nThe streets are usually pretty packed with tourists, panhandlers, street vendors, and the homeless. The panhandlers and street vendors are somewhat aggressive and be sure to keep your wallet or purse snug due to the pickpockets.\nDriving in the traffic can be nerve racking if you aren't used to fast-paced city traffic with drivers that don't care.\nI still think it's worth the visit, just as long as you're aware of your surroundings.\nShow less"], ["Reviewed June 15, 2017", 3.0, "Glad we went, but be prepared to be hassled non-stop", "I am glad we got to see the iconic sights of Hollywood, but I will not be back. It's dirty and filled with homeless, drugged out people and extremely annoying people bothering you for money or tours. If you want a tour, use Ultimate Hollywood Tours (see reviews here). I gave it 3 stars because of it's iconic sights, but it's over crowded and filled with filth.\n\nMy kids did get a first hand lesson of what drugs can do to you, we got to see an addict throw up all over himself and people stumbling around whacked out of their minds.\n\nTraffic is absolutely horrible.\n\nAgain, I am glad I got to see some iconic sights, just be prepared.\nShow less"], ["Reviewed June 13, 2017", 5.0, "\"Song of Songs \"1933- Marlene Dietrich", "You must see Hollywood California to understand the history of American Culture.\n\nTake the Tour of Hollywood to understand how American Film at Paramount Pictures\nSeduced the world, thru moving images with sound.\n\nThis Movie is a classic.\n\n\"Song of Songs,\"produced by Paramount Pictures,\nis Based on a poem that was written in the 2nd Century.\nThere\nHave been many interpretations of this Poem in Jewish Thought and Christianity.\n\nIn this movie, which is a Tragedy,\nit is the classic story of all pretty women. A physically beautiful woman looked at ,\nas\nAn object. Judged as an Object.-\n\nIt's one of the most beautiful films I've ever seen in my life. Marlene Dietrich was 31 years old when she made this film. She was never more beautiful.-\n\nTruly a masterpiece, based on a poem.\n\nYou must see this film, that was produced\nIn 1933 in America.\nShow less"], ["Reviewed June 6, 2017", 3.0, "Not what I expected", "The air is dirty, the people are mean, and the traffic is terrible. I'm glad I went because It's cool to say, \"hey I've been to Hollywood\", but I would never want to go again. It was just not what I expected and the glam of Hollywood had basically been ruined for me.\nShow less"], ["Reviewed June 5, 2017", 4.0, "Lots of crowds!", "Along Hollywood Blvd, you will be faced with a ton of crowds. There is a lot of chain store shopping, as well as large souvenir stores located on the boulevard. It is a nice experience for first time LA visitors but somewhere you don't really need to go twice.\n\nA few notes: The parking prices are a little outrageous the closer it is to the boulevard. There are also a lot of street vendors, performers and people in character costumes that take photos for tips. The people in character costumes can get aggressive, jumping into a photo uninvited and will refuse to leave unless a tip is given.\nShow less"], ["Reviewed June 4, 2017", 4.0, "Hollywood", "We enjoyed our visit to Hollywood and the surrounding area. It was a lot of fun to see the places you see on TV. It is very crowded along the strip. There are a lot of people on the strip that are dressed up in costumes that want money for taking pictures with them and also a lot of people that want to give you a free cd a then want a donation. Also many street vendors and performers. I would suggest going early in the morning before the crowds get there. Go see the Chinese Theatre Courtyard early so you can see the stones you want before the crowds arrive.\nShow less"], ["Reviewed May 31, 2017", 4.0, "Walk of Fame!", "We spent a few hours on the walk reminiscing and enjoying the hand prints (and hoof prints). The retail / restaurant scene was a little on the slim side."], ["Reviewed May 27, 2017", 4.0, "A nice place", "A nice place to see while visitng Los Angeles. There are lot's to see, like Walk of Fame, Chinese Theatre, Sunset blvd etc."], ["Reviewed May 25, 2017", 3.0, "Walk of Fame", "A little disappointed with the walk of fame. Not as many restaurants to visit. Lots of empty buildings."], ["Reviewed May 17, 2017", 5.0, "Fun place to go for Aussies", "Best you start saving and get to this one. We stayed at the Hollywood Orchid Suites which is minutes from the Dolby Theater and main drag. The guys selling CD's can be pretty full on but not too bad in comparison to New York. Don't buy them, they don't work and are a scam.\nHollywood is a platform for all sorts of tours ranging from the basic up to VIP. I would check out Universal Studios and don't go below the VIP pass it's worth the money and also do the VIP personalized tour with LA Insiders. Allow at least 4 days here if you are travelling on towards Anaheim for a feel of the place, but if you can stay longer you can really enjoy the strip for restaurants and friendly people.This is an expensive part of the trip so allow for 2 of you around $USD300/day for food and entertainment and pre pay for your tours.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Very cool area!", "Everyone should visit Hollywood at some point in their life. It's exciting and interesting, and you never know what you might see!"], ["Reviewed May 11, 2017", 5.0, "Stars", "We walked for hours and enjoyed every minute of Hollywood! We went to Madam Tussauds Wax Museum and it was awesome"], ["Reviewed May 8, 2017", 5.0, "A must visit for film and history buffs.", "Anyone that love films, TV and entertainment history needs to take a long walk down Hollywood Blvd to see the hundreds of stars. It can get really crowded during the day and doesn't feel safe at night but I still love this place. A mixture of young and old, locals and tourists, rich and poor. I like picking a good cheaper hotel within an easy walk for a great visit.\nShow less"], ["Reviewed May 8, 2017", 3.0, "Great place to look aroun", "It was great to see all the different places, lights and stars! Great for taking pictures and there are many cops around so you are safe"], ["Reviewed May 7, 2017", 5.0, "Our family really enjoyed this neighborhood in LA", "I don't understand all the bad reviews on this area. We had only planned on spending a little bit of time here based on them, but I really wish we would have planned for more. We enjoyed the touristy fun of The Walk of Fame the most and could have spent half a day if we had the time. Our boys loved seeing all the people in and out of costume. There are lots of shops and restaurants. Some of the areas looked like they might be sketchy, but you'll have that lots of places. Just use your common sense and enjoy the craziness that is Hollywood. We also enjoyed driving up into the hills and seeing beautiful views. We only got to experience a touch of it but would definitely come back if near here.\nShow less"], ["Reviewed May 3, 2017", 1.0, "Not what I was expecting", "Someone says Hollywood/ Walk of Fame and you think glitter and glamour or at the very least something nice! Nope!! This place is so Dirty and Sketchy and full of people walking around high as a kite seeing things that you could never imagine. There are people hustling their CDs and DVDs on the streets and get angry when you do not purchase them for a \"generous donation\". There are so many people from all walk of life here. It was nice to see the Walk of fame and the Egyptian theatre but other than that it was a Dump! I am glad I got to see it, but I will never go back. It is sad to know that the community there is alright with the way things are ran! Some people love it but we were not comfortable being there at all.\nShow less"], ["Reviewed May 2, 2017", 5.0, "A different world!", "Hollywood is a one of a kind place. Saw so many different faces and places...unbelievable! Enjoyed all the Star stuff...will come back! :)"], ["Reviewed April 30, 2017", 4.0, "Driving around in Hollywood", "Just take your car and drive all the way on Santa Monica Boulevard and return to the ocean via the Sunset Boulevard and just enjoy all the famous sightings!"], ["Reviewed April 23, 2017", 5.0, "Getting around Los Angeles with no Car", "For travel around Los Angeles using both metro and bus by a 7-day pass $28 for plastic travel card loaded for 7 days."], ["Reviewed April 21, 2017", 3.0, "Hollywood is a small part of L.A.", "I live in & love Los Angeles. The main reason why I am writing about Hollywood is so that tourists understand that Hollywood is only a very small part of L.A. and except for Paramount Pictures there are no major movie studios in Hollywood. It is worth a short drive on Hollywood Blvd. by Highland Avenue as you head to the L.A. Observatory you can pass by the Dolby Theater where the Oscars are held & the historic Chinese & Egyptian Movie Theaters adjacent to the Walk of Fame, but don't expect to spend much time within Hollywood. Beverly Hills, The Sunset Strip, Universal Studios, The Warner Bros. Studio Tour, the L.A. County & Getty Museums, The La Brea Tar Pits, Santa Monica & Venice Beach...none of these attractions are in Hollywood.\nShow less"], ["Reviewed April 20, 2017", 5.0, "Hollywood You make it what you want", "The land of make believe you can see the sights, walk the steps and feel the ghosts of tinsel towns past, a little deep for sure but with all the history in this town you will never see everything but as times change you see the past mixed in with the present. Must things you should do: Walk the entire Hollywood walk of Fame, dine at Musso & Franks (skip the Pig nWhistle) see a movie at Grauman's Chinese Theatre, the side streets tell a story that others miss but thats what Hollywoods all about. One thing I will say in the early AM the lights flash yellow, get out in your car if you've rented one and drive up the hills and see the houses and so many other sights above you won't regret it\nShow less"], ["Reviewed April 20, 2017", 4.0, "Hollywood sign", "You can't get too close to this sign which is actually 5 stories high! You can get glimps of it as you walk along the Hollywood walk of fame but the best way to get closer is to take a tour. There are lots on offer on the street and you get to see Beverley Hills, Rodeo Drive etc.\nShow less"], ["Reviewed April 19, 2017", 5.0, "Hollywood, Hollywood!", "Accept that it's a pretty shoddy place, and you can have a good time. You can walk along the pavement and see the stars beneath your feet. You can go to the Arclight for a movie & a meal. You can ignore the city and the crowds and drive/hike up to the wonderful Hollywood sign. Best of all, if you're there on Sunday, you can attend the great Farmer's Market!\nShow less"], ["Reviewed April 17, 2017", 1.0, "Where Dreams Come... To An End!", "I have seen this place on movies, in TV shows, on commercials and pictures. The world famous glitz and glamour of Hollywood!\n\nWell...sadly to say... this is not what it has been made out to be!\n\nWe had allotted an entire day for Hollywood because we had always dreamed that it would be fantastic, but how wrong were we?! This is one of the dirtiest, unfriendliest places that I have ever been! In all of my travels around the States and around the globe, I have never wanted to leave a place as quickly as I did Hollywood.\n\nNeedless to say, we took photos of everything that we had wanted to see and high-tailed it out of there!\nShow less"], ["Reviewed April 17, 2017", 3.0, "Good Visit", "We visited Hollywood during our Napa to LA trip. It was our last stop and although a must to see definitely not my favorite. I was much more enamored by the coast and the beautiful sights we saw during our trip."], ["Reviewed April 16, 2017", 4.0, "Great visit", "On our TMZ tour we saw many interesting sites and places around Hollywood and got a great view of the Hollywood Sign."], ["Reviewed April 15, 2017", 5.0, "if you wont take a photo there its like you wont go to USA", "nothing is there except the Hollywood sign and you should and must take a photo before you leave the world !!"], ["Reviewed April 13, 2017", 4.0, "Check it out", "Go to the park with the Hollywood sign. Beautiful views of the city from high above. The sign is a must see."], ["Reviewed April 11, 2017", 5.0, "Stars, stars, and more stars", "Come enjoy all the famous people you could ever imagine. Walk down some streets and enjoy the beautiful scenery. Nice mansions that house famous celebrities is just a glimpse of what your eyes will enocunter."], ["Reviewed April 10, 2017", 5.0, "Hollywood is everything you expected and more", "From the time I arrived till I left there was so much to do. Allow plenty of time to ensure you can do everything."], ["Reviewed April 10, 2017", 5.0, "Must see on LA tour!", "We loved our time in Hollywood - walk of fome, hop on hop off bus a definite. Managed to see the hollywood sign from the shopping mall at hollywood and vine. Take your camera!"], ["Reviewed April 3, 2017", 5.0, "Simply Hollywood!", "Hollywood is so extensive that you can’t define it in a single parragraph. We passed from the \"walk of fame\" where you can have fun looking for the star of your favorite character, the shops, Santa Monica and Sunset Boulevard. Farther west are the Hollywood hills, a place much more quiet and in the countryside where many celebrities have bought houses. All definitely worth visiting.\nShow less"], ["Reviewed March 31, 2017", 5.0, "It's Home to Me", "Well, what can I say, I live around here and I love it. I am mainly talking about HOLLYWOOD BLVD in Hollwood - and not the Hollywood Sign itself. I love living around Hollywood - I wouldn't have it any other way. It's a mess of all kinds of people - homeless and tourists - rubbing elbows and lots of crazy exotic and obvious tourist stores and malls. Lots of costumed people ready to get their picture taken with you - and sellers of tourist rides to see stars' homes. Lots of crosswalks and cross-dressers and couples and kids - you name it. It's wild during the day and mostly calm at night for the most part. Just keep an eye out for pickpocketers and don't go down too many dark alleys alone.\nShow less"], ["Reviewed March 30, 2017", 4.0, "Here I am!", "This is the place where dreams come true, are shattered and everything in between. The most extreme place I've ever been. It has both the best and worst of humanity. Just be careful because there are many bad rabbit holes to climb into."], ["Reviewed March 26, 2017", 4.0, "Wheelchair in Hollywood", "Boulivard the metro and the people were all really helpful walk of fame seeing well known names. Had photo taken with Hollywood sign in background. All were completely wheelchair accessible."], ["Reviewed March 23, 2017", 2.0, "very hyped", "there is noyhing to see here other than the holywood sign on the mountains.this sign is visible from most of the points on the parallel main road in the city of los angeles. just a big hype."], ["Reviewed March 20, 2017", 5.0, "One to see", "Because of the hype its a must see, however the area is lacking the expected glam and sparkle. Its great to tick all the boxes but the area is run down and your constantly being pestered by the tour guides that gets annoying."], ["Reviewed March 17, 2017", 4.0, "Nice but far", "If you go this place better to join the bus tour or if you know someone knows this place and drive you there."], ["Reviewed March 16, 2017", 3.0, "Holywood", "I was disappointed in Hollywood, thought it would have been a smarter looking place. Lots of 'work' being done to repair areas so couldn't see all the hand and footprints of the stars and constantly being harassed by people selling CDs and tramps asking for money.\nShow less"], ["Reviewed March 15, 2017", 4.0, "busy but worth seeing", "Like all of L.A. the traffic is horrible, but it is worth hanging out in Hollywood a little bit to say you have done it."], ["Reviewed March 11, 2017", 2.0, "Very dirty and mighty unclean", "Very dirty place, would have thought, since the Oscars had literally just finished that the area would have been cleaner. But nope, it wasn't. Couldn't wait to leave this place"], ["Reviewed March 6, 2017", 3.0, "Hollywood sign and broadway street walk/hike", "Cool stuff to see but was very dated and dirty on the strip. The hike to the sign is worth it for the view but don't expect washrooms, water or benches it you need to rest. I expected more for the amount of people that were there doing it. we had water but lots didn't. Wear good walking/hiking shoes the trail is a little uneven in spots.\nShow less"], ["Reviewed March 3, 2017", 4.0, "Great visit", "The Academy awards were under preparation so some of the streets were closed off for traffic. Hollywood is a special place that should be experienced by walking around."], ["Reviewed February 22, 2017", 5.0, "A must see if in the area", "Hollywood is fun for people of all ages and is a must see for many people. I personally would not recommend staying here for longer than a day or two because there is so much more to see in the area. Hollywood can be very dirty and may not be exactly what you picture it to look like if it's your first time traveling there, but it does have a lot to offer. I recommend staying in West Hollywood which has an entire different feel to it, but you are still close by the action.\nShow less"], ["Reviewed February 20, 2017", 5.0, "love it", "It doesn't get any better then Hollywood, seeing all the stars on the walk of fame is great loved it"], ["Reviewed February 18, 2017", 4.0, "Memories from my youth", "It is worth seeing, use a guided tour, Stars house tours are every where, so do one it is fun to pick the houses you know from the movies."], ["Reviewed February 13, 2017", 4.0, "Lake Hollywood hiking trail", "A little known, peaceful hike area is the area just below the Hollywood sign, in the area known as Lake Hollywood. It is the area surrounding the Hollywood resovior buiit by Mr. Mullholand. It is approximately 3 miles to traverse the perimeter and is paved and fenced to protect the wildlife from us. There are beautiful deer who will sit inside the fences and watch the hiker and cars go by and numerous birds inside the fences filled with fauna.\nYou can easily accees the area from the 5 or 101 freeways, simply type in Lake Hollywood on Google Maps and you will get simple instructions to get there. find a parking space and do the perimeter, walking or running. its a peaceful quite place. there are several places to park. as you walk around the lake, you will see many views of the Hollywood sign, not typically seen from any other place.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Fab", "Hollywood isnt what i expected, the walk of fame is just stars on the street, not really an attraction. we did a 2 hour tour including beverly hills which was good. Hollywood looks buzzing of a night plenty of bars and restaurants and things to do\nShow less"], ["Reviewed February 7, 2017", 4.0, "Fun if you are from out of town", "There is a lot to see in Hlooywood and it is nothing like the movies, for that experience you need to go to Rodeo drive, or Bel Air. Hollywood is more for the tourist or local who knows the good bars. Take a camera since there are a lot of photo options. Plan to see a show at the chinese mans theater or pantages theater.\nShow less"], ["Reviewed February 1, 2017", 3.0, "The infamous Hollywood", "I had a lot of high expectations for my first trip to Hollywood. I thought it was going to be an amazing experience. I was slightly wrong. While Hollywood is interesting, it was not quite what I expected it to be. It also was a lot dirtier than I had expected such a famous tourist destination to be.\n\nYou won't be missing a whole lot if you never make it here. There are some cool places to check out though either way!\nShow less"], ["Reviewed February 1, 2017", 4.0, "Revisiting after decades!", "Things have changed -- Hollywood is much cleaner and comfortable than it was back in the 80s. Definitely worth the visit."], ["Reviewed January 31, 2017", 2.0, "Do your homework", "Hollywood sounds great when you are not from California but when you are from CA you know to stay away. There is very little here and it is a bit dangerous."], ["Reviewed January 28, 2017", 5.0, "Great place", "The entire Hollywood area is awesome. Make sure you go to universal studios and do the Hollywood walk of fame"], ["Reviewed January 27, 2017", 5.0, "AMAZING", "The view from the spot we got to visit with a vegas tour was amazing! would highly recommend this! Not just the view of the sign, just the whole place. I couldn't stop taking pictures or videos, far too beautiful."], ["Reviewed January 25, 2017", 5.0, "What an improvement!", "Back in 1995, I saw downtown Hollywood and it looked sleazy at the edges, just like Times Square in the 1970s. In 2015, I revisited and was I surprised! It is much safer and cleaner."], ["Reviewed January 24, 2017", 5.0, "Dreaming the movie stars the fashion the homes", "Dreaming the movie stars the fashion the homes Great place to see a movie and a great place to see multimillion dollar Estates on the mountains. It is a great place for celebrities to get together and have fun."], ["Reviewed January 21, 2017", 5.0, "Cool", "I went to California a year ago because thats where most of my family lived so I decided to visit hollywood. I spent a full day going on tour of hollywood it was good and fun. Hollywood did a prank on us too which I thought was very humorous. I will visit America later in the summer which i'm definitely going to Hollywood again. Overall a well guided tour.\nShow less"], ["Reviewed January 19, 2017", 5.0, "Hollywood sign", "As we had lots to see we had our driver.take us to Beechwood drive so we could have our photos taken from the street in front of the Hollywood sign and not drive us up to the mountain. This way we had a great picture taken and could adjust the picture the way we wanted to.\nShow less"], ["Reviewed January 18, 2017", 5.0, "Nice", "I went for business trip to Los Angeles and was so happy to have chance to explore Southern California. I took extra 3 days off, rented car and went to most of the places I always wanted to see. Hollywood was one of them and I was really happy to see everything.Hollywood is beautiful . Also Beverly Hills and LA. That was no fees to enter the park , I went all the way to the observatory. LA view was amazing. Place is very busy and the best time to find parking quickly is to go there early in the morning.\nShow less"], ["Reviewed January 17, 2017", 4.0, "A well guided tour", "If you are alone in LA and want to go around, i think Starline is the best option. Along with a humorous and entertaining guide, we alos get lot of company and chance to make new friends. The guide we had promised us that he would be non stop for the entire trip and so he was. Tour was educating, entertaining and very informative.\nThe only setback is that sometimes you get lost in the location and we dont get the mobile number of the guide if we are running late for the pick up\nShow less"], ["Reviewed January 17, 2017", 5.0, "LA's classic tourist site!", "Hollywood has plenty to offer for the whole family, the walk of fame, Chinese theaters, Madam Tussaud's wax museum, Ripley's Believe it or not museum, the different characters on the street, lots of places to eat, great shopping venues from souvenir shops to high end stores.\nShow less"], ["Reviewed January 16, 2017", 4.0, "Iconic sign", "You can take a Hollywood tour, but you never get right up close to the sign. There are barriers around it although many have climbed the hills to sit on the letters throughout the years. You can also see it very decently when driving to and from universal studios.\nShow less"], ["Reviewed January 13, 2017", 4.0, "One of the Best Places in LA", "You cannot come to LA without visiting Hollywood area. Full of activities like walk of fame, dolby theatre, Hollywood sign and boulevard. Hundreds of restaurants and coffees spreads all over the area"], ["Reviewed January 10, 2017", 4.0, "You just have to see this", "Great to see the Hollywood sign and it is clearer to see than suggested before I visited. I saw it form the observatory, which is worth visiting."], ["Reviewed January 5, 2017", 4.0, "Great for Hollywood nostalgia and dreamers", "Some view Hollywood as a tawdry place filled with tourist trap gift shops, and it is. But it's also the long-standing home of promise and possibility. That's why I love it. Among the gift shops are classic movie houses, the Walk of Fame and famous restaurants. Take it for what it is, and enjoy yourself. Get your picture taken with a costumed weirdo in front of the Chinese Theatre, because why not?\nShow less"], ["Reviewed January 4, 2017", 5.0, "Don't expect what you see in the movies.", "Hollywood is one of my favourite places in the world. It isn't clean and beautiful like Beverly Hills but that's why I like it. It's quirky and at night you don't know what you're going to see. It's full of characters and life.\n\nThe further you walk up Hollywood boulevard the weirder it gets! Check out the museum of death if you're after something a little dark. Eat and drink at the Roosevelt poolside where Marilyn Monroe used to reside if you're after some classy Hollywood history. Check out a bar called \"no vacancy\" which is very close to the blvd for a completely different drinking experience. Shop at Hollywood & Highland, they have a massive Sephora and Victoria's Secret. They even have a shop dedicated to selling only socks! A visit to the Chinese theatre IMAX is also a must. Even the ceilings are spectacular.\nShow less"], ["Reviewed January 4, 2017", 3.0, "Mildly interesting", "One of those places you want to say you've been to, but the reality didn't capture my spirit, the way it does on film. However, seeing the Hollywood sign from Griffith Park was a true enjoyment."], ["Reviewed January 2, 2017", 3.0, "Walk of Fame is the main attraction", "So when you think of Hollywood, you think of movies stars and studios. However, when you are in Hollywood it is mainly souvenir shops, most of them with the same things. Of course there is the Chinese Theater which everyone needs to see as well as the Dolby Theater ( we took a tour there several years ago, which was pretty neat) and the Jimmy Kimmel studio. There are people dressed up as different characters, which really get on your nerves - and there are others who are trying to get you to take some kind of tour - almost like timeshare people in Vegas. The best thing about Hollywood is the Walk of Fame - it is neat to see the stars of your favorite musicians and actors. With that being said, if you come to LA, you have to at least spend a couple of hours here checking it out.\nShow less"], ["Reviewed December 31, 2016", 3.0, "Place to visit but may not worth a repeat", "The word \"Hollywood\" excites many travelers because of the glamours and movie stars. Often people get to the area of Hollywood Blvd within the 4 stops of Metro red line. The main tourist attraction is the intersection of Hollywood Blvd and Highland Avenue (a couple blocks On Hollywood Blvd on each side). The area is where stars' name with foot pints and hand prints are located including other iconic places name. It is worth visiting but may not be worth a repeat.\nShow less"], ["Reviewed December 28, 2016", 4.0, "average", "I was disappointed with it. You know it from the movies, but if you are there, you can not believe that it is hollywood. So many dirty stores and lots of homeless people..."], ["Reviewed December 27, 2016", 3.0, "Tourist Trap", "Hollywood is basically a tourist trap and not as nice and clean as one might imagine. Mostly big crowds and a lot of people on the street dressed up as characters and charging for pics as well as the \"rappers\" who offer people a \"free\" CD but when you say ok they \"autograph\" it then want you to pay them for it, smile and give them a stern NO. As far as views of the Hollywood sign, if you are driving there are plenty of less crowded places to get a better view.\nShow less"], ["Reviewed December 27, 2016", 4.0, "Iconic but...", "We visited in October and the weather was absolutely perfect to see this iconic attraction, however because it was off season the residents didn't allow people to do the full walk to admire the proper view of the sign but we did manage to get a good look at it.\nShow less"], ["Reviewed December 22, 2016", 5.0, "LOVE LOVE LOVE!", "I absolutely loved Hollywood! A lot of people told me before going that it really isn't that exciting but I found absolutely amazing! I found it a really exciting place to go! It was fun seeing the stars and looking at movie sets etc!"], ["Reviewed December 21, 2016", 4.0, "Hollywood's icon", "Everybody have seen this sign in his life .... This is an icon. The path to move to the top of the hill is amazing, you will pass by dream villas and houses. Once at the top you have an amazing view of Los Angeles."], ["Reviewed December 21, 2016", 2.0, "Very run down", "Hollywood has been taken over by the homeless, and they live inside piles of rubbish along the street. We had a very scary encounter with a particularly crazy guy who we only escaped from by ducking into a store with security. You can't walk along Hollywood Boulevard without being constantly harassed by aggressive rap CD and tour sellers. The CD sellers basically push a CD into your hand then demand money for it. I did end up paying about $4 for one they wanted $25 for, and when I listened to it its actually not bad. Don't put it in your laptop though. Hollywood is probably nowhere near as dangerous as it first seems, but still it would have been nice to see at least some police presence since this is supposed to be a tourist attraction. As for the town, it must have been a beautiful place once but its all been knocked down and ugly post-war commercial buildings erected, half of which now seem derelict. Its good to visit the movie stars hand prints and the Chinese Theater, but a couple of hours is plenty, best not to stay here like we did. Not at all how we imagined it. I don't think the city could care less about making this a nice place to visit.\nShow less"], ["Reviewed December 20, 2016", 4.0, "The city view", "Nice trip to the sign and the area of Hollywood. Nothing special but you can see great city view thats it"], ["Reviewed December 15, 2016", 3.0, "Where is the land", "Fun fact originally it was Hollywoodland built to promote a new sub division- God shuffled his feet and a landslide took out Land - now it is a world famous landmark"], ["Reviewed December 10, 2016", 3.0, "Just another city", "Cant say it was amazing, its just another city. We had our own car and drove up and down the streets of Hollywood. It went from the very wealthy to the very poor, lots of interesting houses to see. but over all not that impressed."], ["Reviewed November 29, 2016", 5.0, "Sightseeing!", "Great view! Had fun walking with my son. I have truly missed our long walks. Can't wait to come back and do it again!"], ["Reviewed November 28, 2016", 5.0, "It really is larger than life", "Drove up as close as the tour bus would let us and walked around a bit. Hard to believe the sign looks the same as ever."], ["Reviewed November 25, 2016", 4.0, "Nice Visit but could be better", "I took a city tour of LA via Starline to explore the city swarming with celebrities. It was just a tick in the \"To-do\" list and i wasn't disappointed. But it could be so much better. Places like walk of fame, TCL theater, etc. are just a few minutes worth of attraction. The Hollywood sign is visible in a distance unless you plan to trek (which i did). I was staying at Beverly Hills and the locality is quite nice but there isn't too much to boast about.\nShow less"], ["Reviewed November 16, 2016", 3.0, "not what I expected", "Hollywood is the film business and celebrities icon but the boulevard and immediate area are only worth a very short stop to put on your 'tick list '. the walk of fame is the only thing worth stopping for,even then limited. The 'Hollywood sign a distant name in an uninspiring view. drive on and visit rodeo drive and beverley hills.\nBeware of being offered a cd then expecting $20 for it. Having your picture taken with people dressed as a famous character is fine if you are prepared to pay,which is fine but beware some of them pushing you into this.\nShow less"], ["Reviewed November 15, 2016", 5.0, "nice visit", "I went to hollywood for travelling anf visiting my family member. It was nice experience. Especially if you wanna see the down town hollywood."], ["Reviewed November 15, 2016", 2.0, "Dirty, Overpriced, Homeless People Everywhere and RATS!!", "Spent two days in Hollywood while visiting various attractions. Hollywood Blvd, is dirty, crowded with homeless people, full of overpriced shops, restaurants and hotels and even rats. I was walking on Highland just off of Hollywood Blvd. to one of my destinations when a rat ran on the sidewalk in front of me for several feet until it ran under a fence. Also, the area just a block or two from Hollywood Blvd is not the nicest. I was walking down one street and turned around and went back as I didn't like what I was seeing ahead of me. If you must visit this area be cautious and stay on the main traveled streets, especially at night.\nShow less"], ["Reviewed November 10, 2016", 4.0, "It's a sight to behold, that's for sure", "Hollywood is interesting in many different ways. Hollywood Blvd itself is a bit seedy, cheesy and pretty dirty. It's teeming with \"characters\" such as Elmo, Spongebob and Spiderman who are really out jockeying for cash from tourists. It's definitely a bustling tourist trap. I think you have to see it once for yourself though. It's like a car accident. You can't help but stare.\nShow less"], ["Reviewed November 6, 2016", 5.0, "Great place to visit for culture & local people", "Third visit this year always exciting & interesting as usual with so much to visit/see. Local people pleasant/helpful & when i return each year to same food places staff remember you which is great. Shame to see so many homeless in such a rich, glitzy area, they are usually polite/not hassle, often with sad stories. Great scenery especially in H Hills/ R. Caynon. Local police helpful & friendly.\nShow less"], ["Reviewed November 3, 2016", 3.0, "Hard to get close!!", "The residents have won their battle which now makes it hard to get close to the famous sign! There are plenty of photo ops like at the corner of Hollywood Blvd. and Gower street in Hollywood."], ["Reviewed November 1, 2016", 3.0, "Quick drive around", "We wanted to check it off the list so did a quick drive through Hollywood. It's not that impressive, kind of dirty on the streets, too many homeless about, run down buildings. Sure didn't feel like stopping for too long nor having a meal out here. If you want to check it off your list of things to see because of what it represents from tv, drive around, otherwise, you can give it a pass and visit some more interesting places around LA.\nShow less"], ["Reviewed November 1, 2016", 5.0, "A view from afar.", "Only saw this as part of an open top bus tour , its just another tick on the list of things you do in Los Angeles. Over-rated in my view"], ["Reviewed October 21, 2016", 5.0, "wooden", "We went a few year ago and we found it a bit unexciting. Shopping was bad as my husband and I were not a size 0 but I did find something to wear, a scalf and I still have it. The only good thing was when I met little Richards. He lived in the hotel we stayed at.for the younger people out there he was a singer in the 60s. LA maybe for you but it depends on what you want.\nShow less"], ["Reviewed October 20, 2016", 4.0, "Massively regenerated area - was worth a quick stop", "We were last here 16 years ago - a hell of a lot has changed. It is much more geared toward tourism proper, now - and people seemed to like it. Very busy; a lot of the expected tourist trimmings - worth a little visit, perhaps, just a drive-through, even. We didn't stay long - 30 minutes was all we needed.\nShow less"], ["Reviewed October 13, 2016", 4.0, "Worth the drive", "If you are in L.A this is must visit .It is also perfect for running in the area and of course the most iconic Hollywood sign must to check this out .Keep yourself hydrated with the hot nice weather"], ["Reviewed October 13, 2016", 3.0, "Must See Attraction", "Once again, another attraction that you just have to say you've seen for yourself in person if you're a movie fan at all. The legendary Hollywood sign up in the hills has been in countless movies, TV shows and Documentaries. More of a vibe once you're there than anything else. If you're out in LA and want to do some sight seeing there's plenty to see in a relatively small area that you'll enjoy. The Hollywood area continues to degrade up and down the strip. Plenty of homeless, street people and beggars. Keep to yourself and just be aware of your surroundings and you'll be ok. Usually lots of tourists around so safety in numbers many times. However, worth going to see for sure.\nShow less"], ["Reviewed October 12, 2016", 3.0, "Where was all the glitz and glamour!?", "We stopped at Hollywood for a photo-walk right around the back of the area where you go to photo the Hollywood sign-much better. The stars on the pavements were interesting, as was the Chinese Theatre. A little too much for my liking, tho' a good experience. Enjoy it for what it's worth!\nShow less"], ["Reviewed October 12, 2016", 4.0, "ok", "went in when on hop on hop of bus been befor not inproved bit scruffy not as you see on T V, but if not been go and have look just to say been their"], ["Reviewed October 11, 2016", 3.0, "Run down and grubby", "We visited here last month, we found the whole area to be run down and grubby. We weren't surprised when our tour guide drove through this area, rather than stopped. The history of some of the locations was fantastic, although the state of the buildings, rubbish and the constant presence of homeless people put us right of.\n\nI'm sure the LA council and local authorities can make more of this area, clean it up and improve things for locals and visitors alike.\nShow less"], ["Reviewed October 11, 2016", 5.0, "So much entertainment", "I love Hollywood blvd from the characters to the street acts. The food stand and the attractions you can make a whole day of just being on Hollywood Blvd."], ["Reviewed October 8, 2016", 3.0, "A bit of a run down area - quite disappointing", "We did not devote much time to this area as it was in such a run down and poor area of the city, not really worth the detour!"], ["Reviewed October 4, 2016", 5.0, "Hollywood Sign", "I was on a Rasta Bus tour for the day and we visited the Hollywood sign which i enjoyed, very busy though. I took photos from the Observatory, lovely views."], ["Reviewed October 3, 2016", 5.0, "nice entire experience", "The best part of our usa tour. Because the most iconic attractions are here. We took picture of sign from lots of points. City is more peacefull when compared to New York. Hollywood is a must see city i USA."], ["Reviewed September 29, 2016", 2.0, "Hollywood", "Hollywood was the worst place I visited in the USA and areas of it are just seedy and dirty, Sunset Strip / Sunset Boulevard is awful. The iconic sights such as the sign, Walk of Fame, TCL Chinese Theatre are underwhelming and so overcrowded to enjoy any experience. I would not bother visiting this area again, we had a hop on hop off tour and didn't bother with one of the routes, couldn't wait to leave.\nShow less"], ["Reviewed September 29, 2016", 5.0, "great trip", "I went to Los Angels in June. I found it one of the most amazing places. I would do the trip over again in a heart beat. I was a step away from Hollywood blvd and there were a lot of things to do down there as well. The tour place was super close. It is called Starline Tours. I went to Universal studios but i found that there was not a lot of rides to go on maybe thats just me. I would recommend to try it out for yourself if you have not been. I liked DisneyLand better in Anaheim. I also went to Santa Monica and the famous pier and it was absolutely stunning the water so warm and so nice I want to live there hahaha. I love California and would go back hope you all enjoy your own experiences there.\nShow less"], ["Reviewed September 29, 2016", 3.0, "Fun in places", "Parts of the Hollywood Boulevard, especially away from the main areas like Chinese Theatre, are like a glitzy Blackpool. Lots of tacky souvenir shops. Chinese Theatre was great to visit, and this has the signed palm prints in the front of the building, lots of photo opportunities. Bit disappointed in parts due to tacky shops around.\nShow less"], ["Reviewed September 26, 2016", 4.0, "THE SIGN SAYS IT ALL!!!", "You see the signs in movies all the time so get up close and personal because you are seeing it with your own eyes. My husband is in LA on a project and I am from the Mid-west, but he drove me around Hollywood in style from Rodeo Drive to the Hollywood Hall of Fame with the Stars, it was like we were in a movie. You don't even have to get out and we were driving around Hollywood on Saturday night. We even went up and saw a few nice homes.\nShow less"], ["Reviewed September 25, 2016", 2.0, "Awful", "We stayed in an air b& b on Hollywood boulevard. All the attractions, Chinese theatre, walk of fame were all fab and a must see. But unfortunately the actual place is full of homeless people with mental health issues. They were everywhere, really scary and intimidating. You would also see drug taking with needles! Awful. My advice - just visit for the day.\nShow less"], ["Reviewed September 24, 2016", 3.0, "Just another overpriced, dirty city", "We were massively unimpressed with everything. The place is just a big, dirty city with overpriced shops and restaurants and is so buy, you can't see the stars on the Walk of Fame properly as other people are either standing on them or it's too crowded to stop too many times. The TCL is a lot smaller than we had imagine an is the same, too many people walking over all the pavement slabs and no order to anything so difficult to see an enjoy.\n\nWe were also constantly harassed by singers/rappers trying to sell their CD's and one in particular who accused me of not liking black people when I had simply smiled and said no thank you when he shoved his CD in my face. Not pleasant and they should be moved on.\n\nIf you're in LA, then you have to visit as why wouldn't you, but don't plan to spend too long here as it's very frustrating getting pushed and bumped every few seconds through the shear amount of people there at the same time.\nShow less"], ["Reviewed September 24, 2016", 3.0, "Glad we went - but won't go back", "You build up a vision of a special place you've heard of all your life and just know it won't live up to your expectations. We did the Walk Of Fame and the icons are just stars with a name, many of which have been defaced. To see Dick Van Dyke daubed with 'Penis Van Lesbian' upset me a little. Still found Elvis and The Beatles at the very start of the Walk. The hands and signatures outside the Chinese Theatre were great and were the biggest attraction. However, this was spoiled by the far too many hawkers wanting to make $10 for having your kid's photo taken with something dressed to look like some super hero or other. I was asked to pay for the 'privilege of hitting' Trump or Clinton with a hammer. For goodness sake! The selling of pirate dvds every few feet was another hassle - but just say no!\n\nOverall glad we did it. Been there done that and that's it!\nShow less"], ["Reviewed September 24, 2016", 4.0, "Fabulous", "Even though 'Hollywood' was not quite what I expected, it is not the cleanest city, it is still Hollywood and I enjoyed every minute of it."], ["Reviewed September 21, 2016", 3.0, "Dirty and not impressive at all", "I found it very dirty, disappointing and full of weird, paranoid people. You'd expect the stars on the sidewalk to be glamorous...but it's not. The best part was seeing the Beatles and Elvis partnered together. As a place, not great."], ["Reviewed September 20, 2016", 4.0, "Not what I expected, but still enjoyable", "I thought it would be mostly glitz & glamour, but was surprised at how much rubbish was around on the streets. Hollywood boulevard is pretty clean, but literally walk off the street & it's a whole different story. Despite the high number of homeless (& the stigma), they were quite passive & don't seem to bother anyone. It was amazing to see how many locals would buy food for them or take them inside for a coffee (faith in humanity restored). Easy to get around on foot or there's always the Metro (train), which is not only pretty cheap but there are attendants to help you get your tickets & Tap Card. Food is pretty ordinary & cost of everyday items too. Toilets are only accessible to paying 'guests' of a business, so no public toilets, seating & limited rubbish bins, so go prepared!\nShow less"], ["Reviewed September 19, 2016", 1.0, "Dont Bother", "To get there the traffic is so bad pretty much all the time it is awful.There is crime everywhere, police undercover roping in Johns looking for sex, dirty everything, horrible service at most places and it is just not a good place to visit."], ["Reviewed September 19, 2016", 4.0, "Hollywood! Iconic area of LA!", "We were staying in Hollywood for the 2nd part of our trip to Los Angeles. This was an amazing trip and we had a blast. Hollywood itself is fun and neat but it is a bit seedy. There are a lot of questionable people around. So just be careful.\n\nThe Hollywood walk of fame is really neat. The handprints inside of the Chinese Theater were my favorites. Make sure you check them out!\nShow less"], ["Reviewed September 19, 2016", 4.0, "Hollywood Walk of Fame", "I love walking through The hollywood walk of fame and the wax museum. This time I went in September it was a bittersweet trip. As I was strolling through the walk of fame I wanted to stop by and pay tribute and respect to my favorite singer/composer Juan Gabriel. Gone to soon. But was blessed to have gone to see his star in Hollywood.\nShow less"], ["Reviewed September 19, 2016", 5.0, "We found it by accident by starting out to Griffith observatory and taking a wrong turn.", "You have to see it at least once, but finding it can be difficult. We found it by heading toward Griffith observatory and then saw it and took residential streets until we found a great view."], ["Reviewed September 17, 2016", 4.0, "Hollywood", "We spent one day of our Vacation hitting Hollywood-a must if you have never been. My teenager had not and he was fascinated and loved every second. Did the walk of fame, Hollywood Blvd, Vine St, Sunset Blvd, rode along Mullholland Drive, continued to Beverly Hills, Rodeo Drive, Melrose Ave and many smaller streets where the rich and famous live. Tons of people trying to sell you things you don't need or want but the area is definitely worth a few days if you have never been.\nShow less"], ["Reviewed September 17, 2016", 5.0, "Nasty ... But Compelling", "OK, it is not the cleanest part of town, but if you are into people watching, and hordes of tourists, this is the place to be. The Walk of Fame, the cool architecture, the crazy people ... worth a visit!"], ["Reviewed September 16, 2016", 3.0, "Cannot see it at night", "I coudn't see the sign during nigh time because it is not illuminated at all. It should be lighted!!!"], ["Reviewed September 14, 2016", 4.0, "The known place for LA", "Where else not to be missed when in LA. Check out Hollywood - walk of fame near the buildings nearby. The visitor center is nearby too that can provide very good information too."], ["Reviewed September 12, 2016", 3.0, "Classic Sign", "Just a sign up in the Mountain/Hills that you can see from the street. Nothing too big or something to get excited about. However, a must see while there (just to say as others, that you were there) smiling"], ["Reviewed September 12, 2016", 3.0, "Just a city", "I was so excited to get to go to Hollywood for the first time but its nothing like i expected! i was expecting a beautiful city!!! but its very dirty there! other then that its pretty cool! Hollywood Blvd was awesome!!! Seeing the stars was cool and while on my trip we saw TJ Thynes from the TV series Bones and Gabriel Iglesias Friend Machete\nShow less"], ["Reviewed September 12, 2016", 3.0, "Hollywood the Time Squre of California", "A very interesting location, lots to see. Lots of history and things to do. I enjoy Hollywood Blvd, with lots of tourist traps, that are very unique. I liked the 2nd floor of the Roosevelt Hotel, they have a dedicated area to the history of Hollywood- very interesting and free\nShow less"], ["Reviewed September 9, 2016", 4.0, "nice view from mullholland drive", "go at the parking lot at the top of mullholland drive adn watch the city and the hollywood sign. many tours go there, as a-list tours. a highlite of my trip in LA"], ["Reviewed September 2, 2016", 4.0, "The pavements of Hollywood are not paved with gold", "The pavements of Hollywood are not paved with gold but with a lot of homeless people that live on the streets, actually going to the toilet in the middle of you in the middle of the day which we found disgusting. With homeless home made tent camps perched on the main road embankments.\nThe theatre from where the Oscars take place is in the middle of a very basic main street, and looks nothing from the front, but very nice when you actually go up the staircase into the theatre.\nYou can see the Hollywood sign in the distance from the main strip.\n\nWe made our own way to the Hollywood sign. We walked from the Hilton Garden Inn in downtown Hollywood along the main street to Beachwood drive, then walked up the dirt track trail to get some pretty cool pictures, much closer than the LA tours tour that we also took offered. But it did take a hour and a half walking each way, so take plenty of water.\n\nThe local history of how Hollywood , before we when to Hollywood we discovered that one of the founders of Hollywood actually came from where we live,( West Stanley, co. Durham. England).\nThat is where the Horsley brother's came from to establish the \"Centaur film company\", which was the first film studio in Hollywood.\nAlso on a different topic, Hillary Rodham Clinton's great grandparents also came from\nOxhill Stanley, Co. Durham, which is also the same town.\nHollywood was a very busy place and took ages to drive in and out of the main area it was always gridlocked.\nIt was supposed to be a 30 minute drive from the airport to downtown Hollywood but actually took us a hour,costing us $90 at 5pm rush hour.\nThe pubs and restaurants charge a service charge of 16%- 25%. automaticallyy put onto your bill.\nShow less"], ["Reviewed September 1, 2016", 4.0, "A sign that is an absolute must!", "Perhaps the strangest review I have ever written - it is about a sign and you don't need to get that close to enjoy it. We saw it three times - from Griffith Park, which we would highly recommend, from Hollywood and Highland shopping mall and driving the freeway to Universal Studios. It is a backdrop to an area, and to a culture - to see it is to see something you've seen before so many times on screen, yet to do so in the flesh is really truly much more.\nShow less"], ["Reviewed August 31, 2016", 5.0, "It's Hollywood", "Recently some friends from out of the USA came to visit. Hollywood was one of our\nplaces of interest to visit. No problem finding street parking on a side street. Walking on Hollywood Blvd. we saw many tourist spots. It was worth the visit. Hollywood has changed over the last few years. The businesses are there for tourists.\nShow less"], ["Reviewed August 31, 2016", 5.0, "Very Unique", "This place has so much diversity. You never know what you'll see and thats what makes it so great. Its definitely a place that everyone should see atleast once. Park and walk."], ["Reviewed August 29, 2016", 3.0, "you got to see it at least once", "we stopped to see the sign from the mall on hollywood and highland on the 3rd floor of the mall. We could see the sign but it was further away than we thought. At least we got to see it and check that off the list.\nShow less"], ["Reviewed August 28, 2016", 3.0, "Crowded, crowded, crowded!", "The Walk of Fame with the stars in the sidewalk is unbelievably crowded, especially at night. Impossible to walk on the sidewalk so had to venture into the street frequently. The orientation of the stars flip flops from one to the next so it's hard to see half of the names as you're walking. People abruptly stop to take pictures and you have to dodge around. Lots of seedy characters giving coupons and CDs away\nShow less"], ["Reviewed August 28, 2016", 2.0, "Holywood", "Not a fan of Hollywood or LA. Very seedy area, crowded and way to much traffic. Very surprised at how small the area around the Grauman's Theater was. Very difficult to look at the handprints etc. Would not go back to LA again."], ["Reviewed August 28, 2016", 3.0, "Bit of a disappointment - like Croydon High Street with stars", "We went on a day trip to Hollywood and found it a bit hit and miss. The Walk of Fame was a huge disappointment. There was no glitz and glamour and the area was generally seedy and full of homeless people.\n\nThe stars were interesting but to sum it up, we found Marilyn Monroe's star outside MacDonalds. It was difficult to see a lot of the stars due to the volume of people and in the end we just gave up.\n\nThe forecourt of the Chinese Theatre was better. Whilst busy, it had more of a feel to it as the famous names had provided something more personal, be it a comment, hand or footprint.\n\nWe saw the sign from a distance and it was good to see it - unsure what it was like close up.\n\nTo get to the Oscar Ceremony hall, we had to go through a shopping precinct - again the glamour of the occasion was reduced to everyday life and overall, Hollywood lacked the glamour and star quality we were expecting.\nShow less"], ["Reviewed August 25, 2016", 5.0, "Lots of shops and so many \"Stars\" on the sidewalks", "You can walk along Hollywood Blvd. and see so many \"Stars\" and even Hand and feet prints in front of the Chinese Theater. Lots of shops and Jimmy Kimmel Live Studio is along there. You can spend a lot of time there."], ["Reviewed August 24, 2016", 2.0, "I thought I'd found glamour", "Decadent neighboord. WeHo is better. Dangerous surroundings, homeless dealing with drugs selleres...i didn't like at all, my expectations was surprinsinly bad when i finally met the place i always dreamt to go. But the sign is iconic :)"], ["Reviewed August 24, 2016", 5.0, "Something to tick off your bucket list", "Its something you have to do when your in the area!! you can get some good trips including this and various other things such as the walk of fame, film locations, and shopping day where you can pretend your in pretty woman.\n\nYou need to get those iconic photos!\nShow less"], ["Reviewed August 23, 2016", 3.0, "More glamourous in the movies", "It is nothing more than a narrow walkway with the pink stars on the floor. One has to see it but given the hype around it you would expect much more than waht it really is."], ["Reviewed August 22, 2016", 2.0, "All that Glitters is Not Gold...", "Disappointing and a little scary. My 13 year old LOVES movies, and was really looking forward to seeing \"Hollywood.\" Unfortunately, what he saw there actually frightened him: dirty, seedy, unbelievably crowded, and lots of homeless people. Pot smoking was pretty prevalent. We took a tour and the guide said that before the Oscars each year, they close the street in front of the Chinese Theatre to clean it up and make it look nice for the cameras. We didn't even try the Walk of Fame...just wanted to leave.\nShow less"], ["Reviewed August 22, 2016", 2.0, "Unless you have tickets for the Pantages, I suggest you skip it.", "If the traffic and lack of parking doesn't do you in, the dirty streets are a real bummer. Some new shopping centers and Melrose shops, for the brave, but so many other places to see in LA! I'd skip it!"], ["Reviewed August 21, 2016", 1.0, "Famous Sign", "Sadly very disappointed that the nearest and best view of this sign (except when travelling around the city) is from a shopping mall balcony!"], ["Reviewed August 21, 2016", 4.0, "Shame the sign isn't lit up at night", "The epitome of Hollywood. Best views from Griffith Park or Griffith Observatory. Easy to drive to although local hotels can also take you there."], ["Reviewed August 18, 2016", 5.0, "BUCKET LIST!!!", "Hollywood is such a great place to visit. You are never disappointed with so many things to see and do."], ["Reviewed August 18, 2016", 5.0, "Loving it", "No trip to the US should miss LA and Hollywood . Everything you could want and some you did not know you wanted"], ["Reviewed August 15, 2016", 4.0, "Better than expected.", "We stayed in the Motel 6 which was a very good location. We walked a lot and never had any problems. Great people watching. No good way to pick a restaurant. Use the Metro to visit other spots."], ["Reviewed August 14, 2016", 5.0, "yes we finally found it!!!!", "We went to the Griffith observatory in order to manage to make pictures of the Hollywood sign. It was a must!"]]}}