{"Hollywood Boulevard": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Hollywood Boulevard", "url": "/Attraction_Review-g32655-d103401-Reviews-Hollywood_Boulevard-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/da/a4/85/hollywood-boulevard.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "reviewCount": "1734"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90069", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 3.0, "Have to See It", "So, let’s face it, you’re going to come here. There’s too much to see: Walk of Fame, Grauman’s Chinese Theatre, Dolby Theatre, Hard Rock Cafe, Hollywood Museum.\n\nThere are homeless people, panders, people foisting their CDs on you, etc. This is the Times Square of LA with all the same issues. There are folks in superhero costumes who will pose with you for a $5 tip. There are various merchants selling their wares, some of them good, some not so much. And there are tonnes of souvenir shops.\n\nLike any popular tourist street in any big city, be careful, especially at night. But keep in mind that millions of tourists visit every year and are perfectly safe.\nShow less"], ["Reviewed 1 week ago", 3.0, "So very sad....", "I've reviewed the Walk of Fame, previously. Hollywood Blvd, is full of different characters, all seemed friendly, but I didn't feel safe at all. There's so much poverty in LA anyway, and the tourists carry on walking by, yet I saw people with their dogs covered in blankets, and begging for food. It broke my heart. Horrible to be visiting a tourist spot, when people are living on nothing, and trying to stay alive. Heartbreaking.\nShow less"], ["Reviewed 1 week ago", 4.0, "A Few Tips for this Tourist Area from a Former Local.", "I lived within walking distance of the Walk of Fame for 5 years and have some tips.\n1. Don't lay on the stars, they aren't cleaned often, and someone puked on them last night stumbling out of a night club.\n2. The people with the purple shirts that say $5 Sale at the $10 store are there every single day. It's a scam. The prices have never once been $10, that is why they have shirts printed with sale on them, and why those shirts are faded from the sun.\n3. You don't have to tip the superheros. You should, it is how they make their living and LA is expensive, but they legally can't tell you what they charge or demand money from them. If you tell them that you know this they might back off. If they don't then threaten to report them. But only if they are being hostile... and honestly, you should tip them.\n4. Every bus tour is the same, but right near the end of the day you might catch a deal as they are trying to make a few bucks extra for the last tour of the day. In the morning though, forget about it.\n5. If you are looking for a specific star or celebrity, you can google it. Google will provide you with websites that tell you the exact address for Ringo Star, Betty White, and Brittany Spears.\n6. There are two people named Michael Jackson. One made music and then died. His star is near the Chinese Theater. The other Michael Jackson was a radio DJ in Ohio who got very old.. but last I checked is still alive. His star is on Vine and has a microphone on it. If you pose with this one grabbing your crotch, the locals will point and laugh at you.\nShow less"], ["Reviewed 1 week ago", 3.0, "must see", "Its a must see, but its dirty, scary and busy. the hawkers try to give you CDs for free then once you take it ask you for money. the Chinese theater busy and so dirty. the stars unkept and uncared for. the shops are either junky or seedy.\nI am glad we went, but once is enough in this life, Scientology recruitment was very heavy handed and in your face. The stars go for so long you cant see them all.\nThe impersonators pushy and overwhelming, i had a teen and she was very uncomfortable here. i think little kids would be scared. not my cup of tea but we can tick that off as been there done that.\nif you dont see it, dont worry\nShow less"], ["Reviewed 1 week ago", 4.0, "Always a different experience! Many things to see! Many people trying to make a living!", "Okay when you think of Hollywood you think of all the good things you see on movies and television. What you don’t think of is all the people literally living on the stars. We always stay polite and respectful to everyone and anyone we meet. There are a lot of look alike Hollywood characters you can pay to get a picture with. Or pay to get your name put on a star. Plenty of stores for gifts and snacks. Of course plenty of places to eat. If you are lucky you can catch a red carpet event. It is a very big tourist destination for sure. Be aware of your surroundings and enjoy the atmosphere. There is no place like Hollywood in the world. It is truly a international vacation destination! After all if it wasn’t for all the visitors and people wanting to make it big there wouldn’t be anything to see. If you are driving, walking, or going to see a event Hollywood Boulevard is a place to see and be seen! It is a true awakening when you see so many people in one place at one time!\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Filth and disappointment", "Dirty place full of weird and homeless people. Do not even try to use public transport unless you want to see something you have not seen before. Competely different from what I expected it to be. Half a day to see the key attractions is the maximum time I recommend to spend there.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Actually pretty disgusting", "So this is basically a sidewalk with these famous stars on the pavement which, when in hollywood, one should go see. But what Hollywood Boulevard really is: A street that smells of urine, has dubiouss shops on it, a lot of homless people. A litle further up, the smell is gone and replaced by people in spiderman costumes. All in all, it doesn't come near anything like Times Square, Nathan Road or any other famous avenues.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Stereotypical Tourist Street", "You will not doubt want to visit Hollywood Boulevard if you are in Los Angeles but there is nothing overly special about it. It's full of stereotypical tourist stuff and in some places isn't overly nice. Pop by for a few hours, but you don't need to spend a long time here.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Do it, so you can say you have", "But in reality, its one of those things that isn't great, but you do feel obliged to go see when you're in LA.\n\nThere is some fun in randomly finding stars of people you didn't expect, or that you are a fan of, but that's about it.\n\nAnd be prepared to be asked to go on tours.\n\nLots and lots of times.\n\nAnd then even when you think you're done, you'll get asked again!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "History", "It was exciting walking the boulevard. Even our young granddaughter appreciated the stars. The stores are plentiful. Most are super cheap. Plenty of places to eat. And I mean plenty. Easy to park on a Sunday."], ["Reviewed 3 weeks ago", 3.0, "You won't love it", "You will inevitably find yourself on Hollywood Boulevard during a trip to LA and you will almost certainly be shocked by the place. Dirty, smelly, more than a bit shady. See the sites you came for and leave."], ["Reviewed 4 weeks ago", 3.0, "Find your favorite star", "I found mine. didn't even know that they had a star on Hollywood Blvd. RUSH, the band, has one and I got to see Mel Brooks too."], ["Reviewed 4 weeks ago", 5.0, "It's what they say it is!", "Well it's Hollywood, and that says it all. The shops will draw you in, and the sense of being there where many have visited has it's own nuance."], ["Reviewed 4 weeks ago", 5.0, "So glad we made time for this", "We were in CA on a pretty tight schedule and didn't have much extra time, but we took public transportation to Hollywood Blvd and I am so glad we did. Great people watching, good bars, lots go look at and friendly people all round!"], ["Reviewed 4 weeks ago", 3.0, "For tourists", "Something you feel you have to do in L.A. is walk along the Hollywood Boulevard. Some parts are pretty seedy, lots of tourist shops, but we've done it now. The Highland Mall has good views of the Hollywood sign."], ["Reviewed January 23, 2018", 3.0, "Just Crazy", "Walking along you see people dressed as Super Heroes etc. they encourage you to have a photo taken with them and then insist on being paid, homeless people sleeping on the sidewalk, people with microphones preaching, people thrusting CD's at you don't stop don't take the CD, it is an eye opener, I guess this is Hollywood.\nShow less"], ["Reviewed January 21, 2018", 2.0, "Tourism Paluza", "If you need crazy, tourists & the slightly mayhem of anything that goes with it - This is the place to go"], ["Reviewed January 8, 2018", 1.0, "Hollywood I thought I walked into Detroit", "Very dirty to the point it smelled like urine everywhere. People sleeping all along the sidewalk, and if they are not sleeping they are begging for money. Harassed the entire time to buy cd's or bus trips. Parking was $30. All we saw was overpriced t-shirt shops. Not what we expected at all, DON'T WASTE A DAY going there are other things that are a lot more fun and cheaper!!!\nShow less"], ["Reviewed January 6, 2018", 2.0, "Hype - Not for me", "Never enjoyed the hassle of an overcrowded sidewalk. All the fuss about celebrities is not my thing. A couple of decent restaurants in the mall help breakwaway from the chaos."], ["Reviewed January 3, 2018", 3.0, "Know what you're getting into!", "First, for the uninitiated, Hollywood is NOT Beverly Hills. Don't expect glitz, glamour and ritzy stores and stars walking all over the place. Hollywood lost it's glam in the 40's and has not recovered since. Expect tourist traps and seedy stores. However, Hollywood DOES have the history. If you can accept the seedy side of it, it's a fun outing viewing the stars on the sidewalk and finding your favorites, averting your kids' eyes from some of Hollywood's more risque offerings. Also stop at the Chinese Theater to see the stars' foot and hand prints. Many famous movie and stage theaters are there, such as the Chinese, El Capitan, Dolby and the Pantages. Parking is easily found at the multiple parking lots on the side streets. Also a good jump off point for the multitudinous stars' homes tours.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Welcome to Hollywood", "Busy street, lots os people looking at the floor, taking pictures. For sure the place that everyone wants to visit. Just imagine the street closed and all the artist and characters of the movie industries walking on the red carpet to Dolby Theatre. Need more time to see everuthing, been there only a couple of hours\nShow less"], ["Reviewed December 23, 2017", 1.0, "Seedy, filthy and full of druggies.", "I was totally disillusioned after my visit. We visited on a Sunday afternoon the boulevard had a certain aroma of weed and urine . Homeless people abounded. The streets were filthy, the inlaid stars on the pavement were cracked or dirty . The shops were tacky selling cheap tourist tat.\nThere was an atmosphere of unease as beggars , CD merchants and people dressed in 3rd rate fancy dress with bad body odour tried to con you out of your dollars. A good survival tactic give no-one eye contact just walk purposely forward.\nA very intimidating atmosphere definately not glamorous . We saw druggies shooting up on the bvld . Why aren't the police out in force in this area?\nWe walked to the Chinese Theatre and felt stoned with all the \"smoke\" around us. A seedy place even on a Sunday afternoon. I wouldn't return.\nShow less"], ["Reviewed December 16, 2017", 1.0, "Disgusting.", "Definitely not what we expected. It was disgusting. I live near New Orleans and even Bourbon Street was more pleasant (and that doesn’t say much).\n\nSo many people soliciting. It go so out of hand we just left after eating. Couldn’t even look at starts it’s so crowded.\n\nJust nasty honesty. Not even worth going there just so you can say you did it.\nShow less"], ["Reviewed December 15, 2017", 3.0, "Enjoyed The Walk of Stars", "Hollywood Boulevard is a bit grotty and tacky, truth be told, but we still really enjoyed the walk of stars, looking for some favourites and enjoying the razzmatazz of it all.\nIt's kinda cool to be in Hollywood, the centre of the movie world, but a day or two is enough because it can all get a bit much.\nStill, you won't be bored on Hollywood Boulevard to be fair. It's good fun for a short stretch.\nShow less"], ["Reviewed December 14, 2017", 5.0, "Bucket list item", "One needs to visit Hollywood Boulevard if in Hollywood.\n\nIt ticks off another bucket list item.\n\nHollywood Boulevard is famous for Walk of Fame but along here you will find the cd scammers , beggars etc. The Walk of Fame brass stars in the sidewalks is located along 15 blocks of Hollywood Boulevard and three blocks of Vine Street in Hollywood.\n\nAlong this boulevard there is also the TLC Chinese Theatre , souvenir shops, cafes and restaurants and the large Hollywood & Highland Mall where one gets a great view of the Hollywood Sign. Plenty to see and do.\n\nThe area is buzzing with many tourists visiting this popular tourist street.\nShow less"], ["Reviewed December 10, 2017", 3.0, "A bit chaotic", "The area—obviously—is very touristy and gimmicky, but it’s still worth a visit. It’s also easily accessible by public transport (red Metro line).\n\nIf you manage to escape all of the people trying to sell you some kind of tour tickets, those giving out (read: they’re not free—don’t take one) CDs and other tourist traps, you should be okay. Hollywood Boulevard is also filled with homeless people, but I haven’t encountered any problems when I’ve walked around here. I wouldn’t say it’s safe, but it’s not dangerous either.\n\nThere’s plenty of souvenir stores, and chain stores and cafes. To save time, go to the huge souvenir store just up from Madame Tussauds. It has everything all the other stores sell and then some.\n\nAnd avoid visiting the area on the weekend. There’s a produce/food market held on Sundays, which means there’s even more people. I’ve noticed it is less busy—but still busy enough—during the week.\nShow less"], ["Reviewed December 10, 2017", 3.0, "Don't Expect Hollywood Glitz", "How could you come to LA and not visit Hollywood Boulevard? Though don't expect to come here and see all your favourite stars; except the one's on the boulevard itself.\n\nThe area is generally made up of tourists, gift shops, tattooists, smoke shops, and porn theatres...the surrounding areas look a bit ghetto too. Though it is Hollywood and it's worth visiting the once.\nShow less"], ["Reviewed December 5, 2017", 3.0, "Still Active at 3AM", "We visited the iconic boulevard at 1AM and stayed for a couple hours on a Friday night watching local musicians and taking in the nightlife. It was loud, and we were approached by multiple intoxicated individuals asking for photos with us. The experience was exactly as I expected.\nShow less"], ["Reviewed November 30, 2017", 1.0, "Not what you expect...", "Recently returned from 4 days in Hollywood, apart from the excellent Loews hotel nothing else positive to say, walk of fame full of people hassling you, streets dirty, homeless people (not always their fault) witnessed a drug deal in broad daylight, general feeling of being unsafe (travelling with a toddler)\nFor such a main tourist location did not see any police presence at any time. For those who may know it is like visiting Benidorm in Spain.\nShow less"], ["Reviewed November 21, 2017", 4.0, "Crowded and Lots to see and do!", "This was my very first time to Hollywood Blvd and I had fun . It’s much easier to walk for a better view than to drive so that is what I did. I wanted to take pictures of the stars and find my favorite actors etc. I definitely didn’t come prepared with the water I needed In the hot LA sun and prices were not cheap. There were many different types of people everywhere, obviously tourist. Shops, restaurants , hotels , homeless people performing for money and so much to do. You can see the Hollywood sign from the strip near California Pizza kitchen.I recommend a walking or bus tour just to get familiar with the area and get some great views (pictures) Also there is a city pass you can purchase to get around the city. Overall I had a amazing time and would definitely come back.\nShow less"], ["Reviewed November 21, 2017", 4.0, "The biggest street in Hollywood", "Hollywood Boulevard is the most famous street in LA and has many great tourist attractions, restaurants and shops. However, it is a bit dirty and there are lots of homeless people and scammers. People in costume are frequent and will charge you to take photos with them. Anybody handing you a free mixtape will then demand money and it will likely turn out to be a blank CD. I suggest you keep your head down/\nShow less"], ["Reviewed November 20, 2017", 4.0, "WOW !!!! SOOOOooooo many people - Surrounded by an Aura of EXCITEMENT", "This attraction of Hollywood West is absolutely BUZZING. The amount of tourists, Buskers, Peddlers and so on is HUGE. We asked whether the pace ever died down - answer: around 3-4am you would be able to walk up and down quite freely without dodging hoards of people.\n\nTrying to read all the Hollywood Walk of Fame plaques proved to be difficult, but hey, first-time visitor to this city, just HAD to be able to say \"been there, done that\" - at least once, but would love to go back and allow for a LOT MORE time.\n\nTaking photos of the famous \"Hollywood Sign\" from this location proved to be quite challenging as well due to the massive crowds. Would suggest perhaps early morning might be a better option to stroll Hollywood Boulevard, before the tourist crowds descend.\n\nNonetheless, still got some great pics of some of our favourite celebs hand / foot prints & personal messages.\nShow less"], ["Reviewed November 19, 2017", 3.0, "Busy. Dirty. Diverse. Amusing", "Lots going on and much diverseness in a small area of the strip. Like most of LA, it smells and is dirty, but as long as you stay around people, felt rather safe. Had a lot of different food and beverage and lots of shopping options. Don't expect to be able to stop for a professional instagram shoot on the hollywood stars - way too crowded.\nShow less"], ["Reviewed November 15, 2017", 2.0, "Big disappointment", "We took a tour bus to California to visit several areas, including Hollywood Blvd.\nI was disappointed in how some of the street \"performers\" treated us. They were very pushy and demanding. Several of them pushed up against me trying to hand me CD's while others tried to pull me toward them for photos. When I declined, one of them called me welfare-trash coming to their state and not wanting to spend money. Indeed! I wasn't the one on the streets in a ratty Wookie costume begging for money.\nShow less"], ["Reviewed November 14, 2017", 1.0, "2 hrs wait, front of gen/seating line, and they walked us past good seats to the very worst.", "Don't count on getting best seat possible by where you are in line. We were the 3rd ones in the general ticket line. Didn't expect to get the front because of the people with priority tickets going in first, but we stood in line from 2:15 til 4 and when we got to the actual studio, they asked \"How Many?\" Then walked my daughter and I past seats that were open in the front row all the way to the side as well as others scattered about and we were put in the very very last possible worst 2 seats in the back next to the sound editor and 2 ushers who stood next to us or in front of us during the whole show. It would have been fine if those were the last available seats but they weren't. The people behind us were put in 2 seats four rows back from Jimmy. That was biggest complaint, the rest is basically because I have been to The Colbert show which set a standard Jimmy didn't even come close too. We stood in a long line there too, but we were walked in and ushered in, row by row. Where you were in line, determined how good of a seat you got, as it should in a general seating line. Also, Stephen Colbert came out before the show started and talked to the crowd for quite a while. He also explained things that were going to happen as the show went along. John and the band put on a great performance before Stephen came out and there was a warm up comedian before they played who was funny. Even after the show and Stephen runs out high five-ing people on his way out, he came back in and talked to us again and thanked us for coming. If you go to see Jimmy Kimmel expect to see what you see on TV and not much more. There is a warm up comic who was not funny, and he is just telling us to scream more than trying to say any sort of jokes, but who cares, you don't come to see him....Then all of a sudden they roll the credits on the tv monitors and Jimmy comes out. After a monologue, they went to commercial and Jimmy is talking to people on stage, similar to Colbert. They came back and he did another monologue and video clips/skit, then at the next commercial, he talked to the crowd for 3 to 5 minutes, well, just one couple in the front row really. After that, the guests would come out, they would have commercials the same way with celebrities and staff talking on stage, then each guest, when done, the comic would say, Say thanks to so and so! and we would clap and the would leave out the door. After the second guest left, we thought we would see the singer, but then they said, Say thanks to Jimmy! and off he ran out the doors just like the guests and that was that.No thanks for coming, or anything. Apparently, they had prerecorded the singer. The stage producer/director, I'm not sure who he was, had come out and talked to us in line before the show and said the guests that would be on the show. It included the singer who we never saw, and he even said Jimmy's cousin was going to be there to cause some mischief. He wasn't. If you can get free tickets and don't have to stand in line for hours, go for it, otherwise, don't wait in line. You see nothing that isn't on TV that night and it wasn't worth waiting that long for.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Some is good, some is gross, all is interesting", "Some is good, some is gross, @ll is interesting. Hollywood Boulevard has been improving, block by block, building by tourist trip. Hollywood and Highland is great and Hollywood and Vine has been gentrified. The blocks in between still require attention.\n\nBest to take the subway between Highland and Vine. Alternative is to checks the sidewalk stars and walk diligently between Highland and Vine.\nShow less"], ["Reviewed November 13, 2017", 1.0, "No walk of fame more like walk of shame", "This street is so run down and dirty did not feel safe there at all. All we seen were people off their heads on drugs shouting at us and following us a lot of drunk and drugged up people this was a major disappointment when you can see people clearly shooting up on the street slot of homeless also. I thought this would be one of the main attractions of the visit it was not all we could smell Was piss and weed come on Hollywood clean up this street do not go after dark\nShow less"], ["Reviewed November 12, 2017", 4.0, "A place to go but not at night with kids", "My drama geek son and I were giddy to see the theatres and walk of fame. So many sights and pictures taken! Once it got dark it was a bit skeevy for a woman and young teen. Glad we went and got to see it!"], ["Reviewed November 9, 2017", 5.0, "Long walk", "This street goes for a while. Some attractions. The mall, jimmy kimmel studios, the hollywood stars names engraved on the streets. There's a lot of tourist attractions. It's a bit spaced out but you can cover most of the activities within 2-3 hours."], ["Reviewed November 8, 2017", 3.0, "Very interesting things to see, but be careful of your belongings", "There are a lot of people hustling on the BLVD, I think we were approached by at least 20 guys asking if we wanted their \"free cd\" but as soon as you go to take it, they ask for money...nothing is free, always remember, these guys really won't leave you alone so we learned to tell them sorry we have no cash. There is a lot of history here, we went to the Wax museum, the Chinese theatre, the Hollywood museum, and then we wanted to leave because it does not feel safe here, and make sure to hold your belonging tight to yourself because there are a lot of people trying to pick your pocket. This place was on my bucket list but was not my favorite part of the strip. If you plan on checking out all the museums make sure to buy a GO PASS so you don't pay full price for these places, not worth the full price.\nShow less"], ["Reviewed November 7, 2017", 3.0, "Typically tourist", "Calmed during the day, packed at night. Mostly full of souvenir shops, people dressed like Superman/Spider-Man, a few bars, shops, Wax / Ripley’s museum and not much more. A visit to visit only once in a lifetime"], ["Reviewed November 4, 2017", 3.0, "Tourist trap", "Nice to see and browse the street for a minute or two, but you will soon get tired of all the vendors here."], ["Reviewed October 31, 2017", 4.0, "Expensive", "This place is accessible by red line metro and contains some of the expensive food and shopping outlets. I would not recommend for tourists from here. Either go to glendale or citidel outlet."], ["Reviewed October 29, 2017", 3.0, "Disappointing", "It's an experience , not good not bad .There are loads of touts pushing tours ,photos CDs etc ,so not a relaxing trip .Hard to get photos ,you can see th Hollywood sign up some steps .Plenty of famous buildings ,plenty of souvenir shops ,and lots of homeless folk\nShow less"], ["Reviewed October 29, 2017", 4.0, "Nice place to walk around", "People have really high expectations for this place, besides the stars with names on the floor and all the lights and crowd it is nothing special. In the end my expectation were not much above that so I am not disappointed and would return again!"], ["Reviewed October 25, 2017", 1.0, "Where Are the LAPD", "Not a cop on sight. Seedy, nasty place that locals don't care about because if they did, it would be cleaned up. As a New Yorker, I'm proud of how far along my city has come from just 20 years ago. This place has a long way to go.\n\nWe saw a dude shoot up heroine on a bench in the middle of the street at like 9 pm. Amazing how disappointing this place is. Watch your backs if you go.\n\nLegit, just how is it possible that there is zero police presence??\nShow less"], ["Reviewed October 25, 2017", 2.0, "Disgusting", "Arrived here with my two friends on our travels, they were both really looking forward to it, they actually really liked it but it was overshadowed by the stench of the place. It stank! There were homeless people everywhere and rubbish. One of my friends accidentally bought a CD off a bloke from the street that she didn't want. The shops are all the same, aimed at tourists had a good selection of tacky holiday junk we all love. The McDonald's was disgusting and had a creepy man in the women's toilets - please avoid going there. The place needs an upgrade and a deep clean. Wish they would address the homelessness issue too - provide help for them. Car park was very handy right on the side of the Boulevard but wasn't cheap. Not worth staying for longer than an hour.\nShow less"], ["Reviewed October 24, 2017", 2.0, "Forced into paying for a CD I didn't want", "Was crossing the street in midday and approached by a friendly looking person saying that I could have his CD for free, next thing I know it I have to pay him 20 dollars then his friends another 20 dollars each. Lost around 80 dollars to them. I saw another review here about them targeting Asians which sounds correct as we were asian too. So avoid interaction with people around here didn't feel safe.\nShow less"], ["Reviewed October 21, 2017", 2.0, "Tacky!", "We visited as we wanted to see the Chinese theatre and walk of stars - all in, I'm not sure it was worth it.\n\nThe area is very tacky and whilst I didn't feel in danger / at any risk, I did make sure that I kept an eye open and constantly checked my family were OK and we all checked we still had our wallets / phone. A bit of a dump.\nShow less"], ["Reviewed October 15, 2017", 2.0, "Tacky and unpleasant", "Really disappointed with Hollywood Boulevard. Parked at the Hollywood and Highland garage by the Dolby Theater which is a convenient spot. Hollywood Boulevard itself was really disappointing though.\n\nThe sidewalk was full of people dressed up in awful costumes throwing themselves at you for pictures - and if it isn't them its people selling their tours, CDs or just straight up beggars not to mention its super crowded. Only real upside was the day I visited they had shut the road as they were doing a film shoot for the show Lethal Weapon so I got some good pictures without any cars in the road.\n\nWas cool to see some of the stars on the sidewalk, but that was about it. Too crowded and all there is on the street is huge tacky gift shops. Plenty of nicer places in LA.\nShow less"], ["Reviewed October 12, 2017", 3.0, "Really nothing special - only the stars", "Whole LA city is nothing special or interesting to see or explore it as a city attraction point. Only the film industry and hollywood by itself makes this city interesting to explore -\ncinema studios, Beverlly hills and so on. The same is about Hollywood Blwd - nothing to see, except the stars on the ground. Take a walk along the stars and grab some photos and do not expect something else interesting to see.\nShow less"], ["Reviewed October 11, 2017", 2.0, "Local Low Life Spoil this Attraction", "When visiting LA everyone heads to Hollywood Boulevard to see the stars in the sidewalk. Nobody tells you about the low life who are attracted to this area. Unfortunately it doesn't feel safe even in the middle of the day as police presence was minimal on my visit. It seems like it is the LA centre for tourist scams which is a pity. When you see a celebrity getting their star on TV you don't see the junkies, beggars and scammers. I wonder if they are paid off for the day?\nShow less"], ["Reviewed October 9, 2017", 1.0, "Why do people come here?", "I only came here because I thought it was a necessity when visiting LA for the first time. It was filled with junkies- shooting up drugs on the sidewalks. The streets were covered in trash and people were literally following us asking for money. We were here mid-day-- I would never come in the evening. It seems very unsafe. I live in NYC-- and it is a million times cleaner. To be honest, the only thing I cared to see was MK and A Olsen's star and it was closed off for an awards show. Never again.\nShow less"], ["Reviewed October 6, 2017", 2.0, "Beware of cd sellers on this street!!!", "I visited here in feb, there were bunch of street music cd sellers on the street they said they are the one who recorded music. However, They were forcing people to buy their cd. One of them said ‘you got to buy this , cuz you touched my cd’(they put there cds on people’s hand or cell phone, there s no way to not touching it). And another one goes ‘give me 20, give me 20 or i am gonna bit the xxxx out of you’ this cd seller group consisted of 4guys around 175cm tall. I believe their target was asian tourists who doesnt speak english good enough to call the police. It was midday around 11:30.\nI d like to recommend not to walk around here alone\nShow less"], ["Reviewed October 5, 2017", 4.0, "Take a stroll", "After reading all the recent bad reviews I was a bit dubious about going there, but when in Hollywood how can you not go there!\nHeaded off about 4 .30 pm on a warm afternoon it was great.\nThe place was buzzing , had a couple of drinks in a 2 for 1 bar had dinner at hooters, checked out some souvenir shops looked up our favs on the walk of stars got entertained by the characters on the street.\nShow less"], ["Reviewed October 2, 2017", 1.0, "The biggest disappointment of my travel history", "Went there at 8 PM. I was prepared maybe for a too touristy place, but I did not mind that, you know I am in LA, and I had to see this place, I was expecting glamour, you know the feeling you get when watching the Oscars...but man...this was not it. It was rough, no one in the street but homeless people, I looked at the stars on the pavement searching for a some actor name I like, but then I thought, what am I doing here. I took a taxi and left. Is 8 PM too late to visit that place? Or is always like that. Nothing to see there.\nShow less"], ["Reviewed October 1, 2017", 1.0, "Smells like urine, oh that is urine!!!!", "Walking down the sidewalk with all the stars, whole place stinks of urine, homeless person just passed out in middle of sidewalk with a stream of fluid eminating from him, obviously peed himself. Place is filthy and loads of homeless/ drugged/ drunk people laid out often right in the middle of the pavement. I would say most of the stars would be turning in their graves to see the state these streets are in.\nAny new stars would probably resist have their star there to be peed on.\nShow less"], ["Reviewed September 30, 2017", 3.0, "Not the best experience", "Honestly wasn't impressed. Overcrowded, noisy and dirty. You could hardly get to the stars stars with the amount of people there. Some of the stars are cracked and as much as I dislike Donald Trump it was sad to see his star covered in rubbish. There is also lots of scammers trying to get money off you - literaslly got off the tour bus to have a man give me a \"free\" cd , wrote my name on it and then asked for a tip for it . I thought ok Ill give $5 to go away he looked in my wallet and said theres a $ 20 wrapped in a receipt ma'am...I kid you not! Also on the day of our visit weird Christian people screaming at everyone that we were all going to hell. Not the best and better things to do in LA.\nShow less"], ["Reviewed September 30, 2017", 5.0, "A mecca for entertainment fans", "This famous boulevard is very historical. There are many old theaters on this street, as well as some good restaurants. While much of the glitter is gone, it is still worth seeing. It is probably better to drive down Hollywood Boulevard than to walk it."], ["Reviewed September 30, 2017", 4.0, "Iconic of LA", "Any one who visits Los Angeles will make it a point to visit Hollywood area. This was once the famous in the world for making of grand films, even now the US films are known as Hollywood films it is so important. There are lots of items in this area, you can make in one day or more it depends on your interest.\nThere are some good shopping places and restaurants . We really bought some good sites for men. Price also reasonable.\nIt is hot in the summer so be prepared for walk. Comfortable footwear and dress.\nShow less"], ["Reviewed September 29, 2017", 2.0, "Disappointing", "As an introduction to Hollywood there must be better places to start. I get it celebrity stars laid in the pavement, important cinemas and theatres. However, this means crowded pavements as people stop and photograph stars, touts pushing tickets for tours, street acts and homeless people. The general impression is grubby. Endless souvenir shops (on the positive these shops have cracking air conditioning). However, if you've seen one you have seen them all.\nShow less"], ["Reviewed September 28, 2017", 2.0, "Sad and disappointing.", "I have been to Hollywood once before, as a teen, and was excited to come again. My husband and I did one of those tour buses and hopped off early to walk back. We were absolutely horrified by the state of this famed place. Dirty and run down doesn't quite describe it. It feels like there is a solid coat of grime all over this place and could use a serious power washing. The most disheartening thing was the sheer number of homeless sleeping or wandering the streets, either heavily under the influence, severely and persistently mentally ill, or both. People without shoes, dirty and tattered. I am well aware you cannot help those who refuse the services, but it seems like in a land of such wealth and excess, more should be done to address the area's overwhelming vulnerable population. So many times my husband and I felt incredibly uneasy and really saddened at the state of the world there. My recommendation would be to stay near the Dolby Theater and Hollywood & Highland, where you can still see the walk of fame and some interesting street performers.\nShow less"], ["Reviewed September 28, 2017", 1.0, "Dump", "Disappointed it was so dirty not what I expected all horrible scruffy shops .. not impressed at all, will not be going again, considering so much wealth there, should be lovely needs cleaning up!!!"], ["Reviewed September 27, 2017", 4.0, "Vibrant place", "It's a vibrant place buzzing with both tourist and locals. There are lots of bars offering seats overlooking streets for bird watching.\nThere are many live performances on streets which are entertaining and so are characters. The place also has many famous Theatres.\nSpend few hours in the area, Must see attractions.\nShow less"], ["Reviewed September 27, 2017", 3.0, "Not very clean.", "Very disappointing for a person from overseas with expectations. The stars in the footpath are cracked and dirty. Numerous shops shut and boarded up. Lots of fast food places and bars. Expect homeless to be sleeping on the footpath. While I acknowledge there is a lot of history to be seen, especially if you are a film buff, this is not a good advertisement for it.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Buzzing and Alive", "We took some of the other reviewer advice and visited at night. It was energy filled and quite the spectacle to take in. So do visit and do it at night.\n\nWe parked in the mall right there. Inexpensive and well located. Spent a couple hours walking, watching and taking pics. Glad we did it.\nShow less"], ["Reviewed September 22, 2017", 1.0, "Really horrible", "I visited Hollywood expecting some tinsel town magic, all I got on Hollywood Hollywood Boulevard was a horrible smell of urine everywhere and lots of poor homeless and acutely mentally ill people everwhere.\n\nShame on the city countcil for not wasking the streets here given the amount of tourists that visit to see the Stars names on the pavement.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Just Fun for Crazy Photos", "This is the second time we've Traveled here.\nJust fun to people watch and walk around. Many Photo opportunities. You can even see the Hollywood Sign from here.\nThere are a few street performers. Few are good some are pesty. You will see people handing out CDs.. they want a small donation... trying to make a buck on their music. If you're not interested... keep walking.\nI like to see the sites... there are various places to purchase cheap souvenirs...\nJust Go and enjoy...\nShow less"], ["Reviewed September 20, 2017", 3.0, "Not a great use of limited time", "If you really feel you need to check this place off you list of places to see then do it at night, find a parking garage a block or two off the strip for about $8 and make a quick trip up and down a couple of blocks around the Chinese Theater. You can be in and out of there in an hour and on to much better things.\nShow less"], ["Reviewed September 15, 2017", 3.0, "underwhelmed!!", "Well, this place is a huge let down! The stars are set in the pavement in a very average part of town which was not what we expected. It's dirty and crowded and after about ten minutes you will want to leave! The street vendors are a bit overwhelming and one even stuck a live snake in my partners face which freaked her out! Hollywood is not a very nice place does not compare with Beverly Hills which was the exact opposite to this place.\nShow less"], ["Reviewed September 13, 2017", 2.0, "Girls go to Cali!", "This was my first trip ever to California. It was cool to see the hand prints and footprints of some very one and new actors and actresses. The walk of fame stars was fun to looks at. I caught myself just looking down and times. But as for Hollywood Blvd itself.....Dirty, nasty, RUDE people (the people trying to peddle there CD's) I was totally caught off guard by some of the comments when you did not BUY the CD. This is one of my Been There Done That. Probably would not go again.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Short Stop in Hollywood, Not enough time!", "Some love it, some hate it; We Love it! Based in LA this time, (discussed in another review) whilst on a coach tour so drove us around most of Hollywood on the coach and then dropped us off to do our own thing. We actually stayed here in Hollywood two years ago, and really got on with the place; Why?, because there’s lots to see and do. Sadly, we were only here for a couple of hours, but having been before we knew where we were going. The Chinese Theatre, the Stars Handprints in Cement, Lowes Hotel Shopping Complex and of course the lovely walk along Hollywood Boulevard looking at the Stars names on the pavement. (That’s ‘sidewalk’ to our American friends) Absolutely Great, we just love the place! All of the above is fully accessible to all, both disabled and able bodied, both old and young, as it is flat and spacious. All shops etc, within this area are also accessible for the same reasons. If you choose to drive here in a car, parking is available nearby, but have no idea of charges as we’ve never driven here. Two hours is not long enough to see everything on offer; in fact, if you had much longer, as we did two years ago, then you could take in the latest movie showing at the Chinese Theatre, which is quite voluptuous inside, with really nice seating and the Imax Screen is something to behold. Well, that’s it for this visit, have to catch the Bus!\nShow less"], ["Reviewed September 7, 2017", 3.0, "Crowded and very Touristy", "Walking down Hollywood Blvd reminded me of walking around Times Square. It's crowded and slow with lots of touristy things to do. There is a lot to do up and down the block, but I would probably recommend going earlier in the day before most of the crowd.\nShow less"], ["Reviewed September 3, 2017", 4.0, "Interesting", "Very crowded at peak season,interesting to go to and plenty to see. Worth a visit just be prepared for it to be so busy"], ["Reviewed September 3, 2017", 4.0, "Day in LA", "Hollywood Boulevard is over rated. The Chinese Theater is its BEST real attraction, which was our very first stop after arriving into Hollywood. The Stars on the street were smaller than I'd imagined and were EVERYWHERE. Lucked out and saw Mickey Mouse's and Michael Jackson's Star, which I thought to be kinda ironic.\nShow less"], ["Reviewed September 2, 2017", 1.0, "Ruined by those rude beggars.", "This is the worst experience we had in USA. This is like a broken Hollywood dream. The \"up-coming\" rap star enforced me to take his CD. I ignored him and he just kept yelling at me: where u from? Bro, i'm asking you! Chill bro! Relax bro! I suggest all of you just skip this \"attraction\".\nShow less"], ["Reviewed August 29, 2017", 4.0, "Very Busy Area", "We stayed just off Hollywood Boulevard for 4 nights. It is a very busy area day and night, but really comes alive in the evening. You name it, its there on the strip. I felt a little unsafe in the evenings, you just need to be aware. I found the strip to be a bit on the shabby side.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Expensive Timepass", "Driving through hollywood boulevard - u can see all the stores the cafes and theaters- its very crowded and all the stores are very expensive- but u can see glimpses of lot of things which u only see in the movies but now can see them for real.\nShow less"], ["Reviewed August 27, 2017", 3.0, "Driving down Hollywood Boulevard", "It was fun to see but it is definitely overrated! The street is quite scruffy and certainly doesn't ooze star appeal however to drive down, stop for an hour and have a look is well worth it. A top tip from our motel, drive to the Highland and Hollywood shopping mall on the boulevard and park in their underground car park. Parking is $2 for 2 hours as long as you get your ticket validated at a shop, we bought a Coke and that was enough. Go into the mall and if you go to the second floor there is a viewing platform to see the Hollywood sign. A must!! It was fun, glad I did it.\nDon't expect to see real stars on the Boulevard, you get to see dodgy people dressed as Super Heroes selling CD's, I avoided them and have since learned they are after money.\nShow less"], ["Reviewed August 25, 2017", 2.0, "Tacky, tacky and more tacky", "It's amazing to see the tawdry sidewalks of Hollywood so crowded with tourists when the \"attractions\" are so poor -- silly shops, uninteresting displays, desperately unemployed actors in costumes hoping to be photographed for bucks. The real magnet of Los Angeles isn't here! Go to the Griffith Observatory! Hike up to an overlook of the Hollywood sign! Visit the beach in Santa Monica. Skip the crowded streets of Hollywood!\nShow less"], ["Reviewed August 20, 2017", 4.0, "Amazing but scary", "The walk of fame with all the stars runs 25 blocks (about 2,600 stars) so you have to be dedicated. Graumann's Chinese theatre, the Egyptian theatre, Capitol records etc etc afe along the Boulevard. It's absolutely fascinating and amazing. The scary part is the number of hawkers along the street, who try and blag you into getting a photo with them in their Spiderman/Wonder woman etc costume or dancing to their music/buying their CDs etc and just won't take no for an answer. They get nasty if you won't give them money for taking that picture. I ened up giving one very threatening man $10 for a CD I didn't want just to get rid of him and out of the place alive. Brrrrr.\nShow less"], ["Reviewed August 10, 2017", 5.0, "A Stroll Down Hollywood Boulevard", "A Stroll Down Hollywood Boulevard always rekindles an appreciation for the hundreds of stars memorialized there who have used their unique talents to entertain us through various media.\n\nMemories came flooding back as I toured the Chinese Theater, Walk of Fame, Hollywood & Vine. Best to go early before the crowd swells.\n\nDon't forget Sunset Boulevard. Last trip I stayed @ the Andaz (loved everything about it!), which is surrounded by attractions within walking distance or a $5 Uber ride.\n\nBe sure to visit other attractions & areas in West Hollywood.\n••••••••••\n\nI took awesome photos of the *Stars* while walking on the sidewalk & of the buildings & signs while Ubering slowly ~ but a glitch in TA's App would not allow me to Choose them. Sorry.\n••••••••••\nShow less"], ["Reviewed August 6, 2017", 5.0, "A must be", "It's just impossible not to pass here. Even if you don't like cinema (like me!) this boulevard is amazing! The walk of fame, but also the characters in the street (be careful, they ask for tips for photos), the theatres create here a specific atmosphere."], ["Reviewed August 3, 2017", 4.0, "Interesting", "Its an interesting place to walk around. There are many places to walk into and buy souvenirs or book appointments for city tours."], ["Reviewed August 1, 2017", 5.0, "Many things at stake", "Hollywood Boulevard did a nice movie brainstorm in my mind; there are people with costumes on the streets and both sidewalks are filled with famous older and newer stars. I always wanted to go there."], ["Reviewed July 30, 2017", 1.0, "Horrible in every sense of the word", "Did this to 'tick it off the list' but it was an incredibly disappointing experience. Tacky, dirty and boring. I think 20 minutes is more than enough time to get a measure of the strip and then perhaps another 30 mins tops for browsing the shopping centre. There are plenty of places to get something to eat and drink in the mall.\n\nIf you had to cull something from a busy itinerary, this would be a choice candidate.\n\nShow less"], ["Reviewed July 29, 2017", 1.0, "Hollywood boulevard: smell of piss, puke and canabis", "This a place that comes close my nr 1 place of no go areas. Hollywood bld is dirty, overcrowded and filled with cheap souvenirshops and fast food outlets. This is the exact opposite of Beverly Hills, which is only 10 min from here. Plenty of homeless people, people trying to sell a star watching tour every 50 yrds, combined with the smell of piss, puke and canabis. I was close to vomiting myself because of this (not an exaggeration). If you want to spent your time and money on the good things in life, don't go here. This is probebly the closest thing to hell on earth.\nShow less"], ["Reviewed July 28, 2017", 2.0, "Hated everything about it except...", "....hard rock cafe. The strip is dirty and full of superheros trying to take your money for pictures. I hated it and would never return. The hard rock was a great escape from the disappointing strip."], ["Reviewed July 28, 2017", 4.0, "Worth visiting", "How could you visit LA and not check out Hollywood Boulevard? There are 2,600+ famous stars on the pavement on either side of the boulevard - the fun is to see how many you recognise.\n\nThe Boulevard is lined with cinemas and theatres and many gift shops, obviously aimed at the tourist market.\n\nVery touristy, but worth a visit!\nShow less"], ["Reviewed July 24, 2017", 3.0, "Crowded, wild people watching, but you have to at least check it out.", "We stayed right off Hollywood Blvd so we went out at all times of the day and night. It gets very crowded, but that's to be expected since it's such a concentrated area with many attractions. The walk of fame is definitely something you have to check out while you're there.\nShow less"], ["Reviewed July 22, 2017", 2.0, "still a dump", "I was at this street 3 times. 2000, 2008, and a week ago (2017). Nothing changed, still a dump, crowded with tourists, beggars, impersonators want to take pictures with you for money. The city takes so much money from tourists and pockets them all. No idea how they cleanup on Oscar night. I guess they probably kick those people temporary off the street, put some red carpets on to cover all the filth, garbage, junks, etc. What a shame for such a famous street\nShow less"], ["Reviewed July 20, 2017", 3.0, "Crowded and Dirty", "We couldn't understand how all of the stars come here during the award shows because how dirty the area was. The stores, restaruants, bars, theaters were great in a three or four block area, but we wish it was cleaner. Great place for people watching."], ["Reviewed July 18, 2017", 3.0, "Love & hate", "It's one of those \"attractions\" that you will love because you have to see it as it's famous, but you'll hate for the fact that it's too busy and too touristic. What does it mean? Go early and take no too much time to see it. After 11 am it just gets very busy in peak season and too many tourists and people trying to benefit from the tourists. Note: parking is very expensive, but you have not choice. Between US$ 15 and US$ 20 per time (usually for about 3 hours or so)\nShow less"], ["Reviewed July 17, 2017", 2.0, "Why?", "I arrived with a tour, within 5 minutes I was back on the bus. Busy, dirty, crowded and why would you want to look at a grubby footpath.."], ["Reviewed July 14, 2017", 3.0, "Hollywood experience", "Hollywood Boulevard is the ideal place to have a Hollywood experience. It has the Hollywood walk of fame and the Dolby theater, also the Chinese theater."], ["Reviewed July 14, 2017", 2.0, "Bring Sanitizer!", "I use to love coming down here as a teenager, but it has gotten so bad. The city makes plenty of money you think they would take better care of the stars. It's just sad to think this is what tourists think of Hollywood. The architecture is beautiful but yet deteriorating due to lack of care. Word to the wise walk it but don't let your kids be barefoot or if they fall wipe them with a wipe or better yet sanitizer. Do not let your teenagers walk alone, its pervert capital.\nShow less"], ["Reviewed July 13, 2017", 4.0, "Walk. Don't Drive!!", "There's so much to see here, but you'll have to deal with massive crowds to do so. You can certainly drive down the Boulevard, but you'll be going just as fast--if not slightly slower--than the thousands of pedestrians on either side. You may as well walk for the full experience.\n\nThere are plenty of souvenir shops and such along the way, but I enjoyed getting a glimpse of the Roosevelt, Chinese Theatre and, of course, those famed stars!\n\nIn all, it's a must-do if only to say you did.\nShow less"], ["Reviewed July 9, 2017", 3.0, "Walk don't drive", "Just like NYC this is definitely a walking adventure. I suggest driving through to check out and scope your adventure. Then find a place to park and back track until its time for lunch or dinner. Cross over and return."], ["Reviewed July 7, 2017", 4.0, "Good day of shopping", "My wife loves to swing by here whenever we are in the area. There are a lot of little shops that sell a variety of things from souvenirs to clothes. Of course the star walkway is fun to look at and find celebrities that I know and my kids know. There are plenty of places to eat and the few restaurants we tried were good and worth the price. My wife always finds unique shoes and jewelry here that we have trouble finding back home.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Jimmy Kimmel Live.", "My daughter and I attended a taping of Jimmy Kimmel Live, at the El Capitan Theatre, On June 7th. We got in line around 2:20pm. I believe the line started heading in at 3pm. After getting inside, you watch some videos. Then you are let inside the theatre, where they guide you to your seats. There is plenty of instruction on what is going to happen before, during, and after the taping. The main celebrity for the show was Michael Keaton. Very cool! What a very nice guy. Jimmy Kimmel was great! What a funny guy. The entire process for watching the show was a lot of fun for us and very interesting. I would absolutely do it again.\nShow less"], ["Reviewed July 1, 2017", 3.0, "Not great", "Worth it just to say you've gone and check on the walk of fame. The streets are gross, it is a littered with cigarettes and people constantly begging for money. Definitely was disappointed"], ["Reviewed June 28, 2017", 4.0, "It's Hollywood", "This little \"side trip\" was fun - full of quirky characters on the street, as well as walking the \"Avenue of the Stars\" - quintessential California experience."], ["Reviewed June 26, 2017", 3.0, "Just OK", "We stopped because I had never seen the Hollywood stuff on my previous trips to LA. Because of a late flight we didn't have as much time here and short of being able to take a tour that was fine. It was interesting to see once, but there are a lot of people hawking stuff and many gift shops. Glad we saw it but not in any hurry to go back.\nShow less"], ["Reviewed June 23, 2017", 4.0, "Skanky, but a must see", "It would be a shame to visit LA and not go to the Hollywood Boulevard. Yes, it's crowded with other tourists and you get constantly bothered by touts, hustlers and other dodgy characters. But you see the Walk of Fame and the handprints in the Chinese Theatre. Park in Hollywood and Highland - only $2 for 2 hours with a validated ticket. Don't go at night though and keep a tight grip on any children.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Crowded , tacky yes , but still worth a look !", "We were staying within 10 minutes of HB (far enough away from it that there was no noise or riff-raff around) and ventured down that way twice. Walk of fame , street \"performers\", photo opportunities with movie characters , souvenir shopping. All good fun.\n\nIt is true that at times the streets get packed with people and those soliciting $$$ for a photo can be annoying but as others have said , if you expect it , you will be oblivious to it and can just roll with it.\n\nWe had 2 young kids in tow but only did the walk late afternoon and NOT in the evening. Kids loved it. But I couldn't comment on whether it is a suitable thing to do in the evening with your family.\n\nShow less"], ["Reviewed June 9, 2017", 1.0, "Avoid.....", "Didn't know what to expect before visiting here but certainly was surprised! Filthy, disgusting street with people begging or trying sell you tours/cds/ or photos with poor imitations of Disney characters every few meters. Would not recommend or ever return."], ["Reviewed June 5, 2017", 3.0, "Always bustling", "Everyone comes here to see the Walk of Fame and it has become an incredibly busy tourist attraction. Walking down the block requires a lot of maneuvering around crowds. There are a lot of people dressed as famous characters who take photos for tips, but beware as some of them can get quite aggressive, especially when they pop into your photos uninvited. Parking around the area is also very costly (ridiculously so!). Not an attraction I would visit often.\nShow less"], ["Reviewed June 3, 2017", 3.0, "Hollywood Boulevard – See Your Favorite Star’s Star.", "Hollywood Boulevard is where you will find the Hollywood Walk of Fame which consists of more than 2,600 stars embedded in the sidewalk six feet apart. You can find the stars on both sides of street covering 15 blocks on Hollywood Boulevard and three blocks on Vine Street. The purpose of the stars is to commemorate achievement in the entertainment industry to include well known actors, producers, directors, musician, fictional characters such as Donald Duck and musical and theatrical groups. There are five different types of brass symbols that you will see to include: motion picture camera, television set, phonograph record, radio microphone and twine theatrical masks for comedy and live stage performers. Movie Stars such as Gene Autry have more than one star for the different types of genre that he performed in. Before you go you may want to search on the internet for the location of your favorite Star’s Star. You will also see a bunch of other characters out there who are trying to get you to spend your money.\nShow less"], ["Reviewed May 28, 2017", 5.0, "One of a Kind", "Walking down Hollywood Blvd to find the stars from your favorites. Lots of people dressed as Characters from our favorite movies, will take photos for a tip. Chinese Theater, Hard Rock cafe and lots more to see. Good for a nice stroll in LA."], ["Reviewed May 27, 2017", 3.0, "Part must see, anothe not so", "Part of Hollywood boulevard is \"must see\" for while visiting Los Angeles, another is is not so fun. Tourist spots are packed for people, there are touts and peddlers around. Nice places to see, like walk of fame, theatres etc. Another part is sicial priblems of people.\nShow less"], ["Reviewed May 26, 2017", 2.0, "Never again", "It was so much fun and we were enjoying the whole experience up until half naked girls started harrasing us. They had no panties on and families were walking past. I have never witnessed anything like it. I was so dissappointed in the whole trip down Hollywood Blvd at the end of the day. Lots of \"protesters\" camping on the side of the road, lots of people on some kind of high - the world has gone so sick!!\nShow less"], ["Reviewed May 24, 2017", 3.0, "Hollywood Boulevard", "I think its slightly over rated. Nice in pictures, videos but i was actually expecting more. Its 90% tourist there along the boulevard with souveniers and gifts shops one after the other"], ["Reviewed May 23, 2017", 3.0, "Get there early, way worth it", "We purchased a tour, that's office was behind the walk of fame. We got there around 8am, got a starbucks and walked around, took pictures, saw the stars. When we returned from our tours in the afternoon, wall to wall people. I can't imagine pics taken in the afternoon could be taken without strangers feet in the picture. I was pleased we got this attraction in before any tourists arrived for the day.\nShow less"], ["Reviewed May 20, 2017", 5.0, "Boulevard of Creativity and Loads of People", "Walking down the walk of fame is quite the experience, especially on the weekends.\n\nThere are so many people performing near Hollywood/Highland, the businesses are really sightly, and the stars are home to individual statements.\n\nWhat I thought was really nice was that a tribute to Chris Cornel was left on his star by a fan just after his tragic passing. Things like this are what makes Hollywood Blvd a pleasant little walk.\nShow less"], ["Reviewed May 16, 2017", 4.0, "Take the Walk of Fame..", "Seriously, love it or loathe it, would anyone come to LA and not check out the iconic Hollywood Boulevard?\n\nI enjoyed it and the crowds, CD peddlars and superheroes offering photos along the main drag didn't bother me. It's all part of the experience and easy to ignore given you have so much else to stimulate you especially if you love the movies. So yes, there is an element of tackiness but just go with it.\n\nI caught the Metro Red line to Hollywood/Highland from Union Station ($only $25 for 7 day unlimited) but you could also get off one stop earlier at Hollywood/Vine which is also right in the middle of the Hollywood Walk of Fame. All within a few hundred metres of Highland Station is the Dolby Theatre (where the Oscars is held) the famous Chinese Theatre where celebrities from the Golden Age of Hollywood have left their hand prints and messages with us forever, Hollywood Museum, Madame Tussaud's, and of course, the iconic and ever growing Hollywood Walk of Fame. There are plenty of food options nearby as well.\n\nThis is easily worth a half day of your time if not longer (why not walk down two blocks to Sunset Blvd to check that out as well?). I'd also recommend a trip to West Hollywood as it is very different to Hollywood Boulevard and will give you a better overall feel for the city.\nShow less"], ["Reviewed May 11, 2017", 4.0, "Infamous Hollywood", "This is the reason you come to Hollywood. Yes, it's very touristy and very crowded, but if you plan ahead and appreciate where you're at, you'll enjoy you're time here. A must-see when visiting Hollywood."], ["Reviewed May 8, 2017", 2.0, "Not a fan", "Hollywood Blvd is over-rated and so not LA. Just a tourist trap. So many other wonderful things to see and do in LA. Skip this one."], ["Reviewed May 8, 2017", 3.0, "Hot, busy and overated", "Too busy to get anywhere close to some of the Hollywood stars. Hot and full of pushy tourists and touts. It's very difficult to soak up the Hollywood history here which is a real shame."], ["Reviewed May 6, 2017", 5.0, "Way better than expected!", "There is lots to do here. No matter what type of group you are with, you should have a great time. We went with our family on a long road trip (ages 6 to 60-something) and all enjoyed ourselves.\n\nIn just the short time we spent there, we were able to experience crazy people watching, tons of lights at dusk, amazing performers in costume, souvenir shopping, and lots more. We would recommend a stop here!!!!\n\nParking sucks, so plan ahead.\n\nAfter that, enjoy your time here and be respectful of the people out working in costumes! A dollar or two gets you lot of great photos with these creative people. It's worth it! They really get into their roles!!!\nShow less"], ["Reviewed May 4, 2017", 4.0, "very busy", "in the tourist bits its lovely and its busy. we had a nice 3 mile walk each day from the hotel so we saw quite a bit more both nasty and nice."], ["Reviewed May 3, 2017", 1.0, "Come on Hollywood - clean up this dump!", "We were so looking forward to visiting this iconic location and had explained to our children all about the walk of fame. We were all excited.\n\nWe stopped by Hollywood Boulevard after a day at Universal Studies so it was about 3.30pm when we arrived.\n\nWe saw a sign for parking so drove into a rough surface car park where the guy asked us for $25. This was their only rate. So we paid.\n\nAs soon as we got out of the car we felt uncomfortable. We walked the short distance to Hollywood Boulevard and stopped. There were people yelling at us to take a celebrity home tour, homeless people sitting on the pavements in groups openly smoking pot, transvestites strutting up and down, people shoving their goods at you - usually cd's - and if you took hold of them they demanded payment and finally the poorest excuse for batman etc characters you have ever seen aggressively requesting a picture with them and then charging you for it.\n\nHorrible vibe and to top it all the walk of fame was filthy dirty and many were cracked.\n\nWe dived into the Madame Tussaud's museum which was great and a super reprieve from the dump outside.\n\nWe spent no more than an hour there - I can't imagine anyone wanting to spend any longer!\n\nTotal disappointment.\n\nSo come on Hollywood Authorities- clean up this attraction or lose your tourist revenue.\n\nShow less"], ["Reviewed May 3, 2017", 5.0, "DO NOT MISS this, do not worry about the crowds or crime", "sometimes the blvd has a bad reputation because there are a lot of people and some of them 'hustle but it is very well policies and there re a lot of things to do, just walk around and see for yourself."], ["Reviewed May 2, 2017", 3.0, "Very busy location", "Watch your step here as you are so busy looking at the ground and up and around you constantly are walking into tourist and locals alike. It is quite congested at busy times around lunch and evening when the sun goes down. It is not the cleanest part of town and can be a bit smelly.\nShow less"], ["Reviewed April 28, 2017", 1.0, "Seventh Circle of Hell", "This \"attraction\" should be avoided at all costs.\nWe had the misfortune of having a dinner reservation at a local restaurant and emerged after nightfall. It was as if we were in some zombie movie. We were surrounded by people keen on separating us from our belongings.\nIf this is Tinseltown, you can keep it.\nShow less"], ["Reviewed April 26, 2017", 4.0, "Touristy Street, Shops, Souvenirs", "It is definitely worth a visit in LA, even if it is by car or you can go for a walk you can find cheap souvenirs, I always drop by when in LA and every time I see an interview, or a presentation, or some sort of celebrity spotting.\nShow less"], ["Reviewed April 25, 2017", 4.0, "Day Visit", "Stayed at Loewes Hotel so close to the boulevard. Enjoyed the strip but would stay in Beverley Hills! Has a Train Station centrally so is easily accessible. It's where the Oscars are so a visit should be planned,"], ["Reviewed April 24, 2017", 3.0, "Not my thing", "We spent half a day here as we were traveling with a big group of dancers & this was one of our half-day excursions. It wasn't my cup of tea but it was still good to see such an iconic attraction. It's a fairly touristy area with lots of people trying to sell you tours, charge you for photos & tacky souvenir shops galore. The shopping was pretty good & we enjoyed seeing the stars on the walk of fame. Overall its ok for a few hours but I wouldn't bother going back.\nShow less"], ["Reviewed April 22, 2017", 3.0, "When has Spider-Man ever not laundered his outfit!!!", "When he is walking up Hollywood Boulevard is when! You have to go here when in LA but walking the short distance to cover the stars is not as awesome as it should be. The people dressing up as stars like spidey and cat woman are a joke. One guys costume was so faded it wasn't red and blue anymore, but more a grey colour. it is fun in that it has a lot of eccentric folk working the street but we couldn't help feel like we needed to be careful about being ripped off or puck pocketed so be warned\nShow less"], ["Reviewed April 21, 2017", 2.0, "Hollywood stopover", "I suppose you have to do Hollywood on an Los Angeles stopover but frankly I wouldn't bother. This was probably the most underwhelming part of our entire trip, a little shabby and quite frankly we could have been anywhere. Sorry, in our opinion spend your money somewhere like San Fran, LA not worth it...\nShow less"], ["Reviewed April 17, 2017", 1.0, "Filthy & Rundown", "The street is filthy, worn and tired. On top of this, you are bombarded every 5 yards (no exaggeration) by someone begging you for money, whether a tour operator, an \"up and coming rapper\", or a homeless guy. Get your photos and leave!"], ["Reviewed April 16, 2017", 3.0, "Times Square West - Visit but don't plan on staying long", "Hollywood Boulevard is pretty much Times Square West. If you have been to Times Square, you will recall the many sketchy folks walking about in dingy character costumes enticing you to take photos with them in exchange for money. You will also recall the many people attempting to hawk some type of tour, DVD or CD. Well, all of that is found on Hollywood Boulevard as well. In addition, there are a fair number of street beggars hanging about.\n\nIs it worth a visit? Probably, if for nothing else than to see a few of the stars embedded in the side walk and to see the Chinese theatre. Should you plan on staying very long? No. Go for about an hour and you will see everything necessary.\nShow less"], ["Reviewed April 11, 2017", 1.0, "not worth it", "Disgusting to say the least.... The Hollywood past must be rolling in their graves, Except for the old cement memories outside Groman;s, nothing to see. A real shame to see this once great place, brought down to Time Square of the 70's"], ["Reviewed April 10, 2017", 2.0, "Road works everywhere and not much to look at", "Not what you expect at all. The top end of this road was crummy run down area, and near the bottom where I guess all the pictures are taken was blocked off by road works. Skip this part of the tour and go see Santa Monica instead .\nShow less"], ["Reviewed April 10, 2017", 5.0, "Fun, Wild Sights and A Feel Of Old Hollywood", "Start at Hollywood and Highland and walk a square mile. Along the way you will be on the Walk of Fame, its pure fun to walk on stars that have been in the ground for 60 years. Plenty of shopping and lots of food choices. Star look a-likes, its photograph and a selfie bonanza\nShow less"], ["Reviewed April 6, 2017", 2.0, "Disappointed!", "I was so looking forward to travel to LA to explore this beautiful cities that you see in the movies (I thought). This avenue is one of the first things you think abou visiting when going to Los Angeles; you think about movie stars, fame, the oscars... is nothing like that. First, it's far from the centre and we had trouble finding it . (ahaha). it's also too crowded, which is to be expected I guess, and just much longer than I thought. which ends up being boring. I wast dissapointed in general with the whole city. :(\n\n(check my instagram for my travel photos! :) IG anamafalda8 )\nShow less"], ["Reviewed April 5, 2017", 2.0, "Disgusting", "The smell of urine and marijuana fills the air and there are people living on the curbs. It's very sad actually. Very filthy everywhere. I left the trip feeling gross."], ["Reviewed April 3, 2017", 3.0, "funny enough", "You get to see a lot of people dressed up as all kinds of characters. It's way too crowded and not the cleanest area but it has a certain character. Some street performers stage acts here and there. We didn't get a lot of CD offerings and nobody tried to take photos with us which was good.\nQuite honestly almost all the Supermans and Spiredmans we saw didn't look anything like the real thing. There's a Spiderman in Toronto that's way more interesting. We even witnessed a police chase which really made it feel like Hollywood.\nShow less"], ["Reviewed April 3, 2017", 1.0, "Worst experience of our trip.", "In LA for spring break with teenagers- Hollywood blvd was, of course, a stop on our trip to California. The stars were fun to see, but the costumed vagrants were obnoxious and abusive. As my 15 year old son walked down the street wearing a lakers jersey, a costumed man (one of many) yelled at him to take a photo (which of course costs money). When my son smiled and continued walking, he was screamed at and accused of being a racist!\n\nLA- get control over this area. We refused to spend a dime there after that. What a waste.\nShow less"], ["Reviewed April 3, 2017", 4.0, "Hollywood!", "On this street you can find everything, those who offer tours of the city, luxury cars, souvenir shops, restaurants, bars, the Chinese theater (with footprints in cement of celebrities), the Dolby theater, endless stars on sidewalks, countless homeless and costumed superheroes, and if you're lucky even a few Hollywood stars in the flesh. One thing is certain, you must visit Hollywood Boulevard when you are in Los Angeles.\nShow less"], ["Reviewed April 1, 2017", 2.0, "See once and move on", "Every time I go near this area I can't get over how dirty and more unsafe it is. It's one of those most dos in LA, but it's not the real Hollywood. It's extremely crowned and there are a lot of homeless and people trying to rip you off around. Also every second person seems to be dressed in a costume and trying to get you to exchange your cash for a photo.\n\nKeep your handbag near you at All times. This is not a safe area and as the evening comes it becomes less safe.\n\nIf your in a car it's probably only worth a drive by unless you are going to one of the Attractions nearby. If you do want to look at the walk of stars this is the best place and other parts of the blvd are even less safe.\nShow less"], ["Reviewed March 30, 2017", 5.0, "Larger-than-life Hollywood Blvd - must do", "Awesome Hollywood Blvd, as tourists to LA gravitate here. Celebrities of Hollywood's Walk of Fame where stars' hand & foot prints are done in the pavement; so many stars to chase up and reminisce. Dolby Theatre (used to be Kodak Theatre), TCL Graumans Chinese Theatre, El Capitan theatre. Hollywood & Highland Centre mall, fabulous plaza (view the Hollywood sign on a clear day, to the far distant hills), too many sights to mention; no time to do them all. I have gait/walking challenges (stroke), all sightseeing has to be well-researched and not overly taxing; I wear a legbrace.\n\nNot to mention lookalike-celebrity impersonators everywhere, lining the road hawking the photo opportunities for tourists. Despite the tourist traps, it is a fun place, upbeat and cool for a short period. And shopping opportunities like Zara, Sephora, bars, restaurants, photo opportunities everywhere.\n\nA must to visit.\nShow less"], ["Reviewed March 29, 2017", 4.0, "Crowded", "Hollywood Blvd is a destination that you have to experience, (been there done that). Be careful, as you start walking along the Blvd to get to the chinese theatre. It's very crowded and you will be approached by many people. Firstly by the \"C.D givers\" who shove C.D's at you and then expecting you to give them cash donations, and Secondly by the \"Dressed up Characters\". They will approach you and ask to take a photo with you, others wil just grab you or jump into your photo shot and then expect you to pay them for the photo. Don't get me wrong, it's a place you must see, but be wary. Don't take the C.D's or be firm and politely say NO THANKS. Other than that, It is an O.M.G experience especially when you see the stars on the sidewalk and the foot prints at the Chinese Theatre.\nShow less"], ["Reviewed March 26, 2017", 4.0, "Hollywood............", "On vacation to the USA, travelling our bucket list this is a must place to visit to soak up the atmosphere, looking at the stars on the pavement was great but its just a street well lots of streets with stars in the pavements."], ["Reviewed March 22, 2017", 3.0, "This is an L A scene;", "probably everything you have heard about it is true. the street is loaded with people; visitors, a few locals, and lots of people in costumes trying to get you to pay to have your picture taken with them. If you like looking at the stars to see your favorites, go. The Chinese theater is sool with all the hand and footprints. Lots of retail, tourist junk and good places too, especially at Hollywood and Highland.\nShow less"], ["Reviewed March 20, 2017", 3.0, "Not Family Friendly", "I see that the city is trying to keep this famous tourist street going by putting in large malls, movie theaters, and parking (at the mall), but for the most part, both sides of the streets are dirty, crowded with local people trying to sell you tours, invite you to their adult bars, or get you to take a photo of them dressed in costumes. Think Vegas Strip without the Casinos and hotels. We've been here many times now and it does not seem to improve. Certain areas, they keep the solicitors out of the way so you can actually experience it like around the Chinese Theater. We've just run into too many solicitors that will hand out things (like little balloons to our kids) and then chase us to pay for them after. The only thing worth seeing is the handprints at the Chinese Theater.\nShow less"], ["Reviewed March 19, 2017", 4.0, "Must see", "People, lots of people. Stars on the street, hand prints in concrete. View to the sign. Everything is here. Be aware of pickpockets and scam artits with costumes and free CD's."], ["Reviewed March 15, 2017", 3.0, "Not how it looks on TV", "I wasn't disappointed with Hollywood Boulevard as it was how it was told it would be, but the hype with all the TV coverage and the Oscars makes it out to be something that its not.\n\nWe went the day after the Oscars for 3 days of sight seeing, and god it was bad. Dirty, plagued with people hassling you to take there CD of the new big artist, the shocking costume characters who should be sued by each of the intellectual property companies they belong to.\n\nBut\n\nYou have to do it. You can't come all this way and not see it.\nShow less"], ["Reviewed March 5, 2017", 2.0, "Not great!", "We were totally disappointed with Hollywood Blvd. It was gross and weird. Only part that is worth it is the block with the Chinese theatre. And how much can you really do? Just drive by and call it a successful trip!"], ["Reviewed March 4, 2017", 3.0, "Meh", "It was ok. Nothing really stood out or was that special. The Walk of Fame is alright, as is seeing all the handprints at Mang's Chinese Theatre. However, be aware that people will give you a 'complimentary' copy of their CD, however, they would appreciate if you gave them a tip\nShow less"], ["Reviewed March 3, 2017", 3.0, "Don't walk around at night", "This is ok. It is a bit run down. Some parts are really good eg. The star walk of fame, but some parts are dodgy and I wouldnt go out there at night. Good to see just to tick off your list, but I wouldnt stay too long\nShow less"], ["Reviewed March 3, 2017", 4.0, "Gotta visit", "This is my second visit to this area. Although we did not do much, walking around just seem to be enough. There are lots of people around all the time which is interesting to observe."], ["Reviewed March 1, 2017", 2.0, "Homeless people & graffiti", "I was so looking forward to walking the area but I mostly kept my head down or focused on the distance. There are so many homeless people, graffiti, drugs, etc. that it was uncomfortable that I was just pushing through quickly so I could be done. I wasn't even enjoying the scenery.\nShow less"], ["Reviewed February 25, 2017", 2.0, "From Glitz to Grim", "This area is known around the world as the epicenter of the entertainment industry. T.V, movies, music, award shows, talk shows. Hollywood has long been source of the pilgrimage to success in entertainment. The walk of fame, the historic theatres, the production companies, shops, and restaurants combine to make Hollywood a Hub for those hungry for a taste of the industry to this today.\n\nUnfortunately, the glamour of the mid 20th Century has seemingly become all but a shadow of its former glory. The streets of Hollywood Boulevard are now riddled with homeless, drug addicts, drug dealers, punk kids, and prostitutes. Peddlers abound trying to sell you their souvenir junk. People in costumes of notable Hollywood figures are glad to pose with you, but will be not-so-friendly when you don't tip them. Wannabe rappers hand out their mix tapes like candy for \"free\", yet snatch it back out of your hand when you don't \"donate\".\n\nThe streets smell of urine, and litter obscures the start lined promenade. The area is noticeably dingy and grim. I would not recommended taking my family here at night, if at all. Of all the places to see in Los Angeles (and there are innumerable wonderful places to see), Hollywood is definitely one to pass on. Unless you like the smell of urine in your nostrils, the crunch of old newspaper, used napkins, and dirty foil wrappers under your feet, the pull of your loved one on your arm in fear of the local scene, definitely do not visit Hollywood.\n\nThe boulevard might be acceptable for viewing the walk of fame, maybe the Chinese theatre, and a couple pictures. This can be accomplished in an hour. After that, move right along to greener, less urine-soaked areas of L.A., like Santa Monica, Malibu, Venice, and Redondo/Hermosa Beach. Or drive south to the sea side communities of Huntington and Newport Beach.\n\nPass on Hollywood Boulevard and thank me later. You're not missing much!\n\nShow less"], ["Reviewed February 25, 2017", 3.0, "Okay if you want to see buildings, lights and people", "Around Hollywood & Highland intersection is the busiest with street performers, museums, souvenir shops, etc. Lots of displays and tourist traps. Watch out for scammers including costumed people squeezing into your photos or handlers dropping animals on you and then demanding money (you're not obligated to give them anything, feel free to walk away). If you just want to see Walk of Fame Stars without fighting crowds, head to Hollywood & Vine.\nShow less"], ["Reviewed February 24, 2017", 1.0, "Drugs", "Don't take kids here at night\nWe stayed too long at universal . Planned on leaving at 2 but didn't leave till 4\nThen the shuttle was late to bottom of the hill.\n\nUsed the subway ect . That was ok.\nBut Hollywood Blvd was full of freaks every step .\nI have seen this in Hawaii but this was way different and scarey!\nWe smelled more pot then fresh air .\nWe quickly walked 4 blocks made a circle then went back to subway and back to Disney.( his was 6:30-7:30pm)\nToo dark to see Hollywood sign .\n\nWe did the public transportation all the way from Disney to universal\nWas good the worst part was anehiem city bus .\nEven at 6:30 am.\nAll the rift raft !\nShow less"], ["Reviewed February 21, 2017", 4.0, "Sidewalk of Stars", "It was interesting to look for the stars of celebrities on the sidewalks. I liked that there is a Buffalo Wild Wings there too! There are a few good souvenir shops in the vicinity also."], ["Reviewed February 18, 2017", 2.0, "A very disapointing and somewhat dated street", "When in Hollywood, after taking a selfie with the Hollywood sign in the background what else should you do? Well take my advice and forget Hollywood Boulevard! Having carefully negotiated our way from Lake Hollywood Park down to street level and searched for a convenient place to park for a short while we were confronted by a very run down, dated and somewhat seedy looking Boulevard. So much so that we didn't even venture out of the car. It was not at all the glitzy and glam Hollywood that I had expected. As they say you win some and you lose some and this was most definitely a loser/\nShow less"], ["Reviewed February 16, 2017", 4.0, "Not what I thought", "Hollywood Boulevard is not the \"Hollywood\" you would think of movie wise, still it is part of the Hollywood \"culture\", definately dated, but lots of \"Historic\" things to see."], ["Reviewed February 13, 2017", 4.0, "Hollywood Blvd", "The names of many stars you will see will be covered with thousands of feet. It hard to see these in popular times, but its really just a sidewalk to everyone else."], ["Reviewed February 6, 2017", 4.0, "Legendary walk", "We were confused if we should look down the sidewalk and not miss a star or we should look at the buildings which are full of culture history."], ["Reviewed February 6, 2017", 5.0, "Dirty disappointment", "As long as I like to see and feel different cultures and mixed themes I can't stand all the dirt and shouting. Religion manifesto? Check. Drunk vets? Check. Dancing half naked junks? Check. Tons of made in china stuff? Check Check Check. If this is Hollywood's true face you shouldn't be surprised the city is only for the chosen one.\nShow less"], ["Reviewed February 1, 2017", 3.0, "A must do to tick of the LA list.", "Its the sort of thing you have to do at least once. Great to walk down the strip, stop at the chinese theatre. My faves are to stop at Hooters for some chicken wings, and a choc sunday at the Disney café. Take a token few pics of stars, and hands in stars handprints.... worth the cheesy walk down. Good view of the Hollywood sign... a trick is to take a photo through the binoculars.\nShow less"], ["Reviewed January 28, 2017", 4.0, "Good fun", "We had a great time here. Just watch out for the tour guides though, they can be very pushy and really annoying."], ["Reviewed January 24, 2017", 2.0, "Darkness", "This is inexplicably popular with tourists despite the fact it's overrun with druggies, winos, whores, fornicators, and actors. Yuck."], ["Reviewed January 20, 2017", 5.0, "Where Hollywood comes alive in absolute!", "Hollywood boulevard is a long stretch of entertainment filled mordern road. When you go there remember the boulevard is long walk of a couple of kilometres. So where your walking shoes. Carry enough cash with you as eateries deal in cash mostly. You will find global cuisine on this stretch. There are loads of dollar shops and souviegners shops around for you to shop from. Remember go there at lunch take a bus ride which you will easily get through tickets selling vendors roaming around. Take the bus ride to Beverley hills it's a 2 hours drive. Where they show you residents and sprawling dens of Hollywood's who's who. Carry water for the trip. After you return it would be much cooler than the afternoon heat. It will be an apt time to take the walk on the boulevard. Definitely stop by the Chinese theatre, Oscars hall, Hall of fame is on the street so you need go searching for it, chill at one of the famous clubs. Preferably take a prepaid cab. Or you will have to walk back to the parking after the grinding day. Carry your scarf, water, camera, map with you.\nShow less"], ["Reviewed January 19, 2017", 4.0, "Dirty, but interesting", "A trip to LA wouldn't really be complete without seeing the BLVD. Some neat things to see along here, although it's kinda got a grungy side to it."], ["Reviewed January 17, 2017", 4.0, "A journey through povery, pot, and glitz - following the \"stars\" in the sidewalk", "Walked 10 blocks of the hollywood \"walk of fame\" (should be walk of shame) - which began at all the porno - drag stores and ended at the Chinese theater. You get the real California exposure here: From homeless beggars lying in the street urinating in public, potheads trying to sell you a few buds, black \"rap artists\" handing you their CDs for \"free\" then taking them back when you don't give them a donation, costumed characters happy to pose with you for a \"tip\". We were searching for a costume for a model that my daughter was outfitting for a show and we did find some cheap rhinestone shoes. If you are searching for Adult toys or risque women's wear - there are dozens of places to give you what you need. The highlight is at the end of the walk at the Chinese theater where you will see handprints from the greats including Shirley Temple, Bing Crosby, Marylyn Monroe, and even Harrison Ford. Its woth goin there to see that. We did not go in. There are tours you can pay for and tons of tour guides to give them to you. Jimmy Kimmel's show is also across the street. I would highly recommend daytime only for a family of small children as the area is not policed well - in fact I did not see even one cop in 10 blocks.\nShow less"], ["Reviewed January 15, 2017", 4.0, "Good", "Good place for a walk and taking a lot of pictures. Interesting places around and lots of people from everywhere."], ["Reviewed January 15, 2017", 4.0, "Walk of Stars", "This was a fleeting visit so that we could stroll along the 'Walk of Fame' and take pictures of the various stars embedded in the sidewalk. Beware of the touts who try and force CDs on to you, which you then are made to pay for, a firm but polite 'no thanks' and keep walking worked.\nShow less"], ["Reviewed January 12, 2017", 2.0, "Disappointing", "I was expecting something better. It is just a street with bars, nightclubs, restaurants and some shopping stores. Good for walking but be careful specially in the night from thieves and homeless."], ["Reviewed January 11, 2017", 3.0, "Not that great.", "I have mixed feelings about this place. It was amazing because we were actually there to look at the Hollywood walk of fame. But apart from that. The area seemed dull. There was a lot of homeless people. The people who were dressed up as characters were great but they wanted a tip when you took a photo with them. This got very annoying because I have 2 kids and they kept trying to persuade the, over to them so they could get a photo! The shops inside here were expensive. But the building itself was detailed and sparked a lot of attraction with it's massive elephant statues and bright lights. We ended up staying here for a while but comparing it to the other attractions that we've been to. It isn't that brilliant!\nShow less"], ["Reviewed January 10, 2017", 3.0, "No Great Surprise", "Walked the length of the strip from Selma to Highland. All but the area around the Chinese Theatre is what you could refer to as unsavoury. Full of cheap eat restaurants, tour touts and homeless.\nWalked back along Sunset Boulevard and if anything this was worse\nShow less"], ["Reviewed January 9, 2017", 3.0, "Worth a visit but a little grim", "Walking along Hollywood Blvd is definitely a must do but it is not really very attractive, a little grotty and of course full of tourists. The best and most interesting part is outside the Chinese Theatre. People offering tours, tacky shops and overpriced restaurants are plentiful but having said that, I did enjoy the couple of hours we spent there and I am glad we went.\nShow less"], ["Reviewed January 8, 2017", 5.0, "Busy but not to be missed!", "Walking on Hollywood Boulevard is something you must do once in you life. Of course the stars on the floor are very well know but Hollywood Boulevard is more than that, this is also the home of the Dolby Theater, of the Chinese Theater or the Roosevelt Hotel. Walk up and down, take your time and let the special atmosphere operate. Hollywood Boulevard is busy indeed but not dirty or scruffy as some might say.\nShow less"], ["Reviewed January 5, 2017", 4.0, "Just great", "What fun we had, so many sights and sounds. Be prepared for something different! We never knew what we would see next, Spider-Man, Yoda, cross dressers, musicians to name a few. Go with an open mind and you will have a great time!"], ["Reviewed January 4, 2017", 4.0, "On day short visit as part of full day w tour company", "1.3 miles of stars. Wow! It's hard to see them all but w a knowledgeable guide you can do it. Really fun! We got private tour of Disney theatre across fr Dolby theatre. The picture quality and sound were amazing. I told the manager, \"it's not quite like this in the Midwest\" and he laughed.\nShow less"], ["Reviewed January 4, 2017", 2.0, "Tourist overload", "Been thare , done that Hugely busy not that very interesting Lots of homeless people Don't expect a whole lot"], ["Reviewed January 3, 2017", 3.0, "Impressive Yet Busy", "Very crowded and busy street. However, seeing all the stars and local culture was interesting. It's clean and overall i had an o.k. experience."], ["Reviewed January 2, 2017", 2.0, "Overrated", "Lots of tourists, but most of the boulevard is disappointing: tourist shops, grey buildings, not very interesting... Only a small part of the boulevard is interesting: around the Chinese Theatre.\n\nSo, it is a must-see if you visit LA, but don't waste too much time there.\nShow less"], ["Reviewed December 30, 2016", 4.0, "Hollywood", "There are lots of tourists in this area during the weekend. There are a few things to hit and check out while here so make sure you take a few hours to walk up and down the streets."], ["Reviewed December 29, 2016", 2.0, "Very poor customer service!!", "Booked this tour for my daughter as a Christmas present because she heard about it. Its call Drunk History of Hollywood. I booked online and immediately I saw the debit on my credit card transactions. I never received a confirmation or eticket. I tried to call best tours.com but you will only listen to recorded information. They ask you to chat online but that is only available wed-sat. You can also email them in which you will immediately receive an automatic acknowledgement but never a response (I sent 6). Finally I was able to chat with a rep and get it resolved. Next week is the tour. A little worried because I see on Yelp that we will be lucky to have the tour guide show up. But, fair is fair. I will be back to give a good review if it is good!\nShow less"], ["Reviewed December 29, 2016", 3.0, "In this boulevard of pretentious dreams...", "Hollywood. Home to the films, the glitz and glamor. Visiting this place once is a must for ardent movie-goers who are fascinated by the characters. But once you have spent about 5 mins in this place, you realize there is nothing much to do (except drive up the hill to the Hollywood sign). The place is filled with stores and shopping malls mostly selling souvenirs. Plenty of restaurants making the best use of the opportunity to get some customers. And other attractions & studios spread around.\nSuggestions - The boulevard does house some known attractions to see, like the Walk-of-fame, Madame Tussauds, Ripley's Museum, the wax museum, lot's of famous theaters. If you (may) cover all those, go for the drive to the Hollywood sign, or even trek to there on a good, sunny day.\nCareful - There are lots of characters dressed as your favorite stars looming around the area who hustle you for a pic in exchange for the green papers. There will also be agents who try to get you one a ride around the place to show movie star houses and other things nearby (that ain't gonna get me sold). This place gets super, super crowded. Both the roads with traffic and the sidewalk with people. Keep an eye on your belongings.\nShow less"], ["Reviewed December 28, 2016", 4.0, "nice but", "Great name and imagination but in the reality it was just a street. Quite old and dirty. Lots of dealers and homeless people. But because of the name it is worth visiting it :)"], ["Reviewed December 27, 2016", 3.0, "Typical tourist spot", "If you are a first timer in LA, it is good place to add into your itinerary. Busy place with many people from all over the world."], ["Reviewed December 26, 2016", 4.0, "I liked this boulevard", "There is plenty to do and see some people have different views on things but a lot of good and bad about a lot of places I enjoyed myself and would visit again."], ["Reviewed December 22, 2016", 1.0, "Unimpressed", "We went there. We saw the saw the stars. We saw the street performers. Big deal. And whatever you do, don't visit after dark."], ["Reviewed November 28, 2016", 3.0, "Way to Commercialized", "Was a little disappointed by it. It was very commercialized, was hoping for more of an authentic feel of LA."], ["Reviewed November 23, 2016", 3.0, "crazy Hollywood!", "As a tourist to LA you have to come here, but what a crazy place it is. Wide eyed tourists wandering up and down, having photos snapped with faux celebrities, looking at stars on the pavement and hand prints in front of the Chinese Theatre, being accosted by tour touts and young men pushing CDs of their latest singles or videos, or by Korean born again Christians!! You wonder after how you came out alive! My friend had a photo shopped picture 'taken' with his look alike celebrity (Gene Hackman) and this was fun, and only $20. There is a nice restaurant and bar called Trastevere if you want to have a break from the hustle. The song goes 'LA is a great big freeway', but it is also a great big tourist trap and Hollywood Boulevard is its epicentre - go, but be warned!\nShow less"], ["Reviewed November 21, 2016", 3.0, "It looks better on tv than in person", "Hollywood Blvd. is filled with tourists and kitschy shops. It is still pretty seedy and dirty unless you are at Hollywood and Highland. Lots of hustle and bustle there and around the Chinese Theater. Be CAREFUL about the traffic. Drivers aren't always aware of pedestrians."], ["Reviewed November 21, 2016", 4.0, "somewhat of a tourist trap, but you still need to go if you haven't", "The area itself is somewhat beat up, but I still enjoyed some of the sights and seeing the stars. The city should take some time to clean this place up. Tends to lose some glitz when you have to step over homeless people at times"], ["Reviewed November 20, 2016", 1.0, "Disappointed", "I was quite disappointed. I found it dirty, and was surprised at how unkempt the walk of stars was. I would definitely skip this."], ["Reviewed November 20, 2016", 2.0, "Huge disappointment", "I had wanted to see this my whole life and was very disappointed. The area is incredibly crowded and there are homeless people everywhere. It seems like everyone you pass is either begging or trying to sell you something. There were dozens of people apparently handing out CD's of their music and offering to autograph them. If you take one, they will harass you for a \"donation\" and even follow you down the street. There was a movie premier going on so you could barely see Grauman's Theater and the sidewalk was blocked off so you couldn't see the celebrity handprints. The stars on the sidewalk were neat but they were difficult to see as you had to constantly be aware of all of the people you were bumping into. It was neat to see the Hollywood sign and the area is worth a \"once in a lifetime\" visit but I don't see ever going back.\nShow less"], ["Reviewed November 18, 2016", 5.0, "Another Fun Visit to Hollywood Blvd Area", "We have been to Hollywood Boulevard multiple times. We like the Hollywood and Highland Mall Area. We like the movie theaters such as El Capitan and the Chinese Theater. Jimmy Kimmel has his studio there and we've gone to see his show live.\nThere are various museums to see.\n\nMetro has a station on Hollywood Boulevard.\n\nWe have also dined at several restaurants as well as drinks such as the Roosevelt Hotel and the Loews.\n\nPeople watching is fun to do. One can see the Hollywood sign from the Hollywood and Highland Mall.\n\nOn this trip, we went and they were doing a movie premier so the road was blocked off from traffic and they were setting up for the event. Limos were circling in the area.\n\nIts a place to explore, spend time, and enjoy. For me, its fun.\n\nWe also saw the signs for the upcoming Christmas Parade. We have gone several times and while the pacing of the parade is a bit slow, we have always enjoyed going.\nShow less"], ["Reviewed November 18, 2016", 1.0, "The great disappointment", "Really it's been the great disappointment. Dreams of glamor and beauty had been broken to pieces when we felt and saw stench, dirt and human negligence."], ["Reviewed November 15, 2016", 2.0, "Crowded, Dirty, Full of Homeless People", "I won't be back. One visit to this overpriced place full of homeless people, overpriced restaurants, shops and hotels is enough for me. You can't even see most of the stars as there are so many people walking on them. Use caution when walking around here, especially at night.\nShow less"], ["Reviewed November 15, 2016", 1.0, "Disgusted", "When I went to LA this was one of the things I was looking forward to. Instead the area is dirty with trash, and is not well unkept. There are people asking for money left and right. And it's expensive to park.( yes I know this is a major city) overal, I don't recommend coming to this if you want to look at LA the same.\nShow less"], ["Reviewed November 14, 2016", 3.0, "Not to bad", "I stayed on hollywood boulevard for 6 nights in a hostel. Its quite interesting, you have some hollywood stars, people dressed up as movie characters, a lot of souvenir shops, a few museums and things to do and some places to eat. There are a few shops to buy clothes too. If your looking at staying on hollywood boulevard its very noisy during the week until about 2am and friday and saturdays it doesnt start getting quite till about 4am\nShow less"], ["Reviewed November 6, 2016", 3.0, "Tourist Drive", "We drove along Hollywood Blvd for a stretch and got out for a few blocks to see the stars on the sidewalk. Interesting but very crowded and touristy."], ["Reviewed November 2, 2016", 3.0, "Not a lot to do", "We went to waste time so it was fine. Saw the Chinese Theater but didn't go in. We walked up and down a few times and left. Lots of restaurants. Lots of souvenir shops. Definitely a place to people watch, if you're into that kind of thing.\nShow less"], ["Reviewed October 29, 2016", 3.0, "Had to show the teens all the hype!!", "Our family of 4 came in to town today and the first thing our teens wanted to do was see the Blvd and all the stars. We walked several blocks east from the Theatre and then looped back around and walked west. Besides the fun famous starts and a few pictures, after an hour all 4 of us were ready to be done. Our teens kept complaining about the amount of smokers, pot smokers, and worn out looking costumes along with snake handlers. Seriously, it's thick with people and smells.\nShow less"]]}}