{"Hollywood Sign": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Hollywood Sign", "url": "/Attraction_Review-g32655-d144152-Reviews-Hollywood_Sign-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/21/6c/11/hollywood-sign.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "6386"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90068", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "A bucket list item", "You can access the trails that get you within range of the sign to get a good picture. But you can no longer access the sign up close.\n\nMy friend and I decided to take a horseback ride up the same trails as hiking to take in the view.\nShow less"], ["Reviewed 2 days ago", 4.0, "Long walk for so little...", "We picked this as a random place we wanted to visit during our time in California. We had no idea where we were going or what to expect when we arrived. We didn't have the proper walking shoes or enough water for what was needed. To obtain a good view of the sign, you will need to walk up a steep incline (wear good shoes) and need a lot of water if you plan to hike close enough for a decent photo. Take your time and don't rush, since this could be your exercise for the day. Also, there aren't any restrooms in the area, so be sure you plan accordingly.\nShow less"], ["Reviewed 2 days ago", 2.0, "Famous sign", "The famous sign, but just it. Just a sign with nothing else. I think after long years, They could work more on this place"], ["Reviewed 2 days ago", 4.0, "morning hike-sneakers is just fine", "The air is very dry compared to the tropics. Lots of walkers heading the same way and it’s open to both road and Mtb bicycles. I would choose the Mtb as lots of dirt trails and tracks.\n\nYou can’t really trek right to the signage without getting into trouble with the law. You can get within about 500 yards. I got past the cameras before the loud speakers call you out to get lost.\n\nOur car is parked right where Google recommend the stop/start of the trails which is about 3 hours trek. It’s a landmark for sure but maybe overrated.\nShow less"], ["Reviewed 3 days ago", 4.0, "See It From Lake Hollywood Park", "Couldn't figure out the best spot to see the sign, so I tried a few. Went to the Griffith Observatory, but the sign was so far off in the distance. i got a tip there saying to go to lake Hollywood Park, and find the vista point. So I did just that, and it's really THE place to view the sign. clear as day, and big for your Instagram pictures lol. Still go to the Observatory to see the entire city, but this is the better view point for the sign.\nShow less"], ["Reviewed 5 days ago", 5.0, "THE spot to go get your Hollywood sign picture", "we read so many suggestions on where to go to see Hollywood sign best . Its absolutely crazy how many push you to places like the Griffith Observatory which offers stunning views across LA but just a distant crappy view of the sign itself\n\ntake it from me .... you want to get over to Lake Hollwood Park off Mulholland Highway and stand at Vista Point . Sign is huge and very visible . Any closer and the houses / hills will block your view\nShow less"], ["Reviewed 5 days ago", 5.0, "It's a must!", "If you're visiting LA, you gotta go see it! Especially if it's your first time in the city! Somehow we managed to get onto a trail that took us behind the sign. Great place for photos, but what a hike! I wasn't prepared for it! Don't ask me where we parked, because I don't have a clue? Haha. Good luck!\nShow less"], ["Reviewed 6 days ago", 4.0, "Huge", "The sign is very huge and the scenario is really outstanding with the beauty of nature and is very famous tourist site."], ["Reviewed 6 days ago", 4.0, "Close... but not That Close....", "Ok..we started at the Griffith Observatory. We took the bus up. The parking is a challenge. We drove around for 15 minutes looking for a spot. It was just luck that we found one. We didn't pay in our spot but others closer were pay to park. We then went back down the hill and turned left There are rest rooms at the Observatory. We went across the street to where the hike begins... you can take your pick as to how 'close' you get. Take water and wear appropriate shoes. We decided to see how far we could go.. then once we got started we said.. we can't stop now..how many times have i said that. Well, we just kept going...slowly up. The hike is easy and the road is paved much of the way. However, take note...the entire hike was over 7 miles up and back. So, It was a trek. You can get somewhat close but not THAT close to the sign... it is private property up there. Of course some folks I saw paid no attention to the sign and kept going up. I was fine stopping at the designated trail end. Looks alot like the picture..haha.\nShow less"], ["Reviewed 6 days ago", 3.0, "Better Viewed from Griffith than up close", "The sign symbolizes the giant entertainment business which is hollywood. seen pretty well on the way to Griffith and adequately pictured."], ["Reviewed 1 week ago", 3.0, "Hollywood", "Find it best place to get a good photo of the Hollywood sign is from the Griffith observatory, when it's a clear day !"], ["Reviewed 1 week ago", 4.0, "Love it or leave it, see gotta see it!", "All the other reviews are correct, its only 9 white letters on a mountain, over-rated sure, hard to get to, yes, tons of tourists that are overstimulating, absolutely, however when you're driving and look up and see those famous letters on that mountain, one can't help and put a smile on your face as its the staple of the city of angels, the famous Hollywood sign. We ended up going to the corner of the highwood mall to get a decent picture of the sign, and we were just as pleased. I have heard from locals that getting to Hollywood Lake Park is probably your best bet if you want an up close and good photo, without enduring a hike. I was just as happy driving around the city and seeing that signature sign.\nShow less"], ["Reviewed 1 week ago", 3.0, "Had to be done!!", "OK, so i'm a 'Brit' abroad! I had to do the Hollywood sign photo! We were in Downtown LA and decided to drive up through the streets, and not go up to the very top. It was so busy, but I get why?! If you have to do it, maybe go into LA and stay more in the streets, catch a photo of the street lights, or the roads leading up? We found the experience better from further down into LA rather than under the sign itself.\nShow less"], ["Reviewed 1 week ago", 3.0, "Way overrated place", "If you are willing to have one picture in front of the sign you should go, if you are uninterested better go other place to visit. Is parking only on the street and you have to enter the park for a better view"], ["Reviewed 1 week ago", 3.0, "You can't go to the sign.", "The Hollywood Sign was a temporary sign that ended up staying. The problem is that you can't get close to it. Every picture in front of it is either a long lens zoomed in, or in front of a fake backdrop on Hollywood Blvd somewhere. The best place to view the sign is the Hollywood Dog Park. there is some parking, and you can sit in the sun and have a picnic under (ish) the sign. If you try to get close through a neighborhood, the homeowners won't like it. All the roads near by are dead ends with signs that say \"No Access to the Hollywood Sign\"\nShow less"], ["Reviewed 1 week ago", 4.0, "Would not want to live in this area!", "Too many tourist driving locals crazy... I am sure...be nice be ...respectful of the locals... park only were permissible as In legal. Not sure what the big deal is just a bunch of white letters."], ["Reviewed 1 week ago", 3.0, "View of the sign", "The sign is miles away. Limited parking, have to queue to get into parking . I think there are better places to get a photo of the sign. Very disappointed."], ["Reviewed 1 week ago", 3.0, "Visit / Travel", "Its a far place and looks like you’re doing a hiking just to have a closer picture to the Hollywood sign.. though you are passing to the most beautiful houses near bye to go the hills or mountain.. but its hard to get the parking."], ["Reviewed 1 week ago", 5.0, "What to say", "One of the most famous signs in the world. It overlooks the city and is always a good view from different parts of LA."], ["Reviewed 1 week ago", 3.0, "Hyped", "The sign is on the top of the mountain..worth for one picture,and to establish that you went to Hollywood.With so much technology available today,this could be easily spruced up to make it more attractive"], ["Reviewed 2 weeks ago", 5.0, "It's a hike!", "This was my first time \"visiting\" the Hollywood sign. I didn't realize it was a 5 mile (roundtrip) hike! I'm sure there is a way to drive up, at least part of the way, but my cousin failed to tell me this. When she showed up in running gear, I knew something was up.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Best view", "The best view is from the observatory at the top of Griffith Park, you can get some really good photos from here as there i no actual path to the sign."], ["Reviewed 2 weeks ago", 4.0, "Hollywood ion", "Was amazing to be standing and having photos taken when this is what you have seen in all the Hollywood movies. It was a small highlight of our tour."], ["Reviewed 2 weeks ago", 5.0, "A must", "We went on a tour and one of the first stops was the Hollywood sign from the Griffiths Observatory by the James Dean statue. We learnt all about the sign and history from the excellent tour guide John in LA tours , the office is in Hollywood boulevard walk of fame opposite the mall. Definitely recommend this tour\nIt's a rather so real to see it and glad it is still there. You can hike up Runyon canyon which I have done as well just take plenty of water but be aware no toilets on the hike\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Cool", "The hike to the Hollywood sign was long (our route was approximately 5km one way) but easy walking. The scenery was nice (rolling Hollywood hills and a view of the city) and quiet. Weather was hot and dry. Was neat to see the sign up close and get some pictures.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun to hike!", "Once you make it to the entrance, that is were the journey begins. Right off the bat you can get some great photos, but definitely venture off and hike as far as you can go to get closer to the sign."], ["Reviewed 2 weeks ago", 5.0, "The Hollywood sign with an incredible view!", "We hiked up behind the sign and was afforded a great view. The hike is manageable but it is a bit of a leg and butt workout and can make you catch your breath. Make sure you take water at any time of year and wear a hat; these will help you stay cool. Summer would be very hot, so go early in the morning or later in the day. You get great views of the front of the signnas well as LA and Burbank, can see the ocean and Palos Verde on a clear day\nShow less"], ["Reviewed 2 weeks ago", 5.0, "SO worth the effort!!", "This was our 6th trip to LA and Hollywood, so we’ve seen the sign a few times but never from above and and behind it!!\nWOW!! It was SO worth it!!\nWe researched the hike with the help of “Hiking Guy” but it would have been pretty straightforward, following the signs.\nAt a gentle pace it wasn’t too much exertion, though I have to admit I needed a couple of stops, on the final stretch!\nBut, turn the last corner and you’re there: right behind those huge 40 foot letters, which make the most iconic sign in the world!\nJust a few feet further and you’re actually above it, catching your breath and soaking up a panoramic view of the journey you’ve just made with this amazing city and the ocean as a backdrop. Look behind you and there’s the San Fernando valley and mountains beyond!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must see", "Although I think it isn’t legal, to go all the way to it; a couple of my friends have hiked there, to touch every letter, but one!"], ["Reviewed 3 weeks ago", 4.0, "A must see", "Managed to see a number of houses belonging to the celebrities. The Hollywood sign is the highlight of the tour."], ["Reviewed 3 weeks ago", 5.0, "Pretty cool history", "Finally got to see it this time. Took pictures from a couple of different locations. Would highly recommend taking a tour."], ["Reviewed 3 weeks ago", 5.0, "Love the sign", "Such an iconic part of LA. Must see ! I will say if you want to see up close it’s quite a hike! We will definitely come back next time"], ["Reviewed 3 weeks ago", 4.0, "Must see", "It was a beautiful day my family and I walked to see the sign. Hollywood BLVD was not what I expected but the sign did not disappoint."], ["Reviewed 3 weeks ago", 3.0, "SO much fuss about not much", "It's definitely cool to see the sign, but honestly you can see it from a lot different parts of the city. So driving there just to see the sign is not worth it."], ["Reviewed 3 weeks ago", 3.0, "Iconic but you won't get too close.", "Difficult to get too close to this one and if your on a tour your photo shoot will be a long way away. The sign alters in perspective during the day due to light angles etc. Clearly iconic but access ALMOST impossible."], ["Reviewed 3 weeks ago", 4.0, "A must do in LA", "Well this is an icon, a tourist magnet even if you can only see it in the distance, and you get griffith park and the onservatory all n the one stop"], ["Reviewed 3 weeks ago", 4.0, "Great views, but", "Parking in the area is very bad. It’s residential parking, it’s bad, the residents don’t want you there. You hike about a mile is my guess. You can see the Los Angeles area on one side and the valley on the other"], ["Reviewed 3 weeks ago", 5.0, "Excitement", "Our older generation grew up seeing this icon on so many shows and advertisements. It was exciting to drive up the mountain to photograph the sign. The view is amazing."], ["Reviewed 3 weeks ago", 5.0, "Fun ride", "Great place to take a horseback ride and then go over the hill to the Mexican restaurant the view is spectacular when there is no smog"], ["Reviewed 3 weeks ago", 2.0, "this is very stupid and boring.", "I thought it would be some sort of a sight, something that will move me after seeing it on t.v.\nthis is very boring , simple sign, you see from far (and I got relatively close to it), I really don't get it. I went there cause it's like a must in LA but after going there I have to say - spare the time, do something better and just take a picture from far or from the hollywood blvd which I understand as a mall with a view to the sign.\ndon't bother getting closer to it, waste of time\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Good Day outing to click some Pictures", "There are couple of spots from where you can get a very good view of the Hollywood Sign.\n\nThe one at Ledgewood Drive and the other one from Griffith Observatory. The Ledgewood drive spot is the best one of the lot and you get a near perfect picture of the Hollywood sign. As an added bonus, there are good views of the Los Angeles River as well.\n\nGood Street Parking options are available and its a good spot for a 15 minute stop.\n\nOverall - good fun outing . !\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A sight to behold", "This is an obvious must see for all visitors. It gives even more of an impact when seen in person. The best view we found was from the Griffith Observatory."], ["Reviewed 3 weeks ago", 5.0, "Maybe not what you expect", "It is one of the world recognized sing in the world, but it is hard to find a parking near the sign. Maybe better to come by uber or taxi and walk. It is actually quite far from the road, you need really walk to come very close. But very poplar place to take picture or selfie.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Iconic sight", "Hollywood bus tour stopped in perfect places to get great photos. It is possible to walk reasonably close but barriers around for national security"], ["Reviewed 4 weeks ago", 4.0, "Nice views and cool surroundings!", "A walk uphill for about 30-40 minutes, where there's a foodstore right in the beginning of the walk. You can get there by bus. When you're up you can walk to the griffith observatory as well. You get really nice views of Hollywood and L.A when you're up there!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Take the Photo from Griffith Park", "We went to the observatory and used a telephoto lens to capture a picture of us with the sign. It's much better, you don't have to walk all the way to the sign and you get a very good view of the sign from the park/observatory.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Close to Hollywood Sign", "Beachwood Canyon is as close as you can get to the iconic sign which is visible from many places in LA. It close enough for a good selfie. We drove up and got parking on the first Saturday in November. If you ignore the trespassing signs you could get closer. In our other trips to LA we only saw it from afar. The original sign was put up to advertise a property development.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Sunset Hollywood Ranch is the best way to see the sign", "Riding horses in the Hollywood Hills with the city and ocean as your backdrop nothing compares. Great views and pictures while on horseback!"], ["Reviewed 4 weeks ago", 5.0, "Why wouldn’t you?", "This is one of the most iconic signs in the USA, so why wouldn’t you take the time to see it? Yes, the traffic is going to be bad, but that’s part of the LA experience. We just made it an adventure and didn’t let it stress us.\nThere is more to see than just the sign if you head up to the observatory. You have beautiful views of the mountains and surrounding area as well.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Amazing", "You can pretty much see the sign from any place except getting into the park unless you go to the observatory."], ["Reviewed 4 weeks ago", 3.0, "It is a must see", "It is a must see when you go to Hollywood, and you can see from many places around there. Theres no need to go to a tour to see it"], ["Reviewed 4 weeks ago", 3.0, "Way too difficult", "The best way to see the sign and to take pictures is putting this address in your GPS: Los Angeles, CA 90068 (Central L.A)\n\nIf you're lucky, you will find parking, it's a pain, because you can't stop, not even a second to take a pic from the car.\n\nWhen we almost given up, we found parking and were able to take a couple pictures.\nShow less"], ["Reviewed 4 weeks ago", 1.0, "Why would you bother???", "We saw the sign from the Griffith Observatory. Yes, it is big letters stuck on a hill. Nothing more, nothing less. Why would you go out of your way just to see this???"], ["Reviewed 4 weeks ago", 5.0, "Lake Hollywood Park", "We used map it to find the Hollywood sign. But when we got to the top it was an observatory. The man there told us to go to Lake Hollywood Park. Wow! he was right! AWESOME View. so just put in your map it the park I mentioned. that will take you right there\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Photo op", "Just do a quick stop for some photo opportunity. You can hike up if you wish, but that would take a while. It may be quite a walk coming down."], ["Reviewed 5 weeks ago", 4.0, "Good Place to visit", "Good visiting place , better to view from Griffith Observatory easily. deserving locations for selfies and memorable pics"], ["Reviewed January 23, 2018", 3.0, "Seen from the Old Hollywood Hotel", "We only saw this from the hotel we stayed at while getting ready for \"The Price Is Right Show\" It really did not impress us as much as the Star Walk or the Studios."], ["Reviewed January 22, 2018", 2.0, "Cant get close", "It is always neat to see the sign, but you can't get very close on your own, you just see glimpses of it between the buildings."], ["Reviewed January 22, 2018", 5.0, "Аll recommend.", "It is not far from Hollywood. Free parking on the street. Lake is very beautiful and nice view. Аll recommend."], ["Reviewed January 22, 2018", 2.0, "Annoying", "Quite difficult to find somewhere to get a really good picture with this! However you can see it okay from some places!"], ["Reviewed January 22, 2018", 4.0, "Dont miss a selfie with this sign !!", "This is a symbol of LA and Hollywood .. font miss the oportunity to have at least a selfie with this sign .. get lost on the streets near to catch one and also you will have a great view of a side of LA city ..\nShow less"], ["Reviewed January 22, 2018", 3.0, "Driving L.A.", "It was very confusing, even with GPS to find great views of the Hollywood sign, however it is iconic and was fun to see."], ["Reviewed January 22, 2018", 5.0, "Hollywood sign", "it good walk through all the houes to see the hollywood sign and you get to see this through griffith observatory well"], ["Reviewed January 22, 2018", 4.0, "Must see", "We drive to the hills in a residential neighborhood to see the Hollywood Sign. It was great to see along with looking at the houses down below. The weather was great and the view was awsome."], ["Reviewed January 21, 2018", 4.0, "Hollywood sign best viewed from the observatory", "Went to the Griffith observatory about 10AM before the crowds. The observatory doesn't open until noon. Lots of school buses with kids; but uncrowded. The bathrooms in the parking lot were clean."], ["Reviewed January 21, 2018", 4.0, "A Star is Born", "It’s a very windy road up to the observation parking area....the sign is a must see for it’s nostalgic value. Parking was along the road and next to a park... careful when parking because it’s on a very steep hill and remember to turn your wheels. We had to walk instead of parking on the hill because our rental didn’t have much power to keep from rolling in the parking space. The park is nice and there were many people there taking pictures. There are trails to hike but for a quick picture and photo op...this is great\nShow less"], ["Reviewed January 21, 2018", 4.0, "Iconic But It's A Sign People Let's Keep It In Perspective. Warning Naughty Review And Go On A Weekday.", "There are myriad reviews of best places to take a picture of the sign, but lets face it the best picture is the one with your loved ones front and center with the sign in the background as it's people that make places. So let's go one step beyond. You need a permit to \"go to the Hollywood sign\" and if you get caught you may get in trouble but how do you get to the Hollywood sign. First thing if you've very young or very old travellers forget this. For others for whom the naughty gene shines brightly, wear hiking clothes, and off we go. North on Beachwood Drive from Franklin Avenue, go left on Ledgewood drive and then a right onto Rockcliff drive. Go to nearly the end of Rockcliff and turn left on Deronda Drive, ignore all signs as the no parking doesn't apply on a weekday and park on Deronda where parking is allowed. Walk up Deronda, pass under the white arch and you'll figure out your next move. Walk up the paved road Mt.Lee Drive and you will find yourself behind the Hollywood sign. It is said that one could shimmy down and sit on the sign and get a very cool picture. I can only tell you what is said, and that the pictures turned out great :-) Be careful and have fun.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Recommend the view from Griffin Observatory", "Part of the tourist leg of my trip to LA. Gorgeous at sundown & way to hot during the day, all the tour busses are there so rather wait"], ["Reviewed January 21, 2018", 1.0, "The Most Over Rated Landmark in the World", "I simply cannot understand why people stand in the middle of the street to get a selfie with this sign. The sign is so far away and looks so small and there is no way to get much closer. Wasted time."], ["Reviewed January 20, 2018", 4.0, "Hollywood Sign", "Park in the garage at Hollywood and Highland get your ticket validated at one of the shops or restaurants. Go to the 2nd level of the Hollywood and Highland Center above the Starbucks to take a picture of the Hollywood sign."], ["Reviewed January 20, 2018", 3.0, "Famous sign that needs maintenance", "Most visitors who come to Los Angeles would like to see the sign. I visited it approximately 20 years ago and would like to bring my kids to see it. However, it appeared to be a bit old and broken from a distance."], ["Reviewed January 19, 2018", 3.0, "ok. it's an icon. but it is small and needs painting. Take a picture of it and check it off your bucket list.", "We viewed the sign from the Chinese theater. It's a good was to check off two things at once. They did not let us into the theater. They were showing a star wars movie. The mall is ok. Be sure to hit the bathrooms while you are here and this is the place to load up on cheap souvenirs. Outside the theater that is, on the walk of stars-\nShow less"], ["Reviewed January 19, 2018", 3.0, "Icon worth seeing once!", "There is really no great place to be able to park and the roads around it are very crowded with no direction on where to really go. It was worth it to check it off our bucket list but wouldn't do this more than once."], ["Reviewed January 17, 2018", 5.0, "Family vacation", "We took one of the many drives offers from downtown. Four hour tour of Hollywood homes and township.\nIt was okay but You might say we got a day in the clouds so couldn’t see the sign and most home you just saw the fences or yards . Guess that’s all you get . But on way home two days later saw the Hollywood sign from the freeway kids loved that.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Such an icon!", "Read directions on how to get to best viewing area and got totally lost. We ended up at the end of a culdesac with a fabulous view. when the signs say no parking, heed the warning! We parked in one such area and walked a couple of blocks leaving someone at the car . We barely got to the area to take photos and got a phone call that parking enforcement was at car and would ticket or tow if not moved in a few minutes. We rushed back and left. I think I would do the hike next time from a designated spot.\nKids loved it because they have seen the sign on TV so many times. All it took was 30 minutes out of our day. Fun\nShow less"], ["Reviewed January 17, 2018", 5.0, "Worth the hike!", "Do some googling and find the route to walk up behind the sign. Great view and interesting walk up. It's not easy to find and you'll have to leave the car in a residential area so only go during the week as it's restricted at weekends. Alternately get an uber to drop you as close as possible. There is nothing up there apart from the sign so bring your own water bottles and food. It won't take too long to walk up if you're relatively fit.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Hollywood signage", "Nice view when you drive closer to the sign. The best view is from a street with residences. the residents do not mind if you stop and take snaps."], ["Reviewed January 16, 2018", 4.0, "Super easy \"hike\"", "This is a must if you are visiting Los Angeles. It is probably the easiest \"hike\" you will ever do. Problem would be finding parking, make sure you read all the signs and don't block anyone's home drive-way! Great views of Hollywood!"], ["Reviewed January 15, 2018", 4.0, "Over rated", "It's just a sign on a Hill...but it was something we ticked off our bucket list, we did a tour which included famous people's homes, but didn't get to see anyone."], ["Reviewed January 14, 2018", 2.0, "It is a trail up to a bunch of wood letters!!!!", "Okay it is a sign, nothing more nothing less. Yes it has been in a ton of movies. But so has stop, speed limit, don’t feed the animals signs etc.... Yes it has history, some dream have been made and many more destroyed by those letters “Hollywood”. But it is still just a sign.\nShow less"], ["Reviewed January 13, 2018", 3.0, "Hollywood Sign", "We went to the observatory to see the Hollywood sign, it was just like we have seen it on television, was a little too far away for good photos, probably the hiking tour you would get a better idea of its actual size."], ["Reviewed January 13, 2018", 4.0, "Seen through the window of a helicopter ride.", "Don't bother with the walk or hike or anything else. Take a helicopter ride to see this amazing hollywood icon! It is amazing!"], ["Reviewed January 13, 2018", 5.0, "Great hike!", "Great elevation hike, roundtrip took 2 1/2 - 3 hours. Bring water, use the restroom before you start as there is nothing along the way. Worth the time to hike behind the sign and you have great views of LA."], ["Reviewed January 12, 2018", 4.0, "Tick", "Very busy Saturday in getting to the location that is closest to the Hollywood sign - great weather and we got some excellent photos"], ["Reviewed January 12, 2018", 5.0, "Quintessential California Selfie", "Lots of great websites to tell you where to get the pefect selfie (be respectful of private property and parking) but so glad we did it. I don't care how old or young you are it is cool having this picture."], ["Reviewed January 11, 2018", 5.0, "Wow", "I thought this would be a bit boring and we only went as my daughter wanted to see it - but I have to say it was well worth the visit - not sure why it has such a pull but the iconic sign has an atmosphere of its own.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Where it all began!", "This place was magical to see and our drive through the neighbourhood to Beverly Hill was quite breathtaking"], ["Reviewed January 11, 2018", 4.0, "Colf", "Went to see it as close as we could. Had a better time seeing the houses up the mountain (when you live in Florida a hill is a mountain lol)"], ["Reviewed January 11, 2018", 4.0, "Nice Hike", "We parked at the conservatory and hiked as close as you could to the Hollywood sign. It was a nice, easy hike. We hike a lot and it was easy to us. Bring water and good shoes. I'm sure in the hot months it would be a very HOT hike.\nShow less"], ["Reviewed January 11, 2018", 4.0, "A good Hike and Views - The Backside!", "A drive down Hollywood Blvd and then over to and up Canyon Drive. Skip the first parking lot and go to the last one before the gate - it can save you some steps if a spot is open. Use the bathroom before you go...no facilities here!\nStart walking up the trail - and I do mean up! This route will take you to the Microwave tower on top of the Mountain and you will be able to see the backside of the Hollywood sign!\nJust keep going up on the main trail - there are marked signposts giving you directions.\nAfter you have climbed a while - 40 minutes - you will come to a paved T intersection. Go right - you actually will be going away from the sign at this point but the trails goes up and around. Just keep hiking. Another 25 minutes or so and you will come up to the microwave tower. Go toward the left of the fenced in area and then go up a short steep hill and you will come out on an overlook area with a few benches thrown in. Down below you will be the backside of the Hollywood sign - and just about all of LA - we went on a Wednesday afternoon and not many people around but always like 5 to 10 people there coming and going. Great view of the city - of course you are looking West and the sun can be a hindrance for photos. Either go early in the morning or go later in the day lie 4pm or so.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Iconic", "Well worth getting up to the National Park area to get a picture with this iconic sign - you won’t regret it"], ["Reviewed January 9, 2018", 2.0, "It's a big sign", "Nothing more, nothing less. Good for a photo opportunity to show you were there. Nice views over Hollywood"], ["Reviewed January 8, 2018", 5.0, "Hollywood Sign Hike ! Fantastic", "The hike starts at Getty Centre. Try avoid going over the weekend as we discovered it was hectically busy. We decided to do an afternoon hike, in hind sight we should have done it in the morning while we still fresh. The afternoon sunset and views made up for the long hike. It’s about 4 miles up and 4 miles down. Was hard for the smaller kids but they all made it up.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Watch yourself on the curves! Go during the week less traffic! Great mountain adventure!", "Okay everyone who lives or is visiting LA has to get a picture of the Hollywood sign!! It is a adventure to get there for sure. You know when you arrive after driving through tight turns in the Hollywood Hills and looking at all the celebrities houses. The crowd gets thick when you get there and parking is tight. There are multiple places to get a great picture past all the traffic. Many people get out and walk along the cliffs. We were lucky that my wife has a great steady camera shot. We didn’t have to stop got a great picture while cruising by!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Great hike to the top.", "Great hike from the BAT Cave at the bottom. Full hike is 8 miles and the view just gets better and better as you get higher."], ["Reviewed January 6, 2018", 3.0, "Nice views", "It’s just a sign but it’s iconic and there are great views from up there. Worth visiting when in the area."], ["Reviewed January 6, 2018", 5.0, "Have always wanted to see this!", "When we planned our trip to L.A., the Hollywood sign was the one thing that I wanted to be sure I saw. We took a few tours where we were able to see it from various distances, and we got some great photos."], ["Reviewed January 6, 2018", 4.0, "Nice walk/Hike with the family", "My husband, 8 year old son and 2 small dogs had a nice walk near the Hollywood sign. We were able to get some great photos and it was a nice physical activity that we could do as a family for free."], ["Reviewed January 6, 2018", 4.0, "Nothing special", "The access to the sign is nicely done, but you actually need to walk for too long if you want to see it nicely. If you are short with time you can spend in Los Angeles, it is not a big deal if you don`t see this sign.\nShow less"], ["Reviewed January 6, 2018", 4.0, "nice hike", "the Sign itself is not really worth but the hike to get there is a nice walk outside of the chaos of LA. beware where you park the car - we got a fine :("], ["Reviewed January 5, 2018", 4.0, "Iconic Sign, But Still Just A Sign", "You must see the \"Hollywood Sign\" while in LA. I didn't walk up to the top of the mountain to see it. I could see it just fine from several spots from several different locations, while on the streets below, although it did look smaller than hiking up the mountain. It is a famous icon, but it's still just a sign (& you can always buy a post card).\nShow less"], ["Reviewed January 4, 2018", 5.0, "Hollywood Sign Up Close", "If you want to see Hollywood Sign up close, you must go to Beachwood Canyon in Los Angeles. It is the closest you can see the sign.\n\nSince there are so many tourist found out this secret spot, city has stopped cars from parking on top of the canyon, though you can still find certain little streets allow you to park on, your best bet is to park at the bottom of the canyon, and hike up, or uber it up if you don't want hike a long way up. It is worth it! The houses along the streets up to top are beautiful.\n\nOnce you get to the top, you come to a closed gate, but you can enter from the side, stay to the left, walk around the metal stopping point to get up the hill. Not only you can see the sign, you may just see some beautiful wild peacocks :)\n\nDon't forget to stop at the Beachwood Canyon Cafe for a classic hollywood brunch before your hike. Old school coolness.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Good view from Griffith Observatory", "We visited after San Diego to this place. It was good view from Griffith Observatory. Weekends may need walk long from the bottom to reach the hike of Griffith Observatory to view this sign. Overall nice experience of walk and view."], ["Reviewed January 4, 2018", 3.0, "It's a BIG sign", "I don't think I would bother parking up & walking up to the Hollywood sign. We did however find it whilst out driving - great views from a suburban street - no need to go climbing in the heat!!\nIt's an iconic sign - other that the I don't think I'd bother...\nShow less"], ["Reviewed January 3, 2018", 4.0, "Very Cool !", "Seeing if in TV forever finally get to see it from the Griffith Observatory area ! Beautiful day when we were there ! A must see if in the area !"], ["Reviewed January 3, 2018", 4.0, "Good spot to photo taking", "You can drive your way up the hill and find yourself a good spot to take some photos. You might find it difficult to park your car."], ["Reviewed January 3, 2018", 5.0, "Uber and hike", "Best way is to Uber then hike. May want to bring a hiking stick if you need the extra balance. Also yes there are snakes around rocks so don’t be dumb. Each letter is at least 20 ft tall."], ["Reviewed January 2, 2018", 4.0, "Quick stop for a photo op!", "We didn’t really have much time to spend, but if you do, I would search for a good hike around the Griffith Observatory. We found a great view and spot for a photo op with the sign! We just made a quick stop and parked in a neighborhood near the Lake Hollywood Park. We hopped out, took a pic, and then we were on our way!\nShow less"], ["Reviewed January 1, 2018", 5.0, "Hard work but breathtaking", "As a film fan I simply had to trek up to the sign. Parked at the observatory and walked up. This was pretty intense in the summer heat so make sure you take bottled water with you. It took a couple of hours to get up there but the views are breathtaking. Well worth spending a few hours to get there.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Trek to the sign", "We found free parking on Hollywood lake Dr. We walked for approximately an hour up a dirt track to the sign hard going in some places but a good walk.\nI suggest you take water and some sun block we went in the mid 80s and it was fantastic. On route we met may others coming back from the sign. The track is clearly marked and you can't go wrong.\nThis route is no good for people who have disabilities or use walking implements of which they require. There is a road way up from another route however I didn't use that.\nShow less"], ["Reviewed December 31, 2017", 3.0, "Landmark", "This is truly a landmark that everyone wanted to have a photo, but vehicles are restricted to the area were the sign is located, and there is no parking for vehicles, you should have a driver and drop you off to a certain location and pick you up after the photo shoot.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Manage your expectations and you will be rewarded", "I am writing about the hike that allows several views of Hollywood sign. There is nothing more exciting to the senses than a fine moderate hike through the woods on a early and bright Los Angeles morning. On way, you can see the iconic Hollywood sign up close. You will realize soon its much much larger than you imagined and secondly, you can only get this close to it.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Crowded Hollywood", "Was so exited to be able to see the famous Hollywood sign. We tried to take a picture from Griffith Park, the Observatory, and another random hill that we found on Google.\n\nBut there were so so so many people in all the picture spots. Lining up to the observatory took nearly an hour!\n\nOf course, the sign is a must see tourist attraction, but try not to go during peak holiday season!!!\nShow less"], ["Reviewed December 30, 2017", 5.0, "Yeah, you gotta do it!", "I know, I know, how much more touristy could you get, right? But it really is the thing to do. Hiking up to the sign is great exercise and provides a great view of L.A. Seeing it from the Griffith Observatory is just mandatory."], ["Reviewed December 28, 2017", 5.0, "When in hollywood", "How can you not see the Hollywood sign when going to la it's a must plenty of places for a photo opportunity"], ["Reviewed December 28, 2017", 3.0, "Not a must walk", "Need not walk up to get this pic. can always drive pass, take the picture. Still pretty far away from the sign!"], ["Reviewed December 27, 2017", 3.0, "Picturesque", "Lots of views. Planetarium I'm sure is worth a visit but we got there early in the morning. Many photo opportunities but bring a telescopic lens for the Hollywood sign if you want to take pictures from near the planetarium."], ["Reviewed December 26, 2017", 4.0, "Nice experience", "Nice experience we took a car tour which drove us to all places, showed us houses of Hollywood celebrities / Hollywood sign."], ["Reviewed December 23, 2017", 5.0, "The one and only!", "There is a beautiful hike up to a small Rocky plain that not only gives you close up of the infamous Hollywood sign, but an amazing view of the city. (at least a nice chunk of it) I call that a win-win!"], ["Reviewed December 22, 2017", 4.0, "View from Hollywood Walk of Fame", "Good view from the Hollywood Walk of Fame. Saves you the trip. Bring a good camera if you want a good pic. Otherwise, iPhone does the job"], ["Reviewed December 22, 2017", 5.0, "Bucket list", "We got to hike up to sign and it was pretty amazing to be in a very iconic place. It was worth the hike in the burning heat"], ["Reviewed December 22, 2017", 5.0, "So nice", "We went to the lookout and it’s nice. Still pretty far away from the sign but I’m sure if you like you can get closer."], ["Reviewed December 21, 2017", 4.0, "It’s a MUST!", "It’s a must to visit the Hollywood sign and take a couple of photos here. You’re not in Hollywood if you don’t have pictures here. We took Uber from Dolby Theatre, it’s about 15 mins away. However, pls take note that there’s no signal on your phone once you’re up there. We happily taking pictures but we couldn’t call for Uber to send us back to our hotel @ Roosevelt Hollywood Blv. So both mother and daughter have to walk all the way down the hill until the main road\nShow less"], ["Reviewed December 21, 2017", 4.0, "Positive Outlook", "Must see when in LA. Best place to see the sign is to park on Canyon Lake Drive near the reservoir and then walk up Mulholland Highway."], ["Reviewed December 21, 2017", 3.0, "Disappointed", "Because of some silliness, you can no longer hike up to the sign. Also, this icon is no longer lit at night. But it’s still a Hollywood landmark and a sight to see at least once."], ["Reviewed December 21, 2017", 4.0, "Nice Hike", "The hike gives you a better view of the city than the sign but it is still worth the trek up there! On a clear day you can see all the way to Catalina Island."], ["Reviewed December 21, 2017", 4.0, "Mulholland Drive", "I was a little disappointed and should have done better research. I thought that was a great view from Mulholland Drive and I guess there is but I was expecting to much much closer to the sign from Mulholland Drive. It is quite far away , no like really far way and the sign is TINY in your picture. Like can you even find it in this picture ?!?! No, not really .\nShow less"], ["Reviewed December 20, 2017", 3.0, "Because you should", "A big sign that says HOLLYWOOD on the side of a mountain. Nothing special and decent view of greater LA. You go there because you tick it off your list when in LA."], ["Reviewed December 20, 2017", 3.0, "Must See when you visit LA", "The best way to see the sign is to hike up and get as close as you can. Tour buses are restricted now on getting close to the sign. The story is interesting on how it all came about and the fact that each letter is about 40ft tall is pretty cool.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Overrrated dign but iconic still", "A must do photo shot of the sign even from as far as the lobby of the Dolby theatre. Nothing to fuss but definitely a postcard moment to send picture back home."], ["Reviewed December 16, 2017", 3.0, "WHAT YOU'D EXPECT", "Basically, it's a big sign on a hillside. But you really have to see it because it's so iconic, and if you go with a good guide you'll get it's history and a bit more besides."], ["Reviewed December 15, 2017", 4.0, "My poor husband!", "My poor husband pulled over while my teen daughter and I stood in middle of road to get good photos (not best plan) when a lady pulled up and gave me a map which got us out best shots! We went up to Mulholland Drive and then up onto Lake Drive (narrow and windey). You wind your way up through the wealthy houses and eventually come to a great viewing spot and limited parking. Teen daughter was stoked, husband a little stressed (wrong side of car and road, only second day driving). Worth it in the end!!\nShow less"], ["Reviewed December 14, 2017", 3.0, "Great To See It But Not A Lot Else To Do", "Look, it's Hollywood. You simply have to get a cab up to the famous sign. It's the obligatory photo isn't it after all?\nTo be fair the views are pretty good from up there, the hills rolling off one after another into the middle distance.\nWe really enjoyed our visit. There's nothing much to do except enjoy the novelty of being where you are, seeing the massive white letters up close and enjoying that view...but I'd recommend it if you have an hour to spare.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Iconic place", "For me this is so iconic place that it was a must-see attraction! I made some research before visiting the place. There is hard to get there by car - there is nowhere to park up there. I recommend to park your vehicle at N Beachwood Dr and climb up the hill by yourself. It is like 30 mins. of walk.\nShow less"], ["Reviewed December 9, 2017", 5.0, "A fun experience even for locals", "There are many things to do in the area of the Hollywood sign. It can be seen from many viewpoints throughout the surrounding area. One of the best locations besides hiking Griffith Park is to view it from Lake Hollywood. At Lake Hollywood, you'll have the opportunity to sit and relax at a lovely park with beautiful breathtaking views of the the Hollywood Hills East side and the lake.\nShow less"], ["Reviewed December 8, 2017", 5.0, "Great walk", "If you want a little exercise, take this walk up to the Hollywood sign. It was the perfect thing to make me feel like I was getting a good heart rate increase and some views of the LA area that are breathtaking!"], ["Reviewed December 7, 2017", 4.0, "Nice walk to the sign", "Took my nieces and nephews up to the sign. It’s a nice walk and a pretty cool view when you get up there. Nice to see it once."], ["Reviewed December 6, 2017", 3.0, "You won't be close but its a great workout!", "So one thing everyone wants to do is get to this sign, but unfortunately, the path doesn't get you that close its close enough to take pictures and it appears to look close but it's not, none the less the people you meet while going up is great and it's a great workout! My favorite part is leading up to the gates that you enter, if you look down on the sidewalk theres all these amazing messages writen into the concrete.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Great photo op and a classic landmark!", "Other than the Star Walk of Fame around Hollywood Blvd., this famous landmark is something for those with \"dreams of Hollywood\" to include in their scrapbook on their photo holiday card. There are many ways to get a good photo, and at the risk of being murdered by my friends who live close to the sign, my best suggestion is to PLEASE take a bus tour if you are from out of town or don't have a car.\nDepending on the time of year, afternoon gives you the best sun. If you have a car, several of the CANYON streets will get you close enough for a good shot, but it's also easy to get lost on narrow winding roads.\nThere is no legal way to walk to the Hollywood sign itself, just pick a nice day and explore the neighborhoods or, as suggested, take a bus tour that includes the Hollywood sign.\nShow less"], ["Reviewed December 3, 2017", 4.0, "Something to see", "Glad I got to see the sign and take pics, as it had been on my bucket list. Something everyone should do. We just drove up to the canyon part and had a great view."], ["Reviewed December 3, 2017", 5.0, "Must Visit if in LA", "This is a place known to each and every person in the world. If you were in LA and haven't been to the Hollywood sign, then shame on you. Haha. Beautiful view from up there."], ["Reviewed December 2, 2017", 4.0, "Hike behind the Hollywood Sign - Go early!", "My partner and I didn't start the hike until about 7:30/8am (in early September), and it was already too late to begin. So my biggest recommendation is to start out early, and to take a lot of water with you, wear a hat and wear sunscreen. We were stopping and seeking shade wherever we could (behind small bushes and tree branches) but it is very exposed and we ran out of water very early on. It's also a lot tougher than any of the articles/reviews that I read indicated – a great incline and lots of large lunging steps both up and down! Of course this could have been heightened in difficulty mainly due to the heat, but this didn't stop people of all ages – there was an older family with young adults and also students getting in their workout for the day. We went via the wisdom tree, which, on Pinterest, looked very majestic, but sadly when we were there, it seemed to be a place where the homeless had been; it had the aroma of urine and there was graffiti everywhere, which was a great shame. Regardless of this, the views on the way up are amazing and you really do feel like you're on top of the world.\nShow less"], ["Reviewed December 2, 2017", 1.0, "Terrible", "Even tough it was something I grew up with all the hollywood movies and was used to seeing the sign. I felt this was SUCH a wasted trip. The sign is hugely over rated and there is actually nothing fancy or worth seeing about."], ["Reviewed November 30, 2017", 5.0, "Hiking for days", "A must do experience. Taking the path that goes above the sign gives great views of Los Angeles but you cannot see the sign from here just a few of the letters but from underneith the sign you also get great photos. I hiked to the sign by myself, it's steady incline all the way up but definitely worth it even though it takes a few hours. Remember plenty of water!\nShow less"], ["Reviewed November 29, 2017", 1.0, "Don’t go at night!", "You can’t see the sign at night, much to our dismay, after fighting for parking and through tons of pedestrians traffic. Be prepared to walk a distance to see sign from Observatory and wait for parking. Awful experience!"], ["Reviewed November 27, 2017", 3.0, "Hard to get to, unimpressive", "We drove and drove and finally arrived after dark to the view point. I was very disappointed. It was not lit. Bummer. If you have Garmen and want to see it take the view B not A."], ["Reviewed November 27, 2017", 4.0, "Just a sign", "It's something you must see during your visit to Los Angeles, but it is nothing more than a simple sign. You can see it from different places in the city, so it's not worth it to go up to the mountain."], ["Reviewed November 26, 2017", 5.0, "Can't Miss It", "Larger than life - this is LA! There are so many wonderfuk spots to view it from and it is different from each vantage point. We drove up closerin the hills and it was breathtaking"], ["Reviewed November 26, 2017", 3.0, "Sign", "I was looking forward to see the all famous Hollywood sign. Seen it now. Again it was rainy. May have to come back on a sunny day to have a better experience."], ["Reviewed November 26, 2017", 4.0, "The hill with letters", "The Hollywood Sign: It's more than just nine white letters spelling out a city's name; it's one of the world's most evocative symbols – a universal metaphor for ambition, success, glamour...for this dazzling place, industry and dream. Today the 45-foot-tall, 350-foot-long sign is in its best condition ever, thanks to the ongoing preservation efforts of the Hollywood Sign Trust. From hiking trails to unique views on horseback and even in a helicopter, read on for the best ways to view the world-famous Hollywood Sign.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Must do!!!!", "If you visiting Cali is an obligation to take a pic on this iconic monument in Los Angeles. You have walk a bit up hill to get a great picture But is worth it!!!!!"], ["Reviewed November 25, 2017", 5.0, "Must see", "We took Canyon Lake dr. , got there around 10am, parked and walked up to take some good pictures, not a lot of crowds. Be careful to obey parking signs, otherwise you will be ticketed."], ["Reviewed November 25, 2017", 4.0, "Seen, from a distance", "We had booked a city tour and hoped that at some point we'd be able to see the iconic Hollywood sign. Due to the good weather and great visibility, we spotted it on several occasions. It's one of the things that my wife was determined to see on our trip to L.A. Mission accomplished!!\nShow less"], ["Reviewed November 24, 2017", 3.0, "Sad it is not lit at night", "We made it up to Griffith Observatory to look at the sign but only made it up around sunset and so the view of the sign was poor. We were disappointed to not see it lit up but apparently it isn't any more."], ["Reviewed November 24, 2017", 5.0, "must see", "this is something you should see once in your life. its curuous to imagine sometime ago the word on the hills was longer and looked like \"Hollywoodland\" but then they cut it due to some practical issues. It really blows mind when you see something you are accustomed to see in movies. And now - you are there. Dont try to climb there, it may be dangerous.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Small", "I thought you could see this from everywhere! It's cool to see but really Small! Lots of view points so need to book a tour or anything"], ["Reviewed November 23, 2017", 4.0, "Good view from Lake Hollywood Park", "If you want a clear picture of you with Hollywood sign, you will need to go to Lake Hollywood park. It is right up the hill and you generally should get a parking next to park. Park is pretty small with a small kids play area and you get views of the sign all around and you need to hike like .2 miles from the start of park to reach nearest to the sign. You need to do parallel parking along a slope, which might be tough if you are not good at same. But I found parking at the lane after the park parking ends. There is nothing much else you can do in the park. Taking photos should not take you more than 30 minutes. If you have small kids probably spend 30 mins in the kids\nShow less"], ["Reviewed November 23, 2017", 4.0, "Iconic View", "Stopped off a small viewing point on one of our tours to get photos of the sign. We were quite far away from it. But still good to see as it is such an Icon. Like seeing the empire state building while in NYC. just one of those things you have to see.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Great iconic stop!", "If you are in Los Angelos, you must go to the Hollywood sign! It is an iconic place for you to visit with friends and family!"], ["Reviewed November 23, 2017", 3.0, "No lights!!", "we seen the Hollywood sign driving around LA, went to the Griffen Observatory at night hoping to see the sign up close but it isnt lit up at night"], ["Reviewed November 22, 2017", 4.0, "Worth Checking Out", "It is really cool to see something that is so iconic of America. We were able to check out the Hollywood sign from variety of angles which was awesome."], ["Reviewed November 22, 2017", 3.0, "As Expected", "There really isn't anything fancy about the Hollywood sign. Just cool that you got to see it in person."], ["Reviewed November 21, 2017", 4.0, "Iconic when you can see it", "This is Hollwood's biggest attraction and can be seen from many different vantage points in the city. It is a must see. However, it is often covered by pollution or smoke, so sightings can be temperamental."], ["Reviewed November 20, 2017", 5.0, "Hike up to the sign and get the very best view.", "I will start by saying the locals don't like all the tourists coming up to see the sign. You will see NO access to the Hollywood sign. The truth is it is owned by the city. Since it's not private property you can legally hike up to it. For years I tried to get as close as I could for pictures. Here is the straight dope. You want to drive up the hills from Franklin Ave. Franklin is one block north of Hollywood Blvd. Turn up into the hills from Franklin onto N.Beachwood Dr. this is the street that takes you right up to the trail to get to the sign. Once again you will pass signs that say no access to the Hollywood sign, it's just the locals trying to scare you away. Keep going all the way up.You will be going through the neighborhoods till you come to a gate. It is the gate for the Sunset Ranch. They have horseback riding through the trails. When I went, there was a very helpful security guard at the gate. You have to park on the neighborhood street. I suggest you get there by 10 am for two reasons. It will be easier to find a parking space and it won't be too hot for the hike. The hike is 1.75 miles to the top. The hardest part of the hike is the very first few hundred feet after you are through the gate. It is a steep street until the trail starts. You will see the sign right away and have many different views as you climb. There are plenty of people doing the hike so you shouldn't have a hard time following the trail. There are helpful direction signs along the way. You will also see the LA skyline from many different spots. It takes about an hour or so even if you take your time for pix or rest. At one point you can go right in front of the sign or take the trail up behind it. You can do both going up or coming down. At the very top you are behind the giant letters. You can see towards LA or on the other side look down at Forest Lawn Cemetery. It is well worth the hike and it is easier coming down. Bring water and a snack.I wouldn't wear sandals or flip flops only because of the dust. Except for the very beginning, pretty much anyone that can walk a reasonable distance can make this hike.\nShow less"], ["Reviewed November 20, 2017", 4.0, "It's very to see from a distance", "While on a bus tour through Hollywood, I saw the Hollywood sign. It was cool to see but I am not sure if I would say that was the greatest attraction while traveling to Hollywood."], ["Reviewed November 20, 2017", 5.0, "Must see", "What is a trip to LA without seeing this famous sign... almost everywhere we went we could see this sign. One of the top places on my to do list.... Worth it."], ["Reviewed November 18, 2017", 3.0, "Saw it", "Saw it from a distance. If you are really into Hollywood then okay. Otherwise it is a large sign on a hill."], ["Reviewed November 17, 2017", 4.0, "Iconic Landmark", "One of the most recognisable landmark in LA. I believe, there are many places to spot the sign. We chose the easiest one which is Hollywood/Highland centre mall.\nTook the red line metro rail and got down at Hollywood/Highland stop. Go up 2 levels to the street. Mall is at the corner of Hollywood Blvd & Highland Avenue. 50 ft tall nine letters can be spotted from the distance.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Private tour", "Hire a private tour company. Out tour guy was great. Took us to the closest spot to Hollywood sign ( no one there). He had a lot of info and history and did a great job. Cost 500 for 4.5 hours."], ["Reviewed November 16, 2017", 5.0, "Pretty Cool", "Go on the We love LA tour and tour Hollywood. Carlos knows a spot that gets you close and no one is there. I hear you can Hike up t here but its not necessary . Take a peek.,take a couple picks. Look at the view from Mulholland and go tour somewhere else.\nShow less"], ["Reviewed November 16, 2017", 5.0, "A must see in L.A.", "The well known landmark - a must see in L.A. area. You can get good views from the observatory. Don't forget to bring your selfie stick :)"], ["Reviewed November 15, 2017", 4.0, "Awesome to see!", "Loved seeing the famous sign in person! Was lucky to get a pretty close park and there were plenty of people around but still heaps of space."], ["Reviewed November 13, 2017", 5.0, "Its Huge!!", "We saw the Hollywood sign from various places and took some good photos. The only way to get near it is to drive up as far as possible then walk the rest of the way."], ["Reviewed November 12, 2017", 3.0, "Popular", "It is popular and unique. Worth to see it from a distance. Could be tough walk for those who are not use to walking and so avoid it Nothing great from top. View and enjoy from distance"], ["Reviewed November 12, 2017", 4.0, "Iconic view", "Nice iconic view, much seen before in movies. Glad to have seen it on site from the Griffith park. Very crowded though in the park and difficult to park"], ["Reviewed November 12, 2017", 5.0, "Make the hike", "After speaking to locals majority havent been. I made the hike and it took most of the day due to parking issues but was well worth it. Bring water and a snack. Also use the bathroom before you think about coming here. But the views and pictures were well worth it.\nShow less"], ["Reviewed November 12, 2017", 5.0, "A MUST DO PHOTO", "Saw the Hollywood sign in 3 locations. The first was walking along the Walk of Fame just off a side street.\nThe next was from the Griffin Observatory and the third time was i thought was the best location and to see the sign and a better photo was Lake Hollywood Park.\nA must photo to do when in L.A.\nShow less"], ["Reviewed November 11, 2017", 5.0, "So cool to see!", "Seeing the Hollywood sign in person was so unreal! Glad to have gone and seen it! If you want to get closer wear tennis shoes, you can hike and there is a lot of dirt around. Overall, great tourist attraction!"], ["Reviewed November 9, 2017", 4.0, "Enjoy it from a distance.", "Don’t go on a tour right up to it. You just irritate the neighbors and it doesn’t really add to the experience. Enjoy it from the mall at Hollywood and Highland or the observatory or (here is secret) from the top of the parking garage at the Farmers market at 3rd and Fairfax. There are a zillion angles to view it from throughout LA. Enjoy it as a backdrop to the city.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Nice ride", "If you want to see the Hollywood sign search for it on Hollywood Sign view point. It is a very nice ride going through the neighborhoods going to the top of the mountain to see the overlook.\nUnfortunately it is quite a distance from the sign hard to get up close.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Hollywood", "It is an experience that you will never forget. It is lovely to see the sign. It is beautiful sight to see. Well worth seeing."], ["Reviewed November 9, 2017", 3.0, "Popular sign", "Well, I saw it and I am happy I had the opportunity. Not because it is something great but just because it is very popular."], ["Reviewed November 9, 2017", 3.0, "Get ready for a hike", "Worth it to us but do it early in the morning. Pla around 2 and a half to 3 hours.total. Fantastic view of Los Angeles from up there. Went with my wife, brother and sister in law and we recommend it."], ["Reviewed November 8, 2017", 4.0, "Don't disturb the neighborhood", "There are a few good places to view and photograph the sign. The problem becomes parking and traveling and local residential streets. This must be very annoying to the residents. Some tourists I've witnessed were just plain rude, and loud, and sometimes intoxicated. If you do a little research on-line you will find a dog park where you can park and walk uphill to 3000 Canyon Lake Drive, Hollywood. This may be tough for folks who cannot go the distance or uphill. The view there is good, and you may also see the Hollywood reservoir. Also consider the Griffith Planetarium to see it at more of a distance.\nShow less"], ["Reviewed November 8, 2017", 5.0, "My Kids Loved This", "My children got up early just so they could take a picture with the Hollywood Sign in the background. They really enjoyed this even though they were not doing much."], ["Reviewed November 8, 2017", 5.0, "A Beacon To All Dreamers!", "Let's face it, Hollywood wouldn't be Hollywood without the ... well... Hollywood sign. Back in the mid 90's I had a studio apartment on Sycamore that had a view of the Hollywood sign. It was so magical to wake up to that image. These 9 gigantic letters sitting up on a hill is a beacon to all dreamers, much like the Statue Of Liberty was to the immigrants arriving at Ellis Island. This of course, is a must see!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Well worth the climb!", "It is quite a hike up the hill. It is not too steep though. We walked down a different way through the street which was very nice too! It's a great photo opportunity for us tourists!"], ["Reviewed November 7, 2017", 3.0, "Cool to see in person", "Sign is visible from many spots....wear comfy shoes if you are going to hike up. Its a workout. lots of tours go up...try groupon for a deal"], ["Reviewed November 7, 2017", 2.0, "Disappointing", "They say it's a must stop that you need to see it when you come to LA but you can have pretty nice view of it in the city."], ["Reviewed November 5, 2017", 4.0, "Best place to see the sign?", "After walking around Hollywood for a few days I was surprised just how hard it was to get good glimpses of the sign. So here are a few tips on how I managed to see it and get some good shots without going to huge efforts.\n\nFirstly you can’t just drive right up to the sign and hang out under one of the letters. It’s way off in the hills and cordoned off by gates and security. There are walks and trailheads to the sign apparently but these require time and planning (you can get up behind the sign and look down over LA)\n\nI found the best views were from the top Hollywood & Highland mall, and especially from the Griffith Observatory. And the plus here is that the Observatory itself is such a great attraction with amazing views out to LA in the other direction. It’s totally possible to get good selfies from the Observatory with the Hollywood Sign behind you, and let’s face it, that’s what the people’s want! Of course there may be better vantage points, but these were the two I thought were the best based on my travels.\nShow less"], ["Reviewed November 4, 2017", 3.0, "It's just a sign", "We saw the sign from the Griffith Observatory. Oh well, we saw it. We weren't overwhelmed. It's just a sign."], ["Reviewed November 4, 2017", 3.0, "Coveted photo scene of Hollywood sign is an illusion", "One cannot access the Hollywood sign but can get close and still take photos. I felt that it was better to see it from the Griffith Observatory than to try and get to it..."], ["Reviewed November 4, 2017", 3.0, "Not a must do", "We saw the sign from 3 different angles on various tours and once you have 1 picture they are pretty much all the same."], ["Reviewed November 4, 2017", 4.0, "Up Close and what the heck is going on!", "Hollywood sign used to mean something right now it is something you want to be as far as from it. Still you want to get close to take some pictures and make sure you were there. You want to be close to the sign, but not so close to those running...\nShow less"], ["Reviewed November 3, 2017", 5.0, "Hollywood Sign and Must Do in Hollywood", "There are many places that you can actually see the sign. You can get pictures from various mall parking lots but if you go to Lake Hollywood Park or the Griffith Observatory, you get the best pictures. The neighborhood has such beautiful parks and homes. Yes, it is just a sign but it is a famous sign and many people are doing what you will be doing. Parking is atrocious. Get there earlier for better parking. Or you can park down the hill and walk. This is a very steep hill. My 84 year old Mom had trouble just keeping her balance on the steep sidewalk, but it was worth the trip and the priceless picture. You can also view the sign from the walk of Fame or take a Hollywood tour and the bus will bring you to the sign. Whatever you do, get there so you can say that you were there.\nShow less"], ["Reviewed November 3, 2017", 3.0, "Its just a sign", "So ok I am one of those tourists who wanted a picture of the sign. But seriously its just a sign and perhaps evidence that I have actually been to Hollywood.\n\nOur guide advised us that its really hard to get a close up picture of the sign as the residents up in the hills want to protect their privacy, something I don't blame them for.\n\nYou can get great views of the sign on Hollywood Blvd at Hollywood & Highland Mall. You go up the escalators towards Loewes and its a great place to take pictures.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Iconic Sign!", "My friend and I wanted to go see the sign and get some good pictures. We drove to Lake Hollywood Park, and walked a short distance (UPHILL) to some picture spots. We went 1st thing in the AM. I would recommend the AM - lots of parking and few people. You can see the sign from lots of spots around LA - but this spot it up close.\nThe hill is steep - so be prepared.\nShow less"], ["Reviewed November 1, 2017", 4.0, "At last Hollywood sign", "This sign is very famous, we all watvhed it in many movies. From our hotel we took uber and uber took us at last point, after thet we should walked about 10 minutes for this sign. At the place that we could saw it, not so many people, you could took many pictures with out being interupted by other people took pictures.my sugesstion is bring enough water and enjoyed this place.\nShow less"], ["Reviewed October 31, 2017", 4.0, "It's a sign, but it's THE SIGN!", "Yes, it is a sign and only a sign, but it is THE Hollywood Sign. There are a lot of spots to actually see the sign, one of them being from the Hollywood Walk of Fame, another being from the Griffith Observatory, and then to actually take a tour to get up there. I took a tour and got right up close and personal, but the reason I chose to do a tour is because the last time I was in LA, it was so foggy you couldn't see in front of your face and I wanted to make sure that I saw the sign this time. Parking is insane, but if you go to the Griffith Observatory, you can see it beautifully. If it's a clear day, you can see the sign from the Walk of Fame, or you can take a tour, not worry about parking, and just get up close and personal with it.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Iconic Sign of LA", "This place is reachable by hike but i got the picture of this sign from a huge shopping plaza at Hollywood blvd. A must photo for memories."]]}}