{"Hollywood Walk of Fame": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Hollywood Walk of Fame", "url": "/Attraction_Review-g32655-d104576-Reviews-Hollywood_Walk_of_Fame-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/c2/8f/f2/hollywood-walk-of-fame.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "3.5", "reviewCount": "13408"}, "address": {"@type": "PostalAddress", "streetAddress": "Hollywood Blvd at Vine St", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90028", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 3.0, "Fun to See Once", "The heart of Hollywood is an area that is fun to see once. But it is a big tourist destination with a fair amount of crime and aggressive sales people pushing their tours or CD's. Went several years ago and the kids enjoyed the wax museum while we looked at all the stars. Took my mom back there last week and she loved seeing all the stars and the Dolby Theatre. Interesting to see them setting up for the Oscars. Keep your belongings close to you and pay attention, as with any very public crowded place.\nShow less"], ["Reviewed 2 days ago", 5.0, "Worth It", "This is a definite must do if you are in LA. You can look up where your favorite stars are and get a photo or you can just wander and explore. We did it a couple of times but we were staying right off Hollywood and Highland. You will love this if you are a fan.\nShow less"], ["Reviewed 3 days ago", 3.0, "\"Not Much More Than What I Imagined\"", "Nothing special to me, once you get past the stars on the sidewalk. You can look up their location online to see what area of Hollywood Blvd. to go in to search for them. HOARDS of people everywhere, basically the definition of a tourist trap. Some decent restaurants on the Blvd, and TCL Chinese theater, where they do all the premieres. There's also a mall next door, with standard stores. parking is high in this area, so take Uber. Traffic is always heavy around here though. Good clubs nearby at Hollywood & Highland as well. Pricey. If you take a pic with the people in the costumes, they'll ask for money. There's a main souvenir shop where everything is $5-10, and it's your expected Hollywood souvenir items. Best thing on the Blvd to me is the Foot Locker lol. Make it a stop, but not THE stop.\nShow less"], ["Reviewed 4 days ago", 3.0, "Disappointing but should see!!", "It was ok to see but very touristy. There's a lot of souvenir shops selling the same stuff. Worth getting a hot fudge sundae from Ghirardelli."], ["Reviewed 4 days ago", 3.0, "Interesting", "Found ourselves walking with our heads down looking at all the stars. There are some shady looking people but you just keep walking. Lots of homeless people but they didn't bother us. Lots of people trying to get you to book tours. Read here about people dressed up asking to take a photo then expecting you to pay, so we kept walking. Interesting place but not somewhere to walk around late at night. Black Panther premiere was on while we were there, interesting to see what a premiere in Hollywood looks like Marquees set up, security everywhere but didn't line up to see the stars.\nShow less"], ["Reviewed 4 days ago", 4.0, "Worth a look", "Great for a walk to remember your favourite stars both long dead and still going strong. Equally interesting is the eclectic group of people in the area, business people, tourists, drunks and druggies. There are some terrific bars (try the Irish) and some great shopping in the area. Also the usual crappy souvenir shops. Worth a look.\nShow less"], ["Reviewed 4 days ago", 2.0, "Just meh", "There's nothing really special about the Hollywood Walk of Fame. Most are dirty or covered with gum so it's not really impressive to see. I guess it is one of those things you must do when in Hollywood but don't kick yourself if you don't see it. We were much more impressed with the hand and footprints in front of the TCL Chinese Theatre (formerly Grauman's) There are definitely better sites to see.\nShow less"], ["Reviewed 5 days ago", 3.0, "cool but scary place", "Its nice to walk around and see all the stars specially ones of your 'heros'. However the place gets scary for tourists as everyone tries to hustle you. The place seems shady. When we went they were getting ready for the oscars however there were more people trying to get to you.\nShow less"], ["Reviewed 5 days ago", 2.0, "Not for me...", "This place wasn't for me. Although it's neat to see some of the famous stars along the sidewalk, the crowds and sketchy people ruined it for me. No, I don't want your demo CD. No, I don't want a picture with you. No, I don't want to go on a celebrity tour. No! No! No! Is it a must see? Kind of. Will I return after seeing it once? No.\nShow less"], ["Reviewed 6 days ago", 5.0, "Just cool", "Must have to visit in Los-Angeles! A lot of people , celebrities , tourists, restaurants, I strongly recommend !"], ["Reviewed 6 days ago", 3.0, "Be ready to be hustled!!", "This is one of those places you have to see when visiting LA for the tourist experience so I’m glad to check it off my list!! What I didn’t expect was being hassled at every turn by people wanting to take us on a tour or buy something from them. There are people dressed like famous movie characters who come up and ask if you want a picture with them and once you pose and take the picture they ask you for money!! 2 guys dressed like Star Wars characters asked us to pose for a photo and we did, using our camera and we took the photo. Then the guys said they normally get $20 per picture!! We said we only had a few dollars with us which was true but he said he would take a credit card. I refused to give them $20 for maybe 2 minutes of their time when I didn’t ask for the picture, they approached us! So between that nonsense and so many homeless people, be ready!\n\nOn a good note, we ended up agreeing to take a guided tour of celebrity houses when they offered it to us at half price and thoroughly enjoyed it! The tour bus was old and worn out but the guide was amazing and the price was right! But be aware that on top of what you pay for the tour, they expect $25/person as a tip too!\nShow less"], ["Reviewed 6 days ago", 3.0, "Interesting Experience", "All the reviews of this are true, both positive and negative. Yes, it is crowded, there are homeless, rather aggressive people trying to foist their music CD on you, sometimes sketchy characters in costume working for tips. But it is all worth it to see all those famous names in those pink stores. Let’s face it, you’re going to come here anyway.\n\nThe walk of fame is long and it would takes hours to see every star. They are mostly along Hollywood Blvd. but are also on side streets. You can either walk along and take pictures of your favourite celebrities’ star, or google the location first and go find them.\n\nThere is lots to do in this neighbourhood: Hollywood Museum, wax museum, Dolby theatre, Hard Rock Cafe, several souvenir stores, etc.\nShow less"], ["Reviewed 6 days ago", 5.0, "Must sed", "This is iconic Los Angeles. Took family of five that was visiting. Very fun to see stars and old movie houses. Gets crow"], ["Reviewed 6 days ago", 3.0, "Aussies in LA.", "Walked and viewed the many stars on the Hollywood walk of fame. Good to see notable names from the early days through to now. A good stroll. Unfortunately some stars need to be repaired, some areas need cleaning."], ["Reviewed 6 days ago", 4.0, "Avoid weekends or go really early!", "The Hollywood Walk of Fame is an LA must do and it’s great. You’ll see Spidermen in ill fitting outfits to cat women, Star Wars characters etc etc all plying their trade to have photos taken with them (at a small tip of course) but it’s mainly all good fun. If you possibly can avoid going on a weekend of at least if you have to early in the day when the crowds are less. There some great memories when you see the old names and their movies!! Good fun.\nShow less"], ["Reviewed 6 days ago", 4.0, "Excellent Place for a Lovely Time", "Its an enchanting place, filled with Stars edged on the streets having the great performers of hollywood & worldwide. the roads are filled with performers and exciting attraction, entertaining people and energizing the atmosphere. One must take pics with look alike of top characters like super man, batman etc...there is easy metro connectivity leading back to downtown or any other place.\nShow less"], ["Reviewed 1 week ago", 3.0, "Great to ser", "We walked the length of Hollywood blvd and saw a lot of the stars in the walkway apart from that not much else.\nWe had to walk along way to see the Hollywood sign but even this was miles away.\nLots of homeless people which was sad to see in such a place.\nEveryone very helpful when using the metro system to get around places.\nShow less"], ["Reviewed 1 week ago", 4.0, "Trip in LA", "Loved walking through, watching ppl was priceless, lots of people from all over, it's a good visit and nice to see"], ["Reviewed 1 week ago", 5.0, "Stars from past and present", "This is a great trip for all ages...the Hollywood Walk of Fame. Roy Rogers, Shirley Temple, Marilyn Monroe, Nicolas Cage, the list goes on and on and on...\n\nThe excellent news about the walk of fame is that it's free. Yes, free. You can just walk around, take pictures and leave at your leisure.\nShow less"], ["Reviewed 1 week ago", 4.0, "AAD LA 2018", "Very nice place to visit to see the names of the world renowned people. Located at Hollywood street. Shopping area is very good and one can buy souvenirs easily."], ["Reviewed 1 week ago", 4.0, "Tourist trap", "Always wanted to visit and I did, it's a tourist hot spot for sure but loaded with stuff to see and do.the thing I didn't like is when people trying to sell you they're cds, soo annoying. Everything is so close and at hand whatever you need, atm,food,,drink etc\nShow less"], ["Reviewed 1 week ago", 3.0, "Not my kinda tourist spot... :(", "I have to be honest, I agree with a few of the previous reviewers. This place was filthy when we went (Jan) cold, and full of characters who I did not feel comfortable around. I know it's THE place to be when you're touring around, but to be honest, I didn't feel safe, and it's just a lot of walking. Such a shame, I wanted to love it, and pre 'walk' I was so excited. Each to their own....but not for me.\nShow less"], ["Reviewed 1 week ago", 3.0, "Uneventful but I suppose its something to see", "It wasn't that great to be honest. It's highly overrated. With that being said if you're really into movies or want to bring your kids to wax museums I suppose you'd like it. It was rather busy and uneventful. I wouldn't go back, but I'm sure some people would enjoy it.\nShow less"], ["Reviewed 1 week ago", 2.0, "Don’t go in weekends", "We made the mistake to go on a saturday, when the whole place was just packed with people. Wanted to walk down the boulevard to see all the stars but we were constantly blocked by street artists and people trying to sell stuff. In my opinion this was really annoying, especially sellers and artists blocking the street or the stars.\nShow less"], ["Reviewed 1 week ago", 2.0, "Needs a good clean!", "Sadly once again the illusion of this iconic tourist attraction is greater than the reality.\nThe walk of fame needs a bucket of hot soapy water and a good water blast as it absolutely filthy and disgusting.\nSuch a shame that it is in such a poor condition and the city of LA dont have more respect for it, I wouldn't waste my time going there again.\nShow less"], ["Reviewed 1 week ago", 4.0, "stars and stars and shops and crowds", "stars go on for ages, lots of cool names. Outside Chinese theatre are the footprints and handprints in concrete of lots of star names. Also people dressed up as superman and Spiderman etc want to have pictures taken with you for money. Lots of crowds as people shop and see the sights. Lots of cheap souvenir shops. There is also a MacDonald's nearby.\nShow less"], ["Reviewed 1 week ago", 4.0, "Find your favorite celebrities", "This is one of the main tourist attractions. Always crowded. It's fun to find your favorite celebrities' stars."], ["Reviewed 1 week ago", 3.0, "Lots of stars", "Stars, stars an more stars , it just keeps on going and going , certainly worth a look if your in LA . The characters along the walk are good for a bit of entertainment and it’s cool to see some of your favourite celebs stars, however at the end of the day it’s just a pavement with stars on it\nShow less"], ["Reviewed 1 week ago", 3.0, "Didn't blow me away....", "If you're in LA for the first time, it's fun to go and check it out, however aside from the one block of hustle bustle and eager tourists, there was definitely no WOW factor to it. Take 10-15 minutes, go find and enjoy some of the names that mean something to you, and go onto your next destination. Also be mindful of your personal belongings as it is very crowded at times.\nShow less"], ["Reviewed 1 week ago", 4.0, "Scenic", "We had to check it out of course. Very busy sidewalk, lots of people walking, side entertainment sometimes blocking the walk way, lots of vendors. I'm from NY reminded me of Times Square. However, I too blocked traffic as I stopped to take a picture of some of my favorite stars! Very much worth the experience, make sure you walk down/up both sides to see your favorite stars!\nShow less"], ["Reviewed 1 week ago", 2.0, "Nothing special", "It's not anything special. Just some tiles with names on them. There's one block where everything is happening and apart from that, the whole area is just dirty and unkempt."], ["Reviewed 1 week ago", 3.0, "Walking street", "Night life is amazing , very crowded , everyone try to earn more money from tourist , double prize , nice to see Oscar theatre , walking step with celebrity name , two many thing going on road and footpath ."], ["Reviewed 1 week ago", 3.0, "Cool to see", "Neat to see. But it was unkept. Streets and area were not taken care of at all. Expected more. There were various lots to park at. About $10 for parking. Good thing was that you can see the Hollywood sign in certain spots."], ["Reviewed 1 week ago", 3.0, "Travel", "Just taking a walk to all the Hollywood greatest star ever whose names are written in the star all over the ground / floors of Hollywood avenue. It feels like you are also one of a kind seeing the exact place where the film where shooting at. Theres also a mall just climb up the stairs and lots of restaurant and walking distance to the wax museum. Its fun day.\nShow less"], ["Reviewed 1 week ago", 4.0, "Hollywood Walk Of Fame", "I have recently traveled to Los Angeles, California. The first night I flew in, we decided to go to the famous, Hollywood Blvd. It was very fun to see the stars and hand prints. If you are traveling with children I do sugest kep a very close watch on them. There was some people on the blvd that were sketchy. Also if you are sensitive to smells like pot, I do not recommend, because you can smell the drug (not the whole way through but in some parts). It was an amazing experience that I do highly recommend you take! Hope this review helped :)))\nShow less"], ["Reviewed 1 week ago", 4.0, "A must to visit", "A great walk and see lots of named stars embossed into the walkway dating back to silent movie stars"], ["Reviewed 1 week ago", 4.0, "You've not been to LA if you didn't see this", "Probably the most famous tourist attraction in LA. Directions : Take the Metro red line to Hollywood Highland station. The walkway is right here as you exit the station and extends all the way till Hollywood Vine station where Pantages is.\n\nIt's buzzing with activities you won't miss it. Turn right as you exit and walk ahead for about 5 mins and you'll see TCL Chinese Theater and that's where you'll find the hand and foot prints of world famous celebrities cast in concrete.\n\nCater about 2 hrs here as there will lots of opportunities for photo taking.\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice to see", "Its a little bit crowdy street, but still nice to see. There is Chinese theater, where all Hollywood movies have their premiere. :)"], ["Reviewed 1 week ago", 5.0, "Hollywood Walk Of Fame", "I recommend finding a restaurant, bar, movie theatre, museum, etc that is on the Hollywood Walk Of Fame. That way you are going there for an activity. You will enjoy the Hollywood Walk Of Fame much more of you also have something else you are there to do.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Needs a face lift", "I was really excited to see the walk of fame, imagining strolling over the stars of my favourite celebrities. And it is an experience, but not at all like I imagined. The stars themselves need a little bit of love as they seem like they have seen better days. And be ware that the Hollywood strip of filled with an array of characters ready to take a pic with you... for a price. But it’s all part of the Hollywood experience. The facade of the rich and famous!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Tourist must see", "This is an iconic spot that I always wanted to see. It's one of those things that I can now say I've done. It is incredibly touristy as you might expect. This part of Hollywood is nicer than the rest of Hollywood which is a dive.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Worth it!", "A good walk on a busy and famous street. Lots of familiar names! Be careful of people trying to give you CDs or ‘free’ things - they’re not free and want money!"], ["Reviewed 2 weeks ago", 1.0, "What an awful place", "I must have missed the point but this is a truly awful place. Dirty, busy and dangerous. People constantly trying to force CD's into your hand and then demanding money. Lots of what can only be described as unwell people who seemed out of their minds on drugs all to see some stars with names on. I was with young children (11 and 9) who were genuinely terrified. Stay away from this hell hole\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Exactly the Same - Not Glamorous at All", "I’ve been to the walk of fame a few times, with various people as a Tourist, but now I only go to visit one or two particular shops.\n\nThe walk of fame extends pretty far along Hollywood Boulevard, and also includes several offshoots into side streets as well.\n\nAs you walk along, you’ll find overpriced Tat stores, people trying to sell you their “CD” as an up and coming artist... (Whilst getting in and out of a $100,000 SUV) people dressed up as movie characters trying to get you to pay to have a photo with them... then there’s the Homeless.\n\nHollywood has a Massssssive Homeless problem, in Fact most of Los Angeles does.\n\nAs you walk along you’ll constantly come across homeless people, some sleeping rough and others rooting through bins and what not.\n\nThe Streets aren’t clean and sparkly like you’d expect, they might be a bit tidier around the Chinese theatre but that’s the “Glamour” area of Hollywood.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Very crowded but safe.", "We went having been dropped off from a tour. It is a little crowded, but interesting to find your favourite stars on the pavement. I have taken lots of pictures, so I can make a collage when I get home. If visiting the Chinese Theatre it is worth strolling along the road to see them. At the end of the walk there is a statue of the four most iconic famous women stars, together with Marilyn Munro at the top of the statue. Inside are plaques of the Beatles. In order to be on the Hollywoood Walk of Fame, you have to be nominated and pay 50 000 dollars to be included on a plaque. There are 2400 stars on plaques at present. There are blank ones embedded in the pavement so future stars can acquire them.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Would have been a No no if not a must", "You can’t visit LA and not have a “walk of the game”. Having said that you should know that this street, which I visited at the dark, isn’t the most pleasant place to stroll around.\nThe stars are exciting as always of course but there surroundings just don’t look right for them. I would expect the authorities to beautify the place appropriately.\nIf you got here, don’t miss the area of the Chinese theatre.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Way too crowded", "A much worse experience than you would expect. A lot, LOTS of tourists, and practically there eas no place to stop for a photo.\nParking was 25$ and full, while on the other side there are parkings at 10$ cost, with same walking distance to the walking street.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Ok but not amazing", "This is just as it looks - Stars with names on a dirty old sidewalk. Our first impression of Hollywood was one of filth. So the first set of stars on the walk of fame were filthy and disappointing. I am not a huge starstruck person so wasn't a big deal for me.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Disappointed", "Went on a tour of the LA/Hollywood area and the tour started at the Walk of Fame. Have wanted to visit this place for some time. Was disappointed with the overall experience. Lists of homeless, and every time you turned around some person was trying to sell you something or in a costume trying to get you to take a picture with them for pay. Some enjoy that sort of thing. Just not my cup of tea. Did get to see some of the stars hand and footprints. Kind of interesting and the price was right if your looking for something to do. Free\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Hollywood “Walk of Fame” Tarnished", "Recently, I had the opportunity to take my family to visit the Hollywood Walk of Fame. I had many memories of visiting Hollywood and the Walk of Fame and the many “Stars” representing those of, for the most part, Hollywood past. It is still exciting to see and share the experience but it is somewhat tarnished by the many pan handlers, homeless, and dirty sidewalks. It is worthy of a visit if you have never been but be prepared.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "my daughters leg of our trip", "We enjoyed checking out all the stars. We walked up and down nearly all the streets they are on. We used our phones to pinpoint some exact locations of ones we HAD to See. February is when we went so it was not very busy or packed that you are elbow to elbow. Very nice weather added to our trip. Very neat to see and do if you ever have the chance!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So much to see and do!!!", "I've wanted to come here my whole life and it did not disappoint. There was so much action going on my head was spinning!! We saw a lot of our favorite stars stars. I even got to do one of my own. It was an awesome trip.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Hyped Up", "While it was fun to point out the stars of celebs that we like, the whole experience seemed way over hyped. Mostly it was just walking down a run down area that happened to have stars in the sidewalk. Also, generally a dirty area with a lot of litter on the ground. Many of the stars were cracked or had other signs of lack of upkeep.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun", "Crowded as NYC. Amazing to see the names of so many great performers who are no longer with us. Suggest you hold onto your belongings! You will be bumped and jostled. Well worth seeing."], ["Reviewed 2 weeks ago", 5.0, "Fun!", "It's great to see the historical performers that began the entertainment industry in our country! Great fun!"], ["Reviewed 2 weeks ago", 5.0, "Finally a visit to fabulous Fame", "Since we’re from N. Y. State; we had to visit this! We took many pictures, tried on the foot & hand prints, & had a great experience! I even enjoyed the funny, street vendors!"], ["Reviewed 2 weeks ago", 4.0, "A walk down Memory lane", "Great tourist spot. Good people watching. Fun and funny performance artists. A challenge knowing who all three stars were!"], ["Reviewed 3 weeks ago", 5.0, "So much to do and see", "There is so much to see, so many stars signatures. Lots of shops, restaurants and entertainment, tour buses galore. This is a really fun place to walk around. We really enjoyed it."], ["Reviewed 3 weeks ago", 1.0, "Turn around, get back on the bus or Uber out of there - head to a bar instead!", "Had the unfortunate experience of going to the Walk of fame, I was expecting a lot more, boy, were we in for a shock. Dirty sidewalks, over priced gift shops and homeless/druggies everywhere. The walk of fame was dirty, shonky people trying to sell you a plaque on the footpath with your name on it for a price. Tip - if you must buy keepsakes, walk down to the other end of the street and it will be much cheaper. Our Uber driver suggested a walk down either side before leaving, we made it down one street before being bombarded by salespeople. Very underwhelming, sad but constant theme in LA, homeless people and bums everywhere. Do yourself a favour, skip this iconic tourist trap and spend the money at a bar, it will save you money and time. Don’t waste your time here - it’s time that you won’t get back.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Worth the stop", "It was worth the stop. I enjoyed walking up and down the street and reading all the stars and getting a few pictures with some of my favorites. I wouldn't spend hours and hours there but I am glad I visited and can check it off my list of things to do in my life. At the end of the day you are just walking and looking down. When we were driving away I realized that I was right near Capital Records but I never looked up long enough to notice! The street vendors trying to sell you bus tours for the stars homes were kind of annoying and most were also a bit rude when you said No Thank You but overall it was a pleasant experience and I would recommend it.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Worth a few minutes to say you were there", "It is very difficult to see all of the stars. There are \"character actors\", promotion sales people, \"homeless?\", corner musicians. It feels like you are walking the gauntlet.\n\nThe local news reports that the homeless population has double in the last couple of years - they are everywhere.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Hollywood Blvd", "We walked both sides of the street and what I remember most was the smell of pot and piss. The side walk was quite busy and nearly all the individuals there were addicts or street people. We witnessed three arrests and one car accident in the hour we were there. People we laying on the ground all over the place preparing to sleep for the night. I would tell my friends just to visit the few famous addresses and move on. Don’t waste too much time walking around looking for something special as there is not much else to see.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Hollywood fun!", "The Hollywood walk of fame is fun spotting your favourite stars! The older you are ( I am 78) the better - as you will recognise so many of the original stars of your youth. I found Ester Williams down near Sunset and Vine last week. The walk although centered around Hollywood and Highland goes for a long walk in all the surrounding main streets. Good fun for all, but very crowded around the Chinese Theatre area!!!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Three Generations", "It was fun walking the street's sidewalks and discussing the various stars. Of course, the youngest had no clue as to who most of them were. That was a real lesson for us and our own legacy."], ["Reviewed 3 weeks ago", 4.0, "Ehhh", "Was definitely not what I had expected. Lots of bums and homeless people making the area feel super sketchy. No good places to park for less than $25."], ["Reviewed 3 weeks ago", 4.0, "Czech girl in Hollywood", "This was a very nice trip to see the famous Hollywood walk of fame. I enjoyed looking for my favorite actors and when I found them I was excited to také a Picture with their star!"], ["Reviewed 3 weeks ago", 3.0, "If you're in the area or on the Redline with a day pass, have a walk", "Walking down Hollywood Blvd is an interesting experience. Not only to notice the names on the stars or see the various icons for film, music, directors, etc -- but because there are so many people stopped by their favorite celebrity's names having someone take a photo of them, or trying to pose with a selfie stick. Walking and avoiding the posers can be like being a character in an arcade game. (And then you can add in walking around crowds that form around the unofficial movie/cartoon characters and dodging the guys who want you to go to the $5 souvenir store, which is not a good deal or the guys giving your their CDs and then following you for money.)\n\nStarting at La Brea and going eastward for 1.2 miles to N. Gower Street, Hollywood Blvd is dotted with stars. In fact, you can see them on Google Maps when in satellite view.\n\nIf you want to see the area on the map, enter Statue of the Four Ladies of Hollywood for La Brea side (it's on the south side of Hollywood Blvd and is a major landmark) and the Fonda Theater (north side of Hollywood Blvd) for Gower.\n\nNot all the stars have names though. Some are blanks awaiting an icon and name. Some are in a single line while others are staggered side by side.\n\nParking isn't easy around Hollywood Blvd so you may have to park a few blocks south. Or you can pay upwards of $7 a parking lot. If you happen to have a day or multi-day pass for unlimited metro rides, get off at the Hollywood and Highland station or Hollywood and Vine and have a walk. But if you're all the way across LA, bear in mind that a 2-mile drive is 15 minutes if not much more, and this is not that amazingly great. Maybe drive over there after well around rush hours, preferably after 7. Unless there's an event on Hollywood Blvd that night, it's much more doable at night.\n\nAnother reason to be there when it's dark out is that Hollywood Blvd is much more unique and beautiful when it's lit up at night.\n\nThe stars themselves aren't something I'd call spectacular, but the experience of Hollywood Blvd is unique.\n\nYou could walk the entire area in however long it takes you to walk 1.2 miles on a crowded street, but you'll likely want to stroll and take in more of what Hollywood Blvd has to offer so I am writing 2-3 hours for your visit. But you can also pop out of the subway and look at a few stars for 10 minutes and be back on your way.\n\n(I have lived in the area on and off for many years and seen the Walk of Fame many a time under many circumstances at every time of the year.)\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Walking On Stars", "It was very fun walking and looking at all the names on the stars. We took photos of many of our favorite people. Other visitors were doing the same, lots of great conversations going on. There are lots of stores that sell Hollywood type of items. Just remember to avoid the hustlers on the street trying to sell worthless cds, etc. They are rude. Focus on your fun!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Bit of a let down", "I guess i has to be on the list but to be honest it was a dissapointment.\nThe walk of fame goes a long way and many parts are not washed down and lots of litter and tacky souvenir shops were in place. Don't expect too much from this one although certain parts are for sure better maintained.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Toddler takes over LA", "This is a really nice area. Must do the tour with the Hollywood Mansions . I paid $35 which included my 17 month old . And nice area to take pics and the people are nice . Daytime parking $10."], ["Reviewed 3 weeks ago", 3.0, "It's not what you think", "Is just a sidewalk mostly dirty with the stars name in bronze border stars.\nThe walk goes on for blocks must of the current actors are not in prominent places as the stars are placed in the order they were awarded. It's worth seeing it once and then you are done\nShow less"], ["Reviewed 3 weeks ago", 3.0, "See It Once", "See it once, don't go again is basically the idea. It's so famous that if you're not from Los Angeles you need to go see it. But after you do it once you're done.\nBeware Scientologist recruiters offering personality tests. They want your money.\nSome interesting shops line Hollywood Blvd but the secret is no one who actually lives here hangs out here.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "UGH", "While the concept of honoring all of these celebrities is cool, walking the streets of Hollywood isn’t. Trash, pan handlers, gang members are rampant all up and down the Blvd. Just drive up and down Hollywood and Sunset Boulevards for some fun and then go toUniversal Studios for real Hollywood fun.\nShow less"], ["Reviewed 3 weeks ago", 1.0, "It’s Hollywood...", "I know before I moved here I always had this glamorous view of Hollywood. I’ve visited the Walk Of Fame several times with family and friends while they’re in town. 100% of them have said they’re glad they went to say they’ve been there. But they would never go again. It’s nasty. You will see homeless people who’ve used the sidewalks as their restroom. Be careful what you touch. It will be extremely crowded and very chaotic. Ironically, the symbol of L.A. doesn’t truly represent the city. Except for tons of homeless and human feces on the sidewalks... We have that in a lot of areas unfortunately. Keep a close eye on your kids and valuables. The very best thing in the area is the Jimmy Kimmel show. But you’ll need to reserve free tickets way in advance. There’s also the Roosevelt Hotel. It’s down the street and is really cool.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Dirty & less than desirable!", "Something to see if you are interested in a quick photo w/ your fav's! Hollywood is dirty & less than desirable."], ["Reviewed 3 weeks ago", 4.0, "Worth some of your time", "The Walk of fame is really long, not just on Hollywood Blvd. it is fun to see all of the names of people you recognize as well as those you do not. There are so many tourist on the main few blocks of the Blvd. that it really is hard to stop and read the names. Walk a few blocks east of Hollywood and Highland and you will have the stars all to yourself. You will never do the entire walk. Enjoy the part you can.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Stars on the Sidewalk", "A classic Hollywood attraction........only three stars have ever been removed-----Kirk Douglas, John Wayne and Gregory Peck------all subsequently replaced after tampering or theft.......when will you get yours?"], ["Reviewed 3 weeks ago", 5.0, "A Hollywood Must", "Hollywood Walk of Fame it is a piece of quintessential Hollywood!\nVisiting the Hollywood blvd. is hectic, let's face it it is a CRAZY! busy street, packed with visitors, tourists, shoppers, hustlers, promoters and protesters. If you want to get the best view of the stars on the blvd, uninterrupted, you need to go there earlier, before 10:00 am, earlier the better where there are not many people there, make sure to check out the foot/hand prints of the most popular stars right in front of the Chinese Theater.... if you want to see the craziness of the street, then come after 12:00 noon, where you will see everything you want to see and more.... Watch out for the costumed character impersonators- superman, captain america, Spidermen, keep in mind, they can be very pushy, say NO if you don't want them to push you into take a picture, if you choose to take a picture with one of the characters, be sure to ask how much they charge first before jump in for a picture. There is no regulation therefore they can charge from $5 up to $20. Also, do not take any \"free\" items from the peddlers, such as CDs etc., they WILL want money from you, and there is NOTHING on those CDs. Remember, Nothing is free!\n\nOn the other hand, there are a lots of city tour peddlers, it is ok if you want to buy a tour departing right in Hollywood, that is fun! but pick wisely.\n\nParking: if you drive, park at Hollywood and Highland shopping mall parking (enter from Highland blvd.), you can go to Information to get stamped for two- hour free parking. Remember, park on the street of Hollywood is hard, and you will get nearly $100 parking ticket if you parked wrong, read street sign CAREFULLY!\n\nThere are a lot of restaurants and bars along the Hollywood Blvd., some are a bit shady, but do check out the Hollywood and Highland shopping mall, it has shops, restaurants, and night club Ohm, one stop for all your needs.\n\nWell prepared Hollywood visit will let you have fun without all the craziness and disappointments.\n\nOh, if you are lucky, you may come across the ceremony of a celebrity getting his/her star on the blvd! Have fun!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Shouldn't miss", "We walked most of this area. It is truely an LA experience, not to be missed. If you want to see certain stars, I suggest you look up where they are. Most were in good condition, but I was disappointed to find that a lot of the stars needed repair or cleaning. I know there are many people walking the area, yet in my opinion, I think it should be better maintained. We had a lot of fun walking around, taking pictures, etc.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Half an hour maximum", "Tourist are so excited to see the stars, but after 1/2 hour walk it is the same starts, same souvenir shops, same, same... I recommend going to the Chinese theater and their shops and spend an hour watching the \"crazy\" people... fun for the family. Meuter Media\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A must", "Like a travel in your movies memories, you'll start to remember names that you thought you forgot about, long time ago. Very recommended."], ["Reviewed 3 weeks ago", 3.0, "Fun", "Walk of fame, the wax museum great place if u never been to LA go to Hollywood its a fun place to visit"], ["Reviewed 3 weeks ago", 3.0, "Interesting if you love Movie Stars", "Walk of fame is a hollywood must. But have your senses about you. Lots of souvenirs shops. You can also buy disney merch there as well. you will get harassed by people trying to sell you cd etc. Just don't engage."], ["Reviewed 3 weeks ago", 5.0, "A must see", "Difficult to read all the stars as lots of pedestrians and just couldn’t pause long enough however having heard about it it was good to see"], ["Reviewed 3 weeks ago", 2.0, "Sightseeing", "I thought it would be nicer, it was real dusty looking and dirty. Wasn't worth the drive that we took to get there. The stores a long the strip also looked kinda run down as well."], ["Reviewed 4 weeks ago", 4.0, "A lot of stuff going on here!", "Here you can find a lot of souvenir shops, museums, shows, entertainment, restaurants and some buildings, like Capitol records and Dolby theatre. There are also some other stores like Foot locker. You can also see the Hollywood sign from some spots during the walk.\n\nA tip is just to walk around, look, and enjoy the crazy and entertaining vibes!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Enjoyed it", "It kinda reminded me of the las vegas strip as it was that busy with people walking around. Not sure where you can park but we ended up paying 15 bucks to park in the parkaide as we were strapped for time. Was enjoyable looking for all our favorite celebrities stars. We are glad we went and checked it out.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Tired and overrun by the Homeless", "During a college visit, we spent a fair amount of time walking the Hollywood Walk of Fame. I really feel for the homeless and the lack of resources to help them. That said, the City does virtually nothing to prevent groups of homeless from collecting along Hollywood Blvd. We saw as many as 6-8 homeless young people congregate on the walk and the smells alone are enough to chase people away.\n\nIn the mornings, the remnants of the homeless using the storefronts as toilets really make you worry about Hep-C and other diseases. Old Hollywood has seen its better days as the Chinese Theater is no longer in the best shape along with the Walk of Fame itself. The only modern facility is the Dolby Theater area at the corner of Highland and Hollywood Blvd.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "It was ok", "We walked quite a few blocks. It was dirty homeless people everywhere. Not what i expected but i did enjoy seeing all the stars."], ["Reviewed 4 weeks ago", 2.0, "Don’t bathed to go", "First time I Visit the Hollywood walk of fame it was in 2014 , I had some expectations and\nThe smell of weed and pipi every where ruined my Hollywood dream\nI did not know it’s going to be so so dirty and disgusting\n\nThis year I visited with my husband in January and it’s still the same\nWell I got suffocated by the smell of weed every where\n\nI developed coughing and felt was passive smoker\n\nI put two stars because if u have the same dream I had u should sacrifice for 1 hour of ur life and visit otherwise there is lot of souvenirs shops every where in LA\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Nicely Crowded place", "this place is the most ALIVEplace in the whole LA Area, where it is all the times crowded and full of people who went there to enjoy their time, i think the streets is well known and there is no need to mention that on the ground you will see the honor stars of all the celebrities.\nif you go there do not forget to visit THE MOHAMMAD ALI start, which you wont find on the Ground, because it is the only SPECIAL star where it was on one of the Buildings because Mohammad ALI refused that his name to be on the Ground because he has the name of Prophet Mohammad.\none thing people dont like about this place that it is full of Homeless, but comeone, these people are there to do something and get some money where they can buy some food, also they entertain you.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Iconic", "The Hollywood wall of fame is a must see. The walk of fame is surprisingly long because of all the immortalized stars throughout the years. There are many other attractions, shops, and restaurants along the way."], ["Reviewed 4 weeks ago", 2.0, "Horrible", "This was the second time I have visited this place , the first in 1997. What a difference in time. It is now a dirty grubby hole with homeless people everywhere, everything is dirty with cracked side streets , filthy shop windows and just as equally dirty inside the shops. This place needs to be bulldozed down and rebuild. Unfortunately who remembers Hollywood . I would personally visit other places never planning on coming back again to this rat hole. Don’t waste your time when there are other fantastic places to visit.\nShow less"], ["Reviewed 4 weeks ago", 1.0, "Don’t bother", "This has to be the worst part of our LA experience the place is dirty full of hood rats and homeless and potential crime You can’t get near the Chinese theatre handprints of the stars as it’s barricaded off . Hollywood is a myth unfortunately"], ["Reviewed 4 weeks ago", 5.0, "Walk of Fame in Hollywood", "The Hollywood Walk of Fame is a must\nsee in LA. This was our second time to visit the Walk of Fame. It’s nice to be reminded of some of the golden greats of early cinematic days and the stars of today and forgotten stars of yesteryears. It’s close to loads of other Hollywood attractions.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Another child dream that came true", "Where all dreams come true. Avenue of stars was a great experience and loved it every single moment. Exactly like the movies."], ["Reviewed 4 weeks ago", 1.0, "So dirty and full of scammers", "We were so disappointed when we arrived to what we always thought was a great place to visit. It was full of homeless people but they weren't the problem. There are scammers everywhere. Claiming they are the hottest new thing and using stand over tactics for money. So many people in costumes getting people to take photos with them then demanding money. Also it was filthy. The place needs a huge clean up.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Dirty", "There is one block of the walk which is nice, the rest of it looks like it needs to be power washed."], ["Reviewed 4 weeks ago", 5.0, "Hollywood Walk of Fame.", "My first time in California and it was everything I thought it would be visiting Family in California for the first time it was very busy and walking looking down was really fun can't wait to do it again."], ["Reviewed 4 weeks ago", 5.0, "Exciting", "Hollywood’s walk of fame is one of the popular spots in Los Angeles for tourists, really fun and unforgettable place, however be aware theyre are a lot of street entertainment, the people in costumes asking for pictures will want tipped, guys offering CD’s or holding snakes will be there to make their money too. This used to not be the case as much but as years have went on more and more people have seen this as a money making opportunity, therefore go to this place with the intention of only speaking to people that you know and you will be sure to have a great time and see some celeb names..\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Pre-Bday Celebration", "Fun & exciting...was able to get my own personal star made! Nice to see all the many famous people thsts represented."], ["Reviewed 4 weeks ago", 2.0, "Disapointed", "The entire BLVD was dirty with lots of sketchy people, Uber driver told us to ignore the homeless because they can get angry and few tourist had been stabbed. The entire BLVD was not well kept and dirty. Knowing that the nominees of the star have to pay $40,000.00 for the making and maintenance of the star saddens my to see most of them in need of repair.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Nice addition to your walk.", "Nice to look and see who has a star. They need to fix a few that are cracking but it’s free and interesting."], ["Reviewed 4 weeks ago", 4.0, "Visiting Hollywood, California", "Great time. Lots to see. Enjoyed seeing the names on the stars. Great places to eat at. But was crowded on a Saturday night visit"], ["Reviewed 4 weeks ago", 4.0, "Craziness 24/7", "If you don't like stuff being loud this place isn't for you. First night I was there a helicopter was looking for somebody in the vicinity. I kid you not some guy drove past and said \"They killing people over there, stay away\" I laughed about it but he might of been telling the truth. Lot of people trying to sell you stuff, protest happened a couple times. Cool place if you don't mind the craziness.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice for Visitors", "Hollywood is not the best street people can walk on, but when you are down near Highland where everything is happening, it's a fun place for visitors to go. There is a nice mall, a Hard Rock, and lots of people watching. Just be cautious because like every touristy area, there are pickpockets and anyone waiting to take advantage of someone who is unfamiliar with the area.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must experience at least once in a lifetime", "Totally awesome and busy place. Great food, souvenirs and things to do! The walk of Fame just go and experience it at least once in a lifetime."], ["Reviewed 4 weeks ago", 3.0, "Fun walk, but needs maintenance", "Its was fun exploring the Walk of Fame... The famous names made me gush with delight. But cleanliness and maintenance of overall walk is an issue of concern."], ["Reviewed 4 weeks ago", 3.0, "Not a big deal", "This place was a real chocker, specially since it's so famous. The walk of Fame was long gone. They should name it the walk of garbage. It is really dirty and it seems like they do not take car of it."], ["Reviewed 4 weeks ago", 2.0, "Disappointing", "After all the hype, the walk of fame was a letdown.\nUnlike what you see in TV, Hollywood Boulevard looks like any other street in LA but with costumed characters like Spider-Man/Superman and others hustling tourists.\nFelt uneasy about walking the streets.\n\nShould have been more upmarket and classy with all the history of great entertainers.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Bored in L.A.", "Went to Hollywood walk of fame to kill time. I was not disappointed. Took lots of pictures and had a great time"], ["Reviewed 4 weeks ago", 3.0, "For celebrity lovers, but otherwise, it's ok", "I got excited seeing Minnie mouse and some celebrities but it is rather hard to find them amidst people behind the scenes we might not know. Also it's filled with people selling stuff and dressing up in costumes to take pictures with you for a tip. I hate that because it's very crowded and you get bombarded by people trying to approach you to buy their stuff or service\n\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Find your favorite star!", "A classic trip down the sidewalk taking selfies with the stars! Everyone you love has a star here. See them all!"], ["Reviewed 4 weeks ago", 5.0, "just stay safe", "you will see ALOT of Homeless people In this area. Do not take ANYTHING FROM ANYONE or they will want money. just keep your wallets safe and stick together and you will be fine."], ["Reviewed 4 weeks ago", 3.0, "Just ikay", "Underwhelming. Once you’ve seen one star on the ground you’ve seen them all. I suppose there’s something to saying that you have been there, but that’s about it."], ["Reviewed 4 weeks ago", 3.0, "Busy bustle", "The stars walk you couldn’t do it all it’s too long. But found what was wanted to see. So many rap artists thrusting CDs at you telling you it’s free, then wanting a donation for it. Just annoying and rude they don’t like being told no. Also a lot of people dressed up trying to get money to have your photo taken with them. Some really well done impersonation, but Spider-Man weighing 110kgs with a gut and Spanish voice isn’t impressive, especially when he is wearing a small suit showing every crease in his body. Not kid friendly!!!\nMany of them where really good but again NO is not there preferred answer. Just makes for an obstacle course whilst navigating your way around the starts. Lots of souvenir shops to buy stuff, some excellent some revolting. All in all a good few hours of entertainment, Scientology recruitment drive was funny to see. If you like people watching here is he best mixed bag I have ever seen. Could be inappropriate for younger kids, my teen laughed a lot off and was revolted by more.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Walk of Stars", "This is something you can do yourselves no need to get a tour guide to show you around. There are more things along Hollywood Boulevard to do than just look at the stars as they go for a couple of blocks so you may want to just do the ones along both sides of the Chinese Theatre as once you cross over Highland Street on Hollywood Boulevard there is not much to see down the other end and it’s a bit dirty and dinghy.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "You need to go and take a look but lower your expectations a little bit...", "Being in LA you need to go this place anyway, as it is one of the iconic places for tourists. The good: you can see some famous theatres (El Capitan, Chinese one, etc), you can get a view of the Hollywood sign on the hills, you can see the walk of fame with the star names on it, you can find a lot of reasonable priced souvenirs from LA and you can even find some good and affordable fresh prepared food (recommend Latin Fusion Kitchen). The not so good: some areas adjacent to this place are a little bit rundown and you find some homeless people on the street. If you're going with a family I will recommend to go during the day. Good but not great.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Hollywood Walk of Fame", "Loved looking at all the famous peoples’ Stars and taking photos. We were fortunate to be there when Minnie Mouse received a Star, and were able to see Katy Perry & witness how crazy people are to see a star for autographs & photos. It was fun. We enjoyed shopping for souvenirs.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Nothing special", "We went to the Hollywood walk of Fame because I guess it's a must see if you are in LA. But I did not find it terribly interesting. But I do think that if you're in LA you should go to see it. But now that I have already bee, I really don't think I will go back ever again.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Worth a visit", "Somewhere you must visit if you're in the area, quite fun finding the names of stars we like. Would highly recommend going quite early in the morning so that most of the crowds and poorly dressed superheroes and characters aren't out yet."], ["Reviewed 5 weeks ago", 3.0, "It Could Have Been Worse, Could Have Been Better", "It bothers me to admit this, but I wish that I had enjoyed my time here more than I did. The friend I went with made the time I spent bearable.\n\nIt's obvious that the location has a lot of history. And you can read about the history at the Hollywood Museum. That's right there, too. And I think it's quite a bit more entertaining. My biggest issue with the Walk of Fame wasn't the people hawking their wares on the stars, or the homeless and destitute you will encounter. My problem was with the great history drowning in what I would describe as an aura of decay. Yes, it's crowded. There's trash, and you'd wish there'd be a bit more upkeep on the stars. There are nicer areas, and better things to do around the Walk of Fame. If you absolutely want to see the stars, do so. But keep in mind that the next time you're in the area, you'll just be using it as another sidewalk to get somewhere else.\nShow less"], ["Reviewed January 25, 2018", 3.0, "Our world’s most star-studded sidewalk", "Must be a great attraction . . . I’ve been here over 20 times. I used to have a business partner in LA, and have been to Greater LA over 100 times on work, and over 30 times on vacations and shopping trips. On over 20 of these trips, I’ve brought my guests and friends to Hollywood Boulevard to see the Hollywood Walk of Fame. Although I rate it as an average attraction at best, it is a world-famous attraction. But what do people see in it? I guess they like seeing the names of their favoured stars. Surprisingly, it isn’t that old. The first eight stars were dedicated in 1958, and the Walk of Fame was officially completed in 1960. Over 2,000 stars and celebrities are forever immortalized here.\n\nI guess the conceived marketing tactic worked, as more than 10 million visitors from around the world come each year to experience this attraction. They come to Tinseltown to have their photos taken beside the pink, five-pointed stars. Really . . . But why? Is it that great of an attraction???\nShow less"], ["Reviewed January 25, 2018", 4.0, "Hollywood walk of fame", "Hollywood and Beverly hills both locations make you believe you are too close to actors , actresses , directors , musicians , radio jockeys ... when in downtown u can walk the fame approx 2500 such stars who are successful in films , radio , music or art ... u can find them on this walk .. quite impressive in case ur a movie buff must place to visit once in Hollywood .. keep about an hour to have a good look of place and feel it .. there are good shopping and food areas around the place .. enjoyed it well\nShow less"], ["Reviewed January 24, 2018", 4.0, "Have a CD", "This attraction like many people has been on my list to visit in Hollywood, it gives a certain feel of what it would be like to live like a celebrity. The stars are set out along Hollywood Boulevard ranging from busy areas, to areas that are not as nice. Walking down the street you are approach by numerous gentleman trying to give you their CD, and then ask for money to help them. This is something that becomes very irritating after a while amongst trying to avoid walking into other people on the street. One of the men became quite aggressive to one of my friends when trying to give him a CD, and had resulted in a few heated words coming from the mans side. I personally ignored them and simply said \"No thanks\" and continued on. You will also notice the smell of a certain narcotic when you are walking down this road which is very off putting. We had noticed the presence of two police on the street, but they did not intervene with the men selling cd's.You will notice homeless people on the street, which can be upsetting at times - I personally would not give them money, as we had witnessed another person give money and became surrounded by other homeless people seeking the same. All in all I would say that the stars are amazing, but you will notice that some of them have suffered damage and appeared dirty which was a bit of a let down. I personally would visit this attraction again, and would advise people to be careful of others around you.\nShow less"], ["Reviewed January 23, 2018", 2.0, "Not impressed", "We walk for a few blocks and that was it . What is a star on a sidewalk ??? To be seen if you go there once ."], ["Reviewed January 23, 2018", 3.0, "Hollywood walk of fame", "Really fun to see. Sad that so many of the stars had graffiti on them. There was a lot of dirt and garbage around as well but still moving to see the famous stars!"], ["Reviewed January 23, 2018", 5.0, "Much to see.", "We went there with another couple when we went to be on the Price Is Right. We decided to go sightseeing and stopped to see the stars. Parking is rally hard to find but it is worth it to see the stars and the area. We stayed at the Old Holywod Hotel and just walked to the Studios near there.\nShow less"], ["Reviewed January 23, 2018", 3.0, "What I Expected", "If your in LA this is probably something you want to see and walk along, there are lots of other tourists doing the same, it is a very busy street and sure you see the stars but because the place is packed you can't really stop to much, but there are 15 Blocks of Stars so you will see plenty if you go further down to less busy areas of the Blvd.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Great to visit", "You will be approached by people trying to \"give\" you a CD, or have their photo taken with you, but a firm No gets the message across and they leave you alone. There are about 2400 stars (I think), but you can Google where they all are, so if there's any you particularly want to see find out where it is in advance (some of them are on Vine Street instead of Hollywood Boulevard).\nShow less"], ["Reviewed January 23, 2018", 4.0, "Walk of fame", "The walk of fame is easy to navigate just take your time and see whose star you are waking over no need for a guide easy just take your time"], ["Reviewed January 23, 2018", 2.0, "Pura enganação", "A Calçada da Fama é mais uma dessas pseudoatrações turísticas! Uma pena! Não pense que vai encontrar a Calçada como aparecem nas fotos! Todos os dias são milhares de pessoas transitando por lá! Uma enganação! Vale, eventualmente, para os cinéfilos que encontram o nome de um astro do qual é fã!!! Não recomendo!\n\nThe Walk of Fame is one more of these pseudo tourist attractions! A feather! Do not think you will find the Calçada as they appear in the photos! Every day there are thousands of people walking there! A deception! It is worth, eventually, to the cinephiles that find the name of a star of which he is fan !!! I do not recommend!\n\nShow less"], ["Reviewed January 23, 2018", 3.0, "Wow, the Walk of Fame is awesome to see in person.", "The stars on the Walk are great to see in person, very nostalgic and definitely prompts you to remember Stars from the early days of TV. Take note this is a Should See."], ["Reviewed January 22, 2018", 2.0, "A let down", "A bit of a let down really! The street is dirty and filled with locals forcing their mixtape on you! Obviously it’s a place you want to see when visiting but don’t get your hopes up!"], ["Reviewed January 22, 2018", 4.0, "Good but depends on how much time you have", "It is a good solo walk but it really depends on what you like. It is a one-time thing where you can walk and have a look around at other places like Dolby's, Chinese theatre etc. But if you are pressed for time, you can skip doing the entire walk. It gets very crowded during the day so try and do it early. [You can definitely do this on your own and skip booking a tour for this one]\nShow less"], ["Reviewed January 22, 2018", 5.0, "Dont miss this spot !! .. Amazing !", "This is a must if you visit Hollywood , you could see the stars of many of your favorite artists and arou d there is the famous Chinese Theater, the wax museum, Ripley Museum , and many famous spots among tourists .. there are restaurants and bars, clothing shops, etc and around there you could be able to take pictures with people dress as spiderman , Marilyn Monroe, Superman etc .. theres so much fun .. dont miss to take selfies on this spots !! ..\nShow less"], ["Reviewed January 22, 2018", 4.0, "MY WALK OF FAME ON HOLLYWOOD BOULEVARD.", "I was able to take pictures on the strip. There were so many different characters it was hard to choose."], ["Reviewed January 22, 2018", 3.0, "Walk of Fame...", "This is a tourist thing to do, but not one I highly recommend. Lots of homeless people begging, etc. and can smell."], ["Reviewed January 22, 2018", 3.0, "Bit of a buzz kill", "Love the idea of the walk of fame but difficult to know where people are and some in trashy areas... Wish Hollywood had at least some of the old grandness."], ["Reviewed January 22, 2018", 5.0, "Awesome walk of face", "It was walk well worth it, you get to see all the stars, there are nice shops and great place to see while walking"], ["Reviewed January 22, 2018", 4.0, "Typical LA", "We took an LA City Tour there. Loved walking on Hollywood Walk of Fame. The crowd reminded me of New York. I saw Tom Cruise, Mickey Mouse, Scarlett Johansson, and many other celebrity names. It's fun."], ["Reviewed January 22, 2018", 3.0, "First time visiting", "First things first, there were alot of tourist on Hollywood boulevard. It was a bit crowded but it was cool to see all of the starts on the ground with celebrities names on them."], ["Reviewed January 21, 2018", 3.0, "Once is Enough!", "Our visit to the Hollywood Walk of Fame was a little underwhelming. One block of stars feels no different from the next. We were further turned off by the many vendors selling tours and $5 t-shirts!"], ["Reviewed January 21, 2018", 4.0, "Great solo walk on fame", "Was given a map by friend. Took a walk to find my favorite celebrities stars. Not bad if you are not bothered by homeless population."], ["Reviewed January 21, 2018", 3.0, "hollywood", "fun to see took awhile to find what we were looking for did not know they would be so spread out was really crowded when we were there"], ["Reviewed January 21, 2018", 4.0, "Worth while site", "If you are a movie and TV buff, this is worth the time to see the names of so many honored there. You’re sure to recognize many if not all the names here. Takes you down memory lane"], ["Reviewed January 21, 2018", 3.0, "Go in a group", "My adult daughter and I were dropped off at the start of the stars — we started about 9:30 which was a bit scary as the area is sketchy. We walked and got great pictures — lots of stars were defaced - sad. When we got closer to the 11:00 hour - started to get busy with lots of guys trying to sell tour trips, CD or rides to see homes of the stars. It was a check on the bucket list but would recommend going in groups.\nShow less"], ["Reviewed January 21, 2018", 3.0, "Nice place to see once", "The Hollywood Walk of Fame is a nice place to visit once. A lot of stores a lot of shopping a lot of chain restaurants to eat at. You could see the Hollywood Sign from some of the buildings as well. It's a nice place to visit so you can at least say that you have been there. If you are in that area I highly suggest the restaurant named The Griddle. The Griddle has amazing breakfast one pancake could feed an entire family.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Once in a lifetime", "We had a great time visiting the Walk of Fame. The only downside is that is crowded all the time and vendors everywhere trying to sell everything under the sun. Be prepared to walk and pay some fees for parking but it’s worth every second. Enjoy the pics!!\nShow less"], ["Reviewed January 21, 2018", 5.0, "AN EXPERIENCE LIKE NONE OTHER", "OMG!!!! The Hollywood Walk of Fame is an EXPERIENCE LIKE NONE OTHER. We arrived off the tour bus and right at the STARS. Pictures are obviously allowed to be taken so my cell phone camera was USED to its END............ROFL. The souvenir stores GALORE but it is a FAMILY event needed in ones life. OMG!! is WHAT I CAN SAY!!!!!!!\nShow less"], ["Reviewed January 21, 2018", 4.0, "A very touristy thing to do", "If your first time in LA of course you must visit Hollywood and check out the Walk of Fame for the Stars on the sidewalk. Not terribly exciting but one of those tourist visits you must tick off the list."], ["Reviewed January 21, 2018", 5.0, "Find your hero", "It’s a good place to observe & find the star of your hero. This can also be an excellent place to go people watching"], ["Reviewed January 21, 2018", 4.0, "Nice", "It was great to see all the stars names and all the attractions on the walk of fame. The bad thing about it is that it is dirty."], ["Reviewed January 21, 2018", 5.0, "Cool to see", "If there are stars you know you want to see, be sure you've looked up exactly where they are located! It's cool to see the stars but it's an extremely crowded and busy street."], ["Reviewed January 20, 2018", 5.0, "A Must Visit when in Los Angeles", "This walk lasted a quite a few blocks and it was fun to look for some famous stars names. People would stop and kneel down to take pictures. Remember to put on comfortable shoes when visiting there."], ["Reviewed January 19, 2018", 3.0, "Underwhelming!", "I'm not sure what I expected, but I was underwhelmed. The stars are randomly set in a scruffy street and are difficult to read, often damaged and just offered no wow factor to me unfortunately."], ["Reviewed January 19, 2018", 3.0, "Cool, but gross and touristy", "Find the star you want, take a pic and leave. The street is full of desperate folks wanting money and attention for not a lot in return."], ["Reviewed January 19, 2018", 2.0, "Tarnish Town", "When you think Hollywood, you think glitter and glamour. Not the case. It’s run down and dirty. The sidewalks are crowded with tourists and vendors selling you tours, food and cheap souvenirs. There was also a problem with panhandlers stopping me ever few feet asking for money or something to eat. With the large crowds it made it difficult to see the star’s stars. Glad I got the chance to see the Walk of Fame, although once is enough for me. It was okay during the day, however I wouldn’t want to be there once the sun sets.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Make it your own", "Don't let others influence you. If you are already interested in it, go for it! This is so much fun! Just walk around. See where the rich and famous are and where the people sleep on the street on their stars. Walk into the wax museum, shop, see the Hollywood sign, have someone draw a picture of you . You can get a map to drive yourself around too see where stars live. Or take a guided tour. Tours are fun and informative. Make some research where to eat, and buy trinkets for very very cheap! Enjoy!\nShow less"], ["Reviewed January 18, 2018", 5.0, "If your in Los Angeles it's a must do", "What a great place the Hollywood blvd seeing the stars on the walk of fame. Getting pictures taken next to your favorite star and a place where you can get your picture taken in front of the big hollywood sign. So many wonderful characters that dress up to look like the person in the star. but watch out if you have a picture with them they will want money. outside the chinese theatre where foot and hand prints in cement of stars to compare your foot size with them\nShow less"], ["Reviewed January 18, 2018", 5.0, "Nice ...", "You will always find at least three stars whose work you’ve adored your whole life. I was very happy and proud when a street vendor asked if I was from India and commented, someday Shah Rukh Khan would have a star here ...."], ["Reviewed January 18, 2018", 4.0, "It's a must seeq", "Everyone really should see the Hollywood Walk of Fame if they're ever in the area. And by that I mean you should walk a block and call it a day. The area is pretty seedy and I didn't really enjoy being there, but I wanted to see a bit of the Walk. I enjoyed the Disney stars outside the theaters, and was excited to happen upon Betty White's star, but I didn't go hunting for my favorite celebrities. It's a 1-and-done kind of activity.\nShow less"], ["Reviewed January 17, 2018", 3.0, "Can say I did it once", "spent the day doing landmarks of LA and we thought the Walk of Fame would be fun. We did it once, but would never go back. You see one star.....you have seen them all. If a celebrity was actually getting a star that day it would be exciting.\nWhile walking along the street we were accosted several times with people selling CDs.\nvery aggressive panhandling and none of us felt comfortable. we took some photos at Graumans Chinese Theater but didnt go in to see a show. we then decided to visit the wax museum along the same street. very expensive and not nearly as good as the one in SF. We were glad we experienced it but didnt stay long. For me, not impressed enough to ever go back.\nShow less"], ["Reviewed January 17, 2018", 2.0, "Underwhelming", "It was great to see the star lined street and to find some of your favorite stars. It is basically several sidewalks that have huge crowds walking up and down them so I found myself stopping in the middle of people trying to walk to get a glimpse and picture of some of the star who's names caught my eye. It is so iconic that I felt I had to go and see it and I am glad I did (saw the hand and foot prints of the start in front of the TLC theater at the same time). I have no need to go back. it is an unattractive part of LA and full of tourist crowds. If you are going to go I suggest going early and making your time walking around short and sweet.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Worth a visit!", "It's nice to walk around and look at the stars on the Walk of Fame! It's one of those 'touristy' things to do in Hollywood, but fun none the less. You can walk for quite awhile, the stars go on and on.\n\nThe only thing I didn't like, was that area on Hollywood Blvd. I found it to be dirty, with garbage on the street. Sometimes you can be approached by 'interesting' people. Not the most appealing area.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Fun", "Always great to see the stars on Hollywood Blvd. Hard to find the ones you want to see but there is an App for that."], ["Reviewed January 15, 2018", 5.0, "Goes forever", "It was very interesting seeing all the Stars along The Walk of Fame, But I didn't realise that they actually have to pay to have a star with their name on it, I just thought they were given to famous people, it goes on for Klms and very interesting seeing all the old actors along the way.\nShow less"], ["Reviewed January 15, 2018", 3.0, "Expect the unexpected!", "So for years on TV, I have seen the Hollywood Walk of Fame, and had formulated a very definitive opinion of what I would see. The surprising part is it was quite a bit different then I had expected. I would characterize this as somewhat of a people adventure, where the people hanging around on a typical day will provide much more entertainment then anything else.\n\nI saw and experienced more interesting people in touring this area of Hollywood then anywhere else. And needless to say none of them were famous.\n\nAlso consider the level of adventure based on the time of day, after 10:00 at night it gets really interesting. All in all we were safe, and had lots to talk about after spending a couple of days off and on in this area of Hollywood.\nShow less"], ["Reviewed January 15, 2018", 1.0, "Dirty", "I was blown away with the feeling of how dirty everything was with garbage In The streets and trash everywhere. Also felt very unsafe with amount of strange people and lack of police presence at a tourist attraction. Parking limited and a good ways away. Make sure to visit this place during the day for safety reasons and in groups.\nShow less"], ["Reviewed January 15, 2018", 2.0, "Interesting", "We visited in Jan 2018 and was I surprised. I didn't read up on any reviews of Hollywood prior to visiting the walk of Fame, so I had no expectations but it was so dirty, people on the street every 20 metres asking you if you want to go on a tour and people trying to sell you CDs and dvds. I couldn't get out of there quicker. The times that we were left alone it was interesting to see all the names on the stars.\nShow less"], ["Reviewed January 14, 2018", 5.0, "EXCITING", "Holidaying in your country with wife for 2 months. First in 2013 & now 2017. Both times stayed at Loews Hollywood which is right on the doorsteps of walk of fame. LOVED walking in the different areas to see the different stars exciting to see stars of people I grew up watching on TV, listening to on the radio. Lots of stars I don't know so finding out information on these people & how the affected their industry. Goes on for miles even down near Capitol Records building. Never have found a place that has the complete map that tells you what streets/roads particular stars are situated on. Still haven't seem them all. Hoping to get back there again one day.\nShow less"], ["Reviewed January 14, 2018", 2.0, "Average", "On a sunny day not bad to go for a walk here but it’s not a very appealing street. A lot of the people on the star are unknown to me. I guess the stars who are on it are vain enough to pay for it. Its a bit of fun to walk around and perhaps see some stars of famous people but it had a vibe of poverty on the shops, streets and people. Busiest place was around the chinese theatre but it didnt feel special. Theres a quiet mall next to it and then you can walk quickly back to the metro and get out of there.\n\nWould not come here again.\nShow less"], ["Reviewed January 14, 2018", 5.0, "My self-guided hike", "Yes, it is a bit of a hike, so wear comfortable shoes. I decided on doing this in the middle of the week to avoid crowds and I'm glad I did. There was plenty to see and the food smelled great, as I looked for familiar names on the stars. Of course, you have to be cautious of opportunists, looking to make a buck and you will see homeless people on the sidewalk, too. All that glitters, isn't gold.\nShow less"], ["Reviewed January 14, 2018", 3.0, "Worth seeing but underwhelming", "Spent over an hour walking and reading the names on the stars.\n\nIt was great at first but there is really a lot of people that you don’t know and your kids will not know and therefore perhaps not great for the whole family.\n\nWas surprised that some actors had more then one star, not sure why that is.\n\nWe did the walk early afternoon and as we progressed down Hollywood Boulevard, the crazies appeared. We did not feel threatened and were not approached by any but we still felt a little unsafe.\n\nVery touristy and hence the push from tour guides whilst you are walking but they were ok.\n\nDefinitely worth a look. I think the tip for early in the day is the best.\nShow less"], ["Reviewed January 13, 2018", 3.0, "A bit disappointed!", "So obviously we had to visit the famous walk of fame whilst in LA just to see the stars. However it was so greatly disappointing firstly the place is just packed with people you can't even see the\nFloor and it's so dirty everywhere it's just constantly stunk of old rubbish bins. It's great to see the Chinese theatre it I would recommend just driving the strip instead of walking around- I Felt like I needed a good wash after being here!\nShow less"], ["Reviewed January 13, 2018", 4.0, "All your Hollywood Dream!", "A full 1-mile route each way and be prepared to walk. It is often nice to try to find the Stars that you love to have the photos taken with. There are many buskers and costumed personnel which do expect small tip if you want photos taken with them - for this, do be aware not to take photos of them without their permission. Always ask if you want to!\nShow less"], ["Reviewed January 13, 2018", 3.0, "Friends looking at friends", "Hollywood is kind of interesting if you walk on the famous Stars.... Other than that it is just like anywhere in LA..."], ["Reviewed January 13, 2018", 4.0, "Busy and Fun", "This was my first time in California and I had to most definitely visit the walk of fame. First of all just be prepared because the streets and sidewalks are very very crowded and busy! My wife and I Participated in a walking tour which was very informal and we also enjoyed many shopping malls and stores on the strips. There is a lot to see and street performers come out at night. Don’t be afraid of the bums just keep it moving when you feel afraid. It’s just like any other big city , huge, busy, people trying to sell you things, good food and selfies. It’s the Experience that counts!!! Have fun and make sure to ride at least one double decker bus.\nShow less"], ["Reviewed January 13, 2018", 2.0, "Walk of fame", "It definitely isn’t what I expected, nothing glamorous about it.\n\nAt night I felt very uncomfortable and not at ease, the day was better, lots of homeless people on the walk of fame, made me feel sad.\n\nThe best time too walk, the walk of fame is early morning when there isn’t so many people.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Reminds me of Times Square (for all the wrong reasons).", "It was cool to see, and I was surprised that some people had more than one star. Be prepared to be hassled for tours, mixtapes, and pictures from the random people walking up and down the street. Maybe an hour at most. Very touristy."], ["Reviewed January 13, 2018", 4.0, "Start of day long trip.", "Enjoyed seeing the stars, theaters, etc. We were there early (before 9am). Some 'unsavory characters."], ["Reviewed January 13, 2018", 5.0, "Must see", "The walk of fame is a must see site in LA. It’s great to see so many celebrities and their star achievement. Don’t forget the 1 star which isn’t in the ground. Can you guess who? Overall a good site to see. The area is very busy and can get crowded.\nShow less"], ["Reviewed January 13, 2018", 3.0, "An honour for them, dirty and average for you", "While I'm sure it is a great honour for the celebs to be given a star, the actual area is filthy and crowded and while it was fun spotting names as you walked down the street I wouldn't plan on making this an actual activity for the day. I didn't expect much and wasn't disappointed.\nShow less"], ["Reviewed January 12, 2018", 3.0, "Worth a visit - but once only", "We had visited previously on another trip, however, one of our group had not been to the walk of fame ......,\nIt was a very busy Saturday and not really that much to see ...... shopping is Ok is you want souvenirs or clothes - especially sports\nShow less"], ["Reviewed January 12, 2018", 4.0, "More than I anticipated", "A fun jaunt down memory lane - filled with names you know and names you feel you should know. I wouldn't go to the area for just this but it was fun to get my boys pictures by Kermit the Frog's star. A silly and fun addition to a crazy street.\nShow less"], ["Reviewed January 12, 2018", 3.0, "Lots of Stars, but only of the sidewalk.", "Too many people gathered in one place. But while using the Metro early one morning we did notice there wasn’t as much people.\nThere’s a few street hawkers which you should try to avoid or have a chat to if you have time. They are interesting people who are in LA LA Land trying to make their dreams come true.\nShow less"], ["Reviewed January 12, 2018", 2.0, "Disappointing to say the least.", "Visited this location as part of a guided trip and was looking forward to it as a big film fan. It was a massive disappointment. The stars are laid out on both sides of the street and lead down side streets as well but there appears to be no care taken with their layout. They are placed facing different directions and many of them are cracked, broken and appear disowned as there appears to have been no upkeep on them (despite this being part of the cost of having one in the first place). The area didn't contain many points of interest for myself outside of the Chinese theatre and the street appeared to be filled with people either begging or shouting abuse at tourists.\nThere are many gift shops and a few restaurants in the area but this is not the most pleasant of areas for the walk itself.\nShow less"], ["Reviewed January 12, 2018", 4.0, "Must see", "This is a must see if you're in the area. There are more stars on the north side of the street than the south side. I'd recommend visiting in the morning rather than the afternoon. We got down there at 9:30 before the TMZ tour and the streets were pretty quiet. By the time we returned around noon, the streets were so crowded you could hardly walk around, let alone take a picture next to a star. Poor Donald Trump's star was all defaced and people were stepping on it in disgrace.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Exciting place", "My family and I went to Disneyland for our sons 5th birthday and then we went Hollywood. Hollywood was exciting, very vibrant and lively. Hollywood Walk of Fame is unique experience. While walking on famous Walk of Fame we often stop to take pictures of our famous stars. There is plenty of shops and restaurants. If you are in LA area you should visit this place.\nShow less"], ["Reviewed January 11, 2018", 5.0, "A Trip Down Memory Lane", "Connect the stars with your memories, Hollywood is in a rebirth. Spend a day walking Hollywood Blvd. and experiencing the visitors and the locals. Be wary of the street life while watching their interaction with tourists. The boulevard can be reached by subway from Union Station to avoid the parking. Have lunch or Dinner at 100 year old Musso & Frank's. Walk the Hollywood Roosevelt hotel lobby for a taste of the old days, it has been wonderfully restored.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Just a street with the stars", "When you think of Hollywood you think of the walk of fame but once you are there it is just a street with the stars."], ["Reviewed January 11, 2018", 3.0, "Not Beverley Hills, but still worth a couple hours", "First, for the uninitiated, Hollywood is NOT Beverly Hills. Don't expect glitz, glamour, fancy stores and stars. Hollywood lost it's glamour in the 1940's and has not completely recovered since. Expect tourist traps and seedy stores. However, Hollywood DOES have the movie industry history. If you can accept the seedy side of it, it's a fun couple hours viewing the stars on the sidewalk and finding your favorites, averting your kids' eyes from some of Hollywood's more risque offerings. Defintely stop at the Chinese Theater and fight the crowds to see the stars' foot and hand prints. Jackie Chan even left a nose print! Many famous movie and stage theaters are there, such as the Chinese, El Capitan, Dolby and the Pantages. Parking is easily found at the multiple parking lots on the side streets. Also a good departure point for tours of the stars' homes.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Fun with Stars", "Lots of Fun, walking from beginning to end on a round trip through out Hollywood Blvd. and finding the honorable stars from people that we liked the most, and getting excited about it.\nPhotograph trip, history of the city, fascinating stores, restaurants, graffiti will keep you busy for about three hours, in a slow pace, almost 3 miles round trip with 2600 + stars to enjoy.\nShow less"], ["Reviewed January 11, 2018", 3.0, "an icon that may be past its prime and time", "once on the must-see list of anyone visiting los angeles, the Hollywood Walk of Fame is a shell of what it once was. No longer does the area hold the allure of hollywood, it more closely resembles bourbon street with its dive bars, street performers, and people hocking wares.\n\nthis is a shame since when you do take the time to walk down and see the many past (and current) names, it is pretty humbling and fun to recite the films, songs, or shows that person was known for.\n\nif go, avoid the summer when the heat, smells, and crowds can be overwhelming. also, as it can be a little dirty may want to consider donning a CDC Level 4 Hazmat suit if place a part of your body on a particular star.\n\nwhen i bring visitors, i prefer early fall or winter mornings or just after a rainstorm, where the air and streets are cleaner and quieter and one can glimpse what this once was.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Great Tourist spot", "The Hollywood walk of fame is quite busy over the weekend but a must visit if your destination is Hollywood"], ["Reviewed January 11, 2018", 2.0, "Waste of time", "Not what I was expecting. Just a badly maintenanced street where homeless asked for money and people tried to sell you staff."], ["Reviewed January 10, 2018", 5.0, "What a place !!", "I was told by my travel agent that I wouldn’t need more than a day as it’s quite boring ..well it was fun and alive and never boring I spend most nights just walking Around , Johnny rockets , hooters , the Hard Rock Cafe & Popeyes chicken were all amazing places to eat as we don’t have them in Australia\nHollywood & hyland shopping centre !! Lots of cinemas and wax museums, pretty woman apartment is just off it if your a fan !!\nJust beware of rappers trying to give you there cds as they will ask for a tip and can we very pushy , also anyone dressed up will say yes to a pic then ask for a tip !! Visit the Hollywood museum I’d you love old Hollywood !! Lots of tours leave from here :)\nShow less"], ["Reviewed January 10, 2018", 3.0, "A bit disappointed!!", "Maybe I’d got the wrong end of the stick- but I was imagining a glamorous road with beautiful buildings and lights... kind of what you see on the tv. But instead we were greeted by a normal road, with sooo many homeless asking for money, and people trying to sell us tours and tickets. It was hard to see the names due to all the people and often, if you stopped to take a photo, you’d be immediately approached by someone asking for money. I’m afraid in the end we stopped looking and just carried on matching! The hand/foot prints outside the Chinese theatre was fab though!!\nShow less"], ["Reviewed January 10, 2018", 3.0, "This is like the Times Square of LA", "I really wish I could have enjoyed myself here more. The first problem for us was that we were with another couple and they were very high maintenance. If going to this place I suggest just going with one person, or having a plan on how to navigate it. There are people EVERYWHERE and there are also people trying to sell you stuff on the streets everywhere. The stars in themselves are very cool and I would go back to see a couple peoples, but I would definitely only go with one other person and I would have a solid game plan to tackle this crazy tourist attraction.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Very Crowded", "It is actually what you expect. A crowded sidewalk with all of the movie stars you want to see. After a while you lose interest in the stars. With all of the tourists and the double decker buses it is a busy place."]]}}