{"Huntington Beach Pier": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Huntington Beach Pier", "url": "/Attraction_Review-g32513-d3309900-Reviews-Huntington_Beach_Pier-Huntington_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/fd/7b/d3/huntington-beach-pier.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1942"}, "address": {"@type": "PostalAddress", "streetAddress": "315 Pacific Coast Hwy", "addressLocality": "Huntington Beach", "addressRegion": "California", "postalCode": "92648-5161", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "At last, the Pacific Ocean", "Beautiful and refreshing. Great long pier with Rosie’s restaurant at the end. Beautiful day, beautiful walk"], ["Reviewed 5 days ago", 5.0, "Nice Pier along the beach", "This is a nice pier on a nice beach.There are little diner at the end of the pier.. Pier offered lovely views. There are fishing spots. There are toilets facilities and a few souvenir shops. It is great for a nice walk with a beautiful view of the beach and sea, but it was cold and windy.\nShow less"], ["Reviewed 6 days ago", 5.0, "Hb", "Nice beach, good atmosphere. Not that crowded in february, plenty of places to eat or shop in the area. Parking was pretty easy, but im assuming thats due to it being F February."], ["Reviewed 1 week ago", 5.0, "WOW!", "Probably this is the most beautiful Pier area in the whole L.A. area. It is cool because here you can meet nice and friendly people. It is not posh as in Newport Beach and you can even surf really crazy! I recommend to visit this area!\nShow less"], ["Reviewed 1 week ago", 4.0, "nice pier, not a lot to do, but good views", "There isn't a ton to do at this pier, but it's cool and has some nice views of the ocean and surfers."], ["Reviewed 1 week ago", 5.0, "Beautiful", "Such a nice place to walk. Great views. Fun local shops nearby. Lots of places to eat. The shopping mall is worth the walk thru. Lots of nice shops & very reasonably priced."], ["Reviewed 1 week ago", 5.0, "A sunny retreat!", "staying in a nearby hotel, it was clean, open and friendly as well as safe. a warm atmosphere with so many facilities and everyone having a good time! :)"], ["Reviewed 1 week ago", 5.0, "Nice area to visit - Great Views and Food", "The Pier area at Huntington beach and surrounding area have lots of great restaurants and nice views"], ["Reviewed 1 week ago", 5.0, "Great view at night time", "Long beach pier with a icecream parlor at the end, aslo view of a few oil platforms. Best view are at night time when you can see the lights of the city and the lights of the oil platforms"], ["Reviewed 2 weeks ago", 5.0, "Beautiful", "This is a lovely pier on a lovely beach. With a lovely little diner at the end called ruby's. Pier offered lovely views. Fishing spots. Toilets and a few souvenir shops. Nice walk with a perfect view of the beach and sea"], ["Reviewed 3 weeks ago", 4.0, "Pacific Ocean Experience", "The Huntington Beach pier is a must see location when you visit the city. It is located at the intersection of Pacific Coast Highway and Main Street. The pier receives thousands of visitors every year. It is a sturdy concrete pier that extends well out into the Pacific Ocean. It is not unusual to see multiple fishermen pulling in fish over the rail. There is a restaurant at the end of the Pier which offers an excellent indoor experience which provides views of the coast as it wraps around from Long Beach to the North, to Laguna Beach to the South.\n\nYou have an unobstructed view of the coast of Newport Beach boats exiting the harbor. Full blown luxury yachts motor up and down the coast. Aircraft routinely fly up and down the coast. The beaches are easily in view from Seal Beach to Costa Mesa.\n\nVendors line the pier up to the point that the pier goes over the ocean. Under the pier is a great place to grab some shade. Every year there are functions such as the World Surfing Championships because of the great waves for surfers. On the pier, you have a unique view as if your were out on a boat watching the surfers ride. Life guards protect the beach visitors from everything from rip currents to sting ray stings and medical emergencies.\n\nThe pier is an extension of Main Street out into the ocean. Main Street is in direct line of sight containing restaurants, bars, and shopping opportunities. If you are in Southern California, this is an enjoyable must see location. There is ample parking. But, due to large crowds, it is best to arrive early in the morning, park and enjoy the day. If you have visitors from out of town, this is a great place to go. Every 4th of July Huntington Beach has a parade down Main Street. This is a great event with thousands of people. Much of it can be seen from the pier. There is seating next to the pier which gives views of the surfers. Hang loose.\n\nSurf City, U. S. A.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Very nice place!", "Very nice place. Clean and safe. Surfing watching. Great restaurants in the area. Amazing beach and friendly people"], ["Reviewed 3 weeks ago", 5.0, "Lots of tourists with selfie sticks....", "I love going here, minus all the tourists with their selfie sticks. It's a nice walk down the pier, and a great view of the surfers and waves."], ["Reviewed 3 weeks ago", 3.0, "It's a pier. It's on the beach.", "What can I say? It's a pier on the beach. There are some cheapo souvenir shops on the pier but it's good exercise if nothing else."], ["Reviewed 3 weeks ago", 5.0, "Family friendly beach", "We had never been to Huntington Beach and Pier before. The parking is very good and reasonable in price. The pier is a nice stroll, with a few shops some places to eat. The sand is soft and we thought the beach was pretty clean as well. Plenty of waves to have fun in and watch surfers.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing view", "This is a great place to see the waves and the surfers enjoying the sea. And appreciate the sunset, the scene is really impressive and amazing."], ["Reviewed 3 weeks ago", 5.0, "Entertaining on so many levels. Always great!", "How can you not like a huge elevated platform that sticks out into the ocean? The Huntington Beach Pier is a village in of itself. It is unbeatable for people watching. In addition, there are several shops to stop into and pick up all sorts of unique items. The sides are lined with men and women fishing and you have a birds eye view of the beach and all the activities there. Just watching the waves is mesmerizing. At the end is Ruby's, a good place for something to eat and the view from there is sensational. On a clear day you are able to see for miles up and down the beach from Seal Beach Pier to Balboa Pier and beyond. Looking out you will see the off shore rigs and Catalina Island. Great for a stroll and enjoying some sun and sea air. \nShow less"], ["Reviewed 4 weeks ago", 5.0, "World class surfing, Ruby's, Jr. Lifeguard Pier Swims, dolphins, and more", "Every visit to the Huntington Beach Pier is a little different. You can catch world-class surfing almost any day. Eat a Rubys. Rent a fishing rod. Watch 100+ the Jr. Lifegaurds swim around the pier in the summer. Buy a kite. Stroll through the Friday market at Pier plaza or Tuesday night street fair. Say hello to a Pelican. Watch dolphins or sea lions swim by. Catch the Air Show in August. Gaze at the sunset. ... and perfect weather almost every day.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Awesome place to go for a walk with your LOVED ONCE)", "Bring your friends,family, co-workers, your favorire dogs r cats, even it can be a parrot)KAKADU)) Will be awesome time to spent at the ocean, gold sandy beach, fresh ocean air and awesome sun) ENJOY..😄😚😙😍😆👼👼👼"], ["Reviewed January 23, 2018", 5.0, "Always a great place for a walk.", "It is always a nice place for a walk. It is a great place to see the sunset and people watch. After that you can walk up main street and enjoy the shops and restaurants."], ["Reviewed January 22, 2018", 5.0, "Beach for the day", "Arrived about 10 am and enjoyed watching the surfers near the pier followed by a long walk along the shore picking up shells. Walked across the highway for fish tacos at Bear Flag Cafe then lounged in our beach chairs. After a long bike ride on the beach bike trail we watched the sunset before strolling along the pier.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great pier", "On any given day you can watch all the surfers ride the waves it is so relaxing. The pier has a wonderful restaurant at the base of the pier. Dukes restaurant has wonderful drinks and great seafood."], ["Reviewed January 21, 2018", 4.0, "Huntinton beach pier", "A pier are always a visit opp. There are life from early morning to late night and for huntinton beach pier are people runs and fishing and just relax."], ["Reviewed January 21, 2018", 4.0, "Beach Visit", "Nice beach tucked away from the hustle and bustle of major beaches. Local law enforcement were very helpful since we were truly turned around trying to find the right area to see everything."], ["Reviewed January 17, 2018", 5.0, "Nice Beach and view", "This is a really nice beach. The Pier was nice. It had a lot of shops and places to eat around it. The beach was beautiful. There was a farmers market on Thursday. Not to crowded since we went on a weekday in the middle of winter but I'm sure it gets busy during the summer. We ate at Duke's they had really good drinks the the hula pie was so yummy! Defiantly would come back!\nShow less"], ["Reviewed January 16, 2018", 4.0, "Great beach along route 1", "We stopped by here while from.malibu to San Diego by road by Pacific state highway 1..nice beach this is on Pacific ocean ..much watch"], ["Reviewed January 15, 2018", 4.0, "Beautiful sunset", "Unbelievably warm weather in January made a walk on the pier a must. There were surfers in the ocean and plenty of people on the beach, playing volleyball and splashing in the waves. There was a drum circle next to the beach and anyone can join in.\nWe were there rather late in the day and were able to catch the beautiful sunset.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Chill Out", "A great walk along this pier to see the girls and guys carving up some great waves. Great to relax with a coffee and just take in the sea air and the atmosphere."], ["Reviewed January 12, 2018", 4.0, "Great pier, beautiful view any time of the year", "The Huntington Beach pier is a great place to visit practically all year round. It has a few shops and a Rubys's dinner on the end.\n\nYou can watch surfers and volleyball. Or, just stroll down the 1,850 ft. long pier and enjoy the beautiful pacific ocean.\n\nBeach parking \"may\" be difficult to find in the summer, but there is a large parking structure one block north.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Beautiful December afternoon.", "We went to Huntington beach on our SoCal trip with our grandson. The weather was mild and the surf was up. We walked the pier and had fun watching the surfers and fishermen and a showboat pelican. Had a fun meal at Ruby’s Diner and picked up a few seashells in the surf.\nShow less"], ["Reviewed January 7, 2018", 4.0, "A worthwhile stop to see the scenic Pacific Ocean", "Stopped here while touring the area and it was worth the time. Parked in the metered parking lot (put in more time than usual) and walked out to the farthest point on the pier. An interesting view from there back to the beach. Gives you a good perspective from a surfers view. On this day there were many groups and young kids with parents and friends. Our family always takes the opportunity to tour the various piers we come across during our travels. Huntington Beach Pier was certainly worth the time to stop and visit.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Fun to walk", "Enjoyable to stroll, watch surfers, fishermen and others. Often cool and windy. Lots of places to eat nearby."], ["Reviewed January 5, 2018", 5.0, "Just passing through", "Good family day watching volleyball players and surfers. The peir was long and fun to walk. There was alot happening on a Thursday. It was fum warching the surfers and volleyball games."], ["Reviewed January 5, 2018", 5.0, "Old timer", "A must if you visit Huntington beach! Fishing off the pier. Rubies dinner for good burgers and shakes and don't forget the frys."], ["Reviewed January 3, 2018", 5.0, "beautiful", "this was a great place to go for the day. we took a day trip here on our recent trip to southern California, and we were not disappointed,. this really is surf city... we were there on a Wednesday and it was full of surfers. it was a definite highlight for us to be able to walk along this beautiful pier and watch the surfers. very family friendly!!! there is a lovely restaurant at the end called ruby's diner where we stopped for lunch.. it is a must do and has the best views of the ocean if you can get a table on the second level... also there are a few shops along the pier selling the typical souvenirs.. sone even made in California... do give it a go it is a lovely way to spend a day!!!\nShow less"], ["Reviewed January 3, 2018", 5.0, "HB Pier", "A walk down the pier is a must for any traveler and local alike,watch the surfing action up close!!!"], ["Reviewed January 3, 2018", 4.0, "Nice", "Very nice and enjoyable attraction, really fun to see.Definitely a good place to enjoy the California sun with friends and family. Definitely a must see . Would highly recommend. Check it out soon."], ["Reviewed January 3, 2018", 5.0, "Stroll above the surf", "Great place to enjoy the ocean and meet interesting local characters. I stood leaning against the rail watching the surf and it was blissful."], ["Reviewed January 1, 2018", 5.0, "Iconic California", "The red roof of Ruby's Restaurant situated at the end of the Pier can be seen for miles out on the ocean, and is a landmark now of Huntington Beach. Walking the Pier or surfing under it, it is a great spot to relax, buy a kite at the famous pier kite shop, people watch and enjoy the world-class surfers below.\nShow less"], ["Reviewed December 31, 2017", 2.0, "Nice enough beach but lack of restrooms ruined it.", "Pier and beach were nice enough, but nothing to write home about. What runied it for me was the lack of decent public restrooms. The only two locations I could find were too disgusting for me to let my young kids use. Even tried queuing for a coffee in order to use theirs but even their restrooms were closed. It was all a bit 3rd world.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Excellent view", "the walk at the pier is superb indeed. not only you have nice view of the Pacific Ocean, but the variety of shops and art displays is excellent"], ["Reviewed December 30, 2017", 4.0, "Great for a stroll or to take in the view", "Lots of piers here in Southern California, but this ranks as one of the best for 1) being clean, 2) not mobbed with people, 3) the view. Great place to stroll after lunch or dinner at Duke's, or just to take in the sunset."], ["Reviewed December 30, 2017", 4.0, "Conveniently located", "We chose Huntington Beach this time because it is the most conveniently located beach to the Disneyland Resort. Are there prettier beaches in the OC? Without question. But Huntington offers giant sandy beaches all without fighting the California freeways. Just head west on Katella and make a left onto Beach Boulevard. It goes straight to the Pacific. The water was still a bit chilly in mid-May, but then again the Pacific is always a bit chilly. There were plenty of folks out enjoying the waves.\n\nWe parked at the city park and walked over to the pier, a bit of a hike to be sure but plenty to see along the way. There are ice cream shops and a burger joint, and plenty more places to eat and shop across the PCH. The pier itself was fun. There was a surfing competition going on at the time. It definitely did not have that safe, Disneyland vibe as there were a few homeless people (who left visitors alone) and some solicitors for various charities (who did not leave visitors alone).\n\nThere were some neat souvenir shops on the pier. The vendors were very laid back and friendly (one of the reasons we love California). There is a diner at the end of the pier that we would have liked to try, but we had already filled up on the walk to the pier.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Great beach", "Huntington Beach is a great beach with lots of places to shop and eat. You can rent boards for surfing, or shop all day."], ["Reviewed December 22, 2017", 5.0, "Beautiful!", "We walked the pier after dinner at Duke's. Great place with great views. A wonderful walk indeed. Take advantage of it."], ["Reviewed December 21, 2017", 4.0, "Movie place", "This is the place you would see on several movies, its a good exercise/walk. Wear shoes to walk, so you can enjoy the view."], ["Reviewed December 21, 2017", 4.0, "Great place to lay out, eat or site see", "The pier is a fun place to see the beach and ocean. There are normally people surfing, fishing, walking and just sitting around. There is a Ruby’s restaurant on the end of the pier with decent food at a higher price."], ["Reviewed December 21, 2017", 5.0, "Great place for a stroll on a sunny afternoon", "On the trip down the pier you can watch volley ball on the sand, surfers riding the waves, maybe see some dolphins swimming in the ocean, then get some lunch at Ruby's at the end of the pier"], ["Reviewed December 19, 2017", 5.0, "It's a fun place to visit", "Come on a 4th of July. There are so much things to see and enjoy. They have fireworks, fly a kite, surfing, parade and just to hang out with the family on a warm sunny California day."], ["Reviewed December 17, 2017", 4.0, "Nice pier with fairly limited amenities.", "We walked out on the pier a couple of times, once at night. Beautiful views with a couple of restaurants. Nothing particularly noteworthy."], ["Reviewed December 10, 2017", 5.0, "GREAT WAVES", "it may have a lot of people but there is so much beach you have all of the room in the world! great waves for surfing and for kids with boogie boards. volleyball, food, and a beautiful view off of the pier. water is not clear, but is still great. shells available every where, i am not sure if that is OK to take them..so do some research before hand if you are wanting to grab a souvenir.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Historic Must See", "Anyone visiting Southern California needs to visit Surf City Huntington Beach and walk the pier. This Pier is full of history and has been rebuilt a few times because of damage from storms, etc. From the pier you'll get an excellent view of surfers on one side and body boarders on the other. On the pier is a little shop and a Ruby's diner at the end. This is also a location for fisherman to fish and couples/families to take a nice stroll. We actually saw a pelican up close and personal during our most recent visit. Be sure to bring quarters for the meters or money for the parking structure.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Pier Only 1 mile from Our Home", "Walked the pier many times. Some actually fished off the end. Restaurant there also. Beautiful, serene views."], ["Reviewed December 7, 2017", 4.0, "A must-do in Huntington Beach!", "Great views of sunset, small shops, acoustic artists - loved the vibe! Check out surfers on both sides of pier. Right by Main Street, easy to access."], ["Reviewed December 6, 2017", 5.0, "Great place to sit and relax", "Went on a Sunday to get the kids out of the house. Parking about $2 an hour if you park on the street. If you park in the beach, it's $15 for all day.\nThere's a restaurant called Duke's at the beginning of the pier and at the end is a Ruby's. I'd suggest Duke's if you've got the cash. Way better food than Ruby's.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Best pier in Southern California", "Best pier in Southern California. Surfing, fishing, gawking, and eating. It has it all. Good parking and the fun downtown attractions, bars, and restaurants are steps away. Awesome."], ["Reviewed November 30, 2017", 5.0, "It’s a pier!!", "Very substantial structure extending Main Street into the Pacific.\n\nCouple of retail outlets along the length, a restaurant on the end and public toilets.\n\nLots of people walking the pier, surfers in abundance on both sides several fishermen using it..... clearly this is a much loved local attraction.\n\nIf you’re in Huntington is a must.....\nShow less"], ["Reviewed November 30, 2017", 4.0, "Great Pier!", "This one is huge and has a few shops and a Ruby's on the end. We went to Doc's which is on the beginning of the pier and had a blast."], ["Reviewed November 26, 2017", 5.0, "Probably the best beach in OC", "Nice beach with lots of stores, rentals shops and good surfing spots. Must visit place in California."], ["Reviewed November 26, 2017", 5.0, "Sit, Relax, People Watch", "We parked on Main Street and walked the Huntington Beach Pier in the morning. It was very enjoyable. We watched surfers, fisherman and got to see a pelican up close and personal. It's a really nice spot to sit, relax and people watch."], ["Reviewed November 26, 2017", 4.0, "Fisherpeople and surfers", "It's not Santa Monica Pier by any means (and that's a good thing). $1.50/hour to park in the nearby lot, and the pier is a nice walk on a warm and breezy day (even on Thanksgiving!). A couple of shops selling beach type stuff halfway down. Bathrooms (we didn't try them) and Ruby's at the edge selling beach type meals.\n\nLots of folks fishing (and catching!) from the pier, tons of surfers to watch. Every now and then you see dolphins, too. Plenty of benches to sit and rest on, as well.\nShow less"], ["Reviewed November 24, 2017", 4.0, "Wildlife and surfers", "It was a beautiful sunny (but windy) day in early October. Our conference was over so some friends and I walked to the pier from the Huntington Beach resort and strolled out on the pier. It was crowded but pleasant. Fun to watch the surfers! I stopped to buy a gift at the giftshop on the pier. Caught a pelican posing for tourist snapshots. Fun day.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Besutiful", "This is a great beach in California. It has an active pier with shops and a Ruby's at the end. It has restaurants at the front of the pier. Beach city around it with shopping and theaters. Beach house rentals that looked amazing. Can have fires on the beach. Great sand and surf. Good sized waves with surfers out. Everything there to rent and surf as well. Shells for those strolling the beach. Clean and beautiful. Easy for those with smaller kids wanting to walk and play. Volleyball courts set up as well.\nShow less"], ["Reviewed November 20, 2017", 5.0, "fam time", "Beach, Parks, etc. Went all around. LA is great. The weather is a break from Chicago. Love the shopping."], ["Reviewed November 18, 2017", 4.0, "Beautiful sunset", "First day in LA we went to the Huntington Beach Pier. Long walk but beautiful scenery. Pretty cool to watch people surfing from the pier."], ["Reviewed November 18, 2017", 5.0, "Best OC pier", "Always a great place to go or to take out of town friends or relatives. Lots of activities especially on weekends and holidays. Christmas decorations will be up soon and they are great at night"], ["Reviewed November 16, 2017", 5.0, "A true Californian icon", "In California it is easy to take the beach for granted. After all, there are literally miles of sand. And its relatively easy to get to it.\n\nBut, Huntington Beach has history, and its worth spending time here because it connects strongly to that great American, and Californian myth of destiny and settling down.\n\nWhen you 'go west' you end up at Santa Monica, Venice, Ventura or Huntington Beach. They are all wonderful places, but each have their own character. Huntington Beach is a surfing beach. Historically it belonged to a small group of kids who threw themselves into the waves. Of course the surfers are still here, and some of the great surfing competitions in the world are hosted here.\n\nBut, as with so many mythic destinations, most people who come here are those following a guide book. Something must be here because the guide book says it must be. And it is, but just don't think it is merely the sand, or merely the ocean, or merely the pier, or merely the town. Without a life these are just words on a page of a guidebook.\n\nDoes this mean you shouldn't visit? No, of course not!! You must come to the beach and walk the pier. You must eat at Ruby's at the end of the pier.\n\nBut you should also spend time watching the people. In amongst the hordes of visitors you will see the locals, or the connected, or the surreal. They are surfers, or walkers, or something designated as 'homeless', or fishers, or walkers. These folk are not visitors, they are intricately part of Huntington Beach. If you ever get the chance introduce yourself. But do this with care and respect. You, the visitor, are standing in their living room, or patio or kitchen and as such, you need to be respectful.\n\nOne day we were there the Blue Angels gave an air display that was quite literally earth-shattering and mind-boggling. Somehow this just fitted right into the whole context of what makes Huntington Beach special. I especially loved the fact that many of the 'locals' didn't even bother looking at the jet fighters as they screamed overhead.\n\nGo there and see if you can sight the original California.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Friendly Californians", "I loved this beach albeit you need to watch the waves with young kids.\nThey can be quite strong. One of the cleanest beaches I have been to in a long time.\nThe views are spectacular, couldn't fault the pier nor the beach.\n\nWe met some of the most friendly people (locals).\n\nWell Done Huntington Beach!\nShow less"], ["Reviewed November 13, 2017", 4.0, "Great sunset view", "I loved this beach. It has a long side walk one could ride a bike on. There are fire pits that families were using to seat around during the sunset. The waves were great and not too rough so it is totally swimmable. The restrooms were clean and toilet paper was available. The shower rinse outs are outside. Plenty of sand to run around on and is a pretty long beach.\n\nThe parking is $15dlls per car. I didnt like that cause we were only there to watch the susnet and there was no other option to park but if I was to spens the entire day there then I would not mind paying.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Sand galore and ocean 🌊 to match", "This resort is beautiful we visited it both day and night , if wanting a chill day out this place is it. Has tourists from the UK on our road trip this place was the spot for some relaxation, mesmerising seeing the surfers riding the waves , the beach was very clean and if having a dip in the ocean you felt safe has there were plenty of Life Guard Stations . It’s child friendly and the pier is lovely , plenty of people fishing from it. The resort itself has lots to offer plenty of eating establishments and shops galore, if I ever did a road trip again I would definitely stay here\nShow less"], ["Reviewed November 11, 2017", 5.0, "Great Views", "This pier is nice to walk down and there is a restaurant at the end of the pier called Ruby's. The food is pretty good but the view is better. It is a hamburger place and very casual. Go out and watch the waves and even the surfers. There is even a gift shop on the pier that sells some cute stuff. There a some really good restaurants right next to the pier with great views as well as an area to sit and watch people.\nShow less"], ["Reviewed November 11, 2017", 3.0, "Visit to Huntington Beach", "My wife and I along with another couple recently visited Huntington Beach on our way from LA to San Diego. The beach and pier was a nice scenic walk. You can watch surfing and volleyball on the beach. We enjoyed our visit and would like to return when we have more time.\nShow less"], ["Reviewed November 11, 2017", 3.0, "A great view and pretty ocean views", "Such a pretty view but so dirty. People fishing and seagulls everywhere. Dodging them as you walk can be tricky! Some vendors too that are along the walk"], ["Reviewed November 11, 2017", 2.0, "better places to see", "If your a old bored retired local this place is for you, if you have never seen a pier with nothing to do you will love it, Skip this one"], ["Reviewed November 10, 2017", 4.0, "Beautiful views", "A lovely way to experience the ocean and view the surfers. Great views of the coastline. Access to plenty of restaurants. Nice and long. Makes for a great stroll any time off day or evening."], ["Reviewed November 10, 2017", 5.0, "HB OP Pro spot", "there is a small reef at the end of the pier with a great 2 story restaurant and retailers on and off the pier attached to main street and new pacific city. lots of bars and retailers and hotels all walking distance. parking is kind of expensive unless you look a few streets over for non metered parking. was rebuilt multiple times from massive pacific storms bringing in 20+ foot waves. pier was rebuilt after the huge storms of 2007-2008. surf is good on both north and south sides of the pier with two breaks one inside and one outside. not uncommon to see sea life like seals, dolphins and even a few sharks are spotted. fishing is different just about every day, check reports for tides and anchovy runs in the area. swell also list the tides for best fishing and surfing times. can get very busy on weekends.\nShow less"], ["Reviewed November 10, 2017", 3.0, "Beautiful Beach", "You get to see a long way down the beach from the pier. A lot to see--surfing, swimming, and people enjoying the beach. A couple of small shops along the way. Ruby's has good food. The bathrooms were awful along the pier!"], ["Reviewed November 9, 2017", 5.0, "Iconic Pier overlooking Surf Cities awesome waves", "If you are driving through or stopping in Huntington Beach, you have to set aside at least an hour to walk out on the HB Pier. Visit the art faire on pier plaza, walk out to the end of the pier to visit and dine at Ruby's and if you lucky see dolphins and possibly a whale. On the stroll back, be sure to watch the surfers!\nShow less"], ["Reviewed November 8, 2017", 4.0, "Very few shops. Most closed weekdays.", "Enjoyed the walk down the pier. Watched surfers and volleyball players. Even saw some dolphins. Very few shops. And one wasn’t open weekdays. Ruby’s at the end of the pier is worth the walk. Good prices and the beignets..... wow."], ["Reviewed November 7, 2017", 5.0, "A Beautiful Beach", "One of the nicest beaches in California. At the end of the pier, there is a restaurant. Which I thought was pretty cool. Every Tuesday they have old school freestyle BMX riders performing flatland stunts. There is also a nice shopping and eating area as well.\nShow less"], ["Reviewed November 6, 2017", 4.0, "One of the longest public piers on the west coast", "We visited Huntington and the Huntington Beach Pier during our beaches tour of the area with Anaheim Tour Company.\n\nThis pier is one of the longest public piers on the West Coast California and is on the Register of Historical Resources to preserve this attraction.\n\nThere are two restaurants at the base of the pier called Duke's and Sandy's Beach Grill.\n\nWe an enjoyable walk along the pier and enjoyed the beautiful views and the beautiful beach down below.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Beautiful", "I loved walking on the pier watching the surfers and people fishing. There is plenty of parking and so beautiful."], ["Reviewed November 4, 2017", 5.0, "Great stop!", "This is a great stop. The whole village is very relaxed (surf mekka!) - super stop halfway LA / San Diego. We enjoyed browsing the pier, watching fisherman and surfdudes. The Ruby's at the end of the peer was super busy on the Monday afternoon we passed Huntington.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Beautiful views!", "Not sure which is more beautiful-sunset or sunrise. Both are stunning! Great walking paths along PCH, clean and felt safe. Well worth making an effort to see mother nature’s magic!"], ["Reviewed November 3, 2017", 4.0, "Great perpective of the ocean and the beach from the Pier", "The Pier is very charismatic and adds to the picturesque beach. The walk is good and it offers the best view of the Ocean and the beach. Great spot to see surfers as lots of them gather around. Recommended."], ["Reviewed October 30, 2017", 4.0, "relax on the pier", "I find it very relaxing to take a walk on the pier. The sounds of the waves breaking and the ocean breeze is very calming. You can also grab a bite to eat at one of the many restaurants very near by. There is even a Ruby's on the end of the pier if you feel like burgers. It is really neat to watch the surfers from above it really puts you out there in the ocean with them and I have surfed all my life but is a very different perspective on the pier. The Northside of the pier has a little bigger parking lot.\nShow less"], ["Reviewed October 30, 2017", 4.0, "One of the Best Piers in OC", "The Huntington Beach was rebuilt at the end of the 1980’s after a storm knocked it out. It’s one of the best piers in Orange County. There’s a restaurant at the beginning and one at the end. Ruby’s and a Duke’s. There are souvenir shops on the pier as well. It’s a great spot for watching surfing, after all this is SurfCity USA. Don’t miss the sunset! There’s lots of nearby parking.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Strange Weather", "Stopped here for a break on our way to Carlsbad. We we arrived, the weather was great. It was sunny and the beach was crowed with people. We decided to walk out to the end of the pier. We saw people fishing and surfing. Afterwards we stopped at Sandys.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Great place for a walk", "Lots of surfing and beach to lounge on, but also a wonderful place for a walk. Plenty of metered packing or free parking on the side streets."], ["Reviewed October 25, 2017", 4.0, "Great pier", "Lots of fishing going on...surfing too! Great walk out to the end. Easy stroll from the Hilton or Hyatt hotels."], ["Reviewed October 24, 2017", 5.0, "Really Cool", "We decided to take a stroll 🚶 on the pier after our meal at Duke’s Restaurant. Was able to grab a sense of the local wildlife and culture."], ["Reviewed October 24, 2017", 4.0, "Beautiful Views", "Lovely to take a stroll on and look out to sea. There are a couple of shops at the beginning of the pier, which have some lovely gifts. There is also a diner at the end, which is a superb place to eat and drink."], ["Reviewed October 21, 2017", 3.0, "Great views from the pier!", "Such a beautiful sandy beach.\nEnjoy a walk to the end of the pier and back, stop in the little quirky shops and chat to the fisher-folk that line each side of the pier.\nLots of people about enjoying their Saturday, also a small fair of craft stalls to enjoy walking through and purchasing some extra presents for friends at home.\nSurfers were out enjoying the waves and some swimmers along the shore.\nRestaurants are available close to the main beach area.\nShow less"], ["Reviewed October 20, 2017", 3.0, "Ok if you like to walk", "Not much to see or do. Just a long pier with not many shops or things to see except people fishing. Do it once to say you’ve been to Surf City where there always 2 girls for every boy."], ["Reviewed October 20, 2017", 5.0, "Pier", "We had dinner at a nearby restaurant and then walked the pier after it was very nice. The ocean is beautiful and it gave us a chance to talk as we walked. We saw fishermen and women."], ["Reviewed October 19, 2017", 5.0, "Picture Perfect", "Picture perfect beach pier, makes you think of every movie you've seen and a beach pier with that Californian beach below it."], ["Reviewed October 17, 2017", 5.0, "Cool beach pier", "Walked up the beach pier. It was cool. A few shops. Meet a cool guy at one of them. Talked about a lot of local things to do. Lots of fishing and crabbing."], ["Reviewed October 16, 2017", 4.0, "Sea breeze", "My wife and I frequented the pier area quite a bit Durning our stay in Huntington Beach. It was a great place to get a good view of the surfers."], ["Reviewed October 14, 2017", 4.0, "One of the best beaches around", "Great place for beach life, surfing and restaurants. South of LA and far from the crowd. Well known to surfer for the great wakes. Not far from Long beach."], ["Reviewed October 14, 2017", 4.0, "Nice", "Nice place with a great restaurant at the end Just great to have a walk to the end and back looking at the surfers and fishermen"], ["Reviewed October 12, 2017", 5.0, "Fun place to people watch", "Surfers, swimmers, beach volleyball players - all provided entertainment as they went about their activities - and the ocean and its dramatic waves weren't bad either. There are shops along the pier as well though we were off season a bit and a few were shuttered.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Limited Visit but Good", "We were there during an air show along the beach. It was very crowded and access was limited to only half of the pier but it did provide a really great vantage point to witness the show and the beach."], ["Reviewed October 11, 2017", 5.0, "Beautiful pier-great spot for surfer pics", "Been a while since I've been here but it was beautiful! Loved watching the surfers and perusing the vendors on the boardwalk. :)"], ["Reviewed October 11, 2017", 3.0, "Wasn't impressed", "Its a nice beach but the pier was unimpressive. It was just that...a pier. There were just a handful of souvenir type shops and closer to the end of the pier you can grab a quick bite. Definitely a surfer's beach. Rough waves. Not much else on the actual beach but across from the beach on beach boulevard are many shops, eateries and I spotted a handful of hotels. Very nice for a stroll or lunch/dinner plans. I prefer Laguna Beach myself with is about 20-25 min drive from Huntington. Parking is hard to come by. All paid meter or garage parking in area.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Great location to start your day", "A beautiful walk, specially in good weather, watching the surfers and having breakfast at Ruby's is \"must do\" for first time visitors or for a relaxing day for those who are having a busy itinerary. You will love everything about Huntington beach, specially in the morning. take a moment to stop and watch those surfers, and have your camera with you, you will catch great photos as they are catching the waves.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Surf riders,fishermen, the blue Pacific and a carnival of people every day.", "When the surf is rough, scores of surfers sit out on the waves waiting for the one that will carry them in a graceful ballet of wind, water and motion. Fishermen catch all manner of fish and tourist from everywhere walk back and forth along the pier in a riot of color and motion.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Love this place!", "So I'm leaving a professional conference in Irvine and with nine hours until my flight back east leaves from Long Beach (interesting, fun old) Airport. So I get the inspiration to ride the city bus (OCTA) first to Newport Beach and then up the coast to Long Beach ($2. for an all day pass!!!) And the bus drives through HB and I SEE the ocean and the pier - so I have to jump off the bus - run out to the pier, and catch the sun, cool breeze, \"surfer vibration,\" of SOUTHERN CALIFORNIA dreaming in all its' imagined/perceived glory! (Did I mention that I bought a HB T- shirt at a souvenir shop to take home on the plane for my wife?) Eureka! We have found it!\nShow less"], ["Reviewed October 5, 2017", 5.0, "A must", "If in Huntington Beach you have to visit the pier. Might want to use the bathroom BEFORE you go here though as they are a little rough. The view is spectacular and for me being from the Midwest, the surfers were fun to watch. Great view of the city and the beach.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Love our Pier", "This pier is great, and to top it off there is a Ruby's at the end. They actually have fabulous breakfast's with an unparalleled view of the ocean. People are always fishing at the end, so that can occupy some time watching them, or for more excitement watch the surfers\nShow less"], ["Reviewed October 3, 2017", 5.0, "Beach Trip", "This is a beautiful location where you can walk the pier and watch surfers as well as beach volleyball. There is a restaurant at the end of the pier and lots more within walking distance. There are also some great shops for beach/surf apparel as the place is known as Surf City USA.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Enjoy incredible awesome OC Pacific Ocean views from Huntington Beach Pier - Surfer's Paradise!!!", "I walk the Huntington Beach Pier early mornings daily when visiting my family to watch primarily the surfer's, as well as looking out for dolphins, stingrays, and all forms of oceanic sea creatures and birds that gather around and beyond the end of the pier. This is a must do for me as I enjoy the stroll as well as early morning coffee and breakfast at Ruby's before my longer stroll out onto the beach at the sand and ocean edge in bare feet. What a great way to kick start the day off in awesome epic Huntington Beach with a stroll along the pier, breakfast at Ruby's then a long stroll along the beach to follow. Excellent and #1 attraction on my list for every visit to my family living in this incredible, beautiful location.\nShow less"], ["Reviewed October 3, 2017", 5.0, "A Afternoon stroll down the pier.", "Huntington beach pier is an amazing place to hang out at. You have the fresh sea air, awesome waves, beautiful sandy beaches, and a lot of wonderful people. Plenty to do here whether you come to eat, shop, or just enjoy the scenery. If you come to Southern California to see the beaches, you must stop at the Huntington Beach Pier.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Lovely", "Absolutely lovely! We really enjoyed walking around the pier and all of the friendly people and their doggies. I loved that there were street performers. The views are just stunning."], ["Reviewed October 2, 2017", 5.0, "Summer fun", "We just had the best of times in Huntting beach would recommend it to any family looking for a great holiday"], ["Reviewed October 1, 2017", 5.0, "Great time strolling the pier", "Nice to have a walk around and watch the fishing and surfers. It was also nice that our daughter 5000 miles away in England could watch us live on the pier webcam"], ["Reviewed September 30, 2017", 5.0, "Huntington Beach Air Show", "The Huntington Beach Air Show was held just south of the Huntington Beach Pier. It is a fantastic setting for an airshow. You can hang out on the beach or sit up in the shopping center/hotel area above the beach. It is free but could be best viewed if you have an RV or you book rooms with a view. When the Blue Angels flew over it was so loud and good it makes you proud of some of our tax dollars at work. The show lasted 3 hours but can vary depending on the ocean fog.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Sunset", "This is the one place everyone should watch the sunset it is amazing views and you won't believe how fast it sets."], ["Reviewed September 28, 2017", 5.0, "Unplanned..nice beach", "This was an unexpected shops. Only a few shops on pier but that makes it all the better. The views were awesome.\n\nVery clean beach..plenty of parking at least during the week after 2pm.\n\nThere are three restaurants..one in post and two at the end.\n\nA must see!\nShow less"], ["Reviewed September 24, 2017", 4.0, "Great spot, Rubys is a classic", "after staying across the street at the hyatt we loved nightly walks on the pier. As an orange county native the pier is something that I often drove past but never actually walked down. Its a classic, dont miss it !"], ["Reviewed September 23, 2017", 4.0, "Great Time with Grandson at the Pier", "Beautiful day for a walk on the pier with grandson. As a 5 year old, he was excited by everything. Flying kites, watching surfers and fisherman, a friendly pelican who sat on the rail posing for pictures and all of 'hustle' of the warm end of summer days. For me, GREAT people watching!\nShow less"], ["Reviewed September 22, 2017", 4.0, "Clean and Quaint", "Far from the bussell of Venice Beach and Santa Monica Pier, this place is beautiful and relaxing. Ultra clean and inviting while featuring nice shops and food options I recommend this spot."], ["Reviewed September 22, 2017", 5.0, "\"Surf City, USA\"", "Don't miss the pier at Huntington Beach, CA. We were there on a weekend when vendors had set up all types of crafts. Plus , if you're not trying to catch a wave, you can watch from the pier. Live music right next to the pier and Dukes restaurant is there as well. There is a restaurant at the end of the pier named Ruby's. Cross the street to Main St. Enjoy other restaurant & shops too. Love this place!!\nShow less"], ["Reviewed September 22, 2017", 4.0, "People watching", "Lovely pier to walk along with plenty going on from people walking, skating, running, , fishing, watching surfers or just sitting watching the world go by. A number of shops and restaurants to pass the time. You do have to pay to park but then you can take your time walking the pier and around Huntington Beach for free.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Beautiful Huntington Beach Pier", "Huntington Beach is also named Surf City USA. Recently inducted into the Guinness world records for the largest paddle out in history. The event was called the Circle of Honor. While visiting Huntington Beach make a point to view the sunrise and or the sunset on the pier. Ruby's dinner is located at the very end of the pier and is a great place for family's to eat and watch the waves roll in. Take a stroll on the pier you won't regret it! Aloha\nShow less"], ["Reviewed September 19, 2017", 5.0, "Great Walk on HB Pier", "nice day in mid septenber...slow season. kids and fisherman having a great time. picked up some souvenirs at the pier shop...i was surprised. quality gear at reasonable prices if im in the area...i always stop here for a nice jolt of ocean beauty."], ["Reviewed September 18, 2017", 3.0, "If you like to fish...", "If you enjoy fishing and/or just people watching, this pier is nice and not nearly as crowded as the Santa Monica Pier. Much more laid back and easier to see the surfers, beach valley-ball players on the beach from either side of the pier."], ["Reviewed September 18, 2017", 3.0, "Great to see not much to do", "We walked to the pier from our hotel. It offers great views and it a good vantage point if you want to watch surfers. There isn't much here other than fisherman who fish off of the pier."], ["Reviewed September 14, 2017", 5.0, "Amazing", "Sunset is just amazing, very clean, beautiful, we enjoyed the view and wished we could come back again!"], ["Reviewed September 13, 2017", 5.0, "What a great view of the coast", "Took a long walk and luckily it was on a long pier. Great views and the people were friendly. The fishing was good and the people fishing were friendly and talked to you about their catch"], ["Reviewed September 13, 2017", 5.0, "HB Visit", "Travelling together for the first time to CA and we have loved HB. I really cannot recommend it more to people."], ["Reviewed September 13, 2017", 5.0, "Nice City Pier overlooking the Pacific", "Free to walk on. Fun to watch the surfers and fishermen along the walk. There is a restaurant at the end of the pier."], ["Reviewed September 13, 2017", 5.0, "You gotta do it", "We walked the pier and there is lots to see and do. Unless you surf, this is the best way to walk out on the ocean as far as you can."], ["Reviewed September 12, 2017", 4.0, "Great place for a stroll!", "The day we decided to go for a stroll on the HB Pier, they happened to have a crafts show- which was excellent! So after walking the length of the Pier we got to do some shopping for a couple of unique gifts! There are also plenty of places to eat both near the beach and across the street! Great, Fun area!!\nShow less"], ["Reviewed September 10, 2017", 5.0, "Busy and a must", "Huntington Pier is very busy, lots of happy people on a sunny day. Wander out to the end where the diner is (Ruby's) and enjoy looking out over the surf in each direction. The beach is covered with volley ball courts and locals are having fun. We were fortunate to see the National Scholastic Surfing Competition taking place with some young and dynamic surfing stars. Easy to watch them from the pier. Got to be the most popular pier along the Southern California coast and then you can also put these ones on your list too: Redondo, Hermosa, Manhattan, Oceanside, Santa Monica - all right up there. See them all.\nShow less"], ["Reviewed September 9, 2017", 3.0, "You visit for the beach... not the Pier", "It's beautiful and if you're lucky if you can see a surfing competition but the Pier is just a Pier...busy with lots of amateur fishermen (women) if it's your thing."], ["Reviewed September 9, 2017", 5.0, "Gorgeous!", "We sat on the beach for a few hours before walking the pier. Metered parking but we parked for free on a side street. Public restrooms on the pier. A couple small tourist shops on the pier, as well as Ruby's Diner. We had lunch there and sat upstairs and had beautiful views and a great meal!\nShow less"], ["Reviewed September 8, 2017", 5.0, "The pier is peaceful, yet busy", "Huntington Beach, also known as surf city is a great place to live and the pier is a great place to visit. The pier can even be seen on tv during the surf championships.\nPeople fish, lovers walk holding hands, and it is a great place to hear the sound of the Ocean and a terrific vantage point for watching surfers and swimmers.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Pier visit", "Great view of the coast and local surfers on both sides of the pier. Lots of tourists and fishermen on the pier and there a few local vendors but overall a great vantage point for taking photos."], ["Reviewed September 6, 2017", 5.0, "NICE BUT STINKY", "Very clean paths but not keep up good enough of the trash can, so the smells bad. People usually come here for food in the restaurant and fishing"], ["Reviewed September 6, 2017", 5.0, "Pier made me weak in the knees", "Not because I was in love with it, but because I am afraid of heights. When I got close to the edge my knees would tremble and I would white knuckle my kids hands. I was just visualizing one of them going over the rails, I am paranoid mostly whenever we go somewhere high. Luckily I didn't get a seagull surprise while I was walking the beach so all in all it was a fine day. Beautiful sunset, smells like smoke from all the bonfires which adds to the outdoor ambiance. All in all an amazing weekend, rent bikes and bikes the boardwalk it's he highlight of our trip.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Watching the swimmers and surfers", "Great place to take visitors to this world renowned surf city. Lots of fabulous dining and drinking restaurants on the beach, across the pier and right on Main Street HB."], ["Reviewed September 6, 2017", 5.0, "Beautiful", "At sunset in weeknight people playing volleyball, taking pictures and enjoying. Beautiful beach. Plenty of parking and restaurants, bathrooms. Tourist area."], ["Reviewed September 6, 2017", 4.0, "Nice", "Huntington is a nice beach...big,pretty clean,lots of sand. The pier was nice enough...pretty clean, a restaurant at the end and a couple gift shops. Lotsa fisherman. My kids saw dolphins splashing in the water."], ["Reviewed September 6, 2017", 4.0, "Wonderful stroll", "When you take a nice leisurely walk all the way to the end of the Huntington Beach pier, you are rewarded with a very nice view on your way back. At the end of the pier thete is a Ruby's to eat at, you can also enjoy watching the surfers surf, some people fishing, other people having fun, volley ball players, etc. There are also other restaurants at right at the begining of the pier.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Spent the afternoon on the peir and beach, so chilled", "we spend an afternoon chilling at the pier and beach, lots of hustle and bustle on the pier with a couple of shops and diner, lots of locals fishing off the pier, we especially enjoyed watching the surfers. the beach was spotlessly clean. lots or parking by the beach but if I recall quite expensive and lots of loos. this was everything I had hoped it would be.\nShow less"], ["Reviewed September 1, 2017", 3.0, "Mr", "Ok same as all the other piers on California cost. Worth a stay but for me 2 nights is enough. San diago is better."], ["Reviewed September 1, 2017", 4.0, "Small but nice", "Small pier with a Ruby's diner at the end. Good place for watching surfers and admiring the coastal views. Accessible from downtown area. Plenty to see."], ["Reviewed August 28, 2017", 5.0, "Great place to go to just enjoy the scenery.", "Love going out on this pier. You can watch the fishermen, surfers, or just relax. It costs nothing to enjoy yourself."], ["Reviewed August 28, 2017", 4.0, "Great Views!", "Located right off Main Street, downtown Huntington Beach where there is many local eateries, and shopping."], ["Reviewed August 26, 2017", 4.0, "High Waves and Great views", "People watching is top notch! Just walking along the beach with toes in the sand and water is nice and relaxing.\n\nThere are huge waves and surfing to watch north of the pier. South of pier are slightly calmer areas for family beaches.\n\nRentals for boogie boards, wet suits and bicycle. Be wary of bicycle rentals as they are not well oiled machines and winds are very strong. Hard to pedal for kids.\n\nGreat place to watch sunset, of course water is cold. expensive parking.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Beautiful view", "Walking out to the pier was nice to see the amazing view and enjoy the sea air. Was extra special to watch the sunset from their and enjoy the view."], ["Reviewed August 22, 2017", 5.0, "Fun place to stroll around", "We were here from TX and my friends showed us around. I love the sights from the pier. People watching was fun. You can fish off the pier too. There's a Ruby's diner if you don't mind waiting a long time."], ["Reviewed August 21, 2017", 5.0, "Family Fun!", "Our family enjoyed the entire day here. Water is warmer than other beaches and energy is so playful. Loved the gathering of drummers near the pier."], ["Reviewed August 19, 2017", 4.0, "Enjoyed watching the surf", "Stopped here to kill a few minutes while driving down the PCH, definitely enjoy watching the surf. Had to be at least 500 surfers out there.. Was impressed watching them ride the waves, or crashing and burn.. Not the cleanest pier, but still worth the...More"], ["Reviewed August 16, 2017", 5.0, "surf contest", "It was an awesome time! I will definately visit again and again great people and great friendly service"], ["Reviewed August 16, 2017", 5.0, "Fantastic Pier", "Great views of the world surfing championships. A great place to take photographs. A really nice bar at the end of the pier that does good drinks and food!"], ["Reviewed August 15, 2017", 5.0, "Fun walk", "Loved the walk on the pier. Little shops .a great restaurant right before you get on pier. Nice to people watch"], ["Reviewed August 15, 2017", 5.0, "Fantastic ocean", "It is just WOW! Such a beautiful place with high waves! There you can see the nature going her own way. I am not sure I dear to swim there but for surfing it is an right place."], ["Reviewed August 14, 2017", 5.0, "Excellent", "A bit crowded and touristy but the Pacific ocean is great. Parking is pricey so better to visit on a weekday or weeknight."], ["Reviewed August 14, 2017", 4.0, "US Open of Surfing", "Beautiful weekend but crowded. I would not have wanted to drive here. We rode our bicycles. Lots of good surfing (and people) to watch. Had lunch at Sandy's near the foot of the pier. Really busy too but recommended."], ["Reviewed August 14, 2017", 5.0, "People watch out n the pier", "If you love people watching you're in for a treat, not to mention dukes and some other places with great food. We go there a lot and cruise it where you can listen to the waves, gossip about the people, grab a great bite to eat on main or just sit with a ice cream and waste your day away!\nShow less"], ["Reviewed August 14, 2017", 5.0, "Sturdy, long, and well designed", "I know it's just a pier, but it is a very nice pier. They seem to keep it up well, clean and not a lot of bird droppings to stress out about. It's actually much longer than you might expect. Took me and my family roughly 15 minutes to walk down and back. You get to watch the surfers (both good and bad), which can be entertaining.\nShow less"], ["Reviewed August 14, 2017", 3.0, "Long pier and a nice walk", "This gave us a good view of the beach and everything on it. We also got to watch some guys pull in some fish. It was a nice walk on a nice day."], ["Reviewed August 13, 2017", 5.0, "Great views", "Great place for an afternoon stroll, great views of the sun set and you can watch the surfer catching waves"], ["Reviewed August 13, 2017", 5.0, "Cute place", "Even though there was only two stores and a diner on the pier i wish there where more shops or things to do and maybe they where open more"], ["Reviewed August 13, 2017", 5.0, "Absolute must see", "Huntington Beach pier is absolutely a must see. The vibe is great. Family atmosphere with lots to see from surfers, dolphins, kites, artists, and people from all over the world. Huntington Beach is an amazing place and one that everyone should experience."], ["Reviewed August 12, 2017", 5.0, "Perfect pier for a family outing!", "We walked the pier after eating a great Hawaiian lunch at Dukes on the start of the pier, which was also where we parked rather easily midafternoon midweek for $5.25.\n\nWe are from Va Beach where there are also several fishing piers, but this one was awesome.\n\nIt was very wide, very clean, had lots of seating, and little shops here and there. We found a penny press at the kite shop (the only penny press in HB). We had a stroller, no problem. We also felt safe enough to let the toddler run around with us.\n\nWe also happened to see a sea lion up close underneath us bear where there were some people fishing. He was so cute and stayed with us a few minutes.\n\nGreat way to spend the afternoon.\nShow less"], ["Reviewed August 10, 2017", 5.0, "California Beaches!", "Huntington Beach is a great beach for the afternoon. Lots of waves but not too big. Lots of warm sand (not too hot to walk on) and enough breeze to keep things comfortable in the sun. There are shops to rent boards right across the street (Jacks) and restaurants up and down Pacific Avenue. Parking was close and easy but not cheap ($15).\nShow less"], ["Reviewed August 10, 2017", 5.0, "Watch the surfers from the pier", "One of the best place in the world to watch surfers performing, we took so many pictures, it was fun watch them."], ["Reviewed August 9, 2017", 5.0, "Beautiful!", "Absolutely stunning view! Not too bad of a walk down and back either. There are a few little souvenir shops that have pretty neat stuff in them along the way too!"], ["Reviewed August 9, 2017", 5.0, "Never fail experience", "Living in HB allows us to make the walking the pier a regular activity and for us every visit is new and different. The people walking, running, strolling, sitting, fishing, watching surfers, always present a new experience. The shops and restaurants are space to keep the pier feeling wide open. As you go out you just see the ocean, Catalina, Long Beach and Newport, but as you return you see the varied skyline of HB and the mountains behind. We use it as a must with visitors, after breakfast at Sugar Shake in the morning and with ice cream from BR or a gelato shop on Main St. Parking is easy... great fun and FREE!!!!!!\nShow less"], ["Reviewed August 8, 2017", 4.0, "Pier", "This can be cold/warm/windy in the winter, can be hit and miss with weather.\nThere are always lots of people fishing at the end of the pier.\nIt's a great place to see seals- seen many each night while walking around .\n\nNo skateboards on the walkway\nShow less"], ["Reviewed August 7, 2017", 4.0, "Sunday afternoon stroll on the pier", "It was a very crowded 'major surfing event' day, but still we had lots of good viewing of the surfers from the pier. We found the pier very family friendly and pleasantly clean. Nice that there's a 'Ruby's Diner' at the end. We're looking forward to going back on a less crowded day. We'd definitely recommend this pier for families looking to get a nice elevated view of the beach, surfers, etc.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Great venue", "Neat setting to watch surfers and the waves come in. Well constructed and sturdy. No issues being out over the ocean."], ["Reviewed August 4, 2017", 5.0, "Beautiful and Amazing Trip", "I went here not too long ago to visit family and it was an experience never to forget. There's plenty of shops around the pier as well as a beautifully clean and wonderful beach. I definitely recommend this to anyone in the area."], ["Reviewed August 4, 2017", 4.0, "Nice walk", "I have there by night It was cold but still a nice walk The pier goes far intolerant the ocean and we can see the waves going to the beach, I really liked being there and see those really beating waves"], ["Reviewed August 2, 2017", 5.0, "A beautiful So Cal Experience", "The Pier is always a treat to walk and enjoy the local culture and the beautiful ocean view. There are a few shops that sell shells, flags and almost anything a tourist would want to buy, even the locals like to shop along the pier. Huntington Beach is known as Surf City USA because of the world famous surf breaks next to the pier. You will most always get to see surfers riding the waves from the pier. There are lots of good restaurants within walking distance and many retail tores , also.\nShow less"], ["Reviewed August 2, 2017", 5.0, "You Can See Forever From the Pier", "There was excitement in the air as people on the Huntington Beach Pier watched the setup of the world's only surf arena.\n\nThe 9-day Vans US Open of Surfing opened on July 29. The world's top 300 surfers were arriving & warming up.\n\nHalf a million spectators were expected to funnel $20 Million into the Orange County coffers & $16 Million into the Huntington Beach economy.\n\nWalking the Pier requires a stop @ Ruby's, the iconic '50s Diner, for an old-fashioned Milk Shake.\n\nShow less"], ["Reviewed July 31, 2017", 5.0, "Great Lacation", "My family and I just visited this beach since it was only 30 minutes from our hotel.\nPros\nA lot of shops\nNo trash on beach\nEasy to find\nFor 4 hours, paid $10 in parking garage\n\nCons\nDifficult to find parking\nNot many eateries right off the beach, have to go up toward the pier\nNo water activities (banana boat, jet ski, etc.)\n\nAll in all this was nice beach and glad we stumbled upon it.\n\nShow less"], ["Reviewed July 29, 2017", 5.0, "Awesome time", "We had a great time here! The beach was busy but everyone was friendly. The beach was clean and well kept and there were plenty of shops and restaurants. Will definitely go back."], ["Reviewed July 29, 2017", 3.0, "Great beach for the right person....", "We visited this beach as part of our 28 day road trip from Seattle to San Diego via the PCH (Pacific Coast Highway). We were exciting about visiting Huntington Beach even though we weren't spending the night there. I rated this very good but could have also rated it average. Here's the details:\n\nPRO'S\n- Very big beach where you want have problems finding a spot.\n- All the amenities/ facilities you'd ever want with lots of restaurants as well.\n- Upbeat vibe.\n- Beach & pier look very clean and well maintain.\n- Great promenade to walk.\n\nCONS\n- For me personally not a very pretty Beach and very big & bold. I'd prefer more attractive smaller beaches with character.\n- Water doesn't look very swimmable and mainly looks good for surfers.\n- Wouldn't say the area feels extremely safe with lots of homeless around.\n- personally again for me I don't like hustle & bustle and this place is one big hustle & bustle.\n\nAll in my final word is lots will love this and some want and I'm somewhere in the middle.\n\nProbably worth a visit when in Huntington.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Fun people watching", "Stroll down the pier to watch surfers and volleyball games below. Oil rigs and tankers are visible in the distance, reminding you where you are. There is a diner at the end of the pier and a little gift shop part way down. There are always people walking here so always good people-watching.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Great view", "This site has a lot of history. It has a great view and Ruby's at end of pier. A great place to have visitors see. Pretty crowded, can be breezy so bring something to cover up with."], ["Reviewed July 25, 2017", 5.0, "Surf City Icon!", "Definitely worth a stroll and even a few hours of people watching! We loved the afternoon we spent there just gazing at the Pacific Ocean, looking for sea creatures, watching the surf boarders preparing for the US Open of Surfing, catching glimpses of Catalina Island, Newport Beach and Long Beach. If you walk all the way to the end, you can enjoy a great meal (we had a late breakfast) at Ruby's Diner. I can only imagine just how magnificent a sunset would be here!\nShow less"], ["Reviewed July 20, 2017", 5.0, "Spectacular Views", "We walked the pier early in the day so not as crowded as the afternoons. We watched the men fishing off the pier. Food is available at end of pier. Very beautiful setting!"], ["Reviewed July 20, 2017", 4.0, "Nice walk, good views", "A good spot to take a walk. Grab a to-go beverage at any of the coffee spots close by and take a stroll to the end of the pier. Plenty to see with a view curio shops at the start of the pier. A lot of people tend to fish from the pier and looking in the water one is sure to see surfers waiting to catch a wave.\nAt the end of a pier is a Ruby's Diner with fantastic views of the ocean, which can be a good spot to grab some breakfast, lunch or dinner if you're hungry.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Cool Pier, great waves and hunky hunk life guards!", "If your driving the Pacific Coast Hwy (PCH) this stop is a Must See! Sand, surf, and eye candy for miles!"], ["Reviewed July 19, 2017", 4.0, "Great place for pictures and sunset viewing", "The HB pier is home of the Surfing Championships = tourists attractions = artists shows = Farmers Market = backdrop for fantastic views of sunsets and just a great place to start your adventure of Huntington Beach"], ["Reviewed July 19, 2017", 5.0, "nice walk on the pier", "Famous HB Pier with Rubys Diner on the end. Wait time can be quite long for the Diner depending on the time of day. You can also walk up to the window at the front of Ruby's and order your food, wait timer is less. Either way Ruby's has good food and shakes. They will validate your parking if you park in the structure. Relaxing walk with benches if you want to sit and watch the surfers, boaters, waves or people. NO DOGS ON PIER\nShow less"], ["Reviewed July 18, 2017", 5.0, "Great Pier", "A lovely pier that is great just to walk along and unwind, plenty of fisherman along the edges, great for watching the surfers from above. Get to the end and there is Rubys Diner, a 50's style diner that do excellent milk shakes."], ["Reviewed July 13, 2017", 4.0, "Nice beach location near Anaheim.", "Great beach location near Orange County Airport and Anaheim. The beach was nice. There are plenty of shopping and restaurants around. The pier has a few shops and a burger/ice cream joint at the end. There is lots of fishing off the pier. It would be nice if the fisherman kept that a little cleaner but overall good. There are plenty of benches as well as bathrooms on the pier. There are some bathrooms on the beach as well.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Fairly newly rebuilt, but the 'Surf City' feel is still alive!", "This is a bit of a must-see as the pier just well out into the Pacific...sounds & sights are something to experience...I could almost hear Jan & Dean's Surf City (well, I say almost, as the 'beach' now has several volleyball setups, vice surf shacks/cabanas).............."], ["Reviewed July 10, 2017", 3.0, "Crowded on a hot summer day", "It's just your average pier although they have a Ruby's Diner at the end! Nice place to walk but gets very crowded on a hot summer day or night."], ["Reviewed July 10, 2017", 4.0, "Burger and a breeze.", "Go for the great beach views and cool breezes. Not much in the way of food, Rubys at the end serves exactly what you would expect on the pier... hotdogs, hamburgers and fries... lots of fishermen, some musicians if your lucky... souvenir shops along the way.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Beautiful Stroll", "Just took a leisurely stroll to end of HB pier with visiting relatives from England. They loved the garden wind twirlies at the little store, watching the Jr guards being trained on the beach & in the water swimming around the end of the pier, & of course having a Butterfinger shake at Ruby's at the end of pier. I had to explain what a Butterfinger is, but once tried, I think they'll come back to HB just to have another one. Huntington Beach Pier is a great place to visit, for young & old alike.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Incredible views", "A great place to take a stroll and watch the surfers in the morning, people playing volleyball, the beautiful sunset at night, dine at one of the restaurants nearby or shop in the market set up off the pier certain days of the week. And if you are lucky enough to be there on the 4th of July, the fireworks are spectacular over the pier!\nShow less"], ["Reviewed July 10, 2017", 5.0, "Evening walk!", "Though it's an enjoyable walk any time of the day. The evening is one of my favorite! It could be hot during the day in full sun, refreshing in the evening, romantic late at night. And if it makes you hungry there's always Ruby's burgers at the end of it.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Heaven on Earth", "There is nothing better than standing on the HB pier anytime of day and just look at the beauty all around you. From sea to shore and everything in-between."], ["Reviewed July 9, 2017", 5.0, "Great spot for 4th of July fireworks", "Be sure to get there early for fireworks spectacular at 9pm on 4th of July. Other times great spot to fish or watch waves. Dukes restaurant at entrance and sandys beach shack underneath for great drinks and lower priced foods."], ["Reviewed July 8, 2017", 5.0, "Great sun, surf, and sand at HB pier", "Family enjoyed a great time at HB pier and artisan shops...especially strawberry lemonade. We had great fun playing frisbee and flying our kite."]]}}