{"Indian Canyons": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Indian Canyons", "url": "/Attraction_Review-g32847-d524662-Reviews-Indian_Canyons-Palm_Springs_Greater_Palm_Springs_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/ee/c4/54/view-from-the-trail.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1265"}, "address": {"@type": "PostalAddress", "streetAddress": "38500 S Palm Canyon Dr", "addressLocality": "Palm Springs", "addressRegion": "California", "postalCode": "92264-9332", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Great Hikes", "This is our favorite hiking spot in Palm Springs- Whatever your ability there will be a great hike for you."], ["Reviewed 2 days ago", 4.0, "Some excellent day hikes in beautiful canyons", "The park is operated by the Agua Caliente Indians (Native Americans). There s a fee to enter but it is worth the price of admission. There are maps and Rangers to provide advice. We hiked the Palm canyon. Lots of Palms in the bottom of the canyon and shade on a hot day. You do hike up and out of the canyon where you lose the shade. It can get very hot and the area is prone to flash flooding. Seek advice and heed it! Take water, sunscreen and have good footwear. It is a fairly steep trail down into and out of the canyon. I wouldn't do it unless physically fit. There is a waterfall near the parking lot, about 5 minutes away. This trail dead-ends at the waterfall. We also hiked Andreas Canyon. the access is easier but you do need to be in shape. We picnicked at the entry to this canyon. Tables are available near the parking lot. This was also partly shaded canyon near the creek but not for a long distance. You will get into the sun. The rock formations are amazing to view. One of the most interesting it at the entrance to Andreas Canyon. We will visit again when in the area.\nShow less"], ["Reviewed 2 days ago", 4.0, "Beautiful area to visit especially for hiking", "It is an Indian reservation so there are rules to be followed - nothing extreme (no smoking, drinking, etc.). Be aware that there is a big incline to traverse into and out of the canyon. It is fairly easy hiking after that. There is a water fall near the parking lot that does not require the big incline. The rest of the canyon trails are down in the canyon. Nice half day excursion for the average group. Quite a few picture spots!\nShow less"], ["Reviewed 3 days ago", 5.0, "Must visit", "Start here to get an understanding of the whole valley. Beautiful walks in canyons with water in winter. A great contrast to the open desert. Entry gate can be slow if there are a lot of cars. Bring cash to speed it along"], ["Reviewed 4 days ago", 5.0, ".Great Hiking", "Great hiking. Lots of well maintained trails and great scenery in the palms. A good way to spend the day"], ["Reviewed 4 days ago", 5.0, "Great desert hiking | Closer than Joshua Tree", "Great hiking in a slightly surreal canyon of Palms. Try to hit the Seven Sisters, bu be ready for 45 min in and 45 min back"], ["Reviewed 5 days ago", 5.0, "Beautiful!", "My friend and I hiked through Palm Canyon. While I wouldn’t have called it an easy hike, I absolutely loved it and highly recommend it! The rangers were informative and helpful in deciding where to go. The scenery is so unique- my favorite during our three days in Palm Springs!\nShow less"], ["Reviewed 5 days ago", 5.0, "Great Hiking", "There are three canyons to hike in this area. We thoroughly enjoyed exploring all of them. Here are some tips. Remember to take plenty of water and sunblock. There is a reasonable entrance fee. Check the website for up to date information.\n1. Murray Canyon trails and Andreas Canyon trails are both accessible from the same parking lot. There are picnic tables near the lot. The trails are posted on a board where you can view length and difficulty. If you have limited time, I suggest taking the Andreas Canyon trail. Enter off of the main parking area, do not cross the stream, look for the Andreas Canyon sign and veer left. Within minutes you are transported to a desert oasis. If you are not a hiker, just five minutes on this path will give you wonderful sights. This is a loop trail. It is about a mile, and although it is marked easy, it is rocky and has some elevation changes. There is a good deal of shade the entire way.\n2. Palm Canyon is about two miles away along a well marked road from the other canyons. There are bathrooms, a gift store and a very limited snack bar. I advise bringing your own food. The hikes from this spot are much longer in duration. However, by the concession stand there is a path to a grove of palm trees and a stream where there are picnic tables. It is a switch back trail and is not nearly as steep as it looks. It would be a great place for lunch. One word of warning, if you have a RV or similar vehicle, you will not be able to drive all the way to the parking lot at Palm Canyon. There is a boulder passage that is narrow. You will have to park below the main lot and hike uphill from it for about an eight of a mile.\nEnjoy you day!\nShow less"], ["Reviewed 6 days ago", 5.0, "Breathtaking. Good hiking trails", "Do not miss! The Park Ranger near the trading post is very helpful. Many varied hiking trails of different lengths and difficulty. Stunning scenery. There is an admission fee."], ["Reviewed 6 days ago", 5.0, "BEAUTIFUL", "Well worth the effort. Easy hike. Gorgeous vistas. Lots of shade. Waterfalls during season. Nature trails"], ["Reviewed 1 week ago", 5.0, "Impressed", "My first time here - I was totally amazed and impressed! I loved it - loved the view and the scenery- great photo opportunities- amazing hikes - wish I had more time - look forward to when I come back. Really a must do and spend time the needed time to enjoy!\nShow less"], ["Reviewed 1 week ago", 5.0, "Fascinating", "We walked to the Seven Sisters waterfall - mostly an easy walk with a couple of slightly challenging points . The waterfall isn’t huge but seeing the palms and rivers is worth the journey.\nDidn’t see rattlesnakes (disappointed husband) but there were birds, lizards and even a rabbit !\nGlad we went!\nShow less"], ["Reviewed 1 week ago", 4.0, "Need to hike the Andreas Trail", "If you like easy hikes, go to Indian Canyons and hike the Andreas and Palm tails. The Andreas trail is an easy 1.5+ mile hike and well worth it. We only hiked part of the Palm trail and, frankly< it was not as impressive. There is also a water falls near the Trading Post that is worth the short walk.\nShow less"], ["Reviewed 1 week ago", 5.0, "Such a pretty hike!", "Go as fast or slow as you want. A whole different world when you get down into the oasis. I went twice once with my family and again with a group of friends."], ["Reviewed 1 week ago", 5.0, "Love the trails out here", "Yeah, it costs $9 per person to get in, but the selection of trails makes it worth the cost of admission. Today's hike was out to the stone pools via the Palm Canyon Trail. The 60° temp today made the open part of the trail very comfortable, but down in the canyon was a bit chilly. Stone pools were about 6 miles round trip.\nAndreas and Murray Canyon trails are also terrific.\nShow less"], ["Reviewed 1 week ago", 5.0, "Pleasant surprise. Lovely 2 hour hike. Total.", "We hiked up Murray Canyon. To the pretty waterfall. 2 hours in and out. One section moderate steep. Not many people even on this Presidents Day Saturday morning. A few horse riders. Beautiful canyon. Striking that it could be so close to downtown Palm Springs. $7 senior entry. Park is owned and operated by the native locals. The Trading Post is very well organized. Snacks. The toffee bar for $1 was very refreshing,!\nShow less"], ["Reviewed 1 week ago", 5.0, "So many trail options", "This was a great place for hiking. We walked the Andreas trail and part of the Palm Canyon trail. The Andreas is a nice shorter (~1 Mile) trail. Running water, partly shaded. The Palm Canyon trail we entered the trail head just behind the Trading Post. For about 1 to 1 1/2 miles you walk through the oasis in the shade. Then we saw a sign that goes back to the Trading Post on another trail (not sure what the name of the trail was). This trail was all open but goes up high on the mountain so you can see the oasis down below. Absolutely gorgeous! I would highly recommend it. You will come out of the trail at the overflow parking lot next the to Trading Post.\n\nIf you don’t want to walk the trail but want a nice spot to eat your lunch. Go onto the Palm Canyon trailhead behind the Trading Post. Once you walk down it will open up into the oasis with a nice open area with picnic tables.\n\nGet there early. We got there just before 9:00 and it was starting to get busy. When we left around 11:00, there was a line of cars waiting to get in.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful Palm groves", "We hiked the Mc Callum trail which was an easy 1 hour hike. Started out at a Palm grove where Eagle Scouts had created beautiful bridge pathways through the Palm oasis. Then hiked though a very groomed trail through desert plants to a picturesque grove of palms around a pond. Wish we had brought a picnic! It was SO beautiful- and there were picnic tables around the pond in the shade of giant palms.\nShow less"], ["Reviewed 1 week ago", 5.0, "We have been back three times now", "We have been on around a dozen hikes in the area and this is the best, that is why we pay to get in. We hiked Murray Canyon yesterday and saw multiple Big Horn Sheep. There are Palm trees the entire way. We came back for the Victor Loop today, near the Trading Post, which has some nice books and jewelry and clothing and a snack bar. We saw Bighorn Sheep right from the parking lot, and on our hike\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A nice walk in the desert...", "This was a great way to spend 45-90 minutes getting some walking in and enjoying the beauty this oasis in the desert offers. We went here last year and had to return..."], ["Reviewed 2 weeks ago", 5.0, "Easy Stroll", "We did the Andreas Canyon hike early in the morning. Only two other folks on the trail! Beautiful walk/climb along a well defined trail. Magnificent skirted fan palm trees make up a significant part of the trail. By the time we got back around 9:30 the parking lot was starting to get crowded. Go early in the morning for the best experience!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Sister Canyon to Tahquiz and Better Value", "Indian Canyons was not originally on my agenda for the Palm Desert.\nI had done my research and we were headed for Tahquiz Canyon.\nWe got to Tahquiz Canyon just before noon. The woman selling the tickets helpfully advised my companion that the hike entailed an entire mile of rock scrambling and that many of the rocks were eighteen inches tall. That did not jibe with what I had read, but my companion decided that the hike was going to be way too strenuous for him.\nWe were then referred to Tahquiz Canyon's sister canyon, Indian Canyon, about three miles down the road.\nAnd that is how we arrived at Indian Canyon about half past noon.\nAt the entrance, where one pays, we were given one pamphlet. I asked for a second--we were, after all, two people paying two admission prices and the pamphlets contained the maps. It is always good to have a map on you if you get separated. Be aware, only one pamphlet is allowed per car--no exceptions. If you want another, you have to go to the trading post and pay for it.\nAdmission is $9 for adults, $7 for seniors and students, $5 for children 6 to 12 and free for the military.\nIf you save your brochure, you can get a discount at Tahquiz Canyon.\nThere are a number of hikes in the canyon, ranging in length and difficulty.\nThe trail we liked the best was the one mile loop in Andreas Canyon\nThe ranger, who is a member of the Agua Caliente tribe, gives a ranger talk at the picnic table along the stream, adjacent to the Andreas canyon parking lot at 1 o'clock.\nWe had hoped to catch a ranger hike, but the ranger hikes apparently only happen on the weekends.\nThe first half of the Andreas Canyon Loop Trail is through a lush oasis with a stream flowing through. The second half is through the desert. The contrast is quite extreme.\nThe signage is not good and the path at the desert end of the hike not well defined. There are no cairns or markers to direct you.\nAfter walking through the desert for a while (which somehow seems much longer than walking through the oasis), I started to worry that we were lost. It was getting hotter and we were just about to double back when some other people came along and assured us that we were in the right place. Something to be aware of in advance, if you read this review.\nThere are picnic tables along the stream near the parking lot and a display of Indian structures.\nAfter we finished the Andreas Loop trail, we drove to the Trading Post.\nThe Trading Post is very well stocked and adjacent to two hikes that I recommend, even if you only do part of them--West Fork Falls and the Palm Canyon Trail.\nThere is a fairly steep descent into the oasis for the Palm Canyon trail, where majestic palms are located. You can get an overview from the observation point adjacent to the trading post. The falls are very close to the trading post. To see them properly, you have to clamber up the rocks and peer through the opening.\nWe did these two hikes in the latter part of the afternoon.\nWe stayed longer than we had anticipated and had a fine time.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Good Hiking Semi Dangerous", "Hiked here on numerous occasions. It’s beautiful when it gets enough rain. Remember there are wild animals though! Also rocks can fall and crush your skull!!! I had a huge bolder fall on me once while rock climbing there. I dove against the mountain and it flew past my head and hit me in the butt. Funny now, not then! Left a huge bruise the size of a bowling ball. Still had a fun time connecting with nature. Waterfalls, caves, and enormous rocks make it a challenging rewarding hike.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Visited since 1964 and Keep Coming Back for More", "I've visited the Indian Canyons since I was a little kid 54 years ago. I still keep coming back on my own terms time and again. There is no place on Earth like it anywhere else with a combination of scenery, palm trees, streams, wildlife, rocks, hills, creeks, and hiking. The local Indians would tell you that it is a spiritual place and they are right as others I know who visited feel it as well. It is best to visit after mid-October and prior to mid-April or it gets way too hot. Hike it or take a horse, whichever your pleasure. Remember there are 3 Indian canyons - Palms, Andreas, and Murray canyons - each with their own unique trails and locations.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Gorgeous and interesting place", "What a great place at a bargain price! The Palm trees are just amazing and the surrounding area lovely. There are miles of hiking in this sanctuary. We did the 1 mile San Andreas hike and it was wonderful. Amazing to see rushing water in the desert; you understand what an oasis meant to those traveling through the desert.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Not enough time there. Beautiful!", "We unfortunately got there after 3 pm, so only took in one hike (Andreas), but what we saw was amazing and we will make a point of returning. It'd be better to go much earlier in the day I imagine."], ["Reviewed 3 weeks ago", 5.0, "Fun outdoors", "We love to explore Indian Canyons when visiting Palm Springs. Lots of nice, cool shade when needed. A nice break from in town stuff."], ["Reviewed 3 weeks ago", 4.0, "Hiking", "Well worth the trip and taking the ranger led hike very informative. Thanks Ralph for all the information about the area."], ["Reviewed 3 weeks ago", 5.0, "Beautiful hike into the desert", "Experienced a wonderful hike with quite a variety of desert plants and trees. Took the hike to the pond and was not disappointed."], ["Reviewed 3 weeks ago", 5.0, "Several options, good price - nice way to spend a day", "$9 per person is a good deal for several hikes. Andreas Canyon hike was BEAUTIFUL and very accessible for just about anyone - short, easy terrain, not much of a climb. Beautiful palm oasis.\n\nMurray Canyon a bit longer and more rigorous but still very doable. If you keep your brochure you get a discount at Tahquitz Canyon.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful hike and palm tree oasis", "I had no idea what to expect when we first arrived here as my spouse planned the whole thing and wanted to surprise me......well, it was nothing like I had ever seen, because prior to coming here I didn't even know what a palm tree oasis was. It was spectacular!\nUnfortunately we had come in the late afternoon, so after waiting in a 30-minute car line up to pay and enter the park, we only had an hour to hike around and get a feel for this place, which was way too short of a time.....so be sure to plan your time better to see more and soak it all in.\nExploring this area is more for the active type person as there is very little flat terrain here, but more of a varied, hilly terrain, over dirt trails and rocky areas.\nOutside of the occasional bird, we didn't see any other wildlife while we were visiting but I can only imagine that snakes must be abundant in this area.\nBe sure to wear appropriate footwear and take lots of drinking water.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great Hiking", "We hiked the Palm Canyon Trail to the Victor Trail that brought us back to the Trading Post. It was a combination of a hike through the old large palms and then up through desert areas on rocky hillsides. The hike took us just over 1.5 hours and was perfect. Be sure to take water.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Nice, Scenic Hike", "We hiked the one mile loop in Andreas Canyon. It wasn't too strenuous, and there were plenty of photo ops. We saw a lizard sunning itself on one of the rocks."], ["Reviewed 4 weeks ago", 5.0, "Love hiking in the oasis", "We love going to Palm Canyon, where we hike in the oasis among the tall palms. Very fun and interesting experience."], ["Reviewed January 22, 2018", 5.0, "Cool oasis...", "Did the four mile loop through the palm trees and back to the parking lot. Nothing very strenuous but some amazing views."], ["Reviewed January 22, 2018", 5.0, "vacation in palm springs", "learned a lot of history for the area, great walking trails, met a lot of lovely people, learned about the indigines people"], ["Reviewed January 22, 2018", 5.0, "Close to city but feels like in the middle of no where", "I must for active people. I hiked for 3-hours and at every turn saw something a little different: different terrain, landscape and a different feel. The palm oasis provided shade to cool off in. Take water of course!"], ["Reviewed January 21, 2018", 5.0, "Beautiful", "A nice oasis of peace and beauty in the desert. There’s a easy loop walk that takes about 20 minutes. Parking is at the hike entrance. Adult fee is $8"], ["Reviewed January 10, 2018", 3.0, "Fun but Crowded, Good Kids Hikes", "There was a 3/4 hour wait to get in the park when we got there, and this was first thing in the morning.\n\nThis is a fun place to hike if you are looking for a variety of landscape and some easy hikes for the kids.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Beautiful Place", "Great place to hike. Loved going through both palm oasis here at Indian Canyon. Just a few miles south of downtown Palm Springs this place is very easy to get to."], ["Reviewed January 8, 2018", 5.0, "A must!", "Wow! I was very surprised and shocked. Be careful of rattlesnakes. They are hiding everywhere. The palm trees are amazing! Unbelievable. Take plenty if water. The guides are do helpful."], ["Reviewed January 7, 2018", 3.0, "Fun but HOT!", "I spent a few hours here hiking around the Palm Oasis during my single day to explore Palm Springs before I had to head to Anaheim on my road trip in May 2017.\n\nThis hike was recommended by some other guests at my hotel and after googling it I decided to give it a try.\n\nIt's located on an Indian Reservation so you have to pay an entrance fee to get inside and drive around (it's HUGE) but once inside you're basically free to explore as much and for as long as you want.\n\nI was solo so you have to be careful of heat and snakes in the desert.\n\nAfter I found the trail I wanted to hike a very nice guide was sitting under the shade at a picnic table and I spoke to him to get my bearings and he offered a few other suggestions of things to see while I was on the reservation and in the Canyons. So after I finished with the Palm Oasis I took his advice and drove to the outpost to see a small waterfall that is a very short hike behind it to the left.\n\nThe Palm Oasis is beautiful - I've never seen anything like it - literally an Oasis in the middle of the desert with hundreds of palm trees growing up around it. Gorgeous! I'm so glad I was able to see this while in Palm Springs.\nShow less"], ["Reviewed January 7, 2018", 5.0, "One of the best hikes I've ever done", "We took a wrong turn and apparently ended up in 'the wash'. We didn't see anyone for a few miles so turned back as we knew we were off the main trails. Incredible scenery and solitude. It was like a cowboy film movie set really an amazing experience.\n\nOnly negative was rudeness from other visitors. Hardly anyone said hi and most didn't even acknowledge us when we gave way to let them pass on narrow trails. These people tend to only stick to the first couple of miles of trails so after that you're good.\nShow less"], ["Reviewed January 5, 2018", 3.0, "Pay by the person, not by the car", "What happen to just paying for a flat fee per car? And it's not like the canyon is any great. It's an okay place to come for a run, but it's not one of their best. I think $7 per car is sufficient fee for the park. Come if you have nothing else to do.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Beautiful Hikes, but Beware of Long Line to Get In - Bring Cash!", "We did the Murray Canyon hike which was absolutely beautiful (about 4 miles, somewhat strenuous). However, we probably waited in our car for an hour just to get into the park! Cars were so far backed up, and the pace was impossibly slow. Someone came and explained that credit cards were slowing down the line, as they had a dial-up machine that took 5 minutes to process a single credit card. Given how slow the line was, I believe it! (We arrived at about 11:00am on a holiday weekend, so arriving early probably would have helped)\n\nThe park ranger also said the line is this long all the time, so I don't understand why they either a) update their credit card machine, or b) only accept cash. Countless cars turned around and left after waiting for so long, so they are clearly losing business from this approach. Bottom line, be prepared for a line, bring cash to speed things along, and encourage the rangers to update their systems!\n\nHowever, beautiful hiking that was truly top-notch, once you get in...\nShow less"], ["Reviewed January 3, 2018", 5.0, "Explore Indian canyons", "The Canyons are a nice walk...some are easier than others as the far one makes you hike downhill then uphill to find your car again. However, take time and go deep in the canyon to see where Palm Springs really started."], ["Reviewed January 3, 2018", 4.0, "Good hiking", "Take plenty of water and take your time, it is a moderate desert hike requiring some stamina. Great views and fun."], ["Reviewed January 3, 2018", 5.0, "Not to be missed", "This is an awesome place to visit and experience nature in the Palm Springs area. Just short hikes will allow you to see and experience the amazing oases. Be prepared for a bit of a rocky path and wear sturdy shoes. As for all the complaints about the slow process at the entrance: This must be due to people arriving there unprepared. I looked at the sign that posts entrance fees and had the correct amount of cash ready when we approached the gate and we were through in seconds. I can only assume that the slowness is due to people arriving at the gate asking for pricing and trying to pay by credit card in an area here reception for the machines is spotty. So, do everyone a favor and arrive prepared.\nShow less"], ["Reviewed January 2, 2018", 5.0, "A little piece of heaven", "Indian canyons is a must see in Palm Springs, California. Only a few minutes from the main drag, you can find a peaceful, natural Oasis filled with canyons, Palm trees and amazing Rock formations. There are many places to hike, picnic, meditate or breathe in the fresh air. For a nominal fee (very reasonable) you can enter the canyons and enjoy a few hours or a full day. Make sure to visit the Trading post with it's many treasures of native arts, native American literature and t-shirts. So glad I made the visit. You will be too!!\nShow less"], ["Reviewed January 2, 2018", 5.0, "Happy Trails", "Beautiful scenery abounds here. Don't miss the easy one-mile hike to the oasis. The longer hike to the waterfall has a lot of stones in water to cross, so if you're not big on stepping on slick rocks, it may not be for you, but it's a great hike. It's worth the admission just for the easy oasis hike!\nShow less"], ["Reviewed December 31, 2017", 4.0, "Worth the price", "My initial thought was that the price of admission was too high; until we started hiking! This is one of the most beautiful places I have seen, made even more beautiful by the fact that what you see is so unexpected. A true oasis in the desert. Plenty of places to hike. Get there early to avoid the crazy crowds trying to get in. The only reason for 4 stars rather than 5 is that it seems that the entrance process could be improved upon greatly.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Other Wordly Feel", "Along with the Andreas hike, Indian Canyon is one of the most beautiful and ethereal hikes in Palm Springs. It has such a prehistoric feel to it and if all you do is a 1 mile hike, you'll see enough to get a great sense of what this oasis has to offer. On the day we arrived, there was a long line to get in and traffic seemed to move at a snail's pace. Don't be dissuaded from entering. The ticket booth area is slow in processing people, but once you are in, the drive to the hike entrance is quick and easy. It's a mystery to me why the entrance booth is so inefficient in processing a simple entrance fee, which by the way, is $9 a person. All in all, this is a must see when in Palm Springs.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Very nice place in the summer.", "Very beautiful and interesting to see a real Oasis in a desert. We also saw horse riders. We wish there was more horse riding throughout Palm Springs."], ["Reviewed December 22, 2017", 5.0, "If you only do 1 hike, this is it.", "Easy hiking with spectacular scenery. Well worth the visit! And you will see exactly how Palm Springs became named."], ["Reviewed December 21, 2017", 5.0, "Great Hike. Will be back", "We were looking for some close shorter hiking. We did the Andreas And Murray canyon hikes. There was water in December. The scenery is great. It stays cooler under the palms and by the water.\nThe trails were fairly easy. Murray Canyon has some rock hopping across the small stream and some elevation changes.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Winter hike", "The trails are well signposted. It's worth going here to see the palm oasis. Victor trail is rough on your ankles and no shade. There are people on horseback on the trails. Saw four bighorn sheep high on a steep hillside. One sheep dislodged a good sized rock which fell to the bottom of the canyon, a hiking hazard I did not anticipate. I missed out on the ranger guided walk as they only have them on Fri, Sat, Sun at 10 a.m. at the moment, whereas the website says 10 a.m. and 1 p.m.\n\nCheck the hours as it's closed some days in summer. If you are a visitor it's easier renting a car. You can take an Uber here but I could not get wifi at the Trading Post parking lot so make sure to schedule return transportation before you set out.\nShow less"], ["Reviewed December 19, 2017", 4.0, "Nice place to hike", "What a great deal! You pay 6$ senior's ticket when purchased at the Tramway Visitors centre.\n\nYou drive in on very nice paved roads with great signage. Just drive south on Palm desert from downtown Palm Springs and you can't miss it.\n\nParking is in a beautiful oasis with lots of shade. There are portable washrooms and water for you to wash your hands.\n\nWe hiked Murray Canyon and really enjoyed it. The trail map says it's 4.2 miles , but my Fitbit said it was more like 5 miles.\n\nWe were not lucky enough to see large animals but saw lots of birds and the occasional lizard.\n\nWe started out around 9:30am and found next to no one on the trail. You walk out in an open area until you come to a downhill area leading into an oasis. We only really started meeting people on the way back.\n\nFrom there you hike along a small Creek and keep crisscrossing back and forth until you reach the falls atvrhe end of the trail. Don't expect much of an \"ha ha\" moment at the end ...we found that the trail had ended and we were worried we had lost it, but sure enough there was a sign letting us know that we were at the Sisters' Falls.\n\nIt tool us about 1.5 hrs to hike in and about 1 hour and a bit to come back.\n\nBe sure to bring water, snacks and a hat. It got hot even early in the morning.\nShow less"], ["Reviewed December 18, 2017", 5.0, "I loved my quick walk on an oasis!", "I took a short hike on the Andreas trail around running water. It's peaceful and beautiful! Returned with my adult son a few days later. I hope to return next year to hike some longer trails. This is a heaven on earth."], ["Reviewed December 17, 2017", 5.0, "Great hiking opportunities!", "We enjoyed a short hike in the morning and then went back for a longer hike at sunset! What a beautiful area! We had no idea that this was here. It was a very pleasant surprise!"], ["Reviewed December 6, 2017", 4.0, "A beautiful day for a hike", "This is a great place to go for a picnic or just a Nike or walk. You can get hiking maps at the trading post. They also offer refreshments and Indian art. This is a historical place and well worth the visit."], ["Reviewed December 6, 2017", 5.0, "Great hikes of varying degrees of difficulty.", "A small entrance fee gets you access to the Indian Canyons. The entry booth provides trail maps. Magnificent scenic trails ranging from an easy walk of about one mile up to far more challenging hikes. Well worth a visit."], ["Reviewed December 5, 2017", 4.0, "Palm Canyon and Andreas Canyon Loop", "My husband and I hiked two trails in Agua Caliente Indian Canyons, the Palm Canyon and Andreas Canyon Loop. Both of these trails are beautiful in very diverse ways and fairly easy hiking for all ages. Its a gorgeous area with a variety of scenery and many photo ops.\nShow less"], ["Reviewed December 4, 2017", 5.0, "Beautiful Scenery and Great Hiking", "Went hiking on 3 trails: Andreas Loop (easy), Palm Canyon (easy) and Victor (moderate). Really great hikes with unique scenery and vegetation throughout. It took us about 30 minutes to hike the Andreas loop and about 90 minutes to do the Palm Canyon and Victor trails. Great picture taking opportunities. A must see!\nShow less"], ["Reviewed December 1, 2017", 4.0, "Spring break", "Not real scenic but I have been spoiled. Dry desert hiking trails to waterfall. Bring lots of water, sunglasses, visor or cap. lack of enough parking."], ["Reviewed December 1, 2017", 4.0, "Mystical and beautiful", "I've lived in Palm Springs many years and visited these canyons many times....more recently the area, once open to the public to hike and enjoy, now requires a fee to enter...but it is worth the fee to engage and immerse yourself in the beautiful flora and mountains...and don't miss the oasis. Beautiful, tranquil, natural.\nShow less"], ["Reviewed November 28, 2017", 5.0, "great hiking", "I hiked up the Murray Canyon trail up to the Seven Sisters. Nice trail, busy near the beginning, but the further you hiked in the less people you saw. No really challenging inclines (I didn't make it to the waterfall) but enough to get your heart rate up. Make sure to bring plenty of water, and a wide-brimmed hat would be a good choice. I would highly recommend checking it out if you are in the Palm Springs area.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Just loved", "Dragged my partner out of bed for us to be the first in line . We hiked Palm Canyon and Andreas . Total 4 miles . Stunning views . Not difficult . The rangers were very helpful . Be careful of coming too close to jumping cholla . Nice vistas .\nShow less"], ["Reviewed November 24, 2017", 5.0, "Seven sisters falls", "My adult son and I walked this trail today and although it is marked at 4.9 miles (7.8km), my pedometer clocked just under 9 kms to and from the parking lot\n\nThis is a beautiful walk through the canyon, with water and shady areas under date trees. There’s a small uphill climb about 1 km from the falls. The falls themselves were a bit of a letdown- really just very low but the surroundings are beautiful. We enjoyed it immensely and would recommend it for those who like nature walks\n\nBy the way, there families with children between the ages of 7-12 on the trail.\nShow less"], ["Reviewed November 21, 2017", 4.0, "One of a Kind Experience", "If you go to Palm Springs and don't come out to see this, you're missing something wonderful! Where else can you see a true oasis in the desert, with springs burbling out of the ground, giant palm trees (natural, not planted) in the bottom and stark desert cliffs above?\n\nIf you have only an hour, then go into the main canyon (the East Palm Canyon trail) and simply walk around. But if you have a couple of hours, then I recommend walking up this trail through the palm lined bottom, then about a mile in turn left up the hill to the Victor trail. This parallels the canyon back toward the Trading Post and parking lot, but winds along the top of the hillside for tow miles, with amazing views down into the canyon and out toward Palm Springs. There are other, more intense and longer hikes as well.\n\nGo in morning before the crowds arrive and before the heat really gets going...it's comfortable all day long in the shady canyon bottom, but pretty exposed if you take any of the other trails.\n\nEntry is only $9/adult and the money goes to the local native band. The gift shop is also pretty good.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Great golf destination", "Played both the North and the South, loved both although this time of year the greens are quite slow on the south anyhow. Regardless we had a blast and everyone there treated us like gold. Thumbs up!"], ["Reviewed November 18, 2017", 4.0, "Lovely Oasis", "This is a great place to walk. It is shady on a warm day and the palms and creek are lovely. Be sure to do a couple of the hikes as it costs to come into the site."], ["Reviewed November 18, 2017", 5.0, "Beautiful", "There are multiple Canyons to see. Palm Canyon has the visitor center and gift shop and trails for hiking. Also a Ranger story time. The Andreas Canyon is what we found most beautiful because of the flowing water. There is a spot on the one mile hike where we felt like we were in Jurasic park with the tall palms and huge rock formations. Just stunning!\nShow less"], ["Reviewed November 13, 2017", 4.0, "Recommended", "We really enjoyed our hike here. We only had time to do two of the trails- The San Andreas Canyon trail and the Murray Trail. The San Andreas was unlike any hike we'd done! Beautiful setting with a variety of palm trees and a stream on one side with amazing rock formations on the other. It felt like we were in the jungle! The Murray trail was okay- after doing San Andreas it was a little bit of a let down as it was mostly desert and rock. It was still enjoyable, though! Both were fairly easy but did require some stability and the ability to walk uphill a bit.\nShow less"], ["Reviewed November 9, 2017", 3.0, "$9 admission but no frills", "I was disappointed. With an admission fee I was expecting trails that were well maintained, informational plaques, and water. None of that was available."], ["Reviewed November 9, 2017", 5.0, "Went to see the waterfalls", "We went to the Indian Canyons to see the waterfalls after the rains. It was an interesting hike. So many things to see. Loved the sound of the waterfalls and the peacefulness of the whole place, in general."], ["Reviewed November 9, 2017", 5.0, "Beautiful and Serene", "Great hiking area. It even started raining and was even more beautiful. So lush and full of history. Guide was informative and taught us so much."], ["Reviewed November 9, 2017", 4.0, "Wonderful Desert vistas", "Very manageable Go in the morning to avoid heat and fellow day trippers A must see when in PS Centrally located. No big day trip"], ["Reviewed November 7, 2017", 5.0, "Very Beautiful", "We tried to take a tour, but were unable to as the tour guide we called was booked for the day. We were driving around and found the Indian Canyons. The admission is very reasonable, so we drove up to the trading post where a ranger gave us some information about the area. The grove is beautiful, we were unable to hike as we were not prepared with the proper hiking shoes. I believe the hike is moderate level. The grove of palm trees is beautiful.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Spectacular desert hiking oasis close to town", "Spent about 3 hours hiking in Palm canyon doing the valley Palm canyon trail and then the 3 mile Victor trail that returns back to the park hq. Beautiful Oasis where palm trees line the small stream that runs through it. Lots of hikes to choose from and well worth a half day. It costs 9.00 per person to get it.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Great half day trip", "Really neat micro environment in the middle of the desert. A WOW for us from the East Coast. Worth the trip"], ["Reviewed November 3, 2017", 5.0, "Super cool area with cool history", "Great area for hiking and checking out nature. Also home to the only type of palm tree indigenous to california. Lots of different areas to wander the trails and explore but make sure you bring enough water."], ["Reviewed November 3, 2017", 5.0, "Beautiful Area with Helpful Rangers", "It's a short drive from Palm Springs. Seeing the vegetation from the road was ok, but you really need to do at least part of the hikes to see the area. There are a couple of easier hikes here with awesome views. The rangers are very helpful in helping you determine what you can do.\n\nAndreas Canyon was a great mile long hike. Much of it is shady. Wear hiking or tennis shoes for the most comfort because it is dusty. A beautiful stream runs through most of it. If you aren't up to hiking, you can see part of the area and stream from the parking lot. Rangers recommend a bottle of water per hiker on the trip.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Beautiful and refreshing...", "Strolled along the Andreas trail and the creek was a nice surprise. Lots of shade and beautiful scenery with the imposing rocks and the surprising vegetation. Did not try the more demanding hikes but on a cooler day, would definitely try them!"], ["Reviewed October 30, 2017", 5.0, "Andreas Canyon Trail - a perfect low impact hike", "The trailhead is an easy 15+ minute drive south from downtown Palm Springs and as long as you stay on Palm Canyon Road, you can’t miss it. The entrance fee is per person and reasonable when you consider the number of trails you have access to. We chose the Andreas Canyon trail, which is posted as being over a mile with slight changes in elevation. With appropriate shoes and a bottle of water, this leisurely hike meandering through desert and palm trees along a stream can be done in a little over an hour. A camera is a must because the views are fabulous. Unfortunately, we had not planned ahead and learned upon our arrival that there were scheduled Ranger talks and Ranger escorted trail hikes. We will definitely return to take advantage of these offerings as well as hiking more of these wonderful trails.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Indian Canyons", "Good for beginner or advanced hikers. We did the hour long canyon tour. It was so interesting. You will need water and good walking shoes. Better to do early morning before the temps get too high. Gorgeous scenery and very friendly and helpful staff. Small charge at the gate/per person to get in. Close to Palm Springs\nShow less"], ["Reviewed October 24, 2017", 5.0, "Outstanding hikes!", "Lots of different hikes for different capabilities. Lots of shade in the oasis areas to catch a break. And the water areas are very special in the desert - beautiful location. These are our favorite spots to take a hike.\n\nTake them seriously about snakes. We came across 2 this past spring.\n\nOnly hiccup - during the very busy spring weekends, the line to gain entrance is a bit ridiculous. Speaks to the popularity of the canyon, but they really need a better way to speed up the line.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Nice place", "Very nice place to spend a few hours. You can chose between shorter or longer hikes. Going on a cooler day, we stayed for a rather short visit, probably would have enjoyed better on a slightly warmer day. Entrance fee for a family isn't cheap, yet well worth it.\nShow less"], ["Reviewed October 18, 2017", 5.0, "it is a privilege to be able to go into these sacred and gorgeous grounds", "I went to the famous dinner in the canyons and was not only impresed but elt like i really was in hallowed ground. this san adreas canyon is just gorgowus and very sacred and rightfully so to the agua caliente band of cahuilla indians. once a year they open it to the public for a fund raising dinner in support of their museum and i think it is the best venue ever! between the towering mountatins and the georgeous palm trees, you are just in awe of the great beauty that has been preserved for so many generations. kudos to all. get a pass and go hiking. you will feel wonderful\nShow less"], ["Reviewed October 18, 2017", 5.0, "Fantastic!", "It's $9 per person and FREE to get a guided tour which was amazing! You find out so much about the area, the history and it can be an easy walk or you can do several other great paths."], ["Reviewed October 15, 2017", 4.0, "Sunday morning hike!", "Loved the Andreas loop hike which was in the huge fan palms and so much to see and enjoy along the 1 mile loop. The Murray canyon and palm canyon were just ok and too hot to enjoy them after the andreas loop. $9 per adult gate fee and go before noon if you can and beat the heat.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Best hike of our trip", "We hiked through Murray Canyon to the waterfall. No one was around and it was just beautiful and relaxing when we got there!"], ["Reviewed October 9, 2017", 5.0, "Wonderful day", "Another wonderful spot to visit while in Palm Springs\nHike the beautiful trails of Indian canyon\nThe fee to enter is 9.00 per car\nSee the beauty of the mountains and the trees\nBe sure to bring a hat and water as it is very hot and you are out on the middle of the heat with no tree coverage in spots\nRespect the nature and the signs\nShow less"], ["Reviewed October 3, 2017", 5.0, "Must visit", "We thought the Palm Canyons was awesome! Maybe cos they were the only greens around in the summer and still provided the necessary shade to keep us cool.\n\nVarious trails exist depending on your preference. Some are easier and some cover more difficult terrain.\n\nA visit to the Indian Canyons gives you access to the Palm Canyons, Andreas Canyons and Murray Canyons.\n\nBe prepared with suitable walking shoes and enough water.\n\nVisit the Trading Post at Palm Canyons for refreshments or to soak in more of the Indian culture.\n\nHorseback riding is possible on some of the trails in the Indian Canyons.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Love this trail", "This is a great hike , hiked when it was great weather , nice views. Went with couple friends and had such a great workout and time. If you go in the right time you can find lots of water at the waterfall."], ["Reviewed September 29, 2017", 4.0, "Great hike", "I love to hike and this was my first desert hike. I went around mid-day with my husband and we did a short hike (1 hour). It can get hot and there are some areas that can be harder to hike, but overall it is fairly easy to get around if you like outdoor hiking. (why else would you be looking at this review if you didn't )\nShow less"], ["Reviewed September 21, 2017", 4.0, "Scenic desert views", "We hiked to the waterfalls.. a little disappointing.. not much of a waterfall but none the less.. a nice hike.. make sure you bring plenty of water.. a good portion of the hike is in the desert sun"], ["Reviewed September 20, 2017", 5.0, "Best Experienced on Horseback", "These views of the canyon are best enjoyed on horseback! The unique rocky landscape offers a river lined with palms to lizard inhabited rocky desert mountains. You can easily drive into the canyon once the park is open to hike their many trails for a few hours or make a day of it.\nShow less"], ["Reviewed September 20, 2017", 3.0, "Hot desert", "There are Palm trees, but the short moderate walk we did was hot stony desert. I liked the walk (1.5 hours) but that was enough. I was thinking there was more to the canyons, and maybe there is, all we found was hot stony desert."], ["Reviewed September 13, 2017", 5.0, "Great find", "We done the Andreas Canyon loop, 1 mile in length along the side of the stream, take a packed lunch, lovely area for a picnic. We then headed over to the Palm Canyon trail, bit of a drop down and a climb back out, wouldn't recommend either trail if you have difficulty walking.\nShow less"], ["Reviewed September 9, 2017", 1.0, "Closed during the week !!!!", "Why only open during the weekends ??? We went there because a cousin of us went there and told us to go there, but we didn't know they only open during the weekend. Why ????"], ["Reviewed September 4, 2017", 5.0, "Realy cool", "Palm Springs is in a desert, right. So when you go to Indian canyon, and off in the distance are all these green palm trees in a cluster, it looks cool. We drove over to them, at the Andreas trail, and walked the mile trail, a must do. Seeing the stream feeding this oasis is cool, seeing the rocks pushed up from below is even cooler. Spend the 45 minutes doing the hike, you won't be disappointed.\nShow less"], ["Reviewed August 27, 2017", 5.0, "\" Lose yourself in this most beauteous and wondrous canyon \"", "Some places on earth are very special when left untouched and as they were always.\nIndian Canyons is one of those places, open your mind and spirit to this ancient beauteous land , respect the area , the ancient spirits still roam this their home .\nOn a lighter note , it's a great place to picnic , hike and wonder freely , great for the entire family , bring plenty of water and wear hats during the summer . We live close by and still visit , every time we go is another great adventure ! Enjoy ~\nShow less"], ["Reviewed August 21, 2017", 5.0, "Awe inspiring experience", "Entrance fees are $9.00 per day per person. Very reasonable for sure. The Indian Canyons out of Palm Springs are incredible. Mother Nature has given us an insight to \"the beginning\". The canyons are very Prehistoric in appearance, almost expected to see Fred & Barney around the corner.\n\nVery diverse environment, Coolness of lower canyons complete with rushing streams,, narrow trails, to dry wash streams (which are fully exposed to the sun) to interesting and sometimes challenging scrambles up and over huge rock formations. Snow topped mountains in the distance.\n\nFALLS: After a few hours of hiking thru a variety of topographies we ventured down the road to find the Sisters Falls. That was an incredible adventure. 16 Water crossings, some are easy to jump over and some I opted to walk thru. Trails are shared with horses. The trail in took us an hour then we came face to face with the most beautiful falls and stream system. Return trip was 45 minutes. Worth every moment.\n\nBe sure to have with you:\nA really good sun breaking Hat,\nSunscreen,\nminimum of 2 litres of water per person or more. On hot days, definitely more.\nBe on the trails early and off the trails by early afternoon. Go back to trails about 3:30 Canyons close at 5pm and you need to be out or will be locked in. We did this canyon system twice during our stay.\n\nDid the Stone Pools later in the trip and was worth every single moment in the heat.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Nice but too hot in the summer", "I did the Indian Canyons at 8:30 in the morning but end it at around noon, so it was really hot in August and I suggest to bring 2 litres of water for each person"], ["Reviewed August 5, 2017", 5.0, "A great way to spend a day", "Well worth the price of admission this is a great destination for a good hike and amazing scenery. Only real concern is rattlesnakes. Be sure you bring water and appropriate shoes. Don't forget your camera."], ["Reviewed August 2, 2017", 5.0, "Amazing desert oasis", "I've taken the kids and family that comes to town, to go hiking here several times. There are some short hikes that are just so neat, and like nowhere else around, at least that's as easy to get to and as accessible. A great day to round it out is to hit Palm Springs for lunch or dinner and walk around the shops.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Gorgeous Andreas Canyon", "We had no problem hiking the short Andreas Canyon loop even in the July heat, though we did have our Camelbacks filled. The best part of this hike is that a good part of it parallels a beautiful running stream dotted with palms. Had we known, we would have brought lunch and supplies to just hang out along the stream. A really nice place to cool off.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Beautiful", "Attendants were friendly, knowledgeable, and very helpful. The hike is beautiful and we are glad we took the attendant's advice and headed out first thing in the morning. Waterfall is beautiful and the canyon is gorgeous with lovely views of the valley. A great outing for family with older children.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Hiking on a hot day", "We did 2 of the hikes here. The Palm Canyon gave us a fairly flat, lovely stroll through the palm-filled canyon. The Andreas hike follows a rocky path along a meandering stream, which provided a cool place to soak our feet as we ended our hiking. I would not consider either of these a \"must-see\" destination, but both were quite pleasant, even in the incredible heat that we had. Be sure to carry at least a liter of water for each hiker, and go as early in the day as you can.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Beautiful place", "Lots to see here and nice for all ages. Hiking is possible. The only reason I did not give this 5 stars is because the person working the entry gate was rather curt with my daughter who is military and thus entitled to free entry. Very surprising. After that, everyone else was great and we enjoyed ourselves.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Stunningly beautiful but bring lots of water and protection!", "Some of the most beautiful scenery but with desert trails reaching 114 degrees plus the rangers are not kidding when they say you need to stock up on water. It can be very dangerous if you don't. That being said it's insanely beautiful and a must do! Shout out to ranger Ralph who helped me out a whole bunch during our one on one ranger talk!\nShow less"], ["Reviewed July 8, 2017", 5.0, "Now we know why its called Palm Springs!!", "This place is amazing! So peaceful. And cool. These palm-lined springs provide so much shade and breeze its a heaven send from the relentless desert heat. Great place for a picnic and a walk."], ["Reviewed July 6, 2017", 5.0, "A must for any visit", "This place is magic, Herb Ritts captured it in the 80's. This place blows your mind how beautiful it is."], ["Reviewed June 29, 2017", 3.0, "Unusual", "This was a very fascinating place - be sure to wear covered shoes - as it was very hot we wore thongs and it was suggested that we not hike as to wildlife"], ["Reviewed June 27, 2017", 5.0, "Great hiking!", "Loved the different hiking options here! Lots of variety and beautiful palms and rock formations! Not for the inexperienced hiker when it is hot. Bring lots of water and go as early as possible if it is going to be a hot day! Loved the rock formations at Andreas Canyon!\nShow less"], ["Reviewed June 27, 2017", 5.0, "A prehistoric delight", "Wandering amid the plams is like either being in the Jurassic - or Morocco. the fact they are native palms is amazing. We loved stumbling across signs of past Indian use. there are a few reproduced Indian lean-tos near the Murray car park.\n\nNote that there are 3 valleys. Two can be accessed from the same place, but you will have to drive to the pretty little Visitor Centre to get to the biggest one. I must say I found exploring upstream on both the smaller ones really beguiling. The walk between them is in full sun and full desert though. beware the 2 mile hack! There is a pretty little waterfall behind the visitor centre if you do not want the challenge of getting back up from the oasis in palm canyon.\nShow less"], ["Reviewed June 20, 2017", 5.0, "A hidden gem", "We visited during the heatwave (in the morning), and were able to visit 2 of the 3 canyons! It is an oasis.... can even get down into the creek and splash around! Cheaper entry during the summer months!"], ["Reviewed June 14, 2017", 4.0, "Be prepared for a day of sun and beauty", "Great adventure and memorable photo opportunities when visiting Indian Canyons. With several paths to venture across, you can visit multiple times and never have the same experience. Be sure to pack lots of water and comfortable shoes--a hat wouldn't be a bad idea either."], ["Reviewed June 7, 2017", 5.0, "Wonderful Place to Hike", "This is an amazing place in the midst of the Palm Springs dessert. The hikes pass springs and interesting rock formations. The hike is not difficult although there are some modest elevation gains."], ["Reviewed May 31, 2017", 5.0, "Cool hiking trail through palm tree lined canyons", "We've hiked the Indian Canyons a couple of times now. It is a nice, easy trail with very large canyon rocks and lots of tall palm trees. It would also be a nice spot for a picnic lunch. It does close at 5 pm so you just have to make sure you arrive with enough time and be out by 5 or they will tow.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Great place to visit in Palm Springs", "We have been to Palm Springs several times, but just recently learned about Indian canyons. Maybe 10 minutes outside of Palm Springs up against the mountains. It's a beautiful place with tons of beautiful scenery. You can see waterfalls, mountains, and other desert scenery just outside of the city. There are numerous hikes to take some shaded and some directly in the sun. They charge a price for entry depending on the number of people in your car, but definitely worth checking out.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Woasis", "Shockingly cool and wet in the midst of a hellfire desert. Nice gentle one mile hike along a steam under the large perennial palms. Medium strenuous."], ["Reviewed May 29, 2017", 5.0, "Go early and bring water", "Doable hikes in the summer, as long as you go early in day and bring plenty of water. There's some shaded areas but plenty of exposed areas."], ["Reviewed May 29, 2017", 4.0, "As many trails as you can imagine", "Get a taste of California nature at Indian Canyons hiking trails. You drive to the area and either buy a day pass or a seasons pass (a great deal if you are doing more than 10 hikes). There are many trails depending upon what you want to see, the heat, your stamina, etc. It's a clean beautiful park and gives you a chance of scenery from the pool or golf course.\nShow less"], ["Reviewed May 25, 2017", 5.0, "An oasis in the middle of the hot desert sun", "We visited the three hiking areas managed by the Aguas Calientes band of Cuahuila Indians that comprise the Indian Canyons: San Andreas Canyon, Palm Canyon, and Murray Canyon, all quite close to each other and just a short drive from downtown Palm Springs but a world apart in feel and weather. These canyons, easy-to-moderate in length and hiking capacity, are stunning, featuring large palm oasis areas with col temperatures, fresh water creeks running amid hundreds of towering palms and stunning canyon backdrops. The views alone are worth the visit and the $9 entrance fee to the area, managed by the local reservation.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Oasis in the desert", "Local family, out here as often as possible. Whether its Andreas canyon loop,Tahquitz, Palm or the amazing 7 sisters my kids have done it all from young age and always enjoy thereselves for the couple of hours of no Wi-Fi. Great for picnics in any season except for summer. Summer heat is extreme and not for everyone\nShow less"], ["Reviewed May 24, 2017", 5.0, "great place for a picnic and hike", "this is a great place for a picnic and hike, particularly andres canyon which has a nice stream running through it and picnic tables."], ["Reviewed May 23, 2017", 4.0, "desert stream/palm tree hiking", "Doesn't open until 8AM and I there is a fee. The best areas are the Andreas canyon and Murray canyon hikes that you turn off to before the visitor center. After the visitor center is the main about a mile long sort of lush palm tree hike. All the other hikes are quite exposed with intense desert sunshine.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Nice easy hiking", "We hiked 3 miles and found it nice and pleasant with interesting things to see. As you hiked the vegetation changed which I thought was interesting."], ["Reviewed May 22, 2017", 5.0, "Awesome place to enjoy nature", "The rangers were professional and showed exceptional knowledge of the environment and conservation of their park. They showed keen interest in making sure the students understood the importance of their park while also enforcing the rules and regulations to keep us safe throughout our nature walk.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Amazing Oasis in the Desert, A Must See!", "This is our first visit to the Palm Springs area. Our goal is visit as much of the desert area as possible and explore the many hiking opportunities and scenic areas. The Indian Canyons was a wonderful surprise and the photos on the web don't do the location justice! We were pleasantly surprised. The short walk down to the bottom of the canyon and the oasis is a short doable walk. The climb back up isn't too bad as long as you take short breaks as needed. Once on the bottom the shade of the many palms keeps you cool on a hot day. Would definitely do it again!\nShow less"], ["Reviewed May 18, 2017", 5.0, "Great day out", "We had a fantastic day out what beautiful canyon never thought we would find such a lovely oasis as this out in the desert"], ["Reviewed May 18, 2017", 4.0, "Hiking in the sunshine", "My wife and I were visiting Palm Springs for the first time to celebrate our 20th wedding anniversary. Mike at the Hotel California recommended Indian Canyons and he got it right - it's well worth the visit. Stunning views, great vegetation, a range of trails and wildlife - ask my wife about the rattle snake we encountered! Great fun.\nShow less"], ["Reviewed May 17, 2017", 4.0, "Palm Canyon Trail to Victor Trail & Murray Canyon Trail", "We hiked 2 trails in Indian Canyon totalling about 5 hours with many small breaks. We started out on Palm Canyon Trail and ended up going onto Victor Trail to loop back to the Trading Post. Palms dot the trail providing a little shade but it was mostly full sun on the Victor Trail. Nice desert views. Didn't see any animals but did see many lizards and various bugs.\n\nMurray Canyon had a fun trail where you use stones to cross streams. Just let momemtum carry you across and don't overthink it or you might end up stuck in the middle or a foot in the water, lol. We hiked all the way to the end of the trail where there was a small waterfall. There is a bit of elevation at the very end but once you get up over the top, it's about another 5-10 minutes away so don't give up.\n\nIt was only in the mid 70s when we went but with the full sun, it felt much hotter. Bring a hat, sunscreen, sunglasses, water, energy snacks, and wear good walking or hiking shoes. Don't wear sandals because it is quite sandy and it'll just feel ick.\nShow less"], ["Reviewed May 16, 2017", 5.0, "So Close to Palm Springs, yet so Unspoiled!", "We loved our long walk in this park and our experience was worth every penny we spent for admission. Note that this is not a national park, therefore your national park pass is not valid at this location. It is very close to Palm Springs and can be visited in 1/2 day. There are many shady areas with springs flowing by. Picnic facilities are awesome but bring your food and beverage.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Amazing hikes", "Indian Canyons, a collection of short to long hiking trails, is a treasure. Definitely do the mile and a half Palm Canyon trail first if you have limited time. I've never seen anything like this -- groves of natural occurring Palm trees beside sandy stream beds surrounded on all sides by steep canyon walls and mountains beyond.\nShow less"], ["Reviewed May 9, 2017", 4.0, "Beautiful waterfall hike", "We took the Murray Canyon/Seven Sisters waterfall hike and it was awesome. About 4 miles roundtrip and a beautiful waterfall/cave at the end. You need to cross the creek several times but we were able to balance on rocks to keep our shoes mostly dry. Enjoy!!\nShow less"], ["Reviewed May 9, 2017", 5.0, "Beautiful hike", "We enjoyed the 4 mile hike to the Seven Sisters waterfall. The trail winds along a stream that was flowing nicely from all of our winter rain. You cross cross back and forth the river carefully choosing the rocks to step on as you cross. The waterfall area at the end of the trail was beautiful and would be very inviting on a hot day. It was too cool the day we hiked.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Gorgeous.", "Amazing! I wish I would have taken better pictures. These pictures do not give it justice. Went on my bachelor's party weekend. It was a great way to end it. The views are absolutely spectacular. Going back for sure."], ["Reviewed May 9, 2017", 5.0, "Relaxing hike!", "If you're looking for a relaxing place to go for hike, this is the spot!\n\nWith the perfect mixture of sun and shade, this hiking experience was one to talk about! Make sure you take off your boots, and sit on the rocks near the waterfall - its such a special spot (just watch out for water snakes).\nShow less"], ["Reviewed May 8, 2017", 4.0, "Great Day Trip", "We took a day trip to Indian Canyons while staying in Palm Springs based on previous traveler reviews and were not disappointed! This was a fantastic day trip. There are several hikes you can take, short to long. You can spend a few hours or all day. We took the Andreas Canyon, Murray Canyon and Seven\nSisters Waterfall trails. We found the trails to be pretty easy to hike. The Desert Oasis are beautiful. We recommend you go in the morning, before it gets too hot. The only wildlife we saw was a lizard and a snake but the views and vegetation made up for it! Take sunscreen, a hat and plenty of water. It's definitely worth the hike! I think it was about $9 per person to get in. Definitely worth it. I saw there are some guided tours you an do for a lot more money. I really don't think you need to go that route, but that's my personal opinion. I think the Park offers ranger guided hikes at 10, noon and 2 but check the website for more information on that. This is definitely a must do if you like to hike and are in Palm Springs.\nShow less"], ["Reviewed May 7, 2017", 5.0, "Great time!", "Great day at the Indian Canyons. Very beautiful scenery. Nice hiking trails. Enjoyed the waterfalls and streams."], ["Reviewed May 7, 2017", 5.0, "Amazing hiking place", "This trail is magic. Wonderful site seeing. Easy trail for families . Make sure you go early to beat the heat.bring lost of water, sunscreen and hats."], ["Reviewed May 3, 2017", 5.0, "A Drive Through Indian Canyons", "We were lucky to be there just as the wild flowers were in bloom. We were there on a slow tourist day and were able to wander taking photos everywhere. We are certain that the wild flowers here surpass those of other areas of Southern California.\nShow less"], ["Reviewed May 3, 2017", 5.0, "Nature in all its beauty", "gorgeous, peaceful area. Nice place to walk,contemplate, and enjoy natural beauty of the oasis. Recommend highly. We go every year"], ["Reviewed May 2, 2017", 5.0, "Day trip...", "Great place for a morning hike,,or an afternoon hike. We did Murray Canyon. It was a great hike,,not hard,,not easy. The oasis to visit all along the way are very refreshing."], ["Reviewed April 28, 2017", 5.0, "A great park for hiking.", "Great place to spend a day. Only $8.00 per person to get in. All type of hiking trails. The wife and I did a couple of half mile hikes. They have one that's 15 miles out and 15 back. Go early as it heats up in the afternoon. Bring lots of water.\nShow less"], ["Reviewed April 26, 2017", 4.0, "Great hiking... beautiful creeks", "Love this place. The main hike can get busy but just a little ways away, there is solitude. We wandered in the creeks and the waterfall was a good size. Not flush toilets only out toilets ! Go early first thing to avoid the crowds !\nShow less"], ["Reviewed April 23, 2017", 5.0, "Gorgeous and clean!", "We started with the Murray Canyon and did a short hike there (we had our 2 year old daughter in tow). The sights were just gorgeous and the stream was running fast and it was beautiful. The trail was well marked and everything was so clean. We then went to Palm Canyon and did the Palm Canyon trail for a bit before turning around and checking out the waterfall. We actually enjoyed the Murray Canyon more, but both sections were beautiful. Wish we had more time to explore even more!\nShow less"], ["Reviewed April 22, 2017", 5.0, "Beautiful park", "Beautiful oasis in the desert. Brings lots of water. Lots of picnic tables. One of the hiking trails is 15 miles long. Others are shorter. This park is family friendly."], ["Reviewed April 21, 2017", 5.0, "Great Spot for Hiking !", "This was definitely a great spot to hit up while in Palm Springs. We rented a car to drive there. From downtown its about a 15 minute drive. Many different trails to take depending on how tough you want the hike to be. Interesting how there's an entry fee to a hiking trail.. possibly to preserve the natural surroundings. Still worth it. I would suggest going early to avoid the heat in the mid day, and to avoid the crowd. A different type of hiking experience for sure as it was almost like walking around in a desert. A very calm and relaxing hike with great views overlooking palm springs!\nShow less"], ["Reviewed April 21, 2017", 4.0, "Lovely walk, beautiful Oases", "Look for shady parking, grab your water, sunscreen, hat/umbrella and choose the Murray Canyon trail for an introductory walk to the area. The walk itself is very easy, wear good shoes - at an easy pace it took us about 25 min to reach the oasis. There is very little shade aside from the trees in the oases and if the season is warm begin early (like 8 a.m.) no matter how short the walk is!\nShow less"], ["Reviewed April 21, 2017", 5.0, "BEST real views of the glorious desert oasis", "Don't miss this gem in the desert a walk around this desert oasis will change your perception of the desert and open your eyes to the beauty of Palm Springs nature. NOT to be missed if you enjoy the out doors. Enjoy a nice walk and take in the scenery of palm trees, streams and the desert oasis.\nShow less"], ["Reviewed April 19, 2017", 4.0, "Indian Canyon", "went by car, nice drive to the park. lots of hiking trail and a very interesting area. Bought two hats at the gift shop."], ["Reviewed April 18, 2017", 4.0, "great hiking", "We spent a morning hiking in Indian Canyons - so nice to combine a fun town like Palm Springs with some scenic hiking. Well worth the entrance fee!"], ["Reviewed April 17, 2017", 5.0, "Good hike", "A relatively easy hike for anyone, including children (although not necessarily elderly people - depending on their fitness level). Make sure you have lots of sunscreen and bring some water. The reward is the waterfall at the top."], ["Reviewed April 17, 2017", 5.0, "A worthwhile area to visit", "Yes It costs 7 dollars to get into the area, but worth it ! So many lovely hikes very close to town. Take lots of water. Rain or shine a nice area for all age groups to experience."], ["Reviewed April 16, 2017", 5.0, "many good and varied trails.", "We went up Murray canyon this year and Palm canyon, Fern canyon last year. All the creeks are high this year and you are not likely to reach the falls at the top of Murray without some feet wetting, but dont let that stop you. It is about 15 - 20 minutes out in the open from parking to the start of the canyon. Then you are in and out of the palms as you cross the creek frequently. We did not see any of the possible mammals, but birds and flowers are out. We saw one rattler, so best to stay on the trail. You are not allowed to scramble the last short distance to the actual falls, but many folks did as it is quite easy.\nMurray is marked as an easy trail and it is except that rocks get slippery at the crossings as one parent found out, going down with a child in arm.\nIndian canyons is a bargain at $14 for two seniors. Go early, go often\n\nVery enjoyable hikes with good views.\nShow less"], ["Reviewed April 14, 2017", 5.0, "Prettiest Hike of our Trip", "We did the Palm Canyon hike at Indian Canyons. It was a easy hike and took about an hour. The hike was beautiful. It starts off through a beautiful palm grove with a stream and then winds its way up some hills to give you a lovely view of the valley.\nShow less"], ["Reviewed April 14, 2017", 5.0, "FABULOS!", "I did the Indian Canyon walk several years ago, when I still had two feet! My husband took the easiest walk with me and a friend. We were told that this walk should take us one half hour. That was fine for healthy people, but not for me! Our friend and my husband stayed back with me, and encourged me along. It took me two hours to do it, ut I did it. Now of course, I would not be able to do it, but the memory of this challenge is something that I cherish!\nWe take all of our out of town guests here. This is an experience that I think all people that come to the Palm Springs area should partake of. The walks that are escorted by the rangers, with the information given is always very interesting and informative and it is only six dollars per person.\nI think that the Indian Canyons should be a must for all!\nShow less"], ["Reviewed April 12, 2017", 5.0, "Perfect Morning Walk", "Go early (before 11) due to heat and crowds. Beautiful 1 mile loop at Andreas Canyon, and longer hikes elsewhere."], ["Reviewed April 12, 2017", 4.0, "Secret oasis.", "Beautifully area and scenic . Lots of trails and with palms and water. Parking area small. A gift shop and snacks sold but other then that not a lot of choice to eat . Recommend you bring your own food as there are some tables."], ["Reviewed April 11, 2017", 5.0, "Great Golf Course", "I really like Indian Canyons South Course. A great 18 hole regulation golf experience. This course is well maintained, and staffed with nice People. The Restaurant is also above ordinary. Good food, and Libations....I would highly recommend it."], ["Reviewed April 11, 2017", 5.0, "A must Visit for Palm Desert", "Great hikes for beginners to hard core hikers. Several trails that are all great to take. There is a entry fee but there is a discount for seniors and free for military."], ["Reviewed April 10, 2017", 5.0, "A Hike in the desert oasis", "Come early in the day to avoid the heat. Spectacular desert environment to hike--there are short and longer hikes that take in a variety of views, fauna and flora. Make sure you take lots of water before you hit the trails."], ["Reviewed April 10, 2017", 5.0, "City of Hope fundraiser", "Best wildflowers, grasses, water flow in many years. Gorgeous hike and views! Historic Native American structures, guide information about the Pacific Trail nearby."], ["Reviewed April 10, 2017", 5.0, "Well Worth A Visit", "The Indian Canyons is a large park, and the ancestral home of the Aqua Caliente Band of Cahuilla Indians. The canyons are especially sacred to the Aqua Caliente people today and are historically important to scientists and nature lovers. The canyons have many interesting scenic views and ideal for those who also enjoy hiking. The Palm Canyon, near the Indian gift shop, is a beautiful spot for hiking as well as excellent photographs. Go early in the day to avoid the heat. Stop and take a photo of Split Rock after driving through it on the main road.\nShow less"], ["Reviewed April 8, 2017", 5.0, "Lovely Hiking", "Stopped at the PS Visitor Center and Joe recommended that we visit here. He was right!\n\nWe didn't know about this place beforehand so didn't come ready to hike. However, we meandered about a mile along the Palm Canyon Trail and enjoyed it immensely!\n\nThe babbling brook and stately trees combined for a very pleasant experience.\n\nThis place is also geared towards serious hikers as well as equestrians. The park area is huge and nothing felt crowded. Very well done indeed!\nShow less"], ["Reviewed April 7, 2017", 5.0, "Beautiful", "Do visit Indian Canyons as it is beautiful but go before the heat and the crowds. It is well worth the visit. You will love it."], ["Reviewed April 6, 2017", 5.0, "A great place to hike", "There are a lot of hiking trails available at this reservation park. The trails are well marked as to their difficulty and length. Trading post staff was helpful with suggestions as to which trails to use. We enjoyed two of the easier trails, the Andreas Canyon loop and a portion of the Palm Canyon (first mile from trading post). Beautiful area with a lot of palms lining a still running spring (in April). More shade than most of the other trails. Bring lots of water.\nShow less"], ["Reviewed April 6, 2017", 5.0, "Unbelievable place.", "This is a really neat place, truly an oasis in the desert. We did the short hike and loved it. Bit slow at the gates to get into the park, but don't let that deter you from visiting."], ["Reviewed April 5, 2017", 5.0, "Breath taking", "yes, this walk is jaw dropping, camera can't catch what your own eye can see there. This is a must walk, not difficult to walk. The Barrels (cactus) are huge, standing majestically almost a meter tall. I must go there when all blooming, but again easy to walk, this is not a hike and expect unexpected.\nShow less"], ["Reviewed April 5, 2017", 5.0, "You Truly Understand Why Palm Springs is called Palm Springs", "We did the Seven Sisters Waterfall hike. It was a beautiful day (30 degrees), the sun was out, the vegetation was beautiful, the geckos adorable, and the hike memorable.\n\nWe hiked about 3 miles (about 2.5 hours) up medium level terrain. The hike itself isn't to strenuous, however, there are some rough parts and you will get your feet wet (but that was part of the fun). The pay off isn't a huge waterfall - but it truly is about the climb with the Seven Sisters Waterfall.\n\n(A good hike for slightly active participants who are looking for a slow scenic hike)\nShow less"], ["Reviewed April 3, 2017", 5.0, "Wow! Flowers!", "There were so many flowers, it was beautiful! Someone said that this is the first time in 20 years they have seen so many flowers. Likely from all of the rain."], ["Reviewed April 2, 2017", 5.0, "Beautiful area, fun hiking", "This is a beautiful spot south of Palm Springs, owned and run by the Agua Caliente Indians. We hiked the Andreas Canyon trail (relatively easy and shaded on the way out), and enjoyed it, then drove to the trading post and walked a tiny bit of the Palm Canyons Trail. Lots of fun, very enjoyable. Not very crowded when we were there, afternoon on a Friday.\nShow less"], ["Reviewed April 2, 2017", 5.0, "DO NOT MISS Indian Canyons!", "I haven't hiked in 20 years. What a wonderful way to find my way back to the beauty of exploring nature on foot. Every trail has its own remarkable beauty. The Indian guides are ready to offer advice and help you match your skill level to the appropriate trail. Any trip to Palm Springs would be incomplete without a visit to Indian Canyons. These hikes were the highlight of my trip!\nShow less"], ["Reviewed April 2, 2017", 5.0, "Pretty natural desert Oasis.", "We hiked Palm Canyon, Murray Canyon and Andreas canyon. We did Palm Canyon first because it's at the end of the road. I would advise carrying a map as the Palm canyon trails are not super well marked. After Palm Canyon we made our way back near the beginning of the park and hiked Murray Canyon. We found Murray Canyon really fun because we had to cross the stream a total of about 16 times. My advice is to wear shoes that you do not mind getting wet because it is much easier to wade through the water than to rock hop. Finally we did Andreas Canyon which was the easiest and shortest trail. It is a loop trail.flowers have bloomed all over Indian Canyons right now so it is a good time to visit.\nShow less"], ["Reviewed April 1, 2017", 4.0, "Very pretty but can be crowded!", "We visited this location two consecutive days. The first day we hiked up Palm Canyon to Stone Pools and then took the longer ridgeline trail back. We started right after 8:00 AM and once we left the palm oasis there were hardly any hikers. Thoroughly enjoyed the walk admiring the many wildflowers. We didn't ask if the profusion of flowers is normal or if this area is experiencing a bit of a super bloom due to all the spring rain. Regardless, the colors were excellent. We then went to Andreas Canyon which is a short loop hike. Also very pretty with soaring rock walls towering overhead. As it was later in the day, the walk was crowded, though since it is a loop and most people walk counter clockwise the crowds weren't too oppressive. The second day we went to Murray Canyon but didn't get started until 9:30 am. The hike was quite crowded and as it is an out-n-back, there was plenty of \"people dodging\". The trail crosses the creek numerous times and we had to do some serious rock hopping to keep our boots dry. Most people wore tennis shoes or river sandals and just waded all the crossings which would have been much easier. The canyon itself is pretty but the waterfall at the end is a bit anti-climactic as there isn't that great of a view. All in all, despite the $8.00 per person fee each day, we enjoyed the experience. There are many trails available and many options to get away from the crowds on the less popular trails.\nShow less"], ["Reviewed March 30, 2017", 5.0, "Amazing Hiking", "This was one of the most beautiful hiking trails I have ever been on; this is a must see while in Palm Springs."], ["Reviewed March 30, 2017", 4.0, "It just takes you to what the past might have been.", "Not the cleanest, but trail is great, good for kids and the desert with hairy untrimmed palms is a genuine experience. After the desert dryness, even the little stream is a pleasure."], ["Reviewed March 29, 2017", 5.0, "Beautiful. Bring cash and water.", "Hiked the Murray trail to the seven sisters water fall. Beautiful hike through open flower covered rocky terrain that gives way to a hilly climb traversing a fast flowing creek. You will get wet feet. Not a hike for very young or very old. Although you can modify it to make it work by turning back when it gets steep or you've had enough. The falls are not impressive but it's the journey not the destination that is worth the trip. Not sure but my guess is it took over 3 hours round trip without a lot of tests. The entrance gate only takes cash. Bring lots of water.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Indian Canyons Palm Trail", "My family did the 3 mile hike-all I can say is we are SO glad we didn't miss this gem. A moderate hike suitable in running shoes with exquisite views, shady walks along an oasis of palms. Viewpoints were stunning. Well worth the entrance fee."], ["Reviewed March 29, 2017", 2.0, "Just not right!", "I was very excited to go hiking here. It was a long wait to get into the park and pay the fee. Unfortunately at 11am there was no available parking. Even an employee was waving at people to back up and go down the hill. We checked out the other trail for parking and yep no parking there either. So why did they take our money and let us drive in? Just not right. So my suggestion is to put a sign up that says lots are full before you take my money.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Absolutely worth it", "Breathtaking views. Amazing Palm oasis. Clear hiking trails. Bring plenty of water, cash for admission and plan to get dirty because it is very dusty."], ["Reviewed March 28, 2017", 5.0, "Unbelievable hikes just step away from the city", "Indian canyon is a park with hiking and horse back riding. Beautiful waterfall and an oasis of California palm trees are two of the many highlights. There are several mostly shady hikes and others out in the sun, but all were moderate. The hardest part was the climb down from the trading post. My only hesitation was the sign about the rattle snake habitat! Luckily we didn't see one. The cost is 9.00 per person and is worth the price. Trails were well maintained and marked. Another must experience if you are in Palm Springs.\nShow less"], ["Reviewed March 28, 2017", 5.0, "A must!", "Close to downtown Palm Springs this is an absolutely perfect way to spend a few hours. We were lucky enough to visit when the wild flowers were out and the weather was perfect. Stunning vistas."], ["Reviewed March 27, 2017", 5.0, "Great desert hiking", "We had a wonderful time hiking in the three different canyons. We are not experienced or serious hikers so we followed the easy trails which were very interesting as they each offered different terrain and things to see. We took our lunch with us and enjoyed eating by the stream.\nShow less"], ["Reviewed March 26, 2017", 5.0, "Fabulous Hike", "It was about a 30 minute wait to pay at the fee gate since we arrived about 10am on Saturday. However, the wait and fee was worth it.\n\nWe did the Palm canyon to victor trail loop at the trading post. Do it in opposite direction!! Then you end with the shade and palm trees on your way back.\n\nThe Palm tree oasis is fabulous. The flowers were in bloom on the victor trail, so it's a big change of scenery in 3 miles.\n\nShow less"], ["Reviewed March 26, 2017", 4.0, "Nice halfday trip for Palm Spring Visitors", "After a few days of playing golf, shopping and dining in Palm Springs, Indian Canyons is a very good alternative to explore the surrounding nature at it's best. Various trails lead you through beautiful canyons. Bring water during summer season."], ["Reviewed March 23, 2017", 5.0, "Desert hike", "We've hiked the Murray Canyon many times and it is always beautiful. This year the desert is having a superbloom of cacti and flowers due to exceptional rains that have ended the California drought. So we hiked the Fern Canyon Trail and joined up with several other trails for a six mile loop. The flowers were unbelievable, the hills green with grasses and shrubs and the vistas incredible. Take lots of water. And a good trail map if you are doing these desert hikes. Go early to avoid the crowds. You can't beat it. Spectacular.\nShow less"], ["Reviewed March 23, 2017", 5.0, "Lovely Hike", "Don't miss Murray or Andreas canyon hikes- first right turn after toll gate-but also check out Palm Canyon at the end of the road.. I especially like that the snack bar there has water and snacks at a reasonable price- they COULD easily gouge up prices but instead charge same as grocery store- refreshing! They have water there but be safe and bring lots of your own.\nShow less"], ["Reviewed March 22, 2017", 4.0, "Update to a previous 2012 review", "The trails and the drive into Indian Canyons continue to be a great experience. At the main parking area there is a small canteen and gift shop for souvenirs. For handicapped or seniors be aware that walking trails involve very steep climbs so may not be suitable for some. Trails are very impressive and worth the time to experience. Beware of rattle snakes. Return here every time we are in Palm Springs. Modest price for parking.\nShow less"], ["Reviewed March 22, 2017", 4.0, "Hiking", "Excellent hiking this time of year at palm canyon , Murray canyon and tequita canyon. All worth the time with palm canyon hike by the river and then looping back on top back to the trading post our favorite"], ["Reviewed March 19, 2017", 5.0, "Superb hiking and walking areas - a number of trails to choose from.... all very well administered.", "Bit confusing on Trip Advisor, there are individual trails all of which have individual reviews, and I assume this is a review of all the trails.\n\nThere is a \"Checkpoint\" where one pays $10 for a car to enter the area (The area closes at 5pm and they will tow cars out after thismtime at your expense). From there one chooses which trail to follow. We just kept driving maybee a mile or two and found a car park near the main restroom and shop. This was the start of Palm Canyon trail which turned out to be a superb afternoons hiking. Great for photography, walking and having a picnic - by a long way our highlight of Palm Springs.\n\nOnly downside was a fairly miserable lady serving in the shop. If whe had been bothered we would be able to review some small snack or other. As it is she wasnt - so we aren't. However the overall experience was superb !\nShow less"], ["Reviewed March 19, 2017", 5.0, "Wow! Now we know why it's called Palm Springs!", "While it was quite hot when we visited, we enjoyed doing a portion of the Palm Canyon hike. This year, with double the usual rainfall, the water is running beautifully in the canyons. It's truly wonderful. The palms are spectacular and the environment is stunning. We will return and make sure we come early and have more time!\nShow less"], ["Reviewed March 18, 2017", 5.0, "Great place to hike and explore.", "Beautiful views and hiking. Trails are well marked and rated for difficulty. Perfect for outdoor adventurers. It costs under $10 to get in and you can stay until 5pm. I recommend bringing your own food and of course plenty of water if you are going to be there all day. There's only one place to get snacks and it's out of the way of some of the hiking trails. Otherwise this is a great experience!\nShow less"], ["Reviewed March 18, 2017", 4.0, "Rare rain!", "Unusually, for Palm Springs, it had rained the night before our first visit and the river was full and too deep to be crossed safely. We had a pleasant walk there through the oasis and desert to another oasis.\nThe centre has a shop and toilets. A ranger was on hand to answer questions. He also led informative walks.\nShow less"], ["Reviewed March 17, 2017", 5.0, "We Did It!", "4 friends...60's & 70's....did a couple hikes here, and were SO fourtunate to see the desert in bloom. Terrain, rock formations and vegetation amazing! Second hike was a 3 mile loop, which probably would have been great if we had started a bit earlier, but we fought through the unseasonal warm (HOT!) temps. We spent the afternoon celebrating our survival of the desert elements!\nShow less"], ["Reviewed March 17, 2017", 5.0, "Beautiful trail with some nice oases!", "Took a 2 hour horseback riding tour and thoroughly enjoyed it. Well worth the price as you go on a very interesting trail up the canyon and mountains."], ["Reviewed March 16, 2017", 5.0, "Go at 8 am on a hot day", "There are lots of lovely hikes to explore, but you don't want to be out in the heat climbing up the hills. Go early! Helpful ranger at the trading post will explain the various trail options, and solid walking shoes and water are a must. Such beautiful scenery! We went from the Trading Post parking lot on the Victor trail, which eventually loops into the Palm Canyon trail, about 90 minutes round trip (we are good walkers). Great variety in terms of scenery, starting on a sunny hike up the hill, and the trail back is along the shady Palm Canyon trail, ending again at the Trading Post.\nShow less"]]}}