{"Irvine Spectrum Center": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Irvine Spectrum Center", "url": "/Attraction_Review-g32530-d116597-Reviews-Irvine_Spectrum_Center-Irvine_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/41/51/a2/irvine-spectrum-center.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1004"}, "address": {"@type": "PostalAddress", "streetAddress": "670 Spectrum Center Dr", "addressLocality": "Irvine", "addressRegion": "California", "postalCode": "92618-4956", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Great all day getaway", "First visited this place when it was only a movie theater and a few restaurants n shops (10 yrs ago) now it’s huge with major brand stores! And they are still adding on and building . It’s become a major shopping hub with excellent restaurants and plenty of free parking . With a major Ferris wheel and ice skating ⛸ during the winter. Fun for the whole family . A tour group could spend the whole day ! It’s either here or South Coast Plaza for me .\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Lots of food choices with the shopping", "The quality (price points) of the stores here aren’t as high as the Fashion Island Mall, but they are still quite nice. The food selection at this mall is very good and it also has movie theaters in the same area as the food and shopping. The layout is very good and practical. I noticed a train for children that meanders through the space and a Ferris wheel too.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Retail therapy on steroids, restaurants galore", "The Spectrum Center is most popular in summer months when swarms of teenagers descend to eat, go to the movies and hang out. The rest of the year, there are more locals there, many to eat at the ever increasing number of restaurants. Retail tends to the teens and young adults, although there is a Nordstrom for higher end products and Target for the normal things. Lots of noise, color, and great people watching. Dress casual, dressing up here in a clean t shirt and shorts without rips.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Average for shopping, not too many choices", "Was recommended by some when my family and I were out at desert hills, in comparison fairly average for shopping"], ["Reviewed 4 weeks ago", 4.0, "One of the places to be in the O.C.", "This is the place to be in Orange County. This shopping center is not as large as the South Coast Shopping Center in Costa Mesa, but it has almost everything you need for the shopping experience. In addition, it has a large Ferris Wheel and Carousel for the kids as well as a motorized train ride that goes through a fair bit of the shopping center. It has lots of stores and some are unique. It is anchored by Nordstroms and Target and has tons of great restaurants. This is the place to be at night as it is magical to see the lights on the attractions and there is life to the place.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Great place", "Hung out there for half a day and loved all the food and shop options. Great Restaurants and great shops!"], ["Reviewed January 22, 2018", 5.0, "Nice outdoor mall", "Lively place to shop & eat with the variety of establishments it has. Free shuttle service from nearby Marriott Courtyard. Classy & clean environment."], ["Reviewed January 22, 2018", 4.0, "Entertainment over shopping", "I’m very familiar with the Irvine Spectrum, it’s my family’s go-to” for everything from Nordstrom’s, Target, movies, food and general free time-filling entertainment.\nThe humongous movie theatre is state-of-the-art, worth splurging on recliners for big family movie nights. In-seat food & bar service are awesome!\nWhile shopping is probably not the biggest draw of this center, the people-watching, unique kiosks, and general entertainment are. From The huge Ferris Wheel, beautiful Carosel, Dave & Busters, virtual reality gaming/racing, to the “Hello Kitty” pop-up, this center can be eye-popping. And, outdoor ice skating in the winter months with plentiful seating to sit back and take it all in.\nThere is an abundance of eating options as well. From affordable to impressive, it’s good for little kiddos, multi-family meals, first date impressions, and power lunches. My new fave place is “Habana”, retro Cuban to the core but, So Cal in its wow factor.\n\nGreat for young families & and moms with strollers. Lots to see, and play. Bubble fountains, trains, ice cream, and lots of walking\n\nCons: really crowded week-end evenings (not an issue during the day), don’t expect to pop-in for a quick meal after 5:00. Every place is packed. If you’re not accustomed to a variety of cultures this may not be a comfortable place for you, especially Friday nights. I personally love it but, I know some people are put-off.\nWhile there is a vast abundance of parking lots & spaces it still can take time & patience to find a spot, rest assured: you will.\nLots of new construction for additional experiences, don’t let that keep you away. It’s all neatly organized and hidden. Irvine Company does everything possible to ensure their properties are always stellar, ahead of any and all competition.\nOne last note: this is a wildly confusing center logistically. Keep your eye on the directories & maps to figure out where you are and where you’re going. Easy to get lost & confused.\n\nHave fun!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Variety of shops, eats and entertainment", "Amusement rides, shopping and dining, Spectrum Center has it all. From a few hours to all day, this is a great place for family, business or just to relax and get away."], ["Reviewed January 21, 2018", 5.0, "Great shops beautiful grounds", "On a business trip to Irvine staying in a hotel close to the Spectrum Center. Beautiful immaculate grounds and fountains. Great restaurants great service nice variety of shops friendly people. Made me want to live in Irvine!"], ["Reviewed January 21, 2018", 4.0, "Living in OC", "Our family used to visit the Spectrum mall every other weekend. My toddler loved riding the train. During the summer, the mall hosted \"toddler tuesdays\". It was packed so if they host this summer, arrive early for free kids activities.\n\nThe stores have smaller selections than other retail chains but we never went for the shopping - Although we always managed to either eat at one of the many food choices or buy something for the kids.\nShow less"], ["Reviewed January 19, 2018", 4.0, "A little like shopping in a theme park...", "I have never really understood the concept here. This can explain my infrequent visits. While there are many good stores and restaurants, they are what for me has become and exercise in walking past at least half of them who cater to an audience younger in age. We had an hour to wait until our movie began, and had enough time to explore a bit of the center. Have not been to a Comedy Club in years and my interest is now back while walking past The Improve. Looked into some promising restaurants, a bit on the high $ side for entrees, but on a Thursday night at 7:30 PM, doing well. If only the 405 South were a bit less used between 4 and 7, we would more than likely be here more often.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Visiting my daughter and her fiance there.", "I was in the park area, which has a cafe, dog park, soccer field, gazebo and play area for the kids. Beautiful area. Quite lovely."], ["Reviewed January 15, 2018", 4.0, "Convenient Mall in Irvine", "This is the only mall shopping in Irvine. Irvine has plenty of strip malls but if you want to do any non grocery store, non Target shopping, you will have to come here. Parking structure is large and there is a ferris wheel there. Restaurants and traditional mall stores. Not surprising that it’s very busy on weekends.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Del Frisco’s", "Went to dinner with our daughter and fiancé at Del Frisco’s. Always a very vibrant scene with wonderful servers. All of our meals were fabulous and our server was very prompt and attentive. Their appetizers are phenomenal!"], ["Reviewed January 12, 2018", 3.0, "Huge outdoor and indoor mall with difficult parking", "It took me almost an hour to find parking space at this mall during Christmas holiday. The atmosphere is relaxing and lots of restaurants, shops and attractions at this mall. However, we picked the wrong restaurant, Seoul Urban which is I didn't recommend if looking for Korean food. During normal season, it shouldn't be difficult to find parking because they have lots of parking space. A main destination when visiting Irvine, CA.\nShow less"], ["Reviewed January 9, 2018", 1.0, "Apple Store", "Incompetent personnel and bad repair quality. Brought in a MacBook Pro Retina for battery replacement. The store took all my information and accepted the device. When stopped to pick up the machine, I was told that only my wife could get the device, as it is registered in her name. It took 30 minutes of conversations with different employees to get the laptop. Upon inspection of the laptop noticed a lot of scratches on the bottom part. The employee stated that the repair did not even open the bottom part as the \"top case\" was replaced only. The long story short - the bottom part is called \"the top case\". So instead of replacing the old part with a new one, Apple repair installed a _used part_. According to Apple - this is their standard policy. Not sure, if incompetent employees are included in the policy.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Lots Here, Crowded, Parking is Difficult", "We enjoy visiting the Spectrum for dinner, movies, and people watching. The only drawback is the parking if often difficult to find spaces especially during popular times (nights, weekends)."], ["Reviewed January 8, 2018", 4.0, "Average mall - the outlets are better", "It is a nice mall if not going for the stores but spending an evening out. The stores are not very many compared to the outlets in California. There is going on some construction work so probably will be different in the summer of 2018."], ["Reviewed January 3, 2018", 4.0, "Great Mall!", "Combined with the other stores across the 405 it is a great plaza where you can find pretty much everything you need. Parking is usually a struggle but they have valet!"], ["Reviewed January 3, 2018", 4.0, "Lots to do", "Whether you're shopping, strolling or looking for entertainment, the Spectrum has something for you. We spent the day there and shuttled over from our Doubletree by Hilton hotel--a real plus. We enjoyed burgers, Dave & Busters and hamburgers, and had a lovely day."], ["Reviewed December 29, 2017", 3.0, "Lackluster center", "We come here regularly for the movie theatre which is great. Also excellent valet parking right at the front and a good variety of food options. The rest of the center though is missing something-I can’t put my finger on it but the place is dead. I find myself walking through sort of aimlessly and even impulse shopping doesn’t happen here-maybe it’s the mix of shops or the layout with some dead ends and awkward corners but aside from the theatre, nothing here would make me come south of South Coast Plaza or Fashion Island.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Irvine spectrum Review", "Always pleasure to walk around the area looking at different stores and eating at various restaurants, shopping at Target and going to movies. Parking never a problem when we went there."], ["Reviewed December 14, 2017", 4.0, "Easy for children", "It is very good to walk in this place for the Young children. They are safe. The different shops are important and privés are good. The People are very gentle."], ["Reviewed December 12, 2017", 5.0, "Christmas shopping", "Perfect center outdoors plenty of parking an amazing selection of stores to choose from. Great place highly recommended"], ["Reviewed December 2, 2017", 5.0, "Great Adventure", "Great place to eat see a movie walk around and go on the wheel ride the places in here a very clean and have reasonable prices."], ["Reviewed November 27, 2017", 5.0, "Best Mall I Know Of", "I never really thought to make a review of Irvine Spectrum since I always just took it for granted, but I might as well give my two cents on it now.\n\nI've been coming here since I was a little boy and it has been through many changes. I remember there used to be a Medieval Times store, a Love Sac store, and a magician store filled with quirky items like puppets and the like all in the same court. There was more space for parking before, but now that's been filled in with new businesses, which makes things a bit more congested and bottle-necked. The Macy's as well has since been demolished and smaller stores will fill in the void. The Improv Comedy Club is still here, but was moved to a spot near the movie theater. The old space has been replaced with a Kona Grill (which I might check out one of these days).\n\nThe movie theater is fantastic and has a lot of screens for new movies, including IMAX where I remember seeing Batman Returns, The Lion King, Star Wars: The Force Awakens, and Interstellar (in 70 mm.). The prices are a bit expensive but I'm a Regal Club member which allows me to get free movie tickets sometimes (I've seen Wolf of Wall Street and Thor: Ragnorak at this theater for free). There is a Dave and Busters, Target, Barnes and Noble, Apple (where I bought the MacBook Air that I'm writing this review with) and other stores, along with multiple restaurants like Subway, The Yard House, Red Robin, Chipotle, Ruby's, CPK and more. The architecture is really nice and timeless, reflecting the region's Spanish heritage while also throwing in some Moorish/Islamic elements similar to the Alhambra. They also have a ferris wheel and carousel and while I've never been on either they both make this place more family friendly and help Irvine Spectrum stand out from other malls and shopping centers. One of the quirky newer additions I like is The Ride 7D, which operates like Star Tours at Disneyland only you shoot at things on the screen.\n\nI have to be honest, this is practically a second home for me. I see people from all ethnicities and backgrounds walking around me which helps make this place so vibrant and full of life. It has the right amount of high-end shops and middle-class fare that appeals to the whole spectrum (no pun intended) and brings everybody in. Definitely one of the best malls I know of.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Definitely worth the parking struggle", "The mall is fantastic, there is a hello kitty cafe that has AMAZING little cakes, and of course theres the ferris wheel!"], ["Reviewed November 15, 2017", 3.0, "Parking is horrendous, stores and restaurants are fabulous!", "Easy access at the 5/405 split.\n\nParking is basically a nightmare. If you have a dinner reservation (go to the new HABANA RESTAURANT, it’s fabulous!) be sure to allow an extra 15 minutes to park.\n\nI know, they have valet stations but they’re not always easily accessed.\n\nGreat restaurants and some great retail outlets that just aren’t around at other places. Where else can you find a “HELLO KITTY CAFE”?\nShow less"], ["Reviewed November 15, 2017", 5.0, "A Wonderful Maze Of Shops And Restaurants", "Wander the paths through fountains and grand avenues to shops and restaurants not seen elsewhere in the area. The theater is one of my favorites."], ["Reviewed November 15, 2017", 5.0, "Great place to shop", "The Irvine Spectrum is a great place to shop and eat and see a movie. It is easy to get to, nestled between the 5Fwy and the 405Fwy, where they merge. There is plenty of parking and a variety of shops and restaurants and a big movie theater. Typically I avoid the weekend crowds and go during the week.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Clean Mall with Pretty Good Selection of Stores.", "The Irvine Spectrum is a great place to hangout for the evening or afternoon if you are in the OC area. The shops comprise of a good amount of smaller named stores that I believe are residents to the CA area. There are also your more mainstream businesses here as well so it is a nice blend.\n\nTraveler Tip: The crowd is a lot of teenagers/college kids from the local schools mixed together with business men and women.\n\nOverall: A pretty good outdoor center with decent shopping options and restaurants.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 10, 2017", 4.0, "Millennial Dream", "One look at the mulling crowd and it’s easy to see that this is a dream place for the young. It teems with youth. So that make it interesting even if we older folk find it’s sprawl a bit difficult."], ["Reviewed November 9, 2017", 5.0, "Great Outdoor Mall", "Great place to see a movie, shop, or get a bite to eat. Always beautiful and clean. Love See's candy!"], ["Reviewed November 9, 2017", 5.0, "It just such a comfortable environment. No matter what time of the season or day of the week.", "There are so many things to do here. From movies, to comedy club, dinner or just to hang out and shop. It is honestly such an awesome place to go with friends or family."], ["Reviewed November 9, 2017", 5.0, "Everything in one amazing place!", "Irvine Spectrum is a destination for Orange County and even for visitors from far away countries. Upscale shops, restaurants for any budget, movie theater with IMAX and visual interest everywhere you look with fountains, ferris wheel, merry-go-round and other delights for children and all who are young at heart. Best of all, our Labradoodle is welcome everywhere. We love to shop, eat, and go to movies in this huge and friendly center.\nShow less"], ["Reviewed November 8, 2017", 4.0, "spectacular spectrum", "shop, eat and drink then watch a movie or go to a comedy club all in one place that is pretty spectacular it is a bit on the pricey side however if you are on R&R who cares."], ["Reviewed November 5, 2017", 4.0, "Good Centre to visit", "It has a lot of brands both for shopping and eating. Neat and clean with lots of washrooms if you need to visit.\n\nHas a large Target store which is very customer friendly.\n\nLots of sitting places for you to rest incase you get tired of walking. The area is all walking and kids friendly. There is ice skating, merry go round, carousal etc for kids to enjoy, Cinemas for you to chill if you want to.\n\nGood place to spend a few hours shopping.\nShow less"], ["Reviewed October 31, 2017", 1.0, "Corporation Have Taken Over The Spectrum", "I have lived in Irvine for over 15 years and over the past 6 plus years the Irvine Spectrum Center has become a place for large corporate establishments, because they are the only ones who can afford the ridiculous rents the Irvine Company is charging. The have completely eliminated the independent restaurants, the night life entertainment and have turned the place into an overpriced outdoor mall that lacks any individuality. The Irvine Company has been destroying Irvine for years, they don;t give a crap about the people who live there anymore.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Lovely shopping complex", "Irvine Spectrum Complex is a great choice for those who want to shop in peace, with a great selection of shops, restaurants and coffee shops"], ["Reviewed October 17, 2017", 5.0, "Loved it", "It's very beautiful place to spend your time at. Big cinema, a lot of well known and different restaurants and nice shops"], ["Reviewed October 16, 2017", 4.0, "Huge outdoor mall", "I always enjoy the Irvine Spectrum especially in the evening during the summer. Fun for the entire family. They have an entire children’s section with rides, play area, shops and food. Splash pad just arrived this year. You can get a good workout if you see the entire mall. Plenty of seating along the path if you need to rest or just want to people watch. Shopping for everyone. Many nice restaurants as well as fast food and desserts of all types. Movie theater as well. Tons of parking. Easy access off the 405 or 5 Fwys. Anchor stores are Nordstrom and Target.\nShow less"], ["Reviewed October 8, 2017", 4.0, "A good shopping venue experience for families.", "A very pleasant shopping mall and entertainment center... Especially good for families and kids due to the activities available, like fairground rides."], ["Reviewed October 7, 2017", 5.0, "Shopping and Margaritas!", "This really is a great shopping mall, but my favorite part of this center is that they have a fantastic Javiers Restaurant here with a large open air patio seating option. My favorite go to items are the skinny margaritas and ceveche ahi. Every menu item I've tried is fantastic.\nShow less"], ["Reviewed October 3, 2017", 3.0, "DEPENDS ON WHEN YOU WERE BORN", "If you are NOT of the MILLENNIUM GENERATION, I DON\"T see much attraction to go visit this place. The shops cater to the MILLENNIAL GENERATION for which my definition of them is (the Millennial generation’s confidence has been argued to spill over into the realms of entitlement and narcissism.) OVER PRICED FOOD EATERIES, overrun by the young MILLENNIUM ADULTS, for which I have NO USE FOR just like they have for those of us born in the 1940's. Therefore I don't have a need to go there.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Everything you want", "Irvine spectrum is one of my favorite spots in Irvine. It has all that you need for a family afternoon outing. The restaurants are great. Lots of variety when it comes to food. You have a big movie theater and major stores. At night the spectrum makes a good place to walk around and relax. The parking situation is getting harder and harder as they are expanding but I hope they can continue to make parking available.\nShow less"], ["Reviewed October 2, 2017", 5.0, "A very pretty shopping experience", "The Spectrum has lots of pretty water fountains, a fun ferris wheel, tons of places to eat, fabulous parking and lots of shops."], ["Reviewed October 2, 2017", 4.0, "Shopping and good eats...", "For an outside Mall this is a very nice one. Lots of great stores and restaurants. It is very well kept and have not encountered any problems there."], ["Reviewed October 2, 2017", 4.0, "Fun place to hang out and shop on a Friday night", "Took the family here on a recent trip to Orange County. Nice outdoor mall with plenty to do. Wahoos was delicious as was the ice cream shop Cream. Upscale clean mall. Activities for all"], ["Reviewed October 2, 2017", 5.0, "Disneyland of restaurants and shops.", "Multiple types of food restaurants, clothing and retail shops in this mercantile collection with a pedestrian mall and a parking garage attached."], ["Reviewed October 2, 2017", 5.0, "Something for everyone and all ages", "It's easy to spend an entire day here and not get bored. For the smaller kids there are rides and trains to keep their interest. For the middle level age kids there are rides, candy stores, Dave and Busters, and 7D ride to enjoy. For the teenagers who want to just hang out together this is a great spot to meet up and check out Zummies, Old Navy, and other trendy stores to get their fashion on. They look at this stuff for hours, not purchasing anything, just talking about the cool tshirt designs. Jonny Rockets, Rubys, Subway, and Chiptole are great family hangout spots and the theater has all the latest titles and recliner seats that the entire family will love. And while the kids are having fun, there are some spectacular high end places to eat and drink for the adults. And did I mention the Irvine Improv is there. Simply put, it is a great place to connect with friends and family no matter what your age or interest.\nShow less"], ["Reviewed September 30, 2017", 4.0, "First visit", "A great place to shop, meet up with friends and family and many places to eat. Plenty of places to sit and enjoy the sun"], ["Reviewed September 29, 2017", 4.0, "Colourful place", "It's a colourful place with many decent restaurants and good place to hang out. Place has huge parking. Nice place to spend evening and have a good meal."], ["Reviewed September 25, 2017", 5.0, "Great Place", "There's everything you need. Name it and it's there. Restaurants, shopping, place for kids to play. It's not even much crowded"], ["Reviewed September 21, 2017", 4.0, "Sunny California outdoor mall", "We stopped in for an early dinner and some shopping and enjoyed some also fresco dining with great sunshine and relaxing breezes."], ["Reviewed September 13, 2017", 5.0, "GeneC", "Very convenient and nice assembly of shops, restaurants and entertainment venues. Range of restaurants go from fast food to deluxe sit down facilities. Shops range from family shopping to upscale boutiques and quality department stores. Movie complex is modern and large number of screens offer good variety of current releases.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Dinner", "A good selection of restaurants and plenty of shops to look at afterward, so you can walk off your dinner."], ["Reviewed September 7, 2017", 5.0, "Buzz", "This place was buzzin. We spent a weekend in Irvine right next to the Spectrum and I'm glad we were there. This place was full of people. The shops were mid to high end. The restaurant selection was unlimited. There is something for everyone."], ["Reviewed September 7, 2017", 4.0, "Gastronomical & Enternatinment Variety", "At the Irvine Spectrum you will not struggle finding a great place to eat or something fun to do. From Dave and Busters to the movie theater there is something to satisfy everyone's desires and from Tender Greens to Cucina Enoteca there someting to satisfy everyone's taste buds.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Pretty much everything....", "I like the Spectrum. Plenty of shopping of all sorts. (Just like a good mall, but outdoors.) Loads of eateries, from casual to high-end. Large cinema complex, Improv comedy. Lots of parking, both self and valet."], ["Reviewed September 6, 2017", 4.0, "Valle parking", "I really like the way they design the new parking lot, with Valle parking, I think the whole area belong to Irvin co, and they really made great ideas for Valle parking improvement"], ["Reviewed September 6, 2017", 4.0, "Parking and walking and enjoying 😊", "Irvine spectrum is not a classic American malls type, many different shops including amazing restaurant options but the most important point is: you walk and enjoy, you feel like you are in Europe!"], ["Reviewed September 6, 2017", 5.0, "shopping", "A great place to bring visitors as it has all the restaurants you would want and a great variety of shops---great place for teenagers"], ["Reviewed September 6, 2017", 4.0, "Join in if you like crowds", "First the bad news. Parking can be a nightmare on weekends - everyone is aggressively looking for a parking place. Valet is available. Completely outdoors so there are few places to rest out of sun. Packed with groups of young people on sunny weekends. Many kiosks line walkways urging you try samples. I find it much more hectic and less appealing than Fashion Island that is also outdoors. The good news is that there is a store to please everyone from Nordstrom shoppers to value priced teen clothing and jewelry stores.You won't find the real high end stores like Fashion Island and South Coast Plaza and so this center attracts many young people. Many restaurant choices from casual like Chipotle to finer dining like Cucina Enoteca. Practically all well known chains have their restaurants here. There is a Ferris wheel for those inclined and a train on wheels. The movie theater is cavernous with many theaters showing a wide choice of top movies day and night. I am a senior and honestly, I avoid this place like the plague on weekends and only go weekdays occasionally for the restaurants since I prefer shopping in more high end stores in other centers such as the two mentioned above. The Nordstroms at South Coast is much better.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Look at it this way, it's \"downtown\" Irvine with all of the city's good and bad in one place", "Here's the good....safe, clean, tons of ways to spend money on things you don't need, lots of people, wide variety of places to eat food you shouldn't and a robot security guard.\n\nHere's the bad...overcrowded on weekends, ridiculously high prices for things you don't need, bad nutritional choices, distances from where you park to the shops on a scale typically found only in Las Vegas, and beige walls for as far as the eye can see.\nShow less"], ["Reviewed September 2, 2017", 4.0, "Fun shopping spot with kids!", "Great place to be able to do some shopping even with kids in tow. The carousel is great and there are lots of restaurants too."], ["Reviewed August 31, 2017", 5.0, "Beautiful and fun", "While shopping was not really our purpose for visiting, the selection of stores and restaurants is great. The architecture and fountains are beautiful and relaxing. Fun area for kids with a grassy play area, Miss Kitty cafe and a mini train ride. Several great ice cream places too! Well worth the visit!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Fantastic outdoor mall & restaurant selection", "Met friends for lunch at this outdoor mall. It's great to walk around in the sunshine, watching people & window shopping. There are a variety of restaurants to choose from...Asian, hamburgers, pizza, pasta, Mexican, etc. You could spend hours here!"], ["Reviewed August 28, 2017", 5.0, "Fun and great choices", "While we do have entertainment centers here in our area in AZ, none can compete w/ the Spectrum. Every time we visit family now-we always want to take a few hours to walk around, see what's new and have a great meal-of which there are a LOT of choices! We can do anything from fast food to fine dining and shop for anything from toiletries to designer clothes!\nShow less"], ["Reviewed August 28, 2017", 4.0, "Great outdoor mall", "It's a great mall. Much better expierience than walking the giant indoor malls. Wish every mall was this cool. Def great if I was local."], ["Reviewed August 28, 2017", 2.0, "Bellow expectations", "I never liked this center but I thought I would give it another try. Well I'm still convenienced that I'm not sold on this center. Nothing Wowed about it. However there were a number of good restaurants."], ["Reviewed August 25, 2017", 5.0, "Great shopping", "Tons of stores something for everyone. Great variety of shops and restaurants. Areas to just sit and people watch."], ["Reviewed August 24, 2017", 4.0, "Very nice open air mall", "Lots of stores. Lots of food options. Plenty of parking. Not as nice as Fashion Island, but very close."], ["Reviewed August 20, 2017", 5.0, "Social shopping and entertainment", "Great ambiance and food, entertainment and retail shopping available for all age groups. Best aspect is the social and rest spots available for relaxing and enjoying the occasion.\nThe restaurants are plenty and offerings to suit all pallets. Theatre's for film and Improv, video entertainment, numerous fountains, cafes and retail with broad offerings. Shaded for hot days and sheltered for the cooler days. Carousal, train rides and fairs-wheel for the young at heart.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Young Americans concert", "Special \"back to School\" events by retailers all day. Free concert by Hanna Eyre from \"The Voice\" fame and \" The Young Americans\". The spectrum offers tremendous variety in shopping, entertainment, restaurants and convenient parking."], ["Reviewed August 15, 2017", 5.0, "Always a vacation stop", "For years my family has been coming here when in CA for the food, shops and people in the Spectrum. Rides for kids, Dave and Busters, Woodranch, Cheesecake Factory and shopping galore. All good stuff here."], ["Reviewed August 14, 2017", 4.0, "Great shopping!", "I was here with my daughter, 13 years old, and there was plenty of good shops for teenagers. The cinema looked nice but we never visited. We had dinner at two places and they were ok. As expected."], ["Reviewed August 13, 2017", 4.0, "Fun", "Good and varied outdoor shopping complex, good parking, many options for dining and entertainment. Clean, upscale, modern feel."], ["Reviewed August 13, 2017", 4.0, "Lots of shopping and restaurants", "Great place for shopping (my daughter loves Irvine Spectrum) and good restaurant options, which I like."], ["Reviewed August 11, 2017", 4.0, "Anything and everything....", "If you don't mind the limited parking, you can spend hours here as there are tons of shops and restaurants. A wide range for all tastes and budgets."], ["Reviewed August 10, 2017", 5.0, "Great place to spend the day", "Great outdoor shopping & dining plaza. Lots of covered shade to walk around while you shop, & chairs to sit & hang outdoors. There's a movie theater & great restaurants to try out each time you visit. Lots of places to get a yummy dessert. A large Ferris wheel that lights up at night. Parking surrounds the Spectrum with outdoor & covered lots, but can get busy on the weekends & during lunch on the weekdays. There's something for everyone!\nShow less"], ["Reviewed August 9, 2017", 4.0, "Improv", "Date night at the improv. Convenient valet parking, no wait to get in, always nice. Food is actually pretty good. Service has improved a lot. Saw Andrew Santino. Great time. Seating a little cramped but it wasn't a full house"], ["Reviewed August 8, 2017", 4.0, "Relaxing and Calm- Entertainment", "This place has several stores, restaurants and ferris wheel which is open on weekends. It's a good place to people watch, relax or have a bite to eat in the evening time. Spacious parking."], ["Reviewed August 8, 2017", 5.0, "Strolling Through The Centet", "Always fun to walk either to go to a movie, eat at restaurants or ice cream stores or Cheesecake Factory. Clothing stores are also great. And The Improv and Dave and Busters. Everything to have fun at this Center and so close to where I live. Perfect!\n\nShow less"], ["Reviewed August 8, 2017", 3.0, "Its ok but....", "Restaurants and shops are fine, movies theater is terrific, but overall, its high priced and parking can be daunting on some sides. They are under constant construction (annoying). Overall, not a bad afternoon, but I prefer Fashion Island."], ["Reviewed August 8, 2017", 4.0, "Spectrum centre. Irvine. CA", "Good shopping centre. Excellent restaurants. Good food. Children amusement rides too to keep them engrossed. Must visit hangout place."], ["Reviewed August 7, 2017", 5.0, "If you want to go shopping, this is the place, it's got it all.", "Irvine spectrum center has everything you need, such as books, cloths, restaurants, cafe, and a movie theater. It is a great plaza to go shopping with families and friends. A must visit if you're ever in Irvine!"], ["Reviewed August 3, 2017", 4.0, "Mall", "This is a large outdoor mall, with plenty of dining options. If you're looking to shop this os a good place to do it."], ["Reviewed August 3, 2017", 4.0, "Pet friendly, relaxing place for teenagers who like shopping", "This mall is great for teenagers who want to see a movie and shop with their friends. It is smaller , more relaxed than Fashion Islander or South Coast Plaza. It is a shame that they lost big stores like Macy's, but Nordstrom is still there. It is easy to find great restaurants for vegetarians and to find a variety of food. There are not a lot of good deals but there are a lot of kids and pet friendly places.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Great Outdoor Shopping", "Always a fun and pleasant shopping experience. A few unique restaurants, cafes, and even a dim sum place. A very good selection of chain restaurants as well. It's such a multifaceted and fun shopping center to browse and eat. It's also a happening place to hang out. Highly recommended.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Good place for a walk and shop!", "I like the area for a good walk around, and plenty of shops too! Besides you have a dozen good places to choose from for dinner and drinks options."], ["Reviewed July 30, 2017", 5.0, "Wonderful outdoor Shopping in the junction of 405 and 5 freeway", "Spectrum is an wonderful place, large movie theater, many stores and very good options for fine dinner and fast food! Kids usually love the fountain during the summer and the ice ring during the winter!"], ["Reviewed July 29, 2017", 4.0, "Shopping center", "1-nice place 2- many shops, stores and restaurants 3- clean 4- with the visit 5- Apple Store 6- movie theatres"], ["Reviewed July 27, 2017", 5.0, "Great Visit", "My family had a great visit to the spectrum. Parking was free, the atmosphere is great, and my 2 year old daughter loved the carousel. I highly recommend."], ["Reviewed July 26, 2017", 5.0, "Nice friendly place", "It is a nice place where you an find all what you want . Apple store there is really nice and big . There is target and nordstorm as well . There is a carousel for kids in the middle if the center and a lot of restaurants if you can ant to have your lunch or dinner . We saw that there is cinema but we didnt tru it . It is a must visit place if you are near orange country\nShow less"], ["Reviewed July 19, 2017", 5.0, "Awesome place!", "This mall is awesome! It is outdoors so it is super nice! A lot of variety of stores and restaurants! I totally loved it!"], ["Reviewed July 16, 2017", 5.0, "High end mall", "Quite an high end shopping mall. Lots of shops and restaurants. Just need to walk from end to end to enjoy a relaxing shopping experience. Nice to come late afternoon as it will be cooler in summer."], ["Reviewed July 13, 2017", 5.0, "Clean and Safe", "This outdoor center is clean, appears safe and is well attended. Outdoor spaces are kept up well. Super fun to people watch. Tons of stores, many events at many stores, movie theater, and restaurants! There is a nice nail salon too.\nAdding even more restaurants and retail spaces. Parking is easy, they have valet and you can have food delivered to your car curbside from the restaurants. Oh, and in the parking structure you can opt to have your car detailed while shopping! I love this part of California Living!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Disneyland for Shoppers at this Southern California Destination!", "Californians tend to \"go big\" when they do things. Examples: We are the home of Disney, Hollywood, Apple...and just look a our freeway system! We've now taken shopping to that level with the Irvine Spectrum. Located in Irvine...a master planned, picture perfect SoCal community, the Spectrum beckons shoppers and foodies alike. As locals, we often joke that eating our way through the Spectrum is a perfect way to spend an afternoon. Lots of restaurants to choose from, a wide variety of stores ranging from Target to Nordstroms, entertainment including an Edwards megaplex, and Dave &Busters, Barnes and Noble bookstore, an Apple Store, and many other options. Plenty of places to sit and people watch, often there is live music on a Friday or Saturday in the summer, a mini ice rink in the winter, and a Ferris Wheel to get a birds eye view of the area year round. It's a nice place to visit.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Great mall, can spend hours there", "The Spectrum is well equipped with a wide variety of shops and eateries. From a Target department store; to clothing stores such as H&M, Charlotte Russe and Old Navy; to restaurants such as Red Robin, PF Chang's, California Pizza Kitchen, and Ruby's Diner. TLT is a particular favorite, serving mexican cuisine such as tacos and nachos with a twist.\nThe main attraction is obviously the Irvine Spectrum big wheel and the carousel (a favorite with kids).\nWould definitely recommend, especially as a family outing.\nShow less"], ["Reviewed July 11, 2017", 5.0, "This is an amazing place", "I often go to the Spectrum Center in Irvine this is an amazing place that has everything for the family including restaurants shopping and entertainment. It's very clean and safe for whole family. Plenty of areas to valet and Park"], ["Reviewed July 10, 2017", 3.0, "Shopping", "Offer lots of choices for dinning and shopping within the mid price tag. One of the newer shopping malls I have visited. Visited the place over 4-5 trips as shopping mall is nearest to our hotel. Recommend Umami burger - Japanese styled burgers with good sizing.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Anything you need!", "This place has everything and almost anything. Lots and lots and lots of shops to visit, nice paths to walk, good for people-watching!"], ["Reviewed July 10, 2017", 5.0, "Shopping and having a great time doing it.", "A wonderful place to take the family for great shopping and great food...You will not be boarded walking around all the great shops...Javiers is a amazing restaurant with Baja style seafood that is out of this world good......"], ["Reviewed July 10, 2017", 5.0, "Train!", "Always a great place to walk around and shop. The kids loved the train ! Great selection of restaurants and even a target for easy go to things"], ["Reviewed July 10, 2017", 4.0, "Something for everybody", "This place has it all, shopping, movies, restaurants. Virtually any type of food is available here from fine dining to quick and inexpensive. We like to visit on the weekends but it can be very crowded and parking is sometimes a hassle."], ["Reviewed July 9, 2017", 5.0, "Very popular place to spend an evening", "The mall has mid to high end stores with neatly landscaped pathways. There are a wide variety of restaurants for eats."], ["Reviewed July 8, 2017", 5.0, "Great place to get it all", "Tons of places to eat, shop and be entertained....they have a cinema, comedy show, Ferris wheel, merry-go-round. A little bit of everything"], ["Reviewed July 5, 2017", 5.0, "Good variety of shops", "I particularly enjoyed going to YoughartLand - best FroYo ever! If you go to Irvine spectrum center try Caseys Cupcakes - heavenly! Plenty of parking and the cinema is a good also!"], ["Reviewed July 3, 2017", 4.0, "It's a mall with a Ferris wheel", "I was prompted to pull off the interstate here because I could see the Ferris wheel from the road. It's not a very big Ferris wheel, but still...\n\nThis is a pretty outdoor mall, with all the usual stores. There are, however, some interesting restaurants (there is also a Subway if adventure isn't your style.)\nShow less"], ["Reviewed June 28, 2017", 5.0, "Euphoria of action", "Just about any type of store or restaurant is here. It is always abuzz. Everyone loves the Spectrum ..... kids, teens, and adults alike ....... and of course, our best friends, the doggies."], ["Reviewed June 26, 2017", 3.0, "Just ok", "Nice fairly clean outdoor mall with tons of restaurants. The stores cater to the young teens. So if your 30 plus you won't find anything worth buying here."], ["Reviewed June 24, 2017", 5.0, "My favorite outdoor mall and then some !", "My favorite place to see a movie.. my favorite place to grab a bite to eat because there are so many options. Variety of retail stores, places to eat, and fun things like Dave and Busters... sometimes my friends and I can't decide where to eat so we end up here at the Irvine spectrum because so many different places to choose from.\nAll of this ... outdoors!\nOh and valet parking for four dollars!\nYep definitely my favorite outdoor mall and then some !\nShow less"], ["Reviewed June 23, 2017", 5.0, "Great shopping center", "Many different stores, food places, ice cream shops and coffee shops. Definitely worth a trip. Don't eat before coming. There are enough choices to appeal to everyone."], ["Reviewed June 22, 2017", 5.0, "Excellent", "I am writing a review regarding my wonderful stay . I have been here for 3 weeks already and received the best of service from Angelica & Charline bartending. Always on top of things with cleanliness and awesome drinks at all times. It has been a pleasure\nVivianne Thomas\nShow less"], ["Reviewed June 20, 2017", 5.0, "This is a Mall that is off the freeway and has a large selection of things to do for all.", "This is a really nice place. It has a lot of finer places to shop as well as some local shops like Target. I like it here they offer a lot of places to eat as well. The thing a bit different is the Merry go round and the Italian ferris wheel . You can ride each for a small price and the views from the top are pretty special. There is a lot to do to keep you occupied.\nShow less"], ["Reviewed June 15, 2017", 5.0, "If your passing through Southern California, Don't miss this!", "The Irvine Spectrum is an open air plaza. Something for everyone. Lots of shops and restaurants. There are enough food choices to accommodate everyone in your party. Lots of entertainment options with the movie theater, Dave & Busters plus the giant ferris wheel. They have a couple of large parking facilities, but it can still take time to find a parking place. If you have reservations or are trying to see a movie, plan to spend some time looking for a place to park.\nShow less"], ["Reviewed June 12, 2017", 4.0, "Vibrant mall", "This is a destination mall that has quite a range of stores from a Nordstrom to Target. There are restaurants that range from fast casual to fine dining. The mall gets crowded on weekends so parking can be a challenge. This is one of the nicest outdoor malls in Orange County.\nShow less"], ["Reviewed June 9, 2017", 5.0, "FUN FOR EVERYONE: SHOP, EAT, DRINK, LISTEN, DANCE AND PEOPLE WATCH - THE NEW URBAN DOWNTOWN OF SOUTH ORANGE COUNTY", "Located seven miles south of the John Wayne Airport (SNA) in the northwest quadrant of the I-5 and the I-405 freeway interchange via the Alton Parkway or the Irvine Center Drive, the sheik, modern, open-air IRVINE SPECTRUM CENTER, the new metropolitan downtown of South Orange County, offers a “naturalize” urban environment in which to shop, eat, drink, listen, dance and people watch. Blessed with bright and sunny skies year round (average of 70 degrees) the Spectrum celebrates the Orange County outdoor lifestyle. The unusual architectural design inspired by the Alhambra (Granada, Spain) is the setting for an amazing array of urban amenities, like the white obelisk landmark that changes color, the digitally lighted Giant Ferris Wheel crafted in Italy (you can see it miles away on the 405), the colorful carousel with its menagerie of animals, and the Alhambra inspired Court of the Lions fountain. Of course, there are cinemas, bars, restaurants, concerts, and department stores. Unlike other large shopping centers, the Spectrum provides an abundance of structured parking and at least a hundred chairs and couches were to sit and enjoy the weather. While there my favorite pastime is people watching: every age, size, and type.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Best place to shop", "I love shopping, eating, looking around & the cinema VIP. Really nice places to eat outside. All shop staff very helpful"], ["Reviewed June 3, 2017", 5.0, "Place to go if you need something to do", "Carousels for the kids and ferries wheels, Dave & Busters for the fun zone, nice restaurant choices, great shops and a 21 theatre for movie lovers, and just about anything you could want to shop for you will find here."], ["Reviewed June 2, 2017", 4.0, "Shopping with and for Adult daughter", "What a shopping centre should be.\nEasy parking near anchor stores. Avenues\nOf current chain retailers mixed with one off stores.\nThe avenues have a sailcloth cover to screen out sun. Many comfortable sitting areas to rest/ wait for The shopper in group. Plenty of activities besides shopping, Including a merry go round for all. Restaurants abound as well.\n\nAs mostly a online shopper this was a great outing with my daughter.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Kids in the wonderland", "The Mall that for all ages visitors, with the merry go round and wonder wheel that are the love of every one, variety of cafes, restaurants and shops that you can have every thing in one stop, or just enjoy the music and the landscaping and giant pottery with exotic plants while doing nothing but strolling between each alleys, a must visit place in Irvine.\nShow less"], ["Reviewed May 23, 2017", 4.0, "A nice, relaxing shopping mall", "When my kids were younger, sometimes they would ask me to take them there just to walk around and watching other kids playing around.\n\nWhile other malls have always make me feel overwhelmed with big groups of tourists speaking loudly in different languages, this mall, however, is a good place for a quick stroll with my children after a hectic week.\n\nSadly, many shopping malls are not doing well due to the closing of a lot of big stores, I do hope that Irvine Spectrum will survive and will always be a relaxing shopping mall for the people of Southern California and visitors.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Day of fun shopping", "The Spectrum is a beautiful place to hang.....for locals and travelers alike. There are some great restaurants, theatres and a comedy club if you're there in the evening. An 'entertainment' center for the teens and a ton of shopping, from fairly low-end to fairly high-end. Easy to find, where the 5 and the 405 meet in Orange County.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Unique Mall", "It is safe, freeway close to 5 and 405 freeway, plenty of parking. This location is unique for just about all types, young children with ferris wheel, arcade Dave and Busters with pool tables and serving great food. Different restaurants that will satisfy most taste buds. Has a huge theatre with different movies showing. Even has a IMAX theatre. Great for teenagers, families, and the older crowd, like me.\nShow less"], ["Reviewed May 22, 2017", 3.0, "Very hard to find the store you want to go to", "Locations of stores are confusing. Maps at information displays are confusing. Not easy for occasional shoppers. It looks like you always park at the parking lot far away from the store you want to go to"], ["Reviewed May 20, 2017", 2.0, "Disappointed", "Crowded shopping area...restaurants, coffee shops and foods stands are over price. Unfriendly staff most of the times. Was a good place to walk, relax enjoy an afternoon drinking tea or coffe. Today is a place to go to the movies only due to overcrowding. One good thing - pet friendly!\nShow less"], ["Reviewed May 16, 2017", 5.0, "Excellent Shopping, Good Restaurants", "This outdoor shopping mall is good for a 2 or 3 hour experience. There are stores for all budgets and small kiosks, too. Movie and Imax theaters give you choices for entertainment. There are restaurants for all budgets from fast food to relaxing places to eat. There are activities for families, a Ferris wheel, train and ice skating during the holiday season. Dogs are welcome in the center, too. There are places to sit and have conversations.\nShow less"], ["Reviewed May 7, 2017", 4.0, "Something for everyone!", "Lots of shopping opportunities. While I'm not really interested in a long shopping adventure, they have diversions. I like the game room in Dave and Busters. Or taking in a new movie at Edwards Cinema while the women go shopping. Plenty of parking, although the lower levels fill up fast. Several restaurants to choose from.\nShow less"], ["Reviewed May 6, 2017", 5.0, "I like this place all that you need whether entertainment , movies and restaurant all here we are at WoodRanch for lunch", "I like this place anything I can find for entertainment either movies or restaurant all here if your choice. We are lunch at WoodRanch - their burgers and baby back ribs are so delicious and worth trying for. Surely this restaurant is recommended for friends"], ["Reviewed May 5, 2017", 3.0, "Just ok", "Used to love to stroll and shop here but something has changed. The seating areas have been taken over by large groups of people who sit there forever and never move!! I dont even take visiting friends and family there any more. A real shame."], ["Reviewed April 30, 2017", 5.0, "So much to do", "Came from Canada and loved everything about this place. The food, shopping and entertainment. Love that you can walk around this shopping plaza outdoors. For those of u from Vancouver its similar to the outdoor mall by thr airport on a much bigger scale. Check out dave and busters for enterainment, and Pieology for eats!!\nShow less"], ["Reviewed April 30, 2017", 2.0, "This place....", "I've watched this place grow, but the problem is, it never stops growing. Even just a few years ago, I could go here on a 1-hour lunch break and make it back to work in time. Not now. Don't even think about it on a Friday or Saturday. It's become so crowded, there's now people directing traffic. This place is a like a marriage of a mall and Disneyland. You'll spend a lot of money and wait in line to do so. Irvine, do yourselves a favor and stop trying to build and expand this area. The traffic here, and surrounding, has become a nightmare. Generally, I avoid this center at all costs these days because of it.\nShow less"], ["Reviewed April 29, 2017", 4.0, "Lot's of everthing", "Regal movie theater complex with around 25 screens, maybe 10 restaurants (Cheese Cake Factory, Cucina Enotica, Brio, Javiers and more) probably 50 shops including Nordstrom, people watching, Ferris Wheel, outdoor mall, a bit tight at times with tons to do and see"], ["Reviewed April 27, 2017", 5.0, "Wonderful Place for Families to Hang Out", "With the Moorish style outdoor mall that has a good variety of stores and restaurants located in the heart of Irvine, this is a wonderful place for families to visit and enjoy during the day and evening. The Edwards Theaters are great and there's one with IMAX/3D. Make this a must place to visit when in Orange County!\nShow less"], ["Reviewed April 26, 2017", 5.0, "Wonderful place for a family outing and a pleasant walk to counter the calories", "The place is just amazing . Something for everyone . Right from the really nice Ferris wheel to the train ride and carousel ride . The place is very clean and safe for the children too . Shopping is top notch and so are the restaurants and cafe , you will be spoilt for choice .\nOne can easily spend close to 4 hours without getting bored , the only thing which would make you go back home would be the empty cash or the tired legs .\nShow less"], ["Reviewed April 22, 2017", 5.0, "Business lunch", "Very pleasant & convenient location for a business lunch. I would not hesitate to take a customer here again."], ["Reviewed April 15, 2017", 4.0, "Post walk shopping...", "Being in Irvine temporarily means that the Spectrum is our 'local' mall. It's about 7-8 miles from our location, off the 405 near John Wayne airport...Or 8.5 miles if you walk there following the San Diego creek. The mall is a modern, outdoor mall with a nice selection of shops from Target to Nordstrom's. There's also a variety of choices for places to eat from Dave and Buster's to Ruby's diner (great, in expensive food... Try the cheeseburger). All in all, typical American shopping experience but with few 'outlet' type shops so you won't get as many deals.\n\nThere's also stuff for kids including a Ferris wheel...\nShow less"], ["Reviewed April 13, 2017", 5.0, "Favorite mall of all time", "This is the best shopping, sauntering & food & entertainment place for us. The ferris wheel gives spectacular views of the surrounding areas."], ["Reviewed April 11, 2017", 5.0, "Great", "This is a mall with everything you can think. Evening dining,good lunch,real treat. Shopping is great to do here. They have every store you can think of."], ["Reviewed April 10, 2017", 5.0, "Great marketplace", "Well thought out mall, good mix of stores and restaurants. Great for quick shopping or family day out."], ["Reviewed April 10, 2017", 5.0, "Fantastic shopping mall", "Fantastic for shopping mall and lots of restaurants. Great walking about in the evening everything is lit up and a happy vibe. There's a cinema ."], ["Reviewed April 10, 2017", 4.0, "Terriffic Center for dining, Entertainment, and shopping!", "I have watched this center grow and take shape over the past fifteen or more years, and it is always improving itself! It has become a destination in itself with great entertainment like the Ferris Wheel, Ice Rink, theaters, and Dave and Busters. Add terrific dining options and nightlife, along with an awesome array of specialty shops and boutiques. IT would be easy to spend an entire day here with the whole family and not get bored!\nShow less"], ["Reviewed April 10, 2017", 5.0, "The best shopping", "The place is amazing, the stores, restaurants and the envoirement is special. Every sunday I visit with my family..."], ["Reviewed April 10, 2017", 5.0, "A really enjoyable outdoor \"mall\"", "Here in Orange County, having a mall indoors is not a requirement. The Irvine Spectrum is large, outdoors, and has tons of eating from fast food to fine dining. Somehow, this place is more fun to go than other malls; I do not like malls generally, and this one tops my list.\nShow less"], ["Reviewed April 6, 2017", 4.0, "Great Outdoor Shopping in OC", "If you want to enjoy the outdoor ambiance of what SoCal has to offer, I highly recommend shopping at the Irvine Spectrum. They look great after the renovation with great stores that will fit your budget. It's more reasonable than the South Coast Plaza and it offers casual dining that are ideal for the entire family. Food outlet options are much better than the South Coast Plaza with high quality restaurants. The only negative thing I can think of for this place is parking. Don't go around noon and after 5pm, it'll frustrate you to find a parking spot. It may take up to 25 mins to find something close unless you don't mind walking at a distance. Also, make sure you remember where you park. Parking lots all look exactly the same and if you don't remember which building you are in, you can get quite lost and think your car got stolen. It's hard to differentiate the buildings since they all have exactly the same look and same car wash in all of them. So remember the building name.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Nice", "Lots of good stores to look in. Big shopping area with few decent places to get a quick bite. I liked that there were stores that I have never been into. Outdoors center with plenty of walking space"], ["Reviewed March 30, 2017", 5.0, "Comparison Shopping!!!", "Irvine Spectrum Center has come a long way indeed in the past 5 years. It is now pushing Fashion Island and South Coast Plaza for customers. On a Friday or Saturday nite the place is packed. Plenty of good parking/Edwards Theatre/great food(PF Chang's, California Pizza Kitchen, etc.)/great stores. Not nearly as expensive as FI or South Coast. See you there!\nShow less"], ["Reviewed March 23, 2017", 4.0, "Pleasant place.", "The Irvine Spectrum Center is an outdoorshopping center developed by the Irvine Company, located on the southeast edge ofIrvine, California, US. The mall features an Edwards 21-screen movie theater.[1] Built over a 10-year period, the first phase of the center opened in 1995 and the second phase followed in 1998. The third phase was completed in 2002. The fourth and fifth phases were built and completed between 2005 and 2006. The mall is used forestablishing shots of the fictional \"Mall of Miami\" in the Disney Channel television seriesAustin and Ally.\n\nEdwards CinemasEdit\n\nThe 21-screen movie theater was once the largest movie theater in the western United States.[citation needed] During development, the Edwards company code-named it \"The Big One\". This remained the movie theater's nickname for a while thereafter until other theaters eclipsed its screen count, particularly AMC's 30-screen complex at The Block at Orange. The theater bore over two miles of pink and purple neon lights.\n\nShow less"], ["Reviewed March 22, 2017", 4.0, "Good variety", "There's a good variety of restaurants, shopping and entertainment. We rode the big ferris wheel and it was worth the $5 per person price we paid. There's also a merry go round but we didn't ride it. Parking in the garage was a challenge but it could be due to a show being held nearby or movie goers.\nShow less"], ["Reviewed March 21, 2017", 4.0, "Outdoor mall", "....with many restaurants. Beautiful Moroccan architecture. Great for strolling and shopping. Merry go round for both adults and kids. Gets busy on weekends/evenings."], ["Reviewed March 16, 2017", 5.0, "Awesome entertainment", "Great place to do lots! Shopping, eating, entertainment! All in one place. Great place to enjoy a lively yet safe outdoor area."], ["Reviewed March 14, 2017", 3.0, "Heart of Irvine", "Irvine Spectrum has shopping mall to theater, giant wheel to icecream yogurt, coffee, good to hang out on the weekend and even in the evening."], ["Reviewed March 14, 2017", 5.0, "Evening out", "Great options for dinner. We had kona grill the first night and it was awesome. They even had happy hour prices. Went on the Ferris wheel which sadly only looks at the mall, the highways, a construction site and a Whole Foods. Second night are at capital dim sum not nearly as good as Kona. Tons of shopping, coffee, chocolate and iPhone case stores. Loved all the palm trees.\nShow less"], ["Reviewed March 13, 2017", 4.0, "IRVINE SPECTRUM", "Stay away on weekends unless you're between 14 and 24. Great dining,, inexpensive to fine,. Free garage and inexpensive valet. $(4.00) I eat lunch there often, but stay away from movies and walking areas from Friday night to Monday afternoon."], ["Reviewed March 10, 2017", 4.0, "Ver nice outdoor mall", "The Irvine Spectrum is one of my favorite outdoor malls. It is clean, secure, well-lit, and there is ample parking. I feel very comfortable dropping off my teenage child with friends here on a Saturday night.\n\nYou will find a large movie theater (with 21 Theaters inside), and tons of restaurants. There's also a Dave & Buster's, as well as a merry-go-round, a ferris wheel, and various game venues. For example, there's a 3D ride, and in the winter time there is an actual ice skating ring!\n\nThere's also tons of shopping, with everything from Target to Macy's to Nordstrom's, as well as small boutiques. The restaurant options are unparalleled, you can go budget at Subway to upscale at PF Changs, with everything in between.\n\nThis mall is a great first step for younger teens wanting to spread their wings, in my humble opinion. Parents can enjoy an upscale dinner while kids hang out at the movies or shopping. The mall is so big, you probably won't run into each other, but you'll be close enough in case they need you.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Spectacular Shopping Center", "Very beautiful place to shop, stroll, have fun with your family. The rides were very animated and colorful."], ["Reviewed March 1, 2017", 3.0, "Good Stores - Bad Parking", "I try to avoid this mall unless I need something I can't get anywhere else. Parking is terrible and not easy accessible. The mall is spread out in an inconvenient way."], ["Reviewed February 26, 2017", 4.0, "Great Things to Do and Eat", "This shopping Center boasts many stores, great restaurants, and much more. It lives up to its name and is constantly changing and adding new stores. There is every kind of restaurant you would love. IT was raining hard when I was present so all outside seating closed, but many restaurants still have open and covered patios. It was a joy and for the family there is a carousel and Ferris wheel.\n\nVery easy access to I-405 and I-5. Free parking\nShow less"], ["Reviewed February 26, 2017", 5.0, "Walking Around", "It's a good place to go to window shop. There's a variety of places to go into. Good place to go n a sunny day."], ["Reviewed February 25, 2017", 4.0, "Nice place to wander", "I don't go to the Specrtum much but it's a nice out door mall with a lot of stores and places to eat, just to people watch is fun. I ant today to Target and unfortunately they are doing a lot of construction so it was not fun to park. And the Target was way under staffed it took forever to check out. But the mall itself is nice and had a variety of stores so whatever you are looking for you should find it there. I usually go to Apple there when I need to.\nShow less"], ["Reviewed February 19, 2017", 3.0, "Average mall", "An average outdoor mall with a good selection of stores and restaurants. Had some live music playing which was nice.. parking was a bit of an issue"], ["Reviewed February 15, 2017", 5.0, "Maria", "A place for the young & old. They have rides (trains & ferris wheels), skating rink, game machines, & eating places, shows, shops, & department stores for everyone."], ["Reviewed February 14, 2017", 5.0, "Great Fun", "I found a pair of boots for $5.00 here. They were really nice. I saw them and tried them on. They were on sale and when I got to the register the young lady told me a lesser price. Just for that day."], ["Reviewed February 14, 2017", 5.0, "Night out on the Town", "Fun place to spend time with friends or loved ones! So many different things to do especially depending on the season!"], ["Reviewed February 13, 2017", 5.0, "Fun to shop, dine, and lots ro do", "The Spectrum has so many fun things to do besides shop! There are rides, skating, movies, and every sort of shop or departmenrT store. Also, the Spectrum has fine dining as well as casual, plus ice cream, candy, and snacks, it's an event!"], ["Reviewed February 13, 2017", 5.0, "Great shopping experience", "This is a fun outdoors shopping center which welcomes dogs. My daughter loves to shop here as there is a wide variety of stores to shop in."], ["Reviewed February 13, 2017", 5.0, "Please all", "We come to Irvine spectrum about once a month. Great place to take the family if you're looking to entertain all. They have great food for adults and for kids. entertainment for the kids as well as adults. Good low to mid range shopping."], ["Reviewed February 9, 2017", 5.0, "Lovely Place", "Honestly loved this place, it has a lot of shopping places, the time of year I went almost every place was on sale, many Resturants and there was an ice skating place but couldn't do it as it required to book in advance but it a wow place to visit for travelers\nShow less"], ["Reviewed January 25, 2017", 5.0, "Great shopping and restaurants", "My husband and I were pleasantly surprised by this shopping center. It has a nice variety of shopping, restaurants, a large theater and I believe a comedy club. We were overjoyed to see the Veggie Grill restaurant since we are both vegetarians.\n\nWe were staying at a hotel close by and never had problems with parking at the Irvine Spectrum Center.\n\nWe will definitely return during our next visit to Irvine!\nShow less"], ["Reviewed January 23, 2017", 4.0, "Shopping Galore", "Great place if you have multiple things to buy and have kids. They have a carousal and theater as well as good places to dine (casual to more fancy)"], ["Reviewed January 21, 2017", 5.0, "Big wheel", "If you go there don't miss the big wheel, especially at evening the view is marvelous. the prices are not as high as you expected."], ["Reviewed January 20, 2017", 4.0, "Fun evening", "The Irvine Spec t rum is jam packed with endless food options and shopping. You can find any kind of cuisine here. It is decorated very cool with the palm trees and lights. Even if u just want walk around it would be a fun place.\nShow less"], ["Reviewed January 19, 2017", 4.0, "Great hang out place", "Nice open space with Moroccan style decor, very festive atmosphere at most times, I really like hanging out here even when I'm not looking to buy anything. Very family friendly and great place to just hang out."], ["Reviewed January 17, 2017", 5.0, "always fun - great people watching!", "I live by here and go a lot, to improve, shopping, Dave & Busters , winter they have out door skating (ice) and always fun, great shopping"], ["Reviewed January 17, 2017", 5.0, "South Orange County's Classiest Mall!", "With vast variety of restaurants, shopping, & movies, plus plenty of parking, the Spectrum provides a pleasant outside shopping experience for all!"], ["Reviewed January 16, 2017", 5.0, "Outdoor shops and restaurants", "One of my favorite hang out place while in the Irvine area. It caters to the nice weather in Orange County with it's open mall with shops and restaurants. There is a very nice movie theater, arcade for the kids, and occasionally they have entertainers. This is a kid friendly spot and does not have the crowded feel of other outdoor malls in SoCal.\nShow less"], ["Reviewed January 16, 2017", 5.0, "Amazing Place", "The Irvine Spectrum is one of the best when it comes to shopping, dining and entertainment. It has it all. Beautiful area. Lots of shops. Amazing restaurants to dine at and also an awesome movie theater that includes IMAX. It's a must visit when your in the Irvine area.\nShow less"], ["Reviewed January 8, 2017", 5.0, "Great and accessible community mall", "Irvine Spectrum basically has it all - fast food restaurants, fine-dining, retail shops, department stores, carousel rides, movie theater, etc. The mall has complimentary wi-fi which was pretty neat since we're only tourists and we needed some means of communicating with each other after we're done with shopping. We arrived lunch time and went home around 5 pm.\nShow less"], ["Reviewed January 8, 2017", 4.0, "Great smaller mall in Irvine near Newport Beach", "Visited last in August 2015. We came here to pick up discounted Disney park tix since they were being sold here, Fashion Island, and another location. We'd been to the spectrum a few times in the previous years we'd been to OC. Not too large. It has a train, carousel, and Ferris wheel for the kids to enjoy. Many outdoor seating areas for relaxing while others shop. Many restaurants and a cinema. Many affordable retailers and a good Macy's. If you can't find what you're looking for at one Macy's in the OC, head to another. This is how we found the Spectrum. Nice outdoor mall to enjoy a casual stroll in the warm California weather.\nShow less"], ["Reviewed January 7, 2017", 5.0, "It Has It All", "This is great place for the whole family. It has something for everyone. Great restaurants, shopping, and movie theater. Very clean and lots of parking. Easy to get to."], ["Reviewed January 4, 2017", 5.0, "Great outdoor mall.", "The Spectrum is great. Lots a of things to do with children, including Ferris Wheel, train, and carousel. Of course all these cost money, and you can get tickets at any of the customer service booths.\n\nNear the Target, there is a splash pad that is open during summer. Other fun things include a 4D ride, Dave and Busters, Improv Comedy Club.\n\nLots of restaurants. This place can get very busy however, and sometimes parking is a pain. Great otherwise.\nShow less"], ["Reviewed December 30, 2016", 4.0, "Wheel fun", "This shopping center is pretty cool. Has plenty of parking that has signs that alert you to open spaces.\nLots of great food like the cheesecake factory, veggie grill, and hello kitty cafe. Plus many others.\nGood shopping selection too although I was disappointed the skechers store didn't stock women's size 11.\nLoved the ferris wheel. Good place to get some good pics and it's only 5 bucks a ride.\nI'm gonna come by again when I'm the area.\nShow less"], ["Reviewed December 26, 2016", 5.0, "DESTINATION FUN.", "Shop, eat, entertainment, people watch. A great place to go for a fun afternoon/evening. So many options for fun. Family/couple/solo. Go and explore......many times."], ["Reviewed December 23, 2016", 4.0, "Nice place to shop, see movies or eat.", "Great place here in the center of South County. Nice restaurants, shops and movies. Bring the kids, theyll have fun too. Tell em Margarita Mike sent you!"], ["Reviewed December 14, 2016", 5.0, "Nice place to visit and shop", "I love the outdoor space at this mall. It's designed with comfortable outdoor furniture clustered to invite meet-ups and conversation. This mall doesn't have a big MALL feeling even though it's huge. Also, you can shop high to every-day stores -- there's a Nordstrom AND a Target! There's a huge Edwards movie theatre and the parking can be tricky on Friday and Saturday nights for the structure. Generally, there is plenty of parking.\nShow less"], ["Reviewed December 7, 2016", 4.0, "Wonderful place to socialize", "Lots of shops, restaurants, a movie theater, a Ferris wheel, and plenty of things to do. People watching with a free sample of See's candies makes a stop quite interesting."], ["Reviewed December 6, 2016", 4.0, "Great place for Shopping", "Were were in Orange County and decided to check out the Spectrum. It has just about any shop or restaurant you can imagine. Sure is a good place to spend some time!"], ["Reviewed December 4, 2016", 4.0, "Beautiful outdoor shopping area", "Nice area to go shopping on a nice day. Definitely a great place to visit if you are in the Irvine area. Plenty of stores to shop at and very family friendly as there was a big open grass area for toddlers to play at."], ["Reviewed November 30, 2016", 5.0, "Love this place", "This mall is so complete! They have indoors store, outdoors restaurants, They have water fountains where kids play around getting wet, there is a huge parking lot, there are big stores like target and Macy,cheesecake factory\nThey have also a giant wheel, carousel...\nThe mall is so big that youth have exits to the I-5 OR the 405!\nShow less"], ["Reviewed November 29, 2016", 5.0, "Great for taking out the family", "Went here with the family on Black Friday, and, boy, was it crowded. I like that they had lots of activities and an ice rink for the kids. My wife had a chance to pick up some gifts while the rest of us grabbed some food and got some free entertainment.\nShow less"], ["Reviewed November 29, 2016", 4.0, "More than a typical shopping center", "This is a great place to shop, to eat, to find entertainment, or just to people-watch. The parking facility is large and modern with a system that lets you know how many parking places are available at any given time. I only wish we had more time to see everything. Maybe next time!\nShow less"], ["Reviewed November 26, 2016", 4.0, "Wish we had more time to spend here", "Liked this shopping center. Good stores. My daughter found what she was looking for, even at the end of the night."], ["Reviewed November 25, 2016", 5.0, "One happenning place to be for all ages", "One stop destination - entertainment, movies, fun , shopping , dining and grooming Has everything for each member in the family. Also wrap up your week's grocery from Target"], ["Reviewed November 19, 2016", 4.0, "Find almost everything you want there", "Been going there for years now and he keeps growing and growing. You can find almost anything you want there from theaters do good food"], ["Reviewed November 15, 2016", 4.0, "Great Open Mall", "Great location in Irvine. Plenty of restaurants and choices. Large open safe environment that is located in an excellent neighborhood."], ["Reviewed November 15, 2016", 4.0, "One of the first outdoor malls...", "So Cal has the weather and the spectrum has the offerings. Multiple upscale chains, great stores and wonderful people watching. There is something for everyone. Parking is a bit limited, so be prepared to walk a bit. It's a great way to kill a few hours.\nShow less"], ["Reviewed November 14, 2016", 5.0, "Great place to shop and dine!!", "It's been a while since I've been to the Irvine spectrum and I was pleasantly surprised with how many improvements have been made and what a nice location it is. There are plenty of restaurants, lots of shopping and even an ice skating rink that the kids loved. This is a great place to hang out with friends and family.\nShow less"], ["Reviewed November 14, 2016", 5.0, "Irvine Spectrum Review", "Everything at the Spectrum is great. Food choices, beauty product choices, clothing for children up to adults and varying prices that everyone can choose from. Movie theater with 21 auditoriums, Apple Store, many different kiosks selling clothes, glasses, food. Enough parking to go around and spaces designated how many available. Also has a small train for the kids, carousel and Ferris wheel.\nShow less"]]}}