{"Jedediah Smith Redwoods State Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Jedediah Smith Redwoods State Park", "url": "/Attraction_Review-g60944-d116853-Reviews-Jedediah_Smith_Redwoods_State_Park-Crescent_City_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/03/e4/cb/california.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1195"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Crescent City", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 5 days ago", 5.0, "Great hiking.", "Awesome Redwood forest hiking. Scenic drive with a number of trail choices . Beautiful creeks and rivers. Very peaceful. Easy to access from Crescent City."], ["Reviewed 4 weeks ago", 5.0, "One of most beautiful places on earth", "This truly was one of the most beautiful places I've ever been.. I didn't have a ton of time to visit as I was doing something at Pelican Bay prison but we didn't need that much time. In just an hour I saw the awesomeness that is this place.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Summer vacation", "This was absolutely awesome. The trails are very well kept and you could spend all day just wandering through the giant Redwoods. My kids loved it, some of the trees had fallen over and were lying on their sides and we just loved to climb on top. Make sure your dress for hiking though, we were there in July and needed jackets and jeans. This is definitely worth a stop!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Awesome", "A walk through a forest is one of the best things you can do for yourself, a walk through this forest sets your heart at ease. What a wonderful sight to wander through the underbrush and have the tree trunks surround you."], ["Reviewed January 21, 2018", 5.0, "MUST SEE", "I am a local but I went here on vacation as a child with my family. There is nothing more fun. I am 60 years old now and still go here almost every year a few times.\nThere is a great park for camping overnights...there are even cabins there now. There are forest ranger nature campfire talks...swimming... frogs...deer... plus the beautiful trees. There are clean and good bathrooms and showers. Fun trails for kids there are even a couple wheelchair trails.\nShow less"], ["Reviewed January 20, 2018", 4.0, "nice drive, beautiful trees", "We didn't drive very far because we didn't end up having a lot of time but the first part that we did drive into of the park had a short trail that was fairly easy to hike. There were about a dozen huge trees, beautiful vegetation and a scenic river that the trail followed. If you don't like narrow trails I wouldn't recommend this one though. There were parts that had caved in and it was quite narrow with drop offs. It dead ends into a cute bridge and creek area.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Howland Hill Rd", "It may be muddy and filled with potholes, but Howland Hill Road is the best way to see this particular redwood forest. Visit on a sunny afternoon and see backlit mosses and sun rays between the trees. Close and convenient to Crescent City."], ["Reviewed January 8, 2018", 4.0, "Beautiful park", "I will start right off by saying: WE DID NOT STAY HERE. So I am not rating their reservation system or any of the amenities. We simply drove through the park on our way home to take a look at the accommodations and the river, as well as access.\nThe last time we had been here was in the early 70s, so it has been vastly improved since then. The whole camping area as well as the Day Use area was very clean and of course the area was beautiful with the amazing trees and river. I am very much looking forward to going back for a longer stay.\nShow less"], ["Reviewed January 3, 2018", 1.0, "WARNING: RE Reserve California Website", "Hi All,\nThis review is not technically about Humboldt State Park but rather it is a warning in relation to the dishonest, rude and upsetting practices of the 'Reserve California' Website. If you want to camp in the State Parks then you have to use this service. Basically I booked 3 nights accommodation, after registering with them only to find i received no booking confirmation email and on the 'My Account Section' it states no bookings to show. The money has come out of my bank in England. Any level of understanding and any polite customer service has been non existent. I have sent at least 10 emails asking them to confirm what has happened to my money and two expensive phone calls.No one has had the manners to apologize - and my justified complaints at their taking my money for nothing is being ignored. It is so upsetting and so unjust - this is not some guy in a tin shed flogging something on ebay but The State Park Service of the USA. I am now having to raise the matter with the fraud department of my bank and lord knows where we are going to stay when we visit California next year.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Must see if you around", "Really great place to spend a day easy , you can drive through or can park and take a hike , a lot of beautiful trails and nature scenes , free , relaxing and very interesting"], ["Reviewed January 2, 2018", 5.0, "So tall!", "The redwood trees are so tall. This place looks like an enchanted forest of some sort. The drive is very beautiful! We loved every minute of it. I definitely recommend that one visit this place when in Northern California."], ["Reviewed January 1, 2018", 5.0, "Wowie! Absolutely gorgeous!", "Stayed in Crescent City the night before then drove in the morning to Jedidiah for a short hike. Then continued south down through the rest of the redwood parks -- amazing trees all around! It's absolutely awe inspiring. I travel a lot but I've never seen anything like these trees! You must go here!\nShow less"], ["Reviewed December 30, 2017", 5.0, "just beautiful", "There's nothing like a Pacific Coast redwood forest. This park is one of my favorites. It's quiet and cool, and close to the ocean. Bring your bike!"], ["Reviewed December 29, 2017", 4.0, "Beautiful!", "Definitely a must see! Even if you just drive through or use the day use area. So many must see breathtaking towering Redwoods."], ["Reviewed December 26, 2017", 5.0, "One of best drives in the nation", "I love the drive between Grants Pass and the Crescent City area. It does not matter which direction one is headed, this is a beautiful drive. Massive trees, scenic mountain views, and a road that reminds one of the day before interstates and massive highways. Not a route to really be in a hurry on. Too much beauty to buzz by. Only drive similar is 299 between Redding and Eureka.\n\nOnce near Crescent City one really needs to drive through the Redwood tree and take the sky tram just up the road.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Gorgeous!", "We drove all the way to the Redwoods National and didn't realize some of the best views were on the scenic drive right outside of town. We went while it was raining and you couldn't tell when in the thick of the trees."], ["Reviewed December 6, 2017", 2.0, "Nice Scenery", "He’d Smith is a great place to see beautiful redwoods but the rangers are zealots when it comes where and how campers park. They get upset if a vehicle is parked on a blade of grass and they make you move your vehicle. They are way over the top throwing their weight around. We won’t be going back.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Enchanting", "I would highly recommend stopping at the Grants Pass or the Redwood National and State Parks Visitor Center to get a map of the area. We drove to the Simpson Reed Grove Trail to do the hike. Fabulous. Another hike recommended to us was the Walker road but we did not have time to do it. We drove back to Howland Hill Road and did the leisurely drive on Stout Memorial Grove through the magical forest for the mid afternoon which I would highly recommend because the ray's of the sun and the mist in the air created a magical photographers dreamworld for incredible pictures! Drove the Newton B Drury Scenic Parkway to Eureka to stay for the night. Highly recommend allowing 6 hours to do this gorgeous area and prebooking your accommodation so you know you can take your time and not have to look for a place in the dark. Hit the washrooms at the Visitor Center as not sure if there are any along the drive. We would definitely go back again.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Woods", "If you want to go walking in the woods in September and want to feel alone this is a great place. I loved it. Splended drive to get to it as well."], ["Reviewed November 22, 2017", 5.0, "A heaven in the earth", "This is a must see red wood park. Some thing extra ordinary. Plenty of giant spectacular red wood trees. A lot of hiking trails. And groves. Or you can drive in the scenic road and pass through the park and enjoy your eyes and soul with unspoilt nurture.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Beautiful", "Hiked the Boy Scout trail. Absolutely astonishing journey. This is a must do for anyone in the area. Words cannot do this majestic place justice"], ["Reviewed November 17, 2017", 5.0, "Magical", "This park is right out of a fairytale. On Howland Hill Drive I kept waiting for a mythical creature to appear from the foggy green. The rain made everything even more beautiful. It is off season and we basically had the place to ourselves! One of my favorite places!\nShow less"], ["Reviewed November 12, 2017", 5.0, "A MUST SEE!", "An amazing experience! Would definitely recommend to anyone visiting this area! The trees here are incredible, great walking path to check everything out."], ["Reviewed November 9, 2017", 4.0, "Passing through on way to Crescent City, CA", "Beautiful place. Didn't stay because signs were rather forbidding, indicating a charge at the entrance. Giant redwoods throughout & looked like a good campsite."], ["Reviewed October 30, 2017", 5.0, "Bliss", "We were lucky to get two nights here. Our site was looking on to the Smith river and perfect for mor ing and afternoon swims. Trails in and around the park to wander amongst the redwoods.\nOnly wish we could have stayed longer.\nFacilities were great and rangers and staff were very helpful and friendly.\nHead into crescent city and try some SUP.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Beautiful park & awesome trees", "I cannot adequately describe how beautiful & majestic the trees in this park are. You can hike the trails or do the scenic drives. The visitors center is a must stop for first time visitors. We got maps & several useful tips on how to enjoy our visit. Just remember that the scenic drives are mainly on narrow & unpaved roads so it would not be suitable to do these on rainy days.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Simpson Reed Grove Trail....Great for all ages and abilities.", "This loop is located on the Western edge of the park off of 199. It is located off of Walker Rd. Just a short distance on Walker Rd there will be a bathroom at the trailhead. The loop is under a mile long and very flat and easily walkable. We had our 7&8 year olds that found this to be an amazing outdoor playground. Myself, my wife and my in-laws found the views to be spectacular and there was very little effort to get to see these magnificent trees. My father in law is on 100% disability (no mobility issues just very low stamina) and he was able to complete the entire loop without issue.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Awesome park!", "Of course the RedWoods are awesome! Weather was nice, super great trails. Great place to get some hiking in and enjoy the scenery."], ["Reviewed October 17, 2017", 5.0, "Ancient Redwoods-Spirit of the Forest.", "Majestic redwood trail to the Boy Scout Tree is a spiritual journey. Take time to listen to the silence. Not to be missed. Walking fast this takes 2 hours. Don't hike fast--take 3-4 hours to see it, to feel it."], ["Reviewed October 15, 2017", 5.0, "It's like a fairytale", "We walked parts of the Mill Creek Trail and we're both impreased by the trees and otjer plants and delighted to spens some time there. Leaving the 101 for the road trough the park is worth it. Walking a trail even more!!"], ["Reviewed October 13, 2017", 5.0, "Beautiful /' Breath taking...so worth the drive", "We actually drove two hours to see the Redwoods. So glad we did. We took the Howland Hill Road and it was approx. a 45 minute drive...depending on how many stops you make. Part of the road is paved, some gravel. Do not need 4 wheel drive but RV's are not allowed. Very narrow in some places. The trees and woods are just so awesomely breath taking. A true piece of history. Highly recommend this drive\nShow less"], ["Reviewed October 13, 2017", 5.0, "Pictures Don't Do It Justice!", "I've been fortunate to see redwoods on previous trips to California. But, I have never camped among them. I can not begin to describe how incredibly awesome the experience was for my husband and me.\nThis park is the most beautiful state park I have ever seen. The redwoods are majestic! I don't know what other word to use. The campground was beautiful and well maintained. Incredibly quiet sites even with neighbors nearby. The bathrooms were especially clean and the showers as well. But, do take quarters with you.\n\nThere are great hiking trails nearby. A short hike from the campground is the Stout Grove with incredible redwoods to see and walk around. There is a footbridge that you can walk across to the grove. The footbridge is seasonal, and we were lucky enough to be there the day before they took it down for the season.\n\nA COUPLE OF TIPS: you may want to buy your firewood outside of the park. The park charges $8.00 per box (bundle), and the wood is very light in density. There is a gas station outside the park that sells firewood.\n\nWe stayed in site # 77 which was great. It is a large site, and very secluded even though we had neighbors. I posted some pictures to give you an idea.\n\nThe campground hosts were not very helpful or friendly. That's unfortunate on many levels, but especially given where they are camping. It's my understanding hosts camp for free in exchange for hosting. Oh well.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Nature's Cathedral", "What a gorgeous place to visit. It renewed my body and spirit! Loved the offered hikes and quiet serenity of these magnificent trees!"], ["Reviewed October 11, 2017", 5.0, "Awesome Contrast: Dirt Road, Dusty Ferns, Golden Sun Beams, Mighty Redwoods", "August 30, 2017 - We left Crescent City, California to drive to Bend, Oregon. However, we decided to drive through Jedediah Smith Redwoods State Park rather than take the highway out of Crescent City. It was a great choice because the massive redwoods, the dusty ferns, the streaming sun beams, the distant green, and the walk through the redwoods were all breathtaking.\n\nYou cannot just zip through Jedediah Smith Redwoods State Park because it is a dirt road, because you will incur some on coming cars, but mostly because you senses will not allow you to miss a single vista. You will make numerous stops for photos from open car windows and by getting out of the car. We stopped at Stout Grove for the short hike but I will cover that experience in a separate review.\n\nI suggest you allow a couple of hours to drive through the Park and to take the short hike.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Would the Redwoods Impress a Washingtonian? Definitely Yes.", "We made an unexpected trip by car to San Francisco from Seattle, and on the return I had the vague idea that we would visit \"The Redwoods\". The first thing you learn upon consulting the map is that there are multiple parks with Redwoods to choose from. We wanted to make quick progress north, so we settled on the Jedediah Smith Redwoods near Crescent City - the northernmost of the Redwoods.\n\nNext question: Would a family of Washingtonians be impressed by the Redwoods? Inured as we are to big trees: 100 foot firs all around our neighborhood, the Grove of the Patriarchs at Mount Rainier, and the coastal temperate rain forests at Lake Quinault and the Hoh River Valley. I have to report that, yes, we were all duly impressed by the Redwoods.\n\nWe approached the park from the west - from Crescent City - up the Elk Valley Road and then Howland Hill Road. Howland turns into a dirt road - very dusty in August, but well groomed - that winds through magnificent Redwood trees. We made many stops for photos.\n\nWe made four miles of slow progress to the Stout Grove. This is a short half mile loop trail through a quiet cathedral of stately trees and a few magnificent fallen giants. About half way is a short detour to the beautiful Smith River, which we enjoyed for an hour all unto itself, but that will be the subject of another review.\n\nWe left the Grove to the east, connecting quickly to highway 199 for a fast return to Crescent City.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Jaw dropping beauty.", "You cannot even come close to imagining the beauty of the redwoods until you are actually standing amongst them. Pictures will never do them justice either. It's a humbling and overwhelming feeling to be in the presence of trees so strong and powerful and aged. There were several places you can park if you want to walk around or you can stay in your car and drive around the redwoods. Some of the roads get quite narrow so you need to be alert and constanly looking for vehicles coming towards you. We walked for awhile and there were mosquitos biting me so wear bug spray. The smell of the forest is that of many years of must, dampness and moss. We were in absolute awe of this state park and also of how very well it is kept. If in the area, don't miss it.\nShow less"], ["Reviewed October 4, 2017", 5.0, "OMG... the BEST", "This is a must do if you are here. We absolutely were mesmerized with this trip. I can't get around very well so we didn't do the 1 and 1/2 mile hike to the Grove which I sure wished I could have. We were able to get out and take fantastic shots of the gorgeous trees. The best thing to do here by far!!!!!\nShow less"], ["Reviewed September 26, 2017", 5.0, "Tree normous", "Very humbling experience driving and walking through forest is an unforgettable experience and should not be missed by young or old alike."], ["Reviewed September 25, 2017", 5.0, "Both my husband and I found this to be the best site in the Redwoods", "We actually thought the trees were more spectacular here than at the \"Big Tree\" or the areas further to the south. The trees here were larger and much more interesting"], ["Reviewed September 21, 2017", 4.0, "Stout grove is amazin", "A must see here is Stout Grove, bit of a rough road getting in but well worth it, huge trees, do wish the area would protect better against idiots that carve their initials into downed trees"], ["Reviewed September 17, 2017", 5.0, "Great Hike", "The number of trails in the Jedediah Smith state park are relatively limited but high quality. The Boy Scout Tree Trail is a great moderate difficulty medium length hike that showcases a variety of microclimates. The initial section of wide flat trail gives rise to a persistent rooty climb through large lowland redwoods. The descent toward Jordan Creek reveals mixed flora with hemlocks and Sitka spruce emerging from the dense braken. Toward the end a series of small foot bridges cross the creek. The eponymous Boy Scout tree is up a very steep spur to the right now marked by a small sign as you go toward Fern Falls, a good place to rest before the return hike.\n\nBe sure to allot 3.5-4 hours for this hike. It would be tough to navigate in the dark!\nShow less"], ["Reviewed September 15, 2017", 5.0, "Beautiful!", "We visited Redwood National & State Park in July during our family vacation. We did the Stout Grove Trail and saw Big Tree. We also drove around some since the drive is very scenic. The trees are so beautiful! It is amazing to just look up at them! The only drawback was the mosquitos. Make sure you go prepared. It was warm outside but we wore our jackets to keep them off of us. This is definitely a park that should be on your to-do list!\nShow less"], ["Reviewed September 14, 2017", 5.0, "Redwoods!!!", "This was like something out of a movie. I will never be able be to described how majestic these trees are! We hiked to the Boy Scout tree. Nice hike."], ["Reviewed September 10, 2017", 5.0, "Wow!", "If you ever thought that you were moderately important, take a walk around these trees. You will surely re-assess your status in the universe."], ["Reviewed September 10, 2017", 5.0, "Giant Redwoods", "If your ever in the Crescent City CA area I highly recommend a visit to this State Park. The trees are magnificent! Its pretty close to :Heaven if you ask me."], ["Reviewed September 10, 2017", 5.0, "A wonder of delights", "We journeyed through each area of the Redwoods National Park and this was the best part through which to experience the redwoods - but you will need a car. When travelling from Crescent City you enter via a gravel trail that winds back and forth, and around trees of huge proportions. There are plenty of stops at which you can emerge from your vehicle to stare upwards, and wonder and wander, just mind the dust kicked up from other slow moving cars. If you are in Crescent City I would recommend visiting the National Park office where helpful guides will set you up for the day with insightful tips which will enhance your experience.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Spectacular trees!", "A great way to view the redwoods. They are magnificent and the short walks or drives provide a great way to enjoy them."], ["Reviewed September 7, 2017", 5.0, "Redwoods", "Just one word, breathtaking. The beauty of this place words cannot describe. The walking trails put you one with nature. I walked one trail and just got lost in the natural beauty. Just go and visit."], ["Reviewed September 6, 2017", 5.0, "Filters smoke from area fires well", "I keep looking for Gnomes and Fairies to come popping out whenever I am visiting this place. Lovely Redwoods... lovely walking trails... beautiful wildlife. Great place to get away from all the stresses of every day life."], ["Reviewed September 6, 2017", 5.0, "Magnificent trees", "Everyone must visit and see these beautiful trees. We all need to learn about the life of the redwoods. The trails are great for walking. The forest is peaceful. The river offers great views."], ["Reviewed September 3, 2017", 5.0, "Amazing", "Absolutly need to do this if you want to see the redwoods. Like walking down a trail but only in your car. There are plenty of pulloffs were you can get out and walk around and trails to hike."], ["Reviewed August 31, 2017", 5.0, "Relaxing campground.", "Clean, spacious and kid friendly campsites. Gorgeous scenery. Bathrooms were very clean. Bring quarters for the shower!"], ["Reviewed August 31, 2017", 5.0, "Beautiful reflecting Gods glory", "This was such an amazing area! So beautiful and scenic. Everyone we crossed paths with were so kind and a smile from everyone. We really enjoyed the peaceful walks with epic picture opportunities. A great family time!"], ["Reviewed August 30, 2017", 5.0, "Giant Redwoods, nothing short of spectacular!", "From our AirBnB it was a short drive to the park, then a very slow and dusty drive to the trail we decided to walk, but any regular car can make it. Bring food and water but do bear in mind there are no restrooms!"], ["Reviewed August 29, 2017", 5.0, "Amazing Trees", "The Redwoods are so awesome! They truly are giants. Great place for a day trip or just a quick stop on your way through. Beautiful place."], ["Reviewed August 29, 2017", 5.0, "Spectacular", "Absolutely amazing. These trees are so magnificent. You feel\nSo tiny in this giant forest. The drive is wonderful through the giant redwoods. There's plenty of pull offs & hikes. Very easy to get to off of Hwy 101. Go to the visitors center & get maps. The ranger suggested a lot of great places to go.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Beautiful", "Clean and nice place to have a picnic lunch or dinner. The river so clear you can see to the bottom. In summer months a nice place to swim. It has a nice beach to enter in with out as many rocks but still you should have on water-shoes. Saw a lot of kayaks good place to give credit to the creator for his beautiful work\nShow less"], ["Reviewed August 24, 2017", 5.0, "Beautifull old growth forest", "Lovely trails in old growth forest; coastal redwoods are some of the tallest, but not as large in diameter as the giant sequoyas. Still some were probably 15 feet across. Many fallen trunks that our kids walked and climbed with huge roots sticking up. Easy to walk trails.\nShow less"], ["Reviewed August 23, 2017", 4.0, "Great in theory but......", "It's a beautiful little park off of the Grants Pass Crescent city main road. However, on the mid week day we were there, in mid August, I would say it is truly not worth turning off the road.\nThere are lots of big beautiful trees elsewhere on 199 and there are a few turnouts where you can get up close for that one special picture. Hit this park in the off season\nShow less"], ["Reviewed August 23, 2017", 5.0, "Beautiful", "This is a great place. The redwoods are amazing. We've been here several times and will continue to visit when in the area. Just be prepared for dust!!"], ["Reviewed August 22, 2017", 5.0, "Extraordinary!", "We spent a good part of our morning at this extraordinary national park. It's a national treasure. At times we were speechless. The scenes are so unbelievable it's like you are dreaming. The park is well kept, the road easy to follow and what you...More"], ["Reviewed August 22, 2017", 5.0, "Great hike and unbelievable nature !!!", "We had fun taking the trail and gondola to the top them hiked all the way down to the Hwy. Great for children and adults. The shop has awesome chocolate mint fudge and unbelievable ice cream. Paul Bunyan still up to his tricks talking to...More"], ["Reviewed August 21, 2017", 4.0, "Good experience", "After some hours we visited this park and it was a perfect time visiting in the afternoon. The place is not crowded and so we didn't had any problems parking the car. The parking places are very limited."], ["Reviewed August 20, 2017", 4.0, "Beautiful Redwoods!", "The trees are amazing. It is impossible to describe how incredible it is to look up at over 300 feet of amazing Redwoods. Would reccommend seeing at least once. The trails were nice although signs could be improved. I think they could also cut back...More"], ["Reviewed August 19, 2017", 5.0, "I wanted to build a cabin and never leave", "We took a pic nic and did a lot of walking. This place is so beautiful Spiritual even. Kids ran and played and we read everything and learned a bit"], ["Reviewed August 17, 2017", 4.0, "Amazing Trees But Signage Lacking", "We stopped here specifically to see the redwoods in Stout Grove. The trees were amazing and I highly recommend stopping to see them. They were difficult to find even after getting directions from a ranger at the information building. Be sure to get directions from...More"], ["Reviewed August 16, 2017", 5.0, "Dusty, bumpy drive :)", "We originally came to Crescent City so we could hike here. Our schedule and road trip changed so we were stoked to see we could drive through the park. We didn't realize that it would be CRAZY dusty basically the whole way. When it says...More"], ["Reviewed August 16, 2017", 5.0, "Trees that reach the sun'", "I truly wonderful place to visit,year round. the story is that these huge redwoods lived on earth when Jesus walked the land, huge they reach for the sunlight,the floor littered with the decay of old growth,it has a smell all of its own. i try...More"], ["Reviewed August 16, 2017", 4.0, "State Park is part & parcel to the Howland Hill Road", "See the reviews for Howland Hill Rd and Stout Grove; a gorgeous loop road through huge Redwoods, from Crescent City, eventually paralleling the Smith River, crossing at Hiouchi and back to Crescent City via Hwy 199."], ["Reviewed August 15, 2017", 3.0, "Very outdoorsy", "This was a pretty place to hike. Not too many people. The trail is mostly kept up and there is some signage. It was nice to do, but probably wouldn't do again."], ["Reviewed August 13, 2017", 5.0, "Camped for 3 Days, Never Wanted to Leave", "I would camp in the redwoods for the rest of my life if I could. It's such an awe inspiring place. We feel so fortunate that we were able to experience the magic that is this natural wonderland with our kids. The memories we have from this place will be some of our most precious, without a doubt.\n\nCouple of things to pay attention to if you're camping: BOOK EARLY!! We booked in February for a June trip and there were already pretty slim pickings. The showers require quarters so bring some. There is a little town outside of the entrance called Hiouchi and you're best off getting firewood there.\n\nThe campsites were all pretty awesome strictly because you're in an incredible forest, but if we go again, we'll get one closer to the river.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Low key hike among redwoods", "This park is worth the few miles it takes to get off the 101. Located in Northern California, near crescent city. I mean how can you give a natural setting such as this a bad review? Follow the brown signs to the park . I would say you should experience Howland Hill road if all you want to do is drive. This will be a nice chance to get close to the redwoods without having to leave your vehicle.\nShow less"], ["Reviewed August 11, 2017", 5.0, "No words...", "This is something that you need to experience first hand for yourself! No words can describe this amazing sight. I followed one of the trails and spent all day walking around the forest. Such an amazing experience."], ["Reviewed August 6, 2017", 5.0, "Always amazing", "Second time driving though the Stout Grove and never a disappointment!!! Breath taking views and the road even as single lane is easy to drive with patience!!"], ["Reviewed August 5, 2017", 4.0, "Forest Moon of Endor", "We only really drove through on the way to the coast, had a picnic lunch, stoped to see some of the big trees. Stoped at the small but nice visitor center. My daughter had fun doing the junior ranger program. Not sure if this is where Return of the Jedi was filmed, but I felt as though there could be Ewoks! Also, it BOTH a state and national park!\nShow less"], ["Reviewed August 3, 2017", 3.0, "Fog!", "We love driving and wanted to have an epic road trip. We did have one but this area was just too plain foggy to enjoy a thing. Not only did we not get to enjoy the area, because of the fog it was actually quite dangerous. It sounded like such a nice place too, sigh.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Breathtaking", "We entered this state park from Crescent City on 199. We just stumbled on Walker Rd. We stopped and asked some people what was there to see and we were told to just take a stroll among the redwoods. This was not as crowded as most redwood parks. Another CA couple told us to drive to Stout Grove and it was a memorable loop to hike. I would highly recommend these two places in this park.\nShow less"], ["Reviewed August 1, 2017", 5.0, "God's Best Work", "breathtaking.....WOW beyond words...it's beauty is a to small a word to say as it is just beyond that! If you love hiking & nature at it's best then this is a must see when you come to this area of California. Plan a day in it....cause it will take all that to revel in it :D\nShow less"], ["Reviewed August 1, 2017", 5.0, "Stunning", "Our first redwood stop and it did not disappoint! We walked the stout grove trail...short and manageable.....pretty trail and the trees impress. Then we drove the gravel road into crescent city. Super cool road..a must! Stop by the visitor station. Very helpful there and get you in the right direction!\nShow less"], ["Reviewed July 31, 2017", 5.0, "Beautiful tress hikes and rivers!!", "We loved Jedediah such a great camping spot since the sites are very close to a river. We loved hiking all around the redwoods. Great spot but can sometimes get very cold even in the summer. So dress warmly!! We absolutely loved this park!!"], ["Reviewed July 30, 2017", 5.0, "Family Vaca Stop", "The redwoods were amazingly breathtaking. The 5.6 mile, round trip hike to the 32' in diameter redwood was well worth the dusty road drive to the trailhead and rugged, rooty, trail to the Boy Scout Tree. Highly recommend, but wear durable shoes with socks and pack water. Bring your camera!!\nShow less"], ["Reviewed July 30, 2017", 5.0, "Great for activities.", "Saw a lot of redwoods on our trip to California. This park was great because we saw them from the smith river"], ["Reviewed July 30, 2017", 5.0, "Amazing Trees", "Took the windy, dusty dirt road through the park, dodging other tourists trying to get around the giant trees. The short hike around stout grove loop is well worth it."], ["Reviewed July 29, 2017", 5.0, "Boy Scout Tree Trail", "The road into Boy Scout Tree Trail is dusty, primitive, narrow, and long. However, the drive to the trailhead is worthwhile. The stroll is 5.4 miles with Fern Falls and the Boy Scout Tree. I spent 3.5 hours on the trail, taking many photographs and talking with hikers that I met. I stayed at Crescent City KOA for two nights. Although the campground was full, the staff found a Deluxe Tent Site and a night in a KOA Kabin for each night that was not taken. The cost was about $100 for the two nights and money well-spent. When I lost a key to a bike lock cable, staff were able to locate a hack saw that saved the day. Staff provided several suggestions on hikes and sights to see. I found great crab sold down at the harbor and cooked at the campground.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Wonderful", "Even if you don't leave your vehicle, this is a must do. There are plenty of pull outs where you can be right next to these magnificent wonders of nature. If you can walk a bit all the better as there are numerous trails for all ability levels.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Cathedral like", "Though I grew up in the area, was in awe walking through the groves. So majestic & serene. River trail to Jed Smith from Stout Grove was closed (bridge out) - not sure when or if it will reopen. But an easy drive from 199."], ["Reviewed July 25, 2017", 5.0, "mezmerizing", "This is a place you don't want to leave. The weather was perfect. The sun beaming through the trees. It was extremely peaceful."], ["Reviewed July 23, 2017", 5.0, "The trees are amazing", "My kids and I enjoyed walking the trails around these giant trees. It almost felt like a reverent place to be among these trees."], ["Reviewed July 22, 2017", 5.0, "Beautiful Area", "The drive through here is so magical, especially in the morning with the fog and dew and some slivers of sunlight coming through. It's hard not to want to stop and take a picture. Every turn is a new photo opportunity but be careful this is a thruway highway so make sure only stop where it's safe and wide enough. The redwood trees and moss and ferns are so green.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Jaw-dropping Majesty!", "Everyone must see these massive, majestic trees! Each bend of the road brought forth a collective \"Whoa!\" from us. One feels like a Lilliputian when walking among these stately giants! There is almost a palpable reverence in this forest. Please, take time to appreciate these trees! They have seen much during their lifetime.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Redwood", "There are some beautiful trails, a decent ranger program, and plenty of picture opportunities. An excellent place as any to see the Redwoods"], ["Reviewed July 21, 2017", 5.0, "amazing", "I loved the redwoods ,we went to sequoia national park after we visited the redwoods,i like the redwoods better.so quiet beautiful,and not as hot or crowded"], ["Reviewed July 20, 2017", 4.0, "short cut to \"GROVE\"", "They've placed the foot bridge over the river near the boat ramp, nice walk to the \"Grove\" Just across bridge if your staying at the camp ground"], ["Reviewed July 20, 2017", 5.0, "Loved driving through the trees", "Very pretty area. My family of five was in the area for a few days. We did this section on our last day. Loved driving through the trees. Winding roads. Did Stout Grove which was amazing. My son and husband were excited to find out Star Wars was filmed here. Great Memories.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Unbelievable", "Do not miss this. Unbelievable. Mosquitos were a little bad, but even from the car this is incredible."], ["Reviewed July 17, 2017", 5.0, "The redwoods and ferns and easy hikes we came to see.", "If you don't have time for the full national park, this is a nice sample with accessible hikes, redwoods, ferns, the pretty Smith River, made for a pleasant half day."], ["Reviewed July 17, 2017", 5.0, "Beautiful hike", "Beautiful ancient trees and a wonderful trail for all ages. Lovely at any time of year. Highly recommend."], ["Reviewed July 16, 2017", 5.0, "wonderful", "spacious, well groomed, spectacular, clean restrooms, good roads ..not sure what I can say about the Redwood Forest...big trees!"], ["Reviewed July 14, 2017", 5.0, "Great hikes", "We did a trail run on the Boy Scout trail--best to start early (at least in the sumemrtime), as the trail seems to get pretty heavey usage. Simply stunning old growth forest."], ["Reviewed July 13, 2017", 5.0, "Wow so Gorgeous", "First time I have been and what a beautiful place to visit. Make sure you take a lot of pictures. It's breathe taking"], ["Reviewed July 13, 2017", 5.0, "Wonderful Place for Camping", "We stayed here for 2 nights while visiting the redwoods. The campground is very family friendly. We stayed in site 54, and had a cute trail down to the Smith River. The restrooms are so nice and clean. Showers are coin so bring some quarters. There are 4 showers and 4 bathrooms so there is a wait at busy times. Make reservations as they book up quickly. If visiting the national park, note this is the very northern part. It's about 40 miles south to the most southern point.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Amazing walk/Hike", "The Redwoods are so calm and quite, I will go back again!! The paths are well marked, and if you get there early like 8am there is no one there!!! We left at 10am and people were just arriving."], ["Reviewed July 10, 2017", 5.0, "Beautiful", "Such a peaceful place (when it's not overly busy lol). The sun filtering through the leaves is breathtaking."], ["Reviewed July 5, 2017", 5.0, "Awsome.", "Breathtaking. Roads were in need of repair in places, but other than that, the experience was wonderful."], ["Reviewed July 5, 2017", 5.0, "Mesmerized! Feel like you have stepped into woods of Narnia ;) Fee; dwarfed by giants growing 200 ft tall!!", "This is a must visit place..Step into years old forest and feel awed! Park your car and trial through woods where trees grow almost 200 + feet! You will feel like a tiny dwarfed toy standing by the foot of redwood trees. Its amazing to see how tall and straight a tree can grow! Step on logs fallen and act like bridges and step into a tiny secret secluded spot by a creek which feeds the Smith River! The trials is very easy as its flat route and can be made by almost anyone.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Beautiful!", "We drove up Howland Hill Rd today and the forest was just beautiful! Not too crowded for the 4th of July. I guess everyone was attending the local 4th of July parade in Crescent City. The road was really dusty but not to challenging to drive. I encourage everyone driving through to go slow, pull over and take a few hikes among the trees, take photos and just chill...One of the prettiest forests of coastal redwoods!\nShow less"], ["Reviewed July 3, 2017", 5.0, "Must experience out of your car.", "Pull into walker Rd. Get out of your car and walk. Trust me on this. You will be in the presence of at the minimum a unique sensory experience and at the maximum a transformative spiritual experience."], ["Reviewed July 2, 2017", 5.0, "Wow!", "Old world redwoods in a natural habitat that looks like 'the land that time forgot'! Spectacular! Take the road to Stout grove, you will not be disappointed!"], ["Reviewed July 2, 2017", 5.0, "Superb State Park deep in the redwoods", "Very popular. Reservations strongly suggested. In the Redwood forest and on Smith River. No hook ups but the space size is great and some with awesome views"], ["Reviewed July 1, 2017", 5.0, "Mesmerizing views", "You will look up a lot in this forest. The trees tower over everything and are so tall, that you are amazed. The green under-story is beautiful too. The dirt road drive is amazing and only a little bumpy. There are many short and long hikes to choose from. There are some nice camping areas to stay in or nearby hotels. Definitely worth the long drive to visit for a day or more.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Must see redwoods", "The best view of the redwoods on our whole trim when in the park you feel like you're in the middle of no we're. Told this is were some of the star wars footage was filmed. It is a must see!!!"], ["Reviewed June 26, 2017", 5.0, "Majestic!", "This was one of our favorite places to visit. It is just amazing to see the giant redwoods, and explore the great hikes. Would highly recommend going to Stout grove."], ["Reviewed June 25, 2017", 5.0, "Beautiful Trees", "We keep coming back to this spot because it's just so awesome. We love how the hikes are for everyone and its really serene. Check this place out if you can!"], ["Reviewed June 24, 2017", 5.0, "More beautiful trees!", "We didn't camp here, but drove through after the Howland Hill Road. Just more incredible beauty on the northern California coast. So much to do and see here. We'll spend two weeks. I could spend years here seeing it all!"], ["Reviewed June 23, 2017", 4.0, "Beautiful but ...", "We visited there as part of our redwood experience. The trees are always impressive. However, we were unable to hike the Boy Scout trail or Stout Grove due to no parking available. I understand the desire to keep the forest as untouched as possible but it was disappointing. Also the unpacked road to those locations was terribly rutted. We had a 4-wheel drive pickup but anything less will probably need to be realigned. Earlier in the day we drove on unpaved roads to the Klamath overlook and they were fine. I have no solutions for either problem. It was just disappointing.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Trees are awesome!!", "Great drive through the redwoods with spectacular trees! Hiking trails were really nice, too. We loved it!"], ["Reviewed June 22, 2017", 5.0, "Good jr ranger program.", "The trees are amazing and the junior ranger program was very hands on and well done. The ranger was able to engage to kids in the program."], ["Reviewed June 21, 2017", 5.0, "worth wandering around", "great trees....big big trees...worth wandering around area...sun on sand bars on smith river. if you see cars parked..you know there is something to see there"], ["Reviewed June 21, 2017", 5.0, "Tthis is on my buck list", "We stopped in Crescent City got our motel ask for direction, drove about 15 min. arrived at the entrance , drove in and was amazed of the size and beauty of Gods creation. The hole forest was full of these trees, we could had stayed there for days, We loved it.\nShow less"], ["Reviewed June 21, 2017", 5.0, "So cool!", "We explored the grove loop area and It was gorgeous. Definitely going back with the family and to fly fish."], ["Reviewed June 20, 2017", 5.0, "Wow!", "I read about it, wanted to go, thought it was too far to drive ... and just had to go. Yup, this is it, the prettiest State Park in California and the prettiest National Park in California. Stout Grove was lovely but the highlights were playing in the Smith River (too swift and cold to swim near Hiouchi, just dipping our toes and skipping rocks) and hiking on the Boy Scout Tree Trail (with little kids, we only went a short ways but it was gorgeous). The entire Howland Hill Road is like the most beautifully backpacking trip you've ever been on -- except you can drive it.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Beautiful scenery", "Great drive through the park, the kids enjoyed it, lots of places to stop and get out for pictures and closer inspection of the trees."], ["Reviewed June 18, 2017", 5.0, "Great little solo hike", "If exploring the redwoods when in Crescent City.. take a few hours and do this hike. I recommend getting there early as it's a popular trail. Takes about an hour ish each way and the falls are little but a great spot to stop and eat a snack or some food. This was definitely the highlight of my trip, and as a solo hiker.. I felt safe and renewed.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Love the trees and greenery", "Being from the dessert I thoroughly enjoy all of the woods I can. We drove through and hiked in the redwoods. I feel better just breathing in the air here."], ["Reviewed June 16, 2017", 4.0, "Pretty, but 55 mph is a bit fast for this road, I think", "9 miles from Crescent City, I am disabled so looking for Simpson-Reed trail (flat 0.75 miles w/disabled access) off Walker Road, park is long and this is on Crescent City side with tiny dirty sign so go slow, but WOW once there, even my old 66 year old body made the walk in fantastic surroundings, Don't mistake it for campgrounds later up the road (very narrow road there), Howland not for rental cars, we had big delay due to construction (30 minutes) so if going east, be prepped for that, Road (199) is gorgeous to Oregon and not mountainous, but does have many 20 mph tight curves, not for the unfocused.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Beautiful and Tranquil", "A beautiful and tranquil spot and access is easy for most all ages. Some of the trails will lead to views of the Smith River which is also a beautiful sight."], ["Reviewed June 16, 2017", 5.0, "This is my happy place", "Whenever life gets too much to handle and I need fresh air and nature, I head to Jedediah Smith! Walking around the redwoods always calms my spirit!"], ["Reviewed June 15, 2017", 5.0, "Enjoyable drive/hike through the Redwoods", "We pulled over on one of the short hikes that lead down to the river. Beautiful scenery, lots of great pics of creeks, bridges, massive trees and greenery. Loved it!"], ["Reviewed June 13, 2017", 5.0, "Best Redwoods on the West Coast", "This is THE place to see the redwoods and is free to drive and hike through. It is well worth the time to drive Howland Hill road, but this is a very rough, narrow road with lots of potholes, so be prepared. Hike any number of trails off this road and you will be rewarded with amazing views of redwoods. Stop at the visitor's center and the rangers will provide information for your visit.\nShow less"], ["Reviewed June 6, 2017", 3.0, "Redwoods on the edge of Crescent City", "Right at Crescent City, you can drive your car into a deep forest of redwoods... Prepare to get car dirty as roads are dusty..."], ["Reviewed June 2, 2017", 5.0, "Tall Redwoods", "Make no mistake, either you hike through the grove, or even drive through the beautiful 101 and 199, you will be mesmerized with the size of those trees and subsequently feel so tiny little.\nPicture does not do any justice. You have to see for yourself.\nShow less"], ["Reviewed June 1, 2017", 5.0, "Always Breathtaking!", "One of the most beautiful places I have ever experienced. We go to the Redwoods a couple of times a year to reset and reconnect with what matters. Truly a wonder to walk through."], ["Reviewed June 1, 2017", 5.0, "Close up views of the redwoods!", "The drive through the park is very interesting and you certainly get a close up view of the fabulous redwoods. The road is very bumpy with lots of potholes and I'd recommend a vehicle with fairly good clearance although we saw cars going through as well. Would not recommend taking a trailer or motor home due to the narrowness of some parts of the road. There are quite a few places to pull over to let oncoming traffic pass, take pictures, etc. We thoroughly enjoyed it and highly recommend it if you're in the area!\nShow less"], ["Reviewed May 31, 2017", 4.0, "Bumpy but beautiful ride along Howland Hill Road", "Drove from Crescent City via Howland Hill Road as I was limited on time and their website recommended the drive for those who have very limited time. The road in some parts were very narrow almost enough just for 1 car but it drove us through some beautiful old redwoods that were just absolutely amazing. However I would recommend that you be cautious when driving this road as the road is not well manicured and has plenty of potholes some gigantic.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Stout Grove Loop Walk among the tall trees at Jedediah Smith Redwoods State Park", "My entire family loved this park! You travel a one lane, bumpy road to entire the trail. It was easy to find, and beautiful just getting there. There was limited parking and a bathroom at the parking area. The trail was easy and many off shoots, that made us feel that we had the park to ourselves. Not difficult to hike. An added plus, Return of the Jedi was filmed at this park. We had fun acting it out!\nShow less"], ["Reviewed May 30, 2017", 5.0, "Get Lost!", "When someone tells you to get lost, you better get lost here. Well, not literally get lost but to be out in nature. Yes, we camped here for the weekend to run away from the city bustle. It was the perfect place for retreating and while the spotted owls woke me up in the middle of the night, it was a night in solitude that tops city nights. The campsite layouts are not the same. Some have wide and spacious openings. It is $35 per night per site, maximum of 8 people per campsite, with one vehicle allowed. You pay $8 extra for additional vehicle and only two vehicles per site. The restrooms are well kept and clean with quarter operated showers but they do not provide soap and they are distant from campsites. They also need more signs. I got lost twice. Imagine that. There is also a river alongside where you can kayak or simply take a Riverwalk. There are many hiking trails nearby.\nShow less"], ["Reviewed May 30, 2017", 4.0, "Awesome trees.", "Trees were spectacular, but the road leading through the trees left a lot to be desired. It was narrow and often one lane, with little room for turnaround for anything larger than a midsize sedan."], ["Reviewed May 29, 2017", 5.0, "Great visitor's center", "This is a wonderful area. Beautiful scenery, great hiking. The visitor center people were very informative. Bathrooms were clean! The gift center had several nice items to buy."], ["Reviewed May 29, 2017", 3.0, "Amazing ancient trees", "Limited roads available however were in fair to good shape. Camp ground looked welcoming. Easy turnouts for slower traffic. Visited on a Sunday and minimal traffic problems."], ["Reviewed May 29, 2017", 5.0, "Great drive!", "We drove to Jedediah Smith Redwoods State Park, got lost a little bit, but made it to the visitor center. The winding drive is definitely worth the trip! This place is magnificent; just magnificent."], ["Reviewed May 29, 2017", 5.0, "Awe-inspiring", "Meandering through the woods with the sun shining and windows down allowed to breathe in all the good that our environment has to offer. Protect the wildlife."], ["Reviewed May 28, 2017", 5.0, "Touch the Trees from your Car!", "I loved the idea of 'getting up close and personal' with the Redwood Forest. The road in from the south was NOT great, and we had to go very slow, but we loved it when we got there. Just park along the way and try a few trails.... hard to go wrong from our experience. We also enjoyed Stout Grove, than we got a little lost wondering in it. We stayed almost until dark.\nShow less"], ["Reviewed May 28, 2017", 5.0, "Don't go on holiday weekends, but definitely go!!", "Love this drive!! Heading north on 101 - exit Elk Valley, go right then right again on Howland Hill Rd and you'll find your way there. The road is narrow but AMAZING!! For those more adventurous & with a willing driver, roll down your windows, sit out on the frame to enjoy the beauty\nShow less"], ["Reviewed May 28, 2017", 5.0, "Gorgeous drive", "We drove through the park, mostly to see where we want to go back and hike. Beautiful redwood trees. The forest primeval in every sense. Beautiful!"], ["Reviewed May 27, 2017", 4.0, "Excellent quick trip", "Moderate hike, good for families. Three of us hiked on cool misty day, found the quiet serenity most rewarding."], ["Reviewed May 25, 2017", 5.0, "Amazing!", "Since we were close, we drove a little into California to see the redwoods. Words cannot describe the magnificence of these trees! Don't go into the campground like your GPS might lead you. Stop at the forest ranger cabin for direction. If you're anywhere near this park, you will definitely want to stop in!!\nShow less"], ["Reviewed May 25, 2017", 5.0, "Grueling but beautiful", "The road to the Boy Scout Tree is way bumpyer than one might imagine! Glad we learned I would not have to drive out the way we came in! Incredible trees, but aweful road."], ["Reviewed May 25, 2017", 4.0, "INTERESTING DRIVE - TRANQUIL HIKING", "Ask for directions on how to get here. You follow a paved road most of the way, but the last 9 miles in the park is a rough, rutted, narrow dirt road that winds between trees through the forest. There are spots along the road where two cars can just pass each other, but you have to look ahead to see if another car is coming, as backing up on these roads would be a pain. They recommend only going with a high clearance vehicle because of the road condition but we did it in a Ford Fusion and as long as you don't drive fast there are no problems with bottoming the car (I wouldn't try the road in a car after or during heavy rain - if you get stuck out there, you're out of luck). Pull off near the end where they have a paved parking lot and you can walk a trail among the giants.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Beautiful campground", "My family and I just returned from a two night stay at Jedediah state campground. There are large scattered trees throughout and trails leading you down to the smith river. The shore is covered in pretty decent size rocks so make sure you have some good shoes to throw on or your feet will be pretty sore. The water itself is crystal clear and the view is unbelievably beautiful. My kids were brave enough to try and swim, but it is pretty cold. There are no rv hookups, it's a completely dry camping experience. But as long as you know that and are prepared it doesn't have any affect on your trip. I overlooked it so I went the entire weekend without coffee . My bad. All in all my family and I had a wonderful trip and the weather couldn't have been more perfect. There was a pretty power hungry male ranger in the check in station who was never pleasant and felt the need to make things way too difficult. He was the only negative to our trip.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Magnificent", "We took the driving tour through the park, stopped and took pictures. Really enjoyed the drive. Four years ago we saw the sequois at Yosemite National Park (we took their site seeing tour which was fantastic for us)."], ["Reviewed May 22, 2017", 5.0, "Road trip", "The size of these trees can not be captured by my camera! This place is beautiful! And it smells great. There are so many nice areas in the forest to see. You have to see it for yourself to appreciate it.. reccomend."], ["Reviewed May 22, 2017", 5.0, "must see", "Even though it was pouring rain, the trees shielded the car somewhat. Plenty of places to pull over for pictures. Beautiful drive through the Redwoods. Narrow in places, potholes, but it should be a slow drive anyway."], ["Reviewed May 19, 2017", 5.0, "Womderful.", "Wonderful drive. I have wanted to visit the Redwood National Forest since I was a child. Very much worth the wait."], ["Reviewed May 19, 2017", 5.0, "Great experience!", "Our favorite hike was here, and was actually an easy walk by the river and through the majestic redwoods. One highlight for our 10yo was finding a banana slug. Very quiet and peaceful. We went in from Crescent City on the main road, but took the very adequate but unpaved road back. I would highly recommend this route, it wasn't crowded and there were plenty of pull-offs when other travelers were behind us. We were there in May, before the busy time. Also, the Rangers were very helpful in getting information about the area and selecting our route and stops.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Lots of Variety", "As pointed out by one of the rangers in the park, different areas/hikes offer different learning experiences and atmosphere. Loved it here."], ["Reviewed May 18, 2017", 4.0, "Redwoods", "It was a little hard to find out information at the information sites due to the amount of people waiting. We found trail heads ourselves and trotted along. AMAZING!"], ["Reviewed May 17, 2017", 5.0, "Prehistoric - Stunning -", "Great trails (no dawgs) - spectacular views - easy to drive & find - great place to photograph......"], ["Reviewed May 16, 2017", 4.0, "Beautiful, serene, mystical", "Wow. The California Redwoods. Be sure to stop at the ranger station and get a good explanation of what you're going to see. There is an unpaved road with stops at some trailheads that extend the 45-minute drive-through a bit longer. Stop along the way and take many pictures of the various configurations of redwoods, their root \"families\", and the varying heights of \"the big ones.\" We suggest starting the in-forest road no later than 2 hours before sunset.\nShow less"], ["Reviewed May 15, 2017", 5.0, "A Beautiful Park and Campground", "Large National and State park with lots of campgrounds. Imagine being deep in a giant redwood forest and look straight up. Lots of lush green vegetation. Rangers were very friendly."], ["Reviewed May 14, 2017", 5.0, "This is an outdoor sanctuary (as in church)", "Not overly crowded and there are beautiful trails under huge Redwoods. A real treasure, peaceful and quiet, we go there with everyone who visits us!"], ["Reviewed May 8, 2017", 5.0, "Great Side Trip", "Advised by staff to take this side trip. Like Ave of the Giants only on a gravel and dirt trail winding through the redwoods. Very natural."], ["Reviewed May 6, 2017", 5.0, "Incredible!", "Beautiful visit. We loved the trees! There are some potholes so you need to take it slow. The Boy Scout trail was really cool and we are happy we took the time to visit the grove as well. Can't wait to visit again!"], ["Reviewed May 5, 2017", 5.0, "Wow", "This place is beautiful. Only planned for a lunch stop while taking a road trip on the 101, but we just couldn't leave. Had a picnic on the beach and let my toddler stretch his legs and swim. The beach was busy, but not crowded, and the water was amazing. Spent the rest of the day driving around and hiking through the Grove of the Titans. I've visited before, but my wife was awestruck by the size of the trees. Pictures don't do it justice, come see for yourself:)\nShow less"], ["Reviewed May 3, 2017", 5.0, "Magical", "One of my favorite places in the world just book well in advance for camping. Lots of great hikes. This June will be our 2nd visit cant wait to explore some more and finally find the Titan Grove."], ["Reviewed May 3, 2017", 5.0, "We went in the rain", "Our trip in April involved so much rain, but we couldn't miss the chance to see this place. Absolutely awe inspiring, will return again. Hopefully in the sun!"], ["Reviewed May 2, 2017", 5.0, "Best Redwoods Grove", "This was our first Redwood Forest Grove and I think we can all agree that it was the best! Not to take away from the other ones we visited, but this grove was magical. The road we took, Howlands Mill, I believe, was a muddy, pot-holed, adventure in itself which made this place even more appealing. We had a medium 4-wheel drive vehicle (Toyota 4-Runner) and I suggest not to drive anything too much larger because some of the road was narrow and there were many twists and turns. The trees were completely awe-inspiring and there were hikes down to the river and through the ancient forest. Definitely the best place for viewing these trees!\nShow less"], ["Reviewed May 1, 2017", 5.0, "Wonderful", "Some lovely hikes and inspiring trees. Stop at the visitor center. Camping, too. Take the river walk too."], ["Reviewed April 24, 2017", 5.0, "Great Drive", "This is a great place to see Redwoods up close. there are lots of twists and turns. I would not recommend it for RVs! There are lots of pull outs for parking and walking one of the many trails. Watch for the Elk prior to getting to the Park.\nShow less"], ["Reviewed April 21, 2017", 5.0, "Incredible Hiking and Driving", "Make sure you stop at the visitor’s center for advice on where to hike and drive; the staff is very helpful and informative. My wife and I hiked the Stout Grove Trail, a very short hike, and saw some magnificent virgin Coastal Redwoods. We also drove the Howland Hill Road. This road is an old stagecoach road and not recommended for trailers- glad I rented a Ford Explorer (it got a little muddy). If you’re driving the 101 to look at Redwoods, this is a must stop.\nShow less"], ["Reviewed April 21, 2017", 4.0, "Hugew trees and river access", "The Smith River is right at your doorstep, and there are amazing Sequoia trees everywhere you look. It is a little damp in April."], ["Reviewed April 20, 2017", 5.0, "Magical experience drive during day so beauty is not missed!", "Beautiful and magical and a photo op at every turn! Although unsafe to get the really great shots of the beautiful bridges and views you can take this all in just by driving through this area. Or riding through I should say since as a driver you have to pay attention to the road!\nPlenty of pull outs to stop and take it in and there are trails and campgrounds in places as well. But if you have to take a drive this is certainly the way to go! It's breathtaking through here. The water of the river is turquoise and the green fern and moss covered banks and trees are just magnificent. So green!\nShow less"], ["Reviewed April 15, 2017", 5.0, "Bucket List for Sure!", "I saw \"Bucket List\" on another review and think that's most appropriate. It wasn't on mine but had I known it would have been. Reading other reviews it sounds like it still should be. All we did was a drive thru and a short walk at Stout Grove.\n\nPlain and simple: If you anywhere near this area and haven't already done so, make the time to check it out. We were headed for Grants Pass, OR to see friends and the fine people at the Redwood National Park Visitor Center gave us a map highlighting the route out of Crescent City through the park on Howland Hills Road.\n\nIf you do nothing else, drive this road. It was simply surreal. Maybe it would be less so for someone with lots of exposure to the redwoods, but for first time Midwesterners, it was an experience we will never forget!\n\nNote: Travel on the road is very much NOT recommended for vehicles with trailers, RV's and the like. Two way traffic on a narrow, windy dirt road.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Absolutely one of the best and beautiful camp grounds", "We had SOOOO much fun here. My family swam the Smith River just next to the campground. The river is absolutely clear and refreshing. The trails around here were beautiful. The Redwood State Park is magnificent. Driving around here was beautiful. I was fearful of running into mountain lions though on hikes, so I did carry a big stick . I didn't see a mountain lion, but the park rangers can tell you if there has been reports of sighting.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Beautiful park", "Book your stay here and relax ! Amazing camping under the beautifully Redwood Canopy ! You can tent camp or Rv camp or try one of the brand new camping cabins !! Just a short walk to one of the cleanest natural rivers in the world ! You must get reservations in advance! This is a must see.\nShow less"], ["Reviewed April 7, 2017", 5.0, "Tour", "We are touring America one national park at a time Jo Murray Facebook. Follow us as we see what this country has to offer"], ["Reviewed April 4, 2017", 5.0, "Our favorite of all the parks", "This is a drive through a dirt road that winds around the trees - no paved streets, lots of bumps and puddles, no touristy spots. You definitely feel like you're in the forest more than any other place (other than actually hiking of course) and it feels like an adventure. Dogs aren't allowed on the trails so if you're traveling with pets check out Prairie Creek park and do the Cal Barrel Rd Trail where dogs are allowed on-leash.\nShow less"], ["Reviewed April 1, 2017", 5.0, "Place of Wonder", "You will very much love coming here. If you have little time and inclination to hike, try Stout Grove (by the river). Hikers, head to Boy Scout Tree Trail for a lovely hike up and over a ridge and down to the tree bearing its name and small falls at the end of the trail.\nShow less"], ["Reviewed March 21, 2017", 5.0, "Go and do this...", "Seriously. This place is AMAZING. We are from Arkansas. My daughter \"dad let's go see the redwoods.\" So Spring break 2017 we did. Awesome experience. Curly Redwood Inn is in expensive and is a great launch point for much in this area."], ["Reviewed March 17, 2017", 5.0, "Amazing!", "First time seeing the redwoods and this park did not disappoint. We did the stout Grove trail and it was awesome! Highly recommend!Easy terrain and short hike."], ["Reviewed March 13, 2017", 5.0, "This is Sequoia in a more lush and primative natural setting.", "This far Northern California forest of old grove Redwood has a more primitive natural feel than visiting the Sequoias in Central California. This is a rain forest which experiences 60 to 80 inches of precipitation per year. The ground is damp, the trees are tall and close. The the dense fern undergrowth gives this place a prehistoric feel that is both magical and unnerving. To walk among the intertwined roots of the Redwood at Stout Grove in the heart of Jedediah Smith I could imagine these great trees in a multi- millennial embrace. It brought me nearly to tears. This is a special place, worth planning to visit.\nShow less"], ["Reviewed February 24, 2017", 5.0, "Big trees and pretty views", "Redwoods need no review. They are always majestic and refreshing. Park was clean and even after the huge storms we have had this summer, paths and roadways are clear from debris and accessable."], ["Reviewed February 21, 2017", 5.0, "Breath Taking", "You will HAVE to go there! Camping or Day Trips. We live here in Crescent City, and we go there all the time. The Redwood trees and Smith river are amazing. Full of beauty and life!"], ["Reviewed February 14, 2017", 5.0, "Visit the Redwoods", "Beautiful Crescent City We asked \"where are the Redwoods ?\" They replied: \"you are in them\" (everyehere around there). Amaizing huge trees, and the forest is so pristine,. Love this place..!"], ["Reviewed February 6, 2017", 5.0, "Humbling reminder of our place in the world", "Walking the undisturbed forest grove made me feel grateful to state officials and the people of California. Their determination to preserve the redwoods and offer the rest of the world a deeper understanding of how important all forest ecosystems are to our survival is inspiring. I'm not a church-goer, but this place approaches my definition of what is holy and sacred in this world. Clear your mind and spend an hour here...it's amazing.\nShow less"], ["Reviewed January 30, 2017", 5.0, "We will never forget this place", "We checked off an item on my bucket list on our road trip last year; see the Redwoods. Our first stop, driving down from Oregon, Jedediah Smith Redwoods. Driving in on a very narrow dirt road with our necks craning out of the sun roof and our jaws dropping, we could not fathom how majestic and inspiring the redwoods were until seen in person. We found our way to Stout Grove, and went on as many off the beaten path trails and the main trails we could find. The canopy is so full and it is so enclosed you feel like you are on a different planet. We even found a trail to the pristine Smith River. We spent quite some time in this Grove, taking a ton of pictures and just admiring this beautiful bit of heaven. I am so glad this was our first stop. It was definitely our highlight and the best redwoods from all we saw.\nShow less"], ["Reviewed January 26, 2017", 5.0, "Amazing", "WOW, what amazing trees. Huge and beautiful. They were on my bucket list and was so happy to finally make it here. AMAZING"], ["Reviewed January 17, 2017", 5.0, "Trees, trees and more trees.", "OMG, such marvelous trees. Huge. Spectacular. Did I mention the trees? Also the store there offers lots of souvenirs. ;)"], ["Reviewed January 11, 2017", 4.0, "Huge trees!!!!", "I booked the camping spot online and was during off season so we were allowed to just drive in and park at our spot. It was a bit frightening because they had caution signs of black bears were known to be in the area but we didn't hear anything. It was cool, and I wish we didn't have to leave so early like we did. It looked like a really fun park to explore!!! The showers were a pay to use, I suppose it is due to the constant drought in the area. It wasn't heated and I didn't want to risk a chilly shower and spend my previous quarters on it. Over all, great scenes, huge redwoods, Good photo opportunities!!!\nShow less"], ["Reviewed January 6, 2017", 5.0, "Amazing", "Visited in the late afternoon and caught the sunset. Amazing pictures and views. We did some trails, really enjoyed it."], ["Reviewed January 4, 2017", 5.0, "Camping fun!", "Excellent camping experience. Nice sites. Clean bathrooms. Good hiking trails. Cute little ranger station."], ["Reviewed January 2, 2017", 5.0, "Amazing trees", "Be amazed by the size of the trees. The shade of the trees kept us cool. The ferns and other under brush was interesting. The path is easy to walk on."], ["Reviewed December 30, 2016", 5.0, "Beautiful Drive", "Driving through Jedediah Smith State Park offers close up encounters with tall redwood trees. There are several spots to pull off and hike to memorial groves. I've only driven through this park, and I purposely took this road so that I could share the experience with a friend who had never been there. In my opinion, this drive is better than Avenue of the Giants.\nShow less"], ["Reviewed December 16, 2016", 5.0, "Family reunion", "Beautiful! We have been coming here for years! The river is beautifully. The water is so clear and clean. The redwoods are amazing! We will continue to come here for many more years."], ["Reviewed December 7, 2016", 5.0, "Gem of the trip", "Turned down Walker? road to get out of traffic and it was the best choice ever. Saw some incredible redwood burls and little glades. Discovered Smith River."], ["Reviewed December 4, 2016", 5.0, "Breathtaking!", "This was the redwood forest I dreamed about. My husband crossed this one off his bucket list and was awestruck."], ["Reviewed November 30, 2016", 5.0, "A wonderland", "My family visited this redwood forest on our family visit. It was a wonderful experience with great walking trails that made it easy for the entire family to enjoy the forest."], ["Reviewed November 28, 2016", 5.0, "Another world", "This is an amazing experience. When we came around a corner and saw the redwoods we both went \"wow\". The entire park is like being in and experiencing another world. It is majestic, so quiet, and absolutely beautiful. This must have been what the world was like before we moved in.\nShow less"], ["Reviewed November 27, 2016", 5.0, "Camping", "Love this park! Quiet and serene. Plenty of things to do between hikes, fishing, and biking. Really neat camp sites around old redwood."], ["Reviewed November 25, 2016", 5.0, "Wonderful park", "This redwoods state park is some what off the beaten path. It has all the features of all the state parks. It's a little bit harder to get to. When you get there you will see the and feel the majesty of the redwoods. This one of those places that is worth a little extra time to stop and enjoy\nShow less"], ["Reviewed November 22, 2016", 5.0, "Brilliant!,", "Driving up from Crescent City you go onto a rough forest road which twists through the giant redwood trees. Amazing sight. Stop at the parking area after about ten minutes drive and take the Scout trail to the waterfall. The views and sounds (very little, it is really quiet) make this a memorable hike. We met a visiting couple who had explored this area before and they said this was the best walk they had found.\nShow less"]]}}