{"Julia Pfeiffer Burns State Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Julia Pfeiffer Burns State Park", "url": "/Attraction_Review-g240329-d142807-Reviews-Julia_Pfeiffer_Burns_State_Park-Big_Sur_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/13/9e/ab/mcway-falls.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1298"}, "address": {"@type": "PostalAddress", "streetAddress": "52801 California State Route 1", "addressLocality": "Big Sur", "addressRegion": "California", "postalCode": "93920", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "easy walk over to a very scenic waterfall; a place to see Condors", "Right now, the road is closed near Gorda so you have to drive in from the north. The drive is long but worth it. If you have visited Pt Lobos, SAVE YOUR RECIEPT! It is transferable to Julia Pfeiffer. You want through a tunnel which goes underneath Highway 1. Once, you come out; make a right turn and walk about 50 yards. Look over; you will see the waterfall.\nThis is one of two places to see Condors. I did see one but it was very far away but the park ranger confimed it was a juvenile Condor.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wow of a short walk", "We were disappointed that all of the trails but one were closed, UNTIL we walked the short path to the waterfall. What amazing views...one of the most beautiful walks we've ever taken!"], ["Reviewed 2 weeks ago", 5.0, "Great!!", "I loved the short hike to the ruins of the house Julia lived in, it seems such a shame they had to tear it down. Beautiful views of the ocean and the falls from the trail. I would have loved to live in the house with the awesome views.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "California Condors!", "We wanted to see California Condors and checked with some state park rangers who all recommended going to this park. It paid off! We saw 4 one morning- 2 roosting in a tree on the ridge and 2 soaring over a distant peak. You will need binoculars to get a good view of them. It is worth the drive which is beautiful. We also saw several whale spouts along the drive. Also there is a vista point about 1/2 mile north which is a great place to see the sunset or watch the fog roll in.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "More of a view than a “hike” but worth it!", "One of those epic postcard scenes of California that seem too good to be true. We were hoping for a longer hike leading to the vista, but it was more of a dirt path from the parking lot, under the highway (1/4 mile). But we came, we saw, and then we sat... there are some benches at the end of the path overlooking a beautiful vista and we had plenty of time with the walk (rather than the hike we allotted for). So we sat there with a bit of bourbon and enjoyed the serenity of Big Sur.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "More to explore", "I always bring people visiting me up here to gaze at the wonderful scenery. I never took the time to explore the trails, mainly because it is impossible to park. Since the highway is still not open all the way to through traffic, we decided to stop and wonder around. While there is always a crowd around, it was worth the venture down from the highway. You cannot go all the way down to the beach, but you can at least get a closer view and learn more about Julia Pfeiffer Burns. A nice sunny day adds to the experience, but also the number of people visiting.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Spectacular!", "Mother Nature at her finest. I can't stress how much I wished we had more time to just stop stare, stop some more and just go with the flow. Allow lots of time to stop, enjoy and see the park at different times in the day too.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Short hike, amazing views", "Great walk to the see the waterfall. Amazing day, breathtaking view of the coast, whales, wind, and beauty can't beat that."], ["Reviewed January 18, 2018", 4.0, "Short walk and some beautiful scenery", "This park has a lovely walk to a beautiful overlook complete with waterfall. There is a $10 admission to park, but that will get you into all the parks along the Pacific Coast Highway. Definitely worth the price.."], ["Reviewed November 28, 2017", 5.0, "Great place to stop on a motorcycle.", "I really enjoy stopping here while riding a motorcycle down the California Coast. It gives a nice walking break. Such a great spot to get off the bike and explore while stretching the legs. ."], ["Reviewed November 25, 2017", 4.0, "Lovley", "A short walk brings me to a beautiful view. Spent a long time here just admiring however it could easily be a quick stop"], ["Reviewed November 21, 2017", 5.0, "Splendid", "One of the most beautiful places I've ever seen. Magical and dreamy. Perfect weather both times I was there in November and February!"], ["Reviewed November 20, 2017", 4.0, "Nice place", "Great place to visit and see God’s Beauty on the California coast...Nice places to stop and see from different angles and nice bridges along the way...Friendly Rangers"], ["Reviewed November 11, 2017", 5.0, "Must see!", "Spectacular special place! Crashing waves along the huge rock with a hole in it is really unique. The tree lined mountains surround and shelter this soft sandy beach. If you want a short drive through moss filled trees with the smell of the forest and then a walk on the softest sand in California with the misty ocean and special viewing of water flying through a huge mountainous rock...go to this place! Its Magical, except for the bathrooms! You do need to pay $10 for the privilege which helps maintain this pristine place. Kids were sommersaulting down the sandy hill & playing in the water and enjoying themselves while parents had some romantic alone time! Take a picnic!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Beautiful lookout!", "Very short walk from the road, and well worth the stop. One of the most photographed spots in California, must see."], ["Reviewed November 8, 2017", 5.0, "Don’t Miss This Gorgeous View!", "Don’t miss this stop! McWay falls is well worth the stop. What a gorgeous view. Just a short walk on a path and there you have it ... the money shot. Just incredible. And once you see the falls ... which are actually pretty far away and appear tiny.. is another gorgeous overlook. Just beautiful. Definitely don’t miss this !!\nShow less"], ["Reviewed November 8, 2017", 4.0, "Beautiful!!I", "Beautiful place and definitely worth going to! You will get several amazing photos while at this park. The rangers are very nice with great recommendations."], ["Reviewed November 7, 2017", 5.0, "Lots of Photos of this Waterfall, but Still Best to See In Person.", "There are countless photos of this waterfall pouring onto the sand and into the ocean. With that being said, it is STILL worth seeing in person. It is a scenic cove along the coast of California with plenty of other photo opportunities along the way.\n\nThe scale of the actual place was surprisingly on the smaller scale of things that I thought it would be so you will probably need to zoom to get a clear shot of the waterfall. The beach is protected so you cannot go down there, nor paddle a canoe.\n\nTravel Tip: Please be careful if trying to get that perfect selfie and going through the gate. The gravel is loose and I would highly recommend staying on the proper side of the gate so you are safe.\n\nTravel Tip #2: If traveling with small children who run and climb things, be sure to keep an eye on them or even better hold their hand. The trail goes along the cliff.\n\nLet me know if these tips are helpful by clicking the like button so I know I'm helping someone. Even if this review helps one person then it is worth the time to me.\n\nAlso feel free to follow along on here or IG (@neonorth) for more travel tips & inspiration to hopefully make your upcoming trip better.\n\nSafe Travels!\nShow less"], ["Reviewed November 6, 2017", 4.0, "A must see", "We were so glad the road was open to go to this park. It's a short walk to the falls and the lookout. It doesn't take much time but it's well worth it."], ["Reviewed October 19, 2017", 5.0, "Cool waterfall", "This was a easy walk to see a waterfall pour into the ocean. Not something you see every day. Great views of the area. Very easy path and short walk. Day pass gets you into three area state parks for $10."], ["Reviewed September 26, 2017", 5.0, "ssshhhh!! - the best kept secret on the drive along the golden coast", "Memorizing views - out of the blue - unbelievable location in the Big Sur area. We can enjoy peaceful beach, do a couple of hikes and be one with the nature. Lets try an keep it a secret ;-)"], ["Reviewed September 14, 2017", 5.0, "Beautiful Hiking Trail", "This is my fave spot to stop while driving around Big Sur. It has a beautiful waterfalls that is just a short hike. But last time I was there for the memorial day long weekend, the trail was closed. Also to save money park at the Lodge area and start the hike from there. It's a very short hike to the waterfalls and it's an easy hike. it's mostly shaded area. I highly recommend wearing comfortable shoes. Also you can use the restroom at the Lodge. It's very clean.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Beautiful spot", "The waterfall onto the beach is a beautiful sight at sunset (or any other time), One of the prettiest places we've seen."], ["Reviewed September 1, 2017", 5.0, "Stunning", "My wife and I hired electric bikes to cycle down to McWay falls, part of the park. It's a really fun cycle and the bikes are great. There are loads of places to stop for photos along the way as the landscape is breathtaking. Getting to the falls was the icing on the cake. It's really very beautiful.\n\nBack by the bike place is a great place selling craft beers on tap also. Well deserved after the ride!\nShow less"], ["Reviewed August 24, 2017", 5.0, "Best State Park Ever!", "Fortunately the road was just recently opened since the mud slides or we would never have gotten to see it! I doubt that we will ever be back to this area again since we are from Pennsylvania. We feel really blessed to have had the opportunity to see one of God's most beautiful earthly natural creations. Pictures cannot come close to capturing the awesome beauty! If you have never seen this, make it a point to do so some day. I have included a few pictures just to whet your appetite.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Beautiful", "Beautiful quick hike off the main road. Worth the stop. Love that they have history boards explaining the story of Julia Pfeiffer."], ["Reviewed August 19, 2017", 5.0, "Hikes and beautiful scenery", "The beautiful cove with a waterfall plunging into the ocean are reason enough to stop here, but there are also a variety of hikes, from short and super easy (to view the falls), to long and challenging. The parking lot is crowded when the roads are open...but not today!\nShow less"], ["Reviewed August 14, 2017", 5.0, "REDWOODS!", "This is the last stop before road closures as of August 12, 2017 on the Big Sur Pacific coast drive coming from the north. The park was almost a ghost town and we had the place to ourselves. A ghost town I guess bc of road closure issues and this being the last stop before having to turn back north most likely has hurt the business of the park. There are redwood hammocks scattered throughout and marked very well with good info signs near by. They are not as big as the Redwoods up north but we had never seen them so they looked amazing to us! It reminded me of the Ewok forest in Star Wars! We had fun with that imagery on our hike. Trails are everywhere and well maintained . Park IN the park and not on the shoulder outside because tickets were being given. We had already paid an entrance fee at Lobos State park so we just showed our receipt and did not have to pay to enter this park.\nThere is a very nice lodge/resturant that literally was empty when we got there as I just got a cup of coffee and the kids got an icecream but it was full service. So if River Inn at Big Sur seems a bit too much and crowded just drive a little further south for a much quieter, less crowded restaurant and hikes here. No ocean views as it is all wooded but that was the beauty of the park!\nShow less"], ["Reviewed August 10, 2017", 5.0, "Nature's Best and not to be missed", "Words cannot explain how beautiful this state park really is. The waterfall that flows to the beach is breathtaking and for those who have a hard time walking, it's really not a hard trek to get a wonderful view of it."], ["Reviewed August 4, 2017", 3.0, "Closed", "The park was closed and no signs were posted. We drove into the entrance of the park and the rangers told us at that point. We were disappointed for sure and told them that signs should have been posted way prior to entering the area. It was after we had made our way to the entrance with the rangers that we saw signs indicating a possible early closure.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Good place to stop", "We visited this place as part of our drive up the Big Sur. The view of the waterfall is great, but if you want to really enjoy the falls, you have to walk down the walkway down to the sandy beach below. The water crashes into the sand here, just metres away from the Pacific Ocean. Parking at the top was a bit limited.\nShow less"], ["Reviewed July 10, 2017", 5.0, "The waterfall in Big Sur", "People are always asking me: \"Where is that Waterfall that falls on the beach?\"\nThe answer is: Julia Pfeiffer Burns State Park.\nYo can't get there right now, the park is closed.\nAside from that, it's on the south side of the Pfeiffer Canyon Bridge. They are rebuilding the bridge, it will be completed in late September or early October.\nSo access is denied from the north.\nAs of this writing - July 2017 - there are still mud and rock slides to the south of there. So access is denied from the south.\nMud and rock slides??\nIt's not raining, hasn't rained in months.\nLet me explain.\nThe late winter rains were so intense, that the slides were so bad, they are still trying to get them cleared.\nAt the extreme south end, 50 miles south of the being rebuilt bridge, is a rock slide so large, it's the biggest, in the over 40 years I have lived on the coast. That slide alone added 16 acres of new coastline to Big Sur.\nBecause the ocean all along Big Sur is a National Marine Sanctuary, the can't push any material over the edge.\nIt all has to scooped up and put into dump trucks, and hauled away. For the largest rock slide in recent history, that's a tall order, not to mention an enormous expense.\nThere are estimating it will take a year to get the highway open on the south end.\nSo plan on visiting the park, after it opens, after the bridge is rebuilt. Late September or early October.\nShow less"], ["Reviewed July 3, 2017", 2.0, "Too many closed trails", "I'm always awed at the beautiful redwood trees and the Big Sue river that winds through this park but it's not as fun as it used to be now most of the trails are closed. If you want to slow down and chill at the river, this is probably the perfect spot. However, for us, we were hoping to do more hiking so it was disappointing. Hopefully the trails will be restored in a year or so.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Landslide area", "Most of the park was closed due to the landslide. But, the park had a beautiful grove of Sequoia, so we walked around for a while here. I'm sure the rest of the park is beautiful when it is open."], ["Reviewed June 19, 2017", 5.0, "Most beautiful place", "This campsite is perfect for anyone who wants to get out into nature for a few days! My favorite place to camp!"], ["Reviewed June 16, 2017", 5.0, "Gorgeous!", "Wow! What a beautiful view! We only had time for the waterfall short walk. It is an easy walk (although the terrain is uneven and a sharp drop on one side; it is something most walkers though could handle). The place was PACKED! Like an assembly line meandering to the best views and then fighting for camera space (or selfie stick space, which is what most people were doing). Even still, it's a beautiful stop. Again, we only had time for the waterfall, but I would go to see it again. The history of the family and Julia Pfieffer Burns is really interesting and it is cool to see the photos of the original home also.\nShow less"], ["Reviewed June 10, 2017", 5.0, "A Short Walk Lead You to See the Amazing McWay Falls", "Julia Pfeiffer Burns State Park (朱莉婭．菲佛．伯恩斯州立公園) is located between Big Sur and Mud Creek near mile marker 35.8 on the beautiful CA-1 coast highway (Highway 1). The 1,522 Hectare (3,762 acres) park was named after Julia Pfeiffer Burns (1868-1928), a local and legendary early pioneer woman and resident of Big Sur. The McWay Falls, McWay Creek and McWay Canyon are named after Christopher McWay, an early settler and farmer from New York State who arrived in the area with his son Christopher Jr. around 1874. The park extends from the Big Sur coastline to the nearby 915 m (3,000 ft) ridge.\n\nWe drove from the south to this amazing California state park. We were lucky to find free roadside parking along the west side of Highway 1. We went across the street and followed the sign to the official parking lot which led us to a tunnel under the highway. After the short tunnel, we turned right and followed the trail to the McWay Waterfall House. The 107 m (352 ft) long trail is right on the edge of the cliff and offers a magnificent view of the McWay Canyon, McWay Cove, McWay Beach and the McWay Falls. Most of the visitors like us brought out cameras and took photos. We could see the beach and the cove below, surrounded by ridges. Before 1983, the beach was non-existent and the falls fell directly to the ocean below. The 1983 huge rainfall resulted in several landslides and mudflows. The mudflow entered the ocean immediately to the north of the falls, creating the beach we see today. In few minutes, we saw the famous McWay Falls right in front of us. The 24 m (80 ft) waterfall seemed small from where we stood because the trail is higher up than the top of the falls. The water flow was not huge and significant, but it is one of two waterfalls in California that cascade directly into the ocean, the other being Alamere Falls. At the end of trail, we saw the Waterfall House that was the house of Lathrop and Helene Brown. Later in 1961, Helene Hooper Brown donated the entire property to the state. The mansion was demolished in 1966.\n\nIt is sad to learn that Julia Pfeiffer Burns State Park is closed and not accessible from both sides of Highway 1 due to road closures, rock slides and dangerous conditions. It is hard to say when it will reopen again. You can check the latest information about the park from park website.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Beautiful", "Near Big Sur, on Highway 1, sits this beautiful spot. Depending on the time of year it can be quite busy and during the summer months can be cold and foggy, with very little water flowing. The spot to see this view is a short walk, not at all strenuous. The view out to the Pacific is gorgeous. Sunset here is spectacular and very popular.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Park open", "This was a beautiful place and had great walk. We spent a couple of hours. We had a picnic lunch and a beautiful view of trees, stream, and nature!"], ["Reviewed May 6, 2017", 5.0, "Great scenic place", "A must stop place on Hwy 1 along the Big Sur Coast. Even after all the storm and fire damage in the area Julia wonderful is still a wondetful park to visit. Rugged coastline and beach with alot of scenic beauty. Forget the tourist stores (except Nepenthe!!) if your time is limited, and enjoy the majestic coast and ocean views.\nShow less"], ["Reviewed April 16, 2017", 4.0, "Beautiful but lots of people", "Really beautiful place but a lot of people. If you want to go here, try and be here really early or come some other day when people are generally occupied with something else, or maybe more off season."], ["Reviewed April 12, 2017", 5.0, "Ewoldson trail", "Amazing hike up a mountain. The hike goes along a creek for a while. Through the redwoods and up to the top of a mountain overlooking the Pacific Ocean. Incredible views"], ["Reviewed April 5, 2017", 4.0, "The view of the waterfall is worth the stop", "The walk down to view the waterfall was a bit challenging and parking was not good. But if if you can find a parking spot, it is worth stopping to enjoy the view. We parked along the side of the road as the parking in the park was full.\nShow less"], ["Reviewed March 15, 2017", 5.0, "Breathtaking!", "Once we found this spot (minimal to no road signs are displayed, so know your GPS coordinates or look for a packed car parking area along the highway!) we thoroughly enjoyed the views and walkway to this magnificent scene."], ["Reviewed February 16, 2017", 5.0, "Beautiful Waterfall, Amazing views", "This was such a gorgeous little cove tucked into the coast line with a really cool waterfall! Beautiful sights! It was a little bit of a walk from the parking area to the cove, but it is all packed dirt trail and definitely worth the walk to take in these sights! Worth a stop on your drive down the Pacific Coast Highway.\nShow less"], ["Reviewed February 6, 2017", 5.0, "Wow - what a beautiful place!", "This park has it all - a good story behind it, a lovely waterfall that descends into the turquoise Pacific along a white sand beach, and then on the other side of the road, trails through a gorgeous, dense, peaceful (except when I was singing \"This Land is Your Land\" - how could I not?) redwood forest. We spent about half a day here and could have walked the trails for another several hours, but had other parks to visit as part of a whirlwind tour of the coast. This is one of the smaller state parks, but the trails are decently long as you change elevation quite a bit and have some pretty spectacular views of the ocean through the woods.\nShow less"], ["Reviewed February 4, 2017", 5.0, "This place never gets old...", "The Julia Pfeiffer Burns State Park is absolutely worth your time... if you're interested in visiting a relaxing and naturally beautiful location. There is an added bonus... often, the park is empty... and you can enjoy the views without having to feel pressured to move along so others can enjoy the view.\n\nAs soon as you turn into the park you will find two different parking areas. The smaller of the two areas is near where you pay (honor system) and also near the toilets.\n\nIf you walk inland from the parking area there is an easy to follow path that follows a small creek. The path has very gentle elevation rises through old-growth Redwood trees. After about 20-25 minutes you'll come to small three-tier waterfall. There is a bench at the base of the waterfall where you can sit and enjoy the serene beauty.\n\nIf you walk toward the ocean from the parking lot you will take an easy path that takes you through a short walking tunnel that allows you to pass under the highway. This path then takes you to the end of the continent. There is a beautiful cove with a pencil thin waterfall that makes the trip worth while -- this is a good investment of your time.\nShow less"], ["Reviewed February 2, 2017", 5.0, "Stop at this waterfall no matter what", "This State Park has a very short walk to one of the most photogenic water I have ever been to. The creek pours straight off a cliff and onto a beach. Don't miss this it is well worth the fee."], ["Reviewed February 2, 2017", 4.0, "Beautiful area BUT.....", "This is a beautiful area but we came here to see this spectacular waterfall and when we actually saw it we were very disappointed. It was a tiny stream of water and you can't even get close to it. Extremely disappointed in this so called tourist spot.\nShow less"], ["Reviewed January 29, 2017", 5.0, "Roadtrip worthy. Can't wait to come back by bicycle!", "Big Sur roadtrip with a friend. Of course we couldn't skip McWay Falls and Pfeiffer Beach. Beautiful! I'll be back by bicycle! :)"], ["Reviewed January 26, 2017", 5.0, "Stunning views and trails", "The McWay Falls is the top destination on the 100 mile Big Sur Coast and it's easy to see this beautiful spot by taking a short hike. If time permits hike the other easy side trails to take in the majestic beauty of JPB State Park. With the recent storms this park's streams are roaring with water that cascade down to the tide fall. Listen closely and you will easily find a trail to follow.\nShow less"], ["Reviewed January 16, 2017", 4.0, "Stormy day", "The road was a little less crowded on a stormy day and although harder to see the scenery was spectacular. Found a completely hidden away trail right off the road. However, the park itself was closed the day we were there and no signs telling us why.\nShow less"], ["Reviewed January 15, 2017", 5.0, "This iconic view is available from the road", "Don't settle for that, park and take a short easy hike to get even better views of the falls. there are also other worthwhile hikes within the park"], ["Reviewed January 10, 2017", 5.0, "Wish I could spend more time here", "I had a half day to spend before a flight home from a business trip and stopped by. Absolutely a favorite location of mine and I hope to return for a much longer stay in the future."], ["Reviewed January 10, 2017", 5.0, "Ewoldsen Trail & McWay Falls", "This is a perfect trail/hike combination to see spectacular views of the Pacific Ocean in the Big Sur area of Highway 1. It is an easy to challenging hike for families- there are some steep ascents, you gain about 1,600 feet. Be sure to bring water, the parking fee was $10. The hike to the McWay falls is paved and easy. We recommend arriving early in the morning to secure parking and avoid the crowds. When we left around noon, cars were waiting to get into the parking lot. You can also park along highway 1.\nShow less"], ["Reviewed January 9, 2017", 5.0, "Beautiful, rugged beach with purple sand", "This is a beautiful beach to walk along and take photos. It's small, and it was windy (January). The waves were violent, and the sand was purple."], ["Reviewed January 7, 2017", 5.0, "Absolutely gorgeous", "This place is like something out of a dream... Hard to believe that the water is so blue... A must if you're in the Big Sur area!"], ["Reviewed January 7, 2017", 5.0, "McWay Falls and Ewoldsen Trail is a must!", "We stopped at Julia Pfeiffer Burns State park to check out McWay Falls and hike the Ewoldsen trail.\n\nMcWay Falls is beautiful, and there a short walk (not strenuous at all) to see a very different looking points.\n\nWe then hiked the Ewoldsen trail and we are so happy we did! The trail is 6.2 miles and can be strenuous at times. In the beginning of the hike, you are hiking through a redwood forrest with beautiful trees and creeks. As you move higher up, you begin to see views of the ocean. At the summit, there are the most incredible views as you high up in the mountains but still have the view of the ocean. We were so happy we did it. It is definitely strenuous and I believe it took us around 3-4 hours in total. We did stop a lot of take pictures, but I would budget around that much time.\n\nMany travel sites we looked at suggesting doing both McWay and Ewoldsen hike in the same day if you only have one day in Big Sur, which is what we ended up doing. I would highly recommend it.\nShow less"], ["Reviewed January 6, 2017", 4.0, "Short and Sweet", "We came to JPB State Park 2 days before Christmas Day, around 8:30 a.m. There was no one there, we had the place to ourselves for almost an hour. It's possible to park along the road and take the stairs down to the coastal trail, or park inside the park ($10) and then take the underpass to the trail. The trail along the coast is mostly flat, and it's not very long (we were there for less than an hour and we took our time getting to the end). Along the route, first you'll see the waterfall, which is pretty. Further along the route there are a few more spots to stop and enjoy the scenery, and the waterfalls from different angles. The trail ends at the ruins of the old Burns house that used to be there, and there are plaques that explain the history. It's not possible to get down to the falls. Views are spectacular.\nShow less"], ["Reviewed January 5, 2017", 5.0, "Great Views", "Beautiful state park on Hwy 1, past Nepenthe town. Main attraction is McWay Falls, which drops over a cliff into the Pacific Ocean. A short walk from the parking lot leads to fall overlook.\n\nIn addition, there are other hikes here so one can easily spend a day in this park. Some hikes have trailhead through the mainn entrance while few have trailhead from Hwy 1 itself, eg Partington Cove Trail\nShow less"], ["Reviewed January 1, 2017", 5.0, "Avoid On Holidays!!!!!!!!!!!", "This place is absolutely incredible........when you get there. Try to avoid going near holidays at all costs. I would recommend going during a nuclear war or any other type of disaster that will keep people at home. This place is incredibly crowded. Traffic getting there is HORRIBLE. I'm talking like 5-15 mph at max. Once you get to the park, parking will be a HUGE issue. Overall, the beauty of the park is worth the wait. Just be prepared for the hordes of tourist.\n\nSeriously, do your research and try to go when it is not busy. Good chance it might have to be on some super random weekday with crap weather. Otherwise go as early as you possibly can.\nShow less"], ["Reviewed January 1, 2017", 4.0, "Fantastic but arduous hike", "Fantastic but arduous hike from front of the park all the way to view spots at the top. Not for the faint hearted or weak kneed as some of the hills both up & down very steep. Views are majestic & worth the effort. Parked on the side of the road which didn't seem to be a problem. Worth a visit.\nShow less"], ["Reviewed December 31, 2016", 5.0, "Gorgeous coastal views!", "Absolutely stunning! Enjoy beautiful, picturesque views of our golden coast that cannot be missed. Nice short hikes available. A few coastal redwoods, in addition to the famous waterfall. Just beautiful. Don't miss it! $10 to get in (parking/state park fee; free if you have the CA annual pass) it gets pretty crowded so the earlier the better!\nShow less"], ["Reviewed December 27, 2016", 5.0, "Great hike", "There is a nice trail to the McWay Falls view and an explanation of Julia burns. Inside the park is a 4 mile loop through redwoods over river into chapparel and then a great view of the ocean."], ["Reviewed December 27, 2016", 5.0, "A must-stop on your trip down US 1", "Definitely hike the Ewoldsen trail: a bit of work, but SO worth it!! Redoods, boulders, waterfalls, coastal views. A great lollypop loop trail!"], ["Reviewed December 26, 2016", 5.0, "nothing quite like it”", "Behold the majesty of McWay falls, located just off PCH. There's usually plenty of parking on the road, if you'd like to avoid the $10 parking fee. Up to the south of the falls is a trail into the campsite area that is absolutely worth the extra trek. Poke around the trees and you will find the most enchanting and secluded little spot, perfect for a nap or picnic.\nShow less"], ["Reviewed December 23, 2016", 5.0, "Like a postcard...", "Majestic beauty. A must stop if you love the outdoors and are in the Big Sur area. Visited in December with minimal crowds. Easy hike to the McWay Falls from the parking lot. There's also a redwood forest you can hike through. Gorgeous. Pristine park and well maintained. Pay $10 to park inside or park across the street for free. Bring a picnic lunch for an extra treat. We came here to do a toast for our twentieth anniversary and couldn't have chosen a better place.\nShow less"], ["Reviewed December 21, 2016", 5.0, "Back Again and Mesmerized Again", "Julia Pfeiffer Burns State Park is truly a place you could go to again and again and never get tired of the view.\n\nWe picked up some sandwiches at the Big Sur Bakery's general store and ate them overlooking a spectacular view. Talk about Dinner Theater!\n\nThere's a nice Redwoods trail that we didn't do this time but we took the short, easy Lookout trail to see McWay Falls and the Gorgeous piece of the Pacific Coast. Utterly mesmerizing!\n\nAs a note, this time we discovered that there are steps to access the lookout point from the other side of the highway, so if you happen to snag a parking spot you can get down from there for free.\nShow less"], ["Reviewed December 18, 2016", 5.0, "Spectacular", "My husband and I visited with friends...we were blown away! The drive down route 1 to get here was awesome enough. We absolutely loved McWay Falls. The hike to it was pretty easy. We also hiked in the redwoods a little, which was also beautiful. Fabulous, and a great experience!\nShow less"], ["Reviewed December 18, 2016", 5.0, "Absolutely Majestic", "The view of McWay Falls is absolutely Stunning. I recommend going early to beat the crowds...or maybe just opt to travel during the week as opposed to the crowded weekend. There are hiking trails that take you into the redwoods. Some trails are rather long, with plenty of switchbacks. If you do the longer trails, get there early so you have plenty of daylight to completely enjoy all this park has to offer! There was a waterfall, but the one down the road at Limekiln Park was a bit more stunning.\nShow less"], ["Reviewed December 18, 2016", 5.0, "Trails", "We wandered under the road from McWay Falls and had a stroll along the Ewoldson Train as far as Canyon Falls. It was hard to find the trail going any further as it wasn’t clearly marked and after encountering other people who were having the same issue, we decided to turn back to the car.\nShow less"], ["Reviewed December 17, 2016", 5.0, "Stunning Must see Beauty", "This is one of the most iconic parks and beaches in Big Sur. I actually got to work on a film set there a few years back and loved it. I send all my friends and visiting guests to this beach. If you miss it...you are missing part of the exxence that is Big Sur. Sunset or sunrise are the best times to visit!\nShow less"], ["Reviewed December 14, 2016", 5.0, "Amazin!", "A short 1/4 mile walk to see this beautiful and amazing waterfall that flows down to the beach area. You can pay $10 to park and walk the trail to view the falls, or, a lot of people park on the side of the road and walk down a long stair case to reach the trail. I would highly recommend taking this in while in Big Sur. We loved it!\nShow less"], ["Reviewed December 6, 2016", 5.0, "Great views", "This is a lovely park with hiking trails. We enjoyed walking through the tunnel to see the falls. Even though there were a lot of people there we did not feel crowded."], ["Reviewed December 1, 2016", 5.0, "Fantastic hiking", "We did the McWay Falls hike as well as the longer one through redwood forests and around the canyon. Spectacular views and a wonderful experience."], ["Reviewed November 30, 2016", 4.0, "Beautiful as always, but so crowded!", "Even on a weekday in November ( Thanksgiving week) it was crazy busy. We parked on the road with the hundred other cars and had to be very careful crossing. The state park service really needs to figure something out for parking as it has become very dangerous for everyone along the highway here!\nThat being said, the views here some of my favorites of the entire Pacific Coast! The camping area was occupied, so we couldn't get to my very favorite spot, which was disappointing as we live about 600 miles away!\nI would NOT recommend ever going here on a weekend, or any type of vacation time. It is so crowded it is like being at Disneyland, which takes away from the beauty and serenity.\nShow less"], ["Reviewed November 28, 2016", 4.0, "Busy, but worth it", "On the Friday after Thanksgiving, 8 of us walked around the state park. It was quite busy, but the view was absolutely stunning. We even saw dolphins as we were walking. Parking and rest rooms are sparse and what trail to take wasn't well marked either. However, it is worth figuring out.\nShow less"], ["Reviewed November 26, 2016", 5.0, "hidden gem.", "gorgeous sand, hidden beach. not too crowded, clean, unique beach. easy to walk and easy to get to, once you find the turnoff."], ["Reviewed November 22, 2016", 5.0, "Gorgeous", "Well worth it! beautiful views. Great hiking trails a taste of the beach and the redwoods. Would plan better next time to bring lunch and picnic in the park and do some longer trails."], ["Reviewed November 19, 2016", 5.0, "Just beautiful", "You have to witness this state park in person. One of the most beautiful places I have visited. If you're in the area, you have to make the drive up the coast. Park your car and enjoy the area."], ["Reviewed November 19, 2016", 5.0, "Surf, Beach walk, take photos ... paradise", "We visiting here this summer. Big Sur had just opened after the massive fires. Smoke still in the air. An amazing trail hike along the cliff and down to the shore. Don't miss this highlight of the Cali coast."], ["Reviewed November 17, 2016", 5.0, "Two great parks in one", "We began our day by hiking the Ewoldsen Trail, located on the east side of Highway 1. It was a strenuous hike (we're in our 60s), but certainly doable and enjoyable. The view from the top ridge of the hike provides a spectacular view of the mountains and forests leading to the Pacific Ocean. Upon returning to the carpark, we strolled over to the waterfall on the west side of Highway 1 and the trail that parallels the cove. A beautiful little walk that 2-90 year olds can manage. What a great state park!\nShow less"], ["Reviewed November 15, 2016", 5.0, "My peaceful place", "My family and I are fans of spending quality time in the outdoors and this is our go to place every year. I family camp with my husband, 1 son and 3 daughters. My kids ages are 21, 17, 11 and 8and we camp each year together and enjoy the family quality time we have here. I will be making another trip to show friends what a beautiful place I love coming to every year.\nShow less"], ["Reviewed November 15, 2016", 5.0, "Don't miss it", "The falls are best to be viewed in the afternoon if you into a great picture. Expect crowds. In the morning the falls are in the shade. Still pretty but not a photographic winner. Don't miss partington cove if you want to see otters and rugged Big Sur coast line.\nShow less"], ["Reviewed November 8, 2016", 4.0, "Easy Hike", "Enjoyed the hike, the Rangers was able to point out the condors that fly over each afternoon. Take note most of the trails are closed right now because of the recent fires."], ["Reviewed November 8, 2016", 5.0, "Hiking in sunshine", "Fabulous spot ! Don't miss this beautiful area. Short drive from Carmel ! We stayed at Glen Oaks for 2 nights and enjoyed all of Big Sur !"], ["Reviewed November 5, 2016", 5.0, "Stunning", "Great view point to see one of the most spectacular waterfalls.\n\nIt's only quite small but the fact that the water jets out from the cliff straight onto a beautiful beach is just stunning. You can pull onto the side of the road and view or park up in the national park.\nShow less"], ["Reviewed November 5, 2016", 5.0, "challenging but worthy", "The 4 mile hike through pfeiffer state park was one of the most challenging but really fun experiences of my life. we love to hike so thought this would be a great two hour experience. in fact it took us 4 hours because much of it was up hill but so worthwhile. in the end my phone said we climbed 78 flights, walked 5 miles and 16,000 steps. but getting to the top was amazing and the views beautiful.\nShow less"], ["Reviewed November 1, 2016", 5.0, "Absolutely beautiful - a must-stop", "The State Park is home to some beautiful trees and coastline. McCoy Cove is its highlight, with one of only two waterfalls that empty into the Pacific. The cove is so scenic, and a board walk takes you above it. There is no access to the beach, so the views are never spoiled. Think entrance to the park was $10 per vehicle. A very short walk, with huge reward. Beautiful.\nShow less"], ["Reviewed November 1, 2016", 5.0, "A drive by and a must stop place", "Amazing place to stop by while driving along the PCH, spectacular views. Lovely coast and scenery with places to stop by and admire the unspoilt natural beauty."], ["Reviewed October 30, 2016", 5.0, "Awesome", "Don't miss this and spend some time! Short 2 mile drive off mile marker 45. Watch the tides and surf if you choose to walk a mile north. I took time to try my skill at rock balancing...perhaps you can find a more personal connection to the beach....enjoy!\nShow less"], ["Reviewed October 29, 2016", 5.0, "The view is breath-taking", "We just happened to take a break at the spot where this exact picture was taken. The little waterfall, the deep blues, the sea breeze, the height, and the sounds all make for a once in a lifetime thrill. PCH drive is fantastic!"], ["Reviewed October 29, 2016", 4.0, "McWay Falls and More", "Enjoyed our visit. Very small park. We enjoyed the walk to McWay Falls and a waterfall trail in the park. The waterfall trail wasn't well marked, but we figured it out after a few false starts. Note: you don't have to pay the park entrance fee to see McWay Falls. There is parking along the road and access by a fence past the park entrance on the coast side of the road.\nShow less"], ["Reviewed October 29, 2016", 1.0, "What a waste", "The drive to get there is gorgeous. But if your goal is to get up close and personal with the waterfall, well the pictures you see online will be better. You are herded onto an easy walking path above the beach and waterfall. The waterfall appears to be a trickle and there is no beach access. Is it a pretty setting sure, but don't go out of your way here just to get great pics of the coast/beach...you can find photo ops all along the coast as you drive.\nShow less"], ["Reviewed October 27, 2016", 4.0, "Wonderful view", "Could see the wonderful view of the waterfall. One need not hike to see the waterfalls as one can see the same from the road. One should not miss the site while travelling through this route. A good place for photography."], ["Reviewed October 27, 2016", 5.0, "House with a view", "Pay the $5 entry fee, it's worth it and the money helps support the park. Follow an easy and pleasant path from the parking lot, under the highway to the cliff's edge. Along the way you'll see a beautiful cove beach with thr delicate McWay waterfall streaming out of the cliff face onto the beach below. Continuing on to the end of the trail, you're standing at the end of the point, in front of runs of the Lathrop Brown house. You can only imagine now how spectacular the house and it's views were. Plan at least a couple of hours to hike and enjoy this special park.\nShow less"], ["Reviewed October 24, 2016", 5.0, "Wonderful Ewoldsen Trail Hike", "This was a great state park. Bathroom was in nice condition. We parked right on the 1 so didn't have to pay for parking.\n\nWe hiked the Ewoldsen Trail and I would highly recommend the trail. It is rated Moderate but I would say it was a difficult Moderate. A little over 5 miles total and the first 2.5 miles are quite steep going up the canyon. When you get to the Waters trail at the half way point don't skip it! The best views are at the end of that trail and if you go far enough you will find a nice bench to rest on.\nShow less"], ["Reviewed October 23, 2016", 4.0, "Stop for a view of the waterfall", "The park was ridiculously busy for a fall Friday, and we barely found a parking spot on the highway pull-off. The park's lot was full. We quickly caught a view of the waterfall from the highway and didn't bother to hike. Just too busy this time. It was a great view anyway.\nShow less"], ["Reviewed October 20, 2016", 5.0, "Do not miss that!", "Awsome! Except the parking price which is 10 dolars! Just park on the road side! You can rich the viewpoint in 5 min."], ["Reviewed October 18, 2016", 5.0, "A beautiful sight!", "Ever since my first time years ago driving the Pacific Coast Highway and discovering this state park I've always told others of how beautiful this place is... how a small creek comes tumbling down the mountains to form a waterfall that ultimately splashes on to the sand meeting the sea in this tiny cove. The image is to me as beautiful if not more than an ancient Chinese watercolor painting,something so beautiful that only an artist could could imaginatively put on paper or canvas. Don't drive by mindlessly without at least a brief stop to take it all in,you won't regret it!\nShow less"], ["Reviewed October 16, 2016", 3.0, "Nice by small", "Maybe we missed something but besides Mcway falls, there's really nothing else to see on the other side except a small old fashioned wheel. So id skip paying the money and just see the falls by parking on the highway"], ["Reviewed October 12, 2016", 5.0, "Beautiful Views, but Overrated", "The hike isnt very long and the waterfalls aren't very impressive around this area. However, the views are breathtaking."], ["Reviewed October 8, 2016", 5.0, "Wonderful Views of the Falls", "The views of the falls are simply stunning. You don't even need to hike as you can see it all from the road."], ["Reviewed October 5, 2016", 4.0, "Some closure due to fire but wow!", "Walked to McWay Falls and out on the bluff on the other side of the falls, which is also picturesque. The walk is easy and beautiful\nand even though parts of the park were closed as a result of the fire, there are other walking trails and really nice picnic areas, which you can access now. The falls are amazing and the drive on highway 1 is something to behold!\nShow less"], ["Reviewed October 2, 2016", 3.0, "Nice little stop", "Just a little disappointed by this place. Yes, our main trek, the Ewoldsen trail was closed due to fires. Big disappointment there. We paid the $10 to get in not knowing the trail was closed and not knowing you can easily get to the waterfall from Hwy 1. The trek to the waterfall was hot and dusty. You see the waterfall, take a pic, and that's about all. Park on the road and walk right in.\nShow less"], ["Reviewed October 2, 2016", 5.0, "Beautiful!", "Must see. Short hike and worth it! I strongly recommend it. Great history and great photo opportunity."], ["Reviewed October 1, 2016", 5.0, "Had to Relive the Beauty", "My family visited this beach 20 years ago and we noted then that it was one of the most beautiful beaches on earth. It is hard to find, as the exit is not clear, but now you pay a state park fee of $10 just to walk the beach. The winds were brutal when we visited but we still had a fabulous time sitting on some rocks and watching the waves crash on the giant rocks and sea walls.\nShow less"], ["Reviewed October 1, 2016", 4.0, "Great stop on long drive", "We stopped at the park on our drive from Los Olivos to Monterey. Unfortunately the longer hike through the redwoods was closed due to the fires, but the waterfall was a great surprise. While the waterfall itself isn't very large, you can take the short walk to see great views of the Pacific. This is a great short stop to stretch your legs- and I'm sure the longer hike through the forest is great when available.\nShow less"], ["Reviewed September 28, 2016", 5.0, "Heart wrenching beauty at the edge of western civilization", "The beach, the redwoods, the waterfalls, and camping above the waves of the Pacific, I probably should not rate this as it is coveted by more and more locals, Prime camping sites above the ocean arte gone for the season within MINUTES of them becoming available.\nShow less"], ["Reviewed September 27, 2016", 5.0, "Mcvey falls", "If you stop to see nothing else on the coast, stop to see mcvey falls. Extremely short walk. Only negative was small formal parking lot but worth parking on side of street for."], ["Reviewed September 23, 2016", 4.0, "In The Woods", "Great place to just park and choose a trail and get lost. There is a $10 fee to park and not a lot of parking. You can park on side of road if you can find a space."], ["Reviewed September 21, 2016", 5.0, "This is such a special sight you shouldn’t miss while traveling on the PCH, so worth the short walk a little effort!!!", "Entrance was included with the point lobos 10$ entry fee we paid earlier so save it if you’re planning visiting more than one state park (good for the same day only)!\n\nThere were not many parking spaces available inside the park but we managed to find a good spot. Trail is on a high ledge but well secured with fences.\n\nAfter walking for 15 min we saw the amazing fall pour down merging to the hypnotic crystal blue beach… took us about 1 hour to complete and return to our car.\n\nThis is such a special sight you shouldn’t miss while travelling on the PCH, so worth the short walk a little effort!!! Took some great pictures too :)\nShow less"], ["Reviewed September 17, 2016", 4.0, "Beautiful view, just like on the calendars", "If you are driving along Big Sur, it is definitely worth stopping at Julia Pfeiffer Buns State Park to see McWay Falls. We were fortunate to visit in June before the wildfires. We parked in the small parking lot and followed the trail to the falls overlook. We also followed the trail in the other direction along the coast (lovely wildflowers), back to the parking lot, and for a short distance along the trail into the woods before returning to the car. The highlight was definitely the falls. If you’ve seen photos of them on calendars, then you’ll know exactly what to expect.\nShow less"], ["Reviewed September 17, 2016", 5.0, "Best view - McWay falls", "A must. The view of the falls is incredible. We Parked our car on the side road of highway 1 and walked the short trail down the road. It's a 10 min walk and the view is unforgettable. Don't miss it!!"], ["Reviewed September 15, 2016", 5.0, "Amazing views", "Unforgettable drive with wonderful vistas and so many places to stop and take in all that nature has to offer! A must!"], ["Reviewed September 14, 2016", 5.0, "Best nature has to offer!", "The park itself is a redwood wonderland. The shore is clean and beautiful! Breathtaking, I live in paradise!"], ["Reviewed September 13, 2016", 5.0, "Beautiful views of McWay Falls", "A must stop on your drive south on PCH1. It is $10 cash to pay to park in a self-serve envelope. After a short walk down a trail you come to excellent views of McWay Falls. We didn't walk the beach, but just the above view is well worth the stop\nShow less"], ["Reviewed September 13, 2016", 5.0, "Must-see", "One of the most beautiful places on the California coastline. We were there on a beautiful day and there were many incredible views. We could see whales off the coastline. The McWay Falls were fantastic. We didn't get to explore as much as we wanted because of the wildfire, but I would love to go back when I have the chance. The park staff was friendly and helpful in pointing us where we wanted to go.\nShow less"], ["Reviewed September 11, 2016", 5.0, "Amazing views", "If you are driving on the PCH this is worth the stop. We couldn't get the full experience because it's closed due to the fires but we stopped on the side of the road. You can walk along the side of the road and get a great look at it. It's a breathtaking view. Make sure you have plenty of gasoline because the nearest gas station is very far. We learned the hard way and paid 5.00 a gallon for gas.\nShow less"], ["Reviewed September 10, 2016", 5.0, "Stunning", "One of the most beautiful spots I've seen in California. It's tough to describe how cool it is. I went on a perfect weather day, but I imagine even on off days it would still be breathtaking"], ["Reviewed September 5, 2016", 4.0, "Magnificant", "This location is stunning. Disabled people can take the flat hike to see the gorgeous waterfall to the beach. If you go all the way to the point, you will see the cabin. Really a beautiful location."], ["Reviewed August 29, 2016", 2.0, "Its was closed", "We paid 10usd to park and see the disappointing Mc Way falls as the park was closed and they did not mention this before we pay. Pfeiffer beach is nice but if you have seen Point Lobos maybe it is not worth the detour."], ["Reviewed August 28, 2016", 5.0, "Stunning views of the Falls in the beach", "The state parks were closed because of the fires but you could still stop on the PCH and get a great view of the falls onto the beach. Amazing."], ["Reviewed August 28, 2016", 5.0, "Worth the drive!", "It was over an hour drive south of Carmel, but seeing McWay Falls was definitely worth it. Because of the forest fires, the only trail currently open in the park is the short Overlook Trail to get to McWay Falls. Photos and postcards don't do this justice. Spectacular and a must-see! $10 to get in the park, which we paid, but many people were parking on PCH and walking in.\nShow less"], ["Reviewed August 18, 2016", 4.0, "Great place for watching sunset", "Before the sunset, the fall, the beach, the sea and plants around were in a lovely color. I think it a great time for girls to have their photos."], ["Reviewed August 17, 2016", 5.0, "Iconic experience", "Julia Pfeiffer Burns State Park was one of the highlights on our Californian road trip - the scenery was spectacular - highly recommended."], ["Reviewed August 13, 2016", 5.0, "Gorgeous spot - a must!", "This is such a beautiful spot and you can visit it quickly if you are driving past, or spend more time as we did. This is the type of scenery that the California coast is famous for. The lookout over McWay Falls is awesome (you can't go down to the beach) and there is a reason why there are tons of people there - it's breathtaking. Don't let the idea of crowds put you off - it's worth it anyway! There was enough space for everyone. You can park on the roadside (free) and walk in, or drive in and pay for parking. Having a rental car, we chose the latter and had to wait a bit for a spot. Then it was a 5 - 10 minute walk (flat though not paved) to the best lookouts of the cliffs and ocean. We also explored the redwoods which are nice, too. There are some picnic tables near the first parking lot. With stunning ocean views, cliffs, a waterfall and rocks in the sea, this park is highly recommended.\nShow less"], ["Reviewed August 11, 2016", 5.0, "Great hikes", "You can do the famed McWay Falls hike from this park, though views from atop outside of the park are really spectacular as well. We came here to hike Ewoldsen Trail which I highly recommend. Leads up, up into the forest with spontaneous outlooks over the coast. Streams, gorgeous trees, and quite a climb.\nShow less"], ["Reviewed August 11, 2016", 5.0, "Must stop for this", "This was the highlight of our drive down the coast. Mcway falls is something you just have to see.Parking is minimal so get there early."], ["Reviewed August 10, 2016", 5.0, "Big Sur nature at it's best", "A very touristic spot, but when you get there you will understand why. This is Big sur coast nature landscape at it's best."], ["Reviewed August 10, 2016", 4.0, "Postcard perfect", "We have been here often. No matter what the weather, it's always a super special spot. It can get a little busy so best to get here first thing in the morning or later in the afternoon."], ["Reviewed August 5, 2016", 1.0, "Closed due to fires", "Be aware that this week 5th August, many state parks in Big Sur are closed due to the forest fires raging in the hills behind. Many of the turnouts and lookouts are also closed due to fire fighting equipment so check the state parks website before you travel.\nShow less"], ["Reviewed August 5, 2016", 5.0, "Closed", "The park was closed but we pulled over to at least look down and its spectacular!! Wish we could've went down but it's a site to see for sure."], ["Reviewed August 3, 2016", 5.0, "Crowded but worth it", "It is a great stop on your way to LA or San Francisco. If you are driving the Pacific coast line, you have to make a stop here. Parking sometimes is limited, and you will have to park on the street.\n\nThe view is breathtaking, but you can't go to the beach, just watch it from far. Still is a great stop.\nShow less"], ["Reviewed July 30, 2016", 5.0, "Yes, yes, yes", "This place is wonderful. We only had time to walk over to see the falls but that was absolutely worth giving California State Parks $10! The walk over to see McWay Falls is very easy."], ["Reviewed July 30, 2016", 4.0, "Beautiful scenery", "Beautiful views after a short walk from parking lot which, by the way, seemed quite small for the number of people visiting at the time we went there. So don't be surprised if you have to park at the road shoulder."], ["Reviewed July 28, 2016", 5.0, "Beautiful Scenery", "Julia Pfeiffer Burns State Park is easily accessible right off of the PCH. The highlight of the park is McWay Falls, which drops out of the rocks nearly into a cove of the Pacific Ocean. This site is so picturesque, and well worth the park entrance fee of $10.\nShow less"], ["Reviewed July 27, 2016", 5.0, "We thought the views could get more beautiful driving down PCH... and then we found this place!", "Just amazing! A beach beyond anything... we had the most beautiful day when we were hiking here so the beach was just so beautiful it's difficult to even describe. A definite must stop along the way if you ask me. I wish we had more time so that we could have hiked up hill as well.\nShow less"], ["Reviewed July 25, 2016", 5.0, "Wonderful Views and Walking Trails", "You could spend the whole day here. There are so many walking trails that lead you through the woods and along the gorgeous coast. You can pick up a map when you enter the park. Bring your camera and plan to stay a few hours, at least.\n\nIt's a good idea to bring food with you because there's not much to buy in the park.\nThere are some great picnic spots.\n\nIt's usually crowded here. It's a popular place where the camping spots are booked a year in advance. Plan ahead if you want to camp.\nShow less"], ["Reviewed July 25, 2016", 5.0, "The View", "This is a place to go to take a picture of the beach front, waterfall and ocean, from high above and soak in a second ocean view further down the path at the end. No one appears to stay to do more than that so I can't speak to any other areas of the park. Parking in the park is $10 and rarely available. Most people park along the side of State Route 1. When I left, I followed a more direct route to my car. You can actually get to trail/view areas on the opposite side of the street from the park off State Route 1, down some stairs and following a path. A much more direct route depending on what side of the highway you are on. There is a steady stream of photo takers and most only stay a short time. It is a short and easy walk for most every age and level of ability. Knowing that it is often necessary to park along the side of the highway in Big Sur, I rented a small car and found it very easy to park in tight spots and where there was a bit more room between my car and the road. Note that there are similarly named parks. There is another park called Pfeiffer Big Sur State Park and Pfeiffer Beach. Neither of these are Julia Pfeiffer Burns State Park. Note as well that the beach front pictured is not accessible.\nShow less"], ["Reviewed July 25, 2016", 5.0, "Short walk, beautiful views", "Very short walk from parking lot or street. I recommend coming in from the park/parking lot itself if you have small children. If you go from the street, it's a pretty steep hill. Of course there were lots of people. Parking lot said it was full and had no problem finding a spot on the street. When we did go to the park entrance, we did notice a lot of spots open even though the sign said full. Doesn't hurt to drive through and check but it is $10. Street is free. Views are beautiful!!\nShow less"], ["Reviewed July 24, 2016", 5.0, "Must See in Big Sur", "I've been to Big Sur before, but his was my first trip to Julia Pfeiffer Burns. If you like to hike, this is an absolute must see. We parked in the $10 lot, did the short walk to see the falls, and then hiked the Edwolson trail. We are an experienced group of hikers from the Bay area. We've seen steep climbs and beautiful vistas. This hike included both and was very impressive. It's not easy. The trail has a large elevation gain and some of it is narrow. It'scompletely worth it, though!. First you hike through beautiful woods with serene waterfalls .Then you reach the top with ocean views in abundance. Bring plenty of water and a camera. Other tips: Go counterclockwise around the loop so you are uphill in shade. Take the \"Waters?\" (Can't really remember name) off shoot trail about 2.5 miles into the loop. It offers sweeping ocean vistas and a nice place to stop for a break.\nShow less"], ["Reviewed July 24, 2016", 4.0, "Impressive View!", "Nice little hike to a pretty amazing view of one of California's more interesting natural phenomenon. Parking can be tricky so utilize the first spot you find."], ["Reviewed July 24, 2016", 4.0, "Short walk and LOTS of people.", "Don't expect wilderness and alone time. Crazy busy. It's still amazingly beautiful but just be prepared."], ["Reviewed July 24, 2016", 5.0, "Great trails!", "My wife and I stopped here to do some hiking on July 12, 2016. We both like waterfalls and were able to get to 4 different ones on the trails. For flat-landers, it was a good workout with amazing scenery!"], ["Reviewed July 24, 2016", 5.0, "One of the more beautiful stops along the coast", "One of the more beautiful stops along the coast, access to views are good, cannot reach the falls except by climbing down. However, the streams and woods towards the mountains are great and very refreshing."], ["Reviewed July 23, 2016", 5.0, "Amazing State Park", "This is a very popular park. We had parked on the highway (like a lot of people) and walked down to view the waterfall. It is a very short walk from the highway. I would highly recommend."], ["Reviewed July 23, 2016", 4.0, "Beautiful waterfall!", "You cannot get anywhere near the waterfall, but it is beautiful! Worth the stop!! There is a bathroom where you park, but it is not clean."], ["Reviewed July 22, 2016", 5.0, "Julia Pfeiffer Burns state park", "Loved it. Although You can't go to the beach where the falls are, its a pleasant hike with beautiful views of the falls and coast line. Big Sur at some of its finest! Parking is limited and can be a problem but is worth the stop!\nShow less"], ["Reviewed July 21, 2016", 5.0, "A Must See", "There are many different attractions to choose from in Big Sur. Choose this one. There is a $10 fee to park inside the park, but you can park on the main road and make the short walk in for free. We learned this by accident because the parking lot was full. We totally weren't prepared for a hike, but were still able to make the trek to the falls with no problem. It's just a must see. The waterfall is beautiful. You can also see the remains of the house that was once located at this spot. I would recommend this to everyone.\nShow less"], ["Reviewed July 21, 2016", 5.0, "Incredible", "This was once a residence. When you stand there and try to absorb that fact, it's surreal. The beauty is stunning, the air is pure and the sound of the waves puts you in an altered state. A must see for anyone driving thru Big Sur.\nShow less"], ["Reviewed July 21, 2016", 4.0, "Short hike, but great coast views", "It offers two hike destinations. McWay Fall is a short hike with a great view. The Ewoldsen trail is a beautiful nature hike offering interesting trails taking you further into the surrounding area."], ["Reviewed July 20, 2016", 5.0, "Amazing!", "My wife and I went here on our road trip north. It is a must do for anyone driving the PCH. We went and the fog just kept rolling in but that didn't diminish the beauty of this place. Trust me, take a half an hour and do this. You will not be disappointed.\nShow less"], ["Reviewed July 20, 2016", 5.0, "One of nature's most beautiful spots", "If you are visiting California's central coast or traveling on Highway One, a visit to Julia Pfeiffer Burns State Park is an absolute must. It is home to one of the most popular stops in Big Sur, McWay Falls. It is truly spectacular to behold.\n\nJulia Pfeiffer Burns State Park has a day use fee of $10. If you are from states where actual employees/rangers man stations to collect those fees, you should know you won't find that here. There is a little drop box where you fill out the information and seal your money in a small envelope. The line into the park can back up while motorists do just that. We parked our car and walked back to pay our usage fee. Don't think you can try to sneak in without paying. There are usually employees watching, just not in the ranger shack. Also, make sure you have exact change and a pen to use.\n\nThere is not a lot of parking inside Julia Pfeiffer Burns State Park. So it's a good idea to get there early if you hope to find a spot. The other option is to park outside the gates of the park and walk inside, which I saw a lot of people do.\n\nIf you are headed south on Highway One as you drive to this park, heads up it is very foggy during the popular summer months of June and July. Also, Highway One is a winding two land road with many difficult blind turns. My husband was driving and ended up getting motion sickness. It requires a lot of attention behind the wheel. Traffic moves very slowly at times.\n\nIn addition to the Falls, there are several hiking trails and you will see some beautiful Redwoods. You will not be disappointed if you visit this amazing spot.\nShow less"], ["Reviewed July 20, 2016", 4.0, "Great View of the Waterfall", "Not many beautiful beaches can boast there own waterfall but this one can. Park and walk under the freeway on the trail to view the beach and waterfall. Access to the beach is not really allowed so it is pristine and good for photos like the picture above.\nShow less"], ["Reviewed July 20, 2016", 5.0, "So beautiful!", "This is a must stop for your PCH road trip! Wish I had to further explore the state park, next time."], ["Reviewed July 16, 2016", 5.0, "Short walk to a beautiful falls", "Suggested by our server at dinner in Monterey, it was worth the drive here. Scenic coastal drive to the falls right outside the park. About 10-15 minute walk to see a waterfall coming out of the cliff side and a beautiful view at the walkway end.\nShow less"], ["Reviewed July 13, 2016", 5.0, "Tick this off your bucket list", "Suggesting this is a bucket list visit means it's a one off. If I lived in the U.S. I would see this over and over again. I was blown away with how truly spectacular this is. We've done some amazing drives in our time so far including the Great Ocean Road in Victoria Australia, the Route de Vin in France, the East Neuk coastal drive in Fyfe, Scotland (very close 2nd) to name a few but this tops them all. It's the vastness of the coastline, the shear effort required to build it in 1932, the engineering required to build the bridges, the whales sited off the coastline, the hairpin turns and of course those magnificent red woods. Big Sur is truly spectacular.\nShow less"], ["Reviewed July 12, 2016", 4.0, "The Majestic Redwoods", "For a foreigner like me it's astonishing to walk the trails in the park and constantly passing those giant redwoods. Many of them burnt at the bottom because of a wildfire some 20 or so years ago. Anybody could have persuaded me to believe that these - up to 2000 years old and 300 ft tall - trees have a conversation going on in the treetops about these tiny humans trekking around them down below. And besides that, there are stunning ocean views and a nice piece of workout following the Ewaldson Trail.\nIf you are in the Big Sur Area this is a must.\nShow less"], ["Reviewed July 12, 2016", 5.0, "3 nights in pfeiffer", "we stayed 3 nights in pfeiffer burns state park. The campground is well situated to explore the region. We loved Julia pfeiffer state park. Beautiful place with a pretty waterfall. Must do while nearby!"], ["Reviewed July 8, 2016", 5.0, "Breathtaking", "This is the a must see and it's such a short hike that even someone with a walker could make the trek - very slowly of course. I wanted to spend the entire afternoon here, but it was so crowded in August. I just opted for another breathtaking continuation of my journey down Hwy 1.\nShow less"], ["Reviewed July 7, 2016", 5.0, "Beautiful", "A must stop n see for sure if you're cursing down 1!! The trail is easy and absolutely beautiful!! They highly frown upon trying to make ur way down to the beach!! I advise not trying... unless you want your insurance company to have to pay for a pricy helicopter ride to the nearest hospital!! Not like we tried... but we have seen some less than smart people doing it!\nI\nShow less"], ["Reviewed July 7, 2016", 4.0, "Amazing!!", "Julia Pfeiffer Burns State Park is amazing! THe place is beautiful. The main attraction is McWay Falls. It is practically the postcard for Big Sur. Most people park along the PCH and just walk down to the trail without paying the state park entrance fee. We paid just in case there was anything else we wanted to see/do in the park. It's a $10 entrance fee per car. The only reason I gave this park a rating of 4, was b/c of a very rude park ranger at the gate. She was very rude and unhelpful. She spoke to me in a very condescending way. The scenery was enough to make up for her rudeness and then some! Everybody should see this at least once in their lifetime!\nShow less"], ["Reviewed July 6, 2016", 2.0, "Short paved walk to a view of a beach", "The view is pretty but there is no access to the beach below. This is a very brief stretch of the legs. Nothing more. Pretty but not more than a 10 minute stop"], ["Reviewed July 5, 2016", 4.0, "BEAUTIFUL!", "This park was absolutely beautiful. Lots to see, places to hike, got to see sea lions and seals! What more could you ask for!!"], ["Reviewed July 3, 2016", 5.0, "Edwoldsen Trail worth the climb", "The falls and the cove are obvious -- we've done that tour many times now and it is well worth it -- but this time we did the Edwoldsen trail up and around the loop past the stream and over bridges and through redwoods and above the treetops and through the oaks to the most magnificent sky high coastal views. It was magical. Bring water, apply sunscreen, wear the right shoes. It took us about 4.5 hrs with stops for photos.\nShow less"], ["Reviewed July 3, 2016", 5.0, "Best views and hikes", "We stayed here for the whole day taking in the views and hiking to to top of the hills. Parked on the side of the road and brought a picnic lunch."], ["Reviewed July 2, 2016", 5.0, "Breathtaking", "We stopped along our route and were not disappointed. The scenery is breathtaking and the small hike off the highway was perfect- stop here, you won't regret it!"], ["Reviewed July 2, 2016", 4.0, "Pretty...", "The falls were lovely. We waited for a spot to park in the park area. The hike to the falls was short and easy. The cliff we were on had signs that it was dangerous and unstable which made me nervous with kids (ages 12 and 8). It was okay though. Worth the stop.\nShow less"], ["Reviewed June 30, 2016", 4.0, "Be sure to read the historical information there", "The historical information provided adds even more magic to this already pristine piece of California coastline. The reason behind the park name. All the majestic trees and views are jaw dropping. And reading the information you can almost picture what it must have been like to live in the house that was once there. There are still remants of buildings in the area. Definitely a must see.\nShow less"], ["Reviewed June 29, 2016", 4.0, "Mcway Waterfall", "Easy trail to see the waterfall, very nice! There were also other trails that feared off. We explored just a little, they led us to the creek that feeds the waterfall. Definitely worth the stop!"], ["Reviewed June 28, 2016", 5.0, "Short and romantic walk at dusk", "This hike is less than a mile round trip but it's worth it. Do it just before dusk when there are no crowds and the light is glistening through the trees above the valley. Walk to the rocky cove and then back through the tunnel for fabulous views of the ragged Big Sur coastline. It's a good walk to do with someone special.\nShow less"], ["Reviewed June 28, 2016", 5.0, "Majestic", "This place doesn't even seem real. Imagine a beautiful forest with ancient trees and babbling creek. For me, I would have been happy just see that. Now, imagine that creek flowing into a waterfall that dumps into the emerald Pacific! If you are in the area (or somewhat close) and don't go and see this, YOU ARE MISSING OUT!!!\n\nShow less"], ["Reviewed June 28, 2016", 5.0, "a classic photo at big sur", "This is one of the most famous pictures of the big sur! It is a private beach, and we cant have acess to it... but the view is beautiful! You can either park the car at the park, or in the highway..."], ["Reviewed June 27, 2016", 4.0, "Beautiful scenery, lots of tourist", "This is basically a very easy walk around the cliffs were you get an amazing view of the ocean and the waterfall. It is however, very busy with people coming and going so we didn't stay too long. It's worth seeing but wish we could get to the beach level which you cannot.\n\nWe went to Pffeifer Big Sur earlier and paid for parking there. The same parking pass is good for parking if they have spots inside. Street parking is adequate too since there were a bunch of stairs that would lead you towards the path to the cliff view walk.\nShow less"], ["Reviewed June 26, 2016", 5.0, "Edwoldsen Trail & Loop delights", "We hiked the Edwoldsen trail and loop and loved it. The canyon views are beautiful and the open beauty of the ocean vistas are incredible. The trail to the loop is just over a mile with a set of switch backs and passing through groves of old growth redwoods. It took us approximately 40 minutes hiking to the start of the loop as we took in the beauty and shot photographs. We opted for the right turn at the start of the approximate two mile loop and passed through beautiful canyons and redwoods before breaking out into views of the ocean and canyons before the turn off to the Vista trail to the top. You realize the incredible beauty of Big Sur on this 4.5 mile hike. We ate lunch at the top of the vista with views up and down the pacific coastline. We spent some time at the top just taking it all in. The second half of the loop to the return of the trail back to the parking lot is filled with canyon views, ocean views and redwood groves.\n\nThere is approximately 1,600 feet of vertical for this hike, however it is very doable in good walking shoes. Footing is not an issue however you would want to keep small children close as there are some sections with very steep drop-offs by the side of the trail. We saw a 3 or 4 groups of parents with children under 10 enjoying themselves.\n\nWe parked on Hwy 1 as the parking was full with more than 90% of the visitors doing the waterfall hike. We only occasionally saw other hikers on the Edwoldsen trail, so you do get to enjoy the serenity of the beauty it affords. We took plenty of photos, relaxed and ate lunch at the vista view and it took a total of 3 hours and 45 minutes.\nShow less"], ["Reviewed June 24, 2016", 5.0, "Amazing waterfall and ocean views", "We mainly went to view the waterfall that runs right onto the beach. It was an easy 5 minute walk from the parking lot, to view this amazing waterfall that runs right into aqua blue seawater. If you keep going past the waterfall viewing area it takes you to the foundation of what was once a private residence where you can now sit on what was the house's back veranda for panoramic views of the Pacific Ocean.\nShow less"], ["Reviewed June 24, 2016", 5.0, "Beautiful", "You must stop to view this waterfall and beautiful view on a very short walk. There are few more good hikes at same stop. If you have time, do them."], ["Reviewed June 21, 2016", 4.0, "Make time to stop and explore", "As you enjoy the beautiful drive along the Pacific Coast Highway, be sure to allow time to stop here and even walk a trail or two. You can see from the highway the amazing waterfall flowing to the beach, but explore the park, too. There are artifacts from when an early 20th Century resident built a water-powered generator. TIP: Save and display on your windshield the receipt you get from the first state park you visit. It's good for admission at other state parks along the drive for 24 hours.\nShow less"], ["Reviewed June 19, 2016", 5.0, "Iconic waterfall - Great break from curvey Hwy 1", "Perfect break from the curvey Hwy 1. Often very crowded - parking lot iwill be full and you will need to park along highway. Make sure to park completely off the road (not sticking over the white line) because the ticket often. Easy 10 minute walk to the overlook.\nShow less"], ["Reviewed June 18, 2016", 1.0, "NO BEACH TO GO TO!!!", "After reading the reviews, and looking for a beach to go to, I went here. Sure, you can see a beach, but it is NOT accessible. thanks a lot"], ["Reviewed June 16, 2016", 5.0, "love this park", "i really like this park easy to access and good views u can see the Mcway falls and also there is a historic tunnel i ve seen some couples come and take their wedding picture here as well."], ["Reviewed June 15, 2016", 5.0, "Great Location for Pictures!", "I was in a Photographic Workshop that was based at Big Sur Lodge a couple weeks ago, offered by Sante Fe Workshops, and Eddie Soloway. It was a Great Workshop, and we did go to the Pfeiffer Park area. This Julia Pfeiffer Burns State Park was not included in that initial day, however, I did go to it on the Sunday early afternoon after our workshop was over. This is an incredible picture of the location! Well worth the trip!\nShow less"], ["Reviewed June 15, 2016", 5.0, "Visit Both Sides of this Wonderful Park!", "You absolutely must see the waterfall and the coastline, but don't skip the trail along the creek on the other side of Hwy 1. Walk beneath those wonderful huge redwood trees and enjoy the sunlight filtered through the treetops. Take the longer trail of the ridge (Eswolden) or stay in the canyon; both are superb. Take the short trail down to the building that houses the Pelton Wheel and learn a snippet of history. Go to youtube and listen to Johnny Rivers' great song \"Going Back To Big Sur.\" If the parking lot is full, park on the side of Hwy 1 where the shoulder is wide, and avoid paying the fee.\nShow less"], ["Reviewed June 13, 2016", 5.0, "Must visit!", "My boyfriend and I took a drive up the PCH1 on the 14th anniversary of our meeting and spent some time here mid day. Park is right off the the freeway. Staff was friendly, park was very clean. Paved parking lot on creekside leads to path along creek. A short walk through the tunnel and you will be speechless on what is at the other end of it. Amazing memory made. One of the best days we've shared together in the 14 years knowing each other. Go!\nShow less"], ["Reviewed June 12, 2016", 5.0, "Worth the Drive and Walk", "We drove the spectacular coast highway from Carmel to the state park, about 37 miles of breathtaking curving roadway along the mountains at the ocean, to go see the McKey waterfall trail. As spectacular as the rest of the scenery was on the highway, it still does not prepare you for the site at the end of short, easy trail from the parking area. (The parking lot was full, but you can wait at the gate for a few minutes and a space will open up, as many visitors spend less than 30 minutes in the park).The trail passes under the highway and travels up the south side of small, rocky sided cove, out towards the sea, from there you can look back and see the McKey waterfall pouring onto a small beach, and then into the ocean. The colors are incredible. We were lucky to visit on a sunny day and the water in the cove was an a teal green, cobalt blue combination that was unforgettable. But we took pictures anyway. This was definitely worth the drive. As a bonus, you get to drive over and see the famous Bixby Bridge\nShow less"], ["Reviewed June 12, 2016", 5.0, "Beautiful waterfall", "A great place to stop and view the waterfall that pours onto the beach. Nothing to do there except take pictures after a short hike."], ["Reviewed June 10, 2016", 5.0, "Don't miss this spot!", "I am a native Californian and I have never seen this beautiful spot. Outrageous. Very easy hike. But they did not allow dogs on the trail. But very nice people such a beautiful portion of the coastline."], ["Reviewed June 9, 2016", 5.0, "Simply AMAZING!", "As we saw this on the Net so we decided to give it a try and we were really amazed with this beauty!\n\nIn all, if you are in the area, I'm strongly recommended that you spare a day or two to go along the State Route 1 to check all the beauty of that place! You won't regret it!\nShow less"], ["Reviewed June 8, 2016", 5.0, "Uniquely Beautiful", "You may need a car with high clearance to cross the creek in rainy season to get to the beach, but it's worth the effort. The waves crashing through windows carved from rock, and washing over purple-sand beaches, are a special sight along a gorgeous stretch of US coast.\nShow less"], ["Reviewed June 7, 2016", 5.0, "McWay Falls are a MUST to see....", "These falls are easy to \"hike\" to and view. The color of the water is unbelievable. they are a must to see!! very interesting history!"], ["Reviewed June 6, 2016", 5.0, "MOST BEAUTIFUL SPOT on California coast!", "I know that Point Lobos is pretty amazing, with hiking trails that show off the gamut of variations of California coastline. But where else can one find a single spot that has all of these together...in a single spot.\n\nThe spot where Helen Hooper Brown's home once stood has it all. No photo or written description will ever do it justice. YOU SIMPLY MUST GO!\nShow less"], ["Reviewed June 6, 2016", 5.0, "Amazing views, must see!", "This is a beautiful stop along Highway 1. We parked along the highway outside the park entrance and saved on the $10 parking fee. There is a short, easy path heading to McWay Falls. The falls were gorgeous but very crowded. We also hiked Ewoldsen trail which is a 5 mile loop full of redwoods, oak trees, and ocean overlooks. You definitely work up a sweat because there are some steep areas so make sure to bring water with you. I highly recommend this park!\nShow less"], ["Reviewed June 6, 2016", 5.0, "great hiks", "This park only really offered two trails, one was really short like 10 minutes to a water fall, the other was a couple hours and a lot of uphill but gorgeous."], ["Reviewed June 5, 2016", 5.0, "Awesome, must see stop along Highway 1", "This is a great State park. A very short walk takes you from the parking lot west to the overlook for McWay falls. THis waterfall is gorgeous as it flows into the little bay full of aqua coloered water. This is maybe the most popular spot on Highway 1 so it does get crowded during heavy use periods (like Memorial day weekend when we were there). Heading east from the parking lot is aloso great. THere is an easy trial up to a nice waterfall and I highly recommend continuing along the Ewoldsen trail where you get to see a lot more of the small stream, big redwood trees, Oak trees, and overlooks of the ocean. THere are some steep areas of the trail and a walking stick might help. Bring plenty of water as you will work up a sweat. Also be on the lookout for ticks. They are around. Wearing light colored clothing helps to see them better but do a thorough check when you get back to the car. Worth that little inconvenience however. We got there early, like 7:30 AM early and were able to get a spot in the parking lot. Not too much after that the lot was full and they only let a car in if another car leaves. There is parking along highway 1 but be careful if you do that.\nShow less"], ["Reviewed June 4, 2016", 5.0, "Very beautiful, very crowded", "This spot is really beautiful. Worth your time and trouble to get there. There is not enough parking space, even in the low season, so expect some trouble when finding a place. But don't let that keep you away from this fantastic place. It's a little piece of heaven on earth.\nShow less"], ["Reviewed June 3, 2016", 5.0, "Views Over the beach and falls", "Very nice short stop alongside the coastal highway. The only part that needs to be improved is the parking facilities. On a busy day there is hardly any palce to park. Other than that, this is absolutely fantastic, easy to reach, nice to watch and very relaxing.\nShow less"], ["Reviewed June 1, 2016", 4.0, "A must see if you're in the area", "We came here just to see Mcway Falls, so we didn't have time to explore the park. There is a tunnel that connects the park to McWay Falls trail. Even on an overcast day, it was still a beautiful site. I would recommend anyone to come and see. It was an easy walk that anyone can do.\nShow less"], ["Reviewed May 29, 2016", 5.0, "Must visit park in big sur.", "Nice trails. Well maintained. Trails right by the rugged ocean coast. Plenty of scenic spots. The only downside is the parking during peak days"], ["Reviewed May 29, 2016", 5.0, "To view McWay Falls", "Either pay to park safely across the street or park for free along the roadway. Extremely short walk to view McWay Falls. This is a must see driving the PCH. No beach access."]]}}