{"Knott's Berry Farm": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Knott's Berry Farm", "url": "/Attraction_Review-g32122-d104416-Reviews-Knott_s_Berry_Farm-Buena_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/23/75/b0/la-ruota-per-i-piccoli.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "3758"}, "address": {"@type": "PostalAddress", "streetAddress": "8039 Beach Blvd", "addressLocality": "Buena Park", "addressRegion": "California", "postalCode": "90620-3225", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Great affordable park", "My 11 year old and my 6 year old loved the place. We came on s weekday and lines were short so we could cover most if the park in one day. Lots of cool rides, ranging from those for little ones at the Snoopy Town to scary roller coaster rides. Some rides, like the bumper cars, are too old and need a facelift. But most were very nice. Staff was mostly friendly.\nShow less"], ["Reviewed 4 days ago", 5.0, "Great Amusement Park", "I hadn't been to Knotts Berry Farm in years, but we decided to go right before Christmas. It wasn't super crowded, but the lines for some of the roller coasters did move slow. We bought the Fast Lane pass, which was a little pricey, but totally worth the money. The rides were fun & they are in the process of building a new roller coaster. The park is smaller than some of the others in the area, but still had plenty to do to occupy a full day there.\nShow less"], ["Reviewed 5 days ago", 5.0, "Great family place for all ages", "We live 5 hours away, but we love coming here with our family. The park is great for all ages. There are plenty of rides and attractions that satisfy any age. We have children ranging from 22 years old to 5 years old. Everyone is happy when we go to Knotts.\nShow less"], ["Reviewed 5 days ago", 4.0, "A place for kids to let loose.", "Get your walking shoes on and get ready for some adventure. While it isn't as big a Disneyland, it is priced better and tends to have less of a crowd (shorter lines). If you go during the summer season, they have a water park across the street you can cool of at. Like most parks, things change a little at night so be sure to stay for the evening activities.\nShow less"], ["Reviewed 6 days ago", 5.0, "Awesome", "We’d been to Disneyland and Disney California Park the day before which was good but very busy and took ages to get on rides even with a fast pass. Not so at Knott’s Berry. Admittedly it is winter but the wait times were usually no more than 15mins maybe 20mins at a stretch even for the popular rides. And what awesome rides. The Silver Bullet is fast and twists and turns all over the place, there were a number of smaller roller coasters that at first looked a bit lame but were actually great like the spinning tea cups. Log ride was great and the fear fall (not sure what it was called but you get dropped from a great height) was positively a rush. But the real gem was the ghost rider a wooden roller coaster that just kept on going on forever and it is really fast.\nGreat day and would highly recommend if you like lots of adrenaline rush type rides.\nShow less"], ["Reviewed 1 week ago", 4.0, "Season pass! Convenient, nice day out, roosters in the parking lot", "The season pass is so affordable! We usually walk the park and just hang out for a while. Neither of us (hubby or I) are much interested in the big rides, but we have a good time walking around. What's unique is that Knott's still has \"craftspersons\" who show their craft--glass blowing, sketching, sewing, etc. I like Knott's because I don't get the big-park merchandising push that I feel with other local LARGE theme parks. Huge? no. Positioned to sell merchandise? no. It's more of a local So Cal thing I guess. There are even roosters in the parking lot (no lie)!! And a saloon where you can buy a beer (I'm sure overpriced). On the outside of the park, there's a bar if that's what you're looking for.\n\nBerries are the big deal here. Personally, I LOVE boysenberries, and you can find boysenberry Icees, boysenberry candy, etc. They are famous for their fried chicken, but I haven't had that in years.\nShow less"], ["Reviewed 1 week ago", 1.0, "The worst theme park ever", "I have visited theme parks all over the world and Knott’s Berry Farm CA is without a doubt the most pathetic one of all time... And the Mexican food there I wouldn’t have even given it to my dog... Although the stuff that was put on my plate did resemble dog food.\nShow less"], ["Reviewed 1 week ago", 4.0, "When others are closed :-)", "We planned to go to the Six flags but it was closed so we went here and it was great :-) It is of course smaller but it gives you the thrills"], ["Reviewed 1 week ago", 5.0, "Fun during the off season", "We went in early February and save a little money. There were minimal guest so we were able to ride multiple rides without waiting in really long lines. Some rides were closed, but our four-year-old could not ride those rides anyway. Camp Snoopy was the perfect place for a family with a young child. He rode all of the rides in this area.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "AAA+ Fun for the family & terrific QPR!!!", "We debated on our only amusement park day in SCA to go here or Disneyland & we took the advice of a SCA family & went here. So Glad we did that!! There were NO lines for anything on a Thursday!! We got to ride what we wanted for as many times as we wanted (yes they said FEB is the slow time but never had that at Disney) my 17 yo was as happy as my 10 yr old which NEVER happens!!! The staff were all super friendly & could talk your ear off if you wanted.\n\nThe QPR aspect was outstanding:\n-$43 pp on line tickets (add to your Apple wallet & go right to the gate)\n-bring in water & snacks/lunch (save $100’s there)\n\nI felt like I could buy everyone a souvenir or let them do an extra or two & still came\nout way ahead than going somewhere else. Even going out to dinner after I figured was not only fine because I saved so much $ already but the food was way better than any Park cuisine.\n\nOverall this was an A++ stop & we'd do it again in a heartbeat.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Knott's Berry Farm 1980's,1990's.2000's", "The Boomerang was one of my all time favorites. When is Knott's Berry Farm bringing these rides to Florida?I recommended Suspended Looping Coaster,GhostRider,Silver Bullet,Xcelerator,Batman: The Ride,Timber Mountain Log Ride,Montezooma's Revenge,Superman the Ride,Le Vampire,Ednör – L'Attaque,and many more.I want to say what up to that Atheist white girl the god's love you.I've been to the first K-RAVE before Skrillex's was born.The Knott's scary farm has the Texas Chainsaw massacre,and all the horror movie actors.Did the FBI ever get that person that was hiding in the restaurant at K-RAVE?-Anthony\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Kids had a good time", "Knott’s Berry Farm is an amazing theme to have fun! Very scary rides that any thrill seeker would love!"], ["Reviewed 3 weeks ago", 5.0, "A BEST VALUE PICK: Knott's Berry Farm - HALLOWEEN FUN for13+ KNOTT's SCARY FARM", "This is an older amusement park that has been updating their rides and coasters over the years. The lines are usually much, much shorter than Disneyland, which is only 6 miles away. One can buy a season pass into this park for cheaper than one day in Disneyland, although TIP: heavier guests will find some rides not accommodating. Disneyland has more accomodations for heavy guests.\n\nTIP: Get season passes. Season passes can also give discounts\nTIP: Consider food passes/drink passes\nTIP: If you stay at the Knott's hotel, then parking is free.\n\nDISABILITY:\nThere are wheelchairs and electric mobility scooters for rent in the park. Disabled guests should go to guest services to get a blue card to allow for use of disabled entrances into the rides. This is not always a line cut. They will give you a time to come back on busy rides. The stagecoach ride is not ADA compliant (nor is it required to be as it is a historic ride) but doable if you can transfer, although you cannot ride on the outside unless you can handle climbing a bit.\n\nTIP: If you tell them that you have spinal issues, they will give you a red card and deny your ability to access most rides. So use your best judgement on your own capabilities and ride at your own risk.\n\nTIP: If you bring your own chair and it breaks (and mine did through no fault of the park), there is a medical durable equipment store nearby.\n\nKNOTT'S SCARY FARM (month of October): This requires separate admission even with a season pass. There are a number of haunted houses open within the park and scarers have been added to the log ride. The park is pumped with fog in areas and there are costumed monsters/zombies/psycho clowns etc throughout the park. It is aimed at 13 and older. Most of the rides are open. Camp Snoopy is closed but does have scarers there. There on monsters on stilts. Monsters with metal knee pads and and scraping of snow shovel style sounds. The monsters are somewhat themed too. The ghost town has cowboy ghosts. The Mexico area has some more that are like \"Day of the Dead\" style. The boardwalk has psycho clowns (so for those of you afraid of clowns you may want to stay away). Zombies are generally roaming. If you run, THEY WILL CHASE YOU. If you don't run, THEY MAY GET CLOSE BUT THEY WON'T TOUCH YOU. TIP: Some of the shows have adult humor. You can preview them on youtube.\n\nTIP: DON'T RUN. If you scare or startle easily, tell yourself not to run.\n\nOur son is 7. He can be a bit of a chicken. I was desperate to see Elvira Mistress of the Dark's last show at Knott's Scary Farm but were afraid to take our son through the park. (BTW, you can watch most of her appearances at Knott's on youtube). So, we decided to have him ride on my lap (I am in a wheelchair). We armed him with a Knott's pop cork gun. We did not take him into any of the haunted houses. However, we did do the log ride with scarers and did brave the park in general. HE HAD A BLAST! Literally... He sat on my lap and blasted monsters left and right with his cork gun. They all played along. He would shoot them and they would pretend to fall. He did this all over the park. It was like a shooting gallery. He fired and fired and even a couple of them did manage to sneak up on us (yes, i was helping him call targets). However by the time someone actually got close enough to scare him, he already felt empowered enough to merely turn and shoot them. The only problem came was that we stopped to eat on the boardwalk. The psycho clowns thought my son was cute. He was not afraid of their bloody knives, axes, or anything. Then, he was flirting with a couple of the female psycho clowns. One was going to make him a balloon animal. I did not see that coming. My son has a balloon phobia. He freaked out and took off running. We had to catch him and bring him back. Axes, chainsaws, swords, zombies, ghouls, murderers... none scared him.... but a balloon animal sent him running in terror.. The gals felt bad because he is so little... He was fine again once the balloons were gone. BTW even on the log ride, he blasted all the monsters and werewolves. So my recommendation, KNOW YOUR CHILD... EMPOWER THEM... They may surprise you. I would also say that he felt safer on my lap over if we had just been initially walking. KEEP YOUR HAND ON YOUR CHILD... so if they do get scared, they don't bolt into the darkness/crowds... Review the show videos on youtube for sample content before you take your kids to \"The Hanging.\" The most scary and violent content can be avoided by staying out of the haunted houses so switch off parents if you think your kids cannot handle the haunted houses. It also helps to know if your child knows the difference between fantasy and reality. Ours does and ultimately knew the roaming monsters were just people having fun in costumes. IT IS RECOMMENDED FOR 13+... It is not worth traumatizing your child. So, have a back up plan. We had noise cancelling headphones and a blanket for him to hide under if we found that he could not handle the roamers. We ended up not needing them (as I said, I was desperate to see Elvira, as was my husband). Otherwise, I would not have exposed my son at all. However now that we have gone, I know that, outside of balloons, he would be okay.\n\nTIP: ONLY PARK EMPLOYEES MAY WEAR COSTUMES.. my son did have a transformer jacket on though (not really a costume).\nShow less"], ["Reviewed 3 weeks ago", 5.0, "This is the place to go in SoCal", "If you have kids young or old this is the place to go. Now I know many like Disneyland but honestly they are overpriced and don't control crowd limits it seems. Knott's has something for all. To their old ghost town area , camp snoopy and some good thrill rides. Now if you are just looking for the meanest and bad rides this might disappoint. But the cost is reasonable. Parking is easy , but like SoCal not free like everything and the staff are very friendly. Enjoy\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Always fun, empty during winter weekdays", "Came here on a Wednesday. The place was empty. We did not wait more than 10 min. for any ride and most rides we walked right on. There were 3 out of service rides and those were some of the best ones they have which is a bummer. There is a variety of small kids to adult attractions. Good shopping and food at the park also. It's much cheaper then other parks like it in the area and the annual pass is well worth it. I suggest weekdays and miss the crowds. We had a great time once again and had rode every ride by 1 pm.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "A Way Less Crowded Park...But Way Less Entertainment Too", "When we went here for one day of our vacation we found the place practically empty. The crowds are apparently much more sparse during the week (which is when we went) and more full on weekends. We had very little wait in most lines throughout the day, however, I felt there really weren't many rides here to enjoy for the price paid. I have been to Disneyland, Disneyworld, Cedar Point, and Magic Mountain and I would say all of them have way more to see, do, and ride than Knott's does. I was really disappointed with the lack of entertainment options while there.\n\nOn to the positives, if you want to get a good bite to eat and get some great fudge and sweet treats this is a great place for that! On the way into the park we stopped at a few of the shops and got some treats (honestly, we got some treats afterword too) and the salt water taffy I got was the best I've ever had! The food inside the park is pretty good as well-and a good bargain too if you get the All Day Dining Pass for $31.99 (we split the meals between 2 of us, so each to got many small meals all day long) since you can get a meal every 90 minutes. To compare, if you were to buy 2 meals in the park it would cost you about the same price as the All Day Dining Pass-so as long as you eat at least 3 meals with your pass while there you will have saved yourself some real money. And since the food was the best aspect of the park to me, this is the best way to enjoy the park at a bit of a discount.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Excellent Service", "This is a strange review, because my wife and I had planned to go to Knott's Berry Farm to have fun on the day before taking a cruise out of Long Beach, and we purchased tickets, parking pass, meal plans and a photo package, but due to a delayed flight, we couldn't make it to the park that day in time to enjoy it. The point of the review is to say that when I called to see about having our expenses refunded due to our inability to attend as planned, the customer service person with whom we spoke was amazing. Knott's made a full refund to us, with no hassle or penalty at all. Nowadays, sadly, it is rare to have such accommodating service. It was so refreshing to have such service, that I felt it was important to make it known on Tripadvisor. We look forward to having the chance to have another visit as soon as possible. I haven't been there for many years, but every time I have been at Knott's Berry Farm, I've had a great experience. It's always fun, and not nearly as crowded as other parks in the area.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Average for adults - maybe better for kids", "Plenty of rides and the lines were not bad. But not much atmosphere. E joyed the saloon show and a beer but I would not consider going back."], ["Reviewed 4 weeks ago", 4.0, "Knott’s Berry Farm is a great value!", "I love everything about Knott’s Berry Farm when it comes to traveling with kids… My grandchildren love this place! There is something for everybody… When you go to Snoopy-town the rides are at the level of small kids… Which my grandchildren are! Everything is safe, clean, insecure. They did a good job at running us through the lines as well… I thought that the wait between lines would take a little longer but it really moved along. The annual pass has turned out to be a great deal for us and our family… We make it a few times each year on the birthdays of the kids… It’s great!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A good park without the queues!", "My son is a bit of a roller coaster junkie and is always looking for something new to try. My wife and I on the other hand, are not. But then it's only fair we visit a theme park after we make him do all the stuff we enjoy.\n\nWe caught an Uber from Santa Monica to Knott's Berry which was $42. When we arrived I was almost convinced the place was closed. I was expecting a Disney style mass of people. Nope, straight through the security gate, flash the phone as we'd pre-bought tickets and we were in.\n\nThe park itself is nothing like the size of Disney but it's well laid out and focusses on rides. When lining up you never waited more than one ride before you were on. It was quite amazing and such a relief from the sometimes hour long queues at Disney.\n\nThe rides have a rating of 1 to 5, 5 being the most extreme. I'm not as big fan of coasters and will never hop on one that goes backwards but my son managed to convince me to hit up a few level 4 coasters, all forward facing! Some were a little more daunting than others but to him they were all pretty passive. For me I cursed him aloud and disinherited him several times.\n\nFor kids and teens I reckon this is a great park to kill a few hours and it's relatively inexpensive. Little to no lining up for rides, plenty of food options and by the looks of the construction more coasters to come. Worth a visit if like us you'd never been.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Our favorite amusement park to visit with best priced", "We always come here in January where you can just ride and ride without lines. What can you say about a place where you can get a family of 3 and parking for the same price as one Disney ticket. Also the merchandise is reasonably priced. Sweatshirts are like 24 bucks instead of the typical 60+ you see in other places. Enough rides for those who like coasters and those don’t. The only problem is finding good food. This time we eat at the Ghost Town Grill. It was terrible. I ordered the chicken souvlaki was just terrible. The hot turkey sandwich was ok.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "This park is great for a day with teenagers!", "This park wasn't on our original plan but he had an extra day and I am so glad we choose to go here. My 13 year old son LOVED it! The old roller coaster is a classic and still as fun as ever. They have added a few newer \"thrill\" rides which were excellent. We bought the fast pass options and it was completely worth it since we only had one day to spend in the park. My only suggestion would be food options. Limited restaurants were open so they were very crowded.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Lots of great rides, none of the lines of Disney!", "We came here on our vacation after spending two days at Disneyland. It was so nice to be at a theme park that wasn't stuffed so full of people. Most of the rides we were able to walk on, or we would wait for maybe 5-10 minutes. This was awesome for us after all of the lines at Disneyland!\n\nThe price of admission was great! We bought online and saved a bunch of money. It was disappointing how many rides were closed for maintenance/refurbishment. Two of the rides that we really wanted to ride were closed. One of the downfalls of a vacation in January I guess.\n\nI loved seeing all of the historical areas. it was fun to watch the blacksmith work. My husband and I had intending on purchasing one of the personalized horseshoes, but the blacksmith would not talk to us and kept walking away to talk to another employee so we chose not to purchase anything. Also, the sizes of shirts that were available for purchase were not the greatest options. A lot of super small sizes and a lot of super big sizes, but not a whole lot in between. I would have liked to have seen better stock.\n\nI will say that the signage at Knotts is not the greatest. My friend and I were constantly wandering around trying to figure out where a bathroom was. We took the long way a bunch of times because things were not clearly marked.\n\nEnjoy all of the boysenberry treats! We tried the salt water taffy and it was amazing! We also got the Knott's berry punch and had it mixed with lemonade and then later with Sprite. Both combinations are great and we highly recommend them!\nShow less"], ["Reviewed January 23, 2018", 5.0, "great", "very very entertaining , the Knot scary farm attractions were also better than universal studios attractions during Halloween"], ["Reviewed January 22, 2018", 4.0, "The Old West with Maybe Too Much Forward-Thinking", "I lived blocks from Knott's Berry Farm growing up. It was the local hot spot for teens. It was where I had my first date and where I met my wife on a blind date in 1997. I've had the pleasure of watching Knott's change over the years, I'll explain more below. At a fraction of the cost to visit local rival Disneyland, Knott's still offers a more-affordable entertainment option than Disney with enough rides, shows, and attractions to fill an entire day.\n\nIf you've been to Knott's before 2009 but not after the Cedar Fair purchase, he's what you'll miss: Berry Tails are completely gone. They had moved them from the Kingdom of the Dinosaurs attraction to a fun house in Camp Snoopy, but now the cute critters we knew and loved have been sold in auction. Dolphin water shows have been gone for years, and the overall makeup of what gave the park personality have been replaced with thrill rides, such as extreme roller coasters and spinning carnival rides.\n\nFortunately, Ghost Town has not changed much. Even as recently as 2016, Knott's has introduced an annual Ghost Town event that brings in crowds who want to see cowboys and robberies and the Old West at it's finest.\n\nCamp Snoopy has also been updated with new kids rides, most of which you'll find at your local carnival or festival, but fun nonetheless. The charm of Camp Snoopy left with the closure of the famous fun house, skywalk and bounce house. However, the show has not been removed and does actually get better each year.\n\nFiesta Village hasn't changed much, despite the attempts to bring in new innovative rides that failed. I do miss having a Corona at the restaurant by the lake. That's gone and with it a favorite occasional pastime.\n\nI also miss the Haunted Shack, fortunately the original is still around up-state, as is a small version of it in Calico, CA. In it's place, a stage and occasional shows (mostly during summer and Halloween Haunt).\n\nHalloween Haunt is always a sellout, it's been said that Haunt pays for the park to stay open the rest of the year, yah, it's that big of a deal. You need to buy tickets early and now that they offer season passes for Haunt, the crowds are worse than ever. Be prepared for 1-2 hour waits on mazes, and since they only have a certain number of mazes, better plan for 3 nights at the park if you want to see them all.\n\nPrices are outrageous, but hey it's a theme park, it's what you expect. Pack a lunch or eat at one of the lower-cost restaurants in the back of the park. Bring plenty of water.\n\nDon't miss the Stagecoach ride or the show at the entrance to the park. Check the show schedule for special events happening at the Charles M. Schulz Theatre, such as Snoopy on Ice during the holidays and Elvira during Haunt (though I heard 2017 might have been her last year).\n\nYou'll have fun no matter what. If it were me, I'd visit off-season in late January through May during a weekday. You'll get on all the rides without the long wait times.\nShow less"], ["Reviewed January 22, 2018", 5.0, "SO MUCH FUN....", "BE here several times throughout my lifetime, always a fun place and lots of memories in one of the best parks in the USA ....again it can be hectic and busy, especially weekends any month......Normally Mondays and Tuesdays are best least crowded throughout the year....Its a new twist for an amusement park!\nShow less"], ["Reviewed January 21, 2018", 5.0, "great fam adventure", "The combo passes Knotts, Soak City including parking is very affordable in comparison to other local amusement parks."], ["Reviewed January 21, 2018", 1.0, "If you love standing in line: go here.", "We have been going to Disney for years and thought we should try something new. When entering, we got our pass, but then had to wait for almost an hour to get our fast pass bracelet. There were two people working and the line was out the door. We rode a few rides and the \"fast pass\" was WAY faster than Disney. In fact you just go to the head of the line. Don't go to Knott's Berry if you aren't willing to buy the pass. We watched people stuck in line for A LONG time because the \"fast pass\" people just constantly move to the head of the line.\nThe food pass was truly terrible and actually ruined our day. Don't buy it. We waited in line for ONE HOUR AND TWNETY minutes for terrible burgers and tacos. It was the worst customer service I have ever seen.\nI did go to customer service and they did refund my money, but we regretted that we wasted so much time here. We spent more time in lines for things that should have been simple than on rides. Spend your money at Disney.\nShow less"], ["Reviewed January 21, 2018", 2.0, "Don't waste your time and money here.", "What a bummer. We visited on a Sunday, knowing it would perhaps be busier than a weekday... but for January it was shockingly crowded. This was our first and last trip to Knotts. It took us 4 hours to ride 3 rides, and our day didn't get any better. We averaged 1 ride per 1 1/2 - 2 hr waits. This was mostly the family rides, not the thrills. It was an over 80 degree day, and there's no cooling systems inside the waiting area for attractions. The park was disgustingly filthy. Some TMI for you, is expect the menstruation disposal cans inside your bathroom stalls, to have overflow! Really, really disgusting. TP all over the bathroom floors is bad enough. Garbage all over the grounds. We bought all day refillable drink bottles, and the refill stations closed 2 hours before park closing. Although you pay less for entry as opposed to Disneyland... just remember half the price and definitely half the fun. Employees don't have the etiquette nor training they should. There was little instruction and they were in no rush to keep the lines moving. Once you've experienced all that comes with Disney, you'll see unfortunately Knotts flat out stinks. Literally. We've renamed it Knotts \"Butt\" Farm... as that was the smell around every corner. No wonder Disney keeps air fresheners blowing through the crowds! Trust me. It helps!\nShow less"], ["Reviewed January 19, 2018", 5.0, "Best Bang for your Buck", "This place was great! This is what a theme park should be, enjoyable. The lines were doable. The parking wasn't in the next town over, and the expensive food was actually quality food."], ["Reviewed January 19, 2018", 5.0, "Knott's Scary Farm for Halloween", "In October each year, Knott's opens for Scary Farm in the evenings, until the wee hours of the morning.\n\nMy friend and I did not have time in our travels to go to the Park during the day, but we attended Scary Farm. It did NOT disappoint!!!\n\nActors in make up wander around the Park, making scary faces and jumping in front of you. There are mazes galore to wander through (and they are seriously scary!!), as well as Zombie laser tag.\n\nScary Farm was a seriously awesome find! I would definitely recommend for anyone travelling to LA around October, but it is not for little kids. I think there might be a formal age cut off, but it would definitely be too scary for little children.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Great park for a great price", "We have been coming to Knott’s over Disneyland since our kiddo was 4 years old. We love to come in the off season and not wait in line ever. My kiddo is able to stay on the rides because there is no wait. The park has a great mix of rides for every dare level of rider. Snoopy town has a ton of kid rides and there are roller coasters for the faint and brave at heart. One of my favorites is Pony Express. Not scary just fun. The merchandise is priced very reasonably unlike at other parks and the material is quality made. Snoopy theme is fun for all ages. Food is pricey in the park and honestly not very good. We’ve eaten at Mrs Knott’s, ghost town grill, Johnny Rockets, TGIFridays across from the park and multiple snack areas inside. Food is meh but the price to get in and the attractions make up for it. The hotel is older but is within walking distance which makes it nice if you need a break from the park.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Just for thrills", "Just simply awesome & enjoyed every ride & attraction at Knott's. The Silver Bullet is near on the best coaster I have been one & I look forward to a 3rd return visit to enjoy the new ride coming in the summer..."], ["Reviewed January 15, 2018", 5.0, "Childood memories", "On a business trip, I decided to go and be reminded of another era. I was impacted by the size of the park. It has changed so much. Of course people looked like they were enjoying themselves. I could see that some of the old shops and restaurants are still there, and of course some of the attractions. But now they have more roller coasters. I would go again to the park, I will not however go back to the restaurant so famous and a place that I have great memories from. The chicken is not the same, the flavor is not the same. But the boysenberry jam is the same and still for sale. That was good! Because I love that!\nShow less"], ["Reviewed January 15, 2018", 1.0, "2 rides in 2 hours, what a waste of time!", "After seeing all the positive reviews, I thought this place would be wonderful to hit some great rides with minimal waits. Boy were we wrong! We got there 45 min after opening, after spending 25 min circumventing the entire place to find a parking spot. We went on Silver Bullet after a 45 min wait, then the kids went on Montezuma after 30 min wait. Didn’t seem to bad....but then we could not find another ride that didn’t have at least a 2 hour wait. That’s insane. I’m not wasting 2 hours of my family’s day to go on one ride. And the cost of Fast Pass’s is more than we paid for admission. So it was a total bust, we left to enjoy the day doing something else. I would never recommend this place, especially with it’s long lines for nasty bathrooms. I’d avoid it unless you’re willing to buy Fast Lane passes!\nShow less"], ["Reviewed January 15, 2018", 4.0, "Great place for families and those who love roller coasters.", "We had a wonderful time 1/2/2018 with 6 teenage family members. The park was still decorated for the holidays. It was busy, but tolerable for a theme park. Park food... LOVE their hand-dipped caramel apples and Loca Papas Fritas garlic fries!! Thanks for the great time Knotts.\nShow less"], ["Reviewed January 11, 2018", 5.0, "a great attraction at a reasonable price", "Now days its a good thing when you can nave a quality experience for \"A reasonable price\", Knott's Berry Farm is just that place. My family and I have been going there for many years and have enjoyed every minute. Enjoyable entertainment and good food without breaking the bank for the whole family.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Lots of fun rides", "We enjoy this park quite a bit. Ghostrider is my daughter's favorite ride, followed closely by Pony Express and the log ride on a warm day. Ghostrider at night really feels like you're flying and you get tossed around quite a bit. We had a blast. She prefers to eat at Sutter's, but the pizza place my the Ghostrider exit is okay, but very pricey.\nOne thing that families should be aware of is that there are more smoking areas that we seem to encounter here, as opposed to the other amusement parks. We hate running into a cloud of cigarette smoke unsuspectingly, so now we've mapped our routes walking around the park to avoid those areas. We haven't experienced this issue at the other major parks in southern California.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Wonderful place to spend with the family.", "The rides are great the lines are reasonable. I went with a 9 and 11 year old and they were able to get on the \"big kids\" rides which was fun to watch. Ghost Rider was amazing. The downside is the price of the food. You can get your hand stamped and leave to eat across the street otherwise it is quite pricey to eat at the park.\nShow less"], ["Reviewed January 7, 2018", 5.0, "A place for all ages", "We were pleasantly surprised at how nice this place was. It had something for everyone. Kiddie rides to adult rides, entertainment shows and history. But food and drinks were very expensive. There's lots of shade on sunny days. We went after the holiday rush so it wasn't super crowded and the lines for the rides weren't too bad.\nShow less"], ["Reviewed January 7, 2018", 4.0, "lovely shops!", "Great place to go buy your last minute gifts. I found quite a few gems there. Prices are affordable."], ["Reviewed January 6, 2018", 5.0, "Fun Times", "Haven't been here for a long time, a lot has changed. I am happy that they are keeping the Ghost Town. There are a lot of new rides that brings more thrill. I would recommend buying tickets online as they are cheaper. If we lived locally it would be worth getting annual passes. It was not crowded on the day we went.\nShow less"], ["Reviewed January 5, 2018", 2.0, "Long, long waits", "Terribly disappointed with our first time visit. Being peak holiday time I was expecting it to be busy, but was not prepared for what we were to experience. 8 hours in the park and 3 rides is not good value for money. To top it off, when leaving we had to wait over an hour for the ART bus despite the driver on the incoming bus telling us that the buses would arrive every half-hour. Perhaps it is better value in the off season.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Great family vacation", "We loved everything about Knotts Berry Farm. It was perfect for all ages, not chaotic, and lots to do!"], ["Reviewed January 5, 2018", 5.0, "Holiday Tradition!", "December is obviously chilly and would never go on rides I'm going to get wet from water spraying. But it's unbelievable how they decorate the park for the holidays. Love the carolers which remind me of growing up in Colorado where people really did that!!!"], ["Reviewed January 5, 2018", 3.0, "Once great park, now overcrowded and missing heart", "My spouse and I had bot visited Knotts Berry Farm as kids and had fond memories. After Christmas we decided to visit again but found the old west spirit was mostly replaced with iron rollercoasters and tons of crowds. While the food was pretty much excellent (especially Mrs. Knotts Chicken Diner), and the ghost town area offered some interesting shops and theme areas - most of the park's theme clashed with itself. Random coasters, super hero merchandise and the odd old west curio are all slammed together - nothing really makes any sense theme wise.\n\nThe crowds were our biggest complaint. We actually stumbled across a long-time park employee/friend who told us many more families came here now because Disneyland is so expensive (which it is). Lines for most rides were hours long, and unlike Disneyland there is no signage telling you expected wait times, or even where the line for a specific attraction starts! In 8 hours we were only able to get on 3 rides. Trash was another issue, in many ride queues trash was overflowing from cans or just strewn about (Iron Reef was especially bad).\n\nWe also learned the new owners of Knotts Berry Farm, Cedar Fair, allocated (read stole) the Knotts employees' Christmas bonus this year (and seemingly in the past as well) to help pay for other parks they run across the country. Really lame.\n\nThe rides we did get on were fun (Ghostrider was especially thrilling) - though some new needed a little TLC (the log ride was great but its showing its age and it runs so fast through the dark areas you almost miss the interior scenes entirely).\n\nKnotts wants to be the Disney alternative, but it needs to step up its game - especially when it comes to theme/vision and service.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Excellent Alternative to Disney!", "We were pleasantly surprised by this theme park. We decided to go here because we had a lot of kids (7 in total) and didnt want to pay for a 3rd day at disney. The ticket price for Knotts is much cheaper through a sites online. They charge 30- 40 bucks more at the gate! I will say that this place has probably as many roller coasters ( big ones ) as the California adventure park ( maybe more). The lines are much faster than disneys as well.\n\nThe only thing I didn't really like was the food. I ordered loaded nachos and it was mostly chips, olives and shredded cheese. I also found a small piece of hair in my nachos, also the cleanliness of the kitchen areas looked really bad, almost unsanitary. I'm sure this is a little tough for places like this as they get overwhelmed with crowds of people so they may neglect cleaning up what people can see behind the counter.\n\nThis is a great value and a great time over all and you can get on many rides more than once as this park is no where near as crowded as disney parks. I would go back for the rides.\nShow less"], ["Reviewed January 3, 2018", 4.0, "A Better Option than Disneyland", "Knotts is more fun because the lines are less long and the people are quite friendly. Lots of history here. It was the first theme park in California and continues to have some of those iconic attractions like the Wild West Stunt show and the stagecoach rides. This is a fun family alternative to the madness (and not to mention exorbitant prices) of Disney. If you live in Southern California, you can buy an annual pass for the same price of a Disneyland ticket for just one day! The only caution I have for visitors is to avoid the regular food cooked by teens. Just find the Panda Express, the Johny Rockets or the nice sit down restaurant.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Knott's Berry Farm...still fun!", "First visit to Knott's Berry Farm in 12 years. Still the best \"western themed\" land around. Entertainment shows were great....especially \"Krazy Kirk and the Hillbillies\" in The Birdcage Theatre. Saw all three of their shows...each one a little different than the previous! Attractions and coasters are fun and their steam train, still a great site to see (and ride)! Only thing I've never really liked at Knott's is random vendors selling \"crafts\" and stuff. Takes away from the \"Theme Park\" experience. Took me half the day to find a Knott's Berry Farm souvenir hat that I liked!\nShow less"], ["Reviewed January 3, 2018", 4.0, ".....WOW.....Really Cool", "The history around this place is amazing, all that the Knott’s family did and the relics, excellent.\n\nThe rides are amazing, especially for a first timer like me. Silver Bullet and Super Scream towers were crazy.\n\nAlso of note is the variance in the types of rides, eg old western horse drawn carriages, real steam engine trains!!!\n\nThe place is very clean, crowds not withstanding.\n\nMinus\nThe basic commodities like soda or ice cream priced on the higher side.\nNot all rides were working.\n\nOverall experience? WOW.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Awesome Place", "We took our 10 year old to Walt Disney World last year, we went to Universal Orlando and also went to Magic Mountain and by far our son thought this was the best park. Just the right size park and we also spent extra for a Fast Lane pass which was the best thing EVER. Would go again.\nShow less"], ["Reviewed January 3, 2018", 4.0, "More fun than I expected!", "I haven’t been here for over 20 years mostly bc I live closer to six flags magic mountain and if I came this way, Disneyland is still my number 1 (sorry but it’s true). However in trying to make plans for a party of 8, and knowing that Disneyland will be MUCH more crowded and expensive , plus not having been here in decades, we decided to give it a try.\nI have to say despite the crowds it was a lot of fun. The attention to detail in the western town was great and there were quite a few good choices (not just nuggets and burgers).\nKids loved the rides and we plan to go back again. And their NYE was pretty cool - they provided hats and noisemakers and the fireworks show was pretty cool AND lasted over 12 minutes (I heard Vegas one was 8 minutes). All in all well worth it to revisit.\nShow less"], ["Reviewed January 3, 2018", 5.0, "yuman", "Great place to take family for the money. Something for all ages, great food and great shows. Will be back again."], ["Reviewed January 3, 2018", 5.0, "yearly trip for my family", "we go at least once per year to avoid the family and in law requirements of the holiday season... we take our kids at minimum for thanksgiving and we have an absolute blast! its so much more fun than the family drama you get and drunk unlce rick making a fool of himself... knotts serves our dinner, keeps us happy, entertains us, and then cleans up our mess after without arguing who will be handling the dishwasher afterwards! thank you!!!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Old time fun", "As someone who has been to Knott's many times I would recommend it. It is easy to get around, large choice of food and is less expensive that the other park next town over in Anaheim. I have not been in several years, had to put a date, but does not apply\nShow less"], ["Reviewed January 3, 2018", 3.0, "Good day out but best to visit off-season", "It’s a fun park to visit with some great rides but it gets super crowded. It’s best to visit off-season or go super early if you want to get on some rides as the wait can be up to a couple of hours for the more popular ones.\nAlso the lines for food move super slow and the food isn’t too great, so it’s best to eat at one of the eateries outside the park instead. Yes you can leave and re-enter the Park on the same day but make sure you get stamped\nShow less"], ["Reviewed December 31, 2017", 4.0, "Knotts Berry Farm, one of the last attractions in Buena Park!", "Well this is the first time I reviewed Knott's (even though I have been going here since I was a kid). Many years ago Buena Park had quite a few tourist attractions, such as the Japanese Gardens and Movieland Wax Museum, Knott's Berry Farm is one of the last standing, attributed by it's standing the test of time. I guess things change, when I was younger it was better. Now its not so good, but still worth the price of admission. Rides have changed and prices have definitely gone up. I still love Ghost town and the new roller coasters. camp snoopy is great for the kids. A must see when in Southern California!\nShow less"], ["Reviewed December 30, 2017", 3.0, "Great Ice Show, Average Amusement Park", "They have a nice kids section and some decent rides, but so do a lot of parks. The Ice Show was very professional and the best thing about the park. If you go - do not miss the show. I was very disappointed with the staff friendliness - especially those running the kids rides. A smile would have brightened the day. The staff were doing their job and nothing more.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Knott’s Berry Farm", "There is a lot of history at Knott’s Berry Farm! My husband and I found it very interesting! We had a great time and so did our teenager, who loves the roller coasters best!"], ["Reviewed December 23, 2017", 4.0, "Better rides than Disneyland", "After being a bit let down by the tiredness of Disneyland Anaheim (I think the California Adventureland section is supposed to be better), friends advised us to go to Knotts. It’s really charming and it has some seriously good thrill rides. My husband and I had a ball (and the lines were heaps shorter than Disneyland). Great day out!\nShow less"], ["Reviewed December 22, 2017", 5.0, "Lots of Fun for the Whole Family", "So much fun with all the holiday decorations, activities, and shows. Loved the fact that it was not too crowded before Christmas! Loved Snoopy on Ice, The Christmas Carol, and Krazy Kirk and the Hillbillies shows. And, of course, what would Knott’s be without their famous chicken dinner! Got ours at the chicken dinner take-out.\nShow less"], ["Reviewed December 22, 2017", 3.0, "\"Knott\" what it used to be", "Knott's is for the kids now. My husband and I spent the afternoon there last week. We found very little of the Knott's I grew up going too. Lunch prices were outrageous. We spent $35 total for 2 sourdough bowls and water. If we had added a soda, it would have been over $45! When we walked in to what had been Virgina's gift shop, we found none of the gifts and collectables it was known for. In fact, it looked half empty, just stocked mostly with expensive souvenirs. For the young people, there are lots of fast rides, with a dive coaster being built for next summer. For us older folks, even the Chicken Dinner restaurant is nearly unaffordable. No more early bird specials or senior discounts either.\nShow less"], ["Reviewed December 22, 2017", 4.0, "Birthday!!", "Went here last time but it was Knott’s Scary Farm. Enjoyed the rides - like the silverbullet - it was a bit sad that most of the rides that excites you the most were either under maintenance/non operable (probably because we went in during a week day) but still enjoyed & had fun with my fave persons here\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great for all ages", "Went to Knott's with my 3 grandsons ages 2, 6 & 7 along with my son and daughter in law. We had just as much fun on the rides as the kids. Their are rides for all ages, thrill seekers and not thrill seekers. Park is very clean. Well worth a visit.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Fun!!!", "We spent a day here with our 5-year old and had a great time! The shows were great and the rides were fun for her. The food was average theme park food. The lights at night were beautiful. Snoopy is the best!!!!!"], ["Reviewed December 20, 2017", 4.0, "Pricey but worth a visit overall", "Made a last minute decision to try the farm on a Sunday. We got the fast passes as we anticipated crowds. While they came in useful for level 5 rides like ghost rider, they couldn't be used for other fun rides like la revolution (something like that). This is an old fashioned western theme parks so do set your expectations accordingly and don't expect fancy stuff. Quite like the hill billy band too.\n\nSpecial thanks to Omar who is part of the cleaning staff. He came up to us and offered help with directions even though he didn't need to. Hope the park treasures such proactive staff.\nShow less"], ["Reviewed December 16, 2017", 1.0, "Insanely Crowded, App Not Working", "We came here on a November weekend, buzzing with anticipation about the great roller coasters that awaited us. After we parked and arrived at the entrance, we found a massive horde of similarly minded people. We chalked this up to poor design of the entrance and suspected a bottleneck effect at work, and decided to wait...for an hour among a sweating mass of humanity, not for an attraction, but to only get to the gate, where we were directed to another 10 minute line after being told their was a special gate for Los Angeles Go Card holders.\n\nAll this waiting was daunting, but we were encouraged by frequent checks of the park's mobile app, which listed short waits for most rides, so we decided to forge ahead into the park despite the crowds. However, the first and only ride of our visit, the Silver Bullet(which was admittedly very fun) took 45 minutes to get to, despite the app predicting a 5 minute delay. We continued to wander for a short time, our faith in the app eroded, hoping to stumble across a ride with a reasonable wait, but by this point, our ability to even move about freely was impacted, and we decided to cut our losses and leave the park.\n\nA symbol of our visit could be found in the bathrooms, which were disgusting, with ants crawling on the walls. When compared with another park we visited on our trip, Universal Studios Hollywood, which had futuristic, environmentally friendly flushless toilets, Knot's Berry Farm's bathrooms seemed pathetic, and similar inadequacy was seen in the park's low capacity for dealing with crowds and broken mobile app.\nShow less"], ["Reviewed December 15, 2017", 2.0, "Very disappointing", "Came here after spending 2 Days in Disneyland. Found the park to be nice although understaffed. Very few rides accessible to larger folks. Just about everything here is more expensive than Disneyland. Nicely themed “lands” but line we’re long. Also they charge $65 for their version of fast pass which would have been worth it if I were able to go on many of the rides.\n\nWhat I had hopped to be a great experience turned into a long walk around the park and just a few rides. Not worth the $300 I paid for us to come here.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Best rides ever", "I Love it I was going to Knott's Berry farm in 2011 I want my memories back so much for the update I love it so much"], ["Reviewed December 14, 2017", 4.0, "Great for little ones.", "Nothing fancy and definitely not Disney but we had a great time. Wait wasn’t ever long. It was reasonably priced. Parking easy. Food not over priced like most theme parks."], ["Reviewed December 13, 2017", 4.0, "A Charming, Affordable All-Ages Theme Park 5 Miles from Disneyland", "The legacy of Walter and Cordelia Knott is kept alive at this theme park they founded in 1940. Originally a successful berry farm, Walter and Cordelia pooled their talents together to create a family destination park in southern California that will keep all ages of the family entertained for a full day at a very reasonable price.\n\nThey have a large variety of attractions, including some excellent thrilling coasters, family attractions that all ages can enjoy together, a wonderfully large kids area (Camp Snoopy), and oddball rides that you won't necessarily see at other parks (such as the Calico Mine Ride built back in the 1960s and takes you on a \"mine cart ride\" through a working \"mine\" populated by animatronic miners inside a large, wonderful, man-made mountain. They give actual horse-drawn stagecoach rides, and you can go for a short ride on their full-size, narrow-gauge steam locomotive (complete with robbers who \"rob\" the train enroute). The park is populated with authentic craftsmen/women (such as blacksmiths, wood craftsmen, glass blowers, etc) who make genuine products that you can then purchase and take home after watching them make it in front of you.\n\nThe park is largely \"Wild West\" themed, and they play it to good effect. Cast members remain in character and have wonderful improvisational talents. If rides aren't your thing, they have a large variety of shows to watch during the day as well. If you're a Halloween fan, a visit during the Halloween season for \"Knott's Scary Farm\" is a must. It is a remarkable Halloween event filled with spooky shows, haunted houses, scare zones and rides in the dark. Knott's Merry Farm is their Christmas event, and the park is beautifully decorated to celebrate the Christmas holiday, along with a large variety of lights (they could definitely increase the amount of lights they string up during Merry Farm though).\n\nIt's not Disney. It's an absolutely WONDERFUL park, but its quality falls well short of what Disney offers. Know that and accept it when you enter the park and you will have a very enjoyable day. Visiting on a busy day with huge lines that you don't want to wait in? Buy a Fast Lane and skip the line all day long (something not even Disney offers)! They have a decent waterpark on property, called Knott's Soak City. Again, it's no Disney or Universal water park, but it's a fun day playing in the water to escape the summer heat.\n\nPrices are reasonable, compared to Disney or Universal. Shop online for the best deals...it's a much more affordable day compared to Disney and other parks. Highly recommended!\nShow less"], ["Reviewed December 9, 2017", 3.0, "Fun Trip with little one", "We came around 3:30 on a day the park closed at 6. The time was surprisingly quite sufficient with a 4 year old in tow. We enjoyed a Peanuts Xmas production and then went on the more kid friendly rides. We were lucky to go on a not too busy day so lines were short. We were able to get buy one get one tickets so it worked out to close to $40 each. Although it's a great park I wouldn't say it is worth $75 per person especially when going with little ones.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Go in knowing it's not Disneyland", "Knott's is a lot of fun, but you have to know you're not going to Disneyland. The rides are not as efficient and the workers are not nearly as nice. However they do provide some fun attractions. This is a one day park for sure. Make sure you get everything boysenberry while you're there. More fun for teenagers for sure!\nShow less"], ["Reviewed December 3, 2017", 5.0, "I love KBF", "It's great because it's not too extreme like MM, and it's not too expensive like DL. And I like the shows and characters that they offer."], ["Reviewed December 3, 2017", 5.0, "Fun day with Snoopy and friends!", "My family and I had a blast. Parking was close ($18) to park. Plenty to do for all ages. Kids really enjoyed Ghost town. Must be 48 inches for most rides. Try it out, it's fun!"], ["Reviewed December 2, 2017", 5.0, "Family Fun For... Everyone!", "Yikes! You've got to invest a full day, and go-at-your-own-pace-in-this-place! If you set out your 'must do' rides beforehand, everything and anything that you get after that is just a bonus. IF the line is a bit long, send the troops off for short-burst jaunts while hold the place down in the line...they'll love ya for it! they have a VIP pass, if you have special needs people, but Don't abuse this privilege...the 'Farm' is kind enough to extend a helping hand, BUT.... chat with them and, book in advance for special needs visits.\nShow less"], ["Reviewed December 1, 2017", 4.0, "Good Family Fun", "Knott's is a great place for families to have a great day of fun! We have been bringing our kids here for 28 years and still come with them - even if they are all grown up! So many things to do for all ages!"], ["Reviewed November 29, 2017", 3.0, "It was okay...", "This was my least favourite theme park we visited in California. If you are a thrill seeker, there are many roller coaster opportunities here.\nStaff are not as friendly as other theme parks. Bring your own drinks, expensive!\nThe jewelry boutique has oysters they open and can place in a necklace - really neat! I got a Rose Gold pearl.\nKnotts berry chicken restaurant has great food with HUGE portions. Could easily have shared 1 entree between 2 adults - prices are good for amount of food.\nShow less"], ["Reviewed November 29, 2017", 5.0, "Thanksgiving", "Overall, it was a great time as usual. But it was hot and they didn't have any mists on to cool us down. Fans were on but it wasn't cool."], ["Reviewed November 27, 2017", 5.0, "Fabulous time", "The amusement park it's absolutely great. It is a great place to take a family, including any young and old. The amusement park is well laid out fun rides for the little ones exciting ride for older kids and adults. The staff in the park is very helpful and courteous, and when you leave you felt like you got your money's worth prices are very reasonable and affordable it's great for all ages and it's the new most fun place on Earth.\nShow less"], ["Reviewed November 27, 2017", 4.0, "Go during the week", "We went during the week, there was hardly any lines. Now, some restaurants are not open, but hardly any lines at the rides. Also definitely download their free app, you can have them link the photos to it when you buy the photo pass. You can download and send to social media or family without 20 mins.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Love it here", "Underrated theme park with lots of rides, shows, shopping and usually quieter than Disney. Bit disappointed that Excelorator was closed on our visit which was not advertised"], ["Reviewed November 25, 2017", 5.0, "Lots of fun - great thrilling rides!", "Knott’s really has some fun and unique rides for all ages. The park itself is always clean and the staff are more than friendly. There are rides for all ages and desired thrill levels. The prices aren’t terrible and the food in the park is pretty decent. Definitely check out the Fast Lane passes on busy days. The extra expense is totally worth being able to skip to the front of the lines and not having to wait.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Awesome day trip", "Theme mining town old west. Great family park. Ghostrider is a awesome wooden roller coaster. Water ride log flume. Boardwalk is fun for younger children. Cute shops. Snoopy theme. Pay to park. Definitely a fun day!"], ["Reviewed November 24, 2017", 3.0, "Dont think Disney need to worry!", "Bought tickets at the Knott's Berry farm hotel as we were staying there. Tickets were 42 dollars each as opposed to 75 each on the gate but when we bought the tickets we were not told the best rides were closed. Three of the most exciting rides Ghostrider, Sol spin and Xcelerator were all closed. The park has the feel of a bit of a throw back to days gone by that some people obviously want but I don't think it was for me. It was very quiet, we went on a Monday and it was like a ghost town. I understand that rides need servicing but to close three of the biggest rides at the same time was disappointing. Weather was good though!\nShow less"], ["Reviewed November 23, 2017", 4.0, "Great visit", "My son had never been here before and he enjoyed it. It is more reasonably priced and still has great rides. We didn’t do any shows, but they looked pretty good. Not very crowded, but still a little wait for a few of the rides. Compared to other parks, this one is a lot more affordable and less crowded.\nShow less"], ["Reviewed November 22, 2017", 4.0, "Big and fun", "Litlle old, however - good fun. Nice place to go with the kids. Litlle free time with them. Good location. Been in Universal Studio, this one has more to do. Less new tech."], ["Reviewed November 21, 2017", 5.0, "Quite simply a fantastic day out", "I visited with my family who had a range of children from 14 down to 6. What a great place with something for everyone, including the big kids. The rides are great for everyone too. The park is clean and well maintained, with a great range of eating places even though they’re a little pricy. The staff are fantastic too friendly, polite and helpful. Tip from the top buy your tickets and parking online, as it basically saves half the entrance price to get in. We’d go back in a heartbeat a great day out.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Rides, shows, music, and fun!", "First trip to KBF and it was a blast. We enjoyed the many shows and the family friendly atmosphere. Lots better than Disney and we really appreciated the expression of traditional family holiday values. Great for all ages, including us old folks!"], ["Reviewed November 18, 2017", 5.0, "Knotts Scary Farm!", "I decided to go to Knotts Scary Farm for the first time on the Sunday on the week of Halloween and wow it was awesome. I got the Fast Pass for the mazes and rides which will be necessary to get on all the mazes and roller coasters and it definitely was worth the cost since almost all the mazes were walk ons with the pass with the rides being usually 15 minutes or less, with the exception being a front row ride on Ghostrider which was about 25-30 minutes. Most of the mazes were very good and were far better than the ones I've been to at Magic Mountain. The only 3 of the 9 mazes that I thought weren't great was Tooth Fairy, Red Barn, and Voodoo but maybe one of them will be replaced next year. The scare zones were okay but there should have been more people scaring the guests. Honestly from what I remember Magic Mountain did a better job. For the rides: Ghostrider- 9/10 best in the back row and an awesome woodie\nSilver Bullet- 7/10 A solid invert but nothing too special but still a fun ride\nLog ride- 8/10 the halloween version was cool, best log ride I've ridden\nMontezoomas Revenge- 7/10 a fun unique shuttle roller coaster\nSierra Sidewinder- 5/10 I'm not a fan of spinning coasters but this one was fine\nJaguar- 6/10 A long family coaster that goes around and has its good moments\nCoastrider- 2/10 ok ride but the restraints are awful on this wild mouse for those with large thighs\nPony Express- 7/10 A fun launch family coaster with interesting seats.\nXcelerator- 9/10 closed but I've ridden it before and it is insane 9/10\n\nFor anyone in or near Southern California during Halloween I would highly recommend Knotts Scary Farm but also if you are only going once then you better get a fast pass.\nShow less"], ["Reviewed November 17, 2017", 1.0, "Disappointed & overpriced", "Visited in the off season - a weekday in November. About half the major rides were closed. Asked around and was told they are open on the weekends - so it is not like the rides were closed for maintenance. It would seem your choices are 1) Visit when all the rides are open, but the lines are so long you can only ride half the rides. Or 2) Visit when the park is slow, and only half the rides are available. Pay the same price.\n\nAs for the food... $45 for two small BBQ sandwiches & two sodas. Way overpriced for what we got.\n\nThe staff was slow and uncaring on the rides. One person loading, doing safety, and operating the ride. If I had to take a guess, Knotts gets all the rejects for the big amusement park down the road.\nShow less"], ["Reviewed November 15, 2017", 3.0, "1st time", "We came on halloween which was a very slow day actually. We went on a few coasters. Of course no lines. Watched a show that was pretty neat. Had bbq which was delicious. This place is all roller coasters, so if that's what you are looking for, you found the right place.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Fun", "We had a super fun day. We got there about 11:30, and the closest parking lot was already full. Which I'm actually surprised about because it was completely dead inside the park. So we had to drive around the corner and go to the next lot. And it's a bit of a walk back to the park. There's no Tram.\n\nWe had bought the season passes for 2018, and you get a free day in 2017. In case you were wondering yes the parking is included. However if you purchase the drink or meal option, for unlimited it does not start until 2018. But you do get a discount at all the stores already with your pass.\n\nIt was completely dead all day on a Monday. We went last Sunday and it was so crowded we decided not to go in. It took us no longer than 5 minutes to get on anything. There was no lines in any of the restaurants. The downfall though, is hardly anything was open. I don't think I saw a single stand open. Just some of the restaurants and shops.\n\nThere seems to be more and more roller coasters than before. I'm not really into roller coasters, I like the smaller rides that are mellow. There are a bunch of those as well. Lots of different shows. Again going on a Monday, more than half the shows were not operating.\n\nMost of the shows are super short. The wild west stunt show was about 10 minutes. the one that was the longest was in the saloon. A guy playing instruments and dancing on the bar. It was pretty comical and we enjoyed it. But seating is extremely Limited, so you want to get there super early.\n\nWe got to watch the Native American dance. That was spectacular. It was amazing to watch, captivating and entertaining. it is pretty short as well, and so worth taking the time to see it. the man that did the dance told us about his tribe. He came out afterwards and allowed us to take photos with his beautiful eagle feathers. space here is also very limited so get there early.\n\nThere are bathrooms everywhere, and they're kept up well. lots of restaurants to choose from. We ate at a little place that had carne asada fries. They were absolutely amazing. We also got a churro stuffed with Bavarian cream right by the log ride. they say they are made fresh, but they were hard as a rock and it was only half-filled. They were nice enough though to exchange it. However the next one was kind of hard as well just not as hard.\n\nthey have a lot of cute things in the shops, just way overpriced unfortunately. But that's to be expected at parks like these. we love not having to deal with the crowd, and we had a really fun day there.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Fun day", "It was a great day. The weather was nice, it was not too crowded. We were able to enjoy all the attractions with minimum wait times. We went on a Monday and we arrived right when the park opened."], ["Reviewed November 13, 2017", 5.0, "Great value day out", "Booked tickets in the UK via Expedia UK and worked out £32.50 each so even cheaper than the discounted tickets being offered in america - so UK readers please take note.\n\nWasnt that busy yesterday 12th November which was great news as queues were kept to a minima.\n\nStar of the day as ever is Ghost Rider which without any doubt remains one of my top few rollercoasters anywhere - awesome wooden coaster with good sized drops and speed.\n\nCouldn't recommend this high enough.\n\nFrustrating that Xcellerator wasnt in action again , last two times now it hasn't been working but because of day value overall didn't adversely impact on the day.\n\nFood is expensive in the park but we aint before getting here so didn't affect us.\n\nExcellent day though value for moneywise.\nShow less"], ["Reviewed November 11, 2017", 1.0, "Very disappointed", "My sister and I went to Knott's Berry Farm, after visiting the park in 1981. Back then, it was a more of a toned down amusement park and had a nice country flair. Looking at it now, it looks rundown and has lost it's niche. Reminded me more of a county fair that travels from town to town. Few rides of interest, dirty, and few food options. Would not have been happy paying 1/2 the price we did. We will not go back. Saw everything in 2 hours and that was stretching it out.\nShow less"], ["Reviewed November 11, 2017", 1.0, "Don’t waste you money", "Wow all I can say is I will never be back to this park again, and I will make sure that if I am ever asked I will tell people not to waist there time or there money.\nProblems :\n\n-no feminine products in any of the bathrooms\n-not all bathrooms had changing tables\n-no wait times displayed anywhere to communicate with people wanting to ride.\n-lines not properly managed, backing up into walkways\n-2 hours to go on 1 ride is ridiculous.\n-60.00 for a fast pass is  5x more then Disney charges and is very high\n-staff were very slow and took there time getting guest on and off the ride.\n-staff members were rude when we talked to them\n-staff members gave out the wrong information many times in the restaurants.\n-waiting 75min for food at any location was the worst.\n-the cleanliness of this park was gross\n-many bathrooms had no toilet paper by 3pm\n-when I complained in person I was told it's a busy holiday. (Veterans Day is a busy holiday for you then remind me to never show up in the summer, spring break, Christmas, and so on) plus if you knew it was going to be busy when wasn't the park staffed to handle it.\n-on the way into the park the signs said all rides were going to be open but that not the case and some rides were closed for the day.\n-a single staff member to load, unload, unlock and run a single ride is poor time management, and does nothing but upset guest waiting to enjoy their day\n-maintenance supply and equipment was left unattended all over the park. Such as extension cords, surge protectors, spare parts and more.\n\nAgain I will never be back to this park again.\nShow less"], ["Reviewed November 11, 2017", 2.0, "must do", "way over priced and too commercialized everything cost too much money and the main goal is to get your money"], ["Reviewed November 10, 2017", 5.0, "Thank you Knotts for Supporting Veterans", "We have loved Knott’s Berry for over 65 years and we continue to enjoy the visits. We first came with our parents, then Donna, my wife for over fifty years, dated at the farm for free. There was free admission at that time. We paid fifty cents each for the Bird Cage Theater. Our sons and OUR TEAM grandkids followed. All this to say, THANK YOU TOWARDS VETERANS tKNOTT,S.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Knott's Scary Farm was Cool!", "A dark, foggy amusement park at night is a great idea. Killer clowns and other surprises suddenly pop out of the fog reminds me of Blair Witch Project. Well-done!"], ["Reviewed November 9, 2017", 5.0, "Knotts Scary Farm so worth it (Only on around Halloween)", "We attended Scary Farm and had a ball. Pay for the fast pass it is well worth it. Jump the queue we got to do all the rides and did not line up once.\n\nOnly good for someone who is not scared easily, it could be traumatising.\nShow less"], ["Reviewed November 9, 2017", 3.0, "Knotts scary farm visit", "We visited the knotts scary farm during Halloween time.\n\nThe price is little too high (online is cheaper than ticket window) for the number of hours available 7 pm to 1 am or maybe 2 am.But it's so popular and crowded that each of the rides had 90 to 120 minutes wait time. You can buy fast passes for additional price which would again increase your cost.\n\nThe scary mazes are really amazing and good innovative ideas. Loved a couple of them but we were just not happy coz we weren't able to complete most of the rides and the crowds was just too much.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Enjoyed more than Disney", "My family and I went to Knotts Berry Farm mid week in November and we enjoyed it more than Disney. We saw some large groups when we got there but they didn't seem to get in our way like the tour groups at Disney. There are lots of rides and lots to do.\n\nIf you are going to Disneyland, don't overlook this park. It's not to far away and it's a great park!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Knotts Berry Farm in October", "We have always visited here in the summer months and found fall to be an ideal time of year to visit! The entire park was decorated for Halloween and the crowds were very low. We literally felt like we had the park to ourselves for a good few hours.The park is laid out nicely with different sections and I noticed there are water fountains in each area. Ideal on a day it reached 104!! You can easily do entire park in one day. The small time feel of it's early days in the 60's somehow is still present and the childhood memories come flooding back!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great Fun, Great Rides, Great Food", "I’ve never been so terrified in a wooden coaster in my life, but The Ghost Rider packs a wallop of adrenaline. All the rides were fun, and the old timey atmosphere was unique. We ate (after lining up for an hour) at the famous restaurant and their fried chicken and biscuits were worth every minute.\nShow less"], ["Reviewed November 4, 2017", 1.0, "Would be great...but pricing doesnt make sense.", "Disney has it right with the fast pass system. KBF does not. Im surprised they havent learnt being so close. 75 to get in as an adult 45 as a child. Want fastpass tickets....not included...75....yes and extra 75 each even for kids. Lines were stupid long for this level or park. Stuck waiting hours to go on few ride because I wouldnt drop over $400 for a day admission to an amusement park....stupid.\nShow less"], ["Reviewed November 1, 2017", 4.0, "Always fun for the family.", "I always enjoy visiting Knott's Berry Farm. The lines are not too long, and the park is very clean. The food lines are not too long."], ["Reviewed October 30, 2017", 3.0, "Average at best", "We bought tickets on-line which you had to state the date you are going. These worked out over half the price of the tickets at the gate. We also had an Uber from just outside Disney which was cheaper than parking here.\n\nWe went on a Sunday and the park was quiet with a number of rides closed, we arrived for park opening but had done everything by 14:00.\n\nI would recommend the rapids, Calico mine ride which was unexpected, ghost rider and the log ride. All lines were short.\n\nThe blacksmith in ghost town is great, he was very friendly and talked to us about things we should see while in the park. He is a great asset to Knott's Berry.\n\nWe got stuck on voyage to the iron reef for around 40 minutes, the soundtrack was loud and on a loop which was really annoying it's a shame they didn't switch this off.\n\nI was glad I went to the park and there was a few good rides but I would not rush back as there is just something missing.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Great little theme park", "Had a great day at Knotts Berry Farm. Wasn't to busy and an extremely enjoyable day. Definitely worth going to if you like theme parks. Plenty to do and eat."], ["Reviewed October 28, 2017", 5.0, "So Fun", "We bought the all day dining pass but still spent additional money on ice cream and drinks (things that are not covered by the all day dining pass). In doing so, all we accomplished by buying the day pass was spend more money for food than we would have if we just ate what and when we wanted.\n\nThe park itself is a blast. Lots of things for kids and fun stuff for adults as well. Our almost 2yo wasn't loving the fact that he's too short to ride anything fun, and in his defense there are some rides that shouldn't have a height requirement.\n\nAnyway, it's a great time for a lot less than other attractions nearby. Definitely worth a visit if you're in town.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Great deal", "We visited on a Tuesday morning late October we almost had the place all to ourselves. All rides were walk ons! We rode Silver Bullet twice in a row with no wait at all. Loved Ghost Rider, what a fun wooden coaster.\nThe staff was super friendly and helpful. And the park was clean. I thought the theme was well done too. The shops are neat!\nVery surprised to see how empty it was, especially because it is not very expensive for entrance either.\nWe had a great day at Knotts and would recommend it to anyone visiting the area for a nice relaxed day at a theme park.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Sunday Funday", "I visited Knotts on a Sunday and it was busy. The lines were pretty long so we did not ride a lot of rides. The rides they do have are not that exciting either. I feel like this park definitely needs an update or something to draw vistors.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Knott's Scary Farm 2017", "Took my family on 10/22/17 my wife's Birthday for our annual trip to Knott's Scary Farm, WE HAD A BLAST!!!! Went to the pre haunt dinner. Food was great as were the 2 clowns that filtered through the diners. Because we went to the dinner you were allowed into the park early. Because of that we had 4 mazes done before they opened the park to the guests at 7pm. Mazes were fun. The best 2 in my opinion were Pumpkin Eater and Paranormal Inc. Dark Ride was also good. Knott's also brought back their t shirts that were dated with the year. I have them all going back to 1999. The highlight of the night of course was seeing Elvira!! This is her last year performing at Knott's. You have to see it, the audience gave the show a standing ovation. I went Universal Halloween Horror Nights this year. Knott's blows this attraction away!!\nShow less"], ["Reviewed October 25, 2017", 5.0, "Knotts at Christmas!", "I'm so excited for Knotts Christmas. They really do a good job, it puts me in the spirit. Silver Bullet is a must!"], ["Reviewed October 24, 2017", 5.0, "Knott's Scary Farm", "Don't even waste your time reading this... just go! It's seriously so much fun! They put a lot into the Haunted \"Mazes\" and even add Halloween decorations/props/etc to some of the rides. The employees walking around make it so fun as they scare people and their costumes are awesome. They have fog in certain places which really adds to the fun. We purchased the all inclusive pass which included parking, a \"Boo-fet\" dinner, 30 minute early entrance and fast passes. It was extremely busy so the fast passes were a must. I plan on returning every October!!\nShow less"], ["Reviewed October 22, 2017", 5.0, "Knotts Scary Farm", "Won tickets online for Knott's Scary Farm, had a blast.. haven't been here since I was a child... definitely will be coming back. Knott's scary farm was so fun!! Can't wait to come again in the future."], ["Reviewed October 22, 2017", 5.0, "Chicken dinner restaurant", "Great chicken dinner, the chicken soup was the BEST item we ordered. Also, the boysenberry turnovers were absolutely delicious."], ["Reviewed October 18, 2017", 5.0, "Better rides than Disneyland", "We had a great time here. It was 3 adult & a 3rd grader. The Silver Bullet & Pony Express were my favorite rides. The crowds were very small. We rode all rides with less than 30 minutes wait times. There is a family picnic area which also has ducks & chicken running around. The rock shop was of interest for the 3rd grader. The Knott's restaurant was great too.\nShow less"], ["Reviewed October 18, 2017", 5.0, "WOW!!!", "This place is amazing. It is all ages. The best part is all the rides and the food there is amazing. During the months of Sep. and Oct. there is an event called Knotts Scary Farm. I totally urge you to go but this is probably a place for 10 years older and up. I hope you go enjoy.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Wonderful day!", "We took our German exchange student here and she liked it better than Six Flags magic mountain! It could use. Good cleaning though."], ["Reviewed October 16, 2017", 4.0, "Great day out for all the family...but sandwiches confiscated!", "Visited the park with our two young kids (4 and 2). Loads of rides for both to go one with a few bigger, scarier rides for us! Main annoyance was getting our sandwich lunch confiscated at the gate on entry. I don’t understand why parks do this,especially when travelling with young kids who need a break from fries occasionally! Even Disney let you take food in so I think this should be reconsidered. Good day out though,despite the nonsense at the start.\nShow less"], ["Reviewed October 16, 2017", 4.0, "11 birthday", "we have yearly passes and the kids love to spend the day there. this time was my sons 11 birthday. it was special day for him. we gat there early and spent a great day there. sure it’s an amusement park and you will have to wait in line but you know that going in. the park is clean and it always delivers a good time. if you don’t like waiting in line or medium size crowds or yelling kids...then this isn’t your place. if you want to get your body tossed around in roller coasters then this is your place\nShow less"], ["Reviewed October 16, 2017", 3.0, "Knotts Scary Farm 2017 Review", "Note that Knotts Berry Farm is 4/5 stars for me but Knotts SCARY Farm is more like a 2/5 stars, so I averaged my rating to a 3 star.\n\nNot worth it without a fright/fast lane pass. Bottom line. Especially if it's your first time, like it was mine. I want to rate this higher, but a lot of stuff made it hard. Will list below.\n\nCame Saturday and paid for preferred parking ($30) which is a few blocks closer to the entrance. We got through security by 6:40pm and waited 20 minutes for the opening fog scene where they let the creepies out.\n\nFrom 7-8:30pm, there were no lines. We got into the first maze Dark Ride, within 10 minutes. And this was pretty scary. We got on the Supreme Scream ride within 10 min. Then Jaguar within 5 min. After that, lines for rides and mazes became ridiculous. I'm talking 1.5 hours to 2.5 hours... Knotts Scary Farm is only 7 hours long - it is virtually impossible to get through all the mazes in one visit... let alone mazes AND rides.\n\nWe left at 1:30am... in that time we were only able to do 2 mazes, and 5 rides. Even though I've been to Knotts many times, and have been on all the rides before, we just couldn't do all the mazes. Which is unfortunate since that's why I wanted to go. The lines were just too ridiculous. We decided to do rides to at least get our monies worth.\n\nPros:\n- wasn't cheesy, and was actually very fun/scary\n- decorations were awesome\n- actors were great\n\nCons:\n- over 2 hour wait times for everything is ridiculous\n- the body count in the park was excessive. Shame on you Knotts\n- the signs were nonexistent literally. It was so dark and foggy, we were just lost and couldn't get our bearings right... Couldn't find the ride entrances or mazes\n- the ride attendants weren't very proactive in filling empty seats making ride lines ridiculous\n- SO MANY CUTTERS! and staff didn't even kick them off rides nor was there staff to prevent them from cutting\n- the lines for food, and beers were also nonexistent... people were just making new lines ahead of people\n- xcelerator ride was closed and we wanted to go on this ride\n\nI do want to come back next year. But I'll for sure buy fright/fast lane passes so I can do ALL the mazes. Wished we could have done Special Ops Infected and Trick or Treat Lights Out... we were so sad leaving without having done these.\n\nI think Knotts runs this event very greedily. It's like they only care about packing the bodies in, and don't care about your overall experience. For a special event, that is only 7 hours long, they should sell a LIMITED number of tickets per evening.\n\nTips:\n- download the Knotts app... it tells you how long the wait times are for rides and the mazes in \"real time\"... these times were pretty accurate based on the rides and mazes we did go on... however the app map in real time sucked. It kept changing our current location from one end of the park to the other. So useless for finding your way around using the app GPS.\n- for accurate GPS, we used our Google Map app\nShow less"], ["Reviewed October 15, 2017", 4.0, "Small But Unique", "Every time we have come to L.A. we see this Knots Berry Farm place on brochures and such. We had never known what it was, and no friends in or around L.A. had ever been there. This time around, we made it a point to visit. It was part of out Go L.A. pass, so it was included along with 35+ other places, so why not?\n\nWe have been to other parks owned by \"Cedarefare\" as I think they own almost all of the major parks now, so we kind of knew what to expect. The one thing that was really different about this park is, it's all set up like a small town out of the old west. From the time you are walking in from the parking lot, until you get to the back of the park, it is like you are walking through an old west town with coasters and such. Another thing we liked was, they had some different type of coasters we had never seen before. A good example of this is the horses, the name of the ride escapes me, however it is where you sit on a horse similar to those old dime store rides as a kid and ride it like a coaster.\n\nThe unfortunate thing about pretty much every Cedarfare property is lack of healthy food options. A few things of fruit on carts or a ceasar salad is not really balancing out the scale. Most of their food options at any of the parks are the same burgers, dogs, pizza. I was not looking for absolute crazy health freak, but there was almost nothing. We asked several staff/cast members whatever and none had any suggestions. We look at most of the places ourselves as well.\n\nThat said, this is another one of those two parks for price of one, or two parks one great price. Which is really the best value if you had kids. The park is not that large, and they only have a handful of adult rides. You would want to do the water park to make a full day of it. That is, unless there are crazy lines where you are waiting an hour each time for rides.\n\nAll in all, this was a good experience. We did not go in with expectations, so this was unique and a good value being included with our Go L.A. pass. The one thing I will note to anyone looking to do this though, if you do get a Go LA pass, make sure you go to the ticket booth BEFORE you get in line. Most of these discount deals you have to swap out the voucher for a ticket before you head into the park. Best to ALWAYS CHECK ahead of time.\nShow less"], ["Reviewed October 14, 2017", 1.0, "Knotts scary farm", "I grew up coming to knotts Berry farm and Knott's scary farm. However, this recent visit to the Halloween horror night was awful. If you don't have fast pass tickets, it's a waste of money and time IF you go on the weekend (Saturday). The lines are extremely long, even on rides that don't normally get long lines. My boyfriend and I came wanting a fun night out, and it ended up being waiting in long lines for mazes that aren't even scary, AT ALL. Reconsider coming for the Halloween horror night, but if you are super interested in coming, consider during the week. Not trying to be overly negative, just trying to help others out!\nShow less"], ["Reviewed October 14, 2017", 5.0, "Really great experience", "This has got to be 1 of our favourite theme parks! Not only is it extremely reasonable to enter, it is extremely reasonable to eat and drink and shops are very competitively priced - great if your visiting with children. The Wild West theme is brilliantly done and the Old West train and Stagecoach rides are superb for setting the mood. The buildings and staff in their period clothes look just great and of course the rides will keep both kids and parents amused all day long, as will some superb shows throughout the day. There really is something for everyone. Superb value for money!\nShow less"], ["Reviewed October 13, 2017", 5.0, "Best place to visit for Halloween!", "I've always wanted to visit during Halloween and it was everything you could want in a theme park during a spooky time of year!\nThey had day time \"spooks\" for families and transform at night to become a little more scary.\nWe stayed at the hotel so we were able to go change and wait for the park to ready for scary farm!\nHighly recommend staying at the hotel if possible! It made it so much nicer!\nThe tickets are different for daytime/nighttime so plan accordingly.\nI would also suggest breaking up the two into different days. We ended up doing all of it in one day. It made for an amazing day but long.\nI don't usually give 5 stars but this place knocked it out of the park so to speak!\nNo doubt we will all be back!\nShow less"], ["Reviewed October 12, 2017", 4.0, "All Day Dining Plan", "The All Day Dining Plan is great because I got to enjoy an entree from different vendors. The only drawback is that I could not start my meals until after 10am. If the participating vendors started serving at 10am, then the dining plan would have been better buck well spent but I believe that the first entree was served at 11am so I missed out on at least one of the meals. Neither of the 2 vendors allowed to provide turkey legs and that was not posted. I was really bummed. Then, although stores offered AAA discounts, certain other places did not. So there was inconsistency with there discount policies within the park. I do not mind spending money, but I also like to find ways to save.\nShow less"], ["Reviewed October 11, 2017", 5.0, "So much more value than we thought!", "We had company passes for this venue, and it turned out to be a very fun day. We rode a train from the 1880's, complete with a robbery we are still talking about. Many of the rides have been upgraded from past years, and there are some thrilling coasters. My favorite is the Revolution, one of the newest in the park. I rode this ride twice, the first time leaving my seat six times, the second time 10 times due to less people on the ride and consequently more lift. The Silver Bullet is another new ride, spinning the riders upside down and more. Both of these rides are rated a level 5, the highest rating for this park. There is a younger children's section which was very busy all day. Riding a real stagecoach was another highlight of our day. My granddaughter also loved the Snoopy Halloween show and the swings.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Very clean amusement park.", "Lots of thrill rides for the kids. They keep the park very clean. The only disappointment was that two of the major rides were closed for part of the day which caused long lines."], ["Reviewed October 8, 2017", 4.0, "fun first time", "we enjoyed our 2 days (first timers). we liked the history of the knott's. we loved the museum with the western times/guns etc. the park doesn't feel like they have to not show real history. The stunt show was the BEST. would recommend to at least visit once in your lifetime.\nvery expensive, had to pay $4 for bottle of water, not a lot of drinking fountains or water refill stations (only reason for 4 stars instead of 5)\nShow less"], ["Reviewed October 8, 2017", 5.0, "Brilliant!", "We went on a Friday in late August and there were no queues! (other than c15 minutes on ghost rider).\n\nAll the rides were brilliant and the park was well kept and really clean. The staff were mixed in the extreme - either very friendly or not interested, but it didn't really matter, the park is fantastic.\n\nThe fact that there were no queues meant we could do all rides more than once, and we had a great time.\n\nGhost rider and silver bullet were family favourites and well worth the visit. I Strongly recommend KBF!\nShow less"], ["Reviewed October 8, 2017", 5.0, "Great Theme park decorated for Halloween Time", "We visited Knotts Berry for one day during the Halloween season. The decorating and theme displays were excellent. We were at the hotel for many of the Scary Farm nights and could hear the screaming from the park late in to the early hours.\nThere is a good selection of rides for all ages, this park is different to other theme parks we have visited on our holiday much smaller. with lots of attention to detail. The lines were non existant, we visited on a Tuesday so we were able to ride multi times. We got soaked on the rapid ride. My family loved the old wooden coaster and this was there favouite parkj ride.\nThere is a very good choice of restaurants and priced reasonably.\nA really good family day.\nShow less"], ["Reviewed October 7, 2017", 5.0, "GREAT TIME at KNOTT'S For ALL ages!", "The rides are still great! The Log Ride is still the BEST ride! I have gone to Knott's many times since 1973, and I always have a great time! The shows are great! The Staff is friendly and positive! Reasonably priced! Not crowded often.....so you can ride often! 5 stars on all levels!!!!!\nShow less"], ["Reviewed October 5, 2017", 5.0, "Fun was had by all!", "My family went to Knotts Berry Farm this last weekend. Kids ages from 2 and 4 to 13 and 15, with adults of all ages. We had a BLAST! There was so much to see and do and all the rides we were able to go on were so much fun! The Silver Bullet was our favorite and for the little ones, it was the train ride. Our big disappointment was that the park closed early due to the opening of Knotts Scary Farm. Our bad for not checking the hours before we went.\nFYI: The lines for the rides can take hours and for the whole day we were only able to go on 4 rides. I am sure the fast pass would have been good, but we never got them. Food is expensive, plan for it.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Nice to go to a place not trying to be PC", "I loved the fact that they had a museum with guns and wild-west paraphernalia its refreshing to see the way the west was settle not PC-washed of inappropriate items. fun rides nice people that work there"], ["Reviewed October 2, 2017", 5.0, "Family Fun", "This place is Great, Affordable and reasonably priced. Lots to do for all ages. I went for a meeting place we enjoyed the Food, the rides and infant I was told. That is their slogan come for the food stay for the rides. Family and I had a blast. Truly and highly recommended.\n\n,\nShow less"], ["Reviewed October 2, 2017", 5.0, "Fun for all ages", "We have a 9 year old and a 13 year old pair of boys. They thoroughly enjoyed this park, and we did too. We went at the end of August when the American children went back to school. This meant very short queues for the majority of rides. Certainly didn't queue for longer than 20 minutes on any ride. Most rides were pretty much straight on! Much better than hour long queues at Universal Studios. There are a range of rides for thrill seekers and young children. You can take a stage coach ride or a trip on a fabulous steam train.\nThe whole park has a cowboy theme and the folk dressed up get into character and stage gun fights! The Snoopy magic show is simple but loved by children. The park is clean, spread out well and there is lots to do. We went back on a second day because we had an LA Go card.\nYou are not allowed to bring food into the park but there are picnic benches outside the entrance by the shops so you could bring a packed lunch and retrieve it from the car at lunchtime, as you can re-enter the park at any time when you have your hand stamped.\nWe would definitely go back. One more thing....we recommend the bumper cars at the far side of the park! Good old traditional fun!\nShow less"], ["Reviewed October 2, 2017", 4.0, "Fun for the whole family!", "Knotts Berry Farm is a great place for a family to go! There is something for everyone! We went there for a day this summer and did not get to see everything at the park. All the kids loved it and it is within 15 minutes of Disneyland. Very easy to get to. I recommend getting fried chicken and biscuits at the end of the day.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Family Fun Day", "Was a great day out at Knott's Berry Farm with the family. Knott's caters rides for all ages with no long ride waits. Was nice to be able to walk around the park without having to rush from ride to ride. Food was good in the park, but you can go to Mrs Knott's Famous Chicken dinner which is located outside the theme park next door. (You just need a pass-out). Parking is available for a fee, and is only a short drive from Anaheim.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Loved it", "A nice park suitable for all ages and not as crowded as Disney. We loved the ghost town and almost all rides. Kids loved the snoopy show and the theme being around it. They have the best ever fried chicken ever. Its a good value for money.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Amazing attractions", "An amazing park for all ages with a lot of exciting attractions. Many roller-coaster 🎢 and kids activities."], ["Reviewed September 29, 2017", 4.0, "Guanteed fun for toddlers", "Our family loves snoopy and his friends. We went on Halloween / Scary Farm season and it was suprisingly fair the regular tickets if you buy them online. The weather is so nice on late september, I´ve always thought it is a great time to go when is not too hot and on the evening you can use a light jacket.\nShow less"], ["Reviewed September 28, 2017", 3.0, "Lacking thrill rides", "I have always heard that Knott's Berry Farm has great thrill rides, but I was a bit disappointed. There are roller coasters, but I found most to be quite tame and the best one was not open on the day that we were there. We had made reservations at Mrs. Knotts and found ourselves trying to fill in the time at the end of the day because we had finished everything. We had watched several of the shows, too. This is a good park if you have children who between the ages of 8-12.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Beautiful Park", "I haven't visit the park in 28 years, of course look different but still my favorite park. Park is clean, friendly and family oriented, staff very pleasant. Different machine to choose and have fun, entertainment. Recommend for any person, family or group."], ["Reviewed September 28, 2017", 3.0, "First trip here in over 30 years", "I vaguely remember coming here as a child, probably when I was 4 years old. Visiting Disneyland and decided to spend a day here before heading back home. The park is no where as packed a Disneyland, but the animatronics are very out dated and creepy. I understand that compared to Disneyland this place it trying to stay afloat, but it seriously needs some investment to update some of the old rides...maybe Disney should buy it out and turn it in to a Western themed park and free up Frontier Land for more room for the new Star Wars land...overall prices are way cheaper and the park doesn't get a bust as Disneyland, so a good bargain if you don't want to spend too much $$$ and want to plan a small theme park vacation. I believe the season pass is only a few dollars more than a single day ticket so it is way more r adorable than the Disneyland annual passes.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Boysenberry Fun", "I love all the boysenberry related treats. Delicious! Please, try the boysenberry punch. Worth it. The top three coasters were down and the rest were pretty tame but this is a great place for children. I recommend visit camp Snoopy. It's so much fun!"], ["Reviewed September 25, 2017", 5.0, "Great Park, Good Mix of Rides and Entertainment", "This is our second visit to this park (last one six years ago), and what a great park. Rides cover all ages, from a slow train ride and horse drawn carriage rides, to the wooden roller coaster and everything else in between. We only had an afternoon here so we concentrated on getting on the rides (we are, in fact, a family of three with an adult teenage daughter). I am a chicken, so I won't try the biggest rides, but my daughter and husband went on the wooden rollercoaster (rude not to as we were there) and thoroughly enjoyed it but were also scared by it. There are also shows and lots of choice of places to either snack or eat inside the park. We elected to save our stomachs for chicken dinner just outside. Very enjoyable place, thoroughly recommended as an alternative to Disney and Universal.\nShow less"], ["Reviewed September 24, 2017", 4.0, "This is a Knott's Scary Farm Halloween Haunt review", "It had been many years since going to Knott's Halloween Haunt and I was amazed at the changes that were made to both the event and the park it self. First I have to say the decorations and the mazes were much better in quality than they used to be years ago, it is now very impressive. I was a little disappointed that they barely decorated to Log Ride and that they no longer decorate the Mine Ride. Years ago the individual shops and restaurants also were decorated by the employees and that was always fun to see but that was stopped many years ago. I was absolutely shocked how much they charge for food, $12.69 for a hot dog and French fries and also saw a funnel cakes for $9.99 and up. Honestly it the prices were too high and all the fast food restaurants were dead with no business or lines at all for the entire evening even though the park was filled with people. Years ago you had to wait quite a while in line for any food or drinks. I believe if the prices were much lower they would have a lot more sales. The haunted mazes were very good and I had a great time but I just refuse to pay that much for junk food. Some of the parking was up to $30.00 for this event.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Knotts Scary Farm for Halloween", "I'm not a particular fan of scary movies, thrill seeking or crazy rides, but I decided to be adventurous and check out Knotts Scary Farm which just opened up for the 2017 Halloween season. The regular park closes at 5pm and the Knotts Scary Farm runs from 7pm-2am through Halloween. Ticket prices increase as it gets closer to Halloween. I paid approximately $42 through gold star. You must make reservations for specific nights online. Or you can pay at the park but they can be at capacity. Tickets are inexpensive but parking is $20 for regular and $30 for preferred. The nice thing is it wasn't too far of walk for the $20 parking. I didn't notice a shuttle option either.\n\nThe price was ok, ok enough that I didn't have to worry about losing too much money if I got scared and decided to go home early. Note, no re-entry to the park. Luckily everything was ok and I had a good time.\n\nLines can range from 30 mins to 1hr + for some of the mazes. If you are willing to pay you should invest in the fright lane (aka fast lane). It's more likely that you'll see everything at the park. During our 5 hour visit we completed 3 mazes, 2 rides and watched the Elvira show. That was good enough for me.\n\nI recommend getting there 30 minutes before the park opens and tackling the most popular mazes first. Infected (where you laser tag zombies) and Dark Ride (clown theme) appeared to have the longest lines. I would make time to see the Elvira show too. It's only 30 minutes. I would pass on the Hangtime show which was awful and all politically driven. This show is outdoors with standing room only.\n\nOverall this was a one time only experience for me and while nerve wrecking at some points it was bearable because I had a partner to guide me through the mazes. The monsters in costume roam the park to terrorize guests as well but they are more centralized in specific areas. Just avoid eye contact and beware at all times.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Great Off Season with no waiting", "Made the trip,up from the San Diego area for a day at the park. Old stomping grounds as a teenager in the 1960s so it was a huge change over the years. Daughter and granddaughter had a great time on the rides with no waiting on this off-season Friday. Of course parking is no longer free (now $18). Plenty of gift shops and things for all ages.\nShow less"], ["Reviewed September 19, 2017", 5.0, "No lines all day!", "My friend and I went to the park the day after Labor Day and it was probably the best decision we could have made for our trip to California for the long weekend. There were no lines on any of the rides, quite literally, and even most we could just stay one for another round without having to get up and go back around. We finished all the rides within 2-3 hours, and didn't know what to do for the rest of the day since typically it takes 6 hours to ride half the rides. It was well-worth the ticket price, and no fast pass was needed.\nShow less"], ["Reviewed September 19, 2017", 5.0, "the third wheel of Disneyland", "The third wheel of Disneyland. After exploring Disneyland and California Aventure remember Knotts Berry Farm is nearby. No need to change hotels Knotts is less than 7 miles away. Knotts was one of the original theme parks and the Ghost town is still a hoot. The new sections have wild roller coasters and carnival rides. The fried chicken and boysenberry pie remains a treat.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Great time here", "WE had a great time here. There were a lot of rides for our 17 month old. There was so much to do and we had a great time. Very clean."], ["Reviewed September 18, 2017", 5.0, "Great day out", "First visit really enjoyed the old buildings,great atmosphere,very clean,some lovely food to be had,nice shops kids loved the rides, we loved the train rides all the staff were helpful worth a visi"], ["Reviewed September 15, 2017", 5.0, "No Disneyland", "But that being said it is still a fun place to go and take the whole family. Also if you are into being scared then I suggest you go during Halloween, also known as Knotts Scary Farm. It is not as expensive as Disneyland and also a lot smaller, but it is still a lot of fun, whether you are with friends or on a date\nShow less"], ["Reviewed September 15, 2017", 5.0, "First Visit to Knott's Berry Farm....", "Went for diner as our California friends continually talked about this restaurant with the great chicken. We were quickly seated. Menu was great. As predicted the chicken was great. I ordered the chicken soup and chicken and dumplings. So much food could not eat it all.\nI saw so many families with young children whom seem to be having a great time. As we later walked around observed the wooden roller coaster. Many screams and laughter by patrons.\nWalked through the many stores selling souvenirs and food items made with their famous Berries.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Relax and Enjoy the Day!", "We visited on Sept. 13. Lines for rides were almost non-existent. Felt like we had the park to ourselves. Was told it will get busier with Halloween activities. Friendly staff everywhere! Why wait 40 mins. for Splash Mountain when you can enjoy the Knotts Berry Farm timber log ride, huge roller coasters and other thrill rides without the crowd? Huge $ savings besides!\nShow less"], ["Reviewed September 13, 2017", 3.0, "It's been 30 years", "Well it had been 30 years since I visited this park. Had to say it brought back a lot of good memories spending many summers visiting this park when I was a child.\n\nPrices are still a great value considering some of the other local amusement parks. KBF has also added many more attractions and performances which was a nice surprise. Still love to see the western theme alive with employees dressed as long ago times of past. We took my son here for the first time as we now live in Asia. He really enjoyed interacting with most of the employees and experiencing their characters and the stories they shared. Park was well kept up and clean and not overcrowded on most of the rides. The Wild West show was still as I remembered it as a boy and my son who had his ears covered the whole show, enjoyed it as well.\n\nThe gal who was working in the pony express office that day was wonderful and her and my son got along great as she sent him around the park on many special errands. Turns out she lived where we did in Asia for a while so we had a good laugh sharing stories. Small world.\n\nWhere KBF lost a rating was because of a few unpleasant experiences we had there. The first was our encounter with the sheriff on duty that day. When others sent my son to him to deliver messages, he appeared to see this as an annoyance more than part of his job. This left a bad taste in our mouths as my son was very excited to do this and the response he got from this guy was less than friendly. Apparently having to take time away from him talking to the same two other employees we saw him chatting with throughout the day, was annoying to him so he quickly did what he had to do to shoo my son away.\n\nThe next downside was having to wait over 30 minutes after waiting in a line for 15 minutes to get our food? Poorly understaffed and mismanaged as there were only about 15 people in line at the time though it felt like there were hundreds ordering. Could only see 3-4 kids running around like they had no idea what was going on and never bothered to ask for help. Food was expensive and so so in taste but eating it after waiting so long I had to choke it down because I wasn't happy by then.\n\nLast point of disappointment was the last ride of the day the log ride. The line was long and it was hot but luckily most of the waiting area was shaded. But the most frustrating part of waiting was watching countless empty rafts go by and often 3-4 in a row? We waited 40 minutes which could have been reduced by easily 1/2 the time if the ride was managed properly. Maybe the rafts were broken I don't know but doubt it? The really irritating thing was that many of the 6 person rafts only contained 2 people. We're there no other groups of 2's or 4' that could be paired to film one raft or did the staff not care or bother to think of this??? Grrrr\n\nOh well, I did enjoy the visit and yes it's worth going to. We had fun all in all and came to understand that this park is less staffed than others nearby so may not be as efficient but considering the cheapness of the entrance ticket, this is probably why they can charge less because the payroll is lower.\n\nTry it for yourself and have fun, just don't order your food from the cantina if your hungry.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Alway a good time", "When you want to have some fun or just walk around and shop this is a great place to come. Since we live locally we come here to eat. As they have so many choice to choose from. Now that the Chicken house has been reopened you need to try the best chicken around. But don't forget the pie! Fridays is another place to stop and eat with so many items to choose. If you just want to come down for happy hour they will be able to bring you the best deal around and the most tasty. After you are all done running around the park you will need to rest and there are hotels around to do just that so you can come back the following day and enjoy it all again. Have a great time.\nShow less"], ["Reviewed September 12, 2017", 4.0, "Decent park, better for small children.", "It was okay. got in with discounted tickets from my job, and since I don't have children, Unlike Six Flags, its not a pace I would pay full price to go to. Went with my husband because we love finding new things to do, especially in California and we had never been. Didn't like the food too much. Except the Panda Express. All the other stands have already cooked food prepared so our stuff wasn't really fresh. If you have small kids 10 and under they would probably love it though.\nShow less"], ["Reviewed September 11, 2017", 5.0, "A palce to remember always", "visited over 20 times and still can not get enough\nit is a place that hold a lot of memory and one of the greatest family place to visit in L.A\nyou can easly spend a full day and come back with great memories.\nlocation is conviniant, planty of parking, surronded by many great palces to eat not to mention the tradentional resturants there\nMost important it is still more affordable than other amusment parks in the area\nYES, YES, YES Tourisrts and locals take your kids and go there you will never regret is\nShow less"], ["Reviewed September 7, 2017", 5.0, "I love it here!", "This place is truly a place where you can have a good time. It may be be smaller than other amusement parks but it is affordable."], ["Reviewed September 5, 2017", 5.0, "Knott;s Berry farm......great day at the park.", "During our So Cal visits we usually pick Knott's over Disney. It's much cheaper, less crowded, smaller to walk around with plenty to do. We paid $90 for the two of us one day pass. We had a friend drop us off right at the gate so that was our cost today.\nStaff is always very friendly and helpful. We got there when the park opened and left at 5:00 pm about an hour before closing. It was a low stress day and we took a slow pace. Enjoyable day. Do not miss the Calico mine, blacksmith shop and train ride. A++\nShow less"], ["Reviewed September 5, 2017", 5.0, "Great rides and no queues (late August, Mid Week)", "Me and the family went here in late August, mid week. The park was empty. Still took all day to get round it mind.\nThe rides are really good and my girl (13) and boy (11) went on every ride. Again, food is expensive so book on line using the deals before hand.\nShow less"], ["Reviewed September 5, 2017", 5.0, "1st time there", "Knotts Berry Farm is a nice trip. Over 40 rides that teenagers would really like. W\nMy wife and I don't do rides, but they had some cute shows with a Wild West theme. Nice museum. Good day trip and you have to eat at their chicken restaurant. Huge servings.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Fun", "Parking was kinda far. If you're going when it's busy I recommend getting fast pass. We saved hours waiting in line. Well worth the extra money. One thing that bothered me was ( not the parks fault ) there were a lot of guests taking advantage of handicapped line. It was clear they were not handicapped. Even heard a family bragging how they rent a wheelchair so they can store their belongings and get on rides quicker. Kinda sad. Nice change from Disneyland. Would visit again in the near future.\nShow less"], ["Reviewed September 4, 2017", 2.0, "Nott Berry Impressed :-(", "Many rides stopped working after hours in line. In desperate need of Investment and modernisation.\n\nOrganisation was poor, we really felt that if a single rider policy was adhered to then waiting times would be greatly reduced.\n\nLots of trash in public areas but once we were on the attractions they were pretty good... And it's way cheaper than Disney!\nShow less"], ["Reviewed September 2, 2017", 5.0, "Visit again", "My family is/was a Disney fan until going to this park. We went early in the morning and had the time of our life. Rides were not busy, walking around the park was a breeze not overcrowded, no running into people, no expensive ticket to get in. In fact better rides then Disney.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Loved it", "Visited with our 2 boys 8 & 10 and we had the best day. No long line up's, plenty of shade, a refreshing chance from Disney. The rides are great for the 8+ age group. You can get great packages with accom at knotts berry farm hotel and get the added benefit of snoopy tucking you in at night it was so cool\nShow less"], ["Reviewed August 31, 2017", 5.0, "Great Family Place", "We LOVE this place. So much so that we make the trip from northern California down south every chance we get. Great family atmosphere, great service, great people."], ["Reviewed August 31, 2017", 5.0, "A level up in intensity from Diseny", "Lots of fun for families with teens. Still love Montezuma's Revenge--went on it over twenty years ago and it's still fun! Lots of food choices, got our pic taken with Snoopy, some very chill rides for little ones and Camp Snoopy, and then for older teens some thrill rides. Are the lines long on the big thrill rides--yep--but it's summer and they have an awesome wooden roller coaster! Some older rides had very short lines and they were still fun. Overspent at Johnny Rocket's for lunch, but it was nice to get out of the sun and sit and eat something substantial.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Loved It!", "The log ride and the Jaguar had seats that were too low for me to comfortably get in or out. Everything else was great."], ["Reviewed August 30, 2017", 4.0, "Roller coasters!", "We went off season and there were barely any visitors to the park. We walked on to every ride and after about 7 roller coaster rides (sitting wherever we wanted on the ride!) we had to take a break because we were sick! I loved this place. Also buy some berry preserves while you are there.\nShow less"], ["Reviewed August 30, 2017", 3.0, "Park day.", "Had a great time . Some of the major rides were down which was disappointing. There were no lines which was very nice. We saw the park and rode the rides in about 6 hours. I would reccomend for a day."], ["Reviewed August 30, 2017", 5.0, "Very nice amusement park", "Visited 8-26-17. Pleasant visit. Park was nice. Love the set up with the old time town and old school house and the interactive skits that are played out with back in the day characters. Very nice. Stayed all day. Husband and grandkids had a ball. Definitely recommend.\nShow less"], ["Reviewed August 29, 2017", 3.0, "Glorified funfair with good theming", "Was hugely disappointed in this park, since I travelled from the U.K, 2 main rides were down with no mention why. Lady at guest relations didn't care. Park areas look worn and tired. Ride operations painfully slow, no point in extending opening hours, only to use one car on popular rides. GhostRider is slightly redeeming but again, slow operations were a let down. I was told whilst there it was a quiet time to go and yet I cannot imagine how much worse a busy visit would have been!\nKnott's theming is cute and I liked that along with the delicious boysenberry and market shops area. I think the newly added ride next year will add a dimension the park needs as it is fairly underwhelming ride wise now- though I missed out on 2 roller coasters as I stated above, so I cannot speak for those. Silver bullet looked like it could be fun but was very tame.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Fun amusement park for all ages", "There were so many rides for different age groups. We were able to go in early with the tickets with early entry benefits. Loved Ghost Rider!"], ["Reviewed August 28, 2017", 5.0, "the kids say - its the best", "We brought our two grand kids for a day (as it was their request) before return for another school year. We were there just before the gates opened and before they did open we sang \"Star spangled Banner\" which was really cool and touching. The first ride was the Ghost Rider, the kids loved it, the grand parents got a shock of their life. But as they went from one ride to another they just loved it. Ghost town was original with its shows specially the Indian story, the old western town, the town hall and sheriff's office show. The mine and the stage coach and the train was such a great experience for the kids and the grandparents. Also a learning experience.\nShow less"], ["Reviewed August 28, 2017", 5.0, "A Great Day Out!", "There's something I really love about this place.\nIt's not the same sugar-coated, marketing-heavy experience as you get at Disneyland; this place feels far more relaxed; while at the same time, the rides are more extreme. It's a strange dichotomy, but I absolutely love this place.\nWe've been here twice now and we all have a great time. My teenage boys love the rides, because there are so many thrilling ones. Me and my wife love it here, because there's plenty to see and learn.\nMy elderly Dad LOVES it here, intermingled with the modern thrill-rides, is a really laid-back wild-west town where he can soak up the John Wayne atmosphere.\nThe park staff are REALLY nice and helpful, and the people manning the old western town attractions (blacksmith etc) are very generous with their time and knowledgeable about their craft.\nIt's a real treat.\nYou can comfortably see the whole park in a day, which is extremely satisfying.\n\nOh, and they have a restaurant in there called Mrs Knotts Chicken Dinner, where I had the best burger I have ever tasted, anywhere.\nWorth the entry price on its own in my opinion!\n\nOne word of caution: pay attention to the ride ratings, particularly if you have little kids or elderly with you... extreme is extreme and not for the faint hearted. The Xcelerator ride takes off fast enough to create a doppler effect from the people screaming!\nShow less"], ["Reviewed August 27, 2017", 5.0, "Lot's of fun at Knotts!", "My wife wanted our son and I to see Knott's Berry Farm! She had been many times as a young girl with her Grand Parents. So we headed our to spend the day - we really enjoyed the park - best part was that we visited right after all the California schools went back to school!\n\nWe enjoyed the rides, and the games. The park was very clean, and all the staff was friendly and helpful!\n\nTip - by tickets on line! You can get them for $48 - instead of $70 at the gate! This makes it a very nice outing that is not as expensive for the day as the other parks in the LA area.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Very nice hotel and park", "The hotel is very friendly and good room. Is not new. It is clean and beautiful. The knoot park is very nice small but cute. We are loving spend our days here."], ["Reviewed August 26, 2017", 5.0, "An ORIGINAL Theme Park Experience", "My boys were thrilled to be able to ride a wooden roller coaster. We all loved Knotts Berry Farm, as the rides had originality. There were no crowds and rides were basically queue free."], ["Reviewed August 24, 2017", 5.0, "Very nice", "If you are in vacation with your family. This is you place. Perfect for family to have fun and great time with the little ones. Great prices. They have a lot of stuff to eat inside. I'm looking forward to visit."], ["Reviewed August 24, 2017", 5.0, "Awesome Experience", "We bought the Go La Pass so this was one of our options. We spent a couple days in LA and we were going to use our 3rd day at LegoLand which was only 8 miles from where we were staying. I'm glad we still had this as an option to fall back on. I thought my kids would enjoy LegoLand but I think they were a little too old for it. We drove the hour or so drive here and we were so happy we did. The park wasn't very busy at all (I think the kids in that area were back in school). the waits were only 5-10 minutes or less! My kids often got off and got right back on. We bought a drink cup and every time we got it refilled the employees were very friendly!\nShow less"], ["Reviewed August 21, 2017", 2.0, "Old Theme Park", "I had fond memories of this park as a child. Returning to visit again was nostalgic, but a let down. The park itself looks old. In general amusement parks are for children, but there was nothing terribly original about the park. The same old rides you can see anyplace, the shows are stale and there is no \"wow\" factor. The park itself is overpriced and the parking is outrageous at $18 or $23 for a day. I expect to pay something extra for something nice, but this is expensive without really delivering anything memorable.\nShow less"], ["Reviewed August 17, 2017", 3.0, "OK Not Great", "Waited in line for over 35 minutes to ride Ghost Rider and finally left as it wasn't moving. There were lots of children 5 years and under as the kiddy part is quite large. Also quite a few roller coasters. Not much else. Book on line and pay $45 instead of $70 at the gate.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Want Coasters...This is your PLACE!", "My son, 18 years old if off to college and Daughter 16 years old back in High School next week. Before they both go back to school I asked what they wanted to do for fun before school starts. Both wanted Knotts Berry Farm! They love the roller coasters and had a blast! The only problem is that we couldn't afford the $60.00 each for front of line tickets and they didn't get as many rides as they wanted. If you go I strongly recommend front of line passes but the cost is crazy!\nShow less"], ["Reviewed August 17, 2017", 5.0, "Great boutiques!", "I found all kinds of little gifts there. I mostly loved wallking around and checking out the boutiques. I got some great tea from one of the shops. Should have bought more! But a bit expisive for one can 14,99$"], ["Reviewed August 16, 2017", 4.0, "Must visit", "Its a very nice park. Not so expensive to go in. There is a verity of games inside. I played the roll-costars they are very exciting and amusing. Also there is verity of food inside. I can definitely say its a day well spend"], ["Reviewed August 16, 2017", 5.0, "Better than Disney - shhhhhhhh", "So much better than the others. Short fast lines. Not crowded at all. Cool rides for all ages. Also better than Legoland which doesn't cater enough to smaller children. But go to other places. Leave this place for the loyalists that enjoy this park for all it offers.\nShow less"], ["Reviewed August 16, 2017", 3.0, "Ok but nothing special", "We were on a trip this area and wanted to do something differvent to Disney and universal and came across knotts berry. On line booking was good. Signs to get there not good but when we got into the park we were initally optimistic. One of the bigame rides was not operating and none of the food outlets opened till 11 am so we could not get breakfast. We did what we wanted and saw what we wacted. I think it's better suited to families with smaller children.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Wow!!!! Disney- smisney!!", "So impressed with this park!! It was so easy to get around, it was impeccably clean, and the best part- there were hardly any lines!!!! We loved the camp snoopy theatrical show- so very cute!! The rides were great for young (and cautious) children and the characters were so sweet to meet!\nShow less"], ["Reviewed August 13, 2017", 3.0, "Not a big fan of Knott's Berry Farm...", "I am not a big fan of Knott's Berry Farm... not sure what it is but have never liked it. Typically I point out of town visitors to the touristy places and should have again this time..."], ["Reviewed August 12, 2017", 5.0, "Excellent park", "We were lucky and didn't have to queue for long on the rides. Has a great mix of adrenaline rush tides , character attractions , shows and games . Kids and adults loved it . We used the go la card pass as it's great value if u are spending a few days in California\nShow less"], ["Reviewed August 12, 2017", 5.0, "Best day ever", "A wonderfully simple park with a human touch that bigger parks can't recreate. We were fortunate enough to have a slower day and the staff gave our whole family preferred treatment."], ["Reviewed August 12, 2017", 5.0, "Fantastic Theme Park", "I have nothing bad to say about Knott's Berry Farm. We booked tickets through Expedia before leaving the UK for half the price of gate prices. It was worth every penny. The rides were fantastic and my 2 teenagers had a fab day. The queues for some of the bigger rides were approximately 1 hour but overall waiting time was good - 15mins - 1 hour. The only disappointed was one of the major rides was closed. Food on site was reasonable and we got 2 refillable bottles which were well worth the money if you stay for a full day. I would highly recommend this theme park with teenagers. We chose this over Disneyland as so much cheaper and teenagers no longer into 'Mickey Mouse'.\nShow less"], ["Reviewed August 11, 2017", 2.0, "A Hot Mess", "Firstly, this park is HOT and there is very little shade to be found. I found at Universal Orlando they shaded entire lines whereas here you roasted in their extremely slow moving lines. Secondly, their organization is also a mess. This had to be one of the most inefficient parks I've been to. Where Disney and Univerisal move things along as fast as possible this place doesn't seem to have any motivation to move lines along. Only one cart is ever going at a time. Also there were 2 rides that were closed all day and 2 rides that were open but then broke down more than once. You may find enough to do here they do have a variety of rides, but you get what you pay for. The shows that I watched were pretty lame definitely not like Disney or Universal. P.s. if you do decide to go here, get the discount coupons at Carl's Jr. The coupon saves you 25 to 30 dollars!\nShow less"], ["Reviewed August 11, 2017", 2.0, "Not at all impressed", "Let me start off by saying that if I had to find one positive thing about this park it would be the theming. They did that pretty well. It's all downhill from here.\n\nConsidering there are three major theme parks in the area, I expected this park to at least try to act as some healthy competition. First, parking was a disaster. The parking lot is about the size of a large shopping mall. Not nearly what I would have expected for an amusement park of this size.\n\nI was happy to see no line at all to enter the park. It was a hot day. I quickly made my way to the Sierra Sidewinder. This park seems to provide very little shaded area for riders while waiting in line. While that's bad enough, I'm not sure I've ever been in a park that has slower ride operators in terms of loading and unloading. I'm all for safety, but I'm not saying they were being particulary safe, they were just SLOW. I'm a season passholder at Six Flags (New Jersey) and have visited there about 15 times in the last year. I have also been to many other theme parks in my lifetime, including Universal and Disneyland in the last week and Dorney Park and Hersherypark in the last year. Knotts has by far the slowest ride operators I've ever encountered (read ahead).\n\nAfter riding the Sierra Sidewinder, which is a decent ride, we made our way over to the Xcelerator, which was closed. Now, it would have been nice to know that before I paid $18 to park or before I entered the park.\n\nMy husband and daughter then went to ride the Coast Rider, what appeared to have a relatively short wait but was also operated painfully slow for no apparent reason.\n\nWhile they waited for way longer than they should have, my other daughter and I grabbed a drink and sat at a table across from the soccer style carnival game near Xcelerator. We watched as the employee operating that game grew increasingly frustrated as he requested a battery for his microphone pack from the other employee(s)/his boss (golf shirt?) operating the adjacent game but did not receive one. He also made several comments to guests in the microphone that he \"only had two balls left\" and that they were \"the best he had\". I could tell by what he was saying that participants in the game were complaining about the soccer balls. The game operator was being quite rude to participants telling them the balls were \"just fine\" and that they were \"blown up enough\". Instead of using the automatic launcher to roll the balls to participants, the operator was rolling the balls to participants himself. He was rolling them very fast and with a bounce. People were complaining about the delivery and rightfully so. He kept interrupting people as they spoke, laughing off their complaints, and being generally dismissive. One man got so angry that on his last turn, he lost his cool and kicked the ball over the fence behind the soccer backstop. Now, not cool, but the game operator was being very rude and not in a joking/heckling way. But here's the worst part...the game operator says...IN THE MICROPHONE....\"eff off\" to the guy as he's walking away...as the game operator's boss is standing right there! Unbelievable!\n\nAs soon as the \"boss\" retrieved the ball that had been kicked, he also \"found\" a whole stash of brand new balls that were now being launched from the automatic launcher. Of the four people I watched play with the brand new balls, while I was still waiting for my husband and daughter, three out of four walked away as winners. Totally unfair to all of the people that had to kick the old balls that were \"pitched\" by the game operator...all of whom walked away as losers.\n\nAs soon as my husband and daughter came off of the ride we left the park. It's bad enough that the game operator acted inappropriately, but the fact that his boss condoned his behavior is completely unacceptable.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Loved the Ghost Town Alive show", "I remember going to Knott's Berry Farm as a kid and thinking it was neat, but not great. I went back recently and wow, have things changed for the better! We spent about six out of the seven hours we were in the park watching the wild west stunt show (which was awesome), the train bandits (which was pretty much the opposite of awesome) and the entire drama unfolding all day through little staged events in the Ghost Town (which was tons of fun!). Being involved with the little town of Calico was just adorable, watching the gang try to reclaim the rights to the town and the Sheriff working to keep order, and all the little \"side missions\" you could do just made the whole experience so much better than just a series of pat, staged shows. I look forward to coming back again and again if they keep improving like this.\nShow less"]]}}