{"La Brea Tar Pits and Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "La Brea Tar Pits and Museum", "url": "/Attraction_Review-g32655-d143830-Reviews-La_Brea_Tar_Pits_and_Museum-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/17/07/58/page-museum-next-to-tar.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2584"}, "address": {"@type": "PostalAddress", "streetAddress": "5801 Wilshire Blvd", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90036-4539", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Well curated, surprise in the city", "We spent a pleasant couple of hours in the heart of LA exploring this natural phenomena. Knowledgable guides and good exhibits made understanding easy. A few of the exhibits are a bit dated (the Saturn V rocket is no longer cutting-edge), but the ongoing research is interesting.\nShow less"], ["Reviewed 5 days ago", 5.0, "Way better than I expected!", "If you're \"stuck\" on what to do in LA, go to La Brea Tarpits! It was awesome! We loved walking around the working museum, and all the skeletons were awesome to see!"], ["Reviewed 6 days ago", 5.0, "Enjoyed the Tar Pits, the museum was amazing!", "This was different from what I expected. I expected to see bubbling tar pits but instead they are more like puddles of tar and in some cases appear dormant. However, it was no less interesting and reading about the geological history and evolution was very informative. There are tours available, though there are easy to read and follow explanations at each exhibit. I did find the museum to be particularly interesting. The exhibits of reconstructed prehistoric life were fascinating. These included dinosaurs, birds and fore runners of some of today's fauna. Each accompanied with its information and history. One of the particular points of interest is the time line which denotes the place in time of life and extinction for each of the species. All in all less then two hours is needed, $15. to park and $15. to enter. There is a gift shop worth stopping in as you leave. \nShow less"], ["Reviewed 1 week ago", 5.0, "Very Unique", "We have visited in the past including the museum, which is somewhat pricey but worth it. But you can visit all the sites outside the museum for free, which we did this most recent time because we didn't have the grandkids in tow."], ["Reviewed 1 week ago", 4.0, "Worth a visit.", "The park is free and the museum is a bit expensive. These famous pits are a very famous and quite a curiosity in the middle of the city. Worth a trip."], ["Reviewed 1 week ago", 3.0, "An interesting place", "We visited on a Saturday afternoon and it wasn't too crowded. The young man you was our cashier was very friendly and full of info. The movie was very interesting. A nice, quite place in the middle of L.A."], ["Reviewed 1 week ago", 5.0, "Fascinating— pleased that we invested the time!", "On vacation in LA visiting our son and his wife. Like 4 “kids”, we enthusiastically absorbed the well presented displays and exhibits. You walk away with a deep appreciation for the foresight involved over 100 years in protecting and advancing the research at this prehistoric dig site —smack in the middle of LA.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Been wanting to go here for 40 years", "This is not highbrow...definitely aimed toward the student crowd. Nevertheless the entire experience is not to be missed."], ["Reviewed 2 weeks ago", 5.0, "Excellent. Trip", "This was an amazing trip. We did the 3D cinema tour then went on the free tour to learn more about the bones found in the oil pits of the animals,such as the woolly mammoth and the sabre toothed tiger after theIce Age. If you are interested in this you will find it fascinating. More so the pit outside, where it demonstrates how the ashphalt and methane gas can erupt into pools. The artefacts are also well displayed in the Museum. Worth a visit. There is a shop and toilets, but no cafe. Also if you like art galleries there is one next door.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Cool, informative", "I had lived in LA a long time and it was only on a recent return visit that I discovered the museum portion of the La Brea Tar Pits. It was great. The exhibits were highly educational, and I enjoyed learning about the history of this area and development of the museum itself. In its own way, its very specific to California and specific period of time when the Tar Pits existed - it makes it unique and not your sisal hue overview of prehistory. I also enjoyed watching the researchers sift through \"micro bones\" on the other side of a glass research area. Probably the 3D movie is fun too, but I didn't want to add on to the cost of admission.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "museum", "totally a place to see. Very interesting and so much history! Glad we went. It was a rainy day but that didn't matter."], ["Reviewed 3 weeks ago", 4.0, "Interesting historical site", "The La Brea Tar Pits was one of the things on our list to see while in CA and we were not disappointed. Amazing how many skeletons they have found since they started excavating. The museum is arranged in a very interesting manner and the talks very informative. Definitely a historic site not to be missed.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Has not Changed in a Decade, but unique place to visit", "I love the saber tooth cat and the la brea tar pits. I returned after going there as a school kid and found everything to be the same. For those who do not wish to pay for admission to the museum, the outside section is free. You can smell and see real tar pits and a fossil dig location. Even if a quick stop there is some metered parking in back. If going to LACM it is next door - visit.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Gloop gloop gloop", "I enjoy comming here, its history on many levels, how nature can do this as well as it still is active n such a built up area is amazing, free parking out on the streets i think but we paid Relax and bring a picnic"], ["Reviewed 3 weeks ago", 5.0, "One of the Best Attactions in LA", "The Tar Pits are located on Wilshire Blvd. in the heart of LA. Hard to imagine dinosaurs roaming this area, but they did. The tar pits still exist in the park that surrounds the museum. The pits are still under active excavation. In the museum you can see complete skeletons, animated displays and workers cleaning and restoring bones. There is paid parking, but we luckily found free parking on the street.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Interesting and you smell the tar!", "This is a very interesting and educational place. You actually do see the tar bits bubbling , and you can even smell it nearby."], ["Reviewed 4 weeks ago", 5.0, "Great place to spend a few hours", "Great Museum, great displays. Very informative visit. The car park is $15 for the day. Entry to the museum is $15 per person. The tar pits themselves are free. The park would be a great place for a picnic but we took the 15min walk to the farmers market for a great lunch.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Small but informative", "Not bad museum, but don't expect anything spectacular. My kids were kind of disappointed with it. Lots of gooey tar pits with gasses bubbling up from the tar constantly. You can see a few open excavations where paleontologists are still working 90+ years after the initial discovery, hang out by a pond that bubbles ferociously as methane and tar rise to the surface. There are flags in place highlighting specific bones that the paleontologists are digging up. A guide will explain to you what type of bone and animal it pertained to. My favorites were the ground sloth, ancient bison, mammoth and dire wolves. There are also nice fossils of the sabre-toothed cat, american lion, and mastadon. It is a small, but informative museum.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Must See", "What a cool museum. When we first got out of our car we could smell the tar and we knew we were in the Tar Pits. It set the stage for our visit. We enjoyed the museum here with lots of fossils, displays and explanation. The mammoth is truly mammoth: stand beneath its huge tusks and look up. Check out the Fossil Lab and watch the trained volunteers separate its bitsy fossils like insect fossils from the dirt and sand that they were in. Also, in the tar display, try to pull the metal rod out of the tar - it's tough and you then can see why huge animals like the mammoth could get caught in it.\nBut the best part is the tour of the grounds to see the tar still oozing out of the ground. Here is an open pit that is being worked in the summer and fossils are still being pulled out of it. Then there are the huge crates of material that they took out of the ground when the parking lot for the LACMA was being built. What a treasure trove of fossils.\nI've always wanted to see the La Brea Tar Pits and this visit exceeded my expectations.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "One of the requirements for visiting LA", "This unique place is a great day of any LA trip. Walk the grounds and absorb the aromas - you can imagine the scene with live animals trapped."], ["Reviewed January 23, 2018", 5.0, "Adored this place!", "Add this to your MUST do list in LA! As an archaeology addict, this place was on my list from the get go - and it exceeded my expectations. Exceptionally well run, it provides a great experience - you're in the middle of LA, surrounded by the modern world, but at the Tar Pits you are pulled back in time. From the still active pits, to the well laid-out and interactive exhibits in the museum - I could've spent all day there easily! If you were like my dad & sister (not so much archaeology addicts), it can also be done well in a couple of hours. You can also view the live digs going on at the site - the density of fossils found, and still being excavated, is mind-boggling. Souvenir shop is decent as well. There's nice, secure parking on site - can't remember if you had to pay, but if we did, it was minimal. If I ever return to LA, I will definitely make a return trip here.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Interesting bit of history in the heart of the city", "Visited here with the 11 year old and 8 year old and thought it was great. The air conditioned modern museum was a great escape from the heat. Their are open oozing tar pits in the parkland. Good way to spend a few hours and reasonably priced.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Loved it!", "I was amazed by the whole thing! It's right in the city but does not feel like it at all. The sheer number of animals etc that have been trapped by these pits is overwhelming!"], ["Reviewed January 22, 2018", 4.0, "Interesting inside and out", "We saw the 25 minute film first, which gave you a nice overview of what the museum and pits were all about. The museum had some great displays of skeletal remains that were found in the pits...mastodons, mammoths, saber tooth cats, sloths... plus a demonstration of how these creatures got sucked into the tar (asphalt) and couldn’t get out.\n\nOutside, you can visits some of the pits that are still being worked. There is one that is a display only that shows the remains of many creatures just piled on top of each other.\n\nI found it all very interesting.\nShow less"], ["Reviewed January 21, 2018", 4.0, "You can see a lot without even going inside", "Though the museum is well worth the entrance fee, as it contains the reconstructed remains of the many giant animals that died in the pits, even just walking the grounds is quite interesting. There are displays at several open pits as well as interpretive signs and sometimes you can see active excavation at work.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Very Interesting!", "Visiting the LA area on a business trip and decided to check out some of the LA offerings. Wow what an interesting and educational place. Admission during the weekdays is $15.00 and a 3D movie was an extra $5.00. Totally worth all of it! The only negative was the smell of tar while walking around was pretty strong but faired way better than the animals did hundreds/thousands of years ago! Wish I would have had my family with me to enjoy it as well. Highly recommend this place!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Not enough time .....", "I love this stuff but due to the incompetence of the hop on hop off bus I only had 45 minutes and the very informative 3D film was 25 minutes so not much time to do this amazing place and the dedicated scientific researches justice.\nVisitors can watch what is done with the finds via the glass bowl they work in.\nThe displays are excellent even though I could just walk by.\nGive yourself loads of time you will not regret it.\n\n\nShow less"], ["Reviewed January 17, 2018", 5.0, "Do not miss it!!", "Extraordinary museum and research center, which had been recommended by friends, and indeed it did not disappoint !! Beautiful and comprehensive lay out. Very knowledgeable and helpful staff."], ["Reviewed January 17, 2018", 5.0, "Great experience", "I went here with a friend and spent about two hours at the museum and the grounds. I recommend the 3D movie! It provided great context for the exhibits. Make time to check this out! It's unlike anything else in LA."], ["Reviewed January 17, 2018", 5.0, "Fascinating museum and attraction", "Great attraction for adults and kids alike, with lots of interaction. You see the tar pits outside without having to pay anything but would recommend paying the reasonable entrance fee to see the museum and all the artefacts. There is a great souvenir shop and there are good toilet facilities. You can get a coffee but could be improved with a proper cafe. However there are plenty of places to eat around the attraction.\nShow less"], ["Reviewed January 16, 2018", 2.0, "Nothing special", "Outdoor exhibits are not particularly interesting but if you are at LA MOCA its worth the walk through."], ["Reviewed January 14, 2018", 4.0, "Natural History in the middle of the city", "Wow - I had no idea that prehistoric wonders are so easily accessible. Right next to the grounds of LACMA is a wonderland of still bubbling tar pits. The didactic materials at the pits and the directional signage are so helpful and fascinating. The museum itself was closed when we visited but we enjoyed wandering through the grounds just imagining them before a city was built around it. There is an adjacent parking lot for $15, but there is sometimes street parking off Wilshire. Museum admission would be an additional cost. There is an interesting Pleistocene plant garden and a great view from the plaza atop the museum, where you can also look down into a rainforest-like exhibit even when the museum is closed. This would be a great spot for kids to run off steam, as there are sloping hills and curving pathways.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Inexpensive and Interesting Place To Visit", "Visited this place with family. We had a fine time and learned a lot. Very interesting museum. The exhibits are first rate. Is not expensive and does not take long to see. Plenty of parking."], ["Reviewed January 11, 2018", 3.0, "Good, but pricey and bad location.", "The tar pits themselves are fascinating. The museum is cool, too. They do a good job and the things they've found in those pits will amaze you. I've docked a couple of stars for bad location and price. I realize the tar pits are where they are and there's not a thing anyone can do about it! But they are still a bit of a pain to get to. Traffic is always thick in L.A. and streets a bit narrow. Not their fault, but still took away from the experience. Price was a bit steep for what it is. It's $15 just to park! Then it was an additional $76 for museum entrance and 3-D movie for family of 5. So $100 total for what ends up being about a 2 hour thing. Kind of steep in my book. We saw a lot of groups of elementary age school kids there on tours. I couldn't help but feel like we were subsidizing quite a few things by paying our high entrance fees. If you're a huge nature/history buff, it's worth it. If not, you might want to pass on this.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Interesting", "We stopped by while on our way to dinner. About $15 per adult. We were told it would take 30' to visit it - which was all the time we had. It took us 20' to see pretty much all with sufficient pauses. The potential is there for a superb museum worth $30 for 2 adults, but it needs renovation and expansion.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Interesting", "Very well done. Unique place. Much better than expected. Beautiful grounds and museum. The pits themselves were well presented and explained"], ["Reviewed January 9, 2018", 3.0, "Informative", "The pits are in a nice park like setting. There are paved sidewalks and signs all around the outdoor area that you could access for free. The museum we thought was a bit pricey for what little was in there but we understand it also funds the pits themselves to preserve them. The coolest part was seeing the big crates of asphalt pulled from pits nearby that were being cleared to put in a structure. The excavation of one create showed a little bit about how they remove the bones. We liked that we could see the scientists inside the museum cleaning bones found in the excavations. This was an informative visit and we were glad we stopped to see it.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Probably our favorite thing we did in LA.....", "Absolutely fascinating and so sad. The fact that they are still excavating and finding fossils is incredible in itself. Displays in the museum are nice w/ a lot of docents helping to explain things--mainly for children but will take the time to answer questions fr/ adults. Wandering the grounds is amazing and seeing one of the pits \"up close and personal\" is well worth the admission.\nThe only real issue we had was w/ parking. Those in charge of the parking lot randomly choose to close it when they feel like it whether there are a dozen spots available or not so we circled twice and finally forced them to open the lot b/c we could see spaces open. The lame explanation given was that they had limited parking and did not want to over burden the lot (if a giant parking complex downtown can keep up w/ how many spaces are open then I would think a surface lot of about 100 spaces could figure out how to do it). Even a sign at the entrance that spaces were open at the LACMA complex would be helpful but instead just cones across the entrance and people waving you away. If you can find a place to park then by all means visit.\nShow less"], ["Reviewed January 7, 2018", 3.0, "Ok", "A must see when in LA, but the outdoor tar pits leave a bit to be desired, not quiet like in the movies, some great exhibits in the museum. Have a walk around for free and then decide if you want to pay to go in.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Amazing Place", "I've been to LA a number of times over the years. This time visited the La Brea Tar Pits and Museum. Incredibly fascinating place. The museum is comprehensive and informative. You can walk around the grounds for free - and there's a lot to see. I highly recommend it, especially for families.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Great Visit!", "La Brea Tar Pits was a great time for our family (kids are 4 and 7). There is a great 3D movie that sets the stage for the rest of the visit and the museum is very approachable for young and old. Our visit last just about two hours, including the movie, walking the museum, and visiting various outdoor stops including Project 23 and the Observation Pit.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Beautiful and educational", "We really enjoyed this museum, the collection was really educational and beautifully displayed. There was a tar lake and green space outside of the museum to walk around and explore. However, street parking was difficult - we were in a time crunch, so bit the bullet and paid $15 to park in the nearby lot for one hour.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Great 1/2 Day Park", "Wonderful park that you can either do on your own or with a docent guide. Loved seeing the excavation sites and learning about how they excavate that area. The museum was also nice, but enjoyed the excavation sites more. Worth the visit and there are some restaurants next to the museum in case you want to do lunch.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Fantastic To Visit", "While on tour of LA several summers ago, I slipped away from the Tour & took a personal trip to \"La Brea Tar Pits\". As a former Biology Teacher, I was fascinated to actually be where I taught about in so lesson plans. Because I only had a short time before I had to re-join the main Tour Group, I didn't get to see everything. The fossils included Sabertooth Cats, Dire Wolves, Bison, Horses, and a nearly intact Mammoth Skeleton plus many more. The fossils date back as old as 35,000 to 40,000 years ago. I hope to get back for a longer visit sometime in the future. Anyone interested in science or with any type of brain needs to see this exhibit when visiting Los Angeles.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Great place!", "Interesting, fun, beautiful location, great staff. We had a great time and learned a lot. This is well worth the time and the money."], ["Reviewed January 3, 2018", 4.0, "Good place to take your kids and explore", "Seemed to me that there was plenty of interactive displays and things to see for kids as well as the parents. Tar pit was not what I expected but was still interesting to see. Volunteers were knowledgeable and helpful. Recommend buying tickets in advance to save some time waiting in line to get in. Parking garage next to the tar pits was handy.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Worth a Visit", "We didn’t go into the museum, however just walking around the park was great. It is free just walk the grounds and it amazing to see the tar pits and read the stories on what they have found. Certainly worth a visit if you are looking to fill in a couple of hours.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Attraction unique to Los Angeles. Take the tour!", "Only four locations in the USA have tar pits, and this is the only one accessible from a city. If you've never been before, take the 25 minute excavator's tour, where a guide will show you the important spots on the site, as well as NEW tar formations as the area is constantly changing. Admission only required to the museum, so only pay if you wish to tour the exhibits. The museum is not large, but does have some great examples of the skeletons of extinct animals pulled from the tar pits. Good for a couple hours visit. If you bring little ones, make sure they do not touch the extremely sticky tar slowly oozing from the ground in different spots of the park.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Awesome experience", "A piece of history and lot to learn. Excellent if you interested in fossils and paleontology. Do plan ahead about parking. Roadside at the back is also good option , $1.75 for 4 hours"], ["Reviewed January 3, 2018", 5.0, "THis is real.......... So cool", "So i saw the tar pits in a movie and thought oh it's cool it's a hollywood set. WRONG. this is real and it's so cool. The history behind it is also worth the tour. Take it all in."], ["Reviewed January 1, 2018", 4.0, "Poor Cousin", "We were looking for something to do and happened upon the tar pits which are just near the Farmers Market. With the obvious money spent on the Art Museum next door, it's obvious the Historical Tar Pits don't get the same love. It was interesting to walk around, but after getting slugged $12 to park, we decided not to go another $72 ($12 each) to go into what looked like a pretty small museum. What we did see was good but would've been obviously enhanced with museum entrance.\nShow less"], ["Reviewed January 1, 2018", 4.0, "pretty interesting but small", "Just looking for something to do we never did, and this fit the bill. Was an interesting area with lots of cool small exhibits, and a nice walk around the park. Park is free, exhibits are not. Not sure the price is worth thte small amount of exhibits, but i guess it is worth doing once.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Interesting Displays", "The tar pits and museum were very interesting. It is amazing what they have found in the tar. The museum had some good exhibits highlighting the extinct wildlife which roamed the area. I recommend a visit,"], ["Reviewed December 30, 2017", 4.0, "Very interesting displays", "Interesting things to see, inside and out. We were there 2 hours , still didn't see everything. We liked the timeline that showed when animals were flourishing and when they went extinct."], ["Reviewed December 29, 2017", 5.0, "Great place!", "I’ve always wanted to visit this place. We arrived just before the last Excavator Tour started but chose not to join it since we did not have a lot of a time. It would probably have been more informative. You can actually walk around the park and see everything except the Observation Pit without paying the entrance fee but you would miss out on everything inside the museum.\n\nThe parking lot was full so we parked in the LACMA underground parking which was perfect on a hot day.\n\nHighly recommend going!\nShow less"], ["Reviewed December 27, 2017", 4.0, "Good time!", "We really enjoyed this stop! It took us almost 2 hrs as 30 min was spent seeing the 3-d movie. It was interesting and very well laid out. We did street parking (way cheaper)."], ["Reviewed December 22, 2017", 5.0, "History frozen in time (and tar)", "This was my second visit to La Brea Tar Pits- the first being on my last visit to LA some 33years ago after seeing a David Attenborough programme about them.\n\nThis place is simply unique in the quality of the preservation of the animals and plants that got entombed in the tar (actually, it’s asphalt or bitumen, not tar which is a man made substance). Here you can learn in intricate detail what beasts, birds and insects roamed the area long before man. You can even watch scientists unpicking bones in a round glass sided lab, and join tours explaining in even greater detail how the Tar Pits came about and their relevance and ongoing work today.\n\nI highly recommend a half day visit to this amazing attraction.\nShow less"], ["Reviewed December 21, 2017", 4.0, "You Have to Make This Fun", "Took a school party to this venue. The dinosaurs are fun, the kids may well get tar on their clothes and the exhibits are interesting but the docents are weary. Seemingly no interest in children and no idea how to engage or make learning fun. What a dour bunch. It is worth a visit.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Must See For Everyone at Least Once.", "The La Brea Tar Pits are such a big part of the history of California. This is a comprehensive history lesson both interactive and entertaining, for kids and adults. It's a bit old school in its presentation (kids used to computers may find some of the exhibits quaint) but after you've visited you will have a complete understanding of the history of dinosaurs in California. It's a wonderful place to visit, and to bring kids.\nShow less"], ["Reviewed December 20, 2017", 5.0, "La Brea Tar Pits and Museum", "This museum is also an active site for retrieving Dinosaur bones from the Tar Pits located on the same site as the museum. This is always worth a visit. It is located right next to LACMA art museum."], ["Reviewed December 19, 2017", 5.0, "Incredible insight into the past", "This place surely encompasses a great vision into the past. The exhibits definitely give overwhelming evidence of a world wide flood as recorded in the Bible. Nothing else could've so suddenly trapped and preserved the structures found here. I would recommend to visit this place with an open mind to knowledge.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Where else can you touch something from 33000 years ago.", "This isn't a hyped up tourist attraction so if that is what you are looking for this is not the place for you. If you want to see anthropologists in action and learn about dinosaurs, see tar bubbling from the earth and tons of other cool things it is a must do. The cost was 12 for adults and 5 for children and it took about 2 hours before the 7 and 9 year old that where with us wanted to go. We all really enjoyed our visit and would probably stop again if ever in LA\nShow less"], ["Reviewed December 16, 2017", 5.0, "FASCINATING INSIGHT", "This site offers a great chance to learn about tar pits, including the animals that were trapped in them - notably mammoths. It's a pleasant and educational experience."], ["Reviewed December 15, 2017", 3.0, "small but interesting", "interesting place but every small but work a look just to see what they have found int he tar pits.. the lab is interesting to view just wish i had more time to view the cinema in there"], ["Reviewed December 15, 2017", 3.0, "Not Bad But Not Great Either", "We enjoyed La Brea but I wouldn't say it was a highlight of our time in L.A. or anything.\nIt is pretty unique to see literal pools of tar in the middle of a modern city centre. And the interpretative centre is not bad at all. It's worth a visit and you do learn a lot about the ancient history and geology of the site.\nWorth doing if you're in the city centre but in my opinion there are better things to do with your time. I feel I'm bring a bit harsh but you can only call it as you see it or find it.\nShow less"], ["Reviewed December 10, 2017", 4.0, "Good for kids...", "Took the kids to the tar pits on the way back from Beverly Hills. Quite interesting place with a well curated museum. Plenty of skeletons supported by info.\n\nGood parking (costs $12) and you still have to pay for entry (another $12 per adult), but not bad value.\n\nKids loved it.\nShow less"], ["Reviewed December 8, 2017", 4.0, "La brea tar pits LA,CA", "pretty fun to watch and enjoy. kids got bored towards the end though. Lots of sights to see. I thought it was very and enjoyable. Great for family's!!"], ["Reviewed December 7, 2017", 5.0, "Fun Place for kids and grown ups", "On our way to San Diego, we stopped by at the La Brea Tar Pits Museum. Its right in the middle of the city, and erected at the site of pre-historic tar pits from 10,000 - 50,000 years ago. The Sprawling campus has many \"active sites\" - Meaning site from which archeological remains are being dug out on a daily basis.\n\nThe museum has very detailed information about the fauna/flora that existed during that time. They also have couple of informative 3D shows and one where a giant Sabre tooth cat Animatronics model roams around amidst the kids. It was a huge hit with my daughter.\n\nHighly recommended!\nShow less"], ["Reviewed December 6, 2017", 5.0, "Awesome museum", "I visited La Brea tar pits and museum in November and had an amazing time. It was really well worth visiting. Amazing to see the tar still bubbling up gasses. Fantastic place for all ages. Highly recommend a visit. Great price for entry and the 3D movie is a must.\nShow less"], ["Reviewed December 2, 2017", 3.0, "Didn't do the museaum", "For a quick drop in, it's worth seeing the tar pits. We would have benefited to see more in the museum to understand it all but we had limited time, so we dropped by and saw what we could. Pretty cool! I bet the museum would have upped this a bunch!\nShow less"], ["Reviewed November 29, 2017", 5.0, "Fascinating", "Highly recommended for a visit. Entry to the park is free, and it is a nice place to walk around. It's worth paying the entry fee for the museum, and the movie (extra cost) is worth seeing too. It is a great place to visit for the family.\nShow less"], ["Reviewed November 29, 2017", 4.0, "Visit with Wife", "My Wife has always had a fascination with fossils...I decided to take her here during a business trip...She really enjoyed the tour...There are over 5 million fossils that have been excavated to date and the exhibits are interesting and interactive...We had a great time and learned quite a bit...\nShow less"], ["Reviewed November 28, 2017", 5.0, "Who knew tar could be so cool", "This remains one of my favourite places to visit. Reasonable admission price. I recommend paying the additional 5 - for the movie. Good for all ages. Make sure you walk around the park as well."], ["Reviewed November 28, 2017", 4.0, "Nice educational experience", "Took my family and they enjoyed the terriifc living learning experience. The science behind the research was terrific as well.. Worth the trip."], ["Reviewed November 28, 2017", 5.0, "Good mix of exhibits", "There was a good range of exhibits giving good information about what went on in this area for 1000's of years. Entertaining program, but good organization allowing comfortable viewing by 6 of us with no complaints."], ["Reviewed November 28, 2017", 2.0, "Docents were the most interesting part of the museum.", "Enjoyed the docent objects and explanations. It's a small museum, but interesting. Outdoor exhibits is maybe 1/3 of the experience. I had disabled guests visiting with our group who parked in a vehicle accommodating wheelchairs who parked on the street and met us in the museum. Guest mistake was believing street parking was ok until 5 (it was actually 4pm) They were at their vehicle early, about 4:20 only to find their vehicle equipped for wheelchairs was towed. Unfortunately their memory of LA will be overshadowed with the panic of finding what tow yard it wound up (by the time we got there we barely made it to when the tow yard closes at 7pm) HOW to get everyone there and the outrageous cost of getting their vehicle back. This effectively ended the rest of vacation plans for the Los Angeles area.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Enjoyable and well worth the time", "It is a good sight seeing the tar pit as you enter the park. Watching the tar pit bubble provides a good photo opportunity if you are lucky but if you want to take some video footage, it is definitely we well worth persisting. Enjoy taking the time to check out the museum inside, and don't forget to check out the rest of the park.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Realistic setting for concrete dinosaurs", "A fun place to stop and ponder the theatrics of how we imagine and narrate ages past on the way to LACMA."], ["Reviewed November 20, 2017", 5.0, "Wow! Must see", "We really are fascinated by fossils but are used to those found I stone. The tar pits actually preserve them as bone. Who knew there were 6 foot sloths that existed. Fun and interactive exhibits. The bubbling tar outside was fascinating. Fun area to learn about history. If you enjoy nature and fossils this is a must see.\nShow less"], ["Reviewed November 20, 2017", 5.0, "We spent an hour in the park", "What a great place to spend some time and sew the tar pits, better called the asphalt pits. Lots of great information as well as the pits. We did not have the time to go into the museum but the outside was like a museum in itself. Well worth the visit. Interesting.\nShow less"], ["Reviewed November 18, 2017", 4.0, "Spectacular for kids, interesting for adults.", "A relatively short visit place with a lot of tar pit casualties on display. Mammoths and Saber Tooth tigers well represented. Research digging gives a constant supply of bones.The tar pits themselves are still been excavated and still catching animals.\nAn interesting couple of hours visit in a nice environment.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Quick visit - walk though park only", "We made just a quick stop to see the tar pits (no cost to walk in the park!), there are several informational signs around telling about the tar pits so if you don't have a lot of time, you can do a quick visit for next to nothing (parking $). I'd love to go back and see the museum - perhaps next time.\n\nGreat for all ages.\nShow less"], ["Reviewed November 17, 2017", 3.0, "Tour guide", "Our tour guide for the outside pits was great, took all the questions. Worked with the kids and really listened to them. Without her we would have no idea what the pits were about and what it took to find the bones in there. Very interesting. Just need to find a better way to get to the Museum and not have to drive thru such a bad area. Took 1 1/2 hours to get thru that part of LA and same route going back. Too long and very depressed area.\nShow less"], ["Reviewed November 15, 2017", 4.0, "A cool spot...!", "Really awesome to see such an amazing active excavation site. You won’t need to be here more than an hour, maybe two so it’s the perfect pit stop, with The Grove nearby etc."], ["Reviewed November 14, 2017", 5.0, "LA meets the ice age", "Go back in time to the ice age at the La Brea (tar in Spanish) tar pits, where saber tooth tigers got trapped and preserved in the tar pits - it's actually oil. The tar pits are in a park like setting and there is also a garden here with plants from the ice age.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Saber tooth tigers and wooley mammoths, oh my!", "Saber tooth tigers and wooley mammoths, oh my! This is a fascinating place to wander and the museums are interesting. Be wary of the oozing tar that is percolating throughout the park."], ["Reviewed November 13, 2017", 3.0, "Dissappointing", "The area around the Brea tar pits had undergone a revamp in recent years, so the park is pretty nice. The tar pits are sprouting all over the park but the tar pits are full of rubbish. It just doesn't do them justice."], ["Reviewed November 11, 2017", 5.0, "Living History", "We lived in California years back and we have never visited the La Brea Tar Pits until now. The price of admission is completely worth the amount of work that has gone into this museum. To make things more affordable, military members receive free admission. Therefore, my husband was completely free, something we were not expecting at all. Adult admission is only $12.00 and children prices are good up until age 17. Something almost unheard of in the US. Ok, enough about the cost.\n\nThe museum is well put together and amazingly most of the exhibits are actual bones retrieved from the pits. Watching the scientist at work was also fascinating. Touring the grounds and seeing the different pits made us wonder why the entire grassy area wasn't bubbling with tar. This is a great way to spend a couple of hours. Highly recommend.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Great visit", "Enjoyed visiting this great and awesome museum and grounds. You can actually smell tar in the air. The staff were very friendly and informative."], ["Reviewed November 9, 2017", 5.0, "Outta this world", "This is free to the public very exciting to walk through the park to see all the different tar pits and all the excavation of the animals they have recovered while you’re walking through the parking lot there are two structures where the tar pits have started to engulf the parking lot they had to block it off it’s amazing to see.\nShow less"], ["Reviewed November 9, 2017", 3.0, "Mostly just interesting", "In the effort to be fully honest, we did not go into the museum (it was closed), but the surrounding area was interesting. It is suddenly very easy to imagine these huge creatures being sucked into the tar. And be sure to watch the Bubbling Tar Pits on Wilshire. Then you really have an image of primordial soup!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Don't miss!", "So glad our family stopped here after visiting LACMA. It is right next door and worth a stop. Fascinating look into history of our planet and how it all began. We were lucky too that it happened to be FREE that day--a Tuesday not sure if that is every Tuesday, but check it out. Actual tar pits are still active and bubbling. You can watch people outside doing some excavation work as well as volunteers inside the museum working to uncover the treasures. The outside areas are free to walk around all the time but it really is a nice museum inside with interesting tid bits to keep every age engaged.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Very Very Interesting", "A very unusual and interesting experience. You can see real tar pits and incredible fossils. A site and museum like this cannot be found easy. So do not miss."], ["Reviewed November 8, 2017", 5.0, "Great experience for kids and adults", "Amazing museum with full size skeletons of woolly mammoths, dire wolves, birds, sloth, american camel and more.videos, live action performers, experience the pull of the tar, see the methane bubbling up from the outdoor tar pits."], ["Reviewed November 5, 2017", 4.0, "La Brea Tar Pits", "Very interesting place to visit. I had no idea before coming here that there were active tar pits in the middle of LA. I love finding unexpected things like this when travelling.\nAllow at least two hours to look around here if you want to do the museum as well as each of the pits.\nI highly recommend you do if you like this sort of thing.\nAbout A$12 per adult to enter the museum but the tar pits are free to view if you have bought a ticket to LACMA which we did.\nIf you are intending to do both museums and the tar pits it will be a full days outing.\nYou will probably not get to see everything but I can assure that after all the walking you will be looking for a foot massage and you'll sleep well that night.\nThere are toilet facilities and restaurants/cafes on site as well as souvenir shops.\nThe tar pits are all fenced off so no need to worry about children disappearing into them though there are tiny little eruptions around the park that I'm sure will attract the interest of inquisitive minds.\nOverall, a great day and worthy of your time.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Amazing, such a different place to visit", "Outdoors was free to visit, but the actual centre housing the fossils cost, but it was only minimal.\nThis place is amazing. There are naturally occurring pits of tar, of all different sizes, coming up through the ground, and bubbling up through the lake.\nAs it's tar, it has a very strong bitumen smell. It's truly amazing to see it all.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Wonderful Exhibits and Experience", "I have wanted to go here since I was a boy and it was worth it. The ongoing excavations, demonstrations, exhibits, and shows all made it a magnificent journey through the real Jurassic Park."], ["Reviewed November 2, 2017", 5.0, "Interesting", "I'm glad we came here. It is right next to the Museum, so it's easy to do both. The pits outside are free to walk around, but the museum inside you need to pay for. Very interesting. Be careful not to step in any tar!!!"], ["Reviewed October 31, 2017", 5.0, "A trip back in time", "This is an amazing site there are 91 pits in which fossils were found from several types of Aminals and insects which were from thousands of years ago"], ["Reviewed October 31, 2017", 5.0, "Excellent museum, hard to park", "Lots of activities for kids, make sure you make the walk around the museum, you can see the archeologists actively working and see the places the tar is coming up out of the ground. Well worth the trip"], ["Reviewed October 31, 2017", 4.0, "Very educational.", "If you like science, this is an excellent choice. Good for children. Fascinating that it's in the middle of LA, go inside and see the exhibits. Hard to believe that all this history dates to prehistoric times."], ["Reviewed October 31, 2017", 5.0, "Interesting place", "A very interesting site and small bit dated museum with an interesting exhibit. A true must see. It is interesting to see how close the tar is to the surface in the park as one sees tar in the grass everywhere."], ["Reviewed October 30, 2017", 5.0, "Stayed for 2 hours, but could have been there all day", "This was the 1 thing I wanted to do in LA. It was great! There are actual sticking pits that bubble frequently. There are even places throughout the grounds that the asphalt is seeping up so you can investigate yourself. The museum is a manageable size that you can enjoy it in 30 mins or 2 hours. There is a fossil prep lab on display so you can watch as the fossils are cleaned up for display! The Excavation tour is worth the 30 mins. The museum gift shop has exciting and desirable items for a variety of price points. I recommend it to everyone visiting the area. Very family friendly!\nShow less"], ["Reviewed October 30, 2017", 4.0, "Such an unusual place right in the middle of L.A.", "Really liked our visit here. Very informative, shocking to see on Wilshire Blvd. It's a must see from the other \"attractions\" in L.A. Educational, staff is very helpful and it's just interesting."], ["Reviewed October 28, 2017", 5.0, "Interesting", "a little pricey, but interesting. lots of fossils. Easy to find and easy parking that was appreciated."], ["Reviewed October 26, 2017", 3.0, "So, so.....", "Interesting for 45-60 minutes. There are better things to do in Los Angeles. However if you are in the immediate area, park and pay this place a quick visit. I will not return."], ["Reviewed October 25, 2017", 5.0, "Don't Miss this One!", "This is so much fun-Tar-actually asphalt- oozing up in downtown LA-Fascinating information , great science and old-fashioned exhibits make this a fun spot. Why the capital of movie magic hasn't enhanced this exhibit is beyond me, but its still worth a visit. Couldn't Spielberg or some of the Jurassic Park people help out a tiny bit?\nShow less"], ["Reviewed October 25, 2017", 4.0, "Fun and Unique Place to Visit", "We came for the weekend and stopped here first. It was right next to the LACMA. Easy to navigate by yourself if you wanted. We toured multiple \"pits\" by ourselves. We also paid the $12 for the Museum visit. To be honest, while I even donated $5 to the education fund, I don't know if it was worth the money. I enjoyed walking around outside and the museum was interesting, and if I had children with me I think they would have really liked it, but just being with a friend, I think we could have skipped it.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Interesting if you have time", "How can such a unique archaeological site not be fascinating? It does leave something to be desired in the presentation, however. The museum has so much potential, but we did enjoy learning about the history and on-going research happening here. Great if you have children!"], ["Reviewed October 25, 2017", 5.0, "Amazing history", "Millions of fossils to see. Multiple exhibits throughout. Timeline since Ice Age was an eye opener. We parked there and then walked over to the Art Museum. it was easy to get to. Then drove to Rodeo drive for lunch, which was not too far. Overall, impressive to imagine that this entire area was once an oil well.\nShow less"], ["Reviewed October 24, 2017", 4.0, "enjoyed our visit", "Had a great time with teens and kid in tow, something entertaining and informative for everyone. Museum was nice and cool on a warm LA day, great things to see and engaged every age in our group of 6 people."], ["Reviewed October 23, 2017", 5.0, "So cool!", "Definitely worth going to!! The Museum was fascinating, the tar pits were so cool to see, and I could have easily spent WAY too much money in the gift shop! If you do the hop on hop off bus like we did then you also get a discount on the entrance fee!\nShow less"], ["Reviewed October 23, 2017", 5.0, "Must See", "Small museum with multiple pits throughout the grounds. Amazes me what it must have been like to do the excavation 100 years ago. Super cool to see the bones that have come out of the pits. Also extremely educational regarding the creatures that walked that area. Did you know there were indigenous camels in LA 10,000 years ago? Go when they first open in the morning. We were able to see everything in 2 hrs. The school groups started filling in about 30 mins before we left. Glad we went\nShow less"], ["Reviewed October 23, 2017", 5.0, "Smelly :):):)", "It was really interesting to see something like this. Seeing history in the present and seeing the discovery of this area was very interesting."], ["Reviewed October 22, 2017", 5.0, "Very cool place, a must see!", "This is a very cool place, I definitely recommend checking this out if you are in the area. What I didn’t expect was a strong tar smell upon entering the tar pit grounds.\n\nLots of different bones have been excavated from the pits. There’s a wall full of wolf skulls, Sabre tooth cats, mammoths and much more.\n\nYou’ll occasionally see bubbles coming up from the tar pit surfaces and there are more than half a dozen tar pits to see.\n\nAll around, a really neat place.\nShow less"], ["Reviewed October 22, 2017", 3.0, "Worth going to see the tar pits, but museum needs an update", "I do recommend going to see the La Brea Tar Pitts because it's just really cool and something totally unique. I'm giving it 3 stars because the museum itself could really use and update. I recommend skipping the shows, the 3D one was old, poor quality, and boring, I didn't learn anything I couldn't have read on one of the exhibit placards. The exhibits were shabby. Seeing all the fossils is really cool, and walking around the grounds to see the pitts themselves is really amazing.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Great Museum!", "Great visit with the family. Active tar pits that are still bubbling and you can smell the tar. Museum had great exhibits with lots of fossils especially direwolves. Definitely a museum to take the kids to."], ["Reviewed October 21, 2017", 5.0, "A delight", "Had always wanted to visit. Staff make it a pleasant experience. So much history! Needed a wheelchair and it was promptly provided."], ["Reviewed October 19, 2017", 5.0, "Outstanding Interpretation of this unique geologic feature", "As a retired geologist, this was high on my must see places in LA. The museum is outstanding and you can actually watch real paleontologists working on bones trapped by the tar. Watch the bubbles of methane burst into the air. And, this helps explain how California's petroleum industry started and added to the economy of that State.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Fairly Unique", "There are a number of museums around the world with complete skeletons and fossils, but this is the only one I know that has the fossil beds on site with the museum and in the middle of a major city. It is really worthwhile but if you plan to come check online for parking. The museum has nothing and the city parking nazis in the surrounding streets are red hot even though the signage on where you can park and where not is minimal. Museum once you are in has a small number of fully complete skeletons but includes a lot of information in the displays, plus at extra cost there are a couple of shows. We saw the 3D movie and it was excellent.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Free day out", "We came here and were lucky enough that it was a free day, so interesting and so glad we got to see it. I'd recommend people see it, how much people have found from in these pits it's mind boggling."], ["Reviewed October 17, 2017", 3.0, "free park visit", "We ended up not paying for the museum, just parking, but just wandered around the park. It was interesting to see the tar bubble, and think of the dinosaurs who had gotten caught in the sticky mess and perished. I was particularly intrigued by the one small pit where 27 mastodons were identified. I also liked the photo showing how there used to be stone bridges that looked over the tar pits before some visitors got too curious. Considering it was free, it was great, and was one of the most unique park visits ever, perfect for little ones to stretch their legs, but I would have like some more signs or explanation of what was going on at each pit.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Mammoths, Sabre Tooths and Dire Wolves", "This is a fun few hours to spend with the family or even by yourself. It’s one of those places you can spend an hour or so in or 3-4 depending on your interest level. There are lots of exhibits to see inside and it is a lot of fun watching the workers sort through material looking for items, cleaning bones, building skeletons, digging at the pits, etc. I would recommend going on a guided tour of the grounds outside. It’s free to do with admission and explains a lot about the area that most people don’t know. It lasts about 30 minutes. Bring some water with you if you are doing the outside tour on a hot day as there is sparce shade. Also, the facility has a gift shop but no snack bar so bring snacks if you want. The gift shop does sell bottled water or you can always leave and come back in as they give you an all-day wristband. There is a pizza place, a burger joint and a Starbucks right across the street. I don’t think it is a place you would visit over and over but it is definitely worth a one-time visit. You’ll want to take lots of pictures as well. Oh, and I thought Dire Wolves were only in Game of Thrones but I guess not.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Great stop", "Very interesting and informational. Can see entire thing in 1-2 hours. Definitely do the entire outdoor loop. Then do the museum. Staff were super - friendly and knew answers to all my questions!"], ["Reviewed October 16, 2017", 5.0, "Truly worthwhile visit to La Brea!", "My wife and two young kids (age 6 and 3) visited La Brea as part of our week-long spring break vacation in the LA area. We thoroughly enjoyed La Brea. The museum exhibits were top notch, there's an informative movie as well, and we loved walking around the grounds to look up close at the tar pits and excavation work. It is a beautiful park area that's easy to get to, easy parking etc. We really enjoyed our visit and highly recommend this to others.\nShow less"], ["Reviewed October 16, 2017", 3.0, "Educational but Not a Lot There. Get Combo Pass.", "This was part of the GOLAPass, so for the money it was worth the pass through since it cost nothing additional to go through here. The history was interesting, and the presentation was very nice. The facilities were pretty impressive, and the walk around the campus was interesting. That being said, there is not a lot here. It is something to do on a lazy day, especially if included in a combo pass of some sort. But as a stand alone $12.00 a person? I would skip it.\nShow less"], ["Reviewed October 15, 2017", 3.0, "Buy the combo pass with Natural History Museum on the website", "I would recommend this for older kids because the smaller ones might get bored. I didnt mind though because we got tickets at a good price by buying the combo pass with the Natural History museum on the website. Make sure to catch the free tour\nShow less"], ["Reviewed October 14, 2017", 5.0, "Educational", "I read about the tar pits as a child and always wanted to go. I was finally able to go, and it didn't disappoint. It's right in the middle of the city, so the sound of the traffic can be distracting while looking at the tar pit. It was exciting to watch the tar bubbling. The museum is nice too and very informative, even though it was kind of crowded. You can learn all about the Ice Age, and chill in the atrium. They also have a very nice gift shop.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Page Museum is well worth it", "You can get a good look at the La Brea Tar Pits without having to pay to enter the museum. However on this visit we had a good look around and appreciated both the exhibits and also watching volunteers painstakingly examining trays of material looking for fossils. Museum is a real child's paradise.\nShow less"], ["Reviewed October 14, 2017", 5.0, "A great half-day visit", "La Brea Tar Pits are in a well maintained public park - free admission. See the life-size models of many of the prehistoric animals in the still-active tar pits. Free access to the continuing archeological digs.\n\nIt's all level or sloping access so strollers, buggies and wheelchairs will have an easy time. There are plenty of places to sit around in the park, in the sun or in the shade.\n\nThe museum is exceptionally well laid out with scores of displays, including life size reconstructions and holographic images. The technicians work in a large fully glazed laboratory in the museum - watch them carefully extricate a bone from the tarry 'goo' or clean up the tooth of a sabre-tooth tiger.\n\nThere are two theatres with shows on the hour and half hour throughout the day. We saw the 3-D film (special spectacles provided at the door. Volnteer docents are stationed around the galleries to offer explanations and answer questions.\n\nTickets are sold in booths near the main entrances to the park (credit & debit cards only) or at the reception desk in the museum lobby. It's a fantastic experience for kids and pretty good for the adults too! Don't miss it.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Sabel tigers and Mammoth elephants", "On my bucketlist for Los Angeles. Check. Was not dissapointed. Somewhat pricy. Paid $12 for parking. $11 for museum. $5 for 3D movie. $5 for live Infotaintment. The big park was free thou."], ["Reviewed October 12, 2017", 3.0, "Interesting but not much there", "A blind friend and I walked around the outside of the tar pits and it was very interesting. There was some interesting exhibits and things to learn.\n\nUnfortunately I wasn't so crazy about the museum. It's small and not a lot of interactive or tactile displays. It was quite boring for him- how much can he just listen to? I did enjoy watching the person fixing broken dinosaur bones.\n\nWe were hoping to buy some fun gifts to bring home but it was small and didn't really have many choices.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Very interesting", "Had no idea this was smack in the middle of town...right next to LACMA. Go see both of them. The Tar Pits explain how the animals were trapped and preserved for us to see. They are still finding new things."], ["Reviewed October 9, 2017", 5.0, "Great Childhood Memories Shared With My Kids", "Growing up in L.A. County meant school field trips to The La Brea Tar Pits. I was fascinated as a child and really enjoyed traveling back to Southern California to share the experience with my teenage sons. Definitely, an interesting place to visit and a must see with kids.\nShow less"], ["Reviewed October 9, 2017", 4.0, "Great lake", "We finally found ourselves at the tar pits after talking about going for three years. We paid for our tickets and the staff was excellent. I wish we were given a map of the outside attractions. I found this frustrating as I wasn't sure where I was going. However, the placards were helpful in explaining what we were seeing. We loved the lake - what a wonder to see the earth living and breathing. The museum was excellent. We thoroughly enjoyed watching them behind the glass sifting through earth to find fossils. It's a good afternoon attraction but don't plan on being there all day.\nShow less"], ["Reviewed October 8, 2017", 3.0, "Interesting. Museum is over priced.", "It’s kind of unfortunate trip advisor puts The Tar Pits and The Page Museum in the same listing. It is absolutely free to visit but it’s in the surrounding park. While the tar pits are certainly not super exciting… They are kind of cool specially when you realize what they have. See the prehistoric gases lives in bubble even to this day and that’s pretty cool. What a lot of people don’t know is that there actually multiple times.. Other than the big one, be sure to visit pit 91. The Tar Pits alone get 4 stars. A nice place to picnic. Even better, visit LACMA just next door.\n\nThe museum is much smaller than it looks. You can easily do the entire museum in 20 minutes. So it is vastly overpriced. You can get in free by reserving tickets with your LA COUNTY library card. But parking is still $12. Next time I’m going to forward street parking… But I thought we would be more than a few hours before I knew how little was in the museum. Don’t get me wrong... they have some cool stuff. The atrium is nice... it’s just a quick visit. Taking value into consideration I’d give this a 2.5... so mixed with the 4 star tarpits I’ll give it a 3.\n\nIf you live in Los Angeles usual absolutely visit the tar pits. But skip the museum. If you are visiting and have heard how cool the Tar Pits are, but I have a limited time… You can skip it altogether. If I was only here for a week there are much more fun things to see in LA than the tar pits. But if you’re here a while, check them out!\nShow less"], ["Reviewed October 7, 2017", 5.0, "Transported back to the Ice Age!", "A great day at the museum located right in the heart of urban Los Angeles. We paid €12 to enter the museum and opted to watch a 3D 25 minutes film on the creation of the museum and the history of the Tar Pits for an extra €5. The film was very informative giving a history of global climate change and a dramatisation of the Ice age era and the creatures living then.\n\nThe museum is nicely laid out with well preserved skeletons of the animals which met their end in the Tar Pits. There also is a working lab where the discoveries are still being recorded today.\n\nThe park outside which is free to enter shows the Tar Pits and current archeological digs.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Very interesting", "In the middle of the busy metropolis of Los Angeles a real gem. The tar pits are interesting and the smell of tar in the air is hard to miss. The parking is expensive so you better park outside with meters... we did not visit the museum, in which the fossils are kept only the park. There are excavations in progress, digging into the tar.... the story of the place is truly amazing. An oil field under the park sends pits of tar and asphalt to the surface. Thousands of years ago al sorts of wild life and animals including mammoth stepped over pits and just sank in, like in a swamp, to their death. Their fossils are being dug out by the thousands on daily basis. Go and visit with your young.\nShow less"], ["Reviewed October 3, 2017", 5.0, "The history of some pretty amazing science.....", "Often, when people think of Los Angeles, they think of celebrities and the diversity of the culture, or amusement parks. Which are all great. But, when I took my children here, to take a moment, and go back in time, and think about what happened, right here where I was standing...... it is pretty mind-blowing. To see the displays with the Dire wolves, and realizing while looking down in the pits, that fossils were right there. The story of the circus elephants that escaped and got stuck in pits in 1935, was then rescued by other circus elephants. The displays were interesting and educational. The guided tour was fun and informative.\nShow less"], ["Reviewed October 3, 2017", 5.0, "very unexpected and wonderful", "I had no expectations before going here. I recommend watching both of the videos. However, the mechanical sabertooth tiger might be a little scary for younger children. Amazing exhibits of prehistoric skeletons that were displayed well. Lots of people just come to the lovely park area for lunch. Right next door to the Page Museum as a bonus. Some excellent souvenirs, I love the rocks!\nShow less"], ["Reviewed October 3, 2017", 5.0, "Science in action!", "I loved visiting the La Brea tar pits and museum. There is a museum with fossils, ancient skeletons and other artefacts excavated from the asphalt pits. I particularly enjoyed seeing the live fossil dig that has been going on since 1915."], ["Reviewed October 2, 2017", 1.0, "Another special plac!e especially great for family visits - very educational and unique", "Children love visiting this place and adults can be equally entertained and facinated with the findings there."], ["Reviewed October 2, 2017", 5.0, "What an intriguing place to visit", "If you are in the Los Angeles area for vacation, this is a must see place. Bring your Family and spend at least 4 hours. There are great places to eat nearby and it is a great place for the family"], ["Reviewed October 2, 2017", 5.0, "Educational and fun for adults and kids...", "This past weekend my family was in LA for a wedding. While my wife was busy participating in the pre-wedding activities I needed to find something fun and entertaining to do with my son so we didn't end up in the hotel playing video games all day.\n\nWhat we decided on was to visit the La Brea Tar Pits and Museum. It was fantastic! One of those bucket list items for me for sure. We both had a great time walking around the famous bubbling pit at the entrance to the museum. Once inside the museum we opted for the tickets that included both the puppet show and the Ice Age 3D movie.\n\nThe puppet show was very good and quite honestly a bit frightening. The saber toothed cat was very intimidating and my son was glad to have been seated in the back row further away from the action.\n\nThe 3D movie was okay, yet a bit dated by comparison to other 3D and 4D movie experiences that we have enjoyed in the past.\n\nPerhaps the highlight of the visit was the hands-on experiment where visitors can see what it would be like to be stuck in the tar. Visitors can pull up on these metal rods that are submerged within a gooey tar substance. Pulling up on these rods is very challenging and gives you a sense for what it must have been like to be an unfortunate animal who stumbled into the tar pits.\n\nWe would definitely recommend this museum and experience to anyone who has a few hours to spend visiting in the LA/Beverly Hills area.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Visit the past", "A truly unusual place to visit and learn about the past. Buried in the tar pits are thousands of skeletons of animals, insects and plants that lived thousands of years ago. They have painstakingly put skeletons together so you can see the full size of these lost species.You can watch scientists at work and learn about Los Angeles so long ago.\nShow less"], ["Reviewed September 28, 2017", 5.0, "A Truly Unique Experience", "To visit the LaBrea Tar Pits and Museum is to go back in time 40,000 years while remaining in 21st century LA. The bubbling pits of asphalt are a trove of fossils of mammoth, dire wolves, giant sloth and many more prehistoric animals. Complete skeletons of these animals abound and you can see the fossils being cleaned by hand in the fishbowl work area or being extracted from the tar pits now under excavation in the working pits. There is a good film and helpful docents to answer questions. Definitely the most unique Museum I've been to in the World. Nowhere else are they extracting whole skeletons of extinct species. A must for families and amateur archeologists of all ages!\nShow less"], ["Reviewed September 27, 2017", 5.0, "Not just for kids", "We walked around and looked at the Tar Pits first then got intrigued and decided to buy the tickets to walk the museum. Just beware that some weekday mornings, they host classes of kids. We were lucky in that the large group of kids were leaving right when we started the museum tour around 11am. It was interesting and didn't take long. Very informative and always a nice reminder of how long life has been existing on Earth.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Amazing!!", "This wonder in the middle of the city is worth taking the family. It leaves time to do other things in LA."], ["Reviewed September 26, 2017", 5.0, "Pretty impressive!", "This is probably one of the best museums I have been to! I would recommend you to take one of the guided tours. They have giant Mammoths, saber tooths, and dire wolves (GOT fans!). Do yourself a favor and go visit!"], ["Reviewed September 25, 2017", 3.0, "An Interesting Place to Visit", "Easy to find, follow your nose!\n\nThe tar pits are well presented and not as big as I expected it is still worth a visit. You can enter the grounds for free but to explore the Museum there is a charge.\n\nIt was my wife & I first visit to LA so we had booked a private day tour customised to our requests so Tar Puts on the list.\n\nThe display of animals trapped in the tar pits is very well done and the walkway around the pits is well sign posted with information signs.\n\nYes go here and enjoy, only need to allocate between 30mins to 90mins would be plenty of time and it is easy to walk about\nShow less"], ["Reviewed September 24, 2017", 5.0, "Wow!!! Pleasantly surprised!", "I wasn't really sure about going but my husband wanted to check it out. Be prepared to pay $12 for parking. We walked around the museum and grounds and was so interested and had multiple questions so we decided to stay for the guided tour. It was mind boggling to think of this part of LA being on an oil field and from earthquakes and shifts in the rock layers that the asphalt seeps to the ground. It was amazing to see all the fossils actually discovered on the property and at the art museum next door!!\n(There is a cafeteria at the art museum at which you can eat but expect museum prices.) Definitely would be a great place for a picnic!!\nShow less"], ["Reviewed September 24, 2017", 3.0, "was ok", "we visited the tar and it did not take long to get round/ Maybe we expected more. he only time we had seen the tar pits was on Volcano The Movie LOL"], ["Reviewed September 23, 2017", 5.0, "Outstanding experience", "Excellent museum with many nice exhibits. It is set up quite well and very educational. The active tar pits and active excavations are so interesting. Absolutely worth the time and cost to attend. Of course, parking is not free, but it is still worth visiting the museum.\nShow less"], ["Reviewed September 23, 2017", 5.0, "An educational and historical place to see", "Over three million fossils have been found here, mainly dinosaurs, who were trapped in the tar, thousands of years ago.. There are also life sized replicas of these extinct mammals which are located in the still bubbling tar pits. There are no guided tours, and no entrance fees..\nShow less"], ["Reviewed September 22, 2017", 5.0, "Great experience, interesting find", "Great museum, the kids thoroughly enjoyed their visit and were awe struck by the many artefacts and different types of prehistoric animals and plants being found right where they were standing. They could not get over some of the bones found in tat and asked so many questions about how Tar was made, where else is it found and they couldn't wait to find out more. They really enjoyed getting up close and seeing what else was being found in the pits.\n\nPlenty of parking, affordable and informative. The grounds are wonderful and an easy walk.\nShow less"], ["Reviewed September 18, 2017", 5.0, "A must see", "Super interesting museum, spectacular, offers an easy and understandable way of learning about the tar pits. You`ll need a few hours to go around but it's absolutely worth it. Well explained and well organized."], ["Reviewed September 18, 2017", 3.0, "Checked off my bucket list", "The experience is something I am extremely glad I had and get to check it off my bucket list. It didn't take long to go through everything and the cost of parking was a bit high."], ["Reviewed September 15, 2017", 4.0, "Prehistoric Los Angeles", "Yes, there were creatures living in the Los Angeles area ten thousand years ago - not dinosaurs, but other amazing ones, such as giant mammoths and saber-toothed tigers. Great for the little ones."], ["Reviewed September 15, 2017", 5.0, "Only gets better with time", "As a native born LA person - I have been visiting this place for years and years. They just keep making it better. Lots to see and do and you can sit on the lawn for free!"], ["Reviewed September 13, 2017", 5.0, "Fascinating activity - great for all ages!", "We spent a morning at the Tar Pits before doing an afternoon tour of LA. The La Brea Tar Pits & Museum were fantastic. Well worth the price of admission."], ["Reviewed September 13, 2017", 5.0, "So fun and informative!", "This is just really well done. My husband and I spent a little bit of time walking the grounds before the museum opened and then went into the museum. It is just fascinating to be able to see volunteers looking through the fossils. There were volunteers/docents also available to answer questions. We had a good time, and it's great that this shares a campus with the Los Angeles County Museum of Art!\nShow less"], ["Reviewed September 12, 2017", 5.0, "Finally made it!", "I've wanted to come here ever since I was a kid and while studying Geology at uni and today I finally got my chance and I wasn't disappointed.\n\nFirstly you can wander around outside for free looking at the bubbling tar (or should I say asphalt) pits and spot where fresh seepages are popping up. Then you can pay to enter the museum and find out more including watching scientists cleaning the fossils and preparing them for cataloging.\n\nThere are also a number of additional shows you can pay to watch. We did he 3D show Titans of Ice which was very good.\n\nAnyway if you are in LA and want to see something really cool that isn't shallow celebrity nonsense come here.\nShow less"], ["Reviewed September 11, 2017", 4.0, "History and science all here", "Really enjoyed this museum. It is set up nicely and you learn a lot about Paleontology and Earth Science. We spent three and one half hours and at a leisurely pace saw most, but not all of the events and exhibits. I definitely recommend paying to see both the 3D movie and the interactive story, as they bring the ideas of life and help younger children engage. It was fun to see the volunteers at work sorting fossils in the lab, even on a Sunday afternoon. Ended up parking on the street a few blocks away, but didn't really have trouble finding a place to park on a Sunday. Other days of the week it may be harder to park.\nShow less"], ["Reviewed September 10, 2017", 4.0, "Cool to see", "We just stopped by to see the pits outside. Stinky, but cool to see. Our teen girls weren't interested in going inside, but thought they were neat to see. Lots of room on the grounds for a picnic."], ["Reviewed September 9, 2017", 5.0, "Oil and Tar", "Fascinating visit to see actual archeologists still looking for fossils. Oil still bubbles to the surface with a sulphuric smell. We went into the museum, reasonably priced. Dinosaur bones and life size animals fill the museum. A few animal models even move."], ["Reviewed September 7, 2017", 4.0, "Amazing site in heart of L.A.", "I visited here with my family (wife and two kids, age 10 and 12) on a Sunday afternoon in July 2017.\n\nWe parked in the museum parking lot ($) and tried to figure out exactly where to go. There was an outdoor ticket booth with a long line and two buildings in the area. Of course, we started walking to the wrong one.\n\nI found a staff member who directed me to the museum itself where we could check in. Luckily, there was a short line for those who had purchased their tickets online. I was also able to purchase admission to a 3-D movie.\n\nWe toured the indoor museum (fascinating), looked inside the lab where staff were working, and took lots of pictures! There was lots to see and do and touch which really kept the kids entertained. We watched the fascinating 3-D movie and made our way outside to tour the exterior sites – including the huge tar pit with the mastodon models. You can see the bubbles still coming up through the tar.\n\nWe were able to join in on a tour in progress and I am so glad we did as the tour guide was really knowledgeable and was able to answer lots of questions.\n\nThis was a fascinating museum in a unique location – in the heart of a major city (and close to the Grove and Farmer’s Market, too).\n\nA great experience and highly recommended.\nShow less"], ["Reviewed September 6, 2017", 5.0, "You must go here if you are in LA", "Fun for all ages, interesting for everyone. Lots to see so plan a half day for this activity and if you also want to see the art museum it is right next door."], ["Reviewed September 6, 2017", 4.0, "Took a friend from out of town", "The place was extreemely busy with \"alot\" of school excursions along with the kids \"NOT\" on their best behaviour. Next time I would go when the little darlings are in exams or on holidays. Apart from that the museum was very interesting & informative"], ["Reviewed September 6, 2017", 5.0, "A unique museum in California", "Outside the entrance the bubbling lake of pitch with its mastodon family statues enthralls children and adults alike. This beautiful and accessible museum has a huge educational component with its vast collection of Ice Age bones and assembled skeletons of dire wolves, giant sloths, mastodons and saber tooth tigers. Visitors can look through picture windows to see volunteers sorting through materials that have been collected at the digs outside just beyond the museum.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Worth every minute!", "Finally saw the tar pits and meandered thru the museum- worried my14 year old girls would roll their eyes... they loved it too. Happy that we made the stop.-"], ["Reviewed September 6, 2017", 4.0, "Allow more time", "Our first time here and thought we could 'do it' in a hour or so, were we wrong!\nFound it very fascinating even with school groups & other vistors filling the building.\nSuggest you do allow at least a couple of hours to wander around and do the walking tour as it (the tour) takes you to other areas (outside) which do wouldn't otherwise hear about.\nShow less"], ["Reviewed September 5, 2017", 4.0, "Working excavation site", "This is a nice day trip. The museum docents are very informed. The excavation tour is very interesting. A gem in the middle of Los Angeles. It would be nice if there was a cafe on site but there are plenty of places to eat in the area.\nShow less"], ["Reviewed September 3, 2017", 3.0, "Overpriced", "We enjoyed it but from the parking to the museum, I just felt like it was overpriced. Years ago we were here and everything was free. I realize that times change and you need a cash flow to keep things current and updated, but they've gone too far.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Today is your lucky day...", "That's what the guy said at the parking, and another at the ticket sale. The computer system was broken when we arrived and had free parking ($12), free admission and a free 3D screening about the tar pits. Museum is worth visiting. Very nice staff is eager to tell stories and explain about the tar pits. Nice is that one can experience the forces of the tar once trapped.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Park with real tar pits", "A quiet and beautiful park, with some tar spots emerging from the ground. There are archaeological research currently being done, as animals and plants got stucked into the tar pits over time, and you can see its results in the museum. There are information signs about it scattered throughout the park as well. There is a bubbling lake with mammoth replicas\nShow less"], ["Reviewed August 28, 2017", 5.0, "Incredible that is in the middle of Los Angeles", "This is probably the greatest depository of animal and plant fossils/ skeletons numbering over 750,000 species. The museum was one of the first in the country built to have the visitors interact with the exhibits. The is a pit viewing area where you can see current excavations in progress.\nShow less"], ["Reviewed August 28, 2017", 3.0, "Very Interesting", "Visited with my daughter who is a science teacher and loves paleontology. She was very intrigued with the Tar Pits. I found them very interesting and learned a lot on my visit."], ["Reviewed August 27, 2017", 5.0, "The original Ice Age", "It´s a return to the Ice Age at the heart of Los Angeles. It´s amazing see the Mamonths, Saber tooth Tiger, Dire wolves, and many other creatures found at the Tar Pits, worths a visit, for children is really interesting and educative"], ["Reviewed August 26, 2017", 4.0, "interesting", "were in the vicinity and dropped in pleasant staff good range of attractions with the working pit interesting to view unusual natural thing in la"], ["Reviewed August 26, 2017", 4.0, "Fun For History Buffs", "Our family recently visited here and had a great time. Yes the tar pits do give off a smell but it really isn't as bad as some people make it out to be. The museum is nice as well but not all that big so you won't need to much time to walk the whole thing. The exhibits are very interesting though and a few people in our family really like history and archeology so this was perfect for them. They also have a cute little garden to walk around in the museum itself.\nShow less"], ["Reviewed August 24, 2017", 4.0, "Right downtown LA.", "This is very interesting place to just walk around and read the placards of the history. Parking is sparse but convenient. The pits are free to wander around just watch where you place your feet, some tar is not well marked.\nIt's free to walk thru, you only have to pay to go thru the museum.\nShow less"], ["Reviewed August 24, 2017", 3.0, "It was ok", "The museum itself was nice. Watching people work on fossils was interesting and the volunteers were pleasant. We opted to take the tour that went to the working excavation but ended up doing out quickly. The young lady who led it was pleasant but you could tell her whole tour was geared to small children. It was unpleasant for adults.\nShow less"], ["Reviewed August 21, 2017", 3.0, "Educational museum for prehistoric fact enthusiasts", "This small indoor museum offers a wealth of information about prehistoric creatures and a close up view of real bones of extinct species and creatures. $12 parking, $12 adult entrance fee. Lower fees for children and seniors. We came especially to see the featured 3-D Ice Age movie experience (additional costs apply) and were disappointed that the attraction was closed due to technical problems. The museum is surrounded by a beautiful park that smells strongly (and appropriately) of tar. There is also a lovely Japanese garden to walk through. Overall, I wouldn't have spent the amount of money that I did considering the limited experience that we had however our short visit was interesting and educational.\nShow less"], ["Reviewed August 21, 2017", 3.0, "Smell is very strong.", "Its a little surprising to find a TarPit in the middle of the city but my son was very interested in. So helped to find out some answers about his questions. If you have a sensitive nose , don't go."], ["Reviewed August 20, 2017", 5.0, "Great for science", "The grounds and museum are excellent. People are cleaning the fossils inside by hand. You can walk outside for free and experience some of this. Save money by parking on the street nearby for free instead of paying $12 extra."], ["Reviewed August 20, 2017", 5.0, "So GREAT!! Part of my favorite day in LA!", "This was truly a unique experience. Where else have you seen a tar pit? It is amazing to imagine what LA must have looked like 4-5 thousand years ago and to think about all the animals that became trapped in the tar - allowing them to be preserved. We spent a half day here. The grounds are lovely. Younger kids will like running around the park. We took the guided tour of the outdoor tar pits, which was somewhat informative. The indoor museum was small, but unique. It was amazing to see the number of fossils that have been un-earthed.\n\nThere is no food at LaBrea Tar Pits museum, but a few food trucks outside. We walked over to the LA County Museum of Art, which is right next door. We had lunch in the LACMA café and spent the remainder of the day in the Art museum. It was my favorite day in LA.\nShow less"], ["Reviewed August 19, 2017", 5.0, "If you have a thing for science and history this is a must", "You can spend 20 minutes here or six hours here. We didn't go instead the museum but walked through the park and saw the pits. Very very cool. There are posters up everywhere explaining everything. Plenty of street parking nearby."], ["Reviewed August 18, 2017", 2.0, "Expensive - Just Roam Outside", "The museum is quite expensive and did not offer as much as I had anticipated. It's better to simply roam the grounds."], ["Reviewed August 17, 2017", 5.0, "A Jewel in the middle of LA!", "It's really cool to see an active tar pit and excavation site in the heart of Los Angeles. This was my favorite jogging grounds when I first moved here. Known as the Miracle Mile, this place has seen high rises all around it. It still remains as a great preserved attraction. How about free admission? Yep! Watch the pit as the depictions of animals that used to get swallowed in the black tar (the reason it is one of the most fruitful excavation sites in North America) What to do next? Next door. LACMA. Again one of the best art museums in North America. Love!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Fossils in LA? Unbelievable!", "The La Brea Tar Pits and the Page Museum is a must do activity for everyone. Who would have believed that these tar pits in the middle of Los Angeles would yield such a trove of prehistoric fossils. The story behind how these animals lived and died in the locale was intriguing. Even my 4-year old grandson was enthralled, especially when he could touch the skull of a Saber-toothed Cat!\nThe docents were wonderful and did a great job of explaining the exhibits and the history of the animals.\nWe thoroughly enjoyed the 2.5 hours that we spent there.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Travel into the past right in the city", "Fascinating place - tour guide was knowledgeable and entertaining. Be prepared for the smell - it is tar after all. See some active dig sites as well as watch people in the lab prepare artifacts"], ["Reviewed August 16, 2017", 5.0, "A unique and happening place!", "A very impressive and enjoyable paleontological museum, with active excavations in progress much of the year, and an analysis lab on the premises. NOT dinosaurs but ice-age fossils like sabertooth tiger, dire wolf, ground sloth, and long-extinct new world horses and camels. The tar pits are still bubbling, this is a unique and happening place! While kids would find this very enjoyable and interesting, all the adults in my family really enjoyed it. Right next to LA County Museum of Art, which is also super!\nShow less"], ["Reviewed August 16, 2017", 4.0, "Curious and enthralling", "I found this place quite enthralling. They have a range of exhibits which were extracted from the tar pits over the last century - mammoths, sabre tooth tigers being the most memorable. The video is informative as it give a view of how they have work the site. Definitely worth spending some time here.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Great affordable day out!", "We came to the tar pits as we had heard about them from other friends who visited from Australia and have to say... we had a brilliant time!\nSo much can be seen without having to pay an admission fee (unheard of in Australia) and the cheap admission into the museum was worth the price!\nInformative friendly guides and lots of intetesting information.\nDay well spent!\nShow less"], ["Reviewed August 15, 2017", 4.0, "Neat Area in the Middle of the City", "Not a must see to me, but an interesting perspective on the history of the tar pits in LA. Many pre-historic animals were trapped in the tar pits leaving thousands of bones behind."], ["Reviewed August 13, 2017", 3.0, "Quick Trip to the Tar Pits", "My husband always wanted to come here, and we finally did. Parking is $12 and tickets to the museum is $12 per adult. It was little hot on the outside, so we didn't spend much time. Nice museum though, great fossil display with lots of information, you can experience how hard it is to get out of the tar pits without getting tar on your clothes! They also offer free excavation tours but we did not go since it was little too warm for my husband to stay in the sun... bring a floppy hat, sunscreen, and water bottle if you plan on visiting during the summer.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Excellent volunteers, most expensive penny press", "I'm a 2nd grade teacher and we have a 7yo and 21mo, we live in Va Beach. We have never been this far west before but are road tripping so when we had the time and opportunity, we stopped!\n\nWe only had an hour before the museum would close but we got through it all, even took our time.\n\nThe volunteers were amazing! Only two people are paid to work here, the rest younsee everywhere want to be there and do it happily! We asked one guy lots of questions and he was very knowledgeable and friendly. Another young lady with the microfossils was just as helfpul and kind and let all the kids \"help\" her sort the tiny fossils as she answered their questions.\n\nI had no idea they are still working this site! The lab is so cool, and the older volunteers inside often stopped to smile and wave at us, which is all the 21mo wanted. :)\n\nThey did have a penny press, but after traveling state through state collecting pressed pennies, we were shocked this one was the only one that charged $1 instead of 50c. Crazy!\n\nWe loved walking the grounds and could have watched the methane bubbles gurgle in the tar pits a lot longer. Yeah there's a tar smell but that's where you are!\n\nThere are lots of neat little photo ops all over, but keep in mind the actual excavation pit across the lot also closes at 5, so we didn't get to go in there.\n\nWe are all so glad we made time for this, very interesting!\nShow less"], ["Reviewed August 11, 2017", 4.0, "La Brea Tarpits", "I had never heard to this place so it was very interesting to hear about how it all happened. I would probably never have visited however it was on our bus trip and it was a surprise to find this in a populated area. Worth a visit.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Great education", "This was my first visit to the Tar Pits. The first exhibit was of the tar pit with the mastodon pelvis, wolf skull, camel jaw, and bison upper arm bone. I also liked watching the technicians at the work stations applying n-propyl bromide to remove asphalt from 42,000+ year-old specimens. The skeletons mounted around the museum were impressive.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Loved our visit!", "If your children love science or the ice age, this is a neat place that is inexpensive. The staff are very knowledgeable and friendly. Our kids found this very enjoyable and they learned a lot too! I must also brag on the staff, as our son experienced an unexpected flare of arthritis in his ankle and was having trouble walking. They loaned us a wheelchair at no charge so that he could enjoy his visit!\nShow less"]]}}