{"La Jolla Shores Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "La Jolla Shores Park", "url": "/Attraction_Review-g32578-d263430-Reviews-La_Jolla_Shores_Park-La_Jolla_San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/08/9c/ac/b1/la-jolla.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2424"}, "address": {"@type": "PostalAddress", "streetAddress": "8300 Camino del Oro", "addressLocality": "La Jolla", "addressRegion": "California", "postalCode": "92037", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Good Place to spend for Sun Set and an evening", "Best time to go in evening before sunset. A beautiful beach, and you can spend sometime. Near beach there are play areas for children to play."], ["Reviewed 6 days ago", 5.0, "A great family beach", "It's usally kept clean, a great place for family, swimming, has its own boadwalk with good parking. Public bathrooms available. Believe it or not- this place can handle big waves too. Take a walk down the beach to Scripps Pier. Its worth checking out."], ["Reviewed 1 week ago", 4.0, "Nice afternoon walk", "Clean quiet and accessible. Went for a walk after a late lunch. Plenty of access points and seating along with facilities."], ["Reviewed 1 week ago", 5.0, "Scenery gorgeous", "We walked all around the town from park to shore. We saw the mother seals and pups. The maternal instinct of the seals was amazing. Several pups at different times decided they wanted to go into the water. The moms watched and as the pups got closer to the water the headed right after them. It was precious. The pups were adorable. The cove area was a perfect place for them to sunbathe, and be protected. A sight to enjoy\nShow less"], ["Reviewed 1 week ago", 4.0, "Great walking beach, not for romance.", "Great Sandy beach area with parking seemingly decent, and free. Lots of families here and several surfers. If you want a swimming beach, this is the place."], ["Reviewed 2 weeks ago", 5.0, "Great beach!", "Great sandy stretch! Lifeguards on duty very nice. Washrooms available. Playground and grassy areas and even picnic tables!"], ["Reviewed 2 weeks ago", 5.0, "Nice park", "Great place to just relax and watch the ocean and look for whales. Plenty of park benches and sidewalks. Go early to find parking."], ["Reviewed 2 weeks ago", 5.0, "Wonderful", "La Jolla is a must for San Diego travelers and such a beautiful, fun spot to visit. A nightmare to drive to & park in though!"], ["Reviewed 2 weeks ago", 5.0, "Safe fun beach San Diego even in winter!", "Safe fun beach even winter( mist time)\nVisiting grandson UCSD. Took him and teen friend boogie boarding .I had wetsuits and boards and swim fins. Mellow waves 2-4 ' girls out and older guys and surf classes, and beyond breakers clear water and kayaker sand scuba classes.\nGo before 12:40 pm as Wind comes up and in winter makes it chilling . Was high 60 s 70 s . Felt safe great time. Walked 1/2 mile to Scripps Pier fun photos. More experienced surfers go there. Parking good at park. Lifeguards and restrooms clean and outdoor showers! Important to rinse gestures and boards off so no sand your new car.\nEating places in village.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Beautiful sea front", "I went to La Jolla for the day and I enjoyed it very much. The seafront park is beautiful! You can see sea lions and seals, seagulls and pelicans. It's just amazing!"], ["Reviewed 2 weeks ago", 5.0, "Ahhh", "My fav spot. For a walk and sunsets. You can spend a whole day and sit by the fire at the evening. There is a parking so no worries about where to park. Many surfers, divers, beach goers."], ["Reviewed 3 weeks ago", 4.0, "Sunday Beach Walk", "We had a Sunday afternoon to enjoy the beach at La Jolla. The weather was beautiful, the beach was lovely and everyone seemed to be having a great time. We had a lovely time strolling along the sand"], ["Reviewed 3 weeks ago", 4.0, "Nice early morning walk", "We went early while the tide was low to get as far north on the beach as possible without having to get wet feet. We saw some seals in the water and dolphins. The sea anemones were plentiful among the rocks and the cliff was were beautiful in the morning sun. There were also lots of surfers out. It was a beautiful morning walk.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Sea Lions!!!", "This is such a great area to walk and enjoy! We found street parking that was free and had a 2 hour limit but we should've parked in the parking garage and paid. 2 hours wasn't enough to enjoy this area. We walked out to the view point over the cave and enjoyed watching all of the people kayaking. You can actually walk down into the caves too, there is an entrance fee and the entrance is in the cave store gift shop, but we didn't go. We walked down towards the park and saw some birds in their nest and all of the sea lions! The kids loved it so much! We didn't know that there was a little beach so we didn't bring our swim suits, but we still let the kids take off their shoes and walked around in the water a little bit. There is a fun little cave to the side of the beach too. But I think the best part for us was watching the sea lions! There were so many of them! So much fun to watch. We were able to get pretty close too, but of course not too close! We could have easily spent the whole day in this area. Lots of shops and restaurants too! Next time we are in the area we will plan better!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Unique place! Loved it.", "Fantastic unique place. Dramatic sea views, seals resting on the beach, pelicans and other animals very actively in the area. One of the best nature places we visited in Southern California."], ["Reviewed January 22, 2018", 5.0, "The Perfect beach/park!", "La Jolla Shores beach/Kellogg park has it all! Gorgeous beach with great surfing and boogie boarding! Underwater sea park is the perfect place to snorkel and scuba dive. You can rent kayaks and go through the La Jolla Cove caves and visit the seals. Kellogg Park is very large and has plenty of room for people to picnic, play soccer and run around. The playground area has lots of fun stuff for kids to do. The La Jolla Shores Hotel has a wonderful restaurant with great food and great Bloody Mary's! Plus you can walk to the quaint town which has many great restaurants. My favorite is Piatti. The only problem in the summer is the parking. It's best to get there early and if not just be patient. It's worth it! We lived there on the beach for one year and it was awesome!\nShow less"], ["Reviewed January 22, 2018", 4.0, "Nice Beach-Parking Nightmare", "This is one of San Diego County’s nicest beaches. It’s good for the whole family. There is a grassy area if you don’t like sand. A short walk to the south are rocks and tide pools. We found a starfish last time we visited. It is also close to shops and restaurants. Parking is a problem. There is a small lot close to the beach. If that is full, you have to find parking on the narrow residential streets and possibly walk a long way. That can be an ordeal if you need to take a lot of stuff. Get there early.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Beautiful and accessible location", "Forget La Jolla Cove -- too crowded and good luck trying to find a parking spot. Go less than a mile north to La Jolla Shores Park and beach to find lots of parking and a very relaxed atmosphere. We walked on the beach, people watched, and just relaxed. My son even setup his hammock between a couple of the palm trees and read/relaxed while 'hanging out.' Definitely recommend to visit.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Palm tree lined, long flat beach great for families", "We visited La Jolla Shores Park late June. We were fortunate to find a parking spot just behind the beach, hence a short walk to our patch of sand with all of our gear.\nThe beautiful beach was packed for a Monday. The beach had ample life guards, who meant business. Restrooms are close by. Palm We will definitely go back next time we visit La Jolla.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Nice beach", "Nice beach with free street parking. Parking might be hard to find. Beautiful views and nice place to walk around or get wet in the waves."], ["Reviewed January 7, 2018", 4.0, "Great Walk in Cool Weather", "La Jolla Shores Park is a lovely place to walk especially during the cooler months of the year. One can never get tired of the beautiful views of the Pacific Ocean!"], ["Reviewed January 7, 2018", 2.0, "NOT GOOD FOR SURFER", "too many people that dont now how to surf and hit me on my head super upset. i really prefer pacific beach.and also mission beach ,so many option to surf"], ["Reviewed January 6, 2018", 5.0, "Beautiful", "Excellent beach with lots of space. Free street parking and outside showers. Waves are just right and plenty of shops and beach sport rentals."], ["Reviewed January 3, 2018", 4.0, "Busy typical beach", "Very typical southern California beach. There is a parking lot and some street parking, but in season it will be a challenge. The beach is large, there are lots of life guards, fire rings are few and you have to get them very early in the day. There is also a large grassy area suitable for picnics and there is a playground for children. All in all this is a great spot for holiday makers. You can walk from the beach to some local restaurants and bars and shops.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Perfect for a walk in December", "After living for more than 10 years away from San Diego, I had forgotten how nice it is to walk on the beach in December at La Jolla Shores. Our kids had a great time playing in the water and looking for crabs in the tide pools.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Fantastic Beach", "We vacationed in San Diego in October and found this beauty of a beach during our drive through La Jolla. There was no problem with parking because we had a temporary handicapped placard, but we did notice that aside from handicap parking, there was NO parking to be had, even on the side streets. Quite honestly, without the placard we would have driven right past this beach. Great place for families. Wonderful restroom facilities. We would have loved to have spent the whole day here had we had the time to spare. La Jolla sure knows how to take care of their beaches, and this one showed that special care.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Nice enough beach but lacking some of the amenities I've seen at other beaches", "Nice beach to visit on a warm December day. La Jolla gets very busy as the day gets on and it is not easy to find a spot if you don't get there early but it's a nice beach. We didn't plan ahead and didn't have gear that we normally take to the beach. Unfortunately, they apparently don't allow merchants near the beach area so our visit to the beach was fairly short. Surfers were out which was entertaining but the waves were not that good. Much better waves in the tide pool and Cove area. If you plan ahead, this is a good beach to visit though.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Great beach area!", "LaJolla has always been my favorite beach place. It is quieter and more family geared. Parking is just as difficult as other SD beaches, so go early!"], ["Reviewed December 22, 2017", 5.0, "Alway stunning sunsets at, above, and around La Jolla Shores Park!", "La Jolla Shores Park and Beach is long with shallow beaches perfect for walking and playing when the tide goes out because the shore becomes HUGE. A perfect place for sand castle construction, beach chair lounging, corn toss tossing, or just leisurely walking.\n\nTidepooling is really only possible at the far north and far south ends of the beach and only at very low tides. Be sure to watch tide times so you do ‘t get caught by changing tides and waves that knock you on your bum!! I’ve been knocked down when focused too much on sea anemones and not enough on the sea around me!!\n\nParking is available in the park’s parking lot or along neighboring residential streets.\n\nThere is a wonderful beachside restaurant at the far north end of LJ Shores beach, called Caroline’s Cafe. They have great food, generous portions and incredible views!\n\nEnjoy!\nThe photos below are photos of La Jolla Shores from the hillside just above the beach.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Walking my dog in the Shores area", "I live in the Shores area and wakbthere often with my dog. In Winter months you can walk the dog before 09:00 am and after 4:00 Pm on the beach.\n\nWinter months are not really cold in La Jolla, during the day it may start out at high 50 degree F and by noon it’s sunny and in the low 70s. Winds are gentle except when there are storms which is not often.\n\nThere is a small business district on Avenida de la Playa, the street that goes from La Jolla Shores drive to the beach. On 3 and 1/2 short blocks there are several good Restaurants and coffee shops serving drinks and food. There are two Mexican restaurants, one moderate, one low price serving food in disposable wares. There are two Italian restaurants serving good almost truly Italian food, both are good, Piatti have fancier setting with white linen table cloth and napkins and a very good sized bar. Osterica Romantica uses checker cloth table cloth and napkins. They’ve serve fairly authentic good Italian food in good sized portion, good pasta with sea food, risotto with sea food or with mushrooms and vegetable. If you like lamb, try the pasta with lamb. Meat dishes are all good, from\nThe Shores Park is quite nice in December, not so crowded as in the Summer. Parking is easier at the large public parking lot on Paseo Grande.\n\nYou can walk the dog on the beach and boardwalks before 09:00 and after 4:00 pm.\n\nOn Avenida de la Playa the street that goes to the beach from La Jolla Shores drive there are several good restaurants and coffee shops serving food and drinks with moderate prices and ambiance.\n\nOsteria Romantica is a fairly good Italian restaurant with checker linen table cloth and napkins. Good pasta, including linguine with sea food, risotto with sea food or with mushroom or vegetable. You can ask for other things and the cook may make it for you. Meat dishes include chicken, pork and beef, including osso Bucco. Fish dishes includes salmon, sea bass and scampi. Salad and Appetizers are good, including spinach salad topped with slices of Muscovy duck (insalata d’anatra) other restaurants on Avenida de la Playa include ,\n\nBarbarella serving pizza with the pizza oven behind the bar. You can see the pizza cook and the flame in the oven. They serve some Italian fares , but their menu looks more like and continental food. At Barbarella and The Osteria you can sit on the sidewalks in comfortable sitting with umbrella and outdoor heaters. You can sit in small outdoor sidewalk area at Piatti, or in a large garden area with large shade trees. The services and food at Piatti, Osteria Romantica,and Barbarella are all very good. The coffee shops are all good, serving small fares American or Mexican food. Going from La Jolla Shores down to the beach we have Cooper’s coffee shop and Market, the Shore Thing, and Rusty. Rusty coffee shop is mainly outdoor sitting with a very long bar counter with large screens TV to watch games like in the Sport Bar. Brick and Bell is a small coffee shop serving mainly coffee and some cooked to order breakfast and breakfast rolls or sconces. Next door to Osteria there is a small sandwich shop with a few table for outdoor sitting. At the end of Avenida de last Playa is the La Jolla Shores hotel. Their dining room and bar are right next to the boardwalk. You can sit in the dining room, the bar, or on the pool deck overlooking the There is a hamburger place across the street from Osteria Romantica. They serve hamburgers! At this time, in December 2017 Jeff Burger is closed for remodeling.\nAt the end of Avenida de laPlaya is La Jolla Shores hotel. The Hotel Dining room and Bar is right next to the boardwalk. You can sit inside the Dining room, bar or the swimming pool deck to eat and drink overlooking the beach. The hotel Dining room has very good food, moderate price. They also have good appetizers. You can eat, drink at the bar, the pool deck or the dining room. The hotel has parking under the building. If you eat in the dining room, you can park there free or at a much reduced cost. On weekends and everyday in the Summer parking may be hard to have in the La Jolla park and the business district. The hotel Dining room has more or less Continental menu , with somewhat moderate prices.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Great beach for little kids", "We love this beach for our little kids who are 3 and 5. There’s not much waves so the kids love to run in the shallow water. There’s a bunch of activities for the older and adventurous crowd also like kayaking and snorkeling. There’s also a nice playground here for the kids.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Earl morning walks", "La Jolla Shores is a great beach with several miles of sand and rocky shoreline. Low tide is the best time to visit. Dogs are welcome before 9:00 A.M."], ["Reviewed December 9, 2017", 4.0, "So peaceful", "I was looking for something really relaxing to do and stumbled across this place. I’m so grateful that I did. The sand wasn’t the best but everything else was perfect."], ["Reviewed December 6, 2017", 5.0, "Amazing Sunsets", "Very beautiful. I am partial to the west coast of Florida but this area is awe inspiring. Also a lot of eye candy."], ["Reviewed December 5, 2017", 5.0, "La Jolla sores For a beach day", "If you’re visiting and want to spend time at the beach Ja Jolla Shores is probably the best beach to go to for families , parking can be hectic in the summer but worth it. No pets alcohol or glass containers on the beach , we do have fire rings for the evening ( Wood-burning only) it’s OK to bring your own food onto the beach and enjoy picnic. Waves are constantly good lifeguards on duty most of the time.\nShow less"], ["Reviewed December 5, 2017", 5.0, "One of the better beaches in California", "Scenic, protected cove with generally warmer water temperatures than other surrounding areas. Plenty of pelicans enjoy the area as well."], ["Reviewed December 3, 2017", 5.0, "Great beach and a popular spot for many aquatic activities", "A broad sandy beach with (usually) gentle waves and lifeguards makes this place super popular among locals + tourists both ... Kayakers, divers, swimmers, strollers, and bathers all have fun this delightful charm of La Jolla (arrive early to get a parking spot, or stay nearby) — enjoy :))\nShow less"], ["Reviewed November 26, 2017", 5.0, "Nice!", "Great spot to sit down, relax and enjoy the day. Kids can run around free and even try some surfing or alike."], ["Reviewed November 23, 2017", 5.0, "California", "If you want to experience the Californian mood, this is the place, beautiful beach, crowd of surfer from entry level to acrobatic performances. Nico to walk on the little village where small surfer apparel shops live together with coffe shops. Experience the thrill to dream about a Californian villa at Sotheby’s estate.\nShow less"], ["Reviewed November 22, 2017", 4.0, "Lovely beach for all ages.", "Beautiful beach and a small playground close by. We were there on a week day and it was not crowded at all. The bathrooms are not centrally located but are fairly close by."], ["Reviewed November 21, 2017", 4.0, "Relaxing", "I like La Jolla shores because the parking is super easy, it's plenty big so no wall to wall people, and there's lots of room to walk or jog. There surf here is usually on the tame side, so it's about right unless you are a serious surfer. The biggest downside is perhaps that there is no 'boardwalk' so there's no easy access to food stands or surf shops. If you're looking for that, go to Mission Beach.\nShow less"], ["Reviewed November 15, 2017", 4.0, "beach beach beach", "This is a great beach, it can get crowded so make sure you get there early and set up camp. If it is busy they section off the beach, one side for surfers and the other for swimmers. Good food in the area too, and public bathrooms.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Quick trip to the beach", "Well we visit at the beach after our daughters softball tournament we had a day to do nothing and since the beach was close by we figured we’d stop by it was overcast and a little chilly but there were still people on the beach lots of folks doing kayaking look like they were gone scuba diving and we walked around it was nice to people seemed friendly lots of people were cooking or barbecuing I should say overall seems like a nice place I would definitely return\nShow less"], ["Reviewed November 8, 2017", 5.0, "Where walking near the sea is an art form", "La Jolla Shores beach, and the park that acts as a buffer from the residential district, could be the best combination of beachiness in Southern California. I say this because it works on so many levels. It may not be a beach of single track superlatives, but, as one spot that offers so much of what a beach should be, it has no peer on the entire West Coast.\nFree access and free ample parking with a short walk to the actual sand? Check. Rest rooms to change clothes and take care of business? Check. A children’s playground to appease toddlers? Check. Food and water activity concessions (including snorkeling and a fun ocean kayak excursion) within three blocks of the sand? Check. A grassy lawn that has enough space for a game of frisbee or sand-free eating within earshot of the waves? Check. A reasonable walk from where you park your car and where you park your towel to where you get wet? Check. Actual clean water and surf conditions that work for all age groups? Check. A lifeguard crew that knows what they are doing and keeps board surfers away from waders? Check. Powdery, frequently raked sand that can create a fantastic drip castle along the water’s edge? Check. A natural arc to the shoreline that absolutely demands to be walked? Check. High-end architecture along a portion of the shoreline that alliows the middle-class to dream? Check. An actual working pier (on the northern extreme of La Jolla Shores - sometimes referred to as Scripps Beach) that looks great in sunset photography? Check. Tide pools (at either end of the mile-long sandy beach) to explore at low tide? Check. Wildlife you can see (like seabirds) and maybe touch (like squiggly sand crabs)? Check. At least one beachside hotel that you can reserve the next time you visit? Check.\n\nI love superlative California beaches such as San Francisco’s Baker Beach for that amazing bridge in the background, Carmel by the Sea for its incomparable white sand, Malibu for its legendary surf breaks and sculpted beach bodies, the Santa Monica pier, the Santa Cruz Boardwalk and the Hotel del Coronado. But if I had to choose one California beach on which to play (and walk my dog into the sunset) for the rest of my days, it would be La Jolla Shores.\nShow less"], ["Reviewed November 8, 2017", 5.0, "big sandy beach, great sunsets", "Nestled between the cliffs to the south and Scripps pier to the north this is a great summer beach for wading, boogie boarding, and surfing. Parking is a challenge so arrive early or wait for a spot. Also traffic in and out of La Jolla is rough during the weekends.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Kayak in La Jolla underwater park", "Really enjoyed kayaking , The staff at EverydayCalifornia were very friendly and helpful. i felt safe. Our guide was Joe, he pointed out alot of interesting things about the under water and shore. He kept an eye on the waves, and we were able to get close to the caves, The coastal walk was awesome, Enjoyed where the sea lions hang out , and to go further south and see each section different, Watching the surfers... great. We ate several times at Coopers at the corner of Avendia Del La Playa, We were treated very well and food was great, I'm a new fan of Acia Bowl., We stayed at La Jolla Shores Hotel, again treated well, and right where the action was.\nShow less"], ["Reviewed November 6, 2017", 5.0, "AWESOME energy and the people watching is fantastic. Situated on on of the best beaches in Southern California!", "A great spot to hang out and just watch the \"wildlife\" of La Jolla Shores. Clean and family friendly this park sits RIGHT on the Pacific Ocean!"], ["Reviewed November 3, 2017", 5.0, "Lovely White Sand Beach", "This beach is beautiful. Many people must go to the Caribbean to see such beautiful beaches. This beach is clean and has soft white sand. There are many activities happening on the beach: snorkeling, paddleboarding, scuba lessons, children's park and games being played. The surf is not very rough. There is a border wall and benches for you to sit on if you choose not to go into the sand. Restroom and shower area is clean. And the views up the coast are priceless. A wonderful family visit.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Peaceful walk", "Just love this beach. First time I went here. Nice sand gentle waves and ocean breezes. Good for walking and enjoying the day"], ["Reviewed October 28, 2017", 5.0, "First trip diving in the Pacific SoCal", "Dived with La Jolla Dive yesterday. Had a fantastic time. It’s my first time diving on this coast of the Pacific (US west coast). Tiffany was my guide. She was great – finding lots of things to see and showing features I’d have missed. We dove in a marine preserve of kelp and grasses, then along a low wall on the second dive. Saw dozens of lobsters in crevices in the rock and many fish I wasn’t familiar with native to the Pacific. Tiffany found many small animals in the sand and wall: crabs, shrimp, octopus, flat fish, scallops. The water was cold for me because I’m used to the Caribbean. But LJD’s cold water gear kept me comfortable.\n\nThey are a small operation, but the whole crew is friendly, helpful and knowledgeable about the diving in the area. I’ll dive with them again the next time I’m here.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Best beach in california!", "Came here for a party with some friends. Loved the white sand and pretty water! Perfect place to hang out."], ["Reviewed October 25, 2017", 5.0, "Seals!", "A beautiful and scenic place to visit. Seals rest on the rocks near the ocean and sing out! The coves are beautiful and I would return. A charming park with lots of benches with ocean views."], ["Reviewed October 25, 2017", 4.0, "Remember sandal when it's hot", "When the temperature hits above 3-digit numbers remember your sandals. The sand becomes very hot. As allways the waves out from the Pacific Ocean came rolling in. Nice and cool."], ["Reviewed October 25, 2017", 3.0, "Nice Beach but Not Great for Kids", "Nice beach but the surf can be a little bit much for children. Restrooms are good. Would be better if people would not be so trashy. Would come to the beach again but would take kids to farther down the beach where the playground is."], ["Reviewed October 24, 2017", 4.0, "Nice beach and the water was nice.", "Nice beach. Wayer was great. Has change areas. Has no food or drink places nearby so come prepared with your own food and drinks."], ["Reviewed October 21, 2017", 5.0, "Beautiful Beach", "Loved this beach! The facilities were easy to get to. Could use a sweep or two under the shower heads to clear the amount of sand that gathers there. But, not enough to really complain about. The playground is fun, the beach is well kept, lifeguards a plenty. The water was very, very.. stress on the VERY cold. But that didn't stop us from getting in. :)\nAll in all, loved this beach.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Great Beach", "This was a great family beach. It was nice having showers and bathrooms close by, plus the playground."], ["Reviewed October 16, 2017", 5.0, "Camping", "Beautiful! Being from out of town and never spending time at the ocean this was an amazing place to stop and see. Recommend for anyone on vacation or driving through."], ["Reviewed October 12, 2017", 3.0, "Average beach, enjoy more fun down at The Cove!", "Pretty busy beach. Not as exciting as going to the cove. Seems fun but it was crowded and the parking is difficult in this area."], ["Reviewed October 12, 2017", 5.0, "The most crowded and active beach in my vacation", "Beautiful big beach with hot sun for tanning the beach providing free parking and shower places , nice and smiling people on the beach , families and they kids so friendly and lovely people at beach."], ["Reviewed October 11, 2017", 5.0, "Great beach!", "Our first time at this park in July of 2017. We were not disappointed. The cliffs surrounding the park are beautiful! The sand id super soft, there is a playground for the kids and a nice bathroom/shower house. We will be back next time we are in San Diego!\nShow less"], ["Reviewed October 7, 2017", 4.0, "Surprise find", "Stopped to find a restroom & came upon a quaint little shopping area, with several restaurants. Found one all decked out (over the top!!) for Halloween. Great fun. Good drinks & a lovely cheese tray!"], ["Reviewed October 6, 2017", 4.0, "pronounced '' La hoya'' ..A lovely ocean beach with free parking..admission..showers..no seals or sealions", "An inspiring sand beach in San diego..with excellent views for a romantic sunset and swimming..kayaking.. there is a waterfront park with kids playground ..many free parking spots and showers and restrooms..there are no seals or sea lions seen frequently..it is 10 minutes away from the famous attraction of La Jolla cove\nShow less"], ["Reviewed October 5, 2017", 4.0, "Lovely Beach and Area", "Perhaps not quite as lovely as La Jolla village across the bay. This is still one of the most beautiful areas of Southern California. Some good restaurants nearby."], ["Reviewed October 3, 2017", 5.0, "Nice Beach area with wide sand and parking", "Great place for an afternoon on the beach. Lots of space for pitting down a blanket and throwing the frisbee."], ["Reviewed October 3, 2017", 5.0, "Awesomely Clean Beach & Views!", "This is one of the nice and cleanest beaches in San Diego though it's in La Jolla. However, get there really early, as the free parking, fills rather quickly! There really is no street parking and the streets are always filled will residents and it surfers so, please take my word for it. I will also say, they've the nicest, cleanest restrooms, I've seen besides a few other places but, again, take my word for it. You will enjoy it, so long as you arrive early enough. YOUR children will simply never want to leave and, you will understand why. Plus, after you are done, you can either walk a few blocks, and eat lunch and ice cream, or, if you desire, drive it, if you can find parking, and then do the same. Either way, you will have a Grand day because you are in San Diego and La Jolla and, it doesn't get too much better than This! Plus, once your done, you can drive a couple miles, and look at the seals at the Children's Pool at the Cove in downtown La Jolla, Safe Travels!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Outrageous Beach Park", "We come from Oregon where we have great beaches, albeit very cold water. Bring your wet suit and you are golden. Without it, hypothermia.\nIt was so fun being at La Jolla Shores Park with our 3 year old grandson. The play equipment was great, there were many places to sit, bathrooms were very available and everyone was having fun. Great day at the Beach.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Beautiful", "Great views and beautiful beach. Good for a casual walk or serious hike. The whole area was very clean. Not really crowded when we went in September."], ["Reviewed September 28, 2017", 5.0, "fantastic beach", "We spent about an hour wondering and enjoying the beauty of La Jolla beach at the Shores Park. Such an amazing setting to experience. Such a nice grassy area and great public facilities. We will go back!"], ["Reviewed September 28, 2017", 4.0, "Nice sandy beach.", "Great place to surf or rent a kayak and paddle over to La Jolla cove. Restrooms are decent. Water is quite cool most of the year."], ["Reviewed September 28, 2017", 5.0, "It's great to be back!", "After visiting here in 2015 with just the wife and me and really enjoyed it. We just got back from a vacation with the kids this time and loved it even more. This was our favorite beach of the three we visited on this trip. Parking wasn't as bad during the week. The facilities are great. The beach was clean. The slope into the water was perfect for younger kids. We had a great time. We will be back!\nShow less"], ["Reviewed September 26, 2017", 5.0, "Surfing", "We ended in surfing here today and it was great! Not a ton of people . Everyone is very friendly. The beaches are clean and beautiful. Tons of restaurants in the area. If you want to surf and want lessons or a board go to the surf diva and ask for Justin to do your surf lessons. Decent price and was a great time!\nShow less"], ["Reviewed September 26, 2017", 5.0, "What a beautiful park", "A lovely parkland close to the city. Great place for a day out with a picnic. Must make the time to visit if you're in San diego"], ["Reviewed September 25, 2017", 5.0, "Busy Beach", "Free parking, lots of beach, in a great location, suggest a stop on your trip. Restroom facilities are available as well."], ["Reviewed September 23, 2017", 5.0, "Amazing place", "Such a lovely place, went kayaking, (seals pop their heads out the water next to you kayak to say hello!) also great for surfing as some medium sized waves here, nice feel about the whole place and not too crowded. Could definitely live here if my bank account was healthy!!!\nShow less"], ["Reviewed September 21, 2017", 5.0, "Great Beach for families", "La Jolla beach are very nice, we saw lots of families enjoying great times together here, lots of divers too,\nWe saw lots of sea lions, especially one young silly sea lion, keep herself away from others, enjoying the sunshine on the beach, we will come back again one day.\nShow less"], ["Reviewed September 21, 2017", 5.0, "West Coast Vibe!", "Every time I get the chance to visit from the east coast I come here to see the surfers, take in the cliffs and sand and west coast vibe. Public bathrooms, ice cream shops, play area for the kids.... and then turn around and see the amazing site of the palm trees and houses that hang onto the mountains.....\nShow less"], ["Reviewed September 20, 2017", 5.0, "Great beach", "We visited for the sunset and it didn't disappoint. The beach was clean, not to crowded and there was a playground for the little one. Highly recommended"], ["Reviewed September 20, 2017", 4.0, "Lots of surfers", "Nice wide beach with lots of free parking. Or was a cloudy day though so that may explain the ample parking spaces. Many many surfers here. Fun people watching."], ["Reviewed September 20, 2017", 5.0, "it's the beach.. what else do you need", "Surf, sand and sun. What more can you need. Well maintained beach, nice facilities. Enjoyed the beach and sun. Great pace to watch the morning surfers. vert relaxing and a great place to walk."], ["Reviewed September 20, 2017", 3.0, "very normal beach", "This review describes the actual beach \"La Jolla Shores Park\" which is not located within the \"Village of San Diego\". If you are staying in the village. you have to walk 20-30 minutes to the beach or take the car (10 minutes).\n\nI did not like the beach. There were no shops or restaurants at all, it was not even possible to buy water or ice cream. Then, the surroundings were quite dry and yellow. Comparing to the well watered parks in the village, plants and grass appeared quite dry at the beach. We went back after 10 minutes.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Fun visit", "We stopped to see the seals and sea lions, but apparently were not in the right area. The park itself was really neat. Activities for nearly everyone. We will stop again."], ["Reviewed September 16, 2017", 4.0, "Beautiful but busy park", "The park is beautiful, but we arrived on a Friday afternoon after driving hours in rush hour traffic to be in more heavy traffic. The final touches for a volleyball tournament were being completed on one end of the park and what looked like a wedding venue was set up on the other end with guests arriving, so parking was near impossible. The temperature was 90+ and we were tired, so when we finally found a parking space, we simply got out of the car and walked a short distance and took some pictures before continuing our drive to San Diego.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Awesome & Relaxing Beach!", "La Jolla Shores is a great place to bring the family with miles and miles of awesome beachfront views as well as a pretty nice selection of places to eat and drink as well. Tons of people surfing or grilling on the beach so its a pretty related environment.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Awesome, non commercail beach experience", "Great family beach. No development whatsoever. Have fire pits in the sand built with blocks. Seemed to be a lot of college kids from nearby USD and a lot of families. Very clean, safe, great California beach experience. Retail, restaurants about a 5-10 min walk into the village.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Best Kayaking on the California coast", "I went Kayaking today, first time in like 8 years. Today was a bit more work than I remember, pulling out the kayak dropping it on the shore, finding parking, setting up. The launch wasn't pretty as I was a bit rusty, however I made it out without flipping. Once I got my rhythm back it was a blast! Water temp was perfect air temp was ideal, and the water wasn't too awfully rough. I have had that kayak many many places along the California coast and I have to say La Jolla is the best. I got to go into and ride a wave out of Sunny️ Jim's cave, I also got to go into one side and out the other of not just one but two other caves multiple times each. The seals will come up right next to you and check you out. The water was quite clear and I could see so many of the Garibaldi. I floated around and enjoyed a devils triangle by Mikkeller brewing. Sorry no pics my wet bag was a bit leaky and I had to turn off my phone. Hopefully I will be able to use the back key again.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Good swim beach. Wide , and lifeguards", "Large swim beach, calm waves, lots of leopard sharks to see in shallow waters. Life guarded, with showers , parking and restrooms. Walking distance to the shops in lower La Jolla."], ["Reviewed September 9, 2017", 4.0, "Great place to access beach", "Went diving off the park with a local guide. There is a big free public parking lot and facilities. Nice views if your looking for public beach"], ["Reviewed September 8, 2017", 5.0, "Great clean beach and area...", "Spent one day on the beach while visiting on business....water was clean with good waves . The beach itself is beautiful and clean as well. Arrived at about 10 on a Sunday so it was pretty crowded but found several local places to rent chairs and boards. Bathrooms are convenient and there is a rinse off station right across the street. Would definitely recommend and return. The waves were great to ride in and soak in the sun. A few nice local lunch spots too.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Beautiful beach with swimming and parking.", "This beach is perfect - one can easily swim in the low breakers, shower off in a beach house, and even park if you get there early (8-9 AM). Nice for SCUBA launching, also."], ["Reviewed September 6, 2017", 5.0, "lovely shore", "nice for strollign along shore. Beautiful sight and comfortable for walking along the ocean and looking at the sea."], ["Reviewed September 6, 2017", 4.0, "Great San Diego beach, awesome sunsets", "Very nice stretch of beach in La Jolla. Great lifeguard coverage. Can be (always is...) very crowded in the summer and holidays. Now that school is back in session, crowds should die down a bit. Perfect sunset spot- beach is well aligned facing west with sun always setting over the water! Decent number of bathrooms on both sides of the beach. Parking usually tough to nightmarish.\nShow less"], ["Reviewed September 6, 2017", 5.0, "La Jolla Shores Park in San Diego", "What a great place to visit, look at the ocean and have a nice lunch. The weather is great the and scenery is even better."], ["Reviewed September 6, 2017", 5.0, "Energy", "In this place you will have new energy I think that, is very good and clean also thy having please for kids"], ["Reviewed September 2, 2017", 3.0, "Water, Sand and Sun", "We are in town for a family event but had a couple hours to ourselves. Drove here to kill some time. The area is clean and everyone seemed to be enjoying themselves. You can tell families were making a day of being there. Lots of cookouts and smiling faces. Just a bit too busy for my liking but it is Labor Day weekend. If the beach is your thing, you'll enjoying spending time here. Traffic and parking are both tedious but I find drivers to be very patient here, no rude honking, tailgating and flipping of the bird like I've seen in eastern states. But if traffic and high speeds bother you, use Uber and save yourself the stress.\nShow less"], ["Reviewed August 31, 2017", 5.0, "The beach is Clean", "Its enjoyable to go the beach when its clean, neat and well cared for. This is what my experience has been at the Shores. I feel safe and very relaxed and comfortable here. Something you seldom get in southern California."], ["Reviewed August 29, 2017", 4.0, "day at the beach", "Lovely beach..although it was busy as it was holiday season and a Sunday.Very clean beach....lifeguards at regular intervals along the seafront.Perfect sea for swimming or surfing"], ["Reviewed August 29, 2017", 5.0, "Great beach.", "We loved this beach. Very family friendly. Kids swam in ocean and enjoyed this beach very much. Would recommend for families to spend the day."], ["Reviewed August 28, 2017", 5.0, "La Jolla Shore", "One of the most beautiful intimate beaches in California. Crescent-shaped with Scripps Pier on the end and the La Jolla Palm tree silhouettes on the other. Great walking in the morning. Great from October to May, when crowds are fewer."], ["Reviewed August 28, 2017", 5.0, "Family friendly with lots of facilities", "Great place to enjoy the shoreline, small wave-jumping and sand-based activities including picnicing! But please take into consideration that it is like all beaches lining the Pacific Ocean in California — the water is really cold except maybe during the month of August when it warms ever so slightly to 72 degrees or so.\nShow less"], ["Reviewed August 27, 2017", 4.0, "Nice day at the beach", "I came here with my family of 4 and really enjoyed this place. Water was clean with good waves . The beach itself is beautiful and clean as well . Plenty of room to find a spot. Bathrooms are convenient and there is a rinse off station right across the street. Parking could be a little tough at certain times of the day. Very family oriented and pet friendly. Would definitely recommend and return. The waves were great to ride in\nShow less"], ["Reviewed August 27, 2017", 5.0, "Favorite beach in San Diego", "Our favorite beach visited during our week in San Diego. Very family oriented. Water is blue and crystal clear. Sand is light and fine. We rented an umbrella, chairs and boogie board from a shop a couple of blocks away. Pretty crowded but it's a huge, long beach - enough space for everyone. Lifeguards on duty. Nice green park is adjacent to the beach.\nShow less"], ["Reviewed August 26, 2017", 3.0, "Nice beach", "We arrived at around 11am on Saturday, the free parking was full, curb parking was for 90 minutes only, so we end up paying $20, so be aware. There was a dead seal on the beach that authorities didn't bother to clean! Other than that the beach is clean and kids had a great time in the shallow waters.\nShow less"], ["Reviewed August 24, 2017", 4.0, "Great beach for any activities", "This beach is perfect for all tastes. Long walks along the ocean, very good for surfing and swimming. Several companies offering kayaking deals. Several nice picnic areas where you can use your own BBQ. Very safe for children. Two places for showers and toilets . Lifeguards on duty all along the beach.\nTwo minor weak points : the parking is very difficult if you show up after 10.00 am . They should also do a much better job cleaning the algae that are overtaking part of the beach mainly at low tide.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Large, attractive beach", "Parking is extremely difficult so I would recommend an uber or a walk down to La jolla shores. There are numerous lifeguard stations all down the beach so swimming is easy and safe, especially if you have young children. The sea is clean and the waves were decent if not huge on the day we were there. There are some restaurants and shops just off the beach serving decent enough food/ice cream etc. This is a great place for a day out!\nShow less"], ["Reviewed August 21, 2017", 5.0, "Beautiful beach!", "This is an ideal beach. Lots of fine sand. Long ocean front. Close parking and bathrooms. Very relaxing place."], ["Reviewed August 19, 2017", 4.0, "Our favorite beach in the area", "We visited several beaches in the La Jolla / San Diego area and this was the favorite of our group so when asked where they wanted to spend our last beach day, everyone unanimously wanted to return to Shores. Yes, the beach can get crowded, parking is a challenge, and the shower / bathroom facilities are limited (and not terribly clean during our visits) but the beach itself is great. Plenty of sand which extends far out to sea, great conditions for boogie boarding and surfing (or watching surfers in our case), and the natural surroundings are quite beautiful as well. Because the beach is so big, once you make it to the beach it is easy to find your own space and not feel too crowded-in; we had plenty of room to romp and play.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Fun Beach", "When we discovered La Jolla Cove had no beach we LYFTed down to La Jolla Shores.Active fun family friendly beach."], ["Reviewed August 17, 2017", 4.0, "A nice beach for everyone", "This is a wonderful clean beach with free parking but one does need to wait as its crowded most of time . Its a great places for everyone. One can sit or stroll r do surfing on beach. One can also sit on grass area with tables around and can enjoy the views and gentle breeze. Its a nice beach to spend the day.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Great Beach", "The beach is great and we saw a group of Leopard Sharks only a few feet off shore. Amazing. Plenty of local parking. Be warned, the water is cold even in the summer."], ["Reviewed August 14, 2017", 5.0, "Nice, clean beach with lifeguards", "A packed weekend beach with plenty of people watching. Great views of people taking selfies then face plantinmg when they trip in the sand."], ["Reviewed August 13, 2017", 5.0, "Fabulous, clean family beach!", "A wonderful beach with FREE municipal parking (if you can be patient!), clean sand, wonderful family friendly crowd and perfect waves suitable for kids and adults of all ages. We had a great afternoon here, and the beach is within walking distance of food and shops. And the bathrooms were fairly clean compared to other public beaches.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Quick stop on our way to La Jolla Cove", "While visiting San Diego, we decided to go to La Jolla to see the seals and sea lions. We asked our awesome Uber driver, Thomas, which area would be best to go to first. He said if we wanted to see the seals and sea lions it would be best to go to La Jolla Cove first. Undecided what to do, he drove us by La Jolla Shores Park so we could see it and have an idea if we wanted to come back to it before leaving La Jolla (our hotel was 20-30 minutes away). He pulled the car to the side of the parking lot so I could jump out and take a picture. The beach, the ocean and the views were all beautiful!!! The beach was also pretty crowded. Thomas then drove us to La Jolla Cove were we spent the rest of the day taking in the beautiful scenery and watching the seals and sea lions.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Great Beach, Surf, limited parking", "Great beach and surf, not too much seaweed. Get there early on the weekend/holiday, the parking lot fills up fast."], ["Reviewed August 9, 2017", 5.0, "Nice park", "This is a nice park to go surfing, sit on the beach suntan and relax, there is also a grass area with tables, the bathrooms are clean, it's a nice place to go to, parking is hard to find."], ["Reviewed August 8, 2017", 2.0, "Bad day at the beach", "Spent many a day/night at this beach back in the day. Now, parking is ridiculous at any time of day, all days. There on a Friday and was elbow to elbow. Sad."], ["Reviewed August 3, 2017", 5.0, "Families and surfers welcome!", "La Jolla Shores offers a clean, beautiful setting for a day at the beach. Well patrolled, visitors are directed to either a surfing area or a swimming and playing area. But just enjoying the sand and sound of the surf are good enough for me! Be patient when looking for a parking spot in the very convenient (free) lot. Perhaps after 2:00 is the best time of day.\nShow less"], ["Reviewed August 3, 2017", 5.0, "San Diego trip", "My 17 year old son took a surfing lesson at this beach and park, it was a wonderful experience. the park had restrooms and close by restaurants and stores"], ["Reviewed July 30, 2017", 3.0, "good beach for children", "Beach was clean and easy to walk as we watched our granddaughter enjoy the waves. The signs about where children should be was not clear."], ["Reviewed July 27, 2017", 5.0, "This place Rocks!", "Simply put, La Jolla Shores Park is very family centered and is amazing. Be prepared to have a great time and stay all day long. Mark"], ["Reviewed July 25, 2017", 4.0, "Took in some quick sun while on business", "Took a break from work. Nice little beach area. Sand was clean. Water was nice, very busy with people. Flat and easy to walk beach. About a mile total I believe. If not from West coast, expect lots of kelp to wash in. Deal with it, it is a nice beach. Large free parking lot that fills up, but if patient can usually find a spot. Also lots of free on street parking as well.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Lots to See and Enjoy", "Our family, with 5 teenagers ages 15-18, came to La Jolla on a family vacation in July. We stayed in Del Mar, and La Jolla Shores was the closest beach to our hotel. While there, I took some pictures of my Senior in High School, and for our home decor. We enjoyed the less crowded area north of the Ellen Browning Scripps Memorial Pier, and there are tide pools to explore! We saw several tiny crabs, a couple Snowy Egret's fishing, a whole lot of barnacles, and a sea slug! The beach has several toilets, showers and sinks.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Beautiful beach", "Great beach. Very crowded. Terrible parking. One way streets and requires a bit of patience. Lots to do in the area, including shopping and sight seeing. Love La Jolla!!!"], ["Reviewed July 22, 2017", 4.0, "Nice beach, nasty bathrooms", "Went twice, once later in the evening, parking lot was almost empty, so parking was great! There were firepits on the beach, or you could bring your own, that was nice. Water was warm. Second time, used the bathrooms, they were disgusting. Not only was there urine and feces all over the toilet and floor, but there were used femine products laying on the floor and it smelled like you were IN the toilet, so gross! I dont have a weak stomach, but that was bad. They do have a designated area for surfers, we were told to move down the beach, twice, but didn't. We just told the kids they couldn't go too far into the water, they were fine with that. We had too much stuff to pack up and move about 100 yards down the beach where it appeared more crowded. So bottom line, I would suggest going later in the day and into the evening. The sunset was absolutely beautiful.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Beautiful beach", "Great place to spend an afternoon. Beach is beautiful however, does get fairly busy. Parking can be tricky, if you have a full day to spend here head over in the morning to get a good spot."], ["Reviewed July 20, 2017", 4.0, "Beautiful Beach", "Very nice and clean beach, loved it and the kids and family loved it as well, don't be discouraged if you wake up in the morning seeing clouds, the go away right around noon!"], ["Reviewed July 20, 2017", 5.0, "Great Time!", "Popular electronic music playing in the background, Sun glowing, the Pacific Ocean lapping on the beach, Seals and Sea Lions in the distance, what more could be said? Throw in a cocktail and its a picture of paradise."], ["Reviewed July 20, 2017", 5.0, "Stumbled upon this!", "My daughter wanted to put her feet in the ocean. This beach seemed local and not so crazy busy. There are beautiful houses and easy to get around. Of course it was a Monday, but I defiantly would like to go back."], ["Reviewed July 20, 2017", 5.0, "Vacation", "La Jolla Shores is one of the most beautiful beaches we have visit. The water is clear and the sun set is amazing."], ["Reviewed July 18, 2017", 5.0, "Beach, waves, surf and sun equals amazing fun!", "This beautiful beach has it all!\nFun for families, couples, singles! This beach has lifeguards that watch out for dangerous currents, rip tides and lost children! Plenty of surfers to watch, take a long stroll on the shores or sit on the wall, and watch the world go by.\nJust know there are no refreshment stands, so bring your own cooler, filled with food and water/ soda. Alcohol is NOT permitted!\nDon't forget your sunscreen and sunglasses\nShow less"], ["Reviewed July 18, 2017", 5.0, "My Favorite San Diego Beach For Kids", "This is the perfect beach for families with kids or peeps who want to learn how to bodyboard or surf. The waves are usually good with minimal riptide. They have tidepools when the tide is out, and you can often see small harmless sand sharks at the north end by the pier (they quickly swim away if you try to touch them.)\nShow less"], ["Reviewed July 18, 2017", 5.0, "Busy but fun beach location", "Enjoy a day at the beach here. There is a nice children's park. It's a long sandy beach. It will be crowded in the summer months."], ["Reviewed July 18, 2017", 5.0, "Beautiful Beach", "Beautiful beach for just lazing about, great for families, its best if you want to park your car nearby to arrive before 9AM as it gets very busy after that and you have to park on side streets, the parking is free though which seems a rarity these days.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Summer Beach Day", "La Jolla Shore Park is best visited if you arrive in the morning. Parking is very limited but if you arrive before 10am you should be able to park. The beach is nice and the water is clear. We are from the Baltimore area and the water temp is normal for the Atlantic the early summer. There is plenty to do: sea kayaking, snorkeling and suba diving are just getting some sun on the beach.\nShow less"], ["Reviewed July 15, 2017", 5.0, "one of my favorite beaches!", "i love this place...for the view, the people and even the odd seal that shows up from across the waters. i go here several times per year and each visit is magical."], ["Reviewed July 11, 2017", 2.0, "Zero parking, very narrow streets", "Be prepared to park on the street and walk forever if you decide to come here during the summer months. We drove around for 30 min and literally found zero parking within a mile of the beach so we left. Pick somewhere else to go unless you can be dropped off or go very early on a weekday\nShow less"], ["Reviewed July 10, 2017", 4.0, "Enjoyable", "We took the family here and enjoyed the beach.. The water is dang sure cold and takes a while to get used to but we had fun... seen some seals as well"], ["Reviewed July 10, 2017", 4.0, "Relax in the Sun", "The La Jolla beach is a great place to relax - with warm sun, slight sea breeze, and sand pipers. Just throw out a beach towel or chair, apply the sun screen, lay back and enjoy. Take a break from the workday by sneaking out early, grabbing a sub, chips and beverage - you are all set.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Family trip", "Beautiful and clean beach. My family always has a great time here. Only downside is parking is hard to come by."], ["Reviewed July 9, 2017", 5.0, "Nice beach for swimming and boarding", "Saw the beach from the cove area and it looks great. Only problem with the beach is parking, so be early or patient. Finally got a parking spot, sorry to say there's no Cally laided back attitude when fighting for a parking spot. Yet to be honest it's worth the wait. Nice beach with plenty of lifeguards to keep the order. Swimmers to one side and boarders to the other. The park rules are simple and common sense which makes for a very relaxing atmosphere. It was a crowed beach yet it didn't fell that way since everyone was there to relax. Good amenities like bathrooms, showers legs or full body and some green space. One rule to beware of is no dogs allowed on the beach. You can grill out on the beach or picnic which can help with a vacation budget. Also no alcohol allowed on cally beachs, unlike Flordia. maybe why the beachs are so peaceful, no bodies hangry or drunk.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Fun in the Sun", "Want to take your friends, family and children to experience San Diego's premier day at the beach. The Shores is perfect for you. This guarded sandy beach is large and the surf inviting. This is San Diego's family beach for swimming, bogge boading, diving\nAnd surfing each and every season. But Summer is the best of the best.\nShow less"], ["Reviewed July 7, 2017", 3.0, "Couldn't find parking", "We visited the cove in the morning and then plan to go check out the shore. We couldn't find parking when we got there anywhere. We looped around the neighborhood and made the mistake of entering a what looks like a free parking lot next to the beach. We got stuck because other people were also looking for parking and wasn't moving. When we got out, we just left. So, I can't tell you much about the shore except that it's hard to find parking if you go there in the afternoon.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Amazing Park! Fun playground for the kids with perfect beach views.", "Just loved the park and the beach! My 3 and 5 year old boys played at this park next door to our hotel every day of our stay always for at least an hour. Fun beach/lifeguard themed park with some unique features and the cool whale sculpture make this a fun and unique park.\nShow less"], ["Reviewed July 4, 2017", 4.0, "Good beach, poor parking", "Nice, clean but extremely crowded beach. Poor parking facilities in terms of being able to handle peak season."], ["Reviewed July 4, 2017", 5.0, "Day at the beach", "We absolutely loved this beach. Clean restrooms and outdoor showers. I love that they divide the area for swimmers, riders, and kayaking. Lots to do and see. Spend the entire day enjoying the water and built sand castle. Family and kid friendly."], ["Reviewed July 4, 2017", 5.0, "Beautiful relaxed beach", "Another of my travels brought me for the first time to this relaxing and beautiful beach on La Jolla in San Diego California. The parking space on this place is limited I believe to a maximum of 100 vehicles if I'm not wrong, besides that there are Parking spaces you cannot occupy as they are for the emergency vehicles or parking permit holders only.\n\nThere are not that many restaurants close by nor convinience stores, the nearest one may be at least 600-800 ft away from the beach park.\n\nIt is easy access beach and has excellent bay watch personnel that are almost at any time available to assist any person that may need their services.\n\nThe beach patrol is also at service while enforcing the law in these relaxed beach.\n\nWhy do I say relaxed beach, everyone seemed to be just pleased and enjoyed not only the sea nor the waves but the actual peace and tranquility of this place, even that it was crowded it wasn't too noisy or too disturbing.\n\nI saw that there were people playing ball, chanting in bonfires, playing musical instruments, painting, doing photography, playing in the sand and many more activities, I stayed for a couple of hours enjoying the freshness of the shores while watching the beautiful sunset on the horizon.\n\nI will definitely recommend you all to visit this place if you want to have a good time with your family or even by yourself.\n\nP.s. Grills are welcomed in this place, so bring your favorite steaks too.\nShow less"], ["Reviewed June 29, 2017", 5.0, "One of the Nicest Beaches", "I love this beach! It was super busy this time when I visited and parking is horrendous. Prepare to park a ways away and walk down to the beach. Still worth it. Depending on weather the lifeguard towers are limited and you can only swim in certain areas. This is a great area for surfing!\nShow less"], ["Reviewed June 29, 2017", 5.0, "Spectacular", "A must visit place as it has most beautiful views in the world. Many restaurants and unique small shops. It’s just a feel good wonderful place"], ["Reviewed June 28, 2017", 4.0, "Great beach", "We just visited for the first time and were impressed. Parking can be challenging on the weekends, so be prepared to park and walk. That said, this is a great beach with extremely attentive lifeguards who work to keep both swimmers and surfers safe."], ["Reviewed June 27, 2017", 4.0, "Beautiful", "Great beach but very busy either get there early or be prepared to walk FAR! We went and saw the seals after."], ["Reviewed June 26, 2017", 5.0, "Beautiful busy beach", "Lovely beach, well taken care of and very present lifeguards. On a Monday morning in June I found parking pretty easily at 9 am, but things filled up fast. Public restrooms were even pretty clean."], ["Reviewed June 23, 2017", 4.0, "A Relaxing Walk on La Jolla Shores Beach", "My husband and I went for a two hour walk on the beach last week-end, June 18.We love this beach because you can walk the entire length and do a return trip in that time or less at low tide.It was packed with people because it was Father's Day. People had day tents and shelters set up and kids were having so much fun running around digging holes (be careful not to twist your ankle in one) and swimming. The water seemed cold to us, but we are used to a heated pool. The ocean water temperature is usually in the 60s in the summer months...sometimes closer to 70 by Fall.\n\nThere are a couple of lifeguard towers and a jeep that patrols the beach. I saw a rescue boat with 8 hang-on bars for rip-tide swimmers and surfers who get caught out too far and need to be rescued. I also saw several surf instructors for children demonstrating how to use a surfboard and the precautions necessary to be successful.\n\nIf you are a sun-worshiper, you might like to spend the day, but sit under a large umbrella so you don't get too much exposure. Many people were very red, and probably didn't apply an additional coat of suntan lotion (50 block is best) after swimming.The sun seems very intense here. You might like to take a camera to capture all the fun moments... protected from moisture, sunlight and heat .\n\nI wore hiking boots and a hat on the sand only because we were supposed to go hiking first, but were distracted by this beautiful day and walked on the sand instead. I'm glad I did. Something bit/ touched my husband's toe on his right foot (probably a jelly fish). He complained and later his whole toe and foot became swollen and covered with blisters. He went to Urgent Care at Torrey Pines Scripps Hospital for an antibiotic shot and bought a strong antibiotic cream.Although an unusual event, there are small bees and stinging things around. That is why I normally wear flip-flops.\n\nWe just love the freedom of the beach. Probably what I liked least was the amount of seaweed washed ashore after the last high tide That attracts bugs. As far as I know, the beach is not combed except in front of certain hotels that you can walk by.\n\nParking can be a problem on hot, sunny days. There is a large parking lot for 500 plus cars, but it fills up fast. Get there by 8:30am or sooner for a parking spot, Otherwise you will be looking for a spot along the curb on nearby streets and will have to carry all your gear several blocks.\n\nSo you can have a perfectly wonderful time at this beach. Another beach we love is Wind an' Sea Beach which has beautiful rock formations that La Jolla Shores doesn't have. It offers some protection from the wind and provides some shade.Also it offers several streets where you can park along the curb if the La Jolla Shores lot is full. The Shack is a great place to catch a burger and beer for lunch, just off La Jolla Drive...casual outdoor atmosphere!\nShow less"], ["Reviewed June 22, 2017", 5.0, "Excellent view", "The views are wonderful and it is a great play area for children steps away from the beach. The scenic views of the beach are awesome."], ["Reviewed June 21, 2017", 5.0, "Great beach and playground area !!!", "Had a fantastic time last week in San Diego. While there I took my Boys to LJSP.Very nice beach in LaJolla, plenty of open space, playground and showers.Can't wait to return."], ["Reviewed June 18, 2017", 4.0, "Favorite Beach in the area", "Trying to find parking is a bit of a nightmare. However, once you settle in, the beach is great. Everything is so clean. The restrooms are the cleanest that I have experienced in a public park. Close to amenities, food, rental (surf, bikes, etc.) places."], ["Reviewed June 18, 2017", 5.0, "Nice walk even in the winter", "Even in a cloudy rainy day in the winter this place is great for a long walk by the ocean. A lot of surfers wait patiently to catch their wave. The beach is really empty otherwise during the winter."], ["Reviewed June 16, 2017", 5.0, "Chill out", "You can come for here walk, swim, surf, picnic, BBQ or play some sport games or whatever :-). I really enjoyed it there!"], ["Reviewed June 14, 2017", 5.0, "My favorite beach", "La Jolla Shores is my favorite place in all San Diego and one of the most beautiful beaches in the world. There are cliffs rising to Torrey Pines state park to the North and the caves to the south to explore in a kayak with a wide expanse of sandy beach in between. Great swimming, boogie boarding and surfing too. It's a protected area and a wonderful place for seeing a variety of sea life and birds. Be sure to shuffle your feet as you are walking out to swim though because sting rays are not uncommon. Although in over 30 years of visiting this beach (San Diego is my home town) only one member of our family has ever been stung. If you get hungry, there are eateries along Avenida de la Playa (Barbarella's is our pick) or if you want a romantic dinner with sunset views try \"The Shores\" or the \"Marine Room\" both fantastic restaurants for a special night right on the beach. Caroline's at the North end of the Beach just before the pier is a great place with a view for breakfast. Or, bring a picnic, there are lots of picnic tables on the grassy area and a play area with swings, slides etc for the little ones.\nShow less"], ["Reviewed June 8, 2017", 5.0, "Breath Taking", "Just magnificent shores with all the beautiful scenery of the cliffs and wildlife all around you. Great places to eat and shopping too!"], ["Reviewed June 8, 2017", 4.0, "Great beach, nice surroundings", "Great beach with enough space for everyone. You can go for a stroll on the beach and walk to the other beaches from there during low tide. Not many restaurants or bars nearby so bring your own drinks and food."], ["Reviewed June 7, 2017", 5.0, "Great Place to Hangout", "Love this park. It overlooks the beach and ocean. It is only a few yards away from the cove where you can watch the sea lion's bask in the sun. Wonderful place to play frisbee, or just sit and watch people"], ["Reviewed June 4, 2017", 3.0, "Not quite what trhe pictures suggest", "we walked along this beach, it was too cold even at the end of May to sunbathe. The surfers were out in force. It is not a soft sandy beach, but is allright for walking, but not much in the way of toilet facilities."], ["Reviewed June 3, 2017", 5.0, "Great family spot", "This is a busy beach, but great for a family picnic, with a lovely grassy area next to the beach. There are showers and washrooms close by and lots of places to wander around close by, such as La Jolla Cove."], ["Reviewed May 31, 2017", 5.0, "Family friendly beach", "This is a great beach for anyone, it is particularly family friendly. The people we've met there have always been friendly and respectful. The rowdy party crowd seems to gather elsewhere (ah I remember those days fondly). My grandkids had their first beach experiences here and years later still love to spend time here. The lifeguards do an excellent job, there are plenty of hands around. They keep the swimmers and surfers in their own spots so all can enjoy the best the sea has to offer. There is a wooden ramp to push wheelchairs down to the water's edge; how very thoughtful. There are showers private and outdoor and a place to rinse sand from your feet. This is a must do if your visiting San Diego.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Great place to Start", "This was where we first saw the seals laying on the rocks. Great location with a long footbridge for viewing of the seals, we didn't see any sea lions here. Public restrooms are here also, which we needed after our drive and walk from the car. You can also access the tide pools in this area.\nShow less"], ["Reviewed May 28, 2017", 5.0, "A wonderful, well maintained beach park", "Staying two blocks from this beach made it easy to go twice during my 5 day stay. The beach if free (unlike NJ!), and it appears there are lifeguards year round. Very relaxing and safe."], ["Reviewed May 27, 2017", 5.0, "Catch the Surf and Sand", "La Jolla Shores Park is a great place to visit anytime of day but I enjoy the early morning as the parking is easy and surfers are out in full force.\nGreat walking beach as Sand is raked every night by the city and beach is wide in most parts. I highly recommend a visit.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Great spot", "What a lovely place at sunset! The kids loved romping in the sand and the playground. The views are fabulous!"], ["Reviewed May 25, 2017", 4.0, "Nice Days Attract The Crowds", "La Jolla Shores is a nice, wide and clean stretch of beach. There is a parking lot almost on the beach, a nice grassy area and a playground for the kids. On nice days this beach can get very crowded. So parking fills up quick and you will have to seek out street parking. It is still a great place to spend your beach time.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Our favorite beach to visit", "This is our favorite back for kids with a calm ocean and a great swing set and play area with free parking and a cleaning station. We try to go once a week done there with the kids. Just make sure you pay attention to the weather report as the marine layer can last all day.\nShow less"], ["Reviewed May 23, 2017", 5.0, "relaxing day but arrive early", "Parking lot fills early. Limited parking means we drop our stuff off in parking lot and then go find street parking. At south end it is a short walk to restaurants and shops, I like the grassy area and friends like sand. This place has lots of both.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Wonderful Beach", "I absolutely love the beach and this one has to be one of my favorites. Super clean and family friendly. It's busy, but quiet enough if you want to relax."], ["Reviewed May 22, 2017", 5.0, "Fun in the Sun", "La Jolla shores is a strip of beach perfect for anybody to enjoy. It caters more to families than it does singles. The beach itself is really clean. Do show up early if you are picky about having a lot of space because it does get crowded. If you are there to walk along the water or don't mind squeezing in on the sand then it's no problem. We stayed in North Park, SD so our lyft ride was a little expensive, so be prepared to pay $40+ for a one way trip if you are near downtown at all.\nShow less"], ["Reviewed May 21, 2017", 4.0, "It's a beach", "It's a beach. The playground is good for young kids and it has showers and changing rooms. There are plenty of eateries in this area too."], ["Reviewed May 8, 2017", 4.0, "Great beach to hang out at even on a rainy day", "On a rainy Sunday La Jolla Shores Park is quite deserted. We found a lot of sea weed washed up on the beach and even with the light drizzle it was a pleasant walk along the ocean edge. The skies were very clear and Scripps pier was crystal clear to see.\nShow less"], ["Reviewed May 8, 2017", 5.0, "Amazing Lifeguards etc.", "My 2 families and kids(13 of us) loved the beach despite a chilly day. The small kids loved playing in the sand and having the ability to walk out a long way before encountering the waves. The lifeguards patrol the long beach in red vehicles with megaphones. Two of them rescued my son-in-law and 9 year old grandson who were on boogie boards and got caught up in an afternoon riptide swirl. They helped assure them and helped guide them to safety. Even the 6 year old loved the waves and boogie board . Surfers are confined to one end for safety. Lots of shells, restrooms(not great), and park. Don't miss!\nShow less"], ["Reviewed May 6, 2017", 5.0, "Gorgeous Place, Beautiful Bodies, Beautiful Views", "I had no idea how beautiful La Jolla (pronounced La Hoya) would be. Trendy shops and restaurants with excellent food, ritzy homes and unbelievable views abound. Don't forget the beautiful people surfing, swimming, jogging, and sunbathing everywhere!"], ["Reviewed May 6, 2017", 5.0, "Surf city!", "Wow. What a great time. My friend took me surfing at the shores and it was terrific. The waves were long and rolling, easy to see and easy to catch. There weren't a lot of people out there so it made it easy for a beginner like me. My only critique is the cleanliness of the bathrooms - pretty yucky. Other than that, a great public park.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Breath taking", "One of the most beautiful places I have ever seen. To be so close to nature. We saw seal lions and seals in the wild within feet of us. Wull never forget this special place."], ["Reviewed April 30, 2017", 5.0, "Sunday crowd at the beach", "Obviously a popular spot. On a beautiful Sunday everyone was there, enjoying the beach and surf. Nice sidewalk for strolling. Lovely neighborhood. Try Piatti for great Italian food in the little business district."], ["Reviewed April 30, 2017", 4.0, "Wedding rehearsal picnic, picture perfect", "The lawn space was perfect for mingling & lawn games with a gorgeous view. Amazing special trees, huge beach & gorgeous ocean. Grills and picnic tables. Could use tables closer together for gatherings."], ["Reviewed April 27, 2017", 4.0, "Big waves", "The waves were huge and a number of people were surfing. The park area was nice. This was our first trip to the West coast so we didn't know what to expect. It wasn't the soft white sand we are used to in Florida, but it was a great visit (and a fun town), and we're glad we went.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Catching Rays", "Mica Beach To Soak Up What Health Benefits The Sun Has To Offer. Remember To Wear Sunblock, Regardless To How Much Melanin Your Skin Has, Skin Color Doesn't Matter Who Can Get Skin Cancer!!"], ["Reviewed April 25, 2017", 5.0, "One of the best beaches", "Bright sunshine, lots of places to eat for cheap, convenience stores for sunscreen and supplies, long boardwalk and clean sands. Awesome time. Everyone's friendly."], ["Reviewed April 24, 2017", 5.0, "Great time at the Beach!", "This was a great beach. Lots of families. I seen where they have kayaking tours. Come early because parking can be jam packed. I will be returning"], ["Reviewed April 24, 2017", 5.0, "Safe clean beach, free parking and facilities very close by.", "This is the beach to go to when you are in San Diego. It doesn't have the adult and college crowds that Ocean Beach and Pacific Beach have. Instead there are families enjoying the wide stretch of clean sand with a safe shoreline for the kids to swim and boogie board. There are toilets and showers just behind the boardwalk, a grass playground area if the sand gets too hot for the little ones and plenty of places to get a drink or something to eat if you need to. You can watch the kayakers and snorkelers going out towards the caves. Plenty of free parking close to the beach so you don't have to carry your beach stuff far and its all flat and easy to roll buggies or carts.\nA great place for a day at the beach for all the family.\nShow less"], ["Reviewed April 23, 2017", 5.0, "Nice Beach", "We stopped here in April 2017. It was cold, but our kids didn't mind. This was their first trip to the Pacific Ocean. They had a blast. We learned there were certain areas the life guards wanted swimmers vs surfers. The waves were big, but not dangerously big for my 3 children (ages 7-12). They had fun with the sand and the waves. We had a picnic on the beach (ps: no alcohol allowed). It is a well kept up beach area and quite a beautiful place to hang out. It wasn't overly filled either...although, I'm sure summer is different.\nShow less"], ["Reviewed April 22, 2017", 5.0, "Beautiful blue waters", "This is a beautiful flat beach with long walkways, lined with restaurants and cafes. We traveled in the spring and the water was cold, but we had a nice time nevertheless"], ["Reviewed April 21, 2017", 4.0, "Great beach for everyone", "This beach is very flat and there is a parking lot that almostgoes right up to the sand. We brought my brother-in-law in a wheelchair and it worked out great as there is a sidewalk on the edge of the sand. It is a great beach for kids as well.\nShow less"], ["Reviewed April 21, 2017", 5.0, "Beach!", "More beach space than where the caves are. You can also take a longer walk on the sand. They have a couple of big pit probably for bonfires. A lot of benches along the walk but not much shade. They also have a playground for children.\nShow less"], ["Reviewed April 16, 2017", 4.0, "Spring at the beach", "Great beach, can walk to get a quieter area. Clean. Restroom and showers close by. Parking fills up quickly. Restaurants block a way to get lunch if you forget to bring with you. Rentals also available for wet suits and such."], ["Reviewed April 15, 2017", 3.0, "Too Crowded!", "Man I thought the summer season had passed and we couldn't find a spot to chill and enjoy the sunset. I guess it was not meant to be"], ["Reviewed April 15, 2017", 5.0, "Best Beach for Young kids", "La Jolla Shores Park is located right next to the beach. Very convenient. We can spend the whole day there."], ["Reviewed April 13, 2017", 5.0, "A PLACE IN THE SUN", "La Jolla beach is an approximately 1mile long and wide with soft sand, clean watef and gentle waves. The broadwalk of the shore park is lined with palm trees, there is a children's playground next to the grassy Kellog Park on one end, and the other end, the Scripps Institution of Oceanography campus and the Scripps Pier Walk. There are several restrooms, shower facilities and a free public parking lot. We took a leisurely stroll along the broadwalk and stopping from time to time watching the sufers rising and falling with the waves, we were shivering and shaking... it is COLD!!!!\nShow less"], ["Reviewed April 13, 2017", 4.0, "Walking and people watching", "This is why you go to California. To walk along a great beach With tons of interesting people of all ages to watch Remarkably cool water though when we were there"], ["Reviewed April 12, 2017", 5.0, "The Shores!", "This is a beautiful stretch of beach along the San Diego coast of California. There are many things you can do at the Shores. All under the watchful eyes of the San Diego Lifeguard Station, beachgoers can enjoy all activities ranging from kayaking, scuba, surfing, boogie boarding and swimming. Close to the shore, many businesses cater to the equipment needs of the beachgoers, for a reasonable fee. Personally, I like watching the surf competitions. I believe the last time I was there I was able to watch local high school teams competing. On another note, just going down to the Shores to walk along the boardwalk, walking in the sand or playing in the water is well worth the visit. Parking can be a bit of a problem due to the volume of people. So, get there early! Remember, surfers normally get there during high tide. So, for parking reasons, observe the local weather channels for the surf reports.\n\nRegarding the questions below:\n\nIs this attraction a hidden gem or off-the-beaten path?\n\nI wouldn't say it's hidden. You do have to navigate through many small streets to get there or just take the main road down past Scripps Institute of Oceanography and it will get you where you are going.\n\nDoes this attraction have good sunrise views?\n\nAbsolutely! Watching the sun come up over the hills is beautiful.\n\nIs this attraction good for big groups (greater than 5)?\n\nYes. They have surf competitions sometimes and some group gatherings from the local colleges/high schools.\n\nIs this activity accessible without advanced planning or reservations?\n\nHmm. Not sure about reservations. I would assume that you would have to coordinate with somebody regarding a large event for security, trash, etc. So, I don't know. But, I definitely believe that you should plan the visit or event in advance. I think I've seen a wedding down there as well.\n\nDoes this activity require advanced planning, ticketing or reservations?\n\nSame info as above. Definitely plan in advance. Unless there is some special event planned, i.e. a concert or something, I don't know about tickets, reservations.\n\nIs this attraction in a remote location?\n\nI don't think so. I mean, I've been down to the La Jolla area many times. Just know it is away from the main roads but easily accessible. Parking is the issue. Find a spot, your golden.\n\nPlease keep in mind that anywhere you travel there are weather related issues. For example, if it is overcast out, which we get along the beach, there will be a lack of sunshine/no sunrise/sunset to see, perhaps cloudy or poor visibility for diving, rough waters, etc. Like any city, there are many people trying to do what you are doing. So, don't get discouraged. Keep looking and you will stumble upon a spot. Look for the surfer who is wrapping a towel around their waist (top and bottom for the ladies) and changing out of the wetsuit. Most often they are planning on leaving soon. Just ask them and put on your flashers while waiting.\nShow less"], ["Reviewed April 11, 2017", 4.0, "A wonderful find on our trip", "We just had to stop and check out this site, as we travelled the coastal highway. A fascinating coast line. Not as dramatic as the La Jolla Cove, but nevertheless, I got some fantastic photos here."], ["Reviewed April 10, 2017", 5.0, "Wonderful beach.", "Really enjoyed paddling along the beach, people watching. Great weather helped, and the views are just amazing."], ["Reviewed April 10, 2017", 4.0, "Beach trip", "We enjoyed the afternoon by the beach. It was a bit foggy but still beautiful! The beach didn't seem as clean as it should be noticed people leaving trash!;("], ["Reviewed April 10, 2017", 5.0, "La Jolla Visit", "Staying in San Diego for event. Side/day trip to La Jolla. La Jolla Shores-great beach for walking, watching kayakers & leopard sharks were present at this time."]]}}