{"La Jolla Cove": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "La Jolla Cove", "url": "/Attraction_Review-g32578-d255307-Reviews-La_Jolla_Cove-La_Jolla_San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/3e/ac/85/la-jolla-cove.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "10256"}, "address": {"@type": "PostalAddress", "streetAddress": "1100 Coast Blvd", "addressLocality": "La Jolla", "addressRegion": "California", "postalCode": "92037-3600", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Breathtaking", "Parking is a disaster, but walking the area was delightful. Visited just before sunset. A must see during a San Diego visit."], ["Reviewed yesterday", 4.0, "Beautiful setting, fun snorkeling experience", "My daughter and I booked a snorkeling trip with San Diego Snorkeling & Scuba. The tour lasted about 90 minutes. The instructor/guide, Phil was terrific and the equipment first class. Although the weather had been colder than normal and water choppy, the thick wetsuits really insulated us and getting to swim into the caves was a terrific experience. It is clearly not the Caribbean or Hawaii for snorkeling, but it was a wonderful experience and we enjoyed the views before and after with a walk around La Jolla. Parking in the area gets especially challenging on weekends.\nShow less"], ["Reviewed yesterday", 5.0, "Easy Stroll with Look Outs and Sea Lions", "The cove is a nice stroll. The path meanders along the bluff edge. There's not much parking so I'd walk down from Prospect Street. There are a few stairs down the beach. Depending on the time of year, they may be closed for sea lion calfing season. That was the case when we were there. But, rather than access to a small plot of sand, you'll get to see the sea lions basking in the sun.\nShow less"], ["Reviewed 2 days ago", 4.0, "A Must See in San Diego", "Prior to visiting we had read very little on La Jolla Cove. We went hoping for the best and were not disappointed. This is a must see for everyone when visiting San Diego. Parking is difficult to find but do not give up. The cove is beautiful and the rocks and cliffs are great. We went on the beach with the seals and got up close views of them and their pups. Great experience!\nShow less"], ["Reviewed 2 days ago", 5.0, "Magick Medicine Miracles", "This is one of my favorite beaches in the world. I always feel inner peace restored when I come back to this coast. Truly transformative happy, healthy and holy cove."], ["Reviewed 2 days ago", 5.0, "Great place to visit !", "We heard about La Jolla cove and finally paid a visit. We didn’t know it was pupping season so we were pleasantly surprised to see all the harbor seals with their pups on the beach. A short walk further up the cove and you can get closer to the seals but respect the wildlife and keep a safe distance. La Jolla is a very short beautiful drive from San Diego and we plan on staying here or in nearby Pacific Beach on our next trip.\nShow less"], ["Reviewed 2 days ago", 5.0, "Beautiful, must see", "We stayed in La Jolla and walked down to the cove each day. It's beautiful. After seeing both San Diego and La Jolla, I would say skip it and just go to La Jolla."], ["Reviewed 2 days ago", 5.0, "Great place to watch the various animals", "The sea lions were all sunning, and the cormorants were nesting when we stopped there. It's just a cool place to stop for awhile."], ["Reviewed 3 days ago", 4.0, "Sea Lions and Seals galore", "A neat place to view these animals, but know that it gets crowded quickly and finding parking can be a challenge. Getting there early is recommended. Also, lots of shops and restaurants to enjoy,"], ["Reviewed 3 days ago", 4.0, "beautiful views", "It was a very windy day but with clear blue skies, with the sun shining. lots of people as well. lovely and gorgeous views"], ["Reviewed 3 days ago", 3.0, "Bad Smell", "It was nice to see the seals. They are plentiful. There are beautiful waves and scenic photo ops. There's nice places to lay out and picnic or just read. It was smelly down there though. There were many people in the water even though it was very cool out. I guess it depends on how you feel about cold water but I prefer warmer water.\nShow less"], ["Reviewed 3 days ago", 3.0, "Watch your step!", "If you are going to La Jolla definitely stop by and go to the La Jolla Cove (inside a shop so look for the sign). It's a bit steep (no it is steep), narrow, and wet. Best to have sneakers or sandals with no slip. Pretty cool when you get down the stairs! Then take a walk on the bluffs and go down to the beach (lots of sea lions). Great eats too! This is another reason we love California! It's not just a place for tourists.\nShow less"], ["Reviewed 3 days ago", 4.0, "California Dreaming", "Ahh La Jolla what a beautiful place to have the good fortune to visit especially on ideal sun shining blue sky Southern California Day. We strolled along and of course went down to the cove to get a closer view of the sea lions. Interesting and fun to watch but be warned .... try to stay upwind.\n\n\nThe grounds of the park areas are beautiful and very well cared for. Very inviting to picnic , laze in the sun or just drink in the ambiance.\n\nWe had taken a picnic lunch , found an open bench and enjoyed our lunch while looking out to sea. Very nice.\nShow less"], ["Reviewed 4 days ago", 4.0, "Leisure", "Wow such a sweet towns\nSo much to see and do Jolla cove was nice but really outdated\nStay away from room 416\nRight below the breakfast room\nThe noise starts at 555 am when the staff comes into get breakfast ready!!other than that it was pretty nice\n\nShow less"], ["Reviewed 4 days ago", 5.0, "A beautiful walk!", "We walked from Bahia Hotel to LaJolla which was about an 8 mile walk, beautiful all the way! They have both oceanside walk and bay walk with beautiful flowers all the way! The cove was so interesting and we ate at George's above the cove then stopping to see the seals at George's cove. Fun!\nShow less"], ["Reviewed 4 days ago", 5.0, "Must Visit!", "This location is a must visit as it’s good for everyone with the outstanding views, seals, shops, food and the long stair walk to the sea cave. There’s also swimming in the warmer months, but we visited in Feb so the water temps were a little cool.\nShow less"], ["Reviewed 4 days ago", 5.0, "Excellent place to see seals upclose", "We visited here in February and it was amazing to get up close to the seals and watch the sunset with them. Some people were getting way too close.. if they bark at you then back up. However they started getting closer and closer to some people. They're very sweet and protective of their young. Respect them and enjoy the sunset together\nShow less"], ["Reviewed 4 days ago", 5.0, "Picturesque", "A must see place. Lovely views and nice place to chill out. Lots of wildlife to see and when we visited there were lots of seal pups."], ["Reviewed 5 days ago", 3.0, "Beautiful but smelled horrible!!!", "The waves, rocks, ocean, everything was stunning to see. There were dozens of sea lions and seals lounging around, and they created the most awful smell. We had to drive around for parking for 20 minutes before finally going for the 10$/hour parking offered by a business across the street. We stayed for less than an hour. We took some amazing pictures, but could not stay long due to the overpowering odor.\nShow less"], ["Reviewed 5 days ago", 5.0, "Beautiful spot", "Make sure you take time to see the cove and walk around the park. With every turn, the views get better."], ["Reviewed 5 days ago", 5.0, "The seals are amazing..", "This area is so lovely, and the seals are amazing. I don't understand why visitors insist on going down on the beach when mothers have just given birth to their babies. What the heck is up with that? STAY AWAY and do not disturb the mothers..you can look from up top.\nShow less"], ["Reviewed 5 days ago", 4.0, "Lots of sea lions!", "Very crowded with humans, but fascinating wildlife. Pelicans and Brandt's cormorants nesting on the cliffs, and a huge colony of \"fragrant\" sea lions barking loudly on the rocks will entertain young and old alike. Walk down the paved path to the Children's beach at low tide to see many mother seals and pups resting on the sand.\nShow less"], ["Reviewed 6 days ago", 4.0, "Pretty views", "Pretty views, with the cliffs and sea lions. Walking paths from sidewalk to dirt paths up through the hills. Great scenic views."], ["Reviewed 6 days ago", 5.0, "SeaLions up Close", "Amazing to see the Sea Lions taking over the rocks and beach area. Photo ops were just perfect even with some fog."], ["Reviewed 6 days ago", 5.0, "Day made", "I’m so happy we went to La Jolla Cove. My day was truly made watching the sea lions. It didn’t smell as bad as some others had mentioned. I think it was a general beach like smell. Wear comfy shoes and a jacket. It can get windy and cold.\nShow less"], ["Reviewed 6 days ago", 5.0, "La Jolla cove", "This has to be one of the most beautiful coast lines I have seen. The views driving to La Jolla cove are amazing and when you get there it’s absolutely beautiful. The sea lions were a surprise. Parking is easy just be patient. It could get really crowded.\nShow less"], ["Reviewed 6 days ago", 5.0, "Seals ❤", "What a beautiful experience. The seals and sea lions are adorable and the views are amazing. Definitely stay till sunset. There are some cool shops and restaurants near by also."], ["Reviewed 6 days ago", 5.0, "Back to nature", "Low tide is better but Seals are there most times. Low tide you can walk through the caves but fantastic experience with natural wildlife"], ["Reviewed 1 week ago", 5.0, "Definitely worth a stop if you are not too far away", "I looked up things to do in La Jolla since we were staying there for the long holiday weekend, and I came across this. Glad we went. Those sea lions/seals are worth the view. I did not see the area where they were all laying out immediately, so I climbed on all of these rocks to get close to the island in my pictures. Don't do that! If you walk a little farther down you will see an area that is really easy to get to and see the sea lions. Those rocks were very slippery and I fell.\nShow less"], ["Reviewed 1 week ago", 5.0, "Must See", "Very fun place to visit. As others have said. it's too had people can't give the wildlife their space...."], ["Reviewed 1 week ago", 4.0, "Lovely little cove.", "A lovely little sheltered sandy beach where we spent an hour or so splashing in the sea with our two year old. Much fun was had by us all. A very clean beach with water fountain and toilets very nearby."], ["Reviewed 1 week ago", 5.0, "Fun place to snorkel", "Parking was a time consuming endeavor but the snorkeling was worth it. Snorkeled from the cove and around through the caves. Not the easiest place for learning to snorkel as the water was very choppy but it was a lot of fun. It was a bit difficult to navigate all the kayakers and not everyone in the water seemed to be paying attention to their surroundings. The smell from the sea lions is pretty unbearable but I got used to it after a while.\nShow less"], ["Reviewed 1 week ago", 5.0, "A MUST-DO in La Jolla!", "My husband and I visited La Jolla Cove while were in the San Diego area. We were glad we did! It's a beautiful area! We were able to get up close to the sea lions (beware: they're quite stinky), which was really cool! After exploring the beach, we walked a short distance to Girard Avenue and Prospect Street for dinner and a little shopping. It was a great way to spend an evening.\nShow less"], ["Reviewed 1 week ago", 3.0, "Nice to bring out of towners", "This is the type of locations you bring visitors from out of town. Feel bad for those that live near. They are better beaches in La Jolla depending of your personal needs (surf, swim, or getting sun)."], ["Reviewed 1 week ago", 5.0, "A must see in San Diego", "By just walking short distances, you can get different dramatic views of the Pacific as it strikes the rugged coastline. Both kids and adults will want to observe the seals as they bask in a small beach area. The feel of the fresh salt air I find to be quite refreshing. I visit the sight periodically and will definitely do so again. Oh, and it's free.\nShow less"], ["Reviewed 1 week ago", 5.0, "Must see for the coat walk and views.", "So glad we made the trip to go and see the beauty that is La Jolla. Fun stores and wildlife in the area."], ["Reviewed 1 week ago", 5.0, "Watch out for the slime", "I has a wonderful time here always wanted to visit. I was mesmerized by the seals and has great photo ops. I did however let my guard down and I was so busy focusing on taking pics that I slipped on slime I dislocated my knee. I was miserable the rest of my vacation:/\nI warn you please watch were you step. Wear good shoes. I know it’s common sense, but it’s so magical it’s easy to forget. Honestly totally worth it. I would love to come back.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great beach to walk along and see sea lions", "We had time to kill before our flight home and we are so glad we came here. What a gem! Many benches to sit along the paved walkway along the water. You can hear sea lions and watch them swim and lay in the sun. They are quite an attraction. There are a few who braved the cold water.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful cove", "A bit windy, but beautiful. We visited during our college visit at UC San Diego. Peaceful and entertaining to see gliders going by."], ["Reviewed 1 week ago", 5.0, "This is a beautiful place to visit.", "I enjoy the beach and La Jolla Cove is beautiful and relaxing. Smaller and more quaint then the big beaches of California but so worth going to."], ["Reviewed 1 week ago", 4.0, "Beautiful but crowded", "Having grown up in Southern California, La Jolla is a favorite of our family. Unfortunately, because it's well known, there are far too many people there who don't respect the sea lions who sun on the rocks. It's difficult to get a picture without people everywhere, but if you can, it's beautiful.\nShow less"], ["Reviewed 1 week ago", 5.0, "A must when visiting La Jolla.", "The entire shore area of La Jolla is fantastic and walkable. La Jolla Cove is a bit more calm for divers and water sports. Loved seeing the sea lions and birds."], ["Reviewed 1 week ago", 5.0, "Super nice beach to spend your day", "It was a very fun day spent at la joya cove walking around this beautiful area, watching the sea lions and enjoying the views of the nice houses around and the sea."], ["Reviewed 1 week ago", 5.0, "Cove", "Love this area for the water and wildlife. Feels powerful and safe. Girls loved it and was easy to be around."], ["Reviewed 1 week ago", 5.0, "Wow!!", "Spectacular is an understatement. So much to see and do here. You can get close to Seal Lions and Seals, watch SCUBA divers, look at birds, swim, fish and the scenery is breath taking. This is a must see!"], ["Reviewed 1 week ago", 4.0, "Nice views", "We walked all along the shore in La Jolla. The cove was busy both times we visited from above, but we didn't venture down. There were sea lions on the rocks and people were getting fairly close. Along the beach people were wading, swimming and snorkeling with sea lions swimming around too. Along the upper rocks were many cormorants nesting. Farther to the north a little were a number of kayaks.\nIt was quite fishy smelling, not sure I would get in the water right there.\nShow less"], ["Reviewed 1 week ago", 5.0, "great attraction", "It has big waves, seals, and body surfers. On a Sunday there are outdoor concerts and lots of interesting people.It is a must visit for out of town people. Come early as parking is tough."], ["Reviewed 1 week ago", 4.0, "Gorgeous..", "Had a great time...it's so beautiful there windy and cold around this time.. Will come back during summer... PARKING is hard but just wait until someone gets out...worth the wait.."], ["Reviewed 1 week ago", 5.0, "Loved it!", "I went here with a friend and her kids which were 2 and 3 years old. They lived this as much as we did! The Sea lions just lounge around everywhere and you can get pretty close. The kids loved listening to them bark and play with each other. I'm so glad we stopped! Absolutely amazing.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful La Jolla", "Wow, do not miss a visit to La Jolla Cove. What a place, we saw seals, sea lions, squirrels, pelicans and many other types of bird. Walking close to the sea lions was like being part of the zoo, not watching from behind glass but up close and personal. A bit wiffy but we'll worth it. Stunningly beautiful and free parking- you can't ask for anything else.\nShow less"], ["Reviewed 1 week ago", 5.0, "Sunday Brunch and walk along beach", "Intended to go to Cody’s but the wait was about an hour. We ate next door at olive and basil. The ocean walk was great. Lots of shops etc in this beautiful area."], ["Reviewed 1 week ago", 5.0, "Great DAy at the Cove", "I have been traveling to San Diego for 30 plus years and always make time to visit La Jolla Cove. You can relax on the beach, family can go shopping and my favorite is kayaking and snorkeling with family and friends."], ["Reviewed 1 week ago", 5.0, "Beautiful-pick your time", "So beautiful here, but picked a week day on this trip to avoid the crowds of people who can spoil nature at it's finest."], ["Reviewed 1 week ago", 4.0, "Beautiful location, go early to get parking.", "Beautiful location. Lots of people and parking was a little tough to find but be patient and something will open up or park a ways up the street. Lots of seals to see."], ["Reviewed 1 week ago", 5.0, "Gorgeous!", "So many beautiful things to see! The seals and sea lions are adorable, the homes are spectacular and the shops and restaurants are all so quaint and friendly."], ["Reviewed 1 week ago", 5.0, "A must see!", "Loved it there. The seals and sea lions were so cool to see. The ocean is breathtaking. Views are spectacular."], ["Reviewed 1 week ago", 4.0, "Sight to see while you're there", "It's definitely an interesting spot to visit while you're in the area. There are tons of seals you can see and take photos of (just don't touch them, I think its illegal, plus wildlife should be left alone). This area is BEAUTIFUL during sunset :)"], ["Reviewed 1 week ago", 3.0, "Impossible parking and stinky seals.", "We attempted to go to the cove to see the seals but finding a parking spot was impossible. I dropped my friends off to go see the seals, tried to find parking and then gave up. We parked in the 3 minute passenger pickup spot and I ran to find my friends while my husband stayed in the car. The stench was quite overwhelming to me, I took a quick pic of the seals and ran back to the car. Tried to go to the restroom but it was too nasty so I passed.\nRecommend going early to get parking...then it might be fun. We went at 11am on a Saturday in February and it was nuts.\nShow less"], ["Reviewed 1 week ago", 5.0, "Its Easy To See Why People Want To Live In LaJolla!", "Beautiful and breath taking!\nAs you walk along the edge of the promenade, you are treated to view after view, each different and each contributing to the total effect of splendid coastline beauty.\nIt is easy to see why so many people want to live in this fabulous community.\nOne word on parking. cruise the coastal drive and if nothing pops up, go inland a block or two. This is a very popular place and everyone, of course, wants to park right on the coastal drive!\nShow less"], ["Reviewed 1 week ago", 4.0, "Great Spot to see the Seals", "Took some great pictures here. Even if you do not want to walk down to the beach, you can still get a good view of the cove and seals (and its free)."], ["Reviewed 1 week ago", 5.0, "Smells horrible, but the seals were amazing!", "I loved being able to go so close to the seals, they were amazing. However, the smell was terrible and I still smell it in my clothes. But this experience should be on your to do list!"], ["Reviewed 2 weeks ago", 5.0, "Beautiful Spot", "One of the many great things to do near San Diego. This place is beautiful. So many scenic pictures to be taken. Scenery even has up close seal encounter if you time it tight. Nice downtown area nearby with good food and shopping options"], ["Reviewed 2 weeks ago", 5.0, "Nice day out with the children", "Coastal walks, green spaces, good restaurants and of course getting a good view of the resident seals / sea lions. Very nice place to spend the day."], ["Reviewed 2 weeks ago", 5.0, "3 ft away", "This was the best part of my trip. Talk about up close with these animals! They were much more talkative and active here."], ["Reviewed 2 weeks ago", 5.0, "It's been in my backyard since 1974", "A wonderful place. I grew-up here and played around all the time at the cove. Great snorking for the family, great scuba diving too. It's a underwater natural preserve. So come and enjoy the beauty of La Jolla Cove. One more thing- if your a surfer like I wasd this place takes north swells from Alaska. I've seen some preaty big moster waves break there.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Tidal Pools were great", "Visited just at low tide, after the biggest high tide of the year. Wandered around the tidal pools south of the cove. Awesome! We saw an octopus, a sea hare (giant slug), crabs, anemones, etc. So much fun we spent hours there. Be careful and wear shoes with good traction. It's very slippery.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Breathtaking", "La Jolla Cove is one of the most beautiful places I have ever visited. You can walk and walk along the cove and the scenery is just breathtaking. It has a calming effect for sure. Loved seeing the sea pups and seals too. We did pay the $5 a piece to go down into the cave. We were a little disappointed that it was just an opening to see the water; we had expected to be able to walk around outside of the area a little. With that said we consider the $5 a donation to the upkeep and are still glad we got to view the ocean from this perspective. We would definitely return to this location if we ever visit San Diego again.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Nature undisturbed by human hands", "The ride to The Cove from San Diego is short and well worth it. Sea Lions sunning themselves in their natural habitat - you can't duplicate that in at zoo. The road is elevated but you can park for free and walk down the stairs to get pretty close. Thankfully there is a fenced barrier so nobody disturbs the creatures. You can get great photos with the animals as they position themselves on the cove beach which is shielded from the crashing waves. No matter where you are headed, you must take a little time to stop and enjoy these beautiful creatures.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A great experience and views", "A beautiful place to visit. Nice walking areas along the beaches and on the rocks. Spans for a distance the cove and park area. The best part if you are an animal and nature lover are the sea lions. You could walk right up to them with in arms distance to watch them. It was very cool to see them in this way. Of course you do not touch them or disturb them. The only downside is the parking in the area. If busier the street parking is taken up very fast. I would suggest just finding a parking ramp that is near and parking there. We drove for quite some time searching for a spot and then ended up in a parking garage anyways. Fun location.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great nature watching area", "At this time of the year it was full of seal and sea lions and their pups. The water is so blue in this area. You can walk down to a cave and look in. There are several sets of stairs that lead you to the cliffs. On another note the cliff leading up the road along the sidewalks has a significant amount of bird nests. It was great to see the birds In their natural habitat sitting on their eggs. Great place to sit and watch the ocean.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stunningly Beautiful Ocean and Rocky Cliff to explore", "We spent several hours walking the coastline, exploring the cliffs and beaches and even seeing the seals. An excellent way to spend a few hours and take it all in. It was quite busy on a Sunday afternoon, so finding a place to park can be a challenge. But otherwise a beautiful picturesque day for sure. Excellent photo opportunities everywhere with beautiful rugged coastline and coved sandy beaches. Lots of restaurants and shops in the area as well.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great views. Sea Lion Colony. Scuba Diving with Sea Lions.", "This is a simple park, an expanse of grass for picnics, a beach with life guard. One the rocks around the point is a large number of sea lions and sea birds. Amazing experience.\n\nIf you scuba dive, you can swim off the beach and be surrounded by sea lions, kelp forests and other life.\n\nLength of the visit varies wildly depending on what you're doing. Looking at sea lions? 20-30min. Swimming or diving? 1hr +.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "JUST GO!", "I tagged along with my boyfriend on his business trip to San Diego recently and am so happy I went to La Jolla Cove. I took a day trip by myself here and it was just so breathtaking, I wish my boo was with me to see it. The sea lions were hangin around there too! Was neat to watch them.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Ocean cliff views with seals!", "Drive along the winding shores to view it all. First you’ll probably make your way up Torrey pines Blvd and notice the houses turn to shops, down Gerard st you’ll pass the best rated Thai restaurant is San Diego and it only gets better from there. Keep slowly driving and you’ll get to where people stroll on a hilltop area with exclusive boutiques and restaurants above the actual cove where the seals are viewable with a breathtaking view. There is also a great Indian place here called Taste of the Himalayas, on a slope before the water. It’s not uncommon to see people jogging, or people picnicking and taking in the view.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful beach that can get smelly", "You`ll be most likely lucky to see some sealions enjoying the water by the shore, but you may not like the smell and noises they make:-))) it´s a great experience, but to me the view of the shore and sea was the best. The cave down the stairs at the little sand beach is great to take some photos at as well.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wonderful place", "One of the best places of San Diego. Nice beaches and quiet area at least on February. My favorite place in San Diego!"], ["Reviewed 2 weeks ago", 5.0, "Stunning!", "The views are magnificent. It has a wonderful waterfront walk. It is sea lion pupping season. We saw so many resting on the rocks. A truly unique experience!"], ["Reviewed 2 weeks ago", 5.0, "So beautiful!", "What a beautiful place to walk and also see lots of sea lions. A gem! You can walk along a path and bridge and look out at the water and dozens of sea lions and their babies. So beautiful, and then continue to walk along the Coast path.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Sea Lion Spectacular", "Wonderful up close look at the sea lions, beautiful sunny day. Great views of the cove and the sea life around the cove. Parking was scarce but worth the effort to get their."], ["Reviewed 2 weeks ago", 5.0, "Sea lions, oh my!", "I was thrilled when my husband took me to La Jolla Cove, knowing nothing about it before. It's a beautiful park where you can watch birds, sea lions and seals in their natural environment. You are able to get quote close to the animals. Parking is a bit of an ordeal, but this is such an incredible spot. Next time I go, I will rent a kayak or paddle board to enjoy it from another perspective.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must for any La Jolla visitor!", "We didn't see seals at any time down the So. Cal. coast... until we hit the La Jolla Cove. And there they were! Very cool!!"], ["Reviewed 2 weeks ago", 4.0, "Nice Spot for a Quick Stop", "The cove is located near downtown La Jolla and parking is available along the waterfront. There are grassy area around the cove for the kids to run around or families to picnic. There are actually two coves to see and both had many seals and sea lions resing there on the day we visited. Some harty souls kayak or surf near the cove but swimming does not seem welcome. Depending on the weather/winds the smell from the sea mammals can be unpleasant, as it was the day we visited. This is a nice spot to stop if you are in the area for beautiful views of the ocean and the animals but not for a long visit.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Cool place to see sea lions/seals", "This is a great spot to see the La Jolla Cove, the ocean views are gorgeous, good location to see the sunset and the best places to get close photos & observe the sea lions / seals!"], ["Reviewed 2 weeks ago", 5.0, "California dream", "A lovely gem within San Diego County. Just A 20-30 minute drive from downtown San Diego. Why visit Dining, shopping, sightseeing, photography, kayaking, swim with sharks. Picnic viewing the beach or dine at one of many restaurants. Some restaurants and shops are very high end but the village invites all. Parking can be a challenge near the cove but parking can always be found in the village area. A place for all occasions and ages. Some parts of the cove and village can be a challenge for those in wheel chairs and walkers but options exist. A must for short visits and all year round visitors.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Worth the stop when driving to San Diego", "Beautiful view and vistas in a lovely community. Parking is difficult to find so just keep driving around. Wouldn't plan this as a beach day but you could certainly go for a swim or catch some rays on the shore for an hour or two."], ["Reviewed 3 weeks ago", 5.0, "Seals & Sea Lions", "This is a perfect spot to stop and watch the seals and sea lions. You can get quite close. My kids loved our visit here!"], ["Reviewed 3 weeks ago", 5.0, "Cloudy and cool. But still great!", "The weather was just coming off a little stormyish day and the surf was up! The pics don’t due it justice. It was rough and so cool to watch. Worth a trip to see and then cap it with lunch/dinner downtown. La Jolla is a gem\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Close encounter with wildlife", "While they can be a bit stinky, it was pretty awesome to view the seals and sea lions basking in the afternoon sun. They are unfazed by tourists, even when some get too close in my opinion. A very unique attraction and costs nothing. Wear closed toe shoes and tread carefully.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Way to busy to be enjoyable on a Monday", "So disappointed in this area. Really all of La Jolla. Just to unkempt and homeless and dirty. Won't be back. Had hoped to stay here next area."], ["Reviewed 3 weeks ago", 5.0, "Views and wildlife like no where else", "Breathtakingly beautiful and so much fun! The cove has something for everyone — beaches to sunbathe on, benches to marvel at the views, parks to play in, and a ton of wildlife that you can get super close to! I enjoyed watching the seals at the Children’s Pool but the real treat was climbing down onto the rocks to hang out with seal lions — I can’t believe how close we were able to get to them! I felt like a kid again! What an incredible experience — I highly recommend it for all ages.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great place for a walk", "Enjoy breakfast or dinner and then take a walk and see the ocean. Surprisingly not crowded, but good enough to people watch."], ["Reviewed 3 weeks ago", 5.0, "Wild Life right on the beach", "If you have the temperament to walk among sea lions at sunset, then you have come to the right place. The views here are fantastic at sunset and the place comes alive as humans and wildlife come together to enjoy the location. There is a great walkway along the ocean front and many great spots for taking pictures. You will not forget this place.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Gorgeous with lots of seals", "Parking is horrible but when you find a spot, fantastic day!!! Lots of seals, rock formations, caves, beaches...."], ["Reviewed 3 weeks ago", 4.0, "Crowded and hard to find parking, but worth it to see the birds and seals/sea lions.", "Lovely place to walk and see the wildlife. Recommend parking a few blocks inland where there are public parking lots at reasonable prices."], ["Reviewed 3 weeks ago", 5.0, "Don't miss the Seals and Sea Lions", "This is a short drive from San Diego, and a great place to view wildlife - primarily sea birds (pelicans, cormorants, etc.), seals and sea lions. There is a nice walkway along the coast with some great views. The town is also nice, with lots of shops, places to eat, etc. Definitely plan a half or whole-day trip, if you're visiting San Diego.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great view of ocean and sea lions", "Nice area to walk and visit the many sea lions and seals lining the water edge. Cute shops. We drove, be aware, not easy to find parking and lots of traffic between 4-6PM."], ["Reviewed 3 weeks ago", 5.0, "A beautiful display of nature!", "Wow! An amazing way to spend a day in nature! Seals, sea caves, beautiful beaches and whales!! What more could you ask for! I loved spending time here!"], ["Reviewed 3 weeks ago", 4.0, "Beatiful walk", "Good sights and you are able to get close to sea lions and see them in their natural habitat. Beatiful sunsent and good coffee shops. Def worth it."], ["Reviewed 3 weeks ago", 4.0, "Come to see the sea lions", "The town is beautiful. We came just to see the sea lions and they didn't disappoint. They were everywhere and very loud. You just follow the noise. Parking is difficult so it's best to go early or drive around until you get lucky."], ["Reviewed 3 weeks ago", 4.0, "Where sea meets land and beauty abounds", "La Jolla Cove is a beautiful area of the Southern California coastline. It's a great place to see seals in their natural habitat."], ["Reviewed 3 weeks ago", 5.0, "Stop 4 of 5 Animal Lover Must", "We spent the day seeing several sites that only required an hour or two. This was stop number four on our list.\n\nIt took a little while to find parking somewhere relatively close.\n\nHowever once we secured parking, it was a quick walk to the beach viewing area.\n\nThey have many bathroom facilities at the beach. There is an elevated horseshoe path that goes out over the water to create the cove.\n\nSometimes you need to time your walking just so on the elevated path or else you'll get soaked by a wave. The elevated path is a great viewing area for both looking out into the ocean and looking at the sea lions.\n\nYou could walk down a flight of steps and walk on the beach area right by the sea lions or seals. They did have a rope up to keep visitors behind so the animals could have their safety.\n\nIt was amazing seeing these creatures swim out of the ocean and belly flop on to the beach.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A perennial favorite for locals and tourists alike", "As a San Diego resident and almost native, I have been coming here for decades all year round. Whether to do landscape photography, portraits, or to enjoy a pic nic with the breath taking sunsets or to snorkel and swim in the cove, or to stroll along the scenic boardwalk. La Jolla Cove offers endless attractions everyone.\n\nOn my most recent visit last weekend, we worked up an appetite walking all over and then he had a nice lunch pic-nic on the grass. Lovely!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Peaceful heart", "I try to come every year. Love the sea lions. Hate that people try to get too close to them. Beautiful beaches"], ["Reviewed 3 weeks ago", 5.0, "La Jolla Cove Swim", "We swim at LJ Cove frequently. Usually swim a mile or so, to one of the buoys. On a clear water day you can see a variety of fish, turtles, sharks, bat rays and seals. Water is warm in August. Sometimes 70 degrees F.\nAlways feel safe with other swimmers. We never swim alone. Nice restaurants nearby after swimming. Lifeguards usually on duty.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must see to see the seals and sea lions!", "We were hesitant to visit the cove because of weekend parking, but we found a place right in front of the cove! You’re able to walk out on the rocks to get a good view. It’s a must see that you definitely shouldn’t miss if you’re anywhere near La Jolla!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Scenic but crowded", "Almost walked on to a sealion\n\nIt is a scenic spot with some good amount of sealions\nA small sand beach accessible by stairs\nI almost unknowingly walked on to a sea lion,till my wife yelled at me\nA sea lion just in the color of sand was relaxing on the beach\n\nParking can be a pain especially during sunset times,you could park on the parallel stree where there are a lot of shops and walk down\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Weekend visit.", "Easy walk.. outstanding scene .. beautiful weather. If you are on scope diving you differently need to try there. Bike rental shops are every where. Food and ice cream tiny shops. Georgia Resturant is my fav as they offer international cuisine .. enjoy !"], ["Reviewed 3 weeks ago", 5.0, "Beautiful Views", "Great place to overlook the caves from above- you can walk down to the rocks or over to one of the decks. Lots of pelicans, sea lions and cormorants. There is also a rocky beach, but there are nicer beaches if that is what you looking for. Nice grassy park above cliffs. Also fun to rent kayaks and paddle out to cliffs.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful", "Absolutely beautiful place. Great views and amazing seals which are so close to you. Will definitelly go back!"], ["Reviewed 3 weeks ago", 5.0, "Beautiful place", "Just loved it here, stopped off for lunch & had a stroll down to the beach, it’s so beautiful & never seen so many seals & sea lions just enjoying the sun, it was amazing. You get to get right up close to them , never experienced it before & loved it. The scenery is breathtaking.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Stunning Scenery", "Can’t say much more. Crystal clear water, wild life everywhere, and the beautiful California coastline. Do not miss if you are in the San Diego area. It is a very easy and short drive. Much to see and do!"], ["Reviewed 3 weeks ago", 5.0, "Great family place", "Beautiful beach area to see sea lions and seals up close. You might even see a whale in the distance. Tide pools and rock formations to explore. Close (walkable) to downtown shopping and restaurants. Well worth the visit!"], ["Reviewed 3 weeks ago", 4.0, "La Jolla day", "Glad we went, locals were very friendly and proud of their neighborhood. The Cove was interesting with seals and sea lions and swimmers..good walking paths, restaurants and shops... glad we went!!"], ["Reviewed 3 weeks ago", 5.0, "Kayaking the Coves", "This was our first visit to La Jolla. Got a great deal on a kayaking tour through everyday California. The water was clear and calm, the wild life was plentiful. La Jolla has a lot of history and charm. Absolutely beautiful."], ["Reviewed 3 weeks ago", 5.0, "One of the best view beach in Southern California.", "Beautify houses, beautiful flowers around the neighborhood that made this Cove very nice and worth to visit. Many restaurants around, coffee shops, bars, lunch or dinner. This place is one stop shop for tourists around the country and world."], ["Reviewed 3 weeks ago", 4.0, "See the seals", "Hard to park but a good place to see seals and pelicans. There are kayaking trips but it is exposed sea not protected coves mostly"], ["Reviewed 4 weeks ago", 5.0, "A bucket-list item for families! Even teen boys will love it!", "When I was about 19, my dad took me to San Diego and I first experienced the Cove. Coming from Indiana, it made quite an impression.\nTwenty-six years later, during a week-long, jam-packed tour of California highlights in SF, LA and SD with my three teen boys, this was on my must-do list.\nWe were there on a late Saturday morning just before New Years, and it did take us quite a while to snag a free 2-hr parking spot right along the shore, but I’m glad I didn’t let the boys’ frustration with parking and heavy traffic deter me, as they LOVED it!! Yes, my active, hard-to-impress, video-game-addicted 13, 14 and 19 year old boys could have stood and watched seals all day long (if their stomachs hadn’t started growling) and ranked this above the Hollywood sign, Hollywood Blvd and other famous Cali spots when our week was over. Watching them re-live my own experience so long ago made me tear up and brought me such joy... that we ended up there on my birthday was perfect, because sharing the experience with them and taking in those views again were the best gifts ever.\nThis is one of those things you never forget- especially for older kids, I think.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Kids loved it", "Great place to see sea lions and seals. The kids loved watching them in their natural habitat. Parking was hard to come by, be prepared to walk quite a ways."], ["Reviewed 4 weeks ago", 5.0, "gorgeous views, very peaceful", "A great place to see seals and sea lions up close in their natural habitats. Along with kayakers, snorkelers, and divers. We came during low tide and it was great to see parts of the ocean floor. Gorgeous scenery. Would recommend for a peaceful and relaxing couple hours in La Jolla.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Still Gorgeous", "My family used to live in San Diego, and visiting La Jolla Cove is etched as a favorite memory. Although we would picnic, I strolled along the water and just took everything in. Seals, expansive views and people from all over the world. Parking was easy in off-season. Very enjoyable experience. I didn't get to the well-rated Taco Stand but just being in La Jolla again was worthwhile.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must Stop!", "Stopped in La Jolla after a morning of hiking Torrey Pines. Walked around La Jolla, had lunch, and visited the Cove. It was really cool! I loved checking out the caves, tide pools, and seals/sea lions. Such beautiful water, landscape, & nature.\n\nI am from Michigan and we may have the beautiful Great Lakes, but you don't get to see this rugged cliff landscape often!\n\nHighly recommend a visit if you are in the area. Very easy drive from San Diego as well.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "La Jolla is overrated but introduce yourself to the sea lions in the cove", "I'm not a fan of La Jolla. It has the same upper+class atmosphere you find in Monaco and Beverly Hills. This is the place for the Armani crowd so you better bring your Bugatti and some heavy duty credit cards.\n\nBut if you like animals head straight for the Cove. Here seals and sea lions are hanging out most of the year, and I can assure you there isn't much Beverly Hills over that smell. But I love watching the sea lions and the seals sleep, snooze, swim, and fight. Don't miss it.\n\nThe coastline is beautiful, too and you can get really close to the gorgeous creatures of the sea. You can easily spend an hour here, especially if you like to take photos.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great for viewing seals, sea lions, and ocean birds", "There are nearly always both seals and sea lions along the coast here that you can see along a walking path. There are also a couple areas where you can go down to the beach areas to get closer views (but make sure you do not het too close to the sea lions, which can be aggressive). There are also dramatic views of waves crashing on the rocks.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Natural Beauty", "Very nice to see Sea Lions Up close and also there are some excellent views of the Ocean. The area where sea lions are concentrated stinks a bit but its not bad if you are a bit far from that."], ["Reviewed 4 weeks ago", 5.0, "Nature to touch", "Wow. What a place. National Geographic live. Beautiful scenery, sunset, and animals!!!!!!!!! Loved it."], ["Reviewed 4 weeks ago", 3.0, "STINKS", "Cool to see the sea lions and seals but the smell is horrendous. Be prepared to gag. The smell was almost unbearable but did go away the closer you got to the animals, strangely enough. Don't plant to spend too much time there as you can see it all quite quickly.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful area, seals!", "This was a beautiful area to visit! The seals were in 'pupping season' so we couldn't get too close, but they were fun to watch. Clean and peaceful area. Parking was hard to find but the walk wasn't too bad."], ["Reviewed 4 weeks ago", 4.0, "Beautiful", "Definitely should stop by this area for the scenery and ocean views. There are tons of shops and restaurants nearby."], ["Reviewed 4 weeks ago", 4.0, "Really Don't Know How to Rate It - It's Great, but...", "It's really challenging to know how to rate this place. On the one hand, there's a nice walkway for exploring, a bit of sand if you want to dip into the water, some caves to explore, and a great grassy area for a bit of play or a picnic. On the other hand, there are seals and sea lions (great fun to observe, not so great to smell), plus the square footage is small so I can see it getting really crowded during summer.\n\nIt was really enjoyable to stroll around on a pleasant, sunny day - there's a lot of variety of coastal phenomenon in a small area. My biggest annoyance was observing idiots attempting to interact up close with the animals (letting your child go close enough to touch a seal that is nursing pups so you can take a picture...ugh...too bad it would be the child and not the parent who would be injured in that scenario).\n\nIdiots aside, it's a pretty little spot (5-stars). Unfortunately, idiots are everywhere and on a sunny day there are more of them (3- or fewer stars). I'm going to split the difference and go with 4-stars and just give the warning to beware of the idiots and small number of parking spots (and the sea lion smell).\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful", "This place is beautiful. Well maintained lots to see and enjoy. Plenty of wildlife, birds and seals. Some beach access also. Just a pleasant place to to stroll, get a bite of food or coffee or just watch the seals and waves."], ["Reviewed 4 weeks ago", 4.0, "Beautiful view, cool animal life, but horrible odor!", "We loved being in the La Jolla area, we at brunch overlooking the cove. It was fun to watch the seals/sea lions, but the smell was almost enough to go somewhere else. I don't think I'd want to stay in a hotel near there."], ["Reviewed 4 weeks ago", 5.0, "Amazing", "This cove/park was one of the most interesting places we visited. It was amazing to watch the sea lions and seals up close and personal. You can walk down onto the rocks they are sunbathing on, and although there are posted signs saying they can and will bite and/or attack, people were walking right up to the seals and taking pictures. The only drawback is the smell, and it is pretty strong.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Sea life", "Lovely cove with sea lions and birds .. great stroll along the beach. Unfortunately we didn’t check trip advisor when we choose the restaurant! Good view but expensive and poor food."], ["Reviewed 4 weeks ago", 5.0, "Absolutely breathtaking!", "Favourite spot in San Diego! Come for an afternoon and walk along the beautiful coastline and visit the 1000 sea lions!"], ["Reviewed 4 weeks ago", 4.0, "Restaurant Week Was Awesome!", "While not every restaurant in La Jolla was participating, we found plenty of places that were and had a great time. Very walkable town with lots to see and do, if you like to shop, eat, and drink! Loved all the fur Seals and sea lions on the rocks. We were able to walk right up to them and while you do need to keep your distance, it was fun to watch their interactions.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Gorgeous!", "Beautiful little town about 20 min from San Diego. Very touristy and can be crowded, however worth the trip. Very walkable, nice beach areas, plenty of restaurants."], ["Reviewed 4 weeks ago", 5.0, "Don't Miss!", "This is a wonderful coastal area to just enjoy the ocean and the community. But it is an amazing spot to see the many seals and sea lions, ocean birds and tidal pools."], ["Reviewed 4 weeks ago", 5.0, "Amazing", "This was the highlight of our trip, seeing wildlife in its natural setting was amazing. The rocks are filled with seals and amazing birds. Seals can be viewed frolicking in the surf and sum bathing on the rocks. The ocean and mountains are spectacular. There is a cabe to tour veey close on water sports. Really special location.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Easy Access to Beauty", "This is a beautiful area to walk or sit. An ocean view with plenty of sea life including boats, snorkelers and kayakers. Stroll along the cliffs and guess where the other walkers are from. If you get tired it's just a short uphill walk to bars and restaurants.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Seals, Seagulls, Sunset and more", "We were in San Diego for a couple of days and were told to definitely visit La Jolla Cove. Very glad we did. Reaching there is easy using train/bus from San Diego.\nIt's a fantastic place to spend an evening. Its very scenic and you can see the most gorgeous of sunsets.\nGreat place to see Sea Lions in the wild up close. Great variety of birds too. Must visit if in San Diego.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Get there early! Beautiful!", "This is definitely worth stopping at if you are in La Jolla. Go early! I arrived at 9:30am on a Saturday and got one of the last spots right along the grassy park area. There weren't too many tourists either. By the time I left, it was crowded and lines of cars snaked along the road looking for a parking spot. There are so many sea lions! I stayed for a couple of hours walking along the paths. Further inland are lots of small shops for food and gifts/trinkets.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great views and tide pools", "Love the views in this area. Stairs give easy access down to the cove and tide pools. At low tide you can find hermit crabs, anemones, limpets, various sea plants and get up close to the sea lions. Great experience."], ["Reviewed 4 weeks ago", 5.0, "Beautiful scenery", "Great place to take pictures of the sea lions and get up close to them. Breath taking views. Great way to spend the morning and watch a sunset."], ["Reviewed 4 weeks ago", 5.0, "\"Seal\" Cove", "This is a staple for every visit that I make my way out to San Diego. Sometimes you are not able to go on to the beach close to the sea lions, and other times you can (which is MUCH better obviously) - so be sure to check before planning your travels. We were lucky enough to see the birth of a baby seal once before this trip and it was so cool to see how raw and real nature can be.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Seals are amazing!", "Great place to see seal pups up close. They are all around and on full display for visitors! Just don't try to get too close. Some people do that, but I'd say just admire them from a distance without being too invasive. Warning, there are huge crowds in the area and traffic is horrible. We went in August.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Sea lions!!", "This is a beautiful spot where you can get close to sea lions sunning themselves on the cliffs. Also lots of neat birds, many nesting on the cliffs. Well worth a stop!"], ["Reviewed 5 weeks ago", 5.0, "Love the seals", "Had a nice walk with the family along the stroll. My son loved looking at the seals (even though they are stinky) Such a nice way to spend an afternoon"], ["Reviewed January 24, 2018", 5.0, "Spend some time here and enjoy the view", "We only got to spend an hour here, but would have love to stay longer. What beautiful view of the coast line with water smashing on the jagged rocks. If you love to see seals, you don't even need to go to sea world. You can walk right up to wild seals hanging around the cove. Lots of different kind of bird if you love seeing and photographing birds as well. Looks like there are some nice restaurant with a perfect view of the ocean to pair with your meals, but we ran out of time and didn't get to try it.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Excellent stroll", "Beautiful landscape, very comfortable walk on the coastline. Nice view of the harbor seals during pupping season."], ["Reviewed January 24, 2018", 5.0, "A must see", "Gorgeous ocean views Seals are everywhere. Walk down to the beach and through the town. Cute shops! Great for children of every age. I will return and stay here next time!."], ["Reviewed January 24, 2018", 5.0, "Great Weather", "Visited La Jolla Cove with my family. It was a great experience for my 4 and 7 year old granddaughters."], ["Reviewed January 24, 2018", 5.0, "Sea Lions and Seals", "On a warm winter day La Jolla Cove is a great place to walk. There are many people all watching the sea lions and seals sunbathe. It is fun for both adults and children. There are street vendors and many restaurants nearby where one can eat and look at beautiful ocean views.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Excellent views.", "La Jolla is in San Diego and is considered to be a very luxurious place to live in. Condos there have excellent Ocean Views."], ["Reviewed January 23, 2018", 5.0, "What a spot", "A perfect spot along the coastline of San Diego. Nicely protected. Enjoy this little slice of perfection. A short walk along and you go down to a spot which overlooks the sea perfect for photos. Not to far at an area of coffee shops . Ice cream places and plenty of eating spots. La Jolla cove is the name given to this area.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Perfect for sunset", "This place has a perfect sunset and is great not only for local communities but also for tourist!!!!"], ["Reviewed January 23, 2018", 5.0, "Breath Taking!!!", "Went early morning to avoid the crow, and it is just amazing. It is impressive how you could be so close to nature. This is a great place to just sit and relax."], ["Reviewed January 23, 2018", 5.0, "Great place to see sea lions!", "We were here during pup-ing season, so nobody was allowed on the beach. But we did see some swimmers. The sea lions were sunning themselves on the rocks and having a great time. Loved watching them! I've swam in the Cove before, with other triathletes and distance swimmers. It's a great place to hang out.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Mesmerizing", "A beautiful place that allows you to walk around and take it all in. You can walk around the and see the sea lions right in front of you. The coast is calming and just an incredible place to relax and watch beauty all around you.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Lots of sea lions", "I have the opportunity to experience the wonderful company of many sea lions, just adorable all of them.. I highly recommend this attraction, just remember to keep a safe distance and don't get to close to the seal babies or cubs otherwise their parents will abandon them..\nShow less"], ["Reviewed January 22, 2018", 5.0, "Lunch in Lajolla", "This is a great destination spot to swim in the surf, snorkel and see some seals. Had a bite of lunch overlooking the caves then explored the site, watched the seals playing and singing. It was well worth the drive even thought the weather wasn't ideal. Gorgeous spot!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Beautiful sight", "A must see while in San Diego! La Jolla Cove is home to so much to see and do. There is park, put your feet in the water, or swim, plenty of shopping, eating, leisurely walking. Looking North you can see the Scripps Research Center and Pier, There are lots of seals and sea lions who love to hang out there too!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Gorgeous", "La Jolla is one of the most beautiful cities along Southern California Coast\nAnd it’s a must visit spot\nOur family just loves it , it’s one of our favorite spots\nAnd La Jolla cove has so many adventure to offer, you can go kayaking or even just take a walk and see the seals\nShow less"], ["Reviewed January 22, 2018", 5.0, "Best Happy Hours", "La Jolla has some of the best happy hours. Try Cantania, Isola, Herringbone and Ambrogio 15 for gourmet foods at affordable happy hour prices."], ["Reviewed January 22, 2018", 5.0, "Wonderful first visit", "Visited La Jolla for a wedding. A lovely location with wonderful restaurants and stores. And, I had my first Pacific coast diving experience. A great stop for a relaxing weekend or get away."], ["Reviewed January 22, 2018", 5.0, "Amazing views", "This was a park-like setting and a very nice place to just sit and watch the ocean with the beautiful sunset. The colors were amazing. We spent several hours just watching the seals and sea lions and were able to climb the rocks down and get within several feet of them. The waves crashing on the rocks were just so amazing to hear and watch.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great Sea Lion and Seal Watching Here!", "We saw so many migrating sea lions. They were very friendly and put on quite a spontaneous show! The seals were a bit less active. The waves were very rough the days we visited and we loved watching them slam against the sea walls. What a pretty way to spend time in LaJolla!\nShow less"], ["Reviewed January 22, 2018", 4.0, "Make a point to visit..", "While in SD, I recommend taking a bit of time to check out this area. We came about 10:30 am and easily found parking and enjoyed a nice stroll. The wildlife was interesting to see and it was fun watching the sealions and seals. The cove area is nice as well. There were some brave folks who were also swimming in the cove (way too cold for me). This is a nice area and certainly does not need to be a long visit, but it certainly warrants a look if you are in the area.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Stunning and fun", "Great place to enjoy a great view and find some peace. Well maintained. A bit busy, but what beach isn't?"], ["Reviewed January 22, 2018", 4.0, "Nice place to view Sea Lions", "This is an attractive part of coast line. There , at least when I was there, were plenty of opportunities to get close to to Sea Lions and other wildlife. Very enjoyable and not crowded (weekday)."], ["Reviewed January 22, 2018", 5.0, "Spend the Day, Enjoy the Sunset", "This is a beautiful location. If you want to swing, kayak hang out, have lunch or watch the sunset, it's just a really pretty place."], ["Reviewed January 22, 2018", 4.0, "Very nice park", "Its a great place to go for a walk. The park on the border to the beach and the ocean has great views. Nice place to eat an Icecream or a bear, depending on how you feel."], ["Reviewed January 22, 2018", 5.0, "Amazing views", "What a beautiful place to grab lunch or dinner, Georgie’s if the perfect restaurant for a relaxing lunch or dinner. Great walking along the water just beautiful"], ["Reviewed January 22, 2018", 4.0, "Anchors Aeay", "This is where all the kayakers launch from. It's a nice little beach and makes for easy access for kayaking."], ["Reviewed January 21, 2018", 5.0, "Best View of Sunset", "The sunset at La Jolla was the best I have ever seen!! With luxury houses on one end, a small pier in the centre and the city on the other!! A must visit when in San Diego!"], ["Reviewed January 21, 2018", 5.0, "I absolutely love this place", "My two grandkids and I went for breakfast in La Jolla and went to spent the day. We made a picnic lunch which you can have at the park. We saw the sea lions and took pictures as well as went in the water on the beach at the kids beach area. They also have a Cave at the Cave store that can be explored as well.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Cozy Cove Beach", "Pleasant, cozy cove with beach, kayaking, sea lions and places to eat and drink. We did a kayak tour of the caves in the cove. Safe, fun and very interesting."], ["Reviewed January 21, 2018", 5.0, "Absolutely beautiful!", "We visited shortly after the sun came up and it was absolutely beautiful. Bring your camera for some amazing photo opportunities. And keep an eye out for the seals."], ["Reviewed January 21, 2018", 5.0, "It’s The Cove", "La Jolla Cove is one of the classic must visit places in the USA.\nThe seals and pelicans and sea lions own the place, but you can swim in the Cove during warmer weather. Beautiful waves, accessible to most who come. Thanks to California for not making these beaches into private property.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Must see sea life", "Worth a visit to see the seals, sea lions and birds, esp pelicans. Parking was tough but the walk along the coast is lovely. My teens enjoyed exploring the rocks too. Not really a sit and bathe Beach but definitely worth the trip."], ["Reviewed January 21, 2018", 5.0, "The Glorious Pacific", "As a native, I've seen the Cove over the years and it's still positively heaven on Earth. Great path to workout or run; great stroll for clearing your head and then enjoying the seals, especially during pupping season. Recommend going early before the tourist groups and it's stunning in the morning sun.\nShow less"], ["Reviewed January 21, 2018", 5.0, "A fun place to spend a few hours!", "We just dropped in as we were driving by and wish we'd planned a longer visit. Sea lions and seals, good food, fabulous scenery! The surf was up to about 8 feet so we enjoyed watching some very hardy (crazy?!) dudes out body surfing."], ["Reviewed January 21, 2018", 5.0, "Beautiful view", "There are many things to do at La Jolla Cove including walking thru the cave to see the ocean, eating at fine restaurants and sitting on the beach."], ["Reviewed January 20, 2018", 5.0, "So much fun for free!", "My daughter and i could have spent the whole day there but the wind came up and we were a bit chilly. Bring a sweat shirt and your camera and then simply enjoy the day near the water and the animals. Be sure to check out the sea lions while watching for whales in the distance. Plenty of free and paid parking.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Great walk and views of the ocean and sea lions/seals", "We always stop here after we eat for a nice walk. It’s a great place for a walk and to look at the sea lions and seals. We came here in January and they are always here, but whether they are at the cove or a different spot nearby just depends on the surf. Be aware that the area near the wildlife is pretty smelly. Also when they are by the cove there are stairs to climb down but don’t be the person that gets up right close and disturbs them.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Loved our visit and time in La Jolla", "Our family of 4 (kids 10 & 12) thoroughly enjoyed our time at the Cove yesterday! We loved seeing the sea lions basking in the sun. And the scenery is amazing! We were very sad to see people getting way too close to the seals in order to take pics and selfies. The seals would move away as people got closer but apparently the people are either not smart enough to know they are scaring them or they simply don’t care. I sincerely hope the seals don’t stop coming to this amazing place if the people don’t stop invading their territory. Please respect these animals and stay back on the sidewalks!!\nShow less"], ["Reviewed January 19, 2018", 5.0, "Beautiful waterfront area", "Just a relaxing, beautiful area to spend some time at. It was a bit overcast with large swells. Saw surfers, seals and pelicans."], ["Reviewed January 18, 2018", 3.0, "Decent Place", "Not sure what all the hype is about this place but my husband and I found this place to be just OK. We people watched and that's basically it, maybe it's because we went during November and it was bit chilly, it was still just ok.\nShow less"], ["Reviewed January 17, 2018", 4.0, "La Jolla January 2018", "Traveled to San Diego to see friends and took the kids to La Jolla Cove - they enjoyed the sea cave and the sea lions with their favorite being the steps that lead down to the ocean. Hang on to your kids since the waves can sneak up and take out any littles not hanging on to the railing tightly. Overall a fun day.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Sea Kayaks!", "This was on my bucket list. The day was a bit windy and the water a little choppy but still wonderful."], ["Reviewed January 17, 2018", 5.0, "fantastic", "Such a nice scenery, there are a couple of small beaches (at least from what I saw from my walk), one of them is out of reach because seals go there (such a nice surprise!). When we were there the sand was covered by seals chilling under the sun, so beautiful! There were some locals that were \"catching\" sea hares and showing them to the tourists. It was a stretch to find a parking spot though.\nShow less"], ["Reviewed January 17, 2018", 5.0, "La Jolla Cove", "Beautiful natural area, but tourists should be kept off beach during sea lion pupping season. Tourists stress the animals in their habitat."], ["Reviewed January 17, 2018", 5.0, "Beautiful natural cove easily reached with a short walk.", "La Jolla cove is a beautiful natural cove that can be easily seen below without any walking or explored on foot with only a short walk. Many coves are a long hike but not his one. It is a cove that can be enjoyed from above as well as from the town of La Jolla. There are many good restaurants that offer great food, drinks and an amazing view.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Beautiful place!", "This is a place that you need to visit if you go to San Diego. We went as a family. We walked around the bay and we saw the seal lions. It is a gorgeus place!"], ["Reviewed January 16, 2018", 3.0, "Loved seeing seals", "We stopped there for a morning walk, and were fortunate enough to see so many seals just hanging out and socializing with humans!"], ["Reviewed January 16, 2018", 5.0, "Great Wildlife", "Kayaking over the kelp forest, watching a whale migration, and hearing the songs of sea lions was the ultimate experience. This place is a great way to spend the afternoon and is just 20 minutes outside of SD."], ["Reviewed January 16, 2018", 5.0, "Beautiful", "Went to sort of see the sunrise... weird I know - but my nephew said the colors in the sky were amazing so we decided to check it out.. he was right - the sunrise (although we didn't actually see the sun come up) we saw colors in the sky that looked nothing like a sunrise in Chicago. We were here the night prior and experienced a ton of seals and sea lions. They were everywhere and very vocal. There are signs up telling you to keep your distance - sea lions can be dangerous, but even just sitting on a bench close by - they are still sooo close. Besides the seals - the beach and facilities were very clean and taken care of. It was very peaceful and serene.. I would definitely go back!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Stunning", "Great scenic trip, especially around sunset. Go in the season where you can see seals and sea lions-I wouldn't suggest getting too close, but you can get some great photos! Explore the coves via kayak or paddle-board if you have time."], ["Reviewed January 15, 2018", 4.0, "Beautiful and peaceful", "A very nice beach and area with nice houses and ok restaurants (no to the level of what you would expect there...)"], ["Reviewed January 15, 2018", 5.0, "The seals!!!", "What an amazing experience. There were so many seals laying around, just sun bathing, letting us watch them be lazy. We loved it!!!"], ["Reviewed January 14, 2018", 5.0, "A nice place to relax", "Hopefully you get a sunny day while visiting here as it can be a bit foggy sometimes. Lunch on the grass or a few photos by the water is nice"]]}}