{"Lands End": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Lands End", "url": "/Attraction_Review-g60713-d117409-Reviews-Lands_End-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/fe/a9/9d/sutro-baths.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2342"}, "address": {"@type": "PostalAddress", "streetAddress": "Point Lobos Avenue and El Camino del Mar", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94121", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Beautiful place to walk", "It's all down hill (until it's up hill). A great walk on the way down. The way back up is tough (especially if you're out of shape-Like me) but all of SF seems to be up hill in at least one direction. The view was worth the elevated heart rate ;)\nShow less"], ["Reviewed 6 days ago", 5.0, "Come here at sunset", "We chose to do this hike around 4:30pm on a Saturday in February and it was the best time to visit. The sun was just setting toward the end (near the Golden Gate Bridge) which was absolutely beautiful. Be sure to wear comfortable or gripped shoes...there are cliffs in this hike that aren't roped off and can be a bit dangerous in parts. Worth the visit in SF.\nShow less"], ["Reviewed 1 week ago", 5.0, "A Must See When Visiting San Francisco", "An historic landmark on the Pacific coast. Beautiful views from above the ruins of the Sutro Baths and also from the Cliff House Restaurant. If you're feeling a bit daring, explore the ruins or hike the trails above them. There is also a souvenir shop and restrooms. A great place to watch the sunset.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great walk from Cliff House to Legion of Honor", "The last time I visited Legion of Honor, I walked behind the museum and discovered an interesting trail that went down along Lands End.It past a nice monument to a WWII ship,San Francisco and passed by the Sutro Baths and Cliff House which I had never seen before.On my most recent visit, we started at Cliff House and reversed the walk.It was a gorgeous day and we were rewarded with marvelous views including Golden Gate Bridge.Very memorable and of course a visit to Legion of Honor as well!\nShow less"], ["Reviewed 1 week ago", 5.0, "Add it to your list of \"to-visit\" today!", "I have been to SFO almost a dozen times and never knew this place existed. Boy, what a treat! Amazing views of the GGB, beautiful coast line, easy hiking, and cool caves. We took an Uber to the top of the trail at Lands End and just coasted down the path toward the Sutros Bath. The views are breathtaking. The Sutros Bath was fun for climbing. The tide was out amazingly far so we were able to walk way out on the beach. We hoped to see the Camera Obscura, but unfortunately it was closed by the time we were done exploring. Ultimately we ate dinner at Cliff House, which was expensive, but expected. This entire hike, cave, beach walk was probably my ultimate favorite portion of our trip. You can make it as strenuous or easy as you'd like and I can't say enough about the amazing views. Gorgeous.\nShow less"], ["Reviewed 1 week ago", 5.0, "Nice place, go early", "this place is fantastic for photo opportunities or if you just want to walk the trails. I would recommend going early if you're going to photos though because it does get busy with tourists and locals running/walking the trails. The earlier you go, the less people you have in your shots. There is walking required so wear good walking shoes. Parking is limited in a parking lot but there were cars parked on the side of the road on curbs.\nShow less"], ["Reviewed 1 week ago", 5.0, "A spot you have to see", "Lands End is a wonderful place to see so much of the things California is famous for: beautiful trees, the sea, the coastline and of course the Golden Gate Bridge. While you don’t see it at the beginning of the trail where you can first see the old Sutro Baths, the bridge suddenly appears after a short walk and the view on the bridge gets better and better with every step you take. So Lands End is a good spot for many memories and photos :-)\nShow less"], ["Reviewed 2 weeks ago", 5.0, "amazing what you find when you are not looking for it.", "had a lovely day out, caught the bus, were going to the park but got off at the top of the lookout. amazing. lovely little gift shop with interesting information that kept us in the area for hours. bought a lovely teal shoulder bag with the Golden Gate Bridge embroidered on it, has been admired across the world. did a lot of walking around the old baths, had a drink and snack at Cliff House. got to peruse a book on the history of the area. walked down to Golden Gate Park. amazing what you find when you are not looking for it. happy day out.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great park lots to see", "Just beside Cliff House is the Lands End Park. We got a great view of the remains of the Sutro Baths from the cliff above. Took a walk through the park and saw the shipwrecks just off the coast. Good view of the Golden Gate Bridge and the start of the Bay.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must see and do!", "Land End is a must see and do in San Francisco. Beautiful and scenic and one of those places you never get tired of visiting. Local favorite along with Fort Point and Chrissy Beach."], ["Reviewed 2 weeks ago", 5.0, "Beauty walk", "Not really a hike, but a nice walk. Beautiful views and lovely break into nature. Take a Lyft or uber to cliff house and walk all the way to baker beach 👌🏻"], ["Reviewed 2 weeks ago", 5.0, "so much beauty!", "It's an incredible place with incredible views!\n\nFrom the Cliff House to the modern ruins of Sutro Baths to the tunnel to the hiking to the bay to the Marin Headlands to the fresh air to the fog horn to the history to the local culture to the natural and exquisite beauty ...\n\nI am mesmerized by how lucky, honored, and privileged I am to have been there!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great hiking and sunset", "There's a nice variety here - there's a beach nearby, a restaurant, the Sutro Baths for some interesting hiking and history, and good hiking trails. The trails are fairly easy and offer a really good view of the ocean. The parking lot above the Sutro Baths offers one of the best views of the sunset right over the ocean with some benches overlooking everything. On windy days it can be rather cold. There's a small tourist center at the parking lot which has bathrooms I believe but it's not open too late.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Loved the Hike...Really Loved the Views", "Crossed this off the san francisco bucket list. Cannot believe I had never visited in the 20 years I have lived in the Bay Area. If you like to hike, this is a must. If you want fantastic views of the GG Bridge, this is a must.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing hiking and ocean view", "Went here with several friends and hiked down from the water to see the baths and the caves. Definitely one of the least appreciated wonders of the city. Very peaceful and open; a refreshing sight after being in the dense, crowded city."], ["Reviewed 4 weeks ago", 5.0, "Amazing hike", "This was an incredible afternoon hike. Don't miss this during your visit if you enjoy nature. It is as strenuous as you want to make it with a lot of staircases down to various views of the bay and the Golden Gate Bridge. Make sure to wear good shoes and watch your kids because it gets narrow and steep and the walk back up can be a bit tiring. The trail is pretty and the view from the beach at the bottom of the hill is breathtaking. I don't think you have to be in terribly good shape, but be ready for a good hike. There is even some history available to learn, at plaques along some of the trails. If you go to Cliff House restaurant(s), be aware that their menus are priced based on the knowledge that people who dine there want to be able to say they dined at Cliff House so the meals are priced accordingly.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful", "Awe-inspiring views. If you can don't miss the sunset. Take the trail to the Golden Gate Bridge. The views are do die for."], ["Reviewed 4 weeks ago", 5.0, "A great place to visit", "Had a great time walking on the trail that starts here. The view was scenic, and the air was clean and crisp. Would recommend this place to anyone. Bring your beloved pet along as well for a nice stroll."], ["Reviewed January 23, 2018", 5.0, "Amazing", "Wonderful ocean views. You will see the many places from here: the monetary cypress, rocks on the ocean, Golden Gate Bridge, cliffs, waves, trees, you will also see some ruins, and a cave. During low tides you might also be able to see some ship wreckages in ocean. Sunset is stunning. Also it is dog friendly.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Really nice spot", "Though packed with tourists, I found a quiet enough spot to look over the water at the Sutro Baths and look out at the sunset. Very relaxing and very close to some great walking spots at Lincoln Park. Buses into the Richmond restaurant strip come very regularly as well, if you're looking for a bite to eat after your relaxing sunset visit to the beachfront baths, or a wander along the vast beach strip a few hundred metres south.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Surfs Up", "Waves were sixty feet tall. Watching them come in was amazing. I wished it was a little more clear so we could have seen out further. The weather was not our friend so we were not able to spend as much time as we wanted to.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Beautiful landscape and trails", "Visiting this place was one of the best things I did during my visit to San Francisco. The trails are well-kept and the views are exquisite. I recommend walking the trail from Point Lobos to the Golden Gate bridge on a sunny day. Comfortable, sturdy shoes are a must.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Wonderful hike", "This was a great hike. We took a trek through a neighborhood to reach via mass transit. We took a picnic lunch. It was fabulous!"], ["Reviewed January 21, 2018", 5.0, "Nice hiking trails with stunning views", "Pros:\n1. Amazing ocean views. You will see the monetary cypress, rocks on the ocean, Golden Gate Bridge, cliffs, you will also see some ruins, and a cave. During low tides you might also be able to see some ship wreckages in ocean\n2. Dog friendly, we didn't see any off lease dogs\n3. You can walk to Legion of Honor from the trail and pop in for awhile if you are a member\n4. You can choose a detour to the beach to get extra stairs and additional calorie burns.\nCons:\n1. Quite a bit people, it's a popular trail\n2. Parking can be a pain\nShow less"], ["Reviewed January 21, 2018", 5.0, "Georgeous views!", "I have been to Lands End hundreds of times and never ever get tired of the beautiful view. You can see the Golden Gate Bridge and the Marin Headlands . There are viewing binoculars at the top . There is a partial hull of WW two destoyer that took on much fire that the shell holes in the hull are visible. I cannot imagine the horror that day when so many lives were lost and in danger. There are walking paths that take you closer to the Bridge views and the Pacific Ocean . Keep on the signed paths as people hoping to get the best pictures wander off and fall off the cliffs , frequently having to be rescued or worse. It is such a beautiful place . You can see Seal Rock , where dozens of Seals congregate and bark for hours . Just down the hill there are a few restaurants with views but none like Cliff House restaurant that has million dollar views of the Pacific and best at sundown. Then a little further down you will be at Ocean Beach where dozens of Surfers test the wave. I suggest yiou enjoy the beach and views but \"do not go into the water\" . There are severe undertows that can sweep,you away in seconds. Every year people have not read the signs or just want to dip there feet into the ocean have drowned. Other then that , you will have some of the best views ever.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great Nature in SF", "We went on Thanksgiving Day for a hike. From one end to the other, it takes about an hour, and you'll find several vantage points with a good view of the Golden Gate Bridge. Just for the view, it's worth a visit."], ["Reviewed January 20, 2018", 5.0, "Urban hiking and great ocean views", "I was easily able to access the park in 45/60 mins from downtown San Francisco via the 38R bus. For those with a car there is also plenty of parking. For experienced hiker's this will be more of a stroll, but the history is interesting and views are fantastic. I recommend making a detour to the USS San Francisco memorial if you're into history.\nShow less"], ["Reviewed January 18, 2018", 5.0, "The views from the Lands End Trail are some of the most beautiful views that California has to offer.", "I started at a park overlooking the Pacific and I believe it was once the location of the Cliff House Gardens. Then I walked down to the Cliff House and climbed over the wall and down to cross over to the location where the sutro baths were at one time. Now its just ruins, lost to the ferocious power of the Pacific. From the sutro ruins, stairs lead up to the Lands end trail with beautiful views of the Pacific Ocean and Golden Gate Bridge. I saw a family of Orcas playing close to the shore. The trail ended near the Legion of Honor art museum and then I ventured into a magnificient neighborhood in the Presidio. This is my favorite place in all of San Francisco.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Breathtaking view and nice hike", "My husband and I arrived in the afternoon on a government holiday, so there was a little bit of crowd as compared to other days, as what locals had told us. However, even with the crowd, we got to enjoy our trip there. We explored the Sutro Bathhouse ruins first. To hear the waves crashing against the rocks, is surreal. Makes one wonder how it was like when there was still a building there. We continued our adventure on the trails, and there were several spots that you can take pictures of, with the Golden Gate Bridge in the background. There are several steps that might be difficult for certain people, however, you can still catch a beautiful view, even if it is not easy for you to hike. Don't forget to check out the information center. Another tip, we took the MUNI bus 38R from the Union Square area. Very convenient, and only $2.75/one way. Will definitely do this again when we visit San Francisco next time!\n\nClothes Tip: San Francisco in January can get very windy and chilly. Be prepared to wear layers because once you get sweaty, you might still want to take off your sweatshirt but you still don't want to freeze!\nShow less"], ["Reviewed January 11, 2018", 5.0, "Fantastic \"Urban Hike\" that Feels Far Away from the City", "You can't go wrong taking this hike! Pick a portion or do the whole thing and take a picnic for the beach.The portion just west of the Golden Gate bridge was my favorite and had lots of steep bits to the trail. It was incredibly windy which made it much more chilly than we felt walking around San Fran, so definitely take a jacket. When we got tired we called a Lyft ride back into the city:)\nShow less"], ["Reviewed January 11, 2018", 5.0, "Wonderful walk along the bay", "This is a gentle dirt walking path right along the bay with great views of the golden gate along the way. We were there on a busy Sunday and there was plenty of parking in the lots at the western-most end. And there are restrooms there as well.\n\nWe walked round trip within the park and hung out at the labyrinth for a short time. Could have easily extended our walk into the fancy neighborhood on the eastern edge. You can take a short walk here or make it most of a day and walk to the Golden Gate and beyond. You can also walk right down to the ocean.\nShow less"], ["Reviewed January 10, 2018", 4.0, "A nice way to spend the afternoon...", "Parking is free, but we had to wait about 5 minutes to find a spot. After parking, we\n* walked the path to Sutro Baths below and took some beautiful photos\n* walked the trail that takes you around the hill where you can see the Golden Gate Bridge in the background.\n* visited the Visitor's Center and checked out the shop, the exhibits and got some coffee\n* Drove to Baker Beach (about 10 min away) to see the sunset and take pictures of the GG with the pink sky as a backdrop\n* Drove to The Cliff, for a nice dinner.\n\nIt was a great way to spend the afternoon and evening.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Local tourist", "Whenever I visit here with my kids, I feel like a local tourist. A beautiful landmark in our backyard yet I always feel as if I am seeing it for the first time. The history of Lands End is fascinating and makes me realize that San Francisco is not as new as one might think. The city only dates back 230 years, unlike European cities that span centuries, yet you still have a sense of history here.\n\nNature and views are breathtaking here. We always walk down and spend a good hour watching the waves and playing around before venturing back up and hiking around the coast. Of course, we stop at our favorite restaurant for a quick soup or a more formal dining experience at the Cliff house, followed by a stroll along ocean beach.\n\nA must for anyone visiting San Francisco, especially for the first time. To catch the best views venture here during the day between 10 AM and 3 PM and always check the forecast.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Don’t Miss This!", "Well maintained hiking paths with spectacular views. I have been to San Francisco several times and have never been to Lands End. Absolutely should not be missed."], ["Reviewed January 7, 2018", 5.0, "Favorite spot in the city. Take it from a local.", "If you want to see some of the best of San Francisco where nature meets the city. This is the spot, check out sutro baths it’s beautiful old ruins. and lands end from the parking lot, it’s a bit of a hike to lands end but you get a stellar view of the Golden Gate Bridge.\n\nThis is one of my favorite spots to take people when they visit I’ve been coming for years. Bring a jacket!\nShow less"], ["Reviewed January 6, 2018", 4.0, "Stunning views", "Stunning panoramic views. Very peaceful and tranquil. Could sit and relax here for hours. Perfect for walkers or readers. Restaurant near by."], ["Reviewed January 5, 2018", 5.0, "a MUST-SEE", "Absolutely worth all the hassle I had to endure to get here. Amazing views! Not a touristy spot, which is a real plus."], ["Reviewed January 4, 2018", 5.0, "Not the end but the beginning...", "The beginning of a beatiful hikes awaits you at Lands End. The name is precarious as it conveys a place of ending. The word beautiful does not even come close to describing this place. Made me feel so small and insignificant in the spectrum of life. It allows your soul to open and appreciate what life is really all about. Not Wi-Fi, cell phones, facebook status. You, for just a small fraction of your life, forget all those materialistic things and just live.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Lands End--ocean begins", "Really a must do in SF. You can start at the Cliff House, and if you haven't been there in a while, it's worth checking out again. Nice place for food and/or drink. And then the Sutro Baths. Crazy! And then a beautiful stroll or hike along the Lands End trail. It's a great way to spend a morning or afternoon or both!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Great views and endless hiking", "We visited on New Year's Eve and there weren't many people there. We brought our dog and kids and explored a fraction of what there is to see. There are interesting historic shipwrecks, bath house ruins, beach, trails, rocky coastline, eucalyptus groves, restaurants and a visitor center. We could have easily spent the entire day here, but hunger set in and we opted to eat elsewhere, but understand the Cliff House is a nice place to eat.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Gorgeous views! Great area to walk around", "This is a must go place for any locals, tourists or anyone visiting SF if they have time. It is really beautiful here, it is pretty cool to look at the \"ruins\" of the old Sutro Baths, there are trails you can walk, you can go to the visitor center and the Cliff House is not beautiful on the exterior but it is gorgeous with great views on the inside. The Cliff House is great for a \"date night\", special occasion or just hang out and have a drink and/or appetizers and take in the views!\nShow less"], ["Reviewed January 2, 2018", 5.0, "Beautiful Sunset", "Great park to take a hike, some of the paths are modestly steep, but then, that is typical for side walks in San Francisco. Recommend taking a camera to catch spectacular sunsets in the Pacific. Note that finding parking can be a challange."], ["Reviewed January 2, 2018", 5.0, "Very beautiful--highly recommended!", "Land's End offers excellent views. Highly recommended. We didn't have a car and therefore had to rely on public transportation, which was a bit time-consuming (a bit over an hour) from where we were staying (2nd Street, south of Market Street). And yet the bus ride was enjoyable because we had the chance to view SF neighborhood we hadn't yet seen. There are some portions of some of the trails that are quite strenuous for those who aren't very fit (I'm in that category!).\nShow less"], ["Reviewed January 2, 2018", 5.0, "Gorgeous Bridge Views", "Take a flat hike along the bay to see beautiful views of the Golden Gate Bridge from the back side. Some trails (if you take the giant staircase down farther) are narrow and it was a sand storm in a high wind."], ["Reviewed January 1, 2018", 5.0, "Allow time to hike here when visiting the Legion of Honor", "Love to do a quick or longer hike here when visiting a show the Legion of Honor Art museum at the top of the hill. The views are breathtaking, it is rarely crowded, and plenty of facilities for garbage, restrooms, and dog friendly."], ["Reviewed December 30, 2017", 4.0, "Just walked upon it.", "This was a nice surprise. We were taking a long walk the first day and just continued on with Lands End and the cliff walk. Great hike with beautiful views. The history about the Baths in incredible."], ["Reviewed December 29, 2017", 5.0, "Neat vantage poin", "There is a Nice Reception center here and very cool views. You could walk down to the Waters edge if you chose."], ["Reviewed December 29, 2017", 4.0, "Great Hike with a Beautiful Coastline", "I love California for the view of the ocean and the rocky coast. I grew up in Florida where mountains and rocks do not exist. Every time I go to California I am exited to see the way to way the coast meets the ocean.\n\nLands end is a perfect hiking spot. It has views for days and you do not have to leave the city to get there. I only had a short time to explore but I cant wait to go back again.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Must see!", "The detour is definitely worth it. Walked down at sunset and it was truly beautiful. Many different paths and viewpoints, pink skies over the golden gate bridge!"], ["Reviewed December 25, 2017", 4.0, "Part of History", "Bullet riddled poece of war ship on display and good view with informative display Hard to find unless you know it is there"], ["Reviewed December 25, 2017", 5.0, "Gorgeous Views", "As a tour guide in San Francisco it is always my aim to bring my groups here, it is a beautiful view over the Pacific Ocean especially at sun set. I think it is a must for all visitors to San Francisco"], ["Reviewed December 21, 2017", 5.0, "A beautiful urban hike", "We lucked out and had the perfect sunny clear weather that makes this hike the best thing to do on a Sunday morning before brunch."], ["Reviewed December 21, 2017", 5.0, "Stunning on a Clear Day", "I had the good fortune to visit on a very clear day. The views of the Sutro Baths and shoreline rocks are stunning from all angles. Take your time!"], ["Reviewed December 19, 2017", 5.0, "A nice walk with beautiful views", "Nice views of the ocean and Golden Gate Bridge. Some nice scenic walks with visitor centre and cafe."], ["Reviewed December 18, 2017", 4.0, "Always good for a walk here", "This place offers a very pleasant walk - not difficult at all. One can spend 30min or 90min here, depending on how much time you have. It is a popular place for locals to walk their dogs here too.\nIt also offers a view of the Golden Gate Bridge a far off.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Beautiful views, crowded on weekends", "We loved our 2 visits Lands End, but liked it better on a Tuesday than a Sunday. We first visited on a Tuesday after a day of sightseeing. We loved the views but we were a little late & had just missed sunset. When our plans got shaken up by the wildfires, we ended up staying in northern California & so we decided to go back the day before our flight home (Sunday). Being from New York, we're used to places being crowded on the weekends. Lands End wasn't too bad, I'd say moderately crowded. That didn't stop us from getting in a good vigorous walk complete with the stunning sunset views we had missed before.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Hidden Gem", "We had fours days in SF and spent a wonderful whole day exploring the area around Lands End, including Sutro Heights, a visit to the USS San Frescisco memorial and a walk along the coastel trail. We were very fortunate with the weather which added to the whole experience, though on a poor weather day, it would be quite exposed. There is good parking available, though we caught the regular bus (No 38) from the City Centre. I would suggest wearing good walking shoes and a fleece/wind proof. One tip, if you have a travel card, walk along the Coastel Trek to the bridge and catch the No 28 bus back towards Fishermans Wharf then jump on a tram into the City Centre.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Amazing!", "Went late in the afternoon and hiked all the way from the Lands End Lookout back towards the bridge where we watched the sunset at the rocks at the end of Bakers Beach. Totally worth the time and the million of steps!"], ["Reviewed December 12, 2017", 5.0, "I definitely recommend going !", "Such beautiful place to go in SF! A different sight of SF where u get away from city. Short drive from town or take the bus. Do the trails and have a nice breakfast, brunch or lunch there."], ["Reviewed December 10, 2017", 5.0, "Sand dollars, climbing rocks, and beach discoveries", "We visited the shoreline here every morning and evening during our stay. The weather was cool for July; but we were lucky to get in a sunny afternoon/evening. My boys enjoyed exploring the seashore and collecting sand dollars. Each day my youngest couldn't resist jumping into the waves with his sweatshirt on. Very peaceful and relaxing, we saw many pet owners walking their dogs. My boys found various ocean plants and shell washed onto shore, which made for great entertainment. They also liked climbing the big rock next to the shore. The sutra bath remains were very interesting and also provided opportunities for lots of climbing. So glad we could explore this area!\nShow less"], ["Reviewed December 9, 2017", 3.0, "Lands End", "Great views, cool by the water, got some nice photos. Wear good shoes for walking, the path we took was a bit rough."], ["Reviewed December 9, 2017", 5.0, "Stop looking for options- come here now!", "I loved this place. I had 4 hours to spend close to the airport and every minute here was worth it.\nTRAFFIC- workday and rush hour and it was never more than 30 minutes either way\nGOLDEN GATE- great views and walks\nBEACH AND ROCKS- loved bouldering and roaming the shore.\n\nThis is hands down a fantastic park. You don't have to walk far to see great sulfur but if you want to walk you can. Lots of nature to see and experience.\nShow less"], ["Reviewed December 5, 2017", 5.0, "Beautiful view.", "We drove out here not really knowing what we would see. Lands end is beautiful! The view from the cliff is excellent and a great place to watch the sun go down. Sutro baths are interesting."], ["Reviewed December 3, 2017", 5.0, "Unexpected history", "The views from here are breath taking\nThat a walk back around the corner with a small walk and if the weather is being kind and the fog has cleared you will catch a view of The Golden Gate Bridge\nAt the bottom of Lands End at the foot of the Pacific Ocean you can see the remains of the Sutro Baths\nYou can feel the history and are reminder of life in another era\nStunning\nShow less"], ["Reviewed December 1, 2017", 5.0, "Amazing Pacific Ocean Views", "THese amazing ocean views ovewrlook the old Sutro salt water baths, of the last century, and a beaituful beach. Great Sunset veiws, and the Cliff House restaurant up the hill is an easy walk. Dress warmly."], ["Reviewed November 26, 2017", 4.0, "Great Stop along the Pacific Coast Near San Francisco", "This area is just west of downtown S.F. and is near the Cliff House restaurant and it used to be a public bath house in the early 1900's now it is a great area to see some trees, walk along the beach and watch large container ships cruise into S.F. Bay under the Golden Gate Bridge from this view point.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Oh, Dad, How Embarrassing!", "My dad often drove us to Lands End to appreciate the view and to pay our respects at its memorial. (In high school, I learned that we were marching about disturbing/embarrassing teens at their favorite Lover's Lane). Not far away, you will find the (Palace of the) Legion of Honor, my favorite San Francisco museum. It has a lovely layout and was a nice size for an afternoon visit; it is now 35,000 square feet larger than during my childhood, so you may want to devote more time to your appreciation of lovely European art. My French teacher's husband used to play the magnificent organ (commissioned in 1924) there on Saturdays and Sundays. If possible, be sure to visit when there is a performance; the music in this special setting is truly awe-inspiring.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Thanksgiving -2017", "Wonderful walking path through the woods right along the channel into The Golden Gate area . . . . Well maintained and a very nice time walking gingerly . . . ."], ["Reviewed November 22, 2017", 5.0, "Fabulous Place", "Amazing view of the ocean and what used to be public baths ( back in the old days). Great viewing centre gift shop and coffee shop. Be very careful here if you drive. Signs all over about car breakins. They break your window and are gone in a second. Don't leave anything in view that you don't want to lose.\nShow less"], ["Reviewed November 22, 2017", 5.0, "Amazing!", "The view is amazing!! It's a very romantic spot as well. Two great restaurants are nearby for you to enjoy. Don't miss weekend brunch at the Beach Chalet and cocktails at Cliff House."], ["Reviewed November 20, 2017", 5.0, "Hidden Treasure", "This used to be my favorite place to run in the City. I would start at Sea Cliff, and then run along the cliffs, admiring the beautiful waterfront the whole way! The City has really invested in the area, and have made the trail more official. The sutro baths are an added bonus, w/ just enough remaining to let you imagine how life would be to take a bath at the Bay. Great way to get exercise, learn some history, and take in breathtaking views!\nShow less"], ["Reviewed November 19, 2017", 5.0, "Awesome view", "Came here for our engagement photos! So beautiful! Only downside is that of course it’s packed but this place is great!!"], ["Reviewed November 18, 2017", 4.0, "A lovely day out", "Tok thebus here and it is a spectacular place to vieww the Bridge if not shrouded in fog. Peaceful and easy to walk. Some stunning views and intresdting rock fotmations."], ["Reviewed November 17, 2017", 5.0, "Beautiful views", "Stunning views of the Golden Gate Bridge and the harbour as you walk along. There is a point where you can walk down to the beach. Well worth it on a sunny day."], ["Reviewed November 15, 2017", 5.0, "Great hike", "Don't pay for a tour of this. The 38R bus ends up right at the National Park Building. There are restrooms available here. The hike is not too difficult, but stunningly beautiful. It is well marked and well maintained. It is a hard pack surface with lots of use. So, as I said, you don't need a guided tour. If you walk all the way to the Golden Gate Bridge it is 4 1/2 miles. Once you get to China Beach, which is not so well marked, the walk moves from woods to mostly city streets and is a bit difficult to follow unless you use your phone navigation. Using the phone it's easy. From Lands End Park Station it is about 1 mile to Mile Rock Beach, which is well marked. The walk down and particularly back up is a bit strenuous; but it is amazing and well worth the effort. When you get almost to the bottom there is a trail to the right going up a hill. At the top of the trail is the Labyrinth, which is interesting and the views from up there are great. Mile Rock beach is great for just enjoying the ocean and the views and climbing around on the rocks by the water. You could have a great relatively easy hike by just doing a round trip from the Park HQ to Mile Rock Beach and back and skip going all the way to Golden Gate Bridge. If you do decide to go all the way to Golden Gate Bridge there is a bus stop and you can take the Golden Gate bus back into most areas of town. Of course UBER is everywhere also. Bus Drivers will tell you if they go where you want to and if not what bus to take. This is one of those must do hikes in the area. Enjoy.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Beautiful and Great Hike", "The visitors center is a great place to end your trip since you don't want to carry stuff around. But Lands End is really beautiful to star out to the ocean. There is also a number of great trails in the area that were a blast to hike. It isn't a round trail though, so you'll need to get back to your car if you park at one end or another of the trail.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great views", "Very scenic area, made our way down to the beach and walked over so my adult children could touch the Pacific Ocean. My husband, son, daughter-in-law, daughter, son and myself are visiting from the East Coast. I am 65 and it was a little difficult making my way down but doable with the help of my sons. We did stumble upon a nudist colony, not that there is anything wrong with that except it was a little brisk.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Lands End San Francisco California Great Hiking trail", "One of San Francisco's well kept secret in my opinion! This beautifully 3 mile hiking trail takes you exploring the rocky north west coastline stretch. There is plenty to see for everyone.. the views are stunningly beautiful. There is also access to see the famous ruins of the Sutro baths and much more. Comfortable walking shoes recommended and water!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great Hiking Trail", "Be ready to do some walking if you are looking for scenic views. Came here the morning after some rain and the trails were a little muddy and damp, so wear appropriate shoes.\n\nThere are some large steps in the middle of the trail but if you keep moving you should be able to complete it in under two hours.\nShow less"], ["Reviewed November 8, 2017", 3.0, "Lovely scenery", "a very unique place for the historical factor, however, the rest of the services are ok, not super, but certainly good. Our stop was brief but enough to see the overall history of the site, sadly this history wasn't really well represented with lack of signage, the facilities were ok, the cafeteria small but ok, reasonably priced food, good service, the gift shop was a good selection of educational interested items, and some souvenirs. Didn't warrant spending a lot of money, so that was good too.\nShow less"], ["Reviewed November 8, 2017", 5.0, "A Hidden Gem in San Francisco", "Lands End is one of my favorite places to escape without actually leaving the city. It has history (Sutro Baths), beautiful views from outside of the Golden Gate Bridge, and amazing little beaches (Mile Rock Beach) to find and relax or explore along the water.\n\nGetting here is a little tricky without a car, but it's well worth it!\nShow less"], ["Reviewed November 5, 2017", 3.0, "Misty but obviously better on a clear day", "Unfortunately the mist had rolled in to the bay and visibility was minimal. We were on a guided tour so still learnt about what we couldn't see"], ["Reviewed November 4, 2017", 5.0, "Life Changing", "I cannot put into words how beautiful and otherworldly these ruins are. Complete with a restaurant and cafe, tunnels, and hiking trails, Land's End is simply stunning."], ["Reviewed November 3, 2017", 5.0, "Sutro Bath Ruins", "This is worth the effort to get to if you're into historical ruins. DO venture down to the actual ruins and walk through the nearby tunnel. I'm not sure what it was for, but the experience was great. So much more \"real\" than some of the things most people see.\nShow less"], ["Reviewed November 1, 2017", 5.0, "If you want to escape the city without leaving the city.", "I have run through lands end over 100 times. A lot of it is paved but most of it is trail. It is covered with giant eucalyptus. About half way through, there is a hidden trail down steep steps to a beach that has a labyrinth. You have views of the golden gate bridge and the headlands. It begins at Sutro Baths and ends in Seacliff, two areas worth seeing as well.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Great short hike in the city", "I always recommend Lands End to out of town guests, because I think it tends to get overlooked by some of the flashier attractions on the other side of the city. There is a small parking lot entrance, and street parking if the lot is full. No entry fees, but you can make a recommended donation at the visitor's center (also use the restroom and purchase souvenirs. Starting from the parking lot, the hike is about 1.5 miles one-way over varying terrain - the beginning is paved and turns into a more natural path further on. You can easily hike down to the water at various points, which I highly recommend. Coming back up can be a doozy! Gorgeous views of the bridge throughout the hike. Cannot recommend enough!\nShow less"], ["Reviewed November 1, 2017", 5.0, "Great views!!", "I highly recommend visiting Lands End when you are in the area. It is a beautiful hiking opportunity in the midst of the concrete jungle!"], ["Reviewed October 29, 2017", 5.0, "Beauty at the edge of SF", "This park offers an easy hike to see the Golden Gate Bridge and is scenic. The trail is shaded by cypress trees and there is shore access for the more adventurous hiker."], ["Reviewed October 26, 2017", 5.0, "Intresting Find", "This was a great surprise that we found along the scenic drive. We walked around and enjoyed the views could not believe the beautiful beach that is in the area"], ["Reviewed October 26, 2017", 3.0, "Great views", "Great views of the Suto Baths and Land's End. Would be especially nice at sunset! It was very busy with tour buses the day we went but still beautiful."], ["Reviewed October 25, 2017", 4.0, "Different angle for viewing the GG bridge", "This place is beautiful. You get to see the GG bridge from another angle, the surf, the trees, the coast, the beach, the baths etc. Nature is all around. Very hilly place so you get a lovely view from up here."], ["Reviewed October 24, 2017", 4.0, "Nice hike and views", "If you have time when visiting, it's worth hiking down the path to see some great views of the Golden Gate Bridge and the water. The path is quite steep with steps in sections but manageable for most."], ["Reviewed October 23, 2017", 5.0, "Beautiful", "Wonderful walking trails,and the scenery was fantastic. Being next to Ocean beach you can walk the trails,view the bath ruins and cruise right next door to the beach. Great day!"], ["Reviewed October 23, 2017", 5.0, "Beautiful scenery near the city", "Get away from the congestion at lands end. I took the 38 bus from union square to the end where there is a visitor center with maps, restrooms, shop and cafe. Took the trail all the way to the end - about 1.5 miles. Take time to walk down to beach when you can. Beautiful with view of bridge in the back. Trail is up and down, not even. Wear athletic shoes. To go all the way to end there are some stairs up and down. At the other end, you can walk through a nice neighborhood to baker beach area of presidio. There I caught another bus (#29, connect to #5) back to union square. (Of course uber is another option). Lovely day.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Great Outdoors", "Hiked at Lands End and enjoyed the beautiful vistas. One would need to be pretty steady on ones feet to walk the trail. The train is not difficult, but uneven."], ["Reviewed October 20, 2017", 3.0, "Good for hiking!", "This place is good for hiking. It was not clean (has stale water smell) but has a decent view of the Pacific ocean."], ["Reviewed October 19, 2017", 5.0, "Great afternoon hike", "My son and I took a long afternoon hike along the trails. The hike took us around so that we could see the Golden Gate bridge from the west. Very quiet and relaxing."], ["Reviewed October 18, 2017", 5.0, "Wonderful short hike in any weather", "This is an unusual urban hike along the wild coast west of the Golden Gate Bridge in SF. A wonderful contrast to the city but so very close."], ["Reviewed October 17, 2017", 5.0, "Beautiful Views", "Wow we got really lucky and did this hike on a super clear day so we got the best views! Really cool getting all the different angles of the Golden Gate Bridge and not too demanding a hike. A must see!"], ["Reviewed October 17, 2017", 5.0, "Sunrise", "This place is amazing and right next to Sutro Baths, unfortunately you can't explore as much as one may want due to unsafe zones and excessive graffiti. Lots of parking."], ["Reviewed October 16, 2017", 4.0, "A nice hike", "This is a nice hike from which you get beautiful views of Golden Gate Bridge. There is a nice trail which wraps around the shore and gets you right in the city. There are a few nice beaches along the way where you can stop for a break.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Beautiful", "Took the trolley as part of hop on/hop off bus tour and you stop here for about 15 minutes (you can stay longer and get a later trolley back) if you wish. The views are stunning."], ["Reviewed October 11, 2017", 4.0, "sunset", "stunning sun setting view, free parking, prepare to arrive a bit early as there will be some walk to get the spot for great photos."], ["Reviewed October 9, 2017", 5.0, "Must go", "This is in walking distance from my family's home. The sites are amazing. Breakfast at the Seal Rock Inn for local flavor, Sutro Baths, Sutro Park, National Park building, the cliff House and Lands end all within 1/4 mile. Great for a morning outing. Even though I have been there many times, I go back.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Amazing views of rugged coastline and the Golden Gate Bridge", "This hike is very moderate and offer great views of the SF coast and the Golden Gate Bridge. It also offers a glimpse into the history of SF. So worth it!!!"], ["Reviewed October 8, 2017", 5.0, "Very nice views!", "We timed it perfectly getting there about 30 mins before sunset. The visitor center was already closed so I didn't get to read what the site was before being converted to a lookout. There seemed to be some sort of ruins but not sure? A quick note is there were signs all over about this being a high theft area and to hide your belongings or take them with you from the car...believe it as there was a car next to us where we overheard the couple saying their stuff was stolen. Follow the small hiking necessary to go through a little forest area with beautiful trees, then getting to the overlook site with beautiful views of the cliffs and ocean, then looking to the beautiful views of the mountainside up above. We didn't have time to walk all the way down to the beach which would've been great as it was sort of like a little valley and seemed like the waves would've been fun to wade in. It was pretty cold with the ocean breeze so we didn't stay much longer after seeing the sunset. We were able to take some great pics! Definitely should go!\nShow less"], ["Reviewed October 7, 2017", 4.0, "Amazing views. Well worth a visit", "Great place to go to fill your lungs with some fresh sea air and get some beautiful photos of the bay and the bridge."], ["Reviewed October 6, 2017", 4.0, "Marvelous View Site and walking trails", "On the most north West Point of San Francisco is Lands End. Trails through windswept pines and cypress trees afford stunning views of the Golden Gate Bridge and Marin County Headlands. Turn right off Point Lobos Avenue at 48th and Follow the road to a large free parking lot.\nThere is a monument to the USS San Francisco seriously damaged in the WWllbattle of Guadalcanal on the western bluff at Lands End.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Did this on a city tour", "Great views and interesting part of history. Well worth a few photos of the ruins of the hot baths below."], ["Reviewed October 5, 2017", 5.0, "An hypnotizing place", "The trail is winding between the lush vegetation. We’ve started by going down to Mile Rock Beach and than climbed to the labyrinth. Both are stunning."], ["Reviewed October 4, 2017", 5.0, "What a gorgeous area", "We decided to come here to enjoy a different view of SF and loved the park nearby, the beach and the rocky area.\n\nI popped into a restaurant's toilet to freshen myself and witnessed a woman who flushed the toilet with her feet. When asked about it she said 'I am germophob'. 'Por favor' I was about to say, we are all scared of germs, especially me, as an OCD, yet I would never dream of flushing the toilet with my shoes packed with germs. She ran away too fast for me to tell her anything. Old woman like her should have known better!!!!\n\nThank God the gorgeous views outside made me forget about this silly piece of human lump.\nShow less"], ["Reviewed October 3, 2017", 5.0, "A great place for a scenic walk", "I have spent today walking around lands end. I started at ocean beach and walked up to the famous cliff house and sutro baths. The walk continues along a cliff track giving you amazing views of the golden gate bridge. On my way back, i visited the legion of honour museum. Lovely and especially great on the first tues. of the month where you have free entry!!\nShow less"], ["Reviewed October 3, 2017", 4.0, "Very nice area - fantastic view", "Very nice area - nice history - little shop and separate restaurant - when Karl (the fog) is not there, great view of GGB."], ["Reviewed October 3, 2017", 5.0, "San Francisco vis", "My wife and I are visiting my daughter and her boyfriend this week. They have lived in SF and know the area well.\nOne of their favorite scenic views is Sutro Baths / Lands End & Baker Beach.\n\nThe views are breathtaking. This is a wonderful town to visit\nShow less"], ["Reviewed October 2, 2017", 5.0, "Lands End's Horizons", "It is gorgeous to Cruz around Lands End see the bay and the golden gate bridge, great for running, strolling with a lover or just showing a visitors the beauties of San Fran."], ["Reviewed October 2, 2017", 5.0, "Mind blowing views", "Feel like you are on the edge of the continent which is exactly where you are! Hikers, walkers and runners welcome here--most tourists are not aware of this fabulous place"], ["Reviewed October 2, 2017", 5.0, "Nice walk north with Golden Gate views", "We took a two hour walk along the Lands End park and it was lovely. The day was sunny and temperature was perfect. The walk is mostly fairly easy but there are part where you climb up and then go down. We did the walk back to the parking area so we retraced our way. There is an also a part where you can take many steps down to the beach. While that is very nice you have to climb back up those steps. Wearing tennis shoes is best and take a bottle of water, also sunscreen and hat\nShow less"], ["Reviewed September 30, 2017", 5.0, "Do Not Miss at This!", "This park is a fabulous combination of hiking trails, scenic views, and the best that nature has to offer. Only a short distance from the urban San Fran, this seems like it is a world away. One of the very best parts of our visit!"], ["Reviewed September 30, 2017", 5.0, "Great exercise with great views", "Really enjoyable. Easy to get to. Easy to park. Lots of walking in both sun and shade. Great water views. Great way to spend an afternoon"], ["Reviewed September 30, 2017", 5.0, "Beutiful walk and overview", "It's a very pleasant walk with nice scenray of the bay, including the golden gate bridge. We spnt a few hours there over the weekend - it wasn't too crowded, weather was nice and so we enjoyed it a lot."], ["Reviewed September 29, 2017", 5.0, "very interesting", "If you're looking to hang out with beautiful views and get some exercising wandering around through all the nooks and crannies, this is a great place."], ["Reviewed September 28, 2017", 5.0, "Beautiful area", "Stopped to eat at a nearby restaurant and walked to the area. Very beautiful place to visit. I even made it to the rock hill next to the shore."], ["Reviewed September 27, 2017", 5.0, "Gorgeous vistas", "Need your hiking boots or heavy sneakers for this trail. Some uphill but mostly gentle rises. Places to sit and absorb the majestic vistas of the Golden Gate Bridge."], ["Reviewed September 24, 2017", 5.0, "Breathtaking and relaxing", "A little something for everyone. Great views, lots of walking/hiking options, near Ocean Beach, clean, and connects to the network of SF hiking trails.\nDress for possibilities of extreme weather - wind, fog, heat - it's different out there. And bring good walking shoes- watch your step!\nShow less"], ["Reviewed September 24, 2017", 5.0, "Great walk with great views", "Beautiful walk along the water. Interesting ruins of prior baths near the sea. Is a moderate walk and be ready for some stairs and some up and down. Wide path often used by dog walkers. Everyone was friendly and someone even offered to take pictures of us all. Visitor Center was at the beginning of our walk with a little gift shop. Took a little over an hour.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Great little cafe", "Delicious coffee and almond scones were our choice here. Selection of brownies and other tasty morsels available. Wonderful views from the outside area. Good rest rooms."], ["Reviewed September 20, 2017", 5.0, "Pretty and nice for a walk", "It's so pretty here. Windy so dress warm. We planned to enjoy the Cliff House afterwards to warm up and enjoy the view while dining."], ["Reviewed September 17, 2017", 5.0, "We ate at the Cliff House Restaurant here.", "We visited Lands End and ate at my very favorite restaurant the Cliff House. It was very crowded and we had to eat at the bar but service was very quick and food was excellent."], ["Reviewed September 17, 2017", 4.0, "Lands End", "Great walking path - fairly straight and easy. Went on a Tuesday and it was quiet and pretty. Lovely views. An hour or two is plenty to take it in. Looks like a nice place to reflect, read, meditate."], ["Reviewed September 15, 2017", 4.0, "Bring water and good shoes", "Went here with an SF native and we all had a blast hiking out to the end of the trail. Greatly enjoyed the children's book posted a page at a time along the first part of the walk. No refreshments at the end of the trail, so bring water -- and hiking or running shoes. Note that there are some steep places, so not a walk for the infirm. Also note that parking can be a problem.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Don't Miss Lands End", "If your visiting San Francisco you really need to set a side at least 1/2 day to visit lands end and hike the path and walk out to the look out points. The views of the coast line and the Golden Gate Bridge are simply amazing, sit an take some time to soak it all in. It's a relatively easy hike, bring water but there is a cafe in the cliff house near the Sutro Baths, there is also a large parking lot (free) but I would recommend getting there no later than mid morning so you have time to enjoy this wonderful piece of nature.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Best views of the Golden Gate and Marin Headlands", "Hiking along Lands End is one of my most favorite things to do. I have lived in the Bay Area all my life, and I have never tired of this hike as it gives something new every time I visit. Depending on the weather its always different. It's a decent workout as you walk/run the trail, and the side trails down the sides of the cliffs to look outs and beaches are hidden gems. The best time to go is always when you can see Marin and the bridge, so foggy days are good if you simply want a fresh, oceanside workout.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Once the premier swimming spot in SF", "So, you are Ocean Beach...walk up the hill to teh CLiff house and meres steps beyond is the Lands End and hiking, and and photography opps abound!"], ["Reviewed September 13, 2017", 4.0, "Too bad for the fog", "We went here in the afternoon as we heard the fog lifted by noon and didn't start again til sunset usually. Well the bridge was foggy all day from here. Make sure you do the Land's End lookout. It's worth the 250+ steps each way. We thought the view was better from here than Eagle's Nest (which has a big staircase to get to as well). Wear athletic shoes here- we saw a lot of people struggle in every other type of shoe.\nShow less"], ["Reviewed September 12, 2017", 4.0, "On the edge of the city", "Perfect for a walk and to admire the coast and the cliffs on the north west of the city. Has great views when it's not foggy and you're sorounded by nature."], ["Reviewed September 10, 2017", 2.0, "Underwhelmed", "We visited here as part of our tour, but the only interesting part from my point of view was the collection of historical photos in the visitor centre."], ["Reviewed September 8, 2017", 5.0, "Beautiful area, worth the visit", "Quaint museum and gift shop/ cafe at this point of interest. Walking trails and beach access make this a place one can spend hours. Surfers and porpoise visible from land."], ["Reviewed September 7, 2017", 5.0, "Stunning views.", "This is a great place to get away from the city to relax and explore. The views are incredible. We visited the old bathhouse and the kids enjoyed exploring the spooky caves. There are steep steps down to the beach and a steeply sloping path.\nIt gets surprisingly chilly here. Bring a fleece and jacket. Interesting gift shop too.\nWatch out for coyotes!\nShow less"], ["Reviewed September 5, 2017", 4.0, "Good hiking trails but be prepared for wind, cooler temps and clouds", "First time hiking this area-nice trails, not too difficult, some bikers on some of the trails so be careful. Windy area since it's near the ocean and it was also pretty cloudy so you couldn't see too far out. It was hard to see the \"Land's End\" near the lighthouse and we never saw the shipwrecks and could only just see the Golden Gate Bridge. However, very interesting ruins of a bathhouse down by the beach. We also walked across and up the the street and visited the gardens and former estate of Adolph Sutro, who used to be mayor of San Fran. The Gardens are about run down since they are no longer owned by the city but still a pretty walk and views.\nShow less"], ["Reviewed September 5, 2017", 5.0, "My Favorite Spot in SF!", "I am tempted not to say anything about this incredible treasure of the city because it could get too popular. But it is so gorgeous you cannot miss it - especially if you are rarely in San Francisco."], ["Reviewed September 5, 2017", 4.0, "Nice trail with great views", "We parked in the NPS visitor's center lot and walked the easy trail along the coast to Land's End. We had great views of the Golden Gate bridge, sailboats, marine life, etc.\nYou can almost forget you're within city limits except for the litter and graffiti here and there. Also, beware of leaving valuables visible in your car...there are signs posted in the lot warning of frequent break-ins.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Ideal hike", "Start at the farthest point away from Golden Gate and avoid the small beach to end up walking past high end cliff side homes. About 2 miles and a great hike. Lot of dogs and some runners along with amazing views."], ["Reviewed September 5, 2017", 5.0, "Great spot in the City", "Went here Sunday with family while doing early morning sightseeing tour over Labor Day Weekend. Beautiful day in the City"], ["Reviewed September 4, 2017", 5.0, "Beautiful", "National Parks service does not disappoint. Beautiful views, nice facilities, well maintained. The trails were well maintained and easily accessible by foot or bike. They were not well marked and one could get easily lost."], ["Reviewed September 3, 2017", 5.0, "Spectacular Vistas not to be missed - Golden Gate Bridge", "Wear your sneakers, bring your camera, a friend, a selfie stick and water and walk this beautiful trail. Spectacular Vistas not to be missed - you can see the Golden Gate Bridge and across the way you have views of Marin Highland. Be sure to not leave anything visible in your car - hide everything in the trunk. We saw a smash and grab driveby - was unreal. This was parked on the street near entrance.\nShow less"], ["Reviewed September 3, 2017", 5.0, "In the City but not of it", "This is a \"must\" stop on every visit to San Francisco, not only for the panoramic views of the Golden Gate, but for the short but scenic walks that take you out of the hustle and bustle of the city and into nature. It's a convenient stop for visiting Sutra Baths, Seal Rocks, Cliff House, etc., and only a half mile walk from Legion of Honor.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Worth an uber to visit this area and Baker Beach and Golden Gate Park", "We spent one of our last days in San Fran touring Lands End, Sutro Baths, Baker Beach, and Golden Gate Park. It was our college age kids (18 & 21) favorite day of site seeing."], ["Reviewed August 30, 2017", 5.0, "Great view", "The place has walking tracks and a rest stop so worth spending a little time looking around. Great views from this spot."], ["Reviewed August 29, 2017", 5.0, "Unsurpassed views", "Nice walk with fantastic views\n\nIf you plan it right you end up at the Cliff house for a super meal.\n\nThe bay and rocks are great.\n\nSome marine life.\n\nThe bath house ruins are intriguing from a bygone era.\n\nSo cool to visit the west coast.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Family trip to see the sights!", "Absolutely beautiful, would definitely recommend to go here! It was so picturesque and just breath taking! You can see the Golden Gate Bridge from one of the lookouts and it was a clear and beautiful day! A must see sight!"], ["Reviewed August 28, 2017", 5.0, "Serene trail with fresh air", "The trail started near the Legion of Honor, and we walked for about half an hour to reach the Cliff House. The trail was lush, and part of the way overlooked the Golden Gate Bridge. Many people walked their dogs along the way. It was a refreshing walk. It was fairly easy and took about an hour round trip.\n\nShow less"], ["Reviewed August 28, 2017", 4.0, "Pretty Vistas", "This was a stop on a city tour and the coffee shop was excellent. Great history, beautiful views adn the wooded areas surrounding were stunning."], ["Reviewed August 28, 2017", 4.0, "Pretty cool and easy trail", "Was able to get there right before sunset, was a breathtaking piece of visual beauty. I have traveled to Mexico, lived in Hawaii, the view was just as good, just not the tropical view most associate with oceans and beaches. Yet still beautiful in its own way.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Nature and beauty all in one", "Took a day trip of San Francisco to see the area. Would loved to have spent a good half day or more there. A Photographic Paradise and amazing walking trails. So much to see and do there. Loved it."], ["Reviewed August 27, 2017", 5.0, "Great trails for viewing the Golden Gate Bridge and for catching sights of whales!", "I really wasn't sure what to expect when my husband and I went here. Fortunately, I wore appropriate clothing to walk the trails because we took quite a hike! The trails were well marked and wide enough for the number of people there. At one point, we were doing some pretty steep steps, but they are quite doable. We are in our mid 50's so we were challenged at times, but were able to handle it. As we got further into the trails, we were able to see two whales out in the ocean who put on a little show for us! That was quite a bonus! Definitely worth a visit!\nShow less"], ["Reviewed August 26, 2017", 5.0, "Great beach area with free parking and great views of Golden Gate Bridge", "Our family of 6 really enjoyed walking the trails along the Pacific Ocean and spending time exploring the marine life in the rocks near the Sutro baths. If you go down near the rocks by the water, you can find a surprising number of crabs. Breathtaking views of the Golden Gate Bridge!\nShow less"], ["Reviewed August 24, 2017", 4.0, "Great views on the Ocean", "With great views on the Ocean, Lands End combines perfectly after a walk over the Golden gate Bridge."], ["Reviewed August 24, 2017", 5.0, "The end of th United States!", "When you go to this destination, know that you are about as far west as you can be in the continental U.S.! The vista, overlooking the Pacific Ocean, is magnificent, to your right view, the Golden Gate Bridge, and, when in season, the seals, migrating will amaze! Naturally, beautiful!\nShow less"], ["Reviewed August 23, 2017", 5.0, "Stunning Views", "Travelers looking for a serene escape from the tourist attractions and crowds will find Land's End the perfect choice. The coast some of the most beautiful sunsets and diners will find great, though pricey, dining options at the iconic Cliff House. It's a great place to walk along the shoreline and people watch.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Beautiful, Easy Walk", "Plenty of trails to walk down and explore, with stunning views around every corner. Safe for anyone to walk alone during the day as there are plenty of other people. Definitely check out the labyrinth at the point for a meditative walk!"], ["Reviewed August 22, 2017", 5.0, "The most beautiful enchanting views", "Our daughter took my wife and I to Lands End. What an absolute joy! There are quite a few hiking trails along the cliffs and also down to the shore. The trail we were on was accessible by wheelchair until the Eagle Point steps. But even up to there anyone would have magnificent views of the bay, the birds, and the scenery is just enchanting.\nAt the right times I was told that you can spot dolphins and whales.\nDo take something warm in case the sun is not out!\nShow less"], ["Reviewed August 21, 2017", 4.0, "Interesting", "It has lots of trails and access to the beach but remember what goes down must come back up. We were there looking for a Parakeet Auklet which had been spotted by several birders and is not common to the area."], ["Reviewed August 21, 2017", 5.0, "Don't miss", "Sorry I missed Lands End on previous trips to the city. Absolutely fabulous views all around. Lucky to catch the whales migrating while taking the view of the Golden Gate Bridge. Friendly atmosphere with tourists seeming to like the \"nature\" break from other more crowded-type tourist activities.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Good spot to spend few hours with kids", "It's was a nice spot to visit and play at the beach with kids. It windy and cloudy, yet, kids loved it to be around the beach. Worth visiting if around the area"], ["Reviewed August 20, 2017", 5.0, "Beautiful and easy hike", "A must do when weather conditions are not to foggy.\nYou will start from Land's end visitor center and follow the coast.\nThe Golden Gate Bridge will show off progressively after the dead man's point you can choose to go back or to go on up to the GGB.\nIt took us 3 hours with many stops along the way to just sit and watch.\nWe choosed not to follow the road but to go down in presidio and walk along the beach.\n\nGreat moment !\nShow less"], ["Reviewed August 20, 2017", 5.0, "Nice oceanside walk", "Cliff House Restaurant has 4 restaruants. Walk the paths and see the Sutro Bath remnants. Go in the gift shop just to see photos of what the baths (swimming pools looked like.)"], ["Reviewed August 17, 2017", 5.0, "beautiful view & walk", "great spot at the ocean. beautiful views, trails available. and its free! Very close to San Francisco...short drive. And you can spend at minimum a half hour, if you want to spend time at the beach or do trails you could stay half a day."], ["Reviewed August 16, 2017", 4.0, "Nice place for a little hike with stunning views", "We went here on our viator tour of the city and we really enjoyed the stop. We walked down the steps and to the right for some amazing views of the rugged coast. It was very pretty here and we would definitely recommend seeing this spot if you are in San Francisco!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Beautiful Views", "A must do if you're spending more than a couple days in San Francisco, though make sure you set aside at least half a day as you'll want to stop and take lots of pictures!"], ["Reviewed August 15, 2017", 4.0, "Gorgeous scenery and interesting history", "Lands End was the highlight of my trip to San Francisco. Not only were there beautiful views there was also hiking trails and so much history.\nThe ruins of the Sutro Baths and the old photos of when they were actually in use was so interesting.\nI also was able to get some good pictures of the Golden Gate Bridge.\nOnly complaint was the litter.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Great hiking and spectacular views.", "This is a great place for iconic photographs of classically beautiful California vistas. If there is no fog there are great shots of the Golden Gate Bridge. Be prepared it can be a bit rugged with lots of ups and down, and climbing, but not excessively so. Also, it can be cold if the wind is up and the fog is in. Parking can be tough as it is popular and busy, but hang on in a lane and someone will leave eventually. But, all in all, it is not to be missed.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Nice hike. Beautiful views. Perhaps not for some young children.", "Nice hike. Lots of steps. Consider the personality of a young child before taking them there. They'd enjoy the hike but once out there, the drop off is quite high and there is no safety rail. Kids will enjoy the labyrinth. we saw seals when we were there. Also walked along the beach and there were a lot of kids there.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Beautiful", "My husband and I came here after having lunch at the Cliff House. Amazing views but very cold. Do the hike to see the golden gate. Wear sneakers and bring water and snacks."], ["Reviewed August 8, 2017", 5.0, "San Francisco Treasure", "The Lands End area is full of wonders! From the visitors center to fort miley to the scenic walk between the visitors center all the way to Sea Cliff. Don't miss the walk down to Mile Rock Beach and the labyrinth on the edge of the cliff.\n\nGreat whale, seal and porpoise watching.\n\nOne of the must sees in San Francisco!\nShow less"], ["Reviewed August 5, 2017", 4.0, "Pretty hiking", "Enjoyed seeing the sweeping views of the pacific while doing a moderate hike. As other reviewers mentioned it's probably have seen better days. There's graffiti and garbage but if you look past that it's very pretty. There's rocky pebbly beaches so it's not necessary a place to hang out on for awhile.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Land Sake's Child!", "This attraction was not on our radar until we basically stumbled upon it after making our way through Golden Gate Park & ended up at the Pacific Ocean. It appeared to be a fortress of some type from a distance but upon further investigation it was a National Park Service visitors center. We hiked a little bit & took beautiful pictures of the rocky cliffs. We stopped by the memorial in honor of the USS San Francisco WW2 cruiser & it's crew which actually is constructed from portions of the original ship encased with its battle wounds.\nSince this was an impromptu stop we didn't spend as much time here as with other attractions but would have enjoyed a longer hike along the Coastal Trail.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Great views and Hiking", "The views are great and we enjoyed hiking the trails. Every minute there is a another great view. And we leanred a lot about the history of the area. We used Costal Walkers for a guided tour."], ["Reviewed August 4, 2017", 5.0, "Gorgeous hike and interesting history!", "We visited Lands End on a clear morning in August. Our family of four (parents and two teens) paid a quick visit to the visitors' center, where we learned about the history of the park, including the Sutro Baths, a massive Gilded Age swimming pool for the people of SF. You can still see the ruins. We then took a hike on the well-marked and well-maintained trail to the end (Eagle View) and back. We enjoyed the lovely views. It was a fun way to start our day and we were amazed that so much wild and natural beauty exists so close to a major city!\nShow less"], ["Reviewed August 4, 2017", 5.0, "Lovely Hiking", "After breakfasting at the Cliff House, we walked about 3 miles along the Lands End trail enjoying the cool weather and views of the ocean. Easy hike."], ["Reviewed August 4, 2017", 4.0, "beautiful scenery", "beautiful scenery, beach, golden gate bridge, green, fresh air , all of this you can be seen from here."], ["Reviewed August 4, 2017", 5.0, "Unique view of Golden Gate Bridge", "Hidden gem of a view of the Golden Gate Bridge and Pacific Ocean - we lucked out with a clear, sunny day! We biked here from our B&B in Cow Hollow - definitely hilly!"], ["Reviewed August 2, 2017", 3.0, "Interesting but not much there", "Lovely views but that's it really, usual tourist shop to fleece you! Nothing much to say only visit if passing"], ["Reviewed July 27, 2017", 3.0, "Still needs restoration", "It was a nice walk from Lands End to Golden Gate Bridge, but some parts of the road were pretty dirty and not fully restored. Hopefully in the near future it will get better, because the views are fantastic!"], ["Reviewed July 27, 2017", 5.0, "Easy Hike, Fabulous Views", "The hike is rated moderate because there are a couple of places with a lot of steps. But really it's a pretty easy hike. Great views so take a camera. Some people were whale watching but we were not successful at this."], ["Reviewed July 27, 2017", 5.0, "Lovely break from the hectic city", "Breathtaking views, a lovely stroll, and easy parking made this a great outing! If you want to get lunch at the Cliff House, be sure to make reservations in advance."], ["Reviewed July 26, 2017", 5.0, "Stunning views and great visitor center", "Lands End is a great place to visit especially if you have friends who are from out of town and another state. Foreign visitors love the vista and mix of nature that you can view. Up to the end of August if you are 62 or older get your National Parks pass for $10 because it goes up to $80 after that. Cliff House is close and well as other diners. Keep valuables out of view in the parking lot as there have been many cars compromised.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Interesting Educational Experience", "We visited, thinking we would stay for hallf an hour and stayed for 3 hours!!\n\nThere is a great National Parks Visitor Centre with information all about San Francisco, national parks/ local geography/ animals/ sea and marine life. They have toys/ souvenirs and much much more.\n\nOutside there is a wonderful stand of the Californian pines and a gentle walk down the hills and around back to the ample free parking area.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Beautiful hike!", "We were looking for a fun, free thing to do on a Friday morning and this was a great choice! I'm sure it gets busier on the weekends but when we went it was fairly open.\n\nThe directions for the Lyft driver had him drop us at a parking lot near the golf course so I would recommend inputting the Sutro Baths as the destination.\n\nOnce we made our way to the baths, there we found a small gift shop that had bathrooms. The caves near the baths themselves weren't anything special and were filled with trash.\n\nThe hike itself was fairly easy with some areas with steep steps but the views were incredible. There was a lot of shade along the hike and we were comfortable in pants and a long sleeve tshirt.\n\nI would definitely recommend this if you have a few hours and want something fun to do without all of the crowds.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Amazing", "Why a beautiful spot. Was lucky enough to go here on a very clear beautiful day. Nice place to walk the trail and see the sight of the coastline, ocean and bay entrance. Was amazed how many whales u could see out in the water."], ["Reviewed July 21, 2017", 5.0, "A worthwhile hike along the cliffs overlooking the Golden Gate Bridge", "This hike can be as short or as long as you want. The challenge will be finding a place to park because it is a popular destination for locals and tourists alike. There are several parking lots at, above and across the street from the Sutro Baths and the Land's End Visitors Center. Start at the center and follow the signs. The trail is wide, well-signed and easy until you are half a mile in. Then there are a lot of steps to climb both up and down. But if you survive that, the views of the bridge just get better and better. For those who choose to hike the whole coastal trail, it ends at the bridge.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Typically forgotten attraction", "Great views from a different vantage point. Views of the ocean. Views of the Golden Gate Bridge. Hidden gem."], ["Reviewed July 20, 2017", 5.0, "Wonderful scenic view", "Excellent location for a scenic walk. A must for all photo enthusiasts. A lot of history and surrounded by excellent cafes."], ["Reviewed July 19, 2017", 5.0, "Great walk/hike. just don't leave anything in your car.", "We love lands end, but cut short our visit after noticing the broken glass on the ground from all the car break-ins in the immediate area. A Beautiful place is being ruined because of lack proper security and prosecution of those stealing from cars. Take a taxi, or carry any and everything with you if you leave your car, especially a rental cr here\nShow less"], ["Reviewed July 19, 2017", 5.0, "cool views", "Great picture area. The Sutro Bath history can't be missed. Can't even believe a structure like that was even there. Very cool history, nice views, and a great little hike if you are so inclined."], ["Reviewed July 17, 2017", 5.0, "scenic coastal trail", "the coastal trail from lands end lookout to mile rock beach is very scenic. added bonus were the numerous whales in the bay. the labryinth ia a cool place with wonderful backdrop of golden gate bridge. the trail is mostly flat but the path to mile rock beach and labryinth involves stairs and is a bit steep\nShow less"], ["Reviewed July 15, 2017", 4.0, "Scenic quick hike", "We had a little time so after brunch so thought we hike here. Very busy on the weekends, hard to get a park, but persistence paid off. Wonderful views of Golden Gate bridge through the fog and a labyrinth made of stone. A trip down to the water which felt warmer than expected. Glorious part of San Francisco\nShow less"], ["Reviewed July 15, 2017", 5.0, "Beautiful views", "On the western side of San Francisco, this is a lovely stop with gorgeous views of the ocean. There are some places to walk around, although it's probably more of a 1-2 hour visit than longer. Nice gift shop."], ["Reviewed July 14, 2017", 4.0, "Half a Day at Land's End", "I recommend spending a few hours at Land’s End if your schedule allows. Land’s End is a beautiful natural place. It’s interesting to learn about the history of the Sutro Baths and to walk around the area. (Bring a warm jacket!) The Cliff House is a bit past its prime, but it’s a nice place for lunch, and part of the history of the site. Ask for a table by the windows for a great view.\nMy daughter and I had planned to walk to the Golden Gate Bridge from Land’s End but the trail is long and can be a challenge. We ended up walking through Land’s End and then exploring the neighborhood along El Camino Del Mar and Lake Street where the houses are exquisite, and then catching a bus back to the bridge. This all probably took us four hours, but it was time well-spent.\nShow less"], ["Reviewed July 13, 2017", 4.0, "beautiful view, interesting history", "I've never been to this part of SF before. A gorgeous view of the ocean and an interesting history with remains of an amusement park/baths that used to be on the site long ago!"], ["Reviewed July 13, 2017", 5.0, "Great Views. Great Experience.", "We did Lands End on our last day in the city and we LOVED it! In comparison to the crowds at the Wharf, this place was a dream. The hike was lovely and not strenuous. There is a steep part with stairs, but take it slow and you will be okay.\n\nThere are some great lookout points where you get awesome views of the Golden Gate Bridge. But for us, our favorite part was all of the whales that we got to see. We counted around 8-10 out in the water and just sat and watched them for probably half an hour or so. It was a very low-key way to spend our last day and we commented that if we lived in SF, we would visit Lands End pretty regularly.\n\nPlease, please check this place out when you visit SF! I really don't think you'll regret it.\nShow less"]]}}