{"Legion of Honor": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Legion of Honor", "url": "/Attraction_Review-g60713-d156333-Reviews-Legion_of_Honor-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/02/38/8b/san-francisco.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1797"}, "address": {"@type": "PostalAddress", "streetAddress": "100 34th Ave Lincoln Park", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94121-1677", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Nice collection of European works.", "If you go on the first Tuesday of the month, it is free admission (otherwise $15 adults; free under 18 yrs) to the general collections. A nice art museum of varied artworks in a great setting overlooking the GG Bridge. Love the grandiose architecture as you approach the Beaux-arts building with \"The Thinker\" in the centre of the inner Courtyard. Car parking is limited so get there before late morning or take the bus (#18). If you do buy the general admission ticket, you can get into the de Young Art Museum for free on the same day (which is in another beautiful location: Golden Gate Park).\nShow less"], ["Reviewed 4 days ago", 4.0, "Broad and varied collection of art", "The Palace of Legion of Honor Museum contains artwork from many centuries, styles, artists and genres (Rodin, Monet, religious art, David, Vuillard, Boucher, El Greco, etc.). We weren't able to spend more than 2 hours today but if you like art, you could definitely spend an entire day. The rooms are well curated and display the works nicely. Also, the room dedicated to \"Vertigo\" was a cute touch.\nShow less"], ["Reviewed 4 days ago", 5.0, "Wonderful art museum!", "Found this museum on TripAdvisor. Great experience and the Casonova exhibit was worth the visit alone! Using his life and travels as the backdrop for exploring European art of the day was intriguing and highly engaging. Going on the docent led tour is a must... you learn so much more.\nShow less"], ["Reviewed 6 days ago", 5.0, "Quite with great views", "This was a gem of a visit. We arrived early and were joined buy local joggers. The area provides great views of the city and the Goldern gate bridge. There is a gold course there too. If you drive on you can get a great view of the GGB along with benches to sit on, Was a bit cold in Feb.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "History & Hash House Harriers", "In the middle of SF's 3 par public (?) golf course , a page out of history. A meeting point for some running groups (Like the hash house harriers -Gypsies ) , entry for a heck of a SF picturesque run."], ["Reviewed 2 weeks ago", 5.0, "Favorite San Francisco Museum", "Get the back story of why the Museum was built....the setting is lovely in the western edge of the city overlooking the Pacific - the Classical Architecture is satisfyingly wonderful....the interior spaces are beautiful, and, for a Museum if functions very well...Saw the Rodin/Klimpt show....Very well done!!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Free First Tueday of the Month", "The LoH has a nice collection, especially of European fine art. The highlight for me was The Russian Bride's Attire by Konstantin Makovsky, a must-see in its details, its color, and its depiction of human life."], ["Reviewed 3 weeks ago", 1.0, "Way over priced", "This was a major disappointment. First, the parking situation is ridiculous. We had to park three blocks away and walk UPHILL in the street for most of the journey. No parking structure?? For what they charge they could build a new museum I think. The upcharge for the current special exhibit was out of line for the quality of the art. There is at least one Rodin in every major museum in the world and these were not exceptional. Also, I've seen better Klimts in free museums. If this is standard, Legion of Honor is giving San Fran a black eye.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great but Expensive", "I stumbled upon this wonderful museum and glad I did. I walked by while hiking Lands End. My biggest concern is the cost. A very expensive museum, especially if you want to see any special exhibitions."], ["Reviewed 3 weeks ago", 5.0, "A Colorful stroll with Klimt and Rodin. A day exhibit at the Legion of Honor in San Francisco.", "It's not everyday, you get to stroll the Legion of Honor in San Francisco. But, if you have the chance, I suggest you take your rent a car or the Clement Street bus, Geary Street bus, or California Street bus... and walk a few blocks to this amazing Museum. It's located on a beautiful golf course that overlooks the City and faces the Golden Gate Bridge. Do you want a little San Francisco history and romance in the afternoon? This is a beautiful place to take your special person or your mom & dad when they come visit. This building is elegant and the people that work there are so helpful and passionate about art. It's not uncommon to spend the whole day here, walking around, exploring this the beautiful area. Want to paint? Hear jazz? Take breathtaking selfies with your selfish stick, lol? Give yourself some much needed, eye candy, stimulation, and pleasure. Spend a day all the way out in the Avenues, at lands end, in the Legion of Honor San Francisco.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Go for a Special Exhibition; Visit the Park", "I came for the Klimt show, which is ending. This museum has interesting special exhibitions. The regular collection is of mixed quality, and worth sweeping through once. The park is far more attractive and has better views than Golden Gate Park."], ["Reviewed 3 weeks ago", 5.0, "Some of the best scenery around to add to the Museum", "We belong to the Museum but really like the area around it. If you can find a day especially during the week to go, parking is available and you are not inundated with folks. The walk along the coastal path is also well worth it. Stunning views of the bay and all that has to offer. Even with the crowds everything moves briskly along. When you add in the exhibits a five star place.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Impressive Art at Impressive Venue", "Although I'm not an art aficionado, I enjoyed our Legion of Honor visit more than I expected to. I went with my daughter, a German-French major who spent three years working as an English-language teaching assistant in Europe, one in France and two in Austria. When she heard that the Legion of Honor was hosting a Klimt-Rodin exhibition, she chose this as one of the stops on our San Francisco trip in early January. As I write this, the exhibition has left, but my memories of our enjoyable time viewing it remain.\n\nI was impressed with the quality of the art on display throughout the museum as well as the arrangement of it, which allowed many people to move through the rooms without feeling overly crowded. The Legion of Honor building is a work of art in itself that lends itself to numerous photographs. The museum store is a treasure trove of items that would make great gifts for others--or for oneself.\n\nMy daughter and I spent a couple of enjoyable hours at the museum, but if you're an avid art lover, I'd recommend allowing several hours for your visit to give you time to savor your experience.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great architecture and collection", "The building's architecture makes a great photo, and with ticket prices at USD 15 for general admissions, the art pieces (and actual mummies) available for viewing were better than what I expected.\n\nTip: Try not to bring a backpack as they will ask for you to check it in.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Great to visit - but check what is on display", "If you have time check to see what is on display as the venue does change. Great place to spend time on a rainy day . There is a nice restaurant inside for lunch."], ["Reviewed January 22, 2018", 4.0, "Wonderful Museum", "I always enjoy visiting the Legion of Honor. We couldn't get tickets to the Rodin & Klimt exhibit as it was sold out on the day. But we and visit galleries that had part of the permanent collection. The building and the grounds are also very interesting.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Worth the Trip", "Went to visit the Rodin & Klimpt special exhibit. Well worth the trip! Excellent collection, nice commentaries, learned quite a bit. Nice gift shop and lovely restaurant with view for a coffee or lunch."], ["Reviewed January 22, 2018", 5.0, "Great museum in incredible location", "This museum is set at the top of a hill with views of the Golden Gate Bridge. The museum was featuring an exhibition of Klimt and Rodin. The permanent collection is also impressive. Many great photo opportunities."], ["Reviewed January 21, 2018", 5.0, "Little Unknown Museum", "The setting for this museum is gorgeous. Allow yourself time to walk around, You can walk down to the beach. The museum had a lovely collection of art. I did not know about this museum until I heard about the Klimt/Rodin exhibit."], ["Reviewed January 20, 2018", 3.0, "DISAPPOINTING KLIMT EXHIBIT!", "As they had Klimt's name first we expected more works by him. We were disappointed to find less of him and much more of Rodin sculpture. For the $30 entrance fee it was really not worth the price!"], ["Reviewed January 19, 2018", 3.0, "Klimt Exhibition Disappointed", "We went to this museum to see the \"Klimt & Rodin\" exhibition and stayed on to look through all the galleries. The exhibition, which ends Jan. 28, 2018, proved to be heavy on Rodin, which was a disappointment for me. I've been to the Rodin Museum in Paris many times and explored the one in Philadelphia but have seen only a small number of Klimt's paintings. Many of the relatively few in the exhibition are unfinished, sketches or minor works.\n\nBut for those who have not seen Rodin sculpture up-close and personal or would like to see more, the exhibition presents a nice array. And the museum itself has an outstanding collection of Rodin's work. One of the cast bronzes of his \"The Thinker\" is on a pedestal in the entry courtyard, which costs nothing to visit. The other major collections focus on ancient and European art, which hold little interest for me. Gallery 19 displays Impressionism and Post-Impressionism works, but I saw nothing noteworthy here.\n\nWe stopped in the museum's cafe for snacks and ate them on a lovely patio. There is also a nice gift shop.\n\nThe museum mostly appeals to me, however, for its architecture and location. The Beaux-Arts building is patterned after the Palais de la Legion d'Honneur in Paris. It sits on a hill in Lincoln Park with stunning views of the Pacific Ocean and Golden Gate Bridge. We came by the #1 bus from Downtown, getting off at 32nd Avenue and Clement Street, walking uphill for about 10 minutes to reach the museum. For those driving, there is a small parking lot directly across from the building.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Enjoyable", "Our recent visit to this museum was enjoyable. Much of the art is religious. Not my personal favorite although we appreciated it. Set near the Presidio, Lands End and Baker Beach with awesome views of the GGBridge.... this beautiful area offers much to see and do.\nAdmission is inexpensive and includes admission to the De Young in GGPark. Lots to see and do.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Great art msueum", "Excellent temporary art exhibits, as well as permanent exhibits. It has a large theater for live performances, and a room where organ concerts are given on Sundays. There's a good restaurant with in and outdoor seating, and 2 gift shops."], ["Reviewed January 10, 2018", 4.0, "Have always loved their special exhibits. Stable collection wonderful", "We have been to the Legion of Honor many times for special exhibits. It never fails to impress. They have a permanent collection of Rodan's worth seeing. Nice, but expensive cafe. Lovely grounds. Tough parking if you are disabled."], ["Reviewed January 6, 2018", 2.0, "Value of the museum vs price, not worth", "We really didn’t like this museum, even they have a couple of temporary exhibitions, the collections are very limited . The price was the same as SFMOM, And of course is a different museum , but nothing to do. I really don’t recommend you to send your time here. If you are in the area go to the park. Great views\nShow less"], ["Reviewed January 4, 2018", 5.0, "Best Art Museum in town.", "Check the schedule and definitely go. The permanent exhibit is amazing but they often have special exhibits. The dining room at the Museum is great for a nice lunch with many healthy choices."], ["Reviewed January 3, 2018", 5.0, "Night", "We went here during the night time as we were not able to see it during the day. It was still a lovely night to see the thinking man. I visited the Legion of Honor seven years ago and it still looks the same."], ["Reviewed January 3, 2018", 5.0, "The Thinker....found!", "Rodin has many sculptures here and the additional artwork and collections are vastly interesting and pleasing to the eye. The grounds are peaceful and inviting, nice restaurant, cute little gift shop. Go enjoy!"], ["Reviewed January 3, 2018", 5.0, "Small enough to take in all the art in a day!", "This is a beautiful building in a beautiful location with beautiful art! When we arrived their was ample parking at the museum as well as parking available along the adjoining road up to the museum.\n\nGeneral admission gets you into their permanent gallery only. It is a very pleasant way to spend a half day or even an hour or two.\nShow less"], ["Reviewed December 25, 2017", 5.0, "Klimt and Rodin Exhibit", "If you are lucky enough to be in San Francisco while this exhibit is in place, don't miss it. The sculpture and paintings are glorious."], ["Reviewed December 22, 2017", 3.0, "Small expensive museum", "Went to see Rodin/Klimt exhibition. Was disappointed that there wasn't very many of Klimt's work displayed. The museum itself is really nice, but it is a bit small. It costed $25 to see Rodin/Klimt. However, this fee doesn't include the exhibition on Greek gods that was downstairs. You would have to pay a separate fee to see it. The perimeter around the museum is gorgeous.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Iconic museum with great special exhibits!", "This is my favorite fine art museum in San Francisco. I mean, the De Young is just about the only other one, but this one is just so beautiful inside and out!\n\nThey always have such an interesting permanent collection as well as very cool special exhibitions.\n\nParking is kind of a pain, you can spend quite a few minutes looking around for a space.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Excellent Rodin and Klimt Exhibit!", "The Rodin and Klimt exhibit was excellent ($30 admission) - what a thrill to see so many Klimt's together and become aware of the connections between these arists! The museum itself is not very big, so you can see it all fairly quickly. The cafe is very pleasant. The shop contains a smaller selection of items than the deYoung shop. Free parking right in front was no problem.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Rodin and Gustav Klimt in the US!", "Hubs and I got our tickets online well before our Saturday visit. We arrived 15 minutes prior to opening, and we had plenty of close-in free parking to choose from.\n\nThe exhibits did not disappoint. The descriptions next to each piece gave added depth to our enjoyment.\n\nWe spent a solid 2 hours here. Including a visit to both gift shops. Nice!\n\nWhen we were leaving, there was a long line to get in, and parking was scarce.\n\nMotto: arrive early to avoid crowds.\nShow less"], ["Reviewed December 14, 2017", 5.0, "Archiectural Gem", "I went to the museum for the Klimt and Rodin exhibition and enjoyed the beauty of the building as well.The building is in a beautiful location with views of San Francisco Bay."], ["Reviewed December 12, 2017", 5.0, "Regal Spot Looking out over the Pacific", "We visited this regal spot overlooking the Pacific. Listened to two talks inside and toured the special exhibits. Had a lovely little lunch."], ["Reviewed December 11, 2017", 4.0, "Lots of pretty things to see", "A couple of the big exhibits cost extra, and we only had a couple hours so we skipped those. There were plenty of beautiful things to see."], ["Reviewed December 10, 2017", 5.0, "Pleasant Museum!", "I love the variety of art in this museum! The building itself is architecturally pleasing. My favorite pieces are the impressionist and post impressionist pieces; however, I found something I liked in each room. Highly recommend!"], ["Reviewed December 10, 2017", 4.0, "MATISSE exhibit", "This is a very beautiful setting; the building is gorgeous and the grounds are very peaceful; there's a nice view of the GG Bridge in the distance. I enjoyed the Matisse exhibit immensely."], ["Reviewed December 10, 2017", 1.0, "Klimt show disappoints", "The Klimt show is small, poorly lit, and expensive ($30/person). Klimt is one of my favorite artists and I was sorry to see so few finished paintings. This show isn't worth the crowds and the cost.\nThe location of the Legion of Honor is fantastic. Go there for the views of the bay but skip this show.\nShow less"], ["Reviewed December 9, 2017", 5.0, "ART AS IT SHOULD BE", "My family has many fine artists in it, and many who enjoy art, but I am not an art lover. I do however, appreciate a good presentation. The Klemp and Rodan exhibit Are such an exhibit. If you love art and sculptures please come here"], ["Reviewed December 7, 2017", 5.0, "Beautiful art museum in Lincoln Park", "This is a beautiful museum. Parking is limited. When you arrive, don’t just go in. Explore the surroundings. There is a short walk that will take you to a Holocaust Memorial, a Japanese Memorial and great views of the Golden Gate Bridge. Inside the museum, you will find the works of many masters as part of the permanent collection. I went for the special exhibits. Currently, there are two. One is Klimt and Rodin, two of my personal favorites. These two artists were contemporaries, both rebels of their time, and both created very sensual art. The other exhibit is Color of the Gods. FABULOUS!!! We are used to seeing the sculptures of the Greeks and Romans as beautiful white marble. But those beautiful white marbles were not seen by the Greeks and Romans. What they saw were brightly painted marble. This exhibit focuses on recreating those colorful sculptures based on sophisticated techniques and research. My friend and I spent 5 hours at the museum. We spent about an hour at each special exhibit. We took the docent tour (45 minutes) of the antiquities exhibit. There is no docent tour of Klimt and Rodin, but there was a 45 minute lecture. We attended that. We spent about half an hour having lunch and we spent about an hour exploring the permanent exhibit. We spent maybe a half hour walking around Lincoln Park. A wonderful day!\nShow less"], ["Reviewed December 6, 2017", 5.0, "Beautiful museum in a scenic location", "Went to see the Klimt\\Rodin exhibit last week and enjoyed touring more of the museum afterward. A bit pricey for the size of the exhibit, but worth it if you're a fan of Klimt or Rodin."], ["Reviewed December 6, 2017", 5.0, "Fantastic Museum", "This wonderful museum has a bit to please everyone. If you like Rodins then this is a great place to see a variety of his work. Many fantastic paintings and tapestries. And the cafe is a good place to grab a light lunch."], ["Reviewed December 4, 2017", 5.0, "Great place to spend a Sunday afternoon.", "We went for the Klimt and Rodin exhibits but loved the museum's general collection equally as well. The setting, above the Presidio, overlooking San Francisco's Golden Gate, is spectacular. Be sure to stay for the weekend organ concert. The entire experience is absolutely delightful."], ["Reviewed December 3, 2017", 3.0, "Thirty Five Dollars Each!", "We went to see the recent Klimt/Rodin special exhibition, as well as The Gods of Polychrome. This is a lovely museum in general, but in my opinion both special showings fell flat. The Klimpts were scarce and the polychrome thing was just a bunch of reproductions. The place was packed so there was little opportunity to enjoy what was there. 35 dollars a person is just way way way too much. I actually felt betrayed. My fair city has found yet another way to exclude all but the well off. Very disheartening!\nShow less"], ["Reviewed December 2, 2017", 5.0, "Beaux Arts Elegance Combined with Outstanding Exhibits Make the Palace Irresistible", "The setting is at the top of a hill whose base touches San Francisco Bay. The museum overlooks the bay, Golden Gate Bridge, and wooded Marin County on the opposite shore. In short, it's spectacular. The Legion of Honor is beautiful all by itself, with a huge fountain, green lawn and a marble and stone courtyard (embellished by a bronze of 'The Thinker' by Auguste Rodin) leading to the entrance of the building. Inside the rooms immediately past the ticket area are devoted to the sculptures and art of Rodin. There are Special exhibits are offered both on the ground floor level and downstairs. There is a very good cafe downstairs, also, as well as exhibit cases in the hall way showing smaller sculptures and artifacts.\nI visited the museum a week ago and, although I have been there many times over the years, I felt the same rush I always do. The beautiful surroundings and the high quality of the collection are just amazing.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Klimt exhibit", "Went for the Klimt exhibit, and loved seeing the paintings up close. The depth and colors are beyond what you can imagine if you have only seen pictures."], ["Reviewed November 29, 2017", 5.0, "Don't Miss the View", "You'll love this museum with innovative employees who know how to put together interesting special exhibits. The current exhibit combines Klimt's gorgeous paintings with his good buddy Rodin's drawings and sculptures, some of which are part of the permanent collection. The 4 star view of San Francisco from Lincoln Park where the museum is situated will take your breath away. What a great way to spend a Sunday morning.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Klimt Rodin Exhibit", "Phenomenal and incredible opportunity to see this exhibit. Words cannot express the simultaneous joy of life and sense of mortality I experienced. You have to go!!!"], ["Reviewed November 27, 2017", 5.0, "Enjoy the view, but also go inside", "This is far out in the western reaches of the City, but worth a trip. We took a Number One bus from downtown (Sacramento and Montgomery) which slowly proceeds over half a dozen hills and through a variety of neighborhoods. Then you transfer to a nearby Number 38, and in two minutes you'll be up at the Legion of Honor. Great views of the distant Golden Gate Bridge and what looks like a particularly good golf course. The Legion of Honor is so stately that Chinese brides like to have their wedding portraits taken there. Inside the permanent collection is good, and there are often outstanding special exhibits. Good cafe with nice food and reasonable prices. Visiting this place is a great way to spend a peaceful afternoon in San Francisco. Turn off your cell phone when you come here, and the whole experience will feel like a quiet sojourn in a slower, earlier era.\nShow less"], ["Reviewed November 27, 2017", 5.0, "The best little museum in san Francisco!", "Make sure to use the headsets to get the full experience! The cafe is lovely with delicious options for lunch"], ["Reviewed November 25, 2017", 5.0, "Great museum with a fabulous view", "We went to the Gustav Klimt exhibit at the Legion of Honor in San Fransisco and had a great lunch at the museum cafe. They have a lot of great permanent exhibits as well. The view of the San Francisco harbor is amazing."], ["Reviewed November 24, 2017", 4.0, "Good museum in a beautiful location", "My wife and I spent a couple of hours here, which meant we took our time and skipped nothing. The museum is not large, and substantial gallery space was taken up by two special exhibitions that required additional tickets. The museum was nicely laid out, and the building itself is beautiful. The nicest part may be the setting, though, with spectacular views from a perch atop the hill. Since enjoying this museum didn’t take the time we allotted, we decided to take advantage of the admission also getting us in to the de Young, which I’ll review separately. I highly recommend carving out time to take in both, as together they add up to a whole as compared to other major city’s museums.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Gods of Color -- wow", "The Legion of Honor commands great view of the city of San Francisco and the Golden Gate Bridge. It's collection of Western Art ranges from antiquity to the late 20th century and provides a great overview of art across the ages as well as across media. Their paintings and ceramics are first rate; but unless you've been to his Museum in Paris, their Rodin sculptures are worth the price of admission.\n\nThough I sort of liked the special exhibit of Rodin and Klimke, who seem to have been contemporaries united by common vision of sensuality in their work, it was their other exhibit -- entitled Gods in Color -- that made me go wow.\n\nYears ago, I read about how Ancient Greek and Roman sculptures were painted; but this exhibit not only showed what their painted works looked like (loud and brightly colorful) but also provided background on the historical references to their use of color and explained how chemical and spectographic analyses were used to reconstruct the coloration of their statues.\n\nThe first two picture that I've attached are of the same bas relief--the first is bathed in white and relies on shadow for its effects and the second pops out it figures through the use of color. The third and fourth pictures are of a fully painted archer and a partly painted goddess; both seemed to have in the Acropolis. Very interesting.\nShow less"], ["Reviewed November 20, 2017", 5.0, "History with a view.", "From the structure itself to the statues on the grounds, the is was a very enjoyable stop during our stay in San Francisco. Great views as well."], ["Reviewed November 19, 2017", 5.0, "Excellent permanent collection and superb exhibitions", "This museum is a treasure for S.F. Location is breathtaking. Will be surprised by the quality of art and the choice of rotating exhibitions."], ["Reviewed November 16, 2017", 4.0, "Grand building in a brilliant position and good exhibitions", "I visited with friends who live close by and knew there was the Klimt and Rodin exhibition on. The building is not a typical museum by design but the entrance area is cool with its many columns and open space.\nThe exhibition was good and some of the Klimt portraits were wonderful especially the pastels and sketches as well as the more colourful bright paintings one tends to recall about this artist.\nThe Rodin sculptures are wonderfully detailed - you want to touch them and imagine how his models kept their positions.\nWe had no time to roam around all the other rooms but it is well worth a visit. Some good books and jewellery in the shop.\nThe cafe was expensive for the food we ate but with the dollar/sterling exchange rate being what it is, most cafe or restaurant fare is pricey these days.\nShow less"], ["Reviewed November 15, 2017", 5.0, "lovely way to pass a day well", "I took a dear international friend to the Degas and The French Millinery Trade exhibit in September. It was delightful as was the rest of the museum's exhibits. The Legion of Honor is located in Golden Gate Park and walking around the site and driving out on the north coastal road are also treats. For a lovely outing in SF, especially for art enthusiasts, this was a great day.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Klimt -Rodin combined exhibition.", "Really fine collection of works. Some might find it pricey, but consider the provenance and the artworks themselves. We found it a lovely experience."], ["Reviewed November 13, 2017", 4.0, "The Legion never fails to have a quality show", "Coming to the Legion after the DeYoung Summer of Love was pretty refreshing. The permanent exhibitions and the rotating new shows keeps me going back. Parking is my only issue. Food is good in their dining area as is the gift shop."], ["Reviewed November 12, 2017", 4.0, "Well worth a visit - stay away from the extortionist café", "I visited in August 2017.\n\nThe Legion of Honor has a wonderful permanent collection, which was my reason for being their. I also attended the \"Degas, Impressionism, and the Paris Millinery Trade\" exhibition, which was not worth it! I loved the painting and sculpture collection, which I definitely recommend. There were also two negatives: (i) the Café is one of the most shockingly overprices museum cafés that I have ever been in. I found it quite shameful, in fact. The problem is: there are no other eating options nearby, which is why the museum can extort visitors in thsi way. A second negative is that, failing having your own car, a taxi is the only option to get to the museum. The bus is simply too impractical. As a foreigner, getting a taxi back is not that easy, however, numbers are available at reception, although they \"cannot call you back\" if you are using a foreign telephone number.\n\nThe café extortion aside, definitely worth a visit.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Great Collection, Wish We Could Have Seen the Whole Thing", "This is an art museum with great works, and is small enough to see in one day. The highlight was a discussion by a docent of the Egyptian mummies and how they were made. She was perhaps the best informed docent in any museum that I can remember. Other highlights are the Rubens, Rembrandt and El Greco paintings and the porcelain collection. Unfortunately, the Rodin sculptures were moved to a special exhibit which we passed up because it was grossly overpriced. And since the English paintings were in a room next to the special exhibit, they were off limits to regular viewers even though not part of the special exhibit. How do you explain that?\nShow less"], ["Reviewed November 9, 2017", 5.0, "Nice and cozy museum with beautiful scenery!", "A nice little cozy museum located in one of the most beautiful sites of the city! Very clean everywhere! Beautiful and clean restroom decorated with nice fresh-flower vases is pretty and relaxing. The room with a beautiful collection of porcelain pieces is a must-see, and my favorite.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A hidden Treasure", "Modelled after the French Pavilion of the Pan-Pacific American International Exhibition, this elegant building houses classic art and some BLOCK-BUSTER shows. Scenic overlook is jaw=-dropping"], ["Reviewed November 8, 2017", 5.0, "Breathtaking Monument of SFO", "its a picture perfect location built amidst sea or creek area of SFO and its huge. Right across this monument one can see rest of SFO city."], ["Reviewed November 6, 2017", 5.0, "A hidden gem!", "This is a wonderful museum in a fantastic location. Check for the current featured instalation. Give yourself at least 3 hours."], ["Reviewed November 1, 2017", 3.0, "Stiff museum with basic art history exhibition", "But interesting Rodin vs Klimt exhibition when we were there. Café also decent - but overpriced. Shop - pale. Probably this is an Excellent art history training museum for SF-people, in a stiff context."], ["Reviewed October 31, 2017", 4.0, "Wonderful klimt and rodin exhibition", "Great place for a museum - so near the cliff views. Rodin and klimt exhibition was well worth the trip - some great and inspiring works from these classics."], ["Reviewed October 31, 2017", 5.0, "great and uncommon museum", "in case you are right now in san francisco you shouldn't miss the actual shows of rodin and klimt and on top the spectacular show 'gods of color'!"], ["Reviewed October 30, 2017", 2.0, "Millinery and Degas", "Terrible staff - thus the 2 star rating. Not helpful - i felt as though I was part of a grade school field trip.\n\nThe exhibit was wonderful! The ticket price is extreme for the size of the museum, and must be purchased to view only the special exhibit.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Small museum with a great collection", "Do you avoid museums because they take too long? The Legion of Honor is a relatively small museum with an amazing collection that you can see in an hour (or two or three depending on your level of interest). And the setting is spectacular."], ["Reviewed October 29, 2017", 3.0, "Pricey as always. Decent Klimts", "Lovely location and decent permanent collection but $35 is pricey for admission to the special exhibitions. Klimt Rodin is a decent mid-sized Klimt show padded out, in my opinion, with a tenuous connection to another of the West Coast's large collection of Rodin's works."], ["Reviewed October 29, 2017", 5.0, "A Perfect Setting", "I have been coming here for a few years since I am a member but this is my first review. The setting of this intimate museum is almost surreal, on a clear day the view is spectacular. In the morning there is a lot less crowd and you don't have to elbow your way through just to see the artworks up close. The cafeteria downstairs serves surprisingly good food and coffee. It's more convenient to take Muni bus as it stops right out front.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Great special exhibition Klimt and Rodin", "My sister and I had a great time here. She joined the museum and took me to the exhibition for my birthday. What a treat. The docent was really funny and informative. It is a nice size museum, not too big. We went for a lovely walk to Lands End before our entry time and had a delicious quiche lunch at the museum cafe. Their museum shop is also great. I never buy anything and I ended up cramming two books into my carry on.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Wow", "The museum is in a beautiful location. If you have a chance take the hike nearby for some postcard quality photos of the Golden Gate Bridge. The museum has some amazing pieces but what I loved was the ability to see and learn about artists new to me. I love smaller museums because you get to spend more time with a piece...that being said my only complaint were the large amounts of school children running around the museum. If their teachers and chaperones can't control them then they should be reprimanded by the staff. There were kids running in the galleries and they were extremely loud. The highlight of my trip was the tour by Chaney. She was very good and she even added a few pieces not normally on the tour because I liked them.\nShow less"], ["Reviewed October 23, 2017", 2.0, "Great museum, very dangerous parking lot for break-ins", "Wonderful shows at this museum, but average amount of cars broken into in the parking lot, both in front and on the side of the museum, is 2 -3 per day (just ask the museum staff)! People are watching when you put your valuables in your trunk and will smash your windows and steal them. Take everything inside to the free coat check and leave it there!\nShow less"], ["Reviewed October 23, 2017", 3.0, "Mixed Feelings", "The museum is located in a beautiful setting in San Francisco and, for us, was one of the major highlights of our visit. We went on a Saturday and were a bit overwhelmed by the admission price - $30 per person and then another $15 to see a special exhibit. The museum itself has a fairly reasonable collection for its size -- it is not a very large space. I am not sure I would pay these prices to go back into the museum, but, I would go back to this location, park, and enjoy the scenery from this part of San Francisco.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Always beautiful, always a pleasure", "Came here for the Teotihuacan exhibit. Very well organized and curated. Our cudos to the docent, Leopoldo Villela."], ["Reviewed October 22, 2017", 5.0, "A wonderful family experience", "Our family of five visited the museum for the Klimt exhibit, but found all of the artwork outstanding. Not a particularly huge museum, very do-able in a half-day to a day's visit. Just a very well-run operation, period. We were even impressed with the wonderful food and ambience of the café on the lower level. We highly recommend a visit.\nShow less"], ["Reviewed October 21, 2017", 4.0, "Unique and Beautiful", "All museums house collections, exhibitions and a museum store. If you truly enjoy paying the admission fee to view amazing art then by all means this museum was exhibiting works by Klimt when I visited this past week.\n\nWhat is truly unique and beautiful about Legion of Honor, LOH, is the location. It may seems odd to some that there is a golf course surrounding LOH but once you truly take a look around you will see nature and the beauty of everything.\n\nPassing the arched entrance you find Rodin greeting you and all of a sudden you are now enclosed in pillars. There really are not, in my case, words to describe what visiting LOH makes you feel. My wife and I happened to walk here from the pacific heights neighborhood but LOH is easily accessible via MUNI Bus or even by cab, car, bike, whatever.\n\nMy main reason for making the trip to LOH was because it was featured in Hitchcock's film \"Vertigo\". Not having visited the museum inside I felt the long walk was worth it. We even saw huge crows wandering the golf course.\n\nFor those looking to visit \"monuments\" of sorts this is one place to visit.\nShow less"], ["Reviewed October 20, 2017", 4.0, "Delightful afternoon", "We didn't know what to expect at the Legion of Honor museum since we were between major art shows but decided to check it out nonetheless. We're glad we did. First, it's in a beautiful setting so just walking outside and around its beautiful columns (where a photoshoot of ballerinas was taking place when we were visiting) was a treat in itself. Just viewing the Golden Gate Bridge from the overlook was wonderful.\nInside, the collection (excluding any major exhibition) was small but lovely and all very engaging.\nIt was an afternoon well spent.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Excellent special collection: Klimt and Rodin", "We say the Klimt and Rodin exhibit — excellent. Crowded though and noisy. The setting for this museum is wonderful, worth even a brief visit for that alone and to contemplate Rodin’s thinker."], ["Reviewed October 15, 2017", 4.0, "Klimt and Rodin - Go See It", "The museum kindly brought together two of my favorite artists with the juxtaposition of their work well done and interesting. Admission also includes access to the general exhibition which is a weird but wonderful collection of art and artifacts from around the world that I found very enjoyable as it was a glimpse of many schools and influences without being overwhelming. You need to keep your eye out for treasures in every room!\n\nThe staff were very friendly and helpful and more than one docent saw my interest in something and talked to me about it, telling me more than what was on the plaque or audio guide.\n\nThe Legion of Honor is a bit off the beaten path but I enjoyed the morning ride on the #1 bus and walk around Lincoln Park. This is the only reason for the four stars - it takes some persistence to get there. But worth it and I recommend you take the time to visit while in the City.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Great location. Great museum Klimt and Rodin opened oct 15. Gods in color ones soon", "Legion of Honor Is the sole venue for Klimt and Rodin. Definitely worth a visit for the special exhibit, well displayed permanent collection of European art, fantastic location with great bay views and a great cafe.\nIt is one of two SF city Fine Art Museums. Your admission to the Legion includes a visit to the permanent collection of the De Young on the same day.\nIf you come by public transportation, show your muni ticket for a discount.\nShow less"], ["Reviewed October 13, 2017", 4.0, "Delightful Exhibits", "We visited the Legion of Honor Museum at about 1:30 pm on Sunday, 9/9/17. We were very concerned about parking and had a Plan B & Plan C if things did not work out. To our great happiness, just as we arrived, several cars pulled out in the lot right in front of the museum. In addition, just steps below the museum, we noticed several open spaces in the lots and along Kennedy Blvd. so be brave and give it a try! We are big fans of European paintings and European & American Decorative Art. We enjoyed the Rubens, Monet, Rembrandt and El Greco paintings. The galleries are nicely organized with welcome seating.\nDid this review earn a “Thankful” vote?\nShow less"], ["Reviewed October 11, 2017", 4.0, "free visit on the same day with deYoung", "very nice collection of arts, free parking, great place for art lovers. free visit on the same day with deYoung"], ["Reviewed October 8, 2017", 4.0, "Great collection of 1400-early 1900 european art", "Let me preface with with: my favorite art comes from Europe in the 1400-mid 1900s. So, this is my kind of museum! I'm also a bit spoiled in that the local art museum in Kansas city has a rather large collection of such art and has free admission. So I was a little sticker-shocked, but I understand that maintaining a museum like this takes money and effort.\n\nThey didn't have the largest collection, nor the most famous pieces, but they did have good variety. There were even a couple of show-stoppers that you can't help but stop and get lost in.\n\nAll-in-all: a good museum, but it probably won't have the largest or most impressive collection a real art connoisseur (not that I at all claim this status) will see.\nShow less"], ["Reviewed October 7, 2017", 4.0, "Brilliant.", "Pitched high on a hill with an awesome view of the Bay and GGate area. This incredible building is filled with art which historically walks through the ages. It can easily take most of the day to get through. I walked for hours and still did not see all of the art. The museum has optional headphones and an app which needs some work on it. Signal is not great.\nShow less"], ["Reviewed October 7, 2017", 4.0, "Great Inside and Outside", "Wonderful place to view an art show. Also great location, with scenic views when weather cooperates."], ["Reviewed October 7, 2017", 5.0, "Outstanding!", "This is a major art museum with a history all of its own. The setting is spectacular, with views over the city, bay and Golden Gate Bridge . It hosts a major collection of porcelain, a significant collection of Rodin sculpture and a wonderful art collection. There's a good, well-priced cafe. You can easily spend half a day visiting\n.\nShow less"], ["Reviewed October 7, 2017", 4.0, "If I live in SF, I would buy a membership", "If you like the classical European painting, this is the only place in the SF you have to visit.\nThe permanent collection is not big (in comparison to the Metropolitan Art Museum or National Gallery at Washington DC) and \"infested\" by art-works of some not so great artists, but there are great works of Rembrandt, Gainsborough, David, El Greco, Rubens, Degas, Renoir, Monet, Pissarro, Seurat, Cézanne.\nYou could stare at these master pieces for hours in a kind of a meditation. You could come to see them many times and find something deep, something touching your soul each and every time.\nIn addition to that there are free organ concerts on Saturdays and Sundays (no concerts till Feb 2018 due to some exhibition installation). Actually if you have a single membership you could come with a friend for free (temporary exhibition will require discounted ticket).\nWith a ticket for Legion of Honour you could visit the de Young museum as well (but I would advise to save time and skip it, unless you like to see anthropological artefacts, which collectors and curators mistakenly identified as works of art)\nShow less"], ["Reviewed October 6, 2017", 5.0, "The most beautiful museum in San Francisco", "Located in Lincoln Park in the middle of the golf course on the north west corner of San Francisco with sweeping views of the Golden Gate Bridge, the Palace of the Legion of Honor is the most beautiful museum in the city. Built as a replica of the Palais de la Legion d'Honneur in Paris, The permanent collection of paintings, porcelains and antiquities is reason enough for a visit. During my most recent visit an exhibition and recorded tour on Rodin, design and millinery in the Impressionist Era was outstanding. Admission discounts are available for students and seniors and admission is free on the first Tuesday of the month. Parking is limited. Don't miss the Rodin \"The Thinker\" bronze in the Court of Honor that commemorates the Californian soldiers that died on French battlefields in World War l.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Love so much we joined as members", "We enjoy the intimate nature of the Legion of Honor Museum and the creative art exhibits like the recent Degas and Paris Millenary. They have a Klimt-Rodin exhibit coming up too. Our enjoyment of this museum has caused us to become members. It is a great bargain as it includes the deYoung museum too. I can highly recommend if you like classic art with creative bents.\nShow less"], ["Reviewed October 4, 2017", 4.0, "If you enjoy a wide variety of art, see the San Francisco Legion of Honor", "We visited during the time the museum was taking down a special exhibition and setting up another, therefore what was available for view was their internal collections. The Legion of Honor has a wide variety of artworks to enjoy. I was pleasantly surprised at the range of paintings from early Renaissance to Impressionists, the sculptures and ancient artifacts. There is even a room devoted to porcelain works. The building itself is a work of art to observe and enjoy.\nOutdoors was a vista of San Francisco, the Marin Headlands, and Golden Gate. We visited during the week and there was plenty of parking. The price of the general admission ticket also includes same day entry to the de Young Museum in Golden Gate Park. Parking at the Legion of Honor was free. The Cafe provided us a pleasant lunch at prices one expects at museums.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Lights on the columns", "Because this revered museum sits atop a hill, the views in day light have always made me pause. Golden gate peeking thru cypress trees, stone work, statues and art treasures behind the courtyard and the entrance, with Rodan’s Masterpiece waiting for you. The quiet, the green smell of the ravines and those columns embrace feelings of true no hurry, San Francisco. By nite the colored lights are quite a sight. The Golden gate lit up in warm fog lights for the drivers. At night the museum is closed, but the views are now electronically charged. A lovely drive on a warm evening, just to pause and see the lights.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Incredibly beautiful and worth your time", "I visited this museum for Bouquet to Art several years ago and have returned just to be in such a beautiful location. The collection is romantic and well thought out as it is placed. I enjoy the location and the view from the hill it's crowning and I enjoy the gift shop for it's interesting selection as well.\nShow less"], ["Reviewed September 29, 2017", 5.0, "If you love beauty-don't miss this!", "On a recent visit to S.F. I was lucky enough to see the Degas/hat exhibit. It was a very large exhibit and I enjoyed every bit of it. Rodin, the art, the architecture-all were excellent. The staff was very friendly and helpful as well.\n\nIn addition to all of that, the view of the Golden Gate Bridge, the park, the harbor... oh my. It is just spectacular. I also caught the free organ recital which was fantastic. And I notice the discrete but noteworthy Holocaust memorial right across the street. Oh-and not to forget the fine music coming from a guitarist just outside the Legion of Honor. Beautiful classical guitar. I happily bought one of his CDs!\nShow less"], ["Reviewed September 26, 2017", 4.0, "Great Degas exhibit", "The exhibit was tastefully done, focusing on his work and similar artists in the doing paintings with subject matter in the millinery industry. There were also exhibit of hats on display, which further enhanced the art."], ["Reviewed September 26, 2017", 5.0, "Beautiful!", "We came here to take wedding photos, and it is the most stunning museum! I highly recommend using the exterior of this building for wedding photos, especially in the 4pm-5pm time frame (the golden hour)."], ["Reviewed September 17, 2017", 5.0, "Beautiful!!", "Gorgeous art masterpieces!! A MUST see!!! Huge & in luscious park setting. Rodan's \"The Thinker\" is out front!! :-)"], ["Reviewed September 15, 2017", 3.0, "Interesting Exhibits", "We visited the Legion of Honor Museum during the San Francisco portion our California Road trip. We were looking for an indoor activity for a dreary, rainy day. My daughter is interested in antiquities so we chose the Legion of Honor. It was easily accessed by bus. There were 2 floors of exhibits ranging from the antiquities to some irreverent modern art. Our admission was covered by our purchase of the San Francisco City Pass. If we wanted to view the special exhibit,there would have been an additional charge. The only negative was the strong odor of tuna salad coming from the cafe on the lower level. It was quite over powering and prompted us to shorten our visit.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Small Museum, Big Experience", "The first thing to know is this museum is located in one of the more picturesque regions in San Francisco on sunny days. Surrounded by a golf course and the inlet to San Francisco Bay plus unique visuals of the Golden Gate Bridge, the Legion of Honor packs a big experience in a small package. Attractions can range from \"Splendors of Dresden\" to Annie Leibovitz. Famous painters, designers, photographers, sculptures and diverse displays create an ambiance that transports you. Additionally, when you finish with the museum the Pacific Ocean is within a five minute car ride.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Excellent gem", "This beautiful museum is set on top on the park overlooking the bay. Its permanent collection has a broad variety from ancient antiquety to impressionism. The one Rembrandt is good, the many Van Dyck s are great. Three rooms are dedicated to Rodin, a vast collection for such a small museum. Excellent restaurant as well.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Nice museum", "Went here alone to see the hat exhibit and Degas paintings. The location is very good. Coat check is available. Nice staff."], ["Reviewed September 14, 2017", 5.0, "Unexpected surprise", "Visited the Monet exhibit in July. The exhibit was wonderful with many interesting details and information. A unique experience. The place is also wonderful ... have visited the Bay area many ties , but this was a first one for us. Highly recommend it!"], ["Reviewed September 13, 2017", 5.0, "A gem of a museum", "Most people head for the DeYoung Museum, which is awesome, of course, but the Legion of Honor is definitely worth a visit, especially on a sunny morning. The best chance to get a parking spot right in front of the museum is to time your arrival just as the museum opens. Plan to spend a couple of hours. This would allow for viewing any special exhibits and some time to take a look at the permanent ones. Really, it is worth it.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Make a day of it!", "We attended the Legion of Honor on a Friday in September. It was foggy driving in via the Golden Gate, and the cool breezes saved us from the dry Sacramento heat. On the agenda was a showing of Degas, Impressionism, and the Paris Millinery Trade. Featuring ~40 Impressionist paintings and pastels by Degas (many never before exhibited in the United States), Renoir, Manet, Mary Cassatt, Henri de Toulouse-Lautrec and more. There were also 40 well-preserved examples of period hats, some adorned with feathers, lace, and flowers on display throughout the exhibit.\nNeedless to say, we really enjoyed the full experience!\nSince it was not a Saturday or Sunday, there were not as many visitors roaming about. We were able to find parking near the Museum quite easily. The price of the show was reasonable ($28), and the layout and presentation was impeccable!\nBeing fans of the Hitchcock film, Vertigo, we were also elated to finally see where part of it was filmed...right here at the Legion of Honor!\nAfterwards, we were able to walk the full length of the Museum, and see all of the other exhibits and collections as well. Wow! One of our favorite rooms was Salon Doré, the 18th Century Period Room re-creation from the Hôtel de La Trémoille. It is a lot to take in, so be sure to give yourself plenty of time to enjoy it, and definitely take a stroll around the grounds for a bit too. Do not miss this opportunity!\nShow less"], ["Reviewed September 8, 2017", 4.0, "Rodin and comprehensive well displayed collection", "In a pleasant setting on a hill not far from the Golden Gate Bridge, the Legion of Honor Art Museum has a comprehensive display of paintings from early Italian to Impressionism. There are some notable gaps, such as Botticelli, and many artists are not represented by masterpieces, but it is a pleasant overview. Allow a couple of hours. The highlight is a large number of works by Rodin - an excellent group along with Paris, Philadelphia and Mexico.\nShow less"], ["Reviewed September 8, 2017", 5.0, "WOW!!! Location, location, location", "We drove 1/2 hour from Fisherman's Wharf to this magnificent museum. The views are outstanding. This museum is doable in one day. The \"special exhibit\" was Degas, but we stuck to their permanent collection, which is outstanding. Rent the audio guide. A beautiful day!!!"], ["Reviewed September 6, 2017", 4.0, "Novel way to see Degas and his peers", "Recently went to the museums exhibit: Degas, Impressionism and the Millinery Trade. Wonderful exhibit with Paintings by multiple impressionists, with a focus on Degas, and their fascination with the hats of their time and milieu. The paintings paired with actual examples of the hats bring a new perspective to the impressionists as well as an understanding of the Millinery trade of Paris and London with it's designers, workers and clients. This exhibit opened my eyes to the role of hats in the social and artistic world that these painters traveled, making me realize how little notice I gave to them in the multitude of paintings I've viewed here and at other museums. Well worth the price of admission. Of course do not miss one of the most extensive collections of Rodin outside of Europe, fantastic bronzes as well as plaster studies.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Excellent collection of European art", "The Legion of Honour museum houses a comprehensive collection of European art, arranged chronologically from mediaeval to Post Impressionist. The galleries are spacious, calm and well lit, presenting the art to best advantage. The lower floor of the gallery contains space for special exhibitions and we enjoyed the current Degas and Paris Millinery exhibition. The museum itself is a fine example of French neoclassical architecture in a delightful setting in Lincoln Park, overlooking San Francisco Bay. The adult entrance fee was $15 for the permanent collection, or $28 also including the Degas exhibition.\n\nOne jarring note, however, was a special exhibition of the art of Sarah Lucas, whose works were spread throughout the ground floor rooms. The explicitly sexual nature of many of these works made them unsuitable for viewing by children, so it would have been better to have displayed them together, separately from the permanent collection.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Fantastic spot for a fine art visit", "Attended the recent Degas milinery exhibit and loved it. But the really impressive part was the rest of the museum - particularly the reconstructed palace rooms. Truly amazing work. The old masters' works look stunning in this beautiful gem of a museum. Well worth the trek if you are in SF and in need to a fine art fix!\nShow less"], ["Reviewed September 4, 2017", 4.0, "Small collection but lovely", "Beautiful facility in a lovely location overlooking the city and bay. We were there for a Degas exhibition but visited the permanent galleries as well.\n\nThe permanent galleries offered a small but well curated collection. My only issue was that they had a small special exhibition by a controversial artist -- most of this highly inflammatory exhibition was in one hall, but there were a few pieces that \"spilled over\" into other galleries. Those pieces were jarring in comparison to the other pieces in those galleries and detracted from those pieces (and really did not do justice to the special exhibition pieces either)\nShow less"], ["Reviewed September 3, 2017", 5.0, "Beautiful museum inside and out.", "This is a lovely museum set in a grand building in a park overlooking the Bay harbor and Golden Gate Bridge. It is a smaller museum with an extensive Rodin collection. It also has choice pieces from many different periods, from Greek (and earlier) through impressionist and a lot in between. The galleries are open and mix both objets d'art with paintings from the same period. If there is a special story about an item, it is included in the description. It seems like a museum with pieces lovingly acquired or donated.\n\nWe were fortunate to come and see an extraordinary exhibit on Degas and the Parisian millinery industry. It was a collaboration between SF and St. Louis and it was brilliant. They do have a book, worth while getting if you don't see the show.\n\nThere is also a cafe with high quality food, and an outside garden to sit in. All in all, this is worth a visit.\n\nShow less"], ["Reviewed September 3, 2017", 4.0, "Degas Exhibit Summer 2017 and Architecture", "This museum is stunning. The location (parking lot has a view overlooking the city and the Golden Gate Bridge) and the architecture of the museum itself if stunning. I was lucky enough to be in San Francisco while the Degas Exhibit was there, and it was incredibly well done and interesting. I love Degas, so admittedly not hard to please. They had other fabulous artists included in the exhibit as well as exceptional hats, since the exhibit was about Milners. I enjoyed the other areas of the museum as well. I would go back. Don't miss Land's End Trail while there - and wear sneakers!\nShow less"], ["Reviewed September 2, 2017", 2.0, "Caution about taking your kids", "There is no polite way to say this. The main hall exhibit was a Rodin cum erotic mess. Some artist trying to be significant I guess. But poor taste. There was a sign out front that certain rooms might be inappropriate for younger children (and others with taste). But it was impossible to avoid it from any room. These exhibits were in eyeline rom most places. I felt for the mother whose six year old asked her, \"what is that?\"\n\nLovely grounds and architecture. That is why I have it two stars.\n\nSkip the expense of going inside.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Hidden Gem!", "The Legion of Honor Museum is off the beaten path in SF and its name is misleading. They have a wonderful collection, including many Rodans. The most recent exhibit of Degas' fascination with the Paris Millinery trade is extremely well put together with not just Degas paintings, but others of the era. I loved it! Currently (August, 2017) you get 2 for 1 if you purchase a de Young Museum ticket. Worth the visit. Easy parking.\nShow less"], ["Reviewed August 28, 2017", 3.0, "Beautiful architecture but a tiny museum", "The drive up to the Legion of Honor was decorated by tall trees, and the architecture was enchanting amongst the greenery.\n\nBut the museum itself was very small consisting of an extremely limited selection of art work.\n\nI recommend going just to see the architecture and the surrounding scenery.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Superb Museum, a Little Hard to Get to", "Beautiful Beaux Arts style museum on a beautiful bluff overlooking the Bay. Home to many excellent special exhibits. A bit hard to get to in a park far away from the center of town."], ["Reviewed August 27, 2017", 2.0, "Families with children aren't welcomed in the museum", "We visit Legion of honor very often - we love art and want our daughter to appreciate it. We even buy membership.\n\nI am totally ok with Sarah Lucas's works. She is an artist. I am not arguing with the ways Sara expresses herself.\nWhat I am not ok with is the museum's choice to install her works over entire entrance floor. Actually - there is no way to avoid them. There is no way to walk in the museum with a child without bumping into her works.\nSo what exactly am I supposed to do with my 9 years old who wanted to see French hats and Impressionism ?\nI felt that museum was saying : don't come. You and your family aren't welcomed here.\nVery disappointing.\nShow less"], ["Reviewed August 26, 2017", 5.0, "One of my favorites", "I LOVE this museum. This year the exhibit on Degas and the Millenary ws fantastic. The views from the Legion are spectacular, the exhibits amazing and the organ player concert on Sundays at 4 is terrific. They also have a creat cafe and gift shop."], ["Reviewed August 26, 2017", 2.0, "Pretentious", "We didn't actually go into this art museum. Outside was a fake statue of David and a faux Louvre pyramid. The cost was prohibitive for us as well. Very beautiful spot outside and we enjoyed that."], ["Reviewed August 16, 2017", 3.0, "Degas, Rodin ad Sarah Lucas exhibits", "I love this museum! Please understand this review is just regarding the 3 exhibits mentioned above that are now being displayed.\nCurrently, when you walk into the museum, past the guards and cashiers, the first thing you view is a \"plaster\" sculpture of the bottom half of a man with a cigarette shoved in his anus. Considering that the L of H prides itself on being kid friendly, this a rude awakening as you enter! Many parents ushered their children away from it only to be confronted by more of the same in adjoining galleries. But, that's just the beginning. In the main floor galleries are quite a few Rodin sculptures. Mixed in with these are some more pieces of Sarah Lucas' art. Melting acrylic toilets on top of small dorm room size refrigerators, soft sculptures of breasts and penises and more plaster sculptures of women's private parts (with a cigarette sticking out of them.) I thought this was an insult to Rodin's art and the collection of classic paintings exhibited on the walls.\nDown stairs was the Degas Millinery paintings exhibit. If you go expecting to see the color, grace and fluidity of Degas' ballerina paintings, you will be disappointed. These paintings left a lot to be desired. And because there weren't very many of his \"millinery\" paintings, works by Manet and other artists were interspersed. The best part of the exhibit were actual preserved hats from the 18th century! These were a delight to see! The designs were very clever, beautiful and artistic!\nPerhaps in the future, art by Sarah Lucas could be considered for the Museum of Modern Art, and not the Legion of Honor.\nShow less"], ["Reviewed August 16, 2017", 3.0, "Not outstanding", "I drag my family to museums everywhere we go. It's a true pleasure to find art that is hard to look away from -- to learn something about the artists, and see something new. That said, there wasn't anything new to see at the Legion without paying $60 extra to get in to the special exhibit. Little frustrating to have it be so expensive to visit a museum with kids --\nShow less"], ["Reviewed August 14, 2017", 5.0, "Most Beautiful Setting --> World-Class Museum", "Great setting in Lincoln Park . .. \"above\" the G G Bridge Constantly rotating exhibits (world-class) and a nice cafe."], ["Reviewed August 12, 2017", 5.0, "Fabulous museum", "Me working as exhibition designer in Mexico City for the Museum of Fine Arts, it was such a pleasure to go to this museum and see their wonders.\nI really enjoyed it, I just wished it was closer from where i was staying, but still it is amazing, the building, the exhibitions and the view.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Decent museum", "The Legion of Honor museum is situated on beautiful grounds with great views in every direction. The museum itself was somewhat small. I was there for the Degas collection which was nice but limited in the audio tour component as well as the collection. The \"modern art\" displays were odd, chunky, and added nothing to the experience for my taste. The Rodin collection and Impressionist art is nice. Probably a one time visit for me.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Interesting history, architecture, museum and view", "We are members of the Fine Arts Museums of San Francisco, so go to the Legion of Honor two or three times a year, usually for special exhibitions. The view of the bay and Marin headlands is marvelous on a clear day. The architecture is very interesting and the regular collection is worth seeing as well. Parking can be a bit of a challenge, especially on weekends, but usually you can find a place if you are patient. Worth visiting whether a tourist or resident!\nShow less"], ["Reviewed August 8, 2017", 4.0, "Muni insider's tip", "I visited both solo and with friends definitely a must visit if you're in San Francisco and love paintings and art. Legion of Honor held great exhibitions too, I've definitely enjoyed their exhibits.\n\nIf you happen to take the Muni buses to go around the city they have special discount if you present your Muni ticket at the ticket counter. Take the #2 from Sutter on Union Square is a slower ride from the #38L but with better view, less crowded too! But if you want a speedier ride take the #38L and get off at Geary & 34th Ave then take the #18 Legion of Honor, they go up to the hill and drop you off right in front if the museum.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Hats everywhere", "After having high tea, my group went to the exhibit of French millinery and Degas at the Legion of Honor. A good transition from wearing hats at tea to enjoying the hats of Degas' times. The building is spectacular and we easily found parking. I was so impressed that I joined the museum. I'll be going back soon!\nShow less"], ["Reviewed August 5, 2017", 5.0, "Degas Paris Millinary Trade Exhibit", "This very special exhibit at the Legion - Degas, Impressionists and the Paris Milinery Trade takes you back to the salons with photos, moving pictures, hats, and beatiful paintings which have captured the beauty, fashion, and hard labor of that time A must see for those who enjoy impresionism.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Surprises every turn.", "What a wonderful way to spend a few hours! The grounds are beautiful and we were impressed with the collection of art, sculptures, and furniture the museum has."], ["Reviewed August 4, 2017", 1.0, "DO NOT GO NOW! Do NOT bring children! Current exhibit is foul.", "The Legion of Honor has always been true to it's description as a finely curated collection of classic European art. Until now. They have placed ugly, semi-pornographic half-mannequins and toilets in almost all the galleries, so you or your children can't escape them (I can not even describe them, because Trip Advisor deemed it unfit for publication on their site. That's proof enough right there to stay away.). It is a travesty to fine art. Completely wrong venue for that kind of exhibit. Belongs in a dumpster IMO, but maybe someplace like SFMOMA would accept it. It completely ruins the fine art experience one used to be able to look forward to when visiting the Legio of Honor\nShow less"], ["Reviewed July 29, 2017", 5.0, "Surprisingly excellent collections", "Degas, Rodin and Sarah Lucas, and many, many others. It has a special exhibition on the hat (milliner) theme. It has a huge Rodin collection mixed with Sarah Lucas' works. Very interesting exhibitions. The entrance fee also includes De Young museum general exhibition too. Parking is free. We were there early. After finished the museum, we walked around to view Golden Gate Bridge.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Rodin sculptures, Multiple Monet, Degas, Cassatt, and Renoir masterpieces", "Amazing Degas collections with the actual milliner hats of his day. Huge Rodin collection. Park free here for the most beautiful museum grounds with trails to iconic views of Golden Gate Bridge steps away. My wish would be to see truly talented current sculptors and artists. The display of \"stuffed pantyhose\"--come on it's ridiculous.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Nice little museum at a great location", "This is not a big museum, but always have good exhibits. The recent Monet, then Degas exhibits are amazing. The museum is located in a beautiful area. it looks onto the Golden Gate Bridge and the Bay -- absolutely fantastic if you are here on a sunny day! Do a little hike around, I am sure you will enjoy it.\nShow less"], ["Reviewed July 26, 2017", 4.0, "Seeing places", "Nice and open environment for a huge conference hall. Well maintained and had good amount of flowers photogenic."], ["Reviewed July 24, 2017", 5.0, "Very Chic Cafe and Reasonable Prices", "We visited the cafe at The Legion of Honour Cafe as a group of 6.\n\nThe service system involves ordering from their extensive menu at the counter and pre- paying; there is a second station for drinks and alcohol - we shared a bottle of the Haut Marin Cuvee Marine 2015 Cotes de Gascogne....gentle white.\n\nMy friends had proscutto and gruyere cheese melt, soup de jour and mine was a herb crusted chicken with tasty salad dressing on a homemade burger bun....Yum.\n\nPrices were very reasonable - all in a delightful casual atmosphere; there was an outdoor patio dining option. I could recommend to couples, groups and for special meetings.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Terrific place - art, building, location all great", "A stunning building, terrific collection, and a beautiful location make for a wonderful museum. Consider public transportation because parking can be difficult. There is a bus stop literally at the front door. If you end up in overflow parking there is a bit of a hill to climb. Scupture is a strength of this museum compared to similar museums. You can actually see the top of the Golden Gate Bridge from the parking lot. When you are done in the museum, there are nice walks around the museum. You can get to the tip of the peninsula if you go north.\nShow less"], ["Reviewed July 20, 2017", 4.0, "A fascinating Degas show through October 2017", "The show is about Degas in the Millinery Shops of Paris we're world famous, making hats that were a different kind of art.\n\nDegas painted many of the women who designed the hats and oversaw their making from the time shortly after the 1870 Franco-Prussian War through the end of the century.\n\nThe show links Degas early in to the trade - the hats, the women and the art created in these small shops. Others of the milieu recognized a new subject for the impressionist.\n\nSo the shooting e goes from Degas to the other artists, the spectacular hats and even into the new Parisian life that was erupting.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Wonderful Degas exhibit", "We travel from Idaho to see the Degas exhibit with an old friend. Wonderful exhibit marred only by the break-in of our rental car during the two hours we were at the museum. We were less than a 100 yards from the museum, parked in the overlook lot, in broad daylight. there was no security at the lot, less interest than you could imagine from the security staff at the museum, and little or no response from passing police officers who simply passed us off to a phone report taker. signs of at least a dozen past car break ins littered the ground, so this was not a new happening. The museum simply acted like well thats what happens her in San Francisco,like that made it all better. Pass on this until security is improved\nShow less"], ["Reviewed July 12, 2017", 5.0, "Worth the Trip from the City", "The Musee is a bit out from the Union Square area but has good bus transport. Beautiful setting and an excellent original exhibits, Best visited with special exhibits."], ["Reviewed July 12, 2017", 3.0, "Beware if you're a Rodin fan...", "They're installing the new Sarah Lucas exhibit, and most of the galleries with Rodin sculptures are closed! Big disappointment- we went to see Rodin. You can still see the thinker, but that's all. They should have it done by July 14, so just call before you go. Also, many people may be challenged by the new exhibit- what we could see over the barriers had many teens snickering, to say the least. Read before you go. We were glad for the dual admission to the de Young and went to both.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Memorable", "For anyone appreciating an art or architecture, the Legion of Honor is a place to be. Magnificent Beaux-Art building perfectly located in Lincoln Park charms you from first sight. I would recommend seeing this gorgeous museum from April to October. Enjoy it!"], ["Reviewed July 11, 2017", 5.0, "A true hidden gem for lovers of Ipresionism", "This relatively small museum contains many outstanding works of art. It sits a top a hill overlooking the Bay. For those who are fit, there is a magnificent hiking trail called Land's End that leads to the museum. There also is a Holocaust Memorial across from the museum. For those driving, there is a terrific view overlooking the city across the street from the museum. This is a favorite of San Francisco natives.\nShow less"], ["Reviewed July 10, 2017", 4.0, "First Rate Collection in a Picturesque Location", "Really liked the collection from the dutch masters to the Rodin. A kind of collection of a little bit of everything, not a great deal of any one artist. A kind of collection with no large amount of any one great artist or type but some of all periods and artists. The building is located on a hill with a great view. I liked the view very much.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Legion of Honor museum", "This is a very special museum. Clean, bright, good spacing, several different rooms to visit. Nice restaurant downstairs to relax."], ["Reviewed July 10, 2017", 4.0, "Great place to visit every time", "I love coming here even if it not for a special exhibit. This museum is beautiful, inviting, peaceful. As any beautiful art form, it takes you away from your daily routine and creates an entirely new experience."], ["Reviewed July 8, 2017", 5.0, "Amazing place to take pictures - - indescribable, in words!", "If you're into architecture at all, this is a fascinating place. And it's got all kinds of wonderful places to take photographs, experimenting with light and angle, POV and mood... Wonderful."], ["Reviewed July 7, 2017", 5.0, "Top Rate Museum", "I've visited museums all over the world and this one is in my top 5 as favorites. The collections are phenomenal. Our docent was one of the best and most informative I've ever had. Docents here have to go through a masters training yet work for free; very passionate about what they do. Ask for the docent tour schedule when you arrive. Do take time out for a walk outside for the spectacular bay views. Locals walk this area daily as it is simply beautiful. I loved this museum!\nShow less"], ["Reviewed July 2, 2017", 5.0, "Loved", "My first visit here and we thoroughly enjoyed it! The current Degas exhibit was incredible! Truly breathtaking."], ["Reviewed July 2, 2017", 4.0, "Beautiful monument", "Worth a trek up here, fabulous views and gorgeous houses to see en route, the gallery has some nice art / sculptures."], ["Reviewed July 1, 2017", 5.0, "Cuffs and Collars: Can you recognize the site?", "Many of the old masters were reknown for their ability to paint material, cloth, silk, brocade, and metals or jewels with painstaking attention to detail. This collection shows the amazing ability of some of these masters."], ["Reviewed June 30, 2017", 5.0, "Well worth a visit but pricey", "An excellent museum and certainly worth a visit but overpriced--both the exhibition ticket and the cafe food. Plenty of the masters to go around and interesting pieces from every era and most regions. The European masters were well represented with an excellent exhibition of Degas, Impressionism, and the Millinery trade. Not sure if I liked the Urs Fischer exhibit, especially having it interspersed with the main collection, but it did make me ponder the modern art as I walked through the rooms.\nShow less"], ["Reviewed June 29, 2017", 4.0, "Neat exhibit near Lands End", "This attraction is worth visiting if you are in the area or interested in military history. It is near Lands End."], ["Reviewed June 28, 2017", 4.0, "A Hidden Gem", "Not very large, but has a nice collection of art work. No comparison to NY MMA or Chicago's Art Institute. Located on top of a hill, from there you can have a stunning view of Golden Gate Bridge. Well worth a visit."], ["Reviewed June 25, 2017", 5.0, "Beware of thieves!!!!", "The museum is fantastic but DO NOT leave valuables in your car. Ours was broken into and we lost all our high tech gear when we were on the way to the airport. Apparently 24 rental cars a day are broken into in San Francisco.\nWonderful collection of Rodin sculptures and furniture. Try the Docent tours - ours was excellent. Lunch can be eaten inside or outside and was excellent with a reasonable choice of mains for roughly 17 dollars.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Must see in SF", "If you go to only 1 museum in SF, it should be this one. Not only is it stunning outside, it has great exhibits inside"], ["Reviewed June 24, 2017", 5.0, "Exhibits interestingly displayed", "First of all, the location (Lands End) is stunning. There are 2 noteworthy monuments just outside the Legion of Honor that should also be visited.....the Holocaust Memorial and the Japanese Kanrin Maru monument.\n\nThe Urs Fischer pieces throughout the museum put a smile on my face. They stand out amongst the European masters in which they are placed. I appreciate the curator's point of view.\n\nParking is available, although it can be difficult.\n\nThe cafe is a good option, but prepare for $20 lunch offerings.\n\nShow less"], ["Reviewed June 24, 2017", 5.0, "Interesting exhibits in a wonderful museum in a breathtaking setting", "This is a nice museum that is somewhat off the beaten path. The exhibits are varied and interesting, and the view outside is amazing. The museum is near some trials along the water and would make a good destination to spend a day or part of a day.\nShow less"], ["Reviewed June 22, 2017", 5.0, "Great setting, user friendly, very enjoyable exhibit mixing modern art with classical", "We did not know what to expect but were pleasantly surprised: 1) first Tuesday of month is free; 2) an interesting collection combining modern art and classical art in same room."], ["Reviewed June 21, 2017", 2.0, "Pleasure", "Museum has a decent collection and is located in a beautiful park like setting. DO NOT let this fool you. Our car was broken into and robbed. Apparently this happens regularly here at this museum and in San Francisco in general. In fact, the museum staff was unconcerned and basically rude. It took the overworked police 31/2 hours to show up. We rented a car and the rental agency told me this happens constantly in San Francisco-wake up San Francisco and hire some more Police officers to take care of you crime problem! Also, Legion of Honor Museum-hire an armed security guard for your parking area.\nShow less"], ["Reviewed June 17, 2017", 5.0, "Awesome Art Museum and Memorial", "What a great facility. Impressive sculptures, Rodin exhibit wonderful, art impressive. Great views of the Golden Gate Bridge as well. Highly recommend."], ["Reviewed June 8, 2017", 5.0, "Organ concert on a weekend at 4", "Visited on a sunny Saturday and enjoyed a slow walk up the hill from the bus stop. On the outside there is the Holocaust Memorial to visit and Rodin's 'The Thinker'. Only a short queue to get tickets ($15 - but that also gives admission to de Young on the same day). Plenty of artwork to see and, at 4.00pm on Sat & Sun there is a free organ concert on the Skinner Organ by international organists.\nThe concert was slightly spoilt by the other visitors talking loudly throughout the performance.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Trippy!", "The Legion now has stroppy combination of classic Rodin bronzes and modern sculpture face to face. The building itself is a classic, with panoramic views of San Francisco and the Golden Gate."], ["Reviewed June 5, 2017", 5.0, "excellent way to spend part of your day", "This museum participates in BofA's first full weekend of the month free admission promotion. Normally $15 for adults. It has an excellent collection of European Art, and had fun at the Mummies and Medicine exhibition. I really like the Rodin and other sculptures as well. There's a small ancient art area that was fun as well. We had a small bite at their cafe, which on a nice day is probably nice to sit outside.\nShow less"], ["Reviewed June 3, 2017", 4.0, "Beautiful Acritechutre", "The architecture is beautiful and it is a great piece of history. The only down side is that there is not a lot else in the area. It is a nice to see but not a must."], ["Reviewed June 2, 2017", 4.0, "Beautiful location and museum from outside", "Drove here on a Sat afternoon. Amazing view. Beautiful museum. However. Other than parking temporarily and checking it out. Couldn't go inside because it was impossible to find parking."], ["Reviewed June 2, 2017", 5.0, "Beautiful Walk & Beautiful Museum", "The Legion of Honor is an excellent art museum by any standards, but having been in dozens of the best art museums in the world, the collection itself, although quite nice, is not what impressed me most. It is located in a beautiful area called Lincoln Park and my wife and I also walked through Golden Gate Park to get there. Walking home we took a trail along the Pacific coast and stopped by the 19th century ruins of the Sutro Baths. The objective of that day's adventure in San Francisco was to see the artwork, but the natural beauty that we encountered coming and going made it a particularly exceptional day. I had been to the DeYoung Art Museum on a previous visit to the city. If I were to be given a choice of which museum to visit, I'd choose the Legion of Honor for its generally older artwork (although mixed in with contemporary art) over the more modern DeYoung, but both are worthwhile. Both buildings are quite interesting architecturally as well, and in entirely different ways.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Just right sized, nice location and good cafe. Tourist can get there by bus!", "This was a revisit and again we travelled on our Muni Pass which meant a reduced entry fee after a short pleasant walk up the hill. There are just enough rooms and exhibits to make for an interesting but not overwhelming visit and then there was the excellent chowder and quiche in the cafe. Note that if there is a special exhibition on then the cafe gets very popular and there can be a queue. The chef actually came out and asked how was the food, proudly announcing \"I made them fresh today\" when we were fulsome with our compliments. If it is a nice day you should do as we did and roam through the headland for the views.\nShow less"], ["Reviewed May 31, 2017", 4.0, "Richmond District Gem", "Getting to the Legion of Honor might be a little difficult but the architecture of the building and artwork within is well worth the trouble. I love the changing exhibitions that range between fine arts and textile fashion art. The location and building are part of the beautiful art display.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Wonderful Fine Arts Musuem", "I went to this museum to see the Monet Early Years exhibition and Rodin. I was thoroughly satisfied. I am a member so it made entry free and easy. The musuem is just large enough to see a good selection, but also small enough it does not take all day. It has wonderful views of the city and Golden Gate Bridge. I took bus 38 on Geary St Union Square then walked from 33rd Street.\nShow less"], ["Reviewed May 30, 2017", 5.0, "A Nice Fast Visit", "This is definitely worth stopping to see, its beautiful. However, its very very busy, and you may need to park very far away to see it."], ["Reviewed May 30, 2017", 4.0, "Out of the Way Gem", "The Legion of Honor is set high on a ridge in the northeast section of San Francisco. It is truly a destination and not something you just walk by on a city street. The museum building is modeled after the Legion of Honor in France and houses excellent exhibits of its collection - including great Rodin sculptures - as well as special exhibits. We visited the exhibit of Monet: the Early Years, which drew paintings from museums all over the world. It was interesting only in that it showed what he did before he did his grand paintings of water lillies, etc. We made the mistake of going on a Saturday - big crowds. They try to manage the crowds with timed entrances, but standing two or three deep is not the way to view great art. Next time, I will visit this out of the way gem on a weekday.\nShow less"], ["Reviewed May 29, 2017", 4.0, "Monet Special Exhibit", "While I was greatly impressed with the Monet collection, and was very happy to see\nhis \"early works,\" I was not impressed with the staff and their handling of the\ncrowds. I came away with the definite feeling that the deYoung Museum is\nmuch better able to handle exhibits by famous artists, with the accompanying\nlarge turnout. I was told that I was \"lucky\" to be able to get into the exhibit,\nbut lucky was not how I felt. I have a membership to both of the Fine Arts\nmuseums, and have always enjoyed visiting the deYoung. However, the\nstaff at the Legion of Honor seemed to have little knowledge of something\ncalled \"customer satisfaction.\" I was not the only one to feel that way.\nAnother woman who was waiting to get into the exhibit while I was, told\nme (in relation to the audio guides, which required \"cash\" only), that she\nhad been dropped off by a family member, and did not have any cash.\nSubsequently, she had to call the family member, and request that he\nreturn to the art museum. In the meantime, a staff member had told her\nthat she could, after all, use a credit card.\nThis exhibit was the Legion's chance to attract many new members, but\nI hope that if another \"famous\" artist is invited to the Legion, the staff will\nfind ways to be more polite and more welcoming.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Excellent art musuem", "Easy to get to by the #18 bus. Went to see their Impressionist collection. Wasn't disappointed. Good collection of Rodin sculptures. Worth a visit if you like art."], ["Reviewed May 27, 2017", 4.0, "Monet makes the world go round", "We went to see the Early Monet exhibition but there was so much more. The 17th and 18th century art were a joy and the Rodin sculptures exquisite. The whole experience, from the well-kept grounds to the beautiful setting in such a wonderful building was an exhilarating escapade.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Timeless Jewel in San Francisco's Crown", "This is a beauty inside and out, and one of those rare treasures you might expect to find only in the grand centers of Europe. The gorgeous historic building itself merits a visit. And then there are the gorgeous exhibits inside. On our last visit, among other things, we delighted in the recreated sumptuous 18th century salons. It may be the closest many will ever get to the beauties of that gilded age. But then after all the wonders inside, there are the spectacular views of the bay, the bridge, the woods and flowers. There are few places as inspiring and refreshing. Parking is at a premium, though, so even persons with handicapped parking placards may be hard pressed to find parking close to the entrance.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Classic!!!", "It is not the Louvre. But it has so much to offer. The highlighted artwork change through the seasons."], ["Reviewed May 18, 2017", 4.0, "Great Art Museum. Has a good collection of scuptures by Rodan. Good view of Golden Gate too.", "Love to see the new collections they have. Great old paintings by famous artist on display all the time."], ["Reviewed May 17, 2017", 5.0, "Monet exhibit is not to be missed", "The Legion of Honor's current Monet exhibit is not to be missed. Two years in the making, the exhibit includes more than 50 of Monet's early paintings, a few of which have only been exhibited two or three times in the last 100 years. Worth a journey.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Beautiful location though a ride from downtown SF", "Gorgeous building furnished like a palace in lovely parklike setting. Great cafe with unusual food choices. ."], ["Reviewed May 16, 2017", 4.0, "We visited the Monet, the Early Years exhibit. Very nice", "The Legion of Honor is located in Lincoln Park, with a great view of the Golden Gate Bridge. We only saw the special Monet exhibit, which is about to leave, but the rest of the Museum is worth a visit as well."], ["Reviewed May 14, 2017", 5.0, "Wonderful Monet exhibit", "The Monet early years exhibit was well put together and beautiful. Well maintained and interesting building for art."], ["Reviewed May 12, 2017", 5.0, "ART! WONDERFULL ART!", "I had an amazing time at the Legion. I was lucky to see the early works of Monet as well as other amazing artists. I wish I had more than 3 hours as the collection is vast. The food in the cafe was superb and the gift shop had a good selection was reasonable. Good security, pleasant lighting helped show off fine details of their exquisite collection.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Monet is Worth the Trip", "The museum is having an early Monet exhibit. This is before impressionism become famous. I love the organization of the exhibit, following different cities he lived: le Harve, Paris, London, and Agentuille. You can see his transition from traditional landcape paintings to impressionism. But the special exhibit can be crowded even for a Wednesday.\n\nThe rest of the museum is a pleasure to browse. It is not as overwhelming as big museums, but has more Monet, Seurat, and Gaillibot, el Greco. Much less people.\n\nI do not understand why the city chose to build the museum at the edge of the city, and you have to go through a lot of trouble to reach there. it can be more popular if not so isolated.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Classic Gallery", "The building and the grounds are art in themselves. The views are wonderful extras. We came to see the Monet early years. It is a grand showing of his work and set in a classic gallery. If you live close enough to the city it's wise to become a member and get tickets for the de Young as well.\nShow less"], ["Reviewed May 11, 2017", 5.0, "great location and current exhibit of monet, early years was very good", "location is perfect, was a sunny and warm day. Restaurant in museum has very nice food and a great outdoor terrace. Current exhibit of Monet's early work was unique- not a water lily in sight and some fine works."], ["Reviewed May 10, 2017", 5.0, "Fun day.", "Went for Monet the early years but stayed for the Rodin. Enjoyed the special exhibit immensely. Stayed after to see the Rodins. Easy to get around and see the collections. Also liked the restaurant for lunch. A little pricey but good food. Will definitely go back.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Inspiring! Great Restaurant worth extending the Visit!", "This turned into an unplanned all day adventure! The spot is fabulous. Get there early for parking! Monet, The Early Years exhibit is a must-see! The China room is delightful. I loved the layout of the Museum presentation of art that took you through the periods of history. It became a delightful experience. The distinctly Modern instillation juxtaposed in with the Master's works was charming and witty!\nThe restaurant here was one of the best lunch stops in the city! My soup was so good that I must get the recipe! And the chocolate cake was perfect for sharing. The setting is perfect also! A great day in the city!\nShow less"], ["Reviewed May 3, 2017", 3.0, "Classical and Moving", "Imposing building with Art gallery with expensive admission. The courtyard had a great installation when i visited."], ["Reviewed April 30, 2017", 5.0, "Beautiful, historic building with amazing art", "Both the building and the art, are amazing. Truly a step back to a more beautiful time. Alone time to really stroll slowly and enjoy all the ambiance."], ["Reviewed April 30, 2017", 5.0, "Marvelous and magestic!", "In a city of many notable museums, this is our favorite. It's an architecturally classic museum-one French inspired-with both marvelous permanent exhibits and special exhibits. And, if you're a fan of Rodin, California's Palace of Legion of Honor is a must see on your itinerary.\n\nIt's out of the way Lands End setting, at the western edge of the City by the Bay is incomparable-and, simply breathtaking!\n\nAlso, for those interested in history, this museum's history is a rather interesting one, which includes, Alma de Bretteville Spreckels (think Spreckels Sugar), Queen Marie of Romania, the Fairy of Light dancer \"La Loie \" and more.\nShow less"], ["Reviewed April 29, 2017", 4.0, "Wish it was sunny the day I visited!", "I went with a friend to see the Monet exhibit, which was very good. I hadn't been to the Legion of Honor in many years. It was a wet and dreary day, so outside was not so great!\n\nThe Legion of Honor is a great place to visit though and I enjoyed the permanent collection, as well. I had been to Rodin's museum in Paris a few months back, and really appreciated the Legion's display of his works much better than in Paris!\n\nBut if possible, go on a sunny day. I know. Good luck with that!\nShow less"], ["Reviewed April 28, 2017", 3.0, "Big Disappointment", "The day we went there, most of the exhibits were cordoned off. We were sold our tickets without being informed that we can not see nearly half of the art pieces in the museum."], ["Reviewed April 28, 2017", 5.0, "Fine arts gift from Alma Spreckles to San Francisco", "In addition to being located in the very charming Lincoln Park corner of San Francisco, the building is a full-scale replica, by George Applegarth and H. Guillaume, of the French Pavilion at the 1915 Panama–Pacific International Exposition; which in turn, was a three-quarter-scale version of the Palais de la Légion d'Honneur also known as the Hôtel de Salm in Paris, by Pierre Rousseau in 1782. Today it's part of the Fine Arts Museum of SF. We were able to walk in and buy tickets for the Monet: The Early Years exhibit at the De Young, which was tremendous. Afterwards, we viewed the collection of Rodin sculptures which Mrs. Spreckles had collected in her lifetime. The setting is tremendous and the views of the Golden Gate Bridge from the grounds is amazing. The Palace of the Legion of Honor was the western terminus of the Lincoln Highway, the first improved road for automobiles across the U.S., which originated in Times Square, New York! Be sure to find the gorgeous Lincoln Park steps at the corner of California Street at Outer Richmond. The 52-step path looks as though someone rolled a colorful tile rug down its jagged slope! We walked from Nob Hill (about 10 miles R/T), but public busses run all the way to the Legion of Honor, down California. You can also save money on admission to the art exhibits, from destinationcoupons.com, savvycalifornia.com etc.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Beautiful Museum!", "It's not a large museum, but it is well curated and beautiful. The Monet exhibit was a treat. Coupled with the deYoung it makes for a nice rainy day activity, which is how we spent a recent Sunday in San Francisco!"], ["Reviewed April 26, 2017", 5.0, "Rodin Sculpture Collection", "Alma Spreckels collected many Rodin bronze sculptures in the early part of the 20th Century and donated them to the City of San Francisco Fine Arts Museums. The \"Thinker\" is located in the courtyard entrance, with many more inside. Totally worth a visit for an unforgettable afternoon of Rodin! There is also a cafe on the museum's lower level....perfect for taking a pause!\nShow less"], ["Reviewed April 25, 2017", 4.0, "Very good museum, a bit of Europe in San Francisco", "We visited for the Legion of Honour Claude Monet special exhibition. The Legion of Honour is one of our favourite Bay Area art museums; when we miss the art museums in Europe, this museum gives us a taste, however briefly. The audio guides could be more informative. The cafe provides a peaceful respite and serves wine. If you visit this museum more than once, it is worth getting an annual membership (dual with De Young), and helps to support the arts. Go early to avoid crowds and tour groups.\nShow less"]]}}