{"LEGOLAND California": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "LEGOLAND California", "url": "/Attraction_Review-g32171-d103404-Reviews-LEGOLAND_California-Carlsbad_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/18/d7/cb/legoland-california.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "6475"}, "address": {"@type": "PostalAddress", "streetAddress": "1 Legoland Drive", "addressLocality": "Carlsbad", "addressRegion": "California", "postalCode": "92008-4610", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Great Theme Park!", "Very LEGO-oriented! Every 'sculpture' is very detailed. The park itself is great for kids under 8. For us adults, the dining options offered both park food and healthy, good food! Overall, a great experience! No lines on a Thursday in January!"], ["Reviewed 3 days ago", 2.0, "Possibly the worst theme park ever", "As a family we really love Lego. We spend time building together, watching the movies, and it really is bonding time for us. Our son desperately wanted to visit Legoland and since we would be in the area we decided to make the trip. Firstly, adults cost more. I will never understand this reasoning when the park is geared toward children, most of whom can’t do much in the park without supervision. Then there’s the outrageous cost of food and you get very little of it. There’s also carnival type “try your chance to win the prize” that every adult knows is set up so you can’t win, but your child begs to do. So there’s $20 for a lot of nothing. Aquarium and water park also cost extra than the park ticket.Lastly, the place is utterly neglected maintenance wise. Just horrible, it was honestly depressing. I’ve been to Disney many times in my life and have never seen this level of poor upkeep at their parks, and I don’t know why, but I expected the same from Legoland. We should have gone to Disney really. I’m aware Lego outsourced these parks to another company and I think they’re doing the brand a huge disservice. A total rip off.\nShow less"], ["Reviewed 3 days ago", 3.0, "Definitely fun for the kiddos.", "I have to be honest, for me this place was just meh. I did like the food and they have excellent coffee. I will say I am basing this review from my daughter's perspective. She loved it! She is four years old and was able to go on her first roller coaster. There are so many rides for kids her size that are more than just your kiddie rides so I appreciated that. She loved it! I would say this is not a place to go with your teens, this is a place for lego enthusiasts and little kids. Would I go back? Maybe at least one more time. The parking is ridiculously expensive. I was pretty irked about that for sure. Half of the park looks pretty cool and the other half looks kind of run down. It's no Disneyland, that's for sure, but I recommend it. It's worth going at least once.\nShow less"], ["Reviewed 5 days ago", 4.0, "Happy Birthday", "We took my 7 year old daughter to Legoland for her birthday. Her dream was to go to Legoland. Last week was a holiday so it was not too crowded. We covered the park top to bottom. The water park and some rides and attractions were closed. My daughter loves Aquariums. This one was impressive. She got the chance to see the Lego Friends live and dance with her favorite...\n\nAll in all the food options were pretty good. Prices vary . Lots of rides and things to do. My daughter loved her day!\nShow less"], ["Reviewed 5 days ago", 1.0, "Disappointing", "This was incredibly disappointing with our son who is 10. The rides are for much younger ages and although the Lego buildings are exceptional it was not what we expected. Do not recommend for children older then 8\nShow less"], ["Reviewed 1 week ago", 3.0, "Cute and fun for young kids", "Bring your own food, food here is overpriced and not so good. Go during the week to ride everything in one day, crowds are low."], ["Reviewed 1 week ago", 5.0, "Legoland is awesome🎶", "Legoland is the best!!! Our children absolutely loved our trip there! They were so engaged and busy the entire day! There is something for them to do at every turn. Kid friendly rides, play places, and tubs of Lego's to play with all over the entire park!\nShow less"], ["Reviewed 1 week ago", 2.0, "LEGOLAND California 1 Legoland Drive, Carlsbad, CA 92008", "The park needs some work. The LEGO exhibits looked old and faded except for the STAR WARS displays. The park hours are shortened in the off season but some of the rides opened later after the park was open for a few hours. And some of the displays and rides closed early before the park closed. Not worth the price of admission.\nShow less"], ["Reviewed 1 week ago", 5.0, "Weekend Trip", "Kids had the best time. My 4 year old didn't want to leave the hotel because he loved his Ninjago room that much. Every single employee was friendly and made it fun for the kids. Great time."], ["Reviewed 1 week ago", 4.0, "Fun place for the Lego lover", "This place is great for a Lego lover. My 9 year old is on the cusp of falling out of love, but still had a good time. The lines, although shirt in physical length, do not move and take a long time to progress. And there's nothing to entertain you as you wait in line. Where as the opposite is true in Disney. Long lines in length, but they keep moving so it feels like you keep progressing and they always keep you entertained in line.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun theme park", "It is very suitable theme park for young children. There is lots of different sites to explore for rides and stations. Parking cost $20, food is pricey a hot dog is $5.50. Lines are extremely long on weekends. You could buy fast pass if you are willing to spend. It is ideal to combine the visit to sealife aquarium. Good to find a hotel nearby to visit the second day.\nShow less"], ["Reviewed 1 week ago", 3.0, "Many rides closed, lego looks faded and old", "We knew this wasn't for teenagers but ours like it. This trip was not as good due to their new app giving unreliable wait times for rides and many things being closed or malfunctioning. The lego structures looked run down and several things were malfunctioning. They do have some good food options in the fun zone market but for about $20/meal (kids hotdog kit for $9). New castle hotel opens soon. Really recommend skipping it unless your kids are 3-8 years old. $20 to park....,don't see much of a benefit to paying $30 as it's maybe a block closer. This park is closed midweek off season.\nShow less"], ["Reviewed 1 week ago", 3.0, "Vacation", "Well Feb. 5, when we visit Lego Land. Entrance Fee is not worth because most of the rides are under maintenance the waterpark is closed and some rides are not open. These are mostly for kids. Plus staff are displaying that even them are bored with what they are doing. The sales lady in the souvenir shop is so mean. Other rides are open but not that exciting. Really these place was just for kids alone. Place is far and closes early..\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Fun for younger kids", "This is a fun park, but really geared for younger guests (under 10). The ride attendants did not seem to be trained very well, and the lines got pretty long. Many times you would be waiting in line watching empty rides going by as the attendants wouldn't fill the ride to capacity. We did have a great time, and enjoyed looking at the lego displays. The food was reasonably priced and very good.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "", "First time here...took my under 2 year old and 12 year old niece along with grandparents. Not much for someone under two to enjoy. Most rides and attractions have height limits. There are a couple of rides and attractions but not many. Terrain is up and down. Not quite hilly but not all flat either so may be difficult for the elderly.\nLego displays are impressive. Especially the Star Wars- hubby enjoyed this part the most.\nWent when there was a promotion to come back, so if there is, make sure you stop by the kiosks to pick up your bonus ticket.\n\nFor the price, I was disappointed. It’s almost the same cost of Disney. Less people for sure but some lines just as long as if they had poor planning. One ride in Duplo area for my little one. Waited 45 min as the train held an average of 8 per cycle.\n\n***hint: i didn’t realize until it was too late - there was a promotion in the beginning of December at Costco for an annual pass for less than the price of admission so look out for that!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Day!", "Thank you Legoland for the smiles and warm greetings. We were able to trade 4 minifigures from Sea Life Aquarium to the Friends Land and the Ninjago Ride. The Pasta & Pizza buffet was just what my 6-year old needed, 4 slices and chocolate milk hit the spot after all those rides! The parking ticket employee was helpful with my questions despite the long line behind me. Thank you for making it a great day!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Theme park was great, customer service was even better!", "My wife and I planned a trip for our family, 2 kids, 1.5 and 4 years old. We were there from Jan 28- Feb 1 and my kids had an amazing time, the park was slow so they were able to go on all the rides their hearts desired with little to no wait times. The included buffet breakfast was a huge plus for us. We really appreciated not feeling like we would be nickeled and dimed for every little thing. Upon check in we had requested a Ninjago themed room for my daughter who is really into the show but it was not available on our first night there but, Ghadir who was helping us helped us get into a Ninjago room for the last 3 nights of our stay. She was amazingly helpful and friendly as well as the rest of the staff in the hotel and theme park. We have already recommended LEGOLAND as the theme park of choice over other California theme parks because of the hospitality we received. Thank you so much\nShow less"], ["Reviewed 2 weeks ago", 5.0, "An excellent attraction made even better with Renate.", "My mother and I co-own Bricks 4 kidz Santa Clarita and we travel to Legoland one to three times per month. We have made so many wonderful memories there made even more memorable by Renate. We visit her area in Fun town each time just to say hello. It is very evident to us that she has a kind and generous heart and a passion for lego that rubs off on everyone around her. A visit with her literally makes our day!\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Young children or lego enthusiasts", "Disappointed, but worth seeing if in the area with small children. The small children will enjoy the games and can ride most of the rides. The kids will have plenty to see and do. They will be tired too if your lucky. The rides were not great, but sufficient. The wait times degrade my experience. Some rides with a 45 plus minute wait. You can get a reservation pass and how much you want to pay determines your wait. Up to $100 per person and you skip most of the waits. This would be well worth it if you are short on time and there is a crowd. I will say the food options here are better than some big name theme parks. Overall, don't regret stopping. Won't come again, and would not recommend going out of your way to see it unless you are a lego enthusiasts.\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Overrated Expensive Carnival", "We went to Legoland California on Monday Feb 5th, 2018. If you sign up for one day passes ahead of time it allows you to purchase a second day for an additional $3.00 per person of which we did. Our total costs for 2 adults and a 7 year old child amounted to $408 Canadian dollars which we found to be very expensive. We never did go back for the second day and it is hard to do everything and the aquarium in one day.\n\nWe found that Legoland was a very poor value, as 1/3 to ½ of the park/rides were closed. The water park areas close until March, and a new ride coming in for summer closed another section of the park, and several other rides were also closed for maintenance.\n\nThe only good thing was that the park was not busy at all and lines were no more than 10-12 minutes with many walk up and get on. Do not waste your money paying for the Reserve N Ride not even for the 25% increase in time as most of these quicker lines were closed as there were so few lines.\n\nFood was expensive like you would expect, and most carnival games were ones that are very difficult to win. We found the place to be an overrated cheap corner store carnival that was very expensive. No need to pay for the VIP parking as the regular parking gets you almost in the same space.\n\nWe also pre-purchased the $25 photos which was also not a good value.\nThere are many other choices to go to in the San Diego area, and I would recommend choosing them over Legoland. We will not be back.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A fun place for all ages", "We spent one and a half days at LEGOLAND with our son, daughter-in-law and two grandchildren ages 6 and 8. We all thoroughly enjoyed it even though the water park was shut down for winter."], ["Reviewed 2 weeks ago", 3.0, "Potential but disappointed", "Was just me & my 2 girls (2 and 5). Heard how great it was until I realized we couldn't get on most of the rides because my 5 yr old wasn't over 48\" to go alone, and my 2 year old was too small. So my poor 5 yr old for her 5TH BIRTHDAY, was stuck going on mostly baby rides. They offered to leave 1 kid at the play rides but...ya right. Then I paid for the $25 photo wristband excited that for once, being a single mom there, I wouldn't have to juggle my camera all day & I'd actually be IN the pictures!! But the only photo locations were on most the rides we couldn't get on! I assumed there'd be awesome photo spots throughout the park but no, only on the rides except the 1 guy at the park entrance. So out of the approx. 10 photo locations, me & my 2 girls could only take advantage of 4 of them. And here I am 2 days later STILL waiting for those 4 photos to load in my library. Only have 1 and they said I should only have to wait 24hrs to receive them all. It's been more than than. I've emailed them twice now wanting my 4 photos or a refund. They should tell single parents with 2 young kids going into the park they might not get full advantage of this photo wristband.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fantastic place to visit on the off season!", "We had a great time at Legoland, particularly our 7 year old son, who had wanted to go for ages! I’m glad we went in the off season as I can imagine the lines are long in the busy times. I enquired about a VIP package but they were extremely expensive and turned out unnecessary as the park was not that full. Our son’s favourite ride was the cars he got to drive around in. He went on them ten times, something he could only do because of small to zero queues. The food was not nice, but we struggled with American food our whole trip. A steak sandwich came with kettle chips which we thought was odd. Great to be able to pick any purchases up at the exit before you leave so you don’t have to lug them around with you.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great displays, average rides", "We started the day off going on most of the rides, and they were ok, but nothing spectacular. Our kids enjoyed the actual ride, but the queues seemed to take forever, and it wasn't even THAT busy of a day.\n\nThere was also a distinct lack of shade in the lines at some rides, including the one with the longest line at the Technic Coaster.\n\nThe displays of Lego were the best part, and lots of photo ops, especially the min cities and Star Wars area. These displays helped it elevate from a 3 star review, based on just the rides to a 4.\n\nWe all loved the apple fries- don't forget them.\n\nI wouldn't say give it a miss, but don't expect too much when you go. The rides especially, are based for the younger kids, our 11 year old found them a bit lame. They did find the displays cool though.\n\nIf you are doing all of the rides, you will need all day, especially if its even mildly busy.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Lego Dirty", "LegoLand was cool but wish they had the time to clean it, a lot of the Lego characters where dirty full of bird droppings.\nPay more attention to detail, some characters had limbs missing.. it was just not well presentable...\nBut the kid loved it, i guess that’s all that matters\nShow less"], ["Reviewed 3 weeks ago", 4.0, "good vacation spot for 3-10 year olds", "we visited legoland for the first time in february. the weather was perfect (55-70) so that likely helped a lot. all of our children saw things in the park that they were familiar with, so all had fun. the app is great; it estimates wait times and gives good directions on height and age requirements. in the morning, only minimal rides are open early for hotel guests and some were also closed, perhaps for the off season. line wait times were fair and the staff was very pleasant. we will return in the future!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "4th Birthday", "We had a great time for our daughter’s 4th Birthday. We had 20 friends and family helping us celebrate. I ordered a cake from the resort and we celebrated! We wish the hours were longer to enjoy it a little longer. Overall a great experience!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Needs improvement", "We went to LEGOLAND in California because we went to the original LEGOLAND in Denmark last year.\nCalifornia was so/so ... there were a lot of themes that could be \"completed\" ... for example, there was Cinderella in legos, but no rats or birds or furry friends. In the original LEGOLAND, all of the displays would have been completed in legos.\n\nOn an upside, the food was good.\nWe had pizza at the outdoor grill.\n\nIt would be a fun half-day stop for families with children.\nThey have many activities and games that kids would enjoy!!\n\nWe just thought (as adults) ... there could have been more upkeep and more lego displays.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "MarBrisa Resort", "Fantastic place to stay and a hop skip jump into Legoland, so quaint and kids enjoyed it. For all ages! Lego park is quiet and not overcrowded like Disney.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Enjoyed by young and old", "Our two yr old grandson was captivated for hours. Whether he was playing with the Legos or watching the animation in the cities in Miniland USA. (We spent hours in that area because he was having a blast.)\nThere is a lot of fun to experience at Legoland.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun for younger kids", "We’ve gone to Legoland as a family a few times. It is a lot of fun and has a variety of things to do. A few things I wish they would improve on are - 1) cleanliness of the park. It’s not bad, but it’s definitely not Disney. 2) I wish they would keep up attractions better, especially the ones outside in better shape. I.e. - Dust, wash down, restore color, etc. 3) it would be nice to have a little more time, even an hour or two. I know when you go during winter hours, you would expect less staff and such, but it’s hard to do a lot in 7 hours. In general though, it’s a good time and fun with the family. Leave early if your by Disney, lots of traffic always.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Check out the Aquarium!", "The kids love the touch pool and the staff is really knowledgeable about the creatures. Also, if you time it right, you can catch the dive show. It's cool to see the divers feeding sea creatures and cleaning the lego displays underwater."], ["Reviewed 4 weeks ago", 4.0, "Interactive Fun for Young Kids", "We all really enjoyed LEGOLAND! The rides and interactivity were a great experience for my 4 year old. The food options were good also. Only negative was the carnival type games that distracted from the Lego attractions. It didn't seem to match with the park in any way and cheapened the experience slightly. I also think the unlimited soda refills is a bit irresponsible for the young audience.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Perfect weekend with Five year old", "The two day pass was perfect for us. Plenty of rides for his size, and the Ninjago video ride was super fun. Fantastic fresh and healthy food available, and loved that the entrance was so close to hotel. He was the perfect age for this park.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Expensive", "The staff is not motivated and they don’t look very happy. The clapping to celebrate kids going on the rides seems fake.\nI know I am not the primary type of customer, so complaining about the rides being boring might be to much. So I will complain about the prices. 20$ for the cheapest parking option, 117$ entrance fee and 7$ for a bagel and juice is way too much.\nThey can do better in so many ways.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "First visit", "I was impressed! Each neighborhood was well thought out and had a unified theme. The LEGO statues were super cool and the playgrounds were so enticing that my little ones almost wanted to stay to play rather than ride attractions. I definitely have to go back for the imagination stations and to really explore each neighborhood.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Take the kids,", "Be sure to get the extra pass to shorten your wait in line,, very well worth the cost on a busy day."], ["Reviewed 4 weeks ago", 5.0, "An awesome family-day!", "This park is beautiful. We went during low season and did only wait 10+ minutes at one ride. Got to do lots of activities, great for both, kids and parents. Great food options, too.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Special needs group", "This was the first time we have taken our group of 25 children with special needs to LEGOLAND in years. The park is amazing! It is perfect for our group. Security check in was very accommodating of our group bringing in their food due to their special diets. Our only downside of LEGOLAND is the cost of attending. We used the group discount for our kids, but almost all the kids require a 1:1 aid for supervision due to their disabilities. We wish we can come back in the future, but we have been saving money for the past 2-3 years for them to attend. We are from Therapeutic Recreation Services, Park and Recreation with the City of San Diego. We would love to come back to the park if the prices for the children's aid were more discounted. Thank you for bringing a smile to our children's faces. They really enjoy everything about LEGOLAND and want to come back in the future.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Fun time in Legoland", "All 3 generations enjoyed our stay despite the water park being closed since we were there in mid January.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Great family amusement park for younger kids.", "A nice park with friendly staff. Several fun rides for even the most timid rider. My one major complaint is the number, the frequency and randomness of ride closures and shutdowns, particularly the rollercoasters. This is perhaps a maintenance issue that needs addressing. At over $100 a day cost per ticket for entry, folks may not see great value in being limited to the Friends stage and kiddy rides for most of the day. Even some boat rides were not running. We were there for a week and saw this continuously.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Family outing", "We had an excellent time.. Took 3 kids ages 7,8 and 15. We all found fun stuff to do and appropriate for all ages. We had the time of our life. Thank you legoland!\nShow less"], ["Reviewed January 22, 2018", 5.0, "A great park for kids", "After spending two days at Legoland I can say that this is a perfect theme park for kids up to the age of 10 and the parents of those kids. Legoland is very walk able and their app makes looking at ride wait times very easy.\nDon't forget to bring Lego Minifigures from home so that you can trade them with employees and in almost all of the stores. If you don't bring them, your kids will want to build 1 for $9.99 which is expensive.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Family visit - excellent", "While kids were 'busy', I couldn't leave the mini cities, they are just amazing for all ages. So real! One can stay there all days long. Every corner of the Legoland hides some surprises for both kids and parents.\nShow less"], ["Reviewed January 21, 2018", 5.0, "It's A Family Time", "Our first time with kids 9-10 years old here. This friendly kids theme park suitable for those who like anime or cartoons. Despite of this, We could meet some actions figures of STAR WARS which is my favorite movie since i was child."], ["Reviewed January 21, 2018", 5.0, "You will love it as much as your kids", "We live in Carlsbad so we have season passes to Legoland but honestly it never gets old. Our kids love it every time we go. It's fun and much more manageable then say going to Disney for the day. You get in, parking isn't bad and then entire park is walkable and easy to navigate.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great trip to Legoland", "I took two of kids aged 5 & 7 last weekend for 2 nights. We stayedin the hotel. This is our 2nd visit, last trip was almost 2 years ago. The staff both in the hotel and in the park were superb; everyone could not have been more helpful and professional. My son didn't want to go on the rollercoaster so he stayed with one of the staff while I went on it with my daughter and at the end the staff member walked him out to the exit to meet me which was so nice. The reception staff were very professional and Michael behind the bar at Minis was a true gent! Overall if you have any budding lego aficionados, don't hesitate to visit.\nShow less"], ["Reviewed January 21, 2018", 3.0, "Click Snap that lego", "From a kid perspective this place is a blast. Lego's everywhere and small rides to ride on. The water parks were closed but we we have gone to them and they are great.\nThe thing is the cost for these places is just staggering and what they have there is not all that awesome.\nI will note the star wars lego world was facinating and well done. The miniland was really cool to see and visit. Look for the gent with the Tree's on his badge. He has awesome little Lego people to trade with. MAKE SURE you bring extra Lego men to trade with. They have some cool ones.\nWe happened to go during a weekday and it was great since it was not crowded at all.\nSome of the rides though were not operating. Also there was a number of construction bilboards up for renovation,\n\nThe new Castle Hotel should be great.\n\nThere has to be some way to bring costs down. $55 for a family meal is not long term sustainable at all.\n\nI will also note that a lot of the rides were really dirty or they were missing the enamel that protects the equipment. There has to be some cleanup and repair on these if they want to keep people coming back. The ticket price is not sustainable long term either...\nShow less"], ["Reviewed January 21, 2018", 4.0, "Enjoyable Day at Legoland", "We went with our 5 and 3 year old grandchildren. The building centers were a big hit and they had fun riding on the boats through the different storybook lands. The 5 year old really enjoyed driving a motorized vehicle all by herself for the very first time, and second, and third. Since it was a light day for visitors she was able to go on several times. We had a great time. There are more rides for older/taller kids to enjoy than younger kids. Sea Life Aquarium was a nice cooling off location with exhibits for everyone to enjoy.\nShow less"], ["Reviewed January 21, 2018", 5.0, "We will be back 👍🏼", "All was awesome. The only thing I suggest would be to give the employees working the food areas who have action figures glued on them to have the same figures in there pockets to trade off to other kids. My sons seen a couple and they were glued on to name tags. But other than that little hick up we had an awesome time. From the GUTIERREZ FAMILY.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Great for 4-9 year olds", "My kids love Legoland. We waited until my daughter was 36 inches. Be sure to check all the height minimums and what rides parents can go on with their kids. If we had gone when she was smaller, we would have been very disappointed. We loved the Duplo playground. I liked that there was only one way in and out so the kids could run around and I wasn't worried that they would go out some random exit. We went once when my son was 7 and again at 8. I would say that was starting to get bored at 8 due to only a few roller coasters. I think he would have fun for one more year before he feels he's too old for it. It is a great park for a laid back experience. We did not feel that we had to run from activity to activity and still saw everything in a day and a half.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Fun place !!!", "This is a great place bring your family ! They have a lot rides here as well - there’s a lot of displays that has lego pieces . You can purchase legos here as well :)"], ["Reviewed January 19, 2018", 5.0, "Fun Fun", "We visited Legoland in Dec 24 and 25 2017.\nnot to crowded and we had a lot of fun.\nNo crowds. Great rides for the little ones. Great playgrounds for the little ones as well.\nfor most rides the waiting is about 15 to 40 minutes.\nfood kind of expensive inside the park.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Playground for kids", "Always love Lego, so decided to check it out as a couple. This place is is not like Disney, it is definitely made just for kids. A few of the rides are cool and definitely cool to check out lego star war and the miniature cities. However, most of the attraction is more for the kids. Will come back when we have kids of our own. Wouldn't recommend for couples.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Hands down the best playground for the little ones", "We visited three of the big parks in California - Disneyland, California Adventure and LEGOLAND. The best experience was without a question LEGOLAND. No crowds. Great rides for the little ones. Great playgrounds for the little ones as well. A tip is to go on weekdays and off-season. Worth the money!\nShow less"], ["Reviewed January 15, 2018", 2.0, "Our family experience!", "We decided to take my son to Legoland as everyone was talking about it and said that is was a fun place for kids. I unfortunately did not have that same experience. We paid about $100 per person not to mention that there wasn't too many things for my little one to ride (Not because of his height.) I wish it had more rides and games for them to explore. The only thing my son loved was this water fountain that was by Fantasy Land (Polly Pocket) he had a blast. Please do take extra clothes as my song got soaked and didn't have too many stores to buy him an actual outfit from head to toe. We had a good time but it wasn't the best. All honestly I prefer Disneyland and it's about the same price.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Delightful day with a 3- and 7-year old", "Legoland is impressively well thought out, organized, and pleasant. The park is aimed precisely at the age range of our grandchildren, and has nicely located activities for the younger and older near each other, so that they don't have to wait around for each other (\"younger\" means 3-5, \"older\" 6-10.) There is a nice variety of kinds of thing to do, and usually the lines are not too long (half hour max), so the ratio of time spent having fun vs waiting is quite good. Although there are, of course, shops everywhere, they are not aggressive and one isn't compelled to walk through them. The food, for which we had low expectations, turned out to be quite good and healthy. An expensive entrance fee, but it ends up being worthwhile. I'm not generally a big fan of amusement parks, but it's nice to see one that is well done. The atmosphere is really pleasant and friendly. It's fun to see all the characters, animals, dragons, cities, etc. made of legos. There is still plenty left to come back for, and new areas being developed as well, so we are likely to return.\nShow less"], ["Reviewed January 15, 2018", 4.0, "Lego Heaven", "Came here with my son in law and 4 grandchildren. The grand kids love this place. The rides, the applie fries with powdered sugar, and the attractions. One day was enough for me."], ["Reviewed January 15, 2018", 4.0, "Fun day", "My grandson loved Legoland. We stayed at the hotel in the pirate room. He loves all things pirate! A little disappointed that the pirate area was closed and he didn’t see a Lego pirate man which he wanted to but we had a great time. The hotel staff were amazing. We will definitely come back.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Family Fun!", "LegoLand is a fantastic attraction for all Lego lovers! Our boys of 6 and 7 years old absolutely loved the day we spent here and rate it as one of their best places on our trip to the USA. They loved that all of the rides were perfect for their age and that they could go on them all without mum and dad and even drive their own lego cars on their own. The lego constructions throughout the park are amazing to see and there are plenty of places to eat, sit and explore. December was a great time to visit as it wasn’t too busy. Overall, a great family day out!\nShow less"], ["Reviewed January 13, 2018", 3.0, "Not as good as Legoland in Florida", "The park looks like it needs a good clean up. Many of the models were dirty and with broken parts. Compared to what we saw at LEGOLAND in Florida a few years ago, we were not impressed.\n\nWe did still enjoy our day and the models were well done but definitely could use a bit of TLC throughout.\n\nMinimal lines at the rides the day we were there (early January) so that was nice.\n\nFood, as expected, was fairly expensive.\nShow less"], ["Reviewed January 12, 2018", 3.0, "I found it ok", "It’s an OK park for having some fun. My nephew and my family didn’t find it awesome (as expected). One day is enough here\nShow less"], ["Reviewed January 12, 2018", 3.0, "Disappointed, needs better management", "This was our first visit to Legoland California. Our children are 11 and 13 so almost too old for Legoland but our son is a huge Lego fan.\nWe have been to both Disney and Universal Studios in Florida so perhaps we were comparing Legoland to these parks somewhat.\n\nDuring our Legoland visit we noticed a few things were out of order such as one of the vehicles on the Aquazone Wave Racer, the people dryer next to Captain Cranky’s Challenge and the Skipper School ride. The water parks were also closed but perhaps they are seasonal. One of the Lego characters on an escalator in Miniland USA was missing a head while many of the older models of buildings in Miniland USA looked dirty and in need of a soapy spray wash.\nThat being said the Las Vegas and New York City building models were well done.\n\nMost of the ride operators looked miserable except for the operators of the Coastersaurus who were exceptionally enthusiastic.\n\nA female operator of the Kid Power Tower ride, who I will not name here, was very unprofessional. Our tweens were on the ride for the first time, loaded themselves, seatbelts etc., but when the ride started their seat did not raise like the others. We got the attention of the ride operator to ask her why they weren’t moving and she said ‘because they had pushed the black button next to their seat’. The button in question is very nondescript and I might have been apt to push it too as there was no signage saying ‘don’t press the button’. Obviously our kids didn’t know but rather than let them ride the next round (there was no line-up) she was rude and didn’t say anything of the sort. My son, who was very excited to be trying the ride, was very disappointed and wasn’t himself for almost an hour later. Did I mention that we spent $800 a few minutes after entering the park (for admission and reserve n ride passes)?\n\nThe reserve n ride passes are not as good as the Universal Studios Express Passes. The reserve n ride gadget only gets you a bit closer to the front of the line whereas the Universal Express passes at Universal Parks have an entirely separate line for holders. We did not benefit very much by spending $400 on the reserve n ride passes.\n\nOverall Legoland California wasn’t as good as we had expected. Perhaps better management would address some of the issues I have written about.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Quick whirlwind visit to Legoland", "Park done in 6 hours- this was not long enough- probably best to get a two day pass and really plan it properly. The park is well equipped. Activities are great. Perfect for the family"], ["Reviewed January 11, 2018", 5.0, "VIP Experience was Great!", "We were visiting our 1st time from out of town, and splurged on the VIP Experience for a family of 3 for two main reasons: A staff Host guided us all day long to help our son Skip the Lines at the rides, and to go into the Model Shop where Legoland Staff are building new Lego projects for the exhibits around the park. The added perks were that food and snacks throughout the park restaurants were included for the day, and we did the private tour through the Aquarium at 9:00am before it opened to the rest of the public so it was quiet and enjoyable. It made the visit easy and stress free, and we got to see alot more in 1 day than we otherwise would (and we still didn't do it all - enough left to go back again and do all new stuff for a 2nd day). Once you consider what you'd pay for Skip the Line Passes, a Private Guide, Food, Valet Parking, Souvenir Family Photo printed on Legos, and 2-3 Free Lego Sets at the end of the day, it paid for itself. If you live nearby and can visit 2-3 times on your own then you pretty much see all the same stuff. But for making the most of our 1 day it was great, no regrets.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Awesome", "The rides are fun for kids, my 4 year old really enjoyed our 2 days visit especially the Ninjago ride.\nShow less"], ["Reviewed January 10, 2018", 1.0, "Not worth it", "My family booked Legoland in advance for our trip to California. I have 3 kids ages 6, 9 & 12.\nAt first the parking attendants said they were full and made all of the cars turn around that were in line and promised to give refunds. We came back 15 minutes later and they let us in to park along with many others who were waiting in line. So many people were turned away that could have come from far away. How bad is that?\nAfter getting into the park we went straight to the closest ride, the Technic Coaster, and spent 2 hours waiting in line. It was a very short ride and fell very short in any thrill factor. This is supposed to be the best ride there. So now we are faced with hours of looking at Lego statues, which no one should have to pay to look at because it's just advertising for LEGOs. My kids, who love rides, had no more interest in waiting in a long line for a sub-par, boring ride. My 12 year old daughter got her portrait drawn for $30 and it looked nothing like her. Them, we paid more money to have an average pizza/pasta lunch and left. Even my 6 year old boy said it was a total waste of time.\nShow less"], ["Reviewed January 9, 2018", 3.0, "A good visit, could use an update", "This was our second visit to LEGOLAND and definitely our last. Although the kids enjoyed the day, we found that there is not a huge amount to do here, especially if you’ve visited before.\n\nLast time we were here the Heartlake city area was being built and we were so looking forward to visiting it this time. It was pretty disappointing, with only one ride there. The performers were great though and were so kind to my daughter (who was a bit star struck upon meeting her idols). It would be great if there was some more to do here.\n\nMost of the park is geared towards spending money on games or at the shops. My kids wanted to buy everything, although we had to limit our purchases as we have to be able to take them home in our suitcases.\n\nMany of the rides are looking a bit old and worn, the park could use a refurbishment. We enjoyed the ninjago ride and the kids also enjoyed the Kingdom Adventure ride and the Driving school. My favourite part was the mini American landmarks made out of LEGO.\n\nWe did enjoy our visit but are glad we only stayed for one day. I don’t think you would have enough to do to spend more than one day here.\nShow less"], ["Reviewed January 8, 2018", 5.0, "VIP Tour is worth the price and it was awesome", "On one of our two days at Legoland we decided to take a VIP tour. Our day started at 9AM with a private tour of the aquarium. Our guide Joseph was very knowledgeable and we learned a lot more about it then when we visited it before. Next we headed to the park. It was great to get to the head of the line for any ride and not to have to waste time waiting. Our guide was very encouraging to our five year old son and he went on rides that he would not ride before. Our family loved the experience.\n\nWe made our park ticket reservations online with our hotel. We never received our tickets and our guide saved us the hassle of trying to sort that mess out.\n\nIf you have a family with young kids or want to go to the head of the line the VIP tour is the way to go. We will not go back to the park without a VIP tour guide. Thank you Joseph.\nShow less"], ["Reviewed January 8, 2018", 2.0, "Complete waste of money!", "The attraction is completely aimed at making as much money from kids as possible. The number of people allowed in to the attraction should be limited, or else its impossible to take advantage of every ride in one day. 90mins plus waiting for a 90sec ride is a complete joke!\n\nIf you have a one day pass then enter the park as early as possible and take the most popular rides first. Whilst looking great from outside, the inside is a big let down.\nShow less"], ["Reviewed January 7, 2018", 3.0, "Great for young kids; almost nothing for adults. Very good food choices", "Our family (mom, dad, two boys 9 and 7) visited LegLand California December 27-30, 2017, and stayed in the LegoLand, California Hotel (also reviewed).\n\nWe arrived to the hotel just before park opening time, and had our luggage stored until check-in, and having arranged to meet with several other families, also with young children. Our park admission was included in our hotel package, but admission was about $80 per person for the entire day otherwise.\n\nBe advised that LegoLand, CA, opens at 9:00 AM for hotel guests and 9:30 AM for everyone else. On the days we attended, the park had a staged opening, meaning only parts of the park were accessible upon opening. In fact, we had to wait until 10:15 AM to access a part of the park that had a very sought-after attraction. So much for early access.\n\nThe park closes at 7:00 PM, and does not really have bright lighting to assist with exiting the park. This may have something to do with its proximity to residential neighborhoods, and coastal views of those neighborhoods.\n\nIf your family are RABID fans of Lego toys, your entire family will have a lot to enjoy. If not, there is not a whole lot for everyone to get into, which relegates parents to the role of experience curators for the kids. Our family is pretty big into Legos, and even we struggled to get excited about the attractions at the park.\n\nOf course, being that our visit was during a typical vacation time for families, there were a lot of other families there, too, and lines for pretty much everything were long. We expected this, which weighed on our decision to stay at the hotel. By mid-morning, all lines were 45 minutes-plus. The park has their own version of a Fast Pass like Disney parks have, but are not offered to all park patrons, making most of the time spent in the park line time.\n\nAs far as attractions in the park, they center on younger-aged rides, such as mild roller coasters, as well as video-motion rides, with themes geared toward the different \"types\" of Lego toys (Ninjago, Technics, etc.) and carnival games that offer prizes that, at least to me, seem oddly incongruous for a Lego park. None of the stuffed prizes are Lego-themed. Seems odd, since we thought that, being a Lego park, the operators would want to saturate the environment with Lego-related goodies, and we were actually looking forward to that aspect.\n\nIn several of the sections of the park, supervised brick building areas were set up, but several had certain times that contests were to be held. We did not participate in those, so I have no useful info to share.\n\nAlso of note are the numerous souvenir spots, including many opportunities to purchase Lego building sets. Nothing special here: any of the Lego sets offered at the kiosks and shops can be gotten anywhere else. No discounts were offered on any sets, unless you are a Merlin Club member, and that gets you 10% off.\n\nThere were two big pluses for our group. One was the miniature displays made of Lego bricks. There is an entire section of the park dedicated to the use of Legos to make mini versions of widely recognized places of note, such as San Francisco, Manhattan, and the Taj Mahal. There is also a large section dedicated to incredibly lovingly-recreated Star Wars scenes. They are homages to each of the movies, Episodes I-VII, including a giant Death Star model, and a huge recreation of the trench scene in A New Hope. All the kids in our group spent the most time on this section of the park.\n\nThe other huge plus for us was the food selection at the park: the food. There is very good local beer and wine available at at least one food area. There are numerous excellent breweries in the San Diego area, and many were available at the beer stand we visited many times. Also, all the food we ate in the park was first rate. We enjoyed barbecue and smoked, slow-cooked meats and sides, Vietnamese wraps, and of course burgers and fries. Prices were \"amusement expensive\" which was to be expected, but was not unreasonable, especially considering the high quality.\n\nOn both days we visited LegoLand, CA, we were in the park at closing. Being a winter visit, it got dark at about 5:30 PM, and we found it disorienting navigating the park in the very low light in the outdoor areas. The weather was very mild: low 70s by mid-morning.\n\nWe did not park in the LegoLand lot, so I have no info to share there.\n\nTo summarize: our 9-year-old is about maximum age for this park, even though we all are pretty big Lego fans. Our younger one loved it and wants to return. Both days, the kids indicated that they were tired, and wanted to return to the room to rest. I have a feeling my wife would willingly go again if the kids are into it. I could take it or leave it.\nShow less"], ["Reviewed January 7, 2018", 4.0, "watch out! the waves are coming!", "From my son's birthday we got the 2 day resort tickets. We first enjoyed the theme park with plenty of awesome rides they have. I enjoyed mostly the dragon roller coaster and my son did too. There is a pizzeria buffet that was really appetizing. As for the second day made me feel like a kid again. The water park was beautiful and my son enjoyed it the most. They have whole park divided in different sections for all ages. We went to the far end of the park where the Lion Temple is located. it was really fun especially when the \"alert\" for the waves begin. I had lots of fun with my family, food was decent, and everything went as planned. Watch out for those waves :)\nShow less"], ["Reviewed January 6, 2018", 5.0, "Fun for all ages", "Do you kids love LEGO’s? Do they love riding amusement park rides? This amusement is the best combination of imagination and creativity. Great place for families of all ages, ride rides or build with LEGO building blocks, it’s fun for all!"], ["Reviewed January 6, 2018", 3.0, "Too Old for Legoland", "My girls are 5, 7, and 9 and we visited Legoland with our Go Card. There are a couple of rides that kept their interest, but most are for little kids or kids that don't like fast roller coasters. They did have fun seeing the Legos and I am glad that we went. We also really did enjoy the apple fries, but left after a couple of hours here. Also the park opens at 9 but most of the rides didn't open until 10.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Fun for all", "Kids and adults will enjoy. They have a beautiful water park . You don't have to be a Lego fan to enjoy to enjoy this park"], ["Reviewed January 5, 2018", 4.0, "Worth it - if you like legos or kids in lego fever - independently of age", "we did not reserved hotel rooms at Lego land, the park in general it was good, kids loved it.\nvisiting the park was a last minute decision, so prices were high. we found a good price at SPG La Jolla, really nice. half of the price... if there is time, perhaps it is worth to try the hotel are Lego land.\n\nWhile in the park, bring your own water and locate restrooms ahead of time. Not that many Water fountains.\n\nSummary, if you or your kids are in to Logos, plan ahead..at least a month in advance and enjoy.... you will for sure! ( try always low season - Lego app, keep your Bluetooth on)\nShow less"], ["Reviewed January 5, 2018", 5.0, "Loved it!", "LEGOLAND was very fun. Best ride for us was Ninjago ride- we ride probably 8 times over two days. It is like an arcade game and very fun.\n\nKids loved mini land and all the rides. They have Great food options throughout the park which made the stay very enjoyable. We stayed two days and also two nights at LEGOLAND hotel. Very fun overall experience.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Best Theme Park Experience of All Time", "We have been to LEGOLAND two years in a row. In 2016, we were there in August and in 2017 we were there for Christmas. Surprisingly, Christmas week was exponentially more crowded than August.\nAs for the park itself, all I can say is it blows away every expectation. I grew up going to Disneyland and later worked there for several years, so I have a great understanding of how theme parks should be run and maintained. LEGOLAND exceeded all of my expectations in every aspect. Whether it was the kid friendly attractions, shows or just wandering around Mini Land, LEGOLAND delivers a world class experience.\nImagine walking into Storybook Land at Disneyland where there is ample space for human beings to walk, room for strollers, room to wait in line, room to sit down on a bench and relax. LEGOLAND brings all of this and truly offers something Disneyland no longer can. A relaxing, easy fun family experience. I am completely sold on this place and will return every year with my daughter.\nThe attractions really run the gamut as well. There are rides for toddlers and rides for elementary school aged kids, and even a few coasters for the adults and teenagers.\nThe wide open spaces allow for ample human traffic without bottleneck problems.\nYou could easily spend an entire day walking around Mini Land and taking in all of the miniature cities and Lego people. There is even a Lego factory where you can see how Legos are made.\nThere is even a free water park section for kids of all ages that includes a few slides and pools to splash in. This is right next to the other water attractions, so all of your water play will come at once. Bring a bathing suit or change of clothes.\nIn the summer, you can check out the water parks. I have not been to those and can not review them, but they look just as impressive.\n\nOverall, the food is top notch, the rides are great for all kids, the ambience is so much fun and the park handles crowds very well. It truly is a perfect experience for the entire family and beats out Disneyland in terms of value for your money.\nShow less"], ["Reviewed January 4, 2018", 3.0, "Awesome miniland, nice theming, needs better rides", "I visited during New Year’s Day and lines were not bad. I rode all 3 coasters and some other rides and waited 20 minutes max but usually it took less time. The Miniland and Star Wars Miniland was really cool and probably the best part of the park. I did notice a few issues the park could fix. One problem I found was that when driving to the park, the park is hard to find since their attractions are not that tall and signs are a bit scarce in some spots. Another problem was that with the San Diego Go cards we had to still go over and get tickets printed which took 15 minutes with just one family in front of us on a non crowded day. My biggest gripe with this park is its lack of thrill rides. The roller coasters were pretty average and the “star” ride was a wild mouse roller coaster which I have ridden 5 of now not including spinning wild mouse coasters. A thrilling roller coaster or even something like Manta at Sea World San Diego would be a huge addition to the parks lineup and make the park even more appealing as a park for everyone as I know that there are adults who still love getting LEGO sets. So overall I had fun but there are improvements that must be made for me to return.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Enjoyed it !", "Went to Legoland for the very first time with our teenaged daughter and two younger kids. All enjoyed the park. Ninjago is a must do. As with the section where there are miniature lego-made US structures eg Vegas, One World Trade Center, and wow the Star Wars section is most spectacular. Also got to try the ‘ driving school’ and ‘splash battle’ especially the younger kids.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Favorite Southern California theme park for our whole family", "If you have kids under 10 who like Legos, this place is paradise. The size and crowds are so much more manageable than Disneyland, and the activities are much more exciting for my little kids (ages 5 and 7) than Universal Studios. My kids enjoy the rides, but their favorite thing to do is build with all of the different lego experiences and play on the awesome playgrounds. The rides are secondary. And there are a lot of decent food options. This is a really fun and memorable way to spend a day or two with younger kids.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Amazing day of fun and activities", "Went there a week before Christmas. The weather was perfect, with high 60s and sun throughout the day. The details of the characters and objects built with Legos is astounding. The rides are fun, especially the 3D and 4D ones. We loved the Ninjago ride the best. There are multiple hands on activity spots for kids, and both my 5 year old and 18 month old enjoyed them.\nShow less"], ["Reviewed January 3, 2018", 5.0, "5 stars for little ones...probably under 10.", "This is for my 8 and 3 year old. I visited twice in December, once very empty and once crazy crowded (on a weekday between Christmas and New Year). When it's empty it's very pleasurable. Line's very short so it's very enjoyable. Even when it was crazy crowded, there were rides with shorter lines. My 8 YO doesn't enjoy scary rides, so this was a perfect place for him to enjoy most of the rides. And he loves Lego. I appreciate that some rides have play area right next to the line for kids to play while an adult waits. It really keeps kids preoccupied. But it would be nice if there are a play area for all rides. A walkie talkie would come in handy to call kids back into the line. For amusement park, food price was quite fair. On busy days there are playgounds and play structures that kids can play. And keep an eye out for rides with shorter lines.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Waterpark is a must", "Went over Labor Day, didnt spend too much time in the regular park because it was so hot, went straight to waterpark and had a blast. Highly recommend it to anyone with kids."], ["Reviewed January 2, 2018", 5.0, "VIP- Wake up the fishes- Legoland Cali-", "Awesome, Amazing and so much behind the scenes in every way... Steve our VIP guide was the best and knowledgeable about everything including the best times for rides, food, ect... My son rode more rides with him than me! We found a new friend and a great place for kids of all ages... Thanks LEGOLAND and Steve. See you in 2018 again...\nShow less"], ["Reviewed January 1, 2018", 1.0, "Wish I could have given this place a zero rating", "My family went to Legoland in October for 2 days to take advantage of the the kids free October promotion that they were running. As far as kids free, our experience was far from that. I had purchased discounted two day passes for the adults prior to going. On the first day, when trying to enter the park, we were told to go to the customer service office. Customer service then proceeded to tell us that the kids were in fact not free as we had discounted tickets for the adults. I was informed that the only way the kids would be free was to purchase the adult tickets from their kiosks. Customer service offered to either refund the price of the adult tickets or to sell us full priced tickets for the children. Of course leaving us standing there with excited children to go to Legoland, the only choice was to pay the full price for the children's passes. The price for one two-day pass for a child was more than what was paid for for both adult tickets combined. Legoland should not be involved with the kids free October for the city of San Diego. We went to the zoo, Belmont and several restaurants and had no issues with the kids free promotion for the month of October.\n\nUnfortunately, this was not the end to our disappointment with this park. Since we were going to be there for 2 days, we purchased the refill soda cup only to find out that it could not be refilled at any of the restaurants or stands throughout the park. They were only allowed to be refilled at the refill stations. There are only 3 in the entire park and half the time the employees there can not tell you where they are located. Besides the fact, that once you do finally fill this cup, you have to wait an additional 10 minutes in between refills for you cup to work. What a complete waste of time and money! Also a two day pass is not worth the money. By the end of the first day, you will have had enough of their bad customer service and nonsense.\n\nLegoland's website states that it's good for children up until the age of 12. My 6 year old was bored with the rides and the shows. I can't imagine any 12 year old would remotely enjoy this park. From this experience, we will never return to the park. I would rather pay more money to have a good time for the whole family and visit Disneyland.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Best VIP Experience in California", "Legoland California is amazing experience! I have an 11, 5, and 3 year old, and this was our favorite of the three parks we visited in a three day period (Universal Studious, Disney, and Legoland). This was by far the best VIP experience we had at a park!!\n\nOur guide, Andrew, was knowledgeable, considerate, and super fun! The kids loved him and he helped us all have a blast the entire day! (The picture of our family made entirely of legos and Lego gift sets at the end were an awesome treat as well.)\n\nSilvia made our minifigure building experience a blast even for my littlest one who began to catch on when Sylvia told us she would be our “guide book.” I also noticed throughout the park how kind and friendly attendants at each ride were as well as other very important staff that help keep the park running by keeping it clean.\n\nAnother thing we all loved was how kid friendly Legoland restrooms were.  The kid level sinks and driers were so convenient.  We didn’t see these at the other two parks.\n\nOverall, this was a top notch experience.  I’ll be recommending this to friends and family. Thanks again to Andrew and the entire Legoland team!! \n\n— 1 more thing. They had people on standby for the VIP experience. We were so grateful to be able to book the same day!!\nShow less"], ["Reviewed December 31, 2017", 4.0, "New Years 2017", "Our first time and the Displays were absolutely amazing! Rides were good but geared for under 8, as my 10 year old wasn’t as entertained. Robotics class was a ton of fun for everyone. We bought the 2nd level “fast pass” equivalent and lines were almost non existent for us: solid value for that. Very entertaining with so much to see and do. Though it was an expensive day overall, would do it again.\nShow less"], ["Reviewed December 31, 2017", 1.0, "Too crowded and expensive", "We were very disappointed. We arrived early just to find out that the actually rides didn't open until 10 so we stood with the crowd until 10 and they released the gates. It was a mad rush to rides. Then in about an hour, all the rides had at least a 45 minute wait. The only way to avoid that wait is to pay more for express passes!\nShow less"], ["Reviewed December 31, 2017", 4.0, "Mad house", "Went here with 8,5 and 2 year old. We went christmas week but this was over the top crowded. We did our best to have fun but I feel everyone walked away having a bad time. Will not do this again for a long time. Kids play area is so crowded that it was not safe. And the is always those old of control kids that ruin it for the little ones.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Fun day outing for small kids", "Before visiting Legoland, I didn't realize the power of the small lego bricks and what all you can build by stacking one on top of another. Visit Legoland and you'll see amazing structures and city landmarks recreated using lego bricks. It has many good rides for small kids (4-8 years), kids who have visited other theme parks or are older than 10 years will not be able to enjoy most of the rides as the thrill factor is not big.\n\nFor bigger kids get a reservation early in the morning for robot workshop in the Innovation zone. Two rides that are fun for big kids - Technic roller coaster and Knight's Tournament.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Not for bigger kids", "Legoland was fun for my little ones (7 year old) but not as amusing for older children. Smaller kid rides. Little ones loved the driving experience! Smokehouse bbq place was good with large servings."], ["Reviewed December 30, 2017", 1.0, "Poor line control, low quality attractions, broken", "I had high expectations. My daughter is 4. This should have been a no brainer fun day. She hated it. Rides breaking down. Guns not working on lost kingdom adventure, apathetic staff who aren’t empowered to solve simple problems. Lines moved slowly, but that’s not an unusual problem. What is an unusual problem are terribly trained staff who do not manage lines or rides efficiently. They are woefully understaffed and forcing employees to micromanage loading and line control which does not work and slows everything down to a halt on the coast cruise and ninjago especially. Some of the scenery is deteriorating badly and this place needs a makeover fast. Coaster broke down twice while waiting in line and again on the Dragon. We left after 3 hours. Had enough and daughter said she was bored. I have to agree. We will not be returning to Legoland and am bummed we wasted money here.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Go early, don't need preferred parking", "It was our first visit to the park. We did not stay at the legoland hotel. We paid for the closest parking but in reality since we got there early, even the less expensive parking would have been close enough. I thought it was better than average for a theme park, and we hit the highlights in about 6 hours. Go early so you can get through the busy rides before the crowds really build up.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Tyler is great but not SeaLife", "Tyler was great. He worked very well with Aidan. He was helpful, informative and worked his butt off to make sure we had a memorable experience.\n\nThe Sea Life Reptile was a complete bust. It was very short and half the reptiles were on their \"day off\" and could not be touched. Why are they on their day off when an encounter is scheduled???\n\nI do think it is overpriced for only 2 people. I can see it being more a value with more persons on the trip. I think an hourly rate would be better for smaller groups. The no-wait in lines is HUGE though. I would book again.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Be an informed Consumer", "Legoland is absolutely wonderful if you approach it from reality. Yes, it is expensive, but so is Disneyland and other theme parks. I advise staying in the Legoland Hotel. It was so fun. Rooms have themes, kids play a discovery game to open a safe in the room, activities in the hotel engage kids, parking was free, and characters roam the dining room. We loved it.\nShow less"], ["Reviewed December 29, 2017", 3.0, "An average Legoland experience", "It was our 2nd Legoland experience. We visited the Legoland in Malaysia a few years back. The rides were pretty similar.\n\nMy family visited the park during weekdays. Hence, there was no crowd and wait time was reasonable. Rides were suitable for families with young kids.\n\nNot really suitable for teenagers who seek thrilling rides. USH or Disney parks might be more suitable.\n\nIf your budget permits, you can consider getting the photo pass which allows you to have unlimited photos taken by the photographers in the park. You can then take photos with the different LEGO characters. Some ride photos are included too.\n\nAn average theme park experience for my family.\n\n\n\n\nShow less"], ["Reviewed December 29, 2017", 5.0, "Special shout-out to Cap'n Looty: YOU DA MAN!", "I'm what some might call an \"AFOL,\" an acronym for \"Adult Fan of Lego.\" I have been collecting Lego since childhood. I still buy sets and build for fun. I've wanted to visit Legoland ever since I was a child and read about the original in Denmark.\n\nWell, I'm glad I held off visiting until I had some nieces and nephews to enjoy it because the whole experience is absolutely geared toward children. Starting with the hotel, it's a brightly colored, noisy place with a big castle in the middle. There's a disco in the elevator. It's great; you need playfulness and silliness to appreciate it as a grown-up. But to really get immersed in it, you need to have some kids in tow.\n\nFor example, if I were to have done this on my own, I'd have spent maybe an hour or so admiring the Lego models then run out of stuff to do, in which case, I'd have just retired to the hotel bar. Except the hotel bar is right beside that castle in the middle of the lobby, and just sitting there and drinking a beer whilst watching the children play when none of them are yours is a great way to to get the cops called on you.\n\nSo no, no one wants that. Instead I took my nephews on rides around the park. There is less emphasis on thrill rides; the rides often involve physical challenges and exertion. Smart move, Legoland. Tire out the kids so they conk out as soon as you return to the hotel. Got a good workout with all the walking, and even got a bit of an upper-body work out at the Lego Police & Fire Academy. And the park may be small, but that's okay, it closes at 5pm anyway.\n\nSo what do you do after it closes? You go have the dinner buffet at the hotel. They've got a pretty impressive array of food: carving station, pasta, vegetables, soups, a little bit of everything. And of course they have an entire buffet island of kids' faves right in the middle, and it's set a little bit lower so the kids can serve themselves (with appropriate supervision).\n\nWhen you sit down at your table, expect the best serenade EVER from the legendary dread pirate Cap'n Looty! He'll play his ukelele for you, sing song, tell jokes, and trade minifigs. Makes me wish I had brought some of my own minifigs to trade, but the kids all got some cool ones from Cap'n Looty.\n\nCap'n Looty, you're the bestest! That fifth star is for you.\nShow less"], ["Reviewed December 29, 2017", 2.0, "Not worth the money", "To be fair we went over the Christmas holiday on December 28, The park was insanely busy with over an hour long wait on most rides. Even with that being said we have a 13, seven and four-year-old with us and there was absolutely nothing for the 13-year-old to get excited about and the seven and four-year-olds didn’t want to wait in the lines. There are activities for kids to do while waiting in some of the lines but that only works for so long. I would have much rather spent a little bit more and went to Disneyland.\nShow less"], ["Reviewed December 28, 2017", 2.0, "Overpriced and not able to cop with the rush", "We went on 26th Dec and 27th Dec. Had to pay $18 each day for parking alone after paying for more than 600 for 5 tickets alone. The park was so full that we had to walk 30 minutes to reach the front of the park. The rides had an average of 45 minutes with minimum of 30 to 90 minutes wait for each ride. Just to get the food we had to wait for 45 minutes. In total we had gone for 6 ride with 10 hrs waiting in queue.\nShow less"], ["Reviewed December 28, 2017", 1.0, "Legoland Experldience", "Our experience was very poor. I expected parking to be expensive, which it was. However the lines were so long, and to pay to upgrade to reserve in ride cost more than the price of admission. We planned to stay the whole day, but left several hours earlier because we were pretty much just standing in line all day. We only went on probably 4 rides in 6 hours. Our kids age 7 and 10 were too old for this attraction, more suitable for 5 and under. While I expected this to be expensive, I was very disappointed with our experience. In retrospect we should have gone to Disney, would have been more value for our money and our kids would not have left disappointed.\nShow less"], ["Reviewed December 27, 2017", 2.0, "Poor interaction with kids", "We recently visited Legoland CA from Rochester NY with high hopes however we did not expect the bad experience we had at one of the photo booths. My 5 year old and I were on one of the rides and after completing it, my wife wanted to purchase the pictures from the photo booth. The associate at the booth did not have proper training and took over 25-30 mins to load/print our pictures in the meantime the associate working in the next lane helped at least 4 other customers. The main issue though was a toy stall next to the photo booth- my son who started getting bored picked a toy and should his mother (my wife) for purchase which my wife did not want to so he put it back ( he picked it up and put it back right in front of the toy booth associate) however as my wife was leaving the toy booth associate came up to my wife and stated that my son was stealing- my wife was totally surprised and protested with the associate at which time he backed off-not sure if this is how Legoland CA trains their associates to deal with children. Definitely in future Legoland is off our trip list.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Fun Place", "This place is not just about Legos but what inspires your kids’ imagination to build and construct. You may not expect that the price for Lego items here are cheaper than what online places like Amazon sells.\n\nThe food is great too. They have a variety from American to Asian food like Barbecue, fresh Ramen, Pork Belly cuts, Rice Bowl, etc within the Park.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Great", "Really enjoyed the place. The kids had a blast and we enjoyed them. The food was good and reasonably priced."], ["Reviewed December 26, 2017", 3.0, "Get a Coupon - Pricing Off", "This was a fun experience for my son who loves Legos and has been dying to go to LEGOLAND for a long time, however I honestly did not think it was worth the Disney price tag. Luckily I bought our tickets with a bogo offer online; do yourself a favor and search for one. This will save you almost $100 bucks. The rides are not that great and their aren’t any shows to experience. We felt punished by not being able to enter with the same people who were staying in the hotel, and were forced to shop for merchandise. The hotel is not our style and I couldn’t imagine staying there; much better hotels in Southern California. The aquarium was a waste of time; just go to Sea World or the San Diego Zoo. You can see all of LEGOLAND in a half day and feel like you haven’t missed anything. Fun time with my favorite guy, but it’s certainly not worth the Disney pricing. Get a coupon!\nShow less"], ["Reviewed December 24, 2017", 5.0, "Miniature Fun for the Family", "Great place for small children. Tour the world in miniature version with famous landmarks made from millions of Legos. Entertaining shows and rides for all ages. Great restaurants at reasonable prices. Water rides and hands on activity for young and old. Lego themed hotel at entrance great for multi day visits. Excellent aquarium with beautiful fish from around the world.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Absolutely amazing.", "What a lovely place! Perfect for young kids - irrespective of whether they love Legos or not. The rides are perfect for kids, the Lego displays are amazing and the food is reasonable. We were traveling with a 3 yr old and a 6 year old and both the kids enjoyed completely. The aquarium is small but really nice and interactive for small kids. Can’t wait to go back again!\nShow less"], ["Reviewed December 24, 2017", 4.0, "Love but wish ...", "All three generations LOVED our daytime experience, but with sundown at 4:45, poor lighting hampered our last two hours of enjoyment. Hard to see where we were going and to view the creatiions! For the price charged, it shouldn't be a problem to put in some more lights. Ask Disneyland.\nMore characters walking around would also be a thrill for the kids. We only saw one briefly in 7 hours.\nWe do plan to return, though.\nShow less"], ["Reviewed December 23, 2017", 2.0, "Waste of money. Please avoid. Adult's tickets goes into water. Kids enjoy little bit as they do in every park.", "It is a waste of money. It is a simple park in Lego theme. For the ticket price, it's better to spend time in Disneyland or in SeaWorld. I am not a fan of Disneyland too, but it's worth the visit. Adults should not charged in LEGOLAND at all. It's better to give it to a poor man. It is just piggybacking via children's emotion. I would suggest to avoid LEGOLAND at all. That's my tip. Better enjoy beach or beautiful view of San Diego city.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Great time", "First time going to the park. Great for the kids and us. Loved Legos when growing up and get to see my kids having fun as well. Now this park brings out the kid in me. It was fun building things and riding all the rides. Ninjago is by far the most fun.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Enjoyed every moment of it", "Kids and adults love the rides. Park is conducive for walking. Highly recommended for young kids and adults that is afraid of high roller coasters."], ["Reviewed December 22, 2017", 5.0, "Incredibly fun for all ages!", "While on our first family trip to California, Legoland was certainly the place to go. It would definitely would be good to get there early. Even on a slow day, there were lots of people showing up by noon. The Star Wars scenes were my favorite! Job well done to the Lego team. Huge depiction of the Death Star was awesome! Our kids loved the Ninjago characters. If Star Wars or Ninjago isn't your thing, you have to see Miniland USA. The large displays of cities such as New York City and Las Vegas were surprisingly well made. There were rides for the kids from all different height ranges. I would certainly go back again if we were in the area. Find coupons where kids go free with an adult purchase.\nShow less"], ["Reviewed December 22, 2017", 3.0, "nice park but could be better...", "we went here for one day driving down from disneyland.\nthe good: not as crowded as disneyland so wait times were short and easy to walk around. most of the rides were appropriate for younger toddlers. we could enjoy ourselves more due to the lack of crowds. the sealife aquarium was fun too. the staff was friendly and courteuous too.\n\nthe bad: many of the rides and attractions were broken, the helicopter ride we rode actually broke while we were on it and we had to wait high in the air for about 15-20 mins till someone was able to bring us down. we were given a 'exit pass' as compensation for any other ride but the wait times for rides were so short that we didnt have to use it. another type of compensation would have been nicer. also, alot of the attractions and rides were old, and dirty and just not well maintained.\n\nthis could be a great theme park if everything was maintained a little better.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great park for our little Grandchildren", "Our Grandkids are 5 and 3. Legoland is just perfect for both of them. The 3-year old can only ride some of the rides but there are enough Legos and Duplos around to keep him happy. The rides are just the right speed for both of them and the wait time was not too long as it was a weekday during a school week. The park is nice and compact and the live entertainment was appealing for the children. Got a annual pass so we will visit more in the next 12 months.\nShow less"], ["Reviewed December 21, 2017", 2.0, "A waste of money and time", "We went as part of family holiday. We went to other amusement parks too. More than half the rides were closed. The ones that were open long lines. Some of the rides were family activities. The people that work were not the friendliest. The rides were kind of unthrilling. The Lego displays were good and some amazing. But overall, not worth it at all!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great Experience for Young Families", "This is the second time we have visited Legoland. Our children loved it. There is something here to do for children of any age.\n\nThe park is very family friendly and all of the staff here go out of their way to help you out. We saw the staff at the helicopter rides go out of their way to entertain some of the children while their mother went on the ride with one of their siblings.\n\nAlthough there were a lot of people there once inside the park did not seem over crowded.\n\nA tip - check out the small $5 LEGO bags in the stores for free children admission passes with an qualifying adult. Great way to save you some money for the next time you come back\n\nLEGOLAND is a Great place to go and spend some quality time as a family.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Fun Day", "We had a great time at Legoland today. My son took a friend who knew the park inside and out because he had been there a lot. It was helpful for us but when we did have to ask staff for help, everyone was courteous and very helpful. One person who we found to be extremely friendly and knowledgeable was a hotel employee, Megan T. We had many questions and she answered every one of them and was extremely patient with us newbies! She seems like a great person to have on your Legoland team! We got a lot of info from her and we will be sure to book a stay at the hotel because of all the great info she gave to us. Thanks, Megan T.!\nShow less"], ["Reviewed December 21, 2017", 5.0, "A wonderful theme park for young kids !", "LEGOLAND is really such a refreshing change from the chaos and hustle and bustle of some other parks. Everything is so beautifully laid out in wonderful gardens and the range of rides caters for toddlers to teens. The rides don't have massive queues and seem to really hit the mark for fun. There are plenty of food options (you can bring your own also) and the staff are friendly and really seem to enjoy what they are doing. Well done LEGOLAND; you're up there as one of our favourite theme parks !\nShow less"], ["Reviewed December 21, 2017", 5.0, "Made For Kids But Adults Love it Too", "If you want to be absolutely AMAZED at what can be built with teeny tiny little bricks Legoland will not disappoint. You can literally see all the main wonders of the world created with legos.\nThe amusement park aspect will disappoint people who get thrilled by being terrified. It is geared more towards kids up to 6 or 7 and adults who want to be with them and be awe-inspired by the massive lego creations.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Amazing!", "The LegoLand Hotel is soooo good. Super clean, smells great, tons of food choices, room service, character dining, heated zero depth pool and lots of night time entertainment for the kids. The staff is really nice and accommodating. The beds are soft, the pillows are full. We stayed in a fully themed Pirate room and it did NOT disappoint! Lots of stuff to do and see inside the room. Only complaint (if you could call it that) was that stuff was dusty and needed to be wiped down a bit. My son's 3rd Birthday was celebrated here and Capt. Looty the pirate came to our room, sang and danced, and gave my son Lego gifts and a full sized cake! I'd HIGHLY recommend staying at the LegoLand Hotel if you are going to visit the Park. It's almost better then the actual park!\nShow less"], ["Reviewed December 18, 2017", 5.0, "Fun family park", "Everyone loved legoland! The displays are super cool. The rides were great fun. We went in a quiet time so a lot of stalls were shut and we could walk straight onto any ride. It was a really good day Out.\nShow less"], ["Reviewed December 18, 2017", 4.0, "Better for younger children", "The rides and attractions here seemed much more geared towards younger children - probably 7 or less. My son is ten. He loves legos and overall he said he had lots of fun. However he looked very bored on the rides. This place was like torture for adults. I did enjoy mini land\nShow less"], ["Reviewed December 16, 2017", 4.0, "Enjoyable day, plan to get wet!", "We had been to Disneyland and California Land in the week before, and drove from Anaheim to Legoland, spent the day there and then on to Barstow for the night en the way to Vegas. This was a good plan if you are travelling by car.\n\nGlad we got there early as we found some of the lines got very long. We went to Disney on hot days and the lines were quite short, Legoland I felt like we lined up a long time for very short rides. Our boys age 5 and 7 really enjoyed it they were probably about the perfect age to go on everything, there are a lot of little kid rides. Lego structures are very impressive, well worth the visit, but some needed updating (it's a shame Lego seems to fade a lot in the sun). The kids specially liked the Star Wars legos.\n\nGood variety of food choices for lunch, and the apple fries were very good.\n\nThere are a couple of rides where you get wet, and I dont mean a little bit like at Disney, I mean fully soaked, so make sure you do these last or take spare clothes. These are in the main part of the park, not the water park. If you only have one day, the main part is a full day of activity, but I would not have gone back a second day unless going into the water park.\nShow less"], ["Reviewed December 14, 2017", 3.0, "Needs to be updated", "Kids enjoyed themselves. Adults found it very rundown, and we see the hotel being built but funds should probably be put into updating the miniland, and put into keeping the rides open. We had multiple rides closed for maintenance. We most likely wont be back again.\nShow less"], ["Reviewed December 14, 2017", 5.0, "Epic", "Epic experience. Couldn’t do Lego land any other way! From nighttime stories, to no lines, to amazing breakfasts this experience was amazing!"], ["Reviewed December 14, 2017", 5.0, "Great SoCal Family destination!", "We took our daughter & 2 grands (ages 4&12) and had a wonderful day! We also had access to the large water park. Do not miss one of the best BBQ restaurants in SoCal! We ate there each of our 3 day pass visits!\nShow less"], ["Reviewed December 13, 2017", 3.0, "Just Okay", "Just visited Legoland with two girls aged 7 and 9, I️ think this was the max age I️ would suggest for a visit to Legoland. We spent 3 nights at the hotel which was plenty of time. The lobby of the hotel is a little run down and could use some updates or at least some maintenance, although the kids enjoyed the Lego and pirate ship. We stayed in a friends themed room with a balcony, which the kids loved. We wish the balcony had access to the pool, but our room was on the main floor and was a great location as it was far enough from all the noise but close enough to be very convenient. The room could have used a little maintenance but was clean and great space for what we needed. The kids loved the treasure hunt and the little Lego sets they got each day. Being so close to the park was amazing, we even zipped back to the room a few times just to grab things we needed. The free breakfast was good, nothing spectacular but certainly appreciated as there’s no restaurants really close to the hotel. We also had the buffet for supper one night which was good but seemed a little expensive for what you get. We ate at the Skyline cafe twice, it was good but slightly overpriced and nothing to rave about. Wish there were other options close to the hotel but it was nice to eat at the hotel for the convenience. There were lots of activities at the hotel for kids, which is great but in the weekend when it was busy it was just too crazy for us. I️ like to be at a hotel that is calm and relaxing after a day at a theme park. It was nice and quiet in our room but the common areas and restaurants were crazy on the weekend, the week days were much better. We had a great couple of days and we’re glad we visited but it was certainly a one time trip due to the value of the trip and for the most part more suitable for younger kids.\nShow less"], ["Reviewed December 11, 2017", 4.0, "Teacher Thank You", "Big thank you for gifting teachers a free visit! My three year old loves the park and I love spending time with my family."], ["Reviewed December 9, 2017", 4.0, "Great for young lego fans", "We took out two little boys, aged 4 and 7, to Legoland and they loved it! Rides were good, the Lego sculpture around the park were amazing - they had a great day. But if your kids are not Lego lovers or teenagers - might not love this theme park as much.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Best Day Ever", "There were 6 people in our party (2 adults & 4 grandchildren) and I thought this would be a great experience for the kids but we all had a great time. The rides were great and the shops had friendly and helpful associates. The only thing I was disappointed in was that you no longer sell souvenir books and I was hoping to buy buy another one to compare them.\nShow less"], ["Reviewed December 8, 2017", 4.0, "Awesome", "Stopped for a visit to Legoland and was pleasantly surprised. Park was lovely well set out and the Lego was amazing . Kids enjoyed the rides and displays. My fav part was the apple fried which were out of this world. A definite must visit location if u have kids 5-12\nShow less"], ["Reviewed December 8, 2017", 4.0, "Great for Younger Children", "We went with 3 grandchildren, ages 4, 7 and 15. The two young ones enjoyed it and want to go back. The crowds were much smaller than Disneyland, lines were shorter and wait times no comparison to Disneyland and California Adventure. The 15 year old went there before so didn’t mind watching the siblings ride. They were able to ride some rides several times and as closing time drew near they didn’t even have to exit the ride to ride it several more times. They had things that were interactive and enjoyable. The food at the park was quite good and again had shorter lines. Enjoyed the bbq brisket as a side order though a little on the salty side. Several of us enjoyed the Vietnamese sandwich adjacent to the Ninjago ride. Overall a more relaxed and enjoyable visit. Highly recommend for children 3-10 or so. I believe discount admission tickets are available at local Costco stores.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Great for younger children", "We took our three children to Southern California for Thanksgiving this year and decided to drive up to Legoland for a day. First, for small children, ages 4, 5, and 9, this was the best all around resort experience we’ve had. Our littlest guy (40 inches), was able to do everything except one ride which was great because at other parks, he’d be two inches too small to do a lot of the rides. Our daughter (9yr) was only too tall to sit out one younger child ride. The only bummer is most everything is setup for 4 participants so as a family of 5 either my wife or I went with the boys and the other with our daughter.\n\nWe immediately opted for the Flash Pass when the first ride was over a 55 minute wait and we never waited more than 4-5 minutes to get on any ride which was perfect because we could keep moving and made it around the entire park in a single day. Without a fast pass, I doubt you could do the park in a single day.\n\nThe aquarium was a nice addition to finish our day as well. Make sure your kids collect all the stamps as you go through it and they’ll get a little prize at the end. It’s not huge, but it was nice to go inside as the night got a little cold after the sun went down.\n\nIf you have younger kids, this is a place they’ll really enjoy and more importantly, a place they’ll be able to do a lot of things. 40 inches is the magic height to do 99% of the attractions it seemed so I would suggest you measure your little ones to see if they meet that height. If they do, load them up and plan on a nice day at an easy park to get around. Remember the fast pass!\nShow less"], ["Reviewed November 29, 2017", 5.0, "Loved Legoland!", "Our entire family enjoyed Legoland! We have younger kids and teenagers and everyone found something to enjoy. Mini land is amazing! My 8 year old son enjoyed the Ninjago area."], ["Reviewed November 29, 2017", 5.0, "Four generations laughed, lounged, loved Legoland", "Legoland is a fun family outing for a day or three days.\nMy grandchildren aged 3 and six and my daughter and my mom age 96 and me. We're lost in our imaginations as we rode the boat tour on the lagoon ride. It gives you a great overview of the park before you set out on your own mode of travel being by feet, stroller, or pushed in a wheelchair. Laughs we're shared by all as the Legoland blocks in all shapes of animals or sea life or small familiar characters made us feel welcome.\nThe rest of the day were the three year old and six year old directing our day of their choices. From building Legos or riding the horses on the merry go round or the horses near the castle and pretending they were Knights.\nThey both loved the drivers license by riding the cars all alone. The 96 year old cheered them on on the side lines eating her hot dog and handburger with as she said fresh lettece and tomatoes with just the right price for her budget. She loved the cities build of Legos and sharing with us her memories of visiting them.\nLounging for all of us was stopping the fun of various rides and going to the playgrounds. Benches are located for the adults and kids to have a cold treat in the shade. The 3 and six year old played in the sand and ran around with us nearby as they made new friends in the climbing structures.\nI thought we would spend a morning there because of the wide age group in the family getting tired\nWe ended up there from opening to closing with the kids and are oldest of 93 sad when it was time to go home. Only a promise of a return trip to Sea Life and the waterpark got them in our car.\nHave fun sharing laughter, lounging,loving Legoland with all ages.\n\n.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Great for pint size fun", "Took my kiddo who is 4 to go to Legoland. Didn't realized it was a holiday weekend in CA, and it was super crowded, but he had fun nonetheless. They have music show, play area, of course, lego station everywhere. The Mainland USA is my favorite. The little liked the different areas that had legos to play with. They try to offer up different food options such as Ramen, Crepes, Pizza, Burger and Churros with chocolate Sauce, and salad even. If you are willing the spend the money do the Reserve n' Ride, to me it wasn't the value I'd care for.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Wonderful for all ages!", "We went as a family of 7 adults and 2 little ones, and all loved it! What a nice surprise! Because it was more low-key than Disney, and mostly families with young children, we all enjoyed the leisurely, less crowded pace which gave us plenty of time to enjoy all the Lego creations and rides. The movie was a little intense for the sensitive 3 year old, but not a big problem since there was plenty more to do. Food options were tasty and reasonable for this type of place. The park had something for everyone!\nShow less"], ["Reviewed November 26, 2017", 4.0, "Very good!", "When we visited it was not too busy, lines moved quickly and kids seemed to be entertained every corner we turned ! Great job!\nShow less"], ["Reviewed November 26, 2017", 3.0, "Good for little kids!", "Legoland is a nice park but very pricey for the rides and attractions they have there. If you want to save time you need to get the master pass attachment to your ticket. You essentially get a pager that allows you to schedule your time on the rides. This was very handy but also cost $55 a ticket extra. I'm sure there are ticket packages that you can get if you look around. The park is good for younger children but I think older kids wouldn't have much fun. Not much for adults who like adventure rides. There are a couple roller coasters that are fun but that's about it.\nShow less"], ["Reviewed November 26, 2017", 4.0, "Good with kids up to 9 years old", "if you have kids ranging from 3-9, Legoland is probably the best option around for them. We Liked the park, clean and tidy, great staff. Our daughter is 9 and even though she liked the visit, it was not the most exciting thing for her group age. It is surely a park for small children. LEGO makes sure its main value is there: all rides and attractions are part of an educational effort. The downside of the park is LEGO selling - for some amount of money - people the right to skip lines. This is not ethical at all.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Great Family Attraction", "Legoland will amaze all visitors. The kids will enjoy the rides and you will enjoy the displays. It’s amazing how detailed the cities are from Las Vegas to Washington DC. They also have a great setup of the Star Wars movies with great detail. The weather was great and San Diego is really close by.\nShow less"], ["Reviewed November 25, 2017", 2.0, "Legoland collects the tears of disappointed children!", "Where are the clear signs that state how tall you are to ride an attraction at this park? My family stood in line for multiple attractions and got all the way to the front of the line to be told that my son was too short, a mohawk away to ride the ride that my husband and I help prepare our son for. There are polls with numbers and says this tall to ride alone, but your staff were not well aware on what those signs said. But thankfully my husband and I have raised a great son who can self regulate and can be able to understand that he can come back to your park at another time. Until then while you do construction, make sure you provide more clear signs that prepare the children and the family to set up the conversation that they need to eat more vegetables to be taller to ride your rides!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Family Homeschool trip", "Great trip, we really enjoy the cleanliness of the park, the healthy food choices and the rides. Many of traction's were closed and we did feel like we missed out on some things. Overall was a great day.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Fun place for all", "Been to Legoland 3x the past two years. Clean. Well maintained park. Highly Impressed of their Star Wars outdoor exhibit. The LEGO made cities everywhere. This place is such in high standards I’m still in awe it is close to me. I’m glad we don’t have to travel thousands of miles away for my kid to enjoy this! Highly recommend!\nShow less"], ["Reviewed November 24, 2017", 4.0, "Amazing LEGO displays", "Wow!! Definitely should check it out! What can be built with LEGOs. A really cool exhibit of Star Wars and different skylines of major cities. Rides are definitely for younger children. Very busy. Younger children would have a great time. Half day."], ["Reviewed November 23, 2017", 5.0, "Fun For the Whole Family.", "Great Weekend Weather was warm. Plenty of Sun and Fun for everyone in Our Group. A great Family trip festive for Holiday week. Kids excited and park great Southern California Getaway."], ["Reviewed November 22, 2017", 5.0, "Excellent place to take your kids !!!", "This park has so much to offer! One day is NOT enough. We converted our membership to annual membership and got $ 75 of gift cards and free parking! Totally worth it."], ["Reviewed November 22, 2017", 5.0, "Legoland 11/21/2017", "Great service experiences throughout the day. The staff at the Ninjago ride was able to achieve the impossible and find my son’s sunglasses after we left. Jazmyn was sweet with my kids at the Batman pics by 4D Ninjago. Elby was warm,cordial and funny at the Heartlake shop at the end of a long day. Finally, Camelia at the photo shop was so helpful and generous with my twin 5year olds. Wonderful day! We will be back!\nShow less"], ["Reviewed November 22, 2017", 4.0, "Fun for younger kids", "The attractions are aimed at younger kids and our son loved everything he went on. The first day we were stuck in queues a lot. The second we hired a stroller for our 5 yo and a reserve n ride which was worth every penny. We were able to do smaller attractions and meet characters while waiting for rides and then walk right on when it was our time. Without fail the staff were friendly and helpful, and very patient.\nShow less"], ["Reviewed November 21, 2017", 2.0, "Overpriced, under-performs", "Way overpriced for what you experience. The park itself has actually few rides. They space everything out to make it look bigger than it is. The few rides they have, quickly get full and you have to wait 60+ minutes for a 90 second ride. I really disliked the food most of all. The options are all spaced out. Say you are with a party that wants burgers and pizza, you have to go to two different ends of the park. And yes, expect to wait at least. 30 minutes for that too. Also, why is parking 18 dollars? There is nothing there! It's just another cash grab. Very disappointed overall. But I will say the staff are great. They do try very hard, and are very friendly.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Great fun for kids age 1 and 5", "My one year old loved walking all over the park and enjoying attractions meant for his age. He was tired by hour 1 of just walking. My 5 year old also enjoyed most games and the games she was attracted to had no lines she rode the marry-go-round about 5 times and no lines! It was a good day for them.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Incredible adventure for little kids", "We visited the park with 5 kids ages 3months, 1.5 , 2, 7 & 8 years old. So much to do, one day is not enough if you want to do everything, but for the little ones it was great! Places for parents to sit and relax and while giving kids the opportunity to build and explore from a very safe distance. Food at the park is great! Rides were awesome and all in working order. The lines weren’t too long and the park and bathrooms were very clean! We prefer Legoland to Disneyland while kids are this age. Not as overwhelming and they’re actually able to do stuff!\nShow less"], ["Reviewed November 19, 2017", 5.0, "Toddler paradise", "My son is Two and he loved it. There was a lot for him to see and do. We are also a vegan family and usually struggle to find good food but the stir fry place tasted great and was reasonably priced.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Good Times", "We had a great time. The kids really had fun and many of the rides were good for them. Its a great place for the entire family."], ["Reviewed November 18, 2017", 4.0, "Fun!", "Not the biggest amusement park which is not necessarily a bad thing. There are water features that people can enjoy even if they don't pay for the water park. Could have used a few more rides, but overall really is a great experience even though it is very expensive. They do have a lot of deals coupons and discounts though if you know how to look for them.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Fun but old and unorganized", "It was our first time in Legoland California so we had a lot of expectations. The park is undoubtedly really fun for kids however we were a bit disappointed because when we arrived the LEGO ninja attraction was not working and they had no idea if they could fix it or not (not fun since my 8 years old boy was just interested on seeing it) however they asked us to checked the app flecuently to be advised. That never happened so at the end of our day my son wanted a picture with kylo (on of the LEGO ninjas) and we went back to the ninja area and surprise the attraction was open but on the app was still closed. The cameras for the pictures were not working but still we had fun.\n\nOn the other hand I am not sure if that was because we when on low season but there where just 2 characters on the entire park and on one the photographer wasn’t even there so we couldn’t take advantage of the photo package we bought.\n\nThe tales and the mini land is something really to admire however it looks old and the colors are washed away, hopefully they will replace it soon.\n\nExtra to that the coasters are fun (specially the one at the castle) and you really need to try apple fries\nShow less"], ["Reviewed November 17, 2017", 5.0, "Kids bday", "Our kids just turned 6 & instead of bday parties we took them to legoland. We went on a weekday & their were no lines & we all had a fantastic time. This is great for kids ages 3-8. I highly recommend coming on a weekday when it’s less busy so you don’t have to wait.\n\nShow less"], ["Reviewed November 17, 2017", 5.0, "Amazing Lego Sculptures", "Just awesome. It is so amazing with what these people can do with legos. Miniland and Starwars were our favorites. Totally a must do. A large variety of activities can be done here. Research their website for more details of park activities. Not just for kids, but adults alike can have a blast here. All the staff seemed quite friendly.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Great park for younger kids", "I am and have always been a huge fan of Lego. When I was a kid I remember the book, Adventure in Legoland when it came out in the early 90's and always dreamt of going to visit Legoland. Now in my mid 30's I'm glad I finally had the chance to go, and to take my toddler along for the ride.\n\nReally, the trip was for my son. We had heard that Legoland was better for little ones than Disneyland and that definitely held true. There were more rides and attractions focused for his age and size (at the time around 38\" tall).\n\nYes, the park is not cheap to go to - food and drinks come at a premium, but the number of activities and rides for little kids is great and my son still talks about certain rides to this day. There are definitely some more exciting rides for older kids but for those looking for full on coasters and drops and scares, look elsewhere.\n\nWe will visit again the future.\nShow less"], ["Reviewed November 16, 2017", 3.0, "Worth doing once", "We went to Legoland today as part of a week long theme park trip in Southern California. Legoland was fine as a thing to do, but we were glad we only planned on going for one day. Be prepared if you go... they will nickel and dime you a lot. They won't even let you snap a pic of the screen when your face comes up after a ride. I get that they're trying to make money, but lots of theme parks let you snap the pic of the screen or have more reasonable daily photo rates... Legoland was $35 for your photos for the day!! Also, the staff aren't nearly as good as those at the other parks (especially Disney). We heard staff shouting to each other about breaks, and who was joining what department etc etc. Very unprofessional. Not at all like Disney where everything is so carefully crafted and calculated. If you have young kids under 10, and are traveling in the area, plan on spending 1 day here - not more.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Great for young kids", "Great place if your children are young. Our 3 year old can go on almost any ride there. Once kids are close to double digits in age they will probably start losing interest"], ["Reviewed November 15, 2017", 2.0, "Customers not a priority during \"off-season\".", "My family spent a week in the San Diego area in early November, taking in Sea World, LegoLand, the San Diego Zoos and other attractions. Each attraction met or exceeded our expectations except LegoLand. The park was not overly busy, but it seemed LegoLand believed we needed to wait in line at least 45 minutes for any major ride regardless. They choose to either not have all the cars going or not have enough staff available to man each ride. For example, the kids power tower ride had 3 separate power tower unit, but they only had one open (needed one employee per unit I would assume). Absolutely no evidence of any construction or reason why the others could not be open. So, we waited in line 30 minutes for the ride when the short line should have moved much more quickly and been about a 10 minute wait. We also learned quickly that the sign at the beginning of the ride saying the wait was \"blank minutes\" was never close to accurate.\nSimply put, it was clear that LegoLand was not operated with the level of care of efficiency that we encountered at all our other attractions. We would not return and would recommend to others to skip this park.\nShow less"], ["Reviewed November 14, 2017", 1.0, "Park is pretty nice, but paying $18 for parking is ridiculous", "We got a half year pass but every time we go, it's $18 for parking and you sit in line for 10 minutes because they're too cheap to employ more than one person.\n\nSo we spent extra, only to find out you still have to pay that $18 parking every time, then to top it off they arent even open that many hours... not impressed\nShow less"], ["Reviewed November 14, 2017", 4.0, "Class Fieldtrip", "Students really enjoyed the robotics class. There was a miscommunication in the beginning on what time the class was so we missed 30 minutes of it but the manager was kind enough to find us another class later on during the day to come back and finish the class with our students.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Everything is Awesome!", "Amazing experience of everything Lego. Lots to do for adults and kids. Bring comfortable shoes as there is a lot of exploring to do."], ["Reviewed November 13, 2017", 4.0, "So much fun for our little one", "Our 4-year-old granddaughter had been playing with Lego pieces and its people for several months, so visiting Legoland put her IN heaven! She was able to identify the various stories depicted in the Fairy Tale Brook boat ride, really liked driving her own car, \"flying\" in the rescue helicopters, and aiming water sprays at her grandfather while he rode in the \"Splash Battle\" ship. Making shapes with varying sizes of Lego pieces also held her attention.\nShow less"], ["Reviewed November 13, 2017", 5.0, "enjoyable", "we enjoyed the park. there was something for everyone. food was priced to expectation. we did 2 days and that was ample."], ["Reviewed November 13, 2017", 5.0, "Legoland Girl Scout day", "Excellent day for our Brownie Girl Scouts. I was very impressed with the robots that they built! The girls loved it!"], ["Reviewed November 12, 2017", 5.0, "Love Legoland - More Clarification on Opening Times", "We love Legoland. Our daughter is 6 so we still have a few more years where she will enjoy it. Her taste in rides has changed through the years and she was very excited to move up to the regular driving school this year. We were disappointed that the opening time said 9am but only 2 rides (coast cruise and Ninjago area) and the entrance area were open. This forced huge lines. At 9:30am the Explorer and Heartlake City were opened. Not until 10am did everything open up. It states that only select rides/areas are open early but I had no idea it was so limited. Why couldn't Miniland be open, something to help with the huge lines this created early in the morning. Otherwise we had a great visit and will be back again....until our daughter outgrows it.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Overnight VIP Experience", "This was our first visit to Legoland and we definitely did it right. Our host Billy was amazing and Factory tour in charge Renata is amazing. She made my kids feel so welcomed. Billy made this trip fun for the kids. We are definitely coming again. Becca Blumer helped me organize the whole experience. I am very happy with their service and the amazing professionalism they have while providing fun.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great trip!", "My husband and I took our two year soon. We all had a great time an are definitely planning on going back soon."], ["Reviewed November 11, 2017", 3.0, "Improvements needed", "Totally for ages 3-5, but not much for adults. Visually pleasant, clean and lots to look at. Just expected more from this place. The store merchandise was kinda lame especially for apparel. The granny apple fries were the best!! Since rides are slow and don't seat too many people, lines tend to be very long. The reserve and ride is a scam, how are you going to charge such ridiculous prices for various wait times for rides that aren't that cool anyways?! Disneyland fast pass is $10 and rides are way better than this place.\nShow less"], ["Reviewed November 11, 2017", 3.0, "Disappointed", "This place was not what we expected. It’s expensive to get in and although the weather has been great this fall they shut down a few things the rides are not adult oriented at all. This place is good for up to 6 year olds really. Maybe 7. All the games are pay more which is ridiculous when you’ve didn’t all this money already.\nThe aquarium is near but small and if you’ve been to others it’s not worth the extra.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Good for the younger crowd", "This theme park is geared towards the younger crowd primarily. With most rides being more suited for the 8 and younger crowd. We did however find a couple of faster roller coaster type rides that even my 12 year old enjoyed."], ["Reviewed November 10, 2017", 5.0, "\"HAPPY BIRTHDAY LISA AND CASH!\" 🎈🎂", "We Celebrated Lisa's 53 birthday with our Grandson Cash! We had a really fun day! The fish Aquarium was Awesome, but Honestly Lego Land is definitely for the 10 and under age group, we skipped the rides because the lines were way to long and took to long to get a turn so we walked around and looked at Lego Mini Land with models of Vegas and San Francisco and New York, we really like the tribute to the Twin Towers Freedom Tower although everything was very faded from the sun and looked very run down and worn out and the waters were very dirty, for the price i would recommend Disneyland!\nShow less"], ["Reviewed November 10, 2017", 1.0, "Employees that run rides need to learn manners", "This amusement park is the worst of the worst. Long lines for mediocre rides. The ride attendants are all on power trips that I’ve never seen at any other amusement parks. I had my baseball cap and they basically threatened me if I didn’t put it in their dirty cubbies. I will never return to this place. No wonder LEGO is in such bad financial shape=bad culture.\nShow less"], ["Reviewed November 10, 2017", 3.0, "Had Higher Expectations", "This was likely our one and only visit to Legoland. Our kids are 5 & 7 and our five year old is obsessed with Legos. We visited on a Thursday and though it didn't feel crowded to walk around we were shocked that a few rides had a 45 minute wait! Since we had visited Disneyland earlier in the week our kids were not up for waiting that long to go on smaller scale rollercoasters. To top it off we waited in line over 40 minutes (the line had approximately 20 people) to get a fast-food burger and fries at the burger stand in Castleland.\nWe did like the cleanliness of the park and staff was very friendly in wishing our daughter a Happy Birthday. We also liked seeing the area landscaped with Lego creations.\nA couple suggestions, if you want to buy a Lego set unless it's rare and hard to find I'd recommend buying it online or from your local retailer for way less money. Secondly, if you're looking to trade a Lego figurine bring your worst looking figure and expect the same in return. The kids liked the idea of swapping but the options they had were missing an arm or quite worn with just a head, body and legs. No hat or hair nor any accessories.\nWhile we can now say we've been there and done that our kids were most looking forward to leaving the park so they could get back to the beach to swim. Had we known even on a low volume day wait times would be 45 minutes for ride and food we would've bought both kids $200 Lego sets and stayed at the beach instead.\nShow less"], ["Reviewed November 9, 2017", 2.0, "Dated", "This place is fun to walk around and see all the LEGO figures. But everything is so dated. Needs a big renovation. $100.00 per adult to get in. Not worth it. Walked around for a couple of hours and it was over. Saw everything. Rides old. Park old.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Absolutely great for small children!", "My wife and I brought our four old grandson to his first experience with Legoland California last wee. His first airplane trip! He just loved Legoland and thoroughly enjoyed every minute there. We visited the park for two consecutive days to ensure he could experience the entire park, and all that was offered for someone his age. There are rides designed for older children and many are age specific so that the whole family can find fun. There is a lot of walking so follow the guidelines for comfortable dress. Snacks and food can be brought into the park. Every section has a restaurant of some sort, but be aware as prices are high. Check the weather for your visit and pack accordingly\nShow less"], ["Reviewed November 9, 2017", 5.0, "good place for seniors to visit", "As a senior you may enter Legoland & stay for about an hour & then get your entry fee returned, this gives you time to visit gift shop for the grandchildren at home, walk fast & see a lot"], ["Reviewed November 9, 2017", 4.0, "The kids loved it!", "Remember this is a small place compared to many parks but the children loved the legos and various child friendly rides. Go midweek to avoid the crowds."], ["Reviewed November 8, 2017", 2.0, "Lots of good but what's with the food?", "My son loved Legoland, we met some characters and he went on lots of rides. He had a great time, we were also pretty impressed with all the Lego creations. The one main drawback was these signs at every food kiosk and restaurant in the park. I realize they put the signs up because it's the law to disclose in California which is great but they don't have to use foods that have chemicals that cause cancer and reproductive issues in people. Namely the 1000's of kids who visit daily. I was totally disgusted to read this. I asked an employee which foods and he had no idea, saying they had to put the signs up because some of their cleaning chemicals had those things in them, well there are also many other options for cleaning that aren't known to cause cancer. In a child's park I was pretty stunned to find these signs at not just one or two kiosks and restaurants but every one, I think better choices could be made for everyone's safety and peace of mind. Thumbs down for legoland.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Better than Disneyland", "No issues with anything super easy to find someone great help no lines foods pricey but I’d rather pay those prices then go to Disneyland anyday"], ["Reviewed November 7, 2017", 1.0, "Multiple transactions to my card BE CAREFUL", "FYI! Be careful when giving your card upfront. I paid my entire hotel fees and tickets weeks prior to our stay (not cheap). During the second day Legoland Resort, Legoland made multiple transactions to my account $295.00 each transaction. I immediately talked to management in the hotel and I they couldn't figure out what had happen. I had to wait a long time for them to refund my money.Again two days later, they continued to take money from my account. At the end, my bank took care of me and they had to replace my card. Be careful when booking your stay at this hotel.My vacation became very stressful!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Robotics Lab Visit", "This trip was a field trip for 7th & 8th graders to the Robotics Lab. Our instructor was great (and patient). The students all had a great time programming the challenge board! I highly recommend it. The students even got a little time before and after to go on the rides. I also heard that LegoLand has the best hamburgers ever! :)\nShow less"], ["Reviewed November 6, 2017", 4.0, "Birthday at Sea Life", "It was an amazing day. Our host had the most patience with 12 kids all under the age of 6 years old. They toured us all through the aquarium, went over facts and we did crafts is a really cool lite room!!! After the tour we went to the patio for lunch outside. The spread was amazing and the cake was unbelievable. It defiantly surpassed my expectations. I would have spent just as much for a home birthday and I didn’t have to lift a finger.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Scout Day at Legoland", "What a fantastic day! Our Cub Scout pack spent the day at the park. We had a fabulous robotics workshop while we were there. The staff was very friendly, patient, and easy to work. All scouts first through fifth grade were able to complete the Lego project and program it to move and perform. Most of our scouts were asking to do it again instead of riding the rides. We will definitely be making this an annual outing for our pack!!\nShow less"], ["Reviewed November 5, 2017", 5.0, "The kids loved it and so did we!", "This place was fabulous for our younger set. (I left our teen home with Dad and am glad I did.) I met up with the cousins and we had a blast. There were plenty of rides perfectly sized for ages 3 to 10 and legos everywhere to keep them engaged otherwise. It's very well set up and the lego town creations are awe-inspiring. So happy we made it here with our littles. I don't know that I would recommend Brick or Treat however. It was crowded and while the kids enjoyed getting dressed up, the brick or treating held no bricks, just uninspiring candy. My 10 year old was very disappointed in the starbursts and laffy taffy being handed out at the end of very long lines. We loved Legoland but probably wouldn't have bothered with brick or treat.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Awesome!", "At the end of the day in front of ninjago ,Francisco was asking how mine and my family's day was , he was very helpful with information. Francisco had also helped us with finding a place for dinner because we are not from around here , overall made our night very fantastic visit ! Excited to come back and visit again , and see these awesome people !\nShow less"], ["Reviewed November 4, 2017", 5.0, "Amazing day with 7&3 year olds", "We spent a day at legoland with our daughters and loved it. We arrived a little before opening and did our first figurine exchange before we could ride rides. The rides were all great with not too bad lands. The play areas are nice and plentiful. The aquarium was fine - it was free for us with a pass we had but I wouldn’t pay extra. Overall highly recommend d legoland.\nShow less"], ["Reviewed November 3, 2017", 4.0, "Weekday Visit meant no lines for rides!", "Just visited with my 4 year old grandson on a Monday and it was wonderful not to have any long lines. 10 minutes was about the longest line and that made for a relaxing and special day. Legoland has something for all ages so finding rides for the young ones was easy. Both young and old are impressed by the wonderful lego creations.\nShow less"], ["Reviewed November 2, 2017", 2.0, "Needs improvements", "This is our third visit this year and each time I come home disappointed. Throughout the park it is very visible that the upkeep is not a priority. The attractions have large amounts of dust, cobwebs, etc... I assume sweeping isn’t important. The rides that are near water stink! Standstill green water that stinks is not how you want to spend 20 minutes of your day waiting to ride the boat. This park needs paint!! Attended the Brick or Treat only to be even more dissatisfied. My son received smarties, dumb dumbs and a few starbursts. No chocolate or other alternatives given. Unless there is a major change then we won’t be attending brick or treat event next year.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Great place for kids under 10", "We had 2 days tickets, My 6 yo son just loved it!\nWater park was a bit cold though\n\nWe also joined trick or treat night\n\nThe only disappointment was huge lines, especially in water park then your kid is wet, standing and waiting is not something pleasant\nSo we decided to come on Monday to avoid waiting time and it was really wise.\nMany different activities for ages 2 to 10, but probably after 10 it wouldn't be so exiting\n\nShow less"], ["Reviewed October 31, 2017", 3.0, "Brick or Treat", "Candy was Jolly Ranchers and Red Fish. Last year was lollipops. However, they gave out Lego key chains. This year there was no gift and you literally only received 3 pieces per station."], ["Reviewed October 31, 2017", 5.0, "Met family at Legoland for the nephews 5th birthday.", "We flew to San Diego and went to Carlsbad to meet family to celebrate our nephews 5th birthday. The park is very clean and a lot of fun for both kids and adults"], ["Reviewed October 31, 2017", 3.0, "business hours", "The only thing i feel you should change is to stay open longer. You close at 5 pm and that doesnt leave anytime for late trips.\nShow less"], ["Reviewed October 30, 2017", 4.0, "Legotastic", "October 2017 attended with kids 7, 9 and 10.\nRides are much tamer than some other parks but kids still have a great time.\nThe lego displays are fabulous especially the star wars area.\nGetting the free refill souvenir cup was well worth it..must have refilled it 10 times.\nGet in early for the lego workshops..they fill fast.\nPlenty of places to by food and drinks.\nHeaps of places to buy lego, including some park exclusive figures.\nStaying in the attached hotel was so great when the kids got tired. A bit of a rest and a swim got them all set for mire of the park. Haveing the aquarium attached was also a great break from rides.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Brick or Treat nights", "A lot of fun activities for kids, good shows, good atmosphere. It has really improved since last time we went about 2 years ago!"], ["Reviewed October 29, 2017", 3.0, "Halloween trip", "It was nice but my kids were expecting to get more candy specially on the last hour do to that most of the stations were still pretty full of candies"], ["Reviewed October 29, 2017", 3.0, "Brick or Treat was a Difficult Experience!", "We were Annual Pass holders and offered $8 tickets to Brick Or Treat and can only be bought online and their site was so difficult to buy and navigate for the deal. Then to renew the online purchases st Guest Services was a Line day off. Next you had to go inside and stand in another line to redeem the tickets for a wristband and that took forever. The absolute lame part was the Candy / Treat station...most had a freaking maze to walk through and it was literally their attraction lines and it made us felt like a Hampster or per mouse. Event was pretty poorly planned and the stupid mazes are the absolute worst. However, my son ranked it a 10/10 because he's 7 and had fun and that's all that really matters! It's for the kids and my son is happy!\nShow less"]]}}