{"Little Italy": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Little Italy", "url": "/Attraction_Review-g60750-d274103-Reviews-Little_Italy-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/1e/e2/19/san-diego-little-italy.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1492"}, "address": {"@type": "PostalAddress", "streetAddress": "1668 Columbia St From Laurel south to West A Street", "addressLocality": "", "addressRegion": "California", "postalCode": "92101-2502", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Disappointing", "It is just a lot of Italian restaurant. The best place is the fried chicken restaurant on Kettner and Ivy."], ["Reviewed 4 days ago", 5.0, "Sops, restaurants", "Little Italy is an upscale area with lots of renovated buildings. Lof of shops and restaurants. Many bars with outdoor seating."], ["Reviewed 1 week ago", 4.0, "sort of like Bourbon Street in New Orleans", "We went for dinner and had a lovely meal. The place is a zoo though. We were there during a huge convention and the place was packed. It is fun if you like night life."], ["Reviewed 1 week ago", 4.0, "Fun place", "There are lots of restaurants, bars & dessert shops within all walk in distance. Fun experience to check it out if you enjoy a good meal and what to see where all the people are hanging."], ["Reviewed 1 week ago", 4.0, "a fun place", "This area of San Diego has boomed in recent years. There are many restaurants there along with shops and living units."], ["Reviewed 1 week ago", 3.0, "Don’t go out of your way.", "Just an area full of restaurants and bars. Not worth the effort and pavements were heaving and had to keep walking in the road."], ["Reviewed 2 weeks ago", 2.0, "Not too impressed", "I heard a lot about this and didn't end up being impressed at all. There were many, many restaurants though."], ["Reviewed 2 weeks ago", 4.0, "Lots of places to eat", "Little Italy ranges over quite a few blocks in San Diego. There are lots of places to eat. My suggestion is to eat small things at many different places so you can sample lots of food."], ["Reviewed 2 weeks ago", 5.0, "Little Italy highlights", "Walk along little Italy and take in all the shops, here are highlights! Definitely hit up the weekly farmers market on Saturdays it’s a big one!\nGelato at Zucchero -one scoop of chocolate and one of hazelnut they have another flavor that’s chocolate and hazelnut combined, I happen to like the strong, distinct flavor of both individually, but my friend likes the mixed flavor so to each their own. Pizza at Filipis Pizza Grotto - long time family shop with extremely cheesy pizza and fun atmosphere there are wine bottles hanging from the ceiling everywhere it’s a fun place, you do have to wait in line, the line winds through a shop of imported Italian goods. You will smell dried fish and other imported goods, it really gets the appetite going and has a great theme.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Saturday Night- Little Italy San Diego", "We like to walk, see, smell, and taste an area so we sojourned to Little Italy.\n\nWe walked from one end to another looking into many places.We had a drinks at two different restaurants, dinner, and dessert at a separate place.\n\nIt really needs a few restaurants with music to make you feel like it is a destination.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Our favorite district of San Diego!", "We stayed at the Best Western Bayside Inn right next to Little Italy, and really enjoyed the restaurants and gift shops there. For us, it seemed cleaner, less congested and not as expensive as the Gas Lamp district."], ["Reviewed 2 weeks ago", 4.0, "a place to go.", "Relax have a good meal, walk around its safe and a lot of people around. My wife and I really enjoyed ourselves taking is the sights of Little Italy. its about 3 blocks behind the Hampton Inn were we stayed."], ["Reviewed 2 weeks ago", 4.0, "Fun strip in downtown San Diego", "Glad we decided to visit. It was crowded on a Thursday with what seemed like mostly locals. It was fun to just stroll along and people watch and enjoy the sites. Restaurants range from vintage Mom&Pop to modern boujee. The \"fancier\" restaurants had very long waits to get in (minimum of 1 hour or more), while the smaller joints had tables ready when we walked in. I loved that many smaller venues had little stores/delis attached. If we weren't flying home the next morning, we would have bought a bunch of food. Don't miss Mona Lisa's on the end of the strip, very good traditional Italian!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great food, fun", "Our hotel was in Little Italy so we experienced this all 3 days. From the great selection of Italian food to the HUGE Saturday market it was so delicious and relaxing."], ["Reviewed 3 weeks ago", 4.0, "Great Spot", "We always try to visit Little italy in any of the major towns that we visit. It is alway a pleasant experince if you are eating, people watching or looking for good Expresso or Capuccino San Diego's Little Italy was NO EXCEPTION!"], ["Reviewed 4 weeks ago", 4.0, "Large Selection of Restaurants", "So many good choices of Italian restaurants, all seem to be popular. We happened to be there after the Women's March which meant long waiting lines everywhere."], ["Reviewed 4 weeks ago", 3.0, "walked around and felt like we never quite found it", "despite the map saying we were there, it felt like a bunch of restaurants and I guess I was expecting something more."], ["Reviewed 4 weeks ago", 4.0, "Unique area in downtown San Diego!", "Very cool neighborhood! We went at night (probably the best time to go). It was hopping at night, beautifully lit up with lights everywhere, so many restaurants to choose from! You can't wrong with any of them - lots of great Italian food."], ["Reviewed 4 weeks ago", 5.0, "Authentic", "Such a neat venture to walk down the sidewalks, dine in amazing restaurants or pick up pizza slices!"], ["Reviewed 5 weeks ago", 3.0, "Beware of no parking!", "Went on vacation to san diego and stayed here. The food was really good and there are a lot of good bars, pubs and restaurants. The reason it didnt get a great rating is the parking situation in this city! I think its all of downtown! The hotel in little italy we stayed at had no parking. They told us to go find the $20 a day parking lot down the street! There is a few free parking spots, you have to stalk the spots, for hours!! People don’t leave those spots. Got a ticket for $40 one day and i put money in the meter for 3 hours!! The ticket was written before the 3 hours were up. So, my tip is go see san diego, go to little italy, but use uber. It will make your trip so much less stressful! If you want to drive out of the city, maybe drive up the coast, rent the car for one day.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Happening Spots", "The upscale party is here. Lot's of good spots around San Diego, but this seems to be the place for unique (and authentic) Italian, new hot finds, wine bars and a generally upscale experience. Loved it (oh and you can plane watch as it is near the approach path for KSAN...if you are so inclined)\nShow less"], ["Reviewed January 22, 2018", 3.0, "Neat area with lots to see.. Parking stinks though...", "We come down to this area to visit Ballast Point and to have lunch. We walked around the area for quite a while and did enjoy the lively atmosphere. They are doing quite a bit to this area in regards to new buildings (condos/apartments) from what I understand. While this can be good for many reasons, I feel you do lose the nostalgic feeling of this area. I guess you have a trade off as to what is important to you. This area did host a ton of restaurants and I'm sure you will find something you like. As the name of the area suggests, there is lots of Italian places to try, but also there are some other offerings. We certainly did not see the whole area while here, but it was fun to visit for a bit. To note, this area was very very busy (it was right around noon) and the traffic and parking (pretty pricey) was somewhat of a headache. Perhaps if we were more familiar with the area we woudln't have found these things a problem at all.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Great stalls at the farmers market", "We visited the farmers market which had a great range of stalls. Unfortunatley it was the day of the big march in San Diego so all the cafes and restaurants were really crowded and had a 40 min wait. We found a restaurant off the beaten track instead, The shops and eateries looked really interesting, but the place was really crowded. Walking distance from the city which was great for us as tourists.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Nice little section of the city to visit.", "We visited little Italy for the reason probably most people do, to eat some good Italian food. It is a charming little section that I was surprised San Diego even had a little Italy. Many options for dining and a pleasant place to explore for a meal or dessert.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Really fun to walk around and grab dinner", "I really like this area for an interesting walk around and then grab a delicious bite for dinner. Filippis is my favorite but that might be because I have been going since I was a kid."], ["Reviewed January 11, 2018", 5.0, "Vibrant", "Little Italy at night is a sight to behold. The neighborhood comes alive with an irresistible energy, as pedestrians scamper to the many modern bars and restaurants. I visited Filippi's Grotto and felt comfortable in their cozy dining room, eating incredible pizza and enjoying the fun San Diego vibe that Little Italy exemplifies. One thing to note, though, is that the neighborhood is in no way modeled after the country of Italy, apart from a disproportionately high amount of Italian shops and restaurants. However, as long as you know that, the area is an exciting place to be, whether you spend an entire night exploring or come just a short walkthrough.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Worked for us", "We stayed at the Hampton and enjoyed several excursions into Little Italy, over the course of 7 days we ate here several times and enjoyed all our meals. Got to sample the Saturday street market and that was enjoyable."], ["Reviewed January 9, 2018", 3.0, "Too Busy", "So much development has been happening here and it really has taken away so much of the charm and ambiance."], ["Reviewed January 9, 2018", 4.0, "Small but lots of restaurants", "e ended up on our last night in SD. Our food tour guide said it is the second largest Little Italy in the US after NYC, which I find hard to believe because my impression was that this is a small area. Its smallness was evidenced by my ability to actually find parking relatively easily, which never happened in SD.\n\nAnyway, there is a good number of Italian restaurants, as one would expect, but surprisingly, there are maddeningly few sit down restaurants that serve thin crust pizza. It's a slice and go town, or so it seems.\n\nMy memory of Little Italy in SD will permanently be marked by the fact that after pizza I stopped for gelatto at a restaurant called Sol---- (half restaurant, half ice cream/gelatto place with a bakery) and got deathly sick from food poisoning later that night and the whole next day. The wife and I had the same pizza so it was not the pizza from a different restaurant.\n\nThe next day was our departure day and I was sick as a dog, which made travel absolutely miserable. That's my story about Little Italy in SD. At least I lived to tell it. On departure day I was not sure that I would survive.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Easy Walking - Fantastic Eats", "Little Italy is one of our new favorites when in SD. Cute shops, great area and some kind of awesome food scene. The area is clean and not as many homeless hanging around as in other similar areas of SD."], ["Reviewed January 4, 2018", 4.0, "Both Hip & Old World", "This active neighborhood of San Diego comes alive with restaurants, cafes, boutiques, shops, and hotels. Across from the Italian Catholic Church there's a delightful park where you can play bocca ball or just sit and watch the world go by. You have a choice of eateries from coffee houses to modern glitzy restaurants, such as \"Born & Raised\". The flower pot decorated streets (most of the year) are adorned with Xmas splendor in December. The only downside is the lack of parking as street parking is limited and the lots are few and small.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Resturants galore", "Great resturants note to choice from .parking can be tricky best to take a Uber or something you could be circling for a while There is lots of people very busy area"], ["Reviewed January 3, 2018", 4.0, "Awesome", "What a great area. Fabulous restaurants cars shops etc. Go have fun make a day of it! Enjoy the scenery and the big red chair!"], ["Reviewed January 3, 2018", 5.0, "Super fun walking area", "This area is super fun to walk through and grab some good Italian food! There are some little shops, but mostly restaurants."], ["Reviewed December 30, 2017", 4.0, "Great area for dining, though a bit commercialized", "This is a great historic area and there is plenty of food, though a bit commercialized for my taste, pun intended. You will find good food here but I wouldn't compare it to the Italian fare I am used to at home."], ["Reviewed December 30, 2017", 5.0, "Dinner", "Great restaurants & very walkable from Gas Lamp District. Enjoyed all of the restaurants we went to in this section of the city."], ["Reviewed December 28, 2017", 4.0, "Great place to visit... don't miss the Saturday market", "We visited on a Saturday so took advantage of walking through the farmers market. Unfortunately we arrived around 1:00 and the market closes promptly at 2:00 so we didn't have an opportunity to really shop as much as we had hoped. The market is amazing with a variety of fresh produce, various jewelry, clothing and gift items, artwork and a variety of other items to choose from. Once the market closed we strolled through the area and checked out some of the shops and restaurants. So glad we took the time to come to this neighborhood. Caution... parking is very limited during the market.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Great place for dinner and a stroll", "Little Italy has some amazing restaurants and is in easy walking distance of Gaslamp and the downtown Harbor area. We went at Christmas and the lights and Christmas tree were great to see!"], ["Reviewed December 27, 2017", 5.0, "Walking.shopping,and people watching after lunch", "Very friendly neighborhood to walk and window shop,and have lunch at any of the nearby resturants. Theere is also a farmers market on Saturdays"], ["Reviewed December 24, 2017", 4.0, "Hipster neighbourhood in SD", "Nice strolling. People watching. Foodie restaurants. Galleries. Farmers market on Saturday morning until 2 pm was good."], ["Reviewed December 23, 2017", 5.0, "A must when you go to San Diego", "A great place to visit! The food is authentic and great! Filippi's Wonderful pizza and Italian food! Great place to buy meats and other Italian items."], ["Reviewed December 20, 2017", 5.0, "A really fun area", "We \"discovered\" this area several trips ago and have since fallen in love with it. Fantastic restaurants and shops and a great vibe to match. We've never had a bad meal or experience. Every trip to San Diego in the near future will most definitely include visiting the Little Italy area.\nShow less"], ["Reviewed December 19, 2017", 4.0, "Lots of restaurants here", "We had already eaten lunch in Old Town earlier in the day and got off the commuter trolley to visit Little Italy which was in one end of the San Diego downtown area. There were some signs advertising the Italian nature of this area but mostly it was Italian restaurants. As a result we did not spend much time here. One thing struck as rather amusing. The Consulate for the government of Mexico is in Little Italy. Hmmmm? How did that happen?\nShow less"], ["Reviewed December 19, 2017", 4.0, "Great foods in Little Italy", "The look of restaurant can fool you but the foods are Champ! We ordered eggplant parmigiana and meat raviolis - they were delicious. WOW!!! Bomb in our mouths"], ["Reviewed December 19, 2017", 5.0, "Mangia!", "Delicious pizza, tiny Italian supermarkets, lovely desserts. Walking around this area was definitely one of the nicest way to spend an afternoon"], ["Reviewed December 18, 2017", 4.0, "Restaurants galore", "We have eaten at different places in Little Italy. We enjoy walking around seeing all the different places, which include micro breweries, some museums"], ["Reviewed December 15, 2017", 4.0, "Great fun!", "This is a great little spot. We did feel a little underdressed (it was evening and lots of nicely dressed people)but we really enjoyed exploring this area. Lots of food venues, little shops and a good fun vibe. We had dessert and coffee at a cafe and it was yum!\nShow less"], ["Reviewed December 12, 2017", 4.0, "nice for a walk", "We took a morning walk through Little Italy during our trip, the poinsettia tree was great for pictures, and we also liked looking at the restaurants and some of the fancy cars driving by. It's a nice neighborhood for walking and certainly some great restaurants to choose from.\nShow less"], ["Reviewed December 12, 2017", 5.0, "Italy all over", "Great trendy suburb bustling with lots of Italian restaurants and enotecas. Always busy. Great food but parking is a nightmare"], ["Reviewed December 6, 2017", 5.0, "A great gathering place", "Little Italy was just a couple blocks from our hotel, and it is a happening place. Christmas decorations were out, visitors everywhere. Had three lovely dinners at a group of restaurants and thoroughly enjoyed people watching. It'a a great place to wander and look for a fun place for dinner.\nShow less"], ["Reviewed December 5, 2017", 5.0, "Beautiful at night!", "We walked the streets on a December night, lively, beautifully lit up, great choices for meals or goodies!"], ["Reviewed November 30, 2017", 5.0, "Fun Experience", "A must is the farmers market on Saturday mornings ..Little Italy is full of places to eat, & everyone of the restaurants is amazing"], ["Reviewed November 29, 2017", 5.0, "A Bustling Neighborhood", "We visited the Little Italy area twice in a few short days. Once, to have a long, lingering lunch and then a follow-up visit to experience a fabulous Saturday market. Both worked out well as walking in the neighborhood is a fun activity in and of itself. If you're there on a Saturday, you'll be surprised by the depth of food opportunities and the numerous vendors who want you to sample. Enjoy.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Little bit of Italy", "This inn downtown San Diego about10 blocks from the Embarcadero and the \"Big Bay.\" It is a colorful area with lots of the restaurants offering outdoor dinning. Watch out on Saturday they have a open air market day and parking can be tough, but worth going to. Once a year they have an street \"Art\" fair it's called \"Art Walk\" put on my Mission Federal - goggle it. It's in the latter part of April. Pretty popular event.\nThe restaurants are great and range from Portuguese to Italian and more. You can buy authentic Italian foods at some of them and at some local markets.\nThere is a \"Dick Blick\" art supply shop on one of the corners. As I mentioned it is very colorful and great to photograph and or paint. It's not far from the water of the \"Big Bay.\" were there is the Maritime Museum with the Star of India, the California, and some subs and then the \"Midway\" Air Craft Carrier also a museum. Great way to spend an afternoon. Take in a lunch on Saturday or Friday, Sunday or Saturday night dinner. Then stroll or take a cab up to Gaslamp District for the Bar and Dancing scene. Enjoy!\nShow less"], ["Reviewed November 24, 2017", 3.0, "Seems more commercial than a Little Italy.", "It's mostly restaurants and a few odd shops, but it really wasn't that interesting. I had hoped for a more authentic Italian experience. Other than the 3 Italian guys playing cards, it could have been any street in any town....."], ["Reviewed November 23, 2017", 5.0, "Italian Food? No, GREAT Itailian Food!", "This strip in San Diego has it all: the old, stand-by establishments with grandmother's recipes and the new, posh restaurants with amazing flare, knowledgeable staff and interesting entrees. Walk the streets at night (very safe) and enjoy the \"show\" of restaurant hosts waving their menus and describing their food. Each one seems better than the next. You can't go wrong. Oh, and the bakeries!\nShow less"], ["Reviewed November 22, 2017", 5.0, "Love this place.", "This is such a great place to walk around. You need at least a couple of hours. It is a must that you eat somewhere while you are there."], ["Reviewed November 19, 2017", 5.0, "Favorite Neighborhood", "Downtown San Diego has several Historic Districts and Little Italy is a favorite of mine as it has such a distinctive neighborhood feel. Lots of people out and about and certainly enjoying their restaurants. Wander down India Street to see the overhead Little Italy sign."], ["Reviewed November 19, 2017", 4.0, "Really interesting area with great food options!", "Great area with lots of food and bar options. being from an Italian part of Melbourne, Australia we felt right at home here. We tried seafood and Pizza options. All very good. You can walk or catch the trolley from Downtown San Diego."], ["Reviewed November 18, 2017", 5.0, "Great spot to walk and eat", "Do not miss this on your next San Diego visit. Check Yelp or Trip Advisor for food spots as this is a great foodie place."], ["Reviewed November 14, 2017", 5.0, "What a bustling location when they have their farmers market going, 3 blocks worth", "Little Italy has many little restaurants to visit, try figuring which to try is the problem all are inviting."], ["Reviewed November 13, 2017", 4.0, "Community & Good Food", "I enjoyed visiting here. I definitely sensed the community was tight-knit from the way people interacted with each other. It's a great stop on the hop on, hop off trolley tour and we shopped, ate, and had dessert."], ["Reviewed November 12, 2017", 5.0, "The closest thing to Italy in the US.", "Great selection of Italian restaurants, lots of fun shops, great people watching. Yes, there are real Italian folks here! We loved our four days staying in a hotel in Little Italy. There is a great Saturday street market with lots of local foods, flowers and products.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Little Italy", "We took the hop on hop off to get to this place and it was easy to get to on the bus as it 's one of the stops. There are a lot of Italian Restaurant where you can dine and shops to browse around. It was just timely that a craft fair was going on the street when we stopped there. Enjoyed having some Italian goodies and Gelato and Teramisu.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Great Vibe", "Really like the vibe. This is a great place to walk, have a drink or a nice dinner. I dont know that there is a ton of things to do here but definitely someplace to check out while you are in San Diego."], ["Reviewed November 10, 2017", 5.0, "Love Little Italy!", "This charming community gets cuter every time I visit. Great restaurants, bars and shops. It's a little gem in San Diego."], ["Reviewed November 10, 2017", 5.0, "Great food", "The resturants in little Italy are fantastic, you cannot go wrong in choosing the perfect place to eat. I eat gluten free and had many options. My husband does not eat GF and he had even more options. We found resturants that fit our eating requiremnts. Very friendly owner/operators and wait staff. Great place to stroll and work off that pasta, pizza or authontic Italian meal.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Most authentic Little Italy ever!", "Super-nice, authentic area with a great variety of shops, cafes and restaurants, many of them excellent and really authentic. With a vacation home in Italy I am (needless to say) a bit of a fan of what I consider to be one of the most wonderful countries in the world.\n\nWe had a great time in Little Italy, and the dinner we had at Civico 1845 was excellent, and the staff Italian all together. In addition to feeling authentic, the area is lively, clean and safe.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Great area to grab a bite to eat.", "We stopped here on our tour of San Diego for a bite to eat and to site see. We enjoyed them both. There are numerous restaurants and the area has been largely updated or restored."], ["Reviewed November 3, 2017", 5.0, "Great Walking and Dining Area", "Little Italy is a walkable, easy to visit neighborhood. There are plenty of Italian cafes, restaurants, and markets to help while away the time. The nieghborhood is very well maintained, and we really enjoyed how everyone came out in the evening to just walk, dine, and visit. Great for an evening stroll after dinner.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Were Everything is Going on", "If you are staying in the bay area you need to take a night and hang out in Little Italy. There are great bars and dining. A lot to do and hop from place to place. I would suggest take an Uber or taxi to get in and out. It was $20 to park for night.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Special Place Downtown", "What a beautiful area. Little Italy had some great restaurants that were great prices. My favorite was Flippee's Restaurant. The whole place was like eating with your family. The best meat raviolis. If you need to walk off your food their are great shops right there.\nShow less"], ["Reviewed November 1, 2017", 4.0, "Neighborhood of Italian restaurants and retail.", "Little Italy was vitually at our doorstep when we stayed nearby at Best Western Bayside.\n\nLittle Italy was originally a Italian fishing neighborhood but now comprises mostly of Italian restaurants, and Italian retail shops.\n\nWe dined at several Italian restaurant during our short stay in San Diego.\n\nGreat area to visit and a bit more laid back in comparison to the vibrant Gaslamp District and the nightclub scene.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Walkable, and close drive to everything else", "Home base for a recent 6 day stay in SD - one of those mod condo buildings that itself recently participated in so much construction tangle. Walkable, safe, near side streets, close enough proximity to Waterside park as well and an interior part a few blocks away. Lots of restaurants, a late night bakery, coffee spots and a happy drinking crowd if that's your thing. It's jut a nice little neighborhood, but yes, parking is tougher. (Though if your place comes with a spot, it's very easy to jump on the I5)\nShow less"], ["Reviewed October 28, 2017", 5.0, "Favorite Part Of Downtown Area.....", "Thriving area of great restaurants, bars and shops. Best farmer's market every Saturday, it's amazing. Parking is the only downfall of this area, especially with all the construction, but still work it!"], ["Reviewed October 27, 2017", 5.0, "Great place to visit", "Lots of shops and restaurants. The smells just walking down the street were great. Made you hungry and the portions were huge."], ["Reviewed October 26, 2017", 5.0, "Authentic Italian", "Being half Italian I was very worried that this was going to be the Americans version of Italian food, but I was so wrong. In this little piece of heaven I was taken back to my childhood living in Italy with some of the best Pizza and gelato I have had since leaving. Best place to visit for food.\nShow less"], ["Reviewed October 21, 2017", 4.0, "Great restaurant choices", "Walking into Little Italy on an evening is a total revelation as it seems other parts of San Diego 'shut down' early - the place is really buzzing with bars / restaurants doing a roaring trade - there is so much choice too with places to be found to suit all budgets.\nShow less"], ["Reviewed October 18, 2017", 5.0, "The BIGGEST \"Little Italy\"", "Larger then the New York, Chicago and San Francisco Little Italy but together, San Diego's Little Italy is centrally located in the heart of the city and close to everything you want to see and do.\nThere are so many restaurants and pizza shops it would take you over a month eating 3 meals a day to eat your way through it. There are some nice little boutique hotels and new condos being built to replace many of the older building that have been torn down. San Diego is going through a large rejuvenation.\n\nThere is lots to see and do.\nShow less"], ["Reviewed October 18, 2017", 5.0, "My favorite place to stay and visit", "Little Italy is a great low key place to stay. Some of the best food and coffee are in Little Italy. All of the shops were so nice and affordable and the best part is that It is so close to all of the other attractions in San Diego as well.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Enjoy the ambience", "We walked around Little Italy after dining at one of the restaurants and had a wonderful time. From the Italian WW II memorial to the little shops where browsing is not frowned upon, it was just a great visit."], ["Reviewed October 15, 2017", 3.0, "Not really an attraction", "Lots of good restaurants cafes and a couple of really good brewpubs, but other than that (which is fine) if this is meant to be an attraction, it's not. It's just a good place to go for a night out."], ["Reviewed October 12, 2017", 5.0, "Love it Love Love", "You gotta go here! Walk the streets and see how happy everyone is. Smiles and friendliness greets you everywhere. The shops and restaurants are fun and interesting. Well, the restaurants are delicious! Not a bad one anywhere. If you plan on having dinner, make your reservations early or you will have a wait. This is a place to visit. It's about tradition and enjoyment! Go Go Go\nShow less"], ["Reviewed October 11, 2017", 5.0, "An easy walk through LIttle Italy", "Stayed in the Little Italy neighborhood, which is centrally located and so very easy to navigate. The streets are lined with great restaurants and cafes, and the business people and staff are quite friendly."], ["Reviewed October 10, 2017", 5.0, "My San Diego Trip", "Beautiful and charming section of the city. This area has wonderful restaurants and shops. Don't pass this up when visiting."], ["Reviewed October 8, 2017", 5.0, "I Dessert", "My husband and I never miss grabbing some delicious desserts at i Desserts in Little Italy. It is gluten free, fun, and so delish! We used to share one dessert but we decided it is just too good to share! We started eating so fast I forgot to take a picture before we cracked into the meringue shell!\nShow less"], ["Reviewed October 7, 2017", 4.0, "Awesome walk, especially on a Saturday through the market!", "What a great surprise that on my first visit to this area, I get to experience their farmer's market. An entire street blocked off to give way to locals. Loved walking through it an experiencing the area. I will go back for dinner in one of the many genuine restaurants in town.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Great restaurants", "Great Italian food and groceries all in one area outfreakenstanding. Different sauce in each one if you don't find one you like it's on you."], ["Reviewed October 3, 2017", 5.0, "Worth the time to explore", "This is definitely a \"little\" but very eclectic and quaint area worth a stroll here in San Diego. It's currently undergoing some growth in the form of housing anyway, but otherwise it's an older neighborhood not without it's historic Italian charm."], ["Reviewed October 2, 2017", 4.0, "When you're in San Diego, see Little Italy, especially the Sunday Farmers Market", "Little Italy has a myriad of really good restaurants. The atmosphere is fun! Especially if you check out their Sunday Farmer's Market. Nice!"], ["Reviewed October 2, 2017", 5.0, "Girls bday weekend getaway", "What a fun little city to explore! We could smell the aromas of Italian cuisine as we approached! Fun and active site!"], ["Reviewed October 2, 2017", 3.0, "Very nice restaurants, but not really much shops", "If you only go there to eat, it is a great place with a lot to chose from. But if you think you can shop there, then a disapointment is waiting to happen. There isn't uch. And I even got the feeling that more other restaurants instead of Italian are getting in that area.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Italian dining galore - what to choose?", "Little Italy is apparently San Diego's newest hot spot, and that's confirmed by the throngs of people walking the streets, sitting in restaurants or almost hopelessly circling the blocks looking for a place to park.. And they're not to be disappointed, as the selection of fine restaurants and shops is exceptional. No visit to San Diego would be complete without spending some time - or food budget - in Little Italy.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Little Italy!", "We love going to Little Italy with all of it's great restaurants and shops. With the over development that is prevalent around San Diego in recent years, parking has become a major problem-so we don't go to Little Italy as often as we used to. On the weekends you may consider using Uber or Lyft or paying for expensive parking if you can find it.\nShow less"], ["Reviewed September 28, 2017", 3.0, "Food Galore", "Some great eats can be found here. The best stop was a Tiki Bar though. False Idol had the best drinks but reservations may be needed"], ["Reviewed September 28, 2017", 4.0, "FUN", "Walked through and ate at restaurants in Little Italy every night. Found most to be expensive with small plate size. However, well worth the night out. It was always crowded. Very well lit and a definite must do."], ["Reviewed September 27, 2017", 5.0, "Great slice of Italian culture and food", "We tried several restaurants in this precinct and all were noteworthy. Food was delicious! This little part of San Diego is full of great Italian stories - and the good thing is that Italian is still spoken widely."], ["Reviewed September 24, 2017", 4.0, "Busy area", "Been here several times mostly had dinner reservation. We drove by and saw street fair so we found parking which is very difficult and walked around for a look."], ["Reviewed September 21, 2017", 5.0, "Real Italians Live Here!", "I love Little Italy. I lived in San Diego for a while and watched how this neighborhood has evolved. It is much cleaner than it used to be. There are a ton of coffee shops, little restaurants and shops. It is fun to walk around and test out a few different places. You are guaranteed to hear some of the locals that have been rooted there forever speaking Italian. One of the most original ethnic neighborhoods still in existence in San Diego. Check it out!\nShow less"], ["Reviewed September 20, 2017", 5.0, "great food.", "For those of you who miss Mulberry street in Little Italy in New York. This is the next best thing,...just 300 miles closer"], ["Reviewed September 20, 2017", 5.0, "Beautiful Place to see in San Diego", "One of the nicest part of San Diego is Little Italy. Whenever I am craving real Italy food, Little Italy is my only choice for food. NY has Little Italy and San Diego has Little Italy. What stands out about Little Italy in San Diego the location and the people who come to Little Italy. If you are local or a tourist Little Italy it's a must place to visit.\n\nYou have numerous of amazing places from cafe's to fine dine dinning. If you are looking to just walk around Little Italy you will enjoy every minute you spend here. You can't ask for more friendly people who are always smiling and taking photos.\n\nOn Sunday's Little Italy has a beautiful Farmer's Market that is worth coming to see. From numerous vendors from jewelry to food, Little Italy has a lot of great stuff to do for families and adults.\n\nNo matter what you are craving from just a coup of coffee to warm slice of pizza you will be coming back again and again. For retail stores to candy stores. You have meter parking. Also have private lot parking for a fee.\nShow less"], ["Reviewed September 20, 2017", 3.0, "A good place to eat", "There are a couple of Italian groceries, but mostly this is a street with lots of places to eat. We had some excellent pizza. The area seemed pretty safe, although there are a lot of homeless people roaming about."], ["Reviewed September 17, 2017", 5.0, "Saturday night!", "What a great place to spend the evening! A fun atmosphere, lots of family friendly fun, but not stodgy. Enjoy dressing up, or stay casual, either seems fine. Good food, good wine, good vibes, good times."], ["Reviewed September 15, 2017", 4.0, "Nice walk around and good food", "Tried two random restaurants. Both were excellent. Very clean and safe area. Nice vibe in the area. Recommend to all"], ["Reviewed September 14, 2017", 3.0, "Average place", "It's just a small town of italian restaurants on both sides of the road. We parked off the streets and walked to little italy. Had our dinner in one of the restaurants and i would say the food taste 6/10. Perhaps i was expecting abit more or that the taste just doesn't suit me. However, there were many decos around the street which is more interesting than the restaurants itself.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Awesome place", "Lots and lots and lots of restaurants on the street. Very cool, the neighborhood is well taken care of and clean. Lots of choices for food, prices vary. Parking is HORRIBLE in this area. We went at night and just park, on the street is free but there is paid parking lots. During the daytime you will have to pay.\nShow less"], ["Reviewed September 10, 2017", 4.0, "Cool area", "Plenty of restaurants and shops. Parking is tight. Ride a bike or Uber if you can. Great area for al fresco dining"], ["Reviewed September 9, 2017", 5.0, "Great for walks and food! Saturdays during summer there is a Farmer's Market", "Little Italy is great for walking and exploring the neighborhood! There are a lot of churches, during Labor day there is a Stick Ball tournament and during summer there is a huge Farmer's Market! Close to the harbor and Gaslamp Quarter, as well to a bunch of other attractions!\nShow less"], ["Reviewed September 7, 2017", 5.0, "Little Italy is Great", "We love to eat and walk in Little Italy. When we walk we often stop and have a drink, many good places."], ["Reviewed September 5, 2017", 4.0, "Fun To Walk Around", "Easy area to walk around and people watch. Some great restaurant choices in the the area as well. Art galleries are tucked in here and there. There is always live music to hear as well. Check the calendar for the farmers market."], ["Reviewed September 4, 2017", 1.0, "Overrated", "There was barely anything to do or see. Did not feel like an Italian neighborhood and was very small. I expected so much more and when we arrived in the neighborhood I just said that's it?\n\nI see so many glowing reviews about little Italy and have no idea why. It's small, dirty, and lacks a neighborhood feel.\n\nIf you want to see what a true little Italy looks like then go to the North End in Boston. That is a perfect example of a Italian neighborhood.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Interesting walk", "Very interesting community In process of reconstruction updating the area very limited parking Several restaurants to choose from"], ["Reviewed August 30, 2017", 4.0, "Many places to eat", "Was close for us to walk from our hotel to Little Italy. There were many places to eat breakfast, lunch, or dinner. Of course areas for shopping as well."], ["Reviewed August 30, 2017", 5.0, "Brilliant neighbourhood", "This is the safest place that I have ever stayed when I have been away on holiday. The atmosphere here is homely and welcoming. There is a great selection of food, bars, restaurants and shops. Make an effort to explore here, you won't be disappointed."], ["Reviewed August 27, 2017", 4.0, "Taste for authentic Italian", "My family of 4 decided to visit little Italy while on vacation in San Diego for a taste of some authentic Italian food and this place did not disappoint. There are more than enough places to choose from. The whole area is great with most of the decorations resembling Italy. Place was immaculate and the people were all friendly and personal. Parking could be a little tough but still would recommend checking this place out . Excellent atmosphere. Enjoy eating. Chow\nShow less"], ["Reviewed August 27, 2017", 4.0, "Saturday Farmer's Market", "We took a nice stroll through the farmer's market through Little Italy. Several streets were blocked off and jammed full of vendors and shoppers. Had a good time and all it cost us was a little time and some shoe leather."], ["Reviewed August 24, 2017", 5.0, "A little bit of Italy", "Fun location with lots of eating choices. Very fun to stroll and grab a cup of espresso, a bite to eat and more. Parking can be a part of the challenge but worth it."], ["Reviewed August 24, 2017", 5.0, "True Italian Flair in an American city", "From hearing Italian spoken on the streets and in the restaurants, to the older gentlemen playing a leisurely game of scopa, this is truly a bit of \"La Dolce Vita\" in the middle of San Diego.\n\nWhile the area is not very big, it embraces it Italian heritage and all manner of shops, restaurants, coffee shops and gelateria can be found here. Very cool to hear the waitstaff be able to switch between English and Italian and even indulge visitors like myself.\nShow less"], ["Reviewed August 24, 2017", 4.0, "Cute Neighborhood", "It's still cute, but has become quite overwhelmed by the intensive development of condos. I guess the new residents add to the patrons of the restaurants and cafes. Nice place to eat and drink."], ["Reviewed August 23, 2017", 5.0, "Molto Bene!", "A MUST see in the day and the night! Great vibe here, the restaurants all seem to be outstanding, quaint and inviting with great menu options. We tried Barbusa and we loved it!"], ["Reviewed August 22, 2017", 5.0, "little italy", "great place to walk around eat drink , safe fun place, fillippi's restaurant awesome food, bought grinders to go beach every day. great food and cheese deli meat. nice people"], ["Reviewed August 21, 2017", 3.0, "Going, going...", "What is left of Little italy lies primarily along about six blocks of India Street; the rest of the area is being condo-iced rapidly. Good for restaurants and the weekly Farmers' market...not much else."], ["Reviewed August 20, 2017", 4.0, "Cute place to walk around and get some food", "We mainly came to get a nice Italian lunch, but we also enjoyed walking around the area and taking in the atmosphere. There are several bars where one can stop and enjoy a craft beer or a glass of wine, and we saw many groups of people bar-hopping and having a good time.\nShow less"], ["Reviewed August 19, 2017", 4.0, "Festive Atmosphere", "Since we were staying at the Doubletree Hotel at the edge of Little Italy, we spent some time exploring the neighborhood. It is a very pleasant area for a walk with lots of places to eat and cute shops. It is a pretty area decorated with colorful banners and lots of flowers. The Farmer's Market on Saturday morning was fun. We did not have to contend with parking because of our close proximity.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Wonderful Farmers' Market", "Do visit this area when the farmers' market is on. It covers 4 blocks and is very walkable. It then leads you to explore Little Italy. Easy to access by trolley."], ["Reviewed August 18, 2017", 3.0, "Some interesting retaurants", "Okay....I am not Italian, so let me start with that disclaimer! I came here with my son and his girlfriend to walk around. Parking on the street was difficult and we walked for a few blocks to just look around.\n\nI did enjoy the landscaping and flowers (wheelbarrows filled with flowers) and we had a great lunch. That was about it.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Don\"t miss Little Italy!!", "50 square blocks of Italian goodnes! Try asti's...home pasta cavetelli bolognese was wonderful!...just like Nonna!"], ["Reviewed August 16, 2017", 4.0, "Fun shops and restaurants", "Little Italy is a respite from big urban downtown San Diego. It has the feel of a small neighborhood. There are some cute boutiques and an eclectic mix of small restaurants."], ["Reviewed August 13, 2017", 4.0, "A Napoli!", "A fun place to walk, people watch, window shop and eat. We were on our way to Fillippi's Italian food and were surprisingly able to park reasonably close buts rolled a few blocks just to sight see...photos portraying some famous residents and flowers...There are some homes that front the street and have beautiful flowers, wrought iron fences and gates.\nShow less"], ["Reviewed August 12, 2017", 3.0, "Overshadowed by Gaslight district", "We walked over to little Italy and while there is an effort to celebrate the city's Italian heritage there isn't the sense of vitality that you experience in the Gaslight district which also has some very good Italian restaurants"], ["Reviewed August 11, 2017", 5.0, "Magnifico!!", "Great restaurants, interesting shops, and friendly people. There was even a huge street fair there on Saturday."], ["Reviewed August 8, 2017", 5.0, "Great Food and Nightlife...", "We stayed at the new Homewood Suites which is walking distance to Little Italy. Little Italy has tones of Italian restaurants, pizza places and bars. We tried Juniper and Ivy which was great and Fillipos pizza which was awesome. There were some good sweet shops too, can't remember the name. It's great for families during the day and best for adults and couples at night. This is a must visit if you are in the San Diego area...\nShow less"], ["Reviewed August 6, 2017", 4.0, "A good selection of restaurants", "This area of San Diego is being gentrified rapidly and no longer has the feel of the neighborhood that it was even a few years back. The resturants are very good though if you can bear the traffic during the evening hours. Definitely make reservations or expect a long wait for a table during the peak hours.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Large Little Italy", "Didn't realize little Italy was so large. Spread out so only parts had the intimate feel of a little Italy. We went during the day. Tour guide said at night there's a lot of activity and action. Looks like a good assortment of restaurants to choose from\nShow less"], ["Reviewed August 5, 2017", 5.0, "Great area to stay!", "We stayed in a hotel in this area for 4 nights and we loved it. Great cafes and restaurants and cute shopping!"], ["Reviewed August 1, 2017", 4.0, "Food and Shops Galore", "Had a great time walking the streets and seeing the shops, coffee houses, and the restaurants are amazing. Our favorite Phillipas."], ["Reviewed August 1, 2017", 5.0, "Best of the San Diego farmer's markets", "Our main reason for visiting Little Italy is for the Farmer's Market, held Saturday morning from 7 - 12. I think I have been to every FM in San Diego over the past 30-years and I really think the Little Italy Farmer's Market is the best. There are about 6 (short) blocks of food (both cooked and fruit/vegetable stands), drinks, clothing, jewelry, kitchenwares, fresh flowers, art, pet stuff, nicknacks, and entertainment. We usually stay in Pacific Beach, but always make at least one or two trips to Little Italy during our stay. In addition to the wonderful FM, there are many coffee stops and restaurants that are truly awesome. My current favorite is Davanti Enoteca because of their incredible Bloody Mary bar and beautiful courtyard (oh, the food is good too). I have found there is ample 2-hour street parking (meters) and several lots that offer longer hours for a higher cost. It is very walkable with lots of interesting architecture and small patio gardens to marvel over. It is very near the port attractions like the Embarcadero, harbor cruises, the Maritime and USS Midway Museums, so if you are in the area, you should make a trip through Little Italy as well.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Summer Break", "Over the many years with Summer break love the atmosphere of old Italy. We had a party of 7 with 3 children waited awhile to be seated but here that is part of the fun. The children have never been here before loved the seating a larger table all set with candles. One Grand Child has to eat GF they had the noodles and cook in own water so was really GF she was so happy and said they were the best noodles she ever had. All of our food was good and we had fun like sitting in a set from good fellows. Not only did we had large good portions when the bill came it was cheaper that the meal the night before at another restaurant we had pizza..here we all had full dinners-salad-bread. They did not have GF bread but not complaining.\nShow less"], ["Reviewed July 28, 2017", 4.0, "First Stay in Little Italy", "Having been here numerous times, this was our first tay here. Lots of great places to eat, plus the Saturday street market is outstanding. The Waterfront Park is nextdoor, and the light rail stops in the heart of the area."], ["Reviewed July 27, 2017", 5.0, "Sorrentos is the place", "Sorrentos is the place to eat, Had the Gnocchi, totally awesome, the grandkids had the pizzas, others had the pasta dishes, the staff was awesome, did not have to wait long for your food, One of the best places I have eaten in Little Italy. Highly recommend this place,\nShow less"], ["Reviewed July 26, 2017", 5.0, "Great place to visit! Lots of restaurants and shops!", "We saw this listed on our map from the hotel and thought we should check it out. We are so glad we did! What a great place to spend a day or afternoon walking around and checking out all the shops, delis, restaurants, or bars. There is no shortage of Italian food in this area, we only wish we hadn't already eaten so we could have tried some! Every place we walked by looked amazing. The area is very well maintained and kept up. Felt very safe and secure in this area. Can't wait to go back to San Diego so we can visit Little Italy again!!!!\nShow less"], ["Reviewed July 25, 2017", 5.0, "Great place to spend an afternoon", "They are continuing to upgrade this area and the restaurants and coffee shops are superb. Parking continues to be the biggest challenge."], ["Reviewed July 25, 2017", 4.0, "Amazing restaurant options", "Some of the most well known and highly rated restaurants are located in this area of downtown San Diego."], ["Reviewed July 24, 2017", 4.0, "Progress?", "The last time I was in Little Italy was in 2000. We took a walking tour to some amazing little shops and got to interact with local residents and shop owners. This year we revisited after 17 years. I was disappointed to see all the changes and development in this section of town. We found some amazing food but seem to have lost the charm of years gone by.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Good selection of restaurants and on Saturdays the site of San Diego's best farmers market!", "The best time to visit is early evening and after dark for dining. There are many Italian restaurants with full menus and various levels of authenticity in their offerings. Several cafes offering coffees, gelato, sandwiches and pizza. Check out the reviews on TA and choose the one that sounds best to you.\nEvery Saturday morning until mid-afternoon there is an excellent farmers market offering vegetables (usual choices and some more exotic choices), fruits, artisan breads and cheeses, handicrafts, flowers and clothing. Extra benefits are street musicians and watching people playing briscola, speaking Italian and gesture in synch with the conversation. .\nShow less"], ["Reviewed July 20, 2017", 5.0, "Outstanding Food and Cannoli's!", "Stopped briefly in Little Italy to have a traditional Spaghetti and Meatball Lunch. Not only was the pasta unique and delicious for being common but, the Cannoli's that accompanied were divine, as well!"], ["Reviewed July 19, 2017", 5.0, "Fantastic Food", "I am on a restrictive diet, but our waiter and the chef were more than willing to accommodate my needs. The dish they made was delicious! Wonderful atmosphere. Bon Appetit. Check it out. You can split an entree as they are quite large."], ["Reviewed July 19, 2017", 3.0, "Farmerrs Market is worth a look", "On Saturdays they close the main street and many vendors set up shop. Food, produce, arte, nick knacks etc. Definitely worth a look if your in the area."], ["Reviewed July 13, 2017", 5.0, "Great area to find a true Italian meal", "We ate at Barbusa. Make a reservation. We got there early and got lucky to get a table. Great meal and if you sit towards the front a nice view. There were several other restaurants that seemed equally busy."], ["Reviewed July 12, 2017", 5.0, "A wonderful, energetic, upbeat location to stay!", "We rented an Airbnb in Little Italy for our 9 day stay in San Diego. The location cannot be beat! You can easily walk to many wonderful restaurants and coffee shops or right down to the bay to visit the USS Midway or take a harbour tour.\n\nThe locals are very friendly to tourists. We found it very easy to both walk and drive in the area. We found public transit to be great from here too! You are literally about 15 minutes from most things you would want to do in San Diego!\n\nLittle Italy is not an inexpensive area to eat in, so be prepared to spend a bit more on dining out. The great thing is that the portions of food are great so you can easily take food back to your condo to have for lunch the next day!\n\nI highly recommend this area of the city to stay in/visit.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Must GO", "Amazing food at great prices, friendly people. We happened to go at an art festival & expo. Lots of fun"], ["Reviewed July 11, 2017", 5.0, "interesting", "This is not what you would expect. During the day there is not much to see but it brightens up at night time. all the restaurants open and the food is fabulous."], ["Reviewed July 10, 2017", 4.0, "Cute, quaint area...", "We loved the feel of this area. Very relaxed and chill. If you love Italian food, you will definitely need to visit Little Italy. We really didn't know where to eat. It seemed as though all the restaurants had decent reviews so it was a bit hard to decide. But even if not eating, just walking the streets and glimpsing inside the shops is entertaining and enjoyable.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Hot Spot for restaurants and bars in San Diego", "This is one of the hippest locales in San Diego. Fun to go have drinks or food on India Street in Little Italy. Parking is tough though unless you just pay the ten bucks in the parking garage."], ["Reviewed July 9, 2017", 5.0, "Bellissimo", "Loved that there is a little Italy in San Diego. Tons of restaurants and pastry shops. Nice place for a stroll. Beautiful spot to visit."], ["Reviewed July 8, 2017", 4.0, "Yum!!", "Several Italian Restaurants here. Great for dining, Date Night, Meeting friends. You can pick from many style of dining"], ["Reviewed July 6, 2017", 5.0, "Great community and Market", "The Farmers Market is one of the best, and go EARLY!!! Parking is tough, and crowds get huge!!! The selection of restaurants and sidewalk cafe's seem endless! It is a great neighborhood to walk around!"], ["Reviewed July 5, 2017", 5.0, "Food is excellent", "Great fun location with superb restaurants. Great place for an evenings entertainment. Plenty to see and do."], ["Reviewed July 4, 2017", 5.0, "Very Cool and Relaxing Dining.", "So Little Italy is like a step back into a different time. There are lots of indoor and outdoor seating for dining. Very convenient not at all intimidating. Most of the food here is Italian obviously so if Not an Italian food fan then this might be not exactly for you. However, they do have lots of foods available that are not Italian. Lots of coffee shops lots of ice cream shops fine dining and casual dining. I would say the most attractive thing is that it seems to be very well organized and easy.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Better go on weekend's mornkng", "Before I went there, I have checked some reviews on the internet, it shows me that better go to the little Italy on weekend, there will have morning market. Foods are so good there. It is a nice place to relax and hang around."], ["Reviewed June 28, 2017", 5.0, "Loosen Your Belt Buckle", "Terrific street scene, good food, great espresso, and, a good hamburger place, too, try fillppis pizza."], ["Reviewed June 27, 2017", 5.0, "Love Little Italy", "We visit San Diego regularly, and we always go to Little Italy. The area has great food and friendly people are enjoying themselves. It is just a fun area to visit."], ["Reviewed June 26, 2017", 4.0, "Dinner at Little Italy", "Came here for dinner at one of the many Italian restaurants, fun to walk around and look around , good choices of restaurants"], ["Reviewed June 26, 2017", 4.0, "Bigger than Little Italy in Chicago and New York!", "Block after block of Italian eateries in about 60 square blocks. A lot of Italian history is here, along with some great restaurants. There are hills to navigate, so be prepared to do a little walking. The bus tours take you through there, if you just want to see it from the comfort of your seat.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Dinner plus+", "Headed to Little Italy, found street parking....after 6 street parking is free. I will say felt very safe in Down Town San Diego with my family! We walked everywhere, found a spot to eat, then explored some more(burned off some calories),took pics, then got some gelato and cannoli's for dessert. About this time the sun was setting, and we got a great selfie of the sunset and the bay behind us!\nIf you are in San Diego, check it out for lunch or dinner!\nShow less"], ["Reviewed June 23, 2017", 4.0, "Crowded place", "Lots of people come here to eat & watch people. Many restaurant and bar choices. Good pastry shops too."], ["Reviewed June 21, 2017", 5.0, "Best Selection of Modern Dining", "We spent 3 days in San Diego and in our opinion, Little Italy had the best selection of modern/contemporary dining options. A lot of trendy eateries with rooftop bars and patios, and floor to ceiling windows that open out onto the street. If you're a foodie visiting San Diego, this neighbourhood is a must-visit for dining.\nShow less"], ["Reviewed June 20, 2017", 4.0, "Must see in San Diego", "Little Italy is a must see in San Diego. Tons of restaurants side by side, on the street which stretches over a mile I think, most of them are Italian (or maybe all of them), and lots of people walking on the street. So great place to walk, stroll, sit when you get tired, eat & drink, people-watch, and chat.\nShow less"], ["Reviewed June 16, 2017", 4.0, "Great eats, great atmosphere", "Take the uphill walk through Little Italy and stop off at some very cool restaurants. I tried Petrini's which had good food and good service. Also dined at Filippi's which was very casual and great for our large family. We also had to try Custom Ice Cream Deserts where you build your own deserts. Kids loved it including the dry ice - very dramatic. A fun once off experience. There's lots of variety in Little Italy and there's a fresh food market on the weekend.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Bustling with people and energy, great bistros, people-watching, and shopping.", "We were in Little Italy to shop for art supplies at Dick Blick ..... which is a FABULOUS PLACE TO BUY ART SUPPLIES!!\n\nWe loved the addition of so many new shops and restaurants in Little Italy.\n\nI see that Rakiraki and Pokirito are opening a new place just off India. Another great add.\n\nThe beat way to enjoy Little Italy is to have some time, wander, step into some stores, stop for a coffee, and juat enjoy the wandering!\n\nIf parking gets frustrating, just go farther away and make it a linger walk or just Uber/Lyft over. Life is short..... don't spend it getting frustrated over parking.\nShow less"], ["Reviewed June 10, 2017", 5.0, "You Can Pretend Your In Italy", "A great place to visit. Walk down the street and breath in the smells of home cooking. Casual Dining, Fine Dining, Gelato shop, Home made fresh Pasta shop, Mona Lisa Italian Groceria is incredible. If you want a real tast of Italy don't miss it."], ["Reviewed June 8, 2017", 4.0, "Nice area for food and a walk", "Great restaurants and bars. In the weekend there is a market which is nice. Go for a walk, cruise the neighborhood and have something to eat."], ["Reviewed June 6, 2017", 5.0, "Lovely", "The people and the food in this community were great. The meals were diverse and enjoyable. This is on my list of things to do again in the future."], ["Reviewed June 4, 2017", 5.0, "San Diego's Little Italy - walkable history", "We strolled through SD's Little Italy at least 3 times in the one week we visited SD as it was so close to our hotel. Not only is it full of very high quality restaurants, but it hosts the Saturday farmer's/bakers/fishmonger/craft market and has an amazing amount of history and early folk lore. It only takes about an hour and a bit to very slowly stroll up a fair piece of India Street, but it's the streets to the east (up a gentle hill) that have the feel of Little Italy some 50 to 100 years ago.\nShow less"], ["Reviewed June 4, 2017", 5.0, "A MUST Visit when in San Diego!!!", "Little Italy has a wonderful atmosphere that is lacking in the Gaslamp Quarter. The variety of Italian restaurants and others commingled with residential and office buildings makes for a quaint laid back atmosphere and neighborhood. Everything is within walking distance and it is also within walking distance to the bay front area and the USS Midway museum. While in San Diego, it is the must go to destination for lunch and dinner as there is not a bad restaurant that I have tried.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Little Italy Food Tour", "This is a great way to see the area and taste authentic Italian food! Anthony was our guide and he was full of information and he knew all the business people with whom we visited. He was from Brooklyn, New York (Sicilian family) and had a great accent and manner for an Italian tour guide Check out Little Italy Tours.com!!\nShow less"], ["Reviewed June 3, 2017", 5.0, "1/2 day destination", "We love traveling to \"Italian\" villages in different cities. We made a special trip today for the absolute best 5 block Street market we have ever visited. The neighborhood is quaint and all the shops and vendors had such a friendly easy going style. The food is top notch and so worth a visit if you're in downtown SD. The streets are walkable friendly and there are plenty of spots to take cool pics.\nShow less"], ["Reviewed June 1, 2017", 5.0, "Little Italy Food Tour", "This food tour was absolutely fantastic. Anthony was one of the best, if not the best tour guide we've ever had. In fact he was not a tour guide at all. He's a member of the neighborhood, and knows everyone, and has a story to tell about them all. The food was terrific and his stories about the little Italy neighborhood of San Diego were very informative. We highly recommend.\nShow less"], ["Reviewed May 31, 2017", 2.0, "Not sure where it really starts or ends", "I know it's not exactly fair to compare, but how else can you rate Little Italy? I am familiar with Boston's Little Italy and what used to be great..Manhattan's Little Italy. This locale just doesn't have the feel of an Italian neighborhood. It's difficult to know that you are in Little Italy because intermingled are restaurants of all genres. I only saw one deli and it appeared to be part of restaurant. We could not locate an Italian bakery. We didn't see Italian flags nor hear the language. Perhaps, in its day it was more authentic.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Bustling & good Italian food", "Wonderful atmosphere.The Sunday Farmers market is a must.Fresh produce of every type,from eggs to coffee and beautiful flowers"], ["Reviewed May 29, 2017", 5.0, "Our experience in Little Italy", "This was my favorite place. . .the food, the beauty and we visited a Catholic Church and it was beautiful."], ["Reviewed May 28, 2017", 5.0, "Fantastic place for food", "We visited this area from the \"Hop on Hop off\" trolly. we did not have much time to spend here but definately a place we will come back and spend more time."], ["Reviewed May 22, 2017", 4.0, "Love it", "My husband and I go here on weekend and we love it. Good farmers market, food, sight seeing. Highly recommend."], ["Reviewed May 22, 2017", 1.0, "Not impressed", "Unfortunately, most old buildings are torn down and many new contemporary ones are built. Nice info.if your on Trolley bus on how important Italian fisherman played a part 100 yrs ago. Not much to really get off Trolley to see."], ["Reviewed May 17, 2017", 4.0, "Great Place to Shop and Eat", "The Little Italy area is a great part of downtown San Diego. I always enjoy checking out the local restaurants and the shops that sell Italian food. It's a great place to kill some time while waiting on a flight because the airport is nearby..."], ["Reviewed May 17, 2017", 4.0, "Tight Squeeze - Great Food", "You have to get into Little Italy area early, as parking is tight, suggest trying Filippi's Pizza Grotto, they have a controlled parking and the best Italian menu in the area. If you are 2 to4, be surest ask for seating in the grotto. So authentic!\nShow less"], ["Reviewed May 16, 2017", 5.0, "Nice pizzas", "We walked to little Italy and found a lovely small pizza restaurant which seemed to be authentic and was run by Italians very nice place to wander."], ["Reviewed May 9, 2017", 5.0, "Loved Little Italy!!", "Close to everything!! Lots of restaurants with reasonable prices and good food. Will stay in this area again."], ["Reviewed May 8, 2017", 4.0, "Great Place for Real Italian", "Walked from our hotel and really enjoyed seeing all the Italian stores and restaurants. Great place to buy real Italian food, really enjoyed the deli where we purchased several items to take home with us. Little Italy is a must see when visiting San Diego, you can spend and hour or a entire day. One of our favorite places to visit when in San Diego.\nShow less"], ["Reviewed May 6, 2017", 4.0, "Large Area of San Diego", "They say it's the largest little Italy in America, and they may be right. Plenty of markets and restaurants, clean and safe for exploring the city."], ["Reviewed May 3, 2017", 5.0, "Very pretty Area with Jacaranda trees on the boulevard leading there", "Lots of lovely eateries at reasonable prices. Special offers on for happy hours 3-7 pm. Very attractive area."], ["Reviewed May 1, 2017", 5.0, "Art Walk 2017 was terrific!", "We came to San Diego to attend the Art Walk this year that was held here. We haven't been here for a couple of years and its always a fun weekend. Being in Little Italy is a great place to explore the various restaurants and shops and Art Walk adds to that to make it a great destination! The weather was perfect and even when it got hot (85 degrees in San Diego) the breeze off the ocean was delightful!\nShow less"], ["Reviewed April 30, 2017", 5.0, "Just a neat place to even walk around", "A first visit that won't be the last. Very impressed with the quality of choices in restaurants, some very much have the Italian decor to go with the wonderful food offerings, music, streetside dining or just a coffee and a paper to read, this leaves very much a need to have dinner here, and we did.\nShow less"], ["Reviewed April 28, 2017", 4.0, "An interesting place to visit for good Italian cuisine.", "We are fanatics on going to Little Italy at least once ever couple of months to pick up Italian items at the groceries and shops that you cannot get elsewhere in town, such as authentic Italian sweet sausages. While we are there we like to stop into Filipi's for a sausage sandwich and Pecorino. Makes for a great visit to that area.\nShow less"], ["Reviewed April 25, 2017", 5.0, "In town for a convention? head north to Little Italy", "If you are in town for a convention (or really any reason), hop on the Green Line and walk a few blocks away from the ocean to India Street. Lots of restaurants and Italian food shops. Streets are alphabetical as you head north (Ash, Birch (or was it Beech?), Cedar, Date, etc. Best beer is at India and Ivy, Ballast Point. Saturday farmer's market is worth a trip, too.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Great Places to Eat", "If you can afford it, this would be a wonderful place to live. We rode the train north and south of the area. Walked many streets and saw many places to eat. We felt safe even in this busy part of the city."], ["Reviewed April 23, 2017", 5.0, "Going back in time", "We enjoyed walking around little Italy. We had a great dinner, plenty of restaurants to choose from. Nice walk back to the hotel."], ["Reviewed April 23, 2017", 4.0, "Great Restaurants", "If you enjoy Italian food, a nice place to walk and eat. Very active at night, but restaurants usually close by 10 pm."], ["Reviewed April 21, 2017", 4.0, "Great Place to eat Italian food.", "Great Place to eat Italian food. We had Felipio which was a nice Italian place but the food was just ok."], ["Reviewed April 21, 2017", 5.0, "The Place to Stay in the Middle of Everything", "Little Italy has some of the best restaurants in the area and is right in the middle of everything. Walking distance to the Marina and Balboa Park (though up a steep hill) and short Lyft/Uber rides to everywhere you want to go!"]]}}