{"Living Desert Zoo & Gardens": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Living Desert Zoo & Gardens", "url": "/Attraction_Review-g32846-d144483-Reviews-Living_Desert_Zoo_Gardens-Palm_Desert_Greater_Palm_Springs_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/dd/1d/fb/feed-me.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2303"}, "address": {"@type": "PostalAddress", "streetAddress": "47900 Portola Ave", "addressLocality": "Palm Desert", "addressRegion": "California", "postalCode": "92260-6156", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 4.0, "Fun day - Easy walk and more than enough to see!", "This was our first visit to the Living Desert Zoo and Gardens. It is a great zoo and botanical gardens. There was a lot to see in the couple of hours that we were there, but we did not feel we missed out on anything and could have explored further if we really wanted to.\nShow less"], ["Reviewed 2 days ago", 5.0, "Terrific Surprise!", "A cool, blustery day kept me off the golf course and I reluctantly succumbed to my better halves suggestion to go to the Living Desert.\n\nIt is WONDERFUL. The staff is excellent and was helpful with our questions. The layout is absolutely wonderful and easily accessible and the map facilitated our travels through the Desert.\n\nThe animals are literally \"right there\" and, contrary to so many other \"zoos\" are contained in areas that actually appear to be humane.\n\nThe camel ride is a bit of a novelty as is the bird feeding area. The signage throughout the Desert as pertains to the animals as well as the flora and fauna is exceptional.\n\nWe had a great time and look forward to returning!\nShow less"], ["Reviewed 2 days ago", 5.0, "Great place for kids", "Camel rides, giraffe feeding, lorikeets all over you trying to lick nectar from the small cups. The train setup they have is awesome. Bring a lot of water and use sunscreen."], ["Reviewed 3 days ago", 5.0, "Very Well Done", "Very simply a great place to visit... even without children. Much larger than I expected this is a worthwhile Sunday afternoon place to go in my estimation. Spent about three hours there and really enjoyed the experience. Highly recommend if you like the outdoors and very detailed explanations....\nShow less"], ["Reviewed 5 days ago", 4.0, "You mean there is life in a Desert?", "If you think this way, you are in for a life changing experience. From plants to animals, birds, water and humans the desert has it all. Truly a life of it's own."], ["Reviewed 6 days ago", 5.0, "Even for a 1 & 2 year old, a fun day!", "Look for a cooler day, which we had, but there are a lot of trees for shade. There are uncovered strollers but only two wagons which hold two children. Get those early, but they are uncovered. Feeding the giraffes is a hit! Petting the goats another hit. See the cheetahs up close where the glass is but get there early. They trot between two feeding attendants at each end of their pastured area as they blow their whistle so where the benches are, they are moving. Luckily, we witnessed the kookaburra laughing, and there were plenty of other sites to see. The kids loved the carousel, and for a $2 ride, it was worth the experience for a couple of times each. Spent about half a day there, till the kids , and we, were tired. Can easily go back to do / see more again. Very great place to take kids in strollers. Cement is wide and lots to see and do!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great zoo experience", "We visited this zoo recently while on vacation in Palm Desert. I usually have mixed feelings about zoos - but this one does an excellent job with natural habitats. It’s worth the admission price just to see the giraffes. Right now they have 8 giraffes on park and you can get really up close and personal. For a small fee you can feed them between the hours of 9:30 and 2:30. The kids really seemed the enjoy that and the giraffe was so gentle. We spent about two hours here and were able to walk the whole park at a leisurely pace. All of the animals looked very well cared for and the staff was very friendly and accommodating. There is a shuttle that you can use for a small fee and it seems very helpful for older visitors or those with restricted mobility. We would definitely recommend a visit here.\nShow less"], ["Reviewed 1 week ago", 5.0, "Inspiring, Educational and Fun", "The Living Desert is a conservation and preservation park that educates the public about threatened animal and plant species.\nIt has interactive animal exhibits such as giraffe and bird feeding as well as camel rides.\nThe park has beautiful walking paths that meander between the African and North American exhibits. There are several benches and drinking fountains along the pathways which are great on a hot day.\nWe love visiting the Living Desert and learn something new every time we go!\n\nShow less"], ["Reviewed 1 week ago", 5.0, "Great place for kids 6- 18", "Had great time, exhibits were outstanding. Animals & plants were very nive & varied a lot. Educational, fun, & creative. Plan on at least 4-5 hrs. You could easily spend more time easily. Sunscreen a must have!"], ["Reviewed 1 week ago", 5.0, "Not an ordinary zoo", "The Living Desert Zoo was certainly more than we were expecting. Although it is not large by other zoo comparables (Seattle and San Diego) it has a very visible charm and sense of place. The zoo prides itself on taking great care of it's animals which is evident by the roomy and well thought out enclosures. They also have a fully staffed and outfitted surgery which allows them to give all of the animals regular check ups and \"repairs\" when needed. They take great pride in doing their part in managing these captivity raised animals both in the present and future. Highlights include the jaguars, cheetahs and the wonderful giraffes.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fascinating Flora and Fauna", "One of the better zoos with the animals (understandably excepting reptiles and birds) given plenty of room to roam freely. The distant mountains and palm-studded grounds provide especially beautiful backgrounds for the giraffes, and it's always great fun watching the meerkats. Small gardens tucked along the winding paths are filled with local desert plants. Despite a full parking lot, the gardens never seemed crowded. Probably not the best destination during Palm Springs' blazing hot summers.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fantastic zoo and garden", "We were absolutely delighted with a wonderful, guided nature walk by one of the educated and friendly volunteers. Go early and enjoy!"], ["Reviewed 1 week ago", 5.0, "Night Lights", "Family visited from Orange County. Went to Living Desert to see Christmas Decorations. We had multiple pictures with Great Santa and children were excited to feed the Reindeers."], ["Reviewed 1 week ago", 4.0, "Glad we went!", "This natural setting was what we liked about this zoo, that and the animals. We went to see the Christmas lights but since they had select days for the show we ended up missing them. We wanted to experience the Xmas lights so went later to the living zoo which was our fault, about 3pm and the zoo was closing at 5pm. We did rush through because of time but enjoyed the animals we did see. Lots of walking but you could take the tram cars for a price, all in all would definitely recommend a visit here.\nShow less"], ["Reviewed 1 week ago", 5.0, "Pleasant attraction in Palm Desert", "The Living Desert provided an entertaining and interesting place to visit for our family - ages from 1 to over 50. Kept us amused all afternoon. A good variety of animals, cheetahs and giraffes were highlights for us, and a small petting zoo."], ["Reviewed 1 week ago", 5.0, "Not to be missed!", "We read that people thought two hours would be enough for this place, but for us four hours wasn't enough. The variety of animals was amazing -- one part had North American animals, the other part African. You can get up close to the giraffes when they come to feed, and it was remarkable to be a couple of feet from a cheetah during a training exercise. The focus on preserving animals here and in the wild was inspiring. The volunteers were very knowledgeable about the animals -- they seem to specialize in particular areas and get to know the animals' personalities. The staff presentations were also very interesting. We did not take the tram at all; just moved at a relaxed pace. We were enchanted.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing place", "Volunteers are mostly retirees who just love what they do and are willing to help with anything. The desert brings a natural feeling to this zoo. Great place for kids and adults. We went to feed the giraffes and couldn't believe they took their carrots right out of your hand, softly and gently. You can also pet some very happy furry goats. The park is divided in continents and the animals seem content and happy to meet their handlers. There is a beautiful merry-go-round. They have little trains for those who can't walk but walking is best as you meander through the different areas, often under tree canopies. Just beautiful.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Hidden Gem!", "One of the best Zoos I have been to! I couldn't believe I didn't discover this zoo until recently. Huge grounds and you can get up close to the animals! The kids loved it. I highly recommend it!"], ["Reviewed 2 weeks ago", 3.0, "The Living Desert", "Sometimes difficult walking,not level. Have to come early to see the animals in action. There are some extra options such as feeding the giraffe but these are extra charges. There is a train that goes around, on and off, $6.00 per person. It explains what you are looking at. Can get hot in the middle of the day.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Relaxing stroll with plenty to see", "Bring your walking shoes and take plenty of water. The stroll is uphill and then back down. Along the way, plenty of exhibits and animals in natural habitats. Well worth the visit."], ["Reviewed 2 weeks ago", 5.0, "Great place!", "Wonderful place to spend a few hours with or without the kids. Great value for your money. Even has 3/4 of an acre dedicated to working model trains. Has lots of animals at the zoo. You can feed the Lorakeet birds and go on a carousel.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wonderful activity", "The animals are so awesome. The camels and giraffes completely different in real life, the colors and lines on the giraffes beautiful, their long toungues wow! The park is well laid out and very desert landscaped. Lots of places n the shade to sit and just observe the animals.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Outstanding, Well Worth Visit", "Brought my wife and son with an intention to kill five hours between timeshare check-ins. We lived in the Middle East several years and expected similar zoo exhibits. It was comparable, but surprisingly (based on city size) this was better. Parking lot was already nearly full by the time we arrived in late morning. There was a model railway I could have spent hours with. Several exhibits were highly interactive including a great bird feeding experience and giraffe feeding opportunity. We were entertained our entire time at this zoo and would definitely return.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Lovely afternoon", "We are spending more time in PD this year. We joined with a dual membership for $99 of which $75 was tax deductible. 2 persons free for a year, 2 one time admissions, $12 additional daily tickets, and a number of other benefits. Well worth it if you’re gong to visit more than once a season. Really lovely garden setting and lots of animals. Keeper talks at designated times. We didn’t go this time - we have in the past- but there’s a very nice hike, which can involve some rock scrambling a bit to the east. The Living Desert opens earlier for members. Nice gift shop on site.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great day!", "We went to the living desert in the morning and spent at least five hours there. It gets pretty warm in the afternoon so a few morning trips might be enjoyable. The animals tend to rest in the heat. There is places to rest and sit in the shade if needed. You are able to get a private tour if you want but they sell out quickly. We were able to see the feeding of a cheetah. On their website it shows what talks are available and you can even see operations. The gardens are lovely different types for different areas of a desert region. There is a couple of restaurants on sight for a bite to eat. They do sell beer. It was well worth the 18.00 dollars. You can get an annual pass if you want! Very interesting loved it! Would go several times if we came here again.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Well designed zoo", "Spent a great day touring the zoo on wide and stable pathways. Lots of shade available. The gardens were impressive and well cared for. Lots of displays and different animals. The giraffes are a hit - especially the new baby! So cute. The park is divided and clearly marked into two regions - North America and Africa. The hospital tour was informative and interesting.\nGreat family place!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Afternoon at the Zoo!", "It was our first time in Palm Springs and we were travelling with some friends that wanted to hit a casino. Hubby and I are zoo/animal lovers, so we opted to spend the afternoon outside at the Living Desert. A little background, we are zoological members with the Milwaukee County Zoo in WI (a great zoo if you ever get in the area) and hubby travels all over for his business so likes to check out the local zoos whenever he can.\n\nMaybe we weren't expecting all that much, but we were very impressed!!! First off, there is a large train display set up as you enter the zoo. Fun to walk around and check it all out. We then proceeded to make our way thru and saw animals we had never seen or heard of before. I loved the \"coziness\" of the zoo and the landscaping. We only had a few hours to take it all in, but it was such a great afternoon. Loved our time here. I got some great photo's of the giraffe's standing up on a hill. So different than the zoos we have been to before.\n\nI hope to one day return and spend more time here.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Animal and Plant lover", "We were greeted within moments of arriving by a very kind docent/volunteer.\nKnowledgable and helpful.\nWe got a late start this morning so missed a few opportunities to see some of the scheduled xxxxxxx.\nWe walked the entire grounds and were so impressed by the care of the animals and beautiful plants.\nWe stopped at the animal hospital where they allow you to see some procedures through a viewing area when they are taking place. We did not see any. Another female docent greeted us and patiently explained all the info about the hospital and how it operates.\nDespite the unseasonably warm weather most of the animals were visible. Some sleeping. We still saw animals we have never seen before even at the San Diego Zoo. We wish we had purchased a membership!\nI am not a big fan of zoos. This was exceptional.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Unforgettable Guest Activities --Feed a Giraffe, Ride a Camel, Feed Lorikeets", "The Living Desert offers a number of options for guests to interact with zoo residents for a more memorable experience with an additional fee. Great photos and videos can be taken up close when feeding a giraffe or the Lorikeets or riding a Camel. The cheetah run show is free and provides a perfect opportunity to see them in action. The best time to go is early morning to see more animals active and possibly being fed. We paid an extra $6 for the shuttle service since one person in our group had a bad knee and it was great for getting from one area to another in the heat as well. As soon as we arrived, we took the shuttle all the way around to get an overview of all the areas from the driver and it only took 15 minutes. Each shuttle stop had shaded benches as well for us to rest while we waited to be picked up.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Living Desert Zoo and Gardens", "I was a bit disappointed, as I often am at zoos. During the mid day sun, the animals are not particularly active. I saw a lot of empty cages, and sleeping animals.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A very pleasant winter day", "I hadn't been to the Living Desert for about twenty years. When last here it was mostly a desert oriented botanical garden with a few fauna exhibits. The animal exhibits have been greatly expanded (into a real zoo) while maintaining the interesting collection of desert plants, etc. On a week day during the school year, the place wasn't crowded at all. We had a leisurely stroll through the park and really enjoyed both the plants and animals. We particularly liked the Lorikeet house and the Giraffe area. The giant outdoor model train set may be a bit out dated, but it's still lots of fun. January is a perfect time: sunny but not too hot.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Both interesting and educational for all ages", "I am not usually one to go to a zoo but this place is so much more than just a zoo. And as my title says this site was so interesting and educational, and we are 2 middle-aged, animal-loving adults with no children. We had visited and enjoyed a place similar to this in Tucson so we decided to give this place a go too and it was great fun, especially learning about and seeing the large variety of African animals we had only seen before on TV.\nSome of our favourite animals to see in the flesh were the cheetahs, the giraffes, and the zebras to name just a few.\nTo learn about this zoo's conservation and preservation efforts for so many different animals was truly inspiring. And, to learn that a portion of each entrance fee goes towards saving endangered animal species, among many other animal-related things, made our visit that much more enjoyable.\nI can't imagine anyone not enjoying a visit here, so be sure to check this place out if you are in the greater Palm Springs area.....but don't just take my word for it, visit this zoo's website to see everything it has to offer.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A gem of a combination botanical garden and zoo", "We had visited here over 30 years ago with our children but it was still interesting for us now. I loved how the desert plants were labeled. There is a section on North American animals and African animals along with plants that would be in those areas. Butterfly and Hummingbird gardens as well as aviaries, snakes, bighorn sheep, camels, giraffes, etc. are all in very natural settings. We saw cheetahs racing, giraffes being fed and children riding camels. We also took a walk on a nature trail out into the desert to a lookout to view the San Andreas Fault.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Very pleasant afternoon!", "They have done a excellent job developing this animal park. The giraffe area is one of the best we have visited. You can feed the giraffes and a great photo opportunity. Great Desert setting against the mountains makes for a perfect blend of landscapes. Lots of shade, resting areas and picnic areas. If you plan on more then one visit the annual pass is a good value. Costco also sells the daily pass at an discounted price, about $14.00 saving for two people. Lots of refreshment spots in the park. The desert cactus and trees are identified along the paths which is educational as well. Five stars to the park volunteers as they are eager to help(very knowledgeable) and we were directed to the cheetah run just in time to see these beautiful animals. You can take hikes from here as well. You can visit the animal hospital on site, the only one of its kind open to public. We will be returning in about 6 weeks with family and sampling the ice cream again.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Must to See", "One of the best zoo's we have ever been to. Great care of the animals and such a wonderful variety and very rare animals that you don't see at other zoos"], ["Reviewed 4 weeks ago", 5.0, "best day", "visited the Living Desert with my grand children and they loved it. Beautiful grounds and wonderful representation of our desert. Very friendly and helpful volunteers trough-out the grounds. Great little tram to take us around and the tickets are good all day. Animal hospital volunteer gave us a nice little informative tour. Purchased the unlimited children's ticket for the camel ride, the Giraffe feeding and the Lorikeets aviary. They couldn't get enough of feeding the lovely colorful birds and feeding the Giraffes. Best bargain for $17.95. We're already planning another visit later this year.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Grounds were not well attended", "We wanted to see more of the gardens with plant designations. Not all labeled-seemed to lack care. Not a complete zoo but a nice walk through\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A wonderful zoo in a pristine setting.", "We were a large group so we took the tram ride around the grounds. The tour guide/driver was very knowledgeable and the animals are easy to see in a wonderful setting."], ["Reviewed 4 weeks ago", 5.0, "wonderful", "We enjoyed the native plants. This zoo is serene. We loved seeing the mountain goats and giraffes. Great place to take pix of animals. We definitely will return."], ["Reviewed January 22, 2018", 5.0, "BIG!", "This garden has it all--plants, animals, model train exhibit, good restaurant, shuttles, lots of free parking. The shuttle pass is a bargain--on-off stops throughout the park, lots of interpretive talks along the way by drivers."], ["Reviewed January 22, 2018", 5.0, "Halloween at living desert", "Great place to take the young ones my daughter wasn’t old enough but she still enjoyed her time and I had a lot of great memories the last time I was there I was 5yrs old... LOVED IT\nShow less"], ["Reviewed January 22, 2018", 5.0, "Wonderful", "It is always a treat to go to the Living Desert! Each time is a different experience. The desert plants create a peaceful and harmonious environment and the animals along the way are such a fun and exquisite treat at the same time. Highly recommend!!"], ["Reviewed January 22, 2018", 5.0, "A day at the Living Desert", "This is a really nice place to spend a day, It is a zoo, but many of the animals are in open pens instead of cages. The Hop-on/Hop off tram is well worth the ticket price(extra from admission ticket), as this is a large park, and you may want to go around more than once. Dress for the weather, all trails and pens are out in the open. Timing your visit to take advantage of feeding times is worth the effort.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Don’t miss the cheetahs", "This is one of the best attractions in the Palm Spring-Palm Desert Area. It is divided into two areas: North America and Africa. We paid the extra $6 for tram tickets. As we rode the tram, the driver gave an overview of the Zoo. You and get off and on at any stop.\n\nWe arrived at the cheetahs just before 11:15 AM. They are fed once daily at 11:15 so we were just in time. There are four ‘girls’ there and they are magnificent. They are trained to run between feeding locations. Although they cannot reach their full speed they are very exciting to watch as they run, walk, and lie in the shade.\n\nThere are many other fine exhibits and activities. You can feed the giraffes, ride a camel and much more. This was one of our special highlights during our month in this area. Don’t miss it.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Best views of wild animals I've been to", "My family and I really enjoyed our visit at the Living Desert! Loved the fun shows and the education they provided. The Giraffe feeding was amazing and we were so close to them. So many desert plants and cactus to see and learn about too."], ["Reviewed January 21, 2018", 5.0, "Awesome for families and small children", "Wow! I was presently surprised. This place exceeded my expectations. I went today with my 11month son and my parents. We got there at 1pm and stayed till closing (5pm). We had time to do the full map quickly and see most exhibits. They have a big variety of animals and the site is a nice size. We loved to feed the girafes and checkout the foxes and mexican wolves. We got a 2 for 1 pass for 22$ from Costco online. General admission is about 20$ so that is a great deal. At one point we got hungry and stopped at the main café near the entrace and I got a sandwich (7$) and chili (4,50$) for 11,50$. Pretty good price. The staff was also able to get me hot water for my baby bottle. The washroom I went in was ok...they had a change table. Washroom would need renovating because they look dirty. The petting zoo is simply nigerian goats. It was ok. Would be nice to incorporate more animals. The shows we managed to see were good for young children. I would definitely recommend this place to any family visiting Palm Desert/Springs.\nShow less"], ["Reviewed January 21, 2018", 2.0, "Very expensive to take the kids!", "I took my grandkids and it was very expensive, had to pay to feed the giraffes, paid for camel ride, paid for entrance fee, very disappointed in the lack of animals in the hospital, I have visited many zoos, most of the population was small animal in cages. A waste of time! Sorry I was very disappointed.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Morning at the desert", "One should make time to visit The Living Desert in Palm Desert! You are given hands on at feeding time! My Grandchildren loved feeding the giraffe! We were able to get photos of them and they still are talking about it.\nWe prefer to go in the earlier hours before it gets too hot!\nShow less"], ["Reviewed January 21, 2018", 5.0, "A fun zoo and botanical garden - just the right size", "A group of friends visited here last weekend. We LOVED walking, seeing the animals, seeing the plants, and being together. Someone had recommended this place to us -- and we were so glad they did. A fun outing. We were there about 2.5 hours and could have stayed longer, but had a conflict. We fed the lorikeets (very fun), watched the miniature trains (very fun), and enjoyed watching others feed the giraffes. A good walk, easy to get around, no big hills, very accessible. The temperature for us was around 72 degrees -- perfect. However, it think that this would be an uncomfortable place to visit when it is HOT. Glad we went!\nShow less"], ["Reviewed January 20, 2018", 5.0, "And those camel rides!", "Enough about how wonderful the Living Desert is for all ages. We are members who bring our grandchildren and children as often as they come to visit us. The kids love it, learn something new each trip, and are exhausted by the end of the day; a grandparent's DREAM. But a really special experience is the camel ride. Not so much the camels, who are gentle, sweet and stinky, but the handlers. What kind and patient young men. They make sure the riders enjoy the experience, but also stop to let the happy grandparents take pictures and even snap the greatest shots of camel closeups with the happy riders.. It's a long day leading the animals and these guys made every family feel special.\nShow less"], ["Reviewed January 19, 2018", 4.0, "Fun time at the zoo", "We went to the zoo and enjoyed it a lot. We saw the Cheetah run, saw Giraffes, Goats, and other animals. It was a fun morning activity."], ["Reviewed January 19, 2018", 4.0, "Cool place to see animals and good start for nice hike", "Not best having to pay to enter zoo and gardens when we only really wanted to go on hike which was very nice, few folks around although some very loud mouth bimbos that could talk forever and carry even further, so nice to get out of their range.\nHike was fun, moderate with great views and reasonably marked.\nSpent some time in zoo on way back, some very good parts, did like cheetahs and girrafes.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Great place to connect with nature", "We live about 30 minutes from the Safari Park in San Diego, have stopped going in recent years due to the increase in price and commercialism of the park. The Living Zoo reminds me of what the wild animal Park used to be; A place that is conservation minded with natural habitats. Price is fairly reasonable and there are so many animals to see and hiking trails too. They even offer a giraffe feeding experience. Definitely plan to go when it is cooler because much of the park requires walking and I imagine it can get very hot. We went without kids and based on the amount of children having meltdowns, it was fun as a grown-up date.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Amazing", "I have been traveling to Palm Springs and the surrounding areas for years, but never visited the Living Desert Zoo and Garden. With its extensive walking paths featuring an amazing array of desert fauna, the extensive assortment of animals in very nice habitat or the wonderful hiking trails, this place has something to please everyone.\n\nIt even has a state of the art animal hospital where you can actually tour and watch procedures being done (this was one of the stipulations of Mrs Gates who donated 7 million dollars to build the hospital).\n\nIt also has the worlds second largest outdoor toy train exhibit (if you like toy trains, you will be absolutely amazed (I was). Looking for a camel ride, petting zoo, or carousel ride- they have that also.\n\nPlan on spending at least 3 hours (we were there for 4 hours). We like to hike so including the park and hiking we covered about 7.5 Miles.\n\nFor those not as mobile they have a tram that will pick you up and drop you around the park anywhere you like during your stay for $6 -they come by every 15 minutes.\n\nThis facility has one of the most extensive groups of volunteers and donors I have ever seen. This is truly a community gem strongly supported by the Greater Palm Desert and Palm Springs Community. They have a multi million dollar expansion under way which will make it even better. General Admisson is less than $20 for Adults and Seniors/kids get a nice discount.\n\nThis place is a must if you are visiting Palm Springs, Indio, Palm Desert, Cathedral City, La Quinta or anywhere within a 30 mile radius. Take the family, spend the day and enjoy. Definitely one of life’s little pleasures.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Animals, desert, trains and much more", "This place has a lot to offer everyone. For families there are the zoo animals and hikes on the different paths. Lots and lots of different desert fauna from all over the world. Loved the state of the art animal treatment center. We got a tour of the facility by a great volunteer who showed us how the animals were treated including showing us the operating areas. Before leaving we came across the very large garden train lay out (G gauge). If you at are a model train hobbyist this may be your only stop. Lots of places to get snacks and eat around the zoo. You can get discounted tickets beforehand at the Palm Springs Visitors Center same day as your trip. This was one of my favorite days in Palm Springs. One day minimum and possibly 2 days.\nShow less"], ["Reviewed January 16, 2018", 5.0, "An Absolute Must!", "The Living Desert was wonderful and a must when your in Palm Springs I don't know why we hadn't done it before on one of our other trips. It's quite a lengthy and interesting walk through the zoo. From all the animals to the different kinds of vegetation it was very enjoyable. We were able to feed the giraffes and ride a camel, as well as view several different types of animals we had never seen before that were native to the desert climate. We were here for about 3 to 4 hours, lots of fun!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Super fun time", "When in Palm Springs the Living Desert seems to be the first thing that is recommended to do. We got there at opening and spent I think 3-4 hours there. It was a great place. There are lots of animals and neat little side gardens to walk through with cacti and other various plants. The zoo is well laid out. The giraffe feeding was I think $5 extra and you got a decent amount of carrots to feed the giraffes. That was fun and totally worth the extra money. Same thing with the camel rides. Really nice carousal too. I think a ride on that was $2 – it was empty when we got there and I’m pretty sure the lady gave us an extra-long ride. The extra’s do add up but I think they have an extra unlimited package you can add to your admission that groups all the extras so you can do them as many times as you want. They were worth it for us. We had a great time. It’s not a huge zoo – totally do able in a couple of hours but its well laid out and was an enjoyable morning. By the time we left the parking lot was packed so it’s probably good to get there early.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Beautiful example of the desert with animals", "It has been 25 years since I first came here. They have added many new animals in natural surroundings. So, nice to walk around at your own pace. They also offer a tram. Great place to take photos. Gorgeous cactus gardens. I loved the cheetahs, giraffes and you can even take a camel ride.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Out of Africa", "Wonderful zoo! Happy animals, happy workers (especially Barbara the shuttle driver!) and happy volunteers. Exotic array of animals and it is a learning experience for both children and adults. Feeding the giraffes was just great and many children opted to feed them carrots also. When feeding got too slow, the giraffes nudged the volunteer on the backto get the food chain moving. It was just plain a great environment with happy and quite content workers and animals. The greenery is wonderful also. It was a wonderful day at the Living Desert Zoo and Gardens.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Amazing!", "What am amazing place! Spent a few hours but definitley could have spent an entire day there! Lots of activities for kids and things to see. The animals were stunning and feeding the giraffes was a highlight!\nShow less"], ["Reviewed January 13, 2018", 4.0, "Christmas lights", "This place is awesome during Christmas and if you have kids they would enjoy it. We have been coming here for the past 7 years with my in laws and have made it a tradition and look forward to it every year."], ["Reviewed January 13, 2018", 4.0, "Living Desert Zoo & Gardens", "Great outing for all ages....feeding time is fun to see. Volunteers are wonderful...saw the cheetahs eating their meatballs, the giraffes eating the carrots...Cool"], ["Reviewed January 12, 2018", 4.0, "Educational zoo experience for the family", "Definitely plan for at least a half day to see this hidden gem in the desert. We took our 12 year old daughter and she loved all of it. In addition to the animals you'd typically expect to see in a living desert zoo, this zoo also has a variety of desert gardens throughout the grounds and are well worth extra time spend wandering along the paths. When we were there they also had a Lorikeet Exhibit (right next to the camel rides) where you paid a small amount extra for an entrance fee and additional couple dollars for a cup of nectar. If you're going in I highly recommend at least one of you get the cup of nectar and have someone else with a camera ready to snap photos. It was a very colorful stop on our zoo visit. We also took advantage of the watching the trainers train and work with some of the animals - Cheeta Run, Wild Dog training and an attempt to do target training with the Golden eagle (he was having none of it the day we were there). These 15 minute educational sessions are very well done using positive training methods and providing stimulation for the animals and an opportunity to learn for the visitors. The trainers not only let you watch their training methods but impart fascinating tidbits about the animals and their lifestyles. We also found the volunteers to be very well educated and willing to share information. Don't miss a visit to the animal hospital. They do let the public in for short tours and you might even have an opportunity to see an animal or two in rehab.\nShow less"], ["Reviewed January 10, 2018", 4.0, "You need at least a full or half day to see it all.", "We stopped by here after going to the street fair and didnt realize how much there was to actually see. Only managed to get in the Africa part. we were there after 2pm and most of the animals were lazy . If you want to see them a little more agile, I suggest going in the morning.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Desert Garden", "There were animals in the zoo. But what I found astounding was the wealth of flora that can abound in the desert. Those cacti were beautiful, weird, and wonderful."], ["Reviewed January 9, 2018", 5.0, "Lovely stop along the way.", "We enjoyed our visit very much. Some unusual animals for us East Coasters and the giraffe interaction was such a treat!"], ["Reviewed January 9, 2018", 3.0, "Just ok", "Small zoo, but expensive. Not worth the admission price for our family. The kids like our home town zoo much better, and it’s cheaper!\nShow less"], ["Reviewed January 7, 2018", 5.0, "A local jewel", "We were impressed with the variety of animals, the nice layout and exhibition area and the added attraction of a fabulous train exhibit!"], ["Reviewed January 7, 2018", 4.0, "Nice morning at living desert", "Did a 2 hr tour private tour. The zoo is really nice and there are a bunch of animals and they are very easy to view. Didn’t love that the tour spent about an hour on the botanic garden aspects given that we have kids with us— especially since the guide asked us up front what we wanted to see and we emphasized only animals. Good option if in Palm Springs to view a variety of animals from across the world. Also fun for the kids was feeding the giraffes.\n\nShow less"], ["Reviewed January 6, 2018", 4.0, "A great day", "We spent a few hours at the zoo. It has grown over the pst 10 years and is continuing to grow. They have some great educational talks and we loved watching the running of the cheetahs and feeding the giraffes. I would definitely recommend this. Take your own snacks. A bag of chips was $2.50.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Fabulous Zoo! Great for kids and adults!", "This was simply a wonderful, although untraditional, zoo. There are not as many animals as a tyipcal zoo, but the animals that are there have far better spaces to roam and seem to be far happier. It is so much more fun to visit a zoo when seeing animals in more \"natural\" habitats. The giraffes were simply magnificent, as were the mountain sheep! Seeing the \"cheetah run\" was a lot of fun. We also did one of the hikes which was enjoyable too. Also loved the model train set - so expansive and endless things to look at. Truly impressive!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Wonderful Zoo!", "This zoo was a delightful surprise. It's interactive, beautiful, spacious and even the fast food is good. My two teenagers, husband and I had a great time. The African village with animals you can pet was a highlight, as was feeding a camel. Parking was easy.\nThe volunteer docents are just great! Highly recommended!\nShow less"], ["Reviewed January 3, 2018", 4.0, "A DATE with furry fronds!", "Impressive and Expansive Habitat for flora, fauna and fowl . You don't have to travel to Egypt to ride a camel $6.00\nKid / stroller friendly with lots to do and see!\nAmple parking, easy to get to ... trolley $6.00 gets you around if'n you don't want to stroll Me thinks the entrance fee $19.95 for adults, a bit pricey for what it is, but so it is When the weather warms Plan to arrive early ... like humans, the animals tend to bask when the heat starts to blast. Zoo, rides, displays, exhibits, shows, food and interactions add to the action\nShow less"], ["Reviewed January 3, 2018", 5.0, "The Living Desert - Don’t Skip this one!", "Loved, this place!!! By far better than any other zoo I’ve visited and of course the weather was spectacular. We visited on Thanksgiving morning in the crowds were minimal. I never knew until that morning that giraffes came in so many different colors and patterns!\n\nWe picked up discount tickets at Costco the day before, slightly out-of-the-way but a great discount.\nShow less"], ["Reviewed January 3, 2018", 4.0, "A Fun Place To Explore", "We were here several years ago and it seems the foliage has grown in nicely since then. The kids enjoyed seeing the animals and walking the grounds.\n\nWe did eat at the cafe in the Africa Village. To put it simply, improvement is needed. The staff was confused, the food not very good, and the prices were high.\n\nI would recommend this location for families with small children. They can run around, see multiple things, and leave easily when tired. Older children will not find it as stimulating and informative as they would Wild Animal Park.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Fantastic!", "Old or young - definitely worth a visit. We planned to just check-it out and ended up spending the day. Beautiful grounds, fascinating scheduled \"talks\" w/animal managers, and a lovely place to stroll around and soak up the desert beauty. Check the schedule when you arrive about special presentations - and plan to be there at the giraffe feeding. We'll be back.\nShow less"], ["Reviewed January 2, 2018", 3.0, "Small enclosures", "Many of the carnivores were obviously unhappy in enclosures that are too small - the African hunting dogs, the wolves, the coyotes, even one of the coatis, were all pacing the same paths over and over, which is indicative of stress and boredom (stereotypic behavior is the scientific name for this phenomenon). On the plus side, the grazing animals had more space and the gardens were all very nice, and I liked the petting zoo. Overall would not recommend to friends.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Exceeded Expectations", "This place is no ordinary zoo—it's a showcase of indigenous desert habitats, both plants and animals that has some exotic animals I've never seen before. I was lucky to be there in the late afternoon for feeding time, which made for fascinating viewing, watching a small cat eat a rat and cheetahs hunt for raw mounds of horse meat that the zookeeper planted in their habitat for them to find. I'd allow around three hours for this beast of a feast. If you're in the area, don't miss it!\nShow less"], ["Reviewed January 2, 2018", 5.0, "Fun Day!!", "A great place to visit! Enjoyed the giraffe feedings and the different hikes in the area. Families really seemed to enjoy the zoo!"], ["Reviewed January 1, 2018", 4.0, "Very cool zoo for folks of all ages!", "I wasn't sure how much I would like this place, as zoos are not of my favorite destinations, but was pleasantly surprised the Living Desert Zoo and Gardens. Many interesting animals, primarily, though not exclusively, focusing on animals of the African and North American deserts. Good signage with helpful explanations on location, habitat, and other interesting pieces of information for many animals. And the ability to feed some animals was neat, especially for children! Also many nice regional gardens, though not as much blooming, given I went there in a winter month.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Family and friends at Christmas", "Beautiful desert park like atmosphere. I always struggle with animals constrained in a living space, but the living desert provides more space and indigenous terrain than most.\n\nThe staff is friendly and knowledgeable. They evening have a top shelf hospital on site.\n\nA recommended experience for the whole family.\nShow less"], ["Reviewed January 1, 2018", 5.0, "A phenomenal place", "Just added this to our must do list for anyone who visits us and we live near LA.\n\nYou can visit here just to walk the lovely paths thru a variety the indigenous gardens, or just to see the wide range of desert animals, or just to see the incredible toy train sets spread over amazing towns, bridges, etc over 3/4 acre. Or do all of these for a very relaxed and enjoyable time. We went when the weather was cool which is ideal. Check the website when you plan to go because the schedule is limited in the heat of the summer.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Getting better all the time", "A fantastic attraction. This is one outstanding venue that is continually changing for the better. We have been supporting members for years. Age ages can appreciate the place. Exhibits are all very well done."], ["Reviewed December 31, 2017", 5.0, "Great zoo!", "You can literally feed the giraffes here! And you're 5 feet from fighting warthogs. This zoo is a wonderful place - clean, educational, and a great mix of plants and animals."], ["Reviewed December 30, 2017", 5.0, "Worth it!", "Somebody told us that the living desert wasn’t worth the visit, but they were totally wrong. We are so glad we visited over the holidays. We arrived later in the evening and there were less crowds than other zoos we’ve visited. There were also holiday lights up which was fun to see. Great variety of animals overall and a lot to do with a family or on your own.\nShow less"], ["Reviewed December 28, 2017", 3.0, "Nickle and Dime you for everything.", "This place really does nickel and dime you after you pay the entrance feel. Pay to see the enclosed bird sanctuary, pay to feed the little birds, pay to feed the Giraffes, after a while it was just ridiculous considering for three adults we were already paying $59.00. The animal's appeared to be well provided for and the grounds were beautiful. However, I think the fee structure could use some improvement.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Wonderful Place for Children of All Ages", "This is a fabulous zoo where everyone can discover and better understand which animals live in this region of the a United States. The gardens are equally organized. I have been to zoos around the world and I believe this is one of the best. There are hikes that you can take and if I had one thing to improve, it would be the San Andreas Fault walk which did not inform. But the hummingbirds, Jaguar, and badger, long horn sheep, and eagles were amazing. The churros were tasty too. The volunteers and employees were helpful. It is a great way to spend a day!\nShow less"], ["Reviewed December 27, 2017", 4.0, "Bright Lights for Christmas at the Zoo", "Walk through a magical wonderland of thousands of lights lit up for Christmas. At night many of the animals are not visible but the paths are all well lit and you do see some of the animals. It would be worthwhile to return during the day to see most of the animals in their original habitat.\nShow less"], ["Reviewed December 26, 2017", 1.0, "Nice zoo, but poor organization", "The zoo itself is great - fun to see bobcats, wolves, zebras, etc all out and active. However, the set up left much to be desired. We bought our tickets online, and the web site said skip the line and go straight to park entry. But in reality there was no separate line for park entry, and the staff was super unhelpful - really brusque - when we asked where to enter. We had purchased tickets for general admission and also for the holiday lights. We assumed we would just stay for the evening display, but instead we were told we had to leave at 5 and re-enter at 6 for the lights. The staff told us they were overwhelmed with 4,000 plus visitors for the lights the night before. With the prospect of having to sit in the parking lot for an hour - nothing was open nearby on Christmas Eve - we bagged the lights and gave our tickets to another family.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Bright Lights - Wonderful Time", "We were visiting Palm Desert and brought our entire family to the Holiday Lights event. It was fabulous. I've never been here during the day to see the animals, but I hear it is great. During the Holiday Lights event there is an opportunity to sit down and have a quick bite and glass of wine for the grown-ups. I think I would attend this function even if we did not have the kids with us. A great experience and a wonderful time.\nShow less"], ["Reviewed December 23, 2017", 4.0, "Extensive and Well-Organized", "This place is unusual. It is sort of a \"zoo,\" but with many enclosures and \"areas\" large enough to \"simulate\" natural habitats for the different animals. Walking is easy along wide paved paths. Everything is \"accessible.\" There is even a \"shuttle service\" available for those who need it (slight extra cost). The focus is on animals and birds of \"desert\" areas of our planet. The entire park is well organized along geographical areas of the world. We were there in the winter (December) and it was perfect walking weather. From all indications, Spring might be the best time to visit, due to the profusion of flowering plants (cacti, trees, bushes, succulents all over!). I can imagine how colorful that must be. The only (minor) complaint is that there is a slight extra charge for some special exhibits or activities, like riding a camel or feeding a giraffe. But overall, prices are reasonable for everything. Kids, especially, seemed to enjoy the place very much.\nShow less"], ["Reviewed December 23, 2017", 4.0, "Well kept zoo and animals", "We had visited Living dessert over the summer 4 years ago. The number of animals at the zoo has increased and they seem to enjoy the winter weather more. Camel rides and chats with animal trainers are a must. Very well kept zoo and do not compare it to big city zoo’s. Can cover it in 4 hours if you are not interested in attending every chat and show there. We did not do the wild lights with starts at dusk at an additional cost. AAA card holders get $2 off each ticket.\nShow less"], ["Reviewed December 22, 2017", 4.0, "One of the better small zoos", "This place has some cool experiences...camel riding, lorakete feeding and giraffe feeding...all extra. However, they have a great diverse set of animals and it’s big enough to occupy half a day with the kiddos."], ["Reviewed December 22, 2017", 5.0, "Living Desert Zoo Plus", "An amazing place to visit. Manageable size zoo & gardens. Affordable tram tours available with very knowledgeable guides. Informative, with enough stops for pictures. Giffraths amazing. Extremely large train display. Food was most excellent at Cafe!"], ["Reviewed December 21, 2017", 5.0, "Cheetahs, Camels & Giraffes - All in One Day!", "There were 13 of us so we boarded the VIP private tour at the gates. Not only did we see the sites that were most important to us, but we were highly entertained by our knowledgeable guide. For groups of 10 or more, this is a great way to get familiar with the park and it's many wonderful animals in their habitats. We saved quite a bit on the regular gate fee with this tour.\n\nThe highlight for the youngest in our group was feeding the lorikeets. Be prepared to pay extra for feeding and/or riding the animals.\n\nPlenty of rest area and shady spots. Lots of walking, so wear sturdy shoes, sunscreen and a hat.\n\nWe were impressed by the rescue work they do for wounded animals brought to their hospital. All in all, a great day and time well spent!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Amazing Christmas Light Show", "There are literally thousands of lights throughout the entire Wild Animal Park. The nighttime effect is marvelous. Bundle up because it gets cold at night; but hot chocolate is available by the Carousel."], ["Reviewed December 21, 2017", 5.0, "Great venue!", "If you like animals, this is great place to visit!!! The African and American sections are really good. LOVED the merketts."], ["Reviewed December 21, 2017", 5.0, "great place to visit", "the living desert started out very small some years ago and has grown into a fabulous attraction. the gardens are lovely and they have many species of animals that are rare to find in any other location. the programs to adopt (care for) animals is wonderful seasonal events are great. it really is a special place for both children and adults.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Hollyday Lights", "This is a time of giving, loving those around us. We each day should be great full what we and and help those in need. The wild life s just something else, wonderful for all ages. Brings in the spite of the Holidays."], ["Reviewed December 20, 2017", 4.0, "Worth a visit!", "It was lightly sprinkling so we decided to take our 5 and 6 year old grandchildren to the Living Desert. The kids loved it! They rode a carousel and a camel, fed giraffes and lorikeets. The big surprise was a wonderful huge model train layout. My grandson spent nearly his whole visit in that area. Definitely worth a visit!\nShow less"], ["Reviewed December 19, 2017", 5.0, "Fascinating", "We loved the low key type of attraction and saw more animals than expected. Managed to get some great pictures of cheetahs and giraffes. There is a lot of walking involved but if you wish, for a small additional fee, there is a hop on/off trolley. Well worth a visit.\nShow less"], ["Reviewed December 17, 2017", 4.0, "Wow! Really Enjoyable day", "Be sure to get here for opening time and review the day's schedule so you can make the most of the day.\n\nAn activity that is really popular is the cheetah run where 3 sister cheetahs are whistle trained to run around their compound in search of food. There is a commentary on the cheetahs and their life in the jungle. At the end the cheetahs are fed meatballs. We were in the viewing area to the right of the compound and got to see the cheetahs eating right in front of us. There are 2 viewing areas..not sure if the feeding area changes from time to time.\n\nThe cheetah feeding was at 11;15am and we we had time to view most of the African display prior to that time.\n\nWe also took advantage of the trail that enables you to walk on the San Andreas fault line. There are 3 trails...a very short one over a fraction of a mile, another which is 1.5 miles long and another much harduous trail which we didn't even consider. If you can on hiking be sure to bring a hat, lots of water and a cell phone. You must return by 5pm before the centre closes. The trails expose you to the vegetation and rock formations of the desert.\n\nWe finished up the day by going through the N American display and lastly, the various gardens. All and all well worth the admission price.\n\nIf you are unable to walk great distances, there are little carts that pick you up and drop you off at various key points all over the grounds.\n\nFor a fee, Children will enjoy feeding carrots to the giraffes. We were quite happy watching them being fed from the nearby area. For a fee, you can ride a camel. We were happy to come along as the camel's were being fed and watch them race from one pen to the other to get to their chow.\n\nAnother memorable feature of this place is the miniature train display. You must see this and if you have children, be prepared to spend a chunk of time in this area!\n\nThe Living Gardens and Zoo is handy to hwy 74 coming into Palm Springs from the south.\n\n\n\nShow less"], ["Reviewed December 15, 2017", 5.0, "WOW Great Lights Display", "This is a great time of year to visit. Go in the afternoon during the day before sunset to see the animals and stay for the Wildlights. The display of lights after sunset is magnificent. The Living Desert is very crowded this time of year but worth the visit and the entrance fee. You can join as a family and get a membership for the year if you plan to visit often. Check the schedule of events and times of operations prior to your visit. There is also a great hiking trail within the grounds that is great to explore. They provide a map but ask specifically about the hiking trail and location if that is something you are interested in.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Beautiful and inspiring place to spend the morning.", "So much to see and experience. Be sure to allow several hours to explore. The docents are friendly and full of information - so be sure to ask questions about the animals and plants. New construction, projected to be finished in 2020 - will have to visit again to see what is new! If we lived in the area, this would be a regular hang out and hiking destination. If you have always wanted to feed a Giraffe, this is the place to do so!\nShow less"], ["Reviewed December 10, 2017", 5.0, "Fantastic Venue", "I had visited the Living Desert somewhere in my past, but I don't recall any animals. I recall this as being a plant museum but the combination of plants and animals is fantastic.\n\nWe live in San Diego, so inevitably we were comparing this with the San Diego Zoo and the San Diego Safari Park.\n\nThe San Diego Zoo is massive compared to this and has a much, much larger catalogue of animals (and plants for that matter). But the animals here were, for the most part, well displayed in spacious outdoor areas that looked less like jail and more like the natural setting seen at Safari Park - and yet remained accessible.\n\nWe heard excellent Keeper Talks at the Cheetah enclosure and the African Wild Dog enclosure.\n\nWe particularly liked the Giraffe enclosure (but I'm partial to those animals anyway). Seeing the Giraffes \"necking\" with the sharp, clear mountains as a backdrop was amazing.\n\nIf we had had more time, I would have liked to return to see the Christmas lights.\n\nDocents were all very helpful. I don't know what it's like at peak periods, but when we were there (December 7) it was not the elbow throwing crowd scene that the San Diego Zoo can become.\n\nIf we lived closer, we'd certainly become members.\n\nNegatives: There were some very large vultures (African?) which were in a very small, flightless enclosure. Food choices were slim.\nShow less"], ["Reviewed December 10, 2017", 3.0, "Lights are all you are going to see", "Went to the Living Zoo for the Christmas lights, little disappointing, there certainly are a lot of lights but not the greatest presentation, some looked like they were just thrown on trees. Would be ok for kids I suppose but I did not think it was worth money.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Giraffe feedings! Camel riding! Oh My!", "Although we didn’t have an opportunity to ride the camels, that will be next on my visit! So enjoyable taking our Grandson to this special place where he actually feed the Giraffe...cool thing was to see her baby next to her (great photo op!) Festive look with the color lights in the evening for the Holidays! Lots to see and do for young children! GO!\nShow less"], ["Reviewed December 6, 2017", 5.0, "A Nice Desert Visit", "We enjoyed our morning at the Living Desert. We joined in with a docent on a walk about, and he added some very interesting aspects for our visit. The Living Desert has a lot to see covering the America’s and Africa. We enjoyed it and would visit again next time we are in the area. A large number of volunteers work at the Living Desert, and there is a lot of pride in the work being done there. It is a bit pricey to get in and then there are additional extra charges for things like jumping on their shuttle buses, or entering an aviary, or feeding the giraffes. It is a great place for little ones and adults to visit.\nShow less"], ["Reviewed December 5, 2017", 4.0, "Enjoyed a wonderful night of Christmas zoo lights", "Based on our limited visit we would certainly return to enjoy the entire zoo. Excellent staff and a very professional setup for kids to enjoy the lights etc."], ["Reviewed December 4, 2017", 5.0, "First trip here", "We enjoyed the zoo, and the train at the end!! Amazing! It took us about 2 1/2 hrs to walk around, enjoyable"], ["Reviewed December 2, 2017", 5.0, "Christmas Lights", "While visiting Indio, we decided to take in the Wildlights! What a fabulous display of Christmas lights!! There were some animals out and about but it was dark, past their bedtime. We lived the display of lights and just walking around the Zoo while dark was really cool! Great night for the family! Thank you and Merry Christmas!!\nShow less"], ["Reviewed December 1, 2017", 4.0, "Great Time with Wife Exploring and Learning", "Not large but nice place to visit. Good look at the animals. Easy walk. The giraffes were awesome. Be sure and get there to help feed them\nShow less"], ["Reviewed November 29, 2017", 5.0, "WILD LIGHTS!", "I've never been to the LD in all my years living in PD. But I came here tonight for Wild Lights! We also got a military discount on tickets for $8 each, score!\n\nThe weather was perfect this evening. We didn't originally plan to come, so I was wearing flip flops. Not recommended.\n\nMost of the animals weren't very active at night, but we still saw a lot of them. The cheetah enclosure was my favorite.\n\nLots of Christmas lights which were beautiful. Highly recommend coming here before the December season when it's probably crazy packed with people.\nShow less"], ["Reviewed November 27, 2017", 4.0, "Great little zoo!!", "Lots of animals to see with great walking paths! Lots of opportunities to sit and plenty of water fountains. Food was ok, nothing special! Feeding the giraffe was a highlight!!! (But did cost an additional $6)"], ["Reviewed November 24, 2017", 5.0, "Living Desert Zoo and Gardens and So Much More!", "This is such a special experience! Placed in a very natural setting, this garden and zoo can entertain for hours. From your toddler animal lover to those wanting an interesting hike, you won’t be disappointed in your visit. As of this writing, there was a giraffe feeding for an additional fee, lorikeet feeding and camel rides, also for an additional fee. There are presentations on different animals at posted times throughout the day. You may visit some animals you haven’t seen before! Be sure to look closely at the rugged mountain terrain in hopes of spotting mountain goats. Hiking through the gardens is invigorating and pleasant with different plant specifies well identified. There are multiple options for food and drinks and benches throughout the areas if you brought your own snacks and drinks. There is a shuttle with a guide if you want to get an overview before heading out to your favorite areas on foot.. For those lucky enough to be able to visit frequently, annual passes are available, including couple and family passes, each with their own benefits. AAA discounts available at the ticket window. Free parking. Check temps before your visit. Summer can be hot, hot, hot during the day, but October-May is wonderful.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Fun Couple Hours", "Just a couple morning hours here with our toddler due to unusual November heat. Fun experience just taking leisurely walks between animals. Watched Giraffe feeding. Most of the path is paved but some is sandy which is sketchy for basic strollers. Africa part had a lot more animal action than North America which seemed to be more gardens. Don’t miss the reptile and rattlesnake exhibit just to the left of the entrance - small but cool.\nShow less"], ["Reviewed November 22, 2017", 5.0, "A beautiful place to walk", "The Living Desert Zoo is a great place for people of all ages. The scenery is exceptional and they have a good assortment of unique animals.I highly recommend a visit to the Zoo to everyone.You won't be disappointed!"], ["Reviewed November 21, 2017", 5.0, "Beautiful Zoo and Gardens", "Got there on a Monday morning, bought tickets without much of a line. The park is Gorgeous and well laid out. The animals were up and having breakfast. Later in the day when it gets hot most are sleeping. Park staff are very helpful and knowledgeable. Went for the camel ride and giraffe feeding. Whole family had a great time.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Another Zoo but great backgrounds", "Yes this is just like any other zoo, but the atmosphere was different then most and the backdrop is amazing... Photographers will love this place, many different shots to take here."], ["Reviewed November 17, 2017", 4.0, "Great for photographers", "Amazed at how many birds and butterflies were in the park, not exhibits. The grounds are beautiful. Sad to see the larger animals pacing and unhappy. Especially the big cats. Go early or late otherwise the animals are sleeping in the shade."], ["Reviewed November 16, 2017", 2.0, "I saw some unhappy animals there", "I was very disappointed with the Living Desert Zoo when I saw the Meerkats that were going crazy in their pen, running in circles and crying non stop and looking for a way out. This pen was 5 times too small for those lovely and cute creatures who are very nimble and fast and love to run around. The zoo has plenty of free space to make their pen bigger. Other than that I mostly appreciated the place for its gardens more than its animals.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Come and see!", "Buy an annual membership, and tour the grounds, and see the animals before the general public is admitted. Cool, calm, and serene. By joining, you also support the vision and efforts of the zoo. Good times for all."], ["Reviewed November 13, 2017", 5.0, "Went for the Hike, Loved the Zoo", "My wife and I always wanted to hike the Eisenhower Trail but didn’t want to pay to enter the zoo. This year we decided to bite the bullet and pay the park entrance so we could get to the trailhead. The hike didn’t disappoint! We hiked the wilderness trail in about 2 1/2 hrs. It was mostly moderate with some difficult climbs and rocky terrain. We went early before the weather got too hot. Be sure to take water! You’re going to need it!\n\nWhen we were finished we were too hot and sweaty to enjoy the zoo, so we went home and came back later in the afternoon. So glad we came back. We enjoyed the grounds and the variety of animals. We will definitely return next time we’re in the Valley!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Amazing", "This facility is amazing. The parking is good, pathways inside are nice and wide, directions are very clear. Exhibits all have good signage. They also have an animal hospital onsite. The docents are very friendly and very knowledgeable which enhances your experience. You can even feed the giraffes or ride a camel. Park is expanding with new exhibits in 2018.\nShow less"], ["Reviewed November 11, 2017", 4.0, "Worth a Visit", "We took the private tour and had our own guide and shuttle. Our guide, Bill, was excellent and had an amazing amount of information to share about the plants and animals. They do have a park shuttle ($6 for adults) that will take you around. Part of the park is African animals and the other is North American animals. There have scheduled talks to learn more about specific animals. The model train exhibit is outstanding. The numerous trains go through a model of the Grand Canyon and local areas. If we'd gone on our own, we would have just noticed a lot of desert plants. Bill knew what they were and how they were propagated.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Beautiful zoo in the desert", "An excellent zoo. Great gardens, walking trail, feed the giraffes, and excellent service all around. The staff was always friendly and always helpful. They also had a miniature train set. Being from San Diego and having a great zoo as well, the Living Desert Zoo Was Just As nice. It was great feeding the giraffes and to be so close to them. Overall I definitely would recommend this zoo to anyone visiting this area. If you go during the summer just be prepared for the heat.\nShow less"], ["Reviewed November 10, 2017", 3.0, "Another Zoo", "This made for a nice walk. We saw giraffes, wolves and a couple of other creatures. However most were sleeping somewhere out of our view. Can hardly blame them. Liked the model trains. The kids were really enjoying the zoo."], ["Reviewed November 10, 2017", 5.0, "Best attraction in area for families", "We went to this Zoo as an after thought and so glad we did! It was awesome. We caught a Cheetah demonstration, saw many, many native North American & African animals, a butterfly garden, the reptile house, rode the camels, fed the giraffe, went to petting zoo and rode the carousel. The animals were easily visible and well cared for. Our 1 year old and 9 year old, both parents and grandparents loved it. The volumteer docents were great as was the gift shop. DON'T MISS THIS if you have kids.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Quaint Zoo", "This was a good afternoon excursion. Especially loved the miniature train town they had set up- so much detail! There weren't very many people there which was very nice, no lines for Giraffe Feeding! The habitats were well designed for the most part and the gardens were beautiful. Would have stayed longer if there wasn't a two year old with us-too hot to say out in the sun. Tad on the expensive side but still worth it.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Zoo Day!", "Have taken grandchild a couple of times over the last couple of years and have enjoyed the grounds and seeing the animals that look well kept!"], ["Reviewed November 8, 2017", 5.0, "GREAT EXCURSION", "This is a lovely place for people of all ages. Children and seniors can enjoy the ambiance and animals in their natural habitat."], ["Reviewed November 7, 2017", 3.0, "Too expensive!", "Second time that we spent the afternoon at the zoo and gardens and although we saw some animals, most were sleeping or hiding from the sun so we did not see much (to nobody's fault). However, we noticed that the prices are too expensive. $20 per adult + kids. $8 for a sandwich. Every little attraction within the park requires additional ticket purchases. A family of four would spend $200 at least.\n\nHowever, it is a nice walk through the various paths and the gardens are beautiful.\nShow less"], ["Reviewed November 6, 2017", 5.0, "A day at the Zoo!", "First time at the living Zoo. Loved it. Watching the Cheetahs run was wonderful. Many of the animals were active which is great to see. I like that they have a shuttle that goes around the park as I am challenged to walk long distances. Great family fun.\n\nShow less"], ["Reviewed November 6, 2017", 5.0, "Delightful zoo with fun activities", "I love this zoo! I love that it's desert-themed, since it is in the desert. Depending on time of year, you can ride a camel. Lorikeets land on your shoulder. You can feed giraffes up close and personal. And this year we went to the Boo at the Zoo -- it was fantastic! The indoor activity area was lovely and a relief from incredible heat, as well. Super, super place!\nShow less"], ["Reviewed November 6, 2017", 5.0, "If there is only one thing to do while in Palm Springs...", "The Palm Springs Art Museum, the Palm Springs Air Museum, and the cable car trip up Mt. Jacinto Park are also 'must do's', but this place is so unique. The living desert is worth the visit but having a zoo there as well is the icing on the cake. The most enjoyable zoo I have ever visited, and a photographers dream come true. Plus one of the largest outdoor working railway displays. If you get round in three hours you have missed lots. Will visit every time we go to Palm Springs, an outstanding experience.\nShow less"], ["Reviewed November 5, 2017", 5.0, "A wonderful place to visit when its not too hot", "We visited in November and it was the perfect temp to wander around. My kids loved the Wildlife Wonder show and the animal meet and greets. They also got a kick out of the camel rides and the giraffe feedings. The place is large and the price is right. Great place if you have young kids!\nShow less"], ["Reviewed November 2, 2017", 5.0, "Continues to be the best Living Desert Zoo and Gardens", "We travel to Palm Springs twice a year and look forward to visiting the Living Desert Zoo and Gardens in Palm Desert 2-3 times during our stay. A beautiful 1,200 acre desert park setting with easy paved walking paths and even trams for easy transportation. The zoo and desert gardens promotes desert conservation and offers splendid views of exotic and rare animals including Mexican Wolves, Mountain lion, cheetahs, jaguar, leopards, Desert Bighorn Sheep, Great Horned owl, Golden Eagle, roadrunners, hawks, falcons, coyotes, foxes, giraffes, camels, snakes, tortoises, and many others. The Living Desert Zoo has various wildlife shows and even a Carousel and Merry Go Round. Hours are 9:00AM-5:00PM, but Members can enter the park at 7:00AM. A great facility for families and people of all ages.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Great Way to Spend a Few Hours", "We visited the site on Halloween so there were lots of decorations. The Zoo is divided into two areas, North America and Africa with plants and animals in each. I found the African section particularly interesting since the desert setting seemed more natural for the animals. The staff provides scheduled chats on specific animals which provides an overview on the animal. There are shuttles travelling around the grounds if you need a lift. The model railway exhibit was a pleasant surprise.\n\nI would recommends this location for anyone interested in this type of activity.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Must see", "Visiting family in the area, we made our way to the Living Desert Zoo and I must say it was a highlight of our trip. We got there when it opened and felt as if we had the place to ourselves. The staff/volunteers were very friendly and helpful with directions and our questions. We are from Seattle and even with our zoo, a lot of the animals we saw here, we don’t get at our zoo. All the animals were out visibly and we were able to get closer then most other zoos. The highlight of our visit was Feeding the Giraffes offered additional for a small fee. Do this! They come right up to you and you are able to get close enough to touch and feed these beautiful animals. The staff was so friendly and allowed us to take our time and talk to us with our questions. We were able to take any pictures and just enjoy the experience without being rushed.\n\nWe can’t wait to return. A must see if you are in the area.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Private Behind The Scene Tour", "Roshan was excellent in helping me set up our tour which started with a meeting with giraffe handler and private pictures and feeding of the amazing giraffes. Dave was our tour guide and private tram driver he knows everything about the zoo , animals and just a smart and knowledgeable person on everything he truly made our day special . The Cheetah run is a sight to see . Set this tour with up with Roshan and ask for Dave as your guide and you will be guaranteed a day you won’t forget .\nShow less"], ["Reviewed October 28, 2017", 5.0, "Great zoo experience", "We visited yesterday with our 9 year old and 3 year old. Very impressed. Although it was 100 degrees, there was plenty of shade and benches to sit on. The animals and habitats were very well taken care of and the grounds were so clean. The giraffes were adorable and there were great viewing areas. We allowed 4 hours and that was not nearly enough time as my kids could have spent an hour at the train area alone. We did not have time to visit the animal hospital or attend any of the chats, so will definitely return for that. There are plans for expansion and construction was occurring while we were there, but did not distract from experience. Thinking of buying membership just to support this gem and the animals they serve.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Impressive small conservation zoo", "I visited the zoo when it was 100 degrees outside, so, understandably, most of the animals were resting and not moving around. The giraffes were very active, though, as they were being fed. I was very impressed by the large amount of room each animal has to move. Each animal really does have its own mini habitat at the park, and that was lovely to see. My favorite part of the park, other than the giraffes, was the animal hospital. A volunteer docent showed me around the hospital and told me about how the zoo brings animals in from all over to provide them proper medical care. Some animals are then released back into the wild, but others are not able to survive outside the zoo. The docent also explained how the hospital is helping to increase the numbers of endangered species. This zoo does amazing work to bring awareness to animal conservation and rehabilitation. I just wish I could've visited when doctors were performing a procedure!\n\nHere are a couple tips...If you are a AAA member, show your card for a $2 discount at the admission window. Also, I recommend walking the park rather than taking the tram. The loop through the park is only 1.5 miles, so, unless you are physically challenged or the weather is too hot, walking the park should be very doable.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Wonderful!", "Every time we are in Palm Desert, we make sure to go here. The animals are wonderful, of course, and the staff and volunteers are a wealth of knowledge. The veterinary hospital onsite is fascinating and you sometimes get to see an animal have an exam. There are so many birds and animals to see—as well as gardens and areas that show what life was like in the past for indigenous people in different deserts.\nOh, and there’s an inexpensive trolley that can take people who are tired of walking or those who have mobility problems to all areas of the park.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Living Desert was a great side trip", "Great animals and loved the zoo keeper talks about the animals paths were marked and very nice grounds"], ["Reviewed October 24, 2017", 4.0, "Fun", "Nice little zoo focused on desert animals. Many exhibits had views into dens so even when the animals slept off the heat we could see them. But hard to compare this to the San Diego zoo only 90 minutes away\nShow less"], ["Reviewed October 24, 2017", 5.0, "Great day out but could do better on the tram", "Second time we have visited in 5 years. Zoo looks better than ever and and very impressed with how clean and organized. Lots of growth and building. The gardens were perfect, all the plant labels and signs to explain the plants and the Staff we met were First Class. Pet hospital is very impressive\n\nThe Giraffe feeding was far better than expected. Staff even help us with pics. Saw most exhibits. The big cats were very special.\n\nOnly beef, need more trams, got stuck several times with Tram already full. Need more trams.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Amazing Place!", "Oh My! What a great place! There is so much to see here. Unfortunately it was too hot for us to stay the whole day.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Most amazing zoo!", "My husband and kids love zoos... me not so much. But this place!!!! It was out of this world. Between the Amazing docents everywhere you looked, to the most interesting and inviting exhibits, to the \"extras\" that broke up the monotony of making it animal after animal (carousel, petting zoo, botanical gardens, discovery center). My favorite was seeing the native California animals in their native environments. We will definitely be back. If we lived closer, we would be members.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Different zoo experience", "We had a great day as a family with our five year old at the zoo learning about the animals of North America and Africa. The zoo is spacious with lots of interesting gardens of the local flora and fauna which for a Brit experiencing a desert world is a great education. We saw Mexican wolves, bobcat the most random looking badger and mountain lion, and loved the animal hospital. There are lots of keepers about and happy to answer questions even when they are not doing a talk and clearly care a lot about the animals. They even let our son feed a peccary as he happened to be passing at dinner time. There is a little education centre on site for the children just to get hands on and it makes a welcome stop from the heat, again with very good staff interacting with the children to explain the environment. Simply loved this place and would hurry back\nShow less"], ["Reviewed October 18, 2017", 4.0, "Living desert visit", "Love the venue and the many interesting animals and other attractions. Very hot weather limited our walking tours but still enjoyed the park."], ["Reviewed October 18, 2017", 5.0, "Always a fun place", "Feed a giraffe...... ride a Camembert ...... sit in the butterfly pavilion and have land on you. Only problem is that during the day, many of the other animals are sleeping. We buy a yearly pass and enjoy going on the spur of the moment.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Awesome!!", "So glad we decided to visit during our La Quinta/Palm Desert trip. They let me feed giraffes, need I say more?!? They also had cheetahs. The grounds were pretty. And the zookeepers / staff / volunteers super friendly and knowledgeable. Enjoyed our time thoroughly."], ["Reviewed October 14, 2017", 4.0, "Desert gardens were beautiful", "The garden part rates a five. Beautifully maintained desert gardens with plants properly and frequently identified make wandering through the park a joy. Side paths increase the accessibility so the park seems to be larger than it actually is. Very photogenic. I have mixed feelings about zoos in general so this review will be somewhat negatively biased. The animal enclosures seemed somewhat small, especially for those animals that naturally have a large range. They did seem to be in good physical condition. I think that this zoo is trying to maintain breeding populations of rare and endangered species which to me is the main reason for a zoo's existence.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Great visit", "Great visit. Animals were out so you could see them. You get so close to the giraffes that you can touch them. They have a large G scale model train set up that my husband loved. You can visit the animal hospital and watch the vets work on the animals.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Amazing Natural Resource", "Living Desert was at the top of our to-do list for our Palm Desert holiday. We were not disappointed. This place is a fantastic natural resource. Wonderful desert garden displays from around the globe. Mixed in during your walk you will see exhibits that provide the animals with a very humane environment. Lots of areas with shade. Staff of 100 and 500 volunteers keep this place in tip top shape. Loved it !\nShow less"], ["Reviewed October 11, 2017", 5.0, "Become a member; you won't be disappointed", "Wonderful setting for leisurely walks among the desert gardens and wild animal exhibits. Or use the wilderness trail for a little more strenuous excercise. Perfect place to take out of town guests, children or fellow nature lovers. Learning opportunities for everyone."], ["Reviewed October 11, 2017", 5.0, "Lovely gardens", "The Living Desert has wonderful gardens full of varieties of plants that grow in several different deserts. They also have some wonderful animals. It's a great place to hike and take the kids."], ["Reviewed October 9, 2017", 5.0, "Amazing, a zoo in the desert!", "Who would have thought there would be a little zoo in the middle of the desert?! Must go if you are there. Staff volunteers are amazing, friendly, helpful. They have so much to see and do. From birds, to reptiles, leopards, hogs, camels, giraffes, and much much more. I recommend getting the shuttle to help get around if you arrive midday and the sun is just beating on you. If you get there early hh it's not too got it's totally walkable.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Sunday Morning at The Living Desert", "First time to visit. Arrived at 9am and was greeted warmly by two women at Entrance. They asked if I would like information or direction. The recommended the Giraffe Exhibit. Went there first and was amazed with number of giraffes and ability to feed them."], ["Reviewed October 5, 2017", 5.0, "Great variety of things to see", "We ended up spending most of the day here. It’s well laid out with great exhibits and bonuses like the carousel and the model train lay out.\nThe kids were excited about feeling the giraffes and I loved the lack of lines everywhere. Getting to pet goats that weren’t aggressive was a hit too. Great grounds and message of conversation. Could use some more activities in the Kids area. But overall lots of fun.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Brilliant", "Real focus on desert plants and animals - but wide range. Big site so seems quite quiet. So good we went back the following day\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beautiful zoo and gardens", "We took our young grandkids to the zoo Saturday. They loved feeding the giraffe! Well, they loved watching Mommy feed the giraffe - they didn’t want too close. They zoo is small, but has some lively exhibits. The little ones loved the play area and the hands on activities available. We were there on the last weekend in September so the carousel was not open. We walked past it - really cool! The train exhibit fascinated my grandson.\nShow less"], ["Reviewed September 30, 2017", 5.0, "A must see!", "Living Desert Zoo and Gardens is a must see. Animals are up close and there are very informative chats at different times. A lot of the exhibits are hands on and good for children and adults alike. My husband and I spent over 4 hours there and we didn't see all it has to offer. The park is much bigger than it looks so I recommend getting a tram ticket. Getting there when it opens in the morning gives a much better chance of seeing the animals during the hot months.\nShow less"], ["Reviewed September 30, 2017", 4.0, "Usual but very good", "We were not sure what to expect but despite the hot day we picked thoroughly enjoyed our visit. The settings for each animal and its unique way of fitting so much in, without being crowded, was brilliant. The volunteers at various locations are an absolute credit - knowledgeable and helpful. One gripe - one quite large \"exhibit\" was being worked on, should we not have been told that when we bought tickets? Would visit again and recommend.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Interesting spot.", "Including exotics and rare cattle this makes for an interesting 3 or 4 hour visit. Much to see in well organized areas for all demographics."], ["Reviewed September 27, 2017", 5.0, "a gem in the desert.", "It is a botonical garden and a zoo that focuses on the deserts of the Southwest. It's beautiful, kid friendly with a discovery center geared to the little kids and the really neat playground. There is even a carousel which runs from October to May or June because the summer is just too hot to run it then. They are only open from 8:00am to 1:30 in the summer again because of the heat. There is a trolley with numerous stops and on/off privileges all day for only $6.00 which makes everything accessible for everybody. The Living Desert is well equipped with wee-placed restrooms, benches, food kiosks and many, many drinking fountains. Programs are scheduled throughout the day giving opportunities for up close and personal contact with some of the critters. I got to hold a snake. Honestly, you should just go. It's even reasonably priced and many hotels have discount tickets available.\nShow less"], ["Reviewed September 27, 2017", 4.0, "A nice diversion in the desert", "I've been to the Living Desert a number of times. If you're in the Coachella Valley and you're looking for a nice daytime diversion, the Living Desert is an option to consider. You'll get some walking exercise and there's a good number of interesting animal exhibits to check out. If you're there when the giraffes are being fed in the morning, you can jump in for $5 and get involved. It's a great photo opportunity, especially for children.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Cool place to walk around in the morning", "We visited first thing in the morning during a week when the daytime temperatures were peaking around 44 degrees Celsius. The majority of the pathways are well shaded and it was a very pleasant stroll around the facility. Not many visitors when we were there so we had plenty of time to enjoy all the exhibits. Very nicely laid out zoo, really glad we stopped here for a visit.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Excellent and Informative", "My wife and I came here and were not disappointed. This is a very well designed zoo. Clearly marked pathways and maps lead you through the zoo. The animal hospital is open to visitors and there are volunteer guides there to answer questions. The gardens are very well marked with signs so visitors know what they are looking at. A tram is available to get around and that might be a good option when the weather is really hot or you are limited on time. This seemed to be better than many zoos due to the layout and how the animals are kept. Highly recommended\nShow less"], ["Reviewed September 21, 2017", 4.0, "Pretty neat zoo", "They have a lot of animals here. We fed the giraffes which was fun so, make sure to do this on your visit. We also added the shuttle service that they have which is much needed as it gets really hot here and you get wiped out form the walking. I also suggest going first thing in the morning when the animals are active and it is cooler in the day as it gets pretty hot early on. They also have a really cool gift shop which I bought a few items there so, make sure to check it out.\nShow less"], ["Reviewed September 20, 2017", 5.0, "This is a Fun zoo.", "It's summer so we went early and most of the animals were still out. They have great informative talks and animals you can get close to. Take water it is after all a zoo in the desert featuring a myriad of (generally rescued) desert critters."], ["Reviewed September 20, 2017", 4.0, "Undergoing Renovation", "We will need to revisit at a later date. Many exhibits were closed. Shows were cancelled. Tip -- if you pay for the Tram use it for your full visit. We used it at the very end to drive back to the gate and were charged the full amount\nShow less"], ["Reviewed September 18, 2017", 5.0, "So Much to see!!!", "I had been here so many years ago and hardly even remembered anythig about it so I thought I would check it out again to see what changed if anything. OMG!!! Was I pleasantly surprised that first off they are doing a trial where they are open on Saturday evenings only thru September from 7pm-10pm. They call it Safari Nights and each night they feature a different theme. (ex. Family Movie Night, Wildlife Wonder Shows, Tequila and Taco Night and Oktoberfest) Hopefully this is successful for them because it was amazing to see this place at night. I saw so many animals out in the enclosures because it was not so hot like it is in the day. I went alone but wasn't for long because I came across the most remarkable and well educated in her field zoo employee (thank you, Amanda) I would have not seen a quarter of what she shared with me on my own. We also were joined by a group of 3 ladies from Canada, they made the tour even more memorable. Amanda showed me every big cat and little ones too, this was her expertise. The zoo is so fortunate to have such a dedicated, so well educated in her field, kind, caring and thoughtful employee. TIP: Go to the North American side of park first, it is only open for the first hour because the area is not lit. Then go to the Africa side. If you don't you will miss the cats. They also have a very large Model train display just before the exit, it is not to missed either! I will definitely return.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Great place to visit with family or friends", "Being in Palm Springs this is a zoo you can really feel like your in another country when walking around. The paths are mostly finely crushed gravel and asphalt so very easy to walk or use a stroller. They have a very cool model train city in one section of the zoo which I hadn't expected. Plenty of shade to cool off in the 100+ temperatures. Great place to visit first thing in the morning and stay till you can't take the heat! The animals outside are all warm weather animals, I felt like I was on a safari somewhere.\nShow less"], ["Reviewed September 16, 2017", 4.0, "Beautiful Zoo", "My son and I visited the zoo in the heat of the morning... It was about 110 degrees. They do have a lot of shade which is nice. They have a lot of animals and the gardens are beautiful. They have the only animal hospital that I have ever been to at a zoo. They will allow you to watch through their windows if they are doing a procedure. The tour was very interesting and we really enjoyed the zoo. We also saw a wild snake sliver its way across the side walk.....\nShow less"], ["Reviewed September 15, 2017", 5.0, "Excellent family treat", "Visited in September when it is part of there summer programme so the park is open from 8.00 to 1.30 when it becomes to hot. The park is divided into 2 areas covering America and Africa. All the animals in the zoo are comfortable with a hot climate so are happy in there environment. There is a wide range of animals and helpful guides ofer talks at the popular species. A full tour takes about 3 hours. I suggest an internet search beforehand to buy tickets which will give a good saving on gate prices. Even at gate price I recommend a visit.\nShow less"], ["Reviewed September 15, 2017", 5.0, "One of the best zoos I have been to!", "I really liked this zoo! I loved the fact that because it is so hot in Palm Springs, only animals which are suited to that climate are kept there. As soon as we walked in we were greeted by a zoo worker who was holding a leopard gecko. She told us all about the species, the individual she was holding and my nephew got to stoke her. You can feed the giraffes which is a great interactive activity for both children and adults I would say! The enclosures were very spacious and appeared to be very natural. I was particularly impressed with the big horn sheep enclosure! The zoo contained animals I had never seen before such as a mountain lion which made the experience more memorable for me. A land train runs around the zoo for visitors should you find the heat too intense to walk in. There are lots of wild animals to be seen around the zoo too with it being in a desert environment. We saw lots of lizards and even a red racer snake which was very cool! If you like animals and are in the Palm Springs area you should definitely visit Living Desert as it is one of the best zoos I have ever been to!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Living Desert!", "The name fits it well. The entire zoo - although not huge, but not as small as some describe either - is set up as a Living Desert. It is a very nice experience. You get the nice \"zoo\" attraction, while enjoying a nice stroll in the \"living desert\"! We also got to enjoy a nice lil bird and animal show.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Friendly and knowledgeable", "Loved the way the staff goes out of their way to inform and assist visitors. Their knowledge and passion for the wildlife was obvious."], ["Reviewed September 7, 2017", 3.0, "A day at the zoo", "I took my grandchildren to the zoo, they r from Seattle where there is a fabulous zoo so we were all disappointed. It was also very expensive, once in the zoo, most activities cost additional fees. Will not waste the time and money to go again!\nShow less"], ["Reviewed September 7, 2017", 5.0, "Fun place to go anytime", "Great for adults or those with small children who need to expend some energy! Members can enter at 7 am so even summer is a great time to go. I by an annual membership and it's a really great buy!"], ["Reviewed September 5, 2017", 5.0, "An incredible location to relax and learn well we are amongst nature in orgis animals", "So impressed that I have purchased a year round pass to be able to visit anytime and wander and wonder Plus get Exercise as I view Incredible animals in their natural and protective environment and beautiful botanical gardens . Peaceful and tremendous layout I love sharing with family and friends.\nWe never get tired of going here! Price is tremendously reasonable especially compared to other Southern California attractions and the money goes to help and feed the animals .\nShow less"], ["Reviewed September 5, 2017", 5.0, "Zoo in Palm Springs", "We live in New Jersey and visit the Bronx Zoo often with our grandkids, however I must say the way this zoo is played out it is far better. When you say get up and personal with annimals this zoom is number 1."], ["Reviewed August 30, 2017", 5.0, "This is truly an awesome zoo and garden!!!", "We only had an hour and 1/2 to visit and wished that I had been able to stay until it closed. Be careful ....the summer hours are 8 - 1 p.m. I will bring my granddaughter back to see this. It was fabulous!\nShow less"], ["Reviewed August 29, 2017", 4.0, "A VERY hot day", "We got there for just after 9 a.m and had already missed 2 of the keepers talks. Understandable due to extreme weather conditions.\nBought the wristband for $6 for the train ride around the park, regretted this as it's easily walkable, but the money does go towards the animals\nParticularly enjoyed the keepers talk at the Cheetahs. All animals appear happy & the enclosures are beyond adequate.\nIt closes at 1-again understandable in the heat but we were a bit pushed to see everything.\nThe animals are very well cared for & the staff are outstanding\nShow less"], ["Reviewed August 25, 2017", 5.0, "A lot of fun", "My family had a lot of fun here. The animals seem well taken care of and the staff is very friendly. The food was reasonably priced and very delicious."], ["Reviewed August 25, 2017", 4.0, "Massive Zoo and Gardens", "This zoo and gardens provides an eye-opening view of wildlife in a very natural environment. Covering hundreds of acres, the displays, both botanical and animal, are impressive. It takes two or three visits to really view the entirety of this zoo and garden. Very educational and excellent for children.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Zoo in the desert", "Lots of exotic animals to see African to America animals, jaguar to giraffes, mountain goats to monkeys. Great for kids. Nice niches for animal and event groupings. A must see\nShow less"], ["Reviewed August 17, 2017", 5.0, "Zoo experience for all ages.", "The Living Desert Zoo & Gardens offers an experience for children and adults in a beautiful, well-organized setting. The zoo offers escorted tours, tram rides, a café(to\nhave a snack and rest), and souvenir shops as well. Do remember to visit the desert garden section with a bountiful selection.. There is an opportunity to buy plants and garden accessories at the garden shop. Zoo members receive a variety of discounts\nthroughout the year. Another great tourist attraction in our desert without the hustle and bustle of larger cities.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Family Fun & Great Hiking", "I've been to The Living Desert many times since we purchased our family pass. Regular visits to the toddler play days and strolls around the park during the holiday Wild Lights. Also, one of my favorite hikes in the Coachella Valley is the big loop trail. It takes about 2 hours to complete the full look and I would not recommend for small children unless they are carried in a backpack. The view as you reach the top is a BEAUTIFUL expansive look across the Coachella Valley. It's both a good workout and great scenery. Tip: you do need to buy an admission ticket or membership to experience the hiking trails, but as a bonus following your hike you can visit the animal. Be sure to check out their website or social media pages for updates on trail schedules due to weather.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Great Zoo to visit !", "We have been members for 30 years and have enjoyed visiting for either an early walk before the Zoo opens to the public, a nice hike during the cooler months and to enjoy watching the animals and viewing the flora. it's a great place for all ages, and so many things to see and do. Very educational with the chat sessions, feed the giraffes, ride a camel, ride on a carausel. We are looking forward to the new entrance and lion exhibition. They do have water fountains, but would like to see them to be all the chilled, filtered fountains. Water is too hot during the summer. They do not have a bar, but can purchase bottled beers/wine and food in the cafes.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Very nice and well maintained attraction", "One the nicest smaller zoos I've ever been to. An excellent variety of animals and plenty of shaded areas to rest during the tour. The snack area was very nice as well. Time and money well spent.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Bring lots of Water!", "The only thing I would suggest is bring lots of water, and if you have small children they may tire easily because of the heat. We enjoyed seeing the animals and especially feeding the giraffes.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Visit early", "Make sure you visit as early in the day as possible. One of the shows we wanted to attend in the afternoon was cancelled because it was even too hot for the animals :(\nShow less"], ["Reviewed August 8, 2017", 4.0, "Worht a stop", "Pleasant way to spend a few hours. Not a lot of shade, so get some water from the gift shop before you set out around the facility. Good selection of exhibits and helpful staff."], ["Reviewed August 7, 2017", 5.0, "Hidden Gem!", "This zoo may be small but it was so much fun and offered a good time for the kids. You may want to start out early if you go in the summer because it gets pretty hot!! But all in all love the zoo!!!"], ["Reviewed August 6, 2017", 5.0, "Desert Zoo", "Great zoo to visit! The employees are friendly and helpful. The animals, birds, and reptiles are amazing. We enjoyed feeding the giraffes, the highlight of our visit."], ["Reviewed August 2, 2017", 5.0, "Lots of baby animals", "This zoo is a beautiful place with lots of baby animals and wonderful docents. It is a must-see if you are in the area!"], ["Reviewed August 1, 2017", 4.0, "Awesome", "The place is amazing, extremely well put together and the staff are so friendly and welcoming. However I was a bit disappointed with the species....Not enough desert animals."], ["Reviewed August 1, 2017", 5.0, "Grest.", "Get there in the AM. Great place. Really overall spectacular. Every person we encountered was friendly and happy to help or offer advice for our kids. . Great! We will be back!\nShow less"]]}}