{"Lombard Street": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Lombard Street", "url": "/Attraction_Review-g60713-d106232-Reviews-Lombard_Street-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/34/e5/ec/lombard-street.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "13404"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94109", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Pretty cool!", "I wanted to visit this street because I played grand theft auto San Andreas back in the day. If you come to San Fran it’s definitely something to view since it’s the most crooked street in America. If it’s not too busy and crowded you can take some pretty cool pictures!\nShow less"], ["Reviewed 2 days ago", 3.0, "Touristy", "We rode the cable car to Lombard St. we walked down the street which had several people doing the same. We tried to take pictures from the top but they were so-so. Same from the bottom. You get better pictures walking on down Lombard St & taking the picture looking up at Lombard St. Definitely a tourist spot - after seeing it I would have rather just viewed the pictures on the internet from an aerial view since you can’t really get the view from the street. Guess I can say I’ve been there...\nShow less"], ["Reviewed 3 days ago", 4.0, "Fun site to see", "Interesting site to visit. Truly a very curvy street. Take a stroll down and do photos from below. It’s fun to get a video to watch cars slowly wind around."], ["Reviewed 3 days ago", 5.0, "Must See and Do!", "This is a typical San Francisco experience! Walk or drive down the street and take in the amazing view (while watching the road!)"], ["Reviewed 3 days ago", 4.0, "Take the cable car as no way can you park!", "We hit Lombard Street on a cold night but luckily we took the cable car then made a pretty steep hill to get to Lombard. It's interesting, it can be crowded but it it something to do one time and check it off your list."], ["Reviewed 3 days ago", 3.0, "Eh", "Its a crooked street. It's fun to drive down and see, but really that's all it is. Drive it, get the picture, and move on"], ["Reviewed 3 days ago", 5.0, "Worth it", "Rented a car for a few hours and with the horrible traffic almost skipped Lombard St, went ahead and drove down it. Glad we did, super fun and cute."], ["Reviewed 3 days ago", 5.0, "Crooked street", "If you have time to spare then the crooked street is worth a visit. Good photo opportunity and if you have a car then you must drive down it."], ["Reviewed 3 days ago", 5.0, "Bendy Road!", "Its a must visit, you would have sen it in films so go and walk it!!! we walked from fishermans wharf, easy to find and a really steep hill before you get to Lombard. But well worth the walk not sure I would fancy living here with all the daily visitors?\nShow less"], ["Reviewed 4 days ago", 5.0, "Good luck walking up", "If you're in SF you need to see it. Make sure you're in good shape before you climb. If you don't want to climb know that the view is better from the bottom than from the top and their is a cable car stop at the top.\nShow less"], ["Reviewed 4 days ago", 5.0, "Walk or Drive - it's fun", "Lombard Street is a must do in SF. I have driven it which was a blast! I have walked down the sidewalk and enjoyed watching the cars. It is just so unique - it's a must do while in town. 👍😄"], ["Reviewed 4 days ago", 5.0, "Stunning - MUST DO", "We visited while in San Francisco for 3 days. Drive your car down this strip of road for sure! The homes that line the street are absolutely stunning and it was so much fun to navigate and say you’ve done it.\nSan Francisco is an amazing city and this is a must see and do.\nWe’ve been by the street several times and admired from afar but to drive down and see the holes up close and personal we soooo much fun!\nShow less"], ["Reviewed 4 days ago", 5.0, "Must see!", "Lombard Street is known for being the worlds most crooked street, defiantly a must see when visiting San Francisco! Also 1st stop off the cable car."], ["Reviewed 5 days ago", 5.0, "Adventures await", "Truly with the visit....we walked up the hill from cable car...wiw oh wow the view..well worth it -- takes a bit of time So lovely"], ["Reviewed 5 days ago", 4.0, "Famous Street in SF", "Lombard Street is famous street in SF, its must watch in SF due its amazing landscape and beautiful houses around. Car drivers enjoy a lot while driving here. It rich experience I loved it oh yeah"], ["Reviewed 5 days ago", 5.0, "Largest crowd of tourists we saw all week!", "This iconic street is one of the must do's of San Fran so we figured we'd get there around dusk and get some great sun setting photos. We did that, and found that a whole lot of other people had the same idea! Still, well worth going there and seeing the crooked street which is so famous. While walking down the street it was kind of fun to muse about the challenges of living on this curvy street, with tourists in your front yard every day.\nShow less"], ["Reviewed 5 days ago", 5.0, "Crazy", "This street is crazy. And cute. You’ve seen it in commercials. Worth the climb up the hill. And from there you can take a cable car back to union square."], ["Reviewed 5 days ago", 3.0, "Bendy Street", "Yep it's a bendy street. That's pretty much it. Oh and lots of people are prepared to nearly get run over to take a picture of it.\n\nThere are some great views of the city from up there though. Just don't walk up unless you really like a long climb.\nShow less"], ["Reviewed 5 days ago", 5.0, "Really neat to watch the traffic", "Lombard street is really crooked but it’s so much smaller than what it appears to be on pictures, movies etc. The road is just about 1 car length long and then it curves. Really cool to see. Glad we were able to see it and take pics.\nShow less"], ["Reviewed 6 days ago", 4.0, "A bit overrated and hectic, but still a must-see/do while in San Fran!", "I guess the top 5 must do/sees while in San Francisco is Alcatraz, Fisherman's Wharf, Golden Gate Bridge, Cable Cars and this!\nObviously Lombard St.& Hyde St. is located on top of a hill so it is not easy to get there from any direction by walking but could quickly become the least time consuming if you are able to do so. It can become very crowded and hectic with people and cars everywhere. People taking pictures, in line to walk down Lombard, waiting to cross the street, waiting for transportation back such as cable cars and buses, along with Uber or lyft rides and cars seeking either for limited parking space on the street or in line to drive down Lombard. But at any rate, better to start from Hyde to Leavenworth St. on Lombard and look back to take pictures from there.\nShow less"], ["Reviewed 6 days ago", 5.0, "Very special", "Amazing view and landscape. We also enjoyed the beautiful houses in this neighborhood. Highly recommended."], ["Reviewed 6 days ago", 3.0, "Underwhelming", "My husband and I realized we were nearby so walked a few streets uphill to reach the top of Lombard Street. Honestly, it was the most underwhelming experience we had. Tons of tourists on foot and in vehicles, and all trying to take pics. There are so many awesome views in San Francisco it would be a shame to spend much time on this or plan you afternoon around it.\nShow less"], ["Reviewed 6 days ago", 5.0, "A must to do", "It is so much fun going down this street. Sometimes you have to wait but it is worth it. The journey makes your home street but pedestrian. Fun Fun!"], ["Reviewed 6 days ago", 5.0, "SWEET!", "Spend the money on a GoCar tour and get to drive down Lombard Street. It's so cool to experience it in a vehicle as opposed to just walking down the street. Worth the money and time!"], ["Reviewed 6 days ago", 5.0, "Fun and a must do tourist stop", "Pretty street! We took the Trolley from Union Square to the top of Lombard. Our family of 5 (three kids under 12) took a walk down the street admiring the beautiful homes. At the bottom you are in the North Beach neighborhood. We walked to Ghirardelli Square for ice cream and then walked on to Fisheran's Wharf, etc.\nShow less"], ["Reviewed 6 days ago", 5.0, "Good place to get some exercise", "What a beautiful and fun stop this was. It’s truly crooked, but wear your walking shoes. We hiked up from the Wharf and it’s a hike UP. Once you arrive there are people standing at the bottom and top of the block taking pics. You can walk up and down Lombard St using steps along the sides. There are gorgeous Flowers and hedges. The residences are pretty too. Definitely a place to visit\nShow less"], ["Reviewed 6 days ago", 4.0, "Quick, fun and great photos", "We drove, it was fun. Offered us a great photo shot. You can walk down it and take pics too.... its quick and abnormal. Is iti worth it... yest if your in the area or have a car."], ["Reviewed 1 week ago", 4.0, "The Crookedest Street in America", "Fun by the way it was designed by city planners many years ago. When horse drawn carriages were popular, this street helped the horses and riders keep their balance while going down a steep incline."], ["Reviewed 1 week ago", 5.0, "Must See", "Visiting this street is truly a workout if you are walking. The street to get close to the actual curvy street is SO steep. If you have problems walking or moving you will need to drive. Alongside the curvy part are stairs to walk up and down. It really is a cool site to see, and I would definitely make time to visit this.\nShow less"], ["Reviewed 1 week ago", 3.0, "Difficult to get a good view", "This was one of the disappointing things about our visit to San Fran. From the images I have seen, they all must have been arial or drone shots as you can't get this view from the ground. Big long queues to drive down and lots of people. Couldn't really get a picture that showed the perspective of the street. Probably would recommend a lot of other places to visit in San Fran before I went back here. Its a very steep walk up a hill to see and not really worth it. Sorry, wish it had been better.\nShow less"], ["Reviewed 1 week ago", 2.0, "Overrated", "We visited Lombard street on a recent family trip. It is cool to take pictures at the bottom. You have to fight crowds and traffic to take the pictures. I'd drive it, but not walk and fight crowds."], ["Reviewed 1 week ago", 4.0, "What an experience", "This is my second visit to this street, the first time was on foot and this time we drove and I was nervous but it quite an experience. I was not able to see the full view of the street."], ["Reviewed 1 week ago", 5.0, "great exersize", "we usually head to the marina and turn up hyde and back towards Lombard with a stop at coit tower. telegraph hill will get your hatr pumping!"], ["Reviewed 1 week ago", 3.0, "Oh my god, my legs hurt!!", "Got lost trying to find this place, we walked up the back of the street, boy that gradient is big!!! From the top of the attraction, you have some fantastic views of the city. I really don't see the fascination with living here, you have to hope your brakes are in good condition!!! Walking home from the pub if you lived here could be a bit problematic too :) From the bottom, you get the photo opportunities and yes, it is a pretty street, but very overrated.\nShow less"], ["Reviewed 1 week ago", 4.0, "OK You've Got to Drive It", "If you have a car or uber or whatever you have to drive on this street. Iconic twisty street that must be a real pain to live on but great for the tourists."], ["Reviewed 1 week ago", 4.0, "Short street visit and picturesque", "It’s not like it’s a lot of see the worlds curviest street but I Guess now that you are there you might as well.\n\nI find it overrated for a street but the background got good manicured flowering plants and scrubs. The city view at the back is not too bad too. You can stretch it to 15 mins but that’s already too much.\nShow less"], ["Reviewed 1 week ago", 5.0, "Famous and worth the ride!", "Words can't describe how much fun this is! The view is amazing all the way down. If you drive down... people will take your picture just to prove that it can be done! So much fun!"], ["Reviewed 1 week ago", 5.0, "You have to experience this street", "Visiting Lombard Street is very funny and so strange. We had luck. It was Sunday. Blue sky and lots of cars and a single bike going down the street. If there is no cars this will be a boring attraction."], ["Reviewed 1 week ago", 5.0, "Do it once! We did it in the rental... it was fun!", "This is an iconic landmark in SF. We HAD to do it. Got a rental and hubby decided to do the 'roads' in San Fran, this one was very interesting to maneouvre around, and we all took great delight in photographing each sway from the rear of the vehicle! Shows how bendy this road really is! Please do it, even if you walk, it's just gotta be done!\nShow less"], ["Reviewed 1 week ago", 5.0, "a fun little walk", "Not far from where we were staying so how could we not?\n\nA fun little walk down an iconic little street. If you are in the area and have a spare half hour, why not?\n\nLots of nice Italian eateries and cafes in the area at the bottom of the zig zags.\nShow less"], ["Reviewed 1 week ago", 4.0, "Good for a quick visit", "If you're nearby or its on the way to your final destination then it's worth having a quick stop to check it out! You get an awesome view from the top! Just be weary of cars"], ["Reviewed 1 week ago", 4.0, "Unique Experience", "We have both driven and walked down the world's most crooked street - what a fun and unusual experience! I can't imagine living in one of the homes along both sides of the street, or trying to get in or out of the garage onto the street while the nearly non-stop tourist traffic serpentines to the bottom. Fun stuff.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun Quick Stop", "There are some great views from the top of the hill. You get to take more of it in if you walk it. Great quick stop and not far walking distance from the bay"], ["Reviewed 1 week ago", 4.0, "Just for fun!", "A neat attraction if you are near by. We took the cable car to the tops for then walked down. There are stairs on both sides of the street so it is safe to walk down. Great views of the city below!"], ["Reviewed 1 week ago", 4.0, "Beware organized break-ins for cars parked in this area!", "The best way to see this street (which is charming and unique, but so are lots of other streets) is to walk down the street and take your time. But don't make the mistake of parking nearby to do that, as there are cars roaming the area frequently just looking for a car with something inside worth breaking the window for. It happens all the time, and is so quick that police can do nothing--the roaming cars keep roaming if they see police! Better to use public transportation to get there or have a driver drop you off at the top and pick you up at the bottom. It's a great sight for tourists (though probably not so great for the residents who have to put up with the traffic), but it's not worth having your car looted to see it.\nShow less"], ["Reviewed 1 week ago", 5.0, "A historic drive", "I took my 2017 Acura RDX down Lombard St (one way only). The red road is kept in excellent condition and was interesting to see private homes beside the road on the way down"], ["Reviewed 1 week ago", 5.0, "A must experience", "Touristic attraction and so easy and quick to get down. Amazing view but the sun is always on the opposite site so it is difficult to get clear photos in the morning."], ["Reviewed 1 week ago", 5.0, "Zig Zag", "You have seen it in the films, so is it like that in real life, sort of, the cars go down a lot slower its very pretty well looked after , so are the houses on it and yep its steep . its one of the icons of san Francisco .\nShow less"], ["Reviewed 1 week ago", 5.0, "Get in shape.", "Decided to walk this street after lunch. O. M. G. It was no easy feat. But it was amazing. The homes were interesting. The owners must be very patient as so many people were there to see this. I’ve been on steep hills before but WOW I’m gonna pay for it, but I guess I paid it forward for dessert.\nShow less"], ["Reviewed 1 week ago", 5.0, "Crooked trip to get you perked", "Amazing street. One of its kind. Really cool. Tried the walk down and up the walkways. Coming up was a real test but made it fine. Must see in San Francisco !"], ["Reviewed 2 weeks ago", 3.0, "San Francisco Lombard Street", "Use a tram in Union Square. A place with a nice road and surrounding hills. I want to visit when the flowers are in full bloom."], ["Reviewed 2 weeks ago", 4.0, "Must drive down!", "This is a Popular location to visit is it worth driving or going to ? Yes and no. I've gone down that street before and it is fun! Now this was a long time ago lately you will find out that it will take you a good amount of time. Many people who live near by dont like people blocking the street. Now you may get lucky and find parking but you got to worry about car break ins! So make sure not to leave any valuables behind!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Amaxing", "Only in San Francisco - Lombard Street Which runs from east to west is world famous for a steep, one-block section with eight hairpin turns.\nIt runs From The Presidio east to The Embarcadero (with a gap on Telegraph Hill), most of the street's western segment is a major thoroughfare designated as part of U.S. Route 101.\nLombard Street or the spiral street is a one-block section, often referred to as \"the crookedest street in the world\", is located along the eastern segment in the Russian Hill neighbourhood.\nA must for anyone visiting San Francisco.\nIt has embraced the Hilliness that has made SF famous in the movies with its steep streets and wonderful views.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "We drove on The World’s Crookedest Street, then climbed up the stairs, again climbed down and saw it in entirety.", "The title \"The World's Crookedest Street\" made us to go to it, though we were in San Francisco for a very brief time. My host drove on the crookedest street and I enjoyed the ride. The crowd gathered was taking photographs of the cars passing by. Afterwards, we parked the car, climbed up the stairs of the street, saw it from the top, walked down the stairs and saw the cars going by and saw it again from the bottom and the whole experience was fascinating. From the surrounding, apart from the street, the passing cars, one gets view of the beautiful houses on both sides of the street and the city of San Francisco. Overall a lovely experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "First time is the charm", "This street is a must see to believe in San Francisco. Be prepared for a hike up very steep hills to get there. Although you can drive down it, walking it really allows you to appreciate the homes the gardens and the road itself"], ["Reviewed 2 weeks ago", 3.0, "Just something to tick of the list", "This was one of the places we had on our “to do list” in San Francisco.\nWas quite underwhelming when we got there. We walked down the steps which was definitely easier than going up!\nWe found that you couldn’t really appreciate the crookedness from views either at the top or bottom.\nI’m sure it would look nicer in the summer when the flowers are in bloom.\nWorth going there just to say you have been but that’s all.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Quirky little tourist spot", "This is a really cool landmark which is featured in movies and games. If you don’t fancy driving it, I suggest walking it from top to bottom. Jump on the Powell-Hyde cable car and get off at Lombard Street, that way you’ll be walking downhill and get some great photo opportunities. Once you’ve passed the zig-zag section continue walking to the junction with Columbia. Turn left and there is a cable car stop which will take you back towards the centre of the city or carry on walking and you’ll be at Fisherman’s Wharf in just a few minutes.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Pleasant", "Nice walk down to see the flowers and houses. But don't really see what all the fuss is about. Worth it just to tick the box"], ["Reviewed 2 weeks ago", 5.0, "248 steps UP (on the right side)...OR 253 steps UP (on the left side)", "Even if you don't have a car to drive down the \"crookedest street\"....you can STILL enjoy beautiful Lombard by walking up...and then down Lombard Street!....OR, you could take a cable car that stops at the top for you to take pics, but whatever you do, don't miss this tourist attraction!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun stop!", "We usually drive down Lombard, but decided to walk up Hyde from fisherman’s warf. Steep hill, but a fun adventure! Got to the top, took some selfies and walked down the stairs along side lombard which gave us a new perspective. I really love how you can see coit from here. The view is a must see!!!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "You Have To See It to Believe It", "Something fun to see and experience. Another bucket item list checked off. We stayed at the Bay Area Comfort Inn and walked a few blocks to the top. After taking In the view we took the stairs on the side down and then walked over to Pier 33 for the Cruise to Alcatraz.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "one of the places for photos", "A bucket list stop when in SF, its a very steep climb from the the BigBus Stop though (recommend to take the Cable Car and stop right on top of the hill, learned it the hard way)"], ["Reviewed 2 weeks ago", 5.0, "A must do.", "My husband and I drove down the beautifully landscaped Lombard Street for the fun of the adventure. Due to keeping the car where it was supposed to be on the street, while avoiding the tourists taking snaps, made it really fun. Pic takers will step anywhere for a good shot, just be aware. A great view and experience.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Cool but ok", "Funky street but that’s about it. We just walked down, ya it’s cool and different but we weren’t taking pictures"], ["Reviewed 2 weeks ago", 4.0, "Wiggly, Winding Street!", "Quite an iconic street and if combined with the cable car (recommended so you don’t have to trek uphill steel gradient) and you can walk down it. It is a beautiful street, lovely to take some picture and obviously full of tourists. But get there early and it’ll be be an amazing memorable experience!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Worth a stop", "The legendary Crooked Road. You have to come from the top to drive down it. Come early in the morning to avoid crowds and get nice pictures. Is fun to drive down with no traffic holding you up."], ["Reviewed 2 weeks ago", 5.0, "Not to be missed!", "Of course you have to go here, but DON'T park and leave your car! It takes less than 45 seconds for thieves to break into you car and steal your valuables - and they lurk in this area because of all the tourists. There have been 80,000 smash and grabs in SF in the past year or so. Don't be one of them.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Love San Fransisco!", "This is a must see. Take the Streetcar from The Wharf up Hyde St to Lombard and walk down the steps. Amazing views from atop the hill. The crooked street is something to see."], ["Reviewed 3 weeks ago", 5.0, "Just drive it", "My Sister in law really wanted to drive down Lombard street, so we planned to do so on our way out of town. We were able to arrive just as the sun was setting and we got some super great pictures. She had a blast and wished she had a sports car instead of our rental so that she could check out the curves better, but the 25 mhp speed limit would have prevented that kind of fun :)\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Tiring!", "When going here, make sure that you wear comfortable clothing and athletic shoes. For women, like my mom, heels are not the vibe here. It's very nice to see the cars going through the winding road"], ["Reviewed 3 weeks ago", 4.0, "The drive of a lifetime", "Driving down the famous \"Lombard Street\" in San Francisco if definitely an experience you should do if you are adventures."], ["Reviewed 3 weeks ago", 5.0, "Fun Walk, Better Drive", "One day we walked down Lombard Street with hundreds of tourists and the next day we drove down. Lots of fun and should be experienced both ways."], ["Reviewed 3 weeks ago", 5.0, "Amazing part of City Streets to see", "This was my favourite place to see in the city of San Fran ... and it did not disappoint , \"Small Cars Big Tours\" MINICOOPER who I found on Trip Advisor gave us an amazing drive down this road has to be done ...."], ["Reviewed 3 weeks ago", 4.0, "Strange but intriguing", "This is a must see sight. The walk up the street looks intense which will have you out of breath a few steps in but worth the experience. The views from the top are very nice."], ["Reviewed 3 weeks ago", 5.0, "Looking down", "Certainly a beautiful sight from up to down and watching the cars travel oh.. so slowly. I would visit again on my next trip to San Francisco"], ["Reviewed 3 weeks ago", 3.0, "Nothing really special", "It is just a block long street that seems to be pretty much better on Summer or Spring, since we were in San Francisco on Winter, I didn't see much beauty on this, as you can see in the pictures.\nBut once you are in San Francisco, you have to go there and take your picture too. It is a really fast tour, and there is a cable car stop on the top corner.\nIf you want to go by walk, be sure you'll be wearing confortable shoes.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Loved it!", "Highly recommend driving this road! It is a unique experience and tight turns are intense! The road is steep and the turns are tight. The views are great also! It's just a road BUT it's all about the experience and saying you did it!"], ["Reviewed 3 weeks ago", 5.0, "Worth checking out.", "It’s a cute little crooked street and worth checking out. We even ended up coming back later in our rental car just to drive down. It was easy to find and worth checking out if you are nearby, but I would not go out of your way or trek across town just to see this street.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "interesting", "I would recommend walking up/down it rather than driving. Good spot to overlook the city as well. Fun, quick stop."], ["Reviewed 3 weeks ago", 5.0, "Fun to drive and even more fun to watch.", "If you want to drive it, be prepared to wait. The traffic backs up because you have to drive it very very slow. It is fun, and very beautiful with all of the flowers."], ["Reviewed 3 weeks ago", 5.0, "A must see", "This is a very cool Street that you can drive down or walk the steps beside. It’s very unique! A good place for a photo!"], ["Reviewed 3 weeks ago", 5.0, "It's real", "I loved cycling down but the hill up is killer and I managed it walking with difficulty. Catch it at sunset for great city views too."], ["Reviewed 3 weeks ago", 5.0, "Lombard street by bike", "My wife and I hired a tandem bike for the day and explored san Francisco. Yes you will need to push the bike in may locations but the highlight is definitely Lombard street. be aware that if wanting to drive down Lombard street, you may be in lines of traffic for hours waiting to drive down depending on time of day. Has to be done and for the extra thrill ride down... Amazing and fun...\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Strangest road I have seen so far", "Lombard Street is definitely a place of interest to view when in San Francisco. An easy ride on the Cable Car to view this very tightly cornered street. (More suited to a billy cart race I think) 😀"], ["Reviewed 3 weeks ago", 5.0, "Is it really the most crooked?", "Dropped in on this one at the tail end of a GoCar tour and was not disappointed. The traffic isn't too bad. Everyone seemed patient and safe. Go for it."], ["Reviewed 3 weeks ago", 4.0, "Fun to go, great opportunity for good pics", "I think we took the worst way to go, it’s better to take Lombard St straight up. The other streets around are more steepest than Lombard itself."], ["Reviewed 3 weeks ago", 5.0, "Worth the Walk", "A fun historic spot. A must see place! Avoid walking directly up Hyde St.....there is a Trolley, but walking up makes you appreciate the view and walk down."], ["Reviewed 3 weeks ago", 5.0, "So Unique", "Okay so this is obviously a big tourist attraction that is packed with both walkers and drivers. But it is so unique and cool that you definitely have to either walk down or drive down. Since my son and I did not have a vehicle we walked down. The landscaping is gorgeous and it really is a sight to see.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Typical tourist attraction", "This area is quite busy, however not busy enough that you aren't able to walk up and down or take a good photo. It's a safe part of the city, no homeless people in this area like in the rest of San Fran. No wifi connections nearby so if travelling and Relying in that it's better to take a bus or cable car as you know the schedule or a taxi as they will wait for you to finish and then take you back.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A must drive!", "Yes! Do it! This little 5mph street is so so fun! Its short but feels like you get a quick history of old SF. The flowers are beautiful when in bloom!"], ["Reviewed 3 weeks ago", 5.0, "One of the many things that makes this city unique", "The beautiful short and winding road that's more than worth stopping for a picture. Wouldn't recommend driving on it, but it's an easy walk from Fisherman's Wharf"], ["Reviewed 3 weeks ago", 5.0, "Very unique", "We drove this street carefully. Then walked back to Fisherman’s Warf and back up to Lombard Street. What a beautiful experience! People rode their bikes down Lombard at. The crowd lingered just to talk, watch each expression and/ or see what excitement happened next. It’s free.. obtain the experience.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun to walk up", "Fun to walk up or drive down. Very busy with limited parking. Police direct traffic there most hours."], ["Reviewed 3 weeks ago", 3.0, "Not so special", "The Lombards Street ist not so special like it looks on pictures. It is a curvy street and might me funny to drive through it."], ["Reviewed 3 weeks ago", 5.0, "Amazing!", "Take a cable car to Lombard Street and walk down the crooked road, great fun watching the cars try out the hairpin bends!"], ["Reviewed 4 weeks ago", 2.0, "Not impressive at this time of the year", "Not as I expected like in the picture as shown. My visit was really at a bad timing. No pretty colorful flowers between the houses and the curved road. They were all chopped off ready for spring. Not impressive and not scenic for photographs. I was really disappointed. I advice travelers to come visit around late spring or summer for the best beautiful view.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "10 minute uphill gets you great views!", "So it might be a bit steep, but there are lots of shallow steps up the side of Lombard Street. And it is worth the 10 minutes up hill for the incredible views of San Francisco. And you get to say you’ve walked the crooked-est street in the world!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "San Franciscan Icon", "We took and Uber down Lombard street and then we stopped at the bottom and got out. It’s cool watching the cars navigate the street. Bring your camera and try and time the picture to get a car on each leg of the zig zag. A great 30 minute activity.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Walk down zig zag street", "A must do while in SF. Started at top and walked down. So unusual. We walked from ghiradellis which was close by. Lots of tourists."], ["Reviewed 4 weeks ago", 5.0, "Epic street", "This one is most known and iconic , but actually there are many of those streets in San Francisco..."], ["Reviewed 4 weeks ago", 5.0, "The best street", "This is the best street I've ever been on. There is so much energy will all the people. U can see the Bay and the coit tower from the top. It even has it's own security. There is a Cable Car that stops right at the top as well.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "So crazy", "I went to check out this street. It is insane. Make sure you go to the top and take pictures before going down the drive is the strangest I have seen. Follow me on instagram for pictures @thehalaaltraveler"], ["Reviewed 4 weeks ago", 5.0, "Lombard street", "Also known as crooked street. It's amazing how this actually exists and still functions. Cars have to come down the street in a swirl like manner. It's only one way going down. Pedestrians have steps on each side"], ["Reviewed 4 weeks ago", 4.0, "Nice view from the top", "Lots of tourists on a weekend, definitely recommend walking along the steps to enjoy views from different angles. Saw many tourists cars drove through the street."], ["Reviewed 4 weeks ago", 3.0, "Interesting but not fantastic", "It is interesting to go to a place that you have seen in a lot of movies and that it is a peculiar landscape, differente from other urban sites.\nIt is a must see in San Francisco, however, it demands just a few minutes to see, take a few picture and leave.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "\"Tedha Hai\" but lovely hai :)", "Just simply loved being there. Wish i had got a chance to drive on this 'crooked street\". The flowers all across the road made it look part of a story book"], ["Reviewed 4 weeks ago", 5.0, "What a drive, guys !!", "I went there with my friend's family and they kindly drove me there by night... Then by day\nI can assure you: just do it twice... It's not the same at all! :)\nYou see different details and it's... magic. If you like American films of the 70-80', you will just adore this tour!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must see!!", "I would recommend driving through the street and walking down as well to get great view of the street and for amazing pictures."], ["Reviewed 4 weeks ago", 5.0, "Worth a visit", "This street is so cool! Well, it's really just one block of Lombard St. Maybe I'm a geek but I loved driving down it. I did not have to wait long, if at all to make the drive. Apparently, it can get quite busy at times so if there is a lineup it is worth considering walking up and down the street. We saw quite a few people walking the steps and stopping to enjoy the view in a way you miss while strapped into your car. If it is busy, my recommendation would be to park nearby and hike to the top to get the full benefit of the view. There are police officers monitoring the cars at the beginning and end of the crooked portion.. There are sidewalks on the side, but they are not crooked. The steps are actually not too steep, and the downhill walk was not bad. The road is decorated with beautiful gardens, and it really is impressive looking at it from the bottom. I would definitely recommend seeing Lombard Street when you're in the area.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Nice!", "Very nice place and a must see if you visit San Francisco. Lombard street is without doubt one the most beautiful attractions to see."], ["Reviewed 4 weeks ago", 5.0, "Nice!", "Very nice place and a must see if you visit San Francisco. Lombard street is without doubt one the most beautiful attractions to see."], ["Reviewed 4 weeks ago", 2.0, "Very dissappointed", "Last time i saw it,35 years ago,it was gorgeous.This time it looked awful,no colour at all.After telling my other half how beautiful it was,he was disappointed tpp"], ["Reviewed 4 weeks ago", 5.0, "Crazy street", "We walked this street a few times. Great exercise and it’s quite a site to see. Would have like to see a car drive down but it never happened"], ["Reviewed 4 weeks ago", 3.0, "It's a street!", "Although it can be fun to watch the gaggles of tourists walking down this street, driving is the real deal. It's a lot shorter than you think looking down from the top. We made a loop a couple of times during the early morning. It's a \"been there, done that\" kind of place.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "So San Francisco", "One word to sum San Francisco would be: hilly. I mostly walked in SF for the 5 days I was there and this street is by far the worst to get to - very steep climb uphill to get to this attraction - and is not recommended for those without good walking legs. You could probably drive there with a little bit of waiting time in between and park along the streets to take photos.\n\nHaving said that, I enjoyed the climb myself and visited twice as the higher altitude provided very nice views over the streets of SF.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun drive", "It was a fun drive. From pictures it is much prettier in the spring than in January. Worth the experience. It would also probably be fun to walk."], ["Reviewed 4 weeks ago", 5.0, "Another must do!", "After seeing the long lines of the cable car to visit Lombard St our group of 12 decided to take a cab ride via Lombard St to our hotel. We had to get three separate cabs, though. I’d highly recommend getting a cab as each of our cabbies gave excellent and at times hiliarious commentary. The price was $13 to our hotel but interestingly we all gave the taxi drivers $20 as the commentary was so entertaining.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Such a neat street", "I have been many times before and this last trip just walked over at night. Great time day or night."], ["Reviewed 4 weeks ago", 5.0, "The world’s most crooked street", "This street has a famous one-block, zig-zag, twisted section with eight tight turns. The hill on which it is located has a slope of 27%. The street has a length of 180 metres (600 feet) long, and a straight-line drop of 125.7 metres (412.5 feet), Although Lombard, is not as steep as many other streets in the world, its zig-zagging brick road, and beautifully gardened slope make it a great tourist attraction.\n\nThe Guinness Book of Records lists Baldwin Street of Dunedin, New Zealand as the world’s steepest residential street. It has a vertical height of 47.22 metres, an average gradient of 3.41, and at its steepest point a gradient of 2.86, which translates to a slope of 35%.\n\nHaving been to both Lombard Street and Baldwin Street, I see Lombard as the greater tourist attraction, and much more exciting to drive down. Be prepared to wait in line to drive down Lombard Street. Typical wait time is 20 minutes, compared to no wait time for Baldwin Street.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A must if in the area", "A real tourist attraction, if you are in San Francisco you must visit Lombard Street. Get there early to avoid the crowds when the bus tours arrive."], ["Reviewed 5 weeks ago", 5.0, "A must whilst in San Francisco", "Fun to see cars navigating this little street. If you can, walk down from the top of the street heading towards the bay as the hill leading the other way is rather step or alternatively take the cable car up from Powell Street. It fun walking down the steps and watching people taking videos as the drive down the street. The view from the top overlooks the bay below and the lights make it a magical sight if you visit at night. Hard to believe it was once a straight thoroughfare many years ago.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Amazing to see", "It's cool to see this road. But it's even more cool to drive on it. You can get off the Hyde Powell trolley to see it from the top as well."], ["Reviewed January 24, 2018", 3.0, "Not that impressed", "We walked to Lombard from our hotel, and to be quite honest I was not impressed. Maybe it was because there where none of the flowers it's famous for at this time of year. It was crowded and you really can't even get a decent photo. I guess if you're driving and want to go down it maybe, but from what I understand the line is insane to do that. The veiw is great though.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Cool tourist attraction", "I always enjoy driving down this crazy road and seeing all the tourists taking photos. I'm sure my car is in someone's photo album somewhere in the world..lol. Have a great time and try to keep your car on the road."], ["Reviewed January 24, 2018", 5.0, "Crooked street of San Francisco with amazing views", "We are staying close to this part of Lombard Street so went for a “quick walk” this morning to take some photos. Be prepared to sweat and puff and use your leg muscles. Great walk and the view from the top looking down is wonderful. There are such beautiful homes around this part of Lombard Street. This is a must do for your visit to San Francisco.\nFisherman’s Wharf and Ghirardelli is close by so make a morning or afternoon of your visit to Lombard Street.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Zig Zag Hill", "Since no commercial vehicles are permitted to drive down the crooked Lombard St, if you really wish to experience it you must either drive yourself (probably not worth fighting the traffic to get there) or make the steep hike up the hill and walk down the steps along either side. The best spot for an attempt at a photo is at the bottom but it is difficult to capture those curves from the ground - bring your drone!\nShow less"], ["Reviewed January 24, 2018", 5.0, "Drive down if you can :)", "Another great tourist photo spot in San Francisco. It didn’t seem too busy and only a couple cars went down when I was there. It’s a good thing people can’t drive back up, imagine manual cars stalling the whole way up. Check it out!"], ["Reviewed January 23, 2018", 5.0, "Really neat.", "So cool! And a must see. And if you can drive down the most crooked street in California. Also very pretty to photograph. Crazy how a street can be designed that way."], ["Reviewed January 23, 2018", 5.0, "Worth the cost of an airline ticket", "Go, walk down, drive down and soak up the view! It’s an experience you can’t grow tired of....we actually have an oil painting of Lombard Street in our home."], ["Reviewed January 23, 2018", 5.0, "Steep!", "This road is much more satisfying to see it in person. Get the full experience and walk from the very bottom of the streets to reach Lombard at the very top! The increase of the streets is simply amazing and great workout for your health."], ["Reviewed January 23, 2018", 3.0, "Walk or drive down", "It is located about 20 minute walk uphill from fisherman’s wharf.\n\nVery cool to visit either by car or by foot.There are stairs on both sides of the road - you cannot walk down the actual zig zag.\n\nWhile in San Francisco, i would recommend finding other hidden staircases... much less touristy and even more beautiful!\nShow less"], ["Reviewed January 23, 2018", 5.0, "iconic", "this street need to be seen to be appreciated! AMAZING! It is so steep. If planning on driving down it, allow yourself some time, can have big queues."], ["Reviewed January 23, 2018", 4.0, "Interesting, good view", "Good to drive down and take a video. You see a good downhill view once you reach the bottom. Hard to believe people actually live there. Its something different. Best seen by car in my opinion."], ["Reviewed January 22, 2018", 3.0, "Over-rated", "There is really nothing fancy about this. The walk is particularly boring. It may be more interesting to drive, but nothing really to talk about."], ["Reviewed January 22, 2018", 5.0, "Go in the morning", "If you like to drive through the Lombard Street between Hyde and Larkin, the best way to do is drive the north direction on Hyde coming from Union Street, then simply you could make a right turn at Lombard which makes much easier and the best time to do is in the morning before it gets crowded in the afternoon.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Because it's unbelievable! and free!", "I've driven down it now a dozen times and it never gets old. The line sometimes gets too long, but if you plan it well you can say you've driven down the crookedest street in America, say that three times. It amazes all ages, makes you scratch your head and ask why? January is not a peek tourist time, which makes it perfect for a Lombard drive. Don't forget your camera and yes it's still free.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Just What It Is", "Took a Cable Car to the top and walked down. From here it's a short walk to Fisherman's wharf.\nEven though this an Icon of SF and a must see to say you did, once you see it, you've seen it. Beautiful buildings and great landscaping.\nHow can anyone live on this road?\nShow less"], ["Reviewed January 22, 2018", 3.0, "Not such a big deal", "Theres a great panoramic view though you can appreciate from either the top or the base of the street"], ["Reviewed January 22, 2018", 4.0, "Lombard is Worth A Look", "Lombard is very cool and not to be missed on your visit to the Bay area. It is more steep than it looks and if you park at the top and walk to the bottom, be ready for cardio on the return up. The Real World house is at the bottom of the next block if you are looking.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Cool stop when visiting San Francisco", "Of you are in the area, seeing Lombard Street makes for an interesting detour. Watching the card descend and then walking down the sidewalk yourself gives you an appreciation for just how crooked the street is. There are also some cool houses on the street that provide some architectural interest. Sturdy shoes are recommended.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Well worth the drive down!", "Such a fun street in San Francisco. Driving down was half the fun (as well as all the steep hills it took to get to the start of the street). We filmed a video from the passenger seat driving down and the kids and our friends have loved seeing the drive down.\nShow less"], ["Reviewed January 21, 2018", 4.0, "A Must See in San Francisco", "I would give this 5 stars except that you have to wait in line so long to drive down it. Or you could walk with no wait but that's not for folks with knee issues. But it is beautiful with the houses & gardens & a great view. The last time we actually did it after dark with no wait & there was enough light with house lights & head lights & of course there were the night lights of the city below. But if you've never done it before you'd probably want to do it in the daylight.\nShow less"], ["Reviewed January 21, 2018", 5.0, "A Must Drive!", "We did the (slow) drive down Lombard St. It was so much fun I'd do it again.\n\nThere is generally a lot of traffic going down Lombard so the journey will be slow but that is good as its a street not to be going fast down.\n\nMy wife was filming the journey on the way down and there are some awesome city views you can capture.\n\nI wouldn't suggest doing down Lombard in the wet but this is a must do in San Fran.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Fun views and work out!", "Lombard street is the crookedist street and you will see amazing views and a great work out. If going up hill be prepared it is very steep, great glut work out! Be respectful of the homes and people that live there please. Amazing views from up there so you will get great pics on a clear day. Enjoy.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Loved driving and walking the hill !!", "This is a must do if you have a vehicle while in San Francisco. The view is truly breathtaking albeit, the driver is mostly concentrating on the turns and not the distant scenery :-). Was also nice to park and walk the hill. Beautiful flowers and landscaping and plenty of photo ops on the stairs. Don`t miss this !\nShow less"], ["Reviewed January 21, 2018", 5.0, "Worth it!", "It was a hard-ish walk to the top off the street but it was definitely worth it! A must see when visiting San Francisco."], ["Reviewed January 21, 2018", 5.0, "Definitely a highlight of your SF experience", "Walked to Lombard St from Chinatown for a photo op. It's one of the coolest parts of San Francisco, and everybody knows it, so it's always crawling with tourists trying to get a photo, but at least the drivers know this too and take it all very slowly - not that they have much of a choice! The turns are hilariously sharp and the suggested speed limit is 5 miles per hour though I'm pretty sure most drivers took it at about 2. Getting that photo of the street, however, is harder than it looks - it's not steep enough to easily be able to get a shot of all the bends, so just bear in mind your selfie stick might be useful in crane mode here.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Down you go!", "All the tour buses and cable car stops here and I can understand the fascination. A really pretty area but only worth a stop on foot if you are passing anyway"], ["Reviewed January 20, 2018", 4.0, "\"Crookedest street in the world\"", "You can get here by the Hyde-Powell cable car and get off at Hyde & Lombard in Russian Hill. From the top it is a one way for street cars to get down the 8 sharp bends (or switchbacks) and if you are walking this one block section of Lombard St there are steps at the side with a handrail, so you can walk down or up (walking up would be a struggle).\nFrom Hyde looking down Lombard St you can see Coit Tower on Telegraph Hill.\nWhen we went it was very busy even though it was an overcast day, so it takes a while to get a decent picture at the bottom on Leavenworth St looking up to the top of Lombard St without loads of people in the picture, but it's definitely worth the trip to see this world famous Street.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Worth a visit!", "My colleague mentioned that the Lombard Street was a steep road with a many S-curves but I couldn't imagine how steep and how bendy the street was until I went there.\nThe street is tucked inside a quiet neighborhood and the view from the street is simply amazing and one has to be there to appreciate it. It was a pity I was rushing for time and didn't have the opportunity to drive down the street.\n\nHighly recommended.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Iconic street, hordes of tourists, just like us.", "It’s an interesting curio. The street itself doesn’t offer a great example of San Francisco architecture nor the best views. It is a street worth viewing and is easily accessed from the cable car."], ["Reviewed January 20, 2018", 5.0, "My husband LOVED driving it!", "Most people are afraid of driving it, not my husband! His eyes lit up and boom, the accelerator pedal went down! (There is speed limits) so don't freak out! He loved the steepness and winding turns, I enjoyed the color of flowers, the brick street and housing that surrounded the street like no other!\nShow less"], ["Reviewed January 19, 2018", 5.0, "A must see", "It's a beautiful street that I think does not exist anywhere else. Take the time and visit it and walk it down and then go up from the other side. You can't visit San Francisco and not see it yourself."], ["Reviewed January 19, 2018", 3.0, "Eww", "Lombard at is indeed the most crooked street in America.people live along Lombard. Beautiful homes and you will get a chance for a nice long look. Day and night this street has more traffic than NYC. You will inch painfully down this street. Not for those who get motion sickness\nShow less"], ["Reviewed January 18, 2018", 4.0, "Very busy but worth the walk up and down", "We went in April so no flowers, very busy but worth it to read signs up and down the street. The magic photo straight up the street means you need to stand in the middle of a busy road and risk your life!"], ["Reviewed January 17, 2018", 4.0, "Not as nice in the winter", "Pretty iconic street in San Francisco. I've been here in the summer when all the flowers are blooming and our visit here last month just wasn't the same without the flowers. Everything was bare and cut, its was just a small steep windy road. We didn't even bother driving thru it during the day time as the line up was pretty nuts. Did come back during the night and of course there was barely any cars.\nShow less"], ["Reviewed January 17, 2018", 4.0, "favorite destination", "The street is very picturesque and unique. The kids really enjoyed the twists and turns of the road. All the homes are very well kept and it is such a tourist destination after all these years. Great fun for a 2 min drive."], ["Reviewed January 17, 2018", 5.0, "The crookedest street in the world", "Ever local has a story about going the wrong way on or skateboarding down this street renowned and exhibited in many t.v. shows or movies about San Francisco. It's worth taking a look at, or riding down if you're lucky. The constant intrusions have caused local residents to clamp down on some of the traffic, but even just seeing it from the bottom is pretty cool.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Mind boggling!", "What an odd street, why you'd design it this way is beyond me and I wouldn't want to live her BUT ... it's brilliant! Very busy with tourists driving down it all day and taking pictures but its managed very well. Worth a visit."], ["Reviewed January 16, 2018", 3.0, "Fun", "Really fun to drive down. I went at night so wasn’t any other cars, as heard it gets really busy during the day. It’s not amazing but would do it."], ["Reviewed January 16, 2018", 4.0, "Not just a street!", "I had read a lot of reviews while planning our trip to SF. From people saying it's just a street, to people saying it's not to be missed. After having visited, here's what i think:\n\nIt's NOT just a street, as you don't see crooked streets like these anywhere else! A visit here completes your visit to SF.\n\nWe attempted to do this in the afternoon, and we ended up being stuck in traffic for over an hour. We turned around and left, headed to Telegraph Hill to watch the sunset instead. The next day, early in the morning (around 9:00), we did this without the crowds, without the long queues of cars. We drove up Lombard Street, parked a block from the crooked part, walked down, taking photos along the way, walked back up, and then drove down. This way you get to experience this unique street both by walking it and by driving it! I enjoyed both!\nShow less"], ["Reviewed January 15, 2018", 5.0, "Lucky to go down with our taxi driver", "Because it was a public holiday and the roads were quiet and we also has a really lovely taxi driver we got up drive down the street. It’s short but sweet and very steep and windy!"], ["Reviewed January 15, 2018", 3.0, "TOo many tourists and you can hardly shoot a good picture.", "TOo many tourists and you can hardly shoot a good picture. It is still a must to visit it, but don't expect too much from it."], ["Reviewed January 15, 2018", 4.0, "A must see, but don't carve out a ton of time for Lombard Steet", "FULL OF TOURISTS, don't drive it - go see it and walk down - stop for some pics but prepared for heavy crowds at both ends!"], ["Reviewed January 14, 2018", 4.0, "Iconic Street", "Prepare for a vehicle line of 3 to three hours ,during daytime. At night there is no line . The view is spectacular , it is worth the waiting on line."], ["Reviewed January 14, 2018", 5.0, "Loveliest crooked street", "It's the \"crookedest\" street I have ever seen that people from around the world who visit SFO wouldn't want to miss that spot. It's a downhill street so if you're bringing your car with you, don't forget to check your brakes It's going to be an awesome ride!\nShow less"], ["Reviewed January 13, 2018", 4.0, "Unique driving experience", "This is certainly a unique section of the road, which zig-zags one-way to reduce the steepness. The wrong way to do this is to drive along Lombard St east until you reach that famous section. Since the entrance to this famous section is at the intersection of Lombard St and Hyde St, you should drive north on Hyde St, then make a right turn at Lombard St. (Note - during really really busy holidays, the turns on Hyde could be blocked by police; then you would have to drive along Lombard St, slowly.)\n\nOf course, you can also park your car on Hyde or Leavenworth, and walk up/down by the side of this zig-zag section.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Worth a look", "The worlds curviest street, it's interesting and at the top it has some of the greatest views of San Francisco. The street itself looks nice with the flowers and trees."], ["Reviewed January 13, 2018", 3.0, "The view is amazing and the street is winding, but...", "Maybe in January looking down Lombard street you don't get the best view. It is cloudy, cold, and flowers are not blooming. If I'm back during warmer times, I would want to go back."], ["Reviewed January 12, 2018", 5.0, "Very good expeience", "It was a nice experience\nThings to remeber: GPS will show one road, if you wait in that road it will take one or 2 hours to reach Lombard street ( during weekend), if you take any parellel road it will connect to lombard street, all the parll\nShow less"], ["Reviewed January 11, 2018", 4.0, "Very unique", "If you have not been here you should make and effort to see this unique place. If possible try to drive down it also"], ["Reviewed January 11, 2018", 4.0, "Lombard St Drive.", "Whilst in SF, we wanted to drive down the famous Lombard St. which we did, and as it is a one way down, we had to drive around the block to turn into it.\nIt is as pretty as it looks, and as steep. Also it is a very narrow street, so not good if you have a larger sized car. However it was fun, and the view from the top great.\nHowever hadn't thought about all the houses on the street and how awkward their drive ways, and garages were to access, what a nightmare. But all good fun.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Excellent workout", "Get out your hiking shoes, if you are in San Fran., Lombard Street is a \"must do\". It's fun to walk, but even better to drive. Start at the top and watch as the city disappears..."], ["Reviewed January 11, 2018", 3.0, "It's something to see", "We walked over and walked up and took some great pictures. They had officers directing traffic so everything was running smoothly. It is a fun street to see but please be respectful of the residence."], ["Reviewed January 11, 2018", 2.0, "Wait in line for this?", "OK we have all seen the image but you dont have to be qued up for miles in a motor vehicle to say you have done this. Park, walk and snap a photo if you must but your time could be spent so much better elsewhere.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Pop by a must", "You knew when you was there, a slew of tourists all over it. If you're after a photo, it can make life difficult with everyone that is there forgetting it is also an in-use public road. But, to be fair I travelled with my partner and 9 month old and I walked down Lombard pushing the pram/buggie - there is no way down for a pram unless you take the stairs - forget that, prep your calf muscles and hold on tight.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Better in spring?", "I think this place would be nicer to visit in the spring when the flowers will be in bloom. We visited in December and the place was not as bright as I've seen it in movies. It was still worth the trip as it is one of the iconic places in San Francisco.\nShow less"], ["Reviewed January 10, 2018", 5.0, "SF driving experience", "You cannot go to SF without driving down this iconic street. Traffic does flow, despite always having your foot on the brake, as tourists walk down and wave at you."], ["Reviewed January 10, 2018", 5.0, "Pretty weird", "It’s an icon from San Francisco. You can go on car and take the picture at the end of the ride si you could captura Ted the home zig zag shape of the street! It only take you 7 minutos"], ["Reviewed January 10, 2018", 3.0, "steep and twisty", "Was this worth the walk? I don't think so, would i have been better off doing something else? Yes definitely."], ["Reviewed January 10, 2018", 4.0, "Lombard Street - very popular!", "Most people visit this iconical tourist place, some by car, to drive down this street used in many films case sequences; or the more smarter people get there by public transport and watch the many cars driving very very slowly down: taking their photos of this well known attraction. It is impossible to find a parking place near this section so people usually drive on or take photos on the move.\n\nLombard Street is an east–west street in San Francisco, California that is famous for a steep, one-block section with eight hairpin turns. Stretching from The Presidio east to The Embarcadero (with a gap on Telegraph Hill), most of the street's western segment is a major thoroughfare designated as part of U.S. Route 101. The famous one-block section, claimed as \"the crookedest street in the world\", is located along the eastern segment in the Russian Hill neighborhood. \n\nNo matter at what time of day and even night you will find people in cars driving down this snake like road. Late evening is the best time to visit if you wish to have the experience, but then - few good photos.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Free to wonder", "Top of Lombard you can drive it if you are game or take a cable car to the top and walk down. Another iconic part of SF"], ["Reviewed January 9, 2018", 4.0, "Sweet Street", "Walk this, don't drive it while shooting video like some clown we saw. It is well worth the energy expenditure given the views from the top"], ["Reviewed January 9, 2018", 4.0, "Amazing drive", "Go right to the top of Lombard street and then drive down you will not be disappointed in the view and the craziness of it all"], ["Reviewed January 9, 2018", 5.0, "Take a slow drive", "The best experience was to drive it slowely down the street - we made it twice. Must see and feel place in SF."], ["Reviewed January 9, 2018", 3.0, "Great to see but takes less than 5 min", "Very crowded but good to see and tick off from your list. super crowded so for good pictures - you must go super early. way to crowded during the day"], ["Reviewed January 8, 2018", 5.0, "Walk do not drive Lombard Street", "Take in the view at the top before walking down. It's very crowded and many people are taking selfies at every corner. It's worthwhile to stop and marvel how these houses were built into the hill and if you are lucky enough you'll see one being renovated as did I (the way the houses were shored up was a work of art in itself). Driving down this street does not allow you to appreciate it's character. There's a plaque affixed to a home @half way down the right side of the decent that talks about how the street originated. Please be considerate of the properties you are walking in front of, people really do live on this street.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Crazy street, crazy house prices too", "Who would want to live in a street like this - and pay a fortune for the privilege?\nThis street has to be seen in person. It’s quirkiness cannot be appreciated just looking at photos. It has to be seen to be believed. As a tourist from Scotland I didn’t have a car to drive around the 8 wacky bends (although I would have loved to have driven my wee Mini there) but watching huge 4x4s, SUVs and large saloon cars take the bends at a snail’s pace was fun to watch.\nHubby and I toured the city every day on foot and climbed many a hill, but none had the curves of this one. Go see it for yourself. And have a look at the houses too. $4 million to live in a goldfish bowl? I don’t like neighbours parking outside my home (when there are designated bays) so there’s no way I could handle thousands of tourists a day.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Lombard Street the curviest street in the world", "I really enjoyed this because it was one of the places I really wanted to see in san Fran, we walked up the street one day and then drove down it another, definitely recommend doing this, it only takes a few minutes but its just something a little different.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Take a cab", "Lombard Street is a very crowded attraction but interesting to see and drive at least once. I am always amazed that people would choose to live on this street as have seen tourists not be very respectful of private property."], ["Reviewed January 6, 2018", 5.0, "So cool", "We walked it, both directions during the day and at night, and then we drove it. Walking it is much more fun! Wear good shoes and take your time. It's worth it."], ["Reviewed January 6, 2018", 4.0, "Iconic", "Was lucky enough to explore this twice. First in a go car then we walked down it on our second visit. We had anticipated a long queue but it only took minutes due to low traffic. Worth a look. Recommend going further down the hill to get a good view.\nShow less"], ["Reviewed January 6, 2018", 3.0, "Too much traffic", "It’s a must see for tourists, but it was bumper to bumper and we crawled down the street. We had to wait in a line of cars for 20 minutes before we even go to Lomard St."], ["Reviewed January 6, 2018", 3.0, "Cute", "Saw this street walking the city . It is quant and unusual but bit over rated . We saw other streets that were similar"], ["Reviewed January 6, 2018", 5.0, "Grease your steering wheel.", "Just a great, trivial landmark. Fun to walk, drive and sit and people watch. Pretty landscaping and architecture."], ["Reviewed January 5, 2018", 4.0, "CHECK: Quick 7 minute drive down the windy road satisfies teens curiosity", "I grew up in the Bay Area and NEVER went to see this. Of course, I had heard of it from when I was a kid 40 yrs ago. Teenagers wanted to see it so we visited. Worth saying we did it, views were really cool at dusk with a combo of the night lights yet visibility with some daylight.\n\nNo traffic to drive down and nothing like a real experience and FREE! Easy to do, free and is one of those SF tourist do’s.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Interesting to see", "We walked down the steps next that line either side of Lombard street. It was interesting to see. However, since it was winter, there were no plants in bloom. Good view from the top of the street and good picture place at the bottom to show the street in the picture. However, our entire visit lasted about 15 min.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Over rated", "Went here on a weekday and it was extremely crowded, I would recommend allowing 20 minutes to check it out take some photos and then leave"], ["Reviewed January 4, 2018", 5.0, "Quirky Landmark", "The road is so steep that cars zig-zag carefully down in a conga line of camera-wielding passengers! Walk down at your leisure and enjoy the views and floral displays."], ["Reviewed January 4, 2018", 3.0, "Good to see, very hard to stop while driving", "This one is a great attraction cause of its iconic nature. I was probably less interested in seeing this over everything else that San Fran has to offer, but if you are nearby I would stop by and see it. Just make sure you can get out and be on foot.\nShow less"]]}}