{"Los Angeles County Museum of Art": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Los Angeles County Museum of Art", "url": "/Attraction_Review-g32655-d106166-Reviews-Los_Angeles_County_Museum_of_Art-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/46/54/51/old-lighting-in-front.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2383"}, "address": {"@type": "PostalAddress", "streetAddress": "5905 Wilshire Blvd", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90036-4597", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Urban Lights exhibit", "Me and my gf came here at night, specifically for the Urban Lights exhibit. It was right outfront and wasnt too crowded. It was what any photos youve seen displays. But the actual museum is massive, and is on a museum-lined street. Lots of people taking selfies and family pics. Really nice area. Parking meters in the curb behind on Wilshire Blvd. Cheaper than their parking deck.\nShow less"], ["Reviewed 2 days ago", 5.0, "Wonderful collection of art", "While in LA at the end of last year I decided to do some siteseeing on my own. As a member of my local art museum it gets me into various art museums around the country for free, including LACMA, so I decided to visit, on a weekday.\n\nHours are Monday, Tuesday, Thursday: 11 am – 5 pm, Friday: 11 am – 8 pm, Saturday, Sunday: 10 am – 7 pm, and closed Wednesdays. Admission for LA County residents is: $20 - Adults, $16 - Seniors (65+) & Students, Free for under 18, and free after 3 pm on weekdays. For non-LA county residents it's $25 - Adults, $21 - Seniors (65+) & Students and free for those under 18. Parking is an additional cost. They have a parking garage that costs $16 or there are several other parking lots or metered parking in the area, but you probably won't find any parking that's free.\n\nThe museum always has long term exhibits. Right now they have: Hidden Narratives: Recent Acquisitions of Postwar Art, A Universal History of Infamy: Those of This America, Wu Bin: Ten Views of a Lingbi Stone, Richard Prince: Untitled (cowboy), Pinxit Mexici, 1917/1918: Looking Backward, Stepping Forward Exhibition Image, A Tale of Two Persian Carpets (One by One): The Ardabil and Coronation Carpets, Found in Translation: Design in California and Mexico, 1915–1985, Creatures of the Earth, Sea, and Sky: Painting the Panamanian Cosmos, Alejandro G. Iñárritu: CARNE y ARENA (Virtually present, Physically invisible), and Unexpected Light: Works by Young Il Ahn.\n\nThe collections is spread across several buildings each with several levels. There is plenty of walking to be done, including crossing a street at one point, LACMA is the largest art museum in the western United States, with a collection of over 135,000 objects. Obviously not all are on display but many are. I thought they did a good job in the way they displayed them, using lighting and space well.\n\nWhen I visited I thought all the costumes from the Magic Flute were some of the coolest stuff on display. They were pretty amazing. There was a good amount of 3D art that I enjoyed as well, I liked several of the wooden pieces and sculptures.\n\nThere are three dining options at the museum, a coffee shop, a cafe, and Ray's & Stark Bar with nicer meal selections and reservation options on OpenTable. I did not check out the food places nor did I visit the gift shop.\n\nI am so glad I visited, the collection was extensive and interesting.\nShow less"], ["Reviewed 4 days ago", 4.0, "Great gallery to kill a couple hours", "We love art, and we love art galleries, but we can only spend so long looking at all the beautiful works. This place was massive! LACMA has an amazing collection, just make sure you bring your runners!"], ["Reviewed 1 week ago", 4.0, "Urban Lights", "LACMA is a great museum with extensive art collections. However, I enjoyed the Urban Lights and the sculpture garden the most. It is located in the central LA and traffic and parking are always difficult. The best parking is the museum underground parking. If you have Bank of America debit or credit card, you may get in free on the first full weekend of the month. If you are a LA resident, you may be able to get free admission on certain days of the week. Check LACMA web site.\nShow less"], ["Reviewed 1 week ago", 3.0, "lights", "I went here specifically for the lights only. It was very busy with lots of people taking pictures. I went at night time. I walked here from somewhere else, and the neighborhood was a bit sketchy."], ["Reviewed 1 week ago", 5.0, "Magnificant", "The variety of art you will find makes a visit well-worth your effort. Each time we've come, we've seen new pieces and had a completely unique experience. The effect of LACMA's multiple buildings is that viewers have less museum fatigue.\n\nThe family art room is fantastic!\nShow less"], ["Reviewed 1 week ago", 4.0, "Better value for locals than layovers", "This is an enjoyable museum, with a great permanent collection and interesting exhibits, the hours are good (open til 7 on weekends), and there is parking you can purchase. It is also only half an hour or so in mild traffic to the airport.\n\nThe best deals are for locals, which is reasonable. For those on layovers from a flight, it is a pricey when you add a $25 entrance fee to the $16 for parking. I probably won't come twice unless it is for the day instead of a few hours between flights. But for locals arriving after 3pm, admission is free! What a great deal.\nShow less"], ["Reviewed 1 week ago", 4.0, "A bit pricey but excellent collection", "If you like 20th century modern art you will enjoy LACMA. The museum itself was a bit smaller than expected. It was $54 for 2 tickets and $16 for parking. A bit pricier than other museums we visited (in large cities)."], ["Reviewed 1 week ago", 4.0, "LACMA", "Really nice crowded tourist spot. Great for photos. Would recommend coming in the evening time or whenever its getting dark so you can see the real beauty of the lights. Recommend visiting."], ["Reviewed 1 week ago", 3.0, "Half of museum is closed, but still charging full price!", "I was very disappointed in LACMA, as it was one of the main attractions for my visit to Los Angeles. I'm much more interested in pre-20th century art, so I'm not going to rave about the Rothko's, etc. Much of the exhibit space is closed now, I assume for renovation. Thank goodness the European galleries were still open, and there was a fairly good selection, but the American art was not. The museum looks like it needs significant renovation, and I understand that it's going to cause disruption, but I resent paying $25 to enter and finding this out afterwards. If you go on their website it certainly is not pointed out (maybe in the fine print somewhere?). Go to the Getty instead, it's magnificent!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great collections and exhibits", "Although I am non-plussed by most of the LACMA architecture, the actual art collection is superlative. I was amazed by the modernist european holdings in expression and related movements. Some nice Rothko and Jackson Pollock. Very good Picasso's, and many other modern masters. I also took in the holdings in other buildings - ranging from painting in Mexico to Robert Erwin's awesome metal sculpture. I was truly impressed by the scale and scope of work in this museum. There are also many great outdoor spaces and places to relax in cafe style. Really remarkable and glad I could look past the relatively dull architecture.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A Neighborhood Classic", "This past Sunday, I visited the LA County Museum of Art again for the umpteenth time! I have enjoyed visiting this museum and attending its many seasonal events since my teenage years. The Marc Chagall exhibit recently ended but the current remaining exhibit on Mexico is phenomenal. Ray's & Stark Bar also offers delicious drinks and cuisine in a calming and breezy outdoor setting. The museum also offers Membership and/or free entries to families who may be recipients of California's EBT program. The museum is surrounded by greenery and park space behind and in front. It's a magnificent place for young children and families but also a great place for photographers, seniors, romantic partners and basically any visitor from any walk of life. Go and Enjoy It!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Children can get their parents/guardians in for free!!!", "We’ve been to LACMA twice and only just found out about the NexGen program (after we paid—oh well, it’s for a good cause). LACMA wants to encourage children to visit the museum frequently so they have a program in place that entitles each child under 17 to a free adult ticket of admission (for the parent or guardian bringing them) each time they visit!! You can sign up for NexGen in the children’s gallery, which we accessed to the right of the gift shop. Go straight there and sign your children up, they’ll get membership cards and lanyards within 5 minutes and then their accompanying adults can get in for free! You can read NexGen fast facts on LACMA.org.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing as always!", "Having been a Docent for 20 years, every time I visit the museum and the grounds is like seeing the stars at night."], ["Reviewed 3 weeks ago", 4.0, "Urban Lights!", "Due to time constraints the only parts of the the LACMA that we were able to see were the sculpture garden and the Urban Lights. While we only saw them during the day, the Urban Lights are not to be missed. A wonderful collection of streetlights of all sorts and sizes that made for fascinating photographs. Definitely have to go back to see them at night!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Pretty Attraction", "It's defnitely a popular attraction, but worth the stop! Tons of people taking pictures and it's definitely a tourist stop. I would check it out!"], ["Reviewed 3 weeks ago", 5.0, "Art is that which lifts the souls of men (and women!)", "LACMA is huge - 6 pavilions full of art from all over the world, although the Japanese pavilion is currently closed for renovations. There is something to interest everyone in this place. Post-post modern to Asian, African tribal arts, to traditional and renaissance painting. Everything is at the LACMA.\n\nAdditionally there are cafes, restaurants and a bar for refreshment. The prices range from affordable to insane, but the insane is so good you might want to treat yourself.\n\nBonus: the tar pits are adjacent to the LACMA, with many interesting displays as well as a large grassy area suitable for picnics, letting the kids run around and enjoying the LA sunshine.\n\nA tip: The museum is open until 7pm on Sundays. Go later in the day and you will probably be able to find FREE parking on Wilshire or environs.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great art and fun", "This was a great place to visit. I liked the scultpures the most. Overall it can be a bit crowded, which means it can be a bit noisy. In general you are able to walk around and explore the place with no issues. Restrooms are easy to find.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Day at museum", "Excellent exhibits but not much for kids. We’d leave them at home next time. Parking was kind of tricky too. Great food all around which we enjoyed."], ["Reviewed 3 weeks ago", 5.0, "Great place to spend a day", "I am not a big fan of LA but there are some spots I would recommend. And LACMA is definitely one of them. Nice collections, a lot of good quality outdoor spaces and good eating options on the premises. I think this is a really good option to spend a day for both couples and families with kids.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Loved visiting with our reciprocal membership pass the Whitney", "We really enjoyed this museum and were so happy to get in for free with our reciprocal membership pass from the Whitney museum in NYC. We thought this museum has a far more extensive collection that the MoMA given the sheer size of it. We enjoyed viewing all the art in one building but didn't take in all the other buildings because we went in the evening and were limited in time.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "go in night", "this place is fun, if you have time while visiting LA you definitely should go, i recommend going after the sunset when the lights are on, going in the day is good but you wont be able to get those nice pics.\nthe best thing about it that it is free, and you will be able to find some street parking spot.\ntime to be spent there: less than 30 mins\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Glad I didn't spend $25/person", "We attended the free museum day today and I was pretty disappointed that so much of the exhibit space is closed- I would estimate around 50%. If I had had to pay admission on top of the parking fee, I would have been pretty irritated. The quality was there - just not much to see right now.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Great museum", "My daughter needed to visit museum to view paintings by Spanish artists for extra credit. What a pleasant surprise, we've never been her but would always head to La Brea tar pits next door. There are about 5 buildings to visit with several floors and rotating exhibits. We could have spent hours here with all they have to see. Famous painting by Picasso, Diego Rivera, and then the French artists. I'm not much of an artist but I was very impressed with the other artwork. Will have to go back as we only made it to 3 buildings.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Neat Street Light Display", "I have visited this place 3 times only at night to see the LACMA Street Light display. I've never visited the actual Museum during the day while it's open so I can provide any insight what the Museum has to offer for the paying customer.\n\nThe street light display is amazing because it's art using old street lights that would've been destroyed or thrown away. It doesn't matter what time of night you visit you will find many other people visiting even after midnight. When we went there it was around 1:30am and there were about 25 other people there. We went there hoping to get photos without anybody else in the picture and that wasn't really possible. There are too many people who want to take endless \"selfies\" unfortunately. There is security there at all times so you feel safe there even after midnight.\n\nThe light display is a very unique attraction and it doesn't cost any money to see and parking wasn't too difficult and I don't know how much the fee is to pay for street parking because we didn't pay because of how late it was. There was another interesting building across the street that was worth taking photos of that was lit up in red (I don't know the name of this building unfortunately).\nShow less"], ["Reviewed January 23, 2018", 4.0, "Amazing!", "The urban lights are overhyped but there nice & you don’t have to buy tickets to LACMA to take pictures with them. The museum is beautiful and all of the art works are amazing."], ["Reviewed January 23, 2018", 5.0, "Great place", "Is a wonderful place to visit. If you visit California you can’t leave with out coming to this wonderful place."], ["Reviewed January 22, 2018", 4.0, "Unique Arts", "It is especially very photo-catchy if you visit them at night! Great place to hang out with couples, for some romance encounters."], ["Reviewed January 22, 2018", 4.0, "Just ok", "I love an art museum and was excited for my first visit to LACMA give all of the insta pics I've seen. It was honestly just ok. I loved taking snaps outside but the exhibits were just average."], ["Reviewed January 21, 2018", 5.0, "Always a pleasure to visit", "Easy to get to and into with LACMA membership (especially). Love visiting here with my adult son when he's in town."], ["Reviewed January 20, 2018", 5.0, "Beautiful at Sunset!", "Enjoyed visiting the light display while in LA. Amazing photography opportunities here. There was even a wedding going on in the middle :)"], ["Reviewed January 16, 2018", 4.0, "Good collection", "Decent collection of contemporary on a nice campus, buildings could do with a little TLC.....don't miss the Chris Burden!!"], ["Reviewed January 9, 2018", 5.0, "Worth admiring!", "Well, it was my first time to LA and first time to this light sculpture location, I proposed to my girlfriend here in Nov 2017 along with my close family members, it was a bucket list of mine and my now fiancé, all I can say is magical, its a moment I will never forget! and we played our favorite song from the band \"Journey\" song entitled, \"when you love a woman\" thank you LACMA for the amazing experience, I am super blessed and will never forget that moment! dreams do come true. ALOHA from HAWAII!\nShow less"], ["Reviewed January 6, 2018", 4.0, "\"Urban light\" nice", "\"Urban ligh\" is a nice art installation. we visited during the day and probably its not the best time."], ["Reviewed January 4, 2018", 5.0, "An LA Must See", "The current main exhibition, Found in Translation: Design in California and Mexico, 1915–1985, was an rare treat of so many objects, many unknown to me in this context. LACMA's permanent collection is also worth a long view, especially the rare early Persian ceramics."], ["Reviewed January 4, 2018", 5.0, "Highlight of LA", "I only went there at night. I might not really understand the meaning of the urban light but it looks very nice. Worth visiting!"], ["Reviewed January 3, 2018", 4.0, "For all lovers of art in its many forms", "The major art museum of Los Angeles, one of many. adjacent to the La Brea Tar Pits, it represents a diverse collection of classic and contemporary art contained in a number of individual galleries. It is reachable by auto, bus and taxi. Excellent on site restaurant.\nBest to allow an entire day and check for rotating exhibits..\nShow less"], ["Reviewed January 3, 2018", 4.0, "A must-do for the art fans", "This was one of the main points in our trip. The museum is not expensive and offers a variety of interesting exhibits. I was particularly amazed by the number of Picasso's pieces they have! If you get tired of walking, they have a little cafe, where you can chill and have a snack. After your snack, I highly recommend to go all the way to the top to have a look at the Hollywood sign :) And last but not least, remember to check out the lights installation in front, as well as the levitating mass at the back, outside.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Lovely Museum", "I visited this museum many times with my 2 children from the ages of 3-5 to 8-10. They loved it every time. There is plenty to see and there is a great area for kids to do hands on art. You can also see the Tar Pits while you are there. One of my favorite events is the Children's Film Festival that they host every year. Look uo the NextGen Pass. It allows your child (till they are 18) plus one adult to get in for free all year long! The best.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Struggles to be a Better Museum", "Im an LA native- but i have lived in many other cities. I would love to say that LACMA is my favorite museum - cause its one of the principal museums of LA.....but it just isn't. Its a mess in more ways than one. Its a confusing jumble of mix-matched buildings. Internal signage is terrible making it frustrating to find exhibitions cause you have to walk in and out and through so many buildings.\nI do acknowledge that they are really stepping up their game when it comes to better special exhibitions. And hopefully, that massive new wing they're planning on building will be the proverbial game changer....\nbut for now? I go there reluctantly.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Average museum", "Not a big fan of museums here, so I might take it personally. The museum is very boring, even though is very clean."], ["Reviewed January 3, 2018", 5.0, "Great spot for tourists and locals alike!", "Having lived in CA for 8 years, and LA for over 1 it was high time for me to check this place out. Loved the photography exhibit!"], ["Reviewed January 2, 2018", 4.0, "Urban lights", "Just went to see this location for the urban lights, they are on every night even when the museum is closed. The lights are great to see, very photogenic."], ["Reviewed January 2, 2018", 3.0, "Went to find a Van Gogh", "Basically, a good space, interesting rooms. Cafe was quite expensive for the quality. Shop was lovely and good variety. Main reason I didn’t score higher was because I struggled to find someone to help me locate a specific piece. I asked 3 staff members who couldn’t help me. Finally found another who told me that the piece I wanted to see was in for refurbishment that week.\nShow less"], ["Reviewed January 2, 2018", 4.0, "Chagall Costumes Exhibit was the highlight", "Wonderful collection of art, but the highlight of our visit was the guided tour of the Chagall Costumes Exhibit. Do not miss it. The docent knows so much and is able to reach all ages in the group."], ["Reviewed December 31, 2017", 3.0, "Underwhelming...", "Compared to the size of the place and the variety of exhibits, there isn't all that much to see. If you are looking to get a taste of this and that, LACMA delivers and if you are a student there are some good stalwarts to see in person. However if your tastes lean more toward modern art, better to reserve entry to The Broad. The lights aren't as gimmicky as they look and can provide some good photo ops if that's what you're looking for.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Interesting Collection", "The LACMA has an interesting and eclectic art collection. I liked the early and modern Europe artwork on display. I thought the modern American art would have been better represented. It was a shame that the Pacific collection was not open when we visited."], ["Reviewed December 24, 2017", 5.0, "Something for everyone!", "First off, for L.A. County residents, repeat after me, \"Free after 3, Monday to Friday.\"\nAnd for everyone, \"Kids 17 and under are free.\" \"NexGen kids are free and the can bring 1 adult for free.\" \"NexGen: from the day you are BORN through age 17. Sign up is FREE. Do it first thing when you arrive.\" Yes, I'm biased, I work here. And love it. New, special exhibits are included in admission price.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Only saw the lights but...", "Ran out of time to see LACMA in its entirity, but did stop to see the lights. Carparking expensive but in an expensive part of town. Saw the lights as the sun went down. Very cool...."], ["Reviewed December 22, 2017", 3.0, "Lamp posts", "Didn’t go in, just went for the lamp posts. Great photo but underwhelmed. Maybe go at night for a better photo. They had a toilet which was handy!"], ["Reviewed December 22, 2017", 5.0, "Many things of interest", "LACMA is large, diverse, and easy to view. We are modern art fans, that's why we go there, but the many other areas of art displayed are of real interest also. A new place to park is available."], ["Reviewed December 22, 2017", 5.0, "LACMA", "The Los Angeles County Museum of Art\n5905 Wilshire Boulevard Los Angeles, CA 90030\nA great day can be spent here for those who like to browse through some wonderful exhibitions of art. Set out in numerous building, all with a couple of floors, it is easy to lose yourself for longer than expected. There is a cafe on site, along with well appointed outdoor eating areas for quick bites or lunches or even a quick refreshment on your way between buildings. There are also restrooms of course.\nBetween LACMA and La Brea Tar Pits (which are situated within the same complex) allow most of the day if you intend on visiting them both.\nNaturally, it will be up to you and what time you can spare but I think trying to rush through either of these two attractions will leave you feeling as if you've cheated yourself and wished you had spent a little longer here.\nShow less"], ["Reviewed December 21, 2017", 5.0, "I love the MOMA", "I love the MOMO. There I said it. What is not to love. Besides it is next door to the Tar Pits. The place is a wonder and you will love your time spent there. To do it well make sure you have several hours."], ["Reviewed December 14, 2017", 4.0, "Lits of arts and so called art to see!", "You need most of the Day to see it with a break in between for lunch or coffee there are many departments don’t miss them the only one if you have to miss would be the modern contemporary Art and some of the photography that maybe should not have been there but the rest is worth seeing worth admiring and if you want you can take a guided tour. Don’t miss out on the Japanes building, specially the building architecture itself. Remember the Tar pit and natural history too.\nShow less"], ["Reviewed December 11, 2017", 4.0, "A Very Big Museum", "House in seven building surrounding and urban oasis the museum is BIG. I took in the third floor of the Ahmanson Building that contains European Art. One room held a small collection of Impressionists, many of the grand artists, but minor works. Religious and Dutch Art is a strong suit. The second floor has modern and German art. The patio near the main ticket counter and checkroom is a wonderful place got chill, includes free wifi.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Love, Love LACMA", "One of the great museums of the world and a must see when you’re in Los Angeles. The property is huge so make some time to see the beautiful exhibits. We were there for about three hours and it wasn’t enough time. We will return!"], ["Reviewed December 7, 2017", 5.0, "Great Selection of Art - Including Many Masters", "After being in Paris this art museum shows it has a good selection of masters. Very pleased to see Monet, Rembrandt, Renoir, Picasso and others. Well laid out and properly lit the exhibition was worth the time."], ["Reviewed December 6, 2017", 5.0, "There's ALWAYS something exciting going on!", "Whether it's jazz night or a crazy installation by James Turrell or photo ops at the lights or under the Levitated Mass, there's always something at LACMA. You can dine at the restaurant, have drinks, have coffee at the cafe, visit numerous exhibits, and you still won't run out of things to do! I love LACMA!\nShow less"], ["Reviewed December 3, 2017", 5.0, "Very Satisfying", "This is one of the must visit places if you are in and around Los Angeles. Would recommend going at night and with your cameras."], ["Reviewed December 1, 2017", 5.0, "Who says Los Angeles doesn't have great museums?", "OK, so it's not the Louvre, Uffizi, or the Met, but for this backwater known as Los Angeles it does offer world class exhibitions as well as a strong collection of it's own.\nBeautiful setting, great book store, fine movie events all add to the overall experience.\nEvery out of towner I've ever taken here walks away amazed at the quality of the art.\nOnly caveat, it's spread out over a broad area and for seniors or wheelchair folks it can get tricky maneuvering about. There are elevators and ramps, it's just a large space to get around.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Fantastic", "Fun and beautiful place to hang out take pictures and just to see in general. I would definitely come back and recommend to anyone"], ["Reviewed November 27, 2017", 5.0, "very intersting", "great exebitions & lots of interesting art work. always a visit worth. also good architecture. check it out & take your time"], ["Reviewed November 20, 2017", 4.0, "Always Stimulating", "The permanent exhibit has a lot to offer, and the special exhibits are amazing. Sometimes they even sell out. But my favorite thing to do is picnic and listen to Jazz during the Friday summer concert series. The musicians are incredible and it's free. There are two great places to eat. And a nice bar. The people watching never fails to entertain.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Interesting and popular", "So nice to come there at night. All these lights.. It is amazing and so nice. This place is so popular. People from everywhere enjoy coming and taking pics. This place is special and so different."], ["Reviewed November 17, 2017", 5.0, "Urban Lights are Extraordinary", "I’ve always wanted to see this exhibit that is figured in so many movies! It did not disappoints! It is the perfect place to get really awesome photos! I highly suggest seeing this while in LA!"], ["Reviewed November 16, 2017", 5.0, "Our favourite always", "We love LACMA. Whatever they’re exhibiting is always of the highest quality. Their permanent stuff is amazing. But today we enjoyed tremendously their exhibition of CHAGALL AND MUSIC. the display of his artwork and costumes for 3 ballets and one Opera. If you can get to LA before it closes in mid January. Highly recommended\nShow less"], ["Reviewed November 15, 2017", 5.0, "Large complex with lots of variety", "A large group of buildings make up the complex with everything from room size works to galleries of known to less known artists. Lots to see and amenities as well for a break between buildings."], ["Reviewed November 15, 2017", 5.0, "Didn't go in but went twice to the outside", "The first day, we planned to go but ran out of time, and just walked around the sculpture garden and the Tar Pit area. The Calder fountain sculpture was worth the visit. Then, after reading about how fun the Urban Light exhibit is at night, we made the effort to stop by on our way to dinner. It was worth it! Really fun and great pictures taken!\nShow less"], ["Reviewed November 9, 2017", 4.0, "Decent Exhibits & Good Jazz in the Summertime", "Over the years I have been here many many times. The Exhibits are generally decent. Some have been stellar, such as the Frida Kahlo exhibit. The last time I went this past summer, I don't even remember the Exhibit. I just remember having good coffee at the coffee place near the entrance and enjoying the jazz outside. If you are going to visit a museum for the actual art, I prefer the Broad or MOCA downtown, but as an overall family experience with a place to eat,have coffee or listen to music, LACMA is definitely a solid choice.\nShow less"], ["Reviewed November 9, 2017", 5.0, "What a Gathering Place!", "Just to get a sense of the LA community, this set of museums is very worthwhile. Set on many acres, with several distinct museums, you will see locals there all day every day. I overheard someone saying that they drop in every day at lunchtime. We were there on a Tuesday, and there were many schoolchildren, so arrive early if you want to get to exhibits before them.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A world class museum in LA", "LACMA is an encyclopedic museum in the Mid-Wilshire section of LA. The permanent collection is superb and exhibitions in the Resnick Pavilion and Broad Annex are typically innovative and groundbreaking. There is an excellent bar on the premises and it's nearby several other attractions."], ["Reviewed November 8, 2017", 5.0, "Not to be missed", "A great place to see contemporary art. High quality art exhibition of world standard. Besides a very good permanent art collection covering various periods in European History. Highly recommanded"], ["Reviewed November 6, 2017", 4.0, "Great collection", "Really liked it there, great collections and a wonderful experience overall. Of course the outdoor installation is really exciting to see irl."], ["Reviewed November 6, 2017", 4.0, "Great for a rainy day", "Check the opening hours! not open 24/7!! Great day to visit this place on a rainy day or any day, very interesting"], ["Reviewed November 4, 2017", 5.0, "Trendy, but still fun", "You probably have seen hundreds, if not, thousands of photos of these famous lights on the exterior of the museum. Even long after the museum closes, there are people taking photos and skateboarders cruising around.\n\nYes it's extremely trendy, but just embrace it and check this place out. Besides the lights, there are typically thoughtful and creative exhibitions within. Highly recommended if in the LA area!\n\nI am a travel photographer so feel free to follow along for other travel tips and photos on IG: @neonorth\n\nSafe Travels Friends!\nShow less"], ["Reviewed November 2, 2017", 4.0, "Typical Museum", "I'm glad we came here. Lots of cool things to take pictures of, but at the same time, just another art museum."], ["Reviewed October 31, 2017", 5.0, "A learning experience", "There is a lot of beautiful art works in this museum and it is centrally located in La With plenty of parking in the area and it is next to the LaBara Tar Pits enjoy"], ["Reviewed October 30, 2017", 5.0, "Loved this place!", "Visited a week ago while I was in L.A and unfortunately was only able to see the Urban Lights since we had to fly back home. We came during the day but at night it is even more beautiful. Been wanting to visit since I have seen this spot in about every movie. Spend sometime here there is parking across the street for free for about 4 hours. Worth a visit for sure!\nShow less"], ["Reviewed October 29, 2017", 5.0, "A Must Visit in LA", "You could spend days in this museum. We only went to the building with European art, and only had time to see a fraction of a very good collection. And there is much more in other buildings. It is not easy to get to, at least by public transportation. It probnably akes sense to drive or take Lyft.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Amazing", "A beautiful museum that has several building in a campus like setting. They charge $16 to park in their parking garage. They have an incredible art collection, especially modern with quite a few Picassos. They also have a large Asian collection."], ["Reviewed October 27, 2017", 5.0, "The BEST in Los Angeles", "Strolling through the many isles of art offerings at this wonderful museum is such a treat. Colorful, meaningful and you see the kindness and passion that is put into each of these creations. I imagine myself trying to create such a piece, but it doesn't come through to the hands. The special events that is offered in film, theater and music is so wonderful. The Latin, Jazz, Classical events offered on the weekends at special seasons, showcases some of the best in their field. Parking is easy, prices are fair and what you get for the price is super spectacular. Enjoy the restaurants while on your day of treating yourself to culture. Take a stroll and enjoy. I highly recommend.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Beautiful", "A friend of mine has asked me to come with her to see the place on daytime, although she already was there at night time which I missed on the last day of my LA experience. I was not regretting to come back in daylight with her. Amazing architecture. Lots of people who pose for a good shot and we did had a fantastic time Thanks LA for the lovely memories\nShow less"], ["Reviewed October 25, 2017", 4.0, "Fun Place to See", "I was intrigued by the fun lamp posts they have outside. We paid for admission and spent about 1.5 hours walking around. I loved seeing all the different exhibits. If you are in the area, I highly recommend stopping."], ["Reviewed October 24, 2017", 5.0, "Amazing", "It feels like your on the other side of the space? Well it’s a must visit place when you come in LA."], ["Reviewed October 20, 2017", 5.0, "MUST Visit", "If you ever visit Los Angeles. You must stop at LA County Museum of Art. Please remember to come to this place at NIGHT ONLY. As the light pretty cool. and not realy nice if you visit during the day."], ["Reviewed October 18, 2017", 5.0, "LACMA", "Really nice museum. You can go online and purchase tickets (can also purchase onsite). There is an IOS app for LACMA which is great. It provides a complete layout and schedule of the various exhibits and which ones require extra fees. When you arrive go to the ticket counter & you will be asked to provide proof of your online purchase. You will get a receipt and a map of the exhibit halls. If you have extra time the LaBrea tarpits are adjacent. Enjoy!\nShow less"], ["Reviewed October 18, 2017", 5.0, "Nice Museum", "I ve been there once and I wanted to go back because the place is very nice and it was fun spend one hour taking pictures."], ["Reviewed October 17, 2017", 5.0, "Worth every penny:)", "The best place to go is on a Sunday just because traffic in Wilshire Blvd. is very bad during the week. Parking across the museum is 30-40$ all day. There is so much to see and learn and I will rate my experience a 10. They have special presentations on the weekends.\nShow less"], ["Reviewed October 12, 2017", 5.0, "All kinds of arts", "From the big rock in the outside to all kinds of arts inside of different buildings and many city lights to take pictures, this LA museum can compete with New York museum. You may not have enough time to see in one day."], ["Reviewed October 12, 2017", 3.0, "Where are the California Plein Air artists?", "We visited here 20 years ago. Much has changed but it's still not so impressive.The title cards need to be much more informative. Heavy on the mediocre European art, and of course, the \"hipster\" stuff. Yawn.This seems like the perfect place for California impressionism , and Western and American sculpture, as well as Western indigenous art. I was disappointed not to find it. Where is it? Didn't have time to go to the new Broad. We parked in the LA Brea Tar Pits parking lot, which is much closer to the art museum than the designated parking across the street.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Always great exhibits to see", "We go here every time we are in LA. This time, we saw some very interesting exhibits that were part of the PACIFIC STANDARD TIME show all over Southern California. I especially enjoyed Design in California (1915-1985) and Playing with Fire: Paintings by Carlos Almaraz."], ["Reviewed October 10, 2017", 5.0, "Maze of ancient to modern art", "There are many buildings in the compound. But there are different entry fees for each. We chose the basic entrance and this was an amazing trip within the building. It is multi-level and with many access to the different works of art on display. It felt like going through a maze with each access opening to varied pieces of art. Art lovers will need a whole day to appreciate the pieces on display. There is a small eatery outside the building to satisfy a hungry or thirsty visitor.\nShow less"], ["Reviewed October 10, 2017", 5.0, "LACMA is CHILL", "A wonderful spot to spend the day, look at some art, wander in the garden, grab a coffee, and imagine Saber Tooth tigers. Great for families, dates, or solitude."], ["Reviewed October 8, 2017", 5.0, "13000 artworks dating from past and to the present", "Explore the entire span of art history. We arrived 1 hour before closing, which meant that we only saw fragments of the museum.The positive was that it was easy to find parking, and there was no crowd either at exhibits as well as the cafe.Focused on the Art of America's Building as well as outdoor installations.Guaranteed return visit\nShow less"], ["Reviewed October 6, 2017", 5.0, "Got lost on the way to the tar pits", "We parked in the underground garage and came to Lacma the LA County Museum of art! Six buildings worth the $15 per adult cost! We walked over to the tar pits and saw all of the outdoor features for free! I would've liked to see the video but we missed the last showing at 4 PM. The cost to see this museum is $12 or $17 if you include the 30 min video! Great outdoor covered bar where we watched the Friday night jazz show! Suggest sitting here ordering a bottle of wine if you're not with kids!\nShow less"], ["Reviewed October 5, 2017", 5.0, "Beautiful must see", "This art display is a must for great photo back grounds while visiting the museum area of Los Angeles."], ["Reviewed October 3, 2017", 5.0, "A great way to spend an afternoon", "Beautiful Concert on Sunday - a must do if you are in the area.. and the light display is magical, too, if you have the right camera to take the pictures. I really appreciate the descriptions on the modern American art section. it is well written for beginners like me to start learning about each art piece.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Excellent Museum to Visit", "A huge collection of a variety of art from various periods. Plan on spending at least six hours to do the exhibits justice. And there are a number of famous pieces in the museum that will leave you pleasantly surprised. Well worth the visit. And their free concerts? Wow! Some top names in jazz for free.\nShow less"], ["Reviewed October 2, 2017", 5.0, "GREAT PLACE TO VISIT!!!", "So much to see, wonderful places to discover and explore, new editions to LACMA are really cool!! Lots to see in one day, wonderful contemporary art, great exhibits and spaces plus La Brea Pits adjacent is also great to explore and walk around park which is dog friendly as are outdoor spaces in museum. Multiple eating places, wine bar, sitting areas, beautiful landscape and nice sculpture garden. Can't wait for Academy Awards museum next door, which is under construction and looks amazing. Great place to go!\nShow less"], ["Reviewed September 29, 2017", 5.0, "Got to spend more than a day here to see everything", "This place is awesome! I suggest coming for more than1 day to fully enjoy this place or at least get here very early..even then though you won't be able to fully see everything here. The food is good too. If you are a local, they even have discounts. You can find free parking in the nearby neighborhoods if you don't mind doing that thing called \"walking\"\nShow less"], ["Reviewed September 29, 2017", 5.0, "Fine Art Museum", "The permanent collections are large and varied, really too much to see in one day. The modern art collection seems especially strong, but there are at least one or two examples from most of the Old Masters, Impressionists, and Post-Impressionists too. Temporary exhibitions are excellent. Most recently we saw a really fabulous exhibit on Marc Chagall's work on set design and costumes. The Japanese Pavilion is unique and beautiful. We didn't try the cafe, but the coffee shop was fine.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Excellent", "Really worth a visit, great contemporary exhibitions, atmosphere and space. The location is very central, there is plenty to see for half of the day or even for the whole day if you do it slowly and really enjoy reading about the artists. There is also a program for events, so you should also check if they offer anything else besides the exhibitions.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Excellent General Art Museum", "This is a well-known museum, and deservedly so. It's spread out over about 7 buildings, all within a short walk of each other, many with covered walk-ways. For my interests (modern art), I found it to be excellent.\n\nI had lunch there, quite good. Maybe I got lucky, but I did find on-street parking near the museum.\n\nIt's also adjacent to the La Brea Tar Pits.\nShow less"], ["Reviewed September 22, 2017", 4.0, "I really only went for the outside!", "I have always seen travlers post the lightposts outside of the museum and I had to seee them at night. Such a neat experience, i loved it!"], ["Reviewed September 20, 2017", 3.0, "a nice museum competing with great museums", "This museum has the unfortunate position of competing with the Getty, the Norton Simon and others, and comes in behind that distinguished group. The buildings and collections would be wonderful in most other cities, but not LA. Cannot recommend this attraction if you have not seen the others or various interesting things in Southern CA.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Huge Museum in multiple buildings with excellent collections", "We spent a rewarding afternoon touring four of the buildings housing various collections. German Expressionist, Modern Art and the American Art Collections are very good."], ["Reviewed September 18, 2017", 3.0, "Decent, not spectacular", "The collection is nice, but not great, and a few exhibits are currently closed. If you go, make sure Metropolis is running, as that was easily the highlight for me. Photo attached."], ["Reviewed September 18, 2017", 5.0, "Beautiful place to admire art", "Well organized, interesting. Friendly staff. Take one of the free tours! Good for a 4-5 hour activity. Nice restaurants inside. Connected to TarPits."], ["Reviewed September 15, 2017", 2.0, "A disappointment in LACMA", "I had high expectations of LACMA, located in a major metropolitan area where there are people who have great expertise in the arts, are culturally minded and have the capital to deliver a great museum, but I was disappointed. The buildings were tired, not particularly clean, and with a fair amount of deferred maintenance. The elevator floor in one building would sink in certain areas if you stood there; the same was true in the Japanese pavilion in front of one of the exhibits. The LA Cafe had a reasonably OK menu, but the staff there could have worked in any no-name diner ...no personality and the dining area, like the rest of the complex was tired, the windows cloudy and looking like they could use a good washing. I was expecting something fresh and bright with some excitement and rhythm, but it was lacking. It wasn't that they were rude, they just lacked energy and some zip...just like time clock punchers! The exhibits I saw were not particularly interesting or extensive for a major metropolitan area museum. The American decorative arts section had a few nice pieces, but in style and design conscious LA, I would have expected much more. I was thrilled to see the \"made from life\" bust of George Washington by Jean-Antoine Houdon, the famous 18th Century French sculptor. After viewing it I later noticed three young ladies rather frivolously kidding around the bust as one was taking pictures of the others. At one point one of the ladies posed with her arms around the bust. Where was the guard watching out for this priceless and important American piece? At some point when I am back in LA, I will give the museum another try and hope that my expectations will be met.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great TIPS to enjoy this MUST SEE Museum", "Hello everyone! So, thinking about visiting this amazing museum? Please do! Below you will find my tips and tricks to getting the most out of your visit.\n\nTIP #1 PARKING The underground parking at LACMA is $12, but if you’re planning on just popping by for a few hours or don't mind coming back to plug in coins, take advantage of the parking meters on 6th Street. They’re shaded by trees and have easy access to the backside of the museum.\n\nTIP #2 Get your selfies at Chris Burden’s iconic cast iron street lamps known as Urban Light. These are just as cool during the day as they are at night. But be sure to check out the artist’s lesser-known but equally impressive Metropolis II, where every hour, approximately 1,000 toy cars race through the dense network of buildings!\n\nTIp #3 EATING! A really awesome thing to do that not alot of people know about is the Cur-ATE series, where ArtBites founder Maite Gomez-Rejón connects the dots between food, history, and art by taking guests on a themed gallery tour that concludes with a four-course meal inspired by the evening’s art at Ray’s and Stark Bar. If that isnt your gig there is an AWESOME cafe that is cheaper and quicker!\nShow less"], ["Reviewed September 12, 2017", 5.0, "Must go!", "We go lucky and didn't have to buy ticket and reserve to get in. It was so fun! This art museum is model and fun. I would come back again when I come to LA next time."], ["Reviewed September 10, 2017", 5.0, "Eclectic collection", "From century old sculptures to renaissance paintings to a fast paced miniature metropolis ... the LACMA had loads to impress diverse creative interests! A half day well spent! Then we headed half a mile to the original Farmers Market (near the Grove) for a fresh bite to eat!\nShow less"], ["Reviewed September 7, 2017", 5.0, "SPECIAL LACMA SEASON: PLAYING WITH FIRE: PAINTINGS BY CARLOS ALMARAZ", "This is a great time to visit LACMA. It is an encyclopedic art museum, with great collections of modern, contemporary and historical art of many regions.\n\nIt is also a great place to hang out. Chris Burden's iconic sea of lampposts entitled \"Urban Lights\" is a favorite photo opportunity in Los Angeles. The Museum is now a destination and has a great ambiance. Ray's bar and restaurant in the courtyard is a place to hang and the La Brea Tar Pits and the George Page Dinosaur museum just adjacent. The art collection is magnificent.\n\nHowever, now is a truly unique time to visit the museum.\n\nThis year is the museum has a beautiful show of Carlos Almaraz's paintings entitled Playing with Fire: Paintings of Carlos Almaraz. As stated by KPCC's Marc Haefele this show is \"probably the most comprehensive show of Almaraz’s work ever presented. Maybe it's the most impressive manifestation so far of Pacific Standard Time: LA/LA, an institutional attempt at an exploration of Latin American and Latino art and the way it affects and is affected by Los Angeles.\"\n\nThis show has some of the most beautiful, magical and mysterious paintings ever painted of or in Los Angeles . As Mr. Haefele stated:\" 'Playing with Fire' will truly shake up your mind.\"\n\nI have been waiting since 1989, the year of Carlos' Almaraz' untimely death to see a show of his work this extensive. It has been worth the wait. Don't miss out on this opportunity, the show will remain open until December 3, 2017.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Worth a visit - plan a half day", "There a many building to this museum and it is located right next to the La Brae tar pit museum. Plan the whole day to see both places."], ["Reviewed September 6, 2017", 5.0, "Lots of art", "This museum will be partly closed for the next couple of years in order to build a new building, but there will still be exhibitions and permanent collection to see."], ["Reviewed September 6, 2017", 5.0, "particularly liked their impressionist painting collection", "The museum has a number of buildings and a variety of categories of art on display. The buildings are well lit and accessible. It was a pleasure to walk around and tour the various areas. The layout appeals to guests of all ages.\nThe location was easy to get to and is located in a combination residential and light commercial area. I have been there several times in the past five years.\nShow less"], ["Reviewed September 4, 2017", 5.0, "The Chagall exhibit", "Wow. Never knew about Chagall's involvement with the theatre and costume and set design, so was in awe of the sketches and actual costumes on display. And the portrait gallery with The Dance and a few other incredible paintings, some from private collections, was the icing on this delicious cake. While the exhibit isn't huge, it's well curated, interesting, and a fantastic way to spend Labor Day afternoon. Bravo LACMA!\nShow less"], ["Reviewed August 31, 2017", 5.0, "Always great exhibits", "I have had memberships for years to this museum. A wonderful place with top notch exhibits. I no longer live in the area, but recommend it with no hesitations."], ["Reviewed August 30, 2017", 4.0, "Easy but basic", "I enjoy visiting LACMA but it isn't as stunning as other LA museums. Urban light is a must for a photo opportunity and the specials exhibits are usually decent."], ["Reviewed August 30, 2017", 5.0, "A place to see, a place to stay", "The LACMA is not the most famous museum in LA, yet this place is really worth the trip. I have been there on my way to the airport because I was a bit in advance and had two hours to kill. And guess what... I loved it and I was very surprised but the quality of their collection..\nYou should give it a try.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Fantastic", "I love this museum!! It's really big so you need time if you want to visit all the exhibitions. For me the best thing to do is to go in the afternoon so when u finish your visit it is dark and you can take excellent pictures with the Urban Lights!\nShow less"], ["Reviewed August 28, 2017", 4.0, "HUGE WITH ECLECTIC COLLECTION", "Neat place with some huge outdoor art installations. Then large contemporary collection and then the fine art collection. Very many Picasso's which was cool. It does cost money and the parking is also expensive. I am use to museums being free so I am a little jaded. It is an interesting place and worth a visit but it is certainly not The Met in NYC.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Urban Light display!", "We just happen to drive by this public sculpture of lamp posts in the evening and it was spectacular. It is free and a great place for anyone to hangout. We just stopped at the roadside and spent a couple of minutes enjoying the sight. Visit if you are in the Wilshire Blvd. and you will love it!\nShow less"], ["Reviewed August 21, 2017", 4.0, "Fun with Children", "We had a few hours and the shows were very well presented. Also everything is very children friendly, it was easy to explain and made them read the information."], ["Reviewed August 20, 2017", 5.0, "Surprisingly Wonderful!! Part of our favorite LA day.", "Originally, this was not part of our \"MUST SEE while in LA\" itinerary, but we are so glad that we stopped in. We spent the morning at La Brea Tar pits (which is next door), but became hungry. We weren't in the mood for food trucks so we walked over to the museum café, which was fine.\n\nAfter lunch, we decided to spend the afternoon in the museum, which turned out to be a GREAT decision. We enjoyed walking around the grounds, surrounded by beauty. There were many sculptures, including outdoor pieces, which our little one found interesting. A lot of modern works. More modern Asian art than we had seen elsewhere. There is a separate pavilion that houses Japanese art. We managed to catch one of the activity for kids (Korean brush writing/painting), which was surprisingly fun. There was so much more that we wanted to see - we would definitely come back if we ever visit LA again.\n\nJust as we were leaving, they were setting up for their outdoor concert. We heard the band warming up, which was a treat. It was a great ending to a wonderful day.\nShow less"], ["Reviewed August 16, 2017", 4.0, "pretty cool", "i usually dont like this type of thing, but it was pretty cool to visit and see everything. it is also right next to the tar pits!!"], ["Reviewed August 16, 2017", 5.0, "Extensive holdings, beautifully curated!", "This is a really big campus of art galleries/ museum buildings in a park. One doesn’t hear much about it but it’s DEFINITELY worth spending a day or two there. They have extensive holdings of very high quality, beautifully displayed and curated."], ["Reviewed August 14, 2017", 5.0, "Five stars!!", "This is a large museum with many collections. For any art lovers, you will sure find something you like in one of the halls. We were so delighted to see works of Monet, Picasso, Giacometti, Rodin etc. all in a museum."], ["Reviewed August 12, 2017", 5.0, "Great collection", "This was my first visit to LACMA. I don't know much about modern art but was very impressed with the many exhibits. Don't miss the Shooting Wallpaper."], ["Reviewed August 10, 2017", 5.0, "Great for anyone", "Once a month, they offer free admission and we just happened to be in town on that day. There are so many exhibits that nowhere was really packed. We had a group of all ages and everyone found something they liked. It was new artists, classic, everything you could think of. We were there for a few hours and still didn't get a chance to go through all of it. Wish I would have had more time. A definite must see for anyone visiting.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Magical Museum of Art", "First time getting out of the car and walking thru the exhibits. Good times, saw great and unique artwork and enjoyed it. A great day!"], ["Reviewed August 9, 2017", 5.0, "Loved the new Chagall and Almaraz shows. Do catch them in 2017", "Most of us know Marc Chagall as a painter whose characters fly with love. With his skill, whimsy, and joyful color palette, Chagall designed stage sets and costumes for five operas. \"Chagall: Fantasies for the Stage\" displays the lavish backdrops and quirky costumes with music. You can hear music from Ravel, Tchaikovsky, or Mozart while you view the costumes and sets. What would be finer?\nAnother new exhibit, \"Playing with Fire\" by Carlos Almaraz, features dramatic oils, many set in Los Angeles locations like Griffiths Park. His paintings are intense, dynamic, dramatic. Enjoy!\nOne somber note to both of these is that the painters lived with the specter of death. Chagall escaped Europe in 1941 to do the theater commissions, evading the Nazi net for Jewish people. Almaraz was caught in the AIDS epidemic, dying too young in 1989.\nWe didn't make it to the permanent collection because the visiting exhibits drew us in. I'd like to go back, especially if the traveling shows live up to this level.\nThe museum is also a fine venue for people-watching. Families flock to this place. The installation of Urban Light by Chris Burden (the arrangement of found light poles) is a magnet for anyone with a camera.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Lots of art collection inside", "All kinds of art can be found inside the museum, from Japanese art, Egyptian art, Chinese art, Mediterranean art to all kinds of different culture historical art & paintings are all kept here. The museum is very big to walk around, be prepared to walk alot.\n\nShow less"], ["Reviewed August 8, 2017", 5.0, "Unique Art Collection", "First time visiting and its really unique and contemporary. The restaurant inside LACMA (Ray) has very good salad. John Mason's Red X stoneware art was very interesting so as the Six Part Bars cast urethane art. Robert Grosvenor geometric abstract also took my attention. Ken Price 2011 zizi, fired and painted clay is unique art should I say. Lastly Craig Kaufmann, untitled wall relief (acrylic lacquer on vacuum-form plastic) also captured my attention. Beautiful art, I shall say.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Wonderful visit", "Just as beautiful outside as inside. Unique exhibits in several buildings as well as beautifully curated gardens"], ["Reviewed August 6, 2017", 5.0, "Bring the family for a day of culture from around the world.", "Great place to bring the family for a day of culture and art from around the world. Coming from China, we particularly liked the Native American Art which we found very new and educational - and there are great exhibits from every continent.\n\nOur three year old really enjoyed the Children's art room - very friendly staff, kids get a brush, a palette of paint and unlimited paper to crank out their own masterpieces.\n\nOn the day we visited, there was a lovely outdoor jazz concert which was a lovely way to end the day and had our two kids on their feet dancing. The one downside is perhaps that the parking was expensive.\n\nLocal residents of LA county can enter for free so if you are a local, bring your ID.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Excellent museum!", "I absolutely loved this museum. Its huge collection spans from classical to contemporary art and you could spend hours here just taking it all in. I especially loved the series of Russian abstract expressionist prints. Admission is quite reasonable, considering the size of the collection (it's free to members) and they offer special exhibits for an additional fee. During the summer months the museum had been hosting music concerts and on the afternoon we went, it was a jazz concert, which attracted a lot of people who set up picnics in the shade waiting for the show to start. It's nice to see people so enthusiastic about a museum (same about the people we saw exploring the collection). It's also conveniently located next door to the La Brea Tar Pits. Garage parking was $16 when we went. Highly recommended.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Country", "Very nice. Particular. It's a different high view of LA.and its history. Very American Style. Don't loose it."], ["Reviewed July 30, 2017", 5.0, "Great place to go with kids", "We come here frequently but our most recent visit really exemplified why I love this place. I took my two young children and met another family with kids and we had a super fun day out. From the Boone gallery where kids can paint (and read great books while they wait) to the Metropolis exhibit to the easy walking access over to the tar pits (not part of LACMA, but more broadly the \"museum mile\" experience), the kids had a GREAT time. I particularly love how LACMA offers the \"Next Gen\" experience to families - offering children and one parent free admission through the kids' eighteenth birthdays as a way to introduce art to the next generation/younger kids. Bravo, LACMA, for offering this very special option. Because of LACMA, my kids are better exposed to the wonders of art and will hopefully continue to visit and appreciate museums throughout their lives. Only complaint is I wish food in the cafeteria were a bit better (easiest place to eat with kids, otherwise I would've dined at their very well-regarded restaurant) and parking is a bit steep. Must visit for LA families and visitors as well. Don't miss the Metropolis exhibit!\nShow less"], ["Reviewed July 28, 2017", 5.0, "Must See!", "I read about this place prior to visiting LA and although probably not at the top of everyone's list when they visit LA, the promise of some Kandinsky made it an essential for me. I got that and so much more besides that I spent a full day here and wished I had longer, so many fantastic exhibits through out art history, the foyer itself is a thing of beauty.\nShow less"], ["Reviewed July 27, 2017", 5.0, "5 buildings of very varied art works.", "I booked a ticket in advance but it was not necessary, there are two big entrances and any queue moves quickly. It is possible to go on to the site without a ticket (of the sticker type) to go to the cafes. There is enough to see to last most of the day and there is a park next to it too so you can go in and out when wearing the sticker. The buildings contain quite different works of art and all well worth a visit. The shop was a bit limited compared with other museum shops e.g. New York.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Artist bucket list", "I knew I wanted to go to Urban Light in LA because it's iconic. We ended up going to the museum itself after seeing the pricing. Students are $10 and 17 and under we're free. We whipped out our student IDs and it is easily one of the best $20 i have ever spent while traveling. I have been to the Louvre and I live close to the Dali museum in Florida so I'm no art rookie. They have a wonderful gallery space and wonderful artists! Saw my first Picasso! And they an iconic Warhol piece. Sadly, The Great Wave by Katsushika Hokusai was not on public display but I suppose I'll just have to go back.\n\nTip: If You want good pics in Urban light be careful of your placement within the lights due to the suns position it's easy to be overshadowed by the tall lampposts, also, in the middle it's a cleaner aesthetic as you can't see the rest of the world.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Lamp posts", "I grew up in Orange County and never had I gone to see the famous lamp posts. So visiting from NM where I live now, we went to check them out. It's pretty cool. There are lots of people around all the time but it was cool.\nShow less"], ["Reviewed July 23, 2017", 5.0, "ART FROM ALL DIFFERENT PERSPECTIVES", "We really enjoyed the opportunity to take in all different forms of art. From Mexican, to American, to Far Eastern to Modern. The buildings each offer their own unique aspects. We found the design and calming nature of the Japanese edifice to be one of the most unique and enjoyable layouts ever.\nBe sure to time your visit to see Metropolis 2 in action (check your sheet when buying your tickets) That alone is worth the price of admission.\nWe spent about 3 hours and found we were able to see a bit of everything at a leisurely pace\nShow less"], ["Reviewed July 20, 2017", 5.0, "Beautiful museum", "Plenty to see, plenty to do, clean, and well maintained art museum. The museum contains famous artwork from noticeable and distinguishable artists. It contains art from every time period of human existence. Truly an amazing experience! Will always visit here when I am in town."], ["Reviewed July 20, 2017", 5.0, "Excellent traveling exhibits for art affectionatos", "Always a great place to spend time for the changing exhibits, the physical environs-tar pits as an example and people watching."], ["Reviewed July 20, 2017", 5.0, "A Must in LA", "LACMA (Los Angeles County Museum of Art) is a must while visiting the city of Los Angeles. The museum is filled with art from all over the world. My favorite thing in this museum is the \"This is Not a Pipe\" painting by Henri Magritte; LACMA is its home. LACMA is also home to works of Picasso, Warhol, Miro, and Lichtenstein. If you're an art fan, go to LACMA! It's worthy of an afternoon of your time.\nShow less"], ["Reviewed July 19, 2017", 4.0, "City art museum", "Enjoyed going to visit LACMA after many years. Parking is excellent. It has an outdoor installation of grey lamp posts close together.\nThe buildings are not significant architecturally, unlike Richard Meier's Getty Center or FLWright's Guggenheim.\n\nIndoors, It has a nice mix of art from different countries and time periods. My favourites are by Kandinsky, Warhol, Van Gogh, Cezanne, Matisse, Picasso, and the exhibits of Japanese ketsuke and Chinese snuff boxes.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great museum inside and out", "There are a lot of interesting things to see here and on a Saturday night, they sometimes have live concerts on the lawn. You'll have lively music and some food and drink stands. Great to hang out with your picnic blanket and chairs and enjoy the music.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great special exhibit!", "We were at LACMA in March to see the Pablo Picasso and Diego Rivera Exhibit. This is a must-see. It was fascinating how their lives and art overlapped. The exhibit space is beautiful. We spent two hours there, and didn't have time to see much else other than the Tar Pits. Wow. That is like nothing else!\nShow less"], ["Reviewed July 18, 2017", 5.0, "Great place", "Great variety of artwork of different periods all under one roof. One can easily spend an entire day over here. keep a note on the temporary exhibits as well and enjoy a free cool photography with the lamp posts.."], ["Reviewed July 14, 2017", 5.0, "Great collection!", "Good layout, great collection (Tintoretto, Picasso, Warhol, Goncharova all under the same roof). Plan to spend about 4 hour here. Make sure and check out the Rodin sculpture on the outside,"], ["Reviewed July 14, 2017", 5.0, "Great Art Collection A Must See when in LA", "You can spend a day easily here. There is too much to see and the collection is quite impressive. The dining area/bar was expensive, but there are maybe cheaper cafes on the other side."], ["Reviewed July 13, 2017", 5.0, "Wow, Incredible Place! Ammazing Art!", "We absolutely loved this place. It's definitely in my Top 2 art museums I've ever been to. The museum contains incredible art from many of the masters, as well as art and historical items from all over the world. Some of it dates as far back as 5,000 B.C.! I especially enjoyed the Rembrandts. We spent many hours here and never got bored.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Just an amazing museum and area!", "Love this place. They work hard to curate their art exhibits and what they have permanently is beautiful. It's a peaceful yet energetic place. Highly suggested. The area it's located in is called \"The Miracle Mile\". Lots of restaurants and places to check out. Plus the legendary Labrea Tar Pits are pretty much next door. Love that place as well and the whole area!\nShow less"], ["Reviewed July 12, 2017", 5.0, "WorldClass Museum that is overlooked.", "WorldClass Museum that is overlooked. Amazing collections. Beautifully maintained facility. Excellent experience. I liked hiring a personal guide, worth every penny. Like any museum, do not be in a hurry. Take time to look at every picture and read about there, or have a guide explain them for you.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Amazing a county has a museum of this qualiity", "The variety of the art work was food for the eyes. I could have spent more time but not all in one visit due to the quality and different exhibits. Definiely a place to go back to. The layout of the buildings was special in that you dd not feel crowed being in one place.\nShow less"], ["Reviewed July 10, 2017", 5.0, "A wonderful day", "This is a great way to spend a day in Los Angeles. The art collection is fantastic and it is a beautiful space in the heart of Los Angeles."], ["Reviewed July 9, 2017", 3.0, "Lots to look at", "The centre comprises 5 buildings displaying modern art in various categories so it's easy to go the the topic you prefer.\nThe labeling is clear and informative.\nThe range of exhibits is quite wide, covering paintings, sculpture, ethnic art including Egyptian Sarcophagi, moving wallpaper jewellery household objects,\nYou could spend all day there but I found 2 hours was enough for me.,\nShow less"], ["Reviewed July 5, 2017", 4.0, "An Adventure for the Mind", "The extraordinary collection of art at the County Museum is thought provoking. It makes you think. It challenges you. There are a host of other museums in the neighborhood so check them all out."], ["Reviewed July 4, 2017", 5.0, "Great day of culture and art", "LACMA is a great complement to the Getty in LA, with extensive collections and some memorable individual pieces - Hockney's 'Mulholland Drive' particularly memorable. Sit in the sun in the courtyard and enjoy Coffee and Milk's great baked goods and excellent coffee. Not to be missed.\nShow less"], ["Reviewed July 4, 2017", 5.0, "A day in Art", "I might have logged around more than 20 hours here already. This museum is just amazing. I found Xu Beihong here one time, Jeff Koon's ballon dog another, and Bauhaus art retro this time. The museum never stops to amaze me in terms of its exhibition selections.\nI will definitely come back the next time I am in LA.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Usually Great", "Usually I enjoy discovering new things and exhibits at the LA County Museum of Art made up of 6 different buildings/museums. However, on the last Monday in June a fire alarm went off and no one was allowed into the Ahmanson Building during the 10:30 - 13:00 block fo time that I visited and had especially wanted to see the special exhibit on Margaret Mead paintings. Instead I rediscovered the Asian collection including the wondrous calm soothing (much needed) Japanese nature screens, the very modern and historical Dwan Gallery show, and the spectacular \"The Inner Eye\" (African sculpture and weavings). There are several museum shops and at least two indoor and patio places to eat, if you want to make a full day of it. Alas, I'll have to make another trip to LA to travel with Mead and Bateson to Bali and the South Pacific.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Enjoyable Experience", "Came here as part of a private Bible Tour.\n\nFacility is easy to find. Parking is $16 and there are ample options. Elevators are interesting and easy to find as well.\n\nThere are many places to sit and eat or rest/people watch. Maps are easy to read, with six main buildings.\n\nPhoto opportunities include the Levitates Mass, Urban Light (all the street lamps), Pavilion for Japanese Art and the Three Quintains.\n\nEateries include LAMAC Cafe, Ray's and Stark Bar, C + M (Coffee and Milk).\n\nBackpacks can be brought into the museum but need to be in front (as backpacks on the back rub against displays). Or you can check the bag free of charge at Ticket Offices.\n\nHOURS:\nMonday, Tuesday, Thursday - 11 a.m. to 5 p.m.\nWednesday - Closed\nFriday - 11 a.m. to 8 p.m.\nSaturday and Sunday - 10 a.m. to 7 p.m.\n\nDownload the Museum's app. Connect with the Museum on Facebook, Instagram, Twitter, Snapchat and Tumblr\nShow less"], ["Reviewed June 30, 2017", 5.0, "Favorite LA Museum", "Love the content of this museum. Surprising that they have so much famous art from Warhol to Picasso to Mondrian. Paid admission also gets u access to the Broad which has some interesting modern art."], ["Reviewed June 30, 2017", 5.0, "World Class", "It does not matter which way one looks there is another great piece of art. LACMA or 'The County' to those in the know is a vast warren of buildings on a huge campus. Visited and loved by locals and international visitors alike. It is hard to find fault. It would take days to see everything. I like to wander aimlessly and see what I come across and I am never disappointed. There are plans to demolish and rebuild bigger and better facilities in the near future.\nIn addition to exhibitions there are events like live jazz and I am told that 1000000 Urban Light( the assemblage of Los Angeles street lights) by Chris Burden is a popular engagement and wedding location.\nRemember the Museum is closed on Wednesdays.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Fun", "I visited primarily because it was suggested by my son - but, as an LA travel consultant - he did well. I enjoyed the art and the surroundings."], ["Reviewed June 26, 2017", 5.0, "Wonderful visit", "Compelling ceramic installations and beautiful paintings. The architecture is also quite appealing. Greatly enjoyed our visit!"], ["Reviewed June 26, 2017", 5.0, "Summer fun", "Beautiful art. Many pieces are short term (rotating), so if you go back each year, you'll see different art. Actually several (6) different buildings. Right next to La Brea Tar Pits. Don't miss the sculpture garden. Food in the LACMA Cafe is pretty good, and not too outrageously priced.\nShow less"], ["Reviewed June 23, 2017", 4.0, "Fit this into your visit to LA", "I can't wait to go back to LACMA. When I went it had been on my list of places to see for a while, but I never managed to fit it in. The campus is large and if you have good weather, its easy to spend an entire day here. I regret that when I visited I didn't have time to visit the special Mapplethorpe exhibit they had. But searching for parking significantly cut into the amount of (little) time we had to devote there for the day. It was very challenging to find a parking space, we almost left. But definitely don't give up, and do your research ahead and look into the special exhibits they have and consider which you want to see. I can't wait to go back again, solo, and spend an entire day.\nShow less"], ["Reviewed June 22, 2017", 3.0, "👍🏻", "It was a really great exprience, staff was pretty nice too. Will probably go back soon with friends."], ["Reviewed June 21, 2017", 5.0, "LACMA is not Lacking", "We went to see a photography exhibit and ended up staying to tour the rest of the museum. Rembrant to Hockney - it's a wonderful collection. We heard the cafe was a good place to eat but it was full and we didn't want to wait.\nShow less"], ["Reviewed June 20, 2017", 5.0, "LIGHTS CAMERA ART", "I was so excited to visit this museum in LA. The iconic LA lights was a beauty to behold I had much fun taking pics here. Fortunately for me on my visit there was a Picasso and Rivera exhibit. It was unbelievable. The general exhibit and installatiins were also impressive. The sculpture garden was also unforgetable. I was not able to complete the tour of this huge museum but what I got was artistically satisfying, the lights, had my camera and the art!\nShow less"], ["Reviewed June 19, 2017", 4.0, "\"LACMA Local\", individualized & educational", "I was invited to join the \"LACMA Local\" event last Saturday even though I'm just a regular member. The theme was coffee; its consumption and artifacts relating to making and drinking it. The tour focused on how coffee got to Europe and how the British and Dutch - in particular - were influenced by the Middle East and Asia (Tea). The artifacts were ornately decorated and many were just amazing - such detail in the handiwork. To see all the beautiful tea pots of China and coffee \"pots\" from England that had the design influence from the M.E. was just incredible. The tour guide, Ms. Leniham, was extremely knowledgable on European facts about coffee houses, tea-shops, and the artifacts.\n\nI will say that it would be nice if LACMA could do an exhibit about the history of Ethiopian coffee - most of the people in the group thought coffee came from Columbia, in relation to how the consumption of the \"coffee bean\" changed when the Italians got to E.Africa..(hint: sugar!) it is a rather interesting story.\nBut overall, it was a great way to learn about the artifacts at LACMA and appreciate the history of them, as well {:\nShow less"], ["Reviewed June 18, 2017", 5.0, "One of THOSE museums!", "Awesome exhibitions, truly interesting guided tours in a huuuuge museum. Also, there's a nice outdoor sitting area with some cafes and dinning options. Highly recommended! :))"], ["Reviewed June 15, 2017", 4.0, "Nice museum", "Was only able to spend a couple of hours but the place was certainly worth spending more time than that. Spent much of my time at the Japanese Pavilion (easy to overlook as it is a bit further off); found the setting interesting and thoroughly enjoyed the small but fascinating collection. A number of outdoor attractions (including but not limited to the well known Urban Lights) offered good chance for some nice pictures.\nShow less"], ["Reviewed June 14, 2017", 4.0, "I live 2 blocks away...Worth your time!", "I frequent the grounds of LACMA all the time. The museum has become top notch and is well worth a half a day. FYI...FREE Jazz and classical Concerts from June through to the end of August. Friday nights (outdoor} Basic Jazz. Saturday Latin/Afro/Cuban (my favorite) and( indoor) Classical Sundays. You'll find the coolest locals where you can picnic and dance. It' with them. AWESOME crowd. Always a bopping good time.\nShow less"], ["Reviewed June 13, 2017", 5.0, "AMAZING", "LACMA is the perfect place for the outing in LA. Experience great art and culture. If you find yourself looking for something to do in LA I highly recommend checking out this museum."], ["Reviewed June 12, 2017", 3.0, "Urban Lights Tour", "Just been there for the urban lights outdoor. Great for photo shoot as you can play around with depth of photos in many different ways. stayed around 15-30mins and if you are a IG-active user - here's a place you may wanna drop by - its easy for parking as well.\nShow less"], ["Reviewed June 12, 2017", 4.0, "Short trip !", "The museum is scattered with multiple different buildings. We had a short time to visit the museum so we did not see everything. The art was OK. I think it's enjoyable according to preference. No regrets !"], ["Reviewed June 12, 2017", 5.0, "Great museum", "This very large museum is a challenge because it's so big. There is so much to see here. I especially like the paintings and the sculptures."], ["Reviewed June 12, 2017", 5.0, "nice museum", "this museum offers a wide variety of collectibles from all over the world. Very worth visiting would love to come back."], ["Reviewed June 10, 2017", 4.0, "Just Saw The Urban Light Exhibit Outdoors", "I really enjoyed seeing all the urban street lights from the 20's and 30's. Of course, this is a place where you will see lots of Instagrammers! I had to take photos for my daughter, but was able to enjoy the exhibit in between shots, haha. It's just such a cool vibe to walk in between all the lights. This is a quick and easy thing to visit and I would highly recommend it.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Incredible Collection of Art", "The LACMA has an impressive collection of iconic modern art. Thoroughly enjoyed the 20th century art as well as the Art of the Americas. A fun feature is that most of the art on view (in the exhibits we went to) is owned by the museum, so you can take pictures freely. A wonderful destination for photography and art lovers.\n\nAlso, if you want to take a break, you can walk through the La Brea Tar Pits. It's a fascinating natural history aside, and then you can revisit the LACMA for an afternoon dosage of more great artwork.\nShow less"], ["Reviewed June 6, 2017", 4.0, "It's Okay", "A good place to visit when you have kids with you, The lights are just the light. The story about the Tar is very impressive."], ["Reviewed June 5, 2017", 5.0, "Oasis of Culture", "I am not a arty person, but I know what I like when I see it. This place gives you a lot of choice, from the classics, to contemporary and paintings to sculpture. The outside area is just as impressive and peaceful. You will love it.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Love, love, love", "Such beautiful art! The LA County Museum was one of our main reasons to visit LA. I love this museum and find it easy to navigate so to see as much as possible. Good cafe!"], ["Reviewed June 1, 2017", 5.0, "Amazing Breadth of Art", "LACMA is like a city of museums, requiring at least several days to fully explore. We know great museums from around the world and LACMA matches them all. You can choose from modern, contemporary, American, European, African, or Pacific themes and spend your time exploring some truly great art. When it comes time to recover from art exposure there are good cafes and restaurants with outdoor and indoor seating. Definitely a world class museum.\nShow less"], ["Reviewed May 31, 2017", 5.0, "A real gem with great temporary exhibits.", "We always visit because you never know what new exhibits will be there. We love the permanent American and European exhibits. Good to get a little culture on a cool day!!"], ["Reviewed May 28, 2017", 5.0, "City Museum on a par with other great city art museums", "This is an important city art museum with a major collection covering all periods of art. Well worth seeing. Right now, National Gallery, Metropolitan, Chicago, Philadelphia, Detroit probably rank higher but that doesn't mean LACMA isn't a top museum."], ["Reviewed May 28, 2017", 5.0, "Always a great visit.", "We always try to visit LACMA whenever we are in LA and this trip was no different. There are so many permanent exhibits you can never see them all in one visit and then there are always special exhibits with limited duration. If you love art, don't miss this great institution.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Top Notch Museum", "This place is AMAZING! There are several multistory buildings housing art. The collection is phenomenal. From Pre-Columbian to modern art."], ["Reviewed May 24, 2017", 4.0, "Beyond Bling!", "I hadn't been to LACMA since the first King Tut Exhibit in the late 1970s. I didn't recognize the place with all the new buildings built around it. I understand a new round of building and refurbishing is beginning soon if not already. I chose the venue for my ladies' group to see a small jewelry exhibit called Beyond Bling!. It was the right size for the group as the entire exhibit was in one room and viewable in about 30 minutes. With out price of admission for the special exhibit we were welcome to tour the rest of the museum. We stuck to the first floor. We could not enter the special Diego Rivera and Pablo Picasso exhibit but there are some of their works in the permanent collection. It was a very enjoyable visit. I had already planned lunch at Cassell's on 6th St. but there is dining at the museum and a raft of food truck parked across the street which could have been a real adventure. Parking is conveniently located across the street. I think it is $14 flat rate, not too bad for L.A. I won't wait forty years to come back.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Always enjoyable", "I have had a LACMA membership for years. I like that there are many different exhibits that cycle through as well as regular exhibits I can return to again and again. I celebrated a birthday there one year, which began with drinks at the bar. There are many things to see for people of all ages.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Loved It!", "Beautiful venue, great exhibits, so much to see. Thoroughly enjoyed our day at the museum. Can't wait to return to this museum on our next trip to LA. Our favorite exhibit during this visit was a light exhibit that involved a separate reservation which we were able to make onsite. I cannot remember the name of the artist but if you make it to the museum, ask about it. It's very worth taking the time to see.\nShow less"], ["Reviewed May 21, 2017", 4.0, "Ride midnight", "Wonderful at night. Art of lights . I love this place. It's the park on way. Simply is columm and lights."], ["Reviewed May 18, 2017", 4.0, "Currently, Rivera/Picasso special exhibit", "$25 to get in to this special exhibit which compared and contrasted the works of Diego Rivera and Pablo Picasso. Unlike the previous comparison exhibit we saw elsewhere, these artists were communicating with each other and working contemporaneously. Interesting. Also enjoyed the Japanese pavilion with beautiful screens and netzges. LACMA is right next to LaBrea Tar pits, which you should visit as well\nShow less"], ["Reviewed May 17, 2017", 5.0, "an LA favorite- always visit", "I always try to come to this museum when I am in LA. Right by the LaBrea tar pits. the collections are wonderful and the special exhibitions are great. This December there was an installation with lots of moving cars. We all loved it. I love the giant boulder uspended between two walls. planty of fast dining options.\nShow less"], ["Reviewed May 17, 2017", 4.0, "Amazingly good collection for a county museum", "I didn't expect much compared to the Getty. And in fact, LACMA is a step down but not a big step down. I can't cite specific artist names, but there were a lot of stop-and-study paintings, even for myself who is more into music than the visual arts. The campus is also appealing, with multiple buildings and a courtyard with a coffee/pastry shop.\n\nLocated close to the La Brea Tar Pits. Has its own parking garage.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Great Place to spend a few hours", "My stay in LA was short and other wise occupied but I managed to spend a few hours LACMA. So many great exhibits, not too crowded, and just a cool place to be. I particularly loved the street lamp exhibit and the French advertisements from the 1800s. I was very inspired.\nShow less"]]}}