{"Madame Tussauds Hollywood": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Madame Tussauds Hollywood", "url": "/Attraction_Review-g32655-d1634265-Reviews-Madame_Tussauds_Hollywood-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/b7/14/b1/madame-tussauds-wax-museum.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2844"}, "address": {"@type": "PostalAddress", "streetAddress": "6933 Hollywood Blvd", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90028-6146", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "So life like", "Great opportunity for photos with the stars. So life like, interesting seeing how tall some were, it was fun taking pics with them. Lots of stars from old Hollywood classics to the latest."], ["Reviewed 5 days ago", 4.0, "Many photo ops to be taken!", "If you love photo ops and/ or Instagram, this is the place for you! Many famous celebs to pose with. We had a blast!"], ["Reviewed 5 days ago", 4.0, "Not bad", "I liked the ending where we saw the 4d theatre experience. Other than that there were a few statues and amazing facts. However there were not that many statues as the one in London or in Hong Kong. It was spread out on 3 floors and I was able to recognise everyone I saw.\nShow less"], ["Reviewed 6 days ago", 3.0, "Fun", "Fun to visit with all ages and take some silly photos. It’s a bit pricey but so is everything in this area! Worth a stop."], ["Reviewed 1 week ago", 5.0, "Madame Tussauds is always great!", "We love the wax museums wherever we travel, and this one was great! There are all your Hollywood favorites, from now and long ago.\n\nIt is in a busy area, just near Dolby Theater. I recommend getting tickets online, so you don't wait in line. Also, sometimes there are online discounts.\n\nBring your camera! Great for the whole family.\nShow less"], ["Reviewed 1 week ago", 5.0, "Totally realistic!", "My husband and I enjoyed this very much. We purchased our discounted tickets on their website..basically 2 tickets for the price of one. It was so realistic and the details are extraordinary!"], ["Reviewed 1 week ago", 5.0, "New York or California both are spectacular", "If you don't think it would be fun to go to a wax museum, think again. As you enter the world of real people from all generations and fame are there to walk by, take pictures with and live with them for a few minutes. Easy to get lost in there for hours.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun Time", "We had a blast here. I want to say that we spent something like 30 bucks to get in for 2 of us. I really didn't know what to expect. The last wax museum we went to was really crappy, so maybe I didn't have high expectations. This place blew my mind! you are allowed to interact with the figures, touch them and pose for pictures with them. They were so life like......even from a couple inches away. It was almost freaky sometimes cause it felt like they were really there. Parking garage in the lower level gives you a nice place to park centrally on Hollywood Blvd. I wouldn't miss this if you are there.\nShow less"], ["Reviewed 1 week ago", 4.0, "fun with the famous", "Quality of the wax figures is amazing. It was strange to come out the lift and be face to face with Elton John. My teenage kids took selfies with Lady Ga Ga, Taylor Swift, and Ryan Reynolds. I liked Hallie Berry, Angelina Jolie, Will Smith and Daniel Craig. The cowboys were good - Clint Eastwood, John Wayne, Robert Redford and Paul Newman. It also struck me some are not that tall - Rocky, Judy Garland. the Godfather scene was cool too. We had a great time.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Wax glory", "Was great to view all the wax works we had fun. The price however was a bit dear it was $54.90 for 1 adult 1 child, if you can find discount vouchers grab them. I didn't like however at the end it finishes in a clothing/merchandise shop i thought that was really odd.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Good bit of fun", "We got free admission with the bus tour that we did. There were 3 levels to this and the sculpture’s look fantastic. You can take photos and touch the figures but no touching the hair or faces. You will see some of the stars in the walk of fame ( to see them all is a 5 km walk). Madame Tousauds is right next to the TCL Theatre and you will see stars hand and footprints in the concrete here.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Tacky but fun", "Ive always avoided this tourist trap around the world, but got dragged in with some friends and actually enjoyed it.. self explanetory.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun Morning", "These are so life like! We were literally waiting for people to jump out at us (like some videos) they are so life like. Miss 11 had a great time posing with the props and characters. Well worth the effort and $."], ["Reviewed 4 weeks ago", 5.0, "Fun & Laughs!", "Had so much fun here. So many of the statues look so real. Took pics with so many celebrities. I thought our pics looked funny cause we are dressed like tourists and the celebs are dressed in sequence dresses and suits. LOL!\nThis was our first time visiting a Madame Tussauds, great experience!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "almost Real, fun", "a nice destination while you are in the Walk of fame area, where you will be able to take selfies and pictures with many celebrities not only hollywood celebrities but many more like sport and presidents and all.\nthey look almost real, some of them needs more modifications while others looks just perfect.\nthey have too many of them, it is around 2 hours, honestly after one hour you will feel bored because you are just doing the same thing again and again even if it is with a new character, but still it is a good place.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Wax museum Hollywood", "Visiting the Madame Tousseau museum was more that I imagined. A must thing to do while visiting Hollywood. Great experience."], ["Reviewed 4 weeks ago", 4.0, "It was surprisingly pleasant", "I did not intend to visit them but because it was so close to the other attractions and I had the Go Card, I went. It was very nice! The majority of them the statues really look like alive!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Hello Hollywood", "This was our first visit to Madame Tussaud’s Wax Museum with our family. The Hollywood Stars will lead you there as they are right outside. Our family had an amazing time. We arrived around 1:30 in the afternoon on a Saturday and surprisingly it wasn’t as crowded as I expected, lines to take pictures with the wax figures moved along quickly. We spent about 2 1/2 hours taking fun pics with these beautifully made celebrities. There were some props available and even a 4D show to enjoy ! My 11 and 14 year olds had a blast and not to mention Dad had great time as well. Very clean and great lighting. You never know who’s gonna be around the corner is what made it so exciting. We even got pics with Obama! We recommend you start your Hollywood visit here. Parking is available for $2 an hour or $15 a day.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Worth a visit", "We actually had no plans to visit Madame Tussaud’s but as we had booked a tour of Hollywood Hills they gave us free tickets to visit. So we took up the free offer and really enjoyed it\nWe did see many people just walking in and purchasing tickets at full price so again read the reviews to learn where to pick up a bargain.\nShow less"], ["Reviewed January 24, 2018", 2.0, "Museum was good but the staff was horrible", "The lady at the wax hand was in a bad mood...!!!\nI am here at the wax hand and she had us stop in the middle (I was recording it) to go get a voucher to show her I paid already...\nplease learn to treat tourists better.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Good Family Fun", "The Grandchildren were keen to go, we bought a combination ticket to Toussauds and a two hour LA City Bus Tour. The kids had a great time with the wax statues, putting on the props provided for great photos, it took us an hour to get through but imagine if it were very busy it would take longer, I had never been before and found most of the statues were very like the people they represented, good fun.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Pictures with Stars", "We went there in the evening but there were still quite many visitors. They divided into different floors and themes (e.g. western, action, superheroes...) and my kids loved taking pictures with all the \"stars\". Be prepared to spend 1-2 hours there."], ["Reviewed January 17, 2018", 5.0, "Madame T.", "This was great a great experience.\nWanted to see it for years so took another trip and took kids back to see it few months later and they found it to be all we said and they enjoyed making their hand prints in hot wax to take home. All our hand wax works as been put on shelves for all to see.\nEnjoyed many artists from movies and people in government as well. Nice show case of works .\nWished they had someone on both floors to helping in answering some of ours and the kids questions with some answers on some of what we saw that we wonder about.\nShow less"], ["Reviewed January 17, 2018", 3.0, "Ok once", "Very expensive and not nearly as good as one in SF. Kids had fun taking goofy photos with the wax figures. It was an aha moment when our 9 year old twins starting asking who some of the people were. Ouch. it was a fun family experience.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Attraction was great", "This attraction keeps getting better and better. I've been to a lot of Madame Tussaud's and this is one of the better ones. The themed rooms are perfect and the figures looked fantastic. Great job to Colin and the team!"], ["Reviewed January 13, 2018", 4.0, "Fabulous Glamorous Freaky", "Ok this place reminds me of an old horror film...like as soon as I turn away they will move! Just Amazing work. They are so authentic and lifelike that I imagine standing there meeting my favorite stars.\n\nThere are places to eat all around and since it does not take long to see the whole place, there is time to do something else.\n\nI was glad I had warm sweater and hand warmers. It was cold inside, so be prepared.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Had a great time here", "When I entered, I was really unsure of how to pose with these wax statues. But slowly I started enjoying copying these hand gestures and had some serious fun doing some. Must visit everyone. Doesn’t matter if you know all the stars here or not..just pose and click pictures!\nShow less"], ["Reviewed January 8, 2018", 4.0, "A great highlight to the boulevard!", "Really enjoyed Madame Tussauds - lots of photo opportunities with the stars! A fun experience and works of art."], ["Reviewed January 6, 2018", 5.0, "Lots of fun!", "This wax museum was a lot of fun- very realistic. I liked how some of the figures were standing in the middle of the room with you - so lifelike! My only criticism would be the marquee outside portraying certain celebrities whose figures were not inside as being remodeled\nShow less"], ["Reviewed January 4, 2018", 5.0, "Perfect!!", "This place is busy, busy, busy, but if you pace yourself, sometimes you can do a whole photo shoot with your favorite wax figure.\n\nIt's included; for now with the LA Go Card! Act fast, a lot of businesses are bailing on the LA Go Card, we had to pay for some attractions because they refused to accept the card.\n\nThe A/C in this building is AMAZING!\nShow less"], ["Reviewed January 4, 2018", 3.0, "So-so", "This place was okay, but WAY overpriced. It was crowded with rowdy teens who were rude and annoying. Some of the wax figures were impressive, most left a lot up be desired. At the end, the hard sell in, not one, but TWO souvenir shops was off-putting.\nShow less"], ["Reviewed January 3, 2018", 5.0, "All Hollywood stars at a single place", "Do you wish to meet your hollywood star and take a picture with them. Madame Tussauds can help you achieve that, if not with real star but with their wax statue. Worth visit while you are at LA"], ["Reviewed December 31, 2017", 5.0, "fun visit", "line to enter wasn't bad and moved fast and to my surprise it was not crowded at all and was comfortabley spaced for plenty of pictures. there's a lot more figures than i thought and the selection and organization in the levels was nice. does take time to thoroughly view everyone so you dont have to rush. loved the few props set up to take pictures with. the figures are actually really realistic looking! cant comment on pricing since i got in with the go city pass\nShow less"], ["Reviewed December 31, 2017", 3.0, "Worth a visit", "If this is your first time visiting a Madame Tussaud’s definitely worth the visit. As expected the museum is quite a bit smaller than the one in London but you get the idea pretty quick. Some of the models look incredibly real, while sone not so much. Beware the crowds and the long lineups. A better option would be to buy tickets online for admission after 5 pm. There will be less crowds and you save almost 50%. Great option!\n\nAdult tickets for walk in are 30.95 USD.... I would say definitely not worth it\nShow less"], ["Reviewed December 29, 2017", 4.0, "LA Tour", "Madame Tusads, If you want to spend some time with your Hollywood star this is the best place. Very well maintained and not over crowded. If you want to see Bollywood stars then this place is not for you."], ["Reviewed December 28, 2017", 5.0, "Funny", "Brilliant place the exhibits are really good and having your photo with with is really good and really funny"], ["Reviewed December 27, 2017", 5.0, "Great selection of classic stars", "If you think a wax museum is just for kids you are wrong as you are never too old to visit Madame Tussauds. I love that they had a great collection of classic Hollywood stars at this place such as for instance Vivien Leigh & Clark Gable, (Gone with the wind), Elizabeth Taylor (Cleopatra), Audrey Hepburn, Ingrid Bergman, Marilyn Monroe, James Dean, Katharine Hepburn and Bette Davis. Since we'll never get to meet these stars in real life it is fun to \"meet\" them at this museum. The wax figures also looked more life like than I had expected.\nShow less"], ["Reviewed December 17, 2017", 4.0, "OK to kill 1-2 hours", "Hardcore movie fans will enjoy this place. You can do more in the area so your options are open to either spend more time here or walk to other attractions nearby."], ["Reviewed December 10, 2017", 5.0, "Fun place to get great pics!", "This is a fund place on Hollywood Blvd to get some great pics of celebrities(wax, not real). Great way to spend an hour! :)."], ["Reviewed December 4, 2017", 4.0, "Better than expected", "I'm not a Star Watcher, but my teen wanted to visit. Expected an outdated collection but was pleasantly surprised with modern stars next to classic 1920s & 30s stars. The artwork of the wax figures themselves was amazing and worth seeing."], ["Reviewed December 3, 2017", 5.0, "Super cool!", "This was a super cool experience! Some of them look so real it's freaky. haha Poor Jennifer Lopez though, her's was really bad :( Took some of our best pictures here! It's a must see if you're doing Hollywood..\nShow less"], ["Reviewed December 1, 2017", 4.0, "Visited only because it was included in our Go Card L.A. pass and am glad we did.", "We purchased a Go Card L.A. which included admission to the wax museum. We travelled as a family with two teenage boys and really enjoyed the visit but do not think it is worth the window ticket price.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Interesting place to visit", "Situated close to the TCL Theatre on the Hollywood Walk of Fame and near the start route for HOHO, Madame Tussauds Hollywood is very different where you can take pictures with your favorite Hollywood celebrities. It is across 3 levels and needs about 90 to 120 minutes to see all the was statues.\nShow less"], ["Reviewed November 19, 2017", 5.0, "MUST VISIT THIS SEASON!", "I always recommend Madame Tussauds Hollywood to visitors, but for the Holiday Season 2017, I consider it a MUST VISIT, even for guests who have visited before. The company continues to excel at providing an unforgettable fun experience for all ages, and the people really do treat you ads guests there.There are lots of photo ops to record your memories, and the staff genuinely enjoy making people happy to be there. For this holiday season, they have added a feature pop up shop called Christmas in Hollywood, with a whole range of ornaments that are not sold anywhere else in Southern California. They personalize the ornaments for free, so you are giving a gift that people will cherish forever.\nShow less"], ["Reviewed November 13, 2017", 4.0, "This is your only chance to meet the stars!!", "We quite enjoyed going around seeing the wax models of the famous stars. Its quite small compare to Madam Tussauds in London. We were finished in about an hour and we took our time too. Some of the figures were really good, some didn't really look like who they were supposed to be. We enjoyed it but was not worth the entrance fee.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Worth a visit!", "This Museum is far better than the original Wax Museum. We found this quite enjoyable, and happily took photos with many of the celebrities."], ["Reviewed November 12, 2017", 5.0, "World famous and historic wax museum, probably the better one to see in L.A.", "First of all, they have a very reasonable price if you go there after 5:00 and buy your ticket online. I was entertaining a friend from another country who wanted to go to the wax museum along with the Chinese theatre and Hollywood in general. This wax museum has some very real looking figures, which is a little freaky. You also learn who Madame Tussaud was and how they make the figures, from start to finish. Given that we got the evening price of $20 we felt we got our money's worth.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Super realistic", "Madame Tussauds Hollywood has some amazingly realistic wax figures, i would touch some of them before i would stand next to them to take a photo - I was terrified that they were real.\n\nI recommend walking down the street and waiting for someone to give you a leaflet with a voucher (we got a buy one get one free offer). I also recommend looking on Groupon. There is a gift shop on the way out however it is expensive and there is a souvenir bargain shop just outside.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Pretty cool", "The wax figures were super cool, make sure you buy a GO PASS if you plan on going to multiple attractions, saves you some money if you plan on going to a bunch of attractions like this."], ["Reviewed November 8, 2017", 4.0, "Good place to see wax figures of your favourite celebrities", "Madam Tussauds is a must if at least once. Families with children will enjoy this as the kids can make pretend."], ["Reviewed October 30, 2017", 5.0, "So Cool!!!", "I have been wanting to visit a wax museum for the longest time and decided to come here while on a visit to L.A this is located on the walk of fame by the Chinese Theater so its perfect if you are in the area. I purchased the tickets online and I think you can get like $6 off. Overall so worth it the wax figures were incredible they looked so real! I loved this place will visit the one in Vegas when I travel there!\nShow less"], ["Reviewed October 28, 2017", 4.0, "Best Combined with a Visit to Chinese Theater", "So here’s the deal: if you take visitors to see the foot and hand prints at the Chinese Theater, there’s not a whole lot else to do after paying for expensive parking in the area. And how much time can you spend looking at the movie star prints now that they seem to have them totally blocked off from the public? It may be a temporary thing, but at least on my visit in late October, all we could do was to peek over the barrier to see the prints closest to the barrier.\n\nSo this is a review of Madame Tussaud’s Hollywood, but I wanted to give a recommendation of Madame as an add-on to any visit to the Chinese Theater which is next door. It was surprisingly pricy for two tickets, but I must say that my out of town visitor and I thoroughly enjoyed the experience. The figures, for the most part, are quite life-like and they do represent a large variety of Hollywood personalities. The best part is that you can pose with the figures for wonderful photos, and there were a few occasions where props were available to make the photos a lot of fun. Be aware that there are a few places in the building where the staff will take photos of you, some of which are against a green screen with elaborate scenes superimposed (OK, photo shopped) in the background. These for profit photos are reminiscent of the constant photo huckstering on cruise ships – I thought the price of entrance was enough without the added costs.\n\nToward the end of the visit, there is about a 20 minute film which evokes earthquakes, along with some fun effects such as wind blown at you, a bit of water in your face, etc. That film was very well made and the earthquake effects were terrific. Don’t leave without seeing it!\n\nAt the end of the exhibits, there is a little gift shop. We did not buy anything (luckily), because as one leaves that little gift shop, you are ushered in a large gift shop with items all priced at $5, and some of those same items had been found in the smaller gift shop at higher prices! My out of town visitor was delighted with the $5 prices and bought a ton of kitsch to take home.\n\nSo in summary, Madame is an excellent add-on to any visit to Hollywood and Highland.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Better than I expected", "I really didn't expect much but was very impressed with all of the wax figures. I would recommend Madame Tussauds to anyone visiting Hollywood."], ["Reviewed October 23, 2017", 4.0, "Cool visit", "Awesome attraction. Never fails me. Frequently updated with new figures and lovely effects. It's fun for all."], ["Reviewed October 18, 2017", 4.0, "Nice way to spend the afternoon", "We took our German exchange student here and it was a fun afternoon of silly photo taking and lots of giggling. Some of the statues are amazing while others are... strange."], ["Reviewed October 18, 2017", 4.0, "Nice Play on the Blvd", "The wife loves old Hollywood so we decided to check out the wax museum. Of course before going in you have to do the obligatory pictures.\n\nThe wax figures were great. Between the newer stars and older ones the wife and me were thoroughly entertained.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Fantastic Fabulous and Freaky", "Man oh Man was this place awesome.\nMy first trip to a Wax Museum and I was amazed.\nThe lifelike models of artists both film and radio were awesome.\nI would highly recommend this tour to all walks of life, the young and old alike will enjoy this place.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Money well spent", "While we walked down Hollywood Blvd we saw marketing for 50% off tickets from a street vendor, so I'm not sure if we overpaid. Either way, we had a good time taking selfies with famous wax people; they look so real in pics. I enjoyed how they have props taking more realistic pics with many of the wax people, and the option to go home with your own wax hand.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Great Place To Visit and Act Youself", "We were not planning to go to the museum but glad we did.\nThey network with the Starline tours and offer a discount.\nThey had several floors of current figures.\nMany were set up so you could pose as the actors in various scenes which was a great idea and made it quite a fun experience.\nThe family is still laughing at some of these pictures. For instance the bike scene in ET. You can be the boy riding the bike.'\nLooks like they are improving the techniques but they were always very good to start with. Not sure they're not just wax anymore.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Best wax museum in Hollywood", "This is the better wax museum. Don't go to the other one. We got 50 percent off coupons and it was worth it. Figured were great and set up was fun a spacious ."], ["Reviewed October 14, 2017", 3.0, "Selfie Spot Along the Walk", "I have stopped by the M.T.'s in Vegas, so I knew what to expect. However, the gf wanted to stop by this place just once. As it was along the \"walk\" and we had it included with our Go L.A. Card, we stopped by versus paying the $31.00 each.\n\nI am not sure how many total wax sculptures there were along the three floors, but it was a lot from all kinds of genres. I personally through the one in Vegas had more, but it could be that location just was a smaller square footage to make it look that way. They also had a Marvel Comics movie, where L.A. had once about an earthquake movie in 4D with the wind/water experience.\n\nThe place is laid out well, and there is no shortage of popular and old timer celebrities for you selfie picture opportunities, which many seem to be taking advantage of. If you have the city pass or alike with this included, it is a good time waster that will give you an hour or so of pictures for your collection. I do not know that I would make a special trip for the $31.00 each IMHO.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Fun family visit", "My 11 year old daughter was desperate to go and we had a couple of hours to kill before heading to the airport so came here. I booked online and saved a few dollars, then used a mobile ticket to enter. The kids had a ball and got photos with everyone! We also got wax hands done for both kids which we carefully carried back on the flight to to New Zealand! Next time London. :o)\nShow less"], ["Reviewed October 9, 2017", 5.0, "Kool", "This place was super kool. They have some of everybody and the look so real.. you can even make a wax of your own hand. You can take plenty of pictures."], ["Reviewed October 5, 2017", 4.0, "Tons of FUN!", "Lots to see and experience - Loved it and would do it again! Just the massive King Kong in the entryway was a blast!!! Everything was so realistic and impressive - a must experience!"], ["Reviewed October 3, 2017", 4.0, "Something fun when you're traveling in LA", "It was pretty good. I think I might have been a little spoiled by the time I got there and wanted to have more interactive options, but I got to take a lot of selfies with the figures and that's always fun."], ["Reviewed October 2, 2017", 4.0, "What fun at madame tussauds Wax Museum", "This place was really a fun experience. My son and daughter in law live in LA and made the arrangements. I'm so glad they did. The wax figures are really life like.\nand certainly look like the real thing. Interesting and almost \"creepy\" :-)\nIt is a great photo opportunity and we had a great time taking the pictures.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Great Photo Opportunities", "The wax statues make for great photo opportunities! The wax statues are quite the work of art and very life-like. The museum is definitely worth the time to check it out."], ["Reviewed October 2, 2017", 5.0, "fame!", "If you wanna feel like famous... I mean being famous by being with famous, this place will be great for you :) I really liked!"], ["Reviewed October 2, 2017", 5.0, "Photos", "Really large and good collection of spectacular persons. We took a deal to go also to the next door Dungeon with only small addition to the price. I recommend that you go to see these celebrities as they are so alive looking!"], ["Reviewed September 29, 2017", 4.0, "Fun place to visit", "Enjoyed going through and seeing all the celebrities. It was a great picture taking place. The 4D movie was good too."], ["Reviewed September 27, 2017", 4.0, "Very nice...", "It was pricey and I thought this very Madame Tussauds would be a special one since it is in Hollywood and not any other , didn't find anything so special about it...."], ["Reviewed September 26, 2017", 5.0, "A must see", "Don't miss a visit if you are in the area. Excellent photo opportunity with the figures which are so lifelike. Some of the other bus tours will give out free tickets after there tours"], ["Reviewed September 24, 2017", 5.0, "Very Cool! Like walking into a room full of celebs", "When I got off the elevator it was very strange at first because some of the wax figures look so real and so current! It was really cool to be able to pose with them for selfies. My favorite, was Betty White. It looks EXACTLY like her. It’s a very cheesy touristy thing to do but really is a must see if you’re in the area.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Qick Visit", "Got a free visit when we did the bus tour so visited on our return. It was OK but not all the waxworks were labelled so didn't know who one or two of them were. Maybe wouldn't have gone if it didn't come free with the bus tour though.\nShow less"], ["Reviewed September 24, 2017", 2.0, "Didn't't expect much and was still disappointed", "this is not an attraction we would have sought out but we were given \"free\" access as we had purchased a tour bus excursion. So off we went for what proved to be a lacklustre 30 minutes of my life i will never get back. Please do not spend $35 per person to stare and wonder if Steve McQueen really had such a poor hair cut or whether Will Smith's ears really stick out that far?. what a let down.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Have to check it out", "I was not expecting that much when we went into this. We got admission for free because we brought a 3 day hop on/hop off bus pass.\nWas i surprised with the place. I think it is definitely worth going to. The icing on the cake was the 4d cinema at the end - great thing.\nShow less"], ["Reviewed September 18, 2017", 3.0, "ANYTHING FOR SELENAS", "it was okay, I honestly only went to see the Selena wax figure which BTW was amazing, some of the others could have been better."], ["Reviewed September 17, 2017", 4.0, "Many Superstars", "I've been to a few Madame Tussaud's museums around the world. This museum at Hollywood is a better one. It include a 4D movie show."], ["Reviewed September 17, 2017", 4.0, "Great visit in the evening", "We went at 6 pm and it was quiet. Great selection of waxworks and because of the time and how quiet it was we got uninterrupted viewing."], ["Reviewed September 13, 2017", 4.0, "Great walking amongst the Stars", "Enjoyed the experience walking amongst some of the stars & how lifelike they are & some had opportunity of photo op with costume like ET"], ["Reviewed September 13, 2017", 5.0, "Cheesy fun", "This was a cheesy thing to do but my husband and daughter really enjoyed it. We have visited many wax museums and Madame Tussauds is the best -- but the Hollywood location is the absolute best (we've been to Madame Tussauds in Washington DC and Vegas). The figures look very realistic and there are lots of props to use to pose with and take pictures with the figures. We got a coupon from some guy on the street and saved a lot on admission -- actually the prices came out to about $20 pp and in DC we paid $30. If you like movies and celebs, this is a fun thing to do!\nShow less"], ["Reviewed September 10, 2017", 2.0, "I wouldn't bother...", "I don't normally write poor reviews.. I try to find something positive to say about everywhere I go... so the positive.. I had a free ticket to go with my bus tour.\n\nIf you are paying to enter as an adult you are looking at $30 to enter and look at wax models of famous people. Which is bit steep especially as they'll try and sting you for photos as you go around.\n\nHighlights: the Marvel section and the master chief.\n\nThe rest just a little creepy...\n\nShow less"], ["Reviewed September 9, 2017", 3.0, "Wouldn't recommend alone", "Super realistic to the point that I was a little scared to go up to some of them. Sometime the music and voice recordings could be a little to much and I wouldn't recommend going alone it can be a little boring when there's no one to take a nice picture for you. Overall if I had the option to go again I wouldn't unless I had a friend with me.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Fun!", "After almost a week in LA, my kids wanted to see a celebrity. I thought we saw Patrick Stewart in Venice (probably not him) and Justin Bieber in Beverly Hills, but they were skeptical. So I figured the second best thing was Madame Tussaud's. Luckily they have one in Hollywood.\n\nWe could not have been more pleased. The exhibits are top notch, the personnel are great (kudos to Pete the manager, who explained to my 11 year old the history of Madame Tussaud's), and the video shows are very interesting.\n\nI was initially a little concerned about the area. It is right on one of the more crowded streets in Hollywood, chock full of all kinds of characters, but Pete seems to run a tight ship, and kept the street characters at a safe distance from the entrance, especially the costumed people trying to get cash for getting photos with them.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Wax at it's best", "Madame Tussauds is the very best wax museum by far. They all look EXTREMELY real even up close and most pose for the figure."], ["Reviewed September 7, 2017", 4.0, "yeah its kool", "if u want pics of u and some celebs come here they have some well known ones my fav was ET cause u can ride the bike with him in the front all good for selfies and on the bottom floor they hav a 4 d movie you can watch also yeah its kool place to visit\nShow less"], ["Reviewed September 7, 2017", 5.0, "VERY FUN PLACE !!", "I took 2 nine year olds to the museum and they had a great time. This place lets you get up close to the figures which makes it quite easy to get photos. They even have some props to put on to go with the figure. One floor is dedicated to musical celebrities and they play their music. There are actors, presidents and sports legends. Definitely check this place out!\nShow less"], ["Reviewed September 6, 2017", 4.0, "SO FUN!", "The wax figures were so realistic that you had to look twice and make sure. Great exhibit of all the current and old celebrities. They take photos of you as soon as you come in so be prepared to pose!"], ["Reviewed September 4, 2017", 5.0, "Had never been before except the week before in Las VEGAS", "Traveled from Vegas and saw the museum there. It was fun. Note very big. People are really realistic. Came to hollywood and did it again and they are completely different from one another. It was a fun experience"], ["Reviewed September 4, 2017", 5.0, "Great Sculptures of many Hollywood Persons", "Love the museum. You can see many of the Hollywood actors and actresses here. Its a must go if you are in the Hollywood or Los Angeles area. Love it."], ["Reviewed September 4, 2017", 5.0, "So much fun!", "My son asked to visit the wax museum and Madam Tussauds was the best option. I purchased tickets online at a discounted rate, which was awesome! Purchased our tickets and was able to walk right in. The wax figures were so amazingly done. My son thoroughly enjoyed himself taking photos with almost all of the figures. It was really cool that some of the figures had props to use, trust me, my son loved that added feature. This was a great mother and son activity as I laughed endlessly at how much fun he had. Great attraction!!\nShow less"], ["Reviewed September 1, 2017", 5.0, "Family fun", "We had not planned to visit the wax museum as it was a little pricey. However we were handed 50% off coupons while on the street outside. So we decided to go in. Our 12 year old LOVED it. Especially getting to wear different costumes and interact with the figures. We had so much fun. We were probably inside for close to 2 hours ( including the 4D film ) We would definitely go back!!!\nShow less"], ["Reviewed September 1, 2017", 4.0, "Fun LifeLike", "Had a fun time seeing all of the wax figures in the museum. They are so very lifelike. Highly recommend this tour when visiting the Hollywood LA area. Lots of photo opportunities and costumes with various exhibits that you can dress up to stand next to your favorite wax character.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Fantastic and interesting place!", "You can see here figures of lots of interesting people and dress yourself - there are fancy dresses and subjects. Fantastic and not expensive !"], ["Reviewed August 29, 2017", 5.0, "Mingling with the Stars", "Had some time to kill. My Daughter and I decided to check it out. Was not disappointed. Been in a couple of these wax type museums all over the world. The figures were so life like that my daughter was afraid to sit next to Simon Cowell. She thought that it was real. The figures were well placed, lots of room and amazed at the fact that a lot of the figures were interactive and you could touch them (except for the face). Took home some great photos and fun photos taken by the staff. Highly recommend it\nShow less"], ["Reviewed August 28, 2017", 4.0, "Great time spent with the family!", "Spent a couple hours here while on vacation in Los Angeles from Canada.\n\nThe family had a blast, taking photos with all the stars, very well laid out, not too busy and perfect location!\n\nDefinitely give it a visit if in the area, passes some time while on the Hollywood strip!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Wonderful", "We loved very much and kids liked it as well. The wax work was done top notch. We went to three others down the street but this was by far worth a return many times ."], ["Reviewed August 26, 2017", 4.0, "I mean, it's the celebrities you hope to see on the street, but like in your face!", "A bit cheesy, but fun for what the experience is! Plus, you don't want to be that person that asks for a picture with a real celebrity so just take a pic with a wax figure and don't annoy another human!"], ["Reviewed August 25, 2017", 5.0, "Super fun place for a couple hours", "This place was super fun. Touch anything but hair and face. Reasonable rates for entry. Bought the home tours package. Filled up the day."], ["Reviewed August 19, 2017", 5.0, "wax museum", "this place was so good! the wax figures look so real and the creators of the place made taking pictures fun. some figures had props to go with them to make you a part of their story. a little movie (4D) is played for you and that was really fun. highly recommend going. overall, the figures were done really well\nShow less"], ["Reviewed August 19, 2017", 5.0, "Great wax museum", "We bought a combination ticket from Starline tours which included the stars' homes and tour as well as admission to Madame Toussands--we're glad we did! So much to see (really well done). We also enjoyed the \"wax facts\" that were posted on the wall as well as the trivia. So interesting and wonderful to go through!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Amazing!", "I wanted to go to the musuem because of Selena Quintinia. But was overjoyed when I got in. I love Scarlett and Rhett Butler. Ingrid Bergman from Casablanca. But when I saw Charleton Heston as Moses and Jimmy Stewart as George Bailey. I was overjoyed. I love how it caters to all types. The newbies, but the classics..Well worth the money. I just wished I went slower and enjoyed more time ..\nShow less"], ["Reviewed August 15, 2017", 4.0, "Great wax museum in downtown Los Angeles, CA", "If you want a fun family experience in Hollywood, CA, this is your place. Three floors of great wax statues that you can take photos near. Very well done with lots of new and old Hollywood celebrities. Fun for the entire family and Walk of Fame is right outside with stars on sidewalk, etc.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Nice like all the madame tussuds", "its nice place to visit i think the Madame Tussauds Hollywood is better from the one in the UK for sure‬"], ["Reviewed August 12, 2017", 5.0, "Fun family outing.", "Fun family outing. Wax figures for multiple generations. Life like, with props for picture taking. Whole family enjoyed."], ["Reviewed August 11, 2017", 4.0, "A Selfie-Lover's Heaven", "A place where you're NOT roped off & forbidden to touch these incredibly lifelike figures?\n\nMadame Tussauds is a unique form of entertainment that many don't \"get\" until someone drags them there & then they can't believe they've never been before!\n\nIn 2s, 3s, in any kind of Group, the fun is magnified. Even stopping to watch the antics of others is hilarious.\n\nOn Hollywood Boulevard next to the Chinese Theater & the Walk of Fame ~ The Trifecta!\nShow less"], ["Reviewed August 10, 2017", 5.0, "Fun with the Stars", "During this very high tourist time, this was the closest that you would get to your favorite stars!!! We had a great time posing and taking pictures with the wax statues!!! It took us about 4 hours to cover the entire exhibit because we had so much fun. It shouldn't have taken so long but waiting for other people to take pictures or pass by so that you could take a picture added on to the time.\nShow less"], ["Reviewed August 8, 2017", 3.0, "Madame Tussauds Hollywood", "This museum was not as good as the Madame Tussauds in New York. It only took us less than an hour to go through it, and we had taken pictures with practically EVERY SINGLE wax figure. Highlights were: Ryan Reynolds, Zach Ephron, all the Marvel characters, Taylor Swift, Kylie Jenner (I have teenage daughters...), Alfred Hitchcock and his shower (we had just came from The Universal Studios tour the day before and I had to explain to the young'uns about Psycho), and a few old Hollywood figures.\nIf you have an hour to kill and a few dollars to spend, go for it. If you want to save your money and you're going to NYC in the future, go to that one instead.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Loved it. One of my fav spots", "Yes, if you are in LA you must go here. I get some great pics with some of my fav stars. Michael Jackson, Jamie Foxx, Marilyn Monroe, Kylie Jenner, Snoop Dogg, Barack Obama and a few other celbs. Great place to visit. I recommend."], ["Reviewed August 5, 2017", 4.0, "Well set out, wax figures are quite well done", "The whole family enjoyed this attraction. The figures ranged in age enough that we all found some that we really enjoyed seeing. Most of them we pretty good but a couple were not so realistic. The layout was great there's plenty of room to see each one and get photos.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Great Fun", "I obtained entry thru the go LA card and had a terrific experience posing with the different wax Celebs and the different displays. Admittedly, some of them were a little off, but must were eerily spot on, it's definitely a must see. Enjoy it"], ["Reviewed July 30, 2017", 5.0, "Fun place to visit", "My kids had a lot of fun using the dress up items they had available and taking photos of the wax figures. It was a fun hour to spend."], ["Reviewed July 30, 2017", 3.0, "London is Better", "We bought a hop on hop off sightseeing bus ticket with discounted entry to the wax museum included. It was o.k. but the one in London is much bigger and so much better. Having been there a few times this was a bit disappointing.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Really fun, go early", "I noticed the cost here says $24.99 for advance purchase but we paid on the day of, in person and it cost a little over $30 with taxes.\n\nAnyways besides here, I've been to the Madame Tussaud's in Niagara Falls. That one was much more extensive with more figures and took us 2 hours to get through. Haven't been to the NYC one yet. This one had more Hollywood celebrities that are currently popular but it also had a lot of movie stars from yester-year like Paul Newman who I only know from dressing bottles at the supermarket. I mostly came to see Selena's wax figure as I'm a huge fan. The \"Selena\" gift shop t-shirts cost $20/each by the way.\n\nI recommend going when they open as less people are in there and it's easier to take pictures. After 12:30pm, more people start filling up the place and you have to wait to take pictures with lots of the figures (especially the figures with props like Sandy from Grease and Oscar de la Hoya).\n\nThere is a parking garage directly below the museum, you enter along the side street as an FYI. They charge between $10-15 for daily parking so if you want parking in the area, I recommend there as it was an easy 5 minutes waiting to get our car back from the valet.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Loved it", "As a movie and pop culture fan, I loved the museum even though it's not that big. The wax figures were spot on and flash photography is allowed. You can even touch the statues and you're provided with props to bring originality to the pictures."], ["Reviewed July 26, 2017", 3.0, "not so good", "Some figures looking like other people, hahaha. The was Beyonce and we where sure it was Shakira. I am sorry, this is very funny, but they have to take another specialist to make a good copy\nShow less"], ["Reviewed July 26, 2017", 5.0, "Fun place to visit", "Spent a couple of hours here viewing the wax figures. They look so real and you can take pictures of the figures and get close to them. I highly recommend that you buy your tickets online and ahead of time before you go and visit the museum to avoid the wait.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Excellent visit to Madame Tussauds", "This was our first visit to Madame Tussauds and it was super fantastic. We had so much fun interacting with the wax figures. Great photo opportunity and loved it."], ["Reviewed July 25, 2017", 5.0, "Strike a pose!", "So much fun to see the different stars and get a feel for what they look like up close! A great place to slow down and enjoy family time!"], ["Reviewed July 21, 2017", 5.0, "Creepy yet so cool", "Wax figures are overall kinda creepy yet fascinating all the same time. They look so real!! From Kyle Jenner to Audrey Hepburn and Zach Effron to John Wayne, this place has an amazing display of who's who through the decades. There are 3 floors but it goes quickly. Some figures are simply standing there Red Carpet ready, while others are themed based on their roles. We had tons of fun being silly and posing for pics. This place is also included in the LA Unlimited Go Pass--see my review on that separately.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Great Experience with the Famous!", "Spent an enjoyable couple of hours here and was delighted with the friendly staff and set up. Starting at the upper level we worked our way down and navigation was easy with lots of opportunities for photos with numerous props provided. Some famous people are quite small! Well with the visit for us on the Go City Los Angeles Card.\nShow less"], ["Reviewed July 20, 2017", 4.0, "expensive for what you get but was fun to see!", "We paid full price for this then found out at most hotels they have coupons in the flyers they hand out 8 dollars off or some were have price. I am really not into this type of stuff but my he had a good time even though there were long lines out side in side was fine for taking pictures. Most people were very respectful and everyone took their turn. I would not do it again but it was well worth it for a one time visit. they have stairs or elevators so easy for everyone to get around. You come out of the $5 store which was another money grab, be prepared everyday the stuff is $5 not $10 as they would have you believe happy travels. and remember if your not sure if you want to do it just jump in!\nShow less"], ["Reviewed July 18, 2017", 4.0, "Good experience!", "I have been into MT in London, Sydney and Singapore and really enjoyed it! This MT was just as cool and awesome except for the people out the front asking for tips for photos. Metro station really close too!"], ["Reviewed July 16, 2017", 5.0, "Just fun...", "I had never been to a wax museum before. My family had a blast. The life like figures are incredible. 3 floors of fun. Everything from movies to music to sports. I'll definitely do it again in another city."], ["Reviewed July 16, 2017", 5.0, "Very enjoyable!", "I'm very glad i decided to visit! My family and I had so much fun. Only thing that needs to be improved is the hand wax station near the end of the exhibit, long wait! Needs two stations to make line move faster. A lot of congestion at that point.\nShow less"], ["Reviewed July 16, 2017", 5.0, "So much fun!!", "My husband and I visited here and we had a total blast. There was so much to see. We had never been to a wax museum so this was a treat. The figures are so life like. You save money by purchasing online on the website. Madame Tussaud's does have its own parking garage offering valet parking at $15 but we self parked off of Hollywood and Highland Center and paid $1 per 15 minutes (maximum of $15). We stayed 2 hours which was $8. You actually could park here and do the Hollywood Walk of Fame, Grauman's Chinese Theater, other attractions, and shopping.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Almost Human..", "At first I was kind of weary, but when I got in and sat besides Simon Cowell.....\nwas weird, I felt almost like he was \"there\". Very nice work, veru nice exhibit. o much fun to use the provided gadgets for selfies.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Better Than Expected!", "I know Madame Tussauds is kind of the ultimate \"tourist\" stop, but it really is well worth the visit. We did it because it was the tourist thing to do, but we actually enjoyed it much more than we expected. I especially appreciate that you can touch the figures which makes posing for pictures a lot more fun. We got a kick out of trying to find interesting ways to pose with the celebs.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Much Better Than Expected!", "Our grandsons, (14 & 17) requested a trip to Madame Tussauds Wax Museum when they visited us in July. My husband & I had been to one of their exhibits and weren't really sure that they would enjoy it. But the changes they have made really enhanced our experience. The wax figures of famous Hollywood Stars are spread throughout many large rooms in different poses. Some are standing in the middle of the room while others are posed with furniture and props. What made the adventure so much fun was that costumes and props were provided with the figures, so the attendees could pose with the figures for pictures. We all got into it and dressed the part to dramatically pose with the scene. There are explanations of the careers of each star, but the best part of the experience was to see yourself in close proximity of the figure. So if you go, take a camera and be prepared to wear the Italian Stallion robe and boxing gloves with Rocky Balboa, or the Bowler Hat and Cane with Charlie Chaplin. That's where the excitement lays!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Fun for the whole family", "My girls had a blast! Smaller than other locations but fun none the less. The 3 floors had a lot of characters that they can related too. They offered a military discount which was great. We spent about 2 hours here. Well worth it! My only con.... ladies in the gift shop weren't friendly or helpful so it was confusing getting out of the building.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Surprisingly fun for the whole family", "I had low expectations for this visit. My testy mother in law was complaining before we arrived. Add two teenager girls and two tween boys and my anticipation was nonstop complaining. But madam tussauds was surprisingly very fun. The fax figures were so real I kept checking to make sure a real celebrity wasn't playing a trick. There were props in every room to make posing with the figures even more fun. The kids got really into it with each pose more elaborate and hilarious than the last. With three floors of figures we have tons of pictures. You can touch the figures anywhere but the hair and face so get creative and have fun. The marvel movie at the end was cute but a little lame. Be prepared to get wet if you view it.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Great time \"meeting\" the stars!", "Loved walking around & seeing how lifelike the statues were. Fun photos shoots with each other. Reading the history of 'the people' displayed was intersting.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Great fun", "My husband and I bought tickets online before going to LA and thought of this as another thing on our list. Boy were we surprised! We are both kind of shy but the feel of this place and the props had us putting on hats and jackets and even a straight jacket! We just got home yesterday and spent the night laughing at our pics. When we ordered online we spent a little more for a wax hand and souvenir photo. Soooo much fun and so with it.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Worth it", "Step into famous fun and meet your favorite celebrities at Madame Tussauds. to rub shoulders with the stars at Hollywood wax attraction."], ["Reviewed July 11, 2017", 5.0, "We have fun", "I've been in Madame Tussauds London, but this is different not better it's same, ticket prices is reasonable if you're with your family, i will advice you to get the Ultimate Experience Ticket, the package comes with fast track pass, Souvenir photo, Guidebook, and wax hand. We have great time and enjoy, if you visiting L.A you must visit Madame Tussauds Hollywood\nShow less"], ["Reviewed July 11, 2017", 3.0, "Bit of a laugh", "I had been here before with my daughter on her 16th and decided to repeat the ritual for my son. It is expensive for what it is but we did have a laugh posing with a few of the celebrities. You can be in and out in about 45 minutes. It was fine with just two of us but if you were a party of 4 or more it gets very expensive quickly.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Afternoon Fun", "Went to Madame Tussauds in Hollywood after spending the day walking along Hollywood Blvd. The figures were fun to look at and to see how tall or short famous people are in real life was fun. We also loved to pose and take pictures with the figures and for Madame Tussaud's to actually provide props for patrons was awesome. If you have a friend or family memeber that likes to ham it up for pictures, this could be really fun!\nShow less"], ["Reviewed July 10, 2017", 1.0, "Huge Disappointment", "We've been to the London headquarters of this institution so we were excited to visit our local version.\n\nWow, were we let down. It's as if they had no money and no imagination when putting together this shoddy version of the original.\n\nSimply put, there is no reason in the world to visit this tourist trap when there are so many better choices to do in LA.\n\nWe were finished in 30 minutes and all agreed one visit was one too many.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Great time for all ages", "We are a mixed age group and there were many other mixed age groups. Had a great time posing and taking pics. I was here about 5 years ago....they have some of the same figures but many new ones. Fun time."], ["Reviewed July 9, 2017", 4.0, "see the stars up close", "Very good museum,we went early morning and there was hardly anyone else there so we had plenty of time we each model taking photographs. Well worth a visit,but get a half price ticket voucherwhich are given out for free along Hollywood Boulevard"], ["Reviewed July 6, 2017", 4.0, "Pretty Impressive !", "We skipped the Madame Tussauds at Vegas but decided to visit the stars while in LA. Must admit was a good decision.\nWe went with our 2 yr old & he was most excited around the MJ statue with the blazing lights & hip hop music. Danced and hopped to his heart's content !\nWith a happy kid in tow , we had a great time too. Clicked lots of pictures and the props enhanced our experience! We were there on a Saturday & expected huge crowds but the Musuem is spread over 3 floors which distributes the guests evenly !\nDo the Wax Musuem first and take a stroll later at the Walk of Fame , Dolby Theatre etc once the harsh sunlight gets mild in summer. I plan to do their other museums at NYC & London too !\nShow less"], ["Reviewed July 6, 2017", 5.0, "Rub shoulders with celebrities ..... Lol", "A great way to spend time with family and friends. Life like wax figures allow you to avoid paparazzi's and hang out with your favorite celebrities."], ["Reviewed July 5, 2017", 5.0, "Great fun!", "We enjoyed seeing the figures, posing with them and taking pictures. We were amazed at the size of the celebrities! So lifelike!!"], ["Reviewed July 5, 2017", 3.0, "Tussauds", "Best way to save money is do the Starlite Hop on Hop Off pass. We were offered the wax museum for $5 instead of $30 u pay at the door. Its good. Not as good as London. The 4D film is the best part"], ["Reviewed July 4, 2017", 5.0, "Really Good", "Thoroughly enjoyable & great fun for all the family. Snap yourself with the rich and famous & also legends from the Wild West movies. Great seeing a section/theme of Stark Industries of Iron Man/Captain America etc. The 3D 15minute movie worth a watch - special effects great.\nShow less"], ["Reviewed July 4, 2017", 3.0, "Afternoon fun in Hollywood", "Enjoyed walking around this museum and seeing the figures. Took lots of funny pictures with the figures. Laughed alot. Even taking tons of pictures only took about an hour to complete the tour."], ["Reviewed July 3, 2017", 4.0, "Fun to pose with and my kids loved it", "We last visited this Madame Tussauds back in 2009, and my kids still love looking at pictures, so this was a must do for them on our latest trip. We were unable to find a deal we were happy with, but we used a coupon from a worker outside for a much better deal than on the website. Some of the figures are more realistic than others, but we especially loved all of the props to enhance our picture taking. Our entire family had a good time, and we enjoyed the 3d movie about the Avengers also.\nShow less"], ["Reviewed July 1, 2017", 4.0, "Fun, you might give it a try", "It was a lot of fun, although I did expect a larger collection. Haven't been to any other Madame T museums, so I can't really rate how is this one in comparison when it comes to the size of the collection. The wax figures are pretty impressive, very life-like and detailed. I found the tickets a bit too pricey. The museum is located at Hollywood Blvd, you can't really miss it. It's ok to take photos at the museum. Might give it a try once you're in Hollywood.\nShow less"], ["Reviewed June 30, 2017", 3.0, "Small", "This one is a lot smallr than others we have visited in the US.\nIt was quiet and you could go at your own pace but didn't take very long to get around at all..\nGlad we booked in advance and got a good deal, would not have been happy to have paid price on the door.\nShow less"], ["Reviewed June 30, 2017", 4.0, "Best of the Hollywood museums - lots of fun for kids", "Not only were figures of my kids' favorite celebrities on display, but they enjoyed posing with each and every(!) wax figure at this museum. The layout of this museum is well thought out, making it easy for everyone to get their pictures and not miss any displays. Many displays had scenery and/or props to make the photo ops even more fun.\n\nI would recommend buying your tickets online in advance, since they are much cheaper that way. I wish I had done that. (I'm sure a tour package is a better deal than buying at the door, too.) Also beware that the VIP pass for admission to three museums is NOT for this wax museum. That includes admission to the Hollywood Wax Museum, which is different.\n\nProbably my biggest complaint is that the gift shop is small. But if you're like my family, you walk out with scores of pictures to enjoy anyway.\nShow less"], ["Reviewed June 24, 2017", 4.0, "A fun place to visit", "This was a place we went to kill time before heading to the airport. We had a fun time in the end. The figures were pretty cool and most were lifelike. They even had costumes you could put on and get into character. We had alot of laughs dressing up.\nShow less"], ["Reviewed June 24, 2017", 5.0, "So real", "My son and I had a blast posing with the wax figures. They are so life like. I also loved the figure and history of Madam T."], ["Reviewed June 21, 2017", 4.0, "Celebrities immortalised in incredible detail - Check out my pics", "We received tickets as part of a tour my wife took. Its not normally something I would do but it was quite enjoyable walking the 3 floors and the detail is spot on. An easy way to pass an hour in downtown Hollywood."], ["Reviewed June 21, 2017", 4.0, "good visit", "we have visitied most Madams Tussauds across the globe and yet this was our third time visiting and each time it is still interesting, they keep changing the exhibits and making it more appealing each time, took lots of photos, it was busy but not crowded, parking is nearby just be prepared to pay for it\nShow less"], ["Reviewed June 17, 2017", 4.0, "Better than expected", "I'm not into pop culture so I was expecting the worst... but I have to say it was fun seeing the \"waxed\" stars. Not necessary a must see but it was fun. Also the extra 4D movie at the end was a bonus."], ["Reviewed June 13, 2017", 5.0, "A blast", "We had a blast at Madame Tussauds! There are three levels that you can walk through with very realistic wax models of famous celebrities from singers to actors and directors to sports stars.\nWe went in not expecting much but were pleasantly surprised with the layout, the variety of celebrities and some were interactive with costumes for photos. Photos and videos are allowed and you are allowed to touch them but not the head or hair.\nA fun 4D Marvel movie at the end and cute gift shop. Lots of fun for all ages! Highly recommend.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Play with the stars of Hollywood!", "On a recent visit to Los Angeles, doing the Hollywood walk of Fame and visiting Madame Tussauds was a given. Our group of 5 had a great deal of fun posing with the wax models of so many well known film stars. Some of the models are of film stars of a bygone era, while others were more up to date. We were hoping to see more of the popular artists but it is probably not possible to accommodate so many of the stars. Props were available e.g. hats and feather boas, to allow for fun poses. We were particularly impressed with how life-like some of the models were. On entering the museum, a group photo was taken which we were not obliged to buy. We were also told that the photos could be downloaded digitally after we had purchased a set of 5 printed photos. We have not yet attempted to retrieve them. Hope we don't have the same experience as Randy H. Definitely worth a visit!\nShow less"], ["Reviewed June 12, 2017", 5.0, "Wax model fun!", "We got our tickets as complementary through a Warner Tour and a discount book from a hotel lobby. They do offer 50% off or buy one get one onsite. All kinds of celebrity photo opportunities. Loads of fun, nice gift shop too."], ["Reviewed June 9, 2017", 5.0, "Up Close and Personal.....kinda", "Our family, which includes a teenager, had a blast at Madam Tussaud's. They have a nice range of wax models that appeal to a wide range of the population from Jason Derulo to Judy Garland. You'll love getting your picture taken with the likes of John Travolta (Danny Zuko) and Katniss (hunger games). Great props are available to enhance your photo ops with the stars. Of course there are stops along the way where they take your pic with some of the props. You can buy two of them for $20, 3 for $25 or 4 for $40 plus the ability to see all your pics online. Money well spent! Will never forget it!\nShow less"], ["Reviewed June 6, 2017", 2.0, "Bad experiance getting our paid for photos", "We went to the museum and was given a good sales pitch for a photo package that could be downloaded digitally. We had six people traveling together from two states and two countries so getting digital images was the deal. After several attempts at retrieval we called the Museum and the contacted their subcontractor picsolve. After calling the museum back I received a copied email from museum to picsolve. I then tried again to retrieve and failed. Then I received my codes from picsolve of coarse different than printed on my receipt. The museum was cool>\nShow less"], ["Reviewed June 4, 2017", 3.0, "It's OK if you have an hour to spare.", "This was more of a visit for my partner than myself.\nIt's OK for a quick walk through and to take some stupid pics with stiff actors etc. (couldn't help think this would be a great place for Keanu Reeves to hang out in....I mean the actual guy. No ones stiffer on film than he is.......well maybe Hayden Christensen right?)\nAnyway we got a free ticket with some other purchase and that's really the only reason I went....I personally wouldn't have paid to visit.\nIf you have run out of other things to do in the area or you have kids that might find this amusing then go for it.\nShow less"], ["Reviewed June 4, 2017", 4.0, "Madame Tussauds Hollywood", "We had a lot of fun visiting this wax museum. They had several places where you could put on an accessory and then make your picture with the \"star\". While it was fun, I felt there where not as many figures as I expected to see. Would have loved to see more than what was there.\nShow less"], ["Reviewed June 3, 2017", 3.0, "Quite Good", "There were some good waxworks in this one, but I expected a bit more considering that it was the Hollywood one. We finished the whole place in less an hour and were actually looking at the map, wondering if we had missed a level as it seemed quite short.\nHowever, if you are looking just to have something fun and a bit different to do whilst you are exploring Hollywood, it's a good experience.\nShow less"], ["Reviewed June 1, 2017", 4.0, "More Fun Than it Seemed", "After being a little let down by the kitchy tourist trap setting of Hollywood Blvd. we noticed Madame Tussauds and thought \"If we're ever going to visit a celebrity wax museum, why not do it in Hollywood!?\", and so we wandered in.\n\nAt first glance we thought $30 was kind of expensive for what amounts to gawking at a couple of wax sculptures.\n\nWe were pleasantly surprised. The experience was somehow actually very fun. The sculptures were actually quite nice and extremely lifelike (albeit a few uncanny valleys here and there). They really gave the sense of what it would be like to stand near some of the most iconic celebrities of the last century in their prime. The most interesting thing to me was the scale. You really got a sense of the height and body proportions of each celebrity which often can be surprising as we often only see these people on the big screen and don't always get a sense for scale.\n\nEven though they don't talk or move or anything, it still felt really fun to take goofy photos with our favorites and imagine what it would be like to meet them in person. The curated exhibit had great music, and background set design which helped enrich the experience.\n\nAt the end of it we actually found it to be a satisfying and fun experience for the amount we paid to get in. Probably the most fun thing we did on Hollywood Blvd. Would recommend if you're interested in getting a feel for what it would be like to stand with the stars.\nShow less"], ["Reviewed May 30, 2017", 4.0, "\"Loved it\"", "We recently visited NY and we have always wanted to experience Madame Tussaud's Wax museum with my husband and I and 3 teenagers. While it was fairly pricey and the lines to get in were long, and the desk people slightly rude, we were pleasantly surprised at how much fun we had. The people look real, and it was super fun posing for pictures with them. I actually found myself wishing they had more people than they did, which is why I only gave them 4 stars.\nShow less"], ["Reviewed May 29, 2017", 3.0, "Madam Tussauds", "The models were so spread out on different floors. Really not that impressed with it. It's ok the fill an hour or so in."], ["Reviewed May 27, 2017", 5.0, "Really Cool!!!", "We ended up getting tickets to the wax museum in a package with Skyline Tours for a little over $50 per person. We didn't plan on doing the wax museum, but it was such a good deal we decided to do both. We are so glad we did the LA tour and Madame Tussauds! The figures were so lifelike, even up close! For the first 10 min I was on high alert thinking one of the celebrities were going to be real and scare the crap out of me! This experience was so cool! We has so much fun taking pictures and goofing off!\nShow less"], ["Reviewed May 26, 2017", 5.0, "Memories", "It was enjoyable to see the life like statues of some of our favorite actors and actresses. Our teenagers enjoyed taking photos with the characters. It was a nice change up from everything else we have done."], ["Reviewed May 26, 2017", 5.0, "Quirky fun", "We stopped here on the City GO pass and spent a few hours viewing the wax stars. My kids & husband found humor in posing as wax people and scaring people as they walked by, otherwise this attraction could have been completed in an hour instead of 3. Great opportunities to dress up, pose and act silly. Many wax celebrities were scantily dressed so if that bothers you, you may want to avoid this attraction. My youngest was 10 and he enjoyed himself, though he didn't know who the majority of the celebrities were. kids much younger than 10 may not enjoy this attraction. This is definitely worth stopping by as part of the City Pass, otherwise, I'm not sure we would have found value in paying for this attraction. Check out the City Pass, it saved this family a lot of money.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Only had 45 minutes - but enjoyed it all", "Madame Tussauds is a great way to spend an hour or so. Many of the figures are so lifelike you will swear they should be breathing! There are also a couple of opportunities to have the staff take photos of you. Take the time to have this done, as the results can be hilarious! (TIP: There are people on the Walk of Fame handing out legitimate 50% off coupons to Madame Tussauds)\nShow less"], ["Reviewed May 24, 2017", 5.0, "A must!", "The best thing about Hollywood blvd! I didn't expect much, honestly but we had so much fun! The wax figures are incredibly lifelike. It's a little creepy! And everyone who works there is fantastic! We had so much fun posing with the figures and interacting with the scenes. My only complaint is that it didn't last long enough!\nShow less"], ["Reviewed May 24, 2017", 5.0, "Let your inner child loose", "We expected that we would simply wander about looking at exhibits like most museums, but Madame Tussaud's is interactive. Throughout the stations are costume pieces---hats, boas, robes, a straight jacket-- to encourage you to become part of the tableau and take all the photos you'd like. We had such fun being silly and hamming it up with the figures. It is larger than it looks so wear comfortable shoes. There is a station for a posed photo shoot available for purchase, but you'll take plenty on your own.\nShow less"], ["Reviewed May 22, 2017", 4.0, "A great way to spend an hour", "We decided to stop here and snap some photos with the stars. I have been to the one in Las Vegas and knew what to expect. I thought the staff were very friendly and i appreciated the $10 off coupons I found in a magazine from my hotel. I think this is a great rainy day activity. We did find it to be quite hot in the museum.\nShow less"], ["Reviewed May 22, 2017", 3.0, "Seen one, seen 'em all", "If you've ever been to a wax museum before, you'll know what to expect here. The quality of the figures is hit or miss....some looked horrendous, while others were very good. The props and interactive elements always add to the fun. Horrendously overpriced though. Look for deals or packages before buying.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Amazing", "Although i was alone. But I took around 50 pic inside. There is alot of celebrities icons there nice to watch include movies characters, politician's, athletics. Etc..."], ["Reviewed May 20, 2017", 5.0, "Way too much fun!", "We have been to other wax museums in NYC, Vegas, St. Augustine, FL but we have never had as much fun as we had at this one. It's very interactive, with props, clothing and many items that you can use to pose next to the wax figures. Not only do you have fun doing it but the pictures come out amazing. Do not miss this. Even my 16-yr old had a blast!\nShow less"], ["Reviewed May 17, 2017", 5.0, "so life like", "We had a great time. The wax figures were amazing. We kept feeling like we were walking into real people. Good lay out. A little pushy with their book but otherwise a nice distraction"], ["Reviewed May 14, 2017", 2.0, "holly wood blvd is a bit scary", "We were traveling as a family and between the hawkers and drug addicts, it was a bit scary down Hollywood blvd. Great photos opportunities through with the shop windows and stars.\nShow less"], ["Reviewed May 13, 2017", 3.0, "Something To See", "It is neat to see how tall or short the actors were. They have so many actors from Charlie Chapman to Lady Gaga. Its is worth the money you tour on your own.\nShow less"], ["Reviewed May 3, 2017", 3.0, "Girls Trip", "This was fun to walk through, but if you have been to one Wax Museum you have been to them all! Something fun to do if you have the time and you are going to Hollywood anyway. Personally Hollywood is overrated and dirty with sketchy people! But hey, it's the experience I guess.\nShow less"], ["Reviewed May 1, 2017", 3.0, "Alright", "We are visiting this attraction due to the dance studio I work at was dancing in front of it. Overall it was ok. Nothing super interesting about it, the figures were alright but nothing super exciting. We walked through it all in under an hour and went shopping after!\nShow less"], ["Reviewed May 1, 2017", 2.0, "Not so real", "Was always fascinated by the Madame Tussads Museum as I had heard a lot about it. Was kind of disappointed as to me the images didnt look as life like as they are projected to be. At USD 30, this place is not worth it\nShow less"], ["Reviewed April 30, 2017", 4.0, "Great attreaction!", "You may want to buy the tickets that combine three attractions such as Believe or not Museum and the world records as it is a good value."], ["Reviewed April 30, 2017", 3.0, "Okay ish", "This was my first visit at the wax museum.. I somehow thought they would look more realistic.. It's quite an excellent work overall. I was just expecting it to look more real\nShow less"], ["Reviewed April 27, 2017", 2.0, "Very disappointing!!", "Having been to Madame Tussaud's in London and NYC this was a huge letdown! Not only was it much smaller but huge actors were not showcased there and it was still very expensive. We were in and out in a very short time. Not worth it in my opinion. If you are in London or NYC, you'll love it!\nShow less"], ["Reviewed April 27, 2017", 5.0, "amazingly beautiful!!", "My first Tussaud's experience and was so excited to visit this while I was in LA. The ticket was $29 last July and it was all worth it. Luckily I got discount coupon from the hotel and the entry fee came down to $21 for me. A good 3-4 level experience with all the celebrity statues surrounded and mind it, they are all life size. So one can figure out how your favorite one looks in real life. My personal favorite was the Marvel's section and of course the 7D movie experience in there. A good 2-3 hour activity.\nShow less"], ["Reviewed April 26, 2017", 4.0, "Get into it!", "Lots of displays with tons of opportunities to have your picture taken with \"celebrities!\" We definitely enjoyed walking through this museum."], ["Reviewed April 26, 2017", 4.0, "Great attraction", "Great fun attraction, which was not overly crowded. Plenty of photo opportunities. Kids had fun, usual tourist attraction ends in gift shop."], ["Reviewed April 24, 2017", 5.0, "Great experience", "Well worth going. Lots of famous people done as wax characters. Good mix movie stars, musicians, old school stars, superheroes for the young at heart. Have fun, be creative with your poses with the characters - it makes the most of the experience and your memories.\nShow less"], ["Reviewed April 22, 2017", 3.0, "Good Experience", "Good experience in the heart of Hollywood.\n\nMany cheap vouchers handed out in the street, which gave us $10 off each person. That made it better value.\n\nWe took kids aged 6 and 8 and they didn't really recognise many of the figures. Having said that they still enjoyed having their photos taken with the various figures.\n\nNeeds updating. Still on Obama as President, and we are in April.\n\nI would rate higher for older children or adults.\nShow less"], ["Reviewed April 21, 2017", 5.0, "Fun touristy visit", "We had a blast. I ordered online and I got a slight discount. It is a pain to get there but there was a good parking garage close by. My whole family had a blast. My kids are nine and almost 12 and they loved it. My 75 year old dad loved it too. It's really funny to take crazy picture with the wax celebs. Some are better than others , but super fun. There's only so much time you can spend in Hollywood and this attraction is great!\nShow less"], ["Reviewed April 19, 2017", 3.0, "With all the hype you'd expect something great...for $30 per person, you would expect something MUCH better!", "The Wife finally talked me into going to Hollywood Blvd. First of all, it's sketchy..mind your purses, your Children and your wallet! I wasn't on the Blvd. 5 min when I was approached by a guy with a stack of CD's. He gave me one, scribbled some stuff on it and then asked for a donation. Knowing that I only had large bills on me I politely returned the CD. He offered change for a $20 bill, when I took it out of my pocket, he took off running. Obviously no change. So then we decide to go into Madam Tussauds. $120 for 4 people! Then of course, they want to take a picture of you to sell to you on the way out. It was cool, I guess, but maybe $10 cool. Took 15 min to see the entire thing. My advice is to skip this one while in LA.\nShow less"], ["Reviewed April 18, 2017", 5.0, "Lot of fun", "Had a great time here! Brought the kids as well. Took lots of pictures and we loved every second of it. Very friendly staff! Highly Recommended!"], ["Reviewed April 16, 2017", 4.0, "Great place with 'waxy celebrities'", "Like other Madame Tussaud Wax museums this one is also worth a visit well knows displaying celebreties so you can make whatever kind of selfies you want with these\nShow less"], ["Reviewed April 15, 2017", 3.0, "Just 'good'. Reduced price after 4PM", "I've been to other Madame Tussauds before (NY). The Hollywood one is probably not the best. Go after 4PM and get a discount (I think you might need to buy ticket online). Not necessary to print.\nShow less"], ["Reviewed April 14, 2017", 4.0, "Wow", "The actual museum was smaller than I had expected, but the wax figures were perfectly positioned and placed into a real life atmosphere, with the occasional music to go along with it. I bought tickets online and got a wax hand at the end of the museum (which is a must do!). Just a few photos as I don't want to spoil much of this for anyone!\nShow less"], ["Reviewed April 13, 2017", 5.0, "Wow Amazing!", "It its a wax museum where a lot of celebreties are made out of wax and look so realistic that I sometimes blush thinking that they are really looking at me\nDont forget to take pictures to prank or show your friends that you met the most famous person in the world ;)\nShow less"], ["Reviewed April 13, 2017", 4.0, "Amazing life like figures of your favorites!", "It was amazing how much the wax figures look like your favorite stars, super heroes and legends. Julia Roberts, Bette White, Will Smith and Snoop Dog were my favorites\nShow less"], ["Reviewed April 13, 2017", 5.0, "Best attraction in Hollywood", "I am a big fan of wax museums and I have to say this was the best one I have ever visited.our group of 6 ranged in age from 12 to almost 80 and everyone loved it. The wax figures were so real you felt like they were the actual people. This is a not to miss Hollywood attraction.\nShow less"], ["Reviewed April 12, 2017", 5.0, "A great place for the entire family in Hollywood", "I went to Madame T's a few years back when it first opened. It was a great experience and is a great place to take the entire family! The figures look nearly exact to the stars they represent, great spot to visit if you are visiting LA!\nShow less"]]}}