{"Manhattan Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Manhattan Beach", "url": "/Attraction_Review-g32678-d261449-Reviews-Manhattan_Beach-Manhattan_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/14/ca/1b/a-view-of-the-whole-beach.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1190"}, "address": {"@type": "PostalAddress", "streetAddress": "Along the Strand near Manhattan Beach Pier", "addressLocality": "Manhattan Beach", "addressRegion": "California", "postalCode": "90266", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Great view", "We saw whales and dolphins today. This area is safe with law enforcement available and plenty of families having fun. A great day in the sun."], ["Reviewed 4 days ago", 5.0, "Where we all said we would live if we moved to LA", "Reminds me of Mantaloking / Bay Head / Sea Girt on NJ Shore moved to LA .\n\nClean beautiful beaches with rather normal people wandering about and no homeless or beggars hitting you up . Small number of nice restaurants and shops ( no freakshow like Venice Beach ) and promenade along ocean has no stores & really just for strolling or biking . Some criticize it as being boring ... for them , i suggest Venice Beach oceanfront walkway\n\nNo busy highway near it like malibu ....... place feels very family oriented / safe\n\nif you come down from up north , cut across on Culver Blvd or West Jefferson Blvd & then take Vista del Mar along ocean to Manhattan Beach for an oceanfront cruise\nShow less"], ["Reviewed 5 days ago", 4.0, "I could sit and watch the ocean here for an age", "And it’s especially good if you like people watching as there are always runners, cyclists, people of all ages on the boardwalk, cycleway and beach itself. Sand is great, beach pretty clean (some plastic/weed deposited from the ocean) and there’s always lots going on."], ["Reviewed 1 week ago", 5.0, "Lovely Town Surrounds California Beach", "Manhattan Beach, the ocean reaching sandy beaches, with a pier and plenty of places near to eat. The water was too cold for me, but my son who I was visiting for his birthday has the gear, a wetsuit top and fins for body surfing. There were surfers and sun lovers families all chilling getting some sun, or going in for ocean fun. This is a great beach and highly suggest it for travelers. There is some pull near the pier, that can drag you from one side to the other, so take care swimming to closely there.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome Small Town Away from LA Chaos", "We went to Manhattan Beach in February. Let me just say even though the water was cold people were still surfing! This beach is so clean and peaceful. The restaurants are also great! This seemed to be more family oriented beach and more decent people walking around (unlike Venice Beach where you are constantly smelling marijuana). Would definitely go back int he summer to check out the waves.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Paradise or close to it!", "I love this beach! It's beautiful & really love how clean it is. From surfers to families, and great volleyball! There is always something going on here. Walk the pier & enjoy the scenery!"], ["Reviewed 2 weeks ago", 5.0, "Best beach I've ever been to", "We visited this beach during March so the water was pretty cold, but wow was it beautiful! It was clean and not too busy during our visit. We walked the beach for hours and didn't have a care in the world. I'm ready to return!"], ["Reviewed 4 weeks ago", 5.0, "One of our favorite places during our trip", "Manhattan Beach was one of our favorite places during our trip. Beautiful beach, lovely little shops, great restaurants."], ["Reviewed 4 weeks ago", 5.0, "Best of The beach", "The Cali coast has some great beaches and we visited a few of them on our trip. Some super fancy some super trashy (Venice) while figuring out what to do on our last day before the airport we stumbled upon Manhattan Beach. It’s cast and long and there are many cute shops and restaurants nearby.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "long Volley Ball beach!", "We hadn't really liked LA until we found Manhattan Beach area.\nLong walking parade, separate bike track, and happy people. Lots of expensive houses crammed into suburb, but can imagine fun for young groups. Volley ball everywhere on Sunday, some surfing the day we were there\nParking an issue.\nShow less"], ["Reviewed January 23, 2018", 4.0, "vast and lovely", "Nice fun little town with decent stores and restaurants etc...(I like the Skechers store because my feet were sore, so their shock absorbing shoes were helpful:) Can be a bit crowded on weekends but nice walking around or just relaxing on the beach."], ["Reviewed January 21, 2018", 5.0, "Cool California beach town part of LA County but its own city", "Love to visit Manhattan Beach. Escape the crazy gridlock and nuttiness of LA and escape to this gem of a beach town known for it's pier over the Pacific, great restaurants, pristine clean beaches and many good restaurants. Parking can be a problem, especially on weekend. Amazing concrete bike path goes for miles along the beach, all the way down to Palos Verdes.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Beautiful, quiet beach in an upscale residential area", "Such a nice departure from the noise and crowds at Santa Monica and Venice Beaches. Home to beach volleyball, Manhattan Beach is a quiet escape from the usual Los Angeles scene. The beach is about a 10 minutes drive or Uber ride from Los Angeles. Take a walk along the strand and grab some lunch at one of the cute restaurants along Highland Ave.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Pretty Beach", "Fun beach with a lot of activities. Cool to see all the surfers and beach volleyball players. Lots of places to lock up your bikes."], ["Reviewed January 19, 2018", 5.0, "Upscale neighbor with family friendly beach", "Manhattan Beach is my favorite beach among the South Bay communities. The variety of shops and restaurants lining Manhattan Beach Blvd as you approach the pier is fantastic even if they are a bit on the posh side. This neighborhood is family friendly, safe, and clean.\n\nThere are a few parking options, but I recommend parking in one of the lots off of Morningside just north of the Manhattan Beach Blvd intersection. These are all metered lots. Parking can get a bit crowded on a sunny weekend, but we typically find a spot.\n\nThe pier is a great photo op especially if you are bringing in guests from out of town. It's a postcard Californian location. You can't go wrong with a trip to Manhattan Beach.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Beautiful", "Love MB and will come back to run, eat and play! Parking is tight so try to uber/lyft there. some cool shopping for surf and summer wear."], ["Reviewed January 15, 2018", 5.0, "The Best Beach in So Cal", "I have to brag and say that MB is the best beach in So Cal. Why? Other than parking is difficult which keeps some of the crowds away. The sand is soft, the waves are rolling, the strand is great for walking, running, bike riding, rollerblading, exercising, dog walking, and people watching. Also, MB is home to AVP volleyball, including the walk of fame on the pier. This year in 2018, Sketchers Family is renovating the Round House on the Pier to make it a beautiful exhibit of ocean and beach.\n\nif you get tired of the beach, there are amazing places to eat and shop on MB blvd, from a few old dive bars, to upscale lounges and steak restaurants.\n\nThe beach is smoke free, If you choose to go be the pier, the right side is boogy boards, and the left side is surfing.\n\nIf you have small kids, I would go down by Bruce Beach, which is at the base of a park around 15th street.\n\nHave fun!!\nShow less"], ["Reviewed January 5, 2018", 4.0, "Take a stroll on the pier at Manhatten Beach", "After a great breakfast at Uncle Bill's Pancake House we took a walk down to the beach and out on to the pier. The area was lovely and clean, views in all directions stunning and goodness I can see why it is the home of Beach volleyball. Can only imagine how crazily busy this beach would be in summer, was busy enough mid winter\nShow less"], ["Reviewed January 3, 2018", 5.0, "Favorite beach!", "I love Manhattan Beach! We went on the pier and the free aquarium had crafts for the kids! They suggest a donation of $3-$5 depending on how many people are coming, but you don’t get the stink eye if you don’t do that. They are about to do a renovation so check before you go if that’s your main attraction! I enjoyed an amazing cappuccino at the coffee shop which is closing during renovation but if it’s open when you go then definitely plan to try a beverage!\nManhattan Beach is clean and very family friendly. During the holidays parking is free! Loads of restaurants, bars, shops, etc! Fun for any age!\nShow less"], ["Reviewed December 31, 2017", 5.0, "Our favourite beach", "When we come to LA we always stay at Manhattan Beach. Fantastic beach, great selection of restaurants all within walking distance and good surf."], ["Reviewed December 25, 2017", 5.0, "Great beach for seeing sunset", "It was amazing to see the sunset from Manhattan Beach. Board walk is awesome too, it is decorated with lights on Christmas Eve. There is a plenty of parking space. It is hourly parking."], ["Reviewed December 19, 2017", 5.0, "El porto in winter hard to beat", "We love to sit out and feel the breeze and watch the dolphins..we walk and run daily to pier, we ride our bikes to hermosa to dine, we also ride up\nTo playa ..the views and clean beach, shell combing all top\nNotch..lack\nOf crowds..nice volleyball, adequate clean restrooms and you can park\nIn winter. We walk from\nHome and the views and stunning sunsets just never get old .the homes on strand are fun to look at but no one is ever in them except for workers or window washers ..how sad :) peaceful , calm\nSurf , great for beginners and the advanced alike.. just a wonderful\nParadise we love\n\nShow less"], ["Reviewed December 13, 2017", 4.0, "Nice afternoon stroll on a beautiful sandy beaches", "This is a very quiet neighborhood away from the traffic jammed highways in most of California\n\nYou an hear the ocean waves breaking up along the sandy beach\n\nThere is not a single rock to be found along the mile long sandy beaches\n\nThe beach is absolutely clean without any garbage\n\nThere is no littering or abandoned bottles\n\nStrolling along the beach front one can see beautiful homes with Christmas decorations,and patio furnitures as if they have a pair of welcoming hands with comfortable patio chairs facing the pedestrian walk\n\nThere are bikers,walkers,runners,surfers and youngsters playing beach volleyball\n\nIt appears there is a good control of the vendors as there are no commercial shops or restaurants seen along the long stretch of white sand\n\nAll the shops,restaurants are found somewhat higher up 1/4 way up by the Main Street\n\nAs it was in December and in mid week,the beach is not overcrowded\n\nJust come and walk,relax,and enjoy the beautiful red sunset by 5 oclock\nShow less"], ["Reviewed December 11, 2017", 5.0, "Beautiful views and laid back atmosphere", "Watch the surfers from the pier; walk the trail and look at the homes; take your shoes off and walk in the fine sand. This is a great spot."], ["Reviewed December 10, 2017", 4.0, "Beautiful, clean beach", "Manhattan Beach is clean and quiet. Soft sand for California. Beach volley ball and surfing area. Nice place to walk along the ocean."], ["Reviewed December 9, 2017", 5.0, "Peaceful", "This place in December isn't crowded. The view is nice and the sand looks clean. I would recommend people coming here in December so enjoy some alone time!"], ["Reviewed December 8, 2017", 5.0, "Very clean beach", "We visited the beach after lunch and enjoyed the beautiful view. The beach was clean and there were lots of activities going on: surfers, paddle boarders, sun bathers, people doing yoga, families playing in the surf, and people looking for shells. It was a very relaxing experience.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Strand, sand, pier, and volleyball", "Strand, sand, pier, and volleyball. Surf and groovin on the beach. One of the best beach in the South Bay."], ["Reviewed December 2, 2017", 5.0, "Wind down with the sunset..", "I am a local, but encourage visitors and locals alike to get out and enjoy Paradise in the city. Early evening power walk and jog then cool down as you watch the amazing sunset along the strand or at the beach. It is always amazingly beautify, never quite the same, and quite frankly can make the perfect end to any day.\nShow less"], ["Reviewed December 1, 2017", 5.0, "Nice beach close to LA", "We arrived at LAX and wanted to experience the SoCal beach scene. The town is very charming and has a great beach vibe. We enjoyed walking on the pier and down the beach. Since it was December, the beach was not crowded with only several people walking along it. It was fabulous for us!\nShow less"], ["Reviewed November 28, 2017", 4.0, "great beach", "Not sure if there was a tournament going on but there where beach volley ball nets everywhere and a lot of activity. Even with that going on there was plenty of space for sun worshippers and families, with the tide out it looks like it's at least 100 yards to the water and beach stretches for miles and miles each way. We had no issues finding a parking spot either.\nShow less"], ["Reviewed November 26, 2017", 4.0, "Lovely", "Gorgeous beach with lots of great eating options a few mins walk away. We cycled from Marina del Rey which took about an hour."], ["Reviewed November 26, 2017", 5.0, "One of the best beaches in California", "Amazing beach, great waves and a nice coffee shop on the pier that serves iced Coffee in cold glass jars for a morning at the beach. Kids can learn to surf on these waves."], ["Reviewed November 23, 2017", 4.0, "Nice Beach", "I took a walk to Manhattan Beach after my 12 hour flight from Auckland, NZ. It was a nice way to unwind from the flight. At the beach, there is a pier, bathrooms, volley ball court and it is protected by life guards."], ["Reviewed November 15, 2017", 5.0, "Love it", "Beautiful stroll especially on a beautiful sunny day. Can't say enough of how gorgeous the walk is. It is not too crowded during weekdays. And looking at those beautiful homes while you're strolling makes it even better."], ["Reviewed November 9, 2017", 5.0, "Beautiful Place for a Walk or a Run", "A beautiful, beachfront walk with separate bike and pedestrian paths. A real pleasure to stroll or get in a good workout."], ["Reviewed November 9, 2017", 5.0, "My Favorite Home Ever!", "I have lived in CT, FL and now CA. Been in So Cal for 21 years now and I never saw this as being a long term residency. I have lived in Dana Point, Newport Beach, Huntington Beach, Hermosa Beach and now Manhattan Beach. Seeing a pattern here? I have to say that of all of beachside cities Manhattan Beach is without a doubt my favorite. My neighbors are incredibly gracious and generous. The environment itself is incredible and keeps me in awe every day. There are great restaurants, bars and shops. Couldn't ask for more.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Strolling on the beach", "Nice hot day, beach was not as crowded....easy to walk on the sand without stepping near sunbathers....enjoyed walking in the water...feet feeling cool. Very clean ....air and beach."], ["Reviewed November 5, 2017", 4.0, "Hip and Happening", "A very upscale town still exhibiting the California beach atmosphere. Running, cycling, dining, it al was cool. Staff at all the restaurants was young, beautiful and friendly."], ["Reviewed November 5, 2017", 5.0, "Love the houses along the beach!", "Yes the beach is very pretty. But one of the most unique parts to me about this beach is the walk along the gorgeous houses! Especially on a Sunday morning, it's a fun stroll!"], ["Reviewed October 30, 2017", 5.0, "Working", "I love the clean friendly area. Always alot of events going on or something for that matter. Just a great high energy place. If you have kids this Beach is for you more family and less partying going on. I have come across alot of people that came to visit and ended up moving hear. I totally get it. The pier is great just to walk out on and check the view. The restaurant's have it all dive bars to five star dinneing. Alot of shopping as far as little cool beach and trends. Great vacation destination.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Beautiful", "Great all day long!! Clean beach with endless views. Watch the surfers, or dive in the chilly waters yourself (I'll pack my wetsuit next time!)."], ["Reviewed October 24, 2017", 5.0, "Great spot to escape the airport", "Such an easy 10-15 minute drive from LAX - it makes for a perfect getaway from the airport between flights. Stunning beach, great boardwalk to stretch your legs, and far more chilled out and authentic ambience than the craziness of Venice and Santa Monica. Highly recommend if you want to enjoy some fresh air and endless blue sky - an easily accessible piece of the South California lifestyle.\nShow less"], ["Reviewed October 21, 2017", 4.0, "Awesome place to relax", "Clean, nice people. Great place to stroll and relax. Clean. Friendly people. We will certainly be back."], ["Reviewed October 16, 2017", 5.0, "Awesome place!!", "Loved the town and beach. Very clean and super friendly people. Parking is pretty easy to find and everyone needs to stop at Paradise Bowls!!"], ["Reviewed October 16, 2017", 5.0, "Close enough to LAX Hotels", "Close enough to LAX Hotels to Uber for $8-$12 depending upon time of day. Though cool when we went, still nice to walk and watch surfers!"], ["Reviewed October 16, 2017", 5.0, "Great place to go for a walk", "Manhattan Beach provides a great stretch to walk along the promenade, look at lovely houses and views of the coast. The town itself is a very popular and exclusive place with some high-end stores. The people are all lovely."], ["Reviewed October 14, 2017", 5.0, "Fantastic Beach - lots to do", "Clearly California is blest with lots of wide sandy beaches. Manhattan stands up extremely well against all comers, with surfing volleyball etc. available plus the sheer delight for a 2-year old granddaughter making sand castles. Wonderful boardwalk with a backdrop of some scintillating houses."], ["Reviewed October 14, 2017", 5.0, "Miles of clean, flat golden sands", "It's a gentle 25 minute stroll along the Strand from Hermosa Beach (HB). It gives the impression of being slightly up-market compared with HB but that's a purely personal view. The shops look bigger, smarter and glossier.\n\nIf you enjoy a good walk, stroll along the Pacific shoreline and then return to HB or Redondo via the Green Belt - a former tramway made into a great shaded woodland walk - about 4 miles each way from end to end.\nShow less"], ["Reviewed October 11, 2017", 5.0, "You're gonna love it!", "Manhattan Beach has such a fun vibe! There is plenty of room so you don't feel squished in with a lot of people, tons of beach volleyball nets setup so you can play all day if you'd like, beautiful waves, everything you'r want in a day at the beach. We were there in October & were surprised how pleasant the water temperature was! If you fancy a walk on out on the pier they have a place where you can grab a drink or something small to eat. There's also a little make shift aquarium, it's nothing too fancy but fun non the less. When you're done at the beach you can walk up the street where there are tons of restaurants & shops, they truly have something for everyone. Everywhere you look people are having a wonderful time, if you have the chance I would definitely recommend it.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Goodbye California", "My husband and I took a short ride with Uber from the Hilton at LAX to spend our last evening of our vacation at the Manhattan Beach.\nThere were a lot of young families with children, teens and adults of all ages enjoying a beautiful Sunday at the beach in an early fall evening.\nWe both really enjoyed watching the teenage boys trying to surf on the very small waves!\nThe pier was a great place to watch a beautiful sunset (our last on our trip to the beautiful California coast!\nShow less"], ["Reviewed October 9, 2017", 5.0, "Spend the day, enjoy plenty of room on the beach", "You can park at the meters right by the pier and pay $1.50 per hour, or park further away if you can find a spot. Beach has plenty of room to run around, play games, build sand castles and of course play in the ocean."], ["Reviewed October 6, 2017", 5.0, "Fantastic place", "We are recommended this beach when staying in Santa Monica by a local. Went 3 Times after that. Fabulous beach, gorgeous shops and the house overlooking the beach are out of this world. The boardwalk was beautiful for walking up and down and watching the amazing sunset. Toilet and shower facilities on the beach were always being cleaned. Will definitely visit this place on another holiday in the future\nShow less"], ["Reviewed October 5, 2017", 4.0, "Mahhhvelous Mahattan Beach", "It’s a Beach. And it’s a beautiful beach with beautiful sun kissed people. Being from Hawaii, I know beaches. Volleyball, paddleball, baby waves for beginner surfers, ronpmantic beach strolls, it’s all here. Upnabove is the concrete strand that goes on for miles into Hermosa. Walkers, bikes, skateboarders, and strollers abound. My biggest disappointment? My dogs weren’t allowed on the. Beach! But get there before or after 7am/7pm and let Fido off that leash! Shussssssssh!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Very Enjoyable!", "Have been to California several times and decided to check out Manhattan Beach this trip. What a great decision - its a wonderful area! From riding bikes on The Strand to plenty of great little shops and restaurants to check out, this place definitely has a lot of charm and personality with an abundance of things to do. Loved it and will definitely be back!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Cruising Manhattan Beach", "Great views, plenty of fine restaurants - pricier the closer to the beach. 3 coffee places within a block of each other 2 blocks from beach. Great food and prices at the Kettle ( great diner...) and Old Venice ( Italian and Greek...). Nice beach, long pier with attractions on it. Access to other beach cities - north and south.\nShow less"], ["Reviewed October 2, 2017", 5.0, "An historic beach community with shops and restaurants", "Cleaner than Santa Monica and less snooty than Malibu, Manhattan Beach is an idyllic beach town with friendly people and great restaurants. There are some foodie havens located on Manhattan Beach Boulevard, but also a good number of dive bars for those who come straight from the beach. It's not a resort town that's here to serve tourists, but it's home to good people who welcome other good people.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great Place to take a stroll, see the scenery and relax", "The Northern Part of Manhattan Beach, North of Rosecrans from about 40-45th is the Surfing spot, called El Porto. Great area, parking tough on weekends, good size beach lot. Great for people watching"], ["Reviewed September 30, 2017", 5.0, "Run Run walk", "Great place for a running session or even walking session up to Hermosa Beach, very nice beach, houses"], ["Reviewed September 24, 2017", 5.0, "Well Worth A Visit!", "Manhattan beach is a great area for a visit. Lots of activity and great for walking path, surfing,bike riding and volleyball.This is a beautiful beach with several restaurants in the immediate area. It felt very safe as we enjoyed our afternoon with our family.We look forward to returning again soon.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Bike and Walking Path", "Great place for a ride or walk with lots of room. Right on the beach with lots of activity such as surfing and volleyball. Would love to live in this area."], ["Reviewed September 21, 2017", 5.0, "An Amazing Beach in Los Angeles!", "I have wanted to visit this beach for some time but have always put it off until the next visit. This time I decided to finally go and check it out, and I am so happy I did, This beach is pristine and an unusually large area. It is a must see for all who are in the area! This is a great area for both small parties and/or families to enjoy. I can not wait to get back here and be a beach bum for a whole day.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Famous beach", "Manhattan beach is well worth a visit while you are in LA. It's not as touristy as the other beaches but just as beautiful. The parking is not too bad nearby and there are a bunch of fun bars and restaurants in the immediate area. It seems like a very safe area as well.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Great Beach -Beautiful Pier", "Local family atmosphere-all ages, surfing, beautiful pier, restaurant and shops nearby. Very clean beach. Great to walk, swim or surf. Designated paved Bicycle lanes. Highly recommend to get away from heavy crowds and enjoy locals."], ["Reviewed September 17, 2017", 5.0, "Beautiful", "This is a very nice beach that is right off a quaint town with lots of dining and cocktail options. While it is very family friendly, there are plenty of options for singles and couples without children. Overall a beautiful area and a nice experience."], ["Reviewed September 6, 2017", 4.0, "Relaxing a beautiful", "A very nice Los Angeles district. Much more quiet, clean and organised.\n\nThe beach is big, with good equipment, very clean public bathrooms and lots of (paying) parking space.\n\nThe surf should also be good, but during our stay it was small (waist height) and close out.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Favourite beach in LA!", "On our final day in LA, we decided to take the Ocean Express from our hotel near LAX to Manhattan Beach as we had a free morning before our flight. It was well worth the trip!\n\nBeing from Sydney, this was the only beach that I visited in LA that reminded me of home! It was beautiful and much quieter than Santa Monica and Venice beach.\n\nWe had lunch down by the water and wandered around the pier. There was also a cool little aquarium which you could visit at the pier which would be great for families with kids.\n\nWe wish we could have spent more time at Manhattan Beach as we fell in love with it! Definitely my favourite beach in LA!\nShow less"], ["Reviewed September 5, 2017", 5.0, "Beach City Beauty", "Great for dining, shopping and walking! This city has great character and has great sunny California character.\nIf you want a pleasant, safe, sun-filled place to walk along a beach, have a great meal or shop and window-shop or you want to live with good neighbors, Manhattan Beach is the place.\nShow less"], ["Reviewed August 29, 2017", 5.0, "My most favorite place in ALL of LA", "I've lived in LA since 2003 and my most favorite place is Manhattan Beach. It doesn't get the crowd or element Santa Monica gets and you can always find parking for free or very cheap. (Santa Monica parking is $12+).\nI like getting a Subway sandwich and having lunch at the beach, surfing, watching the pretty people, and enjoying the classless of MB.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Gorgeous weather and super clean beach", "We stayed at the Wave Hotel and could walk to the beach. Hotel was clean and comfortable. The beach was clean and the weather was perfect. Took engagement photos and the beach backdrop was beautiful."], ["Reviewed August 23, 2017", 5.0, "Can I please live here?", "I loved the feel of this beach. It was beautiful and clean. The sounds of the waves and the wind in your face makes you feel relaxed and makes you want to sleep. This is an amazing place to come to not only to enjoy the beach and water but it also offers nice boutiques restaurant and a great area to walk around.\nA beach which is a must go!!! I would also suggest going here before a flight as it is close to LAX airport.\nShow less"], ["Reviewed August 23, 2017", 4.0, "Very nice beach", "Manhattan Beach is a super nice, clean beach. One of my favorites in the area. We love to run the Strand while we are visiting and enjoy the beatiful scenery."], ["Reviewed August 16, 2017", 5.0, "Quintessential So Cal", "Close to LA but it feels like it's a world away. Restaurants, jogging and separate bike paths, white sand beaches and a pier make for an enjoyable visit for all."], ["Reviewed August 9, 2017", 5.0, "A must visit when in LA", "This is the best beach in the LA area. If you're visiting be sure to stop by the town, eat in one of the many restaurants, shop, walk the pier and the strand, and swim in the Pacific. The beach is large and clean!"], ["Reviewed August 9, 2017", 5.0, "Beach Volleyball Capital of the World", "First class beach: Very wide and deep, good sand, a gazillion beach volleyball courts, good surfing on either side of the pier."], ["Reviewed August 9, 2017", 5.0, "Gorgeous beach and scenery", "We took the Ocean Express Shuttle to Manhattan Beach when we stayed at the hotel Lax. It is not crowded the time we visited. Very much enjoyed every minute of it. The beach was beautiful and great view love the activity."], ["Reviewed August 7, 2017", 5.0, "LOVE Manhattan Beach", "The cutest town with a beautiful beach!!! Great shops, restaurants, long stretch of beach and gorgeous homes!"], ["Reviewed August 7, 2017", 5.0, "Superb Californian beach", "We enjoyed a super afternoon on this lovely sandy beach. Coming from cold Northern Ireland we were taken by surprise by how scorching the sand was. Couldn't walk on it without shoes - bring your flip-flops! Our eldest hired a surf board and enjoyed a good hour in the waves. Lovely spot!\nShow less"], ["Reviewed August 6, 2017", 5.0, "Nice Beach and area", "Very nice wide beach and area with good surf. Not crowded and felt very safe and family friendly. Has a pier. Free parking avaliable in most residential streets which are about 10 mins slow stroll uphill from the beach."], ["Reviewed August 4, 2017", 5.0, "Beautiful beach with a pier", "Nice wide clean beach with volleyball nets...surfers out in the ocean. A perfect place to spend a sunny afternoon."], ["Reviewed August 3, 2017", 4.0, "Great Beach", "The beach is very wide and there is plenty to do or watch. Volleyball, Surfing, riding the waves & swimming. The water was great!"], ["Reviewed July 30, 2017", 5.0, "Beautiful", "Lovely wide beach with a relaxing feel to it. Mainly populated by uber healthy sand and surf types but the place has a friendly and welcoming vibe to it. The air feels really fresh and clean. One evening we got a pizza from the Manhattan Pizza Company (excellent) and had a picnic supper, followed by a walk to the pier - simple pleasures but we really enjoyed the evening. Highly recommended.\nShow less"], ["Reviewed July 29, 2017", 3.0, "Manhattan Beach", "I visited this beach in July 2017. If you get there early enough you could find free street parking on Hamilton otherwise there is meter parking. I noticed some small trash on the beach but other than that the beach looked clean. This beach does need more trash can though. Unless you are around the pier itself, there really are no other bathrooms. As the day moves on, it does get crowded so just be aware people will invade your space as it becomes more packed. The are volleyball nets and there is a cool running/bike trail that runs along the beach area next to some cool beach houses. Enjoyed watching the surfers early morning.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Beautiful beach", "This beach has such a relaxing vibe, I felt the minute I walked on it. Nice scenery of million dollar houses. Lots of volley ball nets if you like to play. Walked the pier but didn't go in the aquarium. Lovely shops and restaurants near here.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Lovely Beach", "Good point is easy to find parking. City Parking structure is 0.75 per hour (two hour limit), but on one of the parking structure if you go to the top level.(325 Center Pl)\n\nanother parking structure civic center parking lot is city parking lot, during weekday, only after 3:30pm. two hours limit (320 15th St, Manhattan Beach, CA 90266)\n\nthere is no hour limit. a few blocks down to the beach.\nstreet meter is 1.5 per hour.\nlovely beach. kids enjoy the wave very much.\nmom enjoy the sand.\nShow less"], ["Reviewed July 22, 2017", 4.0, "Beautiful view of the Ocean", "We enjoyed a nice view of the ocean as a family - the breeze off the water made this walk pleasurable."], ["Reviewed July 21, 2017", 5.0, "Lovely place", "Nice relaxed atmosphere. Beautiful homes along the coast but many seem empty. Some cute little cosy shops. Always relaxing to come here."], ["Reviewed July 21, 2017", 5.0, "Great beach!", "Beautiful beach! Very clean, sand was nice. We were there on a Friday morning, and it was very easy to find close parking. Downside is there are no quick food places or souvenir shops near the beach. But is you have everything you need and just want a clean nice beach...this one is great!!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Bring a towel and sunscreen", "This is one of the nicer/cleaner beaches in LA area. Almost every weekend in the summer their is some sort of an event happening where all are welcome. They even have a massive fireworks display during the December holidays. I like to come down here for a swim or just to sit and enjoy the view.\nShow less"], ["Reviewed July 16, 2017", 5.0, "Great way to get your daily steps in.", "It is beautiful, calm and relaxing to stroll down the Manhattan Beach Strand in the early morning. I get so many ideas for my gardens and patios from observing the gorgeous residences. How lucky they are to live there!"], ["Reviewed July 14, 2017", 5.0, "Clean, relaxed and serene beach", "If you'd compare beaches to e.g. European ski-resorts, Santa Monica would be like St.Anton and Manhattan Beach like Lech. The former would be extremely crowded with those who want to be \"where everybody is\" (literally, it is SO crowded!) and the latter with those who would appreciate more space, less noise, more quality than quantity. Manhattan Beach has easy access (also parking), is surrounded by several really good restaurants and small boutiques. Highly recommended!\nShow less"], ["Reviewed July 14, 2017", 5.0, "The BEST California beach town!", "By far my favorite beach community in all of California. Neat, clean, and uncrowded beaches really best describes this lovely town. Parking can be a bit of a problem on weekends however this helps to maintain a pleasant overall experience since you do not have to fight large crowds of tourists.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Always a relaxing walk", "Being born and raised in Manhattan beach this will always be my favorite place. I love walking a couple of blocks and on the pier. Manhattan beach is her clean with lots of parking options. There is so much to do from eating food, roundhouse aquarium,fishing, biking,skating,running,bars live music. They got it all.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Typical California Beach with beachsports and surfing", "Wide beach with enough space and nice beachside houses. Some restaurants nearby. Don't forget to pay for the parking!"], ["Reviewed July 10, 2017", 4.0, "Best beach place in Cali!", "Three fantastic weeks in this little pearl of the west coast!!! I have enjoyed every single day over here......my fav place surely!!!! Chill out is suggested when you get here!!! Great vibes and nice people!!!"], ["Reviewed July 9, 2017", 5.0, "Best of everything", "Great beach. Close enough to the city to not have to endure ridicious traffic, there's a ton of parking spots which is great on the busy summer weekends and the sand isnt dirty, they also have volleyball ball courts. In addition it isn't extremely touristy unlike Santa Monica, which means less of a crowd. Close to the airport without the airport noise. What more can you ask for, plus theres some quaint food/dessert shops in the area to visit after a relaxing day at the beach.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Fabulous Day at the Beach", "We visited Manhattan Beach today for the afternoon and it was excellent. It was so nice to be in an area with that was upscale and clean. Definitely a place to visit if you are looking for great Beach and some great shopping and food!"], ["Reviewed July 6, 2017", 4.0, "Overnight in LA", "Beautiful beach in LA. The fishing pier is really nice. This beach is very wide and spacious. If you like beach volleyball this is your place."], ["Reviewed July 5, 2017", 5.0, "Great Family Beach", "If you're looking for the total opposite of Venice Beach, then this is your spot. It could have a little more parking but if you get there early, you'll be fine. The public facilities are kept up very well and so is the pier."], ["Reviewed July 5, 2017", 5.0, "Family vacation", "Awesome fun at the beach lots great restaurants with great prices and family friendly watching people."], ["Reviewed July 5, 2017", 5.0, "Family vacation", "Enjoyed the beach front. Loved the restaurant,shoped along the board walk. Great for families volleyball games, scakate board accessible lovely beach homes on the shore all types of eateries"], ["Reviewed July 5, 2017", 5.0, "This is the best, safest, most kid-friendly community in Los Angeles", "Even Beverly Hills people will tell you, Manhattan Beach is LA's best. Their Mira Costa High School wins grammies every year for best music program. The community is safe for kids to walk around in, something you don't even see much of in Beverly Hills and Brentwood. LA's best beach. Clean too. And great restaurants to choose from right off the beach. Plus, they have a Whole Foods nearby. Can't beat it for a vacation spot or place to live. Works both ways.\nShow less"], ["Reviewed July 5, 2017", 5.0, "The strand", "I love walking in Manhattan Beach it's so relaxing and there is so many people walking and jogging at all times . I'm blessed to be able to work walking distance and it's just so beautiful"], ["Reviewed July 4, 2017", 4.0, "Fun place to walk aroubd", "Was in town for a meeting and went to Manhattan Beach for dinner. We really enjoyed walking up and down the boardwalk next to the beach while waiting on a table."], ["Reviewed July 3, 2017", 5.0, "Great Beach For Family and Adult Fun", "Great beach for family and adult fun. Enough space for good sized crowds but easy to find your own spot along the beach for your group. The walk along the beach is great for an early morning walk or run. Good dining options in close proximity and Vons grocery if you want to prepare your own meal. We will definitely come back to enjoy Manhattan Beach again.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Great walk, beautiful beach and pretty MAC Mansions!", "The people are not that shabby either, as there are lots of young attractive people half naked running around, playing Beach ball, sun bathing, drinking, or just ridding their bikes. The houses favorite facing the water and beyond are just beautiful and huge. Some architecture is just amazingly done well. There is the board walk and the gardens with beautiful colorful blooms. Even if it was sunny and hot, the ocean breeze makes it all better. Also many places to eat , drink and shop!\nShow less"], ["Reviewed June 30, 2017", 5.0, "Nice clean beach with ample parking close by", "On a sunny day, you can't beat S. Cal beaches! This area is convenient to shops, restaurants and bars and the entire area seems to be dog friendly, too. I was here on a Thursday. I'm certain the weekends will be much more crowded."], ["Reviewed June 29, 2017", 5.0, "Beautiful & Clean Family Beach", "I am from central California and me and My family visited this beach a week ago and ever since this visit we have decided we don't want to visit any other beach again. This beach was beautiful and clean. No trash was visible and the water was Actually clear not like the waters we are used to in the Pismo Beach or Morrow Bay Area. The entire beach was filled with families and everyone was having a blast. This beach was very serene and peaceful. Tip-when Walking up to the ocean front wear some type of sandal or water shoes as the sand was extremely hot. That might have been due to the heat wave going on but I would still suggest not walking up to the beachfront barefoot.\nShow less"], ["Reviewed June 29, 2017", 4.0, "amazing, beautiful beach", "I don't know the LA area well. This is a beautiful beach and the walk on the pier is fun. Lots of good places to eat nearby."], ["Reviewed June 25, 2017", 5.0, "Really neat place", "Really nice beach with lots of surfers to watch from the pier. Also has a nice town with lots of nice shops and restaurants to checkout. Some beautiful houses as well. Recommend a cycle ride along the cycle path to see the whole region better."], ["Reviewed June 25, 2017", 4.0, "Beautiful and not too touristy", "This beach is close to LAX so a great choice if you have a long stopover. It's not particularly touristy, but still has a nice bustle to it. Lots of volleyball courts."], ["Reviewed June 21, 2017", 5.0, "Relaxation in a sophisticated setting", "Manhattan Beach is very a very upscale area of LA surrounded by a nice variety of restaurants and shops. We enjoyed laying on the beach people watching and enjoying the beautiful weather."], ["Reviewed June 21, 2017", 5.0, "Manhattan Beach is a beautiful beach and relaxing. With high end shopping available but with a homey feel", "Living 10 minutes away from Manhattan Beach youll find great bike trails, volleyball, bars and fantastic restaurants within walking distance. Parking can be a bear so its best to get there early to find parking. The beaches are fairly clean and safe. We have overcast mornings and sunny afternoon.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Crowed beach", "be prepared limited parking and parking time was two hours , the small area with 5 hour parking never spots available.."], ["Reviewed June 19, 2017", 5.0, "Father's Day weekend", "My 7 year old daughter and I went here on a Saturday afternoon. It was great to see all of the activities that were available. Volleyball nets are up, there's a section to surf/body board, etc. I would recommend being close to the pier so you can get to the restroom when needed. They also have an area outside the restroom to rinse your body off before leaving. Which is a definite plus so you don't have to worry about having sand all over your body when leaving.\nShow less"], ["Reviewed June 17, 2017", 4.0, "Great beach, nice cafes, great way to relax", "If you like surfing, boogie boarding or body surfing, the waves are great. There is plenty of beach, you will find room even on crowded days. The restaurants at MB are varied and I love the boardwalk for running."], ["Reviewed June 8, 2017", 4.0, "All beaches have their different character in L.A area", "Manhattan Beach has a nice vibe, not as touristy as beaches further north.Plenty of opportunities for an decent meal a few blocks from the beach"], ["Reviewed June 6, 2017", 5.0, "Wow!", "Since I had a few extra hours before my flight back home, I took a last minute detour to Manhattan Beach. I’ve been to LA numerous times, but never here. What a great beach town and so close to LAX! Don’t sit in the airport, come here instead! There are numerous public parking spots (bring change), shops, and restaurants. Not to mention a huge, clean beautiful beach and pier that will make you say Wow! I’m so glad I took the turn off 405 to Manhattan Beach Blvd! After a relaxing walk on the pier, and a lovely lunch at The Kettle, I made it back to the car rental return in less than 30 min.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Gorgeous lively beach with a wonderful boardwalk", "I love this area. You can walk the beach or the boardwalk all the way down to Hermosa Beach which is equally fabulous. There are walk-only streets between houses that go straight down from the main drag to the beach and a separate path for bicyclists. There is so much to see, eat and do. One of my favorite beaches.\nShow less"], ["Reviewed May 30, 2017", 4.0, "Great local beach", "This beach is nice and laid back. It not like some of the nearby beaches. It's twice the size of Redondo Beach and not crowded like Venice Beach. If you come during a holiday weekend be prepared for the crowds."], ["Reviewed May 30, 2017", 5.0, "Beach", "Tons of volleyball nets everywhere with people constantly playing. Kids and older adults relaxing and surfing at all times. At the same time very calm and relaxing"], ["Reviewed May 27, 2017", 5.0, "Phenomenal", "Gorgeous beach and scenery. Especially beautiful at sunset. It appears to be some what of a hidden gem as most tourists make their way to Venice beach or Santa Monica, however I would recommend this place to any one who is visiting LA."], ["Reviewed May 25, 2017", 5.0, "Quiet clean beach", "We found the Manhatten pier to be quiet ne beautiful. The aquarium at the end had some different kinds of fish. You can touch the starfish. Had lunch at a pub and took uber to and from. So much cheaper than a cab."], ["Reviewed May 24, 2017", 5.0, "Excellent views", "One of the best areas to visit in Los Angeles. Great homes, restaurants, wonderful sightseeing. The healthiest area of the United States."], ["Reviewed May 23, 2017", 4.0, "Nice promenade walk to beach", "The beach of beach Volleyball. While it's not the most beautiful beach I've seen, where I live is better, it's certainly a nice spot and if you've got a spare $5mil to live on the beach front, you're pretty lucky. It's got a lovely beach front promenade walk with a lower area bike path/walk path as well.\nShow less"], ["Reviewed May 22, 2017", 4.0, "A beautiful beach to enjoy the day", "Its a beautiful beach which is not too crowded and not to lonely. There is a pathway for cycles to ride on and enjoy the waves along. One can go on the pier or sit and enjoy the beautiful sunset. The parking is not exactly on beach just few steps away from beach. Its a wonderful beach to spend your day.\n\nShow less"], ["Reviewed May 22, 2017", 5.0, "Great for a stroll, a night out, or just the view", "My in-laws live in Manhattan Beach, so it's such a treat to come for holidays and family gatherings. It's a great little town with a clean stretch of beach often frequented by surfers and volleyball players -- but still space enough for runners, swimmers, and sunbathers. The pier is a great perch for enjoying the breeze during the day, but it's best at dusk to catch the sunset. And if you want a pretty walk, the Strand is a great walking path with a view. Just watch out for cyclists!\n\nThe town is a bustling place and one of the wealthier, more polished beach towns in the South Bay. You'll find lots of eateries for every budget, coffee shops, and stores for browsing. One family favorite for Mexican is El Sombrero, the original location on Manhattan Ave. The Coffee Bean's fun blended drinks and Noah's Bagels are both great morning haunts. The stores are on the more expensive side, though, so I prefer just to look.\n\nYou'll find most of the action along Manhattan Beach Boulevard from the Strand to Valley Dr., and a bit on cross streets Manhattan and Highland Aves. It's not a big place, but a lot is crammed in there for whatever time you're around.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Stunning views of Pacific", "The beach is family friendly, has very clean water, lot of beach volleyball courts, boardwalk and has stunning backdrop of mountains."], ["Reviewed May 18, 2017", 5.0, "Best Beach in California", "We have traveled from one end of California to the other, along Pacific Coast Highway and seen and camped at as many beaches as possible. This is by far, is one of our favorites. It smells the best and it's has a great bike and walk path. Some beaches smell like rotting whales, others have oil on the sand that stains your feet, shoes and belongings. This beach has a long stretch - a good 5-10 miles of beach walk that bleeds into surrounding beaches: Playa del Rey, Hermosa, Redondo. It can get crowded but not so much so that people are in your personal space. There are beautiful homes that line the strand, a multitude of unique shops and tasty eateries. Nearby Trader Joe's and Wholefoods. It's a nice mixture of down to earth casual and upscale. Everything is on the pricey side and affluence abounds. There's just something about the energy of this beach that we found more peaceful than most.\nShow less"], ["Reviewed May 18, 2017", 5.0, "My place in the States", "I really enjoy it here. Close to LAX with great eating and a lovely beach nearby. Hotels are clean, people are nice and I always have a great time at Panchos. I've been coming here for over 12 years on business and never a regret."], ["Reviewed May 16, 2017", 5.0, "Very nice place to see and to be", "Lived there for many years and just loved it. Beautiful, fun and save place to be. Every time I travel to the US it is a must for me to make a stop there. Great restaurants and bars, all kinds of nice shops and really friendly people all over the place. :)\nShow less"], ["Reviewed May 13, 2017", 4.0, "Great view", "Great view love the activity and people watching. Crowded on a Saturday, but still enjoyable. Love the pet friendly area."], ["Reviewed May 11, 2017", 5.0, "Cooler weather but beautiful", "Loved it there! Great beach (La La Land famous) and upscale area with Bagels from Noah's to die for!"], ["Reviewed May 11, 2017", 5.0, "Great Beach", "Manhattan Beach is one of my favorite beaches to visit. The Pier is awesome and so is the proximity to great shops and restaurants. Easy walk to get food and drinks to take back to beach. Very clean! Love it!"], ["Reviewed May 10, 2017", 5.0, "Chillin", "Sunset at the beach. Does it get better? Small crowds which is a huge plus. Other areas are super crowded"], ["Reviewed May 8, 2017", 5.0, "What a gem.", "I've been to LA more times than I can count but somehow never to Manhattan Beach. This is definitely a spot worth visiting. I prefer it over Santa Monica. Not as crowded, more sedate, and lots to do/eat."], ["Reviewed May 7, 2017", 5.0, "Calm beach, good for walks", "This is more relaxed, more calm sort of place (comparing to e.g. freaky Venice). It's clean and wide. Great place for walks (on colder day) and afternoon or weekend relax."], ["Reviewed May 7, 2017", 5.0, "Lots of dining options to choose from!", "stride along the fresh breeze of air in the seaside of Manhattan Beach. Discover limitless stalls where you can eat and shop."], ["Reviewed May 4, 2017", 4.0, "GREAT ACTION PLACE.", "A MUST PLACE TO visit. Bring you walking shoe. It is a good climb from the beach to any place to eat or shop."], ["Reviewed May 3, 2017", 5.0, "Great place to go if you have an overnight stay at LAX", "The Ocean Explorer bus picks up and drops off at convenient hotels at LAX and takes you to Manhatten Beach for the small charge of $5 per person with kids aged 5 and under free. The Beach is a great way to adjust your body clock if you are overnighting on a long haul trip. Plenty of sun, sand, restaurants and shops all at good prices and loads of opportunity for different forms of exercise there in the sunshine. It is great escape from the noise and busyness of LAX airport. Ask your hotel help desk for the timetable.\nShow less"], ["Reviewed May 2, 2017", 5.0, "Beautiful Pacific Beach", "There were lots of people enjoying the sunshine. It was a cool day so there were lots of volleyball players and bikers. Lots of deep beautiful sand to get your toes into! The sunset was a perfect end to a great beach day."], ["Reviewed May 1, 2017", 5.0, "Nice walk and enjoyed house shopping! If only I had a few million $$$", "Took a long walk along manhattan beach all the way to Hermosa beach. All I can say is 'wow'. Incredible homes tu the whole length of the boardwalk. It's stunning. Still can't believe so much wealth exists. Coming from Montreal, this is considered Amazing. Perfect beach front homes that are manicured and renovated to today's style. Stunning. Beach itself in April is freezing. But we did see an incredible sight, dolphins swimming close to shore! Another 'wow' moment. I would not hesitate going back.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Very cool", "Very chill scenic setting with a paved beachfront street dedicated to walkers, joggers, bikers, skateboarders and so forth. This down screams socal and I love it"], ["Reviewed April 26, 2017", 5.0, "Beautiful place to be", "I was here just for a short while, but very much enjoyed every minute of it. The beach was beautiful, the weather was nice, it wasn't too crowded, we had great ice cream, and even saw a sea lion. The surfers were also nice to watch. It wasn't too hard to park.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Gorgeous seaside community", "We had an afternoon here as a group & loved this sweet little seaside area. Think beautiful old mansions & beach houses & fresh sea breezes! We wandered along the esplanade before walking the length of the pier. We then spent some time exploring the cute little stores & cafes in the streets tucked back from the beachfront. Lovely afternoon in a pretty little area.\nShow less"], ["Reviewed April 24, 2017", 4.0, "Neat and classic California Beach", "IT is not crowded the time we visited. The paved walkway across the beach next to the beach houses is beautiful and wished we had more time to venture. We were restricted due to cooler than usual weather. The pier is an easy and realxing walk. There were lots of volleyball spots. Surfers were in the water on our 2nd day but the break was not so much and the water seemed murkier that day.\nI just love that great beach vibe.\nShow less"], ["Reviewed April 17, 2017", 4.0, "Solid choice!", "There are several beaches to visit in the LA area but this one is a solid choice. It's a bit more upscale than Redondo and Hermosa, but not as busy as Venice Beach or Santa Monica. There's several restaurants and some decent stores for shopping. Also a beautiful beach with a fun pier. It has an aquarium, which we didn't visit. If you're not into crowds, this may be the best beach for you. It's not remote, but not as congested as the bigger ones.\nShow less"], ["Reviewed April 14, 2017", 4.0, "Fun Beach", "We went at sunset - amazing views especially with the pier. We even got to see some seals. The beach was clean. Nice to have lifeguards. Fun to watch the surfers."], ["Reviewed April 14, 2017", 1.0, "Beware of Tar", "I had heard about LA beaches and some pollution but the amount of Tar stuck on the bottom of our feet after 30 minutes of running on @manhattan beach was shocking. We felt sad for the kids who we saw in the water earlier"], ["Reviewed April 12, 2017", 3.0, "Wedding", "Couldn't find beach only walked on pier, saw the beach enjoyed watching surfers. Pier had a small acquarium museum"], ["Reviewed April 11, 2017", 5.0, "great beach, close to airport", "very clean beach and comfortable area. restaurants just up the hill from the beach. Spent the afternoon there watching the surfers, played volleyball, and took nap after lunch. perfect day on vacation."], ["Reviewed April 10, 2017", 5.0, "amazing", "beautiful place for sunset but also for dinner. there's is a lot of people and the neighbourhood is very cool! If you're near LA, don't miss this place !"], ["Reviewed April 10, 2017", 5.0, "Beautiful", "I walked past two piers down th Manhattan beach. They place was filled with people walking, biking, playing volleyball and dog walking. Nice relaxing stroll."], ["Reviewed April 10, 2017", 3.0, "Seems like a cool place", "Woukd have loved to spend time looking around and having lunch, but it was impossible to park anywhere ! Pay attention to cars, bikes and pedestrians as they all come out in front of you without looking."], ["Reviewed April 6, 2017", 4.0, "What a gem!", "We didn't know this place existed until we had a spare 24 before leaving LA. Our accommodation suggested we take the shuttle to Manhattan Beach and it was a lovely beach with the townhouses and quaint shops. We would seriously consider spending a few days there next time we visit. There is an aquarium at the end of the pier and our 4 year old loved it. She got to touch a starfish and look at other marine life. We really thought this was a beautiful place.\nShow less"], ["Reviewed April 1, 2017", 5.0, "Nice beach.", "Pretty beach that was not crowded or rowdy. Gorgeous scenery with nice people. Bring a light jacket, it gets a bit chilly."], ["Reviewed April 1, 2017", 5.0, "Clean and inviting", "This is a fabulous beach to visit. It always appears to be clean and a friendly, chilled vibe. Plenty of places to sit, swim, volleyball and walk. Great to see it is a patrolled beach and I love the surrounding houses - they are so cute!!\nShow less"], ["Reviewed March 29, 2017", 5.0, "Beautiful ocean views", "Whether reading a book, catching some rays, people watching or just taking a snooze, this is a beautiful beach with a lot of reasonable priced parking spots nearby."], ["Reviewed March 25, 2017", 5.0, "Less busy alternative to Venice Beach and Santa Monica", "We had a great bike ride between Playa del Rey and Manhattan Beach.\n\nThere are unique things to see on this stretch, including low-flying airplanes out of LAX, surfers, hang-gliders, and a bird sanctuary. I think I enjoyed this more than Venice Beach/Santa Monica area as it was less busy and easier to bike ride.\nShow less"], ["Reviewed March 24, 2017", 1.0, "Tar Beach", "Tar everywhere from oil spill. You'll step on it without knowing. Good luck getting it off. Strong surf, cold water, visible smog. Litter washing up everywhere. Parking not cheap w/ 5 hour max. No hot water in was stations or bathrooms. High winds when we were there.\nPros: uncrowded in March. volleyball nets set up in very clean sand areas. Picturesque housing. Changing rooms.\nShow less"], ["Reviewed March 23, 2017", 5.0, "Love this place!", "Love cruising The Strand on a bike and watching all of the classic California activities...Surfing, Volleyball, Rollerskating, Skateboarding...Can't get enough of it..."], ["Reviewed March 22, 2017", 5.0, "One of my favorite beaches!", "I have been visiting Manhattan Beach for years. It is a great place for jogging and biking (busy on weekends). You can play volleyball or just watch a game. There are many eateries nearby. It is a great place for kids to play on the beach. I love it!\nShow less"], ["Reviewed March 21, 2017", 5.0, "Great Beach city", "A beautiful town on the water just south of LAX airport. Lots of fantastic restaurants and shops and a beautiful pier."], ["Reviewed March 21, 2017", 3.0, "A Good Beach Close To LAX", "If you have an overnight in LAX Manhatten beach is a good place to escape the airport area.The Ocean Express Shuttle has pick up points along Century Boulevard and the round-trip i=costs $5.00. The beach is large and quite expansive and the town of Manhatten Beach is different to anything else around.\nShow less"], ["Reviewed March 21, 2017", 4.0, "Nice Sandy Beach and Pier", "Took a 'Red Bus' from the front of our Travel lodge LAX Hotel on West Century Blvd.($5.00 US) to Manhattan Beach. Quite a 'yuppy' town with some designer stores and a nice sandy beach and a typical Californian pier. We loved to people watch and enjoyed a nice warm sunny Californian day at the seaside..\nShow less"], ["Reviewed March 19, 2017", 4.0, "Nice stop near LAX", "Manhattan Beach is a massive beach offering bike and walking paths, a nice long pear you can stroll, plenty of sand sport activities such as volleyball, and must offer a nice surf as there were plenty of surfers taking advantage of the waves. There are bathrooms and changing rooms and if you want to grab a bite to eat or have a drink there are plenty of restaurants within walking distance. Perfect spot to watch a California sunset.\nShow less"], ["Reviewed March 19, 2017", 5.0, "Beach", "It always fun to visit the beach at Manhattan Beach and stroll along the strand (walk) and watch the surfers, the very expensive homes along the beach, and the volley ball games.\nAlso stroll along the pier. And watch some of the locals fishing.\nOr just sit on the beach enjoy the time and go swimming.\nShow less"], ["Reviewed March 19, 2017", 5.0, "Reset the clock", "Great place to visit on a lax stopover get some sun and reset the body clock. Go for a walk on the dedicated walkway or hire a bike and take the cycleway both right on the beach. Then walk back on the sidestreets - great examples of outdoor living. Excellent restaurants too. Handy connection from lax hotels on the ocean express.\nShow less"], ["Reviewed March 17, 2017", 5.0, "Clean, family-friendly, not overly crowded", "I visit MB at least 2 weeks every year while visiting family. I spend several hours walking on The Strand or along the water. Close to the pier is where the beach tends to be slightly crowded on weekends. The beach is very large so it's easy to \"get away\" from other people if that's what you prefer. There are a few small public parking areas but they are usually full. It's a great place to people watch, particularly surfers and beach volleyball.\nShow less"], ["Reviewed March 17, 2017", 5.0, "Newest favorite place in the universe", "Manhattan Beach is utterly delightful. Stayed at a wonderful hotel (Sea View Inn At The Beach) and ate at Four Daughters Kitchen. Also discovered a Peet's on Manhattan Beach Boulevard. Always delighted to find NorCal civilization down in SoCal."], ["Reviewed March 16, 2017", 4.0, "Very nice, clean, upscale beach...great for families.", "We spent the day at Manhattan Beach after spending previous days at Venice Beach, Santa Monica Beach and Huntington Beach...MB was our favorite. Nice area, clean, great for families, seemingly normal people (as opposed to Venice Beach, LOL)"], ["Reviewed March 16, 2017", 4.0, "More sun would be nice ...", "But we are here for a couple more weeks. Looking forward to some sunny days. I know the Chamber of Commerce doesn't control the sun. Clean Well protected."], ["Reviewed March 15, 2017", 5.0, "Nice late afternoon walk", "Took a long walk after a 5 hour flight to LA. Beautiful scenery and a great slice of Earth. Enjoyed watching the surfers catching waves and riding them in to shore."], ["Reviewed March 13, 2017", 5.0, "Great Beach,Pier has an area for the children to see live mammals.", "I have gone to see the different fish,crabs,etc. with my granddaughters. It is very educational & the children are able to touch some of the mammals."], ["Reviewed March 13, 2017", 5.0, "Beautiful beach and area", "Lovely walkway for bikes and pedestrians. Beautiful safe beach and lovely area. Lots of lovely restaurants, coffee shops and shops nearby. Love this area ."], ["Reviewed March 11, 2017", 5.0, "Loved this beach!", "Had a great experience at Manhattan Beach with friends. It was a lovely beach, with beach volleyball and surfing.\n\nFun, little shops up and down the main street were fun to peruse. Quite a selection of good restaurants to choose from as well.\n\nBUT, nothing beats the views! Great place. I will be back.\nShow less"], ["Reviewed March 10, 2017", 5.0, "Beautiful!", "Nice quiet and clean beach. Beautiful to walk down and very family friendly. Cute restaurants within walking distance."], ["Reviewed March 10, 2017", 4.0, "Amazing", "Net beach with one of the most beautiful sunset that I had in my life. It worths to be there and spend some time in there"], ["Reviewed March 6, 2017", 4.0, "Bike path along the beach", "There is a paved bike path that runs for many miles taking you by different beaches. The bike paths are flat. If you like people watching, this is an awesome beach."], ["Reviewed March 2, 2017", 5.0, "Wrong week!", "North MB is mainly filled with locals, but is just beach'in! Broad white sands, waves rolling in, a few shivering surfers, lovely upscale bungalos, hundreds walking the Strand, eclectic restaurants, bikers and skaters on the 26 mile bike path, and 4 glorious hours of sun. All of LA at your door step and LAX just 12 minutes away. We're coming back.\nShow less"], ["Reviewed February 27, 2017", 4.0, "Very pittoresk beach town with some very nice restaurants", "Very nice pittoresk beachtown with some very nice restaurants. We we're only there for 1 day and the weather was not that good, so we didn't do much. At the time it was not so crowded, probably because of the weather,. Very nice looking beach. Parking is a bit problematic, only a few spots where you can park for 5 hours. For Dutch standards parking was cheap.\nShow less"], ["Reviewed February 23, 2017", 5.0, "Beautiful walking paths", "We walked up and down the beach path looking at houses on a misty February night. It was so breathtaking!! All the architecture and crashing waves; and very clean sandy beach."], ["Reviewed February 18, 2017", 4.0, "Great place for walk or bicycle ride", "We went for a walk along the water and noticed that there is a bicycle path as well. We wanted to do this the following day but it rained. We will be back some time to check this out"], ["Reviewed February 14, 2017", 5.0, "Best Stroll Ever", "I love long walks along the Strand! Great people and puppy watching. The Strand is clean and very navigable! Great stretch of pristine beach. A short walk to shops and restaurants!"], ["Reviewed February 13, 2017", 5.0, "Down town Manhattan Beach", "This is a very upscale area. There are many interesting shops and restaurants located here along with many interesting homes plus a wonderful beach to see."], ["Reviewed February 13, 2017", 5.0, "Beach Expereince Galore", "Few places along the Southern California beach community provide the experience that MB provides. To begin with there is a beach front sidewalk and bike path (separated) that runs the entire length of the community. Drive to the downtown pier and you will find numerous restaurants and retail outlets that fit into everyone budgets. Parking can be a challenge on the beach during the busy summer weekends but just a few blocks away parking can be located. MB is a very safe community that provides a wide range of community services that are available to all. One of the unique features of MB is the wide beaches which are only rarely crowded because of their expansiveness. The MB pier provides an opportunity for all to wander about 100 yards into the ocean environment--photos under the pier are a must for the visitor. If you want to check out the multi-million dollar homes that line the beach front sidewalk just meander along the sidewalk any day or evening of the week and peer into the windows.\nShow less"], ["Reviewed February 9, 2017", 5.0, "Morning run", "We ran couple times a week here alone with the strand. Quiet and clean every weekday, a little bit crowd on weekend. Kids friendly and you can find lots of restaurant and coffee shops on Manhattan beach blvd."], ["Reviewed February 5, 2017", 5.0, "Very nice, clean beach, excellent restaurants .", "Very enjoyable in nice weather. The pier has nice views , amazing sunsets, enjoyed close by restaurants, ocean view was excellent."], ["Reviewed February 1, 2017", 5.0, "The waves are huge", "The beach parking is a little bit expensive so you might have trouble finding parking on the road go ahead and try to master this technique by downloading an application or going online haha\n\nAs for the views of the beach it's amazing if you're a tourist please note: if you don't have a surfboard or bicycle rentals are around you just have to find them.\nShow less"], ["Reviewed January 31, 2017", 4.0, "lovely beach", "What nice place, not to crowded. Lovely pier and seating area. We enjoyed our visit to Manhattan Beach."], ["Reviewed January 30, 2017", 5.0, "Nice place", "Highly recommended if you want to go biking though several beaches, eat good sea food or simply enjoy the view. Kind of expensive, of course, but using the bike line and the beach is still free!!"], ["Reviewed January 29, 2017", 5.0, "Beautiful beach and sunset", "Great place for watching people and surfers. A clean little town with lots of quaint stores and restaurants."], ["Reviewed January 26, 2017", 5.0, "Great location", "I just stumbled upon this place looking for breakfast. It's a very nice area. The beach and the beach walk were very clean and well maintained. They have some great little shops nearby. Ample parking is available on the streets. Most spots have a parking meter.\nShow less"], ["Reviewed January 18, 2017", 5.0, "Beautiful Landscape!", "The pier area with aquarium is gorgeous. The beach and surrounding area is a sight to see at night. The waves tend to be pretty large, so beware if you plan to take a dive!"], ["Reviewed January 17, 2017", 5.0, "beautiful beach, even when it's co ld", "It was New Year's Day weekend, so it was crowded, but everyone was polite and seemed to be having a good time. It was neat and clean and thankfully the restrooms were open and clean also."], ["Reviewed January 17, 2017", 5.0, "Beautiful", "I came early Saturday morning and it was beautiful! The people are friendly, there were volleyball nets available, surfers in the water, joggers around and the view was incredible. Did not stay for long but there are shops and restaurants nearby"], ["Reviewed January 15, 2017", 5.0, "Perfect for Strolling on a Sunny Day", "Surfing, biking, jogging and walking along the Boardwalk on a clear winter day could not be better. Many casual inexpensive restaurants."], ["Reviewed January 8, 2017", 4.0, "Very nice walk", "Visited MHB for the first time in August 2015. Walked along this area and enjoyed the warm sunshine. Nice views of the beach, surf, and many residences along this stretch."], ["Reviewed January 5, 2017", 5.0, "Great beach community", "This town is a definite must-visit. Beautiful. Clean. With tons of great restaurants and places to hang out."], ["Reviewed January 1, 2017", 5.0, "Beautiful Beach", "I've been to most the beaches in the area and this one is my favorite. There is plenty of food choices, parking and the beach is clean and not too crowded. Definitely stop here!"]]}}