{"Maritime Museum of San Diego": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Maritime Museum of San Diego", "url": "/Attraction_Review-g60750-d104128-Reviews-Maritime_Museum_of_San_Diego-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/08/37/15/the-museum.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1451"}, "address": {"@type": "PostalAddress", "streetAddress": "1492 N Harbor Dr", "addressLocality": "", "addressRegion": "California", "postalCode": "92101-3309", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "A Wealth of Immersive Maritime History", "Visit the San Diego Maritime Museum to really get a taste for the experience of what it was like to be on the crew of an 19th century windjammer ship (the \"Star of India\"), a cold-war-era Russian submarine during the Cuban missile crisis or several other vessels that are now part of the museum collection. The informative and interactive displays give a great appreciation for the challenges of sea life through the ages. The exhibits are well presented and engaging. Plan to spend at least 2-3 hours touring the 10-12 ships and the main museum exhibits on a former ferry boat - the \"Berkeley\". The views of San Diego Bay and the smell of the seawater just add to the rich experience you enjoy at this very unique museum.\nShow less"], ["Reviewed 3 days ago", 5.0, "Great Museum for the young or old! A definite Must see in San Diego!", "The Maritime Museum is a true must see if you’re in San Diego! Located on N Harbor Drive, the museum has submarines, swift boats, River boat, and classic historic vessels. The museum also offers rides on the Swift Boat and the San Salvador! The Swift boat offers daily rides, however the San Salvador only sails on Sundays. Both cost a small extra fee, but are worth it.\nThe museum also has a small gift shop and concession. Hot dogs are the best offering at a reasonable price.\nShow less"], ["Reviewed 3 days ago", 4.0, "Teenagers thought it was \"OK\"", "We went to the Maritime Museum after spending all day on the USS Midway. Our family was a little tired and cold. I probably would give this 5 stars other other circumstances. We spent an hour and 45 minutes because it was getting dark and we were getting hungry. Probably would have spent 2.5 hours otherwise. Glad we went. Star of India was beautiful and fun to go into the Russian submarine. Teens, 13 and 14, say it was \"ok\".\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun", "Great collection of ships From the haunted Star of India to a cold war Russian submarine Well worth the entrance fee"], ["Reviewed 1 week ago", 5.0, "Must see", "Interesting collection of ships, from sail to submarines. The ship used in \"Master and Commander\" is there along with a Soviet missile boat and the USS Dolphin. Merchant ships also represented. Nice museum"], ["Reviewed 2 weeks ago", 4.0, "Sailing on San Salvador", "Was looking for a special experience to celebrate husband’s upcoming midFebruary birthday when I saw an ad for San Diego Bay Sweetheart Sail aboard the San Salvador. Now this was a unique experience sailing aboard a 16th century Spanish galleon!! The volunteer crew of about 12 plus an affable docent gave the 30+ passengers a great afternoon as they deployed the sails and began tacking back and forth across the bay. Also setting sail with us was the Californian, a replica of a 19th century revenue cutter. 300 years difference in these two ships showed dramatic progress in sailing innovation. While the Californian was a dolphin, our San Salvador was a sea cow. Ha!!! Hard to imagine the small galleon would have carried 100 adventurous people plus horses and livestock across the sea so long ago. Was surprised how stable the top heavy galleon felt. Everyone on board seemed very comfortable. (I’m very prone to sea sickness so I made sure to medicate that morning thus had no problem). Highly recommend this unique San Diego experience!!!\n\nNote: As this was a Valentine’s cruise, we were served bottomless sparkling wine, cupcakes, brownie and chocolates. Water and soft drinks were also available. There was a restroom on board.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "An interesting mix of ships with a lot of potential as a museum", "The mix of historic and replica vessels makes it hard to leave MMSD with an overall big picture that the museum is trying to convey. Nonetheless, they have some interesting ships, and if you get out on the water in one of their vessels, whether the swift boat or the replica San Salvador, it's probably a great day. The program on the sub involved in the Cuban Missile Crisis was very interesting and well-executed. The \"museum\" part, which is housed on the lower deck of an old ferryboat is (mostly) dedicated to the maritime history of the region with an abundance of ship models and 1970s-style presentations on the walls and in cases. It would be a great place to have an event because it is incredibly scenic, and the Star of India, with her sails set makes a terrific backdrop.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Combine whale watching, sailing and learning - can't go wrong!", "We got the combination tiicket for whale watching/ sailing on the schooner \"America\" and museum entry.\n\nThe sailing/ whale watching was a once in a lifetime experience. Saw plenty of whales and enjoyed being out on the sea in the sun. The captain and his crew were excellent and very entertaining;)\n\nAlso toured the Russian submarine - fascinating- and The Star of India- a beautiful old 19th century iron ship.\n\nAll in all a great experience.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Several ships with displays on board.", "The main displays are on an old ferry. There are models of ships named San Diego as well as others. The engine room of the ferry is on display. There are also 3 sailing ships, and 2 submarines that can be toured."], ["Reviewed 3 weeks ago", 5.0, "A step back in time!", "Great Museum if you are a fan of nautical history, or just want to learn a little more about it. Exhibits are well done and informative. There is some restoration going on of several of the ships, but that did not disrupt our tour."], ["Reviewed 3 weeks ago", 5.0, "Wonderful experience -- make good wardrobe choices for going up and down ladders!", "Very varied and interesting ships, boats and subs. Employees were full of knowledge and happy to share when asked! :) Great military discounts. Need to wear good shoes as the ladders can get slick. Also, some maneuvering is required to get thru the Russian sub."], ["Reviewed 3 weeks ago", 5.0, "The Best Maritime Museum", "I enjoyed every bit of it. Ancient sail ships to submarines. My favorite is the Russian submarine captured during the cold war with the enacted incident of launching a nuclear warhead. Admire the hero who saved millions of lives. Experience the limited space in a submarine and crawl through to see the facilities inside.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "beautiful historical place", "Very nice place to visit, this promise all guest an unforgetable experience. Highly recommend it, love it"], ["Reviewed 3 weeks ago", 5.0, "Fun Day Exploring Old Boats", "The Maritime Museum was wonderful!!! So many cool old ships and boats, even a couple submarines. The Star of India is very impressive, as is the giant Steamship ferry Berkeley. You get to wander on and through about a dozen different maritime marvels. The Soviet Sub was especially fascinating. a true Cold War relic. The floating Museum is a great way to spend a few hours.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Bob Allen was awesome, such a wealth of information", "We toured all of the boats and ran into Mr. Allen in the boiler room on the Berkeley, we thoroughly enjoyed the time he spent talking with us and sharing the history of the boats, he is an asset to your museum."], ["Reviewed January 24, 2018", 5.0, "Into the past", "Excelllent Museum to look around, ships to explore and submarines to crawl through. Recommend taking the whale watching sail boat from the museum docks."], ["Reviewed January 22, 2018", 4.0, "Next best maritime museum in San Diego", "Recently had the opportunity to visit the Maritime Museum of San Diego and I found it excellent. But as a docent on the USS Midway, I have to rate it below the Midway. Of course I'm prejudiced about that. There's a lot to see and learn about the nautical history of San Diego.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Step into history, and take advantage of the docents' knowledge", "I don't know the difference between stem or stern, fore and aft, starboard or port, but it's all OK here. We went on a group tour with a guide who really was able to make us understand the hardship and difficulty travel was like when many of these ships were built. The main museum, the commuter ferry, The Berkeley, was of particular interest to me, since I'm from the S.F. Bay Area, and this ferry was used there, like several, that were part of every day life. There is a wide collection of ships from different eras, including the Russian sub with a fascinating history from the Cuban Missile Crisis, made this experience unusual.You can clamber aboard and look around as much or as little as you want. There is also the resident \"movie-star\" ship, built as a replica of the H.M.S. Rose, a British frigate, and renamed the H.M.S. Surprise. Peter Weir purchased it from the HMS Rose Foundation in Bridgeport, Conn., and it appeared in the Russell Crowe movie, \"Master and Commander.\" There's also the replica ship that the museum and its volunteers built recently, of the San Salvador, which sailed into San Diego in 1542.\nFor recent history, I spent quite a bit of time at the exhibit on The Berkeley about the Swift Boats, which were built for and used by the military in Vietnam during the Vietnam War (aka by the Vietnamese as the American War), and much more. Even if you don't know much about nautical history, this is one way to pick up some fascinating aspects of American history.\nAltogether, a great way to while away an hour or three. Worth returning to, as well!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great!", "Great experience for all ages! This museum is a must experience in San Diego. Each vessel is an amazing piece of work that has a story to tell."], ["Reviewed January 17, 2018", 3.0, "Fun but a lot of work going on", "We decided to hit this museum before heading to the airport. We spent about 1 1/2 hours here. The Star of Idea is awesome to walk through and the staff were very knowledgeable. One of the submarines was closed as were several areas of other ships due to restoration work being done. In one we couldn't even be below deck for long because the fumes were so bad... but we understood it's an ongoing process to maintain these boats. A lot to see and you could either zip through or read all about various aspects of maritime. Reasonable ticket price as well.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Under appreciated museum.", "We were the only visitors for most of the afternoon we were there. It is a multiship museum that used dedicated docents to add a little extra historical flavor to the exhibits of seafaring.The Star of India is the big draw, but the B39 Russia sub made quite an impression on us in light of the political situation today. The swift boats from the Vietnam War era also brought back memories. There are also replica ships such as the San Salvador, the first large ship to land in San Diego. Another impressive ship was The Berkley, the first Ferry in the San Francisco Bay area. She is moored in the museum after spending her working lif e ferrying people in the San Francisco Bay area. Stained glass windows and Victorian furniture remind us of her elegance when she was in her heyday. save yourself three hours for this museum .\nShow less"], ["Reviewed January 7, 2018", 5.0, "Visit San Diego's Maritime past", "We arrived just as the museum opened and spent over an hour walking through the various ships. The Star of India is very impressive, as is the submarine and other ships. If you like history, you'll like this attraction. It is kept up nicely and the stories abound.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Take Your Time to Visit Here", "I went here with my husband a afew years back. Every evening we went down and went on one or two ships since the ticket was for more than one day. The evenings were best. I love these old ships and the work they put into taking care of them. Go here when you are in San Diego!\nShow less"], ["Reviewed January 4, 2018", 5.0, "What a blast, just imagine what it was like back then.", "Give yourself some time to complete this. This tour is self guided and way more information than you can soak in. Between the old sail boats and submarines. WOW, just put yourself in their shoes back in those days. Hats off to everyone that made those trips. A must do for anybody.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Maritime Museum", "I really enjoyed this visit to the Maritime Museum. $18 will give you access to the submarines and ships"], ["Reviewed December 30, 2017", 4.0, "Lots to see", "We enjoyed visiting all the different types of ships and submarines. We spent about 3 hours looking at everything."], ["Reviewed December 29, 2017", 5.0, "Excellent Museum", "One can spend about 2 1/2 to 3 1/2 hours here exploring several vessels and 2 submarines. A lot of history."], ["Reviewed December 24, 2017", 4.0, "Step back in time", "Very enjoyable. Great history and a wonderful spot for photos. Gift shop very reasonably priced items"], ["Reviewed December 21, 2017", 5.0, "old ships on view", "It was late when we came so we really werent able to go in, but taking pictures outside is fun as well esp. at sundown. Enjoyed the free view and took beautiful pictures for free. A must see in San Diego!"], ["Reviewed December 21, 2017", 5.0, "A visit prior to watching the Parade of Lights", "We have lived in San Diego for 40 years and have never taken the time to see the Parade of Lights or the Maritime Museum. I have to say, the museum was more interesting than I thought and had I known, I would have done this many years ago. There are several Ships that you are allowed to board and look around at your leisure. Take picture of the ships, waterways and city is highly recommended. Take your time and enjoy. The price is around $18 per adult and parking is easy and close.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Great Museum about Ships and Naval Lore", "We booked on line before leaving for San Diego and that saved us a few dollars. This museum is fantastic since you actually get to walk on and through many parts of some ships, some of which are rather old. We especially enjoyed the Star of India from the 1800s and the former Soviet submarine but there are several other vessels that might interest you. Many things are labeled on board the ships which makes it a real learning visit. We spent a bit more than three hours in all.\nShow less"], ["Reviewed December 14, 2017", 5.0, "Many styles of ships and submarines", "We spent a couple of hours going through the ships and subs. Everything was well done with beautiful and informative displays. The museum offers a fascinating glimpse into the sea life and maritime ways."], ["Reviewed November 24, 2017", 4.0, "Interesting assortment of ships", "From Submarines to the Star of India, his is a great piece of history. The cost is minimal and the variety of sailing vessels interesting. Worth a stop."], ["Reviewed November 24, 2017", 4.0, "Very interesting selection of very different ships and boats", "I don't know how they came up with this eclectic selection of vessels but very interesting it is too. The Star of India is perhaps the star of the show as well although personally I was most interested in exploring the soviet era diesel submarine. It was fascinating although I thought the audio history of the cuban missile crisis, while interesting, didn't lend itself that well to the space available and seemed a little disjointed to me. It was hard to get the flow of the events as they were running in a loop and so it was hard to time each section correctly.\n\nHowever this is a minor quibble. All the vessels are interesting in their own right and for a reasonable price one can get to see 6 or so and as I say, they are a varied mix of sailing ships, submarines, fast boat, ferry etc. Not all are open all the time but most seem to be available to tour 7 days a week. The fast vietnam boat was closed when I was there, only being open at the weekends.\n\nThe larger ships have staff to help you and fill you in on the backgrounds to what you are seeing. They are very friendly and knowledgeable. Overall a most interesting museum if you like to go over ships at your own pace (which I do) and there is plenty of time to linger as you go around. Some of the ships are replicas but the main attractions are authentic and the Star of India still sails once a year (maintenance permitting). It's a bit nerdy of course, all these places are, but trying to imagine life on any of these vessels really makes one think and that is the point I think.\n\nNot good for those who find it difficult to get around. Ships are naturally challenging for those with disabilities and this is especially true of the submarines where one is required to navigate small spaces and swing through hatches. It is really impossible to avoid this and indeed, there is a test hatch in order to ensure you can navigate your way through those inside.\n\nI could spend hours here but I was on a time budget. I look forward to returning.\nShow less"], ["Reviewed November 18, 2017", 1.0, "Excellent history of Ships has the California starred in Master and Commander and has submarines, and the Star of India", "This is great and and I believe your ticket can or does include the Midway Aircraft carrier. or visa versa."], ["Reviewed November 12, 2017", 5.0, "Wonderful displays in the museum on the ferry - interesting seeing different style boats", "Plan on spending lots of time exploring all the different boats here - then wander the museum on the ferry. Well done displays. Work is currently being done on The Surprise. The Star of India is the star of the show! Be sure to sit in the cabin and watch the whole movie about her history and how she came to be restored by many volunteers. They offer pirate birthday parties and maritime type classes. We would have liked a docent to answer questions on some of the ships.\nShow less"], ["Reviewed November 9, 2017", 5.0, "San Salvador sailing", "San Salvador at the Maritime Museum is a fully functional replica of Juan Rodriguez Cabrillo's galleon ship that arrived in San Diego in 1542. Sailing on it in San Diego Bay is quite interesting. It takes several people of the crew plus some volunteers to set the sails. The views are great.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Fun Exploration of Ships", "We were in San Diego to see the zoos, and had some extra time so went to the Maritime Museum just to fill in. The Maritime Museum is great and I would recommend it highly. The docents on the ships took time to tell us lots of information about the ships. It was a Sunday, but wasn't crowded. We didn't have time, but you can schedule to go out on a ship if you plan ahead! There was also a kids birthday party on one of the ships -- something I would certainly consider for my grandkids if I lived in San Diego.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Great place", "They have a decent number of old ships including sail powered ships and a paddle boat type ship from San Francisco. It's fun to explore them all and it's great that they were not destroyed. There is a lot of history here. Very nice."], ["Reviewed November 2, 2017", 5.0, "Set Sail!!", "My Husband and I set sail on the Californian, a full sail historical ship, for a sail around the San Diego harbor. It was exhilarating! We were hoping to go beyond the harbor and out to the open ocean, but the wind was not cooperating that day, but there was plenty of room to sail around the harbor and that was spectacular in and of it's self. We were highly impressed that the crew sailing the ship were all volunteers, but worked the ship like a well oiled machine. It was super fun and gave us a good sense of where things were in the harbor and that we wanted to sail some more!\nWe also toured the other boats in the museum and they were quite fascinating to walk through.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Another 'do not miss' museum", "An American Sub, a Russian Sub......the Tall Ships, the Ferry itself, all incredible. We actually went twice during this visit and we still didn't see everything. It's on the list next time we are in San Diego."], ["Reviewed October 31, 2017", 5.0, "Maritime Museum of San Diego", "Really neat place to check out if you got a little bit of time. Unfortunately we did this on a rainy night so we didn't get to go on a couple ships ,but the staff was really nice. I think the best part was getting a chance to check out the B-39 Russian Submarine.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Really quite interesting", "We bought tickets at the door and well worth the entry. The docents know the history and are very friendly. I really enjoyed the ferry boat and the model scale ships displayed The two subs were also fun to explore."], ["Reviewed October 30, 2017", 4.0, "Brilliantly Put Together Old & Recent History", "No point in repeating others. Yes - absolutely great value, terrific array of wonderful ships to wander around, lotsa engrossing and informative exhibitions to absorb. Plus - the Russian Sub is a real blast: videos talk you through the Cuban Missile Crisis in superb detail - and you get a sense of the claustrophbia of it all, back in the days of early subs in warfare. Lots of knowledgeable volunteers add to it all. Really fascinating afternoon.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Great piece of history", "How amazing is it to have access to multiple tall ships and submarines in one location?! This place was worth every cent of admission; very well set-up, with great insight into the early days of each vessel, not to mention the complete story of the Cuban Missile crisis on the Foxtrot submarine. A very surreal experience to see just how cramped it was for a large number of men to live for months on end! Topped off by boarding tall ships that are actually still in operation today and speaking to those who crew them. We were even offered a paint brush and varnish bucket if we wanted to help out (clever way to get some cheap maintenance work done haha)! I'd recommend a visit to this place if you're nearby.\nShow less"], ["Reviewed October 22, 2017", 5.0, "An amazing spot for adults, kids and families", "We have a Company membership with this Museum.\nThus, visiting there frequently. The location, permanent displays and visiting ships are so unique that I've never seen anything like this before.\nA Colombian Navy Cadet training schooner was anchored here in June: magnificent.\nA locally built replica of the original Cabrillo ship from 1540 takes Museum members on cruises. Many regular activities for kids.\nOUTSTANDING!\nShow less"], ["Reviewed October 20, 2017", 4.0, "Very nice if you like old ships!", "I really enjoyed the Star of India. The Russian sub was also interesting but be aware it is difficult getting around in there!"], ["Reviewed October 15, 2017", 4.0, "Hard a larboard!", "Great selection of ships and submarines, from Master and Commander's leading lady, to a Russian Sub. Lots of good information."], ["Reviewed October 14, 2017", 3.0, "Alot is unaccessible", "Part of the ships are closed or under renovation. Overall some great submarines and ships to see. Around two hours tour."], ["Reviewed October 13, 2017", 5.0, "Great Museum, Great Price, Great Experience", "We had a great time exploring the old ships. It was very informative, interesting, scenic, and a great variety of shops."], ["Reviewed October 12, 2017", 3.0, "Plan an hour", "They had a considerable part of exhibits roped off for maintenance. Overall it was interesting to look around but we didn't spend as much time as we planned. I am not sure it was worth $18 per person."], ["Reviewed October 9, 2017", 3.0, "Cool ships!", "It was pretty interesting looking at all the ships! The submarine was cool,but very tight! It’s worth it to do once.we were too late for the Midway,so we will check that out when we go back! San Diego is amazing!"], ["Reviewed October 2, 2017", 5.0, "So Much to See!", "Visited San Diego Maritime Museum yesterday with my 8 and 10 year old grandchildren & their parents. I highly recommend this outing for all ages! The location on the Bay is very scenic & convenient to downtown San Diego.\n\nThe Star of India was my favorite of the restored ships. The kids loved the Russian & American submarines. These are all restored ships along with the beautifully restored ferry boat, Berkeley. Some of the other ships are very convincing replicas. There are many informative displays on the various vessels. At times there are opportunities for an add-on fee to take boat trips.\n\nDuring the month of October, children are admitted for free here and at other venues including the San Diego Zoo, a great deal!\nShow less"], ["Reviewed September 29, 2017", 4.0, "Great opportunity to see historical ships and connect with the sea", "The whole area of the Marina is wonderful. It's a lot of walking and it's an easy take your pace type of a walk. I feel this event is really cool to have kids and families and a broad range of ages, but I do feel like it's somewhat pricey for what you get. The ships are really fun to see in person as they are authentic and huge up close. I do feel if you have a family and are paying for each attraction in and around this gets to be somewhat crazy. I loved the area and I loved the pirate ship and even if you don't pay to go on them , they are docked for all to view!\nShow less"], ["Reviewed September 29, 2017", 5.0, "Very enjoyable!!", "My husband and I visited this Museum as part of our recent trip to San Diego. I didn't think I would be that interested but he wanted to go. It is fantastic!!!!\nThe \"Museum\" is actually a group of (11) old ships including submarines which you can tour and experience life \"aboard\". Very interesting and enjoyable for all ages. Very knowledgeable staff and demonstrators to show you around and answer any questions. Lots of photo opportunities. There are souvenir shops, lots of restrooms and a cafe. Well worth a visit!!\nShow less"], ["Reviewed September 28, 2017", 5.0, "Fun for the whole family", "Some very cool ships to see. Even a couple of cannons fired off while we were there. The kids loved the Soviet submarine, as did we. It's amazing to see the inside of one of those. We spent about 3 hours looking around. We didn't get a chance to check out the Star of India. You could easily spend all day here if you took the time to see and read about every exhibit. Great place.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Wide variety of ships and boats and lots of interesting models too", "This is a must-see on the San Diego waterfront. There are a substantial number of craft of all sizes, including 2 submarines (one Soviet, one US) and several large sailing ships. We saw the recommended time was an hour, but we spent more like 6, and didn't really have time to take it all in. We loved it, lots of history and loads of models and exhibits. If you are a naval history buff this place is what you are looking for. If not, then maybe after an hour you might be done.\nShow less"], ["Reviewed September 24, 2017", 5.0, "MrGGs-Maritime-Museum", "You have to feed parking meters to stop to see the ships, so plan quarters accordingly. The Star of India is the main attraction and well worth the visit. There are other ships at the same location and one admission fee covers all ships. Get your hand stamped for admission on the other ships. If you go through the Russian submarine, be prepared to squat and squeeze through holes about three feet diameter to go through compartments.\nShow less"], ["Reviewed September 24, 2017", 5.0, "A lot of history here.", "Quite the selection of eleven historic ships here from old sailing ships to a Russian submarine. Was very impressed with the history of all of them. Has to be seen to be believed. All can be explored both above and below decks and you can appreciate what the old explorers, merchants and immigrants went through during their journeys. Great photo opportunities all around the ships and you can use the background of downtown San Diego which on a sunny day is breathtaking. A must see when in San Diego.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Beautiful ships!", "We came on a Sunday morning, and found free parking across the street by the park. The ships were absolutely beautiful, and we were happy to see there were 2 submarines to check out as well (a bonus, as my husband served on submarines). It was a lot of walking around, which was hot and muggy, but at the end the sea breeze kicked up and it was a lot more bearable. The models inside the Berkeley were fascinating to look at, but I think my favorite was seeing all the crew quarters in the Star of India. So amazing to think how they lived and worked in those tiny spaces!\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great way to experience history!", "Go inside several historical vessels right in the bay. Tour a US and Russian submarine. Climb aboard the ships like a pirate, but don't walk the plank! Authentic sailor quarters, and period pieces like helmets, shields, and swords from the early 1900's. You can literally spend hours walking through them all!\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great Afternoon for Kids & Adults", "There's a a lot more to this attraction than it appears. There were 3 adults and 3 kids ( 3, 5, 6 yr olds) in our group. We expected to spend about 1.5 hrs but had to drag the kids out 3 hrs later! There are several other vessels, but here's our 3 favorites:Pirate ship had some restoration underway, but kids focused on the cannons. The Soviet submarine, active in Cuban missile crisis, was an amazing experience. NOT for anyone claustrophobic, but fascinating for all of us! Switches to flip, buttons to push, hatches to climb through and torpedoes. Assign 1 adult to read the history and summarize for other adults if you have kids to keep up with! But it's too interesting to miss! Star of India is an old sailing ship. Adults, be sure to look at all the original beautiful wood and glass work, even on the ceiling. Be sure to take kids to the lower level. There's a simulation area for them!\nNotes:\nThey are open till 8PM\nThey have lots of special events that we noted on their website\nAsk when you get tickets if there is a docent (volunteer) on any of the vessels. The gentleman we happened upon was a big plus!\nShow less"], ["Reviewed September 15, 2017", 3.0, "A little too touristy for me", "I was disappointed because this had so many great reviews. I'm not sure what I was expecting but in comparison to other maritime museums I have visited this was my least favorite. Some of the old ships were interesting but I felt like it was just looking at stuff and lacking in the educational department. To be fair there were several signs to read just difficult on crowded days to navigate the small spaces.\nShow less"], ["Reviewed September 14, 2017", 5.0, "these old ships are worth touring!", "Not only do you get to tour the Star of India, but these are very interesting and worth touring. There are several ships to tour."], ["Reviewed September 14, 2017", 4.0, "Lots to see!", "I was in San Diego for work and wanted to do something fun that I haven't experienced before so I decided to check out the Maritime Museum. I came in the evening on a Thursday and it was practically deserted. I only saw maybe 3 other people the whole time I was walking around so I had plenty of time to check things out. You can tour 2 different submarines (be prepared for very small confined spaces!). I was sweating bullets when I climbed out of the first one - not sure how sub crews could handle being in one of those for months at a time! Such tiny spaces!! The second sub was the world's deepest diving sub and wasn't quite as nerve-wracking as the first one I visited (maybe I was better prepared the 2nd time!). You can also tour the ship from Master and Commander, which was neat. My favorite was the Star of India. You can get cool pictures of all of the other pieces in the museum from the deck of the Star of India and it was just overall the coolest ship. This is a great place to spend an hour or two if you like boats and history. Would recommend visiting if you haven't been!\nShow less"], ["Reviewed September 10, 2017", 2.0, "not bad", "The price isn't really good $18. adult which is a lot for just walking around and reading signs on the wall. Not worth that much, staff were not very helpful answering questions. This should be 5bucks to get in at the most. Go to USS Midway instead.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Amazing Ships through time", "Spent the afternoon wondering thru sailing ships, submarines, passenger ships and old revolutionary men of war. Loved every minute of it. Brings to life the history of sailing but also the adventure and showed you up close what life was like on those ships. Being able to see the interiors, living and working quarters even the old cannon was a lot of fun.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Great spot for a quick visit", "We stopped in here while doing the \"jump on jump off\" trolley tours of San Diego and it was awesome. We didn't go on the Midway but we did get a chance to see the larger boats from 1800. Your allowed to touch things (which is cool) and they had re enactments of cannon fire and colonial British soldiers which was also a plus.\n\nThe day we visited there was a fair happening with tons of street vendors outside of the Museum and it was insanely crowded but it was still great. The fresh food the cool trinkets made the visit worth wild. Our only complaint is that they charge for EVERYTHING. Anything extra you have to pay e.g. boat roads just within the bay etc.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Advanced History", "It's quite amazing how much you learn from being on these ships and submarines. From the perspective of the sailor and captain, you get to feel what it was like during those times. This is definitely worth the visit!"], ["Reviewed September 7, 2017", 5.0, "Lots of ships to explore", "Submarine, tall ships, and a big exhibit plus gift store. One price gives you admission all day. Great nautical history."], ["Reviewed September 7, 2017", 5.0, "Boats", "We visited during the Festival of Sail - not sure if all these boats are always here. Lots of walking... We were able to walk onto the boats and visit with the staff and ask questions. Very interesting to walk aboard these old ships and see how things were back then. They had submarines to walk thru also. The museum has lots of pictures and models. Great place\nShow less"], ["Reviewed September 4, 2017", 5.0, "Interesting Exhibit", "Enjoyed the tour, walking through the museum, and the exhibits. You can easily get captured in the history. Allow at least a couple of hours for your visit."], ["Reviewed August 30, 2017", 5.0, "Glad we did this", "With there being so much to see in San Diego, this attraction was one that you can do at a very relaxed pace. There are a number of ships as well as 2 submarines you can visit, and it is just a relaxed atmosphere. They give seniors a break on the pricing. Must add that if you choose to visit the old submarines, that you must have a flexible body to maneuver through them. If you have a hard time getting about, the submarines may not work for you. We especially enjoyed the Star of India as well.\nShow less"], ["Reviewed August 26, 2017", 3.0, "Interesting place", "This place was kinda cool. Some of the boats were more interesting than others, the submarines were the best. It was interesting to see."], ["Reviewed August 22, 2017", 5.0, "Great museum!", "We really enjoyed learning the history of the Star of India. We took a relaxing 45 minute boat tour of the Bay.(Great price $7 ea.) Our tour guide was friendly and informative. We went to the Maritime Museum early morning - parking was no problem."], ["Reviewed August 19, 2017", 5.0, "8 Ships to Climb Aboard....allow yourself a few hours! Very fun", "After touring the USS Midway last week, we decided to make a day of it and tour the Maritime Museum, since it was something I/we always wanted to do. It cost us $18/per person, for two adults, so $36. We spent about 3 hours here. The Star of India ship is boarded separately and is just a few steps away from the Steam Ferry Berkeley, which is the ship that you board to access the other 6 ships, the cafe and store, and all of the exhibits. My favorites were the story of the Russian sub (watch the videos, I never knew that this situation occurred), and the San Salvador, which is a highly accurate representation of a 1542 European ship (Spanish maybe?) that looks like a pirate ship. It was very fun! I suggest comfortable walking shoes for sure, as you have to walk narrow metal stairs, some over water, narrow planks to access the ships, walk down narrow wooden stairs (and up) on the ships, and practically crawl in the subs (I'm slightly exaggerating but you will see what I mean!)\nAs a tip, the cafe is more of a stand that sells chips and bottled drinks. It was hot in the subs, so I am glad a brought a bottle of water, and I wish we had not been starving, because we left to head to dinner or we would have stayed longer.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Interesting history", "I spent a couple of hours exploring the ships moored here. It was fortunately very quiet so was enjoyable absorbing the interesting information displayed. The vessels are varied ranging from The Star of India Clipper to both Russian and US subs. As a fan of the movie \"Master and Commander\" I was rather taken with be able to board HMS Surprise which featured in the film.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Plenty to see", "A couple of pirate ships and two submarines plus a museum inside another ship rounded out this tour. The Soviet sub was my favorite because it was so unique. Small spaces had to be navigated (be sure to pay attention to the display outside with a large \"O\" that you should try going through before entering), but very interesting. Video tells the story and history.\n\nThe pirate ships have displays of period relics to give visitors an idea of how people lived. Be sure to visit the museum (two levels of displays) before leaving.\n\nTickets are $18, which is high.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Kids loved it", "The museum offers several ships to board including one of the pirate boats featured on the movie: Pirates of the Caribbean and also a submarine.\n\nThe submarine does require climbing steep stairs and entering through smaller entries so good to keep in mind. We had a baby with us and it was too difficult to walk her through the submarine.\n\nThe staff seemed a little on the stern side the day we visited making unnecessary comments. Other than that, everything about this place was fun. My kids who were 10 and 11 really got a kick out of touring the boats.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Well worth the visit!", "Very cool to tour the different ships and see everything up close! It was like taking a step back in time. We got there at 7:45 pm and they close at 9 pm, and it was perfect timing because we had the place to ourselves, no one slowing us down and had just enough time to see everything.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Take the kids!", "Our 11 and 12 year old really enjoyed these ships! The staff is friendly, funny and informative and the ships provide a great way to enjoy San Diego's beautiful weather while also taking in the sights. We spent a couple hours here but the tickets are good all day so you can easily start with a few ships, get lunch and then come back, if you like.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Historical Vessels adding to theLore of San Diego", "This is an inexpensive and very educational way to spend 1/2 day on the water of San Diego Bay. There are 9 vessels that you board and wander about on a self guided, at your on pace tour. The vessels range from a replica of a schooner from the 16th century to the America, the vessel that won the first race that would become America's Cup in 1851. There are submarines to clamber through, an American and a Soviet diesel boat. There is a museum in a retired ferry boat and you may head out on the water in a Vietnam era swift boat or an historic harbor pilot boat. Well worth an afternoon.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Star of India is the highlight", "We particularly enjoyed the Star of India and the submarines. The Star of India has a lot of information to read about the very interesting life of the ship."], ["Reviewed August 7, 2017", 4.0, "Fun!", "With the purchase of a ticket, you get to tour 2 submarines (a Russian and an American one) as well as 4 historic vessel. I never been into a submarine, so -for me- that was the best part. Price is reasonable, so I would definitely recommend stopping by.\nShow less"], ["Reviewed August 6, 2017", 5.0, "History of ships in review!", "Such an awesome experience seeing the Star of India and then followed by a Russian sub, several other sailboats and then an American Sub, and of course the Ferry boat.\n\nThere was a gentleman on board Star of India who introduced us to various posts on board the ship as well as a brief history of this ship.\n\nThis is definitely a on-water walking tour. Be prepared to climb up and down, and squeeze through narrow spaces. If you're claustrophobic, you may want to skip the submarines.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Very good museum, but several ships may be unavailable at any given time", "This museum is really a collection of historic ships, actually a pretty broad selection of ships: a couple of submarines (one American, one Soviet), a gilded age steam yacht, a ferry boat, a replica of a Napoleonic era warship, a replica Mexican War era revenue cutter, a civil war era sail merchantman, a replica America's Cup racing yacht, a replica of a 16th century galleon, and a Vietnam War patrol boat. Couple this museum's collection with the nearby USS Midway, and someone can get a pretty good appreciation of maritime evolution over the past half a millennium or so, which is quite an achievement for an afternoon!\n\nThe starting point for the visitor is the steam ferry Berkeley which houses a small museum and the museum gift shop. The museum covers a lot of marine history of the San DIego area - as one might expect, it is heavy on naval history from the Mexican War (which is how San Diego became part of the United States) up to the present. They have a number of ship models and artifacts on display - including some nice coverage of out personal favorite period, the Great White Fleet era. Fishing, lumber shipping, etc. are also covered. The visitor can then tour those ships that interest him. The only rub is not all ships are open for touring (like the replica of the racing yacht America) and, at least when we were there, some others were closed for maintenance or being used for private functions (which is why we rated this a 4 \"star\" attraction instead of 5), but overall it is still a great way to spend a couple hours.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Many beautiful ships and submarines, with a part of oacean history on the top!", "I am so lucky that I have a boat nerd in my family, and that gives me the opportunity to see things I have never seen or heard before.\n\nThe beautiful HMS Surprise that was used in Master and Commander is a pearl to look at, and the Submarines B-39 and USS Dolphin where so cool to stay inside and be a part of. In the B-39 they have a made it as a story to tell where you get to hear the situation that the Russians where in at the Cold War hidden deep in the ocean and with no possibility to contact the surface. Just to experience the small rooms and the lack of comfort they had was very breathtaking.\n\nThe beautiful San Salvador was a peace of art, and so many wood details on the steam ferry Berkeley, a hidden treasure! And of course the Steam Yacht Medea that was a gunboat for the French during the World War I. Owned by members of the Parliament she often cruised the Mediterranean Sea, and she is still a piece of art!\nShow less"], ["Reviewed July 30, 2017", 5.0, "Lots of Nautical History", "We had always wanted to see The Star of India and finally had the time to do so. Great price to see it and your all the other ships and submarines. They stamp your arm so you can come and go all day, which is nice if you want to go get something to eat nearby instead of rushing to get through them all. That is the only down side that there is not a restaurant extremely close to the museums. There is however a small food cart with coffee drinks, smoothies, muffins, fruit, water, soda, chips and hotdogs. There is a lot of reading you could do to take hours or you could get through them all in about 2 1/2. Depends on how thorough you want to be and if you have young children. If you are claustrophobic you may also not want to tour the submarines, but I'd recommend doing so otherwise. The staff were all extremely friendly and informative. Definitely recommend.\nShow less"], ["Reviewed July 30, 2017", 3.0, "Subs are really small!", "We purchased a sunset sail onboard the sail boat America and visited the Maritime Museum first.\n\nThere is a lot to see, even though not all vessels were accessible when we visited. I think there's some work that could be done there to make it a more pleasant experience, but we still enjoyed walking through the crowded subs and other vessels.\n\nI would think little kids would get bored easily. The staff we did run in to on the different boats were very helpful and informative. We spent hours there and my husband probably could have spent longer!\nShow less"], ["Reviewed July 24, 2017", 5.0, "Very Educational Experience", "This museum on the waterfront includes two submarines N SF ferry, a swift boat a square rig ship plus a series of smaller vessels. Certainly not a load of dusty sryifacts"], ["Reviewed July 19, 2017", 5.0, "Awesome Display of Historical Ships", "This is an awesome museum as you can see the Star of India and other ships on display. It is fun to visit as you can see how sea merchants lived in the early days of sailing."], ["Reviewed July 19, 2017", 5.0, "Wonderful Day In San Diego", "Beautiful day with some friends and their young children in San Diego today. The Maritime Museum was wonderful it was a good very exciting time for the young children who were with us there was a lot of oohs and aahs. It was a wonderful family day is a great place to go with children and adults of all ages.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Submarines and ships", "Spent a few hours at this museum. Board the old and interesting submarine. Tight quarters and amazing history. Cool ships and museum."], ["Reviewed July 18, 2017", 5.0, "Awesome Collection of Vessels", "This is a super collection of sea vessels. Self-guided tour, so you can go at your own speed and take as much time as you want exploring each. I've been to numerous seaports where there may be one or two vessels docked for tours but this is by far the most extensive I've seen. Many of these ships have been painstakingly restored or rebuilt. My 9 & 12 yr old Grandchildren loved it. The Russian Nuclear Sub from the Cold War with Cuba was a really fascinating history lesson. Allow at least 3 hrs so you don't have to rush. Metered parking available nearby.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Maritime Museum Tour", "Very nice Museum, self paced, definitely could spend the whole day here. The ferry boat from the early 1900's is full of history, with multiple exhibits & replica's of ships etc. One can also tour the engine room & other surprise rooms underneath. Our favorite vessel was the soviet submarine, it has an awesome story & is one of a kind!!! There is an example of the subs door at the entrance you should climb through to see if you can fit going through the tour. Also, the Star of India was spectacular, really fun to explore all the decks & the volunteers were happy to answer questions. We opted for the $7 harbor tour in a pilot boat which was awesome & very informative, the guide tells all about San Diego Bay, well worth the money. Groupon offers discounted tickets.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Wonderful way to spend the day", "The many exhibits at this great little Maritime Museum - diverse, interesting and just plain fun. Lots of local seafaring history along with the Bristol Exhibit - the Star of India - this is a great way to get educated without boring anyone - our Maritime History condensed !\nShow less"], ["Reviewed July 10, 2017", 4.0, "A must see", "Fascinating! I wouldn't say I'm a \"boat person\" but this was something I think everyone could appreciate. I like the variety of boat to look through. There was the Star of India sail boat and a couple of submarines even. Of course with all of them in soem intriguing history.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Exceeded Expectations", "We have been to San Diego 5 times and walked by this museum so many times without going in. Finally this time my maritime-history-loving son begged enough that we gave it a try. I am happy we did, as this exceeded our expectations and was a GREAT few hours for our whole family.\n\nThe flagship, the Star of India, is immaculate and really enjoyable to walk around. Below decks is a great museum covering several famous ships and the history of the Star of India herself. It is a beautiful ship.\n\nThe rest of the ships were all interesting as well. The Russian Sub has a little interactive program about the Cuban Missile Crisis, there are a variety of ages/types of ships and you are able to board almost all of them to explore. The museum inside the ferryboat was really well done, and we especially enjoyed the lower level exhibit of model ships.\n\nWell worth the money for anyone who is interested in maritime history or just likes ships! :)\nShow less"], ["Reviewed July 5, 2017", 5.0, "Pretty cool for History Buffs", "I absolutely loved this as I love history. My boys loved it too. The wife and girls where less impressed. Overall I think it was a good place to take the family. It is fairly affordable."], ["Reviewed July 5, 2017", 5.0, "Fascinating!", "Had to see as much as I could in only two hours, so I concentrated on the Star of India and the Russian sub. The film presented in the latter was a story I had never heard. To be in the actual vessel that came so close to triggering a nuclear disaster was mindblowing. Will revisit next time I'm in SD.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Really cool boats", "My kids loved exploring all these boats. You can go at your own pace. We went first thing in the morning and basically had the place to ourselves to explore."], ["Reviewed July 4, 2017", 4.0, "Add harbour trip", "Not the best preserved boats and subs but worth a look. Best bit is the optional add on harbour ride. John and John (no kidding) our crew are very informative and fun guys. As it's a small boat you get a real feel for the harbour. This alone was worth the cash.\nShow less"], ["Reviewed July 4, 2017", 4.0, "My family loved it!", "Great place to visit with kids and family. There are ships from various eras docked here (replicas and original too!) that you can walk in and see around. My favorite was the B59 submarine (real one) and Star of India which had miniature ships exhibited inside. My kid loved hoping on each ship and checking out different exhibits. Great work by the Maritime museum team in maintaining these gems!\nShow less"], ["Reviewed July 4, 2017", 5.0, "So much fun stepping back in time!", "My 6 year old LOVED this!! A bit pricey but a great experience. I love anything hands on with history and this was great! Loved learning the history of each ship, teaching my daughter about it and getting extrabits of info from those who worked the ships!\nShow less"], ["Reviewed July 3, 2017", 5.0, "So cool.", "This was an absolutely amazing experience. All of the different ships were so awesome to wonder through. The submarines were nothing like I expected. It was amazing to see what they are like inside. To see how the crew lived on board. My daughter and I truly enjoyed this museum.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Fantastic", "What a great way to spend the day in san diego. History education fun for the family Good for tourists and locals.loved it"], ["Reviewed July 3, 2017", 5.0, "Ships, Ships, and more", "Star of India is the main attraction. Still considered an active sailing ship. It was closed the afternoon we went as they were having a party for supporters, but the nice ticket lady gave us a raincheck so we could come back the next day which we did.\n\nThere are 2 subs, one Russian the other American, other ships of various kinds. The temporary exhibit \"Swift Boats\" is the one that grabbed by attention. These boats were used on the coast and rivers of Viet Nam.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Perfect Way to Spend the Day", "Awesome way to spend an afternoon. I highly recommend doing the pilot boat tour for only $7 add on. Super informative and funny. Older kids will especially enjoy."], ["Reviewed June 28, 2017", 5.0, "Maritime Visit", "We took our daughter and her boyfriend and they were even interested in the ships displayed. They had 2 subs that were really cool to check out. If your tall it's a little tight for you, but I think it's worth it. You get to see how they lived in these little subs. There are couple Spanish stylenships that were pretty cool. They are open late too so you don't have to rush to get there. We did this tour and the Midway all in the same day with time left over. It's a good outside tour on nice weather days. Weather was perfect for us.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Loved it!", "We got going later in the day and were thrilled to discover that this was open until 9 pm! We got to spend all the time we wanted. 4 sailing ships and a soviet submarine! Wow! We spent 4 hours and did not get to see everything. Want to come back and get a ride on one of the boats!\nShow less"], ["Reviewed June 26, 2017", 5.0, "Extremely Interesting, fun, adventurous and historical!", "We took our daughter and mother on this tour and they both loved it! There were seven ships and a submarine you could walk down into and all over on and read and learn about their purpose on the seas. For an extra $7 per person, we got a 45 minute tour out into the bay on a boat that was so enjoyable and gave us an awesome opportunity for some great photos! We will do this again, thoroughly enjoyed all of it!\nShow less"], ["Reviewed June 21, 2017", 5.0, "Great museums.", "I love the submarines as my husband was an American submarine captain. You get to see a Russian submarine and their sub par boat! And you get to see other boats and a great American submarine."], ["Reviewed June 21, 2017", 5.0, "Really cool", "Very very informative. Audio interactive. Easy to get to. Doesn't take long to visit and yet get a great experience. Overall well worth it!!!"], ["Reviewed June 19, 2017", 3.0, "Not so good", "Visited with family, two children, 8 and 9 total $52\nThe hms surprise was nice on the outside, once onboard, pretty sad. Parts of the ship were cordoned off, tools laying about, yellow tape. The inside worse, stuff piled about like seat cushions and assorted items, seemed used for storage!\n\nB-39 soviet sub looked rusty on outside, once inside looked better, tv intro to historical role, torpedo room interesting. Rest of sub ok, many conduits cut off, but certainly a missed opportunity to label items and help visitors understand what they see. How a submarine works. Once outside on tail side, realized how long it is and rudder section seems to be rusting off.\nCollection of small boats nice, again a missing opportunity to teach visitors about sailing basics and names and function of parts.\nSan Salvador galleon was awesome, nice replica, sailable. Missed opportunity to teach about sailing and life in a galleon, again.\nThe Medea quite nice, lovely yatch early 1900s. Missed opportunity to teach about improving engine technology and steam engines\n\nUSS Dolphin, nice more modern submarine. No access to bottom part. Lost opportunity to teach how submarines work, ballast, periscope, etc\n\nSwift boat was off limits. Looks nice, Vietnam era combat boat. Fake 50 cal onboard, no other visible armament , no info. There was a nice exhibit with photos inside the Berkeley about swift boats\n\nBerkeley looks impressive, large ship, steam powered. Is full of exhibits, scale models, small boats and various historical pieces.\n\n\n\nShow less"], ["Reviewed June 18, 2017", 5.0, "Awesome Place!", "Outstanding Maritime Museum for young and old! Well worth the visit. If you are retired military they give a nice discount which was appreciated. Being a retired submariner, I have to say that the two subs were the best. The old Russian boat was definately something to see! Before you go on it there is a sample hatch outside for you to actually walk through. I strongly suggest that you do this prior to going on the boat since it is a very tight squeeze and difficult on your back. Having to crouch down and go through these, at least 6 of them, as you tour the boat can be difficult so it's better to know prior to going on there. Might be rough if you have a bad back. So try the one outside before going on! It took us a couple hours to go through the entire museum and we enjoyed every second of it!\nShow less"], ["Reviewed June 17, 2017", 5.0, "many memories thank you", "I Had read about the USS Dolphin in previous books, I served on three US Navy ASW ships chasing russian subs, and had seen the San Salvador on TV being recreated\nI also display US flags at historic sites\nThe real gem was the USS Chicago CG-11 The ship served on many moons ago\nwhile stationed in San Diego\n\nWell Worth the Visit\nShow less"], ["Reviewed June 14, 2017", 4.0, "Great boat museum with additional tour of bay", "This museum is located on serval historical boats and gives you the chance to both learn information and explore the boats. It has a great selection of boats with interesting histories, including a ferry boat, an American submarine, sailing ships and a Russian submarine. I found the histories interesting and appealable to both adults and children.\nI would definitely recommend the additional tour of the bay on the pilot ship, especially if it's a nice day. For only a few dollars extra you can see some amazing views of the city, learn some interesting information about the navy and cargo ships, and possibly even see some sea lions.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Something for the children", "There are a variety of historic vessels tied up alongside. And there are parts that young children can enjoy with a mini pirate ship in e Star of India plus a full size pirate ship - that's what it was decided to be by the 7 year old. Even the submarine was good for the young. The history behind the vessels was informative and the role they played in history was appreciated. The sub was a highlight.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Boats were made of wood, the men were made of iron...", "Come and see just how it used to be, and get a perspective on the technology, of the time. As a sailing enthusiast, and a student of nautical history, this attraction did not disappoint. Walk the decks and experience sights, of days gone by."], ["Reviewed June 10, 2017", 5.0, "Fascinating tour of historic ships.", "A wonderful place to explore various historic seafaring vessels. The Star of India, a Russian sub and many more. You can take your time and view at your leisure, a hand stamp ensures you can take a lunch break and resume later. Very worthwhile stop."], ["Reviewed June 9, 2017", 5.0, "Both interesting and informative", "Excellent collection of old ships. We only had about 3 hours to explore the ships and take the harbor tour but will likely come back to spend more time there."], ["Reviewed June 7, 2017", 5.0, "Enjoyed", "I really enjoyed seeing all the ships and being able to go through the submarines. Decent prices and discounts available for students and seniors."], ["Reviewed June 4, 2017", 5.0, "Great value, very interesting.", "We arrived here as part of the urbanadventurequest and to my surprise, the kids really wanted to stop and check out the various ships - especially the submarines. We really enjoyed walking around each of the boats and I thought it was well worth the entry. Kids even learned a bit. ;)\nShow less"], ["Reviewed June 4, 2017", 5.0, "Great 1/2 day addition", "We were looking for something close to do to our hotel on a Sunday morning and decided on the Maritime Museum. It entertained our family of 5 for hours. We underestimated the \"coolness\" of this 9 boat floating museum. It mixed history with the touch and feel of real boats we could explore. All the staff was super friendly and very knowledgeable. It's all self guided so you can flex your time. We added a harbor boat tour for $7 each and got a 45 minute boat ride to take in all the Navy boats, Coronado island, the bridge and a bit a San Diego history. All five of us really enjoyed our morning.\nShow less"], ["Reviewed June 2, 2017", 4.0, "This Was Fun!", "I'm not into boats but visiting the Maritime Museum of San Diego did make me like boats/ships/submarines. Going inside the ships/submarine and reliving what it was like when it was sailing brought you back in time. It was like you were there. I did feel a bit of a presence in a couple of boats. Not surprising since it has historical significance. I would actually visit again. Not bad for the money. Good place to bring kids/the whole family.\nShow less"], ["Reviewed May 24, 2017", 3.0, "Interesting ships but overpriced", "We enjoyed touring the ships but felt the cost was too much for what there was to see. Especially compared to the Midway museum. Would have skipped it. We enjoyed the pirates!"], ["Reviewed May 23, 2017", 4.0, "Maritime Museum", "We went through 4 of the ships. The first was undergoing renovation and most areas were closed off. The others were very interesting. I don't get many chances to tour a submarine so it was an experience. Great for an afternoon on the harbor ,"], ["Reviewed May 23, 2017", 5.0, "Great museum fun and educational.", "We went to the Pirates Day's and had a blast. We will definitely be getting memberships! Loved the soviet submarine tour and the others view able from the Berkeley. The Star of India, Berkeley, Californian, and the HMS Surprise were all open. Unfortunately because of the time of the different events for Pirate's Day, we didn't get to see everything. The 40 minute cruise on the Californian was great!\nIf you're in San Diego, at least go to the harbor to see them. Even if you don't have time to explore the ships.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Submarines", "Although some of the ships were being worked on so you could only view the outside, the submarines were very interesting. If you don't like tight places, you may need to pass on this one. They were very interesting, as were the older sailing vessels."], ["Reviewed May 21, 2017", 4.0, "Great museum with lots of things to ser", "I was surprised at the variety of boats and ships at this museum. A single admission gives one access to the museum, which is a former steamboat, two submarines, two tall ships, and many other boats, etc.\n\nThey have a Vietnam era Swift Boat, and for a small fee, they offer a very fun tour of the harbor in the Swift Boat. A tour of the harbor also is available on a pilot boat. This museum is a very good bargain for what one can see.\nShow less"], ["Reviewed May 20, 2017", 5.0, "Fascinating", "It was really interesting to be able to walk about, unescorted, on so many different types of boats/submarines. There was always someone available to answer any questions. We spent over two hours there and would have stayed longer if we didn't have another appointment. Highly recommended!\nShow less"], ["Reviewed May 18, 2017", 5.0, "Interesting step back in time", "We were told not to worry about seeing this museum because it wasn't worth it, I completely disagree. The tour of the ships and the submarines was really interesting and the trip around the harbor in the pilot boat was well worth the $7 extra.\nThe Star of India and the Russian submarine were my most favorite to tour and if that was all that was there it would still have been well worth the visit.\nShow less"], ["Reviewed May 16, 2017", 4.0, "Nice variety", "Good variety of ships. If you haven't been in a submarine this is your chance to see some older ones."], ["Reviewed May 12, 2017", 5.0, "A Relaxing Tour of Ships off Embarcadero Walkway", "Although we spent almost 2.5 hours touring ships, we could easily have spent another 2.5 hours leisurely walking through these ships on our self- guided tour.\nThe Star of India was my favorite ship because it really was a museum with many descriptions of how the British used it as a passenger ship, and the Alaskan salmon fishermen used it later.\nMy husband really enjoyed the B-39 Soviet attack submarine, active during the Cold War (1962). There is a very helpful video to watch when you first climb down the stairs. The three holes you have to climb through, however are small and a bit difficult to get through if you have a hip rotation problem or can't bend easily.\nThe HMS Surprise had a man to explain this replica of an 18th century Royal Navy frigate just as you walk up the ramp to board the ship, a much smaller ship that most of the others.\n\nThe San Salvador, under the command of Juan Cabrillo in 1542, is now a representation of the vessel that arrived in San Diego. It was being up-dated for a voyage up to Santa Barbara , so we couldn't board it. However, we did read all the descriptions about it along the dock.\nThere are other boats/ships in dock: The Pilot, the Steam Ferry\nBerkeley, the Dolphin, the PCF 816 Swift Boat, the Medea, the Californian, and the America. Some of these ships/ boats go on short voyages up the coast, so not all of them might be there at any given time.\nWe thought it was a great way to spend part of the day and well worth the $16 ticket per person.There is parking at Seaside Village. We used it and got validation of our parking ticket, but it still cost us $14 to park. And, it is a rather long walk from there to the Maritime Museum.Otherwise there might be parking along the curb for Harbor Drive.\n\nWe later walked to The Fish Market several blocks away for a late lunch and had excellent seafood.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Quirky fun outing", "When my daughter said we were coming to this museum I expected an old building with lots of dry displays. Not so! This is more of a \"collection\" than a museum. True, there is a dry-docked ferry with lots of models of ships from many eras, but the most fun for me was wandering among the various ships at dock. How about crawling through a Russian submarine with an exciting video presentation about the Cuban missile crisis? Or perhaps you'd like to go on the actual British frigate used to film \"Master and Commander?\" They have the world's oldest active sailing merchant vessel, lovingly restored, and even a replica of a Spanish galleon. Fun for all ages.\nShow less"], ["Reviewed May 9, 2017", 3.0, "Star of India was great!", "My husband and I saw the Maritime Museum and Midway on the same day. The Maritime Museum is a museum as well as a group of different ships that are open for viewing. The Star of India was amazing but I was not impressed with the other ships. One of the ships was not even there! This attraction was worth seeing but I would not go back again.\nShow less"], ["Reviewed May 7, 2017", 5.0, "The Star of India is worth seeing even if you don't have time to go into the ships", "I was only here briefly for a break during a conference, but this area is definitely worth seeing. If I'd had time, I would have taken the ship tours. Beautiful to see the Star of India in the harbor."], ["Reviewed May 6, 2017", 4.0, "Almost a Dozen", "In addition to sweeping views of the harbor, a visit to the Maritime Museum includes entry to 11 types of vessels for 1 price; unfortunately, the day we visited only 5 were open to the public. Yet we enjoyed getting a taste of shipboard life from the Star of India and Medea. Do do leave time to see the permanent and special exhibits in the Berkeley. Tip -- as your map includes coupons for sailings, the museum shop and a pirate party, don't discard it before checking out their gift shop (unique items) with an adjacent patio coffee shop. Also, there are summer concerts on deck and also 3 different types of boat rides (Swift, Pilot, or Tall Sails) for an additional cost.\nShow less"], ["Reviewed May 6, 2017", 3.0, "Would have been better if there had been access to all of the ships.", "It seems pretty obvious that you would only be going here if you had some interest in ships or history. Keeping that in mind there are some great exhibits here and some that could be skipped.\n\nThe Star Of India was excellent with all kinds of interesting pictures and information.\n\nAlthough the Berkeley ferry is falling apart on the outside and looks like a pile of junk the inside was surprisingly nice with good exhibits.\n\nBoth of the submarines were poorly maintained and did not seem to have a whole lot of information. The area to walk through was limited to one level in both of them. I had been to the USS Cod in Cleveland years ago and it was hands down better than both of these. This was a real disappointment.\n\nThe America, San Salvador, Californian, Swift Boat and Harbor Pilot were all roped off with signs that said \"Crew Only\" so we couldn't even board any of them. That seemed like a bit of a bait and switch. The website specifically implies in several places that admission to the museum includes access to all of the ships.\n\nThe Swift Boat exhibit on the Berkeley was excellent. A very nice tribute to the men who served on those boats in Vietnam.\nShow less"], ["Reviewed April 27, 2017", 4.0, "Worth a stop!", "Several different boats/ships/subs make this an interesting attraction. We enjoyed learning about the boats, some of the exhibits could have used some refreshing - but all in all a good spot."], ["Reviewed April 26, 2017", 5.0, "Great Time", "We went to the San Diego Maritime Museum on Sunday, April 23, 2017. We had such a great time touring all of the ships and submarines. We also took the 75 minute Swift Boat tour of San Diego bay. We had a great time. Totally recommend for families and veterans. The costs are very reasonable for what you get. Be sure and schedule 2 to 3 hours to visit everything. We purchased our tickets online so all we did was present the printout.\nShow less"], ["Reviewed April 23, 2017", 4.0, "One of the most interesting maritime museums we have seen", "Very nice visitor friendly museum - easy to visit and interesting. It maintains and operates old historic vessels which is an additional attraction and worthy form of operation. We found the outdoor portion of the museum visit especially interesting. Star of India is the world's oldest active sailing ship.\nShow less"], ["Reviewed April 22, 2017", 4.0, "Very interesting", "My husband and I really enjoyed boarding the the Star of India, extremely interesting giving a view of travel to NZ under very harsh conditions for crew and passengers.\nThe other highlight was going onto the Russian submarine. Can't believe how people lived in those very cramped conditions. Shari g a tiny bunk bed for extended periods of time\nShow less"], ["Reviewed April 16, 2017", 5.0, "Fun, educational, and not expensive!", "With our daughter and 12-year-old grandson who were visiting from out of town we enjoyed wandering the decks of great old ships, learning about their history and the process of restoring them. The tickets are very reasonable, and the surrounding embarcadero area is also fun and interesting.\nShow less"], ["Reviewed April 15, 2017", 4.0, "An Interesting Look at Old Ships", "The Maritime Museum was an interesting exhibit to visit. There were various boats to walk around on to include an old Russian Sub. The tour was not that expensive and takes about an hour. It was something different to see. It is located close to the Midway Exhibit.\nShow less"], ["Reviewed April 15, 2017", 4.0, "Hidden Gem", "We stopped by here after visiting Midway Museum. Picked it 'cause it's close by and I would suggest parking at the Navy Pier by Midway and then walk over. It's actually quite interesting, being made up of several ships & boats linked together. There are 2 subs you can get into, 2 tall ships and a couple others with interesting displays. If you or your kids are into model ships, this is great. Unfortunately mine weren't as keen and they may have been a bit tired. But think this works great as it opens a lot later than Miday and is the perfect stop after Midway.\nYou can probably spend 1-2 hours here. More if you look at every single detail.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Such a cool museum", "This was a really cool activity we did just in the moment they had some really interesting and fascinating ships I'd recommend a visit to everyone"], ["Reviewed April 14, 2017", 5.0, "SO COOL! Kids loved the old boats and subs!", "Bring your adventure hat, crawling through the submarines is rather tight, but so neat to see how people used to manage in such small places and continue to do so on current subs. The history available to read about is so worth the ticket prices. There are several types of boats to board and very few places they don't want you to wander into. Human ingenuity at its finest and it is available to the public to view.\nShow less"], ["Reviewed April 12, 2017", 4.0, "Monday MORNING", "Stopped here with nephew before flying back home..Interesting submarines ..Other ships so so..Models of ships A+ Use coupon to save a few bucks"], ["Reviewed April 10, 2017", 5.0, "This was great!", "It was so interesting to see and tour such variety of historical ships, submarines, and other watercraft. This is not your typical museum - it is just touring the boats. The guides were all very knowledgeable and enjoyable. We also had a cruise on the America...what a wonderful boat and crew. I highly recommend the museum and the America. This was one of the best days we spent in San Diego.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Impressive display of sea vessels for us land folk", "This museum has so much to see! The Star of India is a pirate ship looking vessel that has been in the movies. There are tiny ship models and full sized displays of nautical equipment on the main ship. We also got to board a nuclear sub and imagined life underwater for weeks and months at a time. These are all amazing feats of engineering.\n\nAs a bonus, there were cannon firing displays and many food booths up and down the boardwalk during our spring visit. If your family likes the ocean, science and military things then this is the place for you.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Great place to visit and learn about old ships and have a great harbour tour", "You get to visit so many ships and two submarines for the admission price. We had hoped to tour the harbour on the swift boat but it was out of town for the weekend so we were on the pilot boat instead. Our narrator was very well informed and kept everyone's interest. We had been on another harbour tour with a different company earlier in the week, and for the money, this was the best value.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Wide Range of Fascinating Vessels", "A fine commercial vessel from the 19th century, \"The Star of India\", a magnificent private yacht, a Soviet era submarine, a US submarine that descended to a record depth, and even the ship that starred in \"Master & Commander\". This is a fascinating collection."], ["Reviewed April 10, 2017", 5.0, "BOATS! BOATS! BOATS! And SUBMARINES !", "Beautiful ships and rich history from each one!!! U get to go inside these boats and it was So Awesome!!! If u have time good 2 hours u can take your time and walk through this wonderful pier museum! GOT TO TRY IT!!!"], ["Reviewed April 5, 2017", 5.0, "Ahoy!", "This is a wonderful attraction. Very near the Midway aircraft carrier. Ships both old and modern. The Russian submarine is amazing and we could easily imagine Russell Crowe at the helm of the Surprise. Very enjoyable."], ["Reviewed April 2, 2017", 5.0, "Amazing Collection", "Te Maritime Mueseum is chock full of incredible vessels, spanning the discovery of San Diego in the 1600s through the Cold War. There are ships from every era, with informative exhibits and very knowledgeable docents. Just when you think you've seen it all, there is more. We actually couldn't get through it all in a morning so we will be back next time we visit San Diego.\nShow less"], ["Reviewed March 30, 2017", 4.0, "A must see", "We spent the morning at the museum and it was time well spent. From the Berkeley with its elegant passenger area done up as the main museum area you walk out decks where you can wander on 2 different submarines, 2 historic replica ships, a beautiful yacht from the 1800s and the fascinating Star of India. There are informative displays throughout the ships, a little gift shop and in all it was a great way to quietly spend a few hours. Of course lots of photo ops too!\nShow less"], ["Reviewed March 29, 2017", 5.0, "Nice old ships that you can walk around on", "This was a nice old ship museum. Quite a few ships that were in very good condition. 16.00 per person for adults and 13.00 for children. Would go to again if I had time."], ["Reviewed March 27, 2017", 5.0, "So much amazing history", "We had access to the entire museum because we went on a whale watching sail with the America. We gained access to the museum, the submarine and the Star of India. My girls enjoyed going through the submarine and walking around the ship from thePirates of the Caribbean. The whale watching tour was hands downt he highlight of my trip to SD. A must do!\nShow less"], ["Reviewed March 26, 2017", 3.0, "Not enough information", "Good range of boats, I had never been on a submarine before, however there was not enough information on any of the boats at the exception of the Russian submarine which had a good story. The HMS Surprise, Spanish Galleon and others were novel to step on to with no real story behind them and not enough access below decks. I would recommend the USS Midway instead.\nShow less"], ["Reviewed March 26, 2017", 5.0, "An absolute MUST SEE", "I was absolutely blown away by this collection of 10 watercraft. Starting at the Steam Ferry Berkeley museum where you could spend an hour or so, to the150 year old (still seaworthy) Star Of India, to the WW2 Russian attack sub and onto the rest that included several replicas built to exact specs of original sailing ships to a couple of patrol boats and then to the USS Dolphin, the record setting (Deepest dive, over 3000 feet and several other records). And you don't just look at them, you actually get in and look around at the Ferry, the Star, the HMS Surprise and both subs. I spent the entire day there and I can't wait to go back!\nShow less"], ["Reviewed March 24, 2017", 4.0, "awesome ships", "great way to spend a few hours, lots of history. Avoid when schools are around, but fun and informative"], ["Reviewed March 23, 2017", 3.0, "Awesome source of Information for Kids", "I had a 5 year old Daughter (now she is 9. Late to write a review)who was interested in digging information on Ships. And this was the best place to take her.\n\nIn fact this was a place for all age groups. The ship is quiet large to spend around 4-6 hours. It has descent information that kids of this age group can observe. The radio recording has good info to share along with the visuals you see in the ship. You get to know how tight the situation could be on a ship with so many people around. The various kind of fighter plains used in those days are still maintained very nicely. The staff is very good to answer all your questions. The veteran are helping and explaing everything in details.\n\nWe spend a good day and time on this place.\nShow less"], ["Reviewed March 22, 2017", 5.0, "Don't miss this!", "Best Maritime Museum I've ever seen. The staff are so friendly and will give you so much history! Where else can you tour a real Russian sub ( that almost \"nuked\" us during the Cuban missile crisis!)\nThere is a ship ( Galleon?) there completely built by museum volunteers! Staff on board will fill you in on the details! The ship models in the museum are spectacular. If you are a sailor or are fascinated by ships/ boats, this is s must see. There are several ships to tour. It is interactive, so even youngsters are sure to enjoy.\nShow less"], ["Reviewed March 16, 2017", 5.0, "Good Variety of Ships", "Very much enjoyed visiting the various ships at the museum dock. You are self-guided so you can visit all or just the ones that you are interested in. Great display of model ships in the Berkley."], ["Reviewed March 15, 2017", 5.0, "Do not miss this patriotic experience.", "It warms your heart to realize the hardships and difficult lifestyles to which our service people had been subjected."], ["Reviewed March 14, 2017", 4.0, "Lot's to see on the Sea", "We loved touring the wide range of ships, boats, submarines, ferries and sailing yachts included on this tour. Kids will enjoy checking out the subs and crawling around below deck."], ["Reviewed March 13, 2017", 5.0, "Worth the money! Very cool museum!", "We stopped by here maritime museum because we had a few extra hours before our flight. We had so much fun on the ships and subs we didn't even get to see them all in those few hours! Self-guided tour - so you can take your time. Everything is labeled and has information about things on the ships and subs. Very interesting! Our favorites was the British naval ship and the Russian submarine! WOULD DO AGAIN!!\nShow less"], ["Reviewed March 13, 2017", 5.0, "Great selection of exhibits", "Spent a morning seeing the sights of this floating museum. A comprehensive range of vessels of various ages. Submarine was interesting as was the old sailing boat. Easy reading panels and an interesting guy in the old sailing ship who was very knowledgeable. Watched the interaction of the staff with a couple of school groups and they worked very well with them.\n\nGreat way to spend a morning prior to a cruise. Was far better than we anticipated. Good value.\nShow less"], ["Reviewed March 12, 2017", 5.0, "Worth the money", "It may not look like much from the street. The submarines are a tight fit. What was a real treat was there was a guide on the sailing ships that knew his history of the ships."], ["Reviewed March 12, 2017", 5.0, "What a wonderful way to spend the day in San Diego harbor.", "Fortunately a friend recommended this museum the day before we left for San Diego. We really enjoyed the chance to go aboard several historical ships and two submarines, one of them of great historical importance! We also enjoyed a tour of the bay in a historic pilot craft. The boat ride also included a a guide who gave detailed descriptions of everything that we saw while on the tour.\nShow less"], ["Reviewed March 11, 2017", 5.0, "Such a great place", "Exceeded all expectations! You get to board many different vessels. So cool to go through 2 different submarines and some old ships. Can't imagine sailing on them. It is right next to the USS Midway, can't beat doing the those two museums. The ferry which is the main building is beautiful and you get to go down to the engine room. The volunteer that was down there demonstrated how the engines worked. Great place, definitely a must do!\nShow less"], ["Reviewed March 10, 2017", 5.0, "Time travel in maritime history", "This museum consists of numerous boats. One could probably spend at least a day touring all of them. Unfortunately we only had about an hour so took in the Russian sub from the time of the Cuban missile crisis (a good multi-media presentation on how close we came to a nuclear war) and a couple of the tall ships. There was an excellent guide who made the ships come alive with history.\nShow less"], ["Reviewed March 9, 2017", 5.0, "Very fun to visit", "Maritime Museum was a lot of fun to visit. It has different ships you can walk through. We also signed up for whale watching on the America, so that is where most of our time was spent. Definitely worth the visit."], ["Reviewed March 6, 2017", 5.0, "Great Collection of Historic Vessels", "We haven't been here since we first moved o San Diego in the early 90's. The collection now is impressive and taking the time to read the stories at each exhibit really makes a difference. The story of the B-39 Russian Foxtrot Submarines was an eye opener. Excellent presentation. I loved the Model Ships on the Star of India.\nShow less"], ["Reviewed March 5, 2017", 5.0, "Great Collection of Tall Ships and Submarine", "Super collection of various types of sailing ships along with an \"old style\" submarine. Very interesting tour! Admissions are not cheap, but in my estimation worth it."], ["Reviewed March 3, 2017", 5.0, "Rainy Day Visit", "It was a rare rainy day in San Diego and our party of four was looking for something to do. All the ships were open except for the Submarine. It was very interesting to see how the ships worked and I would highly recommend this mueseum.\nShow less"], ["Reviewed March 2, 2017", 3.0, "The Russian sub is nice, the Surprise was not impressive", "I really wanted to enjoy this set of ships, high hopes and all that rot!\n\nThe sub is old, but well preserved and worth the admission price by itself.\n\nThe Surprise turned out to be a bit of a prop museum, which is fine, but it could use some more work tying it into the movie it was used for (Master and commander).\n\nWorth the price, but just barely so.\n\nIn their defense, they do seem to be investing in maintaining the ships.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Impressive", "Spent several hours touring tall masted sailing vessels, learning history, viewing Cuban Missle crisis history in Russian Submarine tour, and touring the harbor!"], ["Reviewed March 2, 2017", 5.0, "Very Interesting, well spent few hours on the waterfront", "This museum was included in our whale watching trip ticket, but I would have taken the tour anyway. This is a \"don't miss\" attraction for all ages. Go through many types of ships."], ["Reviewed March 1, 2017", 4.0, "Give yourself enough time to read the informational displays", "I found this very interesting--learning about how transportation by ship during the last couple centuries shaped our world today. We had planned to spend an hour, but stayed about 2 hours and still didn't get it all done.\nA note to those who get motion-sick, as I am. I had no trouble going two floors below deck, as long as I work seabands on my wrists.\nA note to those who are claustrophobic: I debated whether to go into 1960s-age Russian submarine. But I did and had no trouble. On deck are metal circles, that you can crawl through to understand what you will encounter below. And even though the circles may seem small, the rooms they lead to on the sub are not restrictive or small enough to have caused me any anxiety!\nAnd you can retrace your steps if you feel unable to go on, anyway.\nShow less"], ["Reviewed February 27, 2017", 4.0, "interesting collection", "An unnaturally cold windy day in February made time on deck a little shorter and resulted in my skipping the (optional) harbor tour (optional), but there's good history here, and if you like ship models, well - it will be a treat. The Soviet sub along with its interesting historical role was great to see / learn, the older ships make you realize once again that things were once a lot more difficult - and uncomfortable - than they are now. Even the subs - could you manage it? There were not a lot of docents about, or maybe it was just to cold to ask and answer questions. This is well worth a stop, but if time is short and you must choose one - do Midway, you would not regret the decision.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Many ships, submarines and boats to visit", "I have never been in a submarine so it was a thrill to be able to walk through two of them, one a Soviet sub and other an American. The contrasts between the subs were interesting. The Soviet sub had an interesting story, told in different parts of the boat, about how a similar sub came close to starting a war during the Cuban missile crisis. The giant sailing ship, \"Star of India\" has many interesting exhibits tracing its history as a passenger ship and then a cargo ship. It is clear that the museum is continually improving and refurbishing its collection.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Enjoyed This So Much! Wonderful!!!", "This attraction showcases a marvelous variety of historic boats to tour, plus a submarine!! So much fun!! And it's right there on San Diego Bay, which is beautiful all on its own! For an extra $5 a person you can take a boat ride which is so much fun, and shows some highlights of the area from the water. So good!! The Maritime Museum is an excellent San Diego must see!!\nShow less"], ["Reviewed February 26, 2017", 5.0, "A great place for history and adventure", "We visited the Maritime Museum again on our visit in mid-February. We never tire of touring the ships and subs they have there. This was our first time taking a sailing cruise, however, and we took 2!\nWe were fortunate enough to be there for the Sweetheart Sail just before Valentines Day and were lucky enough to take it on the San Salvador! It was a real treat to be on a replica of a historic galleon. Captain Ray did a great job of giving us a tour of the harbor. It was a beautiful sunny day with low waves--perfect with delicious treats, champagne and a souvenir glass to remember the trip by.\nThe following day was also beautiful and calm, so we went out on the ocean on the America, with Captain Troy. We saw a pod of 5 whales, plus a few others; and a group of Pacific white-sided dolphins. There wasn't a lot of wind, but with an engine when needed we had a great excursion.\nShow less"], ["Reviewed February 25, 2017", 5.0, "So much fun. We loved it as much as our grandkids!", "Very affordable and the veterans that are onboard to offer so much more information are wonderful host!"], ["Reviewed February 25, 2017", 5.0, "Dqy out in San Diego", "I enjoyned rhis place a lot. This is a one of the best place to visit in couple of hours. You also come to know about the engineering used in boats and submarines."], ["Reviewed February 22, 2017", 5.0, "Russian sub and more", "My husband and I loved visiting this multiple ship and museum and harbor cruise Yes our entry fee covered all that We got to go on board the HMS Surprise the ship used in the filming of master and commander a Russian sub us sub see the museum and more\nGreat fun and very informative\nGo\nShow less"], ["Reviewed February 20, 2017", 4.0, "Permission to Come Aboard?", "Nicely done floating maritime museum. We especially liked the Cold War - Cuban Missal Crisis theme presented onboard the Russian submarine. The Star of India was classic, while the Vietnam gunboat was a pleasant surprise. The details of the models on the ferry were also impressive. Well done!\nShow less"], ["Reviewed February 13, 2017", 5.0, "WONDERFUL SHIP TOURS.", "There are four old ships and two submarines you can explore at the Maritime Museum. Lots of displays and several employees answering questions."], ["Reviewed February 13, 2017", 5.0, "One of the best museums in San Diego!", "This is an amazing museum. You can go inside two submarines, check out large wooden sailing craft and other ships. Lots of history and some very cool model ships as well. My favorite museum so far."], ["Reviewed February 10, 2017", 5.0, "We loved this place!", "We visited the Maritime Museum on a Saturday in February with our 7 year old son. We loved all of the ships. This is totally worth the price of admission. It's a must-see in San Diego."], ["Reviewed February 9, 2017", 5.0, "Some unique attractions, well worth a visit.", "Its not often you get to be aboard an old steamer, russian submarine, the ship from Master and Commander and all together at this museum. It costs only a few dollars and for a few dollars more you can get to go out on a boat trip around the bay.\nShow less"], ["Reviewed February 8, 2017", 5.0, "Great maritime museum", "I have been to various maritime museums around the world, and San Diego, is on the top of the list. I am sure you could spend the whole day here. There are many ships to explore, the Star of India was very interesting, as was the Russian Sub from the Cuban Cold War. Just imagine living on one of these vessels from that time period, WOW\nShow less"], ["Reviewed February 1, 2017", 5.0, "Excellent!", "Another must see with several boats to roam through. The Star of India and the Russian sub were our favorites. It took us over 3 hours and could have stayed longer. I highly recommend getting the $5.00 45 min. harbor cruise add on. It's a real value on a small, solid, comfortable boat. All their volunteers are extremely knowledgeable.\nClean restrooms in various places. A good museum, and if you are lucky you will get to see and speak with a real miniature boatmaker who makes every teensy item from scratch. No kits. You can rent these as well for parties, wedding, or groups to take out of Dock. Be sure to go and spend the day. Open till 8 pm with all day in and out stamp.\nShow less"], ["Reviewed February 1, 2017", 5.0, "Carlsbad Trip", "What an interesting group of ships to tour. It is amazing how much work has gone into the restoration of these ships. Even the Russian sub. Very inexpensive to visit and a lot of great places to have lunch. A must see for all"], ["Reviewed January 31, 2017", 5.0, "Experience the time of the past.", "Going through the ships, the subs was a lot of fun and at the same time a learning experience. I did the tours by my self and make sure you go online and use a coupon."], ["Reviewed January 29, 2017", 5.0, "Great price for hrs of fun for adults and kids. Lots to see.", "I can't say enough about this place. A must for locals as well as tourists. For $16 adult, cheaper for children and seniors. You get to go onto many ships and 2 submaries. Take your time as it's all self paced with places to sit and relax too. The Star of India sailing ship is the Star. Huge, multi levels to explore with a bathroom onboard. Another wooded masted ship next door too that was in movies including Pirates of the Carrebean with Johnny Depp. There's an old Russian Submarine with ladders and round doorways to maneuver through, about 5 doors like that. There's also an american sub witch is much easier to walk thru with full size doors. A great museum and other boats, including a pirate ship great for kids. All ages will enjoy this. Plan for at least 3 hrs to see everything at a leisurely pace. Longer for those that enjoy the maritime museum. Perfect location, paid metered parking, great views for a sunny day. You'll get your exercise too.\nShow less"], ["Reviewed January 28, 2017", 4.0, "Good, but limited, museum", "This museum consists of several docked vessels and a building with displays, a gift shop, and lecture halls / food area. Our group was there for a late evening social retreat as part of a conference.\n\nThe heart of this museum is clearly the ships:\nHMS Surprise, a reproduction British sailing ship used in both Pirates of the Caribbean and Master and Commander movies. The top deck is period and the second deck has a number of information displays on the ship armament and seaboard life.\n\nStar of India, a commercial sailing ship from the 1800s, used as transport for immigrants across the Pacific and for transporting fish from Alaska to California. Again, the deck is period and the lower decks have several informative displays.\n\nA Soviet and an American submarine, neither of which I toured. The soviet vessel was noted as having several tight passages and the American vessel was closed for repairs.\n\nThe building holds several displays of equipment and models, mainly of military ships.\n\nThis museum is worth a couple of hours, and combined with the Midway, which is docked nearby but not part of the museum, would make a good visit while in San Diego.\n\nAs a social event location, I found it pleasant. The staff were attentive and the food was tended well and of nice variety. The range of spaces offered good opportunity for discussions. The spaces were well lighted and well maintained.\nShow less"], ["Reviewed January 23, 2017", 5.0, "You Should Be Sure to Go", "Pick a nice day and go to this Maritime Museum. The Star of India and the San Salvador are gorgeous ships. They were working on the Star of India, but we still had access to most of the areas. The displays are well done and informative. The Russian sub has a 'passageway' mock-up before you enter the ship. I suggest you try going through it before you enter to make sure you really can climb through easily. There are about four or five of them once you're on the sub itself.\nShow less"]]}}