{"Marin Headlands": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Marin Headlands", "url": "/Attraction_Review-g155988-d103182-Reviews-Marin_Headlands-Marin_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/1e/b2/2b/overlooking-point-bonita.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1814"}, "address": {"@type": "PostalAddress", "streetAddress": "Golden Gate National Recreation Area", "addressLocality": "", "addressRegion": "California", "postalCode": "94965", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 weeks ago", 5.0, "Excellent spot for sunrise over the mountains east of Oakland & view of \"The City\" and The Bay", "We got an early start on the road trip home from Christmas in Eureka, leaving Clear Lake State Park, Kelseyville CA, well before dawn. Got to Marin and thought we wanted Mount Tamalpais, but that didn't the view of Golden Gate Bridge. Luckily we had time to move and find a parking place on side of road to view sunrise. Stunning!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "off the beaten path", "this place was amazing although there are great sights to see the water, the mountains are glorious and have spectacular views. follow me on instagram at thehalaaltraveler"], ["Reviewed January 18, 2018", 5.0, "I'm guessing it's a 5, cuz we were only there for a half day, and it was a 4", "I think you should give it at least two days. We stayed at the hostel (first time in a hostel for me, and so there's that whole experience...) during our N/S bicycle tour of California. Sure, it's a bit of a trip off the beaten path, but if I were to do it again, I'd work a way to spend a full day just in the Headlands area exploring, hiking and checking out the very cool sunset view from the beach to the west of the hostel.\nThere's a really neat tunnel from Highway 101 to the headlands, which is cool if you're biking. The hostel or headlands area is a good place to stay if you're planning on catching the sunrise at the Golden Gate.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Stunning views", "My husbands and sons and I had a delightful drive up to the top and enjoyed the stunning views. Having a clear day is essential to have the view."], ["Reviewed January 4, 2018", 5.0, "Best coastal views in the state!", "Have you ever seen those car commercials where they are driving on a cliff near the Golden Gate Bridge? THAT's this place.\nYou can view the cliffs looking at the bridge, or go to the end of the road and enjoy the protected beach.\nI spent likely wAAy too much time as a teenager running around up to no good in the old underground tunnels and bunkers left from WWII. Only a few are open these days, but definitely worth checking out.\nIt's hard to imagine some poor young draftee waiting alone in his little concrete box looking out at the ocean waiting for the bombers to come so he can sound the alert....creepy.\nOther awesome things to see at the Headlands: Nike Missile Battery...they have the real deal, but no longer armed. Every once in a while they start em up, put them into position and parade the guard dogs. If that doesn't give you chills I don't know what will.\nMarine Mammal Sanctuary is where they care for stranded and hurt animals....sometimes open for visits.\nI've only gotten to stay there once, but if you plan waaay ahead, there is a spectacular campsite looking out over the bay to SF that's a real winner.\nGreat to do with kids on a long trip who need to run around and get rid of excess energy.\nNo other place like it!\nShow less"], ["Reviewed December 21, 2017", 4.0, "Amazing views spectacular way to spend the afternoon!", "Whether you’re biking or hiking, or just taking a drive, the marin headlands is one of the most spectacular excursions in all of Marin!"], ["Reviewed December 4, 2017", 5.0, "Amazing Views! A must do...", "Once you make the climb (or park your car) at Marin Headlands, you will be glad that you did. The views are stunning! There is a panoramic view of the Golden Gate Bridge. It is just incredible. Amazing!"], ["Reviewed November 10, 2017", 4.0, "Beautiful trip", "We used our city pass to catch a bus from Fisherman's Wharf, across the Golden Gate Bridge to Marin Headlands.\nSomeone of the bus suggested we get off the bus at the information centre and walk down to the beach which proved to be a great recommendation. It was a beautiful, warm day and the views of the lake and surroundings are superb. The beach is a popular place for dog walkers and surfers.\nWe spent some time on the beach before catching the bus back from the car park on the far side of the beach.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Beach walk", "Rodeo Beach-dog friendly, waves, rocks, easy access through tunnel. Love this beach through all seasons. Close to Marine Mammal Center."], ["Reviewed October 22, 2017", 4.0, "Marin Headlands - Gateway to the Pacific", "I live in Marin but the Headlands are still an accessible landmark for the historic and geologic gateway to the Pacific. Beautiful just to drive but also access to trails with fabulous vistas. Not to be missed if one is visiting San Fran and wants an afternoon that will seem like 1000 miles away from the city.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Beautiful Park!", "We did a quick stop here to have a better photo op of the Golden Gate Bridge. Driving through along the coast, we were struck by the beautiful views of the sea among the rolling hills. It felt like a world away from the city across the bay. I wish we'd had more time to spend here!\nShow less"], ["Reviewed September 25, 2017", 5.0, "Wow.", "It's free and has the best views I've seen in a long time. The Golden Gate view is stunning and if you hit it at the right time, so is the sunset from the top of the hill. If you get the chance, definitely go here, you won't be disappointed. We were there on a Saturday at Sunset and it was really packed so parking at the lower levels was pretty crowded. If you continue up the hill to see the beach side it's actually more beautiful. there are some trails as well. Very beautiful.\nShow less"], ["Reviewed September 22, 2017", 5.0, "So Glad We Made the Drive", "Not really a bad drive and we were planning to go over that way anyway. On a previous trip we only got to enjoy the bridge and views from the SF side of which are wonderful. Looking back on the bridge and city from high atop the hills on the other side was spectacular. It was a great clear sunny day so we had wonderful views and got to explore a bit. Enjoy the trip!!!\nShow less"], ["Reviewed September 19, 2017", 5.0, "My fist visit to San Francisco", "Visited the headlands and saw the old base, went to the beach, touched the Pacific Ocean, and found great views of the Golden Gate. Great place to visit, but if you want to see the military base be there before 3pm. They offer tours and such, but the beach was awesome! The rocks...and the views....amazing!\nShow less"], ["Reviewed September 8, 2017", 4.0, "No worries if it's fogged in!", "Lovely drive up to the top, interesting WWII bunkers, but the best bit is he drift of fog and the wonderful smells! Do visit the Marine Mammal Centre."], ["Reviewed September 6, 2017", 5.0, "Mountain views of the coast.", "Traveling up to the top requires you to drive up via very curvy roads Eventually we came upon a one lane road. Traveling past bunkers from centuries old to the visitors center. Stop by for an overview from a Park Ranger about the Headland's past military presence.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Great view", "Great place to get an excellent view of Golden Gate Bridge and San Francisco city. It gets quite windy, so do be prepared with a jacket. Well worth a visit."], ["Reviewed September 2, 2017", 5.0, "Great views for photo ops!", "We drove up just to get some great pics of the city and the Golden Gate Bridge. We went a bit too high up, as the fog obscured the view."], ["Reviewed September 1, 2017", 5.0, "Stunning!", "The Marin Headlands are one of the most beautiful views in the world! all of the turrets that are from WWII, are interesting when combined with the landscape! City views, Ocean views, all astounding!"], ["Reviewed September 1, 2017", 5.0, "glorious", "majestic, sweeping windswept gothic vista with probably the best views in the entire bay area. we couldn't get all the way to the lighthouse ont he day we visited and we didn't even care. completely romantic place."], ["Reviewed August 20, 2017", 5.0, "Definitely go!", "It is amazing that there is so much natural beauty right next to a busy city. That is one of the best things about San Francisco. If you are in the area, you need to visit the Marin Headlands. The views are incredible. You can feel like you are in the middle of nowhere, just outside the city. There are so many different things to do, from the views of the Golden Gate Bridge, to the lighthouse (which is a mini adventure) to the history, to hiking. Even if you just drive through the area, it is worth it. You can spend anywhere from an hour to several days here.\n\nIt is easy to get to, just right over the bridge. Definitely visit the visitor's center for the history and information from the rangers. If you want to go the the Point Bonita lighthouse I would read the reviews for it as well. No matter what time of year or the weather, this is a must see. Make sure your bring a jacket and gloves, even in the summer, you might need them. I have been several times and I plan to return.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Beautiful Views of The Bay, Golden Gate and The City", "Total photo-op. Gorgeous views of the city by the bay, as well as the Golden Gate Bridge. There are trails, bike-friendly, and a nice place to take in the views! Must see if you are visiting SF!"], ["Reviewed August 16, 2017", 5.0, "To to the Headlands and get front row views of the Golden Gate Bridge and San Francisco.", "The views are spectacular. Scouting around you will see hidden places used during World War II and before. There is parking, large beach areas, and hiking possibilities in different directions. Be sure to bring a camera."], ["Reviewed August 14, 2017", 5.0, "Spectacular views and hikes!", "What a gorgeous gem Marin Headlands is! I definitely recommend you go see it while you're visiting San Francisco. It's located right across the Golden Gate Bridge, yet you're surrounded by stunning nature. Depending on the fog, of course, Marin Headlands offers stunning views of the GG Bridge and the city of San Francisco. Point Bonita Lighthouse is right there at the end of the loop after you pass the Visitor's Center. It was built in 1855 and it's still active. You can reach it in only a half mile trail from the parking lot - just keep in mind that some parts are steep. I highly recommend you go so it. The wild landscapes at Marin Headlands will make you want to come back for some nice hikes. I know I will be coming back for more!\nShow less"], ["Reviewed August 2, 2017", 5.0, "A Great Afternoon of Touring", "The Golden Gate National Recreation Area has so many different sites all in close proximity to SF that many can be toured in one afternoon (just across the Golden Gate bridge north of the city). From forts to marine life exhibits and the Muir Woods, no visit to SF is complete without having experienced this beautiful national treasure.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Gorgous", "Beautiful area. Incredible views and so much to see. Nice area for photography. Bring a jacket as the wind can get a little chilly even on a nice day"], ["Reviewed July 27, 2017", 5.0, "Fantastic", "The trails go on forever here.The views are amazing. We did a short hike,slackers trail.It was somewhat steep in places but like I said very short.Amazing views looking down at the Golden Gate Bridge await.The best view of the city I've ever seen!!!"], ["Reviewed July 27, 2017", 5.0, "great views!", "Follow the signs once you get off the Golden Gate Bridge. Keep going to the top. The views are great! It was foggy when we got there but the fog moves quickly and we were able to take lots of great pictures."], ["Reviewed July 22, 2017", 5.0, "Great view", "Beautiful spot to capture the views over the Golden Gate Bridge and see San Francisco from the other side. Certainly worth the trip!"], ["Reviewed July 20, 2017", 5.0, "Must visit when seeing Golden Gate Bridge.", "I had visited the Golden Gate Bridge several times and finally discovered the Marin Headlands for the first time. The views are spectacular. Absolute must see."], ["Reviewed July 13, 2017", 4.0, "This area of the park has so much to offer", "If you get the chance, you should visit the area. I did not give myself enough time. But the rangers were so helpful."], ["Reviewed July 8, 2017", 5.0, "Join the cycling crowd", "We were blessed with great weather and excellent visibility over a partially fogged San Francisco. As usual, it is best visited on bike, minding the steep climbs"], ["Reviewed June 25, 2017", 5.0, "Beautiful and plenty to do!", "Make sure you take a tour of the Nike missile site, and the point Bonita light house. The marine mammal center is also nearby (and free). If you are camping check out Bicentennial Campground (it's free and has a view of the Golden Gate bridge) but plan in advance you have to reserve it and no more than 30 days out!\nShow less"], ["Reviewed June 25, 2017", 5.0, "Stunningly beautiful!", "If you are in luck and go out here on a sunny day, alternatively when the fog has cleared, the coastline here is absolutely gorgeous! Also make sure to go to the Point Bonita Lighthouse, but be aware that it's only open a few days per week.\nShow less"], ["Reviewed June 24, 2017", 5.0, "Windy", "It was super windy but the views are fantastic. Take some great shots of the bridge and water. Parking is tricky."], ["Reviewed June 20, 2017", 4.0, "Joyful evening at Marin Headlands at SFO", "Excellent beach with tiny crowd, children may have fun in sea water games and place for sun baths and outings"], ["Reviewed June 6, 2017", 5.0, "76X bus from downtown San Francisco will take you there on Sat or Sun", "For a mere $2.50 you can catch a bus (76X) out to Marin Headlands and explore the Point Bonita Lighthouse, Battery Mendell, Battery Wallace, the Nike Missile Testing site, Rodeo Beach, the Marin Heads Visitor Centre and the Marine Mammal Centre. Of course if you visit all of the above you will exceed the free transfer time on the bus and have to spend another $2.50 to get back to downtown San Francisco...\nShow less"], ["Reviewed June 3, 2017", 4.0, "Go on a clear day", "Fog obscured the bay, Pacific Ocean and Golden Gate Bridge but the trip still worth it especially for those interested in WWII history. The bunkers and pillboxes up on the cliffs were constructed to fend off an attack by the Japanese and not a well known part of US history.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Amazing! Free! Gotta do it!", "I was quite surprised by all of the 5 star reviews for Marin Highlands - but now that I've visited - I get it! Beautiful! The roads and trails extend a decent way along the coast but I'm sure most people just go up a little way to get some AMAZING photos of the GG bridge in the foreground with SanFran in the back.\n\nMy thoughts for you if you have time:\n\n1) Make time! This is way better than most things you might visit in SF - and it's free!\n2) if possible rent a car, get a picnic basket or cooler and put some yummies in there.\n3). Do a little research on places to check out along the way or just drive there and enjoy the adventure. If you have food and drink - no worries!\n4) If possible avoid the weekends but whenever you go hopefully it isn't too foggy - that could be a problem.\n5) Enjoy!\nShow less"], ["Reviewed May 24, 2017", 5.0, "Amazing View of GG Bridge & SF, Most of Parking Temporarily Closed", "The Marin Headlands is actually a fairly large area, but most folks think of the area along the main road that faces back towards San Francisco. It has breathtaking views of the Golden Gate Bridge given you are right above it. However, the Golden Gate National Rec Area is currently doing construction on the tunnel that is the \"back way\" out of the other side of the Headlands so they have restricted parking along the main road for now. There are barriers up, although there is a bit of parking up by the turn around at the top of the hill. The good news is the tunnel construction should be done soon, so hopefully the barriers will be removed before the summer. Be sure to check out the Point Bonita Lighthouse on the back side of the Headlands for amazing views of both the Bay and Pacific Ocean.\nShow less"], ["Reviewed May 14, 2017", 5.0, "Breathtaking view of the bridge.", "Decided to go back to the vista today as I wasn't so pleased with the cloudy weather yesterday. Now that's a sight I don't see very often at all! I couldn't believe how beautiful everything was!"], ["Reviewed May 13, 2017", 5.0, "One of my favorite places on earth!", "I love the view & the air here. Great place to sit, relax, unwind... I've never spent less than an hour here. I really love this spot!"], ["Reviewed May 8, 2017", 5.0, "Take walking/running shoes (or a mountain bike), water, camera and plenty of time!", "The best views in the area are worth the trek, take some photo's, then keep going. The views keep coming. Even without the the Golden Gate, Alcatraz, the City, the Pacific and all the distant places there is lots to see. Wild flowers and interesting plants, soaring turkey vultures, lizards, butterflies, and all sorts of other critters. Plenty of big cat droppings but no chance of seeing them in the daytime.\nThe trails are well marked and maintained. There as so many you could spend a few days there without walking the same trail twice.\nIf you are driving at the weekend, get there early to find a parking space.\nShow less"], ["Reviewed May 5, 2017", 5.0, "It's the Iconic Golden Gate Bridge View", "Marin Headlands is FREE and offers spectacular views of the Golden Gate Bridge, San Francisco, the bay, and the Pacific. You can drive up, park, and snap a few shots; or the trails go for a couple miles, if you’d rather a longer hike. We had the brightest, sunniest day with clear views and the sun glinting off the water when we were there. My husband received some very good news while we were here, so this spot will always be special to us for more than the views alone. ❤\n\nTIP – Parking may be limited during the weekends and high season, but we found plenty on a beautiful Tuesday afternoon in March. The visitor’s center is all the way at the end of the park but, if you need a restroom, there are some disgusting but much appreciated port-a-potties.\nShow less"], ["Reviewed May 3, 2017", 5.0, "Best views of Golden Gate Bridge and San Francisco", "If you are in San Francisco and wants to take great pictures of the Golden Gate Bridge, Marin Headlands is the place you want to go!\nAfter crossing the Golden Gate Bridge going north the toll plaza, take exit Alexander Av and keep left at the stop sign, turn and you will drive underneath the freeway. Just after passing it turn right and up the hill. - If you miss you will end up in the bridge and there is no way to return!\nThere are several stops to stop and take pictures of the bridge, it is always better to go ALL THE WAY UP! You will drive, drive, keep driving until after the round about up. The view there you can see the old fort and the complete GGB and San Francisco Skyline. Do you way down slowly stopping when you have an opportunity, on the weekends it gets very busy but just be patient people do not stay there too long!\nMy favorite spot is the \"last\" parking lot area before going down back to the bridge, there is a big hill in front of the parking lot and abandoned buildings. This is by far my favorite place to take picture. Go up the hill - it is not very steep and very far and enjoy the cars passing by.\nBe aware that no matter what time of the year, it gets windy and very often foggy there so bring a light jacket and water!\nThe best time to take pictures of the Golden Gate Bridge is late afternoon when the Sun shines on it and makes it very bright red.\nits a great experience to also go there at night.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Stunning", "Breathtaking view after breathtaking view. Drive around the whole area or get out and walkabout. We had one on crutches so the latter was a bit difficult but we still managed to get around a bit."], ["Reviewed April 21, 2017", 5.0, "Fantastic Beautiful Place to Visit", "The Marin Headland is a stunning place. What especially endeared it to me, aside from the lovely views of San Francisco Bay, we're the wonderful, stately redwood forests.\nWe rented bikes in SF and cycled across the bridge to see the Marin Headland. It's a lovely way to see the place, trekking a little through the forests. The trees are just enormous and the bird life and flowers just make the place so serene\nWe loved it so much we came back in the car afterwards to roam a little further along the Peninsula and take it in. Just a beautiful part of the world\nShow less"], ["Reviewed April 3, 2017", 5.0, "A \"must do\" after crossing the Golden Gate", "Beautiful area and we were especially happy that we didn't go to the Headlands during high season as the traffic must be horrendous then. A lot of the roads had barriers along the outer road which we thought was because of landslides. No, we learned it was to keep traffic moving and not allowing folks to stop and admire the spectacular views. Lucky for us that the fog lifted in the Bay just as we got there!\nShow less"], ["Reviewed April 2, 2017", 5.0, "Always Spectacular", "We love to hike in the Marin Headlands. The trails are wide and well organized, but do expect elevation gain if you wander off the Tennessee Valley trail. Wildflowers bloom early here due to the open landscape. Fantastic San Francisco Bay views, historical gun bunkers, and endless ocean vistas from the ridge trails. Parking can be challenging, but once on the trails, it feels spacious and uncrowded. My favorite is Marincello to Bobcat thru the Gerbode Valley, then Coastal to Wolf Ridge and down Old Springs. This is a challenging 10 mile loop that will expose you to the best of this park.\nShow less"], ["Reviewed March 27, 2017", 5.0, "Amazing view", "Amazing view on the skyline of San Fransisco also nice if you want to do a little exercice with the bike"], ["Reviewed March 18, 2017", 5.0, "Beautiful", "If you want those stunning post card photos and breathtaking views of the Golden Gate Bridge this is the place to go!"], ["Reviewed March 16, 2017", 5.0, "Exploring", "The views are great of the bridge and coastline / Bay area .You can see the city if the fog has lifted. Make the drive"], ["Reviewed March 10, 2017", 5.0, "Beautiful location", "A great place to take family, friends, a date, ... whomever for a beautiful walk along the shore with some spectacular views. Head to the beach where the sand is really very small rocks. The shore must be protected enough that the rocks have not been crushed into sand. Great location!\nShow less"], ["Reviewed March 5, 2017", 5.0, "Many things to see here, and all free!", "Wonderful views of San Francisco and the Golden Gate Bridge as well as out over the Pacific Ocean. History buffs will enjoy the old gun batteries of Fort Barry and Fort Crawford. The Nike Missile Site is open some days and is a good visit as well. If you like animals, then a visit to the Marine Mammal Center is a must do as well.\nShow less"], ["Reviewed February 28, 2017", 5.0, "Marin has a lot to offer", "Lots of hiking trails available to roam. I stopped in the Visitor Center and browsed the historical pieces of how Marin Headlands became Recreation land. The Marine Mammal Center is a great stop for adults and children alike who have an appreciation for sea life. Great views of the ocean while walking up the trail to visit Point Bonita Lighthouse.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Spectacular Views of Golden Gate Bridge, San Francisco, Pacific Ocean", "We rented bikes and rode the loop starting at the Golden Gate Bridge (you can also drive it). Absolutely stunning views. If you bike it, be aware that there is some significant climbing and some very steep descents; bring some good legs and good brakes."], ["Reviewed February 26, 2017", 5.0, "Best views (and WIND) in the bay area", "Without a car, you're out of luck, but fortunately, some friends scooped us up while in SF for a conference and took us over the Golden Gate Bridge to the Marin Headlands. It was INSANE windy but worth it -- the views were just phenomenal. Because they had just had flooding rains, some areas weren't navigable. But, a quick trek to the visitors center, and we had a map, and great directions for enjoying wind-sheltered, drier trails.\nShow less"], ["Reviewed February 23, 2017", 5.0, "Best Views of San Francisco", "Worth the drive across the Bay to see SF from this vantage point. The views from this quiet nature reserve on high are stunning."], ["Reviewed February 18, 2017", 5.0, "Best view ever", "A long drive up the hill past the roundabout there are a few spots to pull off. The view is incredible. Some people go up On bike. Very courageous"], ["Reviewed February 13, 2017", 5.0, "Just absolute beauty", "You can drive and park. But if possible. Park the car for most the day and walk to see the views. Incredible. Plan on walking a lot. We walked down an incredible flight to be the only ones in a beach besides 2 fishing. It was spectacular. A workout to get back up, but worth it!\nShow less"], ["Reviewed February 13, 2017", 5.0, "ANOTHER WAY TO SEE THE BEAUTY OF THE SAN FRANCISCO BAY AREA", "When I thought about visiting San Francisco for the first time I expected to see the city. My grandchildren had other plans. They love being outdoors and hiking the hills outside the city. The views are beyond description. I have many breathtaking pictures but didn't do much walking to take them. For those in shape who want to hike, there are many trails. For those who don't want to hike, there are parking areas and overlooks where viewing perfect for photographing the natural beauty of the region.\nShow less"], ["Reviewed February 6, 2017", 5.0, "Gorgeous scenery", "This large recreation area is well worth a visit if you are in the SF area. Dramatic seascapes and terrific views back to the city, as well as quirky features such as an old Nike missile site."], ["Reviewed January 28, 2017", 5.0, "Amazing view! Great for hiking", "We did a five hour hike at Marin headland, with my husband, my mom and our two dogs. We were exhausted afterwards but everyone loved it.\n1. Dog friendly - but I did step on an un-picked up dog poop and saw some poopie bags with things in on the side of road. I am a dog owner too but I hope other fellow dog lovers can keep the park clean so we can all enjoy the wonderful park more.\n2. Amazing amazing view - you will see colorful sea cliff and the Pacific Ocean. The Tennessee point trail has a good view\n3. Good exercise - I love that the trails have uphill and downhill, sometimes can be pretty steep. Great exercise for us.\n4. No fee is charged to entry.\n5. Nice visitor center - don't forget to bring your national park passport to get a stamp!\nShow less"], ["Reviewed January 21, 2017", 5.0, "Spectacular View of the Golden Gate Bridge", "Despite the traffic and limited parking in this area, we managed to get a parking spot and enjoyed the view. There were people directing traffic which helped to keep things moving. Seeing the Golden Gate Bridge with the San Francisco skyline in the background was phenomenal. The weather was sunny and clear and the panoramic view was stunning.\nShow less"], ["Reviewed January 15, 2017", 5.0, "Bring some comfortable shoes", "Awesome views of the Golden Gate Bridge & the Bay Area. Parking seems to be limited so arrive early if possible. Bring water and some comfortable shoes to walk down the trails. A lot of cool things to discover. Definitely a place I would like to revisit in the future\nShow less"], ["Reviewed January 15, 2017", 5.0, "Gorgeous stop en route to Napa", "One of the TripAdvisor contributors recommended that I take a scenic route to Napa through the Marin Headlands. I'm so glad I did. It was absolutely beautiful. I loved seeing the fog over the water and the Golden Gate bridge through a distance. I would love to come back and spend more time here, when I have more time to explore.\nShow less"], ["Reviewed December 29, 2016", 5.0, "Amazing trails overlooking the ocean.", "It may be crowded depending the area where you go, it is after all a big area, but you can find quiet trails, visit the site of the old bunkers where powerful cannons overlooked and protected the San Francisco Bay entrance. The views are amazing, specially if you are lucky enough to visit on a really clear day. Get ready fr a beautiful walk and go!\nShow less"], ["Reviewed December 29, 2016", 4.0, "Spectacular views. Crazy parking situation.", "Would have been 5/5 due to the spectacular views of the Golden Gate Bridge with San Francisco as a backdrop. However, the lack of parking is ridiculous combined with a lack of traffic control. Go but be prepared to be very very civil to your fellow tourists as everyone jostles for the rare parking spots.\nShow less"], ["Reviewed December 10, 2016", 5.0, "Wonderful walking, extensive views and some WW2 history for good measure.", "Needed some fresh air and a walk, went up to the Townsley battery, the siting of the two enormous guns was designed to use their 26 mile range to protect the harbour approaches, often fired but never in anger.\nFelt very much at home as the cliff walks remind me of Cornwall.A coyote? ran across the path in front of us.(Too big for a fox)\nShow less"], ["Reviewed December 7, 2016", 4.0, "Great view of the Golden Gate bridge.", "An A-1 viewing location for the GG bridge with a very interesting scenic drive not far from the city and close to many other interesting spots for lunch, shopping or just wandering and looking."], ["Reviewed November 23, 2016", 5.0, "The views of the ocean. I think it is the Pacific.", "This place has views that are outright awesome! If you come in one way it takes you to the \"upper road' you will see the GG Bridge. Low road the ocean. Ultimate! Ft. Cronkite has the historic factor. The air is nice also! You will love this place. Surfer's I am sure will agree also!\nShow less"], ["Reviewed November 6, 2016", 5.0, "Unbelievable at sunset!", "I don't know how we missed this place on the numerous times we have been in San Fransisco? On the way back from Napa, just as the sun was going down, we stopped off and went up Hawks Hill. The views get better and better, and it's a photographer's paradise! My shot was with an iPhone - just think what you can do with a proper camera? Take an hour to watch the sun go down and see how the bridge comes alive with the redness of the paint with the setting sun. Then watch the lights come on in the city beyond. What delight!\nShow less"], ["Reviewed November 6, 2016", 5.0, "Views, trails, interesting sites", "The only excuse for not spending time here is that you don't have a car. It's such an easy trip from San Fran and offers world class views, neat trails to interesting places, picnic spots, etc. Not to be missed!"], ["Reviewed November 1, 2016", 5.0, "Amazing place with so many things to see!", "We arrived here early on a late August morning. The weather was pleasant (not too sunny and not too cloudy) so we got to see a great view of the Golden Gate Bridge and all of the sailboats within the Bay. We also got to see (and walk on) Battery Mendell and Rodeo Beach before we left, both of which were great.\nShow less"], ["Reviewed October 24, 2016", 5.0, "Hidden Gem - No one was around", "Went to see the always packed scenic overlooks at the Marin Headlands Vista Points and then continued on the road down the steep hill and suddenly we felt completely alone on a Saturday evening as we ventured in and out of inlets and walks in the headlands. I kept saying to my wife and kids that it is almost impossible that there could be some place so beautiful, like the Bicentennial Campground, were you could see the spectacular coast line, the Golden Gate Bridge and the city in the background and there was no one else around! Amazing! Do not miss this little side road that will then take you down to Rodeo Beach, an incredible dark sand and pebble beach with amazing surf, rocks and vistas to rival anything along the coast. There were a few people at the beach taking pictures of a perfect sunset, but otherwise the only other thing we encountered were two coyotes. Who were shy enough not to come too close, but were close enough to get a real good look at them.\nShow less"], ["Reviewed October 23, 2016", 5.0, "Cool views", "Not much to write about apart from stunning views of GG bridge and beyond well worth the 15 minutes across the bridge and up the hill"], ["Reviewed October 22, 2016", 5.0, "Great way to get away from the city -- lots to see and do!", "Everyone talks up the views, but the hiking is amazing, as are the various 'attractions' scattered across the Golden Gate National Parks Conservancy: there is the Marin Headlands Visitor Center, the SF-88 Nike Missile Site, Battery Townsley, considered the zenith of military technology in the 1940s, the Point Bonita Lighthouse; drive Conzelman Road from the northern foot of the Golden Gate Bridge to Point Bonita for five-miles of breathtaking views of San Francisco and the Pacific Ocean; Kirby Cove;\nthe Marine Mammal Center,the Headlands Center for the Arts and the Golden Gate Raptor Observatory. Bring your own food and water, as there are no food vendors.\nIn the fall, watch Golden Gate Raptor Observatory volunteers monitor the autumn migration of birds of prey. Each year, more than 20,000 raptors fly over the Headlands\nShow less"], ["Reviewed October 21, 2016", 5.0, "Love hiking the headlands", "We had a very foggy headlands hike and yet eerily beautiful. Of course, we would have loved to see the views, but you have to deal with the fog, too. Dress appropriately and you'll still have a great time. Challenging and fun."], ["Reviewed October 12, 2016", 5.0, "Head up to Hawk Hill for best views and learn about raptors!", "Pretty much everyone knows about the views from the Headlands, but not everyone knows about Hawk Hill. The Golden Gate Raptor Observatory (GGRO) has been keeping track of the migration from here for 30+ years as a huge citizen science project. From mid August through early December, there will be volunteers there unless too much fog. You have to walk up a short, steep climb, but it is more than worth it.\nShow less"], ["Reviewed October 10, 2016", 5.0, "MORE THAN VIEWS OF THE GOLDEN GATE", "You can enter the Marin Headlands from the 101, either north or south. As you climb the hill into the headlands there are numerous area to park and observe the GGB. Due to the popularity of this location, most spots are full and you will have to wait for a parking spot to park legally. As you continue up the hill you come to a traffic circle, to get to the headlands proper veer left and drive up the hill to the Marin headlands vista point (great photos of the GGB and Point Bonita Light). You can continue past the vista point and continue west arriving at Battery Wallace. This location provides a great view of Bonita Cove and Rodeo Cove/Beach. Loop back around and you come to the Headlands Visitor Center and past that back to the traffic circle for a nice loop around the headlands area. Within this area are a great number of hiking trails and other old military sites to see. Well worth a couple hours driving and walking the headlands.\nShow less"], ["Reviewed October 3, 2016", 5.0, "Amazing Views of Golden Gate in The fog", "Worth the winding drive up the headlands. Beautiful views of the GGB in the fog. Amazing views looking down the pacific coast on the west side of Golden Gate bridge. Nice easy hiking trail."], ["Reviewed October 2, 2016", 5.0, "Can't Miss The View of the Bay", "Breathtaking on a clear day. You get awesome views of the San Francisco bay, San Francesco city skyline, Golden Gate Bridge, etc. from many sites. Take the loop drive and there is also an amazing view on the other side going toward the Bonita Lighthouse. On the way you see the Artillery bunkers built in to the landscape. We even had a deer run across the road in front of us. Very nice day excursion.\nShow less"], ["Reviewed September 25, 2016", 5.0, "Views", "The views from this headland are wonderful, every turn inthe road gave a more impressive sight. The visitors centre is very good."], ["Reviewed September 25, 2016", 5.0, "Kirby Cove Campground: What an amazing way to experience the Bay!", "We stayed at Kirby Cove Campground for one-night in mid-September and found it an incredible and beautiful way to experience the quiet side of the bay, especially coming from Colorado. We booked Site #2, making our reservation about 3-months in advance. Site #2 had a beautiful partial view of the bridge from the tent pad, and was nestled in coastal pine trees. A short walk to the cove offered an expansive view of the bridge and city which was breathtaking both at night and during the day. The cove is very quiet as only those camping are offered the code to the locked gate at the top of the service road. Only a few others were willing to make the trek down to the cove and back on foot from the top.\n\nThe bathrooms were kept very clean and tidy. Do note there is no running water on the campground, so be sure to bring plenty of your own. There were several raccoons that frequented our site after dark looking for food, but thankfully they scared easily and did not become aggressive. We also saw a large family of deer within the campground.\n\nThe campground is within close proximity to Muir Woods/Beach and a very quick trip over the Golden Gate Bridge lands you in the city within minutes. This was truly a hidden gem, and a camping trip we will never forget!\nShow less"], ["Reviewed September 16, 2016", 5.0, "Fabulous views of the Golden gate", "Well worth the time. The views from the top are quite breath taking. The Golden Gate and if the fog permits a expansive view of the entire bay, Alcatraz and a vast portion of San Francisco. I especially enjoyed watching the Hawks and vultures soar from Hawk hill.\nShow less"], ["Reviewed September 7, 2016", 4.0, "A cool excursion", "A trip to Headlands can enrich the visitor a lot of information about the creatures living in the Pacific Ocean of California Bay."], ["Reviewed September 5, 2016", 4.0, "Beautiful views, great walking", "Loved the views from this location - absolutely stunning. Great walking paths which considering the elevation are very easy to walk along.\nThe only reason I did not give this 5 stars, was at the weekends the roads were crazy busy. There is limited parking and cars were stopping on the roads, which meant no one could pass. Took up 10 mins to drive to the top. 40 mins to drive down, as there was no traffic control.\nWould therefore highly recommend to go on a weekday, when less busy\nShow less"], ["Reviewed September 4, 2016", 5.0, "Excellent Views", "Very nice hiking for all kinds of hikers. There are winding, dirt pathways for a more 'real' hiking experience as well as paved hiking paths for those who want more of a 'walk' experience. Regardless, the views of the coast are amazing. On a clear day you can have a great view of the Golden Gate Bridge. Many interesting birds and wild flowers to see. Do be careful that you try to choose a time that isn't 'prime' time (like a sunday afternoon) as parking can be limited, traffic getting into the park, and lots of crowds. It would be a much nicer experience on 'off time'. Remember to bring water and snacks. And, do stop into the visitors center as the Rangers there are very knowledgeable and friendly!\nI will most definitely return!\nShow less"], ["Reviewed August 28, 2016", 5.0, "Great views of Golden Gate Bridge and back towards San Francisco", "Drove back into San Francisco from Napa Valley and stopped in Sausalito and on into the Marin Headlands - jaw-dropping views of Golden Gate Bridge and San Francisco. We had some fog, some clouds, some sunshine.....typical Bay Area day!\nThe viewpoints were busy with lots of tourists, many international. It's too bad they can't clean up the restrooms, overlook areas to make them a bit more visitor-friendly. Places I've visited lots of tourist sites and these are poorly maintained but overall the views make up for it.\nWe did see one foreign couple dealing with a police report for a bashed out car window and items stolen from backseat. Hard to imagine how thieves could manage that activity with the crowds but a reminder to always stow belongings out of site at places like this.\nShow less"], ["Reviewed August 27, 2016", 5.0, "Amazing views", "Love the winding road with amazing views. You do have to watch traffic to find parking at overlooks. I went on Tuesday afternoon and still busy especially at the lower overlooks. Drive down to lighthouse was great.\nPictures are great so bring camera. Windy and cold...be prepared. Well worth the time.\nShow less"], ["Reviewed August 24, 2016", 5.0, "Drive Beyond the Tourist Hotspots for a great experience", "This park area on the north side of the Golden Gate Bridge is lovely. However, most visitors park within one mile of leaving the bridge to take a a photograph and then turn back. Definitely stop for photographs with everyone else, but then carry on along the one way road which winds along the coast line dramatically. There is more to see, and a great (quiet) picnic area with bridge views near the lighthouse. Add to that the Nike missile site and the visitor center and this is a surprisingly good option. Do it...\nShow less"], ["Reviewed August 9, 2016", 5.0, "Unmatched views of the Golden Gate", "The road up to the highest point is quite curvy and dangerously close to the edge of a mountain, but the view once you get higher up is totally worth it! Unfortunately, we went on a day where thick fog was rolling in at the higher elevation of the mountain, so we didn't get to see the bridge initially. But, with a little bit of patience, most of the fog cleared out for a bit and we got simply gorgeous views of the bridge. Highly recommend coming here over Vista Point, as it's much less crowded and you get better views of the bridge. Bring a light jacket too, it can get cold and windy!\nShow less"], ["Reviewed August 1, 2016", 5.0, "Top of the mountain", "What a great place to see San Francisco from high atop the Golden Gate Bridge. The best vista ever! Bring a good jacket as it gets very windy and cold!"], ["Reviewed July 28, 2016", 5.0, "Hidden Gem", "I was trying to get to the other side (northwest) of Golden Gate bridge to avoid the crowds and ended up at the visitor center of Marin Headlands.\n\nThis turned out to be a good thing and we ended up hiking to Rodeo Beach. It's 1.5 miles round trip from the visitor center. The trail is well paved and surrounded by shrubs, trees, sand, water, and of course the majestic Pacific Ocean. The trail is fine for beginners although you have to climb just a bit, but it is not strenuous at all. You can go on a completely flat path which means you will cover only half the trail. Ask for directions in the visitor center for a flat path.\n\nPlan on spending between 1 to 2 hours. There are picnic tables right outside the visitor center and it's a good place to bring and eat lunch.\n\nYou can also ask the people in the visitor center for a map and directions for the best views of Golden Gate bridge.\nShow less"], ["Reviewed July 20, 2016", 5.0, "Beautiful views of the Golden Gate!", "We had a lovely, but short, visit to the Marin Headlands. Snapped some lovely pictures and enjoyed the scenic vistas and nature. Definitely spend a lot of time here if you have the opportunity - lots of great hiking and other outdoor adventure opportunities!"], ["Reviewed July 19, 2016", 5.0, "A national treasure.", "The Headlands are one of the most beautiful places in California. Insanely beautiful trails and views of SF and the bay. Rock geeks - you'll be in heaven. Pillow basalt, limestone, oceanic plate scraped off to form the Headlands as the plate sub ducted under the land.\n\nSan Andres fault goes through it. You can see the fault at certain spots. The volunteers are informed and helpful.\n\nAlso check out the WWII bunkers and the marine mammal center.\nShow less"], ["Reviewed July 19, 2016", 5.0, "Amazing views", "Went here at dusk and as it got darker the views got better and better. There are about five or six view points looking across the Golden Gate Bridge with the city in the background. It's absolutely stunning. The road is windy and parking is limited so be careful as cars just pull up and stop. At night when we were there, although busy, it wasn't too bad during the day it must be crazy. It was also incredibly windy and got chilly so take a jumper and or jacket. That said it is worth it seeing the city lit up through the bridge.\nShow less"], ["Reviewed July 18, 2016", 5.0, "The Perfect Viewing Area", "The Marin Headlands is always one of the first places we take visitors visiting us, usually after picking them up from SFO and driving back home (Sonoma County).\nThe views here are truly spectacular, I honestly don't thing you could design a better spot for views of the Golden Gate Bridge, the city of San Francisco and the entire bay. There are numerous pullouts and parking for getting out and admiring those views and also taking pictures. However on busy days, especially weekends the parking areas can fill up and some patience will be needed.\n\nWe have visited the Headlands several times but each time only for the scenic views. There are so many other sites to see here and places to explore. Just a few that we plan to visit in the future are: Point Bonita Lighthouse, Battery Townsley, Fort Cronkhite, Fort Baker.\nThere are also numerous hiking trails to get an even closer view of the wildflowers, birds a\nShow less"], ["Reviewed July 13, 2016", 5.0, "Lovely views", "If you can catch a mostly clear day this is the place to see and photograph the Golden Gate Bridge with the city and bay behind it. Great little drive along the coast beyond the Headlands views . We saw the lighthouse and harbor seals. Also could watchseveral whales\nShow less"], ["Reviewed July 11, 2016", 5.0, "On a Clear Day...", "...You Can See Forever! Appropriate song lyrics for the fabulous views out to the Pacific Ocean and San Francisco and the Golden Gate Bridge. A clear day is when you want to go there, but keep in mind the fog changes sometimes hourly!! It's tricky to get here, just enter Marin Headlands, Sausalito into your search bar. Also stop at several lookouts.\nShow less"], ["Reviewed July 1, 2016", 5.0, "Take your visitors there to see the Golden Gate bridge - best view of all!", "Every time someone comes to visit us in the SF bay area, they must see the Golden Gate bridge, and the view across from the Marin headlands is THE PLACE to see it."], ["Reviewed July 1, 2016", 5.0, "The best view of San Francisco and golden gate bridge", "If you are pressed for time, make this your stop. It was free and well worth the drive. The best views of San Francisco in the background and the Golden Gate Bridge in the foreground. When you get to the lookout, it is breathtaking. It was like you were looking down from the clouds. This should be a must visit on any trip.\nShow less"], ["Reviewed June 30, 2016", 4.0, "Hiding in plain sight", "There are a lot of things to see here... If you hike the trails or walk the paved road... You can see not only beautiful views of SF... But, hidden bunkers and pools of water that have created their own Eco system over time... Filled with newts and plant life...\n\nWarning: Don't touch the newts though, I believe they are poisonous..\nShow less"], ["Reviewed June 29, 2016", 5.0, "The View - Priceless!", "Located on the north side of the Golden Gate Bridge, overlooking the bay's entrance past the bridge. This is a vista that is fabulous, and worth so much to the People. During regatta's or the America's Cup, the there can be hundreds of boats out on the water, and, given a nice stiff breeze, everyone who actually wants to see the northern stretch of the Bay, from the GGB to points east and south of Treasure Island.\n\nDuring the Navy's Blue Angels aerobatics demonstration, this is one of the best spots to look at them to see their incredible formations and say Awww......\n\nTo the west and NW is MT. Tamalpais with a number of dirt bike trails and pedestrian trails for the runners and hikers. All of it is beautiful, even on those dreary gray days that sometimes happens there.\nShow less"], ["Reviewed June 27, 2016", 5.0, "Happy traveler", "wonderful place for visiting. Lovely beach with hirking trail as well. Not too far from San Francisco, watching different angle views of Golden Gate Bridge and San Francisco while on the road and enjoy the sand.. One of the most beautiful place to watch sunset"], ["Reviewed June 22, 2016", 5.0, "Stunning", "If there are better views of SF and the bay available, I'd think you'd have to die to get them. Walk around, get a feel for the entire scope of the vista, from the city to the other side where the cannon emplacement used to be for firing on enemy ships coming into the bay. Just incredible.\nShow less"], ["Reviewed June 4, 2016", 4.0, "Great views of the Golden Gate and the Pacific", "If the fog is low enough or gone, the views of the Golden Gate are excellent -- the best in the area."], ["Reviewed June 1, 2016", 5.0, "Amazing views", "Wow, if you want to get a good picture of San Francisco to take home you must take it from the Headlands. Great views of the City and Golden Gate Bridge. Parking can be scarce and the inevitable road-hogging bicyclist must be watched out for, but it is certainly worth it all. Bring a good camera because the views are spectacular.\nShow less"], ["Reviewed May 28, 2016", 5.0, "Amazing views", "Loved this place, you can get amazing views of the city, ocean and surrounding hills. Great place to hike around, explore the area and get some fresh air.\n\nYou do have to be a little brave driving up and down the winding roads along the cliff edges to get here but it's part of the adventure.\nShow less"], ["Reviewed May 27, 2016", 5.0, "Out for a drive and the views", "Had a nice drive over to the headlands after visiting the San Francisco Bay model (run by the Army Corps of engineers). Views were fantastic of the city. Parking was problematic but if you wait the folks move along fast enough to get a spot."], ["Reviewed May 24, 2016", 4.0, "Not to be missed...amazing views!!!", "First time visitor. Beautiful drive to the top. Wow, amazing views of the Golden Gate Bridge, the bay, and the city of San Francisco. On a clear day can see for miles in all directions, Several points along the way to park car and take in the amazing views. Popular spot. Great hiking trails.\nA few cons: Can become very busy at dusk...use caution with cyclists who share the road, especially on the trip back down to the highway.....and those cyclists without any reflective gear!!\nShow less"], ["Reviewed May 24, 2016", 5.0, "On our way to Tiburon", "Since we were going up to Tiburon to celebrate my birthday, we made a last minute decision to check out the view from Marin Headlands. Since it's a Monday, there were not a lot of tourists. The sky was clear and the fog hasnt rolled in yet at 3pm. Gorgeous views of the Golden Gate Bridge!\nShow less"], ["Reviewed May 21, 2016", 5.0, "Great place to visit in San Francisco", "We went on hike here and the Marin Headlands had the best views of the Golden Gate Bridge and San Francisco. We went in March and the crowds were that bad. I believe this area gets quite crowded in Summertime."], ["Reviewed May 14, 2016", 4.0, "Beautiful drive through this area, on way to Marine Mammal Rescue.", "Enjoyed this drive on way to Marine Mammal Rescue (located in the heart of this area) and saw the old base housing and buildings. One can also see a glimpse of the Golden Gate Bridge!"], ["Reviewed May 8, 2016", 5.0, "One of the best of the Bay", "There are very few more beautiful drives anywhere in the world than the Marin Headlands. Don't be put off by the long line of traffic. It eases up a bit as you get past the first tourist overlook. In fact, skip the first overlooked after you leave the Golden Gate Bridge and drive on a bit further up the headlands.\nShow less"], ["Reviewed May 8, 2016", 5.0, "Best views of San Francisco and bridge", "If you head to the top of road there is a nice half mile path to the lighthouse with stunning views of the bay and the ocean.\n\nWhere flats or tennis shoes because one part is steep.\n\nBring plenty of patience on a beautiful day for the traffic driving up, finding parking and navigating the path with families of all ages.\n\nThe lighthouse closes at 3:30. It took us less than 15 minutes to walk down. We spent about 15 minutes there then walked back.\nShow less"], ["Reviewed April 30, 2016", 5.0, "One of the best views of San Francisco", "If you want good views of San Francisco and the Golden Gate Bridge, you have to go to the Marin Headlands. You won't find a better spot to view the city and the pacific. I biked from Fisherman's Wharf, and the bike ride was amazing! I would definitely do it again, but to get to Hawk Hill (a must-see), the ride is very steep. It might be advisable to go by car unless you particularly enjoy bike riding.\nShow less"], ["Reviewed April 26, 2016", 5.0, "Beautiful!!", "Some of the best views of the Golden Gate and SF! Think \"Full House\" intro. Also great views of the ocean as well and old army bunkers and barracks you can explore."], ["Reviewed April 21, 2016", 5.0, "Amazing ! Must visit!", "Came, saw, and in awe! If you have a full day to spend - this is it! MH is part of the national parks as well as golden gate national recreation area. Get in the car, lace up your boots, pack a lunch and be ready to be inspired! Drive in all the way, pull into any pullovers for scenic views. If you're an avid hiker- Hawks Hill has the best 360 view but the hike is a strenuous one coming from the Rodeo Beach side. The Coastal trail is also amazing! You see the flowers blooming, the critters scurrying and if your lucky, river otters along the waterways! If you're a tourist just follow and wander along with the road - you'll be able to see Golden Gate Bridge once you hit the top- this is a different view! Amazing!!!!\nShow less"], ["Reviewed April 14, 2016", 5.0, "Beautiful", "Beautiful, free area, with abundant wildlife, beaches, trails and wild flowers. Easily accessible from the Golden Gate Bridge."], ["Reviewed April 13, 2016", 5.0, "AKA - Hawk Hill - View San Francisco Through Golden Gate Bridge", "Having been to Hawk Hill numerous times - once also fortunate enough to witness the local conservatory group release a nursed Hawk back into the wild - I always like taking new visitors to SFO to Hawk Hill. It is so peaceful and serene so high up that one could spend hours looking at downtown SFO through the Golden Gate Bridge. The best days to visit Hawks Hill are Saturday's or Sunday's as there can be a lot of sailboats in the bay. I have also been fortunate (or some may say unfortunate) to be up there when the clouds were so low that they enveloped the Golden Gate Bridge so that only the top tips of the towers of the bridge were exposed. We couldn't see downtown SFO, but still what a sight. So if you are in downtown SFO, drive over the bridge, take the first exit (not the Vista Point), turn left at the stop sign and go back under US 101 and veer right up the hill instead of going left back onto 101. Go right to the top - find a parking spot and then go through the bunker tunnels and climb up to the top. Take your time as the view are worth the climb.\nShow less"], ["Reviewed April 6, 2016", 4.0, "Beautiful views!", "We only had a quick visit here as our coach dropped us off for a quick photo opportunity, but the views are amazing and I would imagine it's a great place for walking around or having a picnic. The only downside are the toilets, which were pretty disgusting to be honest. But the beautiful views of San Franscisco Bay and also out into the ocean more than make up for that!\nShow less"], ["Reviewed April 3, 2016", 5.0, "Picnic at Battery Wallace", "The first few parking areas are always very crowded, in my experience at least. If you continue driving all the way and then back down on the far side, the drive is stunning (and maybe a little hair-raising!) and much less crowded. Continuing all the way to Battery Wallace, there are several picnic tables and it is nice and quiet. The views are beautiful of the GG Bridge, but it is quite far away, so the photo opportunities not as magnificent as the more crowded areas.\nShow less"], ["Reviewed April 1, 2016", 5.0, "Second picnic in less than a year", "My husband and I love doing picnics and who in California wouldn't. What's great about main headlands is the views, you can see the golden gates bridge from certain spot or soak in the sun while enjoying the expense of the ocean. So many spots with breathtaking views and so many trails to go hiking. Parking is reasonably easy to find at most of the spots. A fairly long almost two hours drive from where we live but have always found it worth the timer and effort. During hear wave in bay area this is our rescue destination.\nShow less"], ["Reviewed March 19, 2016", 5.0, "Etched in my memory....", "From reading on TripAdvisor, I still could not picture in my mind just how breathtaking the Marin Headlands could be. I arrived on a very rainy day but enjoyed my time driving through their miles of roads, stopping endless times to get out and take photos. Though I imagine a sunny day makes car travel a bit more tricky - I couldn't help but appreciate the gift the rainy weather brought.\nShow less"], ["Reviewed March 17, 2016", 5.0, "Great view of San Francisco!", "Just off the northern end of the Golden Gate Bridge, this old military post offers a grand view of the Bay, the city and the Bridge! Magnificent!🌆"], ["Reviewed March 8, 2016", 4.0, "Scenic Drive", "It's a wonderful drive. Watch out for the cyclists. The roads are narrow and people sometimes take their sportcars out to drive."], ["Reviewed March 7, 2016", 5.0, "killer bike ride gorgeous view payoff", "You'll likely be sucking wind getting to the top of the hill, but the views are worth it. If you need to rent a bike, sports basement has some top notch equipment. (I didn't use it, but my brother who was visiting was really pleased with the bike he rented).\nShow less"], ["Reviewed March 6, 2016", 5.0, "Great View", "You can enjoy some great views of the bridge from the Marin Headlands. There are several overlooks, so if one is busy, just keep going. Our personal favorite was the second overlook from the main road."], ["Reviewed February 26, 2016", 5.0, "If it is a clear day and you have a car, you need to do this", "After visiting Muir Woods, on a whim we drove up to see the view from the Marin Headlands. Spectalular! Wow! Parking was tricky on the weekend, but we found a spot. If you like scenic views this is hard to beat. Pacific Ocean, Golden Gate, City of SF. It has everything.\nShow less"], ["Reviewed February 26, 2016", 5.0, "Very nice views of the rugged coast and the ocean", "So many trails to hike! You can start your hike at the end of Golden Gate bridge on the Marin side (turnoff for Sausalito, turn left to go under 101 and back toward the bridge). The trail starts right off the parking lot. The views of the bridge and the city here are really nice. From there, you can walk all the way to the Marin visitor center or Fort Cronkhite. Or you could drive to the visitor center or Fort Cronkhite and start your hike there. The bridge and the city are further away here, but the views of the ocean are excellent. It's also a very good place for bird watching. Hike up to Battery Townsley and up to hill 88, where there are remnains of military installations. But this is not a loop, and you will have to hike back the same way you went up. It coudl also get very windy and cold. You can also visit the Marine Mammal Center on the way back. The center rescues injured marine mammals.\nShow less"], ["Reviewed February 16, 2016", 5.0, "Spectacular views of the bay, the City, and the Pacific Ocean", "This is the best deal for tourists in the Bay Area. Immediately beyond the Golden Gate Bridge is the turnoff for Sausalito (which is also a wonderful tourist destination), and you can actually turn either left or right at the end of the off-ramp. To the left, you'll pass under 101 and be able to drive up a hill that brings you back to the Golden Gate, and you'll start seeing views (on a clear day) that will take your breath away. If you turn right, get ready to turn left in about 150 feet towards a tiny one-lane tunnel that runs under the Marin Headlands and heads to the beach. The routes eventually converge at one of the many artillery sites around the land. You'll be transported back to World War II when it seemed likely that the enemies would try to send ships into SF Bay and make some trouble.\n\nSuffice to say that there are fascinating military and non-military sites around this large \"park\", a gorgeous beach, birdwatching, trails, and views that are as good as any on earth. Do not miss this gorgeous place.\nShow less"], ["Reviewed February 14, 2016", 5.0, "Many Trails to Choose From", "It does not matter where you choose to start. Everything is beautiful. For me, I chose the Rodeo Valley/Ft Barry. The parking area is the place that has the stables. From the parking lot, hike towards the stables up the hill about 1.2 miles to the first coastal view. Then head towards the left to the Golden Gate bridge. Don't forget to detour right to the Slacker Trail, about .4 miles to the highest point to see the city view before headed to the GG bridge trail. The total hike is about ~ 7 miles. If you have enough time, head out to the Point Bonita Lighthouse about a mile up the hill. It is definitely worth your day with no expense to your pocket.\nTA is asking if this is suitable to children. That depends on their age and abilities. If you train them early enough to hike, they can do part of it but perhaps a full 7 miles will be too much.\nA very nice thing to do in this city by the bay.\nShow less"], ["Reviewed February 14, 2016", 5.0, "Best Views of the City and Bridge!", "The views from the Marin Headlands on a clear day are absolutely beautiful. You are able to see the entire bridge in its entirety; and the city is amazing as its backdrop. If other visitors are being gracious, you can sit up there for a long time and simply take in the view. If they are being a bit loud (some visitors at one pull off were kind enough to bring a boom box to blast their music), it gets a bit tiresome. If that's the case, just move to another pull off.\n\nIt can get pretty windy up there depending on your stop; each one is different depending on how much it is sheltered by the hillside. But that's a small annoyance for such a beautiful view. A must see while in the city by the bay!\nShow less"], ["Reviewed January 31, 2016", 5.0, "Is there anywhere better to view San Francisco?", "Never fails to provide stunning views of San Francisco and the surrounding headlands. Walk up it for serious fitness bragging rights."], ["Reviewed January 27, 2016", 5.0, "Beautiful", "I could spend days up here just staring out over the mountains and water. This is easily one of the most beautiful places I have ever been to in my entire life. If you're planning a trip to the San Francisco bay area, you should seriously consider spending some time here.\nShow less"], ["Reviewed January 26, 2016", 5.0, "Marine Headlands National Recreation Area by MUNI bus from San Francisco", "Marin Headlands is part of the national parks system, and is a magnificent, beautiful natural area. Visiting the city without renting a car, I chose to take MUNI bus #76x to visit the Headlands. #76x runs only on weekends and holidays, and about once an hour; checking times and stops on the MUNI website is essential to planning this trip; the MUNI phone access may also provide help to riders.\n\nThe bus takes riders over the GG bridge, views are wonderful of the bay, the city, and the Marin hills. The twisting hilly roads require slow travel, so riders have time to enjoy the views. My destination was Rodeo Beach and Fort Cronkhite where there is a national park visitor center.\n\nRodeo Beach is the last stop: get off the bus, check out the rest rooms, walk and beach comb for an hour or so. The surf was heavy on a sunny January day, and there were surfers on their boards enjoying those challenging waves. The sand is clean with interesting colorful pebbles, which by law may not be collected. I saw hawks and a great blue heron in the lagoon area inland from the beach. Uncrowded on this visit, the beach provided a perfect respite from the hectic city environment.\n\nWalk along a well-maintained trail about 3/4 mile from the beach to the visitor center, with a short uphill stairway at the end. The visitor center is in a small chapel building that was part of the old military fort, with displays about the natural and military histories of the area. Staff are very helpful and knowledgeable. A bus stop for #76x is a short walk downhill from the visitor center.\n\nDetails about visiting the Headlands are available at nps.gov, the national parks website. For visitors who wish to drive, be aware that traffic can be frustrating and parking challenging on weekends. The bus was perfect for this older traveler and the walks were safe and not too difficult. Commercial tours can be arranged for visitors who do not prefer the do-it-yourself approach--see other reviews.\nShow less"], ["Reviewed January 8, 2016", 5.0, "Gorgeous scene", "The place is very beautiful with mountains and the Pacific Ocean catching your eyes, not mentioning the skyline of San Francisco and the Golden Gate Bridge."], ["Reviewed January 1, 2016", 4.0, "Awesome views of Golden Gate!", "Another great place I went to this visit that I missed in my past visits to San Francisco. We came with our tour and it was just after we drove over Golden Gate Bridge. There's limited parking so our guide dropped us off and drove up and came back down to pick us up. We had about 10 minutes so enjoy the amazing views of San Francisco and the bridge. It was busy with tourists but not so packed that we couldn't find spots to take some great photos. I'm glad we came here but I would have liked to see more on the top and check out what would be around. This is one place I will want to come back to!\nShow less"], ["Reviewed December 20, 2015", 5.0, "Breathtaking views of the City and Bay", "Take a drive from SF over the bridge, take first exit and go left. Wind your way up to the top of Marin Headlands and get some great photos. Continue on down the hill (roller coaster-like) and see the old forts. There's also a beach that is quite nice. You end up in Sausalito.\nShow less"], ["Reviewed December 13, 2015", 5.0, "SPECTACULAR VIEWWW", "Best views with great hike and bike trails. No need to pay for tour it is amazing just to wander and take your time. Pure relaxation."], ["Reviewed November 24, 2015", 5.0, "Great Views of San Francisco", "We went to the Marin Headlands area across the Golden Gate Bridge from San Francisco. It is a beautiful park area with many miles of trails. We spent a couple of hours walking through the park. The views of SF from the road leading to the Headlands are gorgeous. If you want to get away from the city for a couple of hours it is a great day trip. A car is recommended, but we did see city buses dropping off people on the weekends.\nShow less"], ["Reviewed November 23, 2015", 5.0, "Some of the best views of the Golden Gate bridge!", "Rent a bike or get a ride up this hill overlooking the Golden Gate bridge. Fantastic views from here."], ["Reviewed November 19, 2015", 5.0, "Worth the visit!", "A visit to the Marin Headlands is a must! Even if you have been here before, go again! The views are amazing and the trip along the various roads constantly show different vistas. Definitely stop at the Battery Spencer, Google's Best Golden Gate Bridge Vista, but also continue up the road to the other locations, particularly Hawk Hill. I think that vista is actually better. The inland roads are also interesting.\nThere are walking trails as well - e.g. down to Kirby Cove\nShow less"], ["Reviewed November 18, 2015", 5.0, "Amazing Everytime!", "We were driving from the very top of California to Morro Bay recently and having been in SF for over a week not long ago, we decided to only drive across the Golden Gate & skip the city for a change. But we did make time to stop at the headlands again as you can't beat the views up here!\nThis time we were here in the morning, and while the views are still amazing, to get the best views with the best light, go in the afternoon/sunset when the sun is behind you & lights the bridge & city perfectly.\nShow less"], ["Reviewed November 11, 2015", 5.0, "Breathtaking Views!!!", "I've been to this place countless times and I must say, I will never get tired of the view at Marin Headlands!!! First time I went, I fell in love with it right away, 'twas in the summer of 2001. Many more trips with families and friends followed and the last time my family came there was last April 2015. I know it's not gonna be our last visit, however, my bucket list is getting longer, we're exploring other places now :) on our days off from work.\nAnyone who's visiting San Francisco for the first time should not miss coming here. This is where you can find the most impressive spot to view the Golden Gate Bridge. Actually, there is so much more to see than just the bridge. On a clear day, if you're lucky, one can view almost the entire bay - from Treasure Island to Farallon Islands. It's so beautiful it took my breath away a thousand times (or more)!\nShow less"], ["Reviewed November 8, 2015", 5.0, "Superb views !", "The views up here are amazing, the coastline is great but the views of the Golden Gate bridge with San Francisco and Alcatraz in the distance are incredible. It is very popular and parking can be challenging but usually something becomes available as people are quickly going from one vantage point to another. We struck lucky, we were in a large RV and the first car park was packed but as we drove up the hill another RV was vacating a large bay for RV's and buses, Happy days ! It really is a 'must do' for anyone visiting the area, fantastic !\nShow less"], ["Reviewed November 6, 2015", 5.0, "Beautiful scenery but try for a quiet time", "What is beautiful and free for the drive? The Marin Headlands and its views of San Francisco and the Golden Gate Bridge. This is a magnificent drive best by taking Bunker Road (from the Sausalito side) to McCullough, to then get to Conzelman Road since that means you do not have to cross the road to see the views. Of course, those prime views are also where all the other cars are vying for a parking place, so bring some patience, or better yet, pick a quiet time to go….certainly avoid pretty weekend days! At the foot of Conzelman at the Golden Gate Bridge, there is a parking lot that allows you access to walking across the Golden Gate (see separate review). After walking the Gate, you will need to back track along Conzelman to access the remainder of the Headlands area since Conzelman becomes one-way (driving away from SF) at McCullough. In addition to those fabulous SF views, there is plenty else to see, including the Point Bonita Lighthouse (but parking is difficult and currently it is only open on Sat-Mon afternoons) with its spine-tingling approach with its steep path and swinging suspension bridge over the ocean!). Along the drive, you can see numerous batteries and bunkers, some dating back to pre-World War I, and others from World War II, when a Japanese invasion of San Francisco was feared. An old NIKE missile silo is infrequently open for tourists. Further along, you will come to Rodeo Beach, a pretty and nice long beach for walking and contemplating the ocean. On the drive, keep an eye out for wildlife of all kinds (we have frequently seen coyotes, and once a bobcat). Marin Headlands offers so many great and beautiful experiences, and all for free!\nShow less"], ["Reviewed November 3, 2015", 5.0, "Amazing views!", "This area can get super crowded so just be prepared. The views of the Golden Gate are worth it, however. We went in the late afternoon in November and watched the sun go down over the horizon. The colors on the bridge were spectacular!"], ["Reviewed October 30, 2015", 5.0, "Highlight of our trip", "Marin Headlands was a definite highlight of our trip to San Francisco. The views, and photo opportunities, of the Golden Gate Bridge and San Francisco are stunning. Plenty of hiking trails and just a nice change of pace from being in the city which is also awesome but a change can be good.\nShow less"], ["Reviewed October 15, 2015", 5.0, "There's only one", "Heading north go over the GGB and take turn towards Sausalito. Take first left and go thru tunnel. This network of roads give you best access to beaches, the cliffs & the artillery installations. Enjoy the hikes"], ["Reviewed October 14, 2015", 5.0, "Outstanding views", "We took visiitng family to the Marin Headlands. It is a great place of natural beauty and a break from the cityscape. We were there late morning with the fog enveloping the GG Bridge and covering the Pacific Ocean. A Marin Headlands map is available free of charge at the visitors center with backside maps of Fort Cronkite and Fort Baker). There are many historical military remnants and buildings in the area. There is beach access. There are many bicyclists to watch for on the roads. The visitors center has exhibits about the local area and history and has a small gift shop and restrooms. There are no food facilities in the area. Jackets or sweaters may come in handy for cool winds/breezes.\n\nIf you have a vehicle and the time, a visit to the Marin Headlands may be a highlight of your visit to the Bay Area.\nShow less"], ["Reviewed October 11, 2015", 5.0, "Just across the Golden Gate sits a beautiful natural piece of coastline", "We drove out over the Golden Gate Bridge north toward the Sonoma Valley on a trip out to the wineries and stopped just over the bridge to view the coastline and city. It was the Labor Day weekend and by 8.30am, it was extremely busy and difficult to get a parking spot just over the bridge. However, the view is worth it. The view of the Marin Headlines as you progress up into the drive toward the Muir Woods monument is very beautiful. It feels a world away from San Francisco.\nShow less"], ["Reviewed October 10, 2015", 5.0, "Amazing View of GG Bridge, Go at Sunset", "We stopped here (on a tour with SF Shuttle Tours) on our way back from Muir Woods.\n\nThe sun was starting to go down, and the light and the view of the GG Bridge was amazing - especially for the time of day.\n\nIf we had been on our own, we would have stayed here through the sunset, as it was so relaxing and so beautiful. I bet there's some cool wildlife up here too.\nShow less"], ["Reviewed October 8, 2015", 5.0, "One of the best places to view the Golden Gate and the bay", "Fantastic views, a great place to enjoy the breeze and enjoy the sights of the golden gate. Make sure you bring your camera for this area!"], ["Reviewed October 6, 2015", 5.0, "View the golden gate from a different vantage point", "Marin Headlands offers a different vantage point of the Golden Gate Bridge and has a rich history in the area. Bring a camera and good walking shoes."], ["Reviewed September 24, 2015", 5.0, "THERE IS NO PLACE CLOSER TO HEAVEN!", "A trip to the Headlands is always tricky...and you have to have luck on your side because of the fog. But today was just perfect!!!\nWe went all the way to the top...and then came down to the last viewpoint.\nOur friends from Texas said it was a picture postcard from every angle...and yes, this is where many postcards are actually made.\nI have lived in the area for 28 years AND never get tired of this view.\nShow less"], ["Reviewed September 21, 2015", 5.0, "Amazing views", "Another great place I went to this visit that I missed in my past visits to San Francisco. We came with our tour and it was just after we drove over Golden Gate Bridge. There's limited parking so our guide dropped us off and drove up and came back down to pick us up. We had about 10 minutes so enjoy the amazing views of San Francisco and the bridge. It was busy with tourists but not so packed that we couldn't find spots to take some great photos. I'm glad we came here but I would have liked to see more on the top and check out what would be around. This is one place I will want to come back to!\nShow less"], ["Reviewed September 20, 2015", 5.0, "Put this on your list of places to go.", "The best views of the Golden Gate and the city. We were there by 10am on a weekday and there were no crowds."], ["Reviewed September 19, 2015", 5.0, "Worth the drive up", "We were recomended this viewing spot by a friend. We were just passing through San Francisco and wanted somewhere for a great view on the drive through. Hawk Hill was exactly that place.\n\nViews amazing. Lots of interesting walks. Spend ten minutes for the view or spend an hour hiking.\n\nWe drove up, but lots of people seem to ride their bikes up...\nShow less"], ["Reviewed September 13, 2015", 5.0, "Most beautiful views around", "I absolutely fell in love with the Marin Headlands. The trip up the cliff sides was awesome. My camera almost went dead from all the picture taking. At the top I got wonderful pictures of the golden gate and other fun things. You can see the seals hanging out below. It's really a must see in San Francisco. Coming from North Carolina I had never seen anything so beautiful and majestic.\nShow less"], ["Reviewed September 12, 2015", 5.0, "Best viewpoint for the Golden Gate", "Check it out in the early morning. With fog and sun it is spectacular. It is an easy drive up the hill from the Sausalito turn off from US101. Make sure you go up all the way. Before sun up you need to walk up a part of the hill. It is worth the effort. Watch out for bikes coming downhill. They are fast.\nShow less"], ["Reviewed September 8, 2015", 5.0, "what a gem", "Been to SF before and I didnt even know about this place. Not only are the views of GGB and downtown wonderful but the WWII history is great as is the lighthouse (unfortunately vandalized on Labor Day weekend). Rodeo Beach is fabulous too"], ["Reviewed September 7, 2015", 5.0, "The Marin Headlands ... Remarkable", "Seals of the best kind...approval\nIf you would believe i was lead there by the blind ! Yes, i was lead there by the blind, personally Im not blind but i knew about Helen Keller and we met on a train going to SanFrancisco It was a test of my sobriety and I was thrilled to hear the wild dogs howling in the moonlight and the sound of the foghorns and ships and dolphins but terrified to hear about The Great White Shark in the bay and wasn't to keen to go into the water by advice from local people\nOh and I heard it was a nudist beach?\nHitching to and fro was safe enough but difficult on the one way street but okay to and from Hostel no other choice no buses on weekdays\nAnd the best looking blonde i never met there and excellent views 360 degrees of The Golden Gate Bridge Lovely in the mist\nShow less"], ["Reviewed September 3, 2015", 5.0, "Great view and manageable number of tourists", "On previous trips we drove north on Route 101 crossing the Golden Gate Bridge and stopped at the Vista Point. The view is nice but the area is so incredibly crowded that it's hard to even take a picture. This time, we stayed in Sausalito and drove to the Golden Gate Bridge traveling on Alexander Avenue. The underpass takes you to Conzelmann Road and the Recreation Area. We drove almost to the lighthouse and stopped at various locations and took so many pictues of the Golden Gate Bridge. The first stop (Marin HeadLand Ponto 1) was the most popular. We had to wait a couple of minutes for a parking space. Since there are only a limited number of parking spaces available, this area wasn't too crowded. The other stops along Conzelmann Road were also beautiful and less crowded. For comparison purposes, we stopped on the way back at a parking area that allows you to walk over tothe big Vista Point. Boy was that crowded!\nShow less"], ["Reviewed September 3, 2015", 5.0, "Beautiful! Outdoor hike or drive.", "This is beautiful, preserved land that will not disappoint you! It is surprising that so close to the city is a untouched land you can explore. Bring good hiking shoes and enjoy yourself. Make sure you pack a picnic lunch and drinks as this is not a commercial park.\n\nOnce you've finished your hike, drive to Sausalito and enjoy a bite to eat along the water at Scoma's.\nShow less"], ["Reviewed September 2, 2015", 5.0, "Amazing view of Golden Gate Bridge", "Instead of cycling from the Piers to and over the Bridge and then cycling/ferrying back, we took a taxi from San Francisco to the observation point on the Headlands and then walked back over the Bridge.\n\nThe view from the Headlands is spectacular....a full view of the Bridge with the added bonus of San Francisco (and Alcatraz) as a backdrop.\n\nYou can drive up close to this observation point (limited parking available, then a few hundred metres' walk to the observation point) but a taxi is less hassle (and actually less expensive than renting bikes for a family) and has the benefit of being able to walk back over the Bridge (about 45 mins to 1 hour at a very leisurely pace from the North observation point/parking area adjacent to the Bridge). Once you cross back over to the San Francisco/South side, you can grab a bus to take you back into town.\n\nFantastic way to spend a few hours. And the classic Golden Gate view.\n\nNote: if it's foggy or a little chilly, take some warmer clothing with you. Apparently you will feel the cold (we were lucky, had a perfect t-shirt day, even for the walk back over the Bridge).\nShow less"], ["Reviewed September 2, 2015", 5.0, "Underrated views of the Bridge and SF", "There were so many places to park the car here. Just take a walk to the cliff side, and admire the views. You will not be disappointed.\n\nJust be careful when parking and departing as traffic could get really busy at times, and be aware of the cyclists.\nShow less"], ["Reviewed August 29, 2015", 5.0, "Best Bridge and Downtown View!", "Off of 101 at exit 442 only a few feet beyond the Vista Point turnoff at the northern edge of the bridge. Follow the off ramp about 100 yards to Alexander Avenue. Left onto Alexander, curving under the bridge abutments. Turn right onto Conzelman Road about 150 feet after going under the brifge. Take Conzelman - curving up to observation points on the Headlands. When I was in the area long ago, this used to be called Fort Cronkite . . . That's how ancient I am! This vista gives you a full left to right view of the bridge in its entirety - both towers and through the middle of the suspension cables a great view of San Francisco itself. Even better on a foggy day when the white stuff rolls in, partially obscuring a portion of the structure. Enjoy!\nShow less"], ["Reviewed August 25, 2015", 5.0, "Awsome", "Marin headlands was our last stop after a 4 weeks trip to California and Arizona. And it was great. We stayed at the hostel, visited Sausalito, enjoyed the bay views, hiked in mt. Tamalpais, watched the surfers in rodeo beach and took a guided tour at the marine mammal center (highly recommended)\nShow less"], ["Reviewed August 19, 2015", 5.0, "a great walk if you have a few hrs to kill", "Drive to the headlands and choose from a number of excellent walks during which you can explore the old military sites, enjoy the nature, get excellent views of the golden gate and check out the light house and or old missile sites. A trip to the excellent visitors centre is a good place to start and most points are accessable by car if you dont wish to walk. A couple of points to note check the opening days of the light house tunnel and missile site on line. They are closed some week days( rediculous) the animal rescue centre is worth a look. Lastly if walking stick to the trails and know what poison oak looks like. My daughter didnt and came into contact with it. The detour she made cost me 350 dollars in medical bills. That said a great day out.\nShow less"], ["Reviewed August 19, 2015", 4.0, "Rustic and beautiful!", "A very pleasant are, next door to San Francisco, leaving the 'buzzling' city behind you. Green, cliffs, some nice hikes, beautiful views."], ["Reviewed August 19, 2015", 5.0, "Perfect Views", "I can't say how much fun I had biking through here!!! The views are spectacular and breathtaking but soooooo worth it. I will remember this trip for the rest of my life thanks to the amazing pictures I captured."], ["Reviewed August 18, 2015", 5.0, "Breathtaking view", "Great view of the Golden Gate bridge and surrounding area. Parking available relatively easy. A couple of small hikes."], ["Reviewed July 31, 2015", 5.0, "Must see off the beaten path", "We went here because coworkers of our 20 year old son recommended. Plenty of historic forts and batteries to see. Easy hiking. Great view of the golden gate bridge from here"], ["Reviewed July 25, 2015", 5.0, "Beautiful Simple Drive", "Loved this location. Go early in the morning to look out on some beautiful scenes. It will probably be foggy over the bay and the bridge, but it actually lends itself to a new feeling. Also, there are very few people up at that time-only some hard core bicycle riders! Seriously-they bike up what you are driving up...appreciate! Beautiful way to start your day.\nShow less"], ["Reviewed July 22, 2015", 5.0, "Hike from Muir Beach to Pirate's Cove", "Hy husband and I are in our late 50's and in reasonable good shape as in we work out at least three times a week. This hike was 3.4 miles and beautiful!! The last bit down to Pirate's Cove was a little rough as it was a few hundred yards of straight down rocks. The return trip was much easier. It was really so beautiful and well worth it!\nShow less"], ["Reviewed July 19, 2015", 5.0, "Free Views A Must Stop", "Stopped by on a Friday morning. I just set the GPS to the Marin Headlands Visitor Center and from there I drive around. There was plenty of free parking everywhere. If you like to bike and hike this is a great place. The views are amazing!! There is a lighthouse in the area but it is only open sat-mon. Before you leave the area set the GPS to Fort Baker. You will have the best views of the City and the Golden Gate Bridge.\nShow less"], ["Reviewed July 16, 2015", 5.0, "this is an ABSOLUTE must stop", "on a clear day, especially on a week day. The views are \"to die for\". The views of the GG Bridge will never be forgotten. Drive all the way in to the visitors center. It can get busy with traffic but as much as I hate traffic this road of outstanding views is worth the hassle of traffic.\nShow less"], ["Reviewed July 14, 2015", 4.0, "Beautiful view of San Francisco", "We enjoyed the short hike to enjoy the view of San Francisco. We collect lighthouses, and were a little disappointed that we couldn't go to visit the lighthouse since it has limited hours of operation. However, it is worth the hike."], ["Reviewed July 14, 2015", 5.0, "A different view of San Francisco", "Drive or walk over the Golden Gate Bridge for a fabulous view of San Francisco from the other side of the Bay. The day we were there one of their famous fogs rolled in. It was magical. Like a huge tsunami of fog rolling over the hills.\nShow less"], ["Reviewed July 13, 2015", 5.0, "Hidden gem", "Cross the Golden Gate bridge and take a left on Bunker Rd. This is an old Army base that pro bono lawyers saved from developers in 1972 - I am glad they did! Great hiking trails - visit Rodeo beach and brave the suspension bridge to the lighthouse. The views of the city of San Francisco and the bridge are truly spectacular and worth the hike. This will make you fall in love with California.\nShow less"], ["Reviewed July 10, 2015", 5.0, "A must visit in SF", "Wow... What views... loved it... Found it even better then hawk hill may be coz it's different days different weather hence different views... Do this & then go higher to hawk hill enjoy great SF views..."], ["Reviewed July 7, 2015", 5.0, "If you come to SF: Do Not Skip This.", "My favorite part about going up to the Marin Headlands is the variety of views that you get. I prefer to go up there in the morning at dawn...sometimes as the sun rises you can't even see the Golden Gate Bridge, some days you can see all the way to Oakland. Regardless, it is 100% worth the short trip across the bridge from the city to see. If you take the first right after the bridge (via SF) and make a u-turn (pointing your car west) you can skip a long drive around the headlands (which is what you will be led to by default if you follow the signs). It saves a bunch of time.\nShow less"], ["Reviewed July 5, 2015", 5.0, "The Untouched beauty !!", "I don't think I have enough words to describe the beauty of this place . The views , the vistas , the terrain .. Awesome . We visited this place on July 4th , expecting lot of crowds but there aren't many . The weather was supposed to be clear but it turned very foggy. We visited the rodeo beach near the mammal center and point Bonita light house . Spectacular views everywhere. For parents with little kids , the trail to the lighthouse is something the kids can easily make but be careful as it not a place to let kids run around.\nShow less"], ["Reviewed July 2, 2015", 5.0, "Heady views", "Our San Francisco Comprehensive Shuttle Tour driver, Robert, drove us up here at the end of our Muir Woods Tour for spectacular views of the city, bay and Golden Gate Bridge. Fantastic!!"], ["Reviewed July 2, 2015", 5.0, "WOW! Worth the trip", "I have been to San Francisco several times and have done most of the things to do, but I never went UP the hill to the headlands. I have one word, WOW!\n\nThe view is astounding. Stop at each level if you can, and when you get to the top, make sure to go through the tunnel to the other side of the hill\nShow less"], ["Reviewed July 1, 2015", 5.0, "Beautiful- amazing views!", "Awesome! Great walking around the top of the headlands. We lucked out with a perfect day, sunny and in the 70s. I can understand why this is a top rated thing to do when in SF. Worth the effort!"], ["Reviewed June 30, 2015", 5.0, "Headlands Center for the Arts", "Beautiful location. We stayed at a hostel on location with our entire family for a wedding. We enjoyed the grounds immensely. In the morning and throughout the day we were visited by the local wildlife which included deer, raccoon and an occasional fox. The houses were comfortable and spacious with great kitchen facilities.\nShow less"], ["Reviewed June 30, 2015", 5.0, "Great place to explore - for Free!", "We travel to the Bay area twice a year at least to take our dog to the beach (loves the sand, hates the water). Rodeo beach is right in the heart of the Marin headlands and is dog friendly. It is a hidden gem as you have to work to get to it, but well worth it - the tunnel passage is the least hassle. We wandered up off the beach to explore the casemates that use to guard the coast. Interesting facility and neat to explore. There is actually a connecting trail to Muir beach (about 5 mile hike).\nShow less"], ["Reviewed June 28, 2015", 5.0, "Amazing Bay Area nature", "Our San Francisco Bay Area is a wonderful adventure for nature. The Marin Headlands can be a day or multi-day trip on a bike, walking, hiking, driving, inland or on the water. You will not forget your visit. Bring layers of clothing, and enjoy our glorious sites.\nShow less"], ["Reviewed June 24, 2015", 5.0, "Gorgeous Views!", "My wife & I visited Marin headlands on our recent trip to the 415. Easy to get to and great views. We walked from the main parking in Marin headlands and hiked out to a viewpoint that's not as busy with tourists! We then walked across the bridge and had some great views of the city! A MUST do for anyone visiting the area!\nShow less"], ["Reviewed June 21, 2015", 5.0, "A beautiful gem just outside San Francisco", "Amazing that such a beautiful and rather large area is so close to a huge city. Fabulous viewing areas that are postcard worty of the Golden Gate Bridge are along the ocean drive. The Point Bonita lighthouse is only open certain days & hours, so call ahead if you want to see it.\nShow less"], ["Reviewed June 20, 2015", 5.0, "Best view of golden gate bridge", "This is by far the best view of the bridge and the city you can find. Just a short drive up the hill adjacent to Sausalito."], ["Reviewed June 18, 2015", 5.0, "Beautiful!", "This was a gorgeous and well-preserved historical and natural setting to spend the day! Well-worth the time to see views and nature in this vast area."], ["Reviewed June 18, 2015", 5.0, "Bring your camera for the best views of the Bay Area.", "This 40-year-old preserve is quite extraordinary, assuring that development will not despoil one of the richest natural resources left in the country, only a half hour's ride from the City of San Francisco. The hiking trails are a wonder, with breathtaking views of the Golden Gate, the Bay itself and the Farallones.\nShow less"], ["Reviewed June 17, 2015", 5.0, "find the real charming of the city view of San Francisco", "i was firstly knowing this place by seaching some topic about golden gate bridge view. but when we really got there, especially when we came across a walking tunnel and see the \"hawks hill\" sign, it just hitted us so much. the headlands winds its way into the outside part of the bay and the Pacific Ocean, the perfect view of both the sides of the ridge, the historical military facilities, the lagoon, the sound of the ocean tides at somewhere back on the mountain where almost nobody comes.... it just expanded our expierence of san francisco so much, with less than 30 mins drive form the city.\nif you go to san francisco, i thinks this might be the 1st ranking of your places-must-go list.\nShow less"], ["Reviewed June 10, 2015", 5.0, "You haven't truly seen San Francisco If you have not been here", "The view is stunning and never gets old! seems pretty surreal to be at such a perfect distance from the Golden Gate Bridge. Tourists and locals flock here to get the best views of the city. I would suggest eating a sandwich while sitting on the benches overlooking the bridge-it's quite therapeutic. It's also a great place for bikers (tough ride though) and a scenic route for people who want to cruise by. I highly recommend it.\nShow less"], ["Reviewed June 8, 2015", 4.0, "Best views of San Francisco", "Truly stunning views of San Francisco and the Golden Gate - lovely winding route to the headlands, and some stunning walks at the end of it. Well worth the detour."], ["Reviewed June 3, 2015", 4.0, "Beautiful and crowded", "Great views of San Francisco, the Golden Gate Bridge, the Pacific Ocean and SF Bay! There are old, WWII era artillery bunkers overlooking the entrance to the bay as well plus some hiking trails. Be alert because there are cliffs as well. Unless the weather is bad, you will experience crowds. This is a very popular place for locals and tourists too.\nShow less"]]}}