{"Mission Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Mission Beach", "url": "/Attraction_Review-g60750-d104125-Reviews-Mission_Beach-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/12/43/f1/mission-beach.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1802"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "92109", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Long wide beach", "I took a long walk down the beach which I love to do. Not many beach side stores were open early on a foggy Friday but I did go in a beach ware shop which offered suits, towels and all sorts of beach things. Lots of foot traffic on the beach and I would imagine a good weather days would call for lots of people on the beach. Lots of room to sit on the sand, run on the smooth sections and you can walk a ways in the water without it getting very deep.\nShow less"], ["Reviewed 1 week ago", 1.0, "Stay ALERT", "Have always enjoyed this area of San Diego, but over the last two visits saw a lot of homeless and drug exchanges in broad daylight- on the stairway across from Tower 23. Stay alert, as police haul off some undesirables, so not on list to return to this beach again.\nShow less"], ["Reviewed 1 week ago", 4.0, "Perfect Place to Relax", "Had a brief visit while in town for work. Rented bikes at a small gift shop and rode up and down the boardwalk. It's a beautiful beach with a relaxed atmosphere."], ["Reviewed 2 weeks ago", 4.0, "Great Beach", "Although you are spoilt for choice in San Diego, Mission Beach is a great choice if you are looking for a lively Beach with lots of amenities and even a theme park nearby. Can’t say this is a must visit but it’s a good choice nonetheless.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Loved spending time here", "I really enjoyed walking up and down the boardwalk and walking along the beach! Tons of interesting shops and neat restaurants along the beach."], ["Reviewed 3 weeks ago", 5.0, "Great beaches", "The boardwalk is great for walking, running or biking. There are great places to get coffee or have a meal. The roller coaster is awesome"], ["Reviewed 3 weeks ago", 5.0, "Long sandy beach", "Very long, sandy beach, not very crowded during the week, so you are able to find a quiet spot. The water in September was quite rough and not very warm, but it was good to cool down after sunbathing. A lot of beach shaks and bars along the walking street.\nYou can easily walk between the Mission and Pacific Beach\nShow less"], ["Reviewed 3 weeks ago", 5.0, "beautiful beach", "really well kept and clean. Nice stores near by. free parking and its close to belmont park. good for any age to enjoy easy access to the beach. Loved it"], ["Reviewed 3 weeks ago", 5.0, "HIGHLIGHT of our trip", "A must see. I'm tearing up just trying to find the words to explain what a wonderful experience it was. All ages, just a cpl hours, but it was perfect for our family. Lemonade, Funnel Cakes, Arcade Games, Hot Dog on A Stick, new beach blankets and flip flops, lots of hugs & kisses. Bathroom stops and rollar coaster shouts, warm sunny day, waves crashing, clean sand, smiles. <3\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Early morning walks", "We were renting a VRBO on mission beach and one of the highlights of the day was our 7am walks. The sun just hitting the breakers - the surfers and volleyball players already active that early. The beach is huge and felt safe. It was too cold for swimming in January, but perfect for strolls.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "The Beach", "The beach wasn't the greatest, but it was nice considering the weather was was warm. It was very relaxing. You will need to bring your own chairs."], ["Reviewed 4 weeks ago", 5.0, "gorgeous!", "Loved this beach and vibe! Fun little amusement park, and the shops are lovely. The Mexican restaurants around you cannot beat anywhere. Then the open beautiful beach just tops everything off! Definitely a must see!"], ["Reviewed 4 weeks ago", 4.0, "Charming, Deserted Beach", "We came to Mission Beach on a pleasant sunny morning, expecting large crowds at a well-known beach, but there was very few people in the area. We essentially had the place to ourselves for the hour that we stayed. We felt the cool waters of the Pacific, ran along the sand, and walked the nearby boardwalk. Natural beauty and human development comes together to create a satisfying aesthetic in the area. Mission Beach is a worthy stop in Southern California, although maybe not a spectacular highlight unless you immensely enjoy beaches in general.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "All Along The Waterfront", "Whenever we visit San Diego, we make sure that we amble along the Mission Beach boardwalk and park areas. The sunrise and sunsets are beautiful."], ["Reviewed January 24, 2018", 5.0, "My beach of choice", "Mission beach I think is the best beach in th San Diego area. It has rides for kids, the warehouse with wave simulators for older kids/adults, Draft House, Sushi, and many great on the beach restaurants. The beach is very clean and lifeguards are there during the swimming season.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Vacay", "Fun, clean beach. Plenty of seashells to keep the kids busy collecting. Plenty of shops and restaurants within walking distance."], ["Reviewed January 22, 2018", 5.0, "Enjoy privacy as you relax in the sun splashed SoCAL SUN!", "Great place to relax and enjoy the beach and people watching. Plenty of room to set up your little slice of paradise!"], ["Reviewed January 21, 2018", 5.0, "One of the best beaches in Southern California", "It is clean, fun, and family-friendly. Great for people watching! Grab a slice of pizza and head to the beach. You will have a blast!"], ["Reviewed January 14, 2018", 5.0, "Sun, surf sand and lots of fun", "Large expanse of beach stretching more than a mile with areas designated for surfing and swimming, patrolled by life guards plus volleyball areas with embedded posts(bring your own net) There is a pathway along the entire beach area for cyclists, skate boarders, joggers, etc which is walled off from the sand. Great for walking at low tide and collecting sand dollars. The main area has an amusement park, concessions and a number of eateries. Crowds abound in summer and parking can be problematic.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Great Beach area", "I when to Mission Beach boardwalk had a great day enjoying the walkway and beach area clean a lot of space to walk along the sand as well as great housing to stay at and other things to do there. When I come back this is my Beach spot!!\nShow less"], ["Reviewed January 11, 2018", 5.0, "ANOTHER WONDERFUL BEACH", "Not my favorite beach but really nice Good beach to walk. Too cold to swim on the day we were there. We visited 3 beaches while in San Diego, In front of the \"Dell Coronado\" was our favorite, for \"the beach\""], ["Reviewed January 9, 2018", 5.0, "Sand, Sun, Sea and Food", "Great beach, great food, great drinks..you can walk, bike along the beach on a paved sidewalk, stop at any one of the dozen or so places to eat and drink.."], ["Reviewed January 8, 2018", 1.0, "Police State", "We stayed on the boardwalk on Mission Beach for a family reunion for six days. Unfortunately, the beach is patrolled by undercover cops like something out of the book 1984. Big Brother is everywhere through undercover police, cameras, etc..., Both tourists and homeless were harassed by the police. It was not what we expected. It was an extremely unwelcoming atmosphere and we will not return.\nShow less"], ["Reviewed January 4, 2018", 4.0, "wow", "I believe this is the beach with the boardwalk. Even though their boardwalk is cement and not wood, it was like going to the Jersey shore. Loved that they had so many options for our family."], ["Reviewed January 4, 2018", 4.0, "Great Beach with Hidden Parking", "With a wide beach and a long boardwalk, this is beach is one of my favorites. The south end has Belmont Park with its shops and facilities. The north end has many bars and restaurants to enjoy. In between, is a long mile of beach. Rent a bike or walk the boardwalk. Sit and watch the parade of people. Make a full day of it with your beach chair and sunscreen. Street parking can be difficult but try the two large free parking lots on the bay side at El Carmel or Santa Clara Streets.\nShow less"], ["Reviewed January 3, 2018", 5.0, "The perfect combination...", "Inside the continental US, I don’t know that there’s anywhere that I’d rather be. Beautiful beach, beautiful people, great food and an amusement park. What could be better?"], ["Reviewed December 24, 2017", 5.0, "White Sand Beach without the Crowd is a Good as", "It’ll ever Get. Unfortunately, there are just a lot of birds flying over and one did “poop” a real good job on my right side of the neck!!\n(But not at the beach, just after getting off the bus while walking there). Some beach touristy shops but people on beach chairs reading or snoozing or cycling or strolling or socializing. We had wanted to see more of the beaches but this one was great just to step onto the white sand to grab a few snaps or ground ions.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Bike Ride", "Rode my bike all over the area with friends, great day. We stopped along beach to eat and restrooms were accessible."], ["Reviewed December 21, 2017", 5.0, "Amazing beach", "The birds and sea creatures are so accustomed to people that I was able to get right up to them, it was a unique experience. The beach is clean and loaded with various shells if you enjoy collecting them. The other people were friendly and everyone seemed to be having a great time!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Fun Beach", "Took the kids here for the day and had a blase. Wet to the amusement park and walked the board walk. The beach is clean and we had fun walking up and down the board walk"], ["Reviewed December 17, 2017", 2.0, "Once was great - has changed over time!", "This once was a great part of San Diego to visit and stay, but now too many homeless, and drug deals in this area to make it a destination point. Across from Tower 23 is a place to avoid."], ["Reviewed December 17, 2017", 5.0, "Beautiful Beach", "My favorite beach in San Diego. NY has Coney Island and CA has Santa Monica Pier. Also Venice Beach.\n\nMission Beach offers several great tourist attractions. From a roller coaster to amazing shops. The ocean water is very clean. If you are a surfer the waives are a hit or miss. Mission Beach is kids friendly. Overall Mission Beach is one of the best places in San Diego to enjoy a swim or just relaxing on the beach.\n\nMission Beach is located between Ocean Beach and Pacific Beach. Just minutes away from Sea World. If you are looking for great mom and pops stores you will find it at Mission Beach. You have great fast food to restaurants. Mission Beach has the Venice Beach vibe without being so overcrowded.\n\nMission Beach offers several parking options. You have street parking and city lot parking.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Family Friendly Beach", "This is such a great place to visit in San Diego with kids. The Boardwalk is perfect. It included restaurants, bars, a theme park, arcade, ice cream shop, and much more. It is a family oriented beach so great for the kiddos."], ["Reviewed December 2, 2017", 3.0, "Still beautiful but very crowded, and facilities poor", "Went here for sunset and although the beach is still lovely, the narrow boardwalk was chaotic, with walkers, joggers, cyclists, skaters and god knows who else all in the same place.\n\nThere are also very few places to eat and drink overlooking the beach now, with Cannonball having taken over even more space.\n\nAs for getting a taxi well it’s a nightmare. Our advice is if you’re coming here from elsewhere don’t do it unless you have a cab organised to pick you up. We had to walk to the Bahia Hotel to organise one and even then it took half an hour.\n\nAlso if you are walking in this area street lighting is poor and pavements/sidewalks are uneven so be careful.\n\nBelmont Park amusement park is still here with its wooden rollercoaster, but generally our advice would be find somewhere else to watch the sunset!\n\nGutted as this has always been one of our favourite places......\nShow less"], ["Reviewed November 29, 2017", 5.0, "A true beach holiday", "You have lots of choices here at Mission Beach. You can surf, do yoga, play volleyball, sit in the sand or walk the boardwalk. Whichever option you choose, you'll not be disappointed. We walked, talked, and shopped in the area. The weather was amazing and this was a perfect destination to soak in the rays and enjoy the people watching.\nShow less"], ["Reviewed November 29, 2017", 4.0, "water park", "Family oriented. Have been here many times. Love that they have things for the young and old to do. Has a couple ocean front restaurants. Nice to watch the sunset from inside and out."], ["Reviewed November 26, 2017", 5.0, "Very large beach with many surfers and swimmers.", "It is one of the more popular areas for surfers. Besides regular beach activities, you'll find yoga and surf school lessons. Dogs are allowed at certain times (early am and late pm). In the water you'll commonly see seals, sea lions and dolphins. One year we saw a whale, too. Perfect for just walking, too. Just off the beach there are bike rentals, surf rentals, restaurants and bars. Great place.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Lot's of fun attractions!", "Mission beach is a perfect place if you're looking for a fun and unique atmosphere. There was never a dull moment and it's a beautiful area. Best time to go is when there is a farmers market going on, great food and local attractions!"], ["Reviewed November 19, 2017", 5.0, "Great walk and views", "This is the best beach in San Diego in my opinion. Easy access my car or public transportation. Fun amusement park area. Spacious boardwalk for all to enjoy. Lifeguards available for swimmers and surfers. Lots of sand space for sunbathers and people to play ball. A lot of beach volleyball available too. This is a beautiful beach with lots of space. Check it out for sure!\nShow less"], ["Reviewed November 17, 2017", 5.0, "Beautiful beach", "We went in November, did not enter water. Watched surfers, waves, sunset. Beautiful! Had lunch just off beach, delicious fish tacos."], ["Reviewed November 16, 2017", 5.0, "A delightful walk.", "We used the easy public bus from Old Town to Mission Beach, checked out the historical wooden roller coaster at Belmont Park, then walked the couple of miles along the Ocean Front Walk to the Pacific Beach Pier before taking the bus back to the Old Town Transit Center. A thoroughly delightful morning along a gorgeous beach.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Everything is right here!", "Great beach if you want a little bit of everything! There's sand, surf, a gorgeous walk, an amusement park nearby and so many shops and restaurants it's hard to choose!"], ["Reviewed November 8, 2017", 5.0, "Perfect for Enjoying Sand, Surf, Boardwalk Activity, Shops, Restaurant, & People Watching", "Here is you ideal spot to enjoy San Diego's beachfront. The biggest challenge we had was finding a parking spot on a weekend visit, but parking was free. Beach open to the public and crowded. but not overly so, on a sunny Saturday. The concrete boardwalk runs about three miles with plenty of shops and restaurants.There are many places to rent beach and boardwalk toys, bikes, skateboards, skates, paddleboards, etc. If you time your visit correctly, you may enjoy a beautiful waterfront sunset view.\nShow less"], ["Reviewed November 6, 2017", 5.0, "A Popular Beach", "Mission Beach has a lot offer. The boardwalk is a great place to get exercise. If there are two many cyclists and skateboarders, you can take your shoes off and walk on the beach. The closer you get to the waves the more compact the sand gets. Even in November I waded in the cool water. I started my walk at the Crystal Pier and walked all the way to Belmont Park. I think it took about 40 minutes. The bars were open but most of the sweet treat places were closed. If you walk along Mission Blvd. or around Belmont Park you will be able to find food and treats.\nShow less"], ["Reviewed November 3, 2017", 4.0, "Lovely sandy beach", "This is a very long and sandy pbeach which has many shops and eateries nearby. We watched a beginners class on their surfboards on sand before they hit the ocean. Many appartments overlook the beach in what seems a nice beach area."], ["Reviewed October 30, 2017", 4.0, "Have e some history here.", "I went to San Diego State party school....ahh...I mean college and live a little while in La Jolla then moved to Mission Beach for a couple of years.\n\nBack then, there weren't any good restaurants other than a couple of great Mexican food stands, the park with the roller coaster was open but falling into disrepair and days were filled with partying, sunning, roller skating down the board walk and of course watching the girls go by. Life was good.\n\nThen the park closed, some gangs moved into the south end of the boardwalk and it didn't look good for the place, which had changed.\n\nNow, the developers moved in building nice condos and apartments, several good restaurants opened and most importantly the park was brought back to life. There they opened a boardwalk side bar with a cool wave pool which is pretty entertaining and has good breakfasts and lunches and the beach is fun again.\n\nIt's a huge beach (wide) with soft waves so is great for sunning, swimming, families and being seen, in all your glory.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Gorgeous Beach", "This beach is beautiful and huge. You can walk forever. It’s located in a nice area with small shops and places to eat. I highly recommend going there."], ["Reviewed October 26, 2017", 4.0, "Caution when walking the boardwalk.", "What's not to love about walking a board walk? The crazy cyclists. Take care as they don't yield to pedestrians and do run into people. My husband was alert and couldn't get out of the way of a cylcist and ended up getting hit by one.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Huge beach!", "This beach is huge, very wide and you can walk for miles. There is an amusement park at one end and a paved walkway the entire length of the beach. Very clean and a fun way to get some exercise."], ["Reviewed October 13, 2017", 5.0, "Great Area", "Love Mission Beach !! Have been here several times and never disappoints. The boardwalk is family friendly and you can ride bikes to La Jolla. Plenty of restaurants, bars, and snacks along the boardwalk.\nBeaches are clean and feel safe there at night.\nPaddle board mission bay for fun time.\nPlenty of activities to do.\nShow less"], ["Reviewed October 12, 2017", 5.0, "I Love this Beach!", "One of my favorite beaches in San Diego! I think one of the best things about this beach is the versatility.\n\nWant to ride a bike or rollerblade?\nGo for a walk or a run?\nRide rollercoasters and play mini golf?\nGrab a bite to eat?\nSunbathe?\nGo for a swim?\nPlay volleyball?\nTake fido for a walk on the sand?\nBuy touristy souvenirs?\n\nYou can do it all at this beach! We stayed at a VRBO rental across the street from Belmont Park 3 different times (November, May and July). I recommend this beach and area, it has a fun and laid back California vibe to it.\n\nOur favorite thing to do here was take a look walks on the paved path next to the beach. You can take in the beauty of the ocean without struggling to walk on the sand.\n\nThere are many restaurants near Belmont Park, these aren't fine dining establishments, but it's quick and fairly friendly on the wallet.\n\nThere is a pretty good amount of free parking here, but it was insane here on the 4th of July weekend, so be here super early on holiday weekends!\nShow less"], ["Reviewed October 9, 2017", 5.0, "Amazing beach!", "Sun, sand, beautiful woman, great places to eat and drink - this place has it all. You can just walk along the two mile trail and soak up the scenery or you can go into one of the many bars and food places. There are also roller coasters, amusement arcades and many other activities to keep you entertained.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Its the BEACH!!", "Who doesnt love the beach??? So much to do, the sand is so soft and the nice ocean breeze gets me everytime!!!"], ["Reviewed October 5, 2017", 5.0, "Fun in the Sand", "We stopped here for a couple of days to recharge after wine country, couldn’t be more perfect. Great beach, plenty of energy and fun, food and shops. Not a pretentious area, but well kept. Lots of athletic outdoor activities! Will be back!"], ["Reviewed September 28, 2017", 4.0, "Great beach", "As far as beaches go this is a good one. Lined with places to shop and dine, this is worth a visit if you find yourself in San Diego."], ["Reviewed September 26, 2017", 5.0, "Beautiful", "Beautiful beach. Large, wide, clean. Plenty of shops and restaurants located here next to a massive park. Decent parking, but can be problematic. Would highly recommend if you are seeking a nice place to spend the day, or even simply a stroll."], ["Reviewed September 25, 2017", 5.0, "Let's take a stroll", "Take a walk around it is worth it. You never know what you will spot!! A kayaker, a SUPer or even a rowing team. You may even see a sea lion or a flying fish."], ["Reviewed September 24, 2017", 4.0, "Great San Diego, CA beaches for the entire family", "Mission Beach is great for sun tanning, swimming, and walk/bike up and down the strand. Something for everyone in the family. A great place to visit while in San Diego, CA."], ["Reviewed September 23, 2017", 5.0, "Beautfiful, clean, family friendly beach", "We loved visiting this beach while in town for a friend's wedding. There is plenty of beautiful beach to relax on and many restaurants, bars, and vacation rentals in the area to enjoy."], ["Reviewed September 23, 2017", 5.0, "Great beach", "Great beach, lots of tourists, lots of easy waves for surfing. Nice to walk along the promenade looking at all the nice beach houses wishing you lived there!!"], ["Reviewed September 21, 2017", 5.0, "Nice Sunset", "I was on a business trip and I was able to visit the beach. The sunset is amazing specially when seeing from one of the restaurant that offer out side seating."], ["Reviewed September 18, 2017", 5.0, "First time we had seen the Pacific Ocean.", "We had fun in the water from young to old. We walked the sidewalk to see the sights. We went to the amusement park and shops and had a good time."], ["Reviewed September 18, 2017", 5.0, "Nice beach", "Nice beach, soft sand, not too crowded. Water was cold but doable. Good people watching between surfers and little kids and all."], ["Reviewed September 17, 2017", 4.0, "Great beach and boardwalk. Parking is horrible.", "This beach is always a great place to enjoy a sunny San Diego day. The boardwalk is great for walking, running, biking, skateboarding, skating, etc. my daughter especially loved the huge ice cream that she got on the boardwalk. Beware, get there early because parking is a bear.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Chilled", "This is a must beach to go see in San Diego. I was able to finally play in the pacific beach. The day I went it was kinda cloudy so of course the water was kinda cool but when the sun came out it was just right and the sand was hot and refreshing to sit and look at the water. Excellent place to go surfing the waves was intense especially since I'm a rookie still at surfing. Try and go hear during the week to avoid the crowds during the weekend.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Clean, Fun, Safe, and Tasty!", "Thank you San Diego for reviving the Mission Beach and Belmont Park area! Our family visited on a Friday afternoon and ended up staying until after dark.\n\nThe beach was clean and the kids loved how soft the sand was compared to Carlsbad Beach. The boardwalk shops and snacks are a fun option if you need a break from the sun. We chose fresh squeezed lemonade from Hot Dog on a Stick.\n\nOnce the sun went down we changed clothes at the public beach restrooms. The restrooms weren't great, but were not worse than most park restrooms.\n\nWe chose to stick around and eat dinner at Draft on the boardwalk. Family friendly and fair prices. The Nachos were AMAZING and so huge that they fed 3 adults.\n\nBefore we left we strolled the boardwalk and listens to street performers with a backdrop of family campfires and waves crashing on the beach.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great Clean Fun", "My grand-daughters and I visited Mission Beach for the first time and it was awesome, nice and clean, the deli's and restaurants were clean, we saw no homeless or trouble what so ever. We stood there all day and the people were so friendly. I adv my friends that were there this last week to visit this beach and they did and said it was great.\nShow less"], ["Reviewed September 13, 2017", 4.0, "Fall Walk on the each", "The beach was beautiful and walking was delightful especially when we were watching the sunset. I enjoy watching children playing in the sand and the runners enjoying an evening run."], ["Reviewed September 11, 2017", 4.0, "Great spot", "This beach is not the best in the area and the locals tend to steer you away but it is a very nice location to enjoy the outside. We will be back to enjoy it again."], ["Reviewed September 11, 2017", 5.0, "Best part of our vacation!", "We spent two days of our SD vacation here and wish we could have spend a few more! Great selection of restaurants and things to do. The boardwalk make getting around easy and the sunsets were phenomenal!"], ["Reviewed September 10, 2017", 4.0, "Cali beach", "It was a first Southern California Beach visit, and it didn't disappoint.\n\nAuthentic Cali vibes, on a clean beach, with clean public restrooms and showers and with plenty of options to shop and eat just near the beach.\n\nTotally recommended to stroll on between the houses and streets near the beach.\nShow less"], ["Reviewed September 10, 2017", 5.0, "fun", "Great waves, plenty of rentals for boogie boards and surf boards. Plenty of restaurants around. It is pretty crowded and hard to park"], ["Reviewed September 7, 2017", 4.0, "Good sandy Beach but calls for shore maintenance efforts", "Mission beach is a sandy beach with lot of sand crabs.\n\nIt is a beautiful beach indeed but calls for more efforts towards cleaning & maintaining the shore area. Sun Set view was worth watching. We went for a long walk down the seafront and enjoyed although felt tired.\n\nFinding a parking place was difficult but we were lucky to get one after going around for about 20 minutes.\n\nThis is good for visiting in a large group and have some music, food & fun together.\n\nLifeguards are present on duty.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great fun and a beautiful beach", "We went to Mission Beach for the first time this weekend. It was Labor Day weekend so it was really crowded and we still had a great time. The beach had the softest sand and lots of sand crabs. Our kids had a great time looking for sand crabs. We played in the waves. There was plenty of life guards on duty. Its just a great, beautiful beach.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Labor Day beach fun", "Fantastic visit to watch son become a Marine and then spend Labor Day weekend on the beach. It was hot but fun 👍"], ["Reviewed September 4, 2017", 4.0, "Intersting place.. bonus of free parking by the roller coaster park", "This was a little different to what I was expecting, having been to some of the beached up in south LA and around La Jolla I thought this area (sea front) was somewhat run down, it's quite a large beach area and I may have only been to a small section. We went for a long walk down the seafront, difficult due to the rollerblades and bikes swarming all over the place. We didn't spend any time on the beach it's self which looked nice, it wasn't on parr with the others I visited\nShow less"], ["Reviewed September 1, 2017", 5.0, "Fabulous place", "Ok, so it's a big sandy beach with big waves, what's not to like. Loads of lifeguard cover, loads of bars, cafes, trinket & beachware shops, promenade full of characters (especially Mo with his unique roller-blading style). If I could, I would spend the rest of my days there.\nShow less"], ["Reviewed August 28, 2017", 3.0, "nice easy access beach", "This beach is nice and warm (water is warm) in the late summer, but we went in early August, if you go really early and weekday, you'll be fine. But if you go on the weekend or later on in the day, boy was it hard to find parking. It was impossible to find parking, after about an hour, we left and went a few miles down the road, parked somewhere else and paid and walked a few blocks to the beach. Its really busy and can be a little dirty if there's too many people. so plan ahead or maybe have an alternate beach in mind just in case. But kids did love it and played in the water for a long time.\nShow less"], ["Reviewed August 28, 2017", 4.0, "fun beach", "this is another good place to check out if its you're first time in san diego or simply haven't been to this beach. it's good place to grab food while having the view of the ocean, people walking around, in their bikes, their skateboard or the people enjoying the beach.\nShow less"], ["Reviewed August 27, 2017", 4.0, "Great beach", "We stayed fairly close to this beach while on Vacation. It was a little busy, but not too bad! There was plenty of space of all who were there, and we were never over crowed. They have marked spaces on the beach for swimmer and Surfer for safety. We enjoyed hanging out on this beach very much!\nShow less"], ["Reviewed August 25, 2017", 4.0, "Beautiful beach", "We visited this beach for the day and loved the area and the beach was lovely. Busy but not so much you couldn't comfortably find a spot for a week day."], ["Reviewed August 24, 2017", 5.0, "Festive beach place", "WE went here for the invitation of the fund raising of Bibak San Diego youth which started from 12 noon till evening. The CP map was helpful for finding the location but for a while we have to wait for a parking space while the morning crowd were just leaving the place. The burger hotdog fund raising was in the greens and there were several groups who were doing their activities too. The beach was likewise full of people that gives a festive atmosphere, The toilets were clean and a guardhouse was prominently located. a great place for anything..\nShow less"], ["Reviewed August 24, 2017", 4.0, "Beautiful Beach", "One of the great beaches in San Diego. This is a good place to relax in the sun and watch the beautiful people. Some very good beach commercial development in the neighborhood."], ["Reviewed August 24, 2017", 5.0, "1st timer", "First time to the ocean. Clean area but it can be crowded. Lots of choices for quick bites and equipment rentals."], ["Reviewed August 23, 2017", 5.0, "Can't get enough of San Diego's beaches!", "We spent the better part of the day yesterday at Mission Beach. We met some family there. and we all had a great time! There are lifeguards posted, plus the sand is clean and the water is wet."], ["Reviewed August 23, 2017", 2.0, "dirty crowded", "not what I was hoping for. Doesn't measure up to the other beautiful beaches in the area. parking difficult"], ["Reviewed August 23, 2017", 5.0, "Beautiful beach", "My husband and I rented kayaks and were able to paddle over to the beach and we were glad that we did! The sand was really soft and the water was pretty clear."], ["Reviewed August 23, 2017", 3.0, "Good", "Beautiful one, but nothing special. The water is not like a la Jolla but is clean. You can enjoy around the beach."], ["Reviewed August 22, 2017", 3.0, "A surprise", "We were visiting from the east coast.\n\nI was looking for an awesome beach. Mission beach is crowded and dirty. People do not clean up after themselves.\n\nThe algae and the temperature of the water, cold, was also a surprise.\n\nThe shops and restaurants were plentiful. Something for everyone. However not what I expected.\nShow less"], ["Reviewed August 22, 2017", 5.0, "coranado beach", "awesome place, would go back. beach was clean , drinks available, chairs to rent towels too. highly recommend this place"], ["Reviewed August 20, 2017", 4.0, "Beautiful San Diego beach", "This is a very nice beach. The sand is fine. This beach is also a very good sunset spot. Parking can be hard to find."], ["Reviewed August 17, 2017", 4.0, "The most commercialized beach we visited in SD", "Though all the beaches we visited in San Diego had some shops/restaurants, Mission Beach was the only one with a huge shopping center, so how you feel about commercialization may affect your opinion of the place. The good aspect was that if you park at the shopping center, there are plenty of free spots, and the beach is much like Ocean Beach or Pacific Beach since they share the same coastline. The shopping center and the nearby amusement rides made this area a bit more crowded, but with so much beach space, it wasn't a problem; there was room for everyone. The nice park beside the shopping center had some picnic tables and grassy area, which might be nice for those who get tired of all the sand.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Great beach with lots to do", "The beach is very nice and there's lots to do around it. Belmont park with a roller coaster is right next door, and there's many souvenir shops and restaurants. My favorite thing about this beach is the fire pits in the sand. Great for cook outs and bonfires. However, this beach is not my favorite in San Diego because I found it dirtier and geared towards tourists. Restrooms were disgusting, definitely some of the worst I have been in.\nShow less"], ["Reviewed August 14, 2017", 5.0, "family friendly and clean", "Very clean and life guards. Water was relatively warm as people were in their without wet suits or shorties having a great time on body boards, swimming and surfing. Great green space behine beach front and volley ball courts galore. On the other side of the main road is Mission Bay where the waters are calm and kayaks and SUPs could be rented. Our family of teens really enjoyed in as did we as parents. Much more family oriented and much cleaner then Venice beach!\nShow less"], ["Reviewed August 13, 2017", 5.0, "Waves!", "Visit this place often as we stay walking distance to it. You can get anything and everything in this area. We rent chairs and umbrellas at Hammels and always stop at the wave house for fish and chips. There does seem to be lots of parking around Belmont Park not sure if there is cost involved. There are some shells and sand dollars for the treasure hunter.\nShow less"], ["Reviewed August 12, 2017", 3.0, "Very crowded", "This beach was very crowded even on a weekday afternoon. Also has lots of seaweed. There are better beaches to visit."], ["Reviewed August 12, 2017", 5.0, "Scenic Bike Ride Around the Bay", "We had a great 17 mile bike ride around Mission Bay. Most of the ride was on bike path which was in good condition. There were many places to stop and rest. You can rent a bike if you didn't bring your own."], ["Reviewed August 11, 2017", 5.0, "Water was Cold", "My kids had a blast here... The water was to cold for me but they did not want to leave the water. The beach was clean with plenty of space. We came two times. I wouldn't recommend on a weekend but the weekday was a lot less people.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Super beach", "Not quite as crowded as some of the other beaches and surrounded by homes rather than hotels. Parking is hard to find but there are miles of spaces so look hard. Handicapped can use ANY HC spot so if a business has no parking signs up and has a HC spot it is fair game. (Use at your own risk, could be towed anyway, mine was not)\nShow less"], ["Reviewed August 8, 2017", 3.0, "Too many people", "I've lived in Cal before & this was just too many people; took over an hour to find a place to park, so that person was NOT happy."], ["Reviewed August 2, 2017", 4.0, "Great Beach", "Such a nice beach, the kids loved jumping in the waves. walking in the ocean it is not to deep at first. Lots of things to do around the area. Watch for surfers"], ["Reviewed August 1, 2017", 5.0, "Mission beach - relaxing and fun", "Just being on Mission Beach with the surfers, wave boards, families, couples, friends having fun is what live is about. So much activity but relaxing at the same time."], ["Reviewed July 31, 2017", 5.0, "Great beach for kids", "A lovely beach for families with kids. The waves are brilliant and they would gladly spend hours in the water. Decent restaurants and shops close by if needed. I would recommend this beach if in San Diego."], ["Reviewed July 31, 2017", 3.0, "Clean and not too crowded", "Rented a house in Mission Beach for a family vacation. The beach itself was thoroughly enjoyed by all. We were located a few blocks south of the public parking lots and Belmont Park. While the beach in that area was crowded, our section was not crowded. The beach itself was clean, the water was fairly clear and the children in the family were fascinated by the kelp washed up on the shore.\nShow less"], ["Reviewed July 28, 2017", 3.0, "Probably seen it's better days!", "I'm sure Mission Beach was quite the spectacle about 50 years ago. Now it appears somewhat wore out and run down. I get the vibe that people still keep going there , so why invest in improvements. It's very busy , so you will fight the crowds to sit on the beach. Good luck parking! The boardwalk is pretty mediocre. We didn't actually experience Belmont Park. I can't answer to how that experience is. It just wasn't that appealing from the outside.\n\nNothing to write home about. At least Pacific Beach tries to keep up with the times.\nShow less"], ["Reviewed July 22, 2017", 5.0, "One of best vacation beaches", "We come every year on vacation to this beach. Its clean, not too crowded, well staffed by life guards. There are alot of places nearby for food and drink and beach rentals. Belmont Park is the local amusement park and I would highly recommend going here as well. Very safe place for kids and adults!\nShow less"], ["Reviewed July 21, 2017", 5.0, "Better than Sea World", "Mission Beach has a roller-coaster, bumper cars, arcade, and a bunch of carnival style games. There were plenty of places to eat, and there was even zip-lining. The beach is literally right there, no pay for parking. The water was nice, and there was plenty of beach space to hangout. I compare this sort of to the Venice and Santa Monica beaches, given the fact there was a lot of entertainment and attractions. The big plus is that the beach is so close to everything else. Mission Beach is about 10-15 minutes from Sea World.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Graet beach and family fun nearby", "Beautiful, safe beach with an amusement park next door. Plenty of free parking. Changing rooms and good resturants"], ["Reviewed July 21, 2017", 5.0, "Quick day visit", "I love this beach. It has shops all along the boardwalk and folks are riding bikes and skateboards as well as walking. The restaurants that are on the beach there are very nice and there is a variety of food to eat. Oh, did I mention that is an amusement park too! It is very nice and I would recommend a stop there if you are in the San Diego area.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Sand, sand and more sand!", "Located beside pacific beach, mission beach is a continuation of the soft sand waterfront. Lots of room for lounging on the beach or splashing in the ocean. Great views of both the crystal and ocean beach piers and only steps away from Belmont Park. Look for parking by Belmont and the walk to the beach.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Crowded but fun", "Spent an afternoon sunbathing and swimming at Mission Beach in August 2016. It was very hot and there were strong waves that day. The lifeguards were watching swimmers very closely because of the undertow, they even had someone on a seado. I felt safe.\n\nIt was pretty crowded but people were chill. The only negative is that you can't drink alcohol on public beaches in San Diego (it's legal where I live, so that was quite a bummer).\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great day at the Beach", "Took our family visiting from Tennessee and they loved playing in the waves. Had to watch for the sting rays and shuffle our feet when we went in the water. The beach is so wide and there is good parking but is a trek to life guard tower#30 where swimming is allowed. It was a perfect place to bring g our out of town guests.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Great Place to Spend the Day", "Whether you're looking for calm water (on the Bay side) or active surf (on the open side) they both offer great beaches. Plenty of dining opportunities on the ocean side, an amusement park and arcade, and shopping. Take care if you drive. Free parking is available in two public lots, but they fill fast and lots of time can be spent circling waiting for a spot to open. Street parking is limited and strictly policed.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Great clean beach", "I love Mission Beach. They keep it clean, well guarded and its free!!! I come from NJ where u pay for everything so to come to a beautiful beach for free is a pleasure!!!"], ["Reviewed July 17, 2017", 4.0, "A walk in the Pacific", "The beach area was pretty cool. There were people blowing huge bubbles, doing yoga, and walking a bunch of dogs. The people were very friendly and the surrounding atmosphere was very casual. I thought it was a nice way to unwind after running all day. Several places to eat, as well.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Cool Beach!", "Very nice beach. Easygoing atmosphere. Cool restaurants and bars. Excellent Strawberry Margaritas in Margarita Bar!"], ["Reviewed July 16, 2017", 4.0, "Saturday at the beach", "Took an impromptu drive to La Jolla from San Diego on the Saturday of our June trip. We looked for street parking but wound up parking in a garage for $10/hour that was staffed. We walked down to the beach and found a nice spot to sit for a few hours. It was an extremely windy day so parts of the water were off limits as there was a rip current. The people we encountered were friendly. There was quite a bit of foot traffic but we never left our spots. Would definitely go back.\nShow less"], ["Reviewed July 16, 2017", 5.0, "Great beach!!", "Enjoyed this beach with our grandchildren. They loved playing in the sand and jumping into the waves. Yes, there were a lot of people in the beach, but whenever felt crowded."], ["Reviewed July 15, 2017", 5.0, "A great place for a relaxing afternoon", "My wife and I spent the afternoon enjoying the beach. The only down side to this beach is finding a parking spot. We rented two chairs and an umbrilla and had a great afternoon at the beach."], ["Reviewed July 13, 2017", 5.0, "Great SO Cal Beach", "If your looking to catch a few waves, People watch, Bar hop, Walk the boardwalk ofr Ride a Roller Coaster This is your place. MB has it all and is a bit more mature that Pacific Beach just up the way"], ["Reviewed July 12, 2017", 5.0, "Beautiful!", "Beautiful, peaceful and quiet gem. This place is absolutely amazing and so gorgeous! We really enjoyed our time there."], ["Reviewed July 12, 2017", 5.0, "Great family-friendly beach!", "We loved Mission Beach! We spent a whole day there (at the beach and Belmont Park).\n\nThe beach was clean and well maintained. The ocean waves were not too strong for younger kids to safely play in the water.....with adults close by, of course!\n\nThe lifeguards were great at this beach. A little visitor got lost from his family while there and it was all business by the lifeguards. They were professional and helped to quickly locate the child and get him reunited with his family.\n\nThis was a wonderful stop on our holiday!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Great Beach! Very Nice Boardwalk!", "Spent part of two days at Mission Beach and the boardwalk. This was our first trip to San Diego and heard this was one of the places to go. We were not disappointed. Lots of restaurants and shops along the boardwalk and the main street through this area (only 1-2 blocks from the beach). Enjoyed lots of sun, food, drinks, and people watching. Parking is a bit of a pain, but was expected in a popular place such as this. Definitely kid friendly.\nShow less"], ["Reviewed July 11, 2017", 4.0, "Nice Beach", "came here twice whilst we stayed in San Diego. The first was a fine day & the beach was nice - not to crowded. The second time we went was a hot day on the 3rd July. I have never seen so many people wearing red, white & blue bathers (board shorts, bikinis, T-shirts, towels, kites etc). The other thing I found curious was the amount of stuff people take to the beach. Gazebos, tents, over-sized umbrellas seem the norm. I spent march time watching the locals in amazement. It was truly an education in how residents in the USA go to the beach. Makes Aussies look like real amateurs.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Perfect for our family", "We loved this beach. It was our favorite part of the recent trip we took to San Diego. I've been on a lot of California beaches and this one is by far my favorite as a family beach. The sand is amazing. It wasn't too crowded. Things were clean and it was really relaxing. We are going back just to explore this and other San Diego beaches.\nShow less"], ["Reviewed July 11, 2017", 3.0, "ZERO parking, good luck. Nice but BUSY!", "So after visiting San Diego several times I generally avoid the area because parking is non existent...this beach is SUPER compared to others. In July you will be surrounded by thousands of people, don't plan on having a peaceful day at the beach here. Close to restaurants and shops...\nShow less"], ["Reviewed July 10, 2017", 5.0, "Amazing beach, boardwalk, experience, gonna love it!", "This is by far one of the best in Cali and maybe the world! Too many things to do, from renting bikes, skateboarding, rollerblading, or pure walking/jogging. Staying healthy is no issue here. Beach itself is grand, with soft sand and low waves at the waterline. Plus it is FAMILY FRIENDLY! Plenty of food tents put up, coolers and even spots to BBQ. In the far distance you can see water activities, boards, sail boats, etc. and there are plenty of shops for purchasing those missing items like sunscreen and towels and swim suits etc. Food vendors are quite good as well. Then there is Belmont Park (a small scale amusement park open to the public with a roller coaster, bumper cars, arcades, rock climbing, even zip lining.\nShow less"], ["Reviewed July 10, 2017", 4.0, "a Fun morning at the beach!", "Our 6 & 3 year old could have stayed here all day! the sand was so soft and they loved playing in the water. The beach wasn't crowded at all where we were at. The facilities weren't the cleanest, but it was so cool to see the old buildings and amusement park. We had fun and would go back to this beach again. We got there around 9-10am but could tell it was getting busier when we left around lunch time.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Birthday", "It was the first time I went to San Diego I take my wife and my 2 girls they love the beach and everything else I can't wait to come back again."], ["Reviewed July 5, 2017", 4.0, "Mission Beach", "It was packed but looked like we were stepping back into the 1960's. Really nostalgic! Colorful buildings, wooden coaster in the amusement park... brought back memories!"], ["Reviewed July 4, 2017", 2.0, "Kind of trashy", "Way too crowded and trashy. It's the ghetto of beaches. Not impressed at all and don't understand why people come here."], ["Reviewed July 2, 2017", 4.0, "nice beach", "we spent an afternoon sitting on the beach and also rode the giant dipper roller coaster, just a nice afternoon"], ["Reviewed July 1, 2017", 5.0, "Easy to get to", "Stopped here for a short visit to the beach as our kids have never been to the beach before. We got their at 10 in the morning and parking was easy, but by the time we left, parking was at a premium at noon. The life guards do an excellent job patrolling the beach and we felt safe during our visit. There were plenty of shells for the kids to collect and plenty of space to stake out our own little piece of sand. A great beach to visit with the family.\nShow less"], ["Reviewed June 30, 2017", 5.0, "Son loves the beach", "Took him to the shore after playing at Belmont Park. Great weather and the crowds were very light. Bathrooms needed attention but that's a theme of most beach bathrooms. (Although Torrey Pines State Beach was immaculate, $15 was well worth it ;)"], ["Reviewed June 30, 2017", 3.0, "Bournmouth.....", "Simply put Bournmouth on Steroids.\n\nYes its s great beech and yes its greatfor family fun but if like me you want to escape the children look elswhere.\nHaving read reviews on here we decided to come..... we are now heading for the Gaslamp quarter.\n\nBring a bucket and spade and a kiss me quick hat.\nShow less"], ["Reviewed June 28, 2017", 4.0, "calm throughout the night", "Mission Bay is Pacific Beaches soft spoken sibling. Usually calm and sedate it can get wild in the South Mission Beach area with gangs and young idiot wanna-be's. Great park with an old time beach amusement park call Belmont Park with old clinkity clankity roller coaster right on the beach. Nice view of the beach and what's on the beach (skin tight's). Bring lots of sun block\nShow less"], ["Reviewed June 28, 2017", 4.0, "Nice beach", "Very nice and clean beach. Nice place to spend some time with your family. You can spend all day there. I wish it had more clean places to eat out there."], ["Reviewed June 27, 2017", 4.0, "Great place for families, especially small children", "We brought my granddaughter here, age 4. The surf is perfect for little ones who aren't around the ocean much, not to great. Nice day at the beach!"], ["Reviewed June 27, 2017", 4.0, "Nice long beach & good neighborhood", "Mission beach is a long flat beach with good surfing options and plenty of space. The walkway next to it is popular among skater, runners and walkers from dusk till dawn. It's a long beach so there are spots without any services (just houses) but if you don't mind walking a bit there are nice cafes and restaurants along the way. A fine place to spend a day or stay longer.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Nothing beats a day at the beach", "Absolutely loved Mission Beach. Make sure to come early to find parking and a good spot on the beach. There is plenty to do and see on the boardwalk. From restaurants, little shops, to street performers (my favorite!). If you're up for a thrilling adventure, Belmont Park is a beach front amusement park right on Mission Beach. We didn't ride any of the attractions as our plan was to just relax and splash in the water, but it definitely looks fun. From what I see, there is zip-lining, a laser tag place, the old wooden roller coaster and other rides/attractions. If you're into bike riding, there's plenty of places to rent beach cruisers on the boardwalk or on the main streets. Watch out for bike riders as some don't know how to share the road with pedestrians ;)\nShow less"], ["Reviewed June 25, 2017", 5.0, "Calm water, very Scenic", "The Bay is calm, but very scenic. Sailboats cruising always, Down Town San Diego in the backdrop, white sand, and palm trees.\nPlenty of Marinas to rent jetskis, motorized boats, or kayaks or paddle boats! Whichever is your thing! Our hotel had private beach on Mission Bay, but there was a big public section too! Lots of options for Bay cruises too! I would highly recommend booking hotel on Mission Bay!\nShow less"], ["Reviewed June 24, 2017", 5.0, "Ocean bliss", "Beach was clean and not too crowded. Able to walk up and down the boardwalk as well as experience ocean fun."], ["Reviewed June 21, 2017", 5.0, "Cant beat it", "I love this place! I have been coming here since I was a kid! I stay near the border of Mission beach and pacific beach the waves are big but its not too crowded!"], ["Reviewed June 21, 2017", 5.0, "Favorite spot", "We went on vacation and mission beach was my absolute favorite spot. The boardwalk is incredible and the beach had the prettiest waved and softest sand. I wish i could be there all the time!"], ["Reviewed June 20, 2017", 5.0, "Simple pleasures", "Perfect beach, perfect sun, perfect sand. Everything you need for the day at the beach is sold right there. Lifeguards are very diligent."], ["Reviewed June 16, 2017", 4.0, "Gotta Love the Beach!", "Great beach. Went in March - I walked in the surf - it was Cold! However, there were people swimming in the ocean. Always enjoy watching/taking pictures of the surfers also. Great Boardwalk - lots of places to eat, bars and shops."], ["Reviewed June 16, 2017", 5.0, "Fun walk along the beach", "Spent a couple of hours walking along the beach. Another dog-friendly area. Took the main road back to our vehicle and stopped at a small bar/cafe on the way back. Ran into many friendly people. I nice walk - very accessible as it is a concrete sidewalk.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Just a fun beach", "We have been to other beaches before and I loved mission beach it had an old beach town feel and lots of unique and weird shops plenty of places to eat an arcade,rides,ice cream,laser tag it was just really fun I loved it so much more than the fancy pants beaches we have been too in the past and believe it or not we didnt have a problem finding free parking right on the beach at the mission beach parking lot\nShow less"], ["Reviewed June 12, 2017", 5.0, "Loved the ocean & Boardwalk", "We walked to Mission Beach from our hotel. The boardwalk is a fun place, ocean is amazing. Great restaurants & bars along the boardwalk"], ["Reviewed June 9, 2017", 4.0, "Nice beach", "This area appears older than other areas we visited but we still enjoyed it. We are from the south so it seemed so odd not to see a Walmart or Kroger but I'm not complaining. It was refreshing! I think Mission Beach is so pretty. The ocean is calming. I could get used to the overall vibe of the place. No complaints!\nShow less"], ["Reviewed June 8, 2017", 4.0, "Great surfing spot", "Stretched out beach. Great place for surfers (beginners - advanced). There are plenty of rental shops so rent a board and have some fun. Many restaurants, bars and shops along the road. Parking can be a hassle but be patient and cruise up and down the road a couple of times or come early. Nice for beaching as well.\nShow less"], ["Reviewed June 7, 2017", 4.0, "Feet in the Pacific", "We visited in early June so the water temps were still chilled. However, I can officially say that I stepped foot into the Pacific Ocean!"], ["Reviewed June 4, 2017", 5.0, "Beach day", "After asking several people their opinion of a great beach to visit while in San Diego we were consistently told Mission beach would be a fun active spot for our family of 5 (3 teenagers). The beach was clean, had several lifeguard's and walking beach police. More families than we could count but lots of easy open areas to picnic and throw the ball. Standard beach stores and food surrounded the beach. Overall a great day and worth our families vacation time.\nShow less"], ["Reviewed June 4, 2017", 5.0, "My First Pacific Ocean Beach!!", "Went on Friday - weather was so beautiful. Nice comfortable beach - lots to see. Ended our visit with a waffle bowl ice cream in the amusement park."], ["Reviewed June 3, 2017", 4.0, "If you're a beach person - great spot", "We came down for the afternoon for lunch and to people watch. Great boardwalk, with good restaurants. Gorgeous sandy beach. Looks like lots of activities go on here throughout the summer/weekends. Note that traffic is chaotic down here, so come early. Lots of free parking in the area.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Beautiful Beach", "Mission beach is always busy around Spring Break. It's best to go either during the beginning or last week of summer. Or even during winter. The beach is quiet and beautiful for a sunrise/sunset or even just for a day trip to the beach. If you are planning to stay here for a full day, bring a cooler with lots of drinks and food! Don't waste your money on fast food that will get cold later. If you are ever in San Diego by Mission Beach. this is a must-see location! You won't regret it.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Yes, yes, yes.", "Mission Beach is really a beach town. The stars are the clean beach, well-maintained pedestrian strand (walkway), and those spiffy beach-front homes (...mansions). Sections get crowded, so just walk a little way down the beach to find a clear spot. Surf, swim, wade. Highlights: get a breakfast sandwich and sit on the beach. Or, watch the magnificent sunsets. Yes, this is well worth a visit. The village itself gets crowded, with stores and homes (many rentals) packed closely together.\nShow less"], ["Reviewed May 29, 2017", 1.0, "Sad how run down this area is", "I used to go this beach as a kid (35-40 years ago) every weekend with my family and thought I'd revisit with my family on memorial day weekend. It was crowded (could be bc of the holiday) and just sadly not the beach crowd of years ago. My advice? Head 15 mins north to La Jolla.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Our Mission Beach experience", "People People People. Our fault we went at graduation time. . . but beautiful to see. It's a must see!"], ["Reviewed May 26, 2017", 5.0, "Very good beach", "There with family. We enjoy this beach very well. We did not have any problems at here. Nice beach. Very well place"], ["Reviewed May 25, 2017", 4.0, "Go before you go!", "Mission Beach is a beautiful place to watch the sunset by campfire just \"go before you go\" bathroom facilities were terrible!"], ["Reviewed May 24, 2017", 5.0, "Back to Mission Beach (PB)", "No matter the time of the year Mission Beach is full of allure and beauty. Enjoy the long stretch of pacific beach ocean front living."], ["Reviewed May 23, 2017", 5.0, "Cool atmosphere", "I just loved this beach. A good place for young people to have fun. There is a small amusment park by the beach."], ["Reviewed May 23, 2017", 5.0, "beach plus eating and fun", "Parking fills early but you can drop off the stuff/people and then go park. Not a lot of grass near sand. Several restaurants along boardwalk. Fun people watching. There is also amusement area for adults and kids right there. Rides for all ages plus famous old roller coaster. Pizza, burgers, ice cream, funnel cakes,etc avail. Wristbands are $20 for small child and $30 for older kids and adults or tickets can be bought. Rides take 3-5 tickets. There's climbing wall and miniature golf that I think cost extra.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Out of town beach bums for a day", "Had a wonderful day at the beach!\nClean beach & LOVE that there were places to rent chairs & umbrellas everywhere!⛱\n\nThis was not were we originally planned to go but traffic and locals suggested this beach to us (as we were standing in line buying beach towels, sun glasses & sun screen, lol).\n\nThere were plenty of restaurants and bars to get a bite and a beer before hitting the beach. We walked up and down a little ways and while it was busy we didn't have a problem finding a spot to layout in the sun and the sand.\n\nThe beach was pretty clean! And while some people had music playing, no one was loud or obnoxious\n\nCouple things.... don't use the public restrooms. GROSS. Go check out the bar behind you, (use their restroom) rehydrate ... get a snack and move further down the beach to get a new view! And if you have to use the public restrooms , being your own TP ladies.\n\nI don't care how old you are.... bring a shovel and a bucket. Have find. Build a sand castle or a moat. Whatever. Relax and enjoy. It was a very fun and relaxing day!☀️\nShow less"], ["Reviewed May 21, 2017", 4.0, "Beach visit", "Nice beach. Shops near the beach are nice. A lot of people skating and biking. Nice to look at. Come early parking is free."], ["Reviewed May 21, 2017", 4.0, "Enjoyed Mission Beach Boardwalk", "We were in Mission Beach on a cooler than usual day in mid May. We enjoyed browsing in the shops and walking along the boardwalk. It was a nice place to walk and we saw quite a few interesting characters and places there."], ["Reviewed May 15, 2017", 5.0, "Beach paradise", "Mission beach Bay Area is a beautiful bay and park area for family fun. The area is very clean, and the washer for outdoor family fun."], ["Reviewed May 11, 2017", 4.0, "Great location", "Steps from the beach and steps from the bay. There is a theme park, plenty of bars and restaurants and very walkable."], ["Reviewed May 7, 2017", 5.0, "Walked along bay shorelines.", "Beautiful weather, walked along bay and ocean beaches. Beautiful views of the water and interesting mix of house/condo architectural styles."], ["Reviewed May 3, 2017", 5.0, "Beautiful Beach, Family Fun, and Beach Fires in the Evening!", "My family and I come to South Mission Beach every summer and just LOVE it! The beach is gorgeous and right next to Belmont Park so the kids love to ride the roller coaster and other rides and play games before jumping in the water. New restaurants The Draft and Cannon Ball are both delicious with beautiful beach views. Our favorite thing to do is end the day with a beach fire! TheBeachFireguy.com offers a personal delivery service and does all the setup and clean up for the perfect ending to the perfect beach day.\nShow less"], ["Reviewed May 1, 2017", 4.0, "Great Place to go for a Walk or Spend the day", "We parked at Belmont Park and rented chairs to spend the day at Mission Beach. Very accessible, clean bath house, food and shopping easily accessible."], ["Reviewed April 30, 2017", 5.0, "Love walking along Mission Beach!", "Park by the roller coaster, walk North along the beach about 2 miles than turn around and have lunch at over of the many fun restaurants on the walk back. Fun!"], ["Reviewed April 29, 2017", 4.0, "Beautiful beach but water temp was 56 degrees", "Went to the beach. Beautiful day. Water too cold to go in althought llifeguards were on duty. Kids could play baseball catch on the beach. Still got some sunburn. I decided to jump in the ocean with some other crazies as we came 1300 miles. I made it for 5 minutes or so. Must be great in the summertime.\nShow less"], ["Reviewed April 28, 2017", 4.0, "Nice beach", "This is a clean beach with lots of room to sit out and enjoy the day. It has lots of places to eat and shop within walking distance."], ["Reviewed April 25, 2017", 4.0, "This beach is alive!!!", "There is a lot activity happening here. There are restaurants,shops and of course the beach! People watching is a required sport. There are people riding bikes,skate boarding, and roller skating. It is wonderful watching people enjoying the nice weather."], ["Reviewed April 25, 2017", 3.0, "Fishing on Crystal Pier", "Came here with the girlfriend for a day away, parked nearby 2 hour limit for free, and did some fishing at the end of the Crystal Pier. $9 for 1 hour, all equipment included. The guy at the shop wasn't that nice, but meh. Didn't catch anything but did see a porpoise!\n\nWas cold - bring blankets and sweaters\nShow less"], ["Reviewed April 25, 2017", 5.0, "Great place to spend an entire day!", "Beach is very clean, plenty of stuff to do and walk around. Great atmosphere! You do have to get there early to grab a space on the beach or a table in the park."], ["Reviewed April 25, 2017", 3.0, "Its Okay", "TOOOOOOO much gross seaweed on beach, not enough fun stores and restaurants on boardwalk. If you like sand fleas and seaweed then go. There are spots you can lay down without those. Wish Ocean was warmer"], ["Reviewed April 24, 2017", 5.0, "love it", "its clean, it has a ton of room on it- a great boardwalk, and its clean!!! Lifeguards are on duty- tons of food within walking distance. No alcohol or bottles allowed on beach- which means no glass to cut your feet!!"], ["Reviewed April 23, 2017", 2.0, "Beautiful surf, but unimpressive beach and not for families", "The ocean was gorgeous, the sun was shining and the waves were stunning....that's about all I can say for the Mission Beach area. If I was 20 years old with a bunch of friends for a drunken Spring Break, this place would be in heaven, but otherwise, there are better beaches and far better beach experiences to be had elsewhere...\nShow less"], ["Reviewed April 23, 2017", 3.0, "Nice Beach", "Typical Beach, has small boardwalk, a few rides and plenty of places to eat, buy merchandise, and of course gifts."], ["Reviewed April 22, 2017", 1.0, "Unkempt and dirty", "Seagulls all around..food littered everywhere..lot of transients..smell weed all around..restrooms were filthy"], ["Reviewed April 22, 2017", 4.0, "Big, fun beach", "This is a huge beach with tons of activity. Great for walking, sunbathing, swimming, making sand castles, boogey boarding, building a fire - whatever you want to do. Surprisingly, parking is free, although it was super tough to come by. A great beach for family fun!\nShow less"], ["Reviewed April 22, 2017", 4.0, "Nice beach for walking", "I have visited parts of this beach during many stays in San Diego - winter, spring and summer and enjoy the southernmost part of the beach the most. Everything south of Belmont Park appeals to me. A walk from the Jetty to Belmont and back is about a mile each way. Some days there are many shells here and other days not a thing but sand and waves - check tide tables for low tide to find more beach goodies. A nice beach with a more local feel.\nShow less"], ["Reviewed April 21, 2017", 3.0, "Nice Beach", "Nice Beach but at the time - there were so many jelly fish that washed up on the shore - it was hard to really play around."], ["Reviewed April 18, 2017", 4.0, "Morning walk", "Wonderful morning walk on the walkway for Mission Beach. Well maintained and well mannered. Walked back along beach again well maintained."], ["Reviewed April 16, 2017", 5.0, "Beautiful!", "Beautiful beach and sands. Family friendly. Plenty nearby to see an do. Parking can be tricky during peak times."], ["Reviewed April 15, 2017", 5.0, "Went to visit", "Great time. I suggest you visit the pier out here and get a cup of coffee. We took the ferry and it was great ride for the price."], ["Reviewed April 15, 2017", 5.0, "Just Plain Fun", "I love Missioni Beach. This is a place that is just plain fun, the people are wonderful and joyful and one can find wonderfull food and drink right on the beach."], ["Reviewed April 13, 2017", 5.0, "Great place to hang out/stay", "I've stayed at Mission Beach and Imperial Beach before. Id always choose Mission because it has lots of different cafes, walkway, huge resort with parking just steps away."], ["Reviewed April 13, 2017", 5.0, "Beautiful beach", "We came here on our last day in California, and were very pleased. We had a very hard time finding parking, but once we did, we were happy. The beach is beautiful. We sat in a less crowded area, and we just relaxed and enjoyed the views. The sand is nice and clean. Can't wait to go back!\nShow less"], ["Reviewed April 12, 2017", 5.0, "Loved this beach", "Stayed at Catamaran and loved Mission Beach. Really enjoyed just sitting on the beach and reading - very relaxing."], ["Reviewed April 12, 2017", 5.0, "Less busy than Pacific and Ocean beaches", "Mission Beach is a great beach for families. Our condo was located halfway between Pacific Beach and Belmont Park right on the board walk. We noticed less people here and the kids could play for hours while we enjoyed the view from our condo. It felt safe and clean. Highly recommended for families as there weren't many young, loud people on the beach.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Beautiful", "Beautiful beach with nice soft sand. Great place to sit and relax, or just people watch. Best beach in San Diego."], ["Reviewed April 11, 2017", 5.0, "Great beach!", "We rented one of the houses right on the beach, and it was fantastic. We were there at the end of March, so the water was still pretty cold - but we still had a great time. The boardwalk was great as well."], ["Reviewed April 10, 2017", 5.0, "Nice white fine sand, great surf and people watching", ", not too crowded. Volleyball nets, Fire pits. restuarants and bars along the beach. plenty of rental places. very very clean. lots of rental units right on the beach, pretty reasonable. We used VRBO. Downtown San Diego attractions a short ride away."], ["Reviewed April 10, 2017", 5.0, "Best beach in San Diego", "Our family loved this beach! Pristine, Soft sand, perfect for beach lovers! Amazing sunsets. The boardwalk has a few restaurants and stores."], ["Reviewed April 10, 2017", 5.0, "Always fun even during Spring Break", "Go - rent bikes - eat and have a wonderful day there. Amusement park nearby. Lie on the ocean. Its a grand place to visit."], ["Reviewed April 9, 2017", 5.0, "Festive Beach", "Young people, Old people, Bikers, Surfers, Skaters, Tourists and Locals all enjoying the boardwalk, beach, and waves. My photographer husband delighted in taking black and white pictures below the pier. I loved watching children building sandcastles and trying out a little boogie boarding. We both enjoyed biking the miles-long boardwalk. There are places galore to eat and drink and buy souvenirs. Evening brings out the music-makers. Lifeguard stations dot the shores. Young adults play volleyball and paddle-ball on open places and sleeping beauties soak up the sun. Just what you would expect from a California beach.\nShow less"]]}}