{"Mission San Juan Capistrano": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Mission San Juan Capistrano", "url": "/Attraction_Review-g33022-d127321-Reviews-Mission_San_Juan_Capistrano-San_Juan_Capistrano_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/db/69/b3/the-iconic-bell-wall.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1299"}, "address": {"@type": "PostalAddress", "streetAddress": "26801 Ortega Hwy", "addressLocality": "San Juan Capistrano", "addressRegion": "California", "postalCode": "92675", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Always Enjoy Coming Here", "I have been here many times. I was with someone that had never been and wanted to take them there. She really liked it and we stayed for about 3 hours. Took lots of pictures."], ["Reviewed yesterday", 5.0, "Wonderful view of early California history", "Much larger than we imagined. It was a great way to spend some hours learning about early California history, especially this mission. We really enjoyed the tour."], ["Reviewed 1 week ago", 5.0, "An enriching, beautiful experience.", "There is much to enjoy at this historic mission: history, beauty, architecture, fun docent tour, quality gift shop. Most interesting to me was learning about St. Junipero Serra and the swallows I've long heard about. A relaxing and informative couple of hours."], ["Reviewed 1 week ago", 5.0, "Great Family Day", "We were 12 adults and 5 children (6, 5, 3, 2, 1). What a fun time! The children loved being able to run around and were fascinated by the big Koi pond.\nThey participated in the children's events. They panned for gold, made their own adobe brick and put beads onto a string necklace.\nShow less"], ["Reviewed 1 week ago", 3.0, "Wonderful history", "Self-guided tour is informative. Well worth the stop if you are a fan of history. Should be noted that some of the historical context has been \"sanitized\" and from some perspectives, the impact of these missions on indigenous populations was negative.\nIt is a beautiful structure and example of the mission architecture of the era.\nShow less"], ["Reviewed 1 week ago", 5.0, "A Treasure Not to be Missed", "What a wonderful mission. This is the gem of the California Missions and it is really worth the few hours to enjoy it. The entrance fee covers the self guided tour audio and it is done so well. The grounds are spotless and the docents are right there to answer any questions. We were 45 minutes early so we didn’t do a docent led tour, our hand held audio sets worked just fine. Make sure you stop here.\nShow less"], ["Reviewed 1 week ago", 4.0, "Historical and Beautiful", "I thoroughly enjoyed my visit, however it is definitely a historical outing. If you enjoy history, this is definitely a stop for you! If museums and history are not one of your interests I would consider skipping it, or making it a shorter trip.\n\nThe grounds were beautiful, with fountains and flowers; quite picturesque. The old church was large, impressive, and lovely. Throughout the mission were museum displays: historical explanations, timelines of the mission and its story, restored period art and artifacts.\n\nIt was quite nice to wander the grounds, read about the history of the mission, sit by the fountain in the middle of the square, to see the statues and the old bells. It was all quite beautiful and also quite interesting. I would definitely recommend a visit to those historically inclined.\nShow less"], ["Reviewed 1 week ago", 4.0, "History buffs will enjoy", "Very interesting as a self guided tour. Admission included the audio wand. Side buildings have artifacts and art and more detailed history. Great place for school groups to learn about the history of the area. Lots more to see than I expected. I went alone and saw the whole place at my pace in about 1 hour.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A True Jewel", "I have now visited and photographed all 21 missions. This is the most photogenic of all. I was totally blown away by the beauty of this place. So glad I went and so glad to be able to spend 4hours taking photos on a perfect afternoon. All the worker here are super friendly and helpful. The were several groups of 4th graders taking the tour with their teachers at this time also. I think it is a great part of their California History education. One of the workers asked me what I liked most -my answer was “the hallways/arches. Simply beautiful.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "We keep going back", "This beautiful, historic destination draws us back every year, and we learn or see something fresh each time. I was first here many years ago, before it was restored and the historic information was added. The grounds are beautiful any time of year, with fabulous photo opps. Sat in on the Serra Chapel talk, which was informative, if a bit pro-Spanish in its interpretation. This was balanced by a display that pointed out the harm done - some unintentionally - by the European aliens. There's free parking on the nearby streets, along with plenty of places to eat and shop.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "SWALLOWS RETURN", "I went there last March when the Swallows return, party all week. Great little town. Jann Browne's band played at Swallows Inn, the best."], ["Reviewed 4 weeks ago", 5.0, "Peaceful and beautiful", "We spent a relaxing afternoon at the mission. We enjoyed the walking tour and learned so much about California history. The tour and mission are very reasonably priced and it's great to support this piece of history."], ["Reviewed 4 weeks ago", 5.0, "Historical Mission Visit", "This was our second trip to San Juan Capistrano Mission.\nEnjoyed very much the history of this site to Old California history.\nWe were able to get the talking recorder that helps us learn so much more then on our last visit twenty years ago.\nSorry the walnut Grove Restaurant isn’t next door anymore, don’t know if they have moved it to another location as the building is gone.\n\nSo much history just walking into there is the beautiful green garden then we went to the left right into the old building that the Mission military housed their men that had so much information first was a short film of the Mission then there were about five to seven other doors ways to go into to find about life of those that lived there at Mission. They had where they made there wines saw so much it’s hard to say it all in few words . We visited inside most the building those still standing and those taken out by earthquakes of years gone by ,we went inside the church chapel beautiful. Walk around more garden areas and saw where the church people lived daily lifestyles of all that lived there.\nSaw the old church bells. Saw where Richard and Patricia Nixon had visited . Worth 3/5 hours visit. Had little traffic troubles it’s off the 5 freeway and the Ortega 74 Freeway busy , busy area lots of gifts in gift shop as you leave.\nLots of small areas to shopping in the shopping areas food, gift ,small restaurant,coffee shops and artists shops near but ,train station and few place for adults refreshments .\nNice little areas to just walk about. There area few small centers with this and that with in few blocks. Like we needed to go out for dinner with friends and found few locations near by. There were few choices for drive through meals , also groceries stores,saw a bank and think drug store.\nLike to say the Mission staff from entrance till we left where very helpful and informative.\nYes, we shall go back and take other members of our families like the young ones as there is so much they can learn from a visit there.\n\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful historical setting at a bargain!", "Beautiful historical setting and at a bargain. The admission for an adult is $10 and includes a free audio tour. A must do in the area. You can easily spend a day walking around the general area too."], ["Reviewed 5 weeks ago", 5.0, "A beautiful place", "Despite the fact that the mission itself was destroyed in an earthquake many years ago, the remaining ruins and gardens are beautiful. There is a serenity that cannot be underestimated. The entrance fee is a little steep but it is worth it. Everything is well maintained and the bells are beautiful for photographing. It is like a different world right off the 405. There are many restaurants surrounding the exterior of the mission and the mission gift shop is very well done.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Best preserved Mission to visit", "This Mission is the best mission to visit and is very well preserved and restored, but not to the point that it loses this historic character of the place. You can walk in the ruins of the old basilica which was destroyed by an earthquake in the early 1800s. The Chapel that was used by Father Serra is just a great spiritual place with lots of symbolism and history. The mission also gives a very good depiction of the life in the mission and the history of early days of California. Great place to visit.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Must see between LA & San Diego", "Mission San Juan Capistrano is a beautiful place. It's historic, well maintained and gorgeous. The structure of the century old building is incredible. The small church, flower garden and the lotus pond takes your breath away. Right outside the perimeter is the coolest cactus plant you could have ever seen. It's about 12 feet tall and probably centuries old. LOVED IT!\nShow less"], ["Reviewed January 21, 2018", 5.0, "3 day weekend.", "A lovely place. We enjoyed every bit of the historic buildings and area. The price was right, the Coy pond, landscaping, employees, and fresh garden was delightful. The fountain, shop, and location was breathtaking. The drive from our hotel was 5 minutes, and the little town had much to offer.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Mission Viewing", "Took my inlaws to the Mission , we enjoyed the beautiful gardens & the ruins of the former church damaged by Earthquake."], ["Reviewed January 16, 2018", 5.0, "A Beautiful Stop on Our Road Trip", "My husband and I decided to drive to the San Juan Capistrano while exploring around San Diego. What a beautiful way to experience the history of colonial California. We enjoyed exploring the museum, the grounds and even the gift shop filled with handmade items sold to support the mission. It was an easy drive and a very interesting place to spend a couple of hours. If you are in the area, I recommend to drop in for a visit!\nShow less"], ["Reviewed January 9, 2018", 5.0, "Great place to visit", "Been here many many times over the years....great California history and a fun place to visit...low key..usually not crowded...love the active church inside the mission"], ["Reviewed January 3, 2018", 5.0, "Glad it was restored", "We've driven past several times but never stopped until now. I'm glad to see that Abraham Lincoln had the foresight to restore this piece of history. We had a great day walking around and showing the kids how people lived just a short time ago. Interesting how each mission had it's own industrial support network right in house. Quaint town, beautiful architecture, nice people....we had a great day!\nShow less"], ["Reviewed January 1, 2018", 5.0, "Wonderful experience!", "I highly recommend visiting the Mission San Juan Capistrano. It is the 7th of the 21 California Missions. The grounds are beautiful and the structures tell of the history of this Mission. I definitely recommend renting the self-guided video player for an extra $1.00. You have in and out privileges, thus you can go and have lunch outside and return if you wish. Definitely worth the visit.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Gorgeous Grounds and History", "This is an easy drive on the way to San Diego. The mission is so beautiful especially if you love taking pictures. Lots of flowers, succulents, grand trees, old brick and beam work. The chapel is charming and the ruins are intriguing. I especially love the swallows and their special place at the mission. I also really liked the charming gift shop as well.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Original Mission", "Awesome place to see....they’ve added to the original mission, so there’s plenty to see. San Juan Capistrano is a cute little town with lots to see. Events scheduled at the mission from time to time. Parking may be a little tricky or park near the train station and walk a couple of blocks.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Just for fun", "Had never gone there in all the trips I've taken to San Antonio. Finally, went and OMG! Those missions are amazing! If you are a history buff, it's the place to go. The structures are awesome! It is unbelievable how they were built by Native Americans with the kind of tools they had. Plus, those structures have lasted for many years after they were gone. It's a must visit place to go!\nShow less"], ["Reviewed December 22, 2017", 5.0, "Excellent visit", "This was my first visit to a mission in California. Beautiful grounds and well restored buildings. Highly recommended, for all ages"], ["Reviewed December 21, 2017", 5.0, "Always a joy to come here!", "A visit here is always one of peaceful reflection, admiration of beauty and a step back into history. It's so nice to see the families touring and enjoying the Mission. And who ant appreciate the annual return of the swallows?!"], ["Reviewed December 21, 2017", 5.0, "Good visit for kids and adults", "We got the audio guide and was surprised to find out they had a version for kids too. My 9 and 12 years old daughters enjoyed their audio tour too.\nThere is also a small room for kids to learn how to weave a twined basket and other activities.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Classic", "This place is one of our all time favorites. I first visited it over 60 years ago. Now that we live in the area, it’s our go to place for visitors and guests. It’s a worthwhile program, so get involved and protect our local heritage."], ["Reviewed December 6, 2017", 5.0, "What a great suroeise", "With no expectations we found the mission so beautiful. The flowers, friendly staff and information proved such a great day."], ["Reviewed November 30, 2017", 5.0, "Why You Go...to Capistrano", "It's about the Mission, a wonderful place to spend the day, learning about what occurred here in the 18th century and beyond. Highly recommended!"], ["Reviewed November 27, 2017", 5.0, "History galore!", "The grounds are lovely; the signage is more than adequate; history of California missions abound; staff and volunteers are helpful and the new gift store is amazing! Swallows were sighted, which made us smile!"], ["Reviewed November 27, 2017", 5.0, "Outstanding example of California missions!", "We lived in Los Angeles for over 20 years and never managed a visit to this Mission (shame on us!). Now, living in NY, we were visiting family in Southern CA and made it a point to take three grandkids (one will be studying CA history this year) -- really a lovely spot and so important to understanding the history of California!\nShow less"], ["Reviewed November 24, 2017", 5.0, "If you only get to see one Mission, see this one.", "Great site. Excellent audio tour. Sure, it costs a few bucks, but that is why it's so well maintained and has the amenities it does. Go learn some history! :)"], ["Reviewed November 22, 2017", 5.0, "Lovely California Mission", "This is a beautiful California mission. We paid a little extra for a docent tour, which was well worth it. The mission itself is well preserved. It’s very easy to get to from the main highway. The gift shop is nice, too. I found some things to use with my fourth grade class.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Pleasant Surprises", "I went to this place since it was a famous historical landmark as well as the oldest mission in California. When I finally came, it was a good visit in more ways that I expected. It did have exhibits regarding cooking and cleaning, to be sure. But the best things for me was the nature. There were bees flying around the mission. There were also ponds with water lilys and koi fish. I loved the koi fish. The place itself was quite and tranquil, free of disturbances. I'm glad I came here.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Beautiful piece of history", "We took the audio tour, thinking we would spend an hour but ended up staying over 3. The grounds were beautiful, the audio guide well done, many well preserved artifacts. The entrance fee was low, definitely worth it! I highly recommend this mission as a piece of California history.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Beautiful Mission", "This is a wonderful mission with it's rich history and beautiful old buildings. I almost by-passed taking the tour but I'm really happy that I did."], ["Reviewed November 15, 2017", 5.0, "Historic Beauty", "This Mission is one of the most beautiful of the California missions. It doesn't show the destruction of the local cultures caused by the fathers and the soldiers but clearly displays the history from the viewpoint of the Catholic Church."], ["Reviewed November 10, 2017", 5.0, "Jewel of the Missions", "Mission San Juan Capistrano is called the Jewel of the Missions. And the name fits like a glove.\n\nWe have visited all 22 Missions in California (if you include Pala) and have visited most several times. Mission San Juan Capistrano is certainly my favorite. Not just because it is close to home but because of the beautiful grounds, terrific restoration, historical exhibits and so much more.\n\nIt is great family fun, easily accessible, inexpensive, beautiful, educational and inspiriting.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Old California charm", "The Mission in San Juan Capistrano is lovely, with wonderful plants from many different places. It is a peaceful and relaxing place and features much of California and Orange County history. The inlay gold retablo in Serra Chapel is beautiful and makes you feel as if you are in Spain. The mission has wonderful tours and events throughout the year- it is a very special place.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Great attraction and excellent tour guide", "We visited here on our way from San Diego to Los Angeles. It is worth going here especially to see. The mission ground are beautiful and the the courtyard and surrounding building are beautifully restored. The old church was destroyed in an earthquake, but the remains are quite interesting. It's worth a trip.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Famous San Juan Capistrano Mission", "This is a beautiful partially restored mission right in the middle of the town. I wish I lived closer so that I could have more time to study the mission and how life was lived at the time it was occupied. People now days could learn much about how to live within the geographical community. We spent 4 hours and only left because it was closing. It was a highlight of our trip to California.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Beautiful", "We very much enjoyed our visit. The area was rebuilt due to an earthquake years ago, but still has the look and feel of past times. The landscape is beautiful.\nDiscounts given for seniors ($1) which can be combined with an additional $1 for military with ID.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Beautiful grounds", "We spent several hours walking through the beautifully restored Mission and it’s gardens. I would recommend renting the audio guide for $1 to accompany the map. We shared one with the volume on high and it was fine. We would definitely tour it again."], ["Reviewed October 20, 2017", 5.0, "Beautiful, spiritual place", "Loved visiting the mission. Grounds are beautiful and the koi pond in the middle is a highlight. I enjoyed seeing some of the liturgical items such as chalices. Gave a great picture of this settlement."], ["Reviewed October 19, 2017", 4.0, "Interesting, beautiful, and so peaceful!", "Parking - if you can't park on the street near the entrance, there is parking down behind the Basilica. We are seniors and paid $9 each to get in plus $1 more for a listening device for info. The tour was a 35 min. wait ($3 each) and we didn't feel like waiting. As we wandered around we found surprises with each turn. The swallows aren't there until about March but it was still fun. We loved the little chapel where you are allowed to leave prayer requests for loved ones. Please don't write on the walls and some ___ people did. We ran into the tour a couple of times and enjoyed his narrative. Sorry we didn't wait! It was an older man who very knowledgeable and articulate. Don't miss the large Koi in the fountains in the middle of the courtyard and the beautiful water lilies. Lots of benches scattered around if you need them. Highly recommend you visit this. Don't miss going inside the new Basilica! Beautiful!\nShow less"], ["Reviewed October 16, 2017", 5.0, "So nice to find a beautiful historic site in CA", "Being original from the New England, buildings from the 1700s and earlier were the norm. It was so nice to visit the Mission as well as the town of San Juan Capistrano. Such a love and peaceful place. Too bad the I5 noise can be heard. Loved the gardens and buildings. There were some school groups there while we visited but they were not obtrusive. This is well worth the visit. The gift shop had lots of interesting things also.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Beautiful chapel!", "We had always heard about the swallows returning to San Juan Capistrano but now I can finally say we were there. It was interesting to learn about as well as see the history of California. This region has has its share of earthquakes but luckily for all of us they have taken great care to rebuild and preserve history for us and for future generations. It is worth the price of admission just to see the beautiful chapel. I can see why California has their elementary students learn about and visit the mission trail.\nShow less"], ["Reviewed October 12, 2017", 5.0, "History in a really Lovely setting. Really Peaceful.", "The sort of place where once you are inside it really captivates you. Very well signed with lots of information boards. Just gently stroll at your own pace through delighfful well-maintained gardens."], ["Reviewed October 12, 2017", 4.0, "A special place in our history", "So awesome that in our local area we can take our kids to see this special part of CA. history. The tour is amazing and since the renovation even better."], ["Reviewed October 11, 2017", 4.0, "Perfect for friends visting on the weekend", "The Mission offers self guided tours, go on your own pace. It is about a two hours visit if you stop and enjoy the history of the mission. Besides the mission, one can enjoy the Basilica and the other historical places around downtown."], ["Reviewed October 11, 2017", 5.0, "Peaceful and pretty", "It is a beautiful historic place. Beautiful desert flowers and very peaceful. Archaeology site in progress. Great place for a wedding. Lovely old Catholic Church. Monument to Saint Perigrine, the patron saint of cancer victims. Large gift shop too."], ["Reviewed October 11, 2017", 5.0, "A beautiful walk through Californias history.", "Lots have been made of the Mission tour of California. I decided to visit many of them on Hwy. 101 They were designed to be a day apart by mule. 3 or 4 by car. Last year we visited many Santa Barbara and north , try and find San Antonio east of Hearst Castle. Re modeled recently and off the beaten path. They all have history.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Fabulous Location!", "This is a fabulous place for a visit--especially if you love California history as I do! The self-guided tour is very effective. So are the docent tours, especially the art tour. A great place for families and children--particularly fourth graders. Check out the store on your way out. They carry some terrific books an gifts.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Historic Basilica in San Juan Capistrano", "Gorgeous grounds. Magnificent main & surrounding altars. Was fortunate enough to attend a Sunday mass. Welcoming congregation. Beautiful mass in English. Their Knights of Columbus chapter was hosting a breakfast too. Don’t miss this serene masterpiece!!"], ["Reviewed October 2, 2017", 4.0, "Company favorite", "Great place to visit with friends and family....all ages. Wonderful historical experience. The buildings were well explained and the large inter courtyard made me imagine what life must have been like. We also got to experience the mission for an outside concert recently which was wonderful.\nShow less"], ["Reviewed September 25, 2017", 5.0, "San Juan Capistrano Mission", "An old Mission with a great deal of history. The restoration of most of the buildings is well done and clearly shows the hardships of the original missionaries and in particular the Franciscan Friar Father Junipero Serra. The Serra Chapel has been restored and it has art works and a 17th Century Retablo or Golden Altar. Mass is still said here, daily. The stone church was built outside in 1806 but destroyed by an earthquake in 1812. The Serra Chapel was then reused until it became unsafe. The restoration in the 1920s added the Retablo. There is so much history from the Spanish to the Mexican and then the American times. At one point the Mission was a family home, during the Mexican period. So much more to see and do here. The Courtyard garden is beautiful. There are many volunteers tending to the gardens and working around the Mission.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Great historical visit", "We had a great visit at the mission. Super informative! Great history! We spent about 2-2/12 hours there. They have guided tours and audio tours available. We just chose to wander and read everything. A must stop if you're in the area."], ["Reviewed September 24, 2017", 5.0, "Beautiful beyond words!", "We loved wandering around this beautiful mission. The buildings and landscaping were breathtakingly beautiful!"], ["Reviewed September 24, 2017", 4.0, "Very nice peek into local history and culture", "We dropped in here, thinking it might be mobbed on a sunny day in September, but it was nice and quiet. And informative, we spent about 90 minutes there, and it was worth the price of admission."], ["Reviewed September 20, 2017", 4.0, "Nice Way To Spend Your Saturday/Sunday Afternoon!", "This is an excellent day trip! You can take the train to Mission San Juan Capistrano and enjoy the day with walking, checking out shops and having lunch with a margarita or two!"], ["Reviewed September 19, 2017", 5.0, "Peaceful & Beautiful", "The Mission San Juan Capistrano is a serene oasis in southern California. About 20 minutes south of Newport Beach, it is a welcome retreat from traffic and nearby busy cities. The mission is beautifully maintained and provides a great perspective of the foundations of Orange County. Although it is a religiously significant location, it's also fun for the casual secular visitor.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Beautiful grounds", "They have done a tremendous job of beautifying the grounds and restoring many of the structures that were in very bad condition just a few years ago."], ["Reviewed September 13, 2017", 5.0, "A nice experience", "We went on A Saturday to see the Mission, after taking a city tour with the Friends of the Library. It was hot that day and I should have brought more water. The mission has a fountain but it was far from the entrance. There is a lot of sun shine at the mission, it is not all indoors. We started with a walking tour, it was nice and informative. I took some photos and learned some things I would not have noticed. We tried to watch the informative film three times, but each time other guests talked over it so that we could not hear it. They weren't watching the video and were just \"hanging out\" to get out of the sun, I believe. So I don't know much about the history to include in the review. The Chapel on site was beautiful. I liked the lily pond. The gift store was quite popular. I almost missed the area to the left when you walk in, be sure to refer to the map to make sure you see everything. Overall, I didn't think I would like this but I did.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Stunning!", "We're on a mission to see all of the missions. This one is gorgeous. They do a wonderful job keeping up the grounds. The gardens are lovely. Love the koi ponds, butterflies, the old stone cathedral. A must visit if you're into this kind of thing!\nShow less"], ["Reviewed September 8, 2017", 5.0, "Ancient looking buildings add to its historical authenticity", "I thought I would walk into an ancient mission. However, this place offers artifacts and exhibits for visitors. You can tell that the buildings existed over 100 years because you may have to watch your head when entering certain doorways. Lot of the bricks are faded. Nothing can be more faded than the Ruins of the Great Stone Church, caused by the 1812 earthquake. You can also find carved messages in the Sacred Garden's left doorway. Some were written about 100 years ago because the writer carved their name and date on the sides and top of the door way.The place would look lifeless if not for the gardens and the beautiful lily fountain. When you leave, check out their gift store. It's not just a Catholic store but the store also sells religiously neutral items or souvenirs. I had to buy their stuff animal sparrow. When I press its back it sings to me. I shall always remember how much it symbolizes San Juan Capistrano.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Mission San Juan Cap Worth a Visit", "Interesting history. Great location, nearby shops and restaurants. A beautiful mission. Concerts in the summer and beautiful blooms in spring. Visit old downtown San Juan nearby, walking."], ["Reviewed September 6, 2017", 5.0, "Excellent tourist spot.", "There's a lot to see although most of it has been rebuilt. Great museum explaining how the missions were built and worked. Admission seemed a little steep,"], ["Reviewed September 5, 2017", 4.0, "A Some what restored Spanish Mission from 1776", "As many of the California Mission's this one was allowed to deteriorate after the Mexican Independence from Spain in the early 1800's. However due to the effort's of a few, a lot of the structures and history were restored and today give the visitor a good glimpse into the Mission life of the early settler's. It does not compare to the MIssion's of Santa Barbara and Carmel, but it served it's place in the early day's of California development.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Rent the audio units and take your time", "What a lovely place! We were surprised by the reasonable entry fees. The upcharge for the audio units was only one dollar. The wonderful thing you'll notice about these audio units is that with most people using them, the property is quiet and reflective. Plan to spend at least 2 hours... or plan to return.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Beautiful and historic mission", "Had a really nice 1.5-hour visit here with our 3-yr-old son. Gorgeous grounds that are a pleasure to explore and sit in independent of the museum portion. The ruins of the original church are moving - a must-visit portion of the Mission."], ["Reviewed September 2, 2017", 5.0, "Historic visit", "Very important historic mission We self-toured Easy to follow map with great descriptions No swallows They are trying to bring them back- Interesting story Important part of California's history Recommend highly Take a couple of hours to see everything On street parking"], ["Reviewed August 31, 2017", 5.0, "Real Gem", "Had heard of and driven by a few times. We did this as a small group of 6. The mission is a real gem. Great narration guides, the grounds a well kept and the shear history. This mission is one of 21 mission that were built and houses one of if not the old buildings in the state. The koi ponds are beautiful and the Koi are enormous!\nShow less"], ["Reviewed August 29, 2017", 2.0, "Drove over to see it, way too expensive for entrance and parking is hard to find.", "Always heard of the mission, now it is locked into a tourist trap environment. Wanted more than I wanted to pay to enter, so we just looked around and left."], ["Reviewed August 25, 2017", 3.0, "Lots of memories...", "I went to school at the Mission for 4th through 8th grade graduating in 1965. My fourth grade classroom was in one of the original adobe buildings. We spent a lot of time in the beautiful garden just outside our room. San Juan was much less crowded and a lot quieter back them. People came to visit the Mission, of course, but not in such numbers except maybe on Swallows' Day. All the kids dressed up in Spanish/Mexican clothing and danced to traditional music to entertain the tourists. The Mission is so very beautiful; you really should see it. It does seem to be a bit more commercialized these days. It is hard for me to pay for a ticket to visit my old school. Not so long ago, if I told someone I was an Old Mission student, they would let me in free of charge. Swallow's Day traditionally was on St. Joseph's Day, March 19. There is usually (always) a parade on or near that day. When you visit the Mission, be sure to cross the street to visit the Swallow's Inn for a bit to eat and a cold drink. If you are wondering why I only gave this wonderful place three bubbles, it is because of the crowds and commercialism. Maybe next time I'll go on a cold rainy winter day.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Excellent Docent Tour", "It was a beautiful day at the mission. Fred was our docent and he was very thorough as we toured the mission! Our tour was an hour long but Fred could have talked well beyond the hour but unfortunately our group was under a time crunch. We even saw a swallow at the mission! Lots of California history there!\nShow less"], ["Reviewed August 25, 2017", 5.0, "Visiting family!", "A great place to stay for everyone! I have had a wonderful time, there are a lot of restaurants nearby, and it's close to the freeway entrance and gas stations. It has a nice pool and breakfast in the morning. The management and staff are kind and courteous, very professional.\nShow less"], ["Reviewed August 22, 2017", 4.0, "A glimpse into California's early history", "The mission tells the story of Father Serra who founded a series of missions in California. There are several buildings showing how priests and soldiers lived at the mission. There is a nice church and the ruins of the stone church that was destroyed in the 1812 earthquake. There are a few rooms that house a small museum. One complaint is that in one of them the lights are way too dim.\n\nNice gardens with plenty of flowers.\n\nThe mission is just a little way off Interstate 5. Amtrak has a station right near the mission. When my son was younger, he and Tykewife took the train from Oceanside. There is 5 hour parking n the streets adjacent to the mission.\n\nNice gift shop.\n\nClean restroom.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Even without the swallows it is educational", "Very interesting to say the least. The beautiful and perposful buildings and grounds that stand today. It was rebuilt in the early 1800's after an earthquake destroyed most of the buildings. Also it was the first place to make metal for multiple uses in California"], ["Reviewed August 22, 2017", 4.0, "Nice museum store, too!", "It's great to see the museum & the history of the Mission system. It's a beautiful area with great landscaping. The museum store is really nice, too - with reasonbly priced items."], ["Reviewed August 20, 2017", 5.0, "This Oldest California church and it's gardens is the most romantic wedding pictures or proposal setting just 1hr L.A.", "This mission established in 1776 is carefully conserved as a public museum and activity center. One of the few authentic historical spaces in SoCal is a Most if you want to have a glimpse of the real west coast history. A paradisiac space, where one can spend a peaceful afternoon relaxing in its gardens or shooting your most romantic wedding, proposal or anniversary pictures. The church is a unique stop for those Catholics that may want to pray in the oldest Franciscan's temple in California\nJust one hour from L.A. by car or 1:20 by train, is the most picturesque day trip in SoCal\nShow less"], ["Reviewed August 16, 2017", 5.0, "Interesting Look at California History", "This mission has been extensively restored / reconstructed. Grounds are peaceful and pleasant, even on a hot summer day. There are numerous displays in the mission buildings tracing its history from the mission's heyday during the Spanish colonial period, through its decline under Mexican rule and later in the 19th century under American rule, to its resurgence as a historic site, tourist attraction, and place of pilgrimage during the early 20th century. The story of how the mission's promotion as a tourist destination during the early days of car touring helped spark its rebirth was very interesting. Definitely recommend taking some time to see this site while you are in Orange County.\nShow less"], ["Reviewed August 16, 2017", 5.0, "LOVED this amazing piece of California history!", "Took my mother to visit 'the swallows' place! It was a beautiful day and she really wanted to see the famous Mission. I wasn't expecting much, but to my surprise I really enjoyed it. The audio tour option for $1 was awesome and helpful. The grounds are beautifully maintained and spacious. The history and museum quality exhibits are worth the stop for families or history buffs alike! HIGHLY recommend.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Beautiful!", "I had not visited the mission in many years. I went yesterday, and I was so amazed at the restorations. The old stone church is visible now. The Serra Chapel is as beautiful and peaceful as ever. The displays of historical furniture and clothing were nicely set up. The mission grounds were stunning - lots of roses and other flowers, butterflies, lily pads and flowers in the fountains (huge koi!), and swallows' nests (they are finally back!). Lovely place to walk around.\nShow less"], ["Reviewed August 10, 2017", 4.0, "A delightful trip back into history", "The coastal train will take you almost to the door. Once there, you will have a guide take you around and tell you the history of the Mission. Great place to take children as they will be delighted in hearing the history of this mission San Juan Capistrano and the tale of the swallows that return every year.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Beautiful history", "What a beautiful piece of history. It's very peaceful and a total step back into time. I remember in grade school we had to build a replica of a mission in California and it's so amazing to visit one in person."], ["Reviewed August 8, 2017", 4.0, "A bit of California History", "California is full of historical places that shed light on the not so distant past. The Mission located in San Juan Capistrano is one such place. It is one of the most intact of the missions that once dotted the landscape from south of the border to\nShow less"], ["Reviewed August 2, 2017", 5.0, "A great place to learn more on California history.", "This is a great place for couples, family, kids... of all ages to visit. There are a lot of learning opportunities there to study about the rich history of California and you can stroll through downtown San Juan Capistrano for a bite to eat. Check the calendar if you go there during December. They open up the mission at night time to celebrate Christmas. Various bands and orchestras from surrounding high schools gather there to perform all kinds of Christmas music. Expect to spend 3-4 hours there to enjoy all the festivities. Your admission to the mission will allow you to see all the bands and orchestras spreaded throughout the mission. You can make your rounds and see different groups play. There are also local food and beverages being sold that you can enjoy.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Worth the time to stop", "I was very impressed with this mission site. It was interesting, not overly priced, and the grounds were clean and well kept. I enjoyed this mission more than the one at Santa Barbara!"], ["Reviewed July 27, 2017", 5.0, "A walk through the past", "Mission San Juan Capistrano is a great place to visit. It's a step back into the past. I highly recommend going here."], ["Reviewed July 26, 2017", 5.0, "Better than I expected, I needed more time", "The Mission was on my list of places to go for many years, finally made it yesterday.\nSomeone outside told me you can go thru in an hour, sure you can, but not if you want to read the story boards and really soak up all the little things.\nNext time I'll budget a few hours, pay for the audio tour, and really appreciate it.\nNo regrets, but anyone who really is into the history like us, needs to budget the time.\nOh, and BTW, it's popular with school groups, lots of buses and kids when we were there. Some rooms got a little crowded.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Excellent Tour", "The mission was a recommendation and we were tempted to skip it and head to San Diego. I'm so glad we didn't! The story of the missions is so interesting and the result of the Spanish colonization was phenomenal. We opted to take the guided tour and it did not disappoint! If you can, take the docent guided tour (at 11:15 daily). The gardens, the ruins, and the history really do make this a \"Do Not Miss\"!!!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Interesting and historic place", "Such history there and it was a great experience to walk around the grounds. I got several good photos there- I recommend this tour and maybe try the audio tour but we were running out of time."], ["Reviewed July 18, 2017", 5.0, "Mission stop- great addition to our day!", "We ALL enjoyed the hour pop in to the San Juan mission. Our children 8&11 found the architecture interesting and the grounds fun to explore. The koi ponds were a hit too! Beautiful flowers and rich history!"], ["Reviewed July 17, 2017", 5.0, "Beautiful mission and grounds", "I love visiting missions and this one was very nice. The grounds were absolutely beautiful (the pictures I attached do not do it justice). The mission itself was fun to walk thru. The Serra Chapel was very pretty (see picture).\n\nThe staff did a very good job at keeping things original. Any repair work was done in such a fashion that it blended in with the original facade. Very well done.\nShow less"], ["Reviewed July 12, 2017", 5.0, "What history", "So great to learn the history of the missions in california. The mission is well presented and has been very nicely restored. The plants and gardens are beaitiful"], ["Reviewed July 12, 2017", 5.0, "A do not miss", "I've actually been here many times over the years, but moved away 7 years ago. Was meeting a friend in OC and came up with the mission. I can't believe all the restoration and excavation that's happened since I last visited. I always loved walking around before, but now they've added vegetable gardens to simulate how the Indians got there food, they placed the gardens next to the excavation of ovens, metal shop, wine vat for stomping to give you the feel of the past. They've done an amazing job in preserving the mission. I think adult admission was $9.00, but It all helps with preservation. You can take your time and go at your place. Highly recommend going, you will not regret. If you grew up on Calif you learn about the missions and the history. All Calif children know Father Junipero Serra\nShow less"], ["Reviewed July 12, 2017", 4.0, "Interesting", "When you first come into town, it's right there, in the middle of shopping and restaurants. Almost unnoticeable. When you walk through the gates, it's almost like being transported from present to past.\n\nIt was 9 dollars per adult to enter. 1 dollar extra per person, it you wanted a little machine that tells you about each spot. Ours stopped working within 5 minutes. No big deal.\n\nThe grounds are beautiful, with many flowers and plants. Tons of butterflies floating around. A beautiful fountain, with lily pads floating in it. Some statues. Cactus. Benches.\n\nThere are several rooms with artifacts to look at. There is a small gift shop. I did not see any restaurant, but did see a picinic table area. Maybe for those to bring lunch?\n\nThis is the time when swallows are supposed to be there. Saw 3 nest, but not a single swallow. Super disappointing but, what can you do?\n\nIt's a great spot to visit, if you haven't done so. I went in 4th grade, over 25 years ago. Didn't remember a thing. Haha.\n\nWe were there about 2 hours. Not an all day event. I wish we would have packed a lunch. Would have been kinda cool to picnic there.\nShow less"], ["Reviewed July 10, 2017", 5.0, "A lovely and most interesting place to visit.", "The mission has been beautifully restored and has so much history to offer. There are people all around to answer any questions if you don't take a tour and even the gardens are kept perfectly. Our houseguests had been to several of the Missions and declared this by far the best.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Interesting Piece of California History", "The Mission San Juan Capistrano is really more like a history museum! The ruins of the Stone Chapel are impressive, but all of the exhibits located in the surrounding \"outbuildings\" are informative & educational.\n\nOne can get a good idea of the settlement of Southern California here, not just the Catholic dogma. There are real historical artifacts, not just recreations or simulations. There are also interesting films, displays, beautiful botanical gardens & a self-guided audio tour to tie them together.\n\nAlthough there are other missions that have more beautiful structures, this is probably the best mission in California in terms of educational/tourist value.\n\nAnd its location right in the Downtown area means that you can park once, then before/after you tour the mission, you have plenty of shopping & dining options within easy walking distance, too!\nShow less"], ["Reviewed July 10, 2017", 4.0, "Histroy", "NIce place to visit if you're in the neighborhood. Not a whole lot to see but there are quaint shops and resturaunts near by that you can stroll around."], ["Reviewed July 10, 2017", 5.0, "A Wonderful place to visit", "Once a year a large group of us go for a pot luck dinner and show. The band is always different and usually a imitation of the real group. We just saw the Bee Gees and a remarkable cover band. Get your tickets early!!"], ["Reviewed July 10, 2017", 5.0, "I am a local, it took visitors from NYC to get me to tour this beautiful place !", "So sorry I did not take this tour on my own ! We took our guests visiting to this beautiful architectural representation of the incredible mission history of California. I have traveled all over the world and have been remiss to this piece of history in my own backyard. It is perfectly preserved, the gardens are gorgeous and they have a first rate gift shop. Make a day of it and wonder behind the charming shops behind the train station and either have a picnic at the beautiful park or try one of the great eaterys SJC has to offer.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Wonderful", "A beautiful place. The flora is absolutely breathtaking. The history and chapel are wonderful. This was our second visit."], ["Reviewed July 8, 2017", 5.0, "LOVE IT", "This is truly a beautiful location. You can walk around the mission by yourself or for admission plus a dollar you can have your self-guided audio tour. And when I came if you downloaded the app that give you free headphones. It's $9 to get in but truthfully I think it's very affordable it's very well taken care of and it's quite beautiful and when I was here they were setting up for an outdoor concert\nShow less"], ["Reviewed July 6, 2017", 4.0, "Historic, Beautiful, Nice", "A must visit. A little boring for my teenage girls but after a bit of bribery all was good. Took about 2 hours. Really informative with the audio sets they provided. Beautiful grounds. Very serine. I liked it."], ["Reviewed July 5, 2017", 5.0, "Hidden gem - beautiful grounds!", "Just beautiful. We had no idea what to expect before we went to the mission but we were pleasantly surprised when we did. Beautiful flowers, history, wildlife, and art all rolled into one. We saw nesting swallows, humming birds, and honey bees; dozens of plant varieties, and toured church ruins all within a two hour time span. The staff are friendly and knowledgeable and they offer special activities for kids to keep them engaged. With or without the audio tour you will learn a great deal of California history while also enjoying the sunny California weather.\nShow less"], ["Reviewed July 5, 2017", 4.0, "Historic and interesting", "Lovers of history will enjoy this spot, as will those who are religious Christians. Unless your kids are studying missions, they'll probably be bored. (Luckily, mine had studied them and was interested to see one.)"], ["Reviewed July 5, 2017", 5.0, "Quick stop to the Mission with my 3 year old.", "Love The Mission San Juan! So much history and it's in GREAT shape! It's nice to be so close to history."], ["Reviewed July 3, 2017", 5.0, "Beautiful and historical", "Due to traffic we only had two hours to spend here before they closed for the day and we could have definitely spent at least two more hours here. The grounds are so beautiful and the historical significance is amazing. The self-guided tour, with audio, is great, but it would be even better if they had a docent guiding us. We didn't have enough time to listen to all the audio so we had to pick and choose. They have a lovely gift store, too. A must see!\nShow less"], ["Reviewed June 30, 2017", 5.0, "Quiet and peaceful", "Loved the place. It is quiet peaceful. The art and artifact are nice. Liked the church.\nFor parking - you can park on the street or there is a parking lot just across mission. Do take the free Audio tour. There train station is stone throw away. You can plan for a picnic. It will take approximately 2 to 3 hours. Lot of restaurants outside. You can buy candles at the store.\nShow less"], ["Reviewed June 29, 2017", 4.0, "Beautiful, peaceful and historical", "The grounds are absolutely beautiful with all kinds of flowers and birds. The architecture is good to breathtaking and the history is a beautiful match. Don't bother with the gift shop though unless you absolutely must have a souvenir."], ["Reviewed June 20, 2017", 5.0, "HISTORICALLY SIGNIFICANT MISSION", "The mission was founded November 1, 1776. The grounds are not very large; you can walk the grounds in about 2 hours. They give you the option for a free audio tour. The most prominent feature of this mission is the Ruins of the Old Stone Church, destroyed in an earthquake in 1812. Located next to the Stone church is a statue of Father Junipero Serra with a small Indian boy and just to the left of the statue is the bell wall. Within the buildings surrounding the central courtyard is Father Serra’s Chapel. This is the only known chapel, still standing, in which Father Serra is known to have preached. Located within the Serra Chapel is a prayer room dedicated to Saint Peregrine, patron saint of those who suffer from cancer.\nThere are also historical displays to be seen in the rooms surrounding the courtyard.\nAdmission is $9/adult with discounts for the aged, students and others. Well worth the price of admission and time to walk around this mission.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Second visit", "We loved our first visit a couple of years ago that we decided to go back because of the magnificence and history of this mission. Unfortunately, we were not allowed in because of our \"very\" little dog. Doesn't matter size, dogs are not permitted, so we took pictures at the entrance and around the area. If you are in San Juan Capistrano, take 2 hours to visit, at least. You will be glad you did. Also, stroll the main street and go over to the train station and into the shops.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Must see part of California history", "Had read a story about the swallows who return here every spring on St Joseph's Day as a child. I remember learning about the western states' Spanish history and the importance of the many missions founded by Fr Junipero Serra. We were so happy we visited. What was going to be a brief visit turned into a half day and lunch in town. It's a beautiful place, and a peaceful space to relax and reflect. Take the audio tour and one of the guided walks. We learned about Serra's Chapel-the only remaining place where the Saint celebrated Mass. Restoration work continues and masses are held daily here. It is well worth a visit rain or shine as our day was.\nShow less"], ["Reviewed June 14, 2017", 3.0, "Photography at the Mission", "My husband and I have a photography business and would go to the Mission all the time to take photos. However, on our last visit we were advised we could not use tripods and all photo rights belong to the Mission. They now only allow wedding photography who pay an additional fee to take photos. My husband e-mailed and wrote the Mission several times asking for a release of the photos we have taken to no avail. I would recommend visiting the Mission for the educational value. But do not plan on taking any professional photos. Only iPhone snap shots or small cameras.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Amazing beauty", "Always had heard about this place, if only by the reports of the swallows returning every year! Finally got to visit! As we entered the courtyard, my first thought was it is beautiful and this should take 15 minutes! Didn't realize how big the complex was and it ended up taking us an hour and 1/2! Absolutely breath-taking and beautiful and was presented so well! Loved our visit.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Perfect Time for Flowers in Bloom", "Our visit to the Mission on Mother's Day was a real treat due to the explosion of flowers in bloom. We have visited the Mission many times over the years, but we had never seen such a display of flowers. This beautiful and historic Mission is a must-see for tourists to the area. There is a small entry fee which is well-worth your visit.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Inspirational!", "We decided on a quick Sunday morning trip because we were visiting Laguna Beach and thought we shouldn't pass this up since we were so close. Wasn't too crowded, parking nearby was easy. Special place and a lot to see and to learn."], ["Reviewed June 11, 2017", 5.0, "History and beauty!", "Beautiful place to visit and so much history. Summer concerts are great too! Love the ambiance and the music us great!"], ["Reviewed June 8, 2017", 5.0, "Lovely piece of history", "I am new to American historic places. This mission showed me about the movement of the religious crsaders across the American continent and how they survived through the various stages of evolution."], ["Reviewed June 7, 2017", 5.0, "Highlight", "My wife and I were in California recently to celebrate our 20th wedding anniversary and somebody recommended a visit to the Mission. What an experience. It was peaceful, beautiful, inspirational, informative and a privilege to see. Without doubt, it was one of the highlights of our entire vacation. A stunning place.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Love!!", "I absolutely loved visiting the Mission San Juan Capistrano. Ever part of it is amazingly beautiful. I loved the coy pond. There was a school trip while we were there so it was a bit busy but I still had a great time. Also the train stops right there.\nShow less"], ["Reviewed June 5, 2017", 4.0, "Very old mission", "This mission was one of the very early ones, from 1776. It was beautiful grounds, plants and flowers. And of course the swallows.\n\nThe line on Memorial Day weekend was very long to buy tickets and someone told us tickets were available in the gift shop as well. We went there, no waiting at all.\n\nYou can get audio recording with headphones or just wander. A map is included. The grounds are very clean. The most interesting part was the Great Stone church which is in ruins from an earthquake back in the early 1800's. We have been to many missions and the church is unusual.\n\nCost for admission for seniors was $8 per person. Very enjoyable day.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Old Spanish Mission", "For the history buff it is a treat to learn about the historical significance of the missions in California. I would suggest downloading the app and using the headsets to hear about what you are seeing. The area around the mission is quaint and very walkable.\nShow less"], ["Reviewed May 28, 2017", 5.0, "Magnificent", "The ruins history and the gardens are altogether enchanting - much more than anticipated! Ended up spending more time than anticipated. Go early when first opens to avoid the lines and crowds the guided walking tour with a docent is well worth the 3 bucks and supplements the free audio tour immensely. You can not help but be distracted by the spectacular flora and fauna though!!\nShow less"], ["Reviewed May 24, 2017", 5.0, "Wow! What a Wonderful History Lesson in a Beautiful Setting", "I've been to a lot of missions in Texas and some in California and this one is definitely the \"jewel\" that they claim it to be. The gardens and fountains were truly excellent with a great variety of local flora and butterflies floating here and there. Very informative placards and the recordings will tell you more if you so choose. The preservation efforts were outstanding and the conservation well done. My husband really liked the displays which were representative but not all dusty. Loved the bells the most!\nShow less"], ["Reviewed May 24, 2017", 5.0, "A lovely Mother's Day at the Mission", "We visited this beautiful Mission on Mother's Day and it wasn't crowded at all. It's a very affordable activity to do for a day, it was $9 for adults which is reasonable. My 16 month old son really enjoyed walking the grounds and he loved fountain with the koi fish. What is still standing is kept up nicely. There's no parking at the actual mission but we were able to find street parking. There are also many shops and restaurants in the area. We spent a very nice day here.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Lots of beauty and history!", "Loved this place! It was beautiful filled w lovely plants and paths. The chapels were great to visit and a lot of artifacts to discover. I would have planned more time to visit...nice to chill out in the gardens."], ["Reviewed May 24, 2017", 5.0, "Very well preserved California Mission", "Growing up in Southern California, I have been visiting Mission San Juan Capistrano all my life. It's one of my \"go to\" places when I need to relax and unwind. Even though the mission is usually undergoing renovations on some part of the ground, it is really very well preserved. You can absolutely get a real sense of what daily life was like for those who lived and worked here. It is a very quiet and serene place. A great place for quiet reflection.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Jewel of the missions", "Certainly the best California mission to enjoy! Beautiful grounds, serene Serra chapel and wonderfully engaged Docent's and staff... a must visit when in San Juan Capistrano"], ["Reviewed May 24, 2017", 5.0, "Tour of the past here in San Juan Capistrano, California", "Very interesting touring at Mission San Juan. Lot's of history. The grounds are beautiful full of flowers in season and well manicure. Reminds me of being in old Italy. A must see for tourists."], ["Reviewed May 23, 2017", 5.0, "Lovely, peaceful historic mission - wonderful visit!", "The most well-known of the Spanish missions in California, Mission San Juan Capistrano is worth the visit. The history of the mission is told via films and the free self-guided audio tour which is highly recommended. The ruins of the original stone church stand quiet and solemn, and one can almost feel the spirits of the original parishioners who once worshipped there. The mission grounds are beautiful to walk through. Although surrounded by busy streets, it's interesting to note how quiet the mission is within it's walls. Enjoy a couple of hours here when you visit the area!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Absolutely beautiful", "This is a must see even if you're not a religious person. The moment you walk into the Mission you feel like you've stepped back into the 1800's. The landscaping is absolutely beautifully filled with various plants, Palm trees, flowers and fountains. At $9 per person, this attraction is affordable.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Mission San Juan Capistrano", "The Mission San Juan Capistrano is one of the best Missions to visit. It is one of the top three but is number one for the tour. The excellent guided tour is well done. There is a lot to see at this Mission. The grounds are well maintained with a lot of space in the inner yard as you cycle through the exhibits. The local area is a bonus with a great selection of dining and shopping. The iconic bells and free-standing section (survived an earthquake) makes this one unique. There is a cool section on one side with partially exposed archeological digs and a view back in time to days of hard labor and primitive technology.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Historic and beautiful", "This is one of the most amazing places in Southern California. It's beautiful, is historic, and very interesting. The historic church and bells are so unique for Southern California. This is a must see!"], ["Reviewed May 22, 2017", 5.0, "Where the Beer flows like wine...............", "Nestled in the quaint antique checkered neighborhood, a wonderful piece of our history carefully manicured and preserved for a quiet, educational visit. Well worth the visit and enjoy the surrounding cafe's and shops. Park and walk around."], ["Reviewed May 21, 2017", 5.0, "Historic Catholic Mission", "The Mission at San Juan Capistrano is well documented to give the visitors a sense of Mission life in the early days of California. The artifacts, paintings and other items are well preserved and presented with the historical information. Be sure to take the free audio tour as it enhances the experience and provides keen insight.\nShow less"], ["Reviewed May 21, 2017", 4.0, "Quiet Historical Site", "Although the mission sits in the middle of San Juan Capistrano, once you step into the courtyard you are transported to a time when California \"urban\" area was a mission.\nOne section was the church, one section was the educational wing, one section was the \"industrial\" section, and the last was mission housing.\nIt is admirable that efforts have been made to salvage and restore this portion of history. Without the restoration efforts, the adobe structures would be gone - eaten away by the elements.\nHaving visited other Spanish missions in Texas, the most unique item at San Juan Capistrano was the ruins of the Stone Church. Sad that it was destroyed in an earthquake. It would be wonderful if it were still standing.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Beautiful place", "The gardens are stunning. Never mind the Mission buildings. I just wanted to sit outside and enjoy the gardens!"], ["Reviewed May 16, 2017", 4.0, "Great piece of California history!", "I have been to the Mission many times. I always take out of town visitors to the Mission since I see it as a highlight of my town of San Juan Capistrano. The gardens are beautiful and the whole thing is a genuinely interesting part of our history. On one visit there were artists there in various spots working on paintings of the Mission - I got a real kick out of that.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Jewel of CA missions.", "Take a tour. After visiting the mission stroll down Los Rios Street. Delightful little town.Have a happy hour at Ciao Pasta,"], ["Reviewed May 14, 2017", 5.0, "The Disneyland of Missions", "I have been to other missions before, but none compare to this one. Not in size and not in how restored it is. This seems to be the jewel of the town! The day we visited the Mission, the town was in celebration and had a parade that traversed its main strip. The mission itself hosted its guests that day with a mariachi band that delighted all of us interested with traditional Mexican folk songs. It was awesome!\n\nIt is a well organized compound with gardens, well kept grounds, ruins, lots of history, free audio tours,and events programed through out the year. I was well impressed, and--I have to admit--I did not give ourselves enough time to actually see and experience it all (we took the Metrolink there). We are definitely coming back to finish our visit. It is known as \" the Jewel of the California Missions\", but to me it was like the Disneyland of Missions.\nShow less"], ["Reviewed May 14, 2017", 4.0, "Historic Mission", "This historic mission provides for a peaceful meditative visit with beautiful gardens. It gives one a sense of the early religious struggles in Calif."], ["Reviewed May 10, 2017", 5.0, "Premier California Historic Mission - swallows too", "Founded 1775, today is visited by millions to see parts of the original chapel ruins, the jewel like gardens, beautiful grounds and historic exhibits. Here you find the oldest building in California, 1782, the \"Serra's Chapel\". Many know the song \"When the Swallows Come Back to Capistrano\" written by Leon René and first recorded by The Ink Spots in May 1940. And yes, the swallows do still return.\nShow less"], ["Reviewed May 9, 2017", 5.0, "A wonderful peaceful place to spend an hour", "Like most people I had always heard of the Mission at San Juan Capistrano because of the Swallows. Since I was driving right past there I thought I would stop and look around. The first thing that will strike you is that it is very old. It is quite historic and well worth a visit. You will be there for at most two hours. Get a self-guided player and just walk around.\nShow less"], ["Reviewed May 9, 2017", 4.0, "Beautiful gardens and Mission", "We really enjoyed our visit here. The gardens are beautiful and enjoyed our walk through the Mission and grounds. Would recommend visiting."], ["Reviewed May 7, 2017", 4.0, "Fascinating trip back into CA history", "The mission - or what is left of it after natural disasters - was a really fascinating look at construction, some art, and history of this area. Just don't look for the \"swallows\"; locals told us they no longer return to Capistrano!"], ["Reviewed May 5, 2017", 4.0, "Worth a visit", "Worth a visit. Fascinating to see how mission worked way back with natives and Spanish mission. It's very peaceful here. But at same time, you can tell that it wasn't peaceful at times either. Either way the scenery is very nice and mission is well-kept."], ["Reviewed May 3, 2017", 4.0, "Great place for a half day outing from Irvine", "We went to see the Mission San Juan Capistrano, which is around 15 minutes by metro link from Irvine station.The ticket is only $ 6 per person , but getting to the station by Uber will cost you around $13, so it may save time by taking an Uber all the way (Around$30) and back.The historical district is just a row old houses from over the years, some pretty, and some old houses from the time of the early days of the town. The mission is just a few minutes walk from the picturesque railway station, and costs around $ 9 entry for an adult( Includes an audio guide). The volunteers at the reception are helpful and sweet.Lots of history here; within the mission is the oldest church in California which still conducts mass, the Serra chapel.Lovely flowers and cacti, amazingly cool corridors flanking the central courtyard with the garden.The exhibits from 1780s onwards, paintings( some lovingly restored), and the informative write ups gives one an appreciation of the life and times of the mission over more than two centuries.Some buildings and statues need more restorative work, some could be better maintained, and the toilets could be cleaner. The Mission industrial centre, with the vines and vegetable and fruit beds,the hide tanning area and the Tallow vats, the blacksmiths implements exhibit, all make for an interesting display.The Serra chapel is well restored, with its paintings and gold leaf covered wooden altar gleaming. Outside, flanking the chapel are more gardens , and a path leads to the bell wall with its 2 large and 2 small bells.This more or less completes the visit, and takes around 1 1/2 hours, perhaps more if you are very devout or very interested in history.The gift shop( strategically positioned as you leave), offers a lot of \"swallow \" ( The bird that epitomises the mission)motif gifts, a variety of crosses, jewellery, local mission produced jams, olive oil etc.Outside the mission there are similar souvenir shops, which are okay from some small gifts, but the silver and old' indian' jewellery is far too expensively priced.After exiting the mission don't forget to visit the grand, ornate and large Church, the Mission Basilica, located behind the mission, a few minutes walk away.Its time thereafter to get a refreshing drink and a bite to eat at one of the many eateries and wine tasting places, or you could try lunch at some of the historic and reputed restaurants around the area.We were home by 1 pm, having taken an Uber back.Great way to spend the morning.\nShow less"], ["Reviewed May 2, 2017", 4.0, "Where are the swallows?", "We saw a few swallow nests but no swallows.\n\nThere are great little areas what they have turned into display areas and items are well preserved and even a few rooms are temperature controlled. There is a crucifix on display that has a bullet hole through it and they say they found the bullet in a nearby wall and have that on display as well.\n\nMany beautiful gardens with lovely color.\n\nThey have done a good job of restoring the mission.\n\nThe church is very beautiful. They have candles for purchase that you can then light and leave if so desired.\n\nThe old church that has destroyed in an earthquake I think it was 1812 must have been amazing.\n\nThere is an admission charge but it is reasonable.\n\nShow less"], ["Reviewed May 1, 2017", 5.0, "An OC Must-See", "Southern California is a wonderful place. I'm a native, and can't imagine living anywhere else. But if I've got one knock against the place (aside from the ridiculous traffic), it's that there's relatively little by way of history here. It's not to say we don't have it, there's just not a lot of it left to enjoy. The region loves to reinvent itself, usually at the cost of something that tells a story of how it used to be. Which is why Mission San Juan Capistrano is so important. This place is the real deal. A centuries old bit of living history, and an architectural treasure that offers sights and tells stories that you won't find anywhere else in the region. Spend as little or as much time as you wish here (although a few hours at least is my recommendation), it will do your heart good. They don't call it the Jewel of MIssions for nothing...it's as beautiful as anything you'll see in Southern California. And the (very) old Serra Chapel is not to be missed. Since traffic can be a problem in this stretch of the county, it's also worth noting that Metrolink deposits you quite literally steps away from the entrance. It's a rare attraction that's truly mass transit-friendly. In short, if you visit Southern California and miss this place, you've made a major mistake.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Great place for meditation", "As a child, we used to drive to Capistrano from Huntington Beach to watch the swallows return on their annual pilgrimage.\n\nI hadn't been back here since we moved away in the early 1970s. It still looks pretty much the same.\n\nIt was the seventh of the 21 Catholic missions founded in Alta California and dates back to Nov. 1, 1776. Father Junipero Serra personally led a group to establish the mission.\n\nI've visited most of the California missions and Capistrano remains one of my favorites. The flip side is that the missions essentially enslaved Native Americans in order to spread the reach of Spain and the church. I have a hard time reconciling that.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Inspiring", "Yesterday was my first trip to Mission San Juan Capistrano. My husband and I just finished a hectic season of life and were just taking a \"date day.\" It was refreshing to learn a little more about California's history and walk through the gardens. I did not want to leave.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Great Experience", "I loved learning about the Mission. I could spend a whole day here. The gardens are beautiful and the koi ponds/fountains are well kept and beaitiful as well."], ["Reviewed April 26, 2017", 5.0, "Stunning oasis", "A beautiful place, gorgeous gardens and seeped in the history of the area.lovely buildings well thought out exhibits and very well explained story of the missions. Well worth a visit. Reasonable charge to get in and a very well stocked gift shop with some unusual items to purchase. If you are in the area don't pass this by\nShow less"], ["Reviewed April 26, 2017", 5.0, "History Day with family..", "Love to walk all around the mission lots of History and beautiful gardens and treasures hidden on this place I live so closed and Year that I visited I feel so good to walk around and spend a day at the Misision I will love to comeback very soon..\nShow less"], ["Reviewed April 24, 2017", 4.0, "Day at San Juan Capistrano", "We drove up from Anaheim on a weekday. Took about 45 minutes with traffic. It was very nice, lots to see, and ample street parking at 10 am. BE AWARE of school groups-they were a bit much. THe town area was nice, and plenty of places to eat and drink to fit all budgets. The artwork at the Mission, and the historical aspects make it well worth a visit. This place is sure to please many age groups.\nShow less"], ["Reviewed April 24, 2017", 5.0, "A wonderful place", "An unexpected surprise of history and beautiful gardens. Peaceful place to walk and learn about the areas diverse history. Beautifully planted gardens with helpful staff willing to answer questions about all the plants within the mission. A must see for anyone in the area."], ["Reviewed April 24, 2017", 5.0, "Great setting for a dinner", "One of the most interesting historical sites in Southern California. We went there for a large business dinner - good place to do this outside."], ["Reviewed April 24, 2017", 5.0, "Beautiful and Peaceful", "Not knowing much about missions, we were pleasantly surprised how much we enjoyed are visit. Be sure to get your included audio guide and start your tour with the short film. The church was absolutely beautiful and enjoyed sitting in the Saint"], ["Reviewed April 24, 2017", 5.0, "Place was great", "The place is great and the design of the place was awesome. The surroundings were clean and felt sacred. The church is solemn. For catholics, a must-see!"], ["Reviewed April 23, 2017", 5.0, "A Must Visit", "The mission is an architectural, historic, and spiritual gem. It gives on a journey into California history and is a must see if you are in the area."], ["Reviewed April 19, 2017", 5.0, "Beautiful California Mission, not to be missed!", "A truly beautiful California mission. It is well worth a visit as it is very well maintained, though most of the buildings are more recent than the original mission, with a beautifully landscaped garden complementing its rich history. The chapel within the mission is purportedly the oldest building in California. The remains of the stone church are also worth seeing, in addition to learning about the swallows of Capistrano. There is a small but very interesting collection of period items and religious art.\n\nThe mission opens at 0900am and this is the perfect time to visit as at about 1000am, during weekdays, the school visits start and although cute and lively, you may prefer to visit it in a less animated context to take in the tranquillity of the location!\n\nNote however that the associated gift shop only opens at 1000am so you will be unable to collect the audio tour device before that time.\n\nIf you get to the mission before 0900am, there is a Starbucks exactly in front where you can while away the time over a coffee until it opens.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Besutiful", "We took friends from NC to the Mission. It is a beautiful amazing place. The history of the mission, the restoration, seeing how they did things many years ago was fascinating."], ["Reviewed April 15, 2017", 4.0, "Awesome Mission experience", "We have been in the area many times and my wife decided to check it out. We got the tickets online which was a little cheaper than at the gate. They have specials for families and kids and seniors. We had a bit of trouble finding parking but there is a garage less than a block away.\n\nWe went in and there was a wedding party taking pictures in front of us. The rep at the counter was very nice and helpful. She suggested the free audio tour which took us a second to get working. If you do that make sure you take a map with the locations marked so you know which audio to listen to.\n\nThe audio tour was not super dry but loose and pretty entertaining and covered all kinds of things with interesting narrative. The mission itself is amazing. We almost missed the right side which has beautiful old three walled structure with a forum and alcoves. Remarkable history there.\n\nThe mission has the old ovens for cooking and hide tanning as well as awesome herb gardens and fountains but the capper is the chapel with a beautiful 400 year old altar from Spain and amazing paintings.\n\nOverall a learning experience along with experiencing the beauty of California history. We spent several hours there and could have spent a couple more. Very much recommend for students and fans of history like me.\nShow less"], ["Reviewed April 11, 2017", 5.0, "A historic landmark and step back in time located in the quaint town of San Juan Capistrano, Ca..", "If you are looking to get a first hand view of what the early missions were like in California, this would be the place to go. Seeing the grounds and various buildings and chapels within the grounds provides you an important part of history that has been preserved. Within the mission grounds is part of the original church that has withstood time along with the help of restoration efforts to keep in intact. Take your time on a self guided tour and have lunch or dinner at El Adobe Rest. an old stage coach stop just down the street.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Historic Mission!", "Amazing experience, and you learn a lot about the California Missions. You can tour the Mission yourself which is well explained, or a guide can help you. Beautiful piece of property, and the staff is very nice and helpful. Definitely recommend!!"], ["Reviewed April 10, 2017", 5.0, "Great place. So much to do & see", "Great time seeing everything. Everyone really enjoys walking the grounds & hearing & seeing all the great history"], ["Reviewed April 10, 2017", 5.0, "Seeking California History", "I recently visited the Mission in San Juan Capistrano. (I visited many years ago). I have a passion for the Mission system in Mexico and California and have visited several. The San Juan Mission is only 2 miles from my home and I'm so glad I revisited it.\n\nThe Chapel where Fr Serra held a service is still intact. There is an exhibit dedicated to him. The grounds are lovely. There is also an exhibit dedicated to the original Indians who inhabited the area.\n\nI met two women that day...they also have a passion for Missions and have visited others. San Juan is their best!\n\nI feel so blessed that San Juan is in my back yard. It embraces all the glory of that era for California and Mexico.\nShow less"], ["Reviewed April 9, 2017", 5.0, "To Truly Understand CA History", "Founded in 1776, the same year as The United States, and 3,000+ miles away, The Mission San Juan Capistrano is a very special place to visit. If you slow down to absorb the story of its founding, it's influence in the area's history, and the connections to Dana Point Harbor (Two Years Before the Mast by William Henry Dana), you can soak in the rich stories of the forefathers of the region. It is a beautiful and well preserved historic destination.\nShow less"], ["Reviewed April 9, 2017", 4.0, "Historic mission", "This is a very historic California mission. It is popular with foreign visitors as well as locals. You can take a self guided tour or use audio headphones."], ["Reviewed March 31, 2017", 4.0, "Nice place to visit and learn", "This is a great place for a few hours especially with children. You learn a lot about the California Missions."], ["Reviewed March 31, 2017", 3.0, "lots of history", "not as complete as a lot of the missions but the swallows make it famous worth seeing but a lot is in ruins"], ["Reviewed March 29, 2017", 5.0, "Historical Highlight", "On a recent trip out my wife finally brought me by the old mission. Easily worth the visit, especially for anyone of a historical bent. Highly recommended."], ["Reviewed March 28, 2017", 5.0, "A Highlight of My Trip", "I did a road trip through Orange and San Diego counties this month, and the Mission San Juan Capistrano was one of the highlights. I visited three missions in southern California, and this was by far the most beautiful. I was there two days before the swallows were to return, so I enjoyed learning their story. The grounds are so pretty with all of the colorful flowers and plants, and it's quite serene. A lovely place.\nShow less"], ["Reviewed March 25, 2017", 5.0, "Awesome", "I recently re-learned about this mission and many others in my US History class so we decided to head over and check out the mission. It was absolutely beautiful and we came just a day before the celebration of the Swallows (birds) coming back. It was a great trip and I would definitely recommend it for people wanting to learn more about the history of our wonderful country.\nShow less"], ["Reviewed March 23, 2017", 5.0, "Mission Visit", "Wanted to visit some amazing history and it was 35 years since I was there as a child. What an amazing time. Thought we (family of 4) would be there for an hour or so and then move on but after touring the Mission and town for 6 hours so much for that thought. What a piece of Southern California and Orange County History. Forgot that there was so much to see and learn. Would recommend this to everyone. The restaurants were interesting the the food very good. Strolling through the old part of town was also very interesting with some neat little shops. The only disappointment was missing the Swallows.\nShow less"], ["Reviewed March 23, 2017", 4.0, "Beautiful grounds", "It wasn't too busy when we visited this lovely old mission. At one point there were dozens of school children eating lunch on the lawns, but they soon left to board their buses.\nThe grounds are beautiful, very colorful and well cared for. There are rose gardens, fruit trees, amazing cactus and a fish pond. Most plantings are familiar, some are not, but all are worth strolling through despite the heat.\nAn audio commentary obtained at the ticket desk gives lots of information about the ruins and the buildings which are well worth seeing. The beautiful chapel is open to visitors\nShow less"], ["Reviewed March 22, 2017", 3.0, "Anticipation greater than reality", "We included San Juan Capistrano on our itinerary because of its fame gained from the annual return of the Swallows on March 19 and the Mission's prominence as the largest of the California Missions. We were there after the swallows had arrived and missed out on the festival atmosphere that accompanies their arrival. But the visit was still worthwhile. Touring the Mission gives you a much better understanding of the purpose and history of all the California Missions. And for us, the visit satisfied our curiosity about the swallows.\nShow less"], ["Reviewed March 22, 2017", 5.0, "What a fabulous place!", "We had a bit of extra time until the start of a nearby event so we stopped in. What a lovely surprise! The grounds were absolutely lovely and there was so much interesting history. Very nice displays and chapel. Nice gift shop too. I highly recommend a visit.\nShow less"], ["Reviewed March 22, 2017", 4.0, "NO SWALLOWS!", "Went here on St. Joseph's Day. NO swallows . Was told since they had to remove n relocate the nests bc of the renovation the swallows are very scarce. They are hoping they come bk. Very disappointing, however the grounds and ruins are fantastic. The weather was lovely and the special fly over from retired vets was the highlight! The center of town is located a blk or 2 away and filled with lovely shops n restaurants\nShow less"], ["Reviewed March 21, 2017", 4.0, "Interesting place", "Worth a visit, Lovell grounds and interesting chapel and historic facilities. Understanding how the Spanish attempted to colonize California is worth the visit."], ["Reviewed March 18, 2017", 5.0, "Beautiful", "Very historic, one of the original 12 missions in California. This is a must see for everyone. Gorgeous little chapel dedicated to Saint Serra. Awesome gift shop, beautiful grounds."], ["Reviewed March 15, 2017", 5.0, "Well worth a visit", "We are from New York, so didn't grow up learning about the missions from San Diego to San Francisco and their role in the development of the state of California. Visiting this jewel was an excellent introduction to the history, architecture and artisans involved in this movement. Our tour guide was terrible -- just didn't know how to tell a story or to explain things to those who weren't in on it already. But there is an audio guide that people were using all over the grounds. So if you too find that your guide on the free tour is less than informative, just slip away and pick up the free audio guide.\nShow less"], ["Reviewed March 13, 2017", 5.0, "HISTORIC MISSION SAN JUAN -- A VISUAL SYMBOL OF CALIFORNIA HISTORY AND HERITAGE", "Located on Camino Capistrano in the historic center of San Juan Capistrano, just west of the I-5 freeway interchange with Ortega Highway (CA-74), and within walking distance to Los Rios Historic District, El Adobe restaurant and the San Juan Capistrano train depot (Amtrak and MetroLink), the MISSION SAN JUAN CAPISTRANO, founded in 1776 by Junipero Serra, is a national historic landmark and a visual symbol of the Spanish, Mexican, Indian and American heritage of California. The mission ruins are the home of world famous migrating swallows that return to the Mission every year on March 19. The Mission, with ruins of the former mission, well-manicured gardens, pleasant courtyard, fountains, flowers, archways audio tour, is an inspiring and stimulating experience. Parking is sometimes a problem; I recommend the parking structure at the train depot that is two blocks away.\nShow less"], ["Reviewed March 11, 2017", 5.0, "Very Glad We Got To Take This Tour.", "Steeped in history. Our tour guide was very informative and open to questions. The artifacts, the grounds, the remains of the original church which was destroyed in an earthquake. The little chapel with the beautiful altar, the grounds, it's all beautiful. There is a gift shop with a lot items to bring home as a remembrance.\nShow less"], ["Reviewed March 8, 2017", 5.0, "Spirit-Reviving Experience", "Having been to this Mission many, many years ago, we didn't know what to expect. What we found was a much-improved experience: landscaping was gorgeous, the explanation of how and why the Mission worked, and the facilities have all undergone great rehabilitation. It is a place one wants to \"hang out \" and savor the sun, the sights and the beauty of the surroundings in a family friendly environment. No wonder this used to be my mother's favorite destination those long years ago!\nShow less"], ["Reviewed March 5, 2017", 4.0, "Interesting and educational", "This is the mission to visit. Extraordinary exhibits and historic structures. Peaceful place with beautiful grounds and gardens. Can transport you back in time. Very well presented tour. Interesting story about the swallows visiting each year. There are special events happening on certain days of the year so check before you visit to see if you are interested in attending any of them. Allow enough time to take a stroll through town afterwards.\nShow less"], ["Reviewed March 5, 2017", 5.0, "Worth a visit!", "As with the other missions in California, this one has preserved some wonderful history. Located right in the middle of the historic part of town, and walking distance to the train stop, it is worth a visit, and tour. Try to avoid weekends, and when the swallows are expected - parking and crowds are frustrating.\nShow less"], ["Reviewed March 5, 2017", 5.0, "Beautiful", "We enjoyed the mission on a beautiful sunny day. Took in the history and enjoyed walking the grounds. Many artist in the court yard painting their version of the buildings, some were very good at what they were doing. Be sure and do the audio (included with admission) as you learn so much more. We spend a couple hours the grounds, plenty of seating if you need to rest or just take a moment to enjoy the quite and relax.\nShow less"], ["Reviewed March 4, 2017", 4.0, "Peaceful", "This place is one in a million. Where you feel the ppl that came B-4 you . A quiet walk on The grounds give you the peacefulness you long for. Bring home a gift from the gift shop u will enjoy every time you feast your eye and remember\nShow less"], ["Reviewed March 2, 2017", 5.0, "Spanish Ambience", "Beautiful place with Spanish ambience. I had a wonderful experience at the Mission San Juan Capistrano. The place is safe with relaxing view. Souvenir items are very affordable with polite and friendly staff. I enjoyed the place with colorful water lilies. No wonder it is a tourist destination. Visit and see for yourselves.\nShow less"], ["Reviewed February 27, 2017", 4.0, "a great half day trip out of LA", "Don't go expecting the most polished exhibits in the world and it's perfectly charming. Not sure that the docent tour is any better than the audio (possibly less comprehensive, depending on time constraints, but they try hard and are genuinely interested. If you ask the right questions and take time to read the signs you can transport yourself back - parents who do this too, can paint a good picture for school age children; they should learn about life when things weren't at your fingertips. The historic town behind the RR tracks makes a good wander too. Even on a cold and windy day, it was pretty enough that I went back to the car for a sweatshirt and stayed a while longer.\nShow less"], ["Reviewed February 23, 2017", 3.0, "Underwhelmed", "Heard about this over and over and over again as a kid growing up, so it was underwhelming when I actually got to visit. It's much smaller than I expected and the original church/chapel is an archaeologic ruin excavated not that long ago. Glad I went, and did visit the Basilica about a block away. Lots of history here but it just wasn't what I expected.\nShow less"], ["Reviewed February 19, 2017", 5.0, "Historic", "Amazing place. It was great to learn about all the history at this Mission and the tragedy that occurred. I wish we could have visited to see the Swallows nest but even without it was awesome."], ["Reviewed February 16, 2017", 5.0, "Fantastic Photo destination", "We visited this Beautiful Mission as we drove the California Coast with our teenage children. It was beautiful. The photos I took at this place were my favorite and they are framed and hanging in my home as a reminder. The flowers and plants were stunning. The swallows/birds return to the mission each year around March. The Great Stone church is still amazing even though it is in a state of ruins. There are many places to have a nice lunch within walking distance.\nShow less"], ["Reviewed February 15, 2017", 5.0, "Tour of San Juan Capistrano Mission", "The audio tour is good but the docent tours are great. There are activities throughout the mission for all age groups and interests: garden tour, native American Crafts exhibition, children's activities ( gold panning, rope making, adobe brick making)."]]}}