{"Monterey Bay Aquarium": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Monterey Bay Aquarium", "url": "/Attraction_Review-g32737-d104804-Reviews-Monterey_Bay_Aquarium-Monterey_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/e9/ba/44/coral-tank.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "12088"}, "address": {"@type": "PostalAddress", "streetAddress": "886 Cannery Row at David Avenue", "addressLocality": "Monterey", "addressRegion": "California", "postalCode": "93940-1085", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "great place for all ages", "amazing displays, with a wide variety of sea life and great live feedings and short films. Lots of docents and volunteers wandering around to answer questions. Food is very expensive in the cafe though, I'd get my hand stamped and head out to cannery row down the street for lunch and then come back if I could do it again.\nShow less"], ["Reviewed 3 days ago", 4.0, "excellent place to visit but it is getting pricey", "I used to be an Ocean Member but I actually got bored by going there too many times. It has been three years since the last visit. And, I was impressed. The aquarium made a lot of changes to make it more kid friendly.\nI highly recommend to get to the Sea Otter exhibit early for the feeding; like at least 40 minutes early to get a front window spot. I was amazed how deep the crowd became as I looked behind me. And be on top( second floor) so you can see the handlers do their demonstrations. You are not going to see much action by being on the first floor. I had lunch there. If you are a big fan of iced tea, do not get theirs. the tea is not even cold; it is at room temperature.\nThe parking has become a bit cheaper than before( the parking garage). It is a flat rate of ten dollars. Before, it was hourly so you can pay more than ten dollars.\nNow, it will cost nearly $50 to get in. It is getting very expensive. I will maintain my pace of visiting this place every two to three years.\nShow less"], ["Reviewed 3 days ago", 5.0, "Amazing aquarium! Best to visit during the week to avoid the crowds.", "Completely amazing aquarium. So well thought out with so much to do and see. Amazing setting - we saw sea otters, seals and dolphins in the bay outside the aquarium. The canteen has great views and the food is good. Definitely better to visit during the week to avoid the crowds.\nShow less"], ["Reviewed 3 days ago", 4.0, "Beautiful", "We used to live in Monterey and had a membership to the Aquarium, so we've been there many times. We now live out of state, so this was a special return to Monterey and the Aquarium. First, I have to say it's a beautiful facility. We've visited many of the biggest aquariums around the country, and this one is still our favorite. We were disappointed to not be able to see the Ocean Sunfish in the Open Sea exhibit, but that was no one's fault. All the exhibits were clean and beautiful, and the animals looked healthy. We ate lunch there, and the food was overpriced and blah, but that's what you expect from a place like this. The french fries were good, though. The gift shop is extremely overpriced, so we didn't buy anything. After we left, we found some of the same items on Amazon for a much better price. I realize they raise prices to make money to support the aquarium, but I'd rather pay normal prices and donate money for their cause than to feel ripped off. Our biggest concern about our entire experience, and what put a damper on the entire day for us, was the rude behavior of a few of the other guests. One older woman was extremely rude to my family and said some terribly hurtful things to my adult daughter who has a disability, along with shoving her out of the way. All day long, were were literally being run into and pushed by teenagers and adults alike. We were there on a Thursday not near a holiday, but the place was extremely crowded. We were happy to wait our turn to look at the exhibits, but time and time again, we had people push us out of their way so they could see first. I've never experienced anything like this before, and I hope it isn't a new trend.\nShow less"], ["Reviewed 4 days ago", 3.0, "overpriced; wonderful bird display", "For years I had been told to visit the Monterey Aquarium when I got to California, so imagine my eye-blinking surprise at the entry fees. We paid $90 for the two of us (1 adult, 1 senior). I also thought that there wasn't enough information on the displays. We wanted more detail, more interpretation. There is a lot of empty space at the aquarium (maybe to accommodate crowds?) and also many exhibits just for children. As an adult learner, I was hoping to get more from visiting. We are former residents of Boston who were members of the New England Aquarium; comparatively speaking Boston wins hands down. Entry fee - $27.95.\n\nI will give thumbs up for the Sandy Shore and Aviary Exhibit - that was wonderful to see the birds who had been rehabilitated [more information on that would have been helpful] and to get to see them up close.\nShow less"], ["Reviewed 5 days ago", 5.0, "Amazing displays of aqauatic life.", "This museum is well worth the fee as all the activities and displays are excellent. The staff are very courteous and friendly."], ["Reviewed 6 days ago", 5.0, "Still in awe", "We spent the day at the aquarium. Seven hours. I am still amazed by all the interesting things we saw. We are a mature couple and it was fascinating. We went on weekday so not huge crowd. I received news from home about death of family member while at aquarium. It was a perfect peaceful place to be under these circumstances. I liked the information about history of sardine business that was included. I would definitely recommend to anyone coming to Monterey.\nShow less"], ["Reviewed 1 week ago", 3.0, "Overpriced", "This used to be such a fun family location to visit... and it still is, but seriously? The admission price of $50 for a few hours of walking around looking at the beautiful fish, is WAY too pricey for a family of 4."], ["Reviewed 1 week ago", 5.0, "An Amazing Underwater World Experience!", "The Monterey Bay Aquarium is a fascinating, educational place full of wonderful discoveries at every turn! Enjoy the exhibits, learn during their many educational programs throughout the day and be sure to watch the otters and penguins during feeding time! This aquarium offers whale spotting and we saw a number of whales during our visit. A must see!!!!\nShow less"], ["Reviewed 1 week ago", 5.0, "You have to go", "This is the aquarium to see. The settings are so great you will think you are in the ocean. Get your ticket at your hotel and you can skip the long line to get tickets and our Marriott hotel purchased tickets let us return for free the next day. Go on a weekday if you can. The weekend was crowded, but we did not have an option. We still loved it.\nShow less"], ["Reviewed 1 week ago", 5.0, "The best aquarium in the bay", "-not that there’s many options.\nThe Monterey bay aquarium has a very interesting history and is fueled entirely by a passion for marine conservation. This has been one of my favorite places to visit since I was a child, and I’ve gone back several times in my adult life. I definitely recommend going during the colder months to avoid crowds. This way you can actually see the exhibits and admire them at your own pace.\nShow less"], ["Reviewed 1 week ago", 5.0, "Best Aquarium In the World and Conservation Powerhouse", "The Monterey Bay Aquarium is a must visit for people in the area. It is pricey but well worth it and your money goes to a good cause."], ["Reviewed 1 week ago", 5.0, "Our Favorite Aquarium", "This is by far our favorite aquarium, we live over 5 hours away but purchased annual passes and we visit several times a year. The exhibits and marine life are a joy to observe in wonder."], ["Reviewed 1 week ago", 5.0, "Expensive but worth it", "It was 50$ entrance fee per adult. There are special feeding events which are fun to watch. I loved the jellyfish in particular. Various activities for smaller kids, very educational."], ["Reviewed 1 week ago", 3.0, "Slightly disappointed. Have been to better aquariums", "We did get a reduced rate for our visit. Was supposed to be $49 but were only charged $39 since it was Valentines day. Try to see all the feedings. Was disappointed that I wanted to see the shark movie, showed up 1 minute after it started and they wouldn't let me in.\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome place", "This is my third visit to the MBA. The aquarium is fresh and lively. The exhibits are inspiring and thought provoking."], ["Reviewed 1 week ago", 5.0, "greta place", "we spent the entire day, the food was great and the staff was helpful and knowledgable - kids loved it"], ["Reviewed 1 week ago", 3.0, "Wasn’t as cool as I thought", "I went to the aquarium for the first time this past weekend. Maybe I had too high of hops b/c I thought it wasn’t worth the price. I got thru everything within 1hr and the only really cool thing was the jellyfish. They did have a lot of odd fishes but I think they could have had more fish.\nShow less"], ["Reviewed 1 week ago", 1.0, "No whales, no sharks, total disappointment", "2/16/2018\n\nSince the aquarium opened, I have been desiring to see it. Each time I passed through Monterey, I skipped it. Finally, on 2/7/2018, I paid the $40 for admission and toured the whole darn aquarium; it is $30 too much for what you get. I was expecting to see whales and sharks, but the displays featured no whales, or sharks, but mostly tropical fish. It reminded me of a friend's living room aquarium. What a disappointment! The best part was the view from the exterior decks, and the available binoculars at no cost. For customer service, I give the aquarium a 10 on a scale from 1 to 10, 10 being best.\n\nBTW, we parked two blocks away for free.\n\nIf you want to see a real aquarium, got to Newport, Oregon. You will see sharks, whales, manta rays, etc. At half the price.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Very enjoyable aquarium", "Had a pleasant time visiting. Very good assortment of marine life and habitats. Would recommend visiting when in the area, especially on a poor weather day."], ["Reviewed 2 weeks ago", 5.0, "Educational, Fun, Clean and Friendly", "You could easily spend all day here. Recommend getting a multi-day pass or even a membership pass because there is so much to see. Ease of access makes it perfect for all ages. Plenty of places to sit and rest and spectacular ocean views. Will be returning and absolutely recommend.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Most impressive aquarium I've ever seen", "I've been in multiple aquarium in France, Spain etc. but this one has something more.\nBeing able to see the wildlife just outside the aquarium and seeing huge tuna fish being fed was just a mesmerizing experience !\nI would love to go there once more and would recommend it to anyone, children or adults\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Always a wonderful place to see", "The Aquarium continues to expand and grow. The lectures are wonderful. Currently they have one about a young Sea Otter Rescue."], ["Reviewed 2 weeks ago", 4.0, "Good - but I've been to similar", "I had heard this was head and shoulders the best aquarium in the world. I wouldn't say that. It was good, but not dramatically better than the London Aquarium for example.\nHighlights were the sea otters and the cephalopods.\nRays in the touch pools seemed to be aware of the hoards of people who would prod them and so kept their distance.\nThere were lots of kid's activities inside like mini playgrounds which I wasn't really sure was necessary as it cheapened the place.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "World Class Attraction", "A great family day out - fascinating, educational and fun. Huge tanks, great talks and presentations. A favourite was the touching pools with the opportunity to touch a ray. More than just fish - penguins, otters, birds, snakes and lizards. If visiting Monterey this is a must-do.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Family tour", "I have visited Monterey bay aquarium with my wife and son. It\ntakes 2.5 hours to go there from downtown of San Francisco by car. Traffic was good, as we had started at 7:40. If you would like to park your car along the street of aquarium nearby, you have to reach there before 10:00. After that, you have to park at parking lot and it costs 10 dollars. Aquarium is great, for adults and kids. You may spend hard a day there if you want to enjoy all. If you want to have same experiences, visit Osaka Kaiyo-Jan or Okinawa churaumi aquarium.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great for kids", "You can sea sea otters up close, plus penguins. Children would love this (and the aquarium was full of them each time I visited)"], ["Reviewed 2 weeks ago", 5.0, "Amazing Experience & Stunning Views & Service", "If you make it to the central coast of California, your visit isn't complete without a trip to Monterey. It's exhibits and its messaging about ocean conservation are ones not to be missed. It also has stunning views. Employees are great, engaging, and looking to share their knowledge. The restaurant is also really good - and its views are also awesome.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wonderful big fish", "Especially liked the big fish in the giant central aquarium, sea bass, sun fish and sharks Loads of very knowledgeable volunteers around to answer any questions"], ["Reviewed 3 weeks ago", 5.0, "The BEST birthday trip with my littles", "We recently visited the Aquariam for my daughter's birthday and we were not disappointed! The Aquariam is obviously very fun, but the hidden gem here was the staff! Every single person I encountered genuinely seemed to enjoy working there and were chock full with knowledge that perfectly adds to each attraction. My kids fav was the bat rays but I fell in love with the jellyfish! Highly recommend for families, we spent the entire day!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "We learned so much -", "We had a great day at the aquarium !!\nWe did a class on Sea Otters ... the volunteer was so knowledgeable and friendly.\nWe had a small group ... so it was almost like a private tour.\n\nWe would love to do more of the Behind the Scenes and class type stuff.\n\nThe aquarium was a busy place ... but everyone was friendly and helpful.\n\nWe would certainly go back!!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Educational", "Love this place !!! my grandkids enjoy it. I try to bring them a couple times a year every time we come it's a different experience. There's a lot of educational areas now inside the aquarium which is great for younger children a definite must place to bring the children\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Trip to Monterey Bay Aquarium", "Located less an hour and a half from my home town San Jose lies the beautiful city of Monterey, California. Nestled right on the ocean, with beautiful views and a heavy focus on natural beauty the city is a gem in itself. However, the highlight for most tourists in Monterey is the state of the art, breathtaking aquarium, The Monterey Bay Aquarium. This was what brought my girlfriend and I to make the trip down to Monterey in late December of 2017.\nThe sole purpose of our trip was to visit the Aquarium and to have a nice lunch in Monterey. The drive was beautiful and provided amazing views of the coast. Upon arriving traffic was quite busy due to the small streets of the city, however, we were able to find free parking just a few blocks from the aquarium. When we arrived, the line to get tickets was much longer than I’d seen it on previous occasions but we were able to avoid most of it by buying our tickets online while we waited in line. Ticket prices were a bit expensive at $40 per person, but were ultimately worth it.\nThe mode of transportation used for the tour was a simple self guided walking tour. Due to the high volume of people in the aquarium the only mode of transport available for visitors is by walking. Although I do believe they offer some guided tours by employees the most common and efficient way to see all the exhibits is to simply follow the map and go to the exhibits you’re most interested in. In our case, this method seemed to suit us well and we were able to see most everything.\nDuring our visit we were able to interact with many employees in various jobs and departments. The most notable of these employees would probably be when went to go touch the various see animals they have available for up close encounters. The employee running this area was a very kind elderly man who was a volunteer at the aquarium. He was extremely knowledgeable and passionate about his job and the animals, and, was able to tell us about the different animals in front of us. He was also very kind and treated us with the utmost respect while doing his job extremely well.\nThe service we received while at the Monterey Bay Aquarium was exceptional. From our entrance in the aquarium to our exit the employees were extremely welcoming and kind and made us feel calm in what otherwise can be a very overwhelming aquarium. The employees were also very passionate about their work and it truly shows in the service they provide. Employees were excited to teach us about the various animals and to grow our appreciation for marine life. In addition, the service provided at the information desk was super helpful in allowing us to further our entire aquarium experience.\nThe impact of The Monterey Bay Aquarium is unmeasurable. For my girlfriend and I the aquarium had a big impact. We had an absolute blast while there and were able to create create memories together. In addition we were able to deepen our understand of marine life and, specifically, grow our knowledge of the animals in living in our area and in our ocean. The impact of the aquarium will most definitely bring us back to experience it again. As for the impact that The Monterey Bay Aquarium has had on the local area, enough can not be said to describe it. Not only has the aquarium attracted new visitors from all around the world but it has also helped grow appreciation and a focus on nature in the community. In addition, the aquarium has become a major research center and has made discoveries that have saved marine life and protected the beautiful shores of Monterey and California. Finally, the aquarium has allowed for a multiplier effect leading to the growth of many great business and nonprofits on Cannery Row and around Monterey.\nIn conclusion, The Monterey Bay Aquarium is a perfect destination for any traveler whether it be with a family, friends, or by yourself. The aquarium is very manageable to get around, the employees are outstanding, the service is impeccable, and its had a huge impact on the local area and me personally.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best aquarium in the USA!", "We live in Santa Cruz and have been to the aquarium 50 times! I can’t get sick of this amazing place. Our daughter adores it. The new exhibits called Tentacles is amazing! A must see of the amazing octopus! The moray eels are so creepy too!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Always changing always wonderful", "This is a must do when visiting Monterey. They do a great job with all the exhibits and you learn so much. They have a new Baja exhibit that is very interesting. Give yourself extra time just to enjoy the full aquarium."], ["Reviewed 3 weeks ago", 5.0, "Beautiful aquarium!", "The staff here is so passionate about conservation, animals & they have so much information to share! Lots of exhibits & live feedings could have you lingering there all day!"], ["Reviewed 3 weeks ago", 5.0, "Always amazing", "While $50 a head isnt cheap this place always offers plenty for adults and children alike. Download the app and sign up for text alerts for the secret feeding times. Borrow some binoculars to loook at the otters and seals, and if you are lucky a whale or two. We had lunch of soup and half sandwich which again was plenty as portions in the US are huge for no good reason. Enjoyed the presentation called Open Sea where they feed different fish and explain why they stagger the feeding etc. Fantastic place and I look forward to my fourth visit sometime soon. One last thing, our hotel (Marriott) could get tickets for two days for the price of one so check with your hotel if you are staying nearby.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great selection of sea creatures and helpful staff but very expensive", "This aquarium has a large number of and diverse selection of sea creatures. I got to see kinds of creatures such as lobed comb jelly, sea gooseberry, and garden eel that I don't think I've seen before. We also got to watch the feeding of African penguins and sea otters. The more aquariums I visit, the more I realize that I'd prefer watching sea creatures in their natural habitat, but nonetheless, this aquarium provides a safe and very educational place for children and anyone who wants to learn more about sea creatures. Many staff are stationed in each area just in case you require more information or assistance. They also have presentations in the auditorium. The one we attended on sharks was highly entertaining and informative. You can spend 2-3 hours comfortably. There is no parking so find parking elsewhere. Lastly, the admission is super pricey at $50 US per adult.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Still going strong after 30 years!", "If you love the Pacific Ocean and want to learn more about it’s environment, eco-system, animals of all kinds in a first class setting- you need to come here! This trip was a revisit for the family, 20 years since the last visit for some of us. The magic of exhibits and sea otter love is still there! The views are exceptional and even if you stop for a lunch break during your Aquarium day- you will not be disappointed! Lots of people enjoy this venue, so pack your patience and crowd loving joie de vivre- it’s a party all day long with all the best this beautiful area of Central Coastline has to offer!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Absolutely stunning", "This is a very nice aquarium. Everything is pretty, great lights inside the pools, the music fits to the kind of aquarium, the animals have enough space to live happily. You can really enjoy the underwater world!\nAlso a very good place for children, they can discover and interact.\nYes, the price is high but it absolutely worth it!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fantastic in Every Way", "After shelling out $50 apiece for one-day tickets, we were pleased to conclude that the aquarium is worth every penny. The jellies (FKA jellyfish) are remarkably displayed; you could spend hours in that area alone, but don't miss the live albatross encounter, the two-story deep sea tank with sharks, and especially the sea otter pool. The live seabird room was incredible as well. Set aside at least half a day to make the most of this place because you won't find a better aquarium anywhere else in the country.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Always thankful for Homeschool Days at the Aquarium!!", "Wonderful experience. Wonderful lunch! Check-in is a bit confusing, but everything else is wonderful!"], ["Reviewed 4 weeks ago", 5.0, "My Favorite Aquarium!", "This is my new favorite - I suspected it would be and I was not disappointed.\n\nI LOVE Aquariums and visit every single one I am close enough to whenever I travel. So I've seen the Seattle Aquarium, Gaitlinburg, Virginia Beach, etc.\n\nThis one, located right on the Pacific Coast with sweeping ocean views, is stunning.\n\nI loved the Kelp Forest when you first enter with tons of fish swimming and schools of anchovies shimmering - beautiful.\n\nMy husband and I spent about 4 hours here yesterday and honestly I could've stayed longer if he wasn't getting hangry. The gift shop is large and has a ton of neat items and the cafe and restaurant on-site was much nicer than expected with a bunch of options and even some healthy stuff I'd probably eat.\n\nMy favorite things were the sea otters, the octopus and jellyfish, and the Kelp forest. We also enjoyed the deep sea tank and walking around outside.\n\nThere is so much to see and do - this place is huge - admission is not cheap at all - at $50 per person with no discount for a full-price ticket. So plan to spend several hours to get your money's worth and really walk around.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Homeschool Days!", "We visited the aquarium as part of their homeschool program. This included a homeschool program held in the auditorium, which lasted about 15 mins. We spent the rest of the day roaming about the aquarium freely discovering all the rich marine life. We would love to come back to this place even though we had been here before several times, there are always new things to learn about and see.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fine Aquarium", "Continusly improving and well done displays. Customer service was hard to believe because more than once employees offered help without being asked."], ["Reviewed 4 weeks ago", 5.0, "For family is top!", "I went with a friend and i think for adults is a bit expensive but it's a must see in Monterey. A lot of activity for kids, they're the target of this place! But anyway, despite the price, is wow!"], ["Reviewed 4 weeks ago", 2.0, "Overcrowding Destroys Experience", "Have been visiting aquarium annually for long time as I live in SF Bay Area.\nWas always a pleasure. Not so anymore. Overcrowded. Very noisy. The big tanks were cloudy. Went Aug 2017, Jan 2018. August was a complete waste of time . So crowded you could not travel through hallways without bumping into people. Want to see a feeding - forget it. Masses of people. January was less people, but still crowded compared to what I was used to in years past.\nThe clarity in the tanks was poor both August and January. I remember when they were crystal clear.\nAdditionally, I am not a fan the new \"electronic display\" through out the site. Many are just trivial. Others I could have watched something similar at home on Youtube or my laptop. The real estate should be for marine life, not for technology gimmicks.\nI doubt I will be visiting this place again. Just not a pleasant experience anymore. Very sad.\nIt has become very expensive to visit, and frankly its just not worth it.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Brings the Sea to You!!!", "We visited the Monterey Aquarium on Sat. 16 Sept. 2017. It’s wonderful fun for all ages. We loved the sea otters, the penguins, the kelp forest and the jelly fish displays. TIPS: 1) Free all day parking on Laine St. four blocks inland from Cannery Row. 2) Don’t miss the presentations in the auditorium, very well done & very informative. 3) Few people take advantage of the elevators near each of the stairways. 4) You may leave (like for lunch) & return to the aquarium at any time. 5) Feeding time in the kelp forest offers good views and don’t forget there are also good views from the second floor.\nDid this review earn a “helpful” vote?\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Spend extra $15 for Sea Otter Conservation Tour", "If you're really interested in otters, there are Sea Otter Conservation Tours which run approx 1 hour, and are in small groups (8 max, I believe) and leave you full of otter trivia. You don't get to see any otters more up close than you do at the Aquarium, but we had the 3:45pm tour which was closer to the end of the day, so the crowds weren't so bad. There are listening devices that the tour guide's mic is linked to, so you can wander and don't have to stay within shouting distance of the guide. I loved it, because I am a fan of otters and small groups. Well worth the $15, in my book.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "They got penguins and sea otters", "We had a day to sightsee in Monterey so we decided on the Aquarium. I loooove penguins having been all over the world to see them it was a no brainer to see some African penguins in a world class installation. We had not gotten tickets ahead because that required a printer and we only have our phones so we arrived about 20 minutes early. I was first on the to buy ticket line, although they let the people with tickets on first I still got through the buying process before they opened for business. We headed right for the penguins to await the 10:30 feeding. I got to show off my knowledge of penguins to others until the staff came and did a very accurate presentation. Then we went to to big tank for another informative feeding session. We went to the section on Baja peninsula animals, octopus and their close species. Then went to a lecture in a reclaimed sea otter, Lulu. It was really well done. My husband had gone to the sea otter feeding and thought that was well done as well. There are also interactive exhibits for the younger set, a cafe, several outdoor viewing areas and of course a gift shop. It was all very interesting and informative but also a bit pricey at almost 50 bucks a person. I can afford it and some of the money goes to penguins but people with not so much disposable cash may want to have this for special occasions only.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Great Seaside Acquarium but it could use more Big Bang attractions", "Today we visited the Monterey Bay Acquarium.Cost was nearly $50 each.There was some great exhibits focussing on types of fish,penguins and otters.I did think it could do with some more outside exhibits covering seals,penguins and other sea creatures such as large sharks.There were plenty of helpful Acquarium staff and everything was well laid out but I thought it lacked some Big Bang exhibits given the level of the admission charge.Having said this,all the families attending the Acquarium seemed to be having a great time.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Stunning Displays - A Feast for the Senses!", "Perhaps our favorite stop in Monterey, the Monterey Bay Aquarium is an all-day attraction. They have living exhibits of every aspect of marine life in the bay - reef, shallows, a living kelp forest (it is AMAZING!), sea otters (a must see!), tidepool creatures to touch and learn about, an aviary, even a deep-sea display (and you have to see the jellyfish display to believe it!) LOTS of interactive things for children, brief documentaries, behind-the-scenes tours (for additional fees) -- all in all, a world-class aquarium.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun and educational", "Wonderful time exploring the ocean lights in a safe and fun environment. Not inexpensive but worth the cost. The docents were very helpful in explaining the sea life."], ["Reviewed 4 weeks ago", 5.0, "Fantastic day", "Spent the entire day there. I did know believe it was possible but this place has something for everyone and is bigger that it appears. Loved the ability to sign up for text notifications for sightings in the bay. Enjoyed having the feeding schedule in hand to plan out the day. Great shows in the auditorium. The lunch offerings in the cafe were mediocre and terribly overpriced. Conveniently located at the end of cannery row.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "nice aquarium!", "After seeing Finding Dory, we really wanted to visit the aquarium that was the inspiration for the movie! This was part of our California road trip and we're glad we stopped. It's a pretty cool aquarium, however there was a lot of people. I'm not sure if it was because the movie, or summer time or the combination of both but there were so many people! We could hardly see some of the exhibits! The otters were the worst! The grown adults weren't even letting the kids in to see the otters, after about 10 minutes we gave up and moved on. Lots of exhibits to see. I think the jelly fishes were my favorite of all! The kelp forest was also fun to see! We probably spent about 3 hours at the aquarium and we had lunch in the café. Prices weren't too bad. Good selection of food too. Overall good aquarium, but I definitely recommend going during an off season! We're glad we stopped. Not sure if we would ever have had the opportunity any other time. We stayed at an airbnb in Monterey and were able to get 2 free tickets and also discounted tickets through my work. We parked in a parking garage nearby and after the aquarium we walked the town a little bit before heading north on our trek home.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "World’s best aquarium, displaying the beauty of marine life & the ocean abyss", "This is one of the best aquariums in the world. Since opening in 1984, it has had over 40 million visitors. It houses over 35,000 animals and plants, and 550 species of marine life. Its largest tank holds 1.2 million US gallons (A US gallon equals 3.7854 litres, while an imperial gallon is 4.5461 litres).\n\nThe aquarium collection includes, many species of sharks (such as leopard sharks, swell sharks), skates, rays, the world’s largest jelly (jellyfish) collection, free roaming shorebirds (i.e., not caged), giant sea bass, zebra moray, a living kelp forest, mola molas, large coral displays, pharaoh cuttlefish from the Indo-Pacific, sea otters, square-shaped boxfish,flapjack octopus, leatherback sea turtles, African penguins, hermit crabs, clownfish, bat star, California moray eel, sea lemon, shallow-water squid, vampire squid, fangtooth, schools of sardines, and hundreds more.\n\nIts tours and adventure offerings include overnight sleepovers, personalized romance tours, and more.\n\nA great place for people of all ages, and especially for families with kids.\n\nAll staff here seem to be extremely happy with their job and are very attentive, helpful, and polite.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun and informative", "A weekend get away. Watching the penguins feed was very funny. Sea otters fun to watch play and eat. All exhibits very informative. Good place for family to learn about sea life. Just visit, you will be amazed."], ["Reviewed 5 weeks ago", 4.0, "Expensive but amazing", "If you're reading reviews you already know the price tag. But our kids just love it. And with the lack of sciences being taught in elementary school - weekend trips to places like this are so important. It's a beautiful aquarium. Best I've ever seen."], ["Reviewed January 24, 2018", 5.0, "Go early and off peak", "Went here on a Saturday in January. Arrived at 9:40 just ten minutes after it opened and walked right in with no wait. It was wonderful. The only crowding was during the various feeding events but overall had a fantastic 4 hours. As we left at midday it was getting a little crowded and really appreciated the smaller numbers in the early hours\nWhat a great aquarium. I loved how the focus is on the sea life of the Monterey Bay. The kelp forest and open sea exhibits were my favorite staff are very friendly and informative\nMy only issue the water was $5 a single can. The price point of $49 per adult maybe a tad high but I didn’t regret it st all.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Fun time", "Had a really fun day at the Aquarium. They have lots of cool fish and ocean critters that you won’t normally see. Also they have live feedings for the otters and bring out other animals like birds to show and give info on their species. Overall it was lots of fun.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Best Aquarium", "It's one of the best educational aquarium we've ever been to. Situated right on the chore, we loved sitting outside the deck and felt the breeze. The films showing there were very interesting yet educational. My kids though not very into Science, enjoyed the films and learned a lot from it. Being the Sadine Cannery in the past makes the aquarium floor plan and design very cool and unique.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Sea creatures abound", "Great place for the child, young and old. Immurse your imagination into the depths of Monterey bay. Many species of aquatic creatures."], ["Reviewed January 23, 2018", 5.0, "Open and bright aquarium not to be missed", "Definitely be sure to stop by this great aquarium with a staff that is friendly, approachable and knowledgable. Check out the sea otters, the wave room and the kelp forest."], ["Reviewed January 23, 2018", 5.0, "This is the best aquarium EVER!", "Whether you are 9 or 90, you will fall in love with this aquarium. Take your time and enjoy the sights. Don't miss the wave!"], ["Reviewed January 22, 2018", 5.0, "Loved this place", "So glad we got time to go here. Amazing sites and just a lovely place to look around. Not fond of being able to touch sting rays as I think they should be left alone but that’s optional. Very educational, sea lions were super cute."], ["Reviewed January 22, 2018", 5.0, "This place never ceases to amaze", "I’ve been coming to the Monterey Bay Aquarium for almost 30 years and to this day I’m still mesmerized by it. The feeling you get when you enter the Outer Bay exhibit is one of wonder. The main tank really takes your breath away.\n\nThe staff are incredibly helpful and nice which is great. I am a first time member this year and have been back several times so far.\n\nShow less"], ["Reviewed January 22, 2018", 4.0, "Classic place for a visit", "We were on a long weekend away and decided to stop in. To be honest, I was surprised at the cost. I did note that it is a non-profit, so that made me feel better about the expense and the higher purpose of education and conservation. Once we were inside, I was very impressed at the facilities and the program they are doing. We had a spectacular day as it was sunny and relatively warm...lots better than a January day in Colorado! Love that you can go out on deck to see wild otters and seals in the surf in the bay outside.\nShow less"], ["Reviewed January 22, 2018", 5.0, "It's always a new adventure!!!", "I have a little explorer at home, and every time that I say Monterrey he jumps and say Aquarium. Kids really have the opportunity to explore different things, and get new adventures there. Does not matter how old you are, the tanks with different sea creatures and the multiple games to learn and explore makes the experience unforgettable, and if you have the time go behind the scenes. The kids really enjoy seeing how things work in the back to keep healthy animals and taking care of them.\nShow less"], ["Reviewed January 22, 2018", 5.0, "World Class", "Great visit with all day programs and features make this a world class Aquarium. We found the educational opportunities and the location of the Aquarium added tremendously to our visit. It was crowded since it was a raining day. Expect lots of kids. All good everyone has a part to play in protecting the wild life and oceans. The Lagan Albatross was a surprisingly good presentation with many lessons particularly the harmful effects of plastic trash in the oceans. Old to young everyone seemed pleased to see the penguins and the favorite sea otters.we had a great day!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Extraordinary in everyway!", "I have visited the Monterey Bay Aquarium many times. I have never been disappointed. The environment and the staff make it a wonderful experience."], ["Reviewed January 22, 2018", 5.0, "Did not disappoint!", "We had heard so much about this aquarium and its reputation is deserved. The staff were helpful and the exhibits were varied and done well. My favorite were the bright orange jellies just floating so peacefully and beautifully against the blue water. My son loved everything and was only disappointed that the stingrays in the petting pool were kind of hiding and he could not touch them. It's pricey but well worth it. Great views of the bay too.\nShow less"], ["Reviewed January 22, 2018", 3.0, "Beginning to show its age.", "The facility itself if pretty expensive. $50 per person. Some of the exhibits feel a little bit 'dated' in comparison with other similar attractions in other parts of the U.S.A....Boston for example. The outdoor viewing platform are good, but these depend on the time of year you visit. The staff were very helpful and informative, but the whole place could do with a bit of a revamp.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Love our magnificient ocean creatures", "Had a great time. unbelievable sights for an Aquarium. unlike any other aquarium I've ever been too.. So beautiful and right in the middle of beautiful Monterey CA too!!! Awesome, couldn't have asked for a better mini vaca :)"], ["Reviewed January 21, 2018", 5.0, "Best educational Intertainment for the Whole Famiky", "The Monterey Bay aquarium is an absolute must if you’ve never been before, or even if you have been before. It’s interesting, educational, and fun for everyone of all ages. The exhibits are spectacular. There’s also a wonderful gift shop."], ["Reviewed January 21, 2018", 5.0, "Aquarium", "Excellent place to bring Monterey visitors! The gift shop is top notch. There are all kinds of learning activities for all ages."], ["Reviewed January 20, 2018", 5.0, "One of our faves", "We finally got a membership this year. We make the 2 hour drive at least once a month because our kids love creatures and play areas."], ["Reviewed January 20, 2018", 5.0, "Just beautiful", "This is the best place to see all the wonders of the sea. An learn about sustainable source of fish and how to protect the environment"], ["Reviewed January 19, 2018", 5.0, "The Adult Visit", "Most are not aware that you can pay for a half day visit which works great for couples who want to take in the sights and do not have little ones in tow. We just took in the sights at Cannery Row until it was time to enter the Aquarium. We then had dinner after our short and full visit and this made for a perfect day-long outing. The half-day or set hour passes are not advertised. You will have to ask for them at the aquarium. ;)\nShow less"], ["Reviewed January 19, 2018", 5.0, "Great Aquarium", "The Aquarium is very large with beautiful displays of sea life in pretty close to their natural environments. The water tanks are impressively large.\n\nWe spent 2.5 hours and did not get to see everything. I would allocate at least half a day or more if you are going to see some of the shows. The big problem are the crowds, especially if you are coming on weekends. You don't get much personal space when you stand in front of the exhibits. You also need to get your seat for the show(s) at least 15 minutes to 30 minutes before the show starts-- wasting some time.\n\nTickets are a little pricey but worth it.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Amazing visit!", "Wow! Loved the Aquarium- the best in the country!\n\nWe arrived about 15 minutes before opening, since we already had bought our tickets, we were able to walk into the lobby (behind a rope) and there were a few Aquarium employees there that were talking to everyone about what to do. One employee approached us, showed us a map and gave a few tips on what to do first, what got crowded, etc. Very helpful!\n\nWe headed right towards the Touch Pools, where the workers there were super-friendly and really helped my kids (ages 4 and 6) to explore and touch, while giving information. I would recommend getting to the Aquarium at opening, the first hour of the day is not busy and you will get closest to exhibits.\n\nThe shows were great but they do get very crowded, but even if you get there 5-10 minutes before the show, you can usually find a place to see everything. The shows in the middle of the day seem to be the most crowded.\n\nWe did eat lunch at the cafeteria there, which was expensive. The food was ok, nothing special, but just be prepared to have mediocre food at a high price. There are tables in the cafeteria that overlook the bay, which is nice.\n\nWe had a wonderful day at the Aquarium, admission was high, but since this is such an incredible experience it was definitely worth the cost of admission.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Wonderful Day", "This is such a different type of aquarium. World Class inside and the same on the outside. The inside exhibits showed all the sea life in the Monterey Bay. Especially beautiful was the jelly fish exhibit. The otters were entertaining and the penguins delightful. Would definitely recommend seeing as many of the short films as possible. They are shown and narrated by an aquarium biologist, who is there to answer questions. Very Informative.\n\nWhen it gets to noisy and crowded inside, go outside. There, you can view all that Monterey Bay has to offer. There are binoculars available and staff ready to point out the otters and seals in the Bay. If you are lucky, you will catch sight of a whale spout.\n\nGood food in the aquariums restaurant - pricy but satisfying. You will want to spend the day...\nShow less"], ["Reviewed January 16, 2018", 5.0, "Lives Up to the Hype", "Consistently one of the top 10 aquariums in America, it lived up to that billing immediately as you walk in. The setting is beautiful, and not only can you see wildlife inside, but outside we saw seals, a jellyfish, and a whale! Touch pool was probably the highlight for our daughter, it is large and has many different creatures to touch. Great time.\nShow less"], ["Reviewed January 16, 2018", 3.0, "Expensive", "While this place is pretty darn amazing, it is way expensive, especially for people with young chillins."], ["Reviewed January 15, 2018", 5.0, "We spent more time than expected in the Aquarium", "It was so fun watching the \"feeding times\" and the staff was very helpful and answered questions with confidence. The ecological impact and education was a soft sell and perfect!"], ["Reviewed January 14, 2018", 4.0, "Nice, but expensive and crowded", "The Aquarium is amazing. Best I have ever been to. Be sure to hit all the feedings. We went post holiday break on a weekday thinking it would not be as busy, but it was still crowded. Not sure if it is always like this, but the 'sea' of people made the place a little crazy.\nShow less"], ["Reviewed January 14, 2018", 5.0, "World Class Aquarium", "Yes, it's expensive but a very special beautiful, educational experience that provides lasting memories. Check it all out and spend five hours like I did, then it's more economical. Impressive cafeteria too (potato kale soup was good). The aquarium expansion is so very well done. Plus I got to see creatures that I haven't seen before; awesome!\nShow less"], ["Reviewed January 13, 2018", 4.0, "Educational and beautiful", "I've been here twice in the last 20 years the first time when they just open.. all in all nothing really changes.. the big aquarium is definitely worth looking at especially if you get it around feeding time. Young little kids would definitely enjoy this place. I would say it's definitely worth a first-time visit even with the now higher prices..\nShow less"], ["Reviewed January 13, 2018", 5.0, "Fantastic", "This is a must see. If you are here you you have to go the the aquarium. There is so much to see and do. We brought a 17 year old and a 5 year old and other were busy all day. Very expensive but worth the price of admission. They do discounts for kids, students and military.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Impressive aquarium with the wow factor", "Wow, an impressive aquarium, for children and big children alike.\nWe were staying in Pacific Grove in October 2017, we chose to walk to the aquarium along the coast path.\nThe exhibits are very well organised, with excellent information boards, interactive sections, ‘touch’ pools, the guides are very helpful, and we enjoyed lunch in the cafe.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Lots to see!", "We were there the week of New Year's and school was out so there were quite a lot of visitors. It's very hard to see the feedings when it is crowded but you can still enjoy the exhibits. Parking can be challenging, lots of meters but it's hard to judge how long you will be there, pay a little extra to avoid a ticket. We went twice for about 3 hours each time. (My hotel gave me a two day pass for a one day price, so ask around for deals.)\nShow less"], ["Reviewed January 11, 2018", 5.0, "Unreal", "It’s an aquarium, and what an aquarium it is! Two sections of touch pools, an open ocean tank, sea otters, a sea kelp exhibit, a tide pool. It’s a massive complex. Take someone who has no idea what to expect and WOW them.\n\nSome suggestions:\n\nGo when there’s is light outside, some of the big tanks have natural light\n\nCheck feeding times\n\nBudget time for unexpected adventures, the complex is big.\n\nTalk to the guides, they are excellent.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Always fascinating", "Haven't visited the Aquarium for a few years, and once again enjoyed the penguins, otters, kelp bed tank and the palagic tank. I also enjoyed the tropical fish and the special exhibits."], ["Reviewed January 11, 2018", 5.0, "Incredible Place To Enjoy The Ocean's Mysteries!", "wow, what an amazing place. We took a weekend off In April 2017 to stay in Pacific Grove and visited the Monterey Bay aquarium and the place was jumping with activity. As were were there on a weekend, the place was crowded. Be prepared to work to find a parking spot... or connect with your inner parking goddess! We were amazed with all the exhibits. We were there when they had the jelly fish and they are facinating and amazing... quite mesmerizing. The big tanks of preditor fish were great show as well as the mammels . This place is great for young and old, anyone interested in nature and the ocean, and a place you can spend at least a half day to scope out the whole place. There are live exhibits where kids and adults can touch the critters too. And when you wear yourself out you can take a break and get some amazingly good food in the cafeteria. Both my wife and I enjoyed ourselves at the aquarium, and then took a stroll down Cannery Row, a must when you are down in this part of town.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Best Aquarium I've ever been to", "I've been here countless times, going back to probably first grade. I never get tired of it! That being said, since I love going so much, I try to find the best deal as a local. I live in Salinas, and starting in September, the local libraries give out free aquarium passes to anyone with a library card. They run out quickly, so go as soon as they start giving them out ! It's one sheet of paper with a unique code that gives admission for up to six people, so you can bring 5 people with you. Just be sure to bring your ID and library card with you along with that paper the day you choose to visit. It's usually valid from Sept.- May I believe, which is great for planning a day to go. Also, during a certain time of the year, the Aquarium allows Monterey County residents free entry with just their california ID as proof of MC residency. If you're a local, look into these options! If you're not a local, admission price is still definitely worth it! Get there early, like when it opens to make the best of it because there is a LOT to see. Allow yourself at least 3 hours to see everything, if not more, especially if you have kids because they'll want to stop and play in the Splash Zone and other kid-oriented areas. Hope this helps!\nShow less"], ["Reviewed January 10, 2018", 5.0, "Best Aquarium ever!", "There is no aquarium better than this one. At least for me. I have never been in a better place than this! It is lovely! Huuuuge"], ["Reviewed January 10, 2018", 5.0, "Fun place and educational", "It’s a nice aquarium well preserved. The cost it’s 50 per adult and children 30. It takes 2 hours to visit if you go fast. But if you want to est you can do it over there. Nice place for little ones. Kids and adults. You get to touch some animals and even spend the night over if you want.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Love this place", "Do you want a magical experience? Spend a few hours at the aquarium. The exhibits are gorgeous and well maintained, the staff & volunteers are friendly and helpful. I always walk out of there happier than when I walked in."], ["Reviewed January 10, 2018", 5.0, "well organized and updated", "Went January 2, 2018 with a group of friends. Friendly staff, interesting exhibits, fun activities for kids."], ["Reviewed January 10, 2018", 5.0, "super location for an aquarium", "A wide variety of exhibits, the wetlands display is exceptional. The tentacles section well done. There is a cafe with food available."], ["Reviewed January 9, 2018", 5.0, "Best Aquarium in US", "Have visited the Aquarium a number of times previously and we were not disappointed with return visit. Great layout with lots of opportunities to learn more about the Monterrey Bay ecosystem. Loads of enthusiastic volunteers and staff to answer questions.\n\nExpensive entrance fee is worth the price because the aquarium supports research that will help support the wildlife for generations to come.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Always Exciting!", "We come here often but never get tired of watching 'The Deep or Open Sea with the sharks, jellyfish, and other exotic ocean creatures. Also love the shows in the auditorium. The hosts are always very impressive!"], ["Reviewed January 9, 2018", 5.0, "Great Experience for the Grandchildren", "A very fine aquarium with displays on two levels, outdoor patios and two separate buildings. Include the theater in your visit. Displays for the youngsters put them into the action. Much to see. Schedule two hours or more. Very crowded during the Christmas holiday week. Grandkids loved touching the sting rays.Small discounts available to seniors, and the military (and more). Fairly pricey for the whole family. Check out the rates and discounts before going.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Touristy and crowded, but worth it", "What a neat place! I loved learning all the great things this aquarium is doing for the local wildlife. We visited on a very busy Friday afternoon and it was crazy, but we still got to see everything. I recommend going when it opens to avoid some of the crowds.\nShow less"], ["Reviewed January 9, 2018", 3.0, "Way too expensive", "It's a really neat place, but SO expensive. I only went because our host had free passes. There's no way that it's worth $50/person. It's maybe a 2-hour experience. To bring my whole family it would have been $250 and there's no way I'd pay that much for an hour or two experience. It's cool, but certainly not THAT cool.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Loved it", "Excellent choice for a family. Took our 2 grandsons here, were planing on spending couple of hours here and spent the entire day. Would have stayed longer if we could have, so much to see. Their favorites were the seal lions and jelly fish. Great memories, worth every penny!!\nShow less"], ["Reviewed January 8, 2018", 5.0, "It just gets better every year", "Yes it’s pricey. But buy your tickets with your discount before you get here. Go to all of the programs in the theater. It’s fine live with amazing video. They don’t copy other aquariums so don’t look for smarts. After 34 years they got this down. Come early and stay late.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Not Just Another Aquarium", "Monterey Bay Aquarium is a must if you're going to be in the area. We spent about 3-4 hours there leisurely walking through all the exhibits. No area felt too crowed. The crowd flowed well and if you wanted a better, closer look, it didn't long to get a front row view of the exhibits. I did notice that they have lots of fun for the little ones and they all seemed to be having a blast in the kids zones. If you have lunch at the cafe and browse the shops you could easily spend a day there.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Great mid-size aquarium", "Beautiful displays, though somewhat hard to get around as exhibits are on two levels that are not continuous. High educational value, but some areas can get quite crowded (Otter feeding time) as it is not a large aquarium. Highlight was the movie/talks in the auditorium as they narrated live by specialists.\nShow less"], ["Reviewed January 7, 2018", 5.0, "A day at aquarium", "Excellent we have been long members it's the best in the US We continue to come back. Always accommodating to all family members."], ["Reviewed January 7, 2018", 5.0, "This place always amazes!", "Be sure to not miss the 11:00 open sea feeding. Always entertaining and educational. The sea otters are adorable, the jellyfish are jaw dropping, and when your feet hurt go to the theater for a short movie. There are touch pools, penguins, an aquarium with a kelp forest, you can see sharks, sea horses, etc.\n\nIf you buy your ticket through your hotel sometimes you’ll get a two day ticket for the same price.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Always a treat", "Be sure to plan to spend the day, or at least most of it. Spectacular exhibits, and some hands on for kids. Helpful docents and many scheduled \"shows\"."], ["Reviewed January 6, 2018", 5.0, "One of he best aquariums that we have been to", "Lots of immersive experience and interactive displays that encourage visitors to be part of he exhibit instead of just passively viewing the sea creatures through the glass. My daughter and I enjoyed it very much. Especially the tide exhibit."], ["Reviewed January 5, 2018", 4.0, "Family vacation", "One of the best aquaria in the world. Well organized and with great selection. They used to have much more fish species in the main Kelp Forest aquarium, which now looks near empty, but still a good recommendation for families with small children"], ["Reviewed January 5, 2018", 2.0, "Children’s Aquarium", "Many call this facility as no. 1 to visit in Monterey.\n\nMaybe ... if you have children under 10y.o. with you. For them it is an amazing place to learn and explore.\n\nHowever, for us, 3 adults from Australia spoilt with amazing aquariums this was thoroughly disappointing. And pricey.\n\nThe deep sea section is well designed and worthwhile.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Fascinating! But pricey!", "If you are interested in sea life, the ocean, or learning something new, the Monterey Bay Aquarium is a very enjoyable day for adults or children alike!\n\nMy only negative comment is that the price is too high at $50 per person. But, if you are visiting the area, and enjoy the sea, then you will likely quite enjoy your day at the Aquarium.\n\nYou can spend the entire day there, as there are several mini-lectures/feedings near various exhibits, that last around 15 minutes each, but people will start gathering several minutes before. I would recommend getting there right when it opens, so that you have the option of listening to any of the lectures that interest you, have some time to browse the shop, which also gets crowded, and you can buy a snack or lunch in the café at the aquarium. If you are one who skims through the exhibits, then you are in walking distance from Cannery Row, several good restaurants overlooking the ocean, etc. It is a nice day enjoying the California coast & sealife.\n\nThe jellyfish exhibits are mesmerizing, and there are penguins, otters, and a multitude of other sea life to experience.\n\nIt is also a good option if you are from out of town, and it is a rainy day, since it is indoors.\nShow less"], ["Reviewed January 5, 2018", 4.0, "A great experience", "after several visits went back with my 10 year old who was 3 last time - this place still is amazing\n\nAs a not for profit organisation the entrance fee is not cheap but you get what you pay for and they have a lot of cost to upkeep and research, develop new exhibits etc try and get a 2-day flex pass from your hotel - great way of doing it justice and choosing your timings\n\nstand out moments:\n\nsun fish\nsea otter feeding\njellyfish\n....most of it!\nShow less"], ["Reviewed January 4, 2018", 4.0, "Aquarium with a beautiful view!", "This place is very cute! From the outside the aquarium seems to be small but once you start your journey through out the museum it seems a lot bigger than it looks. I love that it has viewing areas you can sit and enjoy the ocean. I was very impressed with the jelly fish area, the tide pool area and the sea otters are very adorable.\nShow less"], ["Reviewed January 4, 2018", 3.0, "Over rated", "I have been to many zoos and aquariums, and this one was pretty average. We had heard a lot about it, and it was supposed to be amazing. Other than the Sea Otters, none of the exhibits were all that impressive, and most cities have Zoos or Aquariums just as good or better. If you are in Monterey, see it, but we drove from SF to see it, and it was just not worth it.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Great for families!", "We dropped in for a visit having read it was a great aquarium. 2 Families in tow. We didn't want to spend too much time here.\n\nLine up was quick. Staff all super friendly, warm and inviting.\nSaw 90% aquarium in 1hr. Parked 2 blocks away and paid $15. Closer parking towers were $30 I think. Noticed lots of strollers parked because of the crowd it was likely difficult to use a stroller. In-and-Out allowed.\nShow less"], ["Reviewed January 3, 2018", 5.0, "A must see!", "I haven't been a fan of previous aquariums that I have visited, but this one is pretty spectacular. Beautiful, well designed for crowds, impressive tanks, amazing displays, and knowledgeable guides. I learned a good deal about the sea while enjoying amazing, up close views of exotic sea animals.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Great day out", "We thoroughly enjoyed our visit to the aquarium. Lots of interactive exhibits and very educational. Kids really enjoyed it, was a great day out. We loved seeing the whales in the bay and the otters from the deck too."], ["Reviewed January 3, 2018", 5.0, "Always a pleasure to visit, and worth the admission price", "We spent about 4 hours at the Aquarium and enjoyed all of it. When we arrived, the line to buy tickets stretched out onto the street. It moved very quickly - I would say we were inside within 15 minutes or so.\n\nTo make the most of your visit, take advantage of the on-line schedule of feedings and other events taking place as they are very popular and can be crowded.\nShow less"], ["Reviewed January 3, 2018", 5.0, "second or third time here and it's still one of the best in the world !!", "Just a great aquarium no matter how many times one visits. And even though we forgot that it was a school holiday week and there were literally thousands of children there of all ages, half of our enjoyment was in watching kids' reactions to the exhibits, i.e., once the crowd in from to each exhibit dispersed enough for us to get a view.\nShow less"], ["Reviewed January 2, 2018", 5.0, "A must see", "A great place to visit. So much to see and do. Great for young children and adults. Parking is difficult. You can leave and come back in all day. They have a food area. No pets. Worth while visit."], ["Reviewed January 1, 2018", 5.0, "Under the Water but Not Wet", "One of the best attractions anywhere. Interesting for children & adults and for anyone who loves aquariums! Interesting science, great employees and service personnel. From the largest 1 million gallon tank to the small exhibits. Take the behind the scenes tour to make it a wondrous visit! Dine at the aquarium or the many surrounding restaurants. Enjoy Cannery Row while your there! The best thing about the Aquarium is its mission to save the oceans, and there fore save the world. Non profit so your money goes to a greater cause is a benefit!\nShow less"], ["Reviewed January 1, 2018", 5.0, "Always fantastic!", "Whether you are a child or a senior, you always learn something at the aquarium. The staff is knowlegeable and aim to please. The displays are unbelieveably large. Can't imagine the engineering that went into building the facility."], ["Reviewed January 1, 2018", 4.0, "Really educational and fun, but packed!", "We went last Thursday and had a nice time, except it was so very busy! Hard to move around and see everything with the crowd."], ["Reviewed January 1, 2018", 2.0, "long lines, few animals", "Lines were very long and there were not many animals. Lots of conservation exhibits and activities for young children though!"], ["Reviewed December 31, 2017", 5.0, "Worth a visit.", "A must see Aquarium. Right on Cannery Row. It can get quite busy so visit early morning. Waterfront views are the best."], ["Reviewed December 31, 2017", 4.0, "Great place. Kids loved it", "Place is very nice. Great exhibits. Way too crowded and almost impossible to enjoy without getting pushed around. If you like crowds, it is worth it."], ["Reviewed December 31, 2017", 5.0, "I nearly cried!", "I have wanted to go for a couple of years and I wasn't disappointed...it was an amazing experience. From the moment I walked through the doors until I left I was utterly spellbound. GO!"], ["Reviewed December 30, 2017", 2.0, "The admission fee has become exorbitant", "The Monterey Bay Aquarium is a smaller science museum than found in other cities. It has two exhibits that are breathtaking; the kelp forest aquarium and the open sea aquarium. Otherwise, the other exhibits are small and my son and I got our fill after 3 hours of viewing.\nThis is where I have a problem rating this museum higher; the price. At $50 bucks a head, I expect more of a Disneyland experience than a small museum. I will not go here again with this high of admission fee. Even the California Academy of Sciences in S.F is $15 dollars cheaper. I guess the people in charge demand this fee because people keep coming, but they priced me out of visiting again just like Disneyland has.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Wintertime visit", "Really great aquarium located in famous Cannery Row. Multiple interactive displays for kids and adults alike. Variety of fish and exhibits to satisfy every taste."], ["Reviewed December 30, 2017", 5.0, "Spectacular", "The six of us passed a delightful five+ hours at the aquarium, starting with the tentacles special exhibit, then moving to the Open Ocean Exhibit, feeding of the otters, and more. The exhibits are beautifully lit (especially those for jellyfish and coral reef fish). Admission is pricey, but it's well worth it.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Fish, otters, penguins", "A wonderful experience for all. See, touch and learn. The docents are a library of knowledge. The children will learn about the ocean world and how to help adults keep it plastic free. Hours of enjoyment."], ["Reviewed December 29, 2017", 5.0, "10/10 Best in class", "The Monterey Aquarium is a worldwide reference from a visitor attractiveness as well as a research perspective. We spend 6 hours enjoying the exibitions and tanks as well as the expert talks.\nHope to be back someday. We need more places like this to change our attitude towards nature and environment protection.\nShow less"], ["Reviewed December 29, 2017", 1.0, "Way too over priced for not much to explore", "This is an overpriced place with not many attractions. Long beach aquarium has more fun and a lot more attractions. This place is not worth the money."], ["Reviewed December 29, 2017", 5.0, "Fun for everyone!", "My husband and I were on an anniversary trip to the area and were told the Monterey Bay Aquarium was a must-do. It did not disappoint! The aquarium is huge and includes lots of beautiful, breathtaking exhibits. We especially loved the jellyfish and the penguins. It was also a unique experience to touch a stingray! There are many opportunities for hands-on learning throughout the aquarium. Be aware that this is not a cheap experience, with adult tickets costing $50 each, but it really is worth the money, especially when you consider that the admission funds the exhibits. This is a huge tourist attraction and so you need to expect LOTS of people. We arrived right at opening time and there was about a 10 minute wait before we were able to enter. We were told by our hotel to get our tickets in advance, but the lines for those with and without tickets was about the same. There is plenty of space for everyone, but you will have to be patient to enjoy this experience. The penguin feeding was especially busy, but totally worth being smushed for a bit to observe the penguins in action! As long as you prepare yourself for the crowds, this can definitely be a wonderful, memorable experience. You could spend anywhere from a half- to full-day there, depending on how much time you put in to observing each exhibit. We were there for about 3 hours and were able to enjoy it all. There is food available on-site, though we did not try it so I cannot speak to that portion of the experience. The Monterey Bay Aquarium is large, clean, and appeals to people of all ages. I'd definitely recommend everyone do it at least once!\nShow less"], ["Reviewed December 29, 2017", 5.0, "Great fun", "Great afternoon for adults and children. Lots of exhibits and lectures. Check out the auditorium and great videos, they do not disappoint."], ["Reviewed December 28, 2017", 5.0, "Amazing! This is the most fantastic aquarium, doing great work to save the oceans.", "If you are going to do anything in Monterey, this is it. The work that they do to educate, inform and entertain using facts about the health of the oceans, is simply the best. I have been to a lot of aquariums and this is by far my favorite. The research into marine life and the health of the animals is inspiring at a minimum, and I have even gone back to school to study oceanography and earth science. This is the most important issue to mankind today. Help support this place so we can preserve and protect the waters that make this planet viable for all living creatures! Enjoy the upclose views of tiny limniscent jelly fish and great schools of sardines. The otters are among my favorites as they are so entertaining and cute. The penquins are pretty cool too. Take in a few of the talks, as they are informative and stimulate deeper thought about mankinds effect on the world.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Amazing aquarium, lives up to it's billing", "Only had a short time here, but you could spend hours looking around. Particularly liked the jellyfish and outside areas, great views of the bay. Suggest getting the free MST trolley as parking can be expensive. It takes you all the way from one side of town to the other and stops right outside the aquarium.\nShow less"], ["Reviewed December 27, 2017", 5.0, "great place for the entire family", "this was my second visit to the Monterey Bay Aquarium. My first was more then a decade ago. and i loved it. This time around I was not disappointed either. I have been to several Aquariums throughout the U.S. but Monterey is the best one i have been to. If you are in the Monterey area make sure you put the Aquarium on your to do list.\nShow less"], ["Reviewed December 27, 2017", 5.0, "AMAZING", "We took my two sons(4&5) here and they had a blast. The exhibits were awesome well worth the stop. The food and drinks are really exspensive so eat before coming."], ["Reviewed December 27, 2017", 5.0, "Christmas 2017", "Very enjoyable every time! I can stay in the aquarium all day! This is a must go to whenever in Monterey! Great for everyone of all ages."], ["Reviewed December 26, 2017", 5.0, "Not just an aquarium!", "The Monterey Bay Aquarium has something for everyone. There are two very large aquariums with plenty of viewing space on several floor levels. It contains numerous smaller aquariums with specific sea life, for example, octopuses, jelly fishes, sea horses, eels, etc. It contains a few touch ponds for kids as well as a few play areas for kids. There is a restaurant with a good number of choices and several gift shops. Also, throughout the day, 15 minute movies narrated by an employee are shown which are very interesting for all ages, even young kids. You can go outside from various exits to view the bay and can often see sea lions and otters in the bay. Our kids love the aquarium and when they were younger, we bought the family membership every year for approx ten years. Our kids are now college students and we just went back after quite some time, and they and I still enjoy the aquarium! I would recommend it to anyone visiting Monterey or the Bay Area.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Great place to visit", "The whole family loves this place - from our 8 year old up to mom and dad. We make sure we come here at least once a visit to Monterey. The annual pass makes it worthwhile!"], ["Reviewed December 24, 2017", 5.0, "Plenty of fish 🐟- Family Day Out", "First time here and I was literally blown away! I have been to many Aquariums before, but this one... WoW! The biggest I have ever been too. Soo much marine life! There were living creatures that I have never even heard of before let alone seen.! The fish - the biggest I have ever !!\nPlenty of time can be spent here, on average I would say leave yourself a min of about 3hours to really take everything in.\nKids and adults will love this place.\nIf driving... there is plenty of Parking garages ranging from $10-15 for the day, so do your research if you wanna save a couple of bucks.\nWhy not make a day of it, the restaurant /cafe foods were quality and fresh, not really too pricey compared to what I have seen elsewhere.\nI would come here again.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Oceans of Fun", "Decided to do Monterey Bay Aquarium for Spring Break, and our family was not disappointed.\nWe all enjoyed being face to face with beautiful ocean creatures we didn't know existed.\nThe aquarium is very beautifully arranged, where you can walk around in an orderly fashion, and not miss anything.\nAwesome exhibits and tanks with detailed information as to what ocean creatures you are observing, and their natural settings.\nHands on exhibits for children and adults, and the shows are awesome.\nI'm so glad we got the 2 days passes, as we all wanted to go back!\nShow less"], ["Reviewed December 23, 2017", 5.0, "Amazing!!!", "Great place to go on a weekend with friends, family, and couples! Definitely worth the money and tour offered. So many things to see from jellyfish to sharks to penguins to baby ducks being fed! Staff is very helpful and accommodating when asked where to go or what to see! The shops there are a but pricey but if you want to take a gift/souvenir back home, this is the place!\nShow less"], ["Reviewed December 22, 2017", 4.0, "Very good display of local water inhabitants", "Right on the shores of the bay, this aquarium has a wide display of the animals and vegetation that populate the local waters. It is well designed, gives you views of tanks and outside natural habitat. And they include numerous views of the feeding process. I especially enjoyed the sea otter exhibit.\nIf you're into aquariums, this is a must-see place.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Wow! Kid Friendly!", "We took my 19-month old granddaughter and she loved it. So many buttons to push and water to put her hands in to touch the animals and sea-life. The adults all liked the visit, too. We ate at the cafe and it was adequate for kids.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Sea life up close", "We came here with my wife and her sisters and we loved it, bought our tickets online with student discounts, which always helps. We loved everything. I recommend looking at the feeding time for the fish."], ["Reviewed December 21, 2017", 5.0, "Expensive/Worth It", "This aquarium is well worth the cost. We were there several hours and did not see half of it. My favorite...the otters of course!\nVery hands on for children with a nice touch tank and stools and ramps for them to view all the exhibits.\nThe space is beautiful and very well done. You will not be disappointed.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Awesome place to love the world", "I love Monterey Bay Aquarium! I is always clean and friendly and open to teaching all ages about the ocean. Not only about all the amazing creatures in the ocean, but how to preserve this magnificent resource. Love Love Love it!!!"], ["Reviewed December 21, 2017", 5.0, "The best aquarium", "A great aquarium and definitely worth the membership. I’m always surprised to find something new that I love here. It’s a great place to take kids but it’s also really great place to go as an adult too. The deep sea exhibit are a great place to just sit and take in. Just a really great place to go for a special occasion or for no occasion at all.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Fantastic local wildlife refuge", "The Monterey Aquarium is by far one of the best aquarium we have explored, and we have travelled the United States! My husband was so intrigued by the two story otter exhibit, and we saw a whale in the Monterey Bay off the observation deck of the aquarium. Location is everything!\nShow less"], ["Reviewed December 21, 2017", 5.0, "World Class Aquarium", "We finally made it to the Monterey Bay Aquarium and were not disappointed. The place is amazing! The range of plants, animals and environments is fascinating. The staff is buttoned up, knowledgeable and friendly. A few highlights were the penguins being fed, the orange octopus out of its hiding place and the stunning jellyfish exhibits.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Best ever", "Expensive but well worth it. Amazing. If you come to Monterey and don’t see the aquarium you are nuts."], ["Reviewed December 20, 2017", 5.0, "Fabulous Surprise", "I am the first to say I am not a fan of aquariums, I normally think they are stinky and dirty and not humane HOWEVER I was amazed at how much I enjoyed myself here. Super clean, HUGE, bright and interesting! I loved it and would go back again. Beautiful setting, plenty of space and even food that was edible and good. Great time!\nShow less"], ["Reviewed December 20, 2017", 5.0, "We love the aquarium", "We bought a yearly membership, as it's not that much more. Tickets aren't cheap in general here, but the aquarium is very nice. Lots to look at, great exhibits, and it's clean. Wasn't too crowded when we went."], ["Reviewed December 20, 2017", 5.0, "No comparison anywhere else in the world", "We are members of the aquarium visiting community and have been for yours. The aquarium makes an excellent family stop and is indeed the major attraction in Monterey.\nWe have a home nearby and enjoy it periodically. It is always a new experience and the special programs are great. Dinner at the aquarium surrounded by the exhibits is particularly special.\nShow less"], ["Reviewed December 19, 2017", 5.0, "What a great exhibition", "About pricy for a family ($50 per adult and $30 per child) but if you book through your hotel you can get a 2 Days admission. My kids were very excited about the different exhibits and the hands on activity. We had a wonderful day."], ["Reviewed December 16, 2017", 5.0, "Great-wow", "One big Wow experience.\nGreatest Aquarium I have ever been too. Very nice of the museum pamper the first biologist and relate to hið work. His research center is to be found at the seaside on the famous Cannery row. There are more things to see and enjoy in Monterey than Steinbeck and Dali (Dali17).\nShow less"], ["Reviewed December 16, 2017", 5.0, "First visit", "We loved spending time at the aquarium! There's a lot to see, so I'm really glad we got two-day passes through our hotel. Don't miss the albatross encounter :)"], ["Reviewed December 15, 2017", 5.0, "Wonderful experience", "We are members of the aquarium and enjoy coming to visit. The buildings are very well maintain and the tanks are so clean. The docents are very helpful and an afternoon visit is less crowded."], ["Reviewed December 15, 2017", 5.0, "Always worth it.", "Go. Learn. Give to an amazing cause. You have to visit to really experience Monterey's beauty and uniqueness."], ["Reviewed December 12, 2017", 5.0, "Fantastic Family Visit", "The Monterey Bay Aquarium is a fantastic place for both kids and adults. There are tons of activities, focused on the unique flora and fauna of the bay, most notably the southern sea otters. The staff and volunteers are all very knowledgeable and helpful. They definitely want you to have a good visit. There are 8-10 short lectures or demonstrations each day, and the aquarium has multiple outdoor decks where staff members are happy to help you spot birds, otters, seals and other wildlife. They'll even loan you binoculars. If you have a more in-depth interest in one topic or another, check out the guided-tour options. The guided tours cost a little bit, but the guides are fantastic, and they keep the groups small, so you can ask all the questions you want. Very impressive!\nShow less"], ["Reviewed December 11, 2017", 5.0, "Highly recommended attraction on the Monterey Peninsula. Outstanding aquarium!", "As a comparison, my wife and I visited the Lisbon Oceanariums in Portugal a couple of months ago. Architecturally it may have a little more pizzazz than the Monterey Aquarium but the latter has so much more to offer from the point of view of education for children and adults in a highly approachable way.\n\nIt is pricey, no question but you must understand how much they need funding for their research and conservation programs.\n\nThis place is first class and a must see attraction on the Monterey Peninsula.\n\nHighly recommended for everyone, young and old.\nShow less"], ["Reviewed December 11, 2017", 3.0, "Did not live up to Reviews", "Our family has toured aquariums all over the USA (Georgia, Tennessee, Boston, Charleston, Texas). We were disappointed here. There were no large fish or mammals on display. Admission price was high. I don't like seeing large animals in captivity unless they are injured or not able to be released into the wild. Our saving grace was seeing a whale feeding in the bay (thru binoculars). My youngest said kept asking if we could leave and go see the wild otters at the nearby beach. That would have saved us $200.\nShow less"], ["Reviewed December 8, 2017", 4.0, "Worthwhile detour", "Great use and aesthetically well done conversion of the cannery. Easy to spend a few hours here. Highlight was the feeding of the sea otters. Also feeding of fish in the large pool."], ["Reviewed December 8, 2017", 5.0, "Stunning views, beautiful kelp forest and revolving display over the years", "I love on the Monterey Peninsula, and was one of the first charter members to join. I'm very blessed to work just 5 minutes from here, and on occasion I come here to enjoy my lunch break. I was reading the one star ratings, and all the complaints about the price and that it doesn't compare to other aquariums. I can attest to the fact that I've visited a few other aquariums around the world. They were all enjoyable but I think our local Aquarium is right up there in what it has to offer. Is this a place where you can watch an Orca whale show? No. (Thank goodness). This aquarium is a non-profit and is run by so many volunteers. VOLUNTEERS!!! These are folks who donate their time, take extensive classes so they can show people around.\nAs far as the exhibits, I love the Kelp Forest tank to this day. It's grandiose and almost mesmerizing. I could watch it for a long time. When my son was little, he loved the touch tank. He was happy to hang out there, while I'd explore other exhibits.\nI still love the jelly fish display, to this day. The one room, where it's floor to ceiling glass with beautiful jellyfish and so well lit up... gorgeous! I love the seahorse display, too.\nI agree, though, that there are way too many people. It's like going to Disneyland. So, we try to go towards the end of the day-- closer to closing hours.\nThe view, standing outside, is breathtaking and I never tire of it. The Monterey Bay is one of the most beautiful places I've ever seen, and I feel so blessed to call this town my \"home\". If you can afford the entrance fee, keep in mind it's educational. Be prepared for a zillion strollers and to be patient as, yes, there can be crowds of people standing in front of a display. Just wait and enjoy.\nShow less"], ["Reviewed December 7, 2017", 5.0, "wonderful experience", "We visited during the week in September. It was a lovely day and we found parking within a 10 min walk away. The staff at the aquarium were helpful and imformative. They were eager to answer questions and give advice. Our favourites were the otters, it was the busiest area we encountered, they are so adorable that young and old alike were happy to stand and watch them playing for long periods of time, us included! The other highlights for us as a family were the giant tanks, I cannot stress enough how amazing they are full of jellyfish, mesmerising. Just a beautiful experience all round, if you get the chance I would highly recommend a visit.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Well renowned Aquarium so had to visit.", "Not the biggest fan of thinks in tanks or cages but this place was excellent, lot's to see things we hadn't seen before both big and small tanks interesting and displays as well, if you go be sure to go out on the rear decking where there might be sea otters nearby, which are well worth seeing. The only downside was we though it was quite expensive, can understand why but if you were a family of four it would be quite a lot of money, obviously check on up to date costs before you go.\nShow less"], ["Reviewed December 5, 2017", 4.0, "Great Time", "Visited the Monterey Acquarium while visiting Monterey on a cruise ship in November Had a great time seeing all the Fish and exhibits visiting this large Acquarium"], ["Reviewed December 5, 2017", 5.0, "Fun place", "this was a very fun place to visit. my son had a membership for his family, The staff was very nice and offered my daughter in law a wheelchair as she had a very bad sprained ankle. They even held on to her crutches."], ["Reviewed December 4, 2017", 5.0, "A great aquarium experience for the environmentally conscious", "This aquarium is focused primarily on research and education, as opposed to entertainment. On the edge of south Monterey bay, the surrounding water is teeming with life, and the observation platform and telescopes of the aquarium allow you to get an excellent view. From the deck I saw sea otters, sea lions, cormorants, and even a couple of dolphins. Close to the deck is the aquarium's restaurant and café, both of which have large windows allowing the diners to get an excellent view of the bay.\n\nAlthough the aquarium seems large, there are quite a few shops on the premises, which I am assuming are used to fund the research activities, as well as some exhibitions which don't have any sea animals and are instead intended to educate the visitor on the problems affecting the ocean, like climate change, ocean acidification, and plastic garbage.\n\nOf the sea animal exhibits, some, like the penguin and puffin exhibits, seemed like they would be better accomplished by zoos, since the animals seemed to be cramped, although the staff assured us that live at very high densities and the exhibits were properly sized for them.\n\nI found the main large tank well as the jellyfish exhibit the most compelling parts of the aquarium, with the lighting and music almost designed to put you into a trance. This of course depends on the visitor. Kids would probably like the petting aquariums instead, a well as the glass waterfall.\n\nThe aquarium has a regular programming of various kinds, including feedings, movies, as well as animal enrichment. The non-releasable sea otters seem to be a favorite, and are especially cute when sleeping.\n\nThe staff are very knowledgeable, and are eager to help and educate. I would recommended the Monterey Bay aquarium for anyone interested in learning about life in the oceans, and it's relationship to humans.\nShow less"], ["Reviewed December 4, 2017", 5.0, "Rainy day surprise", "It was a cold and rainy day so we ducked into the Aquarium next to our hotel. Fabulous Cannery Row presentation complete with boilers and equipment used back in the day when sardines were lifeblood of the area. The rest of the aquarium was excellent, as well, with many activity choices and interesting displays. We took a break in the restaurant to avoid the children in the cafe and were surprised by the excellent cuisine and service. Best views for watching sea life throught the museaum.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Just amazing!", "We loved the Monterey Bay Aquarium so much we came twice this year. Our visit in April with our (almost) 3 year old was amazing. We loved the hammerhead shark exhibit in particular. Our son loved everything about the aquarium and it kept his full attention for about 3 hours. We ate at Cindy’s Waterfront in the Aquarium (make a reservation!) and it was a nice little break so Mom and Dad could have a glass of wine! When we came back with our 5 year old in August we were bummed that the hammerhead was no longer on display but we were told they have a couple that will be going into the tank once they get bigger...so fear not, they will be back! We really enjoyed our time here!\nShow less"], ["Reviewed December 2, 2017", 5.0, "Here fishy fishy", "I love this place. I could spend all day here. My only complaint is how crowded it gets, but that usually means the place is great so..."], ["Reviewed December 1, 2017", 5.0, "Awesome aquarium even if you have one near you this one is worth seeing", "We live on the east coast and have access to the Baltimore and Camden Aquariums. This was great and felt like it came right out of the sea. In the large tank we saw a bait ball for and learned why. We also saw a stay bait fish (sardine?) get grabbed by a Mahi Mahi. They had an floor to ceiling kelp forest.\nShow less"], ["Reviewed November 30, 2017", 4.0, "A Fascinating Aquarium", "We went the weekend of Thanksgiving. It sure was Crowded as expected. The line was handled well though. The exhibits are nicely done and the different areas are interesting. Some of the exhibits were mesmerizing with the beauty of the \"undersea\" world. It was a very Good experience and we were glad we went. A little pricy for a family to go, but they accommodate all ages in pricing. Worth a trip if you are in the area.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Awesome,World class", "I have been to many aquariums world wide and this is by far the best. If you are at a hotel buy your ticket there, most hotel tickets give a second (consecutive) day free. And you need that second day! The price may seem high, but it is a bargain for what you get. Don't miss sea otter feeding time.\nShow less"], ["Reviewed November 29, 2017", 5.0, "World class aquarium", "This is an outstanding example of a responsible aquarium. Superb exhibits with a clear purpose of education rather than just entertainment. Clearly focused on marine conservation and preserving our oceans - well done MBA !"], ["Reviewed November 29, 2017", 5.0, "Great Aquarium", "I love aquariums and I have heard about this one for years. It didn't disappoint. The kelp forest was amazing and the presentations the staff gave were excellent. We went on a holiday weekend and the place was unbelievably crowded with strollers and large families, but I thought that the aquarium did a good job at controlling the crowds especially during the talks. It is pricey but worth it.\nShow less"], ["Reviewed November 28, 2017", 5.0, "New Age Aquarium", "The Monterey Aquarium was an early adopter of naturalism in both its constructin and displays. As a salt water aquarium it displays a wonderful assortment of sea dwellers. Enjoy!"], ["Reviewed November 28, 2017", 5.0, "Great for kids", "Didnt know what to expect but i had just as much fun as the kids. Plenty to see and do and the cafe has a great selection of food."], ["Reviewed November 26, 2017", 5.0, "Sea Otters and Birds", "I'm not a fan of zoos but the Monterey Bay Aquarium is an exceptional place for all ages. It could easily take you a full day to cover all the exhibits."], ["Reviewed November 26, 2017", 5.0, "An animal lovers dream", "Happy to have been there a third time, over 34 years, since it’s opening. The crowds were moderate, and the volunteer docents extremely well informed on the animals’ habitat and behavior. One volunteer described the construction of the aquarium."], ["Reviewed November 26, 2017", 5.0, "Mesmerizing sea creatures!", "This aquarium is amazing! From start to finish, I’m mesmerized. Sea life is fascinating and yet most of us think less of the ocean. Polluting it with non biodegradable plastics put these beautiful creatures in danger. I like the fact that they have dedicated a space for ocean awareness. When I look into the huge aquarium teeming with life, I was like a kid in a candy store! Couldn’t help but get fascinated with the school of fish amongst other sea life. Corals, anemones, sea slugs, multi hued fishes providing so much color! Jellyfishes doing their dance, manta rays and sharks’ commanding presence...I could go on. Sea lions, otters, penguins getting their fair share of attention. So glad I made the stop! 2 hrs went by quick. Felt like a kid again!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Always a pleasure and a wonder to visit the Monterey Bay Aquarium!", "Had not been here in several years but it was just as wonderful an experience as i remembered. Particularly loved the Tentacles area. Could have watched the octopuses all day."], ["Reviewed November 25, 2017", 5.0, "Fantastic day!", "Had a brilliant day out with friends. The sea life variety was amazing and the jelly fish exhibit was so cool!\nThere was also exhibits about climate change and the damage that plastics are doing to the marine ecosystem that were both Intetesting and educational. Also met one of the resident Albatross which was a once in a lifetime experience. A truly fabulous day.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Loved the Aquarium", "Spent the morning here while visiting Monterey off of a cruise ship. Loved exploring all through the aquarium. The weather was perfect for going in and out doors. Were lucky enough to see a sea otter nearby feeding."], ["Reviewed November 24, 2017", 4.0, "Last day", "We debated about going here as ery expensive and we have been to lots of aquariums around the world. The sea otter exhibition I really enjoyed and being able to go out on to the deck and try to see them offshore was great. The rest of it was well laid out and interesting.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Everything has already been said about the aquarium", "Seems especially geared for children but plenty of interesting things for adults as well. Get up close and personal with sharks, rays, and giant sea bass. Immerse yourself in the deep sea exhibit. Watch otter and kelp forest feeding."], ["Reviewed November 23, 2017", 5.0, "Aquarium on the Ocean", "Great aquarium with many great staffers who can answer many questions! Nice walk from parking lot to aquarium. You do have option to drop family off in front of aquarium too but the walk is nice."], ["Reviewed November 22, 2017", 4.0, "Great aquarium, overcrowded with kids on a Saturday visit.", "Our party of 3 visited on a Saturday in November. We loved the aquarium and it’s exhibits, but it was really crowded with young children on the weekend afternoon. I’d recommend a weekday visit for adults."], ["Reviewed November 22, 2017", 4.0, "Worth a visit", "Our children (14 & 11) loved it here, staff friendly, knowledgeable & helpful. Plenty to see, great facilities. Kids enjoyed touching the stingrays, starfish etc"], ["Reviewed November 20, 2017", 5.0, "Great experience for all ages!!", "We have been members ever since our second visit. We were hooked from the very first visit!\nSo many cool things to do and see for all ages. You will truly be inspired by all the amazing animals here. You will think twice on recycling more and keeping our oceans clean for our future and realize how truly important it is for all of us to do our part weather we live in California or just visiting...\nThe ray touch tank is a favorite with most. You do get wet so be ready parent's 2 change lil' one's shirts;)...\nBut sooo worth getting wet for opportunity to feel one of these amazing creatures even just once.\nAnd if your kids are willing to do a dive in the bay, pay the extra money for an experience you all can share for generations..\nI wish they allowed adults to go to go in with their kids, then maybe more people would do it..\nHopefully they will change the age restrictions soon..\nBut check all the behind-the-scenes stuff available. Especially if you have future marine biologists in the group.\nThey may not even know it until they meet face to face and fall I love with one of these amazing creatures.\nMost of us will never get to see or touch these guys in the wild. Especially the deep sea creatures they have on display here.\nDon't miss any exhibit they all are a must see...\nIf you become a member check the times and exhibit' s open at the time you Go, because they close alot of them for the night if you go after hrs at the member's only times...\nWe found that out after driving 2 hrs just to see the flap jack octopus and it was not on display that day.\nCheck ahead for what yr going to see. They have a live chat on their website if yr on yr way already and have last minute ?s\nDown side is the food is way over priced, so bring a snack or lunch if u have a large group.\nAnything around there is also expensive so plan for touristy prices.\nAlso heads up if u go to the wharf there are alot of homeless looking for hand outs.\nBut that's everywhere in CA..\nI would skip it and go see a sunset on the bay!!\nShow less"], ["Reviewed November 20, 2017", 5.0, "Big Aquarium, does not worth money u pay for entry", "Located in a small city Monterey, its the main attraction inside the city. Its good to pass to few hours inside. Its not through the sea, just a big aquarium."], ["Reviewed November 19, 2017", 5.0, "Not to be missed in Monterrey", "Monterrey's main attraction. Not to be missed. Very well organised and staffed. Wonderful experience. Directly on the water with great views of the bay and ocean. Lots of outside space. Proximity with ocean outside gives great context to the exhibits within and is pretty unique for a major aquarium like this. Overall, by far the nicest aquarium I have seen anywhere in the world. Great for families, friends, young or older.\nShow less"]]}}