{"Monterey Bay": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Monterey Bay", "url": "/Attraction_Review-g32737-d116791-Reviews-Monterey_Bay-Monterey_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/11/fd/96/17-mile-drive.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2411"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Monterey", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Beautiful vistas and beach walks", "We’ve visited many times and no matter the weather, always are drawn to a walk along the beaches. Marina Dunes State Park is never crowded and you can often see whales just offshore. The beaches near Pacific Grove generally are windy and it’s relaxing to walk along and watch the waves break over the rocks. Asilomar state beach is sandy and uncrowded too.\nDress in layers, it can be chilly at any time of year.\nShow less"], ["Reviewed 3 days ago", 5.0, "Saw a humpback whale!", "The Bay is beautiful, the coastline is like nothing else, and I saw a whale right off the shore! Can't wait to go back!"], ["Reviewed 4 days ago", 5.0, "Relaxing", "I enjoy Monterey every time I go! Absolutely beautiful. I love how clean and peaceful the beaches are."], ["Reviewed 4 days ago", 5.0, "Breathtaking", "No wonder people come from all over to see this. Rent a bike and see this coastline! Safe bike and walking trails."], ["Reviewed 1 week ago", 5.0, "Beautiful!", "When it's snowing at your house and you're ready for some ocean waves, sand & relaxing... this is wonderful."], ["Reviewed 1 week ago", 4.0, "What a wonderful view", "Monterey Bay is definitely worth a visit if you’re staying in the region. The view is fantastic and it’s a good possibility to enjoy the silence after a city tour or road trip."], ["Reviewed 2 weeks ago", 4.0, "Beautiful place", "A beautiful bay with great views and lots of wildlife. Lots of amenities nearby. Wouldn't fancy swimming amongst all those jellies though!"], ["Reviewed 2 weeks ago", 5.0, "Gorgeous vistas!", "So pretty all through 17-mile drive! Iconic California. So many beautiful vistas along the Monterey / Carmel-by-the-Sea drive down to Big Sur. Breathtaking!!"], ["Reviewed 2 weeks ago", 5.0, "Beautiful, Fresh Air, Clean, Clear water", "The air is so fresh, the landscape is beautiful, the water is clear. If you like seafood, anywhere around the bay is great. It can be windy and slightly cool. It's good to bring a sweater or jacket. Parking anywhere near the Monterrey Wharf is difficult. If you get there before 10 AM, you can find a spot to park on the street. All are metered. You can use a credit card to pay the meter. I had a great time.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Family outing", "Took the kids to Monterey boat light show. There was so many boats lit up that would go from Monterey Bay to Lover's point and back and then they would come into the Monterey Bay Fisherman's Wharf area. This is a definite must to take the family to enjoy this beautiful lights at Christmas time the Bulls were just all lit up with different decorations\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Sea animals galore!", "Being from MN, I can’t tell you how cool it was to see so much wild life just while walking from Monterey Aquarium to fisherman’s wharf...harbor seas, sea lions, sea otters, pacific loons, jelly fish, various birds and even a whale. I WAS IN HEAVEN!"], ["Reviewed 3 weeks ago", 5.0, "Pretty place", "The Monterey Bay is a very pretty bay! You can enjoy the wharf and the beach as well. Nothing else to add."], ["Reviewed 4 weeks ago", 5.0, "Beautiful! Restful, worth the walk", "Just a really beautiful area, with wildlife and waves. Walk around, enjoy the peace, tho that is in winter."], ["Reviewed January 23, 2018", 5.0, "Beautiful.....", "Lots of stunning places to pull off in a car or walk to along Monterey Bay. Blue ocean and nice beaches to explore with amazing scenery from the wharf to the sailboats. Love Monterey"], ["Reviewed January 23, 2018", 5.0, "Wonderful location on the Calif. coast.", "Great location on the Pacific Ocean with fantastic views and unparalleled amenities. A treat for the whole family with great hotels, restaurants and natural beauty that is unparalleled. Visit the Cannery the Aquarium and the fantastic golf courses."], ["Reviewed January 22, 2018", 5.0, "The Monterey Bay Experience", "The rugged coastlines from Monterey Bay to Big Sur are breath taking and makes a beautiful backdrop to engagement announcements or family holidays! There's plenty of hiking for all levels. If you want to do an \"Urban Hike\" park at Fisherman's Wharf, and then walk down to the end of the wharf and go up the stairs & around the restaurant and catch some views of Sea Lions sleeping under the piers. Then walk over to Cannery Row, past the aquarium to Lover's Point and back. You'll be able to see the seals resting on rocks and otters frolicking in the bay. While you're over at Cannery Row consider the Chocolate Factory's \"Pecan Bear\" or sit a spell at the \"Wine Experience.\" Try the test tubes 1 by 1 with samples of food and see how it changes the flavor of the wine. Lots of people watching, shopping and reasonably priced \"Happy Hours\" on a Sunday stroll, in particularly, \"The Chart House's\" Happy Hour from 4:30-6pm. The hiking trails at Pt Lobos are well marked and kept up. Take a photo of the map by the entrance with your smart phone and follow the trails to the coast. Don't forget to stop by the Whaling museum and get a list of the movies who've used this coastline as backdrops! If you've got kids, they can pet the various pelts of animals that live in the state park. If you get to Big Sur, be sure to go to Nepanthe's restaurant and sit out back, the views are fabulous & the Bloody Mary's are spicy!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Awesome and diverse", "Reviewing the Monterey Bay is like reviewing the San Francisco Bay. It's a huge area with tons of options for tourists and locals. My favorite thing is the 17 Mile Drive and the amazing Granite geology around the Monterey Peninsula."], ["Reviewed January 16, 2018", 4.0, "Pretty", "This is one of the prettier places in California in the USA and it is great to drive around and look at."], ["Reviewed January 11, 2018", 5.0, "Take My Breath Away!", "Want a gorgeous, romantic and charming vista and enjoy some fresh air? You have come to the right spot! bring your favorite friend or family and enjoy this first-class venue. From Seaside to Pebble Beach to Carmel-by-the-Sea, it is a sight to behold. My wife and I stayed for a weekend getaway from San Jose at a Pacific Grove B&B within walking distance to the beach and walkway and loved being in one of the most breathtaking stretches of oceanfront anywhere. The water is so blue, the rocky edges so spectacular, the sounds of the waves, birds and animals really connected to my soul! You can walk, go for a run, bike, or cruise (slowly please) in your automobile! I especially love driving from Pacific Grove down Ocean View Blvd. to 17 Mile Drive all the way to Pebble Beach. You have to pay to go into 17 Mile Drive but it is still worth it. Then you can have a picnic on the beach or dine at one of the nice places on the route at many golf courses and resorts. I love Spanish Bay and Pebble Beach for food or start at Carmel and create yourself a picnic basket from one of the great restaurants or delis. You won't want to leave and whisper, \"I sure would love to own a home and live here!!!\"\nShow less"], ["Reviewed January 9, 2018", 5.0, "Fabulous visit", "All the family loved Monterey - really easy-going vibe and lots to see and do in the area. Even the least energised person would find themselves wandering the town and exploring!"], ["Reviewed January 8, 2018", 5.0, "Breath taking", "This place is just breath taking. It is a most see. It gorgeous and I would go there any day. If you are going on a trip the Monterey bay is the place to go for a overnighter or a day trip it is gorgeous."], ["Reviewed January 7, 2018", 5.0, "A Beautiful Place On The Pacific Ocean", "The view of the Pacific Ocean from Monterey Bay cannot be beat. It is teeming with life both animal and human."], ["Reviewed January 4, 2018", 5.0, "Very nice", "My father was actually stationed at Fort Ord so I lived around here when I was a kid for about 3 years. The tell you the truth not much has really changed everything is just as beautiful as it once was. I never come here during the tourist attraction days because I don't like the crowds. This place is just as beautiful in the winter as it is in the summer actually I think it's better during the winter time. If you never been to Monterey or Carmel this is a must-see for you. it's one of the prettiest places in California left\nShow less"], ["Reviewed January 1, 2018", 5.0, "Bring a Camera - and a jacket", "Everyone raves about the beauty of Monetery Bay. If you are driving from San Francisco- when you get your first glimpse of the Bay - you will be dazzled. It really is breathtaking - even for San Franciscans who have beautiful water on three sides...The 17 mile drive is worth the $10.50...vistas and views are spectacular.\nThe kids will want to put their feet in the water - chilly!\nShow less"], ["Reviewed December 26, 2017", 5.0, "Beautiful scenery and something for everyone", "The Monterey Bay area is beautiful. There is something for everyone. The Aquarium is the highlight, in my opinion. Cannery Row is a nice place to stroll and visit restaurants and shops. The 17-mile drive has fantastic scenery and well worth the time - but maybe not too interesting for young kids. And the bay itself is beautiful and you can often see sea lions and otters as well as many sea birds in the bay. There are also several beaches in the area.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Love the bay", "Such a quiet place to hang out and enjoy nature. Or walk over to Cannery Row and Fisherman's Wharf to enjoy the hustle and bustle of people!"], ["Reviewed December 26, 2017", 4.0, "Rugged but pretty", "Plenty to do. Walk, drive. Take your dog or walk with your significant other. Cold this time of year. But adds to the atmosphere. Walk all the way down to the old bay area or just take in the views of the ocean either way you should take the time to experience it.\nShow less"], ["Reviewed December 21, 2017", 5.0, "I live here & the bay is awe inspiring", "The Monterey Bay is the back drop to one of the most spectacular parts of the California coast. Visit Marina Dunes State Park or Point Lobos or better yet Big Sur. The bay provides an incredible sea scape at each venue. But please spread the word Big Sur is open. Please visit as last year's fire and winter mud slides took a major economic toll on the area...Big Sur is back and looking forward to your visit.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Pretty!", "This is a stunningly beautiful area. Monterey, as a city, is pretty hard to get around; the street grid isn't a grid at all, but more like the web of a drunken spider. But the parts that are the best -- the scenery from Fisherman's Wharf, Cannery Row and Pacific Grove -- are easy to get to, and parking is easy if you go in the morning and catch the sunrise.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Great way to spend Black Friday", "This is an absolutely wonderful place to visit. We spend Black Friday shopping at the outlet and main mall. Lots of fun. Wife loves it. After shopping, we go for massages, then wine tasting in the early evening. Walk down Cannery Row, enjoy the shops and food. Smell that cool ocean air, hear the Sea Lions barking. So much history. Might retire here one day.\nShow less"], ["Reviewed December 6, 2017", 5.0, "A great drive and free", "The entire Monterey area is just amazing for its sites, restaurants and of course the aquarium. If you drive north past the aquarium you can drive along the ocean for miles for free. There are plenty of parking spots where you can get out and view the beautiful ocean sites.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Nice Tourist Town", "Nice place to visit but keep in mind it is a tourist trap in many ways. Many excellent restaurants/bars to choose from that have an excellent view of the ocean. Plenty of places to get down by the water. Watch closely and you will see many different type of wildlife.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Sealife protected", "A truly beautiful part of the West Coast of California. This is a protected area and many varieties of sealife can be seen on any given day. 2073"], ["Reviewed November 28, 2017", 5.0, "Spectacular California Bayscape ...", "It’s one of the recognizable special spots of Water and bayside which shows up in books, magazines, advertising and related - and justifiably. Simply beautiful! Enjoy."], ["Reviewed November 26, 2017", 5.0, "Best of California", "I can’t say more about Monterey. There is no where I would rather live as it is picturesque everyday. Great neighbors and nature combined."], ["Reviewed November 24, 2017", 4.0, "Didn't complete the drive", "We did the coastal area which was very beautiful and interesting. We were looking for sea otters but they were in hiding."], ["Reviewed November 19, 2017", 5.0, "Beaches, Wildlife, Otters, Sealions, Scenery, Food, just gorgeous!", "The Monterey Bay is quite vast and there are ample opportunities to explore a variety of beaches, scenery and see a lot of wild animals. I have only explored a ittle as I moved here late Oct 2017 so I am slowly getting around. Beaches are different but all quite beautiful for different reasons. I find the beaches to be clean of trash just lots of plants washing up but I don't mind about that.\n\nDriving on the HWY 1 and just looking at the landscape and views is fascinating onto itself.\n\nYou can go posh areas like 17 mile drive and explore or calm relaxing areas up outside of Monterey. Monterey has a rich history that is fascinating because the Spanish came here hundreds of years ago.\n\nIf you want to sea and walk near the elephant sea lions go to San Simeon and see them up close or watch the Otters playing in the sea at Moss Landing or Morrow Bay. Just so many options and choice to view so many amazing wild life. Deer, wild pigs, mountain cats, raccoons, bald eagles can be spotted in the inland but watch those wild pigs can destroy your car so be careful at dusk and dawn..\n\nI am loving CA and exploring the entire area.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Spectacular Scenery", "Monterey Bay is breathtaking. The state has done an amazing job of preserving the area for the wildlife and their natural habitats. The beaches were vey clean and accessible."], ["Reviewed November 13, 2017", 5.0, "Scenic Outing for Silicone Valley Residents !", "It is one of the most beautiful beaches of California offering a lot of activities to tourists with a classical touch of ancient heritage. 17 Mile drive within a driving distance is an added advantage."], ["Reviewed November 13, 2017", 5.0, "Never get tierd of the amazing views!", "We moved to Monterey from the east Coast in 2001. In the time since, we have been constantly exploring the Monterey Bay coast from Santa Cruz to Point Lobos and down to Big Sur. If you want to experience one of the worlds greatest shoreline roads, fascinating micro-parks, great redwood trees then this is the place for you. Best of all, it's a treat all four seasons!\nShow less"], ["Reviewed November 13, 2017", 5.0, "Great Area", "Walkable in the downtown or by cannery row. Lots of sea life with pretty streets and vistas. Walk to the beach or to the pier."], ["Reviewed November 10, 2017", 5.0, "Beautiful and Educational!", "Be sure to visit the Bay if you are near here! There is a walking-path for people and dogs, and a biking path next to it. You can spend a couple of happy hours, walking along the beach or on the trails, reading the informational signs, and watching the seals and seagulls. Stop by a hot dog stand for authentic USA treats!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Ruggedly beautiful.", "All up and down Monterey, well, the California coast really, is some very rugged, unspoiled and beautiful vistas of where the land meets the Pacific."], ["Reviewed November 9, 2017", 4.0, "Old capital of California", "Scaled down version of old San Francisco. One of the best aquqriq in the world. Skip the restaurants on the Warfs. Most of them are over priced mediocre restaurants."], ["Reviewed November 9, 2017", 5.0, "There is a God", "This place is amazing and scenic in every way. One can sit and look out at the water for hours. The marine life are adorable to watch and are plentiful here in the bay. Such a beautiful place that is very memorable as well."], ["Reviewed November 7, 2017", 5.0, "Spectacular!!!", "Monterey Bay is truly something and is right by all the shops, restaurants and tourist attractions in Monterey!"], ["Reviewed November 7, 2017", 4.0, "Great placeto visit as a tourist", "Monterey is a lovey little town with some great places to visit. We like wildlife so we walked through the town looking for Anya's Hummingbirds in the town parks and all kinds of sea mammals in the bay. There was a lot of choices of places to eat along Fisherman's Wharf and Cannery Row. We had a day out whale watching which was great with excellent views of humpbacks and Risso's Dolphins. The California Sealions were new to us but we get the harbour Seal back home in the UK. Stars of the show are the delightful sea otters which show up anywhere you can see kelp.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Cruise Ship 🚢 in port!", "We were certainly excited to see a cruise ship in the harbor! The park by fisherman‘s wharf is extraordinary! Lulus in the middle on the municipal wharf is a great little restaurant. Monterey Bay has something for everyone. You can, get out of your car and walk a bit. You won’t be disappointed.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Relaxing Drive/Stroll", "We arrived in this area in the late afternoon and took a leisurely drive/walk along the waters edge. A lovely place with many beautiful B&B's and accommodations along the ocean view blvd."], ["Reviewed October 31, 2017", 5.0, "One of the most beautiful places on the planet.", "So much to see & do, fabulous dining experiences! Rent a bicycle & ride around the coast (be careful, drivers are looking at the views too)! There are dozens of fabulous restaurants... Rent a kayak & see the bay from the other perspective..."], ["Reviewed October 31, 2017", 5.0, "Slice of paradise", "I can’t say enough about what a fantastic time my husband and I had on our recent trip to Monterey CA...the weather, the people, the attractions!! Everything was perfect!!! Put Monterey on your bucket list for sure!!!"], ["Reviewed October 26, 2017", 5.0, "Nice conference visit", "Good place to wind down from a conference day. We had a blast and there are so many picturesque views. Lots of close hotels, restaurants, a bike/walk trail, and cool places to checkout."], ["Reviewed October 26, 2017", 5.0, "Excellent views", "We stayed in Monterey for a couple of days and had a trek to the bay area which has it's own Fishermans Wharf, then down to Cannery Row - we tried the American version of Asian food at an Indian restaurant there but it was not up to scratch much as there was no curry in my chicken curry ooh er.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Beautiful area", "Monterey Bay is such a beautiful area. The beaches are full of wildlife which you don't have to work hard to see. Pelicans, Sea Lions making their presence felt and Sea Otters, amongst others. The walk along the beach is lovely.\nHad we been in the area longer, bike hire would be great as there are routes along the shoreline. There were lots of canoeists and divers in the area which looked like fun activities for all levels.\nA lovely place to be!\nShow less"], ["Reviewed October 22, 2017", 4.0, "Wonderful scenery.", "Monterey is an old well established town. Fishermans Wharf is interesting as is Cannery Row, good restaurants, but the parking is terrible, we ended up having to pay in a parking garage when we ate out in the town center."], ["Reviewed October 21, 2017", 5.0, "Perfect for relaxing time off", "We spent Labor Day weekend here and were pleasantly surprised by the mildly busy, but not hugely overly populated holiday weekend. Plenty of excellent seafood restaurants on select and beautiful scenery, and drives."], ["Reviewed October 19, 2017", 5.0, "Scenery is unique", "I dreamed of seeing the Pacific Coast at Monterey since reading John Steinbeck in high school and studying western United States geography in University. The water is as blue as I imagined. The rocks were as sheer and weathered as depicted in textbooks. I could spend hours examining the landscape and seascape and pondering the forces responsible for their creation and their future. It's a view not to be missed.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Stunning coast line.", "Beautiful scenery did a 2 mile walk along part of the bay. Sea lions all resting on the rocks peaceful and relaxing."], ["Reviewed October 17, 2017", 4.0, "A Drive Through Monterey Bay , California", "We drove through one of the most picturesque sea shore on State Route 1 in Central California Pacific Coast to reach Carmel from San Francisco. The Monterey bay starts South of Santa Cruz right up to Monterey City and beyond up to the Carmel township stretching about 45 miles crossing many important beaches and historical landmarks like Capitola,Rio del Mar , La Salva Beach ,Watsonville ,Moss Landing ,Marina,Sea Side, Monterey , Pacific Grove ending at Carmel on the Sea.\nAs you cross Watsonville , you can see long stretches of farm lands on both sides of the highway cultivating strawberries , Artichoke , Pumpkins etc. As Halloween festival was around the corner , we could see brisk sales in Farmers Markers set up in the farms.We passed through the historical Monterey Presideo before driving towards Carmel . The world famous Aquarium and the PGA Golf Course are also located in the Monterey Bay.\nMonterey Bay was first discovered by the Spanish explorer Juan Cabrillo in 1542 . Most part of State Route 1 in this sector is also named after Cabrillo..\nShow less"], ["Reviewed October 16, 2017", 5.0, "My favorite place to take a day or two off.", "I have worked in San Francisco, silicon valley and San Jose and I like to fly in the Friday before I have to be at work and drive down to Monterey by the bay. I have stayed at the \"cheap\" hotels on Munras Ave and walk down to the bay. You can see the bay form Seaside to below Carmel. There are a dozen beaches you can stop at and several good places to scuba dive. Go to the Coast Guard station, Monterey Bay and walk out beside the sea lions. There are several great hotels and restaurants beside the water.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Just wonderful", "Perfect location for wonderful 4 day trip - beautiful historic area, and perfect to serve as a hub to the surrounding areas."], ["Reviewed October 11, 2017", 5.0, "Love Monterey!!", "Weather we come with family, friends or just us, my husband and I love Monterey! We visit twice a year sometimes more. It is most definitely one of our favorite place to get away. We are never disappointed! There's always something to do or see."], ["Reviewed October 11, 2017", 4.0, "Stunning views", "Driving around the coast was very nice. Apparently you can see whales at certain times. Loads of pelicans and Cormorants feeding due to large sardine schools around."], ["Reviewed October 10, 2017", 4.0, "Don’t miss this", "If you are in the Monterey area this is a must see. The best aquarium I have been to. Pricey at $50 per person. But, it really is a full morning or afternoon activity. Lots to learn at the aquarium and many helpful/informative staff members."], ["Reviewed October 10, 2017", 5.0, "absolutely beautiful", "The scenic route and stopping along the way was so enjoyable. Awesome views. We had a picnic lunch at a quiet spot and enjoyed the view and quiet time together."], ["Reviewed October 9, 2017", 5.0, "Its my go to vacation spot", "Of course I title it this way, because I love Monterey. I lived there for three years and just love coming back every couple of years to see the sights, the bay, the aquarium, and of course the food!"], ["Reviewed October 9, 2017", 5.0, "What a dfference 20 years makes!", "Monterey was always beautiful, but what an amazing job they've done in preservation and restoration! Teeming with wildlife, both sea mammals and birds, I've seldom been so happy to be by the ocean!"], ["Reviewed October 9, 2017", 5.0, "love Monterey", "We just love Monterey. The harbor, the beaches, a whale wtahc cruise in the bay. Even watching all the wildlife from the beaches."], ["Reviewed October 8, 2017", 5.0, "Beautiful", "What else can you say! It's the ocean and beautiful. Alot of the area is harder to get to for anyone with walkins issues."], ["Reviewed October 7, 2017", 5.0, "Vacation", "Love Love Love Monterey! Beautiful area, a must do and see for everyone! The weather is wonderful, lots to do and see. Great walking/biking trails."], ["Reviewed October 6, 2017", 5.0, "This 17 mile Drive is NOT to be missed!", "If you are into a leisure drive with awesome views in any direction, spectacular homes on both sides of the road, with floral, fauna and plenty of ocean views = this scenic experience is for you. Stop along the way and picnic or get your picnic at the Lodge Deli.\nShow less"], ["Reviewed October 6, 2017", 5.0, "I love monterey", "It is a for sure place to visit, lovely drive and lots to do. I have stayed at the hotel\nthere three time in a year and a half. many places to eat. and whale watching.\nlove the sea and the beach. also picture taking is a must.\nShow less"], ["Reviewed October 6, 2017", 4.0, "Beautiful area", "We had a wonderful time visiting the Bay area and walking along the beach and warf. There are lots of sea birds and seals and sometimes whales, although we didn't see any. We went on sunny days, foggy and rainy days and morning and evening- we enjoyed it every time. There was plenty of parking too, paid but reasonable.\nShow less"], ["Reviewed October 6, 2017", 5.0, "beautiful views", "We love sea otters. This is a great place to bring your binoculars and watch them. We sat and watched a beautiful sunset here."], ["Reviewed October 5, 2017", 5.0, "Loved biking around here!", "Monterey has a very nice biking pathway system that stretches for miles and along the coastline. On this visit we had a beautiful, sunny day and just loved biking all around the bay area. The sea birds were out fishing and the seals were sunbathing on the beach. The rock formations and water also made for some post card perfect pictures.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Beautiful", "The scenery was amazing. There is nothing more tranquil that being by the water. Would have liked to have been able to spend more time there"], ["Reviewed October 4, 2017", 5.0, "Simply amazing", "We are both nature lovers, and simply loved this part of the world (the first time I heard about it was via a Dreamweaver course and it's book from here!!!). It is stunning, gorgeous and unique, although it reminds me of the rugged coast of Lebanon.\n\nYou have to see it.\nShow less"], ["Reviewed October 3, 2017", 5.0, "\"Small Coastal city with a big personality\"!!", "Monterey is a great vacation spot. Has everything a person could possibly want in a small vacation area. Beaches, whale\nexcursions, Kayaking, trail hiking, shops, golf courses, aquarium and numerous restaurants and lodging. it is a great walking city and also has numerous other entertainment areas close by if you have an automobile. Have been vacationing here for over 30 years and never get tired of the area.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Exciting and rugged ocean views", "Want to see a wonderfully picturesque city? Monterey is a beautiful place to see the ocean and rugged rocks interact to create beautiful scenery and wild water. Pure air, a beautiful Aquarium, great hiking areas along the rugged beach and great tide pools. Plus the historical significance and Spanish architecture of old Monterey. The weather is temperate in fall and May.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beaches galore!", "You can always find a beach to explore or collect sea shells. We always search until we have a handful of sand-dollars. You can always a buy one in the shops but they mean so much more when you can share a memory with them."], ["Reviewed October 2, 2017", 3.0, "Beautiful coastline. Walk-able city", "We stayed in Pacific Grove and were able to walk to/from the beaches and Cannery Row within 20-30 mins. Highly recommend 17-mi drive, Big Sur, and Asilomar Beach."], ["Reviewed September 30, 2017", 5.0, "Fabulous", "The Bay is really scenic, you see the natural beauty. We were fortunate to spot whale from shore and saw Seal giving birth. It's really worth going there and spending few hours admiring natural beauty."], ["Reviewed September 26, 2017", 5.0, "Gorgeous drive and views.", "It's a gorgeous drive and the views are spectacular. Stop and stop and sit. Just enjoy the beauty of the shoreline."], ["Reviewed September 23, 2017", 5.0, "Monterey Bay", "A beautiful place to walk around, with lots to see and do in the Cannery Row vicinity. Of course there is the Aquarium, but there are also lots of shops and restaurants."], ["Reviewed September 22, 2017", 5.0, "So many spots to stop and view the ocean", "This is a must do drive around the bay. Waterfront roads allow photo stops of shoreline that alternates between sandy beaches and rocky cliffs. Seeing the waves pound the shoreline is awesome."], ["Reviewed September 20, 2017", 5.0, "Pristine Bay", "Love watching the otters, the sounds of the seals barking, the sea gulls, the scent of the salty sea mixed with giant seaweed, the jelly bean colored Kayaks, the swoosh of the waves, the mists and fog that clears to reveal the wide swath of bay and crystal waters.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Loved it, sea lions galore, whale watching, nice places to eat and chill", "Definitely visit, the downtown is lovely, there's a nice beach, cannery row is OK, the whale watching is excellent - there's places to visit 17 mile drive, beaches - we loved Monterey."], ["Reviewed September 19, 2017", 4.0, "Lovely Place", "We visited en-route to Pismo. Monterey has a nice Pier, the bay is beautiful, the houses are quaint and nice to see... we also went to Lovers Point which is very pleasant and peaceful. We then drove on to Carmel over the top through the woods etc., an interesting drive...\nShow less"], ["Reviewed September 18, 2017", 5.0, "Stunning", "This was my favourite bay in our whole Californian trip. It is lovely to walk around. Lots to do and see and really pretty."], ["Reviewed September 15, 2017", 5.0, "Where else are you going to go?", "Great town, I wish I could have it to myself. I recommend Lover's Point and the Monterey Bay Aquarium above all else."], ["Reviewed September 15, 2017", 5.0, "BREATH-TAKING at Every Turn", "Skip downtown, traffic and shopping and head to the peninsula and walk along the beautiful, accessible paths. Ample free parking; we watch whales, climbed on cliffs, and simply enjoyed the beauty."], ["Reviewed September 14, 2017", 5.0, "Restaurant shopping tasting rooms", "Great little town for all your gift shopping and tasting rooms and restaurant. So yes I would recommend going to Monterey and visiting. Great views and yes you have to pay to park."], ["Reviewed September 10, 2017", 5.0, "Beautiful Scenery", "I cannot say anything about this place that has not been said a million times already. The coastline just south of Monterey is one of the most beautiful places in California. I keep coming back to it; drawn by the shoreline, the soothing sound of the surf, and the wildlife. It is a cool break from the oppressive heat of summer in the valley.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Bucket List - CHECK!!!", "On our back to Nevada from a family trip when I was eight, my dad stopped by the Pacific Ocean and let us run put our feet in. It was night time ... in mid-March - with a nearly full moon. Now some 50+ years later, I got to go back. Even more amazing than I remember! Recent girls trip took us to Santa Cruz, Monterey, Carmel, and on down to San Simeon before heading up to San Francisco. Monterey was by far my favorite. Most beautiful views! So much to do ---eat, shop, whale watching, eat some more, drive, see the seals and sea lions. One of my favorite bucket list places to date!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Beautiful Place", "Monterey is truly a unique place to go and explore nature! It has breathe taking views of the ocean and sea life! An awesome sunset a place to relax and feel at peace!"], ["Reviewed September 6, 2017", 4.0, "Large with a wide variety of displays", "My favorite is always the octopus - but I also end up feeling sorry for them since they are obviously so intelligent. The jellies are a crowd favorite and the lighting is dramatic. And the large tanks with many different species are also interesting.\n\nThere are several displays for children, including otters.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Beautiful!!!", "It was an unusually hot weekend in Monterey over Labor Day. Despite that, it was a beautiful day on the bay. Especially like walking along the rec trail."], ["Reviewed September 6, 2017", 5.0, "One of the more beautiful places to be.", "Been here hundreds of times and never get tired of it. Its great anytime of the year and when you can be here when the surf is strong the waves crashing on the rocks its spectacular."], ["Reviewed September 5, 2017", 5.0, "Beautiful coast", "The cost line is spectacular. Lots to do and see in the area. Having a car is essential. some of the beach are not so accessible."], ["Reviewed September 4, 2017", 5.0, "Whales!", "Go early in the morning. Walk or park south of the aquarium. They are close in, but bring binos if you have them. We saw several."], ["Reviewed September 3, 2017", 5.0, "Great view", "Visited Monterey Bay enjoying the beautiful view of the coast and the boats on the water. It was very pleasant to walk around."], ["Reviewed September 2, 2017", 4.0, "Stunning Views", "Finished off a long holiday here. Great choice, as the views and the people are fantastic. We only spent 2 days, but could have done with longer!"], ["Reviewed September 1, 2017", 5.0, "Great View!", "Great View! I walked on the beach while the family was shopping. I enjoyed the water! After the family finished shopping we went to Bubba Gumps for more shopping and dinner."], ["Reviewed August 28, 2017", 4.0, "Scenic", "Lovely place to drive around and check out the views. There are some beach areas but I did not find them to be that great. The vistas of the bay however are awesome."], ["Reviewed August 28, 2017", 5.0, "seals and otters", "an excellent location to watch and listen to wildlife. We did not see whales this time int he bay but we have in the past"], ["Reviewed August 28, 2017", 3.0, "Foggy", "So we were there the week of 8/21 to 8/26. It was foggy everyday. If you drive North to Santa Cruz, it was clear and beautiful. I talked to a local and he said it gets foggy and stays foggy all day around this time of year. We drove to Big Sur and it was super foggy there also. It was a great trip but you could see the Bay through the foggy that there all day.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Worth visiting", "The view of the bay and Pacific Ocean was very beautiful. You will see some wildlife like seals and otters occasionally. The Cannery Row and the Monterey Bay aquarium are worth visiting too."], ["Reviewed August 27, 2017", 5.0, "Carole", "We go to every aquarium available on our travels, & this is the very best by far. Beautiful, educational, diverse...just too expensive (more every year), even w/AAA discount!"], ["Reviewed August 25, 2017", 5.0, "Views", "Not a bad view to be had anywhere along the coast..be sure to watch for sea lions, seals and otters."], ["Reviewed August 25, 2017", 5.0, "Nice small town", "Nice town with lots of stuff to do for people of all ages. We went for whale watching and the 17 mile drive, both was amazing."], ["Reviewed August 22, 2017", 5.0, "Great Place For Picnic", "Brought our own picnic lunch for a picnic setting like no other! Best at Lovers Point Park. Can be a little cool even in the middle of the summer even at noon. So bring a jacket just in case and don't forget your camera to photograph the sea otters frolicking in the bay!\nShow less"], ["Reviewed August 21, 2017", 5.0, "a perfect adjunct to the aquarium", "A lovely place to walk along the coast line spotting sea otters and sea lions, The views are superb. Ps. keep alert for the selfish halfwits that cycle at lunatic speeds on the footpaths. I am surprised that there are not more accidents."], ["Reviewed August 14, 2017", 5.0, "Beautiful with Lots to Do", "Lots to do in Monterey from museums and the aquarium to riding the red trail and shopping. Everyone should visit this historical place"], ["Reviewed August 14, 2017", 4.0, "Great diversity in scenery and lots to do", "Loved visiting Monterey Bay and will definitely be back again. May favorite was Lover's Point Beach - it was protected from the wind, not too busy and had lots of character."], ["Reviewed August 12, 2017", 5.0, "Plenty to See and Do", "This magical deep-water bay has an abundance of marine life, much of which is available to shoreline observers. Whales and various marine mammals are in abundance and one can observe sea otters and seals and sea lions up close from the various wharves or ocean front trails (paved for bicycles and walkers). SCUBA divers from around the world find the coldwater diving superb. There is whale watching cruises, deep sea fishing, kayaking, and stand-up paddleboarding for those who want adventure.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Very nice", "Go to Cannery Row. It is a street full of stores, restaurants and nice hotel. There is also an aquarium that is worth the visit"], ["Reviewed August 10, 2017", 5.0, "Day trip", "Had a lovely day walking around the bay with my husband and 6 year old son loads of places to eat and buy soviners"], ["Reviewed August 9, 2017", 5.0, "sea life is amazing", "Lots of sea life to be seen off the piers. Sea lions, otters, star and jelly fish. along with lots of birds"], ["Reviewed August 9, 2017", 5.0, "Beautiful area", "Already planning a return trip So much more to see and do. Two days is not enough Want to visit the Aquarium"], ["Reviewed August 8, 2017", 4.0, "50th bibirthday", "Lots of fun. Definitely will go again. Must in my book. Colton inn, Chris's whale watching, cannary row. The beaches and parks a must see. Bucket list...check"], ["Reviewed August 8, 2017", 5.0, "Amazing", "The Monterey Coast is one of the most beautiful places in the world! When you take this trip don't forget your camera! It is amazingly beautiful!"], ["Reviewed August 8, 2017", 5.0, "Monterey is fabulous!!", "I live in Monterey! And think this is a fantastic place to live and visit. The big advice for those not familiar with the California Central Coast, is that our Summer is pretty cool! Bring layers!\nThe coast is absolutely beautiful. For nature lovers this is paradise. So much to see and do: golf, hiking, biking, kayaking, diving. Not to mention wine tasting and eating.\nI would highly recommend putting Monterey in your travel plans.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Gorgeous vews everywhere you look", "We never get tired of visiting the coastline here. It's always different depending on the weather and time of day. Just beautiful."], ["Reviewed August 5, 2017", 5.0, "Beautiful bag and perfect for whale watching!", "Book a whale watching tour. We were not convinced but took a chance and saw blue whales, hump backed whales, dolphins, otters and porpoises. Beautiful."], ["Reviewed August 4, 2017", 5.0, "Beautiful place", "My husband and I came her for a few days. Peaceful, slow pace place. Loved the Ocean. There are so many things to do here. We will definitely come back!"], ["Reviewed August 4, 2017", 5.0, "Loved seeing this in person.", "Very beautiful place and picturesque for a family vacation. Beautiful weather in July. Sea life is abundant."], ["Reviewed August 1, 2017", 5.0, "A lovely afternoon out!", "The bay is very pretty and there's lots to see along the way!\n\nWe headed down to the bay and decided to hire a tandem type bike for 5 of us. (2 adults 1 young teen and 2 under 10)\nWe peddled up the bay to Lovers Point and stopped there to take pictures and have an ice cream.\nI'd defiantly recommend doing this as we did have fun. It is only a couple of miles however is a good cycle with a steady uphill gradient. There are other points on the bay where you can hire bikes, all the same company but you must return your bike to the office you picked it up from so you are tied to getting it back there and if you stop your charged for the hours you use it. There's lots to see so we obviously did stop to sight see. The bike was changed at $35 am hour and time quickly passes when your having fun as they say.\nShow less"], ["Reviewed August 1, 2017", 5.0, "great place to visit", "Apart from the mist that rolls in from time to time during the day the place is lovely and good for families and children if a little expensive"], ["Reviewed July 31, 2017", 5.0, "Lovely place!", "After road tripping from Las Vegas, through Yosemite and via San Francisco, we were glad to reach the fresh sea air of Monterey. Lovely little town, lots of places to eat. Clean beaches etc. Lots of bird wildlife and of course the seals basking on the rocks.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Beautiful place", "This is a really beautiful place to visit . The sea is very spectacular to behold. It is great place to spend time and have an enjoyable day."], ["Reviewed July 29, 2017", 5.0, "A highlight of our California trip", "My wife and I visited from the UK and drove from SF to LA. We stayed in Monterey for 2 days and we loved it. Great sea life, beautiful coastal walking path, historic Fisherman's Wharf and Cannery Row Wish we could have stayed a bit longer.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Welcome change from the hustle and bustle of the big cities.", "Breathtaking coastline. Historic township with a lovely atmosphere. Elephant seal rookery nearby. Highly recommend."], ["Reviewed July 28, 2017", 5.0, "so pretty", "This place has great views of the ocean. We stopped here along our Highway 1 coastal drive. very very pretty"], ["Reviewed July 26, 2017", 5.0, "Beautiful, love this place", "What can I say, the whole of Monterey is just lovely, the Wharf, the loveliest beaches with white sand, and driving routes that take your breath away."], ["Reviewed July 24, 2017", 5.0, "Live this place", "Love walking here had so much fun love coming here and visiting this place lots to do. Gets a little chilly when you stay later in the day when the fog rolls in to but sunny day beautiful to walk all over"], ["Reviewed July 23, 2017", 5.0, "Balke", "A perfect place to spend time outdoors. The beautiful trails and sights cost nothing and are simply gorgeous. You can spend days outdoors walking."], ["Reviewed July 22, 2017", 5.0, "Heaven on Earth", "I absolutely love Monterey. The weather is perfect, the people are friendly, the food is fantastic, the beach is beautiful, the scenery is incredible...just go! You'll love it."], ["Reviewed July 21, 2017", 5.0, "Wonderful place to live and sight see", "The Bay is just beautiful and also world renowned. Even in Beijing, I hear people talking about Monterey Bay. The weather was a bit cold for late June but temps were pleasant during the day but chili at night. There are so many things to see especially the Monterey Bay Aquarium. The drive, houses, some beaches, stores and restaurants make the Bay an awesome place to be.\nShow less"], ["Reviewed July 21, 2017", 5.0, "What a beautiful spot!", "We were thinking of going to Big Sur ... until a mud slide put the kibosh on our plans. No worries ... Monterey, and Monterey Bay in particular, were beautiful! There were many spots around the bay where one could stop and enjoy the views and other activities. Our favorite was Lover's Point in Pacific Grove.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Nice place to visit", "Just spent last weekend in Monterey and we had a good time outdoors. My wife spent some time paddling and I spent some time biking. The weather as coastal in California is a little bit foggy but the views were amazing.\nMonterey has many places to visit and enjoy\nShow less"], ["Reviewed July 20, 2017", 5.0, "It is soooooo beautiful. take a walk at evening time. it is really breathtaking!", "All of Monterrey is lovely but take a walk along this path. It is so relaxing and really worth doing late evening."], ["Reviewed July 19, 2017", 5.0, "Monterey Bay!", "Monterey Bay never disappoints! This is still an international destination based on the numerous languages I heard being spoken! I live in the valley and it's always a great place to visit after too many days of 100+ degrees. The bay is a beautiful place to visit anytime of the year, it doesn't just have to be summer.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Worth a visit", "Had a few hours to spend here while on a recent holiday. Cracking views of the harbour, boats and seals basking in the sunshine. Worth a dander around with lots to see and do."], ["Reviewed July 16, 2017", 5.0, "A Chosen Spot!", "Monterey Bay has to be one of the most beautiful places in California. The dramatic Pacific Ocean full of aquatic wildlife provides a wonderful backdrop to the unspoiled Del Monte Forest and the quaint town of Monterey offer whatever you desire for the entire family. Whale watching, otters and seals, kayaking and scuba diving, world-class golf, shopping, comfortable lodging, and fine dining all are available in this chosen spot on earth. Monterey also claims one of the best aquariums in the world with numerous exhibits catering to both adults and children. Whether you stay a day or a week, you will not be disappointed.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Beautiful", "If you want excellent wildlife viewing, beautiful scenery, great food and a wonderful family vacation, go to Monterey. Go to the Aquarium, stay close to Cannery Row,, take the 17 mile Drive, Meander down the coast, visit several local restaurants and just enjoy the beauty of this area.\nShow less"], ["Reviewed July 14, 2017", 4.0, "For the nature lovers", "Monterey Bay is a beautiful area to stroll and relax. As a tourist with only one day in the area, we had lunch in the downtown area, walked the boardwalk/fisherman's wharf, and walked our way along the water until we reached the aquarium.\n\nAlong the way, we made a slight detour off onto some sort of jetty or walkway out into the ocean where tons of sea lions could be seen lounging about just metres away! We also spotted an otter swimming about. Even if we had not been able to see any wildlife, the picturesque ocean view is worth the stop. It would be a lovely place to kayak if we had the time, as some others were doing. There are also many scuba divers in the area. The area is beautiful and pristine, and offers lots for both active visitors to do, and people who just want to soak in the views.\nShow less"], ["Reviewed July 13, 2017", 4.0, "Great wildlife", "The best part is the abundance of wildlife you can see from the shore including seals and otters. Whales often get close enough."], ["Reviewed July 12, 2017", 5.0, "One of the nicest cities in the US", "Monterey is one of the best cities in the USA that we have visited. It has perfect location with ocean on one side and mountains on the other side, and it is all green."], ["Reviewed July 11, 2017", 5.0, "Spectatcular", "Worth the drive and time to stop and take in the views. Take Ocean drive into Pacific Grove for the views. We visited in July and found it not crowded and nice place for pictures and exploring."], ["Reviewed July 10, 2017", 5.0, "The ocean is everywhere", "The Monterey area is perfect for everyone!\nIf you are a couple it is fomantic, beautiful places to stay, the best food, glorious beaches, great music and amazing hikes in the area or walks on the beaches. Layer up with clothing, it's mostly on the cool side, especially in the evening!\nIf you are a family with young children or teens be sure to bring grandpa and grandma too, there is much to do for everyone! There are beautiful parks and musuems; a must visit is The Monterey Bay Aquarium There are wonderful beaches everywhere; build those sand castles and create the best memories together\nShow less"], ["Reviewed July 10, 2017", 5.0, "A must visit location", "We spent some time in Monterey as we combined work with a few days sightseeing. The bay is beautiful. We walked for many miles over the beach north of Monterey where we saw many vultures and a sparrow hawk and south of the aquarium. The coast line there is spectacular, with many seals /sea lions on the rocks and in the water. It can be foggy at times and best to walk on a clear day.\n\nShow less"], ["Reviewed July 10, 2017", 4.0, "Sweeping views", "The sweeping views of the bay are marvelous. I saw a while give a few blows from shore. The trees frame your pics beautifully. Lots of great flowers too. Walk from town to town on the trail, stopping off to shop and eat."], ["Reviewed July 10, 2017", 5.0, "Gorgeous area of California", "This area is so beautiful there are many, many photo ops to take advantage of and all your photos will make you dream of going back asap! The cliffs and Pacific are so breathtaking, especially the drive to the Big Sur Area. Be sure to photograph the bridge and surrounding areas.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Pick Up Jaw from the Ground, Again", "This area is gorgeous. Chilly, for the most part, and nights can get cold. However, if you like it warm: just get past Salinas between May and October, 20 miles inland, and you'll cook nicely. Many sea otters; sea lions; birds; coastal mountain lions (you'll be lucky to see anything more than cat tracks in the sand) and international as well as stateside tourists. Dali Museum; Monterey Aquarium; the wharf; the town: all wonderful. Expect some hustle/bustle from the Frisco local tourists, as green lights mean \"go\" despite tourists spotting parking spots and local attractions distracting their driving focus... You could see humpback whales; dolphins; sea otters; sea lions; beach birds; crabs; even mountain lions (closer to Asilomar). Many free parking spots if you don't mind walking near some amazing scenery! TONS of seafood restaurants, and tourist attractions. Do yourself a favor and rent a kayak, and make sure you shower after wearing a rented wetsuit... Youths will gasp at many of the free, amazing sites in this location. Money adorns this locale, and it can be fascinating to see how it is spent here. Much free parking in surrounding areas, just 1/4 of a mile from tourist spots. Walking from and to them is enriching for your journey!\nShow less"], ["Reviewed July 10, 2017", 5.0, "dramtically beatutiful, weatherwise and Scenic wise", "A beautiful drive down the coastline & weather was really mild. Very little traffic going down to 17 mile drive in Pebble Beach"], ["Reviewed July 9, 2017", 5.0, "Vacation", "Our son is stationed in Monterey and we stayed for a week. The Bay is breathtaking! The town is so charming and full of history. It is great for walking, bike riding and it is very pet friendly. The cool ocean breezes keep the temperatures around a comfortable 65 degrees. A great place for family or couples. It has lots of places to visit, eat and shop.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Beautiful Monterey Bay", "One of the highlights of a wonderful Californian road trip.\nWe went whale watching on board the Monterey whale watching catamaran and were not disappointed seeing many dolphins,fur seals, sea birds inc Albatross and yes of course many whales.\nMonterey Bay is simply beautiful with a fabulous spectacular coastline and so many top class restaurants and bars in the harbour and fisherman wharf to recharge your batteries after a gruelling 4 he whale watching trip, one tip \" Take your sea sickness pills beforehand as we did as it can get a little rough out there\"!.\nShow less"], ["Reviewed July 8, 2017", 5.0, "On of the best parts of the California Coast", "Monterey is becoming very commercialized and swamped in tourists, but it is indeed a breathtakingly beautiful stretch of the California coasts with lots of history thrown in. A must see for visitors to the West Coast."], ["Reviewed July 8, 2017", 5.0, "Enjoy the sun and the sea", "Monterey Bay is always great to visit when the weather is warm to hot. It doesnt get any better than that. There many things you can do, enjoy the little city, the fishermen wharf and the Aquarium is so amazing!!\nIf you have time i recommend taking highway 1 down from San Francisco all the way down to Monterey bay. Its an amazing ride under the nice sun and many small stops you can make to take up the west coast view\nShow less"], ["Reviewed July 7, 2017", 4.0, "Carmel's Sister", "While most people find the quaint and charm enclave of Carmel by the Sea to the big attraction, a trip to Monterey Bay can have a host of wonderful points of interest, the Wharf, scuba diving, Aquarium, former Ft Ord and its golf courses, shopping, Naval Post Graduate School, Defense Language Institute, and tons of dining.\nDepending on what you seek, shopping second hand, tourist trinkets, or more upscale clothing, you can find plenty to shop. There is one very MOST do breakfasts or treat stop though, the Paris Bakery. See it out, wait in the lines and enjoy treats worth the wait, there are always lines.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Tranquil paradise", "The Monterey Bay and surrounding areas are so tranquil and peaceful. They really help you to see the amazing natural beauty California has to offer. Such a great vacation for family, kids, couples, and business trips."], ["Reviewed July 5, 2017", 5.0, "Monterey Bay", "Monterey Bay was a very beautiful place to see. You will definitely need a camera for this site. It is very romantic."], ["Reviewed July 5, 2017", 5.0, "Tons to do!", "We visit Monterey pretty regularly for four to five days at a time (work conference). Never run out of things to do, eat or enjoy. Great for family trips or couples. Lots of terrific food, from romantic fine dining (true fine dining, not pretend) to casual and family friendly. There is a TON of great food in Monterey to be enjoyed at casual restaurants and out of the way places that might be a little more expensive, but not fancy. No need to pay for pricey meals on the wharf or Cannery Row. Do your homework.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Great 5 night trip with awesome weather", "So many places to see and things to do here. Cannery row, awesome restaurants, ocean sports and beaches with temps in the 60's. Not a long drive to many day trips like Frisco or Big Sur"], ["Reviewed July 4, 2017", 5.0, "Don't drive through without stopping in!", "Stop by and stay a night or two in Monterey while driving down Highway 1. Lovely area. Lots of shops and restaurants. The beaches and waterfront dining locations cannot be beat."], ["Reviewed July 3, 2017", 5.0, "Breathtaking!", "Went to see the old cypress tree, but found out 2 weeks ago 1/2 had broken off in a storm. Still beautiful! Wonderful docent led nature walks."], ["Reviewed July 2, 2017", 4.0, "Beautiful area - find the secluded spots", "Monterey Bay is not just one area, but is the sum of areas around Monterey. We found the most beautiful areas to be around the ocean, especially along the 17 mile drive and Point Lobos State Park."], ["Reviewed July 1, 2017", 5.0, "Always Love Monterey", "I can say Monterey is my beloved place after I have been many places in the U.S..... I have been there already 4 times in Monterey and still wanna visit again. I love the old historical areas and old buildings...and Monterey is a good combination of seaside...old time and new tourism business... I love those beautiful houses with candy colors...and have a good walk along Ocean View Blvd from Monterey Bay Aquarium to Lover's Point in Pacific Grove...or drive along the coast starts from American Tin Factory Outlets-Ocean View Blue where is the beginning of Pacific Grove area and just drive and enjoy nice view of Ocean and beautiful houses...will see Lover's Point beach, Pacific Grove Marine Gardens park, Golf Links, then the Ocean View Blvd will turn to be Sunset Drive...then the ocean view drive will end somewhere at Asilomar Beach.... evening time is the great.. Don't miss !!\nShow less"], ["Reviewed June 30, 2017", 5.0, "Fantastic", "Everything about Monterey Bay was fantastic. We went down to the Wharf to buy seafood and we met a local, Fernando, who took us to see two giant sea lions, Godzilla and Brutus, resting under the pier. Never would have seen them. The views are beautiful and the local atmosphere was intoxicating. Did not want to leave.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Breathtaking views", "Beautiful ocean views and plenty of paved paths to walk along side the ocean. Incredible place to visit during spring and summer to watch the humpback whales, killer whales, gray and blue whales, seals and dolphins feed on the anchovies in the bay."], ["Reviewed June 23, 2017", 5.0, "What a neat place to come....", "... we will need to come back for a few days.\n\nWe looked around Pebble Beach and 17 Mile drive which was well worth the 10.25 fee to drive around then followed the coast road up to the road closure for some truly spectacular ocean views. Finally we went up the Carmel Valley for some wine tasting.\n\nOnly scratched the surface and to look properly you would need several days.\nShow less"], ["Reviewed June 20, 2017", 4.0, "Awesome views", "We got into Monterey Bay by way of Half Moon Bay and the drive in was spectacular, absolutely beautiful."], ["Reviewed June 19, 2017", 4.0, "Have a Whale of a time", "An ideal location for Whale watching, you maybe lucky to see them from the coast like we did, there are also an abundance of sea otters and sea lions. A magical place to visit."], ["Reviewed June 19, 2017", 5.0, "Monterey is always beautiful!", "Monterey has so much history and so much life! It is always beautiful and there is so much to do. There is the aquarium, or you could rent bikes, or just go walking around, visit the shops, walk out on the pier, go whale watching, and much more!\n\nIn my opinion, the best time to go is in fall. I have found through frequent visits that summer the weather can be foggier or not as clear and calm conditions whereas in the fall I found more beautiful clear conditions. This is not to say it is bad in the summer, it still is great to go in summer. But whenever one visits Monterey, no matter what time of year, it is always best to dress in layers.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Loris W. \" beating the heat\"", "Being from Hawaii I need to rejuvenate by the ocean every so often. Monterey is a wonderful place to do that. It is not as hectic as San Francisco and the ocean views are spectacular.\nThere are a lot of spots to stop and park by the side of the road to view the waves breaking against the rocks. So many little tide pools two look into. It is always an enjoyable place to be and the weather is always.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Great place to hang out", "A fabulous place to visit for the picnic lovers, one should not miss the 17 mile drive on Pebble beach and also Carmel by the Bay. The view of Monterey Bay is the best from point 1 of the drive"], ["Reviewed June 12, 2017", 5.0, "Pretty", "Beautiful spot. Loved watching the seals play in the water. Great walking/running/biking path from downtown Monterey to Lovers point."], ["Reviewed June 11, 2017", 5.0, "Beautiful Place to go", "Go watch the Sea Lions on the rocks in the Ocean, An amazing Place to visit with the family. Good family outing"], ["Reviewed June 10, 2017", 5.0, "Family visit", "We visited Monterey Bay while staying in Pacific Grove. We walked to the Monterey Bay aquarium. We also went whale watching with Monterey Bay Whale Watchers. Nice area to walk around and look at sea lions and Cannery Row. Our kids were 7 and 10 and didn't complain about the walking. So much to see and do along the way. A little deer also walked out from a grassy area near us.\nShow less"], ["Reviewed June 9, 2017", 3.0, "Such a serene place...", "This place is amazing... It offers such a great view of blue sea and white sand... I wish i could see this view forever... It is a must visit place... Do not Miss it... I would definitely recommend it to everyone living in or visiting Cali...\nShow less"], ["Reviewed June 9, 2017", 5.0, "beautiful scenery!!!", "if you're traveling along the coast in Northern Cali you must stop by and check out this spot! there are lots of awesome places along the coast of Cali but I like this spot...not crowded at all like the beaches get the closer one gets to the LA area...highly recommended\nShow less"], ["Reviewed June 6, 2017", 5.0, "PLEASE GET AWAY FROM THE GD CITY !!! THIS IS GODS COUNTRY !!", "Just go along the coast...Monterey, Carmel, The 17 Mile Cruise, Big Sur ( check on what's drivable)...come on...get away !! OH ...don't stop there, take the weekend ..wow are there some great dinners to be had as well!!!"], ["Reviewed June 5, 2017", 5.0, "Anniversary trip", "What's not to love!! The sea lions and the Otters chattering was what we awoke to! The magnificent landscapes.... beautiful flowers, walking path for miles right along the coast... lovers point is a personal favorite spot of mine...\nThis area is more dog friendly then anyplace I've traveled to yet!\nShow less"], ["Reviewed June 4, 2017", 4.0, "Very nice", "Just stop the car, take some pics, if the weather is ok you will take beautiful pics. I liked it and took good picks"], ["Reviewed June 3, 2017", 5.0, "Beautiful View", "Beautiful bay with a variety of marine life, otters, seals, and water fowl. Worth driving down and making stops. Nice tide pools brimming with sea life and easily accessible."], ["Reviewed June 2, 2017", 4.0, "Nice place to visit but don't want to live here!", "Explored all over Monterey last 5 days a tourist town with a military population! City motto should be! \"You can't get there from here!\" The most screwed up streets in the country!"], ["Reviewed May 31, 2017", 5.0, "Very beautiful and quaint location", "A beautiful and quaint location. One can walk down the Cannery Row or use the free shuttle service to get the local experience. It offers a lot of water activities which one must do. Overall a beautiful town to simply relax and spend the day with family.\nShow less"], ["Reviewed May 31, 2017", 5.0, "GREAT place!", "WHAT A BEAUTIFUL, fun place! TONS of sea lions to watch. Great fun, place! (We went to Carmel, but couldn't find a place to park, so we came here instead. SO glad we did!)"], ["Reviewed May 31, 2017", 3.0, "Sleepy town", "Scenic coastal views but not much else going for it. One of those towns you didn't know why it found itself on your checklist. I'm glad I saw it and now I can move on to visit nicer towns."], ["Reviewed May 31, 2017", 4.0, "Beautiful views", "This is why we came to Monterey - to see the Bay and the magnificent views. And we weren't disappointed!"], ["Reviewed May 30, 2017", 5.0, "Beautiful area (but cool!)", "We went to the Monterey area to visit our son who is stationed nearby. We were not disappointed in the beauty of the area but found the temperatures a little cool for the end of May. Although we researched it first and knew what to expect, coming from Maine we were hoping for a break from the wet, cold spring we're having.\n\nIn addition to being a very walkable area, driving is a breeze in Monterey and Pacific Grove. Not a lot of traffic and easy to navigate.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Beautiful part of the country", "The whole area is beautiful and scenic. There are so many things to see from seals and sea lions to possibly whales, birds, even people watching is more interesting here."], ["Reviewed May 28, 2017", 5.0, "Road trip must see", "We were on a 17 day California road trip. From Monterey, which is very cool, you can easily also see Carmel and Big Sur. Plan enough time and see it all. This Ohio boy loved it."], ["Reviewed May 25, 2017", 5.0, "A great layback place", "The food in the area is very good and the aquarium for its size is about the best we have been to. The grandkids love it. hanging out at the beach its a great place for kids to swim and explore the rocks"], ["Reviewed May 24, 2017", 5.0, "Beautiful coastline", "The cypress trees and beautiful colors in the water make this coastline one of a kind. A must see if you're coming to visit California!"], ["Reviewed May 23, 2017", 5.0, "Beautiful location", "Very picturesque and a place you could say \"I could live here\". A homely feel and friendly people add to this stunning ly attractive place by the sea, where you can watch the wildlife and soak up the tranquility"], ["Reviewed May 23, 2017", 5.0, "Beautiful! Great for walking, hiking, or cruising!", "Lovely area to just stroll along or hop in the car and just cruise around. Spotted so much wildilfe - seals, otters etc....Very beautiful and peaceful."], ["Reviewed May 22, 2017", 5.0, "A Stroll with a View", "People travel worldwide to paint, photograph, and write about the amazing central California coast. It is one of the most beautiful places to be behold. Our family is blessed to have grown up close enough to make this a regular vacation spot.\nBring the camera. Don't forget the binoculars. You may want to kayak early in the morning. You may want to bring your canvas and paint supplies. There is a whole lot to see and do. That's why we love #MontereyBay\nShow less"], ["Reviewed May 22, 2017", 5.0, "California Costal dreaming", "Beautiful does not describe this pristine coastline. Yes there are many attractions in Monterey, but kick back, put the top down and cruise this coast. Look for whales, jumping seals or seals poking up looking at you. Lots of protected wildlife has allowed for all of us to enjoy at this natural habitat of many animals both sea and land. Bring your camera or get the zoom ready on your phone, you'll want those stops to be memorialized because you just can't believe you are on the Monterey Coast.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Great option for a short visit", "Had a couple of days after a work conference and stayed in Monterey instead of San Francisco. Great option. Much less crowded. Many good restaurants and shopping options. Even went to Carmel for a retail experience. Consider it."]]}}