{"Moonstone Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Moonstone Beach", "url": "/Attraction_Review-g32148-d104595-Reviews-Moonstone_Beach-Cambria_San_Luis_Obispo_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/06/55/19/looking-west.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1443"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Cambria", "addressRegion": "California", "postalCode": "93452", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Girlfriend Get a way birthday trip", "Every day is a day for a walk along the boardwalk pathway at Moonstone Beach. Lots of bunny rabbits and squirrels love to greet you as you stroll along the path. You can see the seals out on the rocks and enjoy lots of friendly people along the walk. This is a place you must visit while in Cambria!\nShow less"], ["Reviewed 2 days ago", 4.0, "A beautiful central coase beach. Ideal for early morning and sunset strolls", "A beautiful central coast beach. Ideal for early morning and sunset strolls. No dogs allowed on the beach. :-("], ["Reviewed 4 days ago", 5.0, "Stunning beach...great walking path!", "Probably one of the most beautiful places to see a sunset. We could see lots of cars parked along the coast in the early evening as people took in the stunning views. Great wooded walking path, benches & places overlooking the ocean. Tide pools to explore & enjoy. A must see in Cambria. Take jackets (as it can get very windy & chilly) & a camera is a must!\nShow less"], ["Reviewed 5 days ago", 5.0, "Moonstone and sea glass hunting fun!", "The beach is filled with bright stones, pebbles and some sea glass in abundance of colors. Great spot to pass time, do mindless activity and just relax, gorgeous sunrise and sunsets. See for yourself. It's worth the drive."], ["Reviewed 1 week ago", 5.0, "Not much to say other than I can’t wait to go back", "I loved it it was beautiful super quiet home away from home 💖😍💯If all you want to hear our beach waves and birds this is the place for you I will continue to go back as long as I can"], ["Reviewed 1 week ago", 4.0, "Nice beach", "Moonstone beach was just across the road from where we stayed. It was easily accessible from the town and an has a good walking path all the way along the coastline in this part of Cambria."], ["Reviewed 1 week ago", 5.0, "Beautiful Beach", "Moonstone Beach is a must if you are visiting the Cambria area. The boardwalk path offers some spectacular views. We visit Cambria at least once a year and never miss a chance to walk Moonstone while there."], ["Reviewed 1 week ago", 5.0, "Celebration of Birthday", "After having Brunch at the Moonstone Grill walked on the wooden Boardwalk that goes along the cliff. Would recommend visiting this quite and peaceful beach!"], ["Reviewed 2 weeks ago", 5.0, "Beautiful!", "We love Moonstone Beach! We get to see some ocean animals in a relatively quiet area. We had three days of sunshine and one very fogged in day. The rocks in the area and in the water create a beautiful scene. There is a wooden Boardwalk that goes along the cliff with some benches to sit on.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Lovely beach combing", "Such a lovely beach. Sort of rugged in its own way with drift wood logs and trees. A perfect spot to watch the sun set. Lots of parking on the street and broadwalkes on the road side to stroll along. Ther3 are also some benches. A great plac3 to chat to fellow travellers\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Such a Beautiful Beach", "Moonstone beach is one of my favorite beaches. It has a very peaceful vibe. It's very clean and it's not crowded."], ["Reviewed 3 weeks ago", 5.0, "Enjoy the Pacific shore and beach combing", "Plenty of wide clean sandy beach to walk, run, explore and search for rocks, shells, \"moonstone\" and anything the ocean has delivered. There is also a well maintained wooden walkway just above the beach to walk or run. Dogs are welcome. Wonderful sunsets."], ["Reviewed 3 weeks ago", 4.0, "Beautiful sunset", "It is hard to rate a beach in the middle of the winter...but we came here to see the sunset and we got a beautiful one!"], ["Reviewed 3 weeks ago", 5.0, "Lovely", "Lovely for taking long walks, observing crashing waves and starry nights. Long boardwalk makes walking easy and very pleasant. Little ground squirrels and birds of all sorts will greet you."], ["Reviewed 3 weeks ago", 4.0, "All the colors of the rainbow", "Park near Cambria, climb down the shore side, and settle in for a blast culling rocks. You can sort for colors, sizes, white moonstones, or a mix. You can choose tiny or large, round or flat. WARNING : flies will try to carry you away so be sure to cover yourself with repellant. Bring water to drink. Bring a canvas bag to collect your treasures cause your pockets are too small.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Boardwalk overlooking Moonstone Beach", "The boardwalk is most inviting for a long stroll and rewards the traveler with wonderful views of the Pacific Ocean and serene, uncrowded beaches."], ["Reviewed 4 weeks ago", 4.0, "Don't expect to lay in the sand...", "Don't get me wrong - this beach is incredibly beautiful. The waves are impressive, the vistas breathtaking, and the 'boardwalk' along the upper cliffs of the beach offers unexpected twists and turns. The big green lawn with picnic tables is a perfect stop to set up a blanket, light up your legal weed, and watch the sun set.\n\nThe beach is covered in tiny pebbles - not too ideal for walking on and certainly not good for lounging on a towel in the sunshine.\n\nThe main drag of Cambria is about a 5 minute drive - I do not recommend walking to this beach from town.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Beautiful!", "The beach is beautiful. People really take care of this beach, no trash, super clean as it should be. Quiet, with views for miles, cool crisp breeze and the sound of waves crashing against the shore, LOVELY!!!"], ["Reviewed January 21, 2018", 4.0, "Beautiful Beach", "This beach is absolutely stunning! It is really fun to walk the trail above the beach and watch the surfers/sunset. The only down side was not being able to bring our dog on the beach. I completely understand why, but it would be nice."], ["Reviewed January 19, 2018", 5.0, "Moonstone Beach Affords Romantic Get Away in Winter", "Moonstone beach is in the little town of Cambria, California. It has a nice board walk so one can walk the entire beach and watch the wild rolling surf below. In the winter when we visited, you needed jackets and hats because of the wind but the beach is right in town and a nice way to get out and get some exercise. We chose a lodge right on the beach with a fireplace. It was a cozy way to spend a long weekend. There are good restaurants at either end of the beach.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Enjoyable few days", "Loved visiting the Moonstone Beach area for a few days. Stayed at the Pelican Inn & Suites and enjoyed it. Would recommend that you stay at one of the hotels right there on Moonstone Beach Drive. Give yourself a stay of at least 3 or 4 full days so that you can thoroughly enjoy the area and the shoppes on Main Street.\nShow less"], ["Reviewed January 15, 2018", 5.0, "One of the most beautiful places in the world", "We have been to Moonstone beach atlas 50 times. Every time is different and wonderful and the sea is always intriguing and different depending on what time of year you go.\nEveryone loves the pictures I take of the beach and cliffs around it and want to visit as well.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Beautiful Beach on the central coast!", "This is one of my favorite places to visit. It's not busy. You can see the Seal Rookery north of Cambria in San Simeon. Just follow the signs. Also Hearst Castle is in San Simeon. Sebastians Store, at Hearst Bay/Pier has tremendous sandwiches. Stop in at Manta Rey for dinner - You WILL NOT be disappointed!\nShow less"], ["Reviewed January 10, 2018", 5.0, "Dolphins", "From the boardwalk you can see dolphins feeding in the morning. We walked down to the beach to see them even better."], ["Reviewed January 9, 2018", 5.0, "Love the name and watching the seals and walrus in the tidepool areas", "great walking on the boardwalk above the beach with stairs down to the sand or tidepool areas. So pleasant to walk and enjoy"], ["Reviewed January 8, 2018", 5.0, "Nice beach with great stones to collect or just to relax", "We've been here to relax and walk thru the beach. I was sitting on a rock and enjoyed listening&watching the ocean. During the time I relaxed, friends been collecting several stones and dancing with the waves ;)"], ["Reviewed January 5, 2018", 5.0, "Loved the tide pools", "Took my kids to explore the tide pools. Saw crabs, star fish, hermit crabs. So fun exploring and walking around. Just a beautiful place to visit."], ["Reviewed January 3, 2018", 5.0, "Love Love Love", "My favorite place in California. I spend time here 3 or 4 times a year. Hunt for California Moonstones, jade and agates. Watch the sea birds and just enjoy the sound of the waves."], ["Reviewed December 29, 2017", 5.0, "Spectacular Seashore", "Wonderful rambling boardwalk ... enjoyed by all. Friendly to doggies ( on leash) & wheel chair accessible. As you stroll along watching the surfers, dolphins, whales , sea lions & beachcombers you will also come across a couple of fine eateries. A fun route is to walk the beach in search of moonstones & other treasures. Amazing sunsets, boat ramp & picnic area among the cypress. A must experience!\nShow less"], ["Reviewed December 29, 2017", 5.0, "Beautiful Morning", "Gorgeous area to experience especially on a warm winter day. We drove a little south to Fiscalini Preserve for a beautiful walk on easy trails."], ["Reviewed December 29, 2017", 5.0, "Sunset is an event!", "Seriously, you have to go to the beach at sunset, even if just for the people watching. Everyone comes down, drawn by the views, in pairs, groups, with beverages, or with frisbees."], ["Reviewed December 28, 2017", 5.0, "Great place to stroll, day or night", "The wooden boardwalk parallels the shoreline and there are numerous benches and places to stop along the way to take in the fantastic views of the ocean and beach. Whale sightings are frequent, but it takes patience and luck to spy them in the distance. The otters can also be seen among the elephant kelp. What a treasure of a place.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Christmas Festival", "Had a fantastic time visiting MoonStone Beach and Cambria. Great boardwalk for morning or evening walks and photos!"], ["Reviewed December 20, 2017", 5.0, "I've Never Seen Anything Like It!", "When visiting the lovely Central Coast, Cambria in particular, definitely take a stroll on Moonstone Beach. There is a lengthy boardwalk which runs parallel to the beach which is great for leisure, exercise, or just meditating to the rhythmic sounds of the waves. The real experience, however, is walking on the beach. It is unlike anything I've ever experienced on our beaches in Southern California.\n\nThe beach is full of what are called \"moonstones,\" and they are abundant. We grabbed a bag full to make an indoor planter. In the dry sand/moonstone, it is very soft and your feet sink in nicely. Where it is wet, it is a little harder on the bare feet, but still a pleasurable experience. The kids could have spent hours picking out the rarest looking rocks of all different colors (red, green, purple, etc).\n\nThe beach was relatively empty in mid-December, and not because it was cold. The coast was nice and warm and hardly felt like a week before winter. Of course, in addition to the unique moonstones, the ocean was simply stunning.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Moonstones", "Never heard of this place before but glad I stopped , breathtaking views of the ocean , scenic trails and plenty of moonstones for everyone"], ["Reviewed December 17, 2017", 5.0, "Dreamy and awesome", "This beach was one of the best of our travels. So calm and peaceful...the best part was that this wasn't crowded unlike the other beaches that we had travelled. The view is fantastic from most of the hotel in the moonstone beach..sunset was fantastic. Must visit if you are looking for something calm and quiet\nShow less"], ["Reviewed December 15, 2017", 5.0, "Lovely beach", "A beachcomber's dream, I was able to gather quite a bit for my mixed media art endeavors. A beautiful beach with gorgeous rocks and wide curving shores."], ["Reviewed December 13, 2017", 5.0, "Great Views", "Walking on the boardwalk is a must. Great ocean views and very peaceful. Can be a little crowded at times."], ["Reviewed December 11, 2017", 5.0, "Beach in Winter", "Sandy and smooth beach. Pretty windy but it. Was November so ..... cold water so ok swimming. It is a beach."], ["Reviewed December 11, 2017", 5.0, "The White Water Inn is my calm in the midst of the Thomas Fire.", "Moonstone beach is as serene as it is powerful.\nThe White Water Inn is always welcoming, comfortable and relaxing. They went the extra mile for their customers this trip, in light of the fires. They made the rooms affordable and really understood the plight of those needing to escape the smoke and soot if even for a few days.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Breathtakingly beautiful coastline that you'll come back to year after year...", "Park and take a stroll along this beautiful stretch of coastline where if your lucky you may even find a real \"Moonstone\" to take home!"], ["Reviewed November 28, 2017", 4.0, "Nice beach for a romantic walk", "Moonstone Beach is the must see destination in Cambria. If you love the sea, surf, sea lions and sea otters then you must make some time to visit the beach. There is a nice long boardwalk for your walking enjoyment and there are spots where you can get closer to the water, even if that means getting a little closer to the flies that enjoy sitting on sea weeds.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Heaven", "This is drop-dead gorgeous beach, even the name is romantic. If I lived in Cambria I would be walking this beach every single day. As it was I took several videos to enjoy back home as I remember our fun trip to Cambria."], ["Reviewed November 22, 2017", 5.0, "Wonderful place to walk", "All of us loved the walk by the water. We visited at dusk, and the ocean was a beautiful sight. Surprisingly, it wasn't too crowded."], ["Reviewed November 21, 2017", 5.0, "Beautiful!", "We stayed across the road from the beach, watched the sunset on the rocks and the sea lions in the tidal pools. Gorgeous!"], ["Reviewed November 20, 2017", 5.0, "Moonstone Beach Boardwalk", "Very nice boardwalk trail along the ocean. Nice to walk in the mornings and watch the sunset. A nice place to be away from the crowds."], ["Reviewed November 19, 2017", 5.0, "Bring your binoculars", "Being from S. California, I have been to a lot of beaches. What is so fun about going to northern Calif. beaches is seeing the sea lions and otters in the ocean. So bring your binoculars so you can see them better as they bob up and down out of the surf. The board walk makes for nice morning or evening stroll.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Stunning walk along the beaches", "A well maintained boardwalk follows the beach along sandy, rocky and small cliff areas for a few miles of beautiful pathways. Driving along Moonstone Drive follows the beach; not dissimilar to Highway 1, but less traveled, more up close and personal."], ["Reviewed November 14, 2017", 5.0, "Uncrowded beach", "Stroll along the beach. Feed the seagulls. Look for drift wood and moonstones. Fun relaxing time. Windy and cooled in November"], ["Reviewed November 10, 2017", 5.0, "Exhilarating", "What a beautiful beach. We live at a beach in Southern California and I love going to any beach. But this one has a nice wooden boardwalk if you don’t want to or can’t walk in sand. There are areas to sit and relax, and just watch the waves and wildlife. It’s quite windy but we found it exhilarating. I would definitely recommend checking it out.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Awesome tide pools, great boardwalk", "A beautiful, wild, windswept beach, and it was delightfully deserted when i was there. The boardwalk is a great touch, getting to and from the beach."], ["Reviewed November 9, 2017", 5.0, "Scenic Coastal Drive", "Beautiful and peaceful place to unwind after a hectic trip along Hwy 1 or even after a shopping visit through the quaint town of Cambria. The place is not so crowded that you can leisurely walk and relax as you inhale the fresh ocean breeze."], ["Reviewed November 9, 2017", 4.0, "Beautiful, atmospheric", "Not, it's not a Hawaii or Caribbean beach, but it's not the dramatic, almost unforgiving and stoic beauty of the Oregon coast either, although there are elements of both here. What it is, is a meditative spot for overlooking beautiful surf, a spot for contemplation, a semi-protected cove for a refreshing swim (currents permitting, it can get too rough at times), and a place to marvel and feel lucky we still have places like this left in the world.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great beach in Cambria", "We did a road trip on the One and stopped here for a night---although we were here for less than 24 hours, this was one of my favorite beaches. The sand has very small colorful pebbles in it so it was really unique. The water was too cold to go swimming, but it was very peaceful to take a walk in the morning as there weren't many people around.\nShow less"], ["Reviewed November 9, 2017", 4.0, "A lovely place on Hwy 1", "Moonstone Beach is a lovely and tranquil spot on California's spectacular Hwy 1 on the Pacific shore in Cambria. A great place to visit before or after an excursion through town. An evening walk along the boardwalk at sunset with your dog is magical and makes it easy for those with ambulatory limitations to enjoy. A great starting point, if you're planning to travel north on Hwy. 1 (Elephant Seal beach, Hearst Castle, Ragged Point, etc.)\nShow less"], ["Reviewed November 6, 2017", 5.0, "21st anniversary getaway", "Will keep coming back, it was restful and inspirational, our best beach walks, admired all the stick houses from driftwood and the sunsets. The temperatures were great!"], ["Reviewed November 1, 2017", 4.0, "Great sunset view...", "The food here was very good. The service was a little slow, but in watching our server it looked like he was waiting on tables in all areas of the restaurant and he had to oversee many tables not necessarily close together. We saw a great sunset from our table which was right next to the patio. We could not get a seat on the patio because it was full already. I would definitely return on our next visit west.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Great place for a sunset", "A must to see sunset with a glass of wine. Very clean beach. It was black sand and pebble. Easy access to beach plus lots of raking"], ["Reviewed October 26, 2017", 5.0, "Stunning beach", "Moonstone beach is beautiful, with sounds of the pounding surf surrounding you as you walk on the boardwalk or on the sand. The best time of day is sunset, which is simply spectacular. Be sure to make time to walk the entire boardwalk and also time to go down to the shore.\nShow less"], ["Reviewed October 26, 2017", 4.0, "A pleasant getaway from the husstle of city life", "Wander the boardwalk along the coast and regain a sense of calm and wonder amid natural beauty. From lush greenery to vibrant sea life, even surfing, this area of the California coast offers just the relaxing environment we all need from time to time."], ["Reviewed October 25, 2017", 5.0, "Picture perfect", "A beautiful beach with a boardwalk which takes you right down to the beach. Can be difficult to find parking, but the morning is usually uncrowded."], ["Reviewed October 25, 2017", 3.0, "windy, small beach", "The day i went to this beach it was extremely windy, and I found the beach to be small. That being said, you really don't come to this area for the beach, its all about finding moonstones. We found a few, pleasurable experience, but you wouldn't find me sunbathing here\nShow less"], ["Reviewed October 23, 2017", 4.0, "Boardwalk", "Charming little beach across from motels. The boardwalk that runs the length is a popular stroll and a great place to watch the sunset."], ["Reviewed October 14, 2017", 4.0, "Beach", "Beautiful beach with great ares to walk. Just a very peaceful place. We watched for whales but didn’t see any. Had a great time watching the surfers"], ["Reviewed October 12, 2017", 3.0, "Nice beach", "Moonstone Beach was nice, stopped off along the West Coast as I was driving from LA to San Francisco, in the early evening. Not a lot to do, aside from the novelty of the moonstones (but please don't take things away from this beach, it's really such a shame to detract from a coastline) - it's a pleasant place but not much different from the coastline around Devon where I live in the UK. Perhaps if you're not used to the sea, this would be somewhere to head but I wouldn't go out of my way to visit. It was a nice stop off on a long drive up the coast.\nShow less"], ["Reviewed October 10, 2017", 5.0, "BEACH COMBING AT ITS BEST", "Have been here numerous times over the years and the perfect outlet to go beach combing and enjoy the ocean, tide pools and nature. Great for couples and families alike. There are restaurants/bars at the hotels/motels across the road."], ["Reviewed October 9, 2017", 4.0, "Love this Beach but getting crowded", "This is a small beach. Can be overcast. Lovely beach but getting crowded with tourists. I feel sad cuz people keep Taking every thing off the beach. They are stripping it of its nature."], ["Reviewed October 5, 2017", 5.0, "Just as we remembered", "Moonstone Beach is wonderful, apart from the monstrous seaweed thing covered in flies. There were a dozen Seals and a Sea Otter directly opposite our hotel, Castle Inn, and the place gives off a vibe that can only leave you more relaxed than when you arrived. We were only there one night and chose to go back to the Moonstone Grille which served us well last time. It didn't disappoint. Arrive early to get an outdoor table. One hint, in September the sun sets to the right of the big bush that is opposite the hotel. Take a table to the right of the terrace as you walk out from inside the restaurant for the best view.\n\nA walk along the boards is highly recommended and if you run it's 5km from one end to the other and back\nShow less"], ["Reviewed September 30, 2017", 5.0, "Our private beach", "During our visit the temperature was 80+ everyday and the beach was all but empty. Such is the advantage of off an season visit. We love this beach, it offers fun beach-combing, restrooms and dogs are allowed."], ["Reviewed September 29, 2017", 5.0, "Good Boardwalk", "It is great having a boardwalk right along the seafront - makes for a pleasant walk along by the beach with lots of quirky houses and Inns along the way"], ["Reviewed September 29, 2017", 5.0, "Cool rocks, Cold Water", "This is a very nice place to spend part (or even all) of an afternoon. A lot of interesting rocks to look at and the boardwalk is very nice for a short walk. Signs are posted in around the park describing some of the wildlife and their habitat. Speaking of wildlife, this a nice place for viewing. Saw otters and dolphins during my short visit. I regret that I forgot to bring binoculars; I think I might have been able to see more, especially from the vantage point of the boardwalk. The beach itself is very clean and is nice for walking, though as pointed out in many other reviews, there is a lot of driftwood and seaweed. It's all natural, though, so certainly not a drawback and some of the things people made out of the driftwood were kind of cool.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Wonderful beach days!", "We spent most of our time in Cambria walking the boardwalk and the beach. Beautiful vistas. Benches along the way. Marine mammels and lots of birds on display."], ["Reviewed September 24, 2017", 5.0, "Nice boardwalk", "We throughly enjoyed the beach. Lots of rocks to hunt moonstones. We found two. Watched surfers. Looked in tide pools on the big rocks. Walked to dinner on the boardwalk at night and was greeted by others doing the same. Felt completely safe since so many people were out enjoyed the warm evening. So relaxing!!!! Not crowded at all.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Fantastic Rock Hunter's Beach", "Been visiting this beach for over 35 yrs. Spent many joyful hours collecting pebbles and building sand castles. Dolphins, seals, and otter can be spotted. Santa Rosa Creek empties in to the ocean there attracting many types of birds. There is a great park with a pool, play equipment, BBQ grills, picnic tables, and a big grassy field for sports. Its a perfect place for family fun.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Hearst Castle and Ocean View", "Beautiful view and so glad we made the trip. The morning started off rough with an unforeseen dead car battery. Once we finally got on the road we had 3 hours to travel. So happy when we finally made it to the coast line and had an opportunity to see the beautiful castle. It was well worth the journey and I would happily visit again. There is just too much to see in a day!\nShow less"], ["Reviewed September 18, 2017", 5.0, "Pretty", "Very pretty beach well worth a visit. Nice area for a stroll, swim or surf. Lovely quiet area for relaxing after being in the city."], ["Reviewed September 17, 2017", 4.0, "Wonderful Area", "I recently traveled with friends to Cambria and we stayed on Moonstone Beach. Enjoyed walking it's boardwalk!"], ["Reviewed September 13, 2017", 4.0, "Lived in Cambria x 20 years", "MB is beautiful and was a great place to enjoy the ocean especially since they've built the boardwalk. But I also worked EMS in this town and no the horrible undertows and currants. I would not recommend going in the water."], ["Reviewed September 13, 2017", 4.0, "nice place to visit and walk,on or above(broad walk)", "A nice beachfront lined with smaller motels and restaurants. There are lots of surfers most of the day and plenty of sand and \"driftwood\" and seaweed on shore therefore lots of flea type bugs but really not a bother. You place head down to find special stones which are called --Moonstones-a greenish glass they small stone.\nShow less"], ["Reviewed September 11, 2017", 5.0, "Beautiful California Coast", "Relax, walk and enjoy. You can't beat this beautiful stretch of the California coast. We had perfect weather in early September, not foggy as the area is known for. The \"walk\" is perfect for viewing nature : seals, sea otters, driftwood beaches, wildflowers and other animals in their natural habitat.\nShow less"], ["Reviewed September 9, 2017", 4.0, "Moonstone is picturesque for running/building your castle (sand) and meeting friends!", "Let's face it, I have been to several beaches around the world. On this one with a group (girls) or (coed entourage) it's a pleasure. For luxury and beachfront location accommodations at the Cavalier or BW Moonstone beach is perfect.\n\nBW has little patios, which are nice for cocktail hours that you host or they have a lounge. This beach was inundated with seagulls, seals and interesting geological formations. Lots of new friends made here and photographers will not be disappointed.\n\nConducted a walking interview on this beach and it was perfect to put my friend at ease. Appreciate the natural beauty of moonstone beach, its cleanliness and delightful walking trails on the smooth wooden decks (boardwalk).\nShow less"], ["Reviewed September 7, 2017", 5.0, "Beautiful Beach Walk", "We didn't spend all day here, but easily could. A gorgeous beach, perfect for a picnic. A must see if you are driving along the coast."], ["Reviewed September 6, 2017", 5.0, "The Most Gorgeous Scenery", "You'll fall in love with this walk and wish you could do it everyday! The ever changing sky over the ocean and prism of colors as the sun rises and sets are breathtaking."], ["Reviewed September 4, 2017", 5.0, "Peaceful!", "Our second time here and we just love it! We were lucky enough to stay nearby for a week and enjoy the view from our hotel room. The walk along beach is very nice and so peaceful. Hope to come back next year."], ["Reviewed September 3, 2017", 5.0, "Great place to walk", "Moonstone Beach is a gem. Great place to walk and enjoy the ocean views. The boardwalk is just wonderful and it's so relaxing. It's a great place to unwind. I look forward to walking there every trip."], ["Reviewed August 28, 2017", 5.0, "Beautiful beach", "Lovely beach to stroll along, very clean. There is walk way all the way along too for easy access for wheelchairs and buggies."], ["Reviewed August 27, 2017", 5.0, "It's a beach!", "This isn't one of those pretty beaches with the white, pristine sand and the blue waves crashing against the shore as people with perfect bodies soak up the sun as they lounge about. No, this is a beach beach. The sand can be coarse and there is driftwood and seaweed everywhere. The water is cold and it's often cloudy/foggy. But I kinda prefer things this way! The best part? It's incredibly clean. I ran down a two mile stretch and didn't see a single piece of garbage. It is also void of transients/homeless folks that can tend to congregate on some beaches. It's lovely. Take a stroll along the well-maintained boardwalk and you'll see what I'm talking about.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Pretty Beach!", "Enjoyed the beautiful views of the ocean and the beach. The beach is easy to access and the boardwalk is very convenient."], ["Reviewed August 27, 2017", 5.0, "End of the road.", "Our hotel was just in front of the beach. My first time on the California coast and I have to say that it was beyond my expectations. Calm, clean, just the place to take a brake!"], ["Reviewed August 24, 2017", 5.0, "Pretty and peaceful", "A lovely stretch of beach, no great drama, just serenity. At a respectful distance are several fine places to stay and dine. Well worth a meal and an overnight stay, with walks along the beach at different hours."], ["Reviewed August 18, 2017", 5.0, "Nice walk", "The boardwalk is well maintained. There are places to sit and watch the water and access to the beach. Restaurants just across the street."], ["Reviewed August 17, 2017", 4.0, "Beautiful beach", "Beautiful show of nature. The ocean here has one of the best surf spots on the coast, but is wonderful for walking and picnics. You will love this; as good as Monterey, if not better."], ["Reviewed August 17, 2017", 5.0, "The Best getaway", "Love the Moonstone area and the beac board walk. This is a perfect location to get out of the city and let the stress melt away. long walks on the beach or board walk and several nice hotels that are all ocean front to choose from along with two of the best Sea food restaurants in Cambria .. Bring a camera or sketch pad its beautiful !!\nShow less"], ["Reviewed August 16, 2017", 4.0, "Nice Walk along beach", "Very nice place to walk along the beach. There is access to the beach, but parking is a little tough. No real parking facilities. Close to restaurants too."], ["Reviewed August 14, 2017", 5.0, "Heaven on Earth!", "The most relaxing beach for walking, listening to nature and just enjoying the serenity offered at Moonstone. I want to live here!"], ["Reviewed August 14, 2017", 5.0, "Very beautiful beach", "It is definitely worth it stopping in Cambria, we arrived in the afternoon and went for a walk, take your time, the views are amazing"], ["Reviewed August 13, 2017", 5.0, "Moonstone Beach is so scenic!", "Another one of my favorite places to visit when in Cambria is Moonstone Beach. It is so scenic! Love the rocks, etc."], ["Reviewed August 11, 2017", 5.0, "Beautiful ocean view", "Saw seal and whales out in the ocean. Very pretty view and great boardwalk to walk for miles. Boardwalk is dog friendly but not the beach."], ["Reviewed August 11, 2017", 5.0, "Beautiful place to explore", "This beach and surrounding are beautiful and fun to explore. There are parks, nice walking areas, and nice places to picnic. Even some tide pools."], ["Reviewed August 10, 2017", 3.0, "Bitter Sweet", "Moon Stone Bay Lodge has an incredible location right in front of the beach. Our room was a basic small room, nothing fancy. It was clean. However the living room area had a patch that was not painted and the restroom also had a patch that was just left plastered not painted. The bathroom sink clogged the minute you turn the water on. For the price that we paid we thought the room could've been spruced up a bit more. We will return to Monterey Bay but we're not sure if we'd stay there again .\nShow less"], ["Reviewed August 8, 2017", 5.0, "Beautiful view", "Love it totally going back soon ! It's relaxing an wonderful view an walk on the beach an board walk"], ["Reviewed August 8, 2017", 5.0, "A great beach, replete with a boardwalk and excellent restaurants nearby.", "I would recommend the Sea Chest and Moonstone Grille both of which are on Moonstone Beach, Cambria, CA. Sea food is high quality and ambience is peaceful and soul enriching."], ["Reviewed August 8, 2017", 5.0, "Beautiful, serene and relaxing.", "The beach is amazing with a great path for walking and great views. Its not overly crowded which makes it even better. You have a feeling of being on a private beach... remarkable."], ["Reviewed August 7, 2017", 5.0, "Our getaway beach!", "Such an experience! Beautiful rocks everywhere! Great spot for pictures as there are man made yurts along this entire beach!"], ["Reviewed August 6, 2017", 3.0, "Nearest beach to Cambria", "The Moonstones are the colorful little pebbles which make up the sand on this beach. There are rocks to explore with sea urchins and mollusks."], ["Reviewed August 6, 2017", 5.0, "Boardwalk and Beach ... Beautiful", "If you are looking for perfect views of the ocean, sea mammals, sea birds, and other assorted wildlife, then visit Moonstone Beach and take a walk along the entire length of the Boardwalk. The views are beautiful, the walk is easy (the Boardwalk is wheelchair accessible), and the walk is serene. A great way to spend an hour or a day.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Beautiful, unspoiled beach", "My husband and I stumbled across this delightful beach on our way to the Redwood National Park this morning and spent almost 2 hours exploring the area. The sand is beautiful, the gentle waves were mesmorizing to watch. Further out, the waves were bigger and there were surfers challenging them. But for the most part we were the only two people on the beach. Highly recommend making a stop to see the formations off the coast and the large natural tide pool.\nShow less"], ["Reviewed August 2, 2017", 5.0, "One of my favorite beaches in the area", "This is a great beach to look for rocks, pebbles and driftwood. You may also see a few surfers out there as well. This is not a white, soft sand beach and unfortunately, NO DOGS are allowed on the beach."], ["Reviewed August 1, 2017", 5.0, "Beautiful and Serene", "Take a lovely stroll along the boardwalk, or just spend time staring at the waves. This is a lovely place if you like the ocean."], ["Reviewed August 1, 2017", 5.0, "Perfect place to watch the sunset", "We stayed a short walk from this beach and found the whole experience of watching the sunset very moving. There was quite a crowd on the beach as well... It is very accessible and there is a boardwalk as well so all very easy to pass a few hours in fresh air!\nShow less"], ["Reviewed July 31, 2017", 5.0, "Beautiful", "Beautiful boardwalk along the beach with great views out to the Pacific Ocean and various access points to small rocky and sandy beaches"], ["Reviewed July 31, 2017", 5.0, "One of the jewels of the central coasy=t", "Great place for a walk with your partner and your dog. Gorgeous scenery. Places to sit. Board walk is easy to stroll on. Seals often can be scene. A couple of restaurants across the street. A winner."], ["Reviewed July 29, 2017", 5.0, "Spectacular sunset and beach combing", "I so enjoyed walking the beach early in the morning. Beautiful, accesible, rugged and safe all at the same time. Wish I had known this place existed when my young adults were children!! Later the sunsets were spectacular. I will be coming back for sure!"], ["Reviewed July 28, 2017", 5.0, "Romantic beach walk? This is it!", "If you and your mate hanker for a place to enjoy a place to enjoy a romantic walk on a picturesque beach, you can't beat Moonstone Beach! It's got rocky promentories, nice sand, pebbly areas (for Moonstone searches) imaginative driftwood structures, and abounding wildlife. Harbor seals and sea lions abound, sea birds are all around, even squirrels and pheasants get in on the act! This is the stuff that memories are made of; just do it!\nShow less"], ["Reviewed July 28, 2017", 5.0, "What a find!", "We were there with our 3 grandsons (8, 11 & 13). They would stayed at Moonstone Beach the entire time. The water was too cold for them so we found a \"pond\" which was large and actually pretty deep in the middle that had been formed from the high tide waves over time. They spent hours dragging driftwood logs and branches to make various \"structures\" (boats, rafts, shaded homes, dock repair business). There were many structures all over the area and they had a great time re-building and launching these structures while enjoying the warmer water. A truly memorable time on the beach for all of us!\nShow less"], ["Reviewed July 27, 2017", 5.0, "Great food & Great Service", "We went late since Restaurants in Cambria close at 9:00 PM. My daughters and, grandkids got there at 8:45 PM and it was a long waiting list. Though we only had to wait for 15 min. Our server Jack M. was wonderful and had a great smile at all times. Even when we asked for special things for the kids. We ordered soups & salads since it was late supper. The kids had the Linguini Parmesan. At the end, some cookies & Cream for the kids and Irish coffee for Us. We loved it. We had a great time and even though the restaurant went above their closing time, we were never rushed!! We will be back! Thanks, Jack!\nShow less"], ["Reviewed July 26, 2017", 4.0, "Central Coast Charm", "This has the feel of Monterey, but with fewer people. It is often foggy, but that adds to the charm. Not particularly a swimming beach, due to water temp, but great for walking and relaxing. Supposedly is a good source of sea glass, but we did not find any.\nShow less"], ["Reviewed July 25, 2017", 1.0, "Yes, there are moonstones at Moonstone beach!", "Moonstone Beach is a clean well maintained beach with rocky outcrops scattered along the beach mostly at the north and south ends. The boardwalk traverses the length of the beach with strollers and joggers upon it. The surfers are out early in the mornings on boards or belly boards and many critters can be seen daily in the water off the Moonstone Beach Bar & Grill.\nAt the south end of the beach pebbles of moonstone can be found and traversing the rise at the south end there is a little visited park with wonderful views of the Pacific Ocean.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Beautiful anytime", "Nice walk very beautiful. This is one of our favorite places to go and see the sea lion just up beach a ways."], ["Reviewed July 21, 2017", 5.0, "Wonderful Location!", "Excellent views of the Pacific Ocean and a super walking pathway to enjoy the scenery....great location when visiting the cambria area and Hearst Castle."], ["Reviewed July 21, 2017", 5.0, "Over the moon", "Very quiet, clean and beautiful. Not crowded at all. You can walk all day on the beach or on the boardwalk. Spent hours looking for moonstones. It is very relaxing and addicting. Best of all sunsets are awesome. We were there in July and weather was perfect, cool and dry?\nWe will go back again.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Beautiful location!", "We love walking along the boardwalk and beach! We have been comng here for 35 years for our anniversary. Love lookng for moonstones, not easy. Enjoy observing the seals along the coast and picnicking at the park overlooking the ocean."], ["Reviewed July 18, 2017", 5.0, "The boardwalk is enticing!", "I love to take walks on the Moonstone Beach Boardwalk. It's a 1.85 mile one-way trail...almost 2 miles round trip only feet from the ocean. It's so relaxing and the scenery is beautiful!"], ["Reviewed July 18, 2017", 5.0, "A true highlight of the California Coast", "This was one of our favorite beaches along the California coast. We were able to see squirrels, Sea Lions, rock formations, tide pools and seagulls flying right next to your head. We loved that parking was free and so easy to the beach. It was so calm and peaceful and hardly anybody was there. The people we did meet were so friendly and we just loved everything about this beach. You could easily spend the entire day here if you pack a lunch and snacks and watch the sunset in style.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Heavon on Earth", "Simply the best place on the planet. Very peaceful, relaxing and meditative. Great weather, great views, great walking trails, nice people. What more can you ask for."], ["Reviewed July 13, 2017", 5.0, "Vacation with my 12 yr old grandson.", "We stopped at Castle Inn across the street from this beach, and spent a great deal of time walking up and down this unique beach. It is covered with bleached driftwood and people have made many different types of t-pee type structures along the entire strip. Some you can actually sit inside and get out of the sun or the wind. It was a delightful place to spend several hours strolling and taking pictures and collecting small pieces of driftwood. Highly recommend this adorable place.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Love the Beautiful Beach!", "Great beach for walks, amazing view no matter where you look. I love this beach. Great place to unwind and relax."], ["Reviewed July 11, 2017", 5.0, "Quiet, clean, cold water", "We frequent this awesome beach because very few people go here and we can let the dogs run free (they seem to love Moonstone Beach as much as we do). Great beach for picking up rocks for souvenirs, and finding that semi-rare moonstone (a type of agate). Walk as far as your heart's content, or just sit on the sand and watch a few surfers or fishermen. Very convenient to all the San Simeon hotels.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Relaxing and Restorative", "Loved the boardwalk up top of the beach. Walked sections of it several times a day. This year lots of wildflowers were grown up around the path due to the rains. So pretty. Several areas have access stairways down to the water."], ["Reviewed July 7, 2017", 4.0, "sunset views", "convenient location to Cambria to see the sunset. Ample parking with restrooms and easy access. Sand is rough but good enough to see to sunset."], ["Reviewed July 6, 2017", 4.0, "Moonstone Beach visit", "I love Moonstone Beach. Have been going there for 40 years. It's always so lovely and peaceful and relaxing."], ["Reviewed July 6, 2017", 5.0, "Pines by the Sea", "Nice views, great sunset, saw sea lions, pet friendly too, relatively easy free parking.I really enjoyed it."], ["Reviewed July 5, 2017", 5.0, "Beautiful, quiet, and different everyday", "I have never been to a beach like Moonstone Beach. It is breathtaking and beautiful. You can take a stroll on the board walk and/or beach...depending on your preference. Walks in the morning, are rewarded with views of various wildlife.\n\nThe beach is rock / sea glass rather than sand. Rocks and sea glass vary in size and color.\n\nEach day the beach is different. People go to the beach to build structures with driftwood or stones. These structures are interesting to view. I was hoping to gather a lot of sea glass. Unfortunately, I found very little. However, I did find moonstones and rocks to build towers. Don't miss out on this beach it is a sight to behold.\nShow less"], ["Reviewed July 4, 2017", 4.0, "Quiet Walk", "Walk along the boardwalk or take the steps down to the beach where you can look for moonstones and jade. We found both. It was a bit cool and a sweater was needed in the morning in July."], ["Reviewed July 3, 2017", 5.0, "A Gem!", "Walking along Moonstone beach, either on the beach or on the boardwalk, is always a treat. About a mile long the walk, along the walk are staircases which provide access to the beach. An easy walk, good for all ages and the view is lovely."], ["Reviewed July 2, 2017", 4.0, "Quaint Charm!", "Someone had gone along the beach and made decorated little wood shelters from the driftwood. Being our beaches no longer have driftwood, it was adorable and our 9-year-old loved it. It's full of small pebbles of all types of stones, again really different from the beaches further south. Although only there for a walk after lunch, it was a very pleasant surprise.\nShow less"], ["Reviewed July 2, 2017", 4.0, "Beautiful beach", "Great beach to take long strolls along a boarded plank path and just relax. Many tide pools along the beach to observe sea life. There are a few surfers but not many. Not many people actually hang out on the beach but a few people are seen fishing and sunning on the beach.\nShow less"], ["Reviewed July 1, 2017", 5.0, "Beautiful!", "We loved walking the beach to collect really neat rocks. The waves crashing against the rocks were mesmerizing."], ["Reviewed June 30, 2017", 5.0, "Sunset", "Public parking is available. Awesome beach to watch the pacific sunset. Beautiful. Great experience."], ["Reviewed June 30, 2017", 5.0, "Breathtaking views", "Absolutely beautiful place to go and soak up the beautiful views of the water. I always come by here if my travel allows it while visiting the coastal area. Love it here!"], ["Reviewed June 29, 2017", 5.0, "Vista with a view", "Wonderful walking trail and all sorts of interesting finds along the way. Grand daughter went from one exciting interest to the next."], ["Reviewed June 27, 2017", 5.0, "Praise the Lard", "We have been coming to Cambria for 26 years. Going along Moonstone Beach Drive is one of our fondest memories. It is where the pine trees meet the ocean. The boardwalk,which spans all of it, is a must do for anyone coming to this area. It is also a place to really enjoy the sunset. Even if you are just driving Highway 101 to points north, it is worth taking five or 10 minutes to experience this\nShow less"], ["Reviewed June 24, 2017", 5.0, "A Good couple of hours", "We spent a couple of hours wandering searching for Moonstones, we think we found some along with possible jade, but we have no idea ! At least we have some pretty stones."], ["Reviewed June 23, 2017", 5.0, "A MUST DO when in Cambria!", "Moonstone Beach is a place for everyone - no matter your age or your physical abilities/disabilities. There is a wonderful sandy beach area for wading (and surfing), plus several areas for tide-pooling. On the cliff, there is a wooden boardwalk with a couple of stair/access points to go down to the beach/rocks/tide pools. The boardwalk is easily accessible at a number of different areas from the street. The boardwalk is perfect for strolling, jogging, or just heading out to see the beautiful sites. Someone who is in a wheelchair can access the boardwalk, but it is bumpy and steep in areas, so some extra \"push\" is definitely needed if using a manual chair. My husband, who uses a motorized wheelchair, could easily maneuver the boardwalk. Moonstone Beach is a \"MUST DO\" for the Cambria area!\nShow less"], ["Reviewed June 21, 2017", 5.0, "Lovely", "We stayed at Fireside Inn on Moonstone Beach and immediately walked the boardwalk across from the hotel. The boardwalk is well maintained and spans a good distance. Flowers and beach plants tightly flank the sides. We caught the sunset from the boardwalk and it was just stunning.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Good walks", "It's not a dog friendly beach, but there is a long wood plank walking path that follows the beach up on the cliff. Very picturesque."], ["Reviewed June 18, 2017", 2.0, "Too Cold!", "Be sure to have jackets! This place was freezing, high winds, and had tar on the beach! We visited in June, and it was absolutely miserable! This is a typical California Central Coast Beach. If you are looking for the Moonstones, then you will find tons. This is not the beach to picnic on - too cold! It was in the 50's in mid June! None of us would return.\nShow less"], ["Reviewed June 17, 2017", 5.0, "Wonderful walking", "This is a great place to walk along the ocean. There a board walk that runs all along Moonstone Beach Drive."], ["Reviewed June 17, 2017", 5.0, "Secluded beach feel", "The path to the ocean from the parking area afforded beautiful views. The heron (?) just off the path stood still for about 15 minutes of photos -- with ocean and mountains in the background and fields of blooming succulents in the foreground. The cypress trees are trimmed so travelers can walk beneath. The steps down to the beach are well placed with a railing much of the way.\n\nWe simply sat in the stones on the beach and marveled at the beauty of shapes, colors, patterns. We may have even found a moonstone.\n\nIn about 90 minutes we saw no more than 8 people. We played like little kids and no one was there to be embarrassed by the sight. It was like we had the beach to ourselves.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Simply gorgeous!", "This beach is very gorgeous! Nice walking path. The sunset view was spectacular. There were a few areas to park along the road but we were staying in a hotel right across the road so we had no problem."], ["Reviewed June 14, 2017", 5.0, "\"My corner of Paradise\"", "If you have never been to Cambria, now is the time to treat yourself to this treasure! Great places to eat...relaxing atmosphere... nature at its finest...sunsets to impress and the list goes on. Plan a walk on this beach soon!!"], ["Reviewed June 12, 2017", 5.0, "Spectacular views", "Walk along the lengthy boardwalk that spans several miles and take in the gorgeous vistas and ocean. It's truly magical!"], ["Reviewed June 8, 2017", 5.0, "The reason to come to Cambria . . . .", "This is my absolute favorite beach in all of California for a number of reasons.The wooden raised walking trail is the best way to experience this. Being close to flora and fauna. You will see squirrels, rabbits, seals, lizards and the occasional deer. Beautiful rock formations.the perfect beach to decompress and forget about the rat race you are escaping from\nShow less"], ["Reviewed June 7, 2017", 5.0, "Beautiful Beach", "Beautuful N. California beach with dark sand. The flora and fauna in the area is a wonderful sight to see."], ["Reviewed June 6, 2017", 4.0, "Great Place to Teach Kids", "Our grandkids had never been to a beach that wasn't just sand, so it was interesting to see their reaction to a beach covered in pebbles and stones. They were intrigued as to how smooth the stones were."], ["Reviewed June 6, 2017", 5.0, "Wonderful beach to walk on and collect beautiful stones", "I love this beach. Great place to take a long walk and collect polished seashells and rocks. I have been going here for years and it always soothes my soul."], ["Reviewed June 5, 2017", 5.0, "First timer", "I should of checked the weather before going. Since in Kingsburg Ca it was 98* and in Cambria 64 lol. So When i got there it was chilly. I saw everyone, well a few people walking their dogs on the walk way, with a sweater and there I was with a two piece and a whole set up for a hot day Hahah.. I felt like a crazy lady. I'm glad I didn't jump back in my car and drive away with my family. I went down the walk way to the beach itself , and glad I did! Over all the moonstones threw me off. Never in my life expected Little Rocks/pebbles. So the moonstones felt good on my feet. Only when they were wet is when they hurt like hell ! I did climb a few big rocks and pose like a walruse. Lovely, uncrowned beach! The kids loved it. Easy to clean yourself off. The water was lovely. Salty you but nothing un normal. There's a little area where there's these logs and old branches to play with. My kids made a little house. We used our imagination and pretended we were the croods.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Enchanting", "Moonstone Beach is one of many uncrowded beaches on the Cambria, CA coast. It's halfway between San Francisco and LA along CA Highway 1. The beach is extraordinary, both for its amazing vistas and its uncrowded feel."], ["Reviewed June 1, 2017", 5.0, "Boardwalk is the best", "We got up quite early and took the boardwalk round trip(3miles). It is the most amazing experience highlighting our trip. Wildflower, wildlife is just along the walkway."], ["Reviewed May 31, 2017", 5.0, "Lovely beach of multicolored stones. Nice little boardwalk walking path.", "The beach itself is lovely, with a great view of the Morro Rock. It is made up of small multicolored stones that are beautiful when viewed up close. Just above the beach is a very nice sort of miniature boardwalk pathway, making it VERY accessible for anyone elderly or in need of a wheelchair. A nice walk along this pathway and you can look south towards the Morro Rock or north towards Big Sur. Very pleasant stop!\nShow less"], ["Reviewed May 30, 2017", 4.0, "Another great time", "Cambria is a great place to go the walk along moonstone beach is always good the town had a lot of small shops the restaurants in town though not great they are reasonably priced. The nursery is huge and they have everything also a good restaurant at the hotel this is located up the hill between town and the highway if you go there around Halloween the town is really decked out and of course you must see Hearst castle it's a must\nShow less"], ["Reviewed May 30, 2017", 5.0, "amazing rocks", "We came here on a cold rainy day. There was a sea lion swimming in the waves. We were the only people on the beach.\nInstead of grains of white sand the beach is made up of thousands of different types of pebbles. Our kids 11 and 13 had so much fun looking at all of the different kids of stones. The stones are beautiful. They are smooth and shiny we found natural jade, quartz and even 2 moonstones. We could not get our kids to leave.\nShow less"], ["Reviewed May 28, 2017", 5.0, "Wonderful place to walk", "Lovely beach to walk on with it's boardwalk anytime of the day - we needed jackets in May. Enjoyed watching the surfers from our hotel room balcony. BEAUTIFUL!!"], ["Reviewed May 27, 2017", 5.0, "Beautiful beach and boardwalk anongst wildflowers", "My husband and I enjoyed walking the 3 mile (round trip) boardwalk. It winds in and out of wildflowers and natural greenery. Down below is the beautiful shoreline. The beach itself is rockier than southern beaches. Tiny pebbles make up the sand here. The shore has a great sprinkling of driftwood. We didn't visit any of the local shops, but will definitely explore further on our next trip, because they looked interesting as well. I would suggest hiking poles if you attempt to head to the waters' edge. It can be precarious if you're not sure footed\nShow less"], ["Reviewed May 26, 2017", 5.0, "Lovely ocean scenery", "We stayed at the Cambria Shores Inn across the street so we had easy access to the boardwalk that extends up and down the beach. The walkway is suitable for strollers, wheelchairs and easy walking. Stairs lead down to the beach, but we had our dog so we didn't go down. Wildflowers, ocean waves, sea birds and seals are part of the beautiful scenery.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Romantic and Splendid", "Relaxing beach to walk and stunning vistas and sunsets. The beach is a pebble beach with softer sand at the surf line. Hard to find the moonstones, but there are rocks of many colors include the green jade. Lots of driftwood too."], ["Reviewed May 25, 2017", 4.0, "A Wonderful Place to Stoll the Day Away", "Located in the \"quaint\" town of Cambria, it is a \"not so typical\" Northern California Beach. What makes this so different is that the beach is compiled of pea-sized and smaller gravel. It is made up of several different types of rocks, including \"moonstones,\" and other polished rocks. These include jade, colored glass and an assortment of other colored and multi-colored rocks. There is plenty of drift wood to choose from and dried out \"tubulers.\" These have taken on many twisted and coiled, flexible shapes. The gravel can be very unstable, since it does not pack down even with the tide. So, if you have hip, knee or ankle problems, the beach is pretty rough going. I have knee and hip problems, so I needed my wife to help stabilize me or help me up the inclines back to the stairs. Also, we found NO direct access to the beach. Moderately steep stairs are the only way up and down at the two beach accesses we found. I toughed both out, and was not sure it was all worth it when we finished each day. I would do it again. It was tough, sometimes hard-going, and always painful.... It was worth it for me. You will have to decide for yourself. The surf was gentle and rolling. Several large rocks are scattered throughout the water. We were lucky two out of three days with the marine layer staying well of shore by 10 AM to 1 PM. A wind-breaker was needed both days. On day three, the coast was \"socked in.\" Typical warmer weather situation. You never know what you will get. We live in the valley about a hour from San Francisco. We never head to the coast without checking live satellite/radar maps to find out the condition of the marine layer, i.e., how thick, how wide and how far inland it reaches. This is what you experience along the California Coast. Your best chance for clear, sunny and warm days occur in Winter months. So plan accordingly if you aren't FROM CA, and you want to enjoy the coast. Just remember that the whole state can experience the affects of the marine layer anytime of the year. Moonstone Beach is one of California's many unique beaches. Mainly sand on the east-coast; many diverse beaches, with some sand on the west. Warm water back east. Water ranges from the 50s in the north to the 70s in SoCal. Enjoy part of \"California's Gold.\"\nShow less"], ["Reviewed May 24, 2017", 5.0, "Beautiful views", "Loved walking along the beach and picking up moonstones. The views were beautiful and relaxing. Walked the boardwalk at sunset and enjoyed the cool breeze and view."], ["Reviewed May 23, 2017", 5.0, "Beautiful coastline", "Lovely stretch of beach with easy access. Moonstone Drive provides lots of pulloffs for access to the beach. The beach provides access to many tidepools including rocks for seals and babies to sun themselves."], ["Reviewed May 23, 2017", 3.0, "Picturesque beach", "Great beach reminds me of the Sorrento front beach in Melbourne Australia, great sunset and surf. A very popular place to walk the boardwalk and watch the water ."], ["Reviewed May 21, 2017", 5.0, "Terrific Beachside Boardwalk overlooking Beach!", "Moonstone Beach Park Service out did themselves when the boardwalk was put in! Surfers Seigels and sea lions and that are easily viewed from above the water and paralleling the beach sand walk. A myriad of boutique hotels and fun dining choices are to the right as you face north towards San Simeon. Be sure tio allow enough time to get into town to the East Side for some terrific little eclectic shops worth exploring!\nShow less"], ["Reviewed May 20, 2017", 5.0, "Moonshine Bar and Grill", "Nice and cozy inside but we sat on the ginormous patio with a view of the ocean. Very very nice the first time we visited and they had flat iron steak on the menu which we loved. The last visit no flat iron steak might be new owners but still good food. Wait staff the last time we're not as friendly and they weren't even that busy. Strange how it changed in just a couple months . but still recommend.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Beautiful calming", "Was there for a walk just before dinner as the sun was going down. Beautiful, tranquil and relaxing. The walk is easy and on wooden planks surrounded by grass and flowers that is if you don't want to walk on the beach. On the north end is where the seals are, there were not too many but did see a mother feeding her cub\nShow less"], ["Reviewed May 18, 2017", 5.0, "Beautiful", "There is a wonderful trail with beautiful ocean views. Great views of the coastline and easy to walk on."], ["Reviewed May 14, 2017", 5.0, "Wonderful place to walk", "Enjoyed walking the boardwalk and the beach although the beach is pretty rugged. Lots of nice restaurants and parking. Many lively hotels and B&Bs all along the road. We were visiting before the high season so it wasn't crowded. We enjoyed watching the sunset from the many viewing spots. It was windy so bring a hooded wind breaker! It can get really chilly.\nDefinitely a place to revisit.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Nice beach", "Nice beach with great views and long boardwalk. Check this place when you are in town! Rocks and stones in the beach are spectacular."], ["Reviewed May 13, 2017", 5.0, "Well kept secret!", "Quite with no crowds and traffic. Two mile long boardwalk with beautiful ocean views. We will be back here again!"], ["Reviewed May 11, 2017", 3.0, "Nice beach but the rocks hurt my tender feet", "This is a different kind of beach in that instead of sand it is a pebble beach. Had I worn shoes it would have been an even better experience but I wore sandals so every sharp pebble got into my feet. Ha ha. It was very pretty.\nShow less"], ["Reviewed May 9, 2017", 5.0, "An exceptionally beautiful spot", "Moonstone Beach is simply beautiful, unspoiled and uncrowded. It's easy to get to, that is, once you've made the trek to the somewhat remote Central Coast. There's a lovely boardwalk along the shore."], ["Reviewed May 8, 2017", 5.0, "Moonstone Beach has many moods", "Growing up in Hawaii, for me \"the beach\" has a much different vibe than the majority of the California beaches I've been to (except San Diego). So to me, having a beach that can change from sunny with the deepest blue water to gray and foggy and cold is kind of unusual. The locals say it was unusually windy, but the trees grow sideways so it's probably windy a lot.\n\nWe stayed at a hotel that was at the northern side of the beach, and there's a nice lookout on a point, and also beach access though the north side appeared rockier than in the middle. We walked towards the center area of the beach and found a lot of beach pebbles with people looking for moonstones.\n\nOne morning the beach was fogged in and gray, but the next day it was clearer. The ocean seems bluer mid-day to afternoon, and then changes again near sunset. If you want to photograph the sunset, go earlier than you think because the clouds can come in and it becomes dark fairly fast.\n\nTips for comfortable walk along Moonstone beach -- windbreaker / shell to wear over whatever to stay warm, especially morning or near sunset. It was beautiful, but quite windy.\nShow less"], ["Reviewed May 5, 2017", 5.0, "Nice Beach Walk!", "Really relaxing and fun to walk this beach. At street level you can park and if your lucky you might get to witness a beautiful sunset. We were lucky to see a great sunset and we were so glad we stayed in Cambria!"], ["Reviewed May 5, 2017", 4.0, "A nice walk", "We stayed at a Inn across the street from Moonstone Beach. We walked the boardwalk and saw harbor seals. It was beautiful and relaxing. It was overcast when we were there but still very beautiful."], ["Reviewed May 4, 2017", 5.0, "Great Walk", "Moonstone Beach has one of the nicest walks along the beach up from the shore line. The walk is planked with many places along the way to sit and enjoy the view. Definitely a must see and do."], ["Reviewed May 4, 2017", 5.0, "Beautiful Beach Setting", "Beautiful beach setting with a wonderful long boardwalk above the beach--walk, run, wheelchair accessible. So much to see/do with the tidepools, rocks, sunsets, sunrises, quaint hotels and restaurants right on the water. Slow paced and thankfully removed from the craziness of the beaches farther south."], ["Reviewed May 2, 2017", 5.0, "Stunningly beautiful", "You must visit even if you are just passing by. It is a beautiful rugged coastline, a wooden walkway takes you a mile along this coast with a park with picnic tables at one end. Fabulous sunsets."], ["Reviewed May 1, 2017", 5.0, "Exrtemely Picturesque", "After a day of beach hopping around San Luis Obispo, we settled in at Moonstone Beach to catch another Ocean Sunset View. Moonstone was the best & captured everything we expected in a coastal sunset walk on the beach. The waves, walking path, steps to the beach, & rock formations all added to the perfect evening.\nShow less"], ["Reviewed May 1, 2017", 5.0, "One of California's Most Magical Beaches", "Where do I begin to tell you about one of my favorite all time spots for rejuvenation? The beach here is laden with drift wood, black course sand that doesn't stick and instead becomes one of nature's finest spa treatments when you bury your legs deep within its sun warmed granules, crashing waves between black volcanic outlying rocks, and of course the many moonstones. This stretch of beach is beyond beautiful, not too crowded and so special.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Relaxing!!!", "Our afternoon at Moonstone Beach was one of the HIGHLIGHTS of our trip up the California, Oregon & Washington coasts!!! We arrived at noon with the plan to have lunch on the beach and head on to Monterrey for dinner & over night---but plans changed when we were having such a great time (drinking wine & relaxing) that we didn't want to leave!!! We stayed long, found a great hotel room & scored a reservation at ROBIN....OMG!!! Best dinner of our whole trip!\nShow less"], ["Reviewed May 1, 2017", 5.0, "girls getaway", "always breathtakingly gorgeous view. Albeit it's windy and the winds can be very cold. Instantly calms you and makes you forget what ever stresses you may have."], ["Reviewed April 30, 2017", 5.0, "Lovely place to walk along the beach or on the boardwalk", "Yes - go here! There is a boardwalk stretching at least a mile you can walk on. Or you can walk by the water on the beach, which is what I did with my kids. They had lots of fun looking for cool stones and running in the water (too cold to go all the way in). The beach area was clean and everyone we encountered was very friendly and nice.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Beautiful Beach!", "We stayed elsewhere this trip but once I saw Moonstone Beach I was sorry we did not stay here. There are quite a few lovely oceanfront hotels. The boardwalk makes for a delightful walk above the ocean or you can go down steps to walk on the sand. The beach is also a short distance from the shops and restaurants of Cambria.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Getaway.", "Spectacular views, the rock formations are incredible on this beach. The sand and beach was very clean, had fun walking and collecting rocks and shells to take home. Was a great place for us to stop and take a break from the rush of life !\nShow less"], ["Reviewed April 26, 2017", 5.0, "Do the boardwalk and the beach on a breezy, chilly day. We did and it was unforgettable.", "The boardwalk was surrounded by coastal wildflowers and offered several viewpoints including one that overlooked a sea lion rookery. And it is a nice long walk. And the beach...go on a minus tide for the tide pools."], ["Reviewed April 25, 2017", 5.0, "Beautiful", "This is a Beautiful Beach. Always very very clean. Love the the walk along the Beach The trees along the outlet add so much to the view"], ["Reviewed April 24, 2017", 5.0, "Sea of Glass", "If you enjoy finding amazing mineral and moonstones, this is the place. I get lost in time there and all the energy just seems to come back to me"], ["Reviewed April 24, 2017", 5.0, "Beautiful beach", "Beautiful beach! So tranquil and gorgeous. There is a really nice walkway to stroll down with great views of the beautiful beavh"], ["Reviewed April 24, 2017", 5.0, "My zen place", "The best beach hands down for relaxing and to regenerate your soul!!! Absolutely fantastic!!! You really should get a blanket some wine and cheese and go watch the sunset... you might even catch a glimpse of a whale or two 🐳!!!"], ["Reviewed April 19, 2017", 5.0, "Fantastic beach -- our kids seem it a must do", "On a rainy Monday in April, we had this beach to ourselves. We found a lot of moonstones and some sea glass. This is a quiet, relaxing, calm beach but don't come here expecting to build a sandcastle. There a lot of fun rocks to climb, and it's a nice beach to explore.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Majestic Views", "The views from all angles are absolutely beautiful here. We stayed at Oceanpoint Ranch and walked to the beach. When the fog sets in, it is one of the most amazing sights you can picture."], ["Reviewed April 17, 2017", 5.0, "A Walk on the Calm Side", "If you are looking for some inner peace, personal TLC, then take a walk on the \"boardwalk\", as I call it, at Moonstone Beach. The wooden walkway runs along the coastal bluffs along Moonstone Beach in Cambria---it is peaceful, calming, and basically uneventful. A great getaway for those who are stressed.\nShow less"]]}}