{"Moro Rock": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Moro Rock", "url": "/Attraction_Review-g143050-d146443-Reviews-Moro_Rock-Sequoia_and_Kings_Canyon_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/67/8d/2a/moro-rock.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1298"}, "address": {"@type": "PostalAddress", "streetAddress": "36.547063, -118.765734", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Sierra Mountains look beautiful from the Top!", "An easy hike which takes you to the top of Moro Rock where you have 360 views of the magnificent Sierras covered in snow. Must visit if you are in the area."], ["Reviewed 2 weeks ago", 4.0, "Very cool", "This was great. It's a nice easy hike with lots to view along the way. I came into Visalia for business and had a free afternoon. Glad I found this gem!"], ["Reviewed January 22, 2018", 5.0, "A beautiful experience", "The views from the top are truly beautiful. It's a quick hike, but you will need your walking/climbing shoes."], ["Reviewed January 18, 2018", 5.0, "Nice View", "We loved the hke up to Moro Rock - take water even when cool! The hike to the rock was a easy treck, the hike up the rock/stairs - took some effort! Beautiful view."], ["Reviewed January 16, 2018", 5.0, "Never a disappointment", "I love going here. It was on a holiday weekend and it seems they have changed things up a bit. Holidays and weekends you have to park in certain areas and there are shuttles that will take you to the main attractions. I knew the places to visit so it wasn't too hard to make sure we wanted to see what we wanted to see. When u first enter the park they give u a map of the forest plus a map of the shuttle areas and times. There were quite a bit of people visiting but was nicely surprised by the efficiency of the shuttles. BE PREPARED TO BRING YOUR OWN WATER AND SNACKS. There is a gift shop and museum but only souvenirs were being sold. They did have a water fountain. On the week days there are no shuttles so you can park at the different attractions but parking is limited but probably isn't too bad since there may be fewer visitors.\n\nI've been there a few times around May/June time and it was very hot in the 3 Rivers area just before you enter the park but once in the park people were wearing jeans, sweaters, parkas, etc. So make sure you check the weather. I tried to use my Google weather app to prepare for the weather but it was wrong. I dressed for cooler weather and had my winter coat ready. It was way warmer than the app had lead me to believe. So bring clothes for various weather if possible. It wasn't too uncomfortable wearing and walking in jeans but it would've been much better with shorts and a light shirt. I'd also recommend tennis shoes or hiking books depending in how much walking u will do.\n\nI've been here many times with my children when they were of walking age without issues. It would be difficult for me to have small children in strollers especially if I would need to use strollers etc. If u plan on walking up Morro Rock be prepared for heights and to carry small children in alot of areas. It's not stroller accessible. The views are breathtaking.\n\nThere is a small restaurant called The Gateway just before entering the park. It's a beautiful place to have brunch/lunch/dinner. It's right next to a beautiful clear flowing river. The food is a bit pricey and u may have a bit if a wait if it's a weekend or holiday but if it's the only visit you will be making in this neck of the woods it's worth it. I'm spoiled. It's just a hop skip and a jump for me. Hope you have a great time!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Amazing", "The best things in California are nature based. Stay away from the cities and enjoy the parks. Views are simply breath taking. The hike up is a little scary. The railings are way to short for my liking. Wear good shoes,a hat and take some water. Don’t forget your camera.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Top Attraction at Sequoia NP", "This short hike to the top of the rock is right up there with the General Sherman Tree. This hike took us about 20 minutes going up. My 4 year old was able to do this hike. It’s not too bad for those who are scared of heights. If you have younger kids with no fear and who like to mess around, you probably want to keep them away from some parts of the rail. There were lots of informational signs about the area as you walk up.\n\nThe parking lot wasn’t big and didn’t fit a lot of cars. There were restrooms at the parking lot.\nShow less"], ["Reviewed January 3, 2018", 5.0, "View!", "Loved Sequoia and Kings Canyon National Park. We went in the summer and entered the park on a Friday. The lines weren't so bad but people have said there terrible on Saturday. We parked and hiked to the rock from the\nGiant Forest Museum. Short pretty hike, saw 1 person. The climb up morro rock isn't difficult its just a lot of steps and if you are scared of heights you might not like it. The views at the top are amazing! But I was a little scared at the top.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Beyond excellent", "Easy staircase to maneuver - although I did fall and break my thumb- some people are not courteous and run past you so hold on to the rail- breath taking views all the way up - at the top you will see evidence of the glaciation that formed the valley\nShow less"], ["Reviewed December 28, 2017", 5.0, "Great walk, great views.", "If you have a touch of vertigo, be careful with this walk. Paved narrow path with some steps. Not a long walk but steep in short sections. Excellent views along the way and at the top >> too bad the view to the west (toward the Central Valley area) was socked in with smoke/smog. Interesting info placed along the way. Reminded me of a mild version of Zion's Angel's Landing hike.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Test your vertigo", "For those of uncertain fitness or acrophobia I suggest giving it a try and turning back when you get uncomfortable. The views as soon as you leave the car park are excellent and just get better the higher you go. The drops on either side of the walkway get steeper and further as you climb up. The protective walls and railings range from low to barely existent. I am moderately fit, didn’t rush but also didn’t stop much or spend more than 10 minutes on the crowded, narrow top and I got up and down in 30 minutes.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Stunning views", "We took the 350 stair climb to the tippity-top of Moro Rock. When driving from the Three Rivers entrance of Sequoia National you get great views of Moro Rock while winding up the hairpin turns of the mountains. My husband and I wondered as we were driving if you could climb up there and once we reached the top of the mountain we found the trailhead of the climb. No doubt it will leave you short of breath, but it was so worth it. Even coming from someone who is crippled by a fear of heights, once at the top the views are breath taking!!\nShow less"], ["Reviewed December 3, 2017", 4.0, "Inspiring Views", "The trip to the top is a workout but worthwhile. There are many steps and narrow passages on your way. Take your time and enjoy the view along the trail and you will be rewarded with a fantastic view at the top of Moro Rock. This is a must see location within Sequoia NP.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Best part of vacation", "The climb to the top is worth the effort. This is a must do activity while at Kings Canyon. The climb to the very top can be a bit intimidating as you are on the edge of the mountain on a very narrow trail. There are handrails. The view at the top is amazing. There were several fools who went over the rail on the top of the mountain even though signs clearly stated the danger. Wear good footwear and be ready to climb lots of steps. Children must be well behaved and stay close to adults as this can be dangerous.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Best Views in Sequoia National Park", "The 400 steps to the top of Moro rock are worth every step, turn and for some struggle to make it to the best views in the Park. Once you reach the top you get 360 degree views of the Sierra Nevada Mountains, Valley floor and at night you can see the glow of lights from Los Angeles and the Valley. Once you enter Sequoia you head towards the signs for Moro Rock about 1 hr drive from the entrance. You will pass the Auto Log, Tunnel Log and then come across the turn for Moro rock, there is a small parking lot right at the bottom or you can park anywhere around the 1 way road. The Stairs begin right past the information post and bathrooms. The steps are not the large and there is a hand rail, rock guard or other safety feature the entire way up. There are narrow one way area that can become crowded at times but just wait your turn and proceed. Once you reach the top in about 20 minutes or so! WoW see pictures.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Almost there!", "Beautiful view from this high spot! You can get here with your car and then a short walk takes you a step from the sky!!"], ["Reviewed November 16, 2017", 5.0, "Climb the steps to the top of Moro Rock", "Easily climb the stairway to the top of the Moro Rock to get one of the Best views in the park. Take your time and take in the views! It’s a semi-long way up so stop as you need ! There’s just enough room for you to stop and still let the other tourists to keep climbing. Make sure you have proper wear because it can get chilly during the fall and the sun can be a factor during the summer time! Other than that have fun! Make sure to have your cameras with you!\nShow less"], ["Reviewed November 14, 2017", 5.0, "5 STARS!", "Moro Rock is a must see if in the area. Incredible views when the clouds/fog isn't covering the landscape.\n\nTraveler Tip: It is a decent incline so just be aware of this if traveling with children, elders, or anyone not in great physical condition. If you take your time, you should be fine. There are plenty of elders that we saw on the way up that were struggling, but I think they may have been trying to keep up with traffic since the pathways are narrow.\n\nPeople are pretty friendly so if he/she stays off to the side then it should be ok or perhaps they just want to go up part of the way.\n\nIf you are planning to take a large group of elders to the top I'd probably say that someone may yell at you so I'd probably recommend against this since it would significantly slow down traffic.\n\nTraveler Tip #2: If you or the person you are bringing is going with is scared of heights, then I'd say there are plenty of beautiful things to see throughout the park that don't involve heights for he/she to enjoy.\n\nOverall: I would recommend this to a friend and would definitely go back again.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Well Worth the Effort!", "The path is narrow and fairly steep, but there are steps, so that helps! There are some pretty sheer drops off the edge of the path, but the railings and little walls help you feel safe. Once at the top, the views are incredible!"], ["Reviewed November 14, 2017", 5.0, "Moro Rock", "Moro Rock is a MUST see if it’s the only place you go as the views will stay with you for life!!! It’s a pretty quick 15-20min climb to the top just be careful with kids as"], ["Reviewed October 29, 2017", 5.0, "Spectacular Views", "Sequoia National Park’s main draw is the giant Sequoias, but the park has some gorgeous views and vistas to offer as well. One of them is from the top on Moro Rock in Sequoia National Park. The Sierra Nevada Mountains are full of granite domes, the most famous being Half Done in Yosemite National Park; Moro Rock in Sequoia National Park is a much smaller one that, happily, is easily accessible by car and short climb. As you enter the park from the south entrance the Rock towers above you, but the road climbs until you are only a few hundred feet from the crest at the parking lot. Although the climb only takes about 15 to 20 minutes, it is steep and they advertise, I believe, 350 steps. Our visit to Sequoia was marred by smoke from the many fires burning in Northern California during our visit. Even with the fires, the views were superb just halfway up the climb. It was actually less impressive from the top due to the smoke, but on a clear day I think it would be well worth the climb. Road access is by the Crescent meadows drive which leaves the General’s Highway at the Giant Forest Museum. According to the National Park website, free shuttles run from the museum to the Moro Rock parking area. The road to the parking area is closed to private vehicles during weekends and closed in the winter; the climb to the top of the Rock is also closed in the winter.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Park and view!", "Easy to park with a short trail to the steps of the rock.\nNot a punishing climb but one where you might get puffed out tat times - but it is so worth it. After the climbing of many steps the viewing top with its well fenced of area is wonderful. Do it!\nShow less"], ["Reviewed October 25, 2017", 5.0, "Beautiful Views", "The climb was steady and became narrow toward the top. The views of the surrounding mountains and pine & Sequoia forests were spectacular. We saw people of all ages making the climb...several young children. It wasn't an easy climb but is doable for most everyone. The first several minutes are the hardest as one gets acclimated to the elevation/thin air and uphill climb.\nShow less"], ["Reviewed October 23, 2017", 2.0, "Wow", "A gorgeous climb. I would imagine the views are lovely but the smog and smoke made it almost impossible to see. Also the swarms of bugs were overwhelming."], ["Reviewed October 23, 2017", 5.0, "Fabulous views at the top", "The hike to the top of Moro Rock is not for the faint of heart. Approximately 350 steps wind around the rock to the top. There is a safety rail around the top which helps, since you are enthralled with the fabulous views in all directions. Definitely worth the effort if physically able.\nShow less"], ["Reviewed October 21, 2017", 3.0, "Saw nothing", "The walk and climb is hard. The path is narrow. We did not climb to the top. As it wore us out plus it was a whiteout with thick fog. See nothing. Saw nothing. What a shame."], ["Reviewed October 20, 2017", 5.0, "Get there early...you will be alone", "This hike is short and the climb is intense. When you get to the top it is impressive. You have a 360 degree view of the scenery that can't be matched anywhere in the park. If possible, get there early in the morning and you will have it all to yourself. I would recommend gloves though especially if the temperature is cool. The railings can get quite cold overnight.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Fabulous Hike to Top", "This was amazing. It was strenuous, but I loved it. I hiked it by myself since my husband couldn't handle the height. The view from the top was worth it. Not crowded at all."], ["Reviewed October 12, 2017", 5.0, "amazing view on top", "the view is amazing on top of the rock, the steps are pretty simple to climb. this is a must visit while you at the park."], ["Reviewed October 9, 2017", 4.0, "Fun hike to a great view", "This is a great hike up to an awesome panoramic view of the Sierra Nevada's. A bit steep at times and can get very crowded. Make sure to bring water and take your time, but the view is well worth it."], ["Reviewed October 9, 2017", 5.0, "Great views", "The climb to top twists and turns and gives great views all the way to the top. So you don't HAVE TO go all the way up - either way you're rewarded with unique perspective of the park"], ["Reviewed October 7, 2017", 5.0, "California 2017", "Good challenge for these old bones. Worth the climb just as you think you are to the top , 6725 feet, is another corner and another set of stairs. The workmanship cuts thru the granite and stairs were very impressive. Getting to the top you are rewarded with a 350 degree view of the Middle Fork Canyon. Worth the climb!\nShow less"], ["Reviewed October 6, 2017", 5.0, "Breathtaking views with just a small climb", "The hike can be strenous for some but it doesn't take much time. There are stairs that you must climb to be at the top. My friends and I went there in the evening because we wanted to do some star gazing. Regardless of how many stars we saw, the view is breathtaking. You can see city lights and cars making their way down the park on one side and the whole forest and mountains on the other. I am sure it would be great during day time as well.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Great views on this challenging climb", "There are about 350 steps up this giant rock and the views up there are amazing. The area around the rock is really neat too--lots of giant trees, birds and piney fresh goodness to soak in. There are some signs to read and a restroom at the bottom of the rock as well. The road to this rock is short and narrow, but beautiful.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Great Panoramic Views", "To get to the top of the rock takes some courage and not for people afraid of heights. The path is a bit narrow and a sheer cliff drop on one side plus the elevation of the place could make the climb up a bit hard but the views from the top of the rock is your great reward.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Just a mini hike for us", "The Moro rock is accessible to hike even if you are not dressed appropriately (I had a long dress and wedge sandals) however I decided in the name of not destroying my wedges, and to conserve energy, that would be much better for us to climb the easy steps some a quarter of the rock. The majority of people were dressed appropriately on such a warm day and kept going on. Even so, we had some amazing views over the whole valley and happy, we decided to return and visit the other locations.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beautiful View", "We were pleasantly surprised to find that although there are a LOT of steps to get to the top of Moro Rock, there is a handrail all the way to the top. Even though I have a terrible fear of heights and only made it 2/3 of the way up, I'm glad I went because the view was wonderful. My husband did go all the way up and said it was beautiful.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Day out", "Absolutely loved this place. A lot of steps to get to the top - but so worth the effort. The views are incredible!"], ["Reviewed October 1, 2017", 5.0, "Go on a clear, sunny day", "This would be very scary if the path was wet/slippery, or lightening was a possibility at all. On a clear day, it provides some amazing views. I wouldn't take children if they weren't old enough to be very careful. There are places where the border edge of the trail is only about 2 feet high, and the trail is narrow with a steep drop-off. For adults and older children, it is a great experience. There are a few places to stand and rest on the way up.\nShow less"], ["Reviewed October 1, 2017", 5.0, "A Challenge for me", "After a long winding drive to the area I was looking forward to the challenge and it didn't disappoint. I'm in mid fifties over weight and not to happy with heights. Take your time enjoy the view, It's capable for most people, it's the fear of heights that was my main worry but it was fine.\nGreat views from the top.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Busy hike", "This was a brief hike up to the peak. Many steps but not terribly difficult. There are some tight spots where you can end up waiting for a while for traffic to clear. The view from the top is definitely worth it, one of the best in the park! There were a lot of people here but the parking spots open up quickly since it's a fairly short hike.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Spectacular view - difficult climb up", "The view from the top of this rock is truly spectacular with 360 degree panarama. There are also good views on the way up as you cross from one side of the rock to the other.\nThe climb is not for the faint hearted - the safety rails are quite low and there are points where you have to bend slightly to pass overhangs. Not too steep overall but some steepish steps on the way and some parts and one way only!\nShow less"], ["Reviewed September 25, 2017", 5.0, "Easily accessible", "Brilliant views for a very easy walk- hardly a hike or a climb ! Surprised so few people were there. Make sure you have a drink and a good camera!"], ["Reviewed September 23, 2017", 5.0, "Great view", "The climb was daunting at times but fortunately there were stops along the way to catch your breath. We made it up all 365 plus steps to the top and the view was fabulous! A must see experience"], ["Reviewed September 23, 2017", 4.0, "Beautiful Spot/Stupid Humans", "Stopped at Moro Rock for a quick and highly recommended hike. It is an entirely rock staircase that leads you to the very summit of the rock- overlooking the mountain range before you that is endless. The view is incredible and breathtaking. The signs at the top and along the way give great insight into the making of the staircase and the ecological systems at work around you.\n\nThe reason this attraction can not have the 5 stars it deserves is unfortunately because the human race is an atrocity. I visited this hike on a Monday morning in September. Despite this seemingly harmless time of year - I was walking behind someone with someone directly behind me the entire time. It is VERY busy. I am a hiker who, along with my husband, take the LNT policy very seriously. It was awful for us to see the litter and actual garbage along this trail because it was absolutely stunning. We took some water bottles out with us.\n\nLast but not least.. The summit has railings and signs posted EVERYWHERE about how people have died falling from the summit (hence the railings). But nevertheless; human stupidity can not be underestimated. We enjoyed the summit from the railings and then proceeded to watch as people.. and more people.. and more people after that, jumped over the railing to get photos of themselves inches from the edge of the summit, kissing their spouse, and then scrambling back to the railing when the wind gusted. It was nearly unbelievable how people had no respect for the severity of what they were doing. It did take away from the experience of the beautiful mountains. I halfway expected to watch someone tumble down a mountainside. It is absolutely worth the hike- not worth dying for.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Great views without going to top", "Going to the top of the Rock is by a stairway which is pretty safe but may be a physical challenge. If you stop at a couple of levels up the stairway you can see beautiful mountains in the distance and there is a map that identifies the mountains in the range. One of these is Mt. Whitney, so that is really cool. Just take your time and get to this point. You will be well rewarded.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Interesting site", "Even if you don't want to go all 400 steps, there is an area about 100 steps up that provides a very good view. Also, you may want to walk up the road from the parking area to get some good pictures."], ["Reviewed September 20, 2017", 5.0, "Stunning!", "There is parking for Moro rock and a well signed trailhead. The walk up is very steep and with hundreds of steps, with steep drop offs to the sides. If you have any mobility problems or are scared of heights then this is not for you... if however you can manage both this is a fantastic place to get stunning 360 degree views from the top.\nIt is quite busy so you will have to 'give way' to others on the steps, as in places they are only one person wide.\nWhen you reach the top there is a narrow platform where you can see all around, and it's absolutely gorgeous.\nWe saw some young people up there climb over the railing to get a shot of them jumping in the air right at the end of the promontory - very scary (and dangerous) - one slip on landing and they would've tumbled all the way down into the valley. Very silly, please don't do this! Your life is not worth a photograph...\nOverall this was one of the highlights of our stay in Kings/Sequoia, highly recommended\nShow less"], ["Reviewed September 19, 2017", 5.0, "Awesome", "A very strenuous and scary climb but the views are so worth it. We hiked to Moro from the museum and it was about 5 miles round trip."], ["Reviewed September 18, 2017", 5.0, "Best views of sequioa", "Went at the beginning of spring, so we had to park at Giant Forest museum and walk up a road that hadn't been cleared of snow yet. Trail pretty much followed the road right upto the base of the outcropping. Saw some cool trees on the way. The hike up the rock is pretty steep and there have been steps carved into the rock face. Views are phenomenal with 360 or nature around. Totally worth it, and the top or some intermediate spots make a nice lunch stop.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Rock the Bells", "About my situation: mom, son(8), daughter(7). Me, active and have a full exercise routine 4.0 hours weekly. My kiddos, active in sports. For us this was an adventure with minimum oxygen effort.\n\nTraveled in September. Weather forecast said 50 degrees, it was actually 68 degrees. Our clothing was pants, long socks, light long sleeve cotton shirt, and light jacket tied around our waists. Each little one has a camera because they are required to make the fun into learning and this works for sustained engagement!!\n\nFor those who are physically inactive-may be a slight challenge. I recommend parking at Giant Forest Museum, warming up on the 1.5 hike and the stairs will be more than doable. Hike is easy to moderate on trails. Highly managed trails...your park fees are honored and taxes dollars are at work.\n\nWhat can one say about majestic nature? So I will add a different nuts and bolts to Moro Rock. On the drive from Visalia there is a picture scenic point that you don't want to miss. You can take a picture of the rock to get its full view at a scenic point across the forest. After you arrive to Moro Rock, the picture turns into reality and bliss. By the way, do this first, then visit the Giant Forest trails.\n\nThis is not a consecutive 350+ stairs. Each section ranges from 6-20 steps at a time, turn breaks, walkouts to rest and even sit, walking curves, with flatter surfaces and grooves in the rocks. My kiddos said it felt like walking on a flat ladder. It can get tight up/down the path when passing others. A few neat rocks look like \"hiding places\". We took many pictures under these unique rock formations. Kids gotta have fun and adults have to remember \"the kid in them.\"\n\nYou will unlikely get a workout because of so many visitors and each persons pacing is varied. Please be patient as the goal is the stair challenge to reach the top not really to get a fitness rush.\n\nThe following itinerary took us 2.0 hours, comfortably, with lots of stopping at all sites, eating for 15 minutes, taking pictures like the most wanted celebrities and sidetrack picture moments.\n\nRecommended itinerary to avoid crowds and maximize time:\nCheck in at Giant Forest Museum and look at Ranger schedule. Be mindful of a\n1 or 2 pm tour. Arrive at Moro Rock 10 am or earlier. After Moro Rock then take the walking trail to Hanging Rock (.4 mile). After enjoying this much needed to see natural phenomena, walk back toward Moro Rock and see the Roosevelt Tree (.4 mile). Hop in the car and go to Autolog, then go to your ranger tour at Giant Forest.\n\nDistance from Giant Forest Museum: 1.5 miles hike (easy to moderate)\nTime to walk: In the mornings before 10 a.m.\nParking: Minimum in the lot but you can park alongside the road.\nRestrooms: One toilet for males, one for females\nShaded limited seating bench at the base of Moro Rock in case someone comes along and changes their mind.\nAbsolutely a treasure for all.\nShow less"], ["Reviewed September 14, 2017", 5.0, "WOW amazing views!", "Its well worth the 400 steps to climb to the top. The views were amazing although you don't necessarily need to climb to the top to get a great view."], ["Reviewed September 13, 2017", 5.0, "my personal favorite of the road trip", "recently did a road trip starting from reno, through california, ending in las vegas. of all the parks we visited, this was my personal favorite.\n\nthe hike up the rock itself was pretty fun. beautiful views at sunset.\n\na warning though.. there is no shuttle down after 6p, after sunset when there are a ton of people that hiked through the trail. this made no sense to me as it would have been really dangerous to hike through the woods in the dark. a bunch of us walked all the way back to the bottom in the dark on the street. very dangerous as the cars were speeding down without care.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Old folks climbed to the top", "Great climb, beautiful views, not to be missed. I counted 357 stairs to the top, but travel guide says 400. Either way, it is a steep, fun climb to the top and really not that hard. Wife and I are 67 and we thought it was a ball.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Fun HIKE!", "This is a moderate to difficult hike, but with a great view. It was an exciting fun hike. Not for people afraid of heights."], ["Reviewed September 7, 2017", 4.0, "Great view...beware of flies", "The view is amazing, but when we went on Sept 5th, there was an insane amount of flies in the parking lot up to halfway up. Taking to a ranger, it's been a problem for the past 2 weeks only."], ["Reviewed September 7, 2017", 5.0, "Great climb", "Moro Rock is a great climb up to 6,800ft. It's not usually crowded, but be mindful of the weather. If you hear thunder, or it's raining hard, you might want to think twice about climbing up there. Lots of exposure and slippery rocks could lead to a bad experience. When it's dry and clear, it's absolutely gorgeous up there with expansive views of Sequoia National Park and Sierra Mountain Range.\nShow less"], ["Reviewed September 7, 2017", 5.0, "AWESOME views, be sure to go on clear day", "If you have a fear of heights, this hike is certainly not for you. There are something like 400 stairs going up, and you end up at the top of the rock with 360 degree views that are GORGEOUS. It is quite sad because you can see the \"brown cloud\" of pollution, and we could also see smoke from a nearby fire. There was a ranger at the top of the rock answering questions, which was also really cool. This was definitely one of my must-sees of the park!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great views all around", "Went up this thing to see the sunset and it was totally worth it. We were initially hesitant to go up since we were tired towards the end of the day but we kept going up inspired by the new views after every little climb. You get to see mountains, valleys and ridges all around and the sunset makes it all the more beautiful. Nice point for landscape photography.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Excellent view! Don't miss out!", "Great view and gives you a sense of the size of the national park. The hike is short but up a mountain with lots of steps. The trails are well maintained and has guard rails on the whole path. Tennis shoes or hiking boots are good.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Challenging but worth it", "We did this hike when it was pretty warm out, and it was a little challenging but totally worth it. The views are amazing. It is a very popular hke so there is a lot of people and you have to sometimes wait for people to pass. Its about 400 steps up and a steep incline so go slw and take a break if you need it.\nShow less"], ["Reviewed September 6, 2017", 5.0, "The views!", "Fantastic views, but very crowded in July. It takes a long time going up and down since you have to wait at practically every corner for people going the opposite way to pass."], ["Reviewed September 6, 2017", 5.0, "Great time hiking up to the top - great views", "It's 400 steps up to the top. It was a fun adventure and the views at the top are great. It was tiring as well but worth it."], ["Reviewed September 4, 2017", 4.0, "Great view", "Great views. Was recommended for sunset, however... There was much more room and a way shorter walk to watch from hanging rock at the same parking area. No one else there"], ["Reviewed September 3, 2017", 5.0, "Fantastic hike to a vast vista of the park", "We did the walk to the Moro Rock and found the hike serene and relaxing, with no one else around. The climb up Moro Rock itself was tiring, with many steps, and a bit scary, being so close to the edge of a sheer cliff. But the view from the top was totally stunning in its grandeur. You get a fantastic view of the entire park. It is definitely worth the climb\nShow less"], ["Reviewed September 2, 2017", 5.0, "a must", "very cool and amazing you can actually walk up, doesn't take too long but yes parking is very limited"], ["Reviewed September 1, 2017", 5.0, "Stunning views", "The rock is reached by shuttle or car, off one of the roads near General Sherman tree. We found a parking space easily but we were very lucky, and spaces were quite limited.\n\nThe climb up c300 odd steps was safe and the steps have rails / stone barriers all the way to the top. The climb does get a bit narrow in places but we never felt unsafe. The rock is at altitude, meaning the air is thinner and you can become out of breath fairly easily if you walk too fast.\n\nIt is worth making the climb as the views are quite spectacular and the park is just stunning.\n\nThis is definitely worth the effort\nShow less"], ["Reviewed August 29, 2017", 5.0, "Great views", "Car parking is limited which is a good thing as congestion on the paved path to the summit will be a problem at busy times. It is well worth the effort of getting up there for the amazing views. A very 'safe' and short adventure .\nShow less"], ["Reviewed August 28, 2017", 5.0, "Brilliant views", "This is so worth a visit! We walked to the rock from the Giant Forest which I would highly recommend with older children ( ours were 9, 11 and 14). The climb up is steep and not suitable for people with vertigo but if you can stomach the height then the views at the top are 360. Well worth the climb!\nShow less"], ["Reviewed August 27, 2017", 5.0, "CAMPING ⛺️", "We went camping at the Lodgepole and was told that we must go see the sunset at this place \"Moro Rock\"\nWhat an amazing place! DO NOT MISS THE OPPORTUNITY TO SEE THE SUNSET HERE.\nI must say, I didn't expect the amount of stairs and I was not prepared physically. I almost gave up on my way there, but I'm so glad I didn't. Sunset was around 7:30pm and we got up there exactly in time to see the amazing view of the sunset.\nIncredible beautiful and worthy!\nShow less"], ["Reviewed August 27, 2017", 5.0, "Hanging Rock - just before Moro Rock", "Just before you reach the base of Moro Rock, there is actually another equally good view point with a small parking area on the right and a sign indicating parking for Moro Rock, although if you park here you'd have to walk a bit. Note the tiny wooden \"Hanging Rock, 0.1 mile” sign, pointing towards a narrow trail. We had no idea what this was but went up anyway since 0.1 miles was no big deal. Turned out to be a really fun spot, with a big rock seemingly coming from nowhere teetering on the edge of the cliff. And the view, including that of Moro Rock, was fantastic. It's a most rewarding hike that doesn't require much effort or battling the crowds. Worth a stop if heading that way whether or not you plan to climb Moro Rock.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Spectacular View!", "The over 350 stairs is worth the climb to the top. The view is breathtaking.\n\nThe free sequoia shuttle will drop you off right at the stairs and you can start you ascent to the top! People are coming down and going up at the same time.\n\nWe climbed to the top midday and it was hot! Bring plenty of water with you.\nShow less"], ["Reviewed August 24, 2017", 4.0, "Amazing experience if you can beat the crowds.", "This is definitely an unforgettable experience if visiting Sequoia National Park; the view from the top of Moro Rock (6,725ft above sea level) is spectacular and absolutely worth the steep four hundred step climb. However, the stairs weren't built to the accommodate masses of tourists traveling both ways so I highly recommend you arrive as early as possible to avoid the crowds. We ran ahead of a large tour bus group, which made for a relaxing ascent but a miserable descent. Even one large tourist group can congest the entire stairways up.\n\nThis is also a good place to stop for a picnic lunch; there's restrooms and tables nearby with plenty of shade. Though there is some parking, I'd recommend parking at the Giant Forest Museum and taking the trail to Moro Rock that also follows the shuttle path. You'll see some spectacular Sequoias and plenty of wildlife as the trail itself has always been devoid of any real traffic when we've taken it.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Fantastic view", "The view was stunning. Will warn people are afraid of heights like myself. Climb up was a little scary. There are side rails for the most part of it but don't look down! Worth the trip up."], ["Reviewed August 22, 2017", 5.0, "Be ready to climb !", "400 steps to the summit. You will be presented with spectacular views of the mountains. The view of the winding roads from the top is awesome! It takes about 30mnts to get to the top and is worth the climb. Experience it!"], ["Reviewed August 20, 2017", 5.0, "Amazing views", "350 steps up to the top. Gets a bit harder to walk the higher you get but lots of hand rails to make you feel safe. Worth the views at the top."], ["Reviewed August 17, 2017", 4.0, "Great views.....but you can get great views in many areas.", "This is a well maintained area and the climb to the top is not overly difficult. There are steps and handrails. There are others areas at which to get great views throughout this park. The parking area is small so can get congested. You. Any want to consider the shuttle service of the park.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Go early in the day!", "The hike is short but strenuous with wonderful views. We actually came just shy of the top because lightning rolled in pretty quickly and I certainly didn't feel very safe standing on a huge rock. I would suggest coming early, not only for the crowds, but also to avoid afternoon storms. You also have to really watch for others on the trail. Quite a few people bumped us in their rush to the top.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Fantastic", "We're a family with kids age 10, 12 and 14. All off us loved this walk/climb. Really not difficult to get up, lots of steps and hand rails but really beautiful views. Definitely recommend to do it!"], ["Reviewed August 15, 2017", 3.0, "Nice point of view", "Of course it's a nice point of view but it's not the main interest of Sequoia park. By definition if you go to Sequoia it's to see Sequoia. The best way is to hike along the congress trail"], ["Reviewed August 12, 2017", 5.0, "God love the encouragers of the world!", "390 steps of concrete or stone to the top of Moro Rock, but it doesn't need to be a foot race. My husband quickly followed our grandson who practically scrambled to the top. I stopped to \"enjoy the view\" and catch my breath several times....plus, I'm afraid of heights, as well. Other tourists were SO polite and encouraging, stepping to the side when some needed to pass through narrow spaces or turns and telling me \"you can do this!\" or \"you're over halfway already!\" To reach the top was such a victory for me!\nTip: the handrails can be very hot in full sun, so steady yourself by grasping the upright posts instead.\nShow less"], ["Reviewed August 8, 2017", 5.0, "GREAT FOR THOSE NOT AFRAID OF HEIGHTS", "Moro Rock is a granite protrusion on the edge of the Giant Forest. I am afraid of heights, but decided to give it a go. The trail, including it’s 350+ steps is only ½ mile round trip, after all. I made it up the first 50 steps or so, just to the point where I caught a glimpse of the valley (straight down) on both sides at the same time and quickly decided that this was as far as I was going. Luckily, just beyond this point was a viewing area with interpretive sign. I parked myself right there to enjoy the beautiful view of the snow-capped mountains in the distance (definitely worth it) and waited for my family to complete the hike up and back.\n\nAccording to them, the rest of the trail was simply traversing the side of the rock, eventually ending up on the top. The trail is well constructed, but sometimes only wide enough for one person to pass. You are completely exposed as you head up, but there are sturdy safety rails on both sides. They said the views are beyond words, as you can see 360 deg. I’ll take their word for it!\nShow less"], ["Reviewed August 8, 2017", 5.0, "Worth the climb", "I was a bit anxious about doing the climb as I hate heights and have vertigo. However, I found the climb was not as difficult as I thought and it was a great feeling of achievement getting to the top. The view was spectacular and I would encourage people who are hesitant to do this to give it a try.\nShow less"], ["Reviewed August 5, 2017", 4.0, "A serious climb to a fabulous view", "It is a properly surfaced path with lots of steps. There is a rail for much of the way - but not all. There are good views from about halfway up - just before a bit without handrail.\nThere is a good surfaced car park at the start, but no other facilities.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Short steep railed stepped climb but great views", "Good family climb, made with 10, 14 and 16 yr olds. Great views from the top, but not for those scared of heights."], ["Reviewed August 1, 2017", 5.0, "Excellent view", "We really enjoyed this one, At first it looks like a lot handle for some people , but at the end it wasn't as difficult at it appears. One just need to take easy and enjoy the view.\nTo get here you need to take the shuttle (route 2), no access to private vehicles here.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Amazing and Scary", "Took my fiancee and kids (9 & 6) on this hike. My fiancee stopped a little ways before the summit as it was getting so high and the path was so narrow. The kids and I trekked on and made it to the summit. The views are absolutely amazing and totally worth the death defying climb. Trust me, there are spots where I was concerned with the kids because there was only some well placed rocks about knee high between you and a fall you won't survive. Definitely not for very young kids or for those with fear of falling or heights.\nShow less"], ["Reviewed July 27, 2017", 5.0, "300 + Steps to Great Western Divide!", "Our Sequoia Sightseeing driver made certain we all had a chance to climb to the top of this incredible site. Some could not negotiate the many tight, stone stairs as we already started at a significant elevation. Climbing up 30 stories is one thing. Doing so at a starting high elevation is quite demanding. But after stopping to catch our breath many times - as did the younger folks as well (we are 69, but in decent shape) we were able to reach the top where the view literally did take our breath away. Awesome! Incredible! Amazing! Clear views of the mountain range which comprises the Great Western Divide. And those Mountains had snow on them in late July!\n\nIf you are visiting Sequoia, don't miss this fantastic opportunity!\nShow less"], ["Reviewed July 26, 2017", 5.0, "Best View in Park!", "Outstanding and accessible, a rock stair and railing supported climb up a rock promontory with fantastic views of the Sierras and King's Canyon. Can be intimidating if you're bothered by heights, to be avoided in rain or when lighting is possible, but very well worth the relatively short hike up!\nShow less"], ["Reviewed July 26, 2017", 5.0, "Loved this hike! So beautiful!", "My family of five aged 9-43 did this hike while visiting the park. It is a lot of steps so we needed a few rest stops along the way. The view was fantastic!! We went up when it was sunny. An hour after we left thunder clouds rolled in and rain. Glad we did it when it was clear. There are warning signs about risk of lightening. We would definitely do this again. There were quite a few people so it was a little crowded.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Great hike if you can handle heights", "Views were amazing but the height was a lot to handle and I don't have issues with heights. Great physical challenge to climb the over 400 steps but viewwas amazing!"], ["Reviewed July 22, 2017", 3.0, "Did Not Make It To Top", "My husband and I both have a fear of heights. We made it over halfway but stopped when the metal hand rails ended and there were just low rocks on the side. I wish they'd put the hand rails up all the way to the top. We still got some good views even if we didn't make it to the top. Seems to be a pretty popular attraction.\nShow less"], ["Reviewed July 20, 2017", 3.0, "Would Have Been Better Without the Fog", "Unfortunately we went to Moro Rock in the early morning and the fog was so thick we were unable to see the views. The parking area does full up and becomes one way so that you need to exit the area and make a big loop in order to circle around. Make sure you stop at hanging rock before Moro Rock so you do not have to backtrack.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Worth the steps", "Moro Rock is an easy climb for those not afraid of heights. We had a 9 year old and a 12 year old. They climbed this with no problem. Just be sure they understand the height dangers..the trail is pretty well guarded from falls if you stay on the trail. Sometimes you have to wait to let people pass coming down, but all in all the views are so amazing and the climb is worth every step. Enjoy!\nShow less"], ["Reviewed July 17, 2017", 5.0, "Great Views", "This short hike climbs up just over 400 steps to the top of Moro Rock. There is a hand rail and anyone in reasonable shape including kids can do it. It offers incredible views of the Sierra Neveda mountains and the surrounding area. It is busy so either take the shuttle or come early or letter in the day. Even the shuttle filled up and we had to wait for the next one. There is a bathroom and some benches at the trailhead. The trail is entirely on rock or concrete steps so it is best to avoid it when it is wet or icey. There are also signs saying to get down if there is lightning. Great short hike with amazing views!\nShow less"], ["Reviewed July 15, 2017", 5.0, "View of Views!", "Spectacular views of many of the peaks on the eastern side of the Sierra. A stunning site below as well as across to a series of 12,000-13,000ft. mountains. Fairly easy climb up the stairs but there are a few twists and turns that make you realize why this is not suggested for those afraid of heights!\nShow less"], ["Reviewed July 14, 2017", 5.0, "More than just trees in Sequoia", "We loved the Sequoias and Redwoods, but the Moro Rock hike and last 400 steps provided it all. We hiked the less than two mile trial through the forest which provided beautiful up close views at the trees. Then we came to the last 400 straight uphill steps to the peak of Moro Rock. Worth every bit of effort it took to reach the top. It is tight and a bit crowded in some spots-you will have to take turns passing through some of the passages. But the views at the top were gorgeous. Make the effort no matter how long it takes to get to the top. You'll be sorry if you don't.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Don't miss this!", "This was the first thing we did upon entering the park. A fairly quick and easy climb up steps to a breathtaking view of the high Sierras. Bring your camera for some gorgeous shots."], ["Reviewed July 14, 2017", 5.0, "a view worth the hike!", "We were worried that our young children wouldn't be able to make it to the top, but my husband and I were the ones trying to keep up! :) It was a bit harrowing since people are going up and down the same steps and it is awkward trying to pass. It is also easy to get out-of-breath, but the view and the bragging rights are worth the perseverance! Climbing to the top was one of our family's favorite memories from our time at Sequoia!\nShow less"], ["Reviewed July 14, 2017", 5.0, "Amazing view!", "Worth the small walk up the 400 steps take it easy with the heath though have seen a lot of people start of quickly and passed them on the way up. The view over Sequoia is amazing!"], ["Reviewed July 13, 2017", 5.0, "Moro Rock On to the Top", "Moro rock is a great quick way to tour the top of a classic Sierra Nevada granite dome. There are steps to the top and unless you are really scared of heights you can probably make it. Once you reach the very top the views will scare someone who is afraid of heights, but there are railings all the way around and no real danger of falling.\n\nThere are something like 400 steps to reach the top and in a few places it is a bit of a squeeze. It is about a 10 to 15 minute trek to the top - depending on how in shape you are. I spend about 10 minutes on top and descended in about 10 minutes. So think 30 to 45 minutes for the whole stop.\n\nViews from the top of the rock are stunning - look over to higher mountains in the Sierras. Unfortunately Mt. Whitney is obscured by other peaks. Look down to the Kiwaeh River far far far below.\n\nI would suggest taking the shuttle bus from the Giant Forest Museum. We didn't and got lucky but it was a Monday when we visited. I am sure that later in the summer or on the weekend it would be a must.\n\nBest part was that as we were leaving we spotted a mother bear and her two cubs. They were playing and having a blast. We watched them for 15 minutes with other clueless motorists getting perturbed we were blocking part of the road until finally the shuttle bus came and when they stopped to let the passengers get a look a bear jam was started. See my photo of one of the little cubs after their sparing session.\nShow less"], ["Reviewed July 13, 2017", 5.0, "A rewarding quick climb to fantastic views", "I was short on time so I went up quickly and found myself huffing and puffing, but I didn't want to miss this view. Even with just a short stay up on top of the rock I'm glad I went up there; had I gone to Sequoia National Park and not been up there I think I would have felt like I missed out on one of the park's signature attractions.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Awesome view, easy climb, grab the bus if short on time", "Our family of five, kids ages 15, 12 and 9 visited the Sequoia National Park in June. We took the visitor bus to the base of Moro rock because it was late in the afternoon and we wanted to have enough time to get to the summit before closing time. Otherwise, we would have enjoyed the hike there very much--super easy, paved, lots of shade from the forest. The hike up Moro Rock is quite easy as well, most of it is steps and there are handrails to keep you safe. Towards the top, the path is not for the faint of heart. But the view from the very top is amazing. We could see for miles and miles. A thunderstorm was on its way, so we had to cut our visit to the top short to stay a safe distance from the lightning.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Vacation", "Beautiful. If you are afraid of heights not for you. My family hiked it and said was beautiful Remember to bring snacks and water. Use the bus system as parking is very small"], ["Reviewed July 7, 2017", 4.0, "A Big Make that Huge Rock", "Moro Rock is impressive in that is is huge. While some people go there to meditate, photograph, or just sit and stare at it, it is what it is, a HUGE ROCK formation.\nThe beach areas surrounding it are plentiful and uncrowded, even with a lot of people. The surrounding area has some keen points of interest, a bathysphere, fish shops, etc. there is more than just the rock.\nWhen viewing try to do the climb, on this trip we were unable and therefore the lower rating. Had we been able to locate the means to climbing the rock, we would have most likely given it a 5 star rating.\nFrom the ground/sea level view, it was nice but a little disappointing.\nMaximize your visit, research the climb and do it.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Gorgeous Views, Not For Those Afraid of Heights", "My family started our trip us the rock with intentions of making it to the top. My brother was the first to get too scared and stop. My husband and girls stopped about 1/2 way due to the height and waited. My son and I made it to the top, while I had a death grip on him and he was always on the inside. The views of snow capped mountains in the distance were gorgeous. The climb was not bad at all for us, It just made us nervous with the kids. There are gorgeous views all the way up no matter how far you make it.\nShow less"], ["Reviewed July 6, 2017", 5.0, "June 3rd visit.", "My daughter and I visited Moro Rock on June 3rd, reaching the top around 1:30pm. We had hiked over to Moro Rock on the trail from the General Sherman tree. A very nice hike. It was quite busy on Moro Rock at that time. Quite a bit of waiting for people at certain points on the climb. But people seemed quite patient and respectful while we were there. We enjoyed this hike. It was not too hard of a hike. Just lots and lots of steps. And the view was pretty cool from the top. I would hike it again.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Worth the climb", "There are a lot of steps to get to the top, but it's worth it for the view. Best to go in the morning, before it gets hot...and before it gets too crowded."], ["Reviewed July 5, 2017", 5.0, "A great view - those with a fear of heights be warned", "This short trail climbs about 380 stairs carved into the granite of Moro Rock and you end up on top of the 6,500 foot in elevation rock that overlooks the canyon below and can see East to the High Sierras and West to the San Joaquin Valley to the West. The hike takes the better part of an hour to stop and look around and appreciate all around you. There is a railing or rocks around you the entire way. I am a bit scared of heights but felt ok because of the railing and rocks. There are multiple warnings of going if the trail is wet or if dark storm clouds are above. I would highly recommend wearing decent shoes (not flip flops as I saw others wearing them slip) as it can be a bit slippery at times coming down. I also saw a family start up with a toddler who was throwing a tantrum - not a safe idea. I really enjoyed this hike, and felt like I conquered some of my fears by doing it.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Too cool", "We traveled in our motorhome from Collierville , TN which is outside Memphis & camped in Three Rivers. We rented a car to see Sequoia, Yosemite, & Kings Canyon. I think Kings Canyon was my favorite Park. Moro Rock is a must see attraction there. Easy to get to. Beautiful view of the river.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Western Divide...What a view!", "Must see! We hiked the trail from the museum than up Moro Rock...a lot of steep steps to an incredible view..360 degrees"], ["Reviewed July 4, 2017", 5.0, "Great Views", "We got there early before the crowds set in. After making our way up to the top - the stairs were not difficult - we had the rock almost to ourselves. Stunning views, particularly of the Sierras.\n\nWe drove through the area the next day when parking controls were on at all the shuttle sites - when people were lined up for shuttles and parked further down the road. I suspect it would have been much different if we had gone to the rock then.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Tough but worth it", "Its a long hard pull to get to the top of Moro Rock but its worth it. It was a beautiful day and pretty crowded but we still had a great time and a good feeling after making it all the way to the top."], ["Reviewed July 3, 2017", 5.0, "Feeling of accomplishment", "This is a moderate to tough hike, and not for the faint of heart. There are over 350 steps you will ascend, as well as inclined paved trail. The reward is the second best view of Sequoia National Park. (Little Baldy is the #1 best view.) There is a railing at the top, but do not expect much in the form of \"railings\" as you climb up the stairs. There is a precarious section with a 500 foot drop to the side of the trail. The top has enough room for about 80 people maximum, so be prepared for sardine-like crowds on weekends. We received a tip from the Ranger in the Lodgepole Visitor Center that the best time to climb it is after 5pm, because most people are ending their day and the last shuttle leaves at 6pm. Be prepared to have trouble finding a parking spot with your own vehicle. The lot is very small and only has about 30 spaces. There are some gross pit-toilets if you have to use the restroom. BRING WATER! We did not see any water refilling stations here. There are no bear boxes, so take all of your \"smells\" items with you. Bears have been known to break into cars here. After our hike, we drove to Crescent Meadow, about a mile or two away, and had a bear cross the road in front of us on the way there.\nShow less"], ["Reviewed July 3, 2017", 5.0, "DIdn't make it to the top but the view we had from half way was wonderful!", "We took the park shuttle to the Moro Rock and did a short hike and then up and up to more and more wonderful views of the park - it was wonderful."], ["Reviewed June 27, 2017", 5.0, "Huge chunk of granite", "Moro Rock is a huge chunk of granite. There are 350 steps to the top where you have a 360 degree view. The Sierra Nevada mountains are to the east. The Valley to the west. If you aren't up for climbing 350 steps, you have a nice view from 100-120 steps up. You can see to the left and right and Moro will be in front of you. Beautiful!\nShow less"], ["Reviewed June 25, 2017", 5.0, "Well worth the climb", "Amazing views form the top - as long as you don't have a fear of heights! Carefully carved steps to help you on your way."], ["Reviewed June 24, 2017", 5.0, "Go to the Top", "The view from atop Moro Rock is fantastic. The walk could be a bit challenging for some, but take it slow and remain motivated by the incredible views. A must see."], ["Reviewed June 21, 2017", 4.0, "Worth the climb to reach the top.", "Yes this place is very special to be hold. I and my wife were just in awe of the beauty in each way we looked as the sky was clear and air temps were cool near 82 f. The climb up is kinda tough for us flat landers in our fifties. Though well worth it rivers flowing with white water, snow on mountain tops, and so green now. Hurry to take time getting there and slow down once there.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Stunning views", "If your visiting Sequoia National park you have to go to Moro Rock. It's quite a trek up the steep steps but worth it once you reach the top. The steps are often narrow and only a small hand rail or rocks to protect you. The views are outstanding, totally stunning!\nShow less"], ["Reviewed June 21, 2017", 5.0, "This is a must at Sequoia National Park.", "Best hint: save it for early in the morning or late in the afternoon. This is a super crowded area of the park. During the summer season, cars are not allowed to drive to Moro Rock. Visitors must park at the Giant Forest Museum and ride a shuttle. If you wait until after 7:00 pm, the road is reopened to visitors and you can drive to Moro Rock and the Tree Tunnel. Do not be intimidated by Moro Rock. Take your time ascending the stairway and enjoy the views. There are railings the whole way to the top.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Beautiful views!", "You don't have to go all the way to the top to get to the great views. We went about 1/3 to 1/2 way up the steps and had a GREAT view on both sides of the rock! We were able to take some great photos!\nShow less"], ["Reviewed June 14, 2017", 5.0, "Good view of the Great Western Divide", "If one is not afraid of heights, this is a good hike to see some beautiful country. This will be your best view of the Western Divide. However as I said, if you have a fear of heights, this is definitely not for you. Moderate endurance on the hike is required so if you're not in good shape just look at it from the parking lot! It is neat to see though. We hiked about half way up and had to stop due to the height issue.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Fun short hike", "Some steep climb, but it was a fun hike. The view on top was fabulous. Well maintained trail, perhaps not good when wet."], ["Reviewed June 11, 2017", 5.0, "Great climb, what an effort they did!", "This is a huge rock that has stairs all the way to the top. It has around 360 steps and the effort that it took to build these stairs and railing is incredible. Great lookout at the top. Take your camera."], ["Reviewed June 11, 2017", 5.0, "What a view", "The day we were there our view was above the clouds(as if we were in an airplane) but this made it so unique. I imagine the view is amazing on a clear day too. There are a lot of steps.....but so worth it."], ["Reviewed June 11, 2017", 5.0, "Great view, good workout", "Well worth the climb. Take water! My legs got a great workout and were shaky a while afterwards. It is a strenuous hike up even if you are in decent shape. Enjoy!"], ["Reviewed June 9, 2017", 5.0, "Exhausted", "Take some water and take your time. There's over 350 to 400 steps till you get to the point. But once you're there the view is so beautiful and spectacular, you'll forget about how tired you are. Forgot to take a picture but you forget to do that when you're here\nShow less"], ["Reviewed June 7, 2017", 5.0, "Mother Nature's Stair Stepper.", "It's about 350'steps to get to the pinnacle where the new of the snow capped peaks of the Sierras stare you in the face and the work is well worth it. If you go during the week, you can drive to the parking lot whereas on the weekend, you have to take the shuttle. Either way, put this on the list of things to do early because the stairway in places is very narrow and there are several choke points that can be frustrating if you don't like to wait on others.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Amazing views from top", "Is located near museum parking lot. We tried two days to park near parking lot to take shuttle up to Moro Rock but ran into parking issues. Recommend you park at General Sherman Tree parking and take shuttle to museum and transfer to Moro rock shuttle. Again earlier day is better. Lines form fast. Moderate level hike up. But worth it\nShow less"], ["Reviewed June 6, 2017", 5.0, "Must visit place", "This is the best part of the park. 400 steps mentioned by the officer at the visitor center. Must reach to the tip of the rock n see the beauty of kings canyon. Bit tough to reach to the endpoint for elders but if push yourself bit you can feel the beauty of nature.. snow capped mountain n downside roads n River views...\nShow less"], ["Reviewed June 4, 2017", 5.0, "Breath Taking!", "This is a must see at Sequoia NP. It's a 400 step climb to the top, but it is very safe ... by NP standards. Railing or stone walls all the way to the top. Steep in some areas, but there's no hurry. From the top, you have a 360 degree view of the Sierra Nevada Mountains.\nShow less"], ["Reviewed June 4, 2017", 5.0, "This is a must!", "There are two main reasons to go to Sequoia: see the General Sherman sequoia (and the other ones) and climb to the top of Moro Rock. It is about 325 steps to the top on a winding, scary path cut into the rock. For a person who doesn't like heights, like me, it seemed very treacherous. However, the view from the top was amazing! Don't miss it!\nShow less"], ["Reviewed June 3, 2017", 4.0, "Worth it!", "A fairly short but challenging climb up a clear, solid path with railings. Great views on a clear morning. Arrive early for parking at bottom of rock as less than 15-20 spaces available. The sugar pine trail to crescent meadow is at base of rock if 3 mile round trip hike with some elevation changes desired.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Worth the climb", "The view is worth the climb. Good trail with hand rails often. Beautiful view from the top. Recommend this."], ["Reviewed May 30, 2017", 5.0, "I made it to the top", "Definitely a fun walk up lots of steps. The views from the top are excellent. This was not a difficult walk. Remember to bring lots of water with you on the trip."], ["Reviewed May 29, 2017", 5.0, "Not for the faint of heart", "Of everything we did at Sequoia over Memorial weekend, this by far provided the scariest, but also the most magnificent views. I didn't make it all the way to the top because I got a little scared of how treacherous I felt the climb was, but I made it most of the way and regardless of not getting to the top, this is a MUST see and absolutely beautiful. Make sure to arrive early, parking is limited.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Amazing", "Must see for Sequoia National park. The climb to the top is daunting but worth it if you can manage. No elevators and not for the disabled. Can be scary."], ["Reviewed May 28, 2017", 4.0, "Awesome view! Don't bother though if it's foggy.", "We almost didn't make it to Moro Rock due to some crazy thick fog the first day we tried. We could hardly see the front end of our car, let alone any kind of view from the rock. But it cleared up a little the next day and so we gave it a go. Boy was it worth it! It's a bit of a climb, but the trail was pretty good and good handrails. Definitely a must for you sightseeing list!\nShow less"], ["Reviewed May 27, 2017", 5.0, "Majestic Rock", "Moro Rock is located inside the Sequoia and Kings National Park. It is a steep climb with about 250 steps up. As you go up, the view is breathtaking at the top. You are above the clouds with a view of the natural surroundings of the Park. Please take you time and some water on the way up.\nShow less"], ["Reviewed May 27, 2017", 5.0, "GREAT view for the hardy!", "If you are willing to climb about 400 steps to the top, this has an awesome view of the area! A great place to take photos, too."], ["Reviewed May 26, 2017", 4.0, "Steep Climb, Beautiful View", "Do not attempt if you are not fit. Please take water you'll need it, and make sure you have adequate shoes, not flip flops. This is remote climb with no facilities of any sort.\n\nThe climb is at least 400 steep steps on a very narrow rock path with no hand rails. Take your time and take breathers on the way up. Don't worry there will many others doing the same!\n\nAt the very top, the view and breezes are breathtaking. If you are at the Lodgepole Visitors center, there is a photo taken in the early 1900s with a group of \"NATURALISTS\" that made the climb. The females were hiking in dresses and high heels!\n\nGorgeous view but the climb could be made much safer with hand rails.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Nice town", "Had trouble finding reasonable hotel prices during annual event weekend but overall the town very nice ,has neat waterfront with lots of access to views, shops, restaurants and more shops. A neat place was the garden and nursery shop."], ["Reviewed May 24, 2017", 5.0, "WOW!", "If you can climb stairs, that's all this is. For a long way. With crazy drop-offs on the side of a cliff. With incredible views. But only if your not afraid of heights. And only on a sunny day."], ["Reviewed May 17, 2017", 5.0, "Beautiful views!", "You don't have to climb too far to get a gorgeous view of the surrounding mountains and valley. It's a safe climb."], ["Reviewed May 16, 2017", 3.0, "Fantastic views after a tough climb", "Can get crowded---and the viewing area at the top is quite small. A few places to rest on the way up, but not much really. Parking area was crowded early and folks were parking along the exit road Worth the trip up though!"], ["Reviewed May 13, 2017", 5.0, "Stroll to the top and be inspired", "Nice parking lot and step lead you up to the top for a spectacular view of the valley below. Bucket list."], ["Reviewed May 12, 2017", 5.0, "An exciting and rewarding experience", "The climb to the top of the Moro Rock outlook is by means of steep steps carved out of the solid stone. There is a guard rail to assist visitors. The wide ranging view from the top in good weather covering a good section of the Sierra Nevada is well worth the effort. Notices suggest that visitors should avoid the exposed location when electrical storms threaten to strike the area!\nShow less"], ["Reviewed May 7, 2017", 5.0, "Great fun", "This little walk up a lot of steps is really fun. The views are amazing, and the construction of the steps is something to see: they blend in well and are ingeniously incorporated into their surroundings.\nGo early, when it's not so crowded, if you can.\nShow less"], ["Reviewed May 3, 2017", 5.0, "Fantastic Little Adventure", "A short, steep climb up to the top of the rock rewards you with breathtaking views in every direction. Definitely one of my favorite things to do in Sequoia National Park!"], ["Reviewed May 3, 2017", 5.0, "Beautiful but terrifying", "This steep incline paired with the think air, makes for an exilerating climb. At times, I felt I could plummet to my death, but was so worth it. This is a MUST See if visiting the area. We went on a foggy day, so once we reached the summit, we could nothing but white. Buut the thrill was worth acending the multiple steps.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Love", "Love moro rock. My father took me here at least once a year when I was growing up. It is a very popular place to go for tourists so you will see alot of them. You walk up a bunch of stairs but when you get to the top its so worth it!\nShow less"], ["Reviewed April 26, 2017", 5.0, "Awesome views", "The set of steps are easy to navigate and safe to complete. The reward is exceptional with the views you get at the top."], ["Reviewed April 26, 2017", 5.0, "great adventure", "lots of steps to the top fantastic view even on cloudy days strenuous hike but young families were doing it."], ["Reviewed April 25, 2017", 5.0, "Beautiful Walk with Breathtaking Views", "The absolute best view we had in all our explorations in the Great Sequoia and King's Canyon N.P. Moro rock is a moderate hike to get through along a well marked and well traveled trail. Steps up to the rock itself yield the most mesmerising of views across the park to the peaks beyond, as good as I have ever seen in a lifetime of travelling.\nEveryone there was just awestruck by the place, its views and crisp air.\nTo be honest, it was as nice if not nicer than any of the views even in Yosemite and that, believe me, is some compliment to pay it!\nUtterly spellbinding place and an absolute must -see.\nShow less"], ["Reviewed April 24, 2017", 4.0, "Nice bit of excercise Weather depending for a great view", "If you don't like height this might be a challenge, it is quite safe though. On a very clear day all the way up will offer view with varying degrees of secure feelings. The payoff is a fantastic view and a sunset the views will be spectacular Highly reccommended on a clear evening\nShow less"], ["Reviewed April 20, 2017", 5.0, "Strenuous but well worth it", "The 400 steps to the top of Moro rock is not for the faint of heart. The climb is strenuous and narrow in many places but the view from the top is incredible."], ["Reviewed April 11, 2017", 4.0, "Amazing view from the top", "Hard climb for an average person, but worthwhile for the amazing view. It was rather crowded at the top. There are rest areas where you can catch your breath."], ["Reviewed April 7, 2017", 5.0, "Outstanding most times of year", "While its advised to not do this in the dead of winter due to icy and/or snowy conditions increasing the risk of a fall, I and many others on a early spring day of April 1st, 2017 had no problem walking to the top of Morro Rock. The road to Morro Rock is closed in Winter/Spring season so this adds on some distance, but the road was mostly snow free as was the rock. There was no ice and the Sierra's were living up to the reputation as the sunniest mountain range in the US that day.\nShow less"], ["Reviewed March 26, 2017", 5.0, "Worth the climb", "Do it, it'll be one of the best views in the park. It's around 300 steps up. There is railing at the top and in the narrow spots, it may not be the best idea if you are very skiddish about heights."], ["Reviewed March 21, 2017", 5.0, "We Climbed Moro Rock", "Great, but tiring climb. My wife hates heights, but she loved this climb. Railings help...and the steps are tiring, but the view is well worth it"], ["Reviewed March 12, 2017", 4.0, "A mass of Stone", "The Moro rock stands as a massive rock and is visible having a unique shape and size. Can be seen \"Hospital Rock\" parking lot."], ["Reviewed March 9, 2017", 4.0, "How did they cut those stairs!", "Another great view and the ranger was a plethora of information! Closed when snowy but in the 3 seasons it is worth the stop and the short hike. You can nearly see forever and how thing \"can to be\" is part of the rangers info packet. Worth the stop!\nShow less"], ["Reviewed February 22, 2017", 5.0, "Fabulous Moonlit Hike!", "We started up the rock in twilight, so we could be at the top for sunset and the full moonrise. The view over the mountain range and the valley was incredible! Portions of the trail were very narrow, steep and scary (for the kids), but that added to the fun and challenge. It was also very windy the higher we climbed! When we reached the top, some young men arrived shortly after we did and were very impressed that our children (aged 14, 12, and 10) had managed that trail in near darkness! It was quite dark going back down, but awesome. Moro Rock remains one of our family's greatest hikes.\nShow less"], ["Reviewed January 19, 2017", 4.0, "you can feel the burn", "While the distance on this particular journey is not long, it seems quite the opposite, but once your at the top, you forget all about it. I would advise making sure you have water and take advantage of the rest areas as you go up. I would also tell you don't look up as you go lol cause you think your at the top and when you get there you find another level. That being said, I think this is a must on your trip into the park because you get to see all the amazing views, almost like your standing at the top of the world. PLUS, it's easier going back down :)\nShow less"], ["Reviewed January 2, 2017", 5.0, "Worth the climb!", "I did this with my husband and 13 year old and it was doable. Even little kids were taken as small as 5 but be ready to carry them when they give up! Just pace yourself. The exhilarating scenes and views makes it all worthwhile. Buses are very convenient and on time\nShow less"], ["Reviewed January 1, 2017", 3.0, "Nice view", "It was a nice view, you can see were it was burned by wildfires. Makes sure to go early, it gets crowed by mid morning."], ["Reviewed December 30, 2016", 5.0, "Amazing Views, Exhiliration", "This is a fantastic hike up to a summit that gives you breathtaking views of the Sierra Nevada mountains. Not for those who have a fear of heights. Amazing!"], ["Reviewed December 20, 2016", 5.0, "Done it!", "I am not the strongest by any means and my mother is 76. We both walked the trail and did it in flying colors."], ["Reviewed December 18, 2016", 5.0, "Hard to beat the views for a short hike...", "If you like the StairMaster at your local gym, you'll love the climb to the end of the Moro Rock Trail. If you're afraid of heights you might not like it as much. I'd rate this much safer than Half Dome in Yosemite or Angels Landing in Zion, but if it was crowded it probably would not have been as much fun.\nShow less"], ["Reviewed December 17, 2016", 5.0, "Climbing the rock!", "While visiting Sequoia National Park, we hiked to Moro Rock and climbed the stairs, lots and lots of stairs! The views from the top were mostly obscured by clouds ( fog), but spectacular none the less.the road from the museum was closed, so that meant about 1.5 miles each way. A hike well worth the effort...did I mention the stairs?\nShow less"], ["Reviewed December 15, 2016", 5.0, "Such a fun hike!", "Lots of clambering up, but that is what made it fun. The views were great once you reached the top. We wanted to go back the next day because it was sunny!"], ["Reviewed November 25, 2016", 4.0, "Great Adventure, Not for Everyone", "This was amazing, but not as easy as others make it out to be. It is 400+ stairs straight up a huge rock, and you are starting at 6700 ft altitude. Also there is just a metal handrails and you need to keep little ones safe and in line. The top can be wet. There is a resting place halfway up.\nShow less"], ["Reviewed November 22, 2016", 4.0, "Up and up you will go!", "Get your legs in shape to climb to the top of this gigantic rock. They have steps and railings through most of the climb. This climb will provide you with beautiful views and many picture taking opportunities. Once at the top of the rock, you have a 360 degree of the surrounding low lands. The Sunset was beautiful! But you should leave while there is still light because at some points there is no railing and you really need to watch your step. The information boards are very interesting too.\nShow less"], ["Reviewed November 17, 2016", 4.0, "Easy Hike", "Standing down below, you might not believe that you could walk right up to the top of this behemoth of a rock, but, yes, you can! Stairs have been chiseled into the granite and the 360 degree view at the top is well worth the short puff up. Just do it!\nShow less"], ["Reviewed November 17, 2016", 5.0, "Massive Rock", "Must see this jutting out of the ocean. Look at the person in the blue coat just to get an idea of this massive rock. I had to stand VERY FAR away to get part of the Rock in my pic"], ["Reviewed November 16, 2016", 5.0, "Moro Rock", "This is a super easy hike, beware if you are afraid of heights, a couple of turns may not be good for you! One of my daughters couldn't make it all the way up! The view is amazing and fantastic!"], ["Reviewed November 15, 2016", 4.0, "Nice climb, great view", "Certainly worth the climb up. It is an effort to get up, due to high altitude. But when you get up there the view is stunning. Tie up little kids, because it is not safe for them to wander around."], ["Reviewed November 15, 2016", 5.0, "Breathtaking", "It was a thrilling hike up the rock. Was amazed at the builders of it. Not a very long hike but 400 steps. It is worth the cooling climb. What a great view. Went on hanging rock trail to get a better picture of it."], ["Reviewed November 14, 2016", 5.0, "fun climb for an old guy", "Climbed the 250 steps up Moro Rock. Took my time and it was worth it. Great views from the top and got a lot of good photos."], ["Reviewed November 13, 2016", 5.0, "Steep climb with a great view", "Moro Rock is a great start to the park after an amazing drive up the Generals Highway. It's very steep with a LONG dropoff but there are guardrails going all the way up. If the air is clear you can see forever...when we visited it was dirty but the view is still great. Be careful in wet conditions it will get slick as glass.\nShow less"], ["Reviewed November 10, 2016", 5.0, "Those 400 steps are worth it!", "You can hike to this beautiful site or park nearby, either way, your view once you climb to the top will make the journey well worth it!"], ["Reviewed November 8, 2016", 5.0, "Great views on a clear day", "Climb of about 400 steps to the top but worth the effort for the views of the Sierra Nevada. Interesting lenticular clouds topped the mountains. We had one of the highest picnics ever and met a nice bunch of other tourists. Great place for posing on camera.\nShow less"], ["Reviewed November 5, 2016", 5.0, "Great view", "Although I'm afraid of heights, I kept going till I got to the top. Some areas were really narrow but overall safe. Just pay attention to where you step so you don't fall off the edge. I'm totally out of shape but there were plenty of spots to catch your breath. The view was worth it!\nShow less"], ["Reviewed November 5, 2016", 5.0, "Do it for the view", "Moro Rock is a .25 mile climb up steps and ramps carved into the granite rock itself. The climb is about 300 feet, 400 steps.\nOn either side of the climb, the rock slopes away and you can view the Sierra Mountain range on one side, and the Kawea River and valley on the other. It's amazing.\nThis is not a difficult climb per se, but often the passages and stairways are only wide enough for one person, so people climbing need to find an alcove, landing, or press themselves against the rock wall to allow descending visitors to pass. If you are uncomfortable with heights, this is not the site for you. One side of the path/stairway is completely exposed to the air, save an intermittent metal railing, and the rock wall below is vertical. This provides maximum views the entire way up, but should be taken into consideration if you have small children or balance issues. The views at the top, of course, are fantastic.\nI definitely recommend climbing this early in the morning before the crowds appear. We went in late September and while the park was not crowded, this site was. In the spring and summer, get here before 7.\nVisitors can drive directly to the site by taking a short access road from the main highway. Follow the signs for Moro Rock from the General's Highway 198. Moro Rock is about a 45 minute drive from the south entrance to Sequoia National Park (by Three Rivers). Be aware that parking is very limited. We had to park on the side of the narrow road near the site.\nPark fees are now $30 per car for a 7 day pass, $50 for a season pass, and $15 for individuals who walk in or arrive by shuttle from Sanger.\nShow less"], ["Reviewed November 3, 2016", 5.0, "Climb Into The Clouds", "My wife is afraid of heights to put it mildly. When we first started on the climb I convinced her that it didn't look much of a climb, and it wasn't until we turned the first corner, and the next and the next until finally we reached the top. She made it all the way and I'm sure she was a little stressed when we returned but she would agree that it was an awesome view once arriving at the top. Wish it hadn't been so cloudy but we will return again so hopefully.....The climb is completely safe with hand rails all the way to the top.\nShow less"], ["Reviewed November 2, 2016", 4.0, "Great view of the alpine", "it was nearly 300 or 400 steps up to the top. i forgot. the whole hike took me less than 25 minutes. it could have been faster but i spent some time taking photos. not for the faint-hearted if you don't like height"], ["Reviewed November 1, 2016", 5.0, "OMG!", "400 stairs to an amazing view...this grandma climbed and climbed and got about 3/4 of the up and decided that was enough :-) But, the view was amazing! No need to get to the top. It's an incredible view from any point along the way. Wish I made the trip 5 years ago :-)\nShow less"], ["Reviewed November 1, 2016", 5.0, "A must do", "Moro rock is fantastic the views are amazing and it is one of my favorite thing we did when in the park. I would advise to do the walk when it's a good clear day, the first day we went a thick fog came down so lucky we had another 2 days in the park to visit it again the next day was beautiful there are lots of steps and the paths very narrow in places, but if you have average fitness you should find it no problem. The views are spectacular and I am so glad we had the opportunity to visit this amazing place. Our 9 year old daughter really loved it and the achievement of getting to the top. Just a note don't miss nearby hanging rock trail for views across to Moro rock before you climb it. Excellent don't miss Moro rock it's just fab.\nShow less"], ["Reviewed October 31, 2016", 5.0, "The views are worth the 400 steps", "I've heard about this hike for years and never took the time to check it out. The trail head is at the bottom of Moro Rock and it's a zip zag hike up stairs. It's totally safe and worth the effort. The elevation is over 7000 feet so take your time...you will be glad you did.\nShow less"], ["Reviewed October 30, 2016", 5.0, "Best thing in sequoia national park for me", "This is one of the best points if not THE BEST point in the park.. The view from top is amazing and the climb to the top is convenient as they have stairs and rallyings."], ["Reviewed October 30, 2016", 5.0, "Beautiful View", "My husband and I stopped here while touring Sequoia National Park. The walk up the stairs definitely leaves you winded but was well worth it! The 360* view was stunning"], ["Reviewed October 30, 2016", 5.0, "It is quite a climb but the views are unmatched!", "Take your time if you must but go to the very top if there is any way you can. The 360 degree views are incredible! If you can't make the hike to the top even going part of the way will give you some beautiful views.\nShow less"], ["Reviewed October 29, 2016", 4.0, "we did not climb but...", "we did stop and read, walked up the road to get a better view. We had just hiked Gen Sherman trail and felt our legs needed a rest. Little kids were going up, so perhaps we could have done it."], ["Reviewed October 28, 2016", 5.0, "Spectacular View", "The climb up all the stairs is well worth it as the climber is rewarded with a spectacular panoramic view of the surrounding area. I would love to climb this at night and see the stars."], ["Reviewed October 28, 2016", 5.0, "Worth the climb", "400 stone steps to the top but what views you get a photograph delight. It's a long trail but well worth it don't forget the water."], ["Reviewed October 27, 2016", 5.0, "Great View", "A paved, fenced trail of 350 steps takes you to a great view, from a fenced top. Best done on an early morning to avoid the crowds and the heat."], ["Reviewed October 26, 2016", 5.0, "Moro Rock - a must see!!!", "October 2016 my family and I visited Moro Rock. It is such an amazing place with amazing views!! my teenage children loved it!"], ["Reviewed October 24, 2016", 5.0, "Nice", "Does not seem to fit all the trees and woods that fill the park. Just jumps out of nowhere. Did not hike up due to knee pain, but still impressed."], ["Reviewed October 24, 2016", 5.0, "Worthwhile Climb", "The climb up is somewhat difficult, keep in mind the elevation. The top is so worth the steps up. The sights are amazing, the panorama spectacular."]]}}