{"Morro Rock": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Morro Rock", "url": "/Attraction_Review-g32746-d292801-Reviews-Morro_Rock-Morro_Bay_San_Luis_Obispo_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/04/56/b5/morro-rock-early-morning.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1721"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Morro Bay", "addressRegion": "California", "postalCode": "93442", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Great place to visit", "Morro rock is a great place to spend the day with your loved one or your family. There are lots of nice small restaurants and bars with great views of the rock and the Bay. There are whale watching and dolphin tours which start from the pier. A nice place to chill.\nShow less"], ["Reviewed 1 week ago", 4.0, "Beach day", "Pretty beach...lots of gnats. Very clean nice town. Feels safe. Great businesses here. A very nice place to walk around in."], ["Reviewed 1 week ago", 5.0, "Beautiful", "A beautiful location and a great place to view the sunset as well. We didn't go out on the beach because it was later, but looked like a good spot for that as well."], ["Reviewed 1 week ago", 5.0, "Majestic!", "The Rock is in Morro Bay, at the entrance to the harbour. It is quite a sight. I can understand its State Historic Landmark status. Although climbing is prohibited, it is near enough to be approached by paddlers, boaters, etc. We were there on a windy, clear February day. We spent some time looking at the seals floating near the beach. Fabulous!\nShow less"], ["Reviewed 1 week ago", 5.0, "Pretty view", "We went to the rock and were informed by locals how to get to the area where the otters were in the water. Great to see these cuties in their element! Across from there was the surf area and beach. Also worth seeing."], ["Reviewed 2 weeks ago", 5.0, "Interesting……..", "We stopped by at Morro rock on the way to our hotel. It was very fun! Down there in one of the pictures is the rocks me and my sister stacked up! Also has very nice view! We were climbing rocks which was really fun... when we were climbing, we saw a few giant blue rocks sitting right next to us. And when we were leaving, there were firefighters getting ready to lift up the ladder( the super tall one connected to their truck) to get something stuck on the Morro Rock, and we thought it was a bird that got stock there and needed help getting off, but when we stopped for a while and watched, they used a rod or stick thingy to push it off the little edge it was stuck on, and it fell ( it fell from a pretty high place!) And when they picked it up, guess what it was? It was a drone! Apparently someone flew their drone onto the Morro Rock, and I don’t even know why the firefighters even bothered to come and get a DRONE!!!! It’s just a drone and there’s nothing so important about it!!!! So weird... So anyways... if you ever go there, HAVE FUN!!!!!!!!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun and entertaining", "We started off at Kelli's Candies on the little front street. We took our yummy hot coffees (go there by the way☕ it's delicious) and went to Morro Rock. It was a fun place to watch all the surfers and fisherman. There were lots of people doing things, and even a little wildlife. We sat and enjoyed the cool rock formation, the ocean, and the people. It was a terrific place to relax.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "This is the centerpiece of Morro Bay and all the area has to offer", "Morro bay has a lot to attract visitors - the views, restaurants, sunsets, the Pacific, beaches, museums, Morro Rock, and more. The town is a shoppers paradise. The restaurants are extremely varied in menu and offerings. The views and photography opportunities are numerous. This is a great place to visit and stay. It is also near Pismo Beach, Cambria, the entire Central Coast, and numerous wineries. This is a great place to stay for a vacation.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Kind of an oddity to see ...", "We thought this giant rock was kind of odd.\nIt just pokes up right out of the sea!! ha ha ...\nThe little \"Front Street\" was nice for a stroll.\nIt was fun to watch the fishing boats go out for their morning tours.\n\nWe were so excited when we saw wild Sea Otters with babies right in the bay!! :-D\n\nA great place to sit and enjoy the morning ... before the hustle and bustle begins.\n\nWe would love to go back!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "MORRaculous!", "My family and I did the Highway#1 Roadtrip from SF to LA. We stopped at El Morro just to see the sunset and it was more than beautiful! Definitely worth it to stop by before the sun goes down."], ["Reviewed 4 weeks ago", 5.0, "Sea Otters and More", "We arrived in Morro Bay early, a couple of hours before check-in at our hotel, so decided to park in the huge open parking area by the rock.\nWe had been hoping to see sea otters during our California trip but could not believe the sight that greeted us on arrival. Loads of Sea Otters just laying around near the shore lazing around and feeding with the occasional burst of energy to move around as they do. Not only that but birds and other wildlife too. The rock itself has a magical charm and just to walk around and sit in the area is calming and beautiful. Somehow you don't even seem to notice the chimneys of the power station intruding into the scene, and of course on the opposite side of the peninsula from the sheltered bay is the long sandy surfing beach with wading birds. Idyllic!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Morro Bay", "Nice little place to visit but not a lot to see however the vies at sunset were near the marina were excellent, took some awsome photos especially in the twilight hour (golden hour)"], ["Reviewed January 21, 2018", 5.0, "One of nature's wonders.", "When visiting Morro Bay, one must visit the Rock. It is a volcanic plug left over from an ancient volcano. Gulls nest on the slopes of the Rock, but the big bird attraction is the peregrine falcons. There are two pair of nesting falcons, one on each side of the rock's peak. Also at the rock, sea otters can be observed fairly close to shore. Bring your camera and enjoy!\nShow less"], ["Reviewed January 18, 2018", 5.0, "A WOW find...Aussie visitor loved it", "US host was the best tour guide giving me road trips with a difference and a great experience with every find. Beautiful weather to enjoy a boardwalk along the quaint tourist area and overlooking the beauty of the rock, the water attractions with holidaymakers in kayaks and seals sunning on the pontoons. Lunch overlooking the rock with great Mexican choice of menu. Fun shops and galleries to enjoy along the way.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Morro Rock - A special place", "We found Morro Bay and Morro Rock by accident 5 years ago. Since then we have been back to visit 3 more times. The rock stands majestically in the bay and captures many moods depending on the weather and time of day. We can spend hours exploring and relaxing around the area that surrounds the rock. I have taken many pictures of the rock and its surrounds and they all are beautiful.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Big Rock!!!!", "We walked the 1.3 miles from 456 Embarcadero and really enjoyed looking at all the boats and wildlife along the path out to the Morro Rock area. Once there there are lots of benches and lots of open beach to enjoy the surf and watch birds and sea life.\n\nThere are no designated driving lanes in the vast open parking area and several drivers seemed to be qualifying for their own personal NASCAR events so make sure you keep an eye on the small ones and a short leash on Fido as it was very close to a demolition derby as we came and went near sunset.\nShow less"], ["Reviewed January 7, 2018", 5.0, "I Never Knew!", "Of all the years I have been up and down the coast, I never knew one could walk out around the rock. Although you cannot walk all the way around, you can go out to the breakwall and it was amazing. We saw otter and the peregrine falcons.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Unfortunately a lot of grafitti", "Such a remarkable site, yet so easily destroyed by people whom have no understanding of a sign that says stay away, or do not enter. There were even places where people had engraved their names on the cactus. To walk the beach, around and learn about the rocks creation was awesome. We will return.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Worth a walk - great icon of the Central Coast!", "You can park fairly close and walk around. Great place to observe birds and wildlife as well. Parking is free and plentiful."], ["Reviewed January 1, 2018", 4.0, "2/3 times now and well worht a visit", "Admit it was chilly, cold, wet and windy on all 2/3 occasions, so I have been unlucky weather-wise, but some great sightings, of which 20+ Sea Otters in a single flotilla was the highlight."], ["Reviewed December 31, 2017", 5.0, "Beautiful views all around The Rock!", "It's funny, my wife and I have been to Morro Bay at least once a year for the past five-to-six years and up until this past week we never made it out to the Rock. On this trip we decided to head out that way and found a scenic and peaceful beach area. Mind you, this was in December, so I'm guessing it's probably more of a madhouse during the summer. Today though, it was wonderful.\n\nOnce you drive out to the area you find a large parking area next to an extremely long beach. Today at 11 am there were many surfers still out enjoying themselves. You also can walk along the channel and watch the boats going in and out along with kayakers. The Rock is also a bird sanctuary although you see mostly seagulls. One interesting thing to note, there are squirrels living out in the rocks of the jetty and they are not shy. They appears to love showing off for the crowds in hopes of getting a morsel thrown their way.\n\nWe spent about an hour out there walking around, watching the surfers and marine life, and just relaxing. Definitely will be one of our destinations nest time we're in town.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Christmas vacation", "Beautiful view, and area. Nice to walk, take pictures, and great hotel's to staying and spend the day or a weekend."], ["Reviewed December 28, 2017", 5.0, "Great", "Nice town, wish I could stay longer as there is much I didn't get to see. Will come back in the future and stay for a few days."], ["Reviewed December 28, 2017", 5.0, "The Rock", "A must see when you are in Morro Bay. You can walk to the back side of the rock or stand on the front side and watch the surfers."], ["Reviewed December 26, 2017", 5.0, "Easy to visit, beautiful walk", "Visiting this rock might seem uninteresting however, the walking path to the base of the rock is anything but. The day we visited, there were California sea otters floating on their backs and eating mussels. We saw baby otters too. There were human families kayaking around the bay. It was interesting that the winds were calm as we walked along the bay but when we got to the rock and crossed over to the ocean side, super windy. A completely different experience. Typical and fantastic beach scene. Surfers in wet-suits as well as families playing on the beach. Also... benches along the way if you need or want to sit and enjoy the view of the bay.\nShow less"], ["Reviewed December 25, 2017", 4.0, "It's why you're here.", "This one is hard to rate. You can’t climb on it or hike on it but it’s why you are here in Morro Bay.\n\nJust to the north side of the rock is Morro Rock Beach which I can rate at 4 to 5 stars. The beach is very wide and gentle sloping. At low tide you can ride a bicycle on it on the firm wet sand. You can spot many sand dollars which I believe it is legal to collect since it isn’t on a state beach. Some of the sand dollars are small – more like “sand coins.”\n\nBut back to Morro Rock, it’s impressive as it is a free standing mountain of rock; the remnants of an ancient volcano.\n\nThere is a very large dirt parking area at the base. There are clean restrooms with drinking fountains and flush toilets. You can drive to the southern side of the rock but only up to the gate. Beyond the gate you can ride your bicycle or walk toward the breakwater. On the ocean side of the breakwater the waves are crashing high so be careful. On the bay side there is a nice quiet sandy beach.\n\nThere’s plenty of parking near on the south side of the rock and back on the north side. You cannot walk completely around the rock – not safely. Better than driving, why not park back near the shops along the Embarcadero and take a nice walk along the paved path to the rock? There were several sea otters just floating around and watching the tourists watch them when we were there. We’ve kayaked in Monterey Bay where we had seen sea otters but in Morro Bay we had seen more and so close and we didn’t even need to be in a kayak.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Always a great place to be outside", "There is always something to see and do near and at the Morro Rock. The sea otters are always a fun stop and it was a great walk a couple days before Christmas.\n\nThere is a new statue since we were here a few months ago.\nAlso there are now new benches to sit on and watch the wildlife.\nShow less"], ["Reviewed December 20, 2017", 4.0, "Make Morro Rock One of Your Stops!", "You can spend a whole vacation in Morro Bay but if you're just cruising along the coast and want to check out the Rock, it's a fun little stop. I was heading south and used the Main Street exit (Main to Beach to Front but who needs directions in the age of GPS?). Take front street all the way to the Rock. You'll be tempted to park \"close enough\" but if you follow the road until it ends you'll be right under the Rock. Later, if you want to shop, you can park closer to the action. There is a public restroom on the road in pretty close to the Rock.\n\nOnce you're parked, follow the little trail that goes around the Rock, though not all the way around. Along the way you'll see sea otters, seagull nests and maybe a Peregrine falcon. Depending on the time, you'll also see some fishing boats heading back in. Of course there are \"Do Not Climb or Enter\" signs all around the base of the Rock. If you get tired along the way there are benches and big rocks to sit on. There's also some informational postings about the local geology and animals.\n\nDefinitely walk all the way around until you see the red \"Danger\" sign. From there you get the illusion that the sound of the crashing waves are coming from the Rock itself!\nShow less"], ["Reviewed December 16, 2017", 5.0, "This \"volcanic plug\" is massively impressive. Wow.", "Fleeing the Thomas Fire (Santa Barbara, December 2017) brought me to Morro Bay. Lifelong resident of CA, but I had never visited The Rock.\n\nWhat fun. It's a lovely, easy stroll from the \"embarcadero\" (shops/hotels at waterfront) to The Rock. You can walk part way around the back of it, but then comes ocean.\n\nOr---you can ride your bike along the lovely, smooth bike path.\n\nBinoculars are highly recommended if you want to see the Sea otters. If you're really lucky, you might spot a Peregrine falcon at The Rock. (I looked many times, but never saw so much as a feather on either of the nesting pairs of falcons.)\n\nThere's a fun surf spot beside The Rock. Some great wave action.\n\nI highly recommend a visit to this geological wonder. Morro Bay is lovely and so are its residents.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Gibraltarof the Pacific, perhaps", "Gibraltar of the Pacific, perhaps. More likely just a large rock. Impressive, inhabited by seagulls and seabirds, perhaps some seals. Otters are offshore. Dominates Morro Bay."], ["Reviewed December 9, 2017", 5.0, "the lack of coast", "The rock is scenic point on the coast of morro bay .A great place to park and enjoy the ocean and relax and watch the waves.Boats fell and return to the port of morro bay.At most time a group of sea otters can be viewed in the harbor sleeping in the day a way. A great place to relate .\nShow less"], ["Reviewed December 8, 2017", 5.0, "Great place to ride your bike", "The bike trails around the rock are the best. What a beautiful setting this place portrays. Nice benches all around to sit and watch the boats,surfers and especially the sea otters. One of the most spectacular beach places in California."], ["Reviewed December 1, 2017", 4.0, "Crowded on the weekend", "The otters were frolicking and the various birds were flying around the rock At the beach the surfers and paddle boarders were enjoying the surf. We just enjoyed thebeach"], ["Reviewed November 28, 2017", 5.0, "Iconic Morro Rock", "Morro Rock is a must see on your visit to the California coast. While it is no longer possible to climb the rock, or drive around it, the sheer size of it will take your breath away as you stroll or surf near it.\nIt is possible to see sea otters in the bay, peregrine falcons flying out from the rock and a great assortment of your fellow homo sapiens.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Love the “Rock”!", "No trip to Morro Bay is complete unless you go out to the “Rock”! Love to watch the wild life and tourists around the area! Best place to watch the sea otters swimming near by!"], ["Reviewed November 25, 2017", 5.0, "Morro Bay's Rock of Gibraltar", "Morro Rock is beautiful in all kinds of weather, from all sides and anytime of day. There is a wonderful walkway from town out to the rock and beach, with otters and boats coming & going along side. Many restaurants in walking distance."], ["Reviewed November 19, 2017", 4.0, "Very beautiful place.", "It's a must see and if your in town you can't miss it.romantic place.good spot for pictures with family and friends.GODISLOVE"], ["Reviewed November 19, 2017", 5.0, "The town has a wonderful walking path from the marina down to the Rock. Watch surfers surf, sea otters play.", "This was a wonderful time of the year to visit Morro Bay. The crowds are gone! Beautiful coastline. We stayed in MB, and went up to Cambria, San Simeon, and down to Pismo Beach, Shell Beach, and San Luis Obispo. All charming in their own ways. A must!!!\nShow less"], ["Reviewed November 16, 2017", 4.0, "Spectacular Place to spot Sea Otters", "In the bay to the left of the rock one will find a great abundance of Sea Otters and Seals. Plenty of bird life abounds as well. Excellent surfing conditions abound."], ["Reviewed November 14, 2017", 4.0, "Pictures don't do it justice", "We didn't get to spend much time in Morro Bay, but we enjoyed our time. The rock is quite imposing, my kids were impressed with the size of it and liked learning about the lava cap story behind it."], ["Reviewed November 13, 2017", 5.0, "Beautiful Seaside walk", "Beautiful easy walk with the dogs around the bay. Doggie bags are available. Clean facilities. Lots of free parking."], ["Reviewed November 9, 2017", 4.0, "Better than Expected", "Nice little town to stop eat and shop. Lots of good places to eat. Many nice shops. Check out Gardeners Galley. Unusual large Rock formation nice to view, not worth driving to, IMO. Lots of sea lions playing."], ["Reviewed November 9, 2017", 5.0, "Live here", "If you’ve never been to the rock, you are missing a most beautiful, peaceful and centering place. I am spoiled to be able to view it daily as I have lived here for over 18 yrs. Please visit, but no climbing!"], ["Reviewed November 9, 2017", 4.0, "Impressive rock", "Impressive rock but bummed to see power lines close to the rock. The power lines ruin the natural beauty of the rock"], ["Reviewed November 8, 2017", 5.0, "Beautiful Rock", "The entire harbor and rock is so interesting. We were at the harbor. We saw sea lions, sea gulls and a comerant diving for fish. We got great pictures and had a great early morning experience. We saw a boat leaving the area to take sightseers to view whales. We want to return soon.\nShow less"], ["Reviewed November 4, 2017", 3.0, "Big Rock", "Kinda neat if you wanna kill time or check out some otters. Don't het wet unless you can handle a few great whites. Also, don't go on an overcast day."], ["Reviewed November 3, 2017", 3.0, "Huge rock, not anything more.", "Huge rock which you can walk up to and almost walk around but not entirely. Not to climb, it is forbidden."], ["Reviewed November 3, 2017", 5.0, "Morro Rock", "Morro Rock is a impressive Rock on the horizon as you head down Hwy 1 to LA. It situated in beautiful Morro Bay, there is a causeway out to the rock, it’s the biggest structure in the water on the West Coast.\nA great photo opportunity and an ideal spot for the selfie.\nShow less"], ["Reviewed October 29, 2017", 5.0, "I love Morro Rock", "I have been through Morro Bay a few times but this time we stayed overnight. I was at the dockside at both sunset and sunrise to photograph Morro Rock as well as the otters playing just feet from me in the water. There are many public places to sit and watch the bay with public restrooms near at hand. What a lovely way to spend a couple of days!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Sea Ottor Paradise", "Drove out to the rock and observed the bay adjacent to the rock. We had about 2 dozens sea otters feeding, cleaning and teaching their young not 15 yards away from our overlook. We're able to watch them interaction for well over 20 minutes."], ["Reviewed October 26, 2017", 5.0, "So much better in person!", "Saw this online and added it to our Highway 1 trip... Very beautiful and HUGE! We could see it from our hotel room several blocks away. Must see!"], ["Reviewed October 19, 2017", 4.0, "Pet Rock", "This iconic rock is what has helped put Morro Bay on the tourist map. You can drive right to the base of it and park your car. You are able to hike around parts of it but not the entire way (unless you ignore the danger signs). We saw several otters and were lucky enough to see a baby otter. It's also a great place to fish or just sit and watch the boats come in and out of the harbor. Bring a cup of joe and a camera and relax and take it all in.\nShow less"], ["Reviewed October 19, 2017", 4.0, "It’s a big rock!", "I only came for the otters. I’m not impressed with the big rock. Parking is easy. This site is set amongst industrial small town buildings including smoke stacks. So not the prettiest views for sure. But the otters.... sooo cute and a delight to watch. There were many otters in the water doing their thing the day we went. If you’re in town doing touristy stuff I guess it’s a place to go, but I wouldn’t have come to see the rock, only to see the otters.\n\nIf you do make a visit here, stop by at nearby La Parisienne (reviewed in a separate review) for a snack or lunch.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Scenic and Friendly", "Very friendly folks in Morro Bay. Driving out to the rock is a rewarding experience. You get closer to the seagulls and the amusing seals and otters. And the air is wonderful. Take the kids—you’ll all have more fun if you do!"], ["Reviewed October 16, 2017", 4.0, "Lots of seals and sea otters", "What a beautiful spot! Such a nice surprise to see the seals and around the other side were sea otters. A nice detour!"], ["Reviewed October 16, 2017", 4.0, "Scenic", "What else can I say about a rock? There is all lot of marine life here and fantastic bike paths and footpaths for walk-ability"], ["Reviewed October 16, 2017", 4.0, "Come on who doesnt like morro rock", "I got a kick out of the bad reviews what do these folks want. Its striking spot rain,fog or sunny and there really isnt anything else like it on the coast that doesnt require a major hike. See the otters, surfers and fishermen or just watch the water and enjoy the size of this thing. Really is worth seeing and ive been here many times, then enjoy the the little seaside town and eat a meal or drink some coffee heck in bad weather the place is even better. If you dont live near the ocean this place is a must !\nShow less"], ["Reviewed October 15, 2017", 4.0, "Morro Rock - A iconic landmark of Morro Bay", "Morro Rock reminds me of the Rock of Gibraltar. Though much smaller, it stands guard to the entrance to the small seaside town of Morro Bay. It is like a huge dome and appears to be made of a single piece of rock. It is inhabited by scores of seagulls, pelicans and other sea birds. It is possible to walk up to the rock but not sure if climbing it is allowed. Two thirds of the circumference of the rock is on the seaward side and almost steep vertical walls. It is visible from several miles out in the ocean.\n\nSea otters, sea lions and sometimes dolphins can be frequently seen in the waters around Morro rock. Whale watching is very popular and I have seen multiple whales less than a mile from the rock clearly identifiable by the water spouts.\n\nA nice place to visit whether for just a couple of hours or the entire day. If traveling from San Francisco, it is possible to visit Pismo Beach, Morro Bay and Solvang all in a day though it may be a long one!\nShow less"], ["Reviewed October 12, 2017", 3.0, "Amazing from a distance", "Up close, not so much. It just happened to be in the area that we chose to stay for the night. You have to see it from the distance to appreciate it."], ["Reviewed October 11, 2017", 5.0, "Great walking, otter watching.", "Great walking area loved watching the wild life especially the otters. Would love to go back and try kayaking."], ["Reviewed October 9, 2017", 5.0, "Didn't realize you could walk around it", "We've never gotten close enough to realize this is a good easy walk out to the water, we saw a bunch of otters feeding babies, great picnic spot right on the beach"], ["Reviewed October 9, 2017", 4.0, "Up close and personal", "This rock is very large and close to the shore. You can drive right up to it and see it first hand which is nice and unusual. Nice beach near to enjoy as well."], ["Reviewed October 6, 2017", 5.0, "The Rock", "Great little place to stop over on the Big Sur route and slightly cheaper than nearby destinations would definitely recommend as an alternative. The Rock is quite something! Unfortunately it was very windy when we were there so we couldn't go out on a boat but still plenty of sea otters to keep you entertained!\nShow less"], ["Reviewed October 5, 2017", 4.0, "A nice walk", "situated at the far end of the bay you cannot miss the rock. Park up anywhere in the town and take a gentle walk along the boardwalk to the rock where Park Rangers are happy to talk and show you the wildlife which abounds round here.\nShow less"], ["Reviewed October 4, 2017", 4.0, "beach", "We drove out to the big rock and enjoyed watching the surfers, There were benches to just sit & enjoy the ocean view.If we had more time, I would have spent the day on uncrowded beach."], ["Reviewed October 3, 2017", 3.0, "Very nice to drive out to the rock. Not much to do when you get there.", "It's pretty to look at. You can drive to the rock and park...and look from the rock to the coastline...but otherwise, it's not much as an attraction goes. Still, glad we did it. Probably won't bother to do it again."], ["Reviewed October 3, 2017", 5.0, "Beautiful view", "Love walking the trail to the rock. Ocean on one side, bay on the other. Seals, otters, surfers... wow!"], ["Reviewed October 2, 2017", 4.0, "Pretty Big...", "This volcanic feature has had a storied past. The north side was blasted for rocks to build local breakwaters about 80 years ago. Native tibes consider it sacred. Families of peregrine falcons have made it home for hundreds of years, and can often be seen today. Climbing it is forbidden, but each year some wild child tries and is usually ticketed.\n\nA paved road (a northern extension of the Embarcadero) in Morro Bay goes to its base where there is parking. A nice fake wood walkway with benches on the water parallels the access road--park across from the now mothballed power plant for that. A number of nice restaurants and a bakery are at the south end of this parking lot.\n\nThere is often a large group of sea otters in the bay entrance channel adjacent to Morro Rock. Well worth the trip!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Iconic Landmark", "Morro rock is very visible and picturesque. The whole bay including the rock which separates the bay from the beach, is very photographic."], ["Reviewed September 22, 2017", 4.0, "Nice Rock", "Stopped on way from San Francisco to San Diego down Route 1. Interesting rock formation that you can visit close up. Don't forget to try the local seafood."], ["Reviewed September 22, 2017", 5.0, "Perfect", "Love this place. A haven for wildlife. Sea otters are numerous. Shall return. Plenty of places to visit. Plenty of choices for accommodation. Plenty of choice for eating out. Everyone I met was friendly and helpful. Would recommend."], ["Reviewed September 21, 2017", 4.0, "Great ocean views and LOTS of otters.", "The rock is quite spectacular. Rookery for many seabirds, it is off limits to all human access. Drive down to the adjacent dirt lot and look for rafting otters, usually several, oftern a dozen or more. Do not stray out beyond the fence as the swell can be dangerous.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Stunning", "Those who say t's just a rock have missed the whole point. The area surrounding the rock - the beach and inlet are beautiful.There are otters, birds of all kinds,sea lions, surfers and a long beach to walk, find sand dollars or sit and build sand castles. The location is easy to get there, within walking distance of the Embarcadero for restaurants and shops and has restrooms and benches.\nShow less"], ["Reviewed September 14, 2017", 3.0, "It's a giant rock.", "Maybe I missed something but it's a rock. We enjoyed our night there, pretty sunset, nice town to wander around in."], ["Reviewed September 11, 2017", 4.0, "Awesome sight!", "Morro Rock is quite a sight to see! There were lots of surfers to watch from the beach. This location was easy to get to, and I recommend a visit, even if it's just a few minutes."], ["Reviewed September 9, 2017", 5.0, "Nice, easy and best of all free!", "Easy walkabout with great view of the estero Bay, sea otters, sea lions, ocean. Great view, healthy to walk, easy path and Free!!"], ["Reviewed September 9, 2017", 4.0, "Impressive", "Morro Rock sits as a sentinel to Morro Bay. There are trails that go about 1/2 way around it. Good views of the town from the trails. Climbing the rock is not allowed."], ["Reviewed September 6, 2017", 5.0, "Better in Peson", "Morro Bay's iconic symbol is nothing less than spectacular in Person. Awe inspiring, and so cool because you can walk right up to it and touch it with your own hands!"], ["Reviewed September 5, 2017", 3.0, "A big rock...", "Morro Rock is just that...a big rock in Morro Bay. We decided to stop here while driving the PCH. We saw pics of Morro Rock on Pinterest, thought it looked interesting. It isn't....really. Saw the rock, took a photo, ready to move on. Unfortunately were exhausted and hungry. Had a terrible meal on the wharf, stayed at a mediocre, tired hotel.....wish we would have kept driving.\nShow less"], ["Reviewed September 3, 2017", 2.0, "I may have missed something....", "It is nothing more than a rock. That said, Morro Bay was oddly very busy.... I wouldn't add this to your itinerary unless you have some other good reason to be there."], ["Reviewed September 2, 2017", 4.0, "Good beach point", "The rock is impressive. Saw the rare falcons, and you see pelicans, sea otters and sea lions.\nThe sand beach is nice, slope is low, waves are good, also for young children. Water is ice cold, also in September.\nBeach life guards present, so are restrooms. Parking no problem at all and free.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great little town", "The Morro Bay area is a pleasant place to stop while exploring the central coast. The town has good restaurants and places to camp, everything from RV parks to more remote campgrounds. There are tidal pools and mud flats, mostly within site of Morro Rock. We enjoyed our visit. Central California is a place unto itself, without the glitz of Southern California or the bustle of San Francisco.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Fun beach, no services", "Nice beach, basic facilities (restrooms, token showers and water fountain), rustic feel. We had fun."], ["Reviewed August 27, 2017", 5.0, "Weekend getaway", "This rock is an incredible sight to see! There is a man that volunteers his time to bring a telescope out to let you view the Falcons that live on top of this rock... totally free!!! I'm sure he would appreciate a tip! I would come back here over and over again!\nShow less"], ["Reviewed August 26, 2017", 4.0, "Great Place for a rest break!", "We visited Morro Rock when we stopped at Morro Bay on our California Coast Road trip. It was a great place to stop and stretch our legs. There was plenty of parking and clean restrooms. We watched a family of otters frolicking in the water and some kayakers. Then we walked along the water and along side the rock. There is a small sandy beach and a jetty where people were fishing in front of the rock. There is a playground and another beach adjacent to the Rock. There are also picnic facilities available.\nShow less"], ["Reviewed August 24, 2017", 3.0, "Not much to see", "Morro Rock is literally a big rock in between the bay and the open ocean. When we went all there was to see was the rock, some squirrels and a few surfers on the beach."], ["Reviewed August 18, 2017", 4.0, "Otter Sighting", "We stopped on a whim and found it to be a great spot to sit and watch boats and kayakers. The rock is a presence and something to see. Our favorite thing was watching a family of otters playing in the kelp along the shore."], ["Reviewed August 18, 2017", 5.0, "Slow down and enjoy nature at it's best", "I love this place. The bay is nice for long walks and the views are stunning. It's romantic and it's also kid friendly, with plenty of things to do and see."], ["Reviewed August 17, 2017", 5.0, "Spectacular beauty", "We have been coming here for over 40 years. It is a favorite place of ours. They have made nice improvements to the road and bike path out to the rock. We love it so much we walk or ride out there several times each week. Beautiful place to visit.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Nature Lover Spot", "If you love sea life, geology, and/or ornithology, Morro Rock is a must stop. Otter colony/nursery next to shore, exquisite volcanic plug access, and over 200 varieties of birds, including 2 mating pair of peregrine falcons."], ["Reviewed August 16, 2017", 4.0, "Nice photo spot", "My family and I made a quick stop in Morro Bay on our drive home from San Luis Obispo to San Francisco. We took several pictures with Morro Rock in the background. It didn't seem like there was much else to do in the area so we just continued our drive home right after taking pictures.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Interesting sight", "A unique place to visit while driving along the California coast. The area was quieter than most touristy places this time of year and very affordable. Great place for taking photos and enjoying the wildlife that the pacific ocean has to offer"], ["Reviewed August 13, 2017", 4.0, "A nice stay in Morro Bay on our way from SF to LA", "We spent 2 nights in Morro Bay on our way to LA. The location is very special and we were lucky to see a very nice sunset on the rock. One night would have been enough though as after you saw the rock and the surroundings there is not much to do.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Cute", "Magical. Especially recommended because of the beautiful view and magical atmosphere. Just seat, relax and wait till sunset."], ["Reviewed August 12, 2017", 5.0, "Unique Feature of the Central Coast", "You can drive or walk to the Rock along the boardwalk from town. There's a beach and good surfing. Otters and sea lions are usually visible, and there are always lots of birds. If your coming to the Central Coast, don't miss the Rock."], ["Reviewed August 12, 2017", 5.0, "Drive to the Rock.", "Driving to the rock gives a great view back at Morro Bay. There is a really nice little beach at the end of the road. Take a walk on the wild side and go out on the jetty. If the waves are up, you will get wet.\nShow less"], ["Reviewed August 10, 2017", 5.0, "A great place to see up close", "Morro Rock is a must see if you are in the area. Free parking, restrooms, a small park, and beaches. Also a popular fishing spot."], ["Reviewed August 10, 2017", 4.0, "Great Place to Explore with Kids", "There was plenty of parking and options for exploring. We were able to see the peregrine falcons and sea otters near the rocks. We also explored the jetty that was filled with marine wildlife. Only down side it that it can get crowded."], ["Reviewed August 9, 2017", 5.0, "Don't Miss This", "Morro Rock can be seen from all of the water front but don't miss actually driving to the park area and seeing the Rock up close. It is a fun place to walk and watch the amazing sea otters!"], ["Reviewed August 8, 2017", 5.0, "Wonderful sunset", "If you are in Morro Bay you have to go to the rock and watch the sunset. Between that and the Oters that are always hanging around it is just an amazing place to be. Great beach area as well."], ["Reviewed August 8, 2017", 5.0, "Walk", "There is a nice walking path with occasional benches so you can sit and watch the otters, seals, squirrels, egrets, etc. there is also a separate biking path. There is a protected species on the rock--so no climbing."], ["Reviewed August 6, 2017", 5.0, "Seabirds!", "Fascinating rock inhabited by lots of birds. Unfortunately you can't walk all the way around it which we would have loved to do."], ["Reviewed August 3, 2017", 5.0, "Stunning", "A truly beautiful spot, with seals on the edge and in the water, views to die for at sunset, plenty of parking and a decent choice of restaurants"], ["Reviewed August 3, 2017", 5.0, "Wow big rock!", "Very cool land mark with a lot of history. Come to this place and see what's here. Cool place to paddle board and kayak. Great birding, sea lions and dolphins if you are lucky. Finding Dory missed the mark with this place."], ["Reviewed August 3, 2017", 4.0, "Beautiful", "Sat by a restaurant to view and then decided that we could drive out for a better inspection. Wonder how they stop climbers from doing their thing."], ["Reviewed August 3, 2017", 5.0, "Beautiful beach", "Such a scenic beach . We love hanging out and watching all the birds and water mammals. It is our favorite landmark we look for as we arrive on the coast and we look for our last glimpse as we are on the highway."], ["Reviewed August 3, 2017", 3.0, "It's a rock...", "Getting to the rock is more interesting than the rock itself. I mean, it makes for a nice view from town but other than that, not too interesting. Nice place to walk around with your sweetheart..."], ["Reviewed July 31, 2017", 3.0, "Big Rock but not that interesting", "By the time the fog lifted and we could journey to the rock I found myself underwhelmed. The area around the rock was fenced in. The rock was a rock, but nothing worth going gaga over."], ["Reviewed July 30, 2017", 5.0, "Rock to pier walk.", "Love morro rock we did the brian waterbury walk . We always walk on sat afternoon and sunday had a great walk with my great friend morro rock is a great place to walk to or jyst enjoy from afar"], ["Reviewed July 29, 2017", 3.0, "Lots of Resturants with a view of the Rock", "We enjoyed views of the Morro Rock from an opposite shore - as depicted. There are multiple restaurants along this opposite shore. I thought I could see boats pulled up to the rock itself, in case you are interested in getting right up to its shore.\nShow less"], ["Reviewed July 28, 2017", 5.0, "A gem! We are so glad we stopped along US Highway 1", "We flew into LA and went to crazy Venice Beach and planned on going up the Pacific Coast Highway..up to Big Sur. Can't do it because of the closures due to landslides. But, we did go as far up as Morro Bay and we are so glad we did. Morro Rock is what you see when looking from the road, leading into this quaint little town. It is definitely worth an afternoon. Great places to eat along its coastline and of course, you must get a chowder bread (sourdough!) bowl. It just hits the spot on a cold (56 deg F) day in July!\nShow less"], ["Reviewed July 27, 2017", 4.0, "Unique Volcanic Rock", "Morro Rock is accessible by driving, walking or by boat. From a distance or up close the rock is impressive. Often on a summer morning the fog hangs on or near the rock creating interesting photo opportunities. Walking to the rock from town offers a chance to see sea otters carousing and floating along the shoreline. A few small beaches are available, too.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Amazing!", "You can't go to Morro Bay without noticing Morro Rock. After lunch we walked along the Embarcadero to the \"rock\". There is a small beach area on the bay side near Coleman Park, then further along you reach the another beach on the ocean side. We walked around the rock as far as we could go and it's is just massive and awesome! Afterwards we went to the beach and people watched. There are cement benches everywhere. It was overcast, but there were still surfers and sun bathers having a great time. Be sure to read the history along the way.\nShow less"], ["Reviewed July 27, 2017", 4.0, "Unique", "This is a very unique geological formation easily accessible by car, with good parking areas available. There were no otters when we got there, but it is an ideal spot for a snack and if you are interested in a boat trip around the island. There are a couple of good places where you can stop for a bite.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Unique", "Very unique formation, easily tourable from publicly accessible locations. Nice hiking options, rock causeway separates beach from open ocean. Very interesting landscapes with some sea otters and lots of birds."], ["Reviewed July 23, 2017", 5.0, "Great Place to Explore", "My family and I LOVE going to Morro Bay! We enjoy visiting Morro Rock and exploring the shops and antiquities. The weather is sometimes unpredictable. It can get chilly and windy some days. We somehow end up buying Morro Bay sweaters from the gift shops to warm up. But it's nice to walk around and people watch as well. Definitely coming back again!\nShow less"], ["Reviewed July 23, 2017", 5.0, "One of the most picturesque sights on the California Coast.", "I have passed through Morro Bay many times but never had the time to stop. I did so this time. We had dinner at Dockside and then went out to the Rock for the sunset. My only disappointment was missing the sunrise on the Rock. We were socked in by fog and visibility was limited.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Fantastic time!!", "My two granddaughters visiting from NJ loved seeing Morro Rock and hearing the stories about me vacationing her when I was a young girl with my family."], ["Reviewed July 17, 2017", 5.0, "The reason for coming to Morro Bay", "Morro Bay is a nice place in and of itself. The people are friendly and the shops are very quaint. However, the real reason come o Morro Bay is to see Morro Rock. Some people say Morro Rock is just a rock. That’s like saying the Eiffel Tower is just a regular tower. Morro Rock is iconic and part of the lore of the California Coast. People drive for miles and days just to come and see it. If you don’t want to observe Morro Rock then there is simply no need to visit Morro Bay. However, please take note that you are not witnessing just a rock but also fantastic wildlife area that is available elsewhere but part of the reason for this rock being such a pleasing place to see.\nShow less"], ["Reviewed July 15, 2017", 4.0, "It's a Rock", "What can you say. It is a very large rock sticking up out of a beach on the central California coast. It is an interesting geologic formation and a home to large colonies of birds including some Falcons."], ["Reviewed July 15, 2017", 5.0, "Stunning location", "We loved our visit here. The beach to the north of Morro Rock can be reached on foot from town - it is a huge sweep of sand set against the huge mountain backdrop. To the south of the rock, it is lovely to wander along the Bay, watching the sea otters playing in the harbour.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Impromptu visit was awesome", "Awesome location AND pitcheuresque. Nesting birds on the rock and tons of sea otters with pups in the kelp beds 20 ft from shore which were awesome to watch. Nice sandy beach on the other side of parking area as well where kids were learning to surf and families playing on the beach and in surf. Definitely coming back in the future!\nShow less"], ["Reviewed July 14, 2017", 5.0, "Wonderful beach for shell seekers!", "Lots of sand dollars, little waves, not crowded. We were there in the morning, and it was a great place to stop and stroll."], ["Reviewed July 13, 2017", 5.0, "Amazing", "A sunset visit will stay with you forever...a safe, pleasant walk around the base of the rock with birds, sea otters, seals and views of Morro Bay. Dogs allowed!"], ["Reviewed July 10, 2017", 5.0, "Unusual Big Rock at the Bay", "This is a famous rock surrounded by a protected estuary. The rock can be seen from Hwy. 1 from a long way off & hard to believe its in the water. One side is protected Bay, the other is a great beach that provides hard sand for a long walk.\nHighly recommend staying a weekend to explore the area.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Romantic Getaway", "Landing in Morro Bay is always so peaceful and fun. I love this little town. The people are so nice and I always leave filling better than when I arrived"], ["Reviewed July 10, 2017", 5.0, "Overnight visit,", "Great seafood restaurant in town with view of the harbor looking at the rock. Also some interesting shops to browse in the town."], ["Reviewed July 7, 2017", 5.0, "The Rock", "Spend half a day at least exploring around the rock. We found a large group of sea otters acting playfully and watched them for quite some time. There were tidepools and crabs running around everywhere and lots of cute squirrels."], ["Reviewed July 7, 2017", 4.0, "Morro Rock", "We walked over to the Rock...and walked all around it and out to the sea wall. Beautiful day with lots of wildlife abounding!"], ["Reviewed July 3, 2017", 4.0, "Wow", "What an unusual sight to see. The tip of a volcano coming out of the Pacific Ocean. It is visible from all around Morro Bay and you can get lots of pictures at the harbor. With boats in the foreground it helps to see how large this rock really is.\nShow less"], ["Reviewed July 2, 2017", 4.0, "There is so much to do around here", "As the children were studying geology, specifically volcanoes, we took them out to Morro Rock to see it in it's enormity and of course read the signs. They learned that it is a volcanic plug and the last peak of the Nine Sister's. It is also a home and nesting site several sea birds as well.\nShow less"], ["Reviewed July 2, 2017", 4.0, "A REALLY big rock in the ocean. Worth some photos; neat town too", "We were told to look for Morro Bay as we were in the San Simeon area. We took the drive and first saw the rock in the distance. It was impressive, but most impressive when we got up closer. It is HUGE and makes for some great photos. We stopped in the town of Morro Bay which was very nice with great stores and eateries. Worth the stop!\nShow less"], ["Reviewed July 1, 2017", 4.0, "Don't miss it", "We were only here for overnight, but I was able to walk down and see the ROCK. It is very picturesque and the moored boats just add to it"], ["Reviewed June 29, 2017", 5.0, "Happy bday phalisha Gutierrez", "Amazing views and very good restaurants..the people are friendly and not too crowded..sunny and cool ,clear ..nice weekday"], ["Reviewed June 28, 2017", 5.0, "Love the rock!", "The Morro Bay Rock is a 581 foot volcanic plug, it is connected by a causeway sheltering the bay area for kayakers, paddle boaters and other water activities. It is a state Preserve so climbing the rock is not legal but you can boat or drive out to it and walk around the base.\nShow less"], ["Reviewed June 28, 2017", 2.0, "Foggy and Cold", "Stayed here for 2 days during a recent trip. I must say that for May the weather was quite poor. Foggy and Cold yet not more than 3 miles out of town the sun shines. The rock looked more like an Iceberg during our stay."], ["Reviewed June 27, 2017", 5.0, "Relax and Enjoy the View of Morro Rock", "You can really enjoy the beauty and relaxed atmosphere of Morro Bay and the Rock in particular if you visit on a Monday. The weather was spectacular and a great respite from the heat of the Central Valley. Although my family has visited this place since the 1960's, it still has a great laid-back atmosphere and lots of friendly people. Wonderful place to bring the children!\nShow less"], ["Reviewed June 26, 2017", 4.0, "If in Morro Bay, this is a must-do.", "If you are spending some time in Morro Bay, of course you'll come to Morro Rock. How could you skip it? It's just THERE, and no one could possibly ignore it, like a gigantic piece of rock standing on the ocean beach.\n\nDrive to the foot of the rock and there are lots of parking spaces. Better to drive a SUV or high-clearance vehicles, as the ground is full of small pits.\n\nThe views are great, of the beach, of the rock, of the wild birds, and of the group of otters living in the bay.\n\nDress warm, as the winds are pretty gusty. Bring your binoculars, to watch the birds and the otters.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Sweet!", "AMAZING! Beach stretches for miles, too. Met nice surfers and locals who shared interesting stories about the area. Very cool."], ["Reviewed June 24, 2017", 5.0, "Awesome! It's a must !", "I was lucky to see the Indians walking and making a fire the day I was there. They are the only allowed to get to the top and never announce when they are going. Lot of seal lions and seals around the rock, on the bay. So try to catch a little boat the goes around the bay to see everything, it is worth it ! It is a must if you go to Morro Bay! *****\nShow less"], ["Reviewed June 23, 2017", 5.0, "Magnificent view!", "we never been Morro bay. Morro Rock and around the bay area is worth to visit! In addition to the view & beach, there are a lot of wild life you can closely observe. We enjoyed staying around there."], ["Reviewed June 23, 2017", 5.0, "Need To See In Person", "We visited here when traveling from Phoenix to Seattle during a long vacation. I was a bit leery of how cool it was going to be until I saw it! It appeared out of the fog like a giant. We were in awe and loved walking around and checking out the sea otters. It is definitely a must see when visiting the coast of CA.\nShow less"], ["Reviewed June 23, 2017", 4.0, "Great place to visit with the Family!", "Been coming here for years! Love how much slower MB is to the rest of the central coast. Amazing food and views!"], ["Reviewed June 22, 2017", 5.0, "Been coming here since I was a kid...", "I love Morro bay. The rock is awesome. It just...make you feel good. The trails around it are nice, the beach next to it is excellent. Lots of great surfing. All in all, great place to relax!"], ["Reviewed June 21, 2017", 5.0, "Beautiful!!", "We rode our bikes from our campsite here and it was so worth it. So much wildlife around and the view was fantastic! It's historic."], ["Reviewed June 18, 2017", 5.0, "Beautiful sight", "Saw my brother get married here. They couldn't have picked a more beautiful spot. The beach is beautiful."], ["Reviewed June 16, 2017", 5.0, "Everyone needs to visit", "You need to see Morro Bay at least once - this volcanic rock is amazing. You don't realize the size until you are upon it. It is a bird sanctuary, so you can't climb it, but it's cool to see."], ["Reviewed June 15, 2017", 3.0, "Its a rock", "Although it's interesting and nice to look at from your room... it's still just a big ugly rock...LOL."], ["Reviewed June 15, 2017", 5.0, "Great for pictures", "You have to go to the bay to see the rock. it is beautiful as you can see we saw it at night. These were taken from our restaurant. Most of the restaurants on the bay faces the rock."], ["Reviewed June 9, 2017", 5.0, "Love this place", "It's quiet relaxing place to take in great views and wonderful shops and people. The morro rock has a nice beach and boardwalk to see seals and otters. Plenty of thing to do and enjoy."], ["Reviewed June 9, 2017", 5.0, "Must see if you're here.", "Ok, it's probably a bucket list thing but what the heck. Go and take a picture. You'll be glad you did."], ["Reviewed June 9, 2017", 5.0, "it's a huge rock!!!", "it's a sight that one has to see for themselves! It's a huge rock close to the harbor in Morro Bay! there's walk ways close by so there are plenty of opportunities to take pictures...and there's lots of wildlife in the vicinity...birds all over and sea life in the water! it's an awesome place to visit\nShow less"], ["Reviewed June 7, 2017", 4.0, "Chilly in the mornings, but worth the walk/view", "Mornings are a bit chilly with wind off the water and fog combination, so bring a light jacket. Stroll the pathway along the bay and out to the rock. Very relaxing and beautiful."], ["Reviewed June 6, 2017", 4.0, "Geological Wonder", "For many years we have been coming to Morro Bay and have admired the rock, but this time I decided to research what created this wonder. Turns out that a Morro (what the bay is named for), is a plug of an ancient extinct volcano. now it makes sense to me. Regardless of the source it is a picturesque location.\nShow less"], ["Reviewed June 6, 2017", 5.0, "must see", "This is great view and you must spend time on clean beach with nice public rest rooms and can watch surfers or walk down and walk in water"], ["Reviewed June 5, 2017", 5.0, "Cool place", "The wind was blowing about 40 miles per hour when we stopped at this location ... which actually made a really fun memory for our family! A beautiful stop."], ["Reviewed June 4, 2017", 5.0, "Beautiful coastline", "The town is small and the rock is the only attraction. There are also some sea lions and otters but they are not close like they are in San Francisco. You will need binoculars. Its good to see but staying more than one night is not recommended. They are some excursions like whale watching. Too cold to get in the water! Stayed for sunset and the rock against the sun was beautiful\nShow less"], ["Reviewed May 31, 2017", 5.0, "A must see along the California coast!", "Great place to visit in the summer, you have the beautiful ocean surf on the north shore from the rock and can get a close up view from right at it's foot. During the hot summer go to Morro Bay for cooler tempretures and sea breezes. Now living in Florida I never see mountains, in Morro Bay you get the best of both mountain and coastal atmosphere! This massive volcanic plug is a must see!\nShow less"], ["Reviewed May 26, 2017", 5.0, "Million Year Old Wonder by the Sea", "The Morro Rock has ancient story attached as how the seven hills represent seven sister and when they erupted one of the rock fell into the ocean. Well but the rock is worth visiting and one of the most visited place at Morro Bay. i am not a very avid beach fan, but I could stay by the ocean and look at the waves and this huge big rock all day. It is prohibited to climb on the rock. you will find many birds and other creatures have their nesting on the rock. Quite a marvellous piece of nature.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Multiple families of otters", "Otters are always there entertaining. Also had Peregrine falcons with nest on rock face. Early May is very quiet. Good restaurants close by"], ["Reviewed May 24, 2017", 3.0, "A good place for a short visit", "Its a nice place if you are in the area, not worth it for a special visit.\nWe saw different animals there, including few sea otters which was cool.\nNext to it there is a beach that is suppose to be good for surfing, I am not an expert so I cannot say.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Serene", "More rock is a good place to go to see the otters in the bay and to just relax! When the surface hi he will see the surfers on the north side of the rock catching all the big waves! I love the whole town of Morro Bay!!\nShow less"], ["Reviewed May 22, 2017", 4.0, "Picturesque, a sight to see!", "Enjoy Morro Rock view from Embarcadero Rd, or north along the coast! It's very picturesque and sight to definitely see!!!"], ["Reviewed May 22, 2017", 5.0, "Great Landmark", "My favorite attractions of the rock are is the Peregrine Falcons and the surfers! It's a great place to enjoy the awesome pacific ocean."], ["Reviewed May 19, 2017", 4.0, "Places to see", "enjoyed visiting shops and seeing sea otters and eating at the restaurants with a view of the ocean."], ["Reviewed May 17, 2017", 5.0, "Wonderful place to visit", "This is one of my favorite places to visit. Really nice area, great beach and plenty of neat places to shop"], ["Reviewed May 17, 2017", 4.0, "Nice view and interesting place", "The Morro Rock fits very well with the nice view of Morro Bay. It is a landmark between the bay and the beach. You can park in front of the rock, take pictures, enjoy the beach, or take a walk by the bay to visit some stores or have a meal in some nice restaurants around.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Landmark", "We only stayed in Morro for a few hours on our RV trip but the whole town has a great vibe, friendly and interesting. The rock being at its centre, we saw the rock close up and later in the day from high ground inland. On both occasions it looked impressive.\nShow less"], ["Reviewed May 14, 2017", 4.0, "Really interesting geography", "Really interesting geography throughout Morro Bay, anchored by the rock. Drive through town and out to the rock for a great view of the bay and back into town. What a challenge to stay ahead of the sand shoaling with dredging to keep this unique harbor useful!\nShow less"], ["Reviewed May 13, 2017", 5.0, "Landmark", "Great place to visit. Nice walk from the Embarcadero. Views of the bay from the south side and views of the ocean to the north."], ["Reviewed May 11, 2017", 5.0, "My favorite part of California.", "I love Morro Bay, the rock, and this part of the California coast in general. It's my favorite part of California. It seems far enough away north from the Los Angeles basin to not attract many tourists. It is also far enough south from San Francisco to not get many tourists from there either. This part of California is known for its sand dollars and Morro Rock and the beach here are full of them.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Take a walk", "So needed to walk after my flight to SLO. I found it neat to see the otters, squirrels, lizards and all the birds. The walk by the sub and the power plant kept me engaged. Quite enjoyable."], ["Reviewed May 4, 2017", 5.0, "Morro Bay must-visit!", "One of the famous volcanic Seven Sisters, iconic Morro Rock is a must-have picture with friends and family as a part of your visit to Morro Bay. Long before reaching the town itself, \"the Rock\" is visible miles away up and down the Coastline and driving over on Hiway 46. There is a terrific walkway that wraps around from the Embarcadero along the Harbor mouth giving additional enjoyment to the park area. Plenty of parking and a favorite local surf spot as well as beautiful beach for miles up to Cayucos!\nShow less"], ["Reviewed May 3, 2017", 4.0, "Always Beautiful", "A bit disappointed that the gate to the back side of Morro Rock was locked when we went on April 28-29, 2017. The last time we were there, we could drive further. Beautiful ocean views from that location and plenty of surfers to watch."], ["Reviewed May 3, 2017", 5.0, "BEAUTIFUL!!!", "The views are absolutely breathtaking. Is know as a Bird Sanctuary. Great place to take the family. Lots of surrounding beaches and lots of boats around to take you out on the bay."], ["Reviewed May 2, 2017", 5.0, "Awe", "The beauty of the white birds nesting above me in a vastness of fresh air and royal rock opened my soul."], ["Reviewed April 30, 2017", 5.0, "Unique rock formation with beautiful views all around.", "We decided to check out Morro Rock as a FREE planned break along our family road trip driving down the coast of California. This rock can be seen from far off and allows for amazing pictures from lots of angles and distances. While here, we were able to watch some otters playing in the water and got to see some beautiful water views. We would recommend this as a nice stop if you are traveling near here.\nShow less"], ["Reviewed April 30, 2017", 4.0, "Key attraction", "We drove out to the rock and then walked out alongside it as far as you are allowed. The sheer rock walls were punctuated with bright white seagulls nesting at this time of the year. Not exciting but interesting."], ["Reviewed April 29, 2017", 5.0, "Keeps Calling Us Back", "This is a daily visit for us during our month here. Love to watch the waves, surfers, otters, and bird life. We bring a picnic and relax. There is a beach near that you can enjoy and walk."], ["Reviewed April 29, 2017", 5.0, "Picturesque", "This Rock in Morro Bay is huge and made me think of Haystack Rock in Oregon. However, you can drive out to this Rock rather than walk to it on a beach."], ["Reviewed April 28, 2017", 5.0, "Windy & cold rock", "Ok the Morro rock is very cool, literally! The wind was more than windy and talk about wind chill, in April! Take a drive around the bay to get full on photos."], ["Reviewed April 27, 2017", 4.0, "Relaxing place - nice", "Nice scenery with ocean, beaches and the iconic rock. We strolled around the area enjoying a lot and got the relaxing vacation mode set."], ["Reviewed April 27, 2017", 5.0, "Morro Rock", "Great up close, or see it from Los Osos beach, the state park/museum, Morro Strand, Cayucos, or Moonstone Beach i Cambria."], ["Reviewed April 26, 2017", 5.0, "Cool at sunset", "Try to catch this place at sunset and you will get some amazing pictures. It is nice from the beach or from the pier."], ["Reviewed April 26, 2017", 5.0, "Must see", "Can't miss this rock. Very scenic views can be seen from miles around. We didn't walk out to the rock. Great place for photos."], ["Reviewed April 22, 2017", 4.0, "Such an amazing view!", "Loved the Morro Rock! The views were great from any direction. There are also plenty of shops and places to grab a quick bit to eat down the street. We also drove to the other side of the rock to the beach area. So beautiful."], ["Reviewed April 22, 2017", 4.0, "Top thing to see in Morro Bay", "Morro Rock is one of the main attractions in Morro Bay. It is a huge rock in the sea which is pretty spectacular. There are shops and restaurants along the sea front where you see it from and a few nice restaurants that give you a great views of the rock from higher up.\nShow less"], ["Reviewed April 20, 2017", 5.0, "Cool", "Well worth the walk out - or you can drive - to the Morro Rock. Cannot climb it though. Nice beach and surfing to the North side."], ["Reviewed April 19, 2017", 4.0, "Rainy day walk", "The rock is pretty and a nice walk. My husband and I walked here from the Inn at Morro Bay. While here we saw a number of sea otters with their offspring by the rock. There is also a closed off walking trail that cars aren't allowed through.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Wonderful hike on a beautiful morning!", "After arriving the night before during a bad storm, woke up to a beautiful morning and enjoyed a walk around Morrow Rock...waves crashing over the spit...lots of great pictures to enjoy!"], ["Reviewed April 16, 2017", 5.0, "Love the Rock", "I love to get up early in the morning and go on a 4 mile run on the beach where the Rock is located. Nothing like the fresh ocean air blowing in your face and the sight of the Rock."], ["Reviewed April 15, 2017", 3.0, "A large rock next to the harbour", "I'm not knocking it, but how can someone ask me to write a review on it. It's a very large rock overlooking a pretty harbour. It's very scenic here and a wonderful place to visit. Other than that there isn't anything I can add."], ["Reviewed April 13, 2017", 5.0, "The Most Magnificent Rock - Part of the Seven Sisters", "Need to learn more ~ quite spectacular ~ you can see it from everywhere and it takes on different looks depending on the weather. Watched it being revealed through stages of fog this morning and am going to return to do it again."], ["Reviewed April 12, 2017", 3.0, "nice", "not a must in my mind, if you are on a time limitation don't feel bad if you miss it. its only a rock."], ["Reviewed April 11, 2017", 5.0, "Beautiful stop.", "Just loved being here, beautiful weather. Gorgeous pictures. Fun place to stop between Santa Maria and San Francisco"], ["Reviewed April 11, 2017", 4.0, "Clean beach", "Peaceful!! Very clean and clear water. pets allowed. sand is great and clean. nice view of the mountains along the beach"], ["Reviewed April 10, 2017", 4.0, "Interesting Landmark", "I've been aware of this peak for decades but never appreciated how it fit into the surrounding peaks until after visiting here today. It turns out that Morro Rock is one of seven peaks in a chain stretching down towards San Luis Obispo. There's nothing to do on the rock itself as climbing it is quite dangerous; rather, the climbing is probably okay, but many people have trouble with the descent part and need rescuing to get down. There is a nice walkway from the town to the rock, it's possible to see sea otters in the bay, and there are a few very helpful signs describing the area, the rock itself, and the eco system.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Quiet, simple, lovely", "Morro Bay is one of my family's favorite vacation spots, we are even thinking of retiring there. The Rock is unique and majestic, and worth the short hike from the harbor. Lots of wildlife and natural beauty."], ["Reviewed April 9, 2017", 3.0, "Unusual detour along the coast", "Morro Bay is just an unusual place with its monster rock outcrop and it's dangerous narrow harbor entrance to the ocean with a large lagoon harbor full of pleasure and commercial boats. It looks like it supports quite a fishing industry and provides a lot of pleasure opportunities from camping, sailing, fishing, hiking, surfing and much more! Take a walk along the harbor Embarcadero and check out the otters and their young playing in the harbor waters. Lots of places to stop and eat and drink!\nShow less"], ["Reviewed April 8, 2017", 3.0, "It's a rock. That's about it.", "The surrounding area and beach is interesting if you're there to look for otters and other wildlife, but it can get very windy and there's not much to do once you are there since there are signs warning you that the rock itself is off-limits and dangerous surf can sometimes splash over the breakwater if you ignore the signs and walk out over the rocks. There is lots of parking though, so driving there for a photo op is probably the best plan but I wouldn't plan on staying longer than 30-45 minutes (and that's only if you're a photographer). Plenty more to do closer in town, where the views of the rock are actually nicer and you can rent kayaks and paddle out towards it if you like.\nShow less"]]}}