{"Mt. Soledad National Veterans Memorial": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Mt. Soledad National Veterans Memorial", "url": "/Attraction_Review-g32578-d592560-Reviews-Mt_Soledad_National_Veterans_Memorial-La_Jolla_San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/59/d9/9c/san-diego-kalifornien.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1994"}, "address": {"@type": "PostalAddress", "streetAddress": "6905 La Jolla Scenic Drive South", "addressLocality": "La Jolla", "addressRegion": "California", "postalCode": "92037", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Beautiful Location to a fitting Memorial", "Breathtaking view...Don’t miss hanging out there for a bit...We used e-bikes we rented in town and they suggested riding on up, it did not disappoint..."], ["Reviewed 2 days ago", 4.0, "Great views!", "Wonderful tribute to our soldiers, and a wonderful place to see San Diego, the bay, and beyond. Great stop!"], ["Reviewed 3 days ago", 5.0, "Very inspiring memorial", "Well worth a visit! Veterans from the area who served in any war or armed conflict are commemorated with individual plaques. Also the view is fantastic!"], ["Reviewed 3 days ago", 5.0, "This was very surreal.", "I really enjoyed the view from up there and also spent a lot of time reading the memorials that are up there. Totally got into the moment up there. It was a very nice memorial to a lot of soldiers."], ["Reviewed 4 days ago", 5.0, "A wonderful memorial for anyone who served in the armed forces", "A very moving memorial to.visit it is nice to have a place where anyone who served can be remembered. The stories on the plaques tell a lot."], ["Reviewed 1 week ago", 5.0, "Beautiful views of La Jolla", "The memorial to all branches of service is very moving...We had a plaque installed for our Father WWII and my husband Vietnam. If you are in the area it is worth the trip."], ["Reviewed 2 weeks ago", 5.0, "Breathtaking", "We originally planned to see the sunset here, but after spending too much time visiting with the sea lions in La Jolla and a very cloudy day we planned to get up early for the sunrise. Well worth it fur sure! I'm glad we didn't pass up this stop.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A place to remember", "This memorial honors veterans by preserving their legacy. There are names from the army, navy, US marine corps, Us coast guard and Us Air Force who have served and have been honorably discharged. The memorial is partly wheelchair acesible. There are ramps but stairs to the top. The view is great from the top. If you take the time to read all the plaques it is very interesting. This memorial is free and has free parking.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Good View", "It was heartwarming to see people visiting the memorial, looking for names of people they knew. The views from this vantage point were worth the ride up."], ["Reviewed 2 weeks ago", 5.0, "A must see", "A nice place to visit. Breathtaking views across San Diego and surrounding areas. The memorial stands tall centrally and is nice to walk around. Was easy to park and get to by car."], ["Reviewed 2 weeks ago", 4.0, "Great Views at Veterans Memorial", "Mt. Soledad is located in central La Jolla and is easily reached by car, but you need good directions as you motor through a neighborhood. The memorial sits on the high point of the town and offers sweeping views of the pacific and La Jolla. Soldiers from all branches and all wars are honored with plaques. The memorial is free, with free parking.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Absolutely best views of San Diego and the coast line", "Worth a visit for some amazing views and photo ops. Free but limited parking but most visitors stay around 20 minutes so quick changeover."], ["Reviewed 3 weeks ago", 5.0, "Amazing views", "Not only did we get to enjoy seeing this beautiful war memorial, but we got to experience the amazing view of the coast and city from high up. Breathtaking"], ["Reviewed 3 weeks ago", 4.0, "Stop 3 of 5 That Day", "This is a great stop, totally worth your time. But an hour is more than enough time at this location.\n\nThe memorial it's up on top of a hill - mountain- cliff. The only restroom is a potapotty, so plan accordingly.\n\nThe elevation offers breathtaking views of the area.\n\nThe memorial itself is very touching. It's a huge cross with a multi level terraced base. The base has pictures and descriptions of people who served in the military some dating back to pre Civil War.\n\nBob Hope has a plaque.\n\nThank you Veterans for your service.❣️\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful View", "There is a beatiful view and vista from this area and of course it is a tribute to the Veterans too so it is a good drive with a pleasant remembrance of our vets!"], ["Reviewed 3 weeks ago", 4.0, "Great tribute along with views", "Beautiful views of San Diego, surrounding areas and the ocean. A wonderful tribute to the vets. Worth the drive up to see."], ["Reviewed 4 weeks ago", 5.0, "A must see", "Fabulous tribute to our vets! Views of San Diego are off the charts and awesome. Definitely will go back next time I’m in San Diego."], ["Reviewed 4 weeks ago", 5.0, "beautiful panoramas", "Nice views. Nice to think about veterans who have also returned (not just those who made the ultimate sacrifice). Do wish they hadn't chosen to put a cross on top as veterans come in all religions. Although I am Christian, it seemed closed-minded to me. I suppose most people just come here to hike or for the views.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great Attraction for Vets", "This is a truly solemn location for any vet to see. The view from the plateau is great, and the ocean is a great back drop. As a veteran, it put you in the mind frame of why we did what we did. RIP vets."], ["Reviewed 5 weeks ago", 5.0, "Great view", "Mt. Soledad offers a great view of the city. In addition, offers a great memorial of those who served our country. The kids enjoyed running around and we enjoyed taking photos. Spent about two hours just enjoying the air, sight, and company."], ["Reviewed January 23, 2018", 5.0, "Respectful Memorial", "Each memorialized veteran has a plaque with their photo, the dates of their service and often a couple of sentences about them or a message from their loved ones. The plaques also list any medals they received. This makes it incredibly personal. The plaques are placed randomly (not in any date or era order) so that you can stop at any place and read about a WWII vet and a soldier who served during Vietnam.\n\nThere is parking but no building or facilities. Set on top of a small mountain, the grounds provide a 360 view of San Diego.\n\nShow less"], ["Reviewed January 22, 2018", 5.0, "We honor vets", "The Foundation provides a wonderful service to the community. Memorial Day services are always solemn, well attended and with dynamic speakers. I visit the Memorial during visits to San Diego. I view the plaques of my family, friends, and special patriots who are honored."], ["Reviewed January 21, 2018", 4.0, "Good Views", "The views from Mt. Soledad were beautiful!! There was ample parking space for us to park. When in San Diego one could visit here and then go to La Jolla for sunset views.."], ["Reviewed January 21, 2018", 5.0, "A must see in San Diego", "The memorial itself is beautiful and touching. The 360 degrees from this site are spectacular. A definite must see in San Diego!"], ["Reviewed January 21, 2018", 5.0, "Fabulous Ocean Views", "Fabulous views of the Pacific Ocean here at this very special place. Go for the view and then realize how special this spot is to honor any veteran. One can see all the military history of the San Diego area. It’s all free and not far off I-5 freeway. Portable toilets at site. Take time to look at the many plaques on display. You will find famous people like Bob Hope honored here. Remember it’s a place of honor. So be humble here.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great place for a Veterans Monument", "Fantastic views from the top of Mount Soledad above La Jolla. 360 degree view of the San Diego region. Tasteful photos displayed all around the base of this monument profiling vets from all branches and going back many years. Some names you will recognize, but all names include information to make these people real.\nShow less"], ["Reviewed January 21, 2018", 5.0, "This is a MUST see in San Diego!", "especially good for any school aged children who need a good lesson on what it means to selflessly love one's country. I'd like to go back and spend several hours here just reading all the inscriptions. My hat's off to the folks who maintain this site!\nShow less"], ["Reviewed January 16, 2018", 5.0, "The View!", "Went at night and the view literally was breathtaking! You could see for miles! The beauty of the city lights just seemed like you were in a picture. Amazing."], ["Reviewed January 14, 2018", 5.0, "one of the best views!", "Will always be busy on a sunny day but the views into La Jolla and San Diego are as good as any available. Didn't hike but saw a few possible trails"], ["Reviewed January 14, 2018", 5.0, "Beautiful memorila site.", "Memorial features service members from 20th and 21st century. Awe inspiring Cross and views of the Pacific Ocean. Visit on a clear day. You can see FOREVER!"], ["Reviewed January 9, 2018", 5.0, "Wow!!", "Wow, what a view. If you are in the area you should visit. You can see the whole city and ocean at this Memorial. Just beautiful!"], ["Reviewed January 8, 2018", 5.0, "Honoring Veterans on Mt. Solidad", "Mt. Solidad truly wins the prize for the most peaceful and breathtaking views of San Diego and its coast lines. The 822-foot mountain oasis is located between LaJolla and Pacific Beach. On top of Mt. Soledad, is the famous 29-foot white cross which is a beautiful Veterans' memorial.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Best view of San Diego", "Stunning 360 degree views of San Diego and La Jolla. Worth the drive and love that it's a veterans memorial. A must see."], ["Reviewed January 3, 2018", 5.0, "Great views, great sunsets!", "Need a very short time to visit here. You can park, then wander about and enjoy the view of the shore line. Nothing else to do, but the view and the photos you will take will be splendid."], ["Reviewed January 2, 2018", 5.0, "Amazing views", "We spent some time here enjoying the view and taking in the whole experience, profound! It was a little windy so take a jacket if you olan to walk around and take pictures."], ["Reviewed January 2, 2018", 5.0, "One of the nicest Views I remember seeing from this point!!!", "Watching the city from this point in the evening time and with friends is a must-must thing to do in San Diego :D Tips: Take a good DSLR camera with you!"], ["Reviewed December 30, 2017", 4.0, "Great views, not easy to get to...", "The views are pretty good and the tribute to Veterans is much better!!! The drive up from PB is kind of confusing, and parking can be tough! Go early and if you have already been to Cabrillo or Double Peak Park, you have already seen some awesome views...\nShow less"], ["Reviewed December 30, 2017", 4.0, "Great View of the City", "After brunch we drove up the hill to this site. Great view of the City. We had no problem finding parking while visiting this site. We would recommend that when you drive down from the site, use your lower gears to not burn out your brakes.\nShow less"], ["Reviewed December 29, 2017", 3.0, "Good view", "This place is honor veterans; past, & present. It's a peacefull place for the exception when disrepectful people come."], ["Reviewed December 29, 2017", 4.0, "Nice memorial", "This Memorial has fabulous views. It is really pretty and the Young children enjoy walking up and down the stairs"], ["Reviewed December 25, 2017", 5.0, "Christmas Vacation", "What a wonderful tribute to America’s heroes. Walking among the numerous plaques and reading them gave us an even greater sense of patriotism. If you are a veteran, have a veteran in your family or just love history and your country, this is a must see!\nShow less"], ["Reviewed December 23, 2017", 5.0, "Spectacular and Moving", "Mount Soledad has probably one of the best views because you have a 360 degree view of the ocean, San Diego Bay, Coronado Bridge, Mexico, the Coronado Islands and more. There is parking unless an event is taking place. The moving part is because it is a memorial for Veterans. When you walk up to the cross you will see plaques with pictures of Veterans and information about them. It is very touching. One caution- it truly is steep and you need to watch your children so they don’t hurt themselves. Dogs allowed.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Incredible view! Be sure to take your guests!", "360 degree view of Coastal view along Torrey Pines; La Jolla; Mission Bay to the south; Point Loma; downtown, and on a clear day you can see the Coronado Islands of Mexico.\n\nWhat's not to like about such a stunning view while also visiting this war memorial which was built during the Korean War and honors American veterans who have served through wars and military conflicts across the years.\nShow less"], ["Reviewed December 20, 2017", 5.0, "A hidden treasure high above the city!", "We took the beach tour and stopped by the monument. What an amazing place. It has thousands of service personalle plaques with stories and pictures of all those warriors! Not only was the view spectacular, but the details of the service men/women were inspiring. This is free to see and on some days they have an assigned museum rep there to explain the details.. Wonderful!\nShow less"], ["Reviewed December 19, 2017", 5.0, "Great Views But Tricky To Get there", "We took an Uber from La Jolla to the Memorial and then spent about twenty minutes checking out the panoramic views and the lovely Veterans Memorial. The views of the Pacific are amazingly beautiful.\n\nOur plan was to take the hiking trail from the top of the mountain back into La Jolla. There were several websites on Google that described the trail. But there were trails going everywhere at the top and there was no way to tell which one was the correct route to the bottom. And they were all pretty sketchy.\n\nThe sun was setting and we decided to just walk back down the road. But the traffic whizzing by made us fearful. So, we took a side road into a neighborhood and got totally lost. We walked miles and miles in circles and after several hours and asking directions from several friendly folks, we made it to a main road, still several miles from La Jolla and called Uber.\n\nIf you don't have a car, a trip to the Memorial can be rather expensive and time consuming.\n\nFor more travel tips, please check out my popular travel blog.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Lovely memorial and magnificent views", "We rode rental e-bikes from Fly Rides in La Jolla and cruises up to the top of Mount Soledad Memorial. Atop this point you will find an impressive veterans memorial and you will have a 360 degree view of all of San Fransisco. If you don't want to ride a bike, of course you can drive to the top and walk around. Was a nice stop that can be done in less and than half hour round trip from La Jolla via car. (If you are going to ride a bike though, it is a climb!!!)\nShow less"], ["Reviewed December 13, 2017", 5.0, "Great view of the city and the sunset.", "A great place to look down on San Diego and to watch the sunset. It was very windy there and gets very cool once the sunsets."], ["Reviewed December 11, 2017", 5.0, "Do not miss this!", "What a beautiful acknowledgement to US veterans! The view is amazing but the thousands of tiles, each bearing an honorably discharged veteran of every branch and rank of service, is displayed around the massive circular walls surrounding the cross."], ["Reviewed December 9, 2017", 5.0, "San Diego City Tour", "I️ really enjoyed the view and was proud of this wonderful veterans memorial. The pictures and rank and service of our nations heroes were great to see."], ["Reviewed December 4, 2017", 5.0, "Spiritual experience", "What a find !!!Found by accident while driving around la Jolla. Views are spectacular in all directions. The veterans memorial is very special and good for your soul"], ["Reviewed December 1, 2017", 4.0, "solumn place", "Solumn place that makes you realize how many have given all for the country they loved. Beautiful views of San Diego area."], ["Reviewed November 30, 2017", 5.0, "LOVE This Place", "Had the honor of attending a ceremony for three Tuskegee Airmen here a few years ago. The grounds are well kept, parking is good and the view spectacular."], ["Reviewed November 25, 2017", 5.0, "A tribute to our forfathers and mothers", "This is truly a place one should visit. This tribute to our fallen soldiers warms the heart. Our freedom has been provided by the men and women of the services who so proudly gave the final sacrifice and we all should recognize and support such memorials. History cannot be forgotten.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Great 360 degree views", "We visited while on the old Town Trolley tour to La Jolla. Great views from the mountain peak of the whole region. Nice monument, but probably of most interest to those wishing to see the name on a plaque of a US military person they know.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Mt. Soledad National Veterans Memorial", "Beautiful views of San Diego, the ocean and some islands off the coast of Mexico, the drive up there is worth it! Then, there is the touching Memorial, itself."], ["Reviewed November 18, 2017", 5.0, "A Must for San Diego Visitors", "My wife and I stopped by the monument toward the end of the day and the fog was starting to rolling in and the temperature was dropping, making it chilly. This veterans monument is at the top of the hill where the views are superb. You can see the ocean to the west and the mountains off to the east. I believe you can even see the mountains south, near Mexico. I would recommend this site to anyone visiting San Diego. Our prayers are with all of the veterans who are commemorated here.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Veterans, View, San Diego, Ocean, Amen 😎😄☀️", "From atop My. Soledad, is a Wonderfully Spectacular View of Some of the Mighty Pacific Ocean, San Diego, La Jolla but mainly, let's don't forget, to one please pay homage, to our beloved American veterans, as it's because of them, that we may enjoy this Breathtaking Sight! Safe Travels! ✌\nShow less"], ["Reviewed November 17, 2017", 5.0, "Take your camera", "Beautiful panoramic views from the top of Mt. Soledad Mt. Wandering around reading the memorial plaques is a real education in itself. Awe inspiring."], ["Reviewed November 16, 2017", 5.0, "Great memorial", "This is something everyone should enjoy for all of the veterans that served in the military so we can be free."], ["Reviewed November 14, 2017", 5.0, "A special place", "Mt. Soledad National Veterans Memorial is a very special place. Although solemn in concept, the view is gorgeous. My friends and I often hike to the peak and spend a few moments of gratitude to those that served our country. We will often read the plaques of fallen soldiers. Whatever your religious beliefs, this monument is meant for everyone of all nations\nShow less"], ["Reviewed November 14, 2017", 4.0, "Wow", "There are tons of good views in the area but when we finally crested and saw the view to be had at the top, we both said, \"Wow!\". It's really spectacle and you can see forever in many directions. We really enjoyed it, but didn't say too long. I'm not sure if you need to stay a really long time to enjoy it.\nThere is parking around the top, but if that is full there is a lot a little further down (You will pass it first on your way up.) I'd go ahead and drive all the way and make the loop for a spot first and then if need be go back to the lower lot.\nDefinitely worth it and an easy sightseeing thing to do.\nShow less"], ["Reviewed November 11, 2017", 3.0, "Night Visit", "Was amazed and a little taken back by no lighting of the cross at night and especially on Veterans Day. A string of 75 watt LED bulbs on both sides would do the job as both airplanes on departure and traffic on I-5 woud have a wonderous sight and adding to a positive reaction for a military community. I had my uncle's dad now 87 and a Korean War veteran with us who made my same comment about lighting.\nShow less"], ["Reviewed November 9, 2017", 3.0, "Lovely view", "Great bike ride from Downtown La Jolla, some steep sections but well worth the effort with the beautiful far reaching views of San Diego and La Jolla."], ["Reviewed November 9, 2017", 5.0, "First time", "Truly a sacred space. Gorgeous view but most important a place for remembering and appreciating. Attended a dedication ceremony there for a living veteran. Only place where dedication plaques of living and deceased veterans includes an image of the veteran. Even spotted a plaque for Sergeant York! Remember the movie? La Jolla has lots of great places to eat, stroll, visit/smell seals, but this is unique.\nShow less"], ["Reviewed November 9, 2017", 5.0, "View plus Memorial plus picnic", "A little known spot (even though visible from all over San Diego), is this memorial to veterans. It is a wonderful tribute to those who have served our country throughout the years. Added to that is the view - a 360-degree view of San Diego county. There are plenty of benches and grassy areas to have a picnic - probably the best place in all of San Diego for a quiet, reflective picnic.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great views of San Diego!", "I always take people from out of town here. It is a great site and the view of San Diego are the best!"], ["Reviewed November 8, 2017", 5.0, "Hidden gem with incredible 360 degree views of San Diego", "I have now made Mt. Soledad a go to place any time I am in San Diego and tell everyone I know that this is one of the places that they should visit. Great views and AMAZING memorial."], ["Reviewed November 8, 2017", 5.0, "A great veteran tribute", "The list of over 5000 vets is very impressive and emotional. The location at this high point in the San Diego area is outstanding. Great views. Well worth the visit and seeing tribute to many people, including 5 presidents, Ted Williams, Jerry Coleman, and Bob Hope along with several Medal of Honor recipe. Do not miss this.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Looks nice from 1500 feet", "I just flew over it, on my way in to Montgomery Field. It looks nice, I'll have to see it from the ground some day"], ["Reviewed November 8, 2017", 5.0, "Interesting memorial and great views", "This is a really special memorial. Different from other war memorials. Each person has a photo and short history. There are also really great views from the top."], ["Reviewed November 6, 2017", 5.0, "Freedom is not free", "This Veterans Memorial is something not to be missed. It is a reminder of those who gave all for their country. We found an Illinois family whose 13 children served. The histories are heart warming and the views from there are also very nice."], ["Reviewed November 5, 2017", 5.0, "The summit of San Diego", "The mountain topped by a huge cross of the Veteran's memorial provides panoramic 360 views for miles. Do go up for a bird's eye view of the entire city. Absolutely not worth missing."], ["Reviewed November 4, 2017", 1.0, "Not for me", "My dad fought in WW2. He was Jewish. The cross at a \"national\" memorial is wrong. Very wrong. This is not what our country is about."], ["Reviewed November 1, 2017", 5.0, "Great views and a solemn memorial", "During our city tour with Roxanne from SDR Tours we were taken to this prominent landmark. Located on the top of a hill there is spectacular 360 degree views of the city of San Diego.\n\nOn the mountaintop is the site of the Mount Soledad cross. Our guide advised us of a 25 year controversy regarding the involvement of religion in government .The First Amendment restricts government interference in religion.\n\nThe memorial at Mt. Soledad honors those deceased from war with their picture. I reflected on several of these pictures and felt sad at the loss of these lives. it becomes more real when you see a picture. The area is very well maintained.\nShow less"], ["Reviewed November 1, 2017", 5.0, "A salute to our veterans", "Great (360 degree) view of the La Jolla/San Diego area and pictures and short bios of veterans including many local military men and women. Free admission, easy parking, relatively close to the village area."], ["Reviewed October 31, 2017", 4.0, "Beautiful views and touching memorials", "This was part of a beach trolley tour that I took on a birthday weekend in SanDiego. What a beautiful tribute to both living and dead members of all military branches. The memorials, including photos, are on walls below. Above is an enormous beautiful cross. The site also offers spectacular views of SanDiego and all the beaches.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Visita imperdível em San Diego. Vale a pena.", "Unmissable visit in San Diego. It's worth visiting. The view of the city is impressive. This memorial honors the fighters."], ["Reviewed October 27, 2017", 4.0, "A Memorial Worth the Short Visit in San Diego", "Sober feel to visit a memorial dedicated to people who have made sacrifices and died for a great nation . Names and some photos are inscribed . At the top you can see the city from afar ."], ["Reviewed October 27, 2017", 4.0, "Great place to end your day", "A place with historical and patriotic significance. It is also very interesting to walk around and get to know a tiny bit of those men and women from very diverse time frames and backgrounds.\n\nIt is a great place to get to see all around La Jolla area and Pacific Beach with a view downtown from afar. Sunsets are special here. The drive up/down is very nice through great neighbourhoods and enjoying nice views.\n\nIn my honest it is a bit of a turn off that the plaques are placed there by the families. As far as I know, there is no \"special reason\" from those men and women being there, besides having served in war times (it is not based on medals, specific conflicts...) but take that as a comment rather than a criticism.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Very nice Memorial", "Went here on a recommendation of a friend and I am glad I went. The drive is very nice but the memorial is beautiful. Pictures of Veterans from all Branches of Service. Excellent views of both city and beaches."], ["Reviewed October 19, 2017", 5.0, "Specail Place", "On a clear day, you can see forever! 360* of beauty. Coming from a military family it is a special memorial to those who have served in our armed forces. Pictures, bios, the cross, and the flag are all well thought out. Great place to stop!\nShow less"], ["Reviewed October 18, 2017", 4.0, "Great place for reflection", "I sent people here before, but never went myself. Now that I've been there I'm so happy I recommended it. Mt. Soledad is a great place for quiet reflection, and inspiring inscriptions of the brave carved in black granite.\nWhile I was visiting there was a man signing his book called \"The Delta Dogs\". Turns out The Delta Dogs tells the real, gritty story of direct life and death combat engagements in Vietnam, which all too ofter resulted in the death of our young men and it was written as it happened by Major Durgin. SIDE NOTE: Thank you for your service Major Durgin!\nShow less"], ["Reviewed October 17, 2017", 5.0, "Go!", "This should be one of the MUSTS on any San Diego traveller. The 360 views from on high, is outstanding. Don't go early in June, however because the fog doesn't burn off until 2 pm"], ["Reviewed October 15, 2017", 4.0, "Awesome views", "We started our bike tour here. The visibility wad clear enough to see Tijuana. Nice memorial to Veterans"], ["Reviewed October 13, 2017", 5.0, "Beautiful Monument", "A beautiful monument to those who have served our country. It is located at the top of a hill offering a spectacular 360 view of San Diego."], ["Reviewed October 12, 2017", 5.0, "Must Visit", "Anytime I make an itinerary for friends visiting in San Diego I tell them they must go here to see the gorgeous views in San Diego. Seriously you can see everything from here. One of the best places on Earth."], ["Reviewed October 11, 2017", 5.0, "Very well done", "This is well worth the drive to see, the best Veterans Memorial I have see. More country's should erect Memorial like this for their Veterans."], ["Reviewed October 11, 2017", 5.0, "Visit to the cross", "For a reasonably conditioned bike rider this is an excellent trip. There are four or five routes, depending on how you count them. The scenery, especially coming from downtown La Jolla is spectacular. And the view from the summit, especially on a clear day, is superb. I am not religious, but kudos to the supporters who fought the attempts to remove the cross. I am a veteran and appreciate the recognition of the military on the memorial.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Visit to Mount Soledad", "My wife and I visited this tremendous Memorial to USA war dead. Plenty of parking and immaculately kept. Beautiful views of San Diego from all directions. We liked it so much we came back for sunset one night as did many others!"], ["Reviewed October 10, 2017", 4.0, "View of the land.", "Great perspective of La Jolla. Interesting way to get a lat of the land and the surrounding geography of San Diego. Nice drive through the surrounding neighborhoods with interesting landscaping and palm lined roads. Grass areas surround the memorial with a few benches. Unique plaques that honor each veteran. A white cross stands out drastically against blue skies. Free with ample parking. No facilities.\nShow less"], ["Reviewed October 9, 2017", 3.0, "Great view! Don’t forget your jacket!", "The view of San Diego is great, but don’t forget your jacket, specially near sunset, as the wind up there is colder and stronger than down in the city"], ["Reviewed October 9, 2017", 5.0, "Amazing personalized memorials", "I've seen many memorials but this one is really special. Photographs and details of men and women who have served our country. And the views are very special."], ["Reviewed October 9, 2017", 5.0, "Great views of San Diego", "Mount Soledad offers an unique 360 view of San Diego, worth the climb. Was very moved by families visiting to honor their love ones who served."], ["Reviewed October 8, 2017", 5.0, "Great 360 view of San Diego!", "We read about this place and came to see it by ourselves. Very nice memorial for veterans plus the amazing view on top of the mountain! Very clean and easy to park."], ["Reviewed October 7, 2017", 5.0, "A Nice View", "This is a great place to get some wonderful pictures of the beautiful scenery that surrounds this area. The view is breathtaking."], ["Reviewed October 6, 2017", 4.0, "A morning visit", "We visited the area as we were from Out of town and were recommended to make a stop here. The view qas breathtaking and you can see the shoreline for miles - also paid a tribute to the individuals who lost their lives fighting for our freedom.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Great place to take your guests", "Mt. Soledad is a great place to take your guests for a 360 degree view of the city. Parking can difficult depending on when you go. Earlier is better. You get ocean, city and suburban views."], ["Reviewed October 2, 2017", 5.0, "Mt. SoledadGreat overview of the city ....snd its free!", "Great overview of the city ....and its free! Make it the 1st stop on your La Jolla tour. Don't miss this. Go west on Garnet, take right on Soledad Mt. Road. Up the hill and a 360 view of San Diego, Mexico and LA Mountains."], ["Reviewed October 2, 2017", 5.0, "Beautiful site!", "Gorgeous 360 views of city and coastline. Patriotic site honoring veterans. Great place for sunsets. Worth a visit."], ["Reviewed October 2, 2017", 5.0, "Beautiful spot above it all in SD", "This is a beautiful spot day or night for showing guests the beauty of San Diego. The war memorial is also a special and dignified tribute to our veterans. My Grandfather is honored on the wall, so I go there often to say Hi :)"], ["Reviewed October 1, 2017", 5.0, "Breathtaking view!", "You can't capture such amazing view in a photo. It's a must to do visit during your next trip to San Diego!"], ["Reviewed September 26, 2017", 5.0, "Sunset Experience", "Very well done memorial. Beautiful site at sunset. We had a picnic first and then walked around the memorial, taking pictures and enjoying the reverence of the area."], ["Reviewed September 25, 2017", 4.0, "Best vacations ever", "Quiet place, plenty of parking, one of the best views of san Diego area.good place to take good pictures"], ["Reviewed September 24, 2017", 5.0, "Outstanding memorial with an incredible view", "A beautiful spot atop Mt. Soledad with a huge cross and a very nice memorial built around it. Brick walls with plaques honoring veteran's of every branch from every era. Very, very nice. Most plaques have pictures of the veteran, making it even more personal. Just an outstanding memorial. Oh yeah, there is also a fantastic view of the entire San Diego area.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Great 360 view", "Went up here on the advise of a local. Great 360 view of the Entire san diego area., including beaches, town, and all. Memorial is impressive as well."], ["Reviewed September 21, 2017", 5.0, "Bonus-Blue Angels practice", "The view from Mt Soledad is spectacular. Lucky for us, we also got to see from this vantage point the Blue Angels who are here practicing for this weekend air show. Can just say, WOW!"], ["Reviewed September 21, 2017", 5.0, "Mt Soledad", "The Cross sit on top of a mountain with 360 degree panoramic view. Very cool place. A volunteer is there to point out sites and answer any questions."], ["Reviewed September 21, 2017", 4.0, "Go on a clear day", "This is really a beautiful and peaceful spot that overlooks the city and coastline. If you are a tourist and you do not get a chance to go here, it is ok-you won't miss out on the world. I do love to go here every now and then earlier in the morning when it is clear out and there are not tons of crowds. You drive up a longer/winding road, park your car and stand or sit to have a moment of peace and a great overall view. Enjoy\nShow less"], ["Reviewed September 21, 2017", 5.0, "On top of the world", "Worth the ride up the mountain to honor those that have served our country while experiencing a 360 view of San Diego! Wow!!"], ["Reviewed September 18, 2017", 5.0, "Amazing view", "San Diego doesn't lack amazing views and this spot definitely makes the cut. Easy to park and close to other sights, it worth the short drive up."], ["Reviewed September 17, 2017", 4.0, "Poignant vantage point", "Fabulous views from the high vantage point of La Jolla, La Jolla Shore, San Diego and beyond. Hundreds of Memorial Plaques of Service men. Cool and breezy on a warm day."], ["Reviewed September 14, 2017", 5.0, "Beautiful and emotional", "Our trolley guide plus the lady who explained the area were great. The views are beautiful and just knowing that all of those faces served our country was very emotional."], ["Reviewed September 14, 2017", 5.0, "incredible tribute to veteran's", "sitting on a hill over looking san Diego harbor. i was on my way to the light house on the point. always stop at veteran's sites to honor those who served."], ["Reviewed September 14, 2017", 5.0, "Well worth the visit", "This is a very worthwhile place to visit - for beauty & for remembering those who fought for freedom. The view all the way around is beautiful."], ["Reviewed September 14, 2017", 5.0, "First Time Visit to San Diego", "On our day trip to La Jolla with the Old Town Trolley Tours we stopped here. You get a panoramic view of San Diego. The cross is a memorial to military veterans. They all deserve our respect for what they did for all of us."], ["Reviewed September 13, 2017", 5.0, "Peaceful....", "My wife and I were lucky enough to meet a soldier whose picture was on the wall. Listened to amazing stories of journeys from his military career."], ["Reviewed September 13, 2017", 5.0, "Views views views", "A great place to pay your respects to the forces and also to take in magnificent views of San Diego at this memorial site reached by car"], ["Reviewed September 13, 2017", 5.0, "One of the best views in San Diego", "The drive up the mountain is well worth the gorgeous 360 views of San Diego. Take a quick self-tour of the Vietnam memorial at the top as well, and take some time to just breathe in the fresh San Diego air!!"], ["Reviewed September 10, 2017", 5.0, ".Great View", "Fantastic panoramic view from mountain top. Inspiring to see the plaques of our service people and read about them."], ["Reviewed September 7, 2017", 5.0, "Beautiful Veterans Memorial", "Beautiful drive to the top of Mt. Soledad. The day we went it was misting and overcast. But we didn't let this dampen our visit to the beautiful memorial. There is plenty of parking. You can spend so much time here reading the many plaques of those who have served this great nation of ours. Wished we had more time, but we do plan to return when we're back in the area. We did walk down to look out over the city and beach below but it was foggy and overcast so the view wasn't good. On a clear sunny day I know it would be just beautiful.\nShow less"], ["Reviewed September 6, 2017", 5.0, "A must see!", "The Veterans Memorial is quite moving and interesting-many of the plaques featuring pictures of the vets engraved right in to the stone. But, turn around and you have a 360 view of the beach, bay and city!"], ["Reviewed September 6, 2017", 5.0, "Great panoramic views of San Diego area.", "For great views and orientation of the area, can't be beat. Also, a lovely if controversial veterans' memorial commemorating many famous as well as local vets with plaques that make interesting reading."], ["Reviewed August 30, 2017", 4.0, "Great look out", "You can drive right up which is nice (no hiking) and there are beautiful views of the city. The memorial itself is wonderful to look at as well."], ["Reviewed August 27, 2017", 5.0, "Amazing mountaintop monument to America's military men and women.", "A short drive to the top of the mountain, this was truly inspirational. Hats off to America's true heros. Free parking. Well worth the visit. We arrived at dusk and stayed past sunset"], ["Reviewed August 27, 2017", 4.0, "Tributes and Views", "We drove here specifically to see this veterans memorial but became immediately captivated by the stunning 360-degrees view from the mountain top. It was a clear day and San Diego and the Pacific Ocean sprawled beneath us. I found it easy to pick out landmarks and to truly appreciate the beautiful area. What a fitting place to honor men and women, living and dead, who have served our country in the various branches of the U.S. forces.\n\nThe memorial consists of six walls with at least 2400 plaques donated by family, friends and organizations in honor of those who gave service. The plaques have photos and information about the honoree. Some hold moving statements by family members. All wars are represented, back to the American Revolution, but the earliest I could find reflected service in the Civil War. Only a few others studied the walls during my late afternoon visit. I looked at many plaques but found none with a famous name. A 41-foot-high white cross, visible from the I-5 freeway, stands above the walls.\n\nWe were able to find a space for our car in the small parking lot adjacent to the memorial. But there is a larger lot at a lower level.\n\nSpace remains available at the memorial for additional plaques. Information about donating one is on the memorial's website.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Memorable", "Stirring memorial to our vets. Make sure to visit with the on-site vet, and ask him about the history of this monument, which has survived cultural attack and controversy. Great spot for memorable photos. Worth the short drive from San Diego."], ["Reviewed August 25, 2017", 4.0, "Very respectful", "The views are fantastic. The memorial placards of veterans are touching. Take time to look at the placards. There are some famous and some from every war."], ["Reviewed August 25, 2017", 5.0, "Stunning view of San Diego", "By husband is a disabled vet and the memorial is very accessible. The view is also stunning. We are so pleased that the cross has been and will be protected. One can get a great sense of history from looking at the plaques."], ["Reviewed August 23, 2017", 5.0, "Family from back EAST in Maryland", "We were looking for something that would interest the boys 8 and 10. We ended up All of us enjoying this memorial and the gentleman there helping us was a big help. We were able to read and go to some interesting points of interest and also see such a beautiful memorial that family members and friends used to pay tribute to their love ones and their service and commitment to our great nation. SO happy this memorial was allowed to be built and remain a standing place to come and remember. The view is amazing from the memorial overlooking the ocean and beach. Go and enjoy.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Beautiful tribute and view", "This was our 3rd time here. It is amazing to see and read about different veterans and which war they were in. The cross and views are both amazing. Don't be surprised if your car doesn't start the first time. There is some sort of electric files that messes with vehicles.\nShow less"], ["Reviewed August 21, 2017", 4.0, "On a clear day, you can see....", "beautiful views down the coast to Mexico, San Diego City proper, and north way up the coast as well. The memorial itself is interesting and makes one feel grateful for all who have served our country. There is a winding road up to the Memorial from Torrey Pines Rd/La Jolla Parkway that is a little reminiscent of Italy.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Place to remember and to give thanks!", "This monument is humbling as you walk around and read the plaques given by veterans' families. Be sure to look for Bob Hope, Audie Murphy, Jimmy Stewart, and other famous individuals as well as just reading some names of ordinary people who served our nation. A peaceful and quiet place to remember and give thanks!\nShow less"], ["Reviewed August 19, 2017", 3.0, "War Memorial with a view of the city", "Nice views of San Diego but nothing compared to Cabrillo or La Jolla. This is a war memorial, so it is somber."], ["Reviewed August 19, 2017", 5.0, "Beautiful drive and 360 degree look", "Would venture to come here. 360 degree view of La Jolla and San Diego. Overcast so fair visibility. Great memory to the men and women who served the US."], ["Reviewed August 16, 2017", 4.0, "A fantastic view and a place of peace", "Despite the controversy over religious symbols, this is a peaceful and beautiful place to visit. You get an almost 360 degree view of San Diego"], ["Reviewed August 16, 2017", 5.0, "Amazing Views!!!", "Mt. Soledad is a War Memorial. It's sits on top of a hill that overlooks all of San Diego. You can view plaques of Service Men and Women. All branches are represented. Bring a camera."], ["Reviewed August 15, 2017", 5.0, "Wonderful views", "The memorial is worthwhile, but the five stars are for the panoramic views of San Diego, which are exceptional."], ["Reviewed August 14, 2017", 4.0, "Awesome view", "Quick easy drive up the hill from La Jolla. Fantastic view 360 degrees. Monument is beautiful and has names and pictures of veterans. Fun drive through neighborhood. Parking ample a short walk down hill from the top."], ["Reviewed August 14, 2017", 5.0, "vacation", "This memorial is absolutely beautiful. A must see. The view alone takes your breath away. From the top you can see all of san Diego! What a sight. The individual war memorials are stunning to see. What beautiful detail."], ["Reviewed August 8, 2017", 4.0, "Helps to understand the dedication of Service members", "Not only is this a lovely spot to view the city, it's also a good place to understand the sacrifice men and women have made for live of country and a duty they felt"], ["Reviewed August 7, 2017", 5.0, "Drive up there!", "This is a prime location to see the whole city of la jolla and even the skyline of downtown San Diego and of course, the ocean. The drive up is nice because you can look at all the houses. The walk from the parking lot isn't super steep and is definitely worth it. Around the cross is plaques of soldiers from numerous wars and it was really cool to read some of them and see the memorial they have up there. It's free and it's awesome.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Beautifull", "quit stop but it was amazing to see with all the photos on the wall and famous people too. It a must see when in San Diego"], ["Reviewed August 1, 2017", 5.0, "Let's Be Honest.....", "Okay....confession time....I have lived in San Diego for over 12 years and never been to this Memorial. Just recently went and what a treat!!! Definitely A MUST DO!!! Beautiful 360 degree views all the way to Mexico! Why haven't we done this before?\nThe memorial with all the pictures is wonderful. It doesn't matter if you know anyone on the wall at least one or two of the veterans will touch you. So many women veterans and amazing Americans.\nDon't let the \"Cross\" bother you. Whether you are religious or not it doesn't matter. The views and the memorial are so worth it! You will take a lot of photos!!\nShow less"], ["Reviewed August 1, 2017", 5.0, "Honoring the men and women of our military", "Very glad to be able to take a few minutes and honor the men and women who have served our country. The memorial is a moving experience. The views are beautiful. Easy to find and well worth the time."], ["Reviewed August 1, 2017", 5.0, "Nice", "This is a great place to visit and pay our respects to. My daughter and I walked around and said the soldiers names out loud so they may be remembered. Seeing all the names and faces of these brave men and women is a reminder that our freedom is not free.\nShow less"], ["Reviewed July 28, 2017", 5.0, "So beautiful!", "My favorite part of San Diego. Absolutely stunning views! Love the memorial and the tributes to soldiers that have served."], ["Reviewed July 28, 2017", 5.0, "Proud of San Diego", "After all the shameful fighting over the years, I was thrilled to learn of the fate of this amazing landmark. Friends took me there to view the plaque they added to honor their father's service. It is a beautiful & fitting tribute to our veterans.\n\nAdding to the experience are the views of San Diego from this elevated place. I am so proud of all the people who stuck to their principles & created this experience for all to enjoy. Thank you.\nShow less"], ["Reviewed July 28, 2017", 4.0, "touching memorial to service personnel", "This is a touching memorial. There are pix, names, and info on many who gave their lives for our country.\nThe memorial is on a high point with plenty of visibility.\nThere are plenty of hiking trails, though I am not sure if they lead any place special.\nThere is a port-a-potty available near the memorial.\nWe found it windy. Perhaps take a jacket.\nShow less"], ["Reviewed July 27, 2017", 4.0, "amazing view!", "The view is breathtaking, especially being a San Diego native. if you haven't stopped by, I recommend!"], ["Reviewed July 26, 2017", 5.0, "Impressive", "Well worth a visit. The view from the peak is impressive, even through the fog. Thee are some services available and parking is plentiful."], ["Reviewed July 24, 2017", 5.0, "Great views of San Diego", "So peaceful and beautiful place. Highly recommended for everyone. The view of San Diego from above is amazing."], ["Reviewed July 24, 2017", 5.0, "Vet in the Family?", "If you have a military veteran in the family, this is the place to see. I am lucky to view my dad's plaque here at Mount Soledad. We decided to obtain the plaque to honor his U.S. Navy career. All branches of the military are honored here. Truly one of the few places which makes me proud to be an American!\nShow less"], ["Reviewed July 23, 2017", 5.0, "Spectacular view. A must when in San Diego", "A beautiful view of the Pacific. We went there via car to see and experience the beauty of the place and to watch the sunset. A very memorable 2 hours spent. Highly recommended this place"], ["Reviewed July 22, 2017", 4.0, "Beautiful memorial and amazing views", "GPS led us to this place easily. There are 2 places you can park. There's a lot you will see first and then there are parking spaces surrounding the memorial. After circling around twice to try to get a spot around the memorial, I decided to park down at the lot. It was not too far of a walk. The views are amazing! The memorial is well maintained and is a great tribute to our Veterans.\nShow less"], ["Reviewed July 22, 2017", 5.0, "A must in San Diego!", "I have been up there a few times more than 30 years ago, but it was fantastic to see that the plac has not changed much: anyway, the view is stunning and gives a great overview of America's finest city: San Diego"], ["Reviewed July 21, 2017", 5.0, "The most humbling place I've been in San Diego.", "Visited with a friend and survivor of the Korean War. He will be laid to rest here. The visit left me in awe of our departed veterans and what sacrifices they made for us. A truly beautiful resting place."], ["Reviewed July 20, 2017", 4.0, "Beautiful 360 degree views, and Veterans' Memorial", "We had some time to kill before going to the airport so took a drive up here. The views are great. More interesting to us was the memorial plaques. We found Ronald Reagan, Gerald Ford and quite a few other famous people who had served in the military. My daughter was intrigued by the women that she found who had served.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Must see where Dr Suess wrote his works!", "This place is easy to get to and very well taken are of.\nRelaxing to sit and read, or people watch for a few hours. Breezes are so welcoming. Spent hours relaxing and enjoying the wonderful sights of San Diego.\nHighly recommend this place to visit.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Stunning Views!", "Mount Soledad provides the spectator with views of the entire city of San Diego. You can see the Pacific Shore Line, Down town area, and even the Mexican Border on a clear day!"], ["Reviewed July 19, 2017", 4.0, "San Diego 360", "Mount Soledad offers a sobering memoriam to the fallen service members through out the years. It is a great place of reflection with the back drop of a breathtaking 360 degree view of all San Diego has to offer from the border to the south with Mexico to the mountains to the east and all the way North to Carlsbad. Great for bringing those out of town guests to give them the true \"big picture\" of our city,\nShow less"], ["Reviewed July 18, 2017", 4.0, "Pretty neat.", "This is a neat little drive. I think there are good views but there was lots of fog. A very cool monument to those who have served in the armed forces."], ["Reviewed July 15, 2017", 5.0, "Gorgeous views and quiet inspiration", "When the hustle and bustle of San Diego get to you, escape to tranquil Mt. Soledad. It is quiet and lovely to stand by and gaze over a 360 degree view of beautiful San Diego!"], ["Reviewed July 14, 2017", 5.0, "One of the most emotional experiences (See review)", "Whenever we visit San Diego we always make sure to head up to Mt. Soledad. The view is amazing and it is a veterans memorial site. The last time we were up there my wife (Army vet) we noticed an older man wearing his uniform from when he was in World War 2. He was cleaning the memorial where all of the fallen soldiers name were placed around the memorial and saluting them when he was done. Probably one of the most emotional things that I have seen in a long long time.\nShow less"], ["Reviewed July 13, 2017", 5.0, "A 360 degree view of San Diego and environs", "This small park with the veteran's memorial is located at the top of one if the taller hills surrounding San Diego. Views on a clear day all the way to Mexico. It gives a good views of Miramar Naval Air Station of \"Top Gun\" fame as well as UCSD, Mission Bay and San Diego Harbor....even a bit of the Coronado Bridge. The drive down to or up from La Jolla is steep. The easier entrance is from the Pacific Beach side. Brave bicyclists make it a destination climb. So keep your eyes open for cyclists.\nShow less"], ["Reviewed July 13, 2017", 3.0, "Make sure and go on a clear day", "This place looks like ti has great potential on a good clear day. I went and was not very impressed to much mist every where and felt like I was blind and everything was blurry."], ["Reviewed July 12, 2017", 5.0, "Calm, peaceful, very relaxing", "We visited as part of a tour so parking wasn't a problem as mentioned in some of the other reviews. There were also several spots open when we visited. The views are great and the military honor plaques. On a side note, look for James Stewart's plaque.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Beautiful Tribute to Veterans", "This is a nice stop in the La Jolla area. Unfortunately, the day that we visited, the marine layer was very heavy and we weren't able to enjoy the view. Plan to return the next time I am in San Diego."], ["Reviewed July 11, 2017", 5.0, "Excellent views", "This is a free attraction where you can see all of San Diego. There is limited parking but usually something opens up quickly. It's a great place to take out-of-town visitors. You can also picnic or just sit and watch the world go by. It's a nice place to spend some time in reflection.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Fantastic views.", "Really incredible views of the coastline. Also a moving memorial to WWII vets. Parking can be a little difficult, but the views are really amazing."], ["Reviewed July 11, 2017", 4.0, "Great views limited parking and times", "Great place to take visitors to let them view SD county. Slow driving around curvy roads to top. Limited parking available. Plenty of hiking around park for kids. Safe environment."], ["Reviewed July 10, 2017", 5.0, "mt soledad", "a very beautiful & awe-inspiring visit---the 360 degree vistas of san diego around the city--the bay & the ocean. a wonderful tribute to all veterans--"], ["Reviewed July 10, 2017", 4.0, "Must-see place in San Diego", "Spectacular view over all of San Diego. Pleasant place with interesting plaques of memorials for San Diego warriors.. Best of all, it's free"], ["Reviewed July 10, 2017", 5.0, "Mount Soledad", "To get one of the best views in San Diego, drive to the top of Mount Soledad in La Jolla to gain a panorama view of the Pacific Ocean, San Diego and Mission Bay and on a clear day all the way to Mexico! There is a lovely memorial to Korean War veterans and often one of them will be on hand to chat with the public. I always bring visitors to this site first so they can understand San Diego's geography and get awe inspiring ocean and coastal views north. It's always a wonderful photo opportunity.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Beautiful!", "Great views and excellent memorial to our military. Sits at the top of the hill so there are magnificent vistas in many directions. So worth a stop."], ["Reviewed July 10, 2017", 5.0, "Mount Soledad", "I love Mount Soledad. First its a great military memorial. The cross is beautiful and I hope they never remove it. From this location you have a 360 view of San Diego. Its a must visit and see."], ["Reviewed July 10, 2017", 4.0, "Popular, scenic, historical", "Would love to rate this attraction as 5 stars but the young people loitering at the foot of the cross using foul language was a distraction. They were obviously there for the view.\nAs a first timer, seeing all the photos and names of some of our Veterans was a reflective experience. This memorial covers most of the wars we have been involved in starting with the Civil War. There is a true story behind the cross that involves an atheist who sued to have it removed. Two parking lots are available; one is for those who can't walk far located near the memorial. One portable potty is also near the memorial. A few benches are around the area. The 365 degree view includes the Pacific Ocean, La Jolla, Oceanside, Mission Bay, San Diego and beyond.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Beautiful vistas of the cliffs and San Diego", "Took an uber to the top of Soledad for the sights and the monument. It was overcast and cloudy but still worth the trip. The memorial has many unit and individual remembrances with room for more. The vista out over the ocean is stunning. With the focus on the monument, the 360 degree view is a little wild - no observation decks or anything, but that is fine, enjoy a little nature and spend a few minutes on each side looking at La Jolla shore, San Diego, and the hills behind.\nShow less"], ["Reviewed July 8, 2017", 5.0, "A very moving experience", "We arrived at the Veteran's Memorial as a dedication was taking place. We were trying not to intrude on the family's privacy during the very moving ceremony, but it was hard to not get caught up in it. What a wonderful place for a tribute to your loved one! It is quiet and beautifully done and the views from there are fantastic. Well worth the scenic drive to the top.\nShow less"], ["Reviewed July 7, 2017", 5.0, "What a view !", "Well worth going to, driving, walking or riding your bike.......last two options -not for the faint of heart !\nA breathtaking view, well worth the time to get there, plus there are plenty of awesome houses to check out on the way !\nControversy about the cross being on city land, representing a religious symbol,........that\nbattle has been going on for MANY years, but the cross is still there !\nShow less"], ["Reviewed July 4, 2017", 5.0, "Amazing Views and Wonderful monument", "I saw this listed on a tour, but we were on a road trip. Such a beautiful spot to look over the city. The monument was an amazing tribute to our veterans."], ["Reviewed June 30, 2017", 4.0, "Great Views of San Diego", "Easy to get to and lovely views of the city. Great place to stop for pictures. Lovely scenic drive on the way up there as well."], ["Reviewed June 28, 2017", 5.0, "Today was so clear you can see great views", "The view on Mount Soledad is incredible. walking around the top of the walk you can see forever. This is a great spot to take amazing pictures. The war Memorial has so much history to view. If you have time this is something that is really worth a visit.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Beautiful View of San Diego", "When we were in San Diego, we stayed at an Airbnb in Fairmount Park. Our hosts actually told us about Mount Soledad and I'm so glad they did. When we got there, I realized it was the same cross I saw from La Jolla beach the day before. First off, the view of San Diego from up here is breathtaking. You can literally see most, if not all, of San Diego from here. I had no idea there was a memorial. The plaques of fallen soldiers are done very respectfully. There's not much else to write, other than if you're in San Diego, whether you're a local or a visitor, you have to visit Mount Soledad.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Humbling but necessary", "As UK Naval Veterans, we were especially pleased to arrive here courtesy of Old Town Trolley Tours. This memorial is in immaculate condition and in fact when we arrived there was a volunteer there polishing the marble. We loved the fact that alongside were pictures of the fallen and this place was quiet yet respectful - and in a stunning setting. We wish more thought could be given to setting memorials in locations like this - it's the least our comrades deserve. Well worth a visit and don't forget to say a quiet prayer for them and their families - thank you all.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Fabulous views overlooking the ocean, cove, San Diego skyline - all at an historic venue.", "Built as a Veteran's War Memorial, this spot can be enjoyed in less than an hour. Great spot for pictures and views. Enjoy the historical aspect as well. There may be an ice cream truck for treats, and there's a porta-potty. Worth the few minutes drive to get there.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Beautiful Memorial", "The views alone are worth the trip, but so are the many tributes to US veterans. So many photos and histories. Bittersweet and touching and way too many have passed on. Hopefully to a place of love and rest."], ["Reviewed June 25, 2017", 4.0, "Great Memorial and Amazing Views", "I am Canadian. I found the memorial quite moving regardless of my nationality. The memorial is beautifully done. I enjoyed going around and finding the couples and woman that served.\n\nI visited during June gloom so our day was quite overcast when we visited. However, the views were still wonderful. I can only imagine what it would be like on a clear day.\n\nI was able to venture to this destination as I took the 'La Jolla & Beaches Trolley Tour' with Old Town Trolley Tours.\nShow less"], ["Reviewed June 24, 2017", 5.0, "Salute", "Went up the hills and was stunned by the gigantic cross. Heard this is memorable for those army/navy/Air Force who were retired. The view is good for the Pacific Ocean."], ["Reviewed June 23, 2017", 5.0, "Very moving memorial. Beautiful views.", "We were taken to this memorial by the friends who we stayed with. It was very moving especially as the memorial plates mostly had photographs on showing the service personnel. The view were breathtaking. The whole place was immaculately kept. Would definitely recommend."], ["Reviewed June 21, 2017", 5.0, "Must-see! National Veterans Memorial", "This is, besides having gorgeous views overlooking La Jolla and San Diego, is a definite must-see. This is one of the most unique veterans memorial in America and the only memorial that honors veterans whether living or deceased."], ["Reviewed June 18, 2017", 5.0, "360 views of San Diego", "Bring a sweater and your camera. The views are spectacular. A group tried to have the cross removed but a private group bought it and it is a lovely tribute to the fallen military."], ["Reviewed June 17, 2017", 5.0, "A marvelous memorial", "Since taken over by a private concern Mt Soledad has become a genuine jewel. The tiles on the wall are amazing, and well worth your time, assuming you care about our military."], ["Reviewed June 14, 2017", 5.0, "360 degrees view of San Diego", "We've been to San Diego several times but it was out first time here. This was only about 15 mins away from our hotel. Im so glad I convinced my hubby to go here. It's actually a memorial for veterans on top of the hill. You get a 360 degrees view of San Diego city. Going through the memorial plaques for the veterans was very interesting it was also a very nice way of paying homage to our veterans. We waited for the sunset and it was surely a spectacular sight to behold. Parking was ample on a Tuesday..There was no entrance or parking fees. I highly recommend you check out this site if you're in SD.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Very fitting memorial", "A beautiful memorial to those who have served our nation. Very humbling to see pictures of all those that have served."], ["Reviewed June 9, 2017", 4.0, "A stop off on the coastal drive to take in the view", "Great views available as long as the marine layer isn't in. Easy parking. Memorials were moving and beautifully presented."], ["Reviewed June 3, 2017", 5.0, "Mt. Soledad Memorial", "I never fail to cry with each visit to Mt. Soledad. We have plaques for my husband and both of his parents so it is very important that we pay our respects. The plaques are available for all veterans with an Honorable Discharge, living or deceased. It is a gorgeous site and a wonderful tribute to all of our veterans. Everyone should visit.\nShow less"], ["Reviewed June 3, 2017", 4.0, "amazing sunset", "i love this place as this is for sure memorable and also the sunset view is amazing. i for sure will miss this"], ["Reviewed June 1, 2017", 4.0, "Very moving experience", "I visited this spot as part of an organised tour. I found the location absolutely stunning, and the walls of remembrance intensively moving. It was also unsettling to see new plaques being added, and spaces being prepared for new additions. The only thing I didn't like was the groups of people shouting to one another and messing around on the steps of this fine memorial.\nShow less"], ["Reviewed May 31, 2017", 4.0, "view", "Enjoy the view ! Clear sky amazing scenery on the mountains, the beaches and the city centre. end up in la Jolla afterwards"], ["Reviewed May 30, 2017", 5.0, "Eye Popping Views!", "Set on top of the world in the back of a ritzy residential neighborhood, Mt. Soledad offers world class views of San Diego coastal and inland areas. Moving WWII memorial is a moving tribute to those who fought for this country. Can be windy so take a jacket or wrap.\nShow less"]]}}