{"Muir Woods National Monument": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Muir Woods National Monument", "url": "/Attraction_Review-g60909-d124638-Reviews-Muir_Woods_National_Monument-Mill_Valley_Marin_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/af/96/72/muir-woods-national-monument.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "5700"}, "address": {"@type": "PostalAddress", "streetAddress": "1 Muir Woods Rd", "addressLocality": "Mill Valley", "addressRegion": "California", "postalCode": "94941", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Outstanding", "This was the perfect day trip for us from our hotel in Napa. The trees are amazing and left us speechless. Everyone that works here goes out of the way to make sure you’re having a great time. This place feels like another universe. John Muir is a legend and is memorialized here. Visit and feel the positive energy here..\nShow less"], ["Reviewed yesterday", 4.0, "Always wanted to go", "Very interesting and beautiful. Wish there were more rangers and information around through out the trails. Otherwise, really good experience and gorgeous scenery. You have to pay for a time slot now. Either book an appointment for parking or use the shuttles from Sausalito. Parking was not fun. There needs to be a parking attendant. One spot parked crooked into another and therefore the rest of the row was messed up. Then you pay additional $10/person to enter.\nShow less"], ["Reviewed yesterday", 4.0, "Make reservations", "I am writing this review to warn people as I did not get to hike the woods because we didn’t have a parking reservation. I did not see this noted anywhere and I misread the website that say “ shuttle and parking reservations”. This is a new policy that began in 2018 and should be more prominently displayed on the website.\nShow less"], ["Reviewed 3 days ago", 5.0, "Beautiful", "Get your parking pass online before going it’s required you can not get into parking lot without it - $8.00. We bought an hour before we went no problem. We lost GPS signal & got lost but allowed enough time before our pass expired. Once we parked & entered it was $10.00 per person to Actually go in the park. We walked on several trails & it was beautifully there were several spots that you could take pictures close up pictures of the redwoods. The gift shop was amazing! Lots of cool shirts & other items!\nShow less"], ["Reviewed 3 days ago", 4.0, "Beautiful", "A great area to escape the city, with beautiful trees and a creek to hike near. The Jr. ranger program is great and we had a fun morning. Don’t forget to reserve your parking online before you go!"], ["Reviewed 3 days ago", 1.0, "Parking chaos", "Different members of our party referenced the web site a couple times to plan our trip weeks in advance. We even knew how long of hike we were going to take.\n\nWhen we arrived, attendants were SCREAMING at cars to tell them lots were full and YELLING at visitors to send them to the next lot. And the next lot.\n\nAt the last lot, we were told we needed a parking pass and that the passes were sold out for the day. This was a recent policy but it was not posted on the web at the time we made plans to visit.\n\nWe ended up at Muir beach where signs didactically encourage visitors to plan their trip to Muir Woods and arrange parking. Talk about Insult to injury. How about planning the policy roll out with sufficient notice? All that way to travel, all the planning, wasted.\nShow less"], ["Reviewed 5 days ago", 5.0, "Must do- peaceful and beautiful", "Any one visiting San Francisco must go to see the Muir Woods. Such a majestic and serene place for sure."], ["Reviewed 1 week ago", 4.0, "Easy Escape from the City", "My husband and I were in San Francisco for a long weekend and wanted to get out of the city. Muir Woods is close to the city and easy to reach. We rented a car and drove, which was easy enough to do - even for people unfamiliar with the area.\n\nThe park is lovely, well maintained and lots of clearly marked trails. Do be careful to familiarize with the maps, as there are trails that go outside the park range and it could be easy to get turned around.\n\nGreat opportunity to see the redwoods, though these are not the big trees you might expect from the Redwoods Park further north.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great place to hike but make sure of your reservation", "Luckily we came in winter when there were few crowds because we were ten minutes late for our time slot. After receiving the standard scolding and warning to be prompt next time we headed off for a day of hiking. Great scenario and a large number of varied walks in terms of length and degree of difficulty. Do not take the Redwood Creek Trail to the Muir beach because most of the trail is closed due to a bridge washout and you will pretty much be walking the road. Suggest saving your time and driving down to see the beach instead.\nShow less"], ["Reviewed 1 week ago", 5.0, "Like a natural cathedral", "The sacred stillness of Muir Woods was a lovely change from the noise of the city. The majestic redwoods, the fragrance of eucalyptus, the call of a barred owl. . . all contributed to a magical experience."], ["Reviewed 1 week ago", 5.0, "Awe inspring", "We visited Muir Woods for a long afternoon hike New Year's week. The trees are magically daunting. There are enough trails of varying lengths that we were away from the holiday crowds within 15 minutes of walking. Everyone fortunate enough to see America's giant redwoods will know the feeling of awe. Even the 5 teenagers we had with us were inspired. They could have walked for hours more. Tips - bring sturdy shoes and water. Dress for chilly weather, as the woods have a colder, damper micro-climate that the rest of Marin. Go early and if possible on weekdays to avoid crowds. But go, regardless!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A Good Place to See Redwood Trees", "This is a really good spot to see redwood trees up close. The basic trail is either paved or a boardwalk which is really easy to walk with younger children and older people with balance problems. There are hiking trails for those who are more adventurous. If you haven't heard you need a parking reservation now days, either that or take a shuttle. The parking is only $8 so it is well worthwhile. If you don't have a parking pass you will not get in. We saw a number of people turned away.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Canope Trail is a STEEP, but gorgeous hike!", "It was very easy to reserve our parking spot the day of our visit, since we were coming mid-winter. We enjoyed the level walkway path that is perfect for people of all ages. Since we were there in February, it was extra chilly in the shade of the trees! When we came to the end of the path, we chose to go up toward Canopy trail, and read that we needed to give ourselves 2 hours, have a plan, WATER, and a map... we snapped a pic of the map provided, and ventured up. Gorgeous! It was a steep climb, but the trail was clear the whole way, and so worth the effort. We shed layer after layer while climbing, as we were back in the sunshine and working hard. It took our family an hour to finish, but we did not take many breaks. This trail is not for the faint of heart, those with bad knees, or anyone with a stroller. Do bring water. Do mind the trails. Do enjoy!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Blissful wedding", "First time to SFO ever. We spent a magical event during my sister-in-law’s wedding ceremony inside this National Monument.\n\n(... leaving aside tha fact that I was looking for George Lucas’ eawoks); mind, heart and soul disconnect from modern society, and connect to what matters most, yourself. Even better, when shared with family and dear friends.\n\nThis place is indeed worth our tax money, and more so worth all of our efforts to preserve.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful and awe-inspiring...", "This is a fantastic family location! There are multiple hiking trails ranging from easy to difficult, and no matter which one you choose, you will be surrounded by the beauty and stillness of the redwood forest. There is a new requirement to make reservations ahead of time, so be sure to check out their website before you plan on traveling.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Disappointed that we couldn't find parking!", "After driving at least 10 miles north of San Francisco, we found no parking at Muir Woods, as it has a very limited number of parking spots available. It would be helpful if the park could somehow post a sign down by the main highway showing that all of the parking spots are filled before folks trak another 10 miles on the winding, hilly roads that lead to Muir Woods.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Buy parking make trip easy", "We have been many times over the years but recent visit was really great because we purchased parking on line. Best $8 you will ever pay.\nFill in date and time and they confirm a half hour window to arrive. Print out ticket and bring it along as they scan it upon arrival. Park where they point and your on the way to a great visit. Stay as long as you like.\nCan you imagine an outstanding visit on a sunny Saturday morning?\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stunning and peaceful", "This was so stunning and peaceful. Please remember to keep nice and quiet on this walk for the enjoyment of others. I recommend going on your own to spend as much time as possible."], ["Reviewed 2 weeks ago", 4.0, "Reservations Required National Park", "You cannot visit this attraction without reservations. Parking onsite requires a reservation. Using a shuttle to arrive onsite requires a reservation. Plan appropriately. There is no cell service or Wi-Fi in the park. Now that all of the warnings are out of the way. This is still one of the most beautiful parks I have ever visited thanks to the amazing trees. Beautiful winding path through the trees with excellent signage telling you about the history of the park, wildlife and ecology of the area. There is a cost for everything! Admission, parking, shuttle and exorbitantly priced food and souvenirs. And unfortunately even though there are many signs asking visitors to speak quietly and enjoy the sound of nature, too many don't! Most children were very well behaved, but groups of adults were not as compliant! Plan on being there between 1.5 and 2.5 hours. Do your research on the current cost before going. Also there is A LOT of traffic getting there, so planning your arrival at your reservation time can be tricky. There are also many bicyclists along the narrow winding roads to and from the site. Drive carefully. Enjoy!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great nature walk", "If you've heard about the redwood trees, this is a great place to experience them. We were staying in San Francisco with no car so we booked a tour from Viator but there are a few different tour groups to choose from that'll take you here from the city (shop around). The trees are beautiful, you'll take lots of photos if you're looking for some natural beauty. We didn't see too much in the way of animals but it was still great. The trail through the park is fairly easy and gets rather crowded during peak times. We took our time and let others pass at times so we could get the photos we wanted at times. There's a gift shop and cafe with bathrooms not far from the entrance to the park.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Treasure Trove of Trees, But Packed with People", "First off, I arrived at Muir Woods on a tour bus as I didn't want to be bothered with parking. The forest itself is breathtaking but more crowded than other redwood forests that I have been to. This is by no means a knock on the park as it is still a beautiful sanctuary that enthralls everyone who visits. I can vouch for there being NO cell reception in the woods, so be sure to have a ride back, or you're in for a VERY long walk to civilization!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Treasure Not to be Missed", "Beautiful Muir Woods a short drive from SF is not to be missed....even for locals who might have forgotten about it due to so many things to do in the Bay Area. Gorgeous scenery & miles of hiking paths. Go in off season if it’s a nice day. Be sure to make a parking reservation which we did online. So much history here and, of course, the main attraction: the amazing redwood trees which are the tallest trees on the planet & found only in the northwest US along the coast.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful ... chilly ... worth the trip!", "What an amazing place.\nTrails to walk on ... creeks ... birds, slugs, bugs ...\nWOW!!\n\nAll we can say is WOW ... it's totally worth the trip.\nYou can spend as much time as you want walking on the trails and just breathing in the fresh cool mountain air.\n\nEven if you are not in to nature ... you will find these woods to be energizing and up-lifting.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great place but reservations are now required", "Reservations are now required and can be made online for parking (8 bucks). If you don't make a reservations you can't go....period. Bring your printed or cell phone bar code voucher or you will not get in (no cell service there). The shuttle is also available for reservations on the weekend only (3 bucks). Go to gomuirwoods.com\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Gorgeous", "I went two days in a row because I loved it so much. The hiking can be easy to moderate depending upon which trail you choose. Take your camera and bring a jacket even in the summer because where it is shady, it gets cold. If you catch a guide, you may find it interesting but they do go into lots of detail.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Awesome place", "This place was awesome. Very quiet and peaceful. Three tips - #1- go as early as you can. It’s less crowded and will be much more enjoyable. #2 - there is ZEEEERRRROOOO cell service here. There is one old school payphone. I don’t even know what it costs to call but you will not be able to use your phone to get a cab or Uber so plan accordingly if you’re not on a tour bus or in your own car. #3 - there’s a path that you can take up on a rim with great views. Do not take children or people who lack excellent balance on that path. It is very narrow in places and can be scary. Last thing - be quiet when there. There are signs that say be quiet but some people disregard and it takes away from the experience. This is not a place to let your kids run wild. It’s amazing to see the trees but the peacefulness of it is the best part.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Muir Woods Trip", "My sister and I visited Muir Woods In January 2018. It was spectacular. I can't believe how old and tall the redwood trees are in this park. Their is a great walkway through the park that allows everyone to enjoy and take photographs without destroying nature. There are great gift shops with cool souvenirs as well as a café for purchasing a warm beverage. I personally purchased a fog globe which I thought was pretty cool. The Muir Woods Park was beautiful and seemed unspoiled which I enjoyed. If you love nature walks and enjoy very tall trees and beautiful fern beds, this is the place to visit.\n\nLeAnn\nLexington, KY\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Peaceful & Scenic.", "It's awesome looking at these gorgeous redwood trees. Beautiful walking in there. Nice wide boardwalk to walk on, small café & gift shop. My shuttle driver said one tree will build a 18 room house. 600-1,000 year old trees.\n\nThere were two ranger talks 10:30 and 1:30 missed both. Took a tour shuttle. We arrived at 11:30 and had to leave at 1:05. Would loved to hear the ranger talk. I felt peaceful in there.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Come early to get in free", "If u get here early enough it's free admission. It's easy enough to Walk through if u stay on the main path. U can get good pics with huge trees ofc."], ["Reviewed 4 weeks ago", 5.0, "Nature at its best!!", "Ever since we decided to stop over at San Fransisco during our trip and I got to know about Muir Woods, I could not wait. Only ever seen pictures on National Geographic I always wanted to see Giant Redwoods up close.\n\nReaching there - If you don't have a car then this is the only tricky part. We were staying in Marina District and had to take 3 buses to reach Muir woods. There are plenty of buses but could not find anything direct. But using Google Maps and asking around we reached without much delay.\n\nWe reach the top of one of the trails and started from there. Did a decent hike and gradually reached the main entrance of the park. All along the trek, we paused to look around and feel the beauty around us. It was so silent; away from the city hustle bustle.\n\nAll along we had the giant redwoods to look over us. They were taller and larger as we got towards the main entrance. It's a view to behold. And as the guide at the park told us these were not even the largest redwoods in the world. But at around 250 feet they sure were huge.\n\nIf you are visiting SFO, do visit Muir Woods. Its a must see especially so close to the city.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "So beautiful and peaceful", "Muir Woods is such a peaceful place to walk around. There is a wooden path and east walking. It was nice and cool in the trees. The trees are so huge and breathtaking."], ["Reviewed January 23, 2018", 5.0, "Absolutely gorgeous!", "One of my favourite experiences during our US trip hands-down! We used one of the shuttle services to get to the Muir Woods, very easy way to get there & not worry about directions/parking. Everything is run exceptionally well - pricing is clear, maps available, trails well-marked - all making it very easy for you just walk & enjoy the serene beauty of the forest. The little cafe/souvenir shop was also the best one I've been to - not full of cheap, plastic rubbish. Food is simple & rustic but lovely - all made on the premises - try the corn bread & honey sticks! Souvenirs are great - lots of natural & interesting pieces (carved bowls, animals, silvered maple leaves, eco-friendly gear, etc.) SF is lucky so have this place so close by!\nShow less"], ["Reviewed January 23, 2018", 5.0, "Silent Appreciation", "This was such a nice place to visit and feel some peace from nature. With the new reservation system for parking, it was also hassle free for us. Don't forget to download your barcode before coming up, and try to get there early in the day for best parking spots. I truly lost track of time in this wonderful forest retreat. The easily reached trees were impressive in their majesty. We didn't use any of the trails, but they are thoroughly married and tasted inside the park. I had complete confidence in what level of tail I could handle if we did go hiking.\n\nThe restrooms were clean and the snack bar had some awesome gluten free scones! I'd almost go back just for those scones.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Beautiful scenery!", "Muir Woods was a wonderful place to visit. It was very relaxing as we walked the trails and took photos of the enormous trees!"], ["Reviewed January 22, 2018", 5.0, "Overwhelming Beauty", "Muir Woods is a magical place that I thought might only exist in dreams or fairytales. I could have spent days exploring. The weather in October was perfect to enjoy the majestic trees."], ["Reviewed January 22, 2018", 5.0, "Heaven on Earth", "Having grown up on the east coast the only Redwood Trees I saw were in geography books in school. They were remarkable to look at even in a picture. Let all that come to life at MUIR WOODS NATIONAL MONUMENT. You will be so appreciative that you came to see these magistic trees all in their glory. The natural moist evironment in which they grow fosters many other green mossy vegetation making the trip around Muir Woods lush. There are short trails to walk for folks with either a limited amount of time or a limited physical capacity. The .5 loop a pretty flat and wheel chair accessible. There are longer hikes and more advanced trails to hike on if that's what you are looking for. Free parking in the lot when you arrive. It's more crowded on the weekends of course but show up early on a weekday morning and you might have the whole place to yourself. Enjoy!!!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Amazing natural wonder", "If you are anywhere near here you must visit. Amazing beauty and majesty throughout the entire area. Make sure you have your transportation taken care of as there is no cell service. You can buy a bus pass when you are there for your return to town. Really no need to pay for a tour.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Redwoods within 10 miles of SF!", "We went to Muir Woods on the last day that you could park neal the monument without reservations. It was a beautiful day and the walk was gorgeous....unfortunately we didn’t have enough time for the longer hikes. If you happen to go there on a day without reservations, I’d recommend getting there early.\nShow less"], ["Reviewed January 21, 2018", 4.0, "The best trails within 30 min of a major metropolis", "Parking or bus reservation is now required starting this week - the first week of a fed government shut down. Anyway, we made reservation online for a Saturday morning at 10:00 am. Everything went well. We got our parking space near the park entrance.\nThe main trial is along a brook stream. After four bridges on one side of the stream you come to a fork. We took the Johnston trial which took us to the left side of the brook. It is a nice walk for about 5000 steps with about 50 steps up. It is very doable trial. The trial takes you back to near the entrance. After the easy trial , We decided to take the Canopy trial and come back on Lost Trial. It is a trial of steep incline with over ten thousand steps. But the beauty is beyond description. At the top of the trial, it is a near the tip of the red wood forest. We ended our tour around 2:00 pm. There is a sandwich shop near the entrance next to the gift shop. We ordered a hot chacolate which hit the spot.\nShow less"], ["Reviewed January 21, 2018", 5.0, "A natural wonder", "There is no other natural wonder this close to a major city. It's gorgeous And spectacular with magnificent redwood trees."], ["Reviewed January 18, 2018", 5.0, "a Beautiful must see", "Wow! I didnt really know what to expect here but wow! It is so quite and beautiful here. Very relaxing and calming! It was CHILLY! make sure you layer because it is very cool under the shade and can be cool/damp. I did the canopy trail 2.7 miles round trip. It was not hard! My mom had a knee fracture in June and did the trail just fine! They do have bathrooms at the entrance and at the gift shop. They just started requiring reservations on January 16th of this year! Parking is very limited so make sure you plan ahead and make a reservation for your vehicle! To get into the park it is a $10 /person fee. If you have the National park annual pass it is free for up to 4 people! the annual national park pass is well worth the $80. It lasts a year and works at ANY national park and includes 4 people!\nShow less"], ["Reviewed January 18, 2018", 5.0, "Only 40 minutes from San Francisco!", "We stopped here on our way from Yosemite to San Francisco. I had read the reviews that parking is very challenging and that we should get here early in the morning or late in the afternoon, however, that did not work with our schedule so we took our chances.\nThe other reviewers were right: parking was VERY challenging. All parking areas were full. We wasted a good half hour just driving, trying to find a spot, so keep that in mind.\n\nAfter we found a spot, we had quite a bit of walking to get to the entrance. We were able to get in with our \"America The Beautiful\" card, which was great.\n\nThere are various options to explore Muir Woods. The easy one would be to stay on the path that takes you all the way to Bridge #4. Round trip this is 2.0 miles.\n\nWe chose to do the Canopy View to Lost Creek to Fern Creek Loop Trail, which was 3.0 miles but included a lot of steps and a gradual incline. Shortly after entering Muir Woods, on your right, you will see the Canopy View Trailhead (steps). After about 1.3 miles you will take the Lost Trail, which ends at Fern Creek Trail. I found this trail to be a bit challenging on the way up.\n\nBeautiful views. The redwoods were impressive. Recommended when visiting San Francisco for more than 3 days.\nShow less"], ["Reviewed January 17, 2018", 5.0, "A Place All By Itself!", "One of the most beautiful places I have ever visited. Lush growth, green, green, green. High oxygen air content very refreshing. You should go!!"], ["Reviewed January 13, 2018", 5.0, "Beautiful walks", "I have been in this park several times - enjoy it every single time. There are several paths, some easy and some needs effort. The winter is the best time to do this park, because of the damp air. I was there once in the mid of summer - every step from you and people around you generates lots of dust. Parking is limited.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Beautiful!", "We had a wonderful trip to Muir Woods. It was a beautiful, easy walk and the trees were amazing. These would be my tips/thoughts if you are thinking of going....\n1. Arrive early, we arrived around 9:30am and had a wonderful visit that was not overcrowded. It was easy to take pictures and have some quiet moments in the woods. By the time we left around 11 it was becoming very crowded.\n2. If you are worried about the hike/walk being too hard for someone in your family I would say \"don't worry\". While there are some harder trails you can see some wonderful trees from the main trail which is mostly a walk on a well maintained boardwalk.\n3. If you are thinking of taking a tour bus to Muir Woods and have over 2 people in your party I would suggest looking into taking a private car service. We had 3 people in group and for only around $20 more than the tour was going to cost we took a private card from Five Emerald and it was wonderful. They picked us up right at our hotel door, took us to several awesome spots to take photos of the Golden Gate Bridge and was a wonderful guide. Plus, we got to move at our own pace instead of someone elses schedule.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Unbelievable", "what a wonderful site. so beautiful. The trip to was as much fun as Muir Woods. So well worth the trip."], ["Reviewed January 9, 2018", 5.0, "A walk in the Park", "Beautiful place for a walk. Many trails from very short and flat to long and hard. Can't go wrong! A unique experience."], ["Reviewed January 8, 2018", 5.0, "Beautiful natural keepsake", "I really enjoyed my time at MW for several reasons. 1-Being the fact that people are trying to preserve nature - by preventing erosion - loved that they built boardwalks to prevent all the foot traffic from eroding the root systems of these glorious trees! 2-I love that we have a place so full of nature and history, so close to an urban area that is used by so many people. We went on a damp day, less folks out, which was nice. It was nice to disconnect from technology for awhile-there is NO cell phone service there either! Which is also a plus! We did the loop that was a nice hour quick pace.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Family holiday", "We found out about muir woods from a random conversation with a man in a cafe and im so glad we did. Muir woods is just stunning. After a busy few days touring the city it was lovely to spend a few hours strolling through the woods which are just so peaceful. The trees are just breathtaking and the photos really dont do them justice. We were fortunate to see lots of the wildlife as we walked through the woods. For any nature lover this really is a must do but even if your not i would say its still worth a visit. For me it was lovely to escape the hustle bustle of the city and just have some quieter more relaxed time in beautiful surroundings. There is a small cafe and gift shop after your walk. Most of the woods are suitable for pushchairs and wheelchairs. Its an attraction that you need to see as photos really dont do it justice.\nShow less"], ["Reviewed January 6, 2018", 3.0, "Great Adventure Poor Service", "To enter the park you must pay $20 per person. However, the sign listing fees says \"Military Free\". This fee schedule is very misleading. I presented my Military ID, which is a military ID that states that I am a 100% P&T veteran. In most cases the cashier would either take my ID and give me the discount; or they say \"sorry the discount is for activity duty only, but thank you for your service.\" This is NOT the case at this facility. The cashier threw my ID back at me and said very hateful \" NO DISCOUNT! FOR ACTIVE DUTY ONLY\". The woods were very peaceful and beautiful. Parking is very difficult to find and you may need to park very far away and walk to get to the pay-station. Worth the trip, just wear your walking shoes.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Beautiful scenery!", "This place was amazing. Definitely worth the trip! It takes a long time to go thru the entire path (at least for someone like me), so be prepared for several hours and lots of steep inclines.\n\nThey aren’t kidding about having absolutely NO service out there. We scheduled a Lyft to pick us up between 4-4:10 and they never showed. Thank goodness for Tower Tours! They saved us from being stranded. I would definitely book with Tower Tours if I ever get a chance to visit Muir Woods again.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Wonderful remnant of a grand forest", "Only a short drive north of San Francisco is the tranquil Muir Woods National Monument forest.\nVisit early morning or late afternoon to possibly see some wildlife and quieter volume of population.\nWander up to the 4th bridge and up the hillside trail if you have the energy.\nA beautiful collection of amazing old Redwoods well worth a visit\nShow less"], ["Reviewed January 3, 2018", 5.0, "Worth a visit", "Beautifully serene and awe-inspiring place. There is a short walk option that is really easy for anyone. Parking can be tricky so get there early."], ["Reviewed January 3, 2018", 5.0, "Beautiful woods, nice walking trails", "We booked a tour bus to get there which was a good thing as parking seemed to be very challenging there. Walked through the park, even though it was crowded at the entrance and gift shop, it was quiet the further away you walked. I loved the peace and tranquility of being in the woods, with the gurgling stream close by, such a lovely place despite being only 30 mins from San Francisco.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Muir Woods National park", "Beautiful park, definitely worth visiting, but very touristy. Go early in the morning for best experience and also in order to find parking which can be a challenge."], ["Reviewed January 2, 2018", 5.0, "Peaceful place near SF", "If you are visiting SF and need a break from all crowded and noisy tourist attractions, visit this place which is about 30 minutes from city. I have visited this place both times I went to San Francisco. Parking can be a hassle so make sure you come early. Drive to and from Muir Woods is also beautiful. Personally, it was one of highlights of my trip.\n\nNote: They are implementing some changes to adjust for lot of traffic to this place so make sure to check their website before visiting.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Walk in the Woods", "What a beautiful walk but so close to the city. We spent an afternoon here and still did see enough. We have traveled to many places on the West Coast and this one of the best. Multiple trails for all abilities. Nature guides, a nice visitors center. Great to just relax and enjoy nature.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Beautiful place", "Lovely place...but just too many people. Overcrowded and Parking is a NIGHTMARE\nThankfully we decided to take the park and ride shuttle and had to shake our heads at some of the folks having to park more than a mile from the entrance along the narrow road....the shuttle is so much more convenient. No wait and you avoid the parking hassles....although our visit was in 2017 dec, seems like they are changing parking to a reservations system....much needed due to this place being overrun by tourists....the place is simply beautiful....ranger said get here early on a semi rainy day and you will have the place to yourself!!!\nShow less"], ["Reviewed December 29, 2017", 5.0, "Family Vaca", "Fantastic, gorgeous park and forest. Couple of things to note: signs in the park not well done. We were confused several times by the lack of signage. Not sure where we were a few times. At the same time it was adventurous to b \"lost\" in the park. Also, don't go the week between xmas and New Years unless you go first thing in the am. We ended up doing a six-seven mile hike. Totally memorable.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Beautiful Forrest", "Its really quite beautiful. We had not seen the Redwoods so it was great to finally get an opportunity to walk through a forest of them. Its a lovely and serene walk through these beautiful trees. We got there early as part of a tour that later took us to Napa and Sonoma so we had about an hour to spend there. We really enjoyed the trees and could go back again. Its hard to get pictures that give scale of how big these are but take a bunch of shots anyway.\n\nOne word of caution. You have no cell service there. My sister in law had just visited the week before we went and they took an uber from their hotel in San Francisco and had them drop she and her mother off. When they were done walk through they realized there are no taxis and there was no cell service. Her mo freaked out and they had visions of spending the night in the woods. LOL luckily the staff is well prepared for this and they were able to get a cab for them.\nShow less"], ["Reviewed December 28, 2017", 4.0, "Breathtakingly Serene", "What a gorgeous hidden treasure this place is. Wish I had more than an hour to visit this sanctuary. The freshness of the air was the first thing I noticed. The tall timber forest is just a peaceful environment. Only managed to do the Cathedral Grove trail in the hour we had, but there are plenty of trails you could explore.\nI don’t think this place is suitable for infants in strollers. The ground can be uneven, plus I think it would just congest the tracks as plenty of people venture into the numerous trails.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Breathtaking", "Get here early as parking lot fills quickly. Different trails for all skill levels. Wooden boardwalk great for strollers/wheelchairs. The trees are beautiful, no picture can do them justice. Very nice gift shops."], ["Reviewed December 25, 2017", 5.0, "Amazing!", "This place is fantastic! It has many different trails and natural areas. Our family took a trip there, we had 8 teenagers and 10 adults and needless to say that we found something interesting for every single one of the members of our group. We completed our trail in about 2 hrs. Unfortunately we went there the last day of our trip and we had to cut our visit short. We are already planning our next trip here. Plan for a full day or more.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Become one with nature!", "I really, really enjoyed my time at Muir Woods (National Monument) and so did all my friends who joined me for the trip. It's just a short drive from San Francisco over the Golden Gate Bridge and you're there. And once you're here you won't want to leave.\n\nIt seems that has National Parks started to become protected areas of America at the start of the previous century, John Muir was a conservationist that worked to protect the ancient Redwoods in California which had been logged repeatedly for decades and as a result this area was spared the fate of being chopped down like much of the rest of the area. It's a very unique climate in this national park and you really should bring a light jacket or coat. One that is water resistant too, just in case.\n\nMany of these trees are over 1000 years old and are often over 150 feet (50m) high. Pretty impressive, but it really doesn't grasp in your mind until you see them. Truly remarkable and life changing. You should definitely go to visit and take your time. Maybe even have a picnic. You'll feel close to nature and see what it needs to be protected.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Must go", "The Muir Woods state park is just a 20-30 min. drive from San Francisco and definitely worth to go. The mark is very nicely arranged with walking paths and hiking trials. We have chosen the 5 miles hiking trail and we all inclusive our teenager children liked it a a lit. And the redwood trees are really impressive.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Living History", "One of California’s treasures named after John Muir. Let nature fill your soul and your senses in this paradise on Earth. Many different levels of hiking, from pleasant stroll to rigorous hill climb."], ["Reviewed December 19, 2017", 5.0, "Another must see place in Northern California", "Muir Woods National Monument is heavily visited. Parking can be tough. The lots are often full and parking extends up and down the roadsides. Going during off peak hours would be best, as recommended by the park. The trails are awesome and there are a several easy trails and more advanced hiking opportunities.\n\nParts of the park are easily handicap accessible, and easy to traverse with strollers as well. I'd recommend spending at least a couple hours here, not including drive time or parking. The large redwood trees are awesome and there are plenty of photo opportunities. The park is well maintained, just busy. It's majestic and there are many peaceful spots even though there are plenty of people around. It's a must see spot.\nShow less"], ["Reviewed December 15, 2017", 5.0, "BUY THE $1 MAP", "Don't cheap out or believe the kid at the entrance who says 'here's your map' spend the extra $1 for the map - seriously!!! If you plan to go further than the 1 1/2 loop that never leaves the forest floor you NEED it, believe me it will prevent panicked 'we're lost' meltdowns later on. We did a 8 mile hike and I loved it, trails are perfectly marked but trail heads can be few and fair between so pay attention. Great pictures, beautiful day but dress in layers because you will flucuatate between sweating and chilled depending where you are. Needless to say hiking boots or athletic shoes are a must and go early to beat large groups that arrive and clog lower trail!\nShow less"], ["Reviewed December 13, 2017", 4.0, "Impressive", "Impressive redwood trees and good location to go for a nice nature walk not far from the City. A worthwhile visit if you want to escape the hustle and bustle of the city but didn't want to travel too far."], ["Reviewed December 12, 2017", 5.0, "Great Experience", "My partner and I recently visited San Francisco for four days. While there we drove to Muir Woods. We had a wonderful time. Recommend going early. . .as the park is free before 9am. Also, it is a better experience when fewer people are out walking the paths.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Exceptional, except for the squawking kids", "Trust me and the countless other reviewers on this point: get there early when the park opens and choose a weekday off season. You will have a few hours of near solitude to enjoy this treasure. If you ignore this advice, be prepared to deal with throngs of squawking and squealing children (Some of whom are adults) who do not know how to enjoy nature.\nShow less"], ["Reviewed December 9, 2017", 3.0, "Muir Woods plus Sonoma Winery Tour", "Extranomical Tours was who we did this full day trip with. Muir Woods definitely worth seeing but felt our time there was rushed. This largely owing to the tight timelines to make it to winery part of the tour. I personally would have preferred more time at Muir Woods then at the wineries, but that is me & more guests to satisfy than just me. But if you are visiting San Francisco then I would highly recommend Muir Woods with a bit more time than the 70 - 80 minutes we were. Amazing woodland with plenty of walking trails.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Must See", "Beautiful. This is a trip not to be missed. Short walk from the parking lot and you are surrounded by the red woods. The paths are well maintained providing access for everyone with a few benches along the way. The smell is incredible and when totally quiet there are no words to describe the environment. One hour is not enough to complete the circuit. Two hours would be better.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Majestic", "Truly a majestic place. Highly recommend this. Great for families. Eat before you go or bring a lunch as the food and drinks are extremely expensive."], ["Reviewed December 5, 2017", 5.0, "A walk in the woods!", "I was very impressed with Muir Woods! Of course the 200 ft + trees are impressive but the 2 mile walking path was great! The US park service did a great job here. It’s simple walk and pretty much all fitness levels can handle it. Wear comfortable shoes with some good traction since I think it’s always pretty much damp and somewhat muddy. Also, it’s definitely cooler in woods. Go and enjoy!\nShow less"], ["Reviewed December 5, 2017", 5.0, "A truly beautiful place", "You have to be here early! The parking lots fill up quickly. There are several trails to choose from a short leisurely walk to the longer and more strenuous.\nThe trees are absolutely stunning! You feel very small standing next to a towering redwood that has been growing for hundreds and hundreds of years. Walking through the forest you almost get a sort of \"Jurassic Park\" feeling - but without the T-rex;-)\nThis was my second visit and I know it will not be my last!\nShow less"], ["Reviewed December 4, 2017", 5.0, "Great Hike!!", "Superb breathtaking views during the hike. Makes you feel so close to nature and God. Will come and visit again for sure."], ["Reviewed December 3, 2017", 5.0, "Always fantastic", "It's so wonderful to have this area so close to a major city. It is a peaceful getaway from the chaos of San Francisco. Off you have the time, get off the main trail to the side trails - they are much quieter and less traveled. And the views of the redwoods are magnificent!\nShow less"], ["Reviewed December 2, 2017", 5.0, "Nive, very nice. Nature !!", "Impressive place to chose from several trails to go for a short, long stroll and be impressed by nature, trees surrounding you. Parking is available Make sure you wear comfortable clothes and shoes"], ["Reviewed November 30, 2017", 5.0, "Breathtaking and Beautiful", "This is the most peaceful and amazing natural wonder and you must see it. You can take a short hike or a much longer hike. There is a flat, less strenuous path that would not require climbing or you can climb high and see the trees from another perspective. The redwoods are so amazing. The park is kept up very nicely which is a good way to think about your entrance fee being used for a good cause. The road to travel up is very windy and narrow and the parking is somewhat limited but it is worth it. If you love the outdoors at all, you don't want to miss seeing this. There are restrooms available at two locations and a small shop that you can purchase memorabilia and a drink. You aren't allowed to take food and plastic drink bottles into the woods so plan accordingly. I wouldn't recommend this for small children. Some of the climb is steep and the paths are narrow. You could end up carrying a child on your bak.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Just Amazing!!", "Got there just after they opened and there was already a shortage of parking at the monument but we did get a spot. There was more parking but it was a bit of a walk. This was a simply awesome trip. We walked for about an hour and the quiet was spellbinding! I would recommend you go early before the crowds arrive. Spoke to one of the rangers who was very helpful taking a picture of myself and my wife. Apparently it is very busy in the summer and it looks like they will be limiting the number of people they allow each day in 2018. You will have to book ahead to be sure to get in. I almost forgot........ the trees are amazing!\nShow less"], ["Reviewed November 30, 2017", 4.0, "Worth a visit", "I was recommended to go here by a couple at a viewpoint overlooking the Golden Gate Bridge and I am really glad I made the detour back up to it. The ancient trees were something else and although I didn't do a guided tour, I still found it very interesting. Nice place to visit.\n\nThe service in the cafe was a bit slow even though there were only 4 people in the queue.\nShow less"], ["Reviewed November 28, 2017", 4.0, "Extraordinary giant redwoods in a pleasant park setting", "You feel very small beside these giant trees standing tall and wide. The park has a comfortable walkway passing through the Woods and over the stream."], ["Reviewed November 28, 2017", 2.0, "Expensive and tourist trap", "Parking sucks! Also while trying to find a spot the bus drivers for Muir Woods kept honking there horns to try and get through. Once we got in their food was a dip off, $4.95 for a pb&j. Really? $2.50 for bag of chips? Trees were really cool though, it's a shame they have to screw you for you to see nature.\nShow less"], ["Reviewed November 27, 2017", 5.0, "A Surreal walk in the forest", "a wonderful and an awe inspiring walk.The setting was more then described by past\nvisitors. Paths were well maintained ,making the walk an easy go. I stayed on the lower paths ,while my gal went up the more challenging routes.\nThere were are scars of past fires on many trees.Also many of the trees had gaping cavities either from fire or just a natural formation.that one could stand in.\nWe both enjoyed the walk and its views.\nJust be aware the cell phone signal is almost .non existent\nShow less"], ["Reviewed November 26, 2017", 5.0, "Amazing park", "If you like to spend time in nature - you must go there and spend there a lot of time walking and thinking. There are a lot of ways you can take- depends on you health. but you will like it for sure!"], ["Reviewed November 26, 2017", 5.0, "Natural wonder", "Parking is limited. $10 to park. Go early to get parking. We went on Black Friday. NO PARKING anywhere near the visiters center. We ended up parking on the road at the beginning of Suntrail/Dipsea trailhead. Nowhere near visitors center. We started there and worked our way toward the visitors center. Difficult trail. Not for the weak. Bring water and wear proper hiking shoes. About a 7 mile round trip. Not OH at trailhead. Restrooms at visitors center. Highly over crowded. I guess everyone decided to go there on Black Friday. LOL. Discounting the crowds that day, I loved the hike and count Muir woods as a must see\nShow less"], ["Reviewed November 24, 2017", 5.0, "An outstanding treasure", "Anyone who visits the San Francisco area must take the time out to visit the Muir Woods Park. The easiest way to do that is to take a tour as it includes the entry fee and gets you right up near the front. There are many numerous trails to explore and it is just an absolutely wonderful and beautiful place to spend some time.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Hidden gem!", "Although this park is very close to San Francisco, most tourists don't know about this place because of the remote location. You will need to rent a car or join a package tour. It's well worth the trouble. The park contains several easy trails within a lush forest. A few times a day, there is a 15 minute talk about the park given my the park rangers. If you happen to be there, it's worth listening to the talk.\nShow less"], ["Reviewed November 23, 2017", 5.0, "A wonderful walk in the woods", "My wife and I went on Thanksgiving. Heed the many warnings online about the crowds and parking. We arrived around 7:40a, and the primary lot was already almost full. The trails here are typically wonderfully kept NPS trails, allowing you to focus on the breathtaking experience of a walk through the naturalist mothership. We are so glad that we hiked the Canopy View trail, as it provided wonderful solitude and peace. Once it rejoined the boardwalk, the crowds were significant. Still, a visit here was well worth dealing with the crowds.\n\nA couple of notes:\n1. Dress in layers. It was cool in the morning, but it is also pretty humid in the woods. We found ourselves spending most of our hike in our base layer t-shirts. 2. Make sure you have water, and either a good trail map or a good offline GPS map app. A couple of junctions were a bit confusing, and our map app was invaluable.\n3. Enjoy but expect some intensely winding canyon roads. The Rockies have nothing on some of what we drove today.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Awesome day with nature", "Take a day out from the city to visit this awesome nature spot! The trees are huge!! Take a jacket, it is cool!"], ["Reviewed November 21, 2017", 5.0, "An Absolute MUST SEE!", "Just wow. So we took the ferry from San Francisco to Sausalito and then Uber'd up to the park which was about $24.00, to head back though we had 0 cell phone signal so we had to take a cab which was $36.00. Despite that it was still 100% worth it. It was crowded so when we go again I think we will try to get there 1st thing in the morning as to avoid the crowds. The main trails are VERY well maintained and easy for just about anyone to hike. The trees are AMAZING, and there are so many picturesque spots to stop at and take pictures that it could take you all day! Plan for at least 3 to 4 hours to truly experience Muir.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Majestic Trees", "We came by Grey Line tour as after researching we found parking here is almost impossible unless you get here before the park opens. Some people parked on the road and walked 3 miles to get to the entrance of the park! Although off season and late in the day the park was still very busy. Bring a warm jacket as even though it was over 70 degrees, in the woods is was very cold and damp. The are many different trails you can choose from depending on how far you want to walk. The trees were indescribably majestic, towering into the sky. No words to describe the beauty and splendour of the trees. There is a piece of a tree over 1000 years old!!! A must see when you visit San Francisco.\nShow less"], ["Reviewed November 18, 2017", 5.0, "My favorite place in California", "In spite of its popularity its always peaceful and enjoyable. Walking among the redwoods is magical. Well worth the drive from SF."], ["Reviewed November 18, 2017", 4.0, "Excursion to Muir Woods", "My wife and I recently visited Muir Woods with friends while in San Francisco on a cruise. We really enjoyed our visit. This national park is amazing. The giant redwoods were really impressive. Seeing these gigantic specimens that are hundreds of years old was awesome. We would recommend this excursion.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Wow!", "I have always wanted to see Redwood trees and they do not disappoint. The Cathedral is only a short walk but shows trees that reach over 20 stories into the sky. The width of these trees is enormous, and the silence of the woods offsets the chaos of the city. Wow, for a great time.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Awesome - must go if in Bay Area!", "Not far out of San Francisco - worth the trip. Only need to spend an hour or two there to experience the beauty of these awesome tall redwoods. We took an Uber there from our hotel and that was fine. But you better arrange a ride back in advance or maybe rent a car for the day! Phone service is bad there and if you can even get a Lyft or Uber you have to wait 30 min or more. We found out there was some kind of shuttle that picks up there and takes you into Sausalito or maybe Pochono - then once you’re back in “civilization” get an Uber from there!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Amazing", "Absolutely beautiful! The beauty of this place is amazing! Hike under a canopy of giant trees. Great place to take pictures."], ["Reviewed November 15, 2017", 4.0, "Easy and safe way to experience California redwoods", "We went on a weekday and arrived just after 9:00 am. The main visitor parking was full but just a little further up the road is another lot that had ample parking. There are many trails but the main trail has a wooden walkway that anybody can walk through. No inclines or rough terrain at all. The size of the redwoods is awe inspiring. If you want more adventure there are longer trails that go off the path. Some were closed off though. There is also a gift shop and cafe near the visitor center. We enjoyed it and would recommend it to anyone.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Really beautiful and peaceful", "Such a beautiful area to hike in. Many different trails of different lengths and abilities. We had a great day. Just arrive early. We hiked for about three hours. It is much more enjoyable when there are fewer people and easier to park. Tends to fill up by late morning. Do one of the longer trails early to really feel like you have the place to yourself. Wear good walking shoes!\nShow less"], ["Reviewed November 14, 2017", 4.0, "Plan to hike... to the car.", "I have traveled and camped all throughout northern California and yet this \"small\" parkland makes a welcome, enjoyable and easy side trip, especially when towing young children. The hike from the car to the park entrance can be extensive if you don't get there very early, before 8 or 9 am. Also, if anyone in your group gets car sick easily they should not go for the drive there is very, very winding.\nShow less"], ["Reviewed November 14, 2017", 5.0, "You Feel So Small!", "Our necks were soon hurting from gazing up at these towers of history! Our walk through the woods was very peaceful and inspiring. It's nice to know places like this still exist in their pristine state. Indeed, we found lots of majestic places among the redwoods that made terrific pictures and memories.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Beautiful walk", "The park is work the $10 to get inside and walk around. Part of the trial is very flat and easy for families or the elderly. If you want to spend more time you can easily go off on one of the side hikes and explore. I would recommend 1.5 -2 hours to do the basic loop.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Extremely Popular Experience", "We decided to go there on our way into San Fransisco as, because of the fires we had not been able to see the big trees elsewhere. Luckily we noticed a sign advising us to take the shuttle bus. It was worth it. We parked up and caught an air conditioned bus for the 30 minute trip up a narrow windy road. The traffic queue was very long and as we got closer to the wood cars were parked at the side of the road for a long distance as the small car park area was full. The woods were very peaceful and impressive. Because of the traffic we only had time to spend about an hour walking among the trees. We then had to join the queue to get back on the bus. It was lovely to be there but if you want to spend some time, go early.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Amazing Redwood Views", "We took Tower Tours excursion to Muir Woods. We boarded in the Fisherman's wharf area. The driver was fun to be with and explained a lot about San Francisco and the areas we traveled through on the way to Muir Woods.\nIt is an experience that you should not miss if traveling to the Bay area. The paths are easy with a few that are a bit more challenging for some. The redwoods themselves are majestic and towering. The forest is located only about 25-30 minutes north of the city and you can easily see most of it in 1 1/2 to 2 hours.\nThere are many places along the way for photo opportunities. If you look closely at some of the trees, some appear to have faces staring back at you.\nShow less"], ["Reviewed November 11, 2017", 5.0, "A must visit woods for nature lovers", "Less than 1 hour drive away from San Francisco city. As soon as you enter, its a different world altogether - pleasantly cool, taller than the tallest of tress ine has seen and a well maintained clean path. There are 4 levels which one must ensure one covers all 4. Depending upon time availability, all 4 levels can be done in approximately 1.5 hours. Each level leads to a different vista and a different experience albeit within the same area.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Ethereal in the early morning!", "Truly Majestic! The redwoods here are truly old and awe-inspiring. If you go early in the morning, you can take one of the longer trails without so many people, which takes you deeper into the forest. You might also find parking easier. Otherwise take the shuttles from near the 101 Freeway. Parking is also easier after 4PM, which is still great in the summer, but it gets dark early in the winter. Bring warm layers in the fall and winter, as it can be damp and cold here, even if it is not near San Francisco.\nNote: Please stay on the trails, even for photos. The roots of the trees are sensitive and can be damaged by people straying off the paths. We want to preserve this special place for future visitors to enjoy.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Amazing", "A truly beautiful place to visit. You can choose to walk the smooth flat path through the woods or opt to go off the beaten path. This option will be a bit more rigorous and slightly more narrow but definitely not stroller friendly.\nA must see.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Behold! The majestic Redwoods of the California Coast", "There is nothing like standing at the base of a 1500 year old Redwood tree soaring to the clouds, to make anyone feel tiny and insignificant in comparison. Take a deep breath and soak up the majesty of these Redwood giants. The beauty and magnificence is like no other when you consider the age of these Redwood skyscrapers. A must see on anyone's bucket list.\nShow less"], ["Reviewed November 9, 2017", 5.0, "The \"trails\" are accessible to everyone, offering unique access to a magnificent grove of redwoods!", "Wonderful exploration with our young 4-year-old guest and his family. The redwoods are magnificent, pulling us further and further along!"], ["Reviewed November 9, 2017", 5.0, "Muir Woods Magical", "That place is so beautiful and serene. Very clean and breathtaking. I didn't want to leave. The trees are awesome and it smells very clean."], ["Reviewed November 9, 2017", 5.0, "Tranquil", "Go there early to avoid the crowd. Took the public transport and trek down to Muir woods using the dipsea trail. Downslope all the way so it's pretty easy. Walking amongst the giants in the woods. Definitely an experience."], ["Reviewed November 8, 2017", 5.0, "Walk the loop", "Top nature attraction in the area. Get there by 8 A.M. and you have the whole woods to yourself. There is a lovely 1-2 mile loop that gives you the lower and upper view of the trees. Thank you, John Muir for saving this treasure for all to enjoy❣️\nShow less"], ["Reviewed November 8, 2017", 5.0, "A must.", "Awe inspiring. Any Bay Area visit should include this amazing place. The huge tress, quiet walkways, shifting shadows induce a sense of timeless peace."], ["Reviewed November 8, 2017", 5.0, "Big changes coming!", "We just visited Muir Woods for the umpteenth time and just love it. This time there was a sign there stating that next year you will need to make a reservation to get in! The national parks, monuments, etc. are so overcrowded that many places are talking about starting this. So beware and call ahead if you are planning a visit.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Great Treasure", "After passing over golden gate bridge in SFO one can go to Muir woods. Its beautiful road with many turns through jungle.\nWe walked down to gate and took ticket and broucher was given. Rangers were giving information, direction every where after entering the woods jungle.\nIt is said that the trees are as before as five hundred or more than years. It was quiet place and huge trees with scenic natural beauty. We had good trail walking there. This is national preserved monument. At many places it was so dense that in spite of day, daylight was not coming down.\nOne can reach very near to nature and can get calmness in mind.\nFor those who are doing research in biology this could be ideal place.\nThere are short informative programmes being conducted and one can attend the same.\nThere are hiking attractions.\nCafe, souvenir shop and rest room provision is there.\nAlthough lot of parking spaces were present all could be full and people are parking their cars on side of road.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Magnificent", "Highly recommend a trip to the Muir Woods - we spent half a day exploring the beautiful park/monument and we could definitely have spent longer.\n\nThe trees are just majestic, and awe-inspiring - never seen anything like it.\n\nUnder-rated and should be on everyone’s list of places to visit.\nShow less"], ["Reviewed November 6, 2017", 5.0, "If You Go Down in the Woods Today - You are in for a big surprise!", "I have always had a fascination for Giant Redwood trees. We were visiting San Francisco and I read about Muir Woods National Monument ( my husband was impressed with the fact that Return of the Jedi was filmed here). and made a point to visit with my husband and daughter. We were impressed with the well maintained walkways and easy to navigate paths (my husband walks with a cane and has limited mobility). The woods are amazing, with much to see and enjoy, from the natural vistas, the cool breezes and places to sit and ponder life, to the wildlife, coyote, squirrels, deer to the wonderful coffee and souvenier shop.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Inhale & Enjoy Beauty...", "Passing the turn-off turned provided breath-taking views of San Francisco Bay. On the way back down, I made the tricky turn to Muir Woods. Parking was tight but once tickets were paid, the trees, air and slow walk provided nirvana. Taking it slow is key, and absorbing the trees while frequent stopping, and using the benches makes for a great experience.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Walking among Giants", "Always wanted to see the majestic California Redwoods, so while on trip to Napa wine country took a little detour heading back to San Francisco and visited Muir Woods National Monument!\n\nWe arrived in late morning to find parking lot already full but found parking on road next to lot (leading to park exit). Tip: parking lot is small so arrive early if you don’t want to walk some distance.\n\nThe parking area, entrance, and main area around visitor center are mostly level, two main trails lead deeper into park, with the Hillside trail going all the way to back (Western) edge. The very nice Redwood Creek runs between the trails for much of the way, fairly wide in some parts but with modest water flow, and there are three crossing points (bridges), two of which are nearer to visitor center.\nTip: there are many nice photo opportunities in this area, wonderful lighting through trees, romantic couple shots in front of trees, water, or glades. Try to get shot with someone standing in front of tree for perspective (pull back to get more of tree in vertical frame) - it’s hard to appreciate real size of these coastal redwoods without a reference point!\n\nThe drive up to park is also pretty and worth a stop to catch the views. We took Franks Valley Road (Rt 1) on leaving which goes down to Muir Beach before swinging back up to meet Shoreline Highway then merging into Highway 101. This is the long way around, very scenic and pretty, but takes a bit longer – there are also several sections with no guard-rails that are close to steep drop-offs (a bit unnerving!).\nThis road has been damaged repeatedly by storms though (rain run-off erodes highway underlayment) so it could be closed. Worth the drive if open.\n\nWe didn’t have time to do a tour, but checking the options realized they’re probably a good deal, especially those combining two or more attractions.\n\nA must visit!\n\n[visited September 2014]\nShow less"], ["Reviewed November 2, 2017", 5.0, "Beautiful hike through Redwood forests close to downtown.", "This was 15 miles from Fishermans ward where we were staying and it felt like we were in another world. There is a $10 per adult charge to enter the area. There is a visitors center, gift shop and cafe. The hike was beautiful and easy to navigate on wooden walkways and paved trails. We enjoyed hearing the ranger talk as well.\nShow less"], ["Reviewed November 2, 2017", 5.0, "A walk in the woods", "While in San Francisco you have to visit Muir Woods. The last of the Giant Red Wood forests. There is a small entrance fee of $10 per person. Once in there are miles of walking trails through the majestic redwoods. These trees have been around for over 2000 yrs. and just being among them is surreal.\n\nThis is a must see.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Beautiful", "This was such a beautiful hike. Very peaceful and breathtaking. We got there really early- 7-8 am- which I recommend as it is not super busy yet. When we were leaving, the parking lot was filling up and the tour buses were arriving! Probably wouldn’t have liked it as much if it was really busy.\nShow less"], ["Reviewed November 1, 2017", 5.0, "We love Redwoods", "We wanted to walk among the Redwoods and we certainly did. When we arrived the trees did not look that big but once on the trail you really get the perspective. There are many trails which makes it exciting and a great afternoon hiking in the woods. There are lots of car parks which are free but are very busy. People were regularly coming and going so it was not long to wait. The Park Service charge $10 per adult to walk around the woods, children were free.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Muir Woods", "Our family had a half day lay over in San Francisco on the way back to Europe. We have taken a rental car and visited the Muir Woods in the early morning, when the park was still officially closed.\nIt was a nice opportunity to show the kids the redwoods located that close to San Francisco.\nThe park is quite small, however very cute and quite. I would definitely recommend visiting it...\nShow less"], ["Reviewed October 29, 2017", 5.0, "A Great Hike Amongst the Redwoods", "Whilst it was very foggy on the steep,switch backing road down, once in the woods, you feel so small amongst the huge redwoods and your camera doesn’t do it justice - a great hike and unforgettable experience.\n\nYou can take the valley floor trail to bridge 4 and then the hillside trail back which can be done comfortably in the 1.5 hours often allotted by the tour companies.\n\nDuring high season there is a shuttle bus from the Sausalito ferry terminal that takes you up otherwise it’s car or tour bus.\n\nCar parking is very limited so get there early! Also be aware that there is zero mobile reception and no WiFi at the woods so watch out if you plan to uber it!\nShow less"], ["Reviewed October 27, 2017", 5.0, "Go after 4pm - quieter and free admission", "If you visit after 4pm it's less crowded, there's more parking as the commercial vehicle places become available to all, and admission is free."], ["Reviewed October 26, 2017", 5.0, "Amazing and beautiful", "The Muir Woods is beyond words. You just can't describe the magnificence of the giant redwoods. Being in the midst of these trees that are not only beautiful but hundreds of years old is like being in the most peaceful place on earth. There is something serene that takes places and makes you just want to look up in awe without speaking. This is an attraction that you should not pass up.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Bask in the quietude!", "Hard to not imitate what most everyone else has said here, but another word about the quiet. We went on a weekday afternoon, and on the two mile (approx.) loop, found two spots where we just sat, and for several minutes (2 maybe?) did not hear a sound nor see anyone else in front or behind. Not a plane overhead. That awesome experience was magical. You don't need vast natural history background to know you're in a special place. The lower hike was level and smooth, and calming after the insane parking experience and crazy winding drive down the mountains! Obviously great photo ops, and on our trip we did not cross paths with too many yahoos, although we did witness some adults just drop their food wrapper trash on the trail.\nShow less"], ["Reviewed October 26, 2017", 5.0, "A must visit", "Muir woods are famous because of the giant redwood oak trees which is the main reason to visit,but its also nice to stroll around.\nHere are some tips and information=At the start there is a gift/cafe shop and toilets there is also parking which I think is free.Your not allowed to take any part of the woods away with you ,even a leaf.The trail pass's three bridges which you can cross.\nEven on a nice day the forest floor does't get a lot of sun so it can be a chilly ,unle4ss its really hot take a jacket,\nYou can spend the whole day there but check closing times .\nGetting there=If you drive its a steep twisting road,not sure if public transport is an option,Taxi might work out if there's enough of you to share the cost,but theres the problem of getting back.\nProb best option to to book a coach tour which will include the entry price and of course takes you back to your point of departure.\nGray line/Viator offer various packages ,this seemed best to us.\nHow ever you get there enjoy its worth the trip.\nShow less"], ["Reviewed October 26, 2017", 3.0, "BEWARE", "Visited Muir Woods on 10/20/17, it’s beautiful and worth the visit HOWEVER be sure to take ALL your valuables with you. There are signs posted regarding break ins and they happen EVERY single day. We were a victim. The comment I heard a park employee make was ‘well, we had our first break in of the day. ‘ And before we left the park another group of people from Europe had the same thing happen.\nDon’t think your immune! Go visit and enjoy the natural beauty but be smart. The thieves are watching!\nShow less"], ["Reviewed October 25, 2017", 5.0, "Amazing place!", "If you are in the San Francisco area, this is an activity you shouldn't miss. The beauty and majesty of Muir Woods is incredible. The walking paths are well maintained and you'll be up close to these magnificent trees. We thoroughly enjoyed our visit with the only negative being that our tour did not provide us with enough time...we would have needed several hours to really appreciate all this national moment has to offer. Just be prepared to be disappointed in your photos...it's hard for a camera to capture this amazing place!\nShow less"], ["Reviewed October 22, 2017", 5.0, "It's a must do!", "It's so beautiful and peaceful. We got there around 430 pm and it closes at 6 so we didn't have to pay the 10$ fee. The road down is kind is scary but also really cool! It's a lot of switch backs with no guard rail. The redwoods are amazing. So huge. We didn't get to go into the shop because it closed at 5... which to me should probably be open until the park closes. But that's just me. Highly Recommend and a must do in San Fran!\nShow less"], ["Reviewed October 22, 2017", 5.0, "Absolutely amazing", "Hiked through the woods and truly felt so tiny midst the woods. Easy hike all the way through and suitable for those in wheelchairs or strollers."], ["Reviewed October 19, 2017", 5.0, "National Treasure", "We drove to Muir Woods from San Francisco on a sunny warm Fall Monday afternoon. We missed the actual turn off into the Woods and had to back track due to confusing detour signage in the area. We parked in the second parking lot and walked about .5 miles to the entrance. The atmosphere was serene. The sunlight peeking in between the gigantic trees under the blue sky was breathtaking. The manicured boardwalk made for easy movement in the forest. Due to time constraints, we chose to walk the short route with a return to the canteen after the second Bridge crossing. The redwood trees are spectacular in size and appearance. Information is available along the way, as is ample bench seating to rest and meditate. We ended the visit with an artisan sandwich and water at the canteen. A gift shop and restrooms are available.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Friendly park", "Very friendly people walking, exploring, learning. We had a short visit here; the board walk makes it easy for people with disabilities to enjoy the giant trees. Nice benches are available for quiet contemplation."], ["Reviewed October 19, 2017", 5.0, "Like no other forest on earth", "Named after John Muir considered the \"patron saint of 20th century environment activism\" and Founder of The Sierra Club, Muir Woods is like no other forest on earth. The coastal redwoods, Sequoia Sempervirens, soar to over 250 feet, are the tallest living things on earth and Muir Woods is one of the last old growth stands of these magnificent trees.\nLocated less than fifteen miles north of San Francisco on the slopes of Marin County's Mt. Tamalpais, a visit to Muir Woods is a must for any visitor to the Bay Area.\nParking is limited so arrive early (park opens at 8:00 am) when the crowds are few and your walk through the cathedral of trees will be more peaceful. By 10:00 am the large tour buses start arriving and the babbling Redwood creek becomes inaudible. Pay the minimal admission cost, pick up your map of the park with the variety of trails marked and begin your journey of discovery. You can spend an hour or all day. Be prepared for fog and chill but if you're lucky and the sun breaks through,the shafts of diffuse light makes the forest more magical.\nUnder President Teddy Roosevelt the park became a National Monument in 1908 and the National Park Service maintains the area and offers talks and walks with Park Rangers. There is a gift shop and cafe on site.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Serene beautiful and awesome", "Serene place in the lap of nother nature... greenery's everywhere you see, buy ticket and walk and explore on different trails, restrooms cafe are there to relax. Kids too will love to walk and explore every nook and corner, you are left to admire and love everything you see..\nShow less"], ["Reviewed October 17, 2017", 5.0, "Don't miss these Giant Redwoods", "The parking is limited and we got lucky - arrived mid afternoon when there we no buses and found a pretty close space for parking. Admission only $10 if you do not own a pass. Just incredible to view these majestic redwoods and learn about the redwood forest history. Cathedral Grove is awe inspiring. Nature at it's finest. My nephew suggested I take a panoramic picture holding my camera sideways and it came out terrific. So enjoyed a leisurely stroll through the redwoods with my family.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Magnificent", "Took a Muir Wood bus tour on Gray Line. Wow! First stop at Vista Point after crossing Golden Gate...spectacular view. Then still not sure how the bus/driver/tour guide navigated the winding mountain road to the national park but he was a pro and obviously not his first rodeo. The redwood forest was magnificent and our leisurely stroll and picture taking on the trails was most enjoyable. I’m thinking if an avid hiker you would want to send more time exploring other trails but it was a perfect time for us seeing what we had never seen before.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Only visited because of Dylan's Tour", "We visited as part of a Dylan's City Tour and, after visiting Henry Cowell Redwoods State Park, we were a bit underwhelmed. The park was quite busy and the boardwalks are great for those who need it but we didn't care for them. I can see why this would be a nice retreat for those in the nearby big cities though. I wouldn't go out of your way to visit.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Don't miss Muir Woods", "We almost missed seeing the majestic redwoods due to the fires north of San Francisco. I'm glad we were able to make the trip. We headed up from Sausalito mid afternoon arriving at 4pm. Perfect for finding a parking spot and just enough time to make the one mile trail option before the park closed at 6. Make sure to read the information signs along the well maintained path. There are many trails accessible to wheelchairs and strollers. So there are no excuses to miss this beautiful park!\nPlease note that the drive from Sausalito has plenty of hairpin turns along the side of the mountain and challenges those with fear of heights!! But it was worth it!!\nShow less"], ["Reviewed October 14, 2017", 5.0, "Muir Woods Visit", "Road to the woods was very narrow and wound very sharply. There were detours en-route but they were well marked."], ["Reviewed October 14, 2017", 5.0, "Restful, peaceful and majestic", "Hard to believe this stand of towering redwoods is just minutes north of San Francisco. Just a short drive with lots of switchbacks and elevation changes leads to Muir Woods.\n\nExpect crowded parking lots and tour buses, especially on the weekends. But this national park doesn’t feel crowded. Some parking close up is reserved for handicapped.\n\nTrails are easy accessible with wood planks and asphalt. One trail involves lots of steps though. Meandering creek and huge trees. There is quaint gift shop and snack bar a short jaunt in from entrance.\n\nIf you crossed the Golden Gate Bridge this would be a pleasurable trip addition. Nice change from the hustle of San Francisco proper.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Really cool and family friendly", "Took our 6 & 8 year olds here to check out the redwoods. This place was beautiful. The main trail is a long loop that can be shortened, but allows you to hike at a lower level for one part and up higher for the other part - which allowed for cool different perspectives. It was $10 each for adults and free for kids.\nShow less"], ["Reviewed October 13, 2017", 5.0, "A Must Do while in the San Francisco Area", "We visited the Muir Woods National Monument on Sunday, 9/1017. As we approached, there were several signs warning to use the satellite lots and shuttle bus as the main lot was full. However, when we arrived at the main entrance at about 4:30 pm there were many open parking spots. From mid-March through mid-Sept. the park is open till 8 pm. Our Nat’l Park Senior’s Pass got us in without fees. While there are many trails in the park, see website, must folks find it sufficient to just walk down the length of the main valley and back. Depending on which bridge you use to cross over the small stream to return it’s either a total walk of 0.5 or 1 mile along a wheel chair accessible flat path. Street shoes would work fine. It’s fascinating to see the ancient giant red woods and even touch the bark on some of the fallen trees near the path. In the late afternoon the crowds were gone and we took our time soaking up the beauty and serenity of these woods. There is a nice gift shop, café and welcome restrooms near the start of the trail.\nDid this review earn a “Thankful” vote?\nShow less"], ["Reviewed October 13, 2017", 5.0, "Cathedral of trees!", "We hiked several of the trails in Muir Woods and would have loved to stay for the entire day. Beautiful setting with a feeling of a cathedral. You have to pay homage to the beauty of nature that is Muir Woods. If I had one day in San Francisco, I would take the ride out to Muir Woods again.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Incredible visit", "We took a guided tour from San Francisco to Muir Woods. It was more enjoyable doing it this way. Ann and Michael were our guides and they kept us entertained throughout the tour.\nThe woods are incredible. My wife and I have some mobility issues. The trail was easy to walk to see this wonderful forest.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Fantastic Hike Through the redwoods!", "My family and I started at the visitors center, walked through the well-groomed \"Cathedral\" area. The size and age of the trees are simply awe-inspiring. We then hiked several of the 1 to 2 mile trails in and around the area. The trails range from super-easy to moderate. Trails are well-marked in most places and maps are available. In all, we hikes about 12 mi and about 130 floors of elevation (according to fitbit GPS). We saw deer, squirrels, chipmunk, turkey, and a variety of birds. Truly an amazing experience walking through both old and new growth.\n\nAs many others have said.. parking is a nightmare unless you arrive early. We arrived at 7:15am on a Sunday morning and parked right at the visitor center. When we left around 1pm, people were parked (often illegally, getting ticketed/towed) over a mile away. We considered taking the shuttle that is offered, but were concerned about the quality/timeliness and other issues that tend to affect public transit. After seeing the shuttles, we would have taken them for sure rather than try to park.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Beautiful walk in the woods!", "Muir woods is a beautiful and magical walk through the woods. It was raining, but it was still amazing and less crowded then if the weather would have been nicer. Cannot recommend taking the time to see this magnificent forest and the amazing trees!"], ["Reviewed October 11, 2017", 4.0, "Muir Woods", "beautiful park near San Francisco - very nice walkway and good views of trees, however better parks with more large trees can be found further north on Hwy 101."], ["Reviewed October 10, 2017", 4.0, "Get lost among the giant trees", "It wasn’t much of a trek considering that there were wooden platforms as path. It was an awesome feeling to be among giant trees, green moss, clear flowing stream of water and breathing fresh air everywhere. The only downside I guess was the limited availability of toilets in the area. We had to queue to whatever is available.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Must See National Park", "I am thankful to Mr. Muir for establishing this amazing national monument - these parks are part of what makes the US a great place to call home. There is so much beauty to be found in the trees and nature here, and the park has done a good job of establishing a good variety of paths of different levels. If you seek more solace, it's a fairly short hike to get high enough into the park to the point where you will feel like you are the only one on the trail. But even the paths on the ground level are nice and well-kept, and I couldn't help but feel peace when I visited.\nShow less"], ["Reviewed October 9, 2017", 5.0, "amazing redwood trees, nice walk", "just a short ride north of SFO, beautiful redwood trees, nice walk, you can choose the short walk which is about 30 minutes or the long one but do take one of them you will enjoy every minute. notice that some GPS systems are not working in the area so make sure you know where you're going.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Great short hike with stroller", "First of all, there is a limited amount of parking spots. A lot of people end up parking along the road and walk up to 1/2 miles to the main entrance. Get there early and avoid free entrance days.\n\nIt is a really nice \"hike\" especially for family with toddlers needing stroller. The flat looped boardwalk is about 1 1/2 hour leisure walk. It's not too difficult pushing a stroller around (big wheel one is more recommended). We spotted a few small animals, but it's mostly just nice and quiet. Don't miss it!\nShow less"], ["Reviewed October 8, 2017", 4.0, "Beautiful encounter with the nature", "If you love nature, then this is a must visit place..It's got plat paved paths that makes walking convenient. You may not enjoy if you're a hardcore hiker..as i found the pathways to be simple and not adventurous..the place can get bit crowded especially if it's a weekend..You get to see some magnificent redwood trees..Keep this as . morning activity and add a tour to Sausalito village as this activity should not take more than 3 - 4 hours..the drive to Muir woods is also amazing with some awesome views of the valley..if you're self driving, then you have to be extra cautious as some of the bends can be blind and dangerous..there's a nice coffee shop, so you can relax a bit too..\nShow less"], ["Reviewed October 8, 2017", 5.0, "Simply awe-inspiring", "My wife accompanied me on a recent business trip to San Francisco, and we came a few days early for some R&R. Coming from New England we love the mountains and woods, and we really wanted to see the redwoods. We stayed in Sausalito one night and drove to Muir Woods the next morning, about 15-20 minutes away.\n\nThe drive into Muir Woods can be a bit harrowing for the faint of heart, with a fairly steep drive up the mountains on narrow switchback roads, and even steeper and narrower switchbacks down into the canyon where the Woods are located. But if you take it slow it's actually quite an adventure! Trust me - the payoff is worth it!\n\nThe walking trails through the woods are flat, typically on boardwalks or paved surfaces. You can choose several different trail distances, from a 0.5 mile loop to a 3+ mile loop. But the beauty is so overwhelming that you don't even notice the distance! The National Park Service has done a wonderful job preserving this beautiful resource.\n\nThere is a $10 per person entrance fee. (Parking is free). There is a gift shop at the entrance with food and rest rooms. But plan on getting there early - before 10 am on weekdays and no later than 9 on weekends. Parking fills up quickly and you could end up parking a mile down the road. We arrived just around 10 on a Thursday morning and we found a spot right at the main entrance. By the time we left 2 hours later people were parking half a mile away!\nShow less"], ["Reviewed October 8, 2017", 5.0, "Amazing walk in the woods", "Make sure to bring a camera, it is so beautiful you will want to take tons of pictures. My twelve year old even enjoyed it, high praise! Bring water. Hard to park. Get there early and remember to bring layers, it's difficult to tell if it will be cold and foggy or sunny til you are there.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Breathtaking", "We booked a tour of Alcatraz, Muir Woods Forest and Sausalito. Little did we know that Muir Woods would be the highlight of the day for us. Parking is definitely a concern at the forest however arriving by tour bus took that issue away. Once inside the park you are overcome by the beauty and serenity of your surroundings. The redwoods are spectacular and you get to enjoy them while walking along a walking trail. We've already added Muir Woods to our must do list on our return to California.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Wow! What a place!", "Visited this on free time with my colleague.\nBeautiful place but one need to drive very carefully to the place. Once there, first thing you need to worry about is finding parking but you need to keep trying and it won’t take long.\n\nOnce inside, it is an awesome place! So quite, so refreshing and so clean. Many hiking trail options available but the top ones that offer the best ocean view are tiring and demand good physical fitness.\n\nStrongly recommend to be in proper outfit, especially shoes. Carry a water bottle as you shall need it.\n\nPlace worth visiting and a must when in San Francisco.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Majestic Redwoods but crowded", "Beautiful park with a flat, paved path through the redwoods - easy walking. There is a nice gift shop and cafe. It was crowded, even in off season, and parking was limited. The road to the park is winding and somewhat narrow. There were a few other trails off the main trail but we did not do any additional hking.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Interesting", "If you want to see big trees, this is the place to go. Make sure you visit by mid-morning, otherwise you may have a problem finding parking. The trails are paved and easy to walk. Seniors pay less, mention it at the ticket office if you qualify.\nShow less"], ["Reviewed October 7, 2017", 4.0, "Redwoods!", "This park is really a gem, just outside SF. If you aren't going further up to the redwood coast this is the best way to see these amazing trees.\nThe 15 minute ranger talk was super good.\nParking fills very fast so get there early or take the shuttle. You can do the main area of the park in an hour or so or you can explore the further trails for much longer.\n\nShow less"], ["Reviewed October 7, 2017", 5.0, "Beautiful", "The woods are wondrous and incredible. There are three main routes offering walks of 60/90/120 minutes (although these are more than adequate) respectively depending on how far you wish to go. There are also longer routes that extend fully into the forest but these take an additional few hours.\nThe park can be busy so I would recommend doing the trials backwards and going up the hill first to avoid the masses.\nIf you don't have a car or a tour then you can get the Route 66F bus from Sausalito. Note however that on the weekdays the bus runs every hour and can be busy. You would need to queue ahead of time to ensure fitting on the bus otherwise you will need to wait an additional hour for the next bus.\n\nWell worth a visit.\nShow less"], ["Reviewed October 6, 2017", 4.0, "GO EARLY!", "If you show up at 10AM with a dozen tour buses you will probably still have a good time. BUT, if you want to really enjoy this treasure you'll show up when they open at 8 AM. The hikes are lovely and the solitude will make it so much more enjoyable. (I'm not a super green person or an echo terrorist, but seriously, take my word for it. It's a much better experience.) We left just as the hoards were upon us and were SO glad we had the place to ourselves!\nShow less"], ["Reviewed October 6, 2017", 5.0, "Beautiful but crowded", "This National Monument is gorgeous and the surrounding areas are just as beautiful. Our tour guide told us these trees are the tallest ones but not the widest ones (those are in Yosemite).\nI learned a lot about the trees and the history of this forest and how it came to be preserved. It is definitely worth seeing and preserving.\nI went on a weekday afternoon and it was quite crowded, so I can't imagine what a weekend is like. I do feel this forest needs a cap on how many visitors it allows daily; there are many signs asking for quiet as people wander through the forest, but it wasn't as quiet as I would have liked because there were too many people and some children were being very loud.\nOur tour guide dropped us off at the top and we walked down into the woods; the trail was not hard/strenuous going down and the view at the top is phenomenal...although I can imagine walking up would be quite difficult. I would visit again and try to get there before it gets too crowded which can ruin the experience.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Absolutely beautiful", "If you are in San Francisco you have to come here. The trees are amazing and beautiful. There is a great \"boardwalk\" path do it is easy walking and handicap and stroller friendly. There are so many beautiful trees and it is very tranquil and peaceful.\nShow less"], ["Reviewed October 5, 2017", 4.0, "Amazing trees and trails, less amazing crowds", "The trees are seriously impressive, and you can get a very good impression from the scenic main trail. Also enjoyed an informative talk from one of the rangers. Arrive as early as you can, because the parking facilities are ludicrously small and it is very popular. We felt the $10 admission fee per person is a little on the steep side - granted, the trees are great, but as Brit + Italian maybe we are used to national parks and similar (Dolomites, Lake District, forests etc) being basically free. This said, note that it is included on the America the Beautiful national pass - if you're going to visit other national parks (Grand Canyon, Yosemite etc.), have a look at this!\nShow less"], ["Reviewed October 5, 2017", 5.0, "A Monumental Monument", "The T Shirt I purchased in the gift shop says on the front of it, \"Muir Woods National Monument\". And man 'o man, is it ever a monument. Muir Woods is one of the most special places I have ever had the opportunity to see and \"feel\". Because once you enter the park you get a a reverential feeling walking along the trail and seeing the magnificence of what is around you. It truly is a religious experience. It is absolutely beautiful, peaceful, quiet, and a place to sit and think of the grandeur of Mother Earth.\nA couple of tips about traveling there. Very curvy road down to the park. I would recommend taking a shuttle or bus to the park because parking also is a premium. It is free, but limited spaces. If you get there in the middle of the day you might end up way down the road about another mile from the entrance. And it is just pulling off the road to park. Then you walk back. Not an optimum situation. If you drive, go early or late to get close to the entrance.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Very Calming!", "Had to visit Muir Woods on this trip. Was better than we expected. An enjoyable stroll on winding trails through tall trees and interesting displays. Very informative on how the trees feed off each other and how even when they fall, they are left for the other trees to survive. The gift shop had lots of good souvenirs. This made for a very calm walking experience.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Gorgeous!", "Gorgeous hike! The signs said the parking lots were full but there were spaces. Just drive in and check before you leave. There are two gift shops ..one at the entrance and a second one about 100 yards into the park at the cafe. Both gift shops have different things! The ranger talks are very worthwhile, as is going off into some of the other trails besides the main one!\nShow less"], ["Reviewed October 5, 2017", 5.0, "A memorable walk in un-matched Woods", "Visited Muir Woods when in San Francisco. The Redwoods and setting are worth the $10 admission fee, per person. The trees are truly something to marvel at. DON'T FORGET THAT THERE'S NO CELL SERVICE AT THE MONUMENT - meaning if you Uber in (like we did), you need to call a cab from the visitor center to get out. The cabbies know this and there was one waiting about closing time (7pm), to take us back to Sausalito. It should be about $40 back to Sausalito by cab, and $25 by Uber. Don't let them take advantage of you! Muir Woods: take the time if you can.\nShow less"], ["Reviewed October 4, 2017", 5.0, "really enjoyed our visit here", "We were on a day tour of the city with a local company which includes a visit to Muir Woods for an extra charge. So glad we paid the extra bit of money. The tour of the city was great, took us to loads of different good spots and got some great pictures but we were also taken to Muir Woods for about 2 hours or so to just have a stroll and chill a bit. Luckily for us that day, it wasn't too busy. Considering we had just arrived in San Francisco after spending the last 10 nights in Vegas, to be on a relaxing walk in the woods was lovely !\n\nThroughly enjoyed our trip here, would do it again when in SF and recommend a visit here to other people.\nShow less"], ["Reviewed October 4, 2017", 5.0, "A park dedicated to giants", "This is a park dedicated to redwood tree, well maintained and properly laid trail. We took the usual and the shorter trail. Parking outside can be tricky during weekends, I would suggest to reach as early as possible to get parking closer to the entrance."], ["Reviewed October 4, 2017", 5.0, "Beautiful", "Absolutely beautiful area. Please take your time and enjoy the trees! Not quite what I was expecting but still very much worth your time to drive there. The website on some sites said not to drive. However that is exactly what we did and it worked out great. We were able to park fairly close - for free! In a parking lot. Short walk to the park. Go early as we did . Got there about 1100h . Still lots of parking left however during a Monday. It would be a different story on a weekend.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Easy stroll in a giants wonderland", "A boardwalk trail takes you into the woods, besides a small brook and over bridges. A beautiful sequoia grove, serene and majestic."], ["Reviewed October 3, 2017", 5.0, "Time for yourself", "I drove up from San Franc near Union Square up to Muir Woods, took me about a good half hour easy ride. I’m not local in San Franc but for the times I’ve been there it’s always good to go out in the morning although it may be slight gloomy but afterwards it’ll be bright and clear! Muir Woods had so much souvenir to be bought, but the best enjoyment I had was just to sit around the trees and just admire the serenity especially near the chapel grove area. Would certainly go even earlier next time to beat the crowd and noise :)\nShow less"], ["Reviewed October 3, 2017", 4.0, "Beautiful and well maintainade place", "Very tall trees in a national park with a very well constructed path. Peaceful and agreeable place to walk and watch nature."], ["Reviewed October 3, 2017", 5.0, "of trees and trails", "Love the muir woods...there are several trail options with spectacular trees all around. Do read and follow the notices and instructions posted along the trails. The souvenir shop also offers well thought off souvenir options including some redwoods to plant. This is also a good area to introduce kids the value and the humble magnificence of trees/forests.\n\nHug a tree for positive energy. :)\nShow less"], ["Reviewed October 3, 2017", 5.0, "Breathtaking, Awesome, Not to be Missed", "Wow! An incredible experience that will take your breath away. To be surrounded by the giant sequoias and their majesty makes one understand just how small we are. A walk through these woods is like a religious experience. Definitely worth a visit."], ["Reviewed October 2, 2017", 5.0, "Natural wonder!", "Arrived early and enjoyed free admission as the park opens at 8 but the visitors center doesn't open until 9! I highly recommend going early - minimal visitors and the sunlight streaming through the trees make for a gorgeous morning walk!"], ["Reviewed October 2, 2017", 5.0, "When you need time away from the city...", "I LOVE Muir Woods! My friends and I wanted a staycation over the weekend, but didn't want to stay in SF/the city. We had dinner in SF then drove about 45 minutes to San Rafael for our hotel stay. We planned to go to Muir Woods on Saturday (it happened to be one of about 4-5 annual national park days so it was free). Weekends and holiday shuttle parking is great at the Pohono stop. Got there at 9am and caught the first shuttle up. 25 minute ride up ($5 roundtrip). If you drive up and attempt to park in their small lot, you should arrive before 7:30AM to be safe....otherwise you're walking a few miles up to the entrance (leave that energy for the miles of walking in the park).\n\nI had planned a consolidation of a few trails (canopy, sun, dipsea, bohemian trail) to get beach views, park view, and redwood trees, but there were a few trail closures due to yellowjackets and construction. Did not matter. We went for a hike and that's what we did. The main trail has a boardwalk/paved so it's flat and easy for those only wanting to go about a mile or so in. It's great for families with small kids. Once you go off the boardwalk to the trails you lose the large crowds. This time around, we did the main trail to hillside loop (2 mi, easy) and Fern Creek to Camp Alice loop (3 mi, moderate).\n\n-Main trail to Hillside Loop- super easy and you get to see all the beauty of the redwoods (and cathedral grove). You'll have people traffic on the main trail, but worth going to the end to loop back on hillside. It's an elevated way back toward the entrance so you're able to get the view of the below boardwalk. From end bridge 4 you're making a left to the Hillside trail, if you pass it you'll be going onto the Ben Johnson trail which leads to a couple of other trails I want to try the next time I'm there (they are a bit more strenuous). As we were passing a couple on their way back from the Ben Johnson trail they told us they just finished \"cardiac hill,\" which leads to runner trails.\n\nIt was such a quick hike that we wanted to do another one. Dipsea would have been nice, but it has an estimated 3 hr time so we did the Fern Creek one instead for 2 hrs.\n\n-Fern Creek to Camp Alice, slow incline so you're not in pain from a direct incline. We had only 2 or 3 other people pass us the whole trail so I was glad we chose a less busy trail. You get to walk along a creek, cross some bridges, get up and close to huge fallen tree trunks (and crawl under one to get through the pathway). Definitely liked this one better than the Hillside.\n\nGot to parking lot at 845am, shuttle promptly arrives and leaves at 9am (i think it runs every 25 min). After arriving, paying for the shuttle ticket at the visitor center, stopping for the restrooms at the entrance (there are none within the few miles passed this point), we began our hike at 9:45am and left for the shuttle at 1pm. There's a small cafe shop where the gift shop/restrooms are so after we were done with the hike, a snack was nice.\n\nI could have done another trail, but my friends were done. So, I'd say 2.5-3 hours is a good time frame if you're planning an itinerary. Mill Valley has their farmer's market on Saturdays and San Rafael's is on Sundays (it's BIG). Just in case you're looking to do other things.\n\nA couple of things-\n-It's redwood wood forest, you're going to be in the shade the whole time if you're only planning to stay along the main trail. IT WILL BE CHILLY.\n- A few trails have poison oak\n- Please don't let your little children run ahead of you on the elevated trails (we saw a kid almost run off the trail when his parents weren't quick enough to turn a corner for him)\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beautiful Muir Woods", "A must do when in San Francisco. Take a bus tour across the Golden Gate Bridge to Muir Woods National Monument. This is about 12 miles north of San Francisco.\nAwesome visit. Tranquil walk through those incredible old giant redwood trees. Easy hiking trails - boardwalk platforms. We really enjoyed our visit\nShow less"], ["Reviewed October 2, 2017", 5.0, "Must-See Destination Close to San Francisco!", "We had such a great time visiting the Muir Woods. As many reviewers have mentioned, you should aim to arrive before 9 AM as there is limited parking and it gets VERY busy around mid-morning. Plus, we were allowed to enter the park for free before 9 AM! The entire monument is accessible (wheelchair friendly) but you do have the option to wander off the boardwalk and hike in the nearby state park - which I would definitely recommend. Make sure to dress in layers - it's chilly in the shade but once you start hiking, you warm up very quickly!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Stunning", "Muir Woods is always a surreal experience as you wander through trails of the national park and take in all of the natural beauty. There is a park entrance fee of $10 and limited parking, shuttles are available if you are visiting in peak season. You can walk some the short paths in under an hour if you are in a hurry, but make the time to simply enjoy the woods.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Majestic Redwoods in a wonderful surrouding", "Great morning spent at Muir Woods National Monument. Staying in SF, quick morning drive out of the city, across the Golden Gate to Mill Valley. Went early to insure we could park; that was key. Parking is very minimal. Arrived at 8am on a Friday morning. Took the self-guided walk to the 2nd bridge, enjoyed some truly great works of nature. The redwoods are beautiful and amazing. The pathways are marked well with several informational stops along the way. The walks are very easy. We finished a leisurely stroll in about two hours, had some coffee and walked back through crowds pouring in and lines of parked cars that snaked down the road several miles. So early arrival is key! Highly recommended.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Must see", "We took a bus tour here. Definitely the way to go as the parking is not good and the lots fill up quickly and you may need to walk a mile or more to get to the entrance. As soon as you get out of the vehicle you will be amazed by the evergreen smell. This is one of the most beautiful places I have ever seen. It is so serene and peaceful. Take a tour that offers a minimum of 1 1/2 hours here to enjoy it. There is a nice gift shop also.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Nice trees, go early!", "Muir Woods is a nice place to see the coastal redwoods. We followed the advice of previous posters and went early - we arrived around 7:45am. The parking lot is pretty small, but that early we found a spot with no issues. We walked in without paying, because they don't official open until 8am (we did leave a donation upon leaving). This early in the morning it was so quiet and peaceful, with relatively few people. We walked the ground level loop out and took the hillside trail back - very easy walking paths. We spent about an hour here, which was enough for a couple without children to see our fill. Just be aware that mornings can be pretty chilly because everything is in the shade, so bring warmer clothes!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Redwoods close to San Fran", "We did not get to the redwoods in yosemite during our visit so when we got to san fran we were so excited that this was close enough to visit. 10/10! Loved this quiet relaxing walk."], ["Reviewed September 30, 2017", 5.0, "Really interesting", "On the way out of San Francisco we stopped in to Muir Woods. Was really interesting, and you can spend as little or as much time as you want there as there are different length walking trails. However long you spend you will get to see some of the amazing trees they have. We managed to catch one of the talks a ranger was giving which explained the history of how Muir Woods came to be.\n\nEntry is $10 each, parking is free but a bit of a pain when it's busy and you might have to walk far. There's also a cafe there and a nice little gift shop. Well worth a visit in my opinion.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Simply gorgeous!", "We visited Muir Woods in the late afternoon, as recommended by everything we read. We had no trouble finding a close parking spot, and we had plenty of time to walk the trails before sunset. Simply put, Muir Woods is incredibly beautiful, calm, quiet, and serene. Do yourself a favor and visit this gem, but go early or late for the best experience!\nShow less"], ["Reviewed September 30, 2017", 5.0, "SF HIGHLIGHT", "lots of really great trails. Lots of shade. A little pricey in that you pay be the person. Hard to find weekend parking. But worth it b"], ["Reviewed September 29, 2017", 5.0, "Almost Religious Experience", "How can you not walk among these ancient giants and not feel moved? The trees are upwards of 250 feet tall. Some of the redwoods are between 500 and 800 years old. You just feel blessed to be in this quiet special place. I really appreciated the serenity. I only had two hours to spend here but I could have easily spent 4 hours walking the trails and photographing the scenery.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Between gyants", "Amazing. You feel really small and some of the trees are huge! You have to stay on the trail and you are not allowed to get too close to the trees, but in some spots they left it open to the public: no worries! You will be able to take great shots with these giants!\nAn hour is more than enough to see the park but, if you like hiking, you can plan more time there because there are longer trails you can walk.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Incredible forest !", "Stroll or trail into Muir woods is ever charming, never mind the teeming fellow visitors to the forest. This place is magical ! I walked for about 3 hours with the woods. The calmness around , all along is a powerful experience for the mind ! The only downside is parking, it took so much time to locate one and then it was such a long walk to the entance. Yet, I will be back again here soon !!\nShow less"], ["Reviewed September 27, 2017", 5.0, "Unbelievable experience", "Accessible by wheelchair and the most wonderful evergreen fragrance on nature trails Nice gift shop. not so nice bathrooms."], ["Reviewed September 26, 2017", 4.0, "beautiful", "great place to go and visit for a short walk or if you want to trek for a few hours.\nthere seems to be a shortage of parking so probably worth taking the shuttle buses from sausalito - cost of a one way is £5\nwould recommend going early can planning ahead\nShow less"], ["Reviewed September 26, 2017", 5.0, "Beautiful woods", "Took one of the large coach bus tours here recently. Big buses, winding roads, stop-go-stop-go traffic not always desirable, but at least you don't have to worry about parking, as the lot is small.\nAbout the Woods, NOTE! If the Bay area is foggy, it will appear as rainy in the Woods. Take umbrella and jacket!\nOtherwise, this is a beautiful, peaceful easy stroll in the Redwood grove. The trees are big, but not Sequoia big.\nSchool group leaders: please keep your students noise level contolled. This area is meant for quiet observation.\nThe boardwalk is easily maneuvered. Less than an hour to stroll it and buy gifts. There are steeper trails I did not take.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Great half day trip", "I went on an excursion via Viator.Com in September to Muir Woods. We were given 2 hours to tour the park. It was definitely sufficient time to see the beautiful Redwoods of Muir Woods. Please note that temperatures can vary depending on season. Down in the city it was hot, however, we went during a morning tour, it was chilly, and foggy, so definitely dress appropriately on the day you do go. Also included in this tour was Sausilto where we ate lunch, shopped and took an uber back to our hotel. Definitely a great place to check out if you enjoy the outdoors and hiking!\nShow less"], ["Reviewed September 26, 2017", 5.0, "Beautiful and Peaceful", "This is a beautiful and peaceful place to visit. I love that they ask you to silence your phones and if you speak to speak quietly. The trees are amazing. Thoroughly enjoyed my time walking all around the Muir Woods."]]}}