{"Musee Mecanique": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Musee Mecanique", "url": "/Attraction_Review-g60713-d104542-Reviews-Musee_Mecanique-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/7b/74/d7/rows-of-game-machines.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2403"}, "address": {"@type": "PostalAddress", "streetAddress": "Pier 45, Fishermen's Wharf foot of Taylor Street", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94133", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Fun and quirky", "Full of family fun for all ages, it's like stepping in a time machine. Inexpensive, genuine fun! Would highly recommend. It's full of old arcade games that cost $0.10, honestly a must see."], ["Reviewed 1 week ago", 5.0, "Quirky step back in time on the Wharf", "Do yourself a favor and take a few quarters to the Musee Mecanique on the wharf. It is full of old time vending machines, games, fortune-tellers, and more. It's a fun walk back in time."], ["Reviewed 1 week ago", 5.0, "A Journey Back in Time", "Close your mind to the hustle and bustle of the outside world and imagine yourself encased in a time capsule of simple pleasures. Stay a while. Watch the old time movies and peep shows on the Mutoscopes. Pause and marvel at the miniature towns and communities. And take plenty of quarters so you don't miss a thing.\nShow less"], ["Reviewed 1 week ago", 4.0, "A charming trip down Memory Lane", "This museum of working old-timey games and entertaining pieces that move mechanically is great fun for both kids, many of whom have never seen anything like this, and adults who may remember similar things from their childhood if they are old enough. It's the largest collection (that I know of) of mechanical toys and is great fun to wander through and spend quarters to see them in action and imagine what things were like back then. My grandchildren were fascinated, which I wasn't expecting!\nShow less"], ["Reviewed 1 week ago", 5.0, "Step back in time...", "This place is very cool, quite eerie, but very cool! Get a load of quarters and squander them on these antiques, there is such a vast range of different machines, it's a lot of fun, (and also a bit creepy)"], ["Reviewed 2 weeks ago", 5.0, "Video Game Lovers Dream", "I first discovered this place over 20 years ago when it was at the bottom of the Cliff House Restaurant when it moved I thought it had closed down...and I accidentally stumbled upon it when i was at the Wharf Area after I already had moved back to LA from the Bay Area.....\nWhenever I have a chance I try to see this wonderful haven of lost toys! Laffing Sal I think used to be the main attraction for this place that people would see when they first came in...but it has an abundance of what I consider irreplaceable and unknown and hard to find Penny Arcade machines from pinballs to arcade machines where you put money in and watch made all out of toothpicks! Old School Fortune teller machines, old mechanical baseball games that I loved playing in the 70s even at that time they were old already....self playing piano and other musical machines...\nYou've got to come here I've put some videos up on YouTube in the past of various things but it's just a fun for all place....unless you are deeply rooted in your computers and phones only...but hey you have to see where the history of these things started as well!!!!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Spectacular", "This place is just spectacular, they have a huge mix of antique games, arcades, and amusements all mixed with modern games. Everything worked and it was all 1-4 quarters to operate. We enjoyed playing a lot of the games I think I spent close to $10 in quarters and we didn’t quite get to try everything but it was a lot of fun. I would definitely go back if I was in the area.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Free Place", "Free to get in. Just bring lots of quarter and pennies if you want flattened pennies. We had fun playing old arcade games and new ones. Got our fortune told by two machines. And tried to whack the mole. Lots of fun for adults and kids. Short walk from Pier 39.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Quirky", "Weird and quirky. Bring quarters and hand sanitizer. Lots of old and unique games. It's free to enter."], ["Reviewed 4 weeks ago", 4.0, "Old-Fashioned Fun", "This free museum would be fun for the young and young-at-heart. Families would have a great time playing games, some that hearken back to the 1800s, others that will transport visitors to their childhoods. My adult daughter and I had fun looking at the wide variety of arcade games. We played a few too, which included a rousing game of mother-vs-daughter air hockey. I was happy to see my favorite arcade game, Whack-a-Mole, in which I dropped a few quarters--readily accessible at the many change machines located throughout the museum.\n\nThe museum houses antique and retro games, but it does have a bit of a dated feel itself. We lost a few coins in out-of-order machines bearing tiny signs that were hard to see. Even so, a fun experience can be had for the price of a handful of quarters.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "So fun, bring quarters", "We had some much fun playing the games and reading our funny fortunate and looking at old timey games. super fun"], ["Reviewed 4 weeks ago", 5.0, "Whoa!", "This place is the best thing about Fisherman's Wharf. It was an unexpected and delightful surprise. It is packed with vintage arcade games and amusements. It's both historical and fun.. I love how the attendant cruised around on rollerblades. Bring lots of quarters!"], ["Reviewed January 21, 2018", 5.0, "A step back in time, so awesome!", "This place is really cool! My husband and I popped in here to get out of the rain for a minute and completely got lost looking at all the cool games. There are actually quite a lot of games in there. It's free to enter and if you want to play some of the games they are pretty cheap to try out, $0.25 to $2 (a lot were 25 or 50 cents though). Some were a bit hokey and I actually felt bad for any children who had to rely on them for entertainment as a child, but that's life and technology I guess. There were some games/music players in there from 1915, 1928...beautifully redone! It was really cool just walking around looking at them while listening to the music some of them played. I could get lost in looking at the details on some of them, so intricate. An oldie but goodie...they sure don't make things like that anymore. Definitely recommend visiting here, with or without kids. Just make sure you have some change or bills on you, they do have change making machines. You can't possibly visit without trying out a game or two! :-)\nShow less"], ["Reviewed January 19, 2018", 5.0, "Love This Museum!!!", "This was my 3rd time visting this museum and it never ceases to amaze me! I love antiques and I love antique toys & games and this is heaven for me! My sons & I played games and got our fortunes told. Check out laughing Sal, she always cracks me up! The museum is free but if you want to play the games you will buy tokens from vending machines. This machines are so old and still work ~ crazy! Don't miss this!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Best $10 of fun", "We found this a few years ago by chance on our last visit ( no kids ) had a great time\nThis trip with our kids 9 and 12 we again visited , the the girls loved it as we did again\nBest value for an hour of fun you can get anywhere\nYoung or old and every one in between dont miss this one\nShow less"], ["Reviewed January 17, 2018", 5.0, "Delightful", "This whole place is a delightful trip back in time. It's FREE to check out and you can check out the games for a few dollars changed to quarters, which I highly recommend. In addition to all the retro arcade games, there are a few panels set up with some history. There are also several pressed penny machines here. If you're in the area, this is a great way to spend an hour or two!\nShow less"], ["Reviewed January 15, 2018", 5.0, "Most fun I have had in a Museum in Years!", "Stopped in on a Thursday afternoon while strolling around Fisherman's Wharf. Easy to change money into quarters, a huge selection of fantastic vintage machines - all of which you can play/watch. We ended up spending over an hour in hear and leaving with our stomachs in pain from so much laughter. An absolute blast and well worth an hour or two of your time! Haven't seen a working antique collection this amazing anywhere else!\nShow less"], ["Reviewed January 12, 2018", 5.0, "Roll up, roll up, and get your quarters out!", "You could easily spend a lot of time at this place! We stayed for nearly an hour not entirely realising how big this place was. There are so many old school games and you can't help but appreciate how old some of these things are and how special it is to be able to play them. We also had a few goes at the game where you throw the ball at the bowling pins dressed up as clowns which was so funny.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Step into the World of Antique Arcade Games", "Most games are 25 or 50 cents to play, but there are some that are as cheap as a penny! There are tons of really old games, as well as some newer ones. It's fascinating to just check out all the old games, and they're fun even to play now. It's a place you have to check out at least once.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Kids will love this!!!", "You will see games here you won't see anywhere else. Most are Just one quarter. A great stop to relax at let the kids play."], ["Reviewed January 7, 2018", 5.0, "so much fun!", "Totally worth going to! There's a game there for everyone and most cost 25-50 cents. It wasn't overly crowded, and we didn't have to wait a long time for most of the games. Coin machines are available, so as long as you have cash you don't have worry about getting quarters.\nShow less"], ["Reviewed January 7, 2018", 2.0, "Rude staff with over the top rules", "Found the man who works here to be really rude with that type of attitude towards customer who came along way to visit this place he doesn’t deserve the customers. Seems over the top you cannot have a takeaway coffee in there but aside from that the way he spoke to me about it was terrible. Very poor customer service\nShow less"], ["Reviewed January 6, 2018", 3.0, "A few modern games but would appeal more to an older generation", "Interesting nostalgic look at amusement of a different era. A greater selection of old mechanical arcade machines and games. A few more modern games. Change machine available. Worth a look just out of curiosity."], ["Reviewed January 4, 2018", 4.0, "Old fashion games", "Lots of old fashion games like pinball machines, little skits performed by mechanical machines, car racing games, and some more modern games. Many of these games are still playable— just bring your quarters or they have change machines there. Free to go in and see the old games/mechanical shows. No prizes here but very interesting to look at the displays and try a few games. We spent $2 playing a few different games— cheap for the Fisherman’s Wharf area.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Kinda Creepy But Fun", "Some of the old games in here are super creepy, but I think that makes it fun. The main reason I wanted to go was to play the arm wrestling game from a scene in The Princess Diaries. I played, it was very hard. It was neat to see the old games, a fun way to kill a half an hour. If you have little kids I would caution you that the games are not cheap to play, some of them are 75 cents. But they cost a bit to maintain I imagine so I wasn't bothered by it.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Free!", "Entrance is free, you can pay a little bit to play some of the games, some are free. There is one pretty racist diaorama of an old South plantaintion. But it is dry and a good place to get out of the rain"], ["Reviewed January 3, 2018", 5.0, "Great for Families", "Ever since they moved form the cliff house to the warf it seemed like a good fit. Great for Families since there are interesting antiques along with more modern machines and its interactive and fun for pictures."], ["Reviewed January 2, 2018", 5.0, "Unexpected Fun!", "My wife and I recently had friends in from out of town. Walking through Fisherman's wharf, we decided to drop in for a moment at Musee Mecanique to show them \"Laughing Sal\" who terrorized generations of kids at Playland at the Beach. A moment stretched into an hour as we played a dozen old games including several energetic rounds of air hockey.\n\nFree admission - so walk in and take a look around at dozens of mechanical games that thrilled people back in the 40s and 50s - the nostalgic value alone is worth the visit. Plan to drop a few quarters and try your hand - you'll at least get a good laugh out of the experience.\nShow less"], ["Reviewed January 2, 2018", 5.0, "MUST DO! Family Fun!", "I make it a point to stop at this arcade every trip to the bay. I love love love the old style machines and the silly entertainment that was created years ago. We have so much fun and laugh a lot when visiting."], ["Reviewed January 1, 2018", 4.0, "Happy place", "My friends and I came here after our dinner at Boulud and were pleasantly surprised. Got ten bucks in tokens and played the gamut of games, ranging from Pole Position to a old time baseball game, vintage 1937 or so. A little rough around some of the edges, but it's a fantastic representation of over a century of entertainment, and you get to play with most of it to boot!\nShow less"], ["Reviewed January 1, 2018", 4.0, "Awesome Player Pianos", "A pretty fun time was had, and some of the older arcade games were interesting to see and interact with. Awesome player pianos and other vintage games. This arcade/museum is in a very touristy area and will require you pay alot for parking, so consider this while spending time at Musee Mecanique... it is free, the individual games are quite inexpensive, but the parking is $3 for 15 minutes...\nShow less"], ["Reviewed January 1, 2018", 4.0, "If you love video games as a kid or if your kids love games, this is where it all began", "What a cool place this is. It's like walking through a time warp of the evolution of games and how the technology has progressed over the ages. My wife, kids, and I thoroughly enjoyed spending time in here and playing a lot of the games, old and new. So interesting to see how kids back in the day would have spent their time in an arcade as opposed to how I spent it back in the 80's. Speaking of which, they have games here from every historical era, but stick mainly to the old timey games, that were all mechanical. A great way to burn some time while in San Francisco. It's a in a great location and doesn't have to be the focal point of your visit, but plan to burn about an hour in here for the full effect, as there are a LOT Of games to play!!\nShow less"], ["Reviewed January 1, 2018", 4.0, "Asteroids and titillation", "Several generations went here and all found something that reminded them of there youth. There is plenty to see and do."], ["Reviewed December 30, 2017", 4.0, "Great way to kill an hour or two with your kids", "My daughter and I dropped into the Musee Mecanique at Pier 45 while visiting San Francisco on a recent pre-Christmas trip.\n\nI honestly think this is one of the best bang for the buck attractions in San Francisco. I’m an old-school technology fan anyway (disclosure: I’m a consulting archaeologist) and using hands-on antique entertainment equipment is just a fun thing to do. We visited a few years ago, and it was neat watching my young son play an actual, functioning, non-digital pinball game for the first time. I thought it would be fun for my daughter as well.\n\nAs you plonk in your quarters, and you try these things out, you realize that people haven’t really changed a heck of a lot. They still like to be entertained, and are willing to pay money for it. Some of the attractions are hokey – “Ramasees The Great Will Answer Your Question”, from a coffin, no less – but that’s the fun of it. My daughter’s in her mid-twenties, and she enjoyed things like playing with the claw machine and cranking out penny souvenirs. It’s easy to spend a couple of hours using the lovingly maintained hands-on technology a quarter at a time – and find yourself totally immersed in the experience.\n\nIf you’ve got kids and want to keep them – or even yourself – inexpensively occupied for a couple of hours, the Musee Mecanique is worth a visit.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Loved this Place!!", "We loved this place - a awesome step back in time and definitely loads of fun. We had 2 teenage boys who marvelled in the old world charm of this place of days gone by. Definitely not to miss when you are in San Fran"], ["Reviewed December 17, 2017", 5.0, "Really interesting and fun", "The old-time games here were so fun. The kids loved it and so did I! I also liked that many of them were only a quarter, and most were no more than 50 cents. Although when we first got there, my husband put in a $20 bill and only got $11.50 back in quarters (so definitely count your change). It was no big problem though. I went in back to customer service and the guy gave us the extra coins that were missing (after checking the machine). We spent about an hour and a half here. I especially loved the really old, quirky machines like the Grandmother Fortune teller, the terrifying Laughing Sal, and so many more. There are little wooden can-can dancers and puppets that dance. Foot massage machines, love life predictors, you name it. Really cute. Check it out!\nShow less"], ["Reviewed December 16, 2017", 5.0, "Free and fun! Games galore", "This place! You must see it to appreciate it. It has all those old creepy fortune teller machines (ala the 80's movie Big with Tom Hanks) and a zillion other old mechanical games. It's a history museum of gaming that you can still appreciate by playing all the games. Some are 25 cents, some are 50 cents or more. Worth every penny! They also have all the standard pinball games and air hockey. Perfect for the serial gamer in your life. I took my 5 year old and we were there forever!\nShow less"], ["Reviewed December 14, 2017", 5.0, "Old School Arcade", "Free entry to this interactive 'museum' where you can wander around checking out all the old amusement machines ranging from the vintage mechanical devices to the retro arcade video games.\n\nThe vast majority of the displayed machines are playable and there's change machines available in order for you to get a roll or two of quarters.\n\nHighly recommended!\nShow less"], ["Reviewed December 13, 2017", 5.0, "Good Old Fashioned Fun", "My boyfriend and I stopped in to check it out and ended up spending hours in here. The machines are in great shape and we had a lot of fun playing them all."], ["Reviewed December 12, 2017", 5.0, "Fun place to walk through and a blast with a hand full of quarters.", "Fun place to walk through and a blast with a hand full of quarters. Amazing antique and vintage coin operated machines."], ["Reviewed December 9, 2017", 5.0, "Fun to see!", "This place has the most amazing collection of antique arcade games that work! It was so fun to play the old games, and watch the old mechanical puppet shows."], ["Reviewed December 2, 2017", 5.0, "One of a kind", "This place was really cool. The funny thing is you look at the machines and think \"wow, everything is only 25 cents\". But then you want to put quarters in everything so expect to blow through 5 bucks in 20 minutes. It's worth it though because you won't find machines like this anywhere else. I give the owners credit for keeping everything running. I'm sure they're making a boatload, but I've never seen anything like this and everything is in beautiful condition.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Childhood memories", "Not to be missed especially if you hung out at the arcades back in the 70's and before. When I first walked in I had a wide smile and couldn't make up my mind on which game to go to first. The old arcade machines brought back found memories of growing up and the big plus is that you can actually play on the machines.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Grab your quarters and allow an hour to play!!!", "You could stop in for just a few minutes, but don't be surprised if it sucks you in for an hour or more....not only do they have Ms Pac Man, but many OLD OLD games...REALLY OLD. Some are funny, many are down right creepy. We got some good laughs about what folks used to find humorous....so simple and sometimes VERY dark....a reading of the last rites where a guy gets hung....as a game....really!?!?!? check it out.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Most amazing place in SFO", "What a find. At fishermans wharf, on the pier behind boudins.enter, get $10 worth of quarters and wander around this huge game room full of ancient coin op games. Anyone over 40 will recognize the amazing old games carefully maintained by the family that owns them. Bring your kids, turn off you cell phones and let them experience a different kind of fun. Do Not miss this place.\nShow less"], ["Reviewed November 22, 2017", 4.0, "Interesting", "Stumbled across this place randomly. Was really neat to see all the old game machines. The museum wasn't too busy - we visited on a rainy Wednesday afternoon in November. Easy walking distance from Pier 39. Located in Fisherman's Wharf."], ["Reviewed November 18, 2017", 5.0, "Old times", "Very interesting. Oh what used to pass for entertainment you will find ir here. Some very interesting antiquities"], ["Reviewed November 18, 2017", 5.0, "Good family fun....SF history", "We miss having the Musee Mecanique at the Cliff House. It was a family favorite and always allowed the kids to safely enjoy the \"videogames\" of the past. San Francisco made an effort to save these treasures and relocate them to Pier 45. I am not a fan of the tourist SF but this is SO classic, if you are a tourist you'd better not miss it.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Vintage video games...go here!", "Jewel of the wharf if you have teens that want to see what mom and dad played as a kid. Lots of WAY older games and attractions as well.\n\nAlso, most still actually cost a quarter. Marvel at how your kids will just shake there heads watching their parents rock out to totally old school (boring to them) games. Nut then they find some they like as well.\n\nDone some time with the really old attractions as well. It's well worth dropping $5 to see a bunch of these in action.\n\nAnd yes, we left with 3 high scores!\nMs. Packman\nBattleZone\nGalaga\nShow less"], ["Reviewed November 16, 2017", 5.0, "2001 - Fantastique", "Free entry, restored and working old machines from 100 years ago. Some operate for as little as 25c. There are also a couple of pressed penny machines onsite. I will add some photos from my DSLR later"], ["Reviewed November 15, 2017", 5.0, "Excellent fun!", "We really enjoyed wandering through the exhibits. There were many hilarious (and occassionally creepy) pieces which made us laugh. The mechanical orchestras were particularly enjoyable. It was a fun and low-cost way to spend an hour."], ["Reviewed November 14, 2017", 5.0, "Great place for history and pin ball", "I was amazed at the number and variety of games and machines that were in this place.\n\nI played some vintage baseball games as well as some pinball and video games.\n\nIt is free to walk around, but you can spend all day there if you want to play some of the games.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Relaxing evening at the warf", "Was a really nice evening wondering through the place. Such history in all the machines and activities. Easily spend an hour here looking and interacting with the different games"], ["Reviewed November 11, 2017", 5.0, "Magical", "What a magical, mystical and fun place to spend a couple of hours. It's a fun place to explore and play with the old mechanical machines."], ["Reviewed November 8, 2017", 4.0, "Step Back In Time", "Asteroids! Galaga! Centipede! Pac-Man! Need I say more? If you lived in the 70's and 80's playing these games, you'll find them here...in the 20-10's!!! I lost a lot over the years, yet it was fun and brought back great memories hanging out at Mr. Mike's...\nShow less"], ["Reviewed November 7, 2017", 5.0, "Awesome", "This is a tiny spot of san francisco that you have to visit!! There are so many games and distractions that you can spend your afternoon here, playing a game of the past!! Great for kids, teenagers and adult!!"], ["Reviewed November 6, 2017", 4.0, "Bit of old fashioned fun for a half hour - part of the Wharf", "Was always going to check this place out. As an Aussie whose only arcade experience is pinball machines and video games, I was looking forward to this quirky attraction. Both my wife and I had a lot of fun with our bag of coins. Fun - old days style. Lots of different coin operated games to play and I was just fascinated by the mechanical wizardry of these old school machines. You can spend 10 minutes browsing to hours playing and go in and out at anytime and since it’s at the Wharf you are not cutting into your precious tourist time. No harm checking it out. Go back in time and have some fun.\nShow less"], ["Reviewed November 6, 2017", 4.0, "An interesting escape from the sun", "We dived in here to get some respite from the baking sunshine. It was a great place, full of vintage games. Definitely worth a look"], ["Reviewed November 5, 2017", 5.0, "Old-timey Fun!", "What fun for a few dollars! There is no excuse to skip this. There is no admission fee, just play the old time arcade games for a quarter (\"old time\" means 1920's to 1980's). I always wanted to play some of these games that I only saw in museums. I finally got my chance. Spent $4 in 30 minutes. I will spend more time there the next time I'm back.\nShow less"], ["Reviewed November 4, 2017", 5.0, "This place is a blast", "This warehouse on the wharf is filled with old-fashioned pinball machines, PG-rated peep shows, city tableaux, photo booths, and a few newer machines. My favorite is one of the baseball games, and there are 2-3 different kinds. It's a great place to go when you need a break from the walking and touristing, or if you have some time before lunch or dinner or before your boat sets sail. Lots of fun at a minimal price.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Vintage at its finest", "Came across this museum when visiting the Wharf. The visit was more for a wander (free entry into the museum). Even if you aren’t planning on playing any of the penny arcade games, and it’s located next to restaurants, shops and other attractions so worth your while admiring the vintage seaside games in all their glory, and take a trip back, and enjoy.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Antique games on the pier...fun for everyone", "If vintage contraptions and penny arcade games sound interesting to you, you will really enjoy yourself here. We were in San Francisco visiting friends and spent the day at Fisherman's Wharf. We happened to pass by and it looked like fun so we popped in to check it out. Admission is free. I seem to remember that most of the machines cost 25 cents to operate but you really want to try them all because they're all so interesting (and possibly creepy). We loved it. The kids (7 and 10) didn't want to leave. They also sell really cool art/objects out of vintage vending machines -- be sure to check it out.\nShow less"], ["Reviewed November 1, 2017", 1.0, "Ok place but might appeal to one with specific interest in old game machines", "I went to this place after it was recommended to me. But I didnt go in once I saw that its kind of a gaming arcade. I was in SFO for a week and did not want to spend my time here playing games."], ["Reviewed October 31, 2017", 5.0, "Works for me!", "Do not expect fancy. This museum is essentially a warehouse full of old arcade machines of various ages. However, if you like this sort of thing...it is absolutely heaven! First off, its free. Bring a pocket of quarters. You can run the games/ attractions yourself! Plus, the attractions they have are frighteningly simple, and my idea of real folk art. Americana times ten from the giant Joan laughing away to the \"Corn Cob Gang\" puppets....it really points to how our culture has changed as our visual sophistication and demands would not carry this sort of simple game/ or show right now. Be prepared....the gift shop is a vending machine with some pretty sweet stuff (albeit expensive). Do not miss this original and eccentric place.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Fun remembrances of the early and mid 20th cent", "All types of coin operated history is here. Several machines I remembered from the 60s and 70s.\nNothing is overpriced to operate.\nIf you love nostalgia, this is worth the visit. Free to enter and roam. This was just a fun stop at the pier. I would support it, just to keep it alive.\nReally...stop in and reminisce, or stop in for an education, or stop in to have some laughs.\nShow less"], ["Reviewed October 30, 2017", 5.0, "An absoluet blast from the past and flashback from carnivals past!!!", "A fun free look into the history of carnival game and entertainment over the last 100+ years. And the amazing fact is that the machines still work quite well!!"], ["Reviewed October 25, 2017", 5.0, "Fansnating place.", "This is a massive room filled with all sorts of arcade machines ,many form the 1980,s and many more from time before that.There some really old machines here you can just wander around and get lost in a bit of history.\nIt seems most attractions took 25 cents ,there is a machine that will exchange dollars into 25 cent pieces, you have to make sure you put the notes in correct side up or it wont work.There is no admission and your free to just wander around at your leisure ,not sure if there are any toilets ,there are staff on site.\nGreat place to spend a couple of hours.\nShow less"], ["Reviewed October 25, 2017", 5.0, "A blast from the past!", "Fascinating collection of vintage arcade machines! You can have so much fun here for just a few quarters! Great for young and old alike!"], ["Reviewed October 17, 2017", 5.0, "Wow - memories for adults and great fun for kids", "An absolutely brilliant place to spend time - a whole array of amusements from the very old to the games I played in the 80's. Good value for money and a great time had by the whole family."], ["Reviewed October 16, 2017", 5.0, "Free Family Fun", "Amazing collection of coin operated amusements, some over one hundred years old. Free admission, and it is interesting to admire the engineering and craftsmanship of these machines. Most of the machines operate for 25 cents."], ["Reviewed October 16, 2017", 5.0, "A little jewel", "This was a little jewel in an otherwise over commercialized Fishermans Wharf. Took me back to my childhood and more. I would have happily spend hours here if time was on my side. A must see attraction for young and old."], ["Reviewed October 15, 2017", 5.0, "This place is amazing!", "We visited here when we were in San Francisco for years ago and it on the immediate must visit again least when we came back this time. No entry fee. It contains lots and lots of old time/old style game machines. It includes old-fashioned tenpin bowling, pinball machines, AirHockey, all the different sorts of arcade games. An absolute buzz for the whole family. We actually visited twice in a two day stay in San Fran.\nShow less"], ["Reviewed October 15, 2017", 4.0, "UNBELIEVABLE collection of Old Arcade Machines", "What an awesome collection! It is almost too much to take in at one time, but we tried. Being able to actually play some of them rather than just look from outside ropes was really great. Wish our grandson had been with us ~ of course we might still be there the next day if he had. So many to see and try ~ so little time (they are only open 10 hours each day).\nShow less"], ["Reviewed October 11, 2017", 5.0, "Interesting old amusement games", "Wow! Never seen so many old games from recent past back to the turn of the last century.\nThis is on the east side of pier 45 by the submarine.\nCosts nothing to enter. All the machines work and most cost 25c for a turn, up to 75c.\nGames include recent past games like space invaders etc.\nA lot of history here. Includes some information panels about amusement trend from the past.\nWe spent around 45min here without playing any games.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Fun and cheap", "This is a unique little corner of the world with arcade games from the turn of last century to today. Nothing costs more than 50 cents and if you need a break you can head out to the pier and take in some views of the harbour.\nWe had a blast here as adults but kids would really love it - definitely worth a visit if you are in the area.\nShow less"], ["Reviewed October 9, 2017", 3.0, "Quirky and interesting", "We didn't stay long. We wandered around and relived some memories of our youth, but other than that it was super noisy and crowded. We didn't stay long."], ["Reviewed October 8, 2017", 4.0, "Stop in while down at Fisherman's Wharf", "Free to enter, the is a fun museum that showcases over a century's worth of old style arcade games, automatons, and other fun machines from days long past. Think Zoltar from the movie \"Big.\" All the machines still work, so you can stay a while and play some of the machines if you'd like. Definitely worth a stroll through while you're visiting Fisherman's Wharf.\nShow less"], ["Reviewed October 8, 2017", 3.0, "Old School", "Stumbled across this whilst wondering about. Has all old amusements from back in the day. Interesting walk about & worth popping in. 8/10"], ["Reviewed October 7, 2017", 5.0, "Amazing place. Well worth a visit.", "A step back into the past with some beautiful automats - almost works of art, Some made by prisoners."], ["Reviewed October 4, 2017", 5.0, "Great old style arcade from the turn of century", "I love visiting this place each time I am at Fishersman Warf, They have a huge assortment of working old arcade games, viewing machines, and automated musical dolls etc.. most of these are from the early 1900's or even early. There are a few pinball machines and old 1980 Arcade games but the real joy is seeing all of the old time machines. Most cost 25 cents now and there are change machines in and around the arcade.\nA must for todays kids who have only played PLAYSTATION or XBOX games to see how it all began.\nShow less"], ["Reviewed October 4, 2017", 4.0, "Neat old games", "All different kids of old arcade games. Some dioramas too. Free to get in. Costs to play the games. Fun time ."], ["Reviewed October 3, 2017", 3.0, "Good place to spend 30 mins or so", "Good fun but not somewhere you could spend a long time. A nice stop off whilst looking round the piers."], ["Reviewed October 2, 2017", 5.0, "Blast of from the Past", "Such a cute attraction. Basically a free attraction unless you \"feed\" the machines. My sister had great fun reminiscing about Preppy the musical clown and introducing him to her children. You don't need a whole day there, but if you are spending time down at Fisherman's Wharf stop in and take a look around. You won't be sorry.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Hilarious fun!", "This was probably the most fun we had in San Francisco! The collection of antique coin-operated machines (all in working order) is amazing and many of them are pretty hilarious too. It's a bit hard to describe, but picture a big arcade with all kinds of old games -- musical organs, fortune tellers, \"how hot are you\" tests, creepy animated puppets, pinball machines, sports and shooting games, and relatively modern video games like Pac Man. Be sure to find the one with the sign that says, \"Don't play this if you are easily offended...\" Free admission and most games cost only 25 cents, so this is a cheap way to spend an hour or so on the waterfront. Bring some small bills and use the change machines on the premises.\nShow less"], ["Reviewed September 30, 2017", 5.0, "It's free! How can you beat free!", "Great collection of penny arcade, turn-of-the-century, automaton, etc.,. Plus some more current electric pinball and video games. Get lots of quarters when you're there! Conveniently located right on the waterfront. Don't miss it!"], ["Reviewed September 30, 2017", 4.0, "asteroids!", "free to enter and most items 25 cents to operate. very old machines very funny ones - if going please do he cowboys you will roar out laughing. also has asteroids and pac man that made me feel old!"], ["Reviewed September 29, 2017", 5.0, "Great historic working arcade", "My second visit here, first time back in 2015 where it was one of the highlights when briefly visiting San Francisco. Today, I visited by myself, taking more time to read up about the history of the different arcade games. The mechanical car racing old style winding a handle to get the cars moving was awesome, I also like the music boxes and pinball machines. Recommended for all ages.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Pier 39", "A fun place to visit. A lot of activity, restaurants, shops, and at the end are the seals. !!! Fun to watch their activities and a great view of the bay"], ["Reviewed September 22, 2017", 2.0, "Kitchy", "I suppose it is supposed to be kitchy, but just not for me. It is a running arcade so loud and busy."], ["Reviewed September 20, 2017", 5.0, "Loved this little gem", "This place was great - love looking at the old games and skill testers that no longer exist... except here - you can use all the machines, about 98% were is great working condition - its free to browse and all you pay for are the games you want to get involved in. It was a little gem on the pier that we would highly recommend!\nShow less"], ["Reviewed September 19, 2017", 4.0, "Since you are down at Fisherman's Wharf", "A good way to kill some time. The museum is free and you can walk around and see some very good antique arcade games. A fun look back in history."], ["Reviewed September 16, 2017", 3.0, "Unique Find", "Right in the heart of Fisherman's Wharf is the Free Museum. It is larger that it appears and houses decades of old arcade games and puppetry.\nThis is worth a stroll thru here. What amazed me was that all of the games/machines are all in working order. They have a coin machine on site and you are good to go.\nThey had a mechanical playing piano and some of the popular arcade games as well as some that were easily some of the earliest games.\nThis was a great place if you find yourself in the area.\nShow less"], ["Reviewed September 16, 2017", 3.0, "Interesting", "If you are interested in old time amusements you should visit Musee Mecanique. It was fun to walk through and observe the old pin ball machines, mechanized fortune tellers, and other amusements. If you would like to pay to play you can may. We spent just a little bit of time there. You might enjoy more!\nShow less"], ["Reviewed September 15, 2017", 5.0, "A total surprise", "We came upon this place by chance and were amazed. The collection of working historic arcade games etc; was fantastic a,d magic. Very well done."], ["Reviewed September 15, 2017", 5.0, "Fun for all ages.", "It's a step back in history and new games too. Fun for all. Not too expensive. You can spend a couple of hours watching and playing games."], ["Reviewed September 14, 2017", 5.0, "Impressive trip down memory lane", "This is a great example of how inventive US minds can be! Great piece of history and how men have looked for ways to entertain themselves"], ["Reviewed September 14, 2017", 3.0, "Okay, but not a highlight of our visit", "While walking around Fisherman's Wharf we stopped in Musee Mecanique. Quite frankly, I was expecting more than what they have. Interesting to see some of the very old games, though. There is so much else to see and do in San Francisco that we didn't spend much time here.\nShow less"], ["Reviewed September 13, 2017", 5.0, "musee mecanique", "must do if you like mecanical games of any kind. everything from the very old to the stuff you played not too long ago. free to get in and can play most everything for 25 cents .very cool"], ["Reviewed September 12, 2017", 4.0, "History of amusement", "possibly one of a kind working amusements from years gone by. Simple and naïve by today's standards, but interesting and some real fun ones. Worth seeing."], ["Reviewed September 10, 2017", 5.0, "Completely Unique Experience", "We stumbled upon this arcade and had a blast! It was so neat to see such old arcade games still in operation. We spent about an hour here! Totally worth a visit."], ["Reviewed September 10, 2017", 4.0, "Nostalgia", "Really cool to see the old games from arcades. Even more fun to be able to play some of them again. Only down side was it was very warm inside."], ["Reviewed September 9, 2017", 4.0, "Cheap time killer", "Visited this tourist trap with my two kids (10 and 12) as an alternative to other tourist traps at the Wharf (i.e. Ripley’s Believe it or Not). Entrance is free. This is a large warehouse of vintage coin-operated amusement devices. There are more modern games like Ms. PAC Man and Pirates of the Caribbean pinball machines and air hockey, but there are also some very unique antique gaming devices. There are plenty of change machines located throughout the Musee and all games are operated by quarters (not tokens). This appeared to be a popular location, but we never had to wait to play a game. Not all of the vintage games were functional unfortunately. There were a number of press-your-penny into a souvenir games, which my kids are obsessed with. Overall, they had a good time and we spent considerably less than if we went to Ripley’s for $20 per person.\nShow less"], ["Reviewed September 9, 2017", 5.0, "So cool!!", "It was so neat to see and play the games of yesteryear!! The games at .25 each *mostly* are so cheap we got out of there having spent less than $20 on a couple of hours for 3 people. We can't wait to go back with our son and explore the rest of the games. Wonderful stop!!\nShow less"], ["Reviewed September 7, 2017", 5.0, "lots of cheap fun", "visiting the Musee Mecanique was a very pleasant surprize. hundreds of old fair ground activities like slot machines, puppet shows, mechanical people and animals, strength tests, games of all description; all for a quarter or 50 cent and a few a dollar. we spent hours there and really enjoyed it.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Fun History", "We had great fun taking our teenagers here. It was great entertainment and cheap! We gave each of the kids a handful of quarters and they had great fun!"], ["Reviewed September 6, 2017", 4.0, "Definitely go here!", "This is a fun place filled with all kinds of game machines from different years. Some are very old - others more familiar. For a quarter or 50 cents you can actually play the many machines there. Our whole group liked this place!"], ["Reviewed September 4, 2017", 4.0, "Quirky fun", "Vintage electronic amusements. A fair \"hodge-podge\" of machines but most very interesting. Fans of \"The Princess Diaries\" will recognize some of the pieces."], ["Reviewed September 2, 2017", 4.0, "Good fun with old toys", "Enjoyed playing with old machines and checking fortunes from forgotten fortune tellers. A nice place to spend a couple hours and have a good time."], ["Reviewed September 1, 2017", 5.0, "So much fun!,,,", "So, I had my first turn of Space Invaders in years and years, so much nostalgia for anyone who has ever enjoyed arcade games - from raunchy 3D stereoscope machines from the 1800's, to those creepy fortune teller machines, calliopes and bagatelles to pinballs and video games. What a history trip! Had a great time and appreciated the low cost of most slot machines, all restored and in working order.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Unique and interesting", "First off- it is free. Secondly - the old type 'fortune teller', moving scenery as well as other machines from the earlier years are fun to look at. Take a few quarters and step back in time. Where everywhere else you might see one or two, here are several to keep you on the right path!\nShow less"], ["Reviewed August 31, 2017", 5.0, "Had a blast!", "I hadn't really read much about this place other than a short review by another TripAdvisor member who had enjoyed it. I loved it. It was like stepping back in time but only to the must fun parts of history. The fact these machines still work is nothing short of amazing to me. I would highly recommend this museum if you were the kind of kid who hung out at the local arcade or wished you parents would let you!\nShow less"], ["Reviewed August 30, 2017", 4.0, "An amusing browse through history", "This was quite amusing. It is a museum of arcade games and amusement machines. It is free entry but you can use quarters to try out the machines. We came to the conclusion that there were some pretty strange people making these early machines. There were a couple that were puppets performing executions. A number were peep shows. Then there were some that were just plain bizarre, like laughing puppets or crying babies. We had a good laugh trying out some of them though.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Loved it", "all kinds of old pinball and carnival machines. There was some that had executions and other gruesome displays. Little mechanical puppets acting out scenes from life 100 years ago. I really enjoyed it"], ["Reviewed August 29, 2017", 5.0, "go go go", "It might not thrill those young'uns who are addicted to internet games, but those of us who remember what is there will be absolutely awed. And you might be tempted to pull out a quarter or two to see the magical machines that do their stuff, and which have given great pleasure to our parents, and even some of us.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Affordable Fun!", "We decided to come here based on the reviews on trip advisor. I am glad we came. This place is pretty big and it has tons of arcade/video games and some older one that are very interesting. All the games cost $0.25 to $0.50 per game. They have a change machine there so you don't have to worry about bringing change. We spent $5 on games and we had a blast! You can easily spend an hour or two here. Good for kids and adults! If you are by the pier, I would highly recommend stopping by!\nShow less"], ["Reviewed August 27, 2017", 4.0, "Fun place", "Not often you get to visit a fun museum for free, but that's exactly what we did. Came across this fabulous museum while strolling around fishermans wharf and what a hidden gem it is. A handful of quarters and you can spend hours here enjoying and playing the fully functioning historic arcade games. Loved it and recommend it as a place for all age groups!\nShow less"], ["Reviewed August 26, 2017", 5.0, "Had a great time exploring OLD games", "Kind of just happened upon this place and really glad we did. We are a family of 4 with 2 boys, ages 14 and 17. So if you have any video game enthusiasts in your family, this is definitely worth a walk around. Games from every era, dating back to the 1800's I believe? But then the classic arcade games and pinball games of the 80s and 90s too. We spent a good hour in here and had a great time playing!\nShow less"], ["Reviewed August 25, 2017", 5.0, "What a Fun Surprise", "We do not let our son play video games or use our PDAs at all, so we didn't think we would come here at all, let alone spend much time, but we wandered in after looking at the ships outside and ended up coming back twice. These games provide a level of community play, physical manipulation of objects, and personal interaction that is radically different from the video games of today. This place is a REALLY FUN SURPRISE, as well as an excellent rainy-day activity and a great value. In a low-key, bright, and shockingly wholesome environment (as opposed to the darkened, cave-like arcades of my youth), you can enjoy mechanical amusements from yesteryears (possibly including your own). Introduce your kids to Skee-Ball, Space Invaders, Pac Man and Pole Position. Re-live your glory days if you were a pinball wizard. Try out the antique massage chairs (both foot and whole-body). Play a round of air hockey like you used to do in the basement with your kid brother. Hurl little red balls to knock down pop-up clowns. Younger kids will win a prize every time with the mechanical arm in a box and enjoy helping a chameleon zap bugs. Watch a player piano in action, and peer into some truly antique amusements. While some things here are not really appropriate for kids, those are easy to skip. There really are games for people of all ages here--at least there was plenty to keep both ourselves and our six-year-old boy busy. For about 8 bucks (quarters are available in change machines) a family of three can laugh away a few hours or more. In fact, it's VERY easy to lose track of time in this place. If a machine eats a quarter or if you need help, ring the bell at the office near the back, and a gentleman on roller skates will appear and help you out.\nShow less"], ["Reviewed August 23, 2017", 4.0, "Best value for money!", "I was surprised by how much fun this was and its free. Quarters to run a whole hangar full of historic arcade games. Loved the mechanical fair ground."], ["Reviewed August 23, 2017", 5.0, "Hidden Gem", "Sometimes when you see a US museum with free admission you think it might be only OK. This museum was excellent. So much to see and do, and I thought the charges to play the games were very reasonable. Well worth spending an hour here before moving onto the more well known attractions\nShow less"], ["Reviewed August 23, 2017", 4.0, "Fun to step back in time", "Made a quick stop in here (that's all you need) to see and play some of the antique carnival games. It was a blast. Stepping back in time and having some of the creepy monkey's singing for you lol! What I really liked was most things were under $1 to do and they haven't changed the machines, they still take real quarters and there was lot of change machines around to break down your small bills!\nShow less"], ["Reviewed August 21, 2017", 4.0, "Added bonus", "Did this with a spare hour we had before we had to go to the airport. Some great nostalgic 80's 90's games and pinball, plus super old games, and fortune machines etc. Our teens had fun and some good laughs."], ["Reviewed August 20, 2017", 4.0, "Unique and Historic..and Cheap", "This museum of largely historic arcade amusements is situated in an old warehouse and has free admission. In addition to viewing the old amusements, which itself is entertaining, many if not most of the games and other contraptions are functional and can be used. If you intend to play any of the games, be sure to bring quarter or low-value bills (e.g. $1), as there is change making machine. For us, we played a very old mechanical baseball game and found it quite entertaining. Something for everyone.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Great way to spend an hour!", "We stumbled across this warehouse of old-tyme arcade games and were dazzled! Just looking at how entertainment has changed over the century was fascinating, and I loved that 90% the games were functioning. Stopped by on a Thursday afternoon in August and it was slightly busy (the entire wharf was pretty packed that day) but not too bad.\nIf you're visiting, be sure to bring lots of quarters and dimes! The nickelodeons were either 10 or 15 cents and most other things were a quarter. There were authentic photobooths (that actually develop real photographs while you wait 5 min!) for $3, huge musical installations and dozens of \"test your love\" games amongst other fun games.\n\nYou can wander for free or pay to play, but overall everyone has something to gain from seeing this exhibit!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Fun and historic", "We had fun playing in the arcade. Is a combination of museum and arcade and we got to use some of the games that were from the beginning of the century. Is very interesting and fun"], ["Reviewed August 16, 2017", 5.0, "If you can't have fun here....", "Time to give it up. They have old fashioned games -- really old fashioned games -- and new things to play. The ridiculous (put in a quarter and the game features a cowboy theme, very old time, where they all sit around a campfire and fart a melody) and the just plain fun -- Whack a Mole, basketball, driving, cell by cell movies...hundreds of things to try. For $20 worth of quarters you can be entertained for a couple of hours. A really fun, silly way to spend time in a group of mixed ages.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Loved the palm reader", "Great little find and a really cool way to spend an hour.\nEverything worked really well and was nice and cheap.\nReally loved the palm reading machine and fortune telling machines.\nHad so much fun and it looked like everyone else in the room was too.\n\nDefinitely recommend!\nShow less"], ["Reviewed August 15, 2017", 5.0, "Everything Works!", "This is one of the most amazing museums you will ever visit. Fabulous collection of well maintained arcade machines. Incredibly, everything works and you can play every game, even the ones that are 100 years old. Even more amazing, free admission."], ["Reviewed August 14, 2017", 4.0, "Rolling back the years", "Couldn't resist calling in to see this collection of games and gadgets. Our teenagers would have stayed all day, trying out all the old machines that us older generation grew up with. Well worth rropping by and spending some quarters and remembering the good old days before X-box and PS.\nShow less"], ["Reviewed August 14, 2017", 3.0, "Kids Love It - Not sure why", "My kids love this place. When going back to San Francisco recently, it was the one place they wanted to make sure we stopped at. I am not sure why as I don't find the old fashioned games all that entertaining and possibly even a waste of money, but I can say the kids love it! So I gave them each some quarters and some free time and read a book outside :-)\nShow less"], ["Reviewed August 14, 2017", 5.0, "Hidden Gem", "What a great find, tucked away is this little gem of a museum, very interesting and some beautiful pieces, and free! Plenty of the exhibits are hands on and the collection is varied covering a wide time span, something for everyone."], ["Reviewed August 12, 2017", 4.0, "Some Old Fashioned Fun", "I guess it can be described as a unique interactive museum. There is a large array of what I viewed as relics from around the turn of the 20th century to retro games from my childhood during the 60's & 70's. I did notice there were also a few 1980's games. It was very interesting to observe what was considered entertainment throughout the decades & even more compelling was that they were mechanically intact & playable. There were a few items with maintenance tags on them but I guess that is to be expected with the high volume of people using the antiquated machinery.\nIt is a well worth at least a gander when at the wharf. Don't need to bring change there are bill breakers available on site.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Lots to do, more to learn", "Stumbled upon this place while walking around Pier 39 and Fisherman’s Wharf and I’m glad I did. This place is great. There is definitely a unique appeal to this place with all of the old arcade machine. I loved seeing the older mechanical machines which were pretty much operated by levels, gears and springs. They also had some interesting machine associated with different eras such as the French Revolution and other wars. A trip through this place was practically a history lesson is itself. There is no “admission” fee to enter. Most machines are $0.25 per play except the fancier, more complex ones. There are lots of change machines spread throughout this place. There were also a few more “modern” screened games such as Pac-Man, Frogger and even a few more recent ones such as Time Crisis and Tekken. This place is awesome and I suggest any and every one, young and old, take at least a walk through this place. You will have fun and learn a lot.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Great fun and free entry", "We just wandered into this place and ended up staying ages. The ancient exhibits are fascinating and my partner enjoyed a nostalgia trip playing on the 80s arcade games."], ["Reviewed August 10, 2017", 5.0, "Vintage Fabulous", "Oh my gosh where do I start. This place had it all. All the fun vintage old fashion arcade games! $5 went along way! very interesting to see the different types of arcade games through the different generations!"], ["Reviewed August 9, 2017", 4.0, "Old Time Fun!", "This place is a very cool blast from the past. The teenagers loved it even though most of the 'games' were before their time. We HAD to try out lost of the games, arm wrestling, love tests, etc. Bill changers are located throughout the facility so you can get change to play.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Great fun", "Take plenty of quarters with you - you will need them !\n\nAn unbelievable collection of working vintage arcade machines - some you may remember from your own childhood, but the majority are much older than that.\n\nEveryone in there seems to have a smile on their face. Well worth a visit.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Fun to See", "It was fun to see all the different arcade items from turn of the century to early 80's arcade machines. A few of the older machines ate a quarter, but overall it was a fun experience. We had a lot of fun \"racing\" with the car race machine near the entrance and also the horse racing machine almost to the end.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Worth a visit", "A warehouse ful of antique games. I've never seen half of these, and it's so great that they are all working and accessible to play."], ["Reviewed August 6, 2017", 5.0, "Fun for the whole family", "This arcade has hundreds of vintage games. Some games are over 100 years old! They cost between .25-.50 cents to play. My 12, 14 and 17 year olds had so much fun we had to visit one last time before leaving San Fran."], ["Reviewed August 6, 2017", 5.0, "Great!", "Great, free museum with all thinkable slotmachines. Lot of classic computergames like Asteroids and Mrs. PacMan. Loved it!\nThe museum itself is free, but for playing the machines you'll have to pay. Most games are 25 cents, some 50. There is an ATM and change machines.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Great little arcade", "It was fun to show my kids who have the current gaming technology some of the original pinball and other arcades. It was a fun place to escape a rain storm."], ["Reviewed August 4, 2017", 5.0, "Hidden Treasure from the past", "We where walking at the Fishermans warf late om the evening and discovered this hidden penny arcade! It is a hidden treasure with coin-operated entertainment machines all the way back to 1860! And the best things is that you can still use them! Put a coin in the slot and listen to fortunetellers,arm wrestle, dancing dolls, lazer pistols, self playing pianos, pin ball dreams and more.\nThey even have repair and fix the machines at the museum.\n\nFun to just watch because there are a lot of classic machines, but hey: who would not try one ;-) It's after all only 25c\nShow less"], ["Reviewed August 2, 2017", 4.0, "Funny", "We walked past this and actually only went inside because it was windy and cold outside, but it was well worth it. I personally would not go jsut for itself, but if you are nearby anyway, it is well worth a visit!"], ["Reviewed July 31, 2017", 4.0, "Better than expected", "This really is a little bit of an arcade and a little bit of a museum. We had fun playing Ms. Pacman and Pole Position while we also got to see old school (really old) games and activities. Bring a five or ten dollar bill and just enjoy a half hour to an hour as a throwback to pre-Xbox games.\nShow less"], ["Reviewed July 31, 2017", 3.0, "Cool place if you are into vintage video games", "We stopped in just to check it out and spent about 15 minutes in here. While we are not into video games, it was cool to see some arcade games and even carnival games from our past as we did see some we remembered. If you have children, I can see you spending some time here playing arcade games. I would see if you are in SF and it is raining, this could be a great activity for awhile just to get out of the rain for a bit.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Visited for an hour and enjoyed it", "We all enjoyed exploring all of the old time video games! Games are either 25 or 50 cents. Great find!"], ["Reviewed July 29, 2017", 5.0, "Hidden Gem!", "We didn't expect this place to be so fun! Bring all your quarter coins and it'll be guaranteed that you'll have fun as a little kid. This was such a pleasant surprise for our kids, but especially for us! Highly recommended!!"], ["Reviewed July 28, 2017", 5.0, "Great way to spend an hour or two with children", "Old arcade games - brought back memories and the children marvelled at our skills on simple old games!"], ["Reviewed July 28, 2017", 5.0, "Make sure to have plenty of change, you'll need it!", "Some of the machines are really impressive, a few of them are worn down and faulty. Despite all of this I'd still recommend setting aside at least one hour for this place. There's plenty of fun to be had and if you have any problems with the older machines it's possible to call for staff and get refunds.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Those old machines are so cool", "The kids had fun, the adults played like kids! Get ready to spend some money, but the history is really very cool if you just want to look around and not play the games, it can be a free attraction."], ["Reviewed July 26, 2017", 5.0, "No one wanted to leave", "This is the only thing in the Fisherman's Wharf / Pier 39 area that I can recommend because the entire area is basically one enormous tourist trap. The Musee Mecanique doesn't look like much from the outside, inside is a bit disorganized, but once you look around for a few seconds you're immediately engaged. To top it all off, there is no entrance fee and games are all reasonably priced (most are 25 cents or 50 cents). My family had 45 minutes of fun for less than $10.\n\nIf you are dreading going to Fisherman's Wharf, this could be your saving grace. One word of caution, I spotted at least one person that seemed to be looking to pick-pocket. I made sure he knew I saw him and he quickly departed. San Francisco is known for pick-pockets and this type of highly distracted, crowded, and entertaining activity creates a lot of easy targets.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Vintage entertainment", "A very cool and interesting collection of vintage mechanical entertainment machines. It's free to enter and have a look and you can play/watch the machines for some coins as well.\n\nThey also have some newer retro arcade games.\n\nThey have money change machines as well in case you don't have any coins on you.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Fun way to spend an hour", "My family of four (kids aged 10 and 12) came here after having lunch at the nearby Boudin Bakery.\n\nI got change for my $10 and we spent the next hour or so having fun with old and vintage machines. Many were silly. Most were fun. And we all had a good time.\n\nDefinitely worth a visit, even if you’re not interested in playing any games as the vintage machines are interesting to see on their own.\nShow less"], ["Reviewed July 23, 2017", 5.0, "A time before beeping", "A easily overlooked treasure at the end of Fisherman's Wharf and a fascinating reminder of an era before computers when amusement arcades bustled with the sounds of bells, whirring mechanical gears and slightly disturbing clown laughter! I'm old enough to remember some of the attractions which adds to the nostalgic enjoyment. Make sure you bring plenty of quarters!\nShow less"], ["Reviewed July 23, 2017", 3.0, "Interesting to See, Waste of Money to play.", "Thought this place would be real cool. I t had a lot of old time games mixed with newer games. Neat to see the old games. I tried to watch one of the 3-d viewers and could hardly see the pictures. Some of the machines took our quarters\nShow less"], ["Reviewed July 23, 2017", 3.0, "Kinda fun and quirky", "Spent a little time here when we first arrived in San Francisco. This building contains lots of old arcade machine which are still in working order. This is at Pier 43 1/2 which is near Boudin Sourdough, Madame Tussaud 's and Ripley's. It was worth a look and was pretty quick to go thru. Also, lots of penny smasher machines in there.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Vintage mechanical games", "This is a great place for all ages. Mechanical entertainment games that I remember growing up. From fortune tellers, player pianos, baseball games, horse racing. Funny how the cell phones were not out and people were engaged playing these old working order games."], ["Reviewed July 19, 2017", 4.0, "Fun old games!", "Nice place to spend an hour and about a million quarters (there is exchange machines inside to convert your useless bills to much more useful coins).\nMore fun than expected to try the old game machines. Free entrance, only downside it's a little crowded but not hard to find unoccupied machines to play. Would recommend a stop by if you're in the area.\nShow less"], ["Reviewed July 19, 2017", 3.0, "The machine took my qaurter", "I was hanging out to see this place. Firstly the ATM there would not accept my Travelex card and locked me out of it in which I was not happy then the machine took my quarter and didn't give me what I paid for. Not happy so we walked out disappointed.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Working History of Arcades", "A neat historical look at arcade machines from the past to recent, and best of hall they still work and the majority are in the range of a quarter."], ["Reviewed July 17, 2017", 3.0, "Cool for older kids", "We had some younger kids that were terrified in this place, but the teens thought it was kind of cool. Certainly won't hurt to take a peek inside, but we didn't find ourselves caring to stay too long. We timed out pretty quickly here."], ["Reviewed July 17, 2017", 4.0, "A real treat", "A cool stop to see the history of games, but many didn't work. There was a great deal of trash in the building as well. A word to the wise.. the games/viewers that hint about being naughty, actually are. Parents watch out.\n\nAll in all a good memory.\nShow less"], ["Reviewed July 16, 2017", 5.0, "mechanical and electrical whizardry.", "Amazing, I can still remember some of these old fashioned games of skill from my early years, I wonder what some of todays kids think of them????"], ["Reviewed July 16, 2017", 5.0, "Cheap fun on the whaef", "My youngest son and I visited here while my two older children were taking an Alcatraz cruise over the weekend and hadba blast. The Musee is part arcade part historical museum as you can play and enjoy all sorts of vintage arcade games from times gone by all for super cheap prices many costing just a quarter. The Musee is a breath of fresh air on an otherwise pricey boardwalk. I really enjoyed the many unusual arcade games. It was stepping back in time to enjoy the wonders that are grandparents might have experienced. My favorite was the arm wrestling game. My son enjoyed the old time shooting gallery. I highly recommend the Musee for parents with kids and just adults by themselves. This place will bring a smile to your face no matter your age!\nShow less"], ["Reviewed July 15, 2017", 5.0, "Fun Museum", "The entire family enjoyed this museum! So many arcade games and old machines that are still in working condition. We spent a couple of hours here and didn't even notice b/c of the amount of fun we were having."], ["Reviewed July 14, 2017", 4.0, "Nostalgic, old school fun for young and old.", "It's not every day that you can go into a museum and play with its contents, but Musee Mecanique was a fun and amusing way to take an indoor break along the pier.\nIt is free to enter, and even if you don't play anything, there are lots of arcade games and machines to reminisce on, or watch other people play. If playing, the costs are not unreasonable or expensive, with many games only asking 25 cents. Games can be single player or double players - there is a huge variety. There are change machines if you don't already have a large coin collection in your wallet that you are trying to get rid of! Therefore, you can spend anywhere from fifteen minutes browsing the area, or more than an hour playing all sorts of arcade games.\nShow less"], ["Reviewed July 14, 2017", 3.0, "overrated", "Based on other reviews, we made a stop here but were underwhelmed. It is quaint and my girls made a pressed penny, played a video game, and were creeped out by Sideshow Sally, so it wasn't a bust. :) It is not so much a museum as an arcade and the games are usually 25 to 50 cents each (not a penny). We felt like there were so many better sites to visit in the area when time in the city is short.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Amazing place", "Actually visited a while ago and forgot to rate. This place is fantastic.. I could have spent hours there and would love to go back now we have children.\n\nOnly cost is playing the games etc but we'll worth it.\n\nTold everyone to go that I know was going to San Francisco and they have all loved it too\nShow less"], ["Reviewed July 14, 2017", 5.0, "Very fun diversion on the waterfront in SF", "Admission is free; you need quarters (mostly just a quarter but in some cases, the attractions might cost 50 cents of $1). There are change machines so you don't even need to think ahead. We wandered around dropping quarters into whatever looked interesting. My brother with Down Syndrome loved the player piano (which played a variety of quite lengthy tunes) and the skee ball games. It was a fun place to drop in when we had a few extra moments between timed activities.\nShow less"], ["Reviewed July 13, 2017", 5.0, "So much fun - not expensive either!", "If you're at Fisherman's Wharf check out Musee Mecanique. It's a unique collection of old and very old games to play solo or with a friend. It's definitely kid friendly. Games are usually 25 cents or 50 cents - a few are 75 cents. They range from pac man, skeet bowling, basketball, racing cars, pinball, and almost every other arcade game you can imagine. No need to worry about quarters - they have change making machines that take bills (as little as $1 and up to $20) and give you quarters. It's fun for kids of all ages (even a grandma like me!).\nShow less"], ["Reviewed July 13, 2017", 4.0, "Worth a Visit!", "San Francisco may be expensive, but this place is anything but! They have change machines so you can get all the quarters your heart desires. Then, go to town playing some cool old school games!\n\nI loved getting to arm wrestle the machine from the Princess Diaries movie! And my husband and I both enjoyed seeing the old games you can't find anymore. In the back is where you will find the arcade games. My husband's only complaint was that they didn't have all the NeoGeo machines filled with games. Other than that though, we loved our visit here and wish we could've stayed longer!\nShow less"], ["Reviewed July 11, 2017", 4.0, "Throw Back...", "Musee Mecanique is worth a quick stop when at the San Fran waterfront. The arcade has super old games and it is fun to reminiscent on the games we played as kids. And, some games are super old (like wood and stuff). If you enjoy arcades, make a quick stop!\nShow less"], ["Reviewed July 9, 2017", 5.0, "So much fun!", "I stumbled upon the musee by accident while walking around the pier, and was not disappointed!! It is the perfect place to spend an hour playing all of the arcade games, most of which are from before 1950. I was surprised that one could play every machine there, considering they are almost historic artifacts of the past. The machines take quarters, but if you don't have any with you, there are machines that will give you change, in quarters, for bills. I consider this a must do while in the city!\nShow less"], ["Reviewed July 9, 2017", 5.0, "Kids of all ages will love a visit here", "Our family of five, kids ages 15, 12 and 9, happened upon the Musee Mecanique on our way to see the warships docked at the pier at Fisherman's Wharf. Admission to this \"museum\" is free. It consists of dozens of antique arcade machines. There were player pianos, animated scenes, ski ball, Pac Man, tests of strength and more. It was fascinating to see how the machines had changed over the years from mechanical to digital. The nicest part was that the price to activate the machines was reasonable, 25 cents for the most part, some were 50 cents. There were so many options, the kids couldn't make up their minds. Had the parking garage hourly rate not been so outrageously high, we would have spent more time there.\nShow less"], ["Reviewed July 7, 2017", 5.0, "A fun way to spend an afternoon", "I first wanted to come here because of The Princess Diaries; the scene where Julie Andrews squares off against the arm wrestling machine is my favorite. There are so many different games and machines that you can try; some are more modern than others, but they have some from the late 19th century and the early 20th which I thought was awesome. Admission is free, but the games range from 5 cents to 50 cents; there are plenty of change machines to get coins to play. It was a good time playing all the games, and I would definitely come back.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Fun, cheap entertainment!", "I read about this place on the things to do in San Francisco, so it was on my list of places to visit. We had a great time! It was cool seeing all the old games, some we've played back in the day, some before our time. Only ran across one game that didn't work, 50 cent loss, no biggie. Glad we went and definitely recommend. Free to enter, then get some quarters and have a blast! Kids and adults enjoyed this place.\nShow less"], ["Reviewed July 5, 2017", 2.0, "Disappointment", "I was hoping for a smaller venue with a chance to learn more about each machine. I would not so much call this a Musee (Museum) but an arcade. Too much jammed into a large space. Also, there were too many modern electronic machines which I feel detracted from the expectations I had. I would also have liked some history behind each piece rather than just a date. The warehouse setting was not attractive either.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Great fun!", "Definitely wouldn't have known about this place had I not watched Netflix's Girlboss- So I knew visiting was a must! It had a great atmosphere, brilliant not only for children but for adults too. Highly recommend!"], ["Reviewed July 1, 2017", 5.0, "WHAT A TRIP!!!", "This is a Bucket List adventure . . .I swear! Your head will spin seeing all the unusual arcade games and eclectic artifacts in this building. If you saw the movie \"BIG\" . . . just for the shear experience, have your fortune told."], ["Reviewed July 1, 2017", 5.0, "Loved this place", "They have a ton of old arcade style machines. Bring plenty of quarters since you will want to see what most of them do."], ["Reviewed June 29, 2017", 5.0, "Great find!", "We stumbled across this quite unexpectedly and loved it! We both enjoy arcades for the nostalgia and, even though we aren't old enough to remember these types of machines, we had a great time going round. Who needs high tech graphics and 4D?!?!"], ["Reviewed June 29, 2017", 5.0, "A \"Videogame\" blast from the past", "Older folks and even maybe the kids will get a kick out of this museum of video games from a bygone era. Most of the games are not the screen type games we think of, but rather just mechanical visual displays. Fortune tellers (like the Zoltar machine of \"Big\"), games of skill and chance and other amusements from the early part of the last century will show you what kids and adults wasted their pennies on back then.\nShow less"], ["Reviewed June 28, 2017", 5.0, "The only redemable thing in Pier 39 Go there.", "I grew up in San Francisco when I was a child this was called the Penny Arcade and located at the Sutra Bathhouses. I was always memorized by the old arcade games from the early 1900's. They all still work and this arcade is hands on. Now the games go from 1903-1980's. I'm so glad this historic arcade was saved for my kids. Take your or take yourself and relive your childhood.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Fun place to see a history of mechanical amusements.", "This place has been in movies such as the Princess Diaries so I wanted to check it out. They had a great collection of antique and more recent amusements, some dating back to early 20th century. Most cost only a quarter and they have several change machines so the you can break a few dollars to enjoy the games and other amusements. Kids and adults alike will enjoy playing the games and watching the mechanical scenes that are on display. They also have several stretch penny machines available in case you want a cheap keepsake. Great stop while visiting Fisherman's Wharf in San Francisco.\nShow less"], ["Reviewed June 27, 2017", 3.0, "Interesting", "As this is in a popular area it is worth a look. Lovely sunset from the pier outside and lots of quirky gizmos inside. Look out for the staff on roller-skates collecting quarters!"], ["Reviewed June 27, 2017", 4.0, "A great way to spend a couple of hours", "We ventured in to this large arcade and marvelled at some coin operated attractions we remembered from our youth. We were also fascinated by some attractions that belong to our parents childhoods. For between 1 and 4 quarters your can get a taste of amusements from time gone by. We both enjoyed our time here and children should enjoy the experience also.\nShow less"], ["Reviewed June 26, 2017", 4.0, "History and Fun", "We visited this museum 2 years ago and went again with my son who enjoyed seeing how arcade games have evolved over the years. There are many to see from years gone by and then again you will find the newer games. Don't be fooled that they are pennies to play, there are many for the most part at .25Cents and some for .50 cents.\nThere is a change machine, rest rooms across the street. It's a fun place to spend a break from sight seeing.\nShow less"], ["Reviewed June 26, 2017", 5.0, "A view to history", "Seeing 20 y old youngsters smiling, laughing and again playing with these mechanic gadgets was surprising. My three sons enjoyed the museum though they are used to their mobiles and play there. This museun was a wakeup call for the of the close past history."], ["Reviewed June 25, 2017", 5.0, "Unique bit of history", "You can see lots of old video and mechanical games. Some as old as the early 1900s and some from the early video games of the 80s. You can see some of the old early 'movies' from the early 1900s and some of the damage from the 1906 earthquake. Very unique bit of history that can't be found anywhere else.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Mechanical Museum Fun for Old & Young Alike", "I spent several hours in this museum as an artist/illustrator. The displays are entertaining - much better than present day arcades."], ["Reviewed June 20, 2017", 4.0, "The Adult Kids had a Great Time Here !!!", "Our Adult kids really enjoyed playing the retro games in this museum. They challenged each other and could have easily spent half a day."], ["Reviewed June 20, 2017", 5.0, "Unusual and Fun!", "This place is a blast! We found it here on TA and decided to visit when we were in Fisherman's Wharf! They have a great collection of old school games and many are just a quarter! Really a fun place to explore and play!"], ["Reviewed June 19, 2017", 5.0, "Super Cool", "This was really so super cool. A step back in time and a great thing to show the kids. We spent at least an hour here. And yes, you need quarters. It's an arcade."], ["Reviewed June 19, 2017", 5.0, "Arcade fun!", "This arcade is a real amusement!\n\nWurlitzer one-man band/player piano reading info from punch card papers the latest and greatest addition.\n\nTons of Coin-Op machines, most are 50cents\n\nAll very fun. Take ya down memory lane.\n\nI love this place. It's my all time favorite of San Francisco\n\nYou and your kids cannot go wrong here\nShow less"], ["Reviewed June 18, 2017", 3.0, "Interesting and unique", "Hey, it's free to enter, although you might want to spend a few quarters seeing how they work. If you are into cultural history and/or machines, this is an interesting place to spend a little time."], ["Reviewed June 17, 2017", 5.0, "Loved it!", "I love old pinball machines and this place had some. I spent most of my time playing those and getting smashed pennies as I have friends and family that collect. They had to have had at least 5 pressed penny machines there. Beware that you have to go through Fisherman's Wharf to get here but it was well worth it to have my niece take a picture with the arm wrestling machine from The Princess Diaries.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Arcade from Princess Diaries", "For any Princess Diaries or gaming enthusiasts, this is a great place to go! We had a great time playing some games, and trying the hand wrestling machine that Mia and her grandmother did in the Princess Diaries movie. Games are still reasonably priced at 25 cents each. Great view from the deck right over the bay as you step outside the rear of the building, and lots of restaurants right in Fisherman's Wharf in front of the building.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Step back in time", "Who would have thought that a simple quarter could bring so much enjoyment. I do remember some of these arcade machines from my childhood, but, most of them were a new, \"old\" discovery. We spent much more time in there than we anticipated and loved it!\nShow less"], ["Reviewed June 15, 2017", 5.0, "kids will love it!", "my children, really enjoy their time in here. they would like to comeback again. I, even did enjoy my time here - just for observing the vintage game machines displayed in this place."]]}}