{"Natural History Museum of Los Angeles County": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Natural History Museum of Los Angeles County", "url": "/Attraction_Review-g32655-d103412-Reviews-Natural_History_Museum_of_Los_Angeles_County-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/47/dc/7f/natural-history-museum.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1112"}, "address": {"@type": "PostalAddress", "streetAddress": "900 Exposition Blvd Exposition Park", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90007-4057", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Wonderful for Kids", "We come from the DC area, so Smithsonian is the gold standard for museums to us, and this is right up there. The dino exhibit was extensive and impressive. We were awed by the diorama displays in the several great halls displaying native animals of the Americas. We kept thinking how much our grand kids would enjoy this place. On-site parking was $12, nice cafeteria with outside seating if you wish.\nShow less"], ["Reviewed 5 days ago", 5.0, "The Museum has a new exhibit on Tattoos that is exceptional", "\"NEW\" is not accurate but It is n'new' to me since I just visited. It is an excellent\nexhibit with all kinds of interviews with TATTOO artists from all over the world,\nplus a history of Tattoos and a section devoted to California tattoos. It is\na very large exhibit and requires your full attention and energy,\nShow less"], ["Reviewed 1 week ago", 2.0, "Not the best", "Went with my girlfriend, there wasn't much to see, the typical dinosaur and animal exhibitions,wasn't even free admission, $15 entry fee, I'll also been to the natural history of Raleigh NC which is ten times bigger than this one and soo much to see which was FREE\nShow less"], ["Reviewed 1 week ago", 5.0, "Great for families", "Science made accessible. Do you love dinosaurs? Amazing gemstones? Animals from Africa or North America presented in their natural habitats? This is the place."], ["Reviewed 3 weeks ago", 3.0, "First Fridays", "The museum just started First Fridays, a cool event featuring a rock band and dancing. The museum also had a tattoo exhibit, which was well done.\n\nThat said, I haven't seen dioramas in museums for some time. They are so dated and uninteresting.\n\nThe building is beautiful.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Dinosaurs and Tattoos", "We originally went for the Special Tattoo exhibit. What we got was so much more. The Dinosaurs were great very lifelike. I thought the History of Los Angeles was somewhat unfinished. It could be so much more, but I learned from it. The building is open an welcoming. The dioramas need a good updating. The Tattoo exhibit was a fantastic history of tribal culture up to present day. We are all in a tribe and they have beauty and they mean something. My goal was to understand face tattoos. I was so surprised what every thing meant.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "nice for dinosaurs lovers", "i love this place, where they have a variety of nice items and fossils of stuff you can not imagine, for example they have a room full of metals shaped as stones and gems. also they have many dinasours bones and whales. going there was a very nice experience and it really makes you think of what happened on this earth through the years and how WE Humans are making many animals to be in danger, although it is fun but some how sad, but it is a good reminder for all of us that we need to take care of our planet so that , we do not face a day where all the animals we know today will be part of this museum\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Not as good as others I've seen", "We went to this museum in January 2018, only a month after visiting the Denver Museum of Nature and Science. We felt that the Denver museum beat LA in all departments.\n\n- The animal dioramas in LA looked very old and dated here, whereas the Denver ones were extremely lifelike.\n- The dinosaur section in LA was good, but we had seen it all and more in Denver.\n- The section on the history of LA was very dull, with nothing to spark curiosity in my children.\n\nWhile I may have enjoyed this museum more if I had seen it first, I walked away feeling disappointed.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A very nice experience, Dinosaurs are great !!!", "I went there with my family, mostly interested on checking the fossils, found much more. The building itself is fantastic, offering great spaces and nice architecture. The exhibitions are great, very professionally displayed with a log of good information. Our favourite however were the dinosaurs fossils. It was a fantastic experience to see well preserved T-Rex fossils, among some other creatures. This is a great experience for a family or individuals, totally recommended.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Positive, Educational, and Always Relevant", "I came here with some friends, who were cheering me up following the initial shock of a major shift in my life. They know museums always cheer me up, and I had not been to the Natural History Museum in a long time. The visit brought back memories, but there had been additions and seasonal exhibits which provided a new \"spin\" to the museum trip. I would suggest, if you can, to take the Metro, since there's a train stop within short walking distance. There is parking, but it's kind of a pain, but if you're not knowledgeable, in regards to L.A. public transit, it's a logical, and convenient, option, although you might have to do some walking with that, too.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Top Quality Natural History Museum", "The Natural History Museum of Los Angeles County compares well to some of the best natural history museums and is worth a stop. They offered special ticket pricing for military families. If you live close I would recommend getting the membership. We paid a little extra for one of the special exhibits ($5 per person) but it was probably worth it. We could have easily stayed longer than 3 or 4 hours but the kids were tired eventually. There is a basic cafe but also some restaurants within walking distance. Traffic can be messy on the weekends when there is also an event at the adjacent football stadium. Checking other events before heading out would be a good choice before heading out on a Saturday or Sunday.\nShow less"], ["Reviewed January 17, 2018", 4.0, "Lots of see", "I really enjoyed the museum. The mammal, bird, and dinosaur section would be great for little kids. I personally really loved the section on the history of LA and P-22 (mountain lion). The gift shop is pretty cool too."], ["Reviewed January 15, 2018", 5.0, "Awesome!!", "This was one of the highlights of our trip to LA. The dino exhibits are incredible, some of the best I have ever seen. Would recommend to all visitors to LA, families, singles and couples. We spent about four hours in total, staff was wonderful and were more than willing to answer questions. Really neat items in the gift shop, not your typical tourist stuff. Cafeteria downstairs had a good variety of snack and lunch options plus seating outside to enjoy the great weather. We will definitely be back.\nShow less"], ["Reviewed January 15, 2018", 4.0, "A good museum, worth your time", "If you have time in LA then this museum is worth your time. It is not really big but perhaps it is als its advantage. If you don't have much time in LA then I would rather dedicate my time to the city (my opinion)"], ["Reviewed January 13, 2018", 4.0, "Good family fun!", "Always a lot of fun things to do. Enjoy walking around and seeing the sites! Kids really enjoy the gem exhibit!"], ["Reviewed January 7, 2018", 5.0, "Stumbled Upon Some Greatness", "My Fiancé and I went to visit USC campus and as we were walking around we ended up literally stumbling upon the Natural History Museum. With nothing else to do we went in, and with the very reasonable prices of $15 for general admissions and $23 for admissions plus the Tattoo exhibit (adult), we had no other choice but to go. The Tattoo exhibit was something I thoroughly enjoyed! I am a tattoo lover myself so to be able to get history on tattooing and it's origins and meanings was something unbelievable. We even learned that people had actually travelled from all over the world to see this exhibit that we got lucky to find. If you have the chance to check it out, I would highly recommend. The museum offers even more with it's extensive dinosaur fossil collection, history about Los Angeles and Hollywood and other information exhibits. But one of my favourites was definitely the gems and minerals collection, which was far superior than any other gem and mineral collection I have seen yet. To conclude, my only complaint is I wish it was bigger.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Great family expedition", "The Natural History Museum is a great way to spend an afternoon in LA with your family. It is great for families of all ages especially children with an interest in history and anthropology. They have a special collection of historical archives about LA as well. It should relate to anyone - local travelers to even international. The outdoors area is fun for small children and the adjacent rose garden is a great opportunity to just enjoy a well manicured garden. The Coliseum being right next door, offers an even greater opportunity to spend the day in the area.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great Dinosaurs", "If you love dinosaurs, it's a great place. It has tons of bones and gems and minerals. We took our 10 year old, he liked it, but not too much hands on things for him to do.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Brilliant", "This place is amazing the exhibits are really good an easy way to spend hours seeing everything.make this visit a priority you won't regret it"], ["Reviewed December 28, 2017", 5.0, "Watch for wandering dinosaurs and wild animals", "Watch for wandering dinosaurs and wild animals. The Natural History Museum is a great place to wander and explore and it is always fun to see what will be discovered at the end of each corridor. There truly are dinosaurs and wild animals. Just be on the lookout for lurking critters.\nShow less"], ["Reviewed December 26, 2017", 5.0, "A True Treasure of Los Angeles!", "In the tradition of European museums, the building is itself an architectural wonder--marble everywhere, huge hallways and giant exhibit rooms. The permanent exhibitions include an incredible gem and mineral area, a huge collection of fossils and several Halls of dioramas of various ecosystems throughout the world. And keep an eye out for the rotating exhibits--they are always unusual and worth the price of admission. This museum has a full staff of scientists that support the research mission of the institution, providing their expertise to ensure the accuracy of the exhibits.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Natural History Museum of Los Angeles", "I go here at least once a year! This museum is much greater than anything in Arizona. One of my favorite thinks are the Dinosaurs. They are unbelievable!!! They have them on both a first floor and a 2nd floor. My favorite are the Tyrannosaurus Rex. They have 4 of them, 4 different ages. So Awesome!\n\nThey have wonderful movies also! I look forward to going there again soon!\nShow less"], ["Reviewed December 3, 2017", 5.0, "Great museum for all ages", "Great museum for all ages, adults and children alike. The Taxidermy sections are very impressive. Allow 2-3 hours for a visit if it's your first time. Free admission on the first Tuesday of every month (except for July and August). You can take the expo line train, there is station right in front of the museum.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Becoming Los Angeles Exhibit is AMAZING", "This review is just for the Becoming LA Exhibit, because I became too engrossed in it to see anything else. This exhibit follows Los Angeles from just before European contact until modern day. It does an excellent job of showing the contributions of different ethnic and cultural groups to shaping the city, as well as the detrimental impact that the ever-expanding population has had on the environment and natural resources. In particular, the museum made a point to acknowledge the roles of groups such as food service workers and undocumented immigrant clothing and textile workers in present-day LA--people whose contributions are often overlooked. Glad I went!\nShow less"], ["Reviewed November 24, 2017", 3.0, "Nothing special", "I visited many natural history museums at other cities nothing is special here except the gems and minerals section . I was very disappointed as there was no luggage store to keep my bag so i had to carry it through my visit!!"], ["Reviewed November 19, 2017", 4.0, "really nice with kid", "was not expecting it to be nice especially with a toddler. went in the afternoon, it was really nice. dinosaurs and other exhibit were really nice. the animal exhibits looked very lively. even the garden to showcase self grown vegetables was nice.\nwhen coming here plan for California science center as well since parking cost 12$ and all are in the same place.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Dinosaurs!", "We went here because our son is studying Paleontology at University. We are so glad we went, it was amazing for our whole family. Admission was cheap too."], ["Reviewed November 17, 2017", 4.0, "very good museum", "They have so nice stuff in here. Nice bones and Dinosaurs. Was not to crowded. The only issue was the food was not that good."], ["Reviewed November 15, 2017", 5.0, "Dinosaurs the star of this kid friendly museum", "If you love dinosaurs then this museum is for you! From Pleosaurs to T-Rex relatives, to stegosaurus it's all here. The history of California is interesting, how people survived before irrigation, the gold rush and growth after. The rocks and crystals were cool too. Combine this with a trip to the Tar pits!\nShow less"], ["Reviewed November 8, 2017", 4.0, "Interesting Museum and collection", "Another good Natural History Museum. Nothing more then the usual Natural Museum but well worth a visit, especially the Dinosaurs Hall and the dioramas."], ["Reviewed October 30, 2017", 5.0, "Great afternoon stop", "I really enjoyed the different halls on mammals, dinosaurs, gems and minerals, and LA County history. I think I ended up spending the most time in the gems and minerals hall, but of course the dinosaurs and extinct animals halls were exciting too! We were able to see the highlights in about 1.5 hours, although I could have spent much more time going more in depth. It really has something for everyone. The gift shop wasn’t to be missed.\nShow less"], ["Reviewed October 24, 2017", 4.0, "An impressive building at Exposition Park", "Near the California Science Center, this museum has an excellent dinosaur area, as well as other exhibits. When we were there there were several docents in the dinosaur area available for questions - that was great. Other areas too, we only had time to quickly go thru the American Mammal and African Mammal rooms - reminded me ot the NYC Natural History Museum. Parking nearyby, $12 cash only.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Fantastic Experience for Young and Old!", "Space Shuttle on display...one of three in the U.S.! Aerospace history all around. Body Works now on display...awesome! All kinds of interactive exhibits and programs for kids and admission is free! Highly recommended!"], ["Reviewed October 9, 2017", 5.0, "Really nice!", "I had previously been to this museum as a kid and was eager to return as an adult. I really like this museum it is spacious and not over crowded. I’ve been to some museums were it felt like things were crammed in this is not the case here.\nEven with groups of kids visiting you didn’t feel overwhelmed and packed in.\nWe opted to do the spider pavilion too and that was an experience. It was a fear conquering experience,to an extent, for me. I wouldn’t say it was enjoyable but interesting.\nOne of the most interesting areas is the gem stones. I wouldn’t miss it if you are planning a visit. There are so many colors of rocks and gems our planet has developed.\nThere is also a large hands on type area for kids. I was quite impressed with it.\nAs a side note parking was cash only and 12 bucks.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Ageless museum.", "Previously, we went to a museum with children. Now we are visiting with grandchildren. Ageless museum. Absolutely all the exhibits are in excellent condition. Very informative and interesting."], ["Reviewed October 3, 2017", 4.0, "serves the purpose", "I have been luckily with my son 3 of these museums including London and New York City. Out of the 3 this one was the smallest in our opinion but it had its own creative parts to explore and kids and adults with enjoy. Its worth the trip for sure.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Awesome musuc, folks& food", "Great place to listen to music on first Fridays while enjoying nice drinks and food. The museum is filled w various exhibits and also permanent exhibits. Fun sleakers too and at a great price. It does get busy on weekends so 1st Fridays,are also a less crowded way to see the museum exhibitions albeit special exhiits might close early.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Worth going if you are in to dinosaurs", "I was with 2 friends and had about 2 hours to kill before going to the airport and i decided to go to this place. I guess, the best thing about this museum was the dinosaurs. Everything else was pretty okay. But then, we couldn't really explore the whole museum because we only had 2 hours!\nShow less"], ["Reviewed September 24, 2017", 5.0, "Good visit!", "This is the sister museum to the La Brea Tar Pits (according to one of the guides). Pretty common exhibits except for going through the Spider Pavillion and seeing all the orb spiders. Parking was $12."], ["Reviewed September 14, 2017", 4.0, "Nice way to spend the day", "An impressive museum with lots to see, especially if you love dinosaurs and it's history.\nPlenty of exhibits and it looks like a lot of painstaking work was involved to ensure all the details are preserved and kept well. You would need at least 2 hours to go through the halls and kids would really enjoy the interactive ways you can learn.\nShow less"], ["Reviewed September 13, 2017", 5.0, "T Rex, Oarfish, Gems, and Butterflies", "The dinosaur rooms are amazing. The rotunda has a T Rex, and the other species of dinosaurs from the largest to tiny little animals you'd never think were dinos (but your kid would know them!) are there. Fossils, megafauna, dioramas of local wildlife in additional rooms. There are gem rooms, and during the summer, a butterfly pavillion. Worth it. The rose garden is spectacular. There is a Discovery center for the kids, and an amazing garden of indigenous plant life in the back.\n\nYour ticket will also get you into the LaBrea tar pits museum in mid-city.\n\nThe California academy of science is across the mall. There is a space shuttle there.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Great for kids", "This is a very nice interactive museum and a must if your todler loves dinasours. Tjey had \"real life\" dinasour that walks around the museum, my son will treasure the memories."], ["Reviewed September 8, 2017", 4.0, "Natural History and Fun", "It's one of the older museums in Exposition Park, but has been updated and still is very interesting and educational. It's very fascinating for the young people and even for adults. It has nice exhibits that are Los Angeles centered so it puts natural history in the context of the environment we live in. There is a wealth of great exhibits, but some are getting a little dated but still interesting. The dinosaur and mammal exhibits are very good as are the gemstones. Great place to go on a hot day. Avoid going when there are football games at the Coliseum as there is no parking. However, the Metro Expo line will drop you off nearby.\nShow less"], ["Reviewed September 7, 2017", 5.0, "You Won't Regret It!", "Bring your comfortable shoes because even if you come here for a single exhibit, you will want to see all of them, which takes about 5 hours. I saw an exhibit on Extreme Mammals, then checked out the permanent exhbits on North American and African Mammals, the Gem Exhibit, the Los Angeles History Exhibit was fascinating and the Dinosaur exhbit was INCREDIBLE. There is an outdoor Natural area, a Food Court, Restrooms everywhere including an All-Gender if thats what you need, and the Museum is not modular but has an organic flow with multiple levels, open walkways so you can look down at massive Dinosaurs, unique statues and friendly staff. Parking is $12, tickets were $22 - about the same cost as a movie plus popcorn anymore.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Very good museum", "i came here originally just for the butterfly exhibit which was amazing in itself. but i decided to stay and look around the museum as well and it is amazing! there is so many thing to see and enjoy. it is worth the time and money. there are many new things to learn when visiting here.\nShow less"], ["Reviewed September 3, 2017", 4.0, "A very good spot to explore !", "It was the first thing I visited when I landed in LA. Museum was pretty cool, lots of interesting exhibitions, from evolutionary thingies to gorgeous jewelry and minerals and super nice animals , dinosaurs. Loved spending my time there !!"], ["Reviewed August 28, 2017", 3.0, "A Mixed Bag", "This museum has some really fantastic exhibits. The dinosaur halls and the gem & mineral hall are probably among the best in the world!\n\nUnfortunately, many of the other exhibits are either poorly planned or are very old, out of date, and beginning to fall apart. If you have limited time, skip the mammal halls altogether. And, don't waste your time on the marsh and rainforest portions of the bird hall.\n\nSome of the special exhibits are worthwhile even if they are a bit expensive. You'll have to make the call based on your own intellectual interests. Overall, we enjoyed the museum. But, I was disappointed that the quality of the exhibits is such a mixed bag.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Fabulous museum", "There is so much to see and of interest to all ages. Some stunning displays that just make you think of the films 'Night at the Museum'.\nJewellery vault is breathtaking. Give yourself plenty of time to go around as there is just so much to take in. Would revisit again if in LA. There was an exhibition at the time of our visit but you had to pay extra to see it, so we didn't bother but it didn't matter as just getting around the museum took us long enough. Fabulous day.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Great Museum About Animals and Evolution", "I've lived in Los Angeles all my life and have visited the Natural History Museum over the years, once when I was in grammar school, a couple of times when I was a teenager, and a few times when I was a young adult, so I visited again this summer since a number of years have elapsed. Even though the African mammal dioramas are virtually the same since childhood, I never tire of viewing it the wondrous animals. I also enjoy the dinosaur exhibits as well as the historical artifacts related to life in Los Angeles, and there is so much to see.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Unique experience, full of knowledge and fun", "I highly recommended parents to bring their children here for an educational experience full of fun and interactive. This place has so much history and displays that will WOW young and old. Must see the Gems and Minerals and of course Dinosaurs...."], ["Reviewed August 8, 2017", 5.0, "Experience The rich culture, history and art of Los Angeles", "If you are visiting LA, start at this museum and work your way through many other great ones. You will then have many many great restaurants to eat in downtown LA. Perfect for your whole family."], ["Reviewed August 8, 2017", 5.0, "Visited with 2 adults and 5 year old", "Very informative and much bigger than I remembered. Exhibits inside were great.\nButterfly pavilion was very good since it also had native plants that attract the butterflys and many curators to answer questions. The nature pathways was amazing too since a curator stopped and spent time with us pointing out various points of nature in such a fun way the five year old didn't even realize it was educational. Well worth the drive to LA and plan on going again to spend more time.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Fun!", "I visited with my family including children ages 5 - 13. We had fun and it is a great please to visit if you are in the area. The museum is clean and well laid out. We spent about three hours in the museum and thought it was plenty to take everything in. We also did the science museum the same day.\nShow less"], ["Reviewed July 28, 2017", 4.0, "A great place for anyone with a thirst for knowledge", "Even though our kid is not fluent in English, all of the exhibitions were full of interactive and informative information enough for our 9 year old to have a great time with but a little help from a grownup.\n\nA great variety of displays, but the best was the interactive section in the lower level, next to the cafeteria.\n\nIf you want the most out your visit, make sure you have plenty of time.\n\nMy only \"negative\" remark about the museum is that it closes to early. We could have stayed a lot longer :)\nShow less"], ["Reviewed July 26, 2017", 5.0, "Awesome Experience for the kids - Dinosaurs", "This attraction is great, and fair priced as well. There is a lot of great exhibits, but the kids loved the dinosaurs most of all. A lot of great taxidermy to be seen, and multiple areas for kids to interact with exhibits. Definitely worth it for kids.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Good Museum", "Ive been coming to this museum since i was little and still love it. Not as good as New York's NHM but still worth visiting"], ["Reviewed July 19, 2017", 5.0, "A Gem of a Place (Sorry about the Pun)", "If you like the Earth Sciences or just want to see a first rate Museum while in LA LA land.\nBy all means come here as you will see some fantastic stuff.\n\nWhich is housed in a very classic Edwardian Era Building. (I just love their sense of style)\nNow for some hints.\n\nIt is not in the best of neighborhoods. So leave before Sunset and lock you car and keep a weather eye on your stuff.\n\nThere are panhandlers and Homeless around\n\nParking is easy and not too expensive.\n\nThere is a lot of fast food places on Figueroa St\n\nUSC is next door.\n\nIt gets very hot here during the Summer and early Fall. So dress accordingly.\n\nThere is a fair amount of walking so wear comfortable shoes.\n\nWhen its hot make sure that you keep your fluids up. As LA has a dry heat which will suck the water out of you w/o noticing it.\nShow less"], ["Reviewed July 11, 2017", 5.0, "A Gem of a Museum", "I recently visited the Museum with my daughter, son-in-law and 18 month old grandson. My grandson w delighted with the animal dioramas and we all enjoyed the gems, dinosaurs and special exhibits."], ["Reviewed July 10, 2017", 4.0, "What a fun day.", "An excellent way to beat the summer heat & enjoy family time. The virtual reality part of the museum is definitely a big hit with the teenager in the family. The animal & dinosaur exhibits are a hit with the toddlers. Do not touch the butterflies if you go to that exhibit.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Sunday, June 11th visit.", "I visited June 11th, arriving around noon. It was my last full day in LA and did not have anything planned. So this worked out great, using the Metro rail from my hotel near Vermont and Sunset. The Metro stops at the NHM. I bought my ticket at the small out building located between the Metro rail and the museum itself. The NHM did not seem too busy while I was there. I believe I saw everything in the museum to see that was free with your paid admission. I really enjoyed all of the Dinosaur exhibits. The Gems and Minerals exhibit was also very cool. As much as I liked those exhibits, I wasn't blown away by the museum. I grew up with the Milwaukee Public Museum and maybe its just hometown prejudice, but I love that museum a whole lot more. The cost to get in the NHM was very fair. I just do not think I would return for another visit.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Wonderful Experience!", "Their dinosaur was impressive. We did not think we would enjoy it that much. What really floored with the gem and mineral display! Absolutely amazing and a must see"], ["Reviewed July 9, 2017", 3.0, "Ok....", "There's some very good quality displays but it could be so much more interactive, especially for younger kids. Too much to read and not enough buttons to press. This isn't in the same league as somewhere like the Natural History Museum in London, or even Liverpool Museum. Personally I don't see this as a must visit unless your kids are desperate to see some dinosaurs and even then I would just plan for an hour at the museum.\nShow less"], ["Reviewed July 8, 2017", 5.0, "This place is great, You will learn something and the staff is nice.", "Of all the Museums in the LA area I like this and the LA Brea Tar Pits, ( Like La Brea more when Will Wrights ice cream was nearby)\n\nThis place is huge and easy to walk around- You will walk or if you have a wheelchair if big enough where you have alot of room. The exhibits are great and change once in a while. I used to be a member when I lived in LA. They had lots of extras when you are a member, the cost is not much, its air conditioned. Young and old enjoy this place.\n\nLots to see and do, You can take breaks as well. parking is close. its close to a few different Museums as well. But you could spend a day in side if you take the time and read what they are telling you.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Great spot if you are into natural history - very good", "This was a surprise, it is as good in many respect as better known museums (e.g. the Smithsonian) and because it has fewer people it is more engaging. Some very good displays that are well done. A bit of a hidden gem, well worth seeing."], ["Reviewed July 3, 2017", 4.0, "Fun", "This museum is super fun. So many things to see. I will start with the bad first. It was super crowded. It was a Sunday, so my own fault. I highly suggest buying tickets online. The line for tickets was about a 30 minute wait. We bought tickets online. If you do that, there is no line. You walk right up, scan your ticket, and go in. Definetly worth it. But, it ONLY let us use a mastercard online. There was no other option.\n\nParking was 12 dollars. Yikes! I'm not sure it was part of the museum, or general parking. But we could not find any other nearby parking.\n\nThat's it. No other complaints. Staff was all super friendly, and helpful.\n\nMany exhibits to see. Very interesting stuff. They have a couple exhibits you have to pay extra for, that are there limited time. We decided to do the butterfly pavillion. Only 5 extra bucks per person. SO worth it! It's magical to see and feel the butterflies all around. Some had broken wings, from rude people touching them. One landed on my purse. They have a soft paintbrush, that gently removes them. PLEASE DON'T TOUCH THEM! Amazing experience. Watch your kids. Don't ruin something beautiful.\n\nThe museum has a lovely garden outside, with tons of flowers, and a beautiful little pond with a waterfall, and dozens of dragonflies all around. Pretty neat.\n\nThe dinosaur bones, and all the other animal bones were amazing. Beaitiful and magestic. Very educational. There are 3 levels. They alao have elevators, for those who can't do stairs.\n\nA couple of gift shops. Kinda pricey. A water, candybar, shot glass and post card came to 19 dollars. The candy alone was 7 bucks. Lol\n\nThey have a cafeteria downstairs. Lots of food and drinks. Pizza and salads. A good size menu. We just got some drinks and a bag of chips.\nShow less"], ["Reviewed June 30, 2017", 4.0, "All about those dinosaurs!", "This is a very good natural history museum. Entrance fee was reasonable (though not free, unlike in the UK...boo!). The dinosaur section is excellent with all of the star attractions including T-Rex and Triceratops. We found the African animals section interesting too. A great way to spend a few hours in LA.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Interesting museum", "We spent a really interesting 4 hours here, but could have stayed longer.\n\nWe started in the butterfly pavilion (which was an additional cost) which was OK but felt that the pavilion was not big enough for the butterflies- the ones we saw were beautiful and was given a card to identify them.\n\nThe dinosaur, mammal and gem displays were really good. Although the mammal displays did remind me of the Night at the Museum\n\nThere is also a nature garden where we had our packed lunch but they do have a nice cafe which had a range of food including gluten free!\n\nWorth a visit for both adults and children with plenty to do for the day and at $12 entry (without any of the extras) is good value for money.\n\nIf you fancy doing a museum fest the science museum is a 5 minute walk\n\nCan be accessed on the metro - on the new expo line\nShow less"], ["Reviewed June 25, 2017", 4.0, "Pleasant few hours", "The Natural History Museum of Los Angeles County is certainly worth a visit. Expect to invest several hours touring the mostly excellent exhibits. The Special Exhibit on Extreme Mammals is particularly interesting. The Gem & Mineral Hall is also interesting. The dioramas of North American Mammals are equal (if not superior) to those found in the American Museum of Nature History in New York City.\nShow less"], ["Reviewed June 17, 2017", 5.0, "Love Dinosaurs?? This Is A MUST SEE!!", "Okay, we only ended up going here because our other plans got derailed, but man, oh man, I am SO THANKFUL we chose to do this! Had I known how incredible this museum is, I would have had it on our original itinerary! Dinosaurs... loads and loads of actual dino bones, skeletons, and more dino facts than you ever cared to know! Not to mention, tons of history, dioramas that rival those in New York's American Museum of Natural History!! And one of the most extensive geology and gemstone exhibits I have ever seen! We were there for three hours and didn't even see half of what this place had to offer. Believe me when I say, your kids will LOVE it. :) In fact, it's great for all ages!\nOh, and they have a pretty awesome cafe inside and several gift shops with some really cool souvenirs.\nShow less"], ["Reviewed June 2, 2017", 4.0, "Spent four hours here with 13yo", "We spent 4 hours here and almost saw everything on exhibit...almost.\n\nThere dinosaurs and the gem displays were really wonderful. Too often I find that museums never answer my questions about exhibits. Here, I found myself repeatedly asking myself a question and then turning the corner to find the answer. For example, have you ever wondered why there are no flying marsupials? Did you know that there is a striped bunny? Did you know that the original depictions of T Rexs were wrong because they have the dinos dragging their tail? Want to know how they realized this? Go to the museum!!! Have you ever wanted to touch polar bear fur? Go to the museum!!!\nShow less"], ["Reviewed June 2, 2017", 5.0, "Absolutely worth a visit", "This museum is located next to the Science Centre and the African American museum. It is a majestic building and although entry is not free ($12 US per adult) it is absolutely worth a visit. Dinasours, birds, mammals, gems, butterfly garden and more. Free guides tours, and super interesting. Visit al three museums in a day. A big day, but worth it.\nShow less"], ["Reviewed May 24, 2017", 3.0, "Great Museum for Children", "This grand dame of the Los Angeles museum scene is emerging from a long slumber and being revitalized into an impressive interactive museum space. The enormous rock and mineral, bird, and diorama collection are still there, but now they share space with a native plant garden, a hands-on dinosaur haul, and a children's interactive room filled with insects and other critters to observe. It is so refreshing to see the space getting a new lease on life. Avoid the museum during weekday morning because of thousands of school field trips.\nShow less"], ["Reviewed May 24, 2017", 5.0, "An iconic museum well worth a long visit", "The Natural History Museum is an iconic museum well worth a long visit, built back in the days when museums were meant to inspire as well as inform -- and this one certainly does. As you go in the main entrance, almost the first thing you will see is a huge display of dinosaur skeletons, which may remind you of something you may have seen in the Jurassic Park movies. You can breeze through it if you want to, but my advice is to pay attention and allow the inspiration to sink in. Incidently, they have an on-site parking garage and a good restaurant, so you needn't worry about those things.\nShow less"], ["Reviewed May 22, 2017", 5.0, "old LA", "make sure you check out the rose gardens there are plenty of cool places in the area for a snack or lunch so all in all a very enjoyable half day Nice exhibits sometime there are cool special events, also check out CA science center nearby\nShow less"], ["Reviewed May 21, 2017", 4.0, "Butterflies!", "The museum is pretty cool, but make sure you visit the butterfly pavillion which is only open for part of the year. You get to be inside an enclosure with hundreds of butterflies. So cool!!"], ["Reviewed May 20, 2017", 5.0, "Great", "Really nice Museum. You can easily spend the entire day in it. And is not expensive at all. I would recommend it."], ["Reviewed May 16, 2017", 3.0, "Wonderful Garden", "We did not buy ticket for special exhibits, so this review only applies to the standard diaramas. The bird wing is very, very dark and specimens are difficult to see. The large mammal exhibits are definitely worth the trip. I wish the birds in the African mammal exhibit were also labeled, as the lighting is much better. The garden is beautiful and specimens are labeled.\nShow less"], ["Reviewed May 14, 2017", 4.0, "Weekend visit", "If you are new to the LA and looking for things to see and do, then go here. Otherwise, do not waste you precious vacation time coming here. This place is not the NY Met, nor the Louvre museum. Getty museum is better."], ["Reviewed May 13, 2017", 5.0, "Worth visiting", "Dinosaur hall is exciting. So much information to take in. Interested also to watch paleontologists at work in the Dino Lab.\n\nThe other exhibits are very nice too. The exhibits look so real that you'd think they would move.\n\nThe nature lab was also really cool. Esp if you're visiting with children.\n\nWe planned to just stay for 45 mins to avoid traffic. But ended up staying for 2-1/2 hours.\nShow less"], ["Reviewed May 9, 2017", 4.0, "Pretty Good Place to Waste a Couple of Hours", "Had some time to kill on a business trip in LA so decided to visit a museum. Since this one was open on a Monday (many are not), I opted to stop in here.\nThe place is pretty cool. Anyone with a family would probably enjoy it more than I did, but I had a fun time. The gem collection was amazing. The history of LA section was also pretty cool and informative. The museum store was a little lacking and the price was a bit high (I am spoiled by my home town museums which are amazing with a reasonable recommended donation amount) but I would recommend stopping in if you have time.\nShow less"], ["Reviewed May 7, 2017", 4.0, "Good small museum for kids", "Nice and clean. Was easy to get around on a rainy Sunday. Fair amount of exhibits but nothing to write home about. Staff was friendly and it was convenient. I would go with small children but not as an adult."], ["Reviewed May 3, 2017", 4.0, "Small but Is nice love the gardens", "Is a great place for family or If You like nature dinosaurs stones, the gardens around are fantastic, several other museums aré in the area Is worth it 100%"], ["Reviewed May 2, 2017", 5.0, "One of the City's Great Treasures", "The Natural History Museum is one of the great treasure houses of artifacts anywhere. It's enormous, an endearing collection of traditional exhibits and state-of-the-art engagement. Great for kids and families alike. Don't miss the dino hall and the exhibit on making los angeles."], ["Reviewed April 23, 2017", 5.0, "Came for megamouth, loved bird hall!", "I can't believe that mueseums have the connotation of being boring! I had such a blast at this place! I read in a book back home that a very rare megamouth shark was housed here! (60 specimens have been sighted, most were consumed.) I went solely to see him and I was not disappointed! We also very much enjoyed the gem exhibit-so beautiful!! The bird hall was totally amazing too! I got to see a pelican and penguin species I'd probably never get to see otherwise! Of course, the dinosaur fossils are always a hit. The whole area was very spacious and internal architecture was beautiful! I also really enjoyed touching some pelts that a volunteer had brought out!\nShow less"], ["Reviewed April 15, 2017", 5.0, "Amazing Natural History Museum!", "I love natural history museums, and this one didn't disappoint. It's large, and you can easily spend the entire day there. They offer free tours that bring you around different exhibits and give you more insight. Admission isn't free, but they do offer student discounts if you're still in college. There is paid parking (it is LA after all.) Beautiful grounds that you can explore. A great place to spend a day in LA! I live in OC but my husband took me on my birthday before an Adele concert. One of the best birthdays ever! :)\nShow less"], ["Reviewed April 13, 2017", 5.0, "Never tire of this museum", "One of my favorite museums in Los Angeles. Plenty of space to walk around inside the museum and outside in the rose gardens."], ["Reviewed April 13, 2017", 5.0, "A.M.A.Z.I.N.G", "Love the animals but the life size dinosaurs skeletons were just something else! Definitely recommend.."], ["Reviewed April 10, 2017", 5.0, "Once in a lifetime opportunity", "Historically important, this a a don't miss museum. Always iconic, it is top flight with the new dinosaur exhibit. From the building itself to the incredible variety of exhibits , this is a must."], ["Reviewed April 10, 2017", 3.0, "Alright", "VR experience is recommended . Not quite a big museum but has a lot to show. Staff is very friendly ."], ["Reviewed April 6, 2017", 5.0, "Must see those dinosaur skeletons life size!", "We stayed over in LA specifically to see the dinosaur exhibit and were not disappointed! We stayed at a hotel near the airport as we were passing through and took an $18-$28 Uber ride to the museum. It opened at 9:30 am and surprised that there were no problems with traffic getting there and back and the journey was under 45 minutes each way.\n\nIt is free entry on the first Tuesday of every month. So we unexpectedly had a free entry. But to be honest it would have been better to go on a full fee day because it only costs $13 each and the place was full of school tours on the free day. However, it is a great museum and well worth the visit. You can go upstairs by elevator and see the staff working in carefully chiseling away bone from dinosaur skeletons. painstaking work with tiny pneumatic drills.\n\nWhile you are there visit the fantastic gem display it is really amazing. And the mammal display and the African Animals are very well presented.\nShow less"], ["Reviewed April 2, 2017", 5.0, "It's Huge", "Wow, I was not expecting the collection to be as big as the building. Three flors and around every corner We found some sting new. We with teen aged boys, they had a blast, over three hours in the museum."], ["Reviewed March 31, 2017", 5.0, "Cool place for events- weddings, proms, and just to visit..", "I have catered many proms and weddings at this venue.. it is so interesting.. it is great to visit with the kids as well, and to bring out of town visitors .. it is close to the California Science center and the Imax theater, so you can make a whole day of adventure out of it- I love this place..you will see all of the prehistoric animals and dinosaurs..great fun for taking photos.. I love catering weddings and proms here- it is so much fun ..\nShow less"], ["Reviewed March 30, 2017", 5.0, "Plan to join a free museum tour", "You will learn lots more background stories from the guide about the exhibits. Did a father-and-son trip as my daughter was not feeling well. My teen son enjoyed the trip thoroughly. The dinosaur exhibits alone are worth the time to visit this enormous place."], ["Reviewed March 28, 2017", 4.0, "Impressive dinosaur and mammal displays. Reasonably priced", "My kid loves the dinosaur so we had to bring her to see the fossils. The displays and museum's works are impressive, housed in a beautiful building. Price is very reasonable too compared to San Diego's natural history museum."], ["Reviewed March 22, 2017", 5.0, "Excellent for families", "A top notch museum with lots of dinosaur displays, gems, rocks, wildlife and special exhibitions like the Chinese Emperor Warriors. The special exhibits have a surcharge."], ["Reviewed March 21, 2017", 4.0, "Enjoyable place for the kids", "We visited this museum on a Saturday afternoon. Since we arrived around 2pm, we found parking quite far. Paid $12 for parking.\n\nThe entrance cost to the museum is very reasonable.\n\nOur 6yr old thoroughly enjoyed the whole museum, for us adults we specifically enjoyed the gem n mineral exhibit.\n\nIt's a great place for educational purposes for kids. From an adult perspective, I've been to more interesting and intriguing museums in other cities.\nShow less"], ["Reviewed March 18, 2017", 5.0, "Wife and Son's first visit to a major museum", "It was my wife and son's first visit to a major museum and they really enjoyed themselves. It was my first visit since I was a younger child and it felt great to be like a little kid again. The gem and mineral section was huge and impressive. I couldn't believe how many samples were out on display. I bought my son his first rock collection and I hope it is the start of his interest in gems and minerals. The dinosaur section was impressive and informative. Too bad the insect section wasn't bigger, the bird section made up for it. Had a blast and it was definitely educational for my seven year old son, as well as my wife and I.\nShow less"], ["Reviewed March 16, 2017", 5.0, "A gem of a find for an out of towner", "This was a surprising find for us and we only found out about it because of the combo ticket deal with Aquarium of the Pacific. This was an amazing museum and made the perfect day for my marine and dinosaur obsessed son.\n\nThe displays were impressive and I even enjoyed them (even though dinosaurs bore me). They have more than just dinosaurs and the building itself is impressive and a piece of stunning art.\n\nParking is available for $12 cash (I sensed a $12 parking theme in LA).\nShow less"], ["Reviewed March 15, 2017", 5.0, "Great Museum and Beautiful Building", "If you're looking for something to do inside, this would be a great choice. It literally took us all day to visit.\n\nThe dinosaur exhibit was excellent and also very informative. The gems and mineral section was my second favorite as I am a rock collector. My husband, sister, and I were able to find some minerals that were even from our home town in Michigan. The human evolution exhibit was also very very interesting. The exhibit that I was not excited about at first, but that I found to be really entertaining was the local history part. It talks about previous populations of LA, local people, etc.\n\nThe museum is in an excellent location. It is within walking distance to several fast food areas and parking is right across the street. It's also right across from USCs football stadium, if you are a sports fan. There is a very nice little garden area you can walk around in. There are some lemon, lime, and orange trees that are really cool to see.\nShow less"], ["Reviewed March 8, 2017", 5.0, "Great museum", "Love this museum! Parking is easy and just across the street ($12). The dinosaurs section is great and really thorough, as is the gemstones section. Docents are around to answer questions or elaborate more on exhibits. The mammal halls are really cool and the displays are detailed and lifelike. I also love the section where you can watch scientists working on dinosaur bones! They have boards telling what each person is doing. There weren't any places to sit down and have a coffee that I noticed, which would've been nice.\nShow less"], ["Reviewed March 8, 2017", 4.0, "Must see, over and over again.", "All interesting exhibits. Some are permanent, others change. Location is great, as can see other museums and, of course, the Rose Garden. Dinosaurs are great for the kids, Gems and Minerals for the grown ups!"], ["Reviewed March 6, 2017", 4.0, "Great way to spend a rainy afternoon!", "My husband and I were able to get free admission tickets as they offer free admission on the first Tuesday of the month. We reserved our tickets online. Parking was available across the street. (I believe it was $12 to park.) They have a lot of displays for dinosaurs and animals that lived in California. They also have an interesting display on the early history of Los Angeles. We walked outside and looked at the gardens. There were a few flowers in bloom but I think in a couple more weeks, it would have been much more colorful. We were there about an hour and half and pretty much saw everything.\nShow less"], ["Reviewed March 6, 2017", 5.0, "So much fun with a 3 year old", "Our three-year-old grandson had the day off from preschool, so we decided to go to the museum to see the dinosaurs. The museum is full of wonderful adventures and hand-on experiences for kids. He was most excited about the dinosaurs. The diaramas were also great.\nWe also had lunch at the cafe. The only down part was the $12.00 parking. Otherwise it was fabulous.\nShow less"], ["Reviewed March 3, 2017", 4.0, "Dinasours and other wonders of nature", "Large dinasour skeletons abound, as well as many other natural animals in exhibits. Good place to eat downstairs also. Looks like they could use some refurbishing, or more aggresive fundraising, but what is there is amazing."], ["Reviewed March 1, 2017", 4.0, "Fun, learning and dioramas!", "The grounds are beautiful! It's easy to reach by the Expo Line train. The displays are so good! I really enjoyed the visit."], ["Reviewed February 28, 2017", 5.0, "MUST SEE", "If you can't get to the one that's shown in the Night of the Museum in New York then visit this one. Great place to visit with the kids or by yourself. Learn the history of California and see some dinosaurs. I was there for the Diamond Exhibition. This was exquisite and fun to see the Gems of the world.\nShow less"], ["Reviewed February 27, 2017", 4.0, "LA County History Museum", "Considerating the competition in Southern California this Museum is a bargain at $12. It cost us $12 just to park across the street so $24 for Los Angeles is a great price. If you wanted to look at everything close you could spend all day in the Museum. It took me and my aunt 3 hours to go thru the Museum. You could also go to the California Science Center and/or LA Coliseum in the same day if you wanted to since they are right next to it.\nShow less"], ["Reviewed February 27, 2017", 5.0, "Primo!", "Wow! This NH museum is amazing & we were duly impressed. The Dinosaur Hall is, arguably, one of the best (if not the best) dinosaur exhibits we have ever had the pleasure of visiting. In addition to hundreds of fossils, there are 20 complete dinosaurs. The museum also contains excellent exhibits on mammals, insects, birds, geology (rocks, gems), – literally, something for everyone. Enjoyable & educational experience not to be missed.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Visiting Dinosaurs", "Great place to take your kids. Overall the visit was great. I would say the earlier you can make it out the better. I purchased the tickets for the museum online. The cost for a family of four was just under $40. Parking outside was $12. Overall we all enjoyed the museum.\nShow less"], ["Reviewed February 26, 2017", 3.0, "Gem and Mineral Hall makes it worthwhile", "I was a little disappointed in the NHM. The exhibits are a bit boring. With exception of the gem and mineral hall - that room is amazing and made the whole trip there worth it. I much prefer the California Science Center next door."], ["Reviewed February 23, 2017", 5.0, "There are many attractions.", "I have been here with my friends. It was my first time to visit a museum of natural history. There are many kinds of animals, dinosaurs, insects, birds and so on. You can enjoy here with very high-quality things."], ["Reviewed February 23, 2017", 5.0, "Very Good", "I've been to a number of Natural History Museum and this is up their with any of them. Very well put together displays, lots of variance (from the history of California, to the dinosaurs), and very helpful staff. A staff member approached me while I was perusing the dinosaur exhibit and asked me if I had any questions which I did. She was helpful and pointed out other exhibits to me that were relevant to my question.\n\nI combined this with the nearby Science Center, it's a busy day but doable (perhaps take a break between for lunch). I did this museum second and it was much quieter and more pleasant, in terms of numbers of people and school groups, though both museums are fantastic.\n\nThis museum is worth the admission though to get the most out of it, I'd suggest looking into their daily schedule and taking one of the free tours offered throughout the day. My tour guide was friendly and knowledgable and made for a more sociable visit, given that I was attending on my own.\nShow less"], ["Reviewed February 21, 2017", 5.0, "Great place to visit", "You can learn a lot, you will spend all day here and kids will ask you to come back tomorrow... Very good exposition!"], ["Reviewed February 16, 2017", 3.0, "Nice enough", "Some of the art pieces were interesting. The place wasnt crowded also. Not that great a museum one expects."], ["Reviewed February 14, 2017", 5.0, "Great family activity", "We took three young children to look at the dinosaur exhibits, including an effective live show. The only difficulty was having enough time to see everything."], ["Reviewed February 14, 2017", 5.0, "General Science Exhibits", "An amazing day trip for students & their families! Certainly covers all areas of Science Curriculum as well as California History."], ["Reviewed February 13, 2017", 5.0, "Lovely visit", "from the spiders in the greenhouse to getting to see a whole room full of precious gems then of course the dinosaurs.\nI'm a history and science nut so I could and did spend all day here.\nwith the mummy exhibit we saw last time was permanent\nShow less"], ["Reviewed February 13, 2017", 5.0, "My kids loved!", "We spend all day at this museum, because my kids like so much that the day ended up and we were there yet!!"], ["Reviewed February 8, 2017", 4.0, "fossils coming to life", "This was a place which attracted me, maybe because I love the move \"Night at the museum\" and I must say that this was most educational visit from my time in LA.\n\nWe arrived in late morning and planned only to spend about 2 hours at the museum. In the end, we spent over 3 hours at this place. We should have allocated more time for this place.\n\nFirst and foremost, it has an impressive collection of fossils and life size replicates of animals. This allowed us to have a better comprehension in terms of size, colours and even textures of the animals. The only way to outdo this is by going to the zoo. But with a number of these animals already extinct, this was probably the best way to get to know them.\n\nWe were served by a most knowledgeable and passionate volunteer. Nothing quite beats real live narration (with a passion). I will like to thank the \"senior\" volunteers for your passionate sharing and concern shown for our environment. This set a great example for our young kids. Though some of them may be too young to fully understand the \"continental drift\" but they definitely have caught some of the passion to co-exist responsibly after these interactions.\n\nDue to time limitations, we could not spend too much time to understand about the history of the land and headed for the Gems showcase. It was an impressive and wide collection of gems from different parts of the earth. I am also \"touched\" by the few families who have \"donated\" their collections for public viewing.\n\n3 hours went by in a flash and we had to leave without visiting the other rooms.\n\nNatural History Museum, please keep up the great work and know that you have left a great impression on us.\nShow less"], ["Reviewed February 4, 2017", 4.0, "See the dinosaur skeletons!", "My boys always have loved dinosaurs and so do I! Great to share the dinosaur memories and other great exhibitions of fauna and minerals."], ["Reviewed February 1, 2017", 4.0, "Dinosaur bones are the things to see", "Went on Free Museum Day in January. The place was packed. Recommend going to the museum website and getting tickets in advance, whether it is a free museum day or not.\n\nThe highlight is seeing the different dinosaur bones. My five year old was impressed by the size of the fossils. Also impressive were the dioramas of mammals. Some of the exhibits, particularly in the dinosaur section, now have interactive video screens for information.\n\nAlso outside the museum is a nice garden to walk around.\n\nIf you want to save some parking money, there is a lot for $2 per hour across from the Memorial Coliseum, adjacent to a soccer field. On the day I went, the machine only took coins. The lot is about an 8-10 minute walk from the museum.\nShow less"], ["Reviewed January 31, 2017", 4.0, "Great Day", "The kids and I had a great time at the Los Angeles Natural History Museum. More exhibits than time permits for in one day!"], ["Reviewed January 31, 2017", 5.0, "Great Museum", "Great museum, with a variety of displays. Staff were very good and full of information when asked. There is plenty to see and the dinosaur exhibit is particularily good. Great place to spend a few hours."], ["Reviewed January 27, 2017", 5.0, "Awesome", "Well worth a visit with lots of interesting exhibits. We loved the gemstone exhibit and the layout of the animal exhibits."], ["Reviewed January 23, 2017", 5.0, "Just GO!", "It's a fun stop for families and locals alike. Be sure to also check out the California Science Center while you're there."], ["Reviewed January 22, 2017", 5.0, "GREAT INFO AND DISPLAYS IN THE DINO HALL", "We spent all our time checking out the dinosaur displays and the mammal section. Excellent presentation with some superb interactive screens. A real bonus are the great 'docents' wandering around with a ton of knowledge.\nReally enjoyed our time even though it was pretty busy with all the family's there on a Sunday morning.\nShow less"], ["Reviewed January 19, 2017", 5.0, "Great for kids..", "and adult as well :) This is a wonderful place to take in the diversity of animal life around the world and across time. We spend there all day from early morning till the Museum close the door… highly recommended"], ["Reviewed January 18, 2017", 4.0, "It was a great visit with the Endevour being shown", "We went to visit the museum specially to see the Endevour Spaceship.\nIt was a great decision as we had a really good time and learned a lot. The place was full of children, still we had a guide who shared lots of amazing details and facts about the exhibition.\nShow less"], ["Reviewed January 17, 2017", 5.0, "Good times at NHM-LA", "We enjoyed our visit to NHM over this past weekend. I took my 11 year old and my mom, husband & I. We all had a blast; I mostly enjoyed reminiscing from the times I had visited in my younger years. First time for my son & husband and they really wanted to see every corner, every exhibit. I would mention, we have a pass we can come back anytime. I still went along with all the exploring and got me exercise for the day too. I highly recommend this place for all ages; of you're in LA it's got a lot of history to see.\nShow less"], ["Reviewed January 16, 2017", 5.0, "All ages will enjoy!!!", "We had a great time! There was a school tour going on that day, but we still had a good time and the attendants were very helpful in guiding us throughout the museum. The dinosaurs exhibit was amazing!!!!!!! And of course DIAMONDS are a girls best friend:). Adults, teens and children alike will truly enjoy themselves and learn at the same time! It's a MUST!!!!\nShow less"], ["Reviewed January 12, 2017", 5.0, "Something for all ages!", "I been visiting the museum off and on for 2 years I live in Fla and seems this is a must on my list. My curiosity is on a high level. The spider exhibit was interesting to see Mr.spider doing what comes natural. The diamond exhibit was disappointing just 2 pieces but yes a pink diamond are rare . But the gem collection is excellent to wonder through. The nature lab is great. I was noticing how the kids were reacting. The NHM has excellent hands on for them with plenty of staff standing by to teach and show why it happens. The Dino exhibit I got to say is one of best in country. I visited all over the country and learned so much from NHM. My favorite is a fossil of Dino skin on wall exhibit. Of course T Rex shows himself too over your shoulder.. So if your in LA don't miss this. This museum shows what our world is about old and present and a look at what maybe the future. Doesn't matter if your young or old something for everyone.\nShow less"], ["Reviewed January 9, 2017", 4.0, "Likewise NY Museum", "I love US museums! this is likewise NY Natural History Museum (in a smaller scale, but still worth the visit) Dinossaurs and there are scientists working on dinossaurs bones in front of you"], ["Reviewed January 9, 2017", 3.0, "I was bored", "I love this kind of museums and try to find and visit them everywhere. So I have enough experience to compare with. Believe me, this museum is pretty good, but, frankly, I'd never call it 'must see\" place in LA. The building is beautiful, but inside you find lack of interactive exhibits and old stuffed animals.\nShow less"], ["Reviewed January 8, 2017", 3.0, "Great for dinosaurs", "This is a world class museum for dinosaurs and the dioramas were amazing! The layout was somewhat confusing and hard to navigate. Well worth a visit."], ["Reviewed January 6, 2017", 4.0, "Interesting, but in need of a refresh", "This museum has some great exhibits, but feels a little disjointed and could do with some decorating and some maintenance on some of the exhibits.\n\nHas the potential to be great museum, as they have shown with the layout of the dinosaur exhibition which feels clean and modern. Some of the other exhibitions such as the animals of America or the Birds exhibition could really do with some cleaning and brightening.\nShow less"], ["Reviewed January 1, 2017", 5.0, "Great Museum", "I've been to museums across North America and this is one of the better ones. Would highly recommend it."], ["Reviewed December 27, 2016", 3.0, "Stale museum", "Putting a small exhibit on the history of human evolution in a corner at the back of the museum is shameful. This museum can't compare with natural history museums in Chicago, Washington DC, and New York City."], ["Reviewed December 23, 2016", 4.0, "Fun, learning experience for 1/2 day family visit with kids", "We really enjoyed our 1/2 day visit to the museum with kids. The \"stuffed\" animals were an interesting (historical) way too to learn about different animals. The exhibit on \"dinosaurs\" and \"evolution\" was great (and we adults could have spent the full day viewing all of the exhibits)\nShow less"], ["Reviewed December 14, 2016", 5.0, "Interactive amusement", "I loved this museum because you can find more than history in every corner. With their interactive activities for children and grown-ups you get amazed of how much you can still learn about history. A pair of comfortable shoes and you´re on!"], ["Reviewed December 14, 2016", 5.0, "Dinosaurs!", "A great place to bring children. Would be great if there's an audio tour as well. We didn't stay for the guided tour at 2pm so couldn't comment.\nShow less"], ["Reviewed December 12, 2016", 5.0, "Great museum for the whole family", "We had a wonderful morning at the Natural History Museum with our 3 kids. There was something for everyone to enjoy. The exhibits were interesting, educational and of very high quality. Perfect for dinosaur enthusiasts. Very easy to get to using the metro rail."], ["Reviewed December 7, 2016", 4.0, "A must see", "We had lots of fun. It was really interesting for the kids, the garden wad awesome and the butterfly pavilion wad hilarious it is worth the ticket"], ["Reviewed November 29, 2016", 4.0, "Dinosaur-tastic", "A fantastic museum for dinosaurs and fossils. The building itself is impressive and a bit of an architectural gem. The stuffed animals did however leave me cold but the dinosaurs were well worth the trip.\nShow less"], ["Reviewed November 22, 2016", 5.0, "Interesting and enjoyable", "Informative facts and displays for all ages. Aviation and space displays were among our favorites. Historical exhibits are also neat. Pretty hard to mess up nature and history, unless you're claiming that global warming will signal the end of the earth."], ["Reviewed November 21, 2016", 5.0, "Historic visit done incredibly well!", "Debated on if I wanted to visit this Museum on this trip as I had many other \"must see\" places and I am oh so glad that I put this on the list. Wonderful history presented incredibly well. Enjoyed myself and by the comments of others around me so did they. This museum has specimens that any world class museum would lust for and their collection goes on and on. You have to wonder what kind of great stuff is behind in storage? Well worth a stop and certainly worth repeat visits.\nShow less"], ["Reviewed November 16, 2016", 5.0, "Very Nice Museum", "This museum was absolutly awsome!! The displays are breath taking and set up soo damn well! I loved this place and would gladly come back to it again!!"], ["Reviewed November 9, 2016", 5.0, "Enjoyable", "We spent over four hours and really enjoyed it! We arrived immediately after they opened and found many parts of the museum all to ourselves. That seemed almost spooky but didn't see many others our entire time there. Parking was $12.\nShow less"], ["Reviewed November 9, 2016", 5.0, "Great way to spend a day in L.A.", "Many highlights including dinosuar fossils, a gem vault, local historical artifacts. Plan on spending at least three hours."], ["Reviewed November 4, 2016", 4.0, "Nice short visit", "My stepdad & I stopped here on our way back towards downtown LA from Santa Monica. We had gone on a short visit to the museum but I have to say there's a lot to see & it was a quiet visit. We had gone on a Thursday. Prices were fare and very educational.\nShow less"], ["Reviewed November 2, 2016", 4.0, "Loved the Rose Garden", "I love visiting museums. This one in Los Angeles is okay. I thought that it was a bit on the small scale in terms of their exhibits. I enjoyed learning about the different precious and semi-precioud stones found all over the world.\n\nWhen I visited, it was a weekday so it wasn't as crowded. I particularly enjoyed visiting the Rose Garden. My only complaint is that, the entry to the garden wasn't clear and there was construction happening around the garden. There were also quite a few homeless people hanging out inside and around the garden. I actually saw one homeless man giving himself a 'birdbath' at one of the drinking fountains.\n\nI still have mixed feelings as to whether I will visit again or not, especially the rose garden.\nShow less"], ["Reviewed November 2, 2016", 5.0, "Dinosaurs", "Visited NHM and Science Center in a few hours (didn't have much time). We visited the Dinosaurs hall in the Natural and the Endeavour in the Science. If you also don't have much time. At least don't miss that."], ["Reviewed November 1, 2016", 5.0, "Nice day trip by public transportation.", "We took the Metrolink and light rails/subways to get there. It is well worth the time and the walk. It is easy to get there and once there easy to get in. Get your tickets on-line to make it really a wonderful experience. We saw the dinosaur exhibit and many other exhibits as well. Food is available in an on site cafe with a variety of foods.\nShow less"], ["Reviewed October 31, 2016", 5.0, "Dinosaurs and the history of Los Angeles", "If you like dinosaurs you will love this place. The skeletons are a revelation - you can even touch some of the sample bones on the exhibit explanation plaques. There is a room where you can watch the scientists working on archeological pieces. This is an excellent museum for children with lots of interactive displays. We also enjoyed the Los Angeles city history section.\nShow less"], ["Reviewed October 25, 2016", 5.0, "Excellent museum with amazing exhibits", "This museum is really a gem. Several floors with wonderful exhibits that have descriptive plaques that are easy for adults and children to read and learn from. The docents are friendly and informative as well. Great areas for young children (and adults) to 'touch' and learn. Definitely a must see when in LA\nShow less"], ["Reviewed October 21, 2016", 5.0, "Dinosaur Central", "I spent a few delightful hours here on a week day. The animal dioramas were well done and the dinosaur exhibits were amazing. They do a great job with timelines and putting these animals into context and perspective. It's pretty cool to be able to watch scientists actually working on the bones.\n\nDon't miss the mineral, gemstones and the gem vault! The docent outside that exhibit was very enthusiastic about her interest and had good stories to tell about many of the rocks. I also enjoyed the insect room.\n\nFun place for adults and kids. A must see for dinosaur fans.\nShow less"], ["Reviewed October 21, 2016", 5.0, "\"We have a T-Rex...\"", "Having never seen a Tyrannosaurus Rex skeleton, this was a real treat, and they had several. This was the primary motivation for our visit - and it was completely worth it, in itself, let alone for all of the other exhibits."], ["Reviewed October 17, 2016", 4.0, "Good place even for teenager.", "My teenager was surprised by the latest exhibition. They found it appealed to their many senses. It was enough to keep them interested."], ["Reviewed October 17, 2016", 5.0, "FANTASTIC family activity for the money!", "Woolly Mammoths! Tigers! Snakes! Jungles! DINOSAURS!!!! This Museum had a lot of everything that the kids loved, and the price (especially for the LA area attractions) was very inexpensive. This is a MUST for young children in school. Our kids still talk about it. Great educational experience. Really, you can't go wrong choosing to come here.\nShow less"], ["Reviewed October 17, 2016", 5.0, "Great place", "Had fun looking at all the history stuff. They have a little bit if everything to look at. Great times"], ["Reviewed October 17, 2016", 4.0, "Lots of interesting stuff for small children", "I regularly go with my 3 yr old granddaughter and there's lots to see that she can relate too. Dinosaurs, especially (go on Thursdays for this). When she needs to burn off energy, there are lots of stairs and wide open exhibits. The food in the basement is better than most.\nShow less"], ["Reviewed October 17, 2016", 5.0, "Great museum!!", "This museum was great! There was a lot to see and several rooms to go into. My daughter has always been into dinosaurs so she was thrilled to see all the displays and read about all of them. They had a cute little gift shop too. The traffic in Los Angeles is awful so it was a pain to get to but other than that, really enjoyable!\nShow less"], ["Reviewed October 16, 2016", 5.0, "Over 100 years", "This is a family favorite for three generations. NO ONE is bored, ever. From beautiful, drought resistant, child friendly gardens to gigantic dinosaur bones to delicate, living butterflies and phenomenal geological gem displays, the Natural History Museum is an all star destination!"], ["Reviewed October 4, 2016", 5.0, "Amazing place", "We've been here several times with the kids. And every time it is a great family experience. All the bones and dinosaurs and animal replicas are awesome, even for me as an adult. We bought the annual membership so we can go a few times a year. And the whole family loves it.\nShow less"], ["Reviewed October 1, 2016", 5.0, "Endeavor was worth the visit!", "I went just to go see the space shuttle Endeavor! That was worth the trip! It cost only $2 just to that which was worth it! The museum is donation entry and is worth giving too! Great place to bring your kids to have fun for a couple of hours for sure! The parking was my only issue.. They only take CASH!! :/. Finding an ATM is rough in the area so bring cash. One of my best stops in the week to LA!!!\nShow less"], ["Reviewed October 1, 2016", 5.0, "GREAT FACILITY THAT TAKES SEVERAL VISITSWe wenet a c", "We went a couple of times over the last two weeks and really enjoyed the diverse and well presented exhibits. I think there is something for everyone in this great facility and add to that the special displays they rotate through such as the Butterfly pavillion and the Pterasaurs. Allow at least 3-4 hours. Take a break at the cafeteria and enjoy the outside gardens.\nThe staff are excellent, Very friendly and full of knowledge. Great for all ages\nShow less"], ["Reviewed September 29, 2016", 5.0, "Must visit!", "Great place to bring your family. Kids would love this place. Don't get freaked out by some of the exhibits though. Parking is a pain, but once you get inside it's worth it."], ["Reviewed September 22, 2016", 5.0, "A GREAT place......", "We went to the museum mainly to see the space shuttle. We went on a day that they offered free admission so not sure the cost......but I'd pay next time for sure. We spent about 4 hours total walking through the museum but we spent a good amount just with the shuttle. The ship is huge and very cool to see in person. A world class place.\nShow less"], ["Reviewed September 19, 2016", 5.0, "Gorgeous Space", "Now this is a classic building with beautiful architecture. If you're new to Los Angeles, check this out! The moment you walk in, you're in front of a t-rex skeleton! Such an impressive site! There's a newly constructed cafe down stairs, a lot of fun interactive displays for kids and a rose garden to stroll when you're tired. The Natural History Museum is a fun afternoon getaway from the rigors of Los Angeles!\nShow less"], ["Reviewed September 17, 2016", 5.0, "Dino-Mite!", "Amazing collection of dinosaurs, mammals, and a ton of birds. Cafe is reasonable priced, good parking at the science center. Excellent exhibit on rocks, minerals, and Mayan and Inca treasures. Great historical look at LA. A great family activity!"], ["Reviewed September 16, 2016", 5.0, "Incredible Specimens On Display!", "My friend and I decided to visit the Natural History Museum since I had not been there since the 1980's and I must say this is the best museum in Los Angeles. If you love animals, or dinosaurs, or birds, or are curious about the flora and fauna from North America or Africa, you simply have to visit this amazing place. This is the finest collection of preserved and taxidermy specimens that you will find anywhere in the world. YES, anywhere. There is also the most stunning collection of dinosaur foils, and a collection of gems and minerals that will literally take your breath away. If you are an adult, be aware that from time to time you will encounter loud, rowdy, and excited children of various ages so be prepared for that! If you are a parent this is a great place to take your kids to show them amazing sights from the natural world. The museum is open daily from 9:00 to 5:30 pm and you will need at least four hours there to make a stab at seeing everything. There is a place to grab lunch, and various gift shops to grab some trinkets to remember your visit with. Parking near by will cost you $12.00 and admission for adults is $12.00 and small children get in free! You can take all the photos that your heart desires and you will be blown away at the amazing sights you will see at this amazing Los Angeles landmark. If you are visiting the area put this on your list of things to see and do! You will love your visit! Also if you have a background in biology, THIS IS THE PLACE!\nShow less"], ["Reviewed September 13, 2016", 5.0, "Educational and Fun for all ages", "This place is huge and has a variation of collections. There is a rose garden outside that provides a nice scene for a stroll. The exhibits are well put together and stagger the imagination. They have everything from dinosaur skeletons to a precious stone collection, to a collection of birds and some hands on rooms for children to play and touch.\nShow less"], ["Reviewed September 12, 2016", 5.0, "Wonders from our past", "We loved the exhibits at the museum. Wow the Dinosaurs,I've never seen anything like it.well worth a visit."], ["Reviewed September 10, 2016", 4.0, "Pterosaurs and friends. ...", "My son loves the exhibit of the pterosaurs. The simulation was so fun. ...(Fyi. ... the pterosaurs exhibit has a extra payment . although it's Worth it. ... ) specially like the minutes videos. Learned so much from it. ...\n\nThe dinosaurs exhibit was also great. ... We met Thomas the t-rex. ...\n\nThe animals exhibit was so real and breathtaking. ... love it. ...\n\nWe have fun. ... I recommend going early. ... we went there in late afternoon so we didn't get to see all of it. ... it closed by 5pm. ...\nShow less"], ["Reviewed September 9, 2016", 4.0, "A great morning", "We decided to visit here when we learned that they had a big dinosaur exhibition. I had my 5 year old son and my teenage daughter. It was relatively cheap to enter and we paid extra for the pterodactyl exhibit.\nWe really enjoyed looking at all the dinosaurs and especially the fossils. It's not the biggest museum I've ever visited but we had a great time. The cafe had a very limited choice of food.\nWe did enjoy walking around the outside area although it's not very big.\nOf course no visit to a museum is without a visit to the gift shop. They had a good selection of gifts which ranged in price.\nI wouldn't plan on having a full day here as there's not enough to see.\nShow less"], ["Reviewed September 5, 2016", 5.0, "Paradise for Dinosaur Lovers and Children", "My family and I visited the museum. The Museum is close approximate to California Science Center, Rose Garden and The African American Museum. There were lots of Dinosaur and other fossils. They have a very impressive collection of gems there as well. The dinosaur puppet show was one of the MUST go and watch. Kids will have a chance to see Dinosaur around their height and size. The dinosaur will play with the kids and brave kids might want to feed the dinosaur. They had an interactive game in the Pterosaur exhibition hall. Kids will love catching \"Bugs\" or \"Fishes\" for the Pterosaur there. My toddler had a great time in this museum. He kept asking questions after questions about the exhibits. We realized a day wasn't sufficient for us in the museum.\nShow less"], ["Reviewed August 29, 2016", 4.0, "We love this museum", "Some amazing exhibits, including the hall of mammals, the dinosaur hall, the butterfly pavilion, bug fair, spider pavilion. The gardens are beautiful too - so much for kids to see and do."], ["Reviewed August 28, 2016", 4.0, "Lovely place to spend an afternoon", "Lovely place to spend an afternoon. If you are coming from Europe or the East Coast, do not expect this to rival with any of the big science museums you've seen before. However, it is worth a visit and the rose garden is quite pretty."], ["Reviewed August 25, 2016", 4.0, "awesome", "museums are truly amusing if you actually read the information! this museum has lots of information on dinosaurs and whales and other animals. we paid extra to have access to the pterosaurs exhibition. enjoyed that the most as there are interactive activities and documentaries to watch. and the gift shop of course couldn't leave without a gorgeous golden mug!\nShow less"], ["Reviewed August 24, 2016", 5.0, "Love", "I love museums and never get tired of visiting them. I really enjoyed the different exhibits, especially the dinosaurs. I don't know why I'm so fascinated with them but I am. The garden is very relaxing. I could sit out in it, all day. I would definitely come again.\nShow less"], ["Reviewed August 23, 2016", 5.0, "Fantastic Museum in my own city!", "I love this place. We are members and there are tons of things to do all the time...like Dino Fest, Butterfly Pavilion, etc. The volunteers there are great and now the train stops right there so you don't even have to drive. Old school meets new fun things to do Museum.\nShow less"], ["Reviewed August 22, 2016", 5.0, "AMAZING PLACE!", "I love this museum. Have been going there since I was a child. There is so much to see and the dinosaur exhibits are extraordinary. As well as the animals and gemstones. Amazing.! One tip though. If you go in the summer it is chock full with school kids. Better and quieter to go when school is in season.\nShow less"], ["Reviewed August 22, 2016", 4.0, "Nice way to pass some time", "The exhibits were interesting. I went there as I was getting bored at home. Very educational and lot of exhibits. Though I thought the natural history museum in new York was better. They had a special exhibit going on which I didn't go to though."], ["Reviewed August 22, 2016", 5.0, "Just beyond history; Super cool!", "Can offer gala time for any school kid and parents. Amazing collections. Especially the Dinosaur skeleton and the lot of life-like 3D display items of animals from around the globe. Would like to visit again soon,"], ["Reviewed August 22, 2016", 4.0, "History museum", "When in Los Angeles try to make a visit to the history museum ..it's a beautiful area ..right next to the coliseum and adjacent to the beautiful rose gardens ...spend the day learning about California history ..and walk next door to the science museum and see the space shuttle\nShow less"], ["Reviewed August 22, 2016", 5.0, "food for your mind", "The location of the place allows you enjoy the history of the country and area, welcoming staff in front desk, shop available inside, nice with kids and fruits and veg garden in the back yard open for public"], ["Reviewed August 14, 2016", 5.0, "summer nights & more", "We've been to the museum a few times this year and each visit has been a little bit different and very enriching and interesting..\n\nThe latest visit was part of their free summer nights event hosted by a local radio station and featuring food trucks, music and activities for the whole family.. We had a wonderful time!\n\nEarlier this year we went as a field trip for the early education center and the children all really enjoyed seeing the dinosaurs and the halls of exhibits.\n\nAnd even earlier this year we went as a family and took the train from Pasadena to the museum for a day trip.\n\nEvery visit has been interesting and enjoyable!\n\nBecause the museums are in the same general area as USC there are some fast food restaurants in the general area. The natural history Museum has a café near the garden area which is healthy and good. You can take the metro train from Union Station and with a couple of changes you can be at the museum before you know it.\n\nThere is a fee to enter but keep in mind that the science center next-door is free.\n\nWould we go back? Yes.\nShow less"], ["Reviewed August 13, 2016", 5.0, "World Class Natural History Museum", "The Los Angeles Natural History Museum is world class. having been a member for a couple years, I don't know why I haven't reviewed this place. I enjoy the displays, and especially the special extra temporary displays. Currently about flying dinosaurs. Well done indeed.\nSo lets take the short trip inside\nStarting with the bones, beautiful and displayed so well.\nThe dioramas are incredibly realistic and you cal feel like you are there\nThe bird collection is one that rivals any.\nThe private garden in so well maintained\nThe words to describe the quality are escaping me now.\nA wonderful asset for Los Angeles and the planet.\nGet the Annual pass and get into the Tar pits for a year too! Its a deal!\nShow less"], ["Reviewed August 7, 2016", 4.0, "One of the best Natural History Museums I have been to!", "One of the best Natural History Museums I have been to! I was always under the impression every natural (history) museum would be the same more or less. But this one is very nice. It was a broad array of animals set up in their habit, and the made it very 3D like. Dont know how else to discribe it, but it looks very real compared to other museums. Very well done. Also the gem vault is pretty awesome!\nShow less"], ["Reviewed August 4, 2016", 5.0, "Beautiful", "The grounds are what one really come for. The surrounding rose garden the historic coliseum, the ever expanding USC campus and the Olympic swimming facility. But the inside of this museum is the true gym. If you excite over architecture this building cannot be missed."], ["Reviewed August 2, 2016", 5.0, "Amazing", "Perfect for my 2 granddaughters to see the actual size of those dinosaurs! And sister in law to read about the actual LA history in the city she has been living in for 15 years!"], ["Reviewed August 1, 2016", 5.0, "Flying Reptiles from the Age of Dinosaurs", "I have no idea how many times I've visited this museum, probably the best of this type west of Chicago. This day our main objective was to see the traveling exhibit on Pterosaurs - flying reptiles often thought to be dinosaurs but really close relatives who lived at the same time.\n\nThe exhibit is a mix of full size models, some 30 feet across and some a few inches, as well and real and cast fossils, simulators, dioramas, videos, and signage to explain it all. The exhibit will only be there a few more months before traveling on.\n\nWe skipped the rest of the museum having seen it all recently, but the rest includes an excellent dinosaur hall, mammal hall, a great gems and minerals hall, birds, mammal dioramas, two halls on the history of Los Angeles, Nature Lab and Gardens, and more. While a separate institution, the Space Shuttle is a few steps away.\nShow less"], ["Reviewed July 31, 2016", 5.0, "First ime visit to the Natural History Museum of LA County", "Another name for the Natural History Museum of LA County might be Dinosaurs Galore. The large dinosaur exhibits were gigantic and simply amazing. Chatting with the knowledgeable docent enhanced our visit. In addition, the halls of vintage animal dioramas were full of artistry in scenery and taxidermy. An assortment of other natural history collections and exhibits were fascinating. Combo tickets are offered to see the NHMOLAC and La Brea Tar Pits. If visiting both, I suggest seeing the tar pits/tar pit museum as a preview before visiting the larger natural history museum. As we were short on time, we parked at the flat rate $12 parking lot across from the museum.\nShow less"], ["Reviewed July 30, 2016", 5.0, "The building of knowledge", "I as a child only visited this museum twice. Those two times stuck in my head as one of the most happy moments in my life. This was my first museum and I never knew you can get so much info from a building. Now as an adult I really appreciate the purpose as a museum, to make memories. I always recommend the Gem exhibit many gems, minerals and just about anything we dig up. Obviously the dinosaurs are what the kids come to. Also the new history of LA exhibit is full of new facts I never knew of my hometown. I can't wait to bring my children to make these awesome memories.\nShow less"], ["Reviewed July 25, 2016", 4.0, "Natural History Museum Visit", "We had a small group of relatives and friends. Age group from 10 to 50. We had a married couple and single adult as well as teens. The exhibits were very educational and interesting. We loved it and will go again."], ["Reviewed July 25, 2016", 4.0, "Nice museum", "We arrived in the afternoon about 2 1/2 hours before closing. We paid the extra charge for the special exhibit which was a good exhibit but we felt the admission was a little high for the quality of the exhibit. Unless you are really interested in Pterosaurs the exhibit is a bit over priced compared to the rest of the museum. The exhibit was full of new discoveries and theories about these flying creatures. The entire exhibit badically informed you that you were wrong about everything you thought you knew about Pterosaurs! Other than the impressive models there wasn't really much to keep younger children's (ages 3 and 4) attention. There weren't many actual fossils or artifacts to view, most of the exhits were replicas. The dinosaur gallery that is included in the general admission was really impressive and definitely worth a visit. We had enough time to explore the entire museum in the small amount of time we had. We really enjoyed the large animal galleries, the detail and design was beautiful! We also enjoyed the gems and stones gallery, in fact, it was one of the most extensive collections we had ever seen and may even rival that of the Field Museum of Natural History in Chicago (one of our favorites) Much to our surprise, one of our favorite galleries was the one themed to the history of LA. The museum was well laid out and very accessible. There wasn't a problem with crowds or parking. There is an additional area outside of the museum that looked like fun but we weren't able to visit that section due to time running out and the museum closing. We felt like the admission price was a good value and parking was easy and reasonably priced as well. The only thing we would have changed was to have saved the $55 it cost us to visit the Pterosaurs exhibit and spent it in the gift shop, which looked amazing but unfortunately out of our budget after spending $150 on the entire visit (admission and parking). Definitely an interesting museum if you are in LA looking for a way to spend the afternoon.\nShow less"], ["Reviewed July 22, 2016", 4.0, "Fun museum", "This museum was very expansive. It reminds me a lot of the Smithsonian Museum in Washington DC. My only suggestion is that they have more interactive things for kids. Downstairs there was a room where kids could see live bugs which was fun. I believe that was the only live exhibit.\nShow less"], ["Reviewed July 20, 2016", 5.0, "Wonderful n interesting", "A wonderful museum. There is always a interesting and informative museum. It is a great place to take children."], ["Reviewed July 18, 2016", 5.0, "Dinosaurs and so much more!", "After living on the Great Plains and having numerous mammoth skeletons to peruse in my home state, I was like a kid in a candy store when I saw the T-Rex and stegosaurus in the grand entrance of the museum. I was also a bit aprehensive about visiting because I was worried the displays would only accommodate children but I was gladly mistaken. This museum has a great display of various dinosaurs, dioramas of mammals, birds, whales, insects, artifacts, and more. The information was very interesting and presented well for both young and mature viewers. I was also impressed by the wonderful architecture of the buildings that house these displays. The museum is located on the same campus as the Olympic Coliseum and Space Shuttle Endeavour. Plan to spend most of the day in this museum alone and be sure to take a break in the nice cafe with a great patio and garden. I will definitely suggest this to my friends and family when they visit Los Angeles.\nShow less"], ["Reviewed July 16, 2016", 5.0, "Fantastic Times with the Fam", "This is a wonderful place to take in the diversity of animal life around the world and across time. My wife and I had a great time with our 7 and 11 year old boys exploring the nooks and crannies of this place. From ancient dinosaurs to regional wildlife, this place is worth at least half a day's time. Take your family!\nShow less"], ["Reviewed July 15, 2016", 5.0, "Huge Natural History Museum with so much to see", "When my family visited Los Angeles over spring break we met up my cousin and his daughter to check out the Natural History Museum of LA County. It's a huge, impressive museum with so much to see my little cousin, who is 2, got a little tuckered out and we didn't get to see all of it.\n\nThis museum reciprocates membership with other science museums, including the Kansas City Science Museum so we got in free, but if you aren't members of the museum or a reciprocal the cost is Adults $12, Seniors and Students $9, Children $5. They are open every day 9:30 -5 pm except 1/1, 7/4, Thanksgiving, and 12/25. Parking nearby did cost money too and they only took cash. They have a grill if you get hungry during your visit.\n\nWhen we first got there we checked out the dinosaur show. A lady was a scientist and she discovered live dinosaurs (huge costumed animals) with weather effects and lighting that was fun. It was pretty crowded though. Then we started wandering the halls. Much of the museum is just for looking, not interactive until the area near the store. They were halls full of hundreds of mounted birds. There was another hall full of mammals, and then some areas with reptiles and amphibians, plus of the course the amazing bones of dinosaurs. There was also a huge room full of gems and precious metals. My son was impressed with all the gold. He thought someone might try to steal it.\n\nBy the store was a discovery area. There were insects and huge blocks to make a big tower (which of course we did). The store also had some fun things. We ended up getting some dinosaur shaped cookie cutters.\n\nThis museum has lots of info on their signs and the specimens seemed to be in good condition. I hadn't been since I was a kid and was impressed upon returning many years later. This is a cool natural history museum.\nShow less"]]}}