{"Newport Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Newport Beach", "url": "/Attraction_Review-g32780-d255306-Reviews-Newport_Beach-Newport_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/56/05/19/you-can-t-really-tell.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1153"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "92660-3267", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 4.0, "Great Surf Lovely Sunsets", "Nice beach with clean sand. Many surfers like to surf here early morning till evening. There is ample parking right beside the beach and many eateries along the beach.\n\nThere is a walking path between the buildings and the sandy beach so the walk is quite pleasant without getting your shoes sandy.\n\nThere is a small fish market called the Dory Fishing Fleet Market right next to the Jetty on the beach. Signs on the market say that they've been around since 1891. It was closed on all the days when I visited perhaps they'll open after winter.\n\nSunset views over the beach are lovely.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "thumbs up", "drove here from san diego and it was very saltwater taffy touristy. also places you can sit and look out over the water and have a beer and some eats. definetly worth it"], ["Reviewed January 23, 2018", 5.0, "Great place to visit", "Great open and clean beach. Nice place for a walk, to shot photographs of the area, and to just relax and enjoy the ocean views."], ["Reviewed January 21, 2018", 5.0, "Nice Beach", "Beach is nice. It was a bit chilly so could not enjoy it as much as we would have liked to enjoy it."], ["Reviewed January 21, 2018", 4.0, "Fun", "Great place to go with the family...A lot of cool stores, Restaurants, and places to stay...Very family friendly and clean"], ["Reviewed January 16, 2018", 4.0, "Beautiful beach!", "Spent a few hours there and loved the setting as well as the relaxed atmosphere. I very much enjoyed running up and down the beach with spectacular mountains and ocean views."], ["Reviewed January 15, 2018", 5.0, "Whale, dolphin, and sea lion tour", "Spent the day...arrived at about 1000 on a Sunday in Jan...had brunch...walked around...did the aforementioned tour with east meets west adventures....what a great experience...saw a fin whale, pod of pacific white sided dolphins, and a bunch of sealions...captain nick from jersey did a great job and kept us entertained throughout....will def go again and highly recommend!\nShow less"], ["Reviewed January 13, 2018", 5.0, "beautiful", "What a gorgeous place. Take a stroll, you won't regret it. Beautiful even when the sun is not shining!"], ["Reviewed January 12, 2018", 5.0, "Still a great beach town", "I haven't been to Newport in 30 years but recently got a chance to backtrack and visit for a few days after a convention in Anaheim. Newport and Balboa are just like I remember them with slightly more expansive boardwalk activities, restaurants, low rise condos and new houses. Lots of new houses. We did our mecca visit to eat breakfast at the Beachwood near the pier, then out onto the pier, over to crystal cove beach for lunch, hiking around the tide pools and drinks then back to the crab cooker for dinner.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Great Visit", "Nice place to go, recommend going early on, you get to see a fish market, walk the pier. Nice shops along the walk. Starts to get really crowded around noon. There is paid parking, very tight areas to drive in. Very friendly area and Beautiful."], ["Reviewed December 27, 2017", 5.0, "Newport Beach is a Southern California gem.", "Beautiful residential neighborhoods, close proximity to the ocean, lots of hotels, restaurants and shopping with a friendly, welcoming vibe."], ["Reviewed December 26, 2017", 5.0, "Beautiful Beach", "First time on the west coast. Beach was beautiful. Plenty of walking trails to access the beach. Parking can be difficult when there are events going on at the beach. Overall a nice place to visit"], ["Reviewed December 23, 2017", 5.0, "I love this beach!", "I spent a lot of time on this beach this past summer and autumn. It is clean and safe, and beautiful. The water is clean, and you can walk miles for exercise, plus enjoy the sunsets. Never very crowded. And can always find parking."], ["Reviewed December 21, 2017", 5.0, "Site represents Newport Beach", "Great landscape that reflects water conservation. Architecture represents a city dedicated to it's beautiful harbor and bayfront."], ["Reviewed December 19, 2017", 5.0, "Warm and Sunny", "A great beach to walk and wade IN DECEMBER! Shelling, wandering, and people watching though the beach was mostly deserted."], ["Reviewed December 11, 2017", 5.0, "Beautiful", "My most favorite beach in Southern California. I love to visit here every time I come this way. Very pretty and cleaner than some other beaches. There’s fire pit areas and also in some areas play sets for kids."], ["Reviewed December 8, 2017", 5.0, "GREAT Beach", "Great beach to visit. I was there on a Monday and was able to find FREE parking close to the beach. Good sand and enjoyed watching the surfers and body board enthusiasts for the afternoon."], ["Reviewed December 6, 2017", 5.0, "Quaint little respite along the coast", "A must see, a nice offshoot of Newport. Quaint shops and eateries. Beautifully nestled on the coastline. It reminds me of San Fransisco."], ["Reviewed November 26, 2017", 5.0, "Newport Beach", "Very nice place to visit. Beaches along the coast. Each beach had some unique look or feature. Would definitely recommend seeing the beaches."], ["Reviewed November 25, 2017", 4.0, "Great getaway location", "Great weather, beautiful scenery, great restaurants, the ocean on one side and the bay on the other. How could you go wrong here? Yes, it's expensive, but what a treat!"], ["Reviewed November 25, 2017", 5.0, "Beautiful Beach", "We spent 5 days in a house right on the sand. This beach is very clean, with great views, and wonderful waves. Very popular place to surf and we met several of the surfers. Great walking up and down this beach area. Can't wait to come back again. Beautiful sunsets and beautiful sunrises over the houses right on the waves.\nShow less"], ["Reviewed November 23, 2017", 4.0, "Newport Beach", "Newport beach is truly spectacular especially for sunset. The drive was easy, the whole area is clean and spacious. Highly recommended for family vacations."], ["Reviewed November 17, 2017", 4.0, "Lovely beach", "Lovely beach but had mounds of sand along the beach to protect the ocean as there was a spill from a greasetrap from a restaurant on the Newport Pier.\n\nClose by the Newport Beach Pier is the Balboa Pier, plus the Balboa Fun Zone, an old-school amusement park with a Ferris wheel and ocean views.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Lovely Beach", "One of the great beaches in America. The water is amazing and the people are out in force to enjoy the day. Great Sand and good public access."], ["Reviewed November 14, 2017", 4.0, "California Dreaming", "Newport Beach is an isthmus with the surf on one side and boatsman's paradise on the other with only a few streets in between. It has great shops and restaurants but surprisingly few accommodation choices. It is simply a great place to stay."], ["Reviewed November 14, 2017", 5.0, "Fantastic beach", "Soft sand, walking for miles, super safe and NO HIGHWAY to cross. What a treat. We used to stay in Huntington but the access, boardwalk, cycling options are great at Newport"], ["Reviewed November 11, 2017", 4.0, "Amazing beach!!!", "Truly an amazing beach!! If you have kids, bring tons of sand toys to make sandcastles and play in the sand. There are miles of ocean and sand to play in! The pier is great and tons of shops and restaurants surround the beach"], ["Reviewed November 10, 2017", 5.0, "Newport Beach Lighthouse", "All of the Newport Beach environment is heavenly in terms of great beauty, and it's very welcoming to visitors. The Lighthouse which stands all alone, and all by itself on top of the headland, has become that true beacon of hope which gives a renewed sense to all, including those who come here weighed down with problems of their own. But the great Lighthouse is also a symbol of guidance that still echoes those visions of the men and women, including Englishman, Captain Cook, who most truly admired this grand geological architecture along the Pacific Northwest.\n\nI took an Oceanographic class, and one of my lab assignments made me to travel the nearly 100 miles from Eugene, to the coast.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Big beach", "Really enjoyed walk on piers and beach. It is a classic Californian beach and with places to eat and drink."], ["Reviewed October 31, 2017", 4.0, "Wide, clean, soft sand beach", "This is a very clean, wide, and soft sand beach. The scenery is typical (beautiful) CA surf with pleasant breezes. The houses lining the beach range from some of the original quaint single-story beach cottages to ultra-modern mega-beach houses. Enjoyed walking a few miles down the beach. Access to the pier from the beach was a little \"fishy\" smelling.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Great beach", "This beach is fantastic. Amazing sand, great people watching, lots of surfers, great boogie boarding. We (my 9 year old daughter) and I preferred to be a 10 minute walk either north or south of the pier. If you go south there are lots more restaurants that are kid friendly just a block off the beach.\nShow less"], ["Reviewed October 23, 2017", 2.0, "Dinner after boating in harbor with friends", "Reside in Newport Beach and went to out with friends for dinner. I had suggested BlueFin sushi or Pirozzi in Corona Del Mar for dinner but we thought we would try 930 Sushi. We should have gone elsewhere"], ["Reviewed October 22, 2017", 5.0, "Beautiful beach", "Newport Beach is a stunning location, with wonderful views and full of life. When you have a clear day you can see miles up the coast in either direction."], ["Reviewed October 21, 2017", 5.0, "Great beach! Not as crowded as Huntington", "We found that Newport Beach didn’t have as many surfers but not any places to rent boogie boards. Saw plenty of bike rental places."], ["Reviewed October 19, 2017", 5.0, "Gorgeous", "We stayed in Newport Beach for 7 nights. We loved each and every moment of it. From the restaurants and bars around the place to the beach to Pavillions (the supermarket). It was the perfect location for us and we will return to holiday there again.\n\nThe beach was clean and the weather was perfect. We loved that there was a mix of people on the sand, from families to couples to young people having fun.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Lovely spot", "My wife and I loved this town. It is a quintessential California coastal town with lovely restaurants with the usual variety of stores and shops to make it easy to spend the day. We did not stay overnight as we were driving on to Palm Springs but we all thought it might be a nice place to spend an evening and night before continuing on in the morning. We had a happy hour meal and drinks at a lovely restaurant with outside tables (sorry but I've forgotten the name) and the drinks were good and the meal well prepared and very tasty. We faced the inner harbour and the little ferry was no more than a hundred yards from our location.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Marvelous spot by the ocean", "A very affluent area by the ocean with loads of shopping and great places to eat. Pelican Hill and the Marriott Vacation Club are in residence nearby. Mercedes and Porsche take the place of Fords and Chevy. More of an adult place than kid friendly.....but a beautiful place regardless.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Fun to walk around", "The waves were big and loud. Large Sandy area and not too crowded at this time of the year as the water is freezing.\nWe enjoyed walking on the paths in front of all the beach houses and apartments and the pier. It's a good place to people watch. A variety of restaurants too. Beautiful sunset spot and family friendly during the daylight hours.\nShow less"], ["Reviewed October 11, 2017", 5.0, "The Bomb", "Newport Beach , CA is simply one of the most beautiful places on the planet. We are renting a house on the beach and it is so so perfect. Great restaurants, great ocean, over the top shopping, and all in a very relaxing setting. It compares with the Amalfi coast in Italy, but with a true American spin!!!\nShow less"], ["Reviewed October 9, 2017", 5.0, "Fantastic Beach! Clean, Great Views, Fantastic Surrounding Community!", "This was my first time seeing a ocean or beach of any kind in my life, and it did not disappoint! This area is extremely clean, looks great/safe, and is a fantastic beach and community. The beach has plenty of space with great sand, great views, and is very clean. Showers are available and plenty of near-by food options for after you are done at the beach. very relaxing and nice area! Lifeguards and public safety are plentiful in the area and makes you assured that if the need arises, you are taken care of (but overall, this area is a clean, crime free/low crime area so no need to worry). It was amazing to get to stick my feet in a ocean! Amazing experience. Water was comfortable (this was in September) and overall, just an amazing experience. Will return for sure! One of my new favorite places I have ever visited!\nShow less"], ["Reviewed October 9, 2017", 5.0, "Beach day in the fall", "The last week of September was a great time to visit the beach. There were only about 10 people on the beach. The water was a bit cold but the air temp was warmer than usual."], ["Reviewed October 9, 2017", 5.0, "Beautiful beach", "Very nice place, the beach was so clean. Had a lovely evening walk along the beach and then onto the pier."], ["Reviewed October 8, 2017", 3.0, "beautiful sunset", "Definitely a place to go to see a sunset. I had a few hours one night while in the area on a business trip and visited the beach/pier. Waves appeared like good surfing waves, and the beach was relatively clean. Towards the night there were several homeless that showed up at the beach. Several restaurants, bars, and shops next to beach. Towards the night (was there on Friday night) the crowd is the those seeking bars.\nShow less"], ["Reviewed October 8, 2017", 4.0, "Newport Beach - Dramatic Surf!", "First time to a west coast beach. Sooo different from what I’m used to on the Atlantic side of South Florida. The water...Chilly! But that sure didn’t keep out the surfers and body surfers. The waves here are nothing short of spectacular. Anomalous winds from the south-southwest had the waves crashing up over the top of the beachhead and actually flooded the Municipal parking at Balboa Pier and down into the city streets. Incredible. Nice that the Pier is free. Beaches here are WIDE and the sand soft and warm, even if the water isn’t. Also love the beauty of the cliffs rising up out of the ocean. So different from flat Florida. Easy bike riding on beachside paved paths as well. Really enjoyed the stay.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Nice", "Nice long beach with good service. Clean and cold water. Shower and toilets available. Parking for 12 USD."], ["Reviewed October 2, 2017", 5.0, "Newport Beach~ a fantastic place to visit!", "Newport Beach, is what you may find to be a wonderful vacation destination....or a new spot to live.\n\nInfluenced by a bit of history.....the Peninsula dates back to the early 1900's, and there are still several buildings which reflect this rich history.\n\nNewport has also become very modern, with 5 star dining, 5 star shopping, and Theaters which feature some of the finest shows around.\n\nThe bay is lovely and many cruises are available from whale watching, to romantic evening cruises.\nSurfing....is a lifestyle here.....and so is a very casual atmosphere, which is unique and very enjoyable to guests from all over the world~!!\n\nA wonderful destination to enjoy all the best of Newport Beach~!!\nShow less"], ["Reviewed October 2, 2017", 4.0, "Nice beach", "Newport Beach has plenty to offer: from lovely relaxing sands to awesome eateries and relaxing walkways."], ["Reviewed September 29, 2017", 5.0, "Nice beach", "Nice beach with beautiful views, not rough but gentle waves. Beach was spotless and sand was white and gentle. Good variety of restaurants nearby. Relaxing place..."], ["Reviewed September 20, 2017", 4.0, "Gorgeous", "On a whim, we wanted to catch a California sunset while on a work trip and discovered Newport Beach was the closest and so we got here just in time to wait for a gorgeous sunset. The Beaches were nice and clean and very scenic. would love to come back again\nShow less"], ["Reviewed September 19, 2017", 5.0, "Very deep beach front", "It is a long walk to the ocean and very hard to park here. I would recommend walking from your beach house."], ["Reviewed September 19, 2017", 4.0, "Gentle waves", "The waves at Newport municipal beach were by far the most gentle waves that we experienced on our trip to Newport Beach. While the waves roll in quickly, there was little to no undertow. Great for swimming, wading, and boogie boarding."], ["Reviewed September 16, 2017", 5.0, "Vacation", "Another great city to visit along the coast in California. Great beach and shopping in this upscale neighborhood. The drive along the coast was very scenic"], ["Reviewed September 14, 2017", 4.0, "Nice beach to visit", "Have visited Newport Beach several times while in SoCal and have always enjoyed it with the exception of parking and traffic. Parking could be better and drivers always seem a bit stressed. However that aside lots of great places to eat, a beautiful beach and neat stores to visit makes it worth it.\n\nIf it wasn't for the parking I'd give it a 5 out of 5.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Quiet beach", "Very nice beach with a lot pf sand to enjoy the summer days. Have a very beautiful view from the pier"], ["Reviewed September 11, 2017", 5.0, "Lovely", "Awesome and clean. Pelican Hill shuttle drops off and prepays umbrellas and chairs a nice touch. Water is quite chilly but kiddos loved playing in the sand. Great way to spend a day at the beach!"], ["Reviewed September 11, 2017", 5.0, "Girls go to Cali!", "This is a very beautiful beach. I could see myself living here. I went to the beach every morning to meditate and it was very peaceful."], ["Reviewed September 8, 2017", 5.0, "Beautiful", "We came here the last week of August. I must say the beach absolutely took my breath away. I never been to the Pacific Ocean before and it was absolutely gorgeous. What's nice about Newport Beach is that there is the Beachside and the Bayside. So if you have small children and you're worried about the waves you can always go to the Bayside. The beach was absolutely beautiful and I must say there was very little or no garbage. The only thing that sucked was I somehow managed to get a bit of tar on the bottom of my foot and it was kind of a pain in the butt to get off. But other than that it was amazing. We can't wait to go back.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Beautiful Beach, Even with the Crowd", "Can never pass up a chance to visit Newport Beach. Before eating I walked out on the pier enjoying the sights in all directions. It's relatively clean for a fishing pier. This day the water was so clear, even the fisherman could see the fish coming. This was on a hot Thursday and the crowd was not too large. There's no charge, the facilities are clean, and there's plenty to see and do along the beach. I'll be in the surf the next time. Experience this one!\nShow less"], ["Reviewed September 6, 2017", 5.0, "GORGEOUS", "The whole town is beautiful. Great shopping, great restaurants and even watching the cars go by is a treat. We saw two cars the whole week that were less than $30,000 - every car is expensive and clean!! This is the land of the ultra successful, so plan accordingly, because you are gonna need lots of cash to do just about anything here. Homes, offices everything just about is well maintained and landscaped to perfection. Beautiful!\nShow less"], ["Reviewed September 3, 2017", 5.0, "Amazing beach", "Felt very safe on the beach, lots of life guards and families doing exactly what we were doing - enjoying the amazing view and family time together.\n\nRestaurants, shops and bathrooms all within walking distance.\n\nWe rented bikes and truly enjoyed biking down the entire beach looking at the amazing homes, rentals, shops etc\nShow less"], ["Reviewed September 3, 2017", 5.0, "Newport Beach - A True Paradise", "We love visiting Newport Beach for it's beautiful Beaches, Great Restaurants, Great Shopping and of course Beautiful Ocean & Coastline views of the Pacific Ocean! So much to do including swimming, surfing, canoes, paddle boards, sailing, boating, deep sea fishing, whale watching, boats to Catalina or any other activity you might enjoy, Newport Beach has it all!\nBeautiful Homes surround the enchanting area! Would highly recommend visiting Newport Beach!\nShow less"], ["Reviewed September 2, 2017", 4.0, "Probably one of the beaches in Lower Cali!", "I would say this the cleanest out of all the beaches we saw down the coast .Pretty rich section ,so that's why ? No bums around no garbage ,lots of people good atmosphere. Would recommend for families."], ["Reviewed August 31, 2017", 4.0, "Cold water", "The beach was nice; the water was extremely cold, and the view was pretty. You need to bring your own beach chairs and towels. come prepared with water and something to eat if you plan to spend the day . The shuttle service from our hotel was excellent\nShow less"], ["Reviewed August 30, 2017", 5.0, "Wow", "This is one of the best beaches in the world. Can't wait to walk along & in the pier every time we return. Wish I could afford a house on this beach!! Stunning."], ["Reviewed August 25, 2017", 5.0, "Travel every year for two weeks", "Our family stay locally for two weeks in the area and this is one of my favorite beaches to visit. Waives are just right and not too busy. Lots of things to do in the area."], ["Reviewed August 19, 2017", 5.0, "BEAUTIFUL, PRISTINE, UNCROWDED", "The beach in Newport Beach was located one block from our hotel. It was populated with families and couples but it was not at all congested. There was plenty of room for children to play and run and be free to dig and build sand castles. The water was crystal clear and the water temperature was perfect! The color of the water was magnificent! My first experience in the Pacific Ocean was a total success!!\nI'm sure\nAccess to the beach is limited because it has one road in and out but if you travel at the right times it doesn't pose a problem.\n\nDo take time to experience this lovely beach area if you want a relaxing restful respite from some of the more frenetic activities in Southern California.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Wonderful Beach", "I was staying at a hotel on Pacific Coast Highway and this beach was about a 15-20 minute walk...and well worth the exercise. It was beautiful beach with a nice pier and beach side shops/cafes close by."], ["Reviewed August 12, 2017", 5.0, "Beautiful, Clean Beach", "I love Newport Beach for many reasons. The beach is clean and less crowded than Laguna Beach. Also, there are many places you are park near the Newport Beaches that you do NOT have to pay for parking which is a plus. I always enjoy walking near the beautiful Newport Beach and enjoy both the ocean views and the views of the beautiful homes that overlook the ocean.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Lovin' us some Newport Beach", "Everytime we go to Southern California we hit Newport. We haven't spent much time in any shops as we are usually headed to the beach itself. We love the beautiful sand and the water. Love the pier. We also love looking at all the beachfront homes - some so beautiful and others so tiny (but still probably waay out of our price range). We've even gone deep sea fishing as a family from here and had a ball. After all the hub-bub and bustle of doing Disney, Hollywood, all sorts of other touristy things...it is so nice just to go relax on the beach, play in the waves and enjoy the ocean. The only reason we didn't rate this a full 5 circles was parking. It can be a challenge to find parking and on some evenings it can be a real challenge to get out of your spot and back out to where you need to go since traffic can be so heavy. Still, I would recommend paying several visits to Newport Beach, and we very much plan to go again.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Best beach!", "I may be biased but this is by far the best beach to vacation at. We have come to this beach for years and we find our favorite spot is between piers 19 and 20. The beach is clean and safe."], ["Reviewed August 11, 2017", 5.0, "Very nice!", "Nice quiet beach, although there were planets of people, it was quiet, and very pretty. The Pacific water is COLD though...beautiful weather and great temperatures! Very nice beach!"], ["Reviewed August 9, 2017", 5.0, "Lovely beach, lifeguards to keep an eye on everythin", "Lovely beach to spend the day chilling out, looks like a good place to learn surfing, parking beach front was $5 for 3hrs. A nice pier also"], ["Reviewed August 7, 2017", 5.0, "Wow. Love this place", "Have never been here before but wow. Absolutely love it here. Plenty to do for everyone. Great food. Great service. You can take a boat to Balboa island."], ["Reviewed August 1, 2017", 5.0, "Amazing", "One of the most beautiful places on earth. The Pacific Ocean is refreshing and it is a wonderful place for children to laz about on the beach . Watch out for small stingers in the winter time as the tides and water becomes calmer.\nLots of great accommodation options as well as food and dining.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Great!", "Great beach, water was clear and clean, great surroundings as far as restaurants and pier, clean enough bathrooms, even fished off pier and caught a few."], ["Reviewed July 31, 2017", 5.0, "Best beach in LA area!", "We had visited Santa Monica beach the day before. This beach is 100 times better than Santa Monica. The waves were incredible! Approximately 10 to 12 feet high at times. I wish we brought our boogie boards from Toronto. The beach was clean. People were friendly. We parked on the street for free for 3 hours.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Beautiful Scenic Beach", "Newport Beach was beautiful ~ soft sand, blue water, gentle waves, not crowded. All ages were enjoying this stretch of Summer Fun.\n\nTook a break to Lunch @ Ruby's & found the cool breeze on top delightful.\n\nI spent hours here in perfect conditions. Clean public restrooms with showers outside.\n\nShow less"], ["Reviewed July 30, 2017", 5.0, "Great beach", "Came to enjoy the weather and view.. great place to come for a beach day with friends or family. Came with friends and had a great time relaxing."], ["Reviewed July 29, 2017", 5.0, "LOVE THE SURF", "The beaches go on and on and on.. Newport is definitely one of the nicer ones. Great surf. Lots of parking and not too far to walk. Glad we stopped by for a break"], ["Reviewed July 27, 2017", 4.0, "Beautiful CA Beach", "This was a fantastic beach, and more what you expect when you go to a Southern California beach. The sand was beautiful and the waves were stunning. It has a cute little downtown area, so we could hang out for hours."], ["Reviewed July 25, 2017", 4.0, "Beautiful area!", "Darling town filled with gorgeous neighborhoods, marinas, walking paths, beaches, shopping and restaurants. We snagged a parking space in a neighborhood near the beach but if you don't want to spend time driving around, parking in a public lot is probably the best bet. Sunsets are stunning.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Fantastic Beach", "Great clean beach, surrounded but lots of bars and restaurants which make this a fun place to visit. It's also fairly quiet in the week which makes for a peaceful experience."], ["Reviewed July 23, 2017", 5.0, "Wah! Just looked as good as in the movies!", "Sandy beach with school of pelicans birds all around! There's a few cafes available! Great for running and chill!"], ["Reviewed July 22, 2017", 5.0, "One of our favorites", "We traveled from the east coast to visit family on the west coast and in comparing beaches we think the west is the best! Beautiful beach and sunset. Kids loved playing in the water and my husband was able to fly a kite."], ["Reviewed July 16, 2017", 5.0, "Nic,e clean beach", "We enjoyed our long walk on the beach. The sand is clean but the water is cold. The homes along the beach are very cool. A must visit beach. Parking is hard to get so I suggest just pay for parking in a paid lot. We did and it was worth it.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Newport Beach", "It's was a nice day at the Newport Beach we spend couple days at the beach and this beach was nice and not really hot we enjoyed swimming with the young kids and also walking along the beach not to much of shell for the kids to pick out but it sure was fun for the whole family\nShow less"], ["Reviewed July 12, 2017", 5.0, "Run and play", "Love getting in my morning jog on the boardwalk with baby in the stroller. Nearby is a park on the beach my nephew loves to play at. Parking at the pier is $1.90 per hour. Pay with card and get there early to get a spot. Not far of walk to the ocean which is ideal when you are carrying a two year old. Great people watching.\nShow less"], ["Reviewed July 11, 2017", 5.0, "We love this place", "We spend most of our 3 weeks out here in SoCal by going to the beach just about every day. It isn't always crowded and when it is, people tend to try to give you your own space and not park directly on top of you. The lifeguards are good at what they do. They don't just sit there in their mini-towers they get off them when they have to, to warn people from going too far or when necessary, bring someone back to a safe location. They are well trained.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Sunday Funday", "my Daughter, her boyfriend and I spent the afternoon at the beach, the lifegaurd was frendly and helpfull of where was safe to swim. The only thing that was an isuee is parking. we paid for a full day and keroed the recept when we went back to the car to grab sandwiches there was a ticket on the car. I saw the oarking athority person issuing tickets and showed him my recept. his respons was mot his problem fight it or pay it. to fight it i would have to come back from Canada which i found not fair!\nShow less"], ["Reviewed July 10, 2017", 4.0, "Fun in the sun and great eats", "I actually work at a place right on the coast hwy across from the beach. If you like long stretches of sand and surf, Newport is probably ideal. There aren't any scenic cliffs like some of the other beach spots offer, but if you like shopping & food eateries, going to the pier area will offer you a number of shops & restaurants along the long stretch of boardwalk. There are also some beautiful beach homes as well. The food places range from typical sandwich huts to high-end and if you have a need for some amazing sushi, visit Sakee Sushi,a tiny little place that serves some of the best around. There's also plenty of surfing and boogie boarding here. If you just wish to dine there are a number of restaurants on the water but you'll want to make reservations for those.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Very nice", "During my visit to Newport Beach, I noticed how clean and well-cared-for the entire area was. There is a great selection of restaurants, great sand, bike rentals, etc. It is a great area!"], ["Reviewed July 7, 2017", 3.0, "Newport is nice, but Huntington is nicer!", "We visited Newport beach for one day and although it was nice overall, just didn't compare to Huntington beach. Everyone just seems nicer in Huntington, the beach is cleaner in Huntington too. Decent pier, real nice boardwalk but I'd prefer Huntington over Newport"], ["Reviewed June 26, 2017", 5.0, "Great time to visit - spectacular views not crowded", "We walked Newport Beach around 9:30 this am. The beach was just waking up so we had plenty of room to roam. Beautiful views from Inspiration Point. Nice walk along the beach and sidewalks above. Watched sea divers, couples and children laughing in the waves and heard the sound of sea lions but couldn't see them. A beautiful, picturesque spot!\nShow less"], ["Reviewed June 24, 2017", 3.0, "Typical Beach", "My son and I walked to beach while my husband was in a conference. It was a typical public Beach. Waves were high and there were a lot of people."], ["Reviewed June 23, 2017", 5.0, "We love Newport Beach!", "Excellent beach for active families and couples. We love the beaches, restaurants and recreation. Fun walking town. Nice escape."], ["Reviewed June 23, 2017", 5.0, "Great beach!", "The beach is nice and clean. Picturesque, exactly what one would expect of Southern California. Lots of restaurants nearby as well."], ["Reviewed June 17, 2017", 4.0, "I was there on a cold windy night but.....", "I went to visit Newport Beach while in town for business. We went at night and though it was cold and windy there were tons of people out and about. This definitely seems like the place to go during the day."], ["Reviewed June 17, 2017", 5.0, "We had so much fun!", "Pack your body boards and hit the waves! Our boys (7&9) caught wave after wave while my husband surfed. There were cute shops for our 18 year old and shallow water for our 7 year old girl too! This party of 6 had lots of fun.\nShow less"], ["Reviewed June 14, 2017", 4.0, "nice beach", "we had a walk on the pier during a sunny evening. really enjoyed the atmosphere, many people fishing and having a good time. Nice place to be."], ["Reviewed June 14, 2017", 3.0, "Visited on a windy and cool day", "Parking is very close and it is a nice beach. In my opinion the restrooms get a fair minus rating. We didn't get to stay long because it was very windy and cool. I was wearing a jacket and could have used pants. Seems very unusual for \"sunny California\". My expectations for the beach was totally different than my actual experience. I hear July and August are actual beach months in CA. I prefer the beaches when it's cooler but not this cold. But the wind made the temperature feel lower than what it actually was. The wind was fierce.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Terrific Beach area in Southern California", "Fun place for beaches and shopping in bike riding and soaking up beautiful Southern California weather. Beaches beautiful and less Rocky than the normal California beaches Pacific Ocean is always a little too cold but probably a little warmer down here. Lots of good restaurants and shopping nearby.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Easy access", "Park right next to the sand. Pretty busy at night. Parking is free after 6 pm. Lovely to walk along the water."], ["Reviewed June 10, 2017", 5.0, "Amazing!!", "So beautiful, with a local vibe. Beach is stunning and lots of shells to pick. Lovely sand. Check out Newport Coffee Company so yummy and the hotdog place next door has frozen cheesecake on a stick. So good!! 👍🏻👍🏻👍🏻👍🏻👍🏻"], ["Reviewed June 7, 2017", 5.0, "The is my favorite beach.", "I and my wife were vacationing and stayed at the Newport Beach Hotel and played on Newport Beach. It is a great beach. It is clean and the great thing about it is that there are a lot of places to get lunch and dinner close by. If you forget your lunch just go and get a fish and chips or sushi to go. Great food is close by and a great place to eat is on the beach.\nShow less"], ["Reviewed June 6, 2017", 5.0, "great beach, easy and nice views", "Great beach to hang out for a while. It's never crowded and there's always enough space for everyone. Great sunset views. A lot of stores and restaurants nearby. Parking can be a hassle during the weekends. Come early."], ["Reviewed June 1, 2017", 3.0, "Restrooms", "The beach is awesome! Love the shops nearby! Public restrooms were absolutely disgusting!!!!! The women's restroom had feces on the toilet rims, used tampons resting on top of the toilet paper rolls, and it smelled like an outhouse. Urban Cup has a restroom, for customers only! So it was worth buying a drink so we could use their restroom!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Iconic Southern California", "LOVED this beach. Great vibe and fantastic walkway and bike path. Would highly recommend hiring a bike and riding along the bike path taking in the scenery. Lifeguards are on duty on weekends making it a great day at the beach for the family."], ["Reviewed May 17, 2017", 4.0, "Beautiful sand", "All California coast is very beautiful but I like this beach more white sand nice sunset just take time enjoy beach."], ["Reviewed May 16, 2017", 4.0, "Beautiful White Sand Beaches", "Amazing Sunsets...took some chairs to watch the sunset and take some pics. Parking was easy, no one around...lovely."], ["Reviewed May 13, 2017", 5.0, "Amazing Area!", "The only negative was we didn't have enough time in the area! Loved the beach, water, sunsets, shops, etc. Will stay longer next time."], ["Reviewed May 12, 2017", 4.0, "Really nice beach and shops.", "Newport is my idea of a beach town, there are lots of shops and restaurants. You can walk around without worrying about traffic and it feels pretty safe here, They have all sorts of boat expeditions, and they are always having specials so they are really pretty reasonable, we took the whale watching tour but I spent much of the ride with seasickness, we didn't see any whales but there were quite a few dolphins.\nShow less"], ["Reviewed May 7, 2017", 5.0, "Take a harbour cruise", "We attended as a large group and did a harbour cruise for 2 hrs. It was well worth it. The view of the homes was incredible. So many boats too! Even saw a few seals lounging on the back of a couple boats!!"], ["Reviewed May 4, 2017", 4.0, "Beautiful sand", "The sand on this beach is so beautiful. It is a golden color. Super clean sand and water. Nice pier and walking area."], ["Reviewed April 29, 2017", 4.0, "Very clean and nice", "Newport Beach is probably the cleanest and nicest beach I have been to in California. Lot's of great beach to enjoy and great restaurants in town."], ["Reviewed April 27, 2017", 4.0, "Park your car for the duration of your stay", "Newport Beach is a great getaway for the weekend. There is no need to drive once you've arrived & found a free parking space. Everything you may need is within walking distance. The beaches are clean & there are areas were the beaches stretch far before you reach water as well as areas where the waves are crashing away at the sand very close to shore. There are so many yummy places to eat & very few familiar franchises which makes this place a gem. Walk over to the Lido Theatre after a day at the beach to enjoy a beautiful single screen theatre. Be sure to walk through Newport Island to locate the home decorated with pirates escaping from the rooftop. Take the ferry to Balboa Island to get a pedicure at Rosey Toes, your feet will thank you. Browse the shops on Marine St and stop by any of the nice restaurants on the island's main st. Take the ferry back to the peninsula and explore the boardwalk & fun zone built in 1936.\n\nThere are enough activities & places to explore to fill your weekend stay in Newport Beach!\nShow less"], ["Reviewed April 26, 2017", 4.0, "Fantastic beach with great pier area", "Excellent beach with plenty of sand, excellent pier area and walking facilities on boardwalk. Great fro chilling and people watching"], ["Reviewed April 22, 2017", 5.0, "Gorgeous Stretch of Beach", "This area of the OC is fantastically awesome. The roads are wide and easy to drive. Lots of shops and good restaurants in the area. Magnificent houses fill the landscape. Crystal Cove beach is a large beach area that is easy to get to and makes a great outing. Highly recommend a visit to this area.\nShow less"], ["Reviewed April 22, 2017", 5.0, "Beautiful Area", "We just stopped here passing through, but would definitely come back here for a visit. The beaches are absolutely stunning."], ["Reviewed April 21, 2017", 5.0, "A Must", "An awesome place to beach, eat, and explore. The SUNSETS are beautiful and can be seen best on the Newport Beach Pier. Would have loved to spend more time here.."], ["Reviewed April 20, 2017", 5.0, "Aside from limited parking, a great beach for kids", "First time to Newport Beach. Very difficult to find parking anywhere close, but once parked, the beach is close to public parking and smooth and flat.\n\nA great venue for our little grandkids, and the older ones, as well.\n\nThis may be our new \"go-to\" for So Cal beach fun.\n\nAnd don't miss a stop at the Pipeline grill right by the pier. Excellent food!\nShow less"], ["Reviewed April 17, 2017", 5.0, "Relaxing Lazy Day Off", "On my Monday day off of work I took my hubby down with me to a Newport Beach . We enjoyed wandering the fun small shops and taking in some sun on the beach . Nice place to walk around or bike ."], ["Reviewed April 15, 2017", 5.0, "Relaxing", "Wonderful place to go and relax or watch the sunset. Walk around and take in the fresh air and watch the kids play on the beach and in the waves."], ["Reviewed April 14, 2017", 5.0, "Sunny breeze", "Clean beach, hard to find parking! Lots of dead end roads to get close to the beach. Beautiful waves and what not"], ["Reviewed April 13, 2017", 5.0, "Love the Beach", "Weather was a little cool but the beach was beautiful. Not crowded at all. Saw parking nearby but our motel was within walking distance"], ["Reviewed April 13, 2017", 5.0, "Beautiful beach", "Probably one of the best beach towns in the OC. The beach areas are clean and there's life guards present to ensure a safe environment."], ["Reviewed April 12, 2017", 5.0, "Such a beautiful area.", "Our daughter moved to Newport Beach out of college to start to law practice. We seriously enjoyed every visit to the area while visiting from Alabama. Our daughter moved closer to LA now but my wife and I still manage to visit and stay in the area after every family visit.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Great place", "If you have the opportunity go to Newport Beach California. Not only is it one of the nicest cleanest beaches you'll ever see but it's always always beautiful. There are so many things to do like many great beaches but this one to us is very special. We are very fortunate only to be 20 minutes away so we take numerous trips down to Newport walk around ride our bikes eat right by the ocean so many great places lots of great people. The atmosphere is always always positive. While you're down there stop at pipeline get a frozen banana or a balboa frozen bar.\nShow less"], ["Reviewed April 9, 2017", 5.0, "Dog Beach for Benny", "Beautiful! Very fun for a beach walk, with our Jack Russell Benny. He loved playing ball & rolling in the sand. Everyone was very cognizant of pet behaviour."], ["Reviewed April 5, 2017", 1.0, "Be Warned!!! Parking will be one FINE after another!!! Find Another beach!!!!", "Parking on the Balboa Peninsula is a disaster!!! We had NO idea that it was any kind of problem to BACK INTO A PARKING STALL!!! We completely complied with all the parking fees only to find a ticket on our cars when we finished our day here for something as ridiculous as backing into the parking stall!!! What a joke! Our vehicles have license plates on the front and back and we were well within the lines of the stall! We paid the parking, in fact in excess so we would avoid any kind of fine! Then we found tickets on our two cars! What a joke! We will find other beautiful places to visit next time! This place is impossible!! Now we are required to pay another $88 dollars for our simple trip to the beach! Find another place without a million hidden fines for visiting!!!!!\nShow less"], ["Reviewed March 28, 2017", 3.0, "Good public beach", "We enjoyed a family walk on the beach. The weather was nice and the beach was clean. The pier was filled with fishermen looking to catch a fish."], ["Reviewed March 27, 2017", 5.0, "Fun Week in the Sun", "Great trip. Lots to do for families or couples. Will be back soon! Great food, great shopping, great atmosphere"], ["Reviewed March 26, 2017", 4.0, "Wheelchair vacationing", "Although mostly wheelchair accessible there are a few bumps and holes which need to be avoided. I would be reluctant to go out and about fat night. The broad walk at the beach was a great place to stroll."], ["Reviewed March 25, 2017", 4.0, "Lots of beach, Must Visit", "It wasn't suntanning weather yet but warm enough to frolic in the waves, walk along the sandy beach, build sand castles, search for shells, or just sit and people watch. Great beach also as lots of space and close to shopping and coffee and snacks."], ["Reviewed March 24, 2017", 5.0, "Very nice location", "This location is very clean and easy to walk. There are many shops and restaurants to visit. Plenty of soft sand to go around."], ["Reviewed March 21, 2017", 5.0, "Beautiful village style setting", "Spent a beautiful afternoon here in Newport Beach with the kids and had a wonderful time. A quaint village style area with a beautiful sandy beach, no problem finding street parking and plenty of room at the beach. A definite must visit if you are in the area and not too long of a drive from Disneyland.\nShow less"], ["Reviewed March 20, 2017", 4.0, "Beautiful beach", "This is a very nice large beach. I don't really swim here but I love to walk around the area and maybe even get my feet wet from time to time. Beautiful scenery here."], ["Reviewed March 19, 2017", 5.0, "Nice small beach but beautiful", "I actually only visited a small part of the beach at Balboa Pier. It was foggy in the morning and early afternoon but then the sun came out and lit up the water front beautifully. People swam, played around, had picnics, and the little streets near the pier had many stores and restaurants to go to. There is even a little fair type section that has a ferris wheel and arcade and some other little attractions. There's fishing and boat rentals and other stuff. I would visit again some day.\nShow less"], ["Reviewed March 18, 2017", 3.0, "Not a lot to do for a family vacation", "We stayed a week. We spent two days in LA and another day at the San Diego Zoo Safari Park. The days in LA we spent driving two hours one way in stressful traffic. That meant 4 hours each day just driving. Yet with a family there wasn't a lot to do in Newport Beach. Very focused on wealth and found people were not very friendly. Not a lot to do in or around the area. The weather was not warm and had extreme fog every day so had difficulty even enjoying the view of the ocean. Of course we had fun as a family because we were on vacation.\nShow less"], ["Reviewed March 14, 2017", 3.0, "Family friendly but great for couples too!", "Lots of great eating spots around, kids area, pier to walk around or fish off of, great parking. We felt very safe walking around after a late dinner."], ["Reviewed March 13, 2017", 5.0, "Newport beach", "Very beautiful beach with many access points. Tons of shopping and restaurants in this area. We ate lunch and shopped when we were there. Swimming and surfers were out. The beach is miles long. We enjoyed the beautiful view of the beachfront homes as we drove through. Very high end area.\nShow less"], ["Reviewed March 11, 2017", 5.0, "Paradise an hour south of LA", "It's a wonderful, beautiful, safe area with lovely homes and easy access to beaches and shopping. Highly recommended."], ["Reviewed March 10, 2017", 4.0, "Best in the summer", "We went to the beach right after the big storms in February 2017. The biggest storm in years took away something from Orange County that could be missed when the weather heats up — the beach. Wild surf and wind made dunes almost 8 feet high. A cleanup was underway on our visit. We saw huge piles of sand, manmade mountains as big equipment worked on the challenge. We were at the northern end of Newport where the Santa River hits the Pacific. It is normally a dog-friendly beach, but not on our day. It was closed. We walked nearby open beaches with our Maggie on a leash. Ordinarily this is a great beach. Come in the summer. Years ago we rented a cottage on the beach for $500 a week. Not anymore!\nShow less"], ["Reviewed March 8, 2017", 4.0, "We saw whales!", "We were brought to this wonderful beach by a friend and had an exhilarating afternoon walking along the sand, hearing the Pacific Ocean and watching the waves roll in. And then spouts of water appeared in the distance and 2 whales were frolicking! Quite an unexpected bonus. Further on, a couple had their wedding photos taken under the pier.\nShow less"], ["Reviewed March 7, 2017", 5.0, "Off season", "We were lucky to have beautiful weather the last week of January. I love off season because fewer people are on the beach. We rode bicycles all over Newport and Balboa Island. It was a delightful to get away from the snow and cold in Utah.\nNewport Beach is a beautiful place.\nShow less"], ["Reviewed March 6, 2017", 5.0, "Classic Newport", "Sexy people, Orange County staple beach. Worth visiting & taking a dip in the ocean. Adjacent to the beach there is downtown Newport with top notch restaurants & bars."], ["Reviewed March 1, 2017", 5.0, "Hints to enjoy Newport Beach", "Start you day at the Newport Beach Pier and walk around the shops. If the weather is cooperative go for a swim, but keep an eye on small children or poor swimmers. The surf can be rough, especially at the south end of the beach, an area called \"The Wedge.\" Don't miss the Balboa Island ferry or the main street of Balboa Island with its quaint shops. Grab lunch at one of the many restaurants, or an excellent sandwich at Hershey's Market Deli. A frozen Banana is simply a must. Return back to the Pier area for dinner at the Crab Cooker.\nShow less"], ["Reviewed March 1, 2017", 5.0, "Stunning and beautiful boardwalk and beach", "Went for a run along the boardwalk. Clean and beautiful area. Perfect mix or a large beach, natural beauty and tons of shops and restaurants suitable for all."], ["Reviewed March 1, 2017", 5.0, "Cool, hip beach vibe", "The expansive, golden sand of Newport Beach is a real way to spend the day. Along the \"boardwalk\" the shops offer everything one needs from great gelato to the funky, ketchy beach souvenirs. Spending a few hours here is a great experience."], ["Reviewed February 27, 2017", 5.0, "Breathtaking views", "This is a nice and quiet place to visit. There are plenty of great beaches with lots of good shopping. The restaurant choices are plentiful with price ranges from very inexpensive to wallet busting. Nice resorts in the area...nice for families or couples."], ["Reviewed February 27, 2017", 5.0, "Had a great time", "We had great visit to the area. Everyone from hotel staff to cab drivers were VERY nice. This was our first trip to Southern California and we would go back. Beautiful beaches and sunsets!"], ["Reviewed February 22, 2017", 3.0, "BEST HIDDEN SPOT", "best place to go is on ocean blvd and jasmine avenue. parking is free and limited. this is a great place for nonsmokers and kids. once you on ocean blvd, you have will a great view and surrounded by multi million dollars home. bring your camera and watch the sunset. it is gorgeous. it like you are on the movie set . there are a lot people walking their dog and exercising . the place is clean except the damage signs that state employees refuse to take care of them. you can have a romantic walk on the beach\nShow less"], ["Reviewed February 18, 2017", 5.0, "My Favorite Beach!", "Newport Beach is my favorite beach of all the beaches I have visited in Southern California. Parking is easy to find and there are plenty of things to do and places to get something to eat. The piers are nice and the waves are always just right.\nShow less"], ["Reviewed February 13, 2017", 4.0, "Nice beach", "Clean beach. Parking is available in paid lots close to the beach and a public restroom. Lots of homeless people around."], ["Reviewed February 8, 2017", 5.0, "Nice", "Very nice .. we walked a bit there . Considering the weather was not so many people but still some .. cool !"], ["Reviewed February 1, 2017", 5.0, "Awesome time !!", "Absolutely beautiful, breath taking views at every turn! This was a family get away and we never had a dull moment ! There is so much to do here ! I highly recommend a trip to Newport Beach ! Gorgeous views and Lots to do and see !!! Go if you have the chance !\nShow less"], ["Reviewed February 1, 2017", 4.0, "Beautiful Place to Relax", "We spent a day at Newport Beach while vacationing in So Cal. There wasn't as much flat sand space where we were compared to other beaches we visited, but it was well kept and the views were beautiful."], ["Reviewed January 22, 2017", 5.0, "Beautiful clean beach. Really good day out", "Visited on a hot sunny day for the first time. It was a lovely experience. The sand and water was very clean. The souvenir shops had really nice things in there. Lots to choose from. Collected lots of shells. Would definitely recommend this beach and can't wait to visit again!\nShow less"], ["Reviewed January 17, 2017", 5.0, "BEST HARBOR EXPERIENCE IN ORANGE COUNTY", "Enjoy the different communities of Newport Beach: the harbor, Balboa Island, Balboa peninsula, Corona Del Mar, Lido Island, Newport \"Gold\" Coast, and Newport Center with Fashion Island."], ["Reviewed January 15, 2017", 5.0, "Amazing beach", "Even tho it was coldish December day, we went to the beach. This was kind of a must-to-do for me, as I had to step into the Pacific ocean during my visit to Ca. As my friend used to live in the area, she drove us to this beach. I was amazed how clean beach was, and how many people was there, even it was windy and clowdy December day. This was a short but great visit. We brought our flip flops and walked around the beach and collected some sea shells along the way.\nShow less"], ["Reviewed January 4, 2017", 5.0, "Fun day at the beach", "It was my daughters first trip to the beach. She is 3 years old and this was a fun and lively beach. It wasn't too busy, but it was nice to have people around so she could see that others were not afraid of the water.\nShow less"], ["Reviewed January 2, 2017", 5.0, "Love Newport Beach", "We've been coming here for years and highly recommend it! Fairly quiet year round, compared to other beaches nearby. They keep it clean and well staffed with police and lifeguards. Easy walks to restaurants and some shopping. Easy Uber ride from John Wayne Aiport. There are even mermaids!\nShow less"], ["Reviewed December 31, 2016", 5.0, "Loved Wave Watching here", "This beach is beautiful, waves are a good size. It was in the mid 70s the water was cold it didn't matter, my little kids loved playing in the water and sand. It's so peaceful here, definitely recommend this beach.\nGood for reading a book or meditation on the beach.\nShow less"], ["Reviewed December 29, 2016", 5.0, "Shells galore, beach for miles, quaint restos nearby", "Great for families, we walk up and down the beach looking for shells, we collect them then throw them back before we leave. Exiting Newport via the 55 is a pain, but so is driving EVERY freeway in L.A. Every time we visit SoCal we do Newport Beach and Ruby's Diner in Corona Del Mar. Cheap. Family. Fun.\nShow less"], ["Reviewed December 28, 2016", 4.0, "Fun beach to walk around", "Had a lovely Sunday afternoon picnic and walk on the boardwalk at Newport Beach. It was fun watching the surfers and seeing the seals."], ["Reviewed December 28, 2016", 5.0, "Natural Habitat", "Inexpensive way to see the beauty of the natural beech. Park setting discourages homeless people from setting up camp. Open daily until 6pm. Very impressive."], ["Reviewed December 28, 2016", 5.0, "Beautiful places to wander", "Really just a lovely view. I spent quite a lot of time just walking down to beach and watching the pelicans dive for fish. It was during december so there were not a lot of people which was really cool."], ["Reviewed December 28, 2016", 5.0, "Thanksgiving Visit", "We came down to visit my son for Thanksgiving. We live in the Bay Area. This beach is a nice clean very long beach and about 150 yards deep. We took several long walks. We ran out of steam way before we ran out of beach. I also appreciate that for a good part of the beach there is a sidewalk which runs next to the houses. It was nice to be able to enjoy this beach with very little people around because of the time of year. I thought that there would have been more people since it was Thanksgiving break.\nShow less"], ["Reviewed December 27, 2016", 5.0, "Great place to live or visit", "I have lived in Newport Beach for a year now and love it! Great views and great food. If you visit make sure to rent a bike and ride along the beach."], ["Reviewed December 26, 2016", 5.0, "Long walks", "Great options to walk either by the water or on the boardwalk. We combined both. The boardwalk is very busy so you'd need good tolerance for getting through crowds to go running there, so I'd recommend it more for walking."], ["Reviewed December 17, 2016", 5.0, "Hometown Beach", "Great hometown beach, great for families or couples. We love date night down here at the Original Pizza, Woody's Wharf, or Rockin' Baja Lobster. Parking is by meter so don't forget your quarters."], ["Reviewed December 12, 2016", 5.0, "Love it", "Love this place, the sea in front of the house, relaxing life, the pier everything was amazing i recommend it"], ["Reviewed December 10, 2016", 4.0, "I bet of a hot day this is an amazing place.....", "We visited on a grey December day; you can see this would be wall to wall people if it was summer... Clean & still pretty"], ["Reviewed December 7, 2016", 5.0, "Wonderful", "Had a fantastic and relaxing walk along the beach. The sidewalk is well kept and gives a beautiful view of the oceanfront homes and beach. Can't wait to go back. It is such a great pier and full of nearby shops."], ["Reviewed December 5, 2016", 5.0, "nature lovers find peace", "My family rented a condo on Adams Street for a week at Thanksgiving and thoroughly enjoyed the entire area. The area near the Fun Zone is very good for both adults and kids, as the Zone is modest entertainment for kids and the shops and bars and restaurants are good for the adults. But the big hit is the proximity to the pier, the park, the ocean and the path for walking along the shore. Beautiful, relaxing Nature. It is easy to find and navigate and easy access to freeway connections to nearby attractions like Disneyland, etc, etc. A perpetual people pleaser!\nShow less"], ["Reviewed December 4, 2016", 4.0, "Beautiful at sunset", "We went to Newport Beach during the late afternoon hours for happy hour and to watch the sunset on the pier. It was lovely and gorgeous to watch it set behind Catalina Island from the pier!"], ["Reviewed November 30, 2016", 5.0, "Simply stunning", "Newport Beach is on the pacific highway and easy to find. Plenty of parking available.\nThe sandy beach and rolling pacific waves are breathtaking. The ocean stretches as far as the eye can see and is lovely and clean.\nAs we visited in November we didn't get into the water.\nThe sunset was a treasured memory\nHighly recommended Newport is an upper class suburb with millionaire homes\nShow less"], ["Reviewed November 29, 2016", 5.0, "Nice Beach", "Newport Beach is a place you want to see and take advantage of the great surfing and swimming. This beach is first class and very clean"], ["Reviewed November 27, 2016", 5.0, "Love Newport Beach", "I am so in love with Newport Beach. It is so beautiful always. As a teenager we'd go to that beach often, and now that I am older and live out of state -- I ALWAYS go there at least twice a year to walk on the sand, walk in the water and collect sea shells and watch the Surfers and the people. My favorite place to be. Very crowded in the summer.\nShow less"], ["Reviewed November 15, 2016", 5.0, "Awesome beach and pier", "We stayed in Newport for one night in October 2016 and it was awesome! We ended up walking to Balboa Island - which is not advisable as it took us forever to walk. I think it took us over an hour. If you plan to walk from Newport Beach/Pier to Balboa, definitely rent bikes! It's something everyone does and is a lot quicker/ easier than walking the distance. The nightlife in Newport is awesome, they have a great row of bars by the pier which were pretty live for a Tuesday night!\nShow less"], ["Reviewed November 13, 2016", 5.0, "A wonderful day!", "We love Newport Beach. Had a fun day exploring, shopping, eating, soaking up the sun, watching the waves crash, people watching and more!"], ["Reviewed November 12, 2016", 3.0, "Visit Huntington Beach", "While Newport beach is nice, Huntington beach has so much more to offer. Newport has a few hot spots like fashion island and various restaurants, but you need a car to get around. In Huntington just park your car along Main Street and enjoy the restaurants, bars and beach, all within walking distance.\nShow less"], ["Reviewed November 11, 2016", 5.0, "Lovely beach", "Really nice beach, not too crowded when we arrived at 10 am rented chairs andv umbrella, $25. Free parking on the road. A, really nice day and I don't like the beach much lol"], ["Reviewed November 10, 2016", 4.0, "Enjoyable Time", "We did Davey's Locker whale watch tour and enjoyed it. We also walked around beach and Main Street areas. We ate at Ruby's at the end of pier which was good.\n\nThere is free parking in residential areas. Watch no Parking signs which are different days in different places for street cleaning.\nShow less"], ["Reviewed November 7, 2016", 2.0, "Over crowded over priced", "This beach is a tourist-trap like beach. The beach itself is large and the pier is lovely. Parking and traffic are horrendous. If you are looking for a low key beach experience keep driving. There are many smaller more laid back beaches quite near. There are a lot of over priced, fair quality food optionS.\nShow less"], ["Reviewed November 5, 2016", 5.0, "Amazing!", "Beautiful beach, clean, soft sand, no rocks, perfect temp water, not over-powering waves, easy/cheap parking, not over-crowded. Best beach we have ever been to."], ["Reviewed November 2, 2016", 5.0, "The best beach on the Westcoast!", "I have seen many beaches in the US, but this beach is outstanding. Amazingly clear water, broad and a fine sandy beach without any tourism."], ["Reviewed October 28, 2016", 5.0, "The OC", "If you love SoCal, this is a must visit. The sunrise is just so beautiful. They have really cleaned the place up."], ["Reviewed October 27, 2016", 4.0, "Pretty beach, easy access, short shore-break and large undertow", "Golden sand and blue water make for an eyeful of beauty at this beach. Not a great place for the littlest swimmers because of the steep beach and undertow, but this is a lovely place to spend a bit of time."], ["Reviewed October 23, 2016", 5.0, "Just the best", "I've been to Newport Beach many times. It is fun and a true So Cal experience. So much to do there..surfing.. swimming.. bicycle riding..boating..fishing..volleyball. The fun never stops."], ["Reviewed October 23, 2016", 5.0, "Gorgeous beach!", "No steep incline, fine sand, quiet and not too crowded. People are incredibly friendly here and there are many food and drink options right on the boardwalk."], ["Reviewed October 21, 2016", 4.0, "Beach, shopping and dining", "Beautiful beach, loved my stay here. Plenty of shopping too. Nearby Balboa Island has nostalgic charm, boating, and enjoyed strolling along the beaches and piers. Stay to watch the gorgeous sunsets !"], ["Reviewed October 20, 2016", 5.0, "Fine sand, beautiful views", "We were there on a Thursday evening and very early Friday morning. The evening light was golden, the waves curled and crashed. The seabirds and pier in the distance lent color to the scene. People walked along the waters edge, sat on the sand or bobbed on surfboards in the water. I don't want to imagine it at beach-going height of the year! Lifeguard stations, nearby parking and convenience stores, etc make this a good beach for recreation as well as peaceful meditation.\nShow less"], ["Reviewed October 19, 2016", 5.0, "Quite spots to enjoy the view and ocean.", "We were there on Monday and it was the perfect time. We almost have the whole beach for ourselves to enjoy. Walked on the cool water and soft sand."], ["Reviewed October 17, 2016", 4.0, "Great classic Southern California beach!", "Grew up near this beach and still a favorite. Try Corona Del Mar for a less crowded and more private area. Shops & restaurants nearby. Parking can be paid by iPhone App."], ["Reviewed October 17, 2016", 5.0, "Great Beach for Family and Kids", "I love the Newport Beach - it is great for families and kids since the wave area fairly calm and its a great place to play in the sand and the water. You must watch sunsets if you can - they are amazing!!"], ["Reviewed October 17, 2016", 2.0, "Newport Beach! I don't get it", "Stayed one miserable night at balboa shores inn changing rooms two times and should have moved one more time all in one day .\n\n4 star hotel ? Not\nFirst room didn't have hot water.. really ?\nSecond room smelled like sewer gas\nVery really ?\n$ 400 per night after parking , taxes and $ 80. Dollar breakfast ( I had oatmeal) oh my .. they seemed taken aback that we would want to check out two days early..the maintenance man said this was a known problem.. why would you put people in a room with s known problem.\n\nThere is a nice holiday inn express with real hot water across the street\n\nThe rest of the town is just not very walkable or interesting .. including balboa peninsula just so so\n\nheading to laguna beach and San Juan Capistrano ..oh well.\nShow less"], ["Reviewed October 17, 2016", 5.0, "Clean, Family Friendly Beach", "Newport Beach is family-friendly and very accessible (once you are there!). We were able to walk and ride bikes to many places - there is a great bike path throughout the beach area. The beach itself is clean, has nice waves and was not too crowded when we visited (October).\nShow less"], ["Reviewed October 17, 2016", 4.0, "Very clean beach beautiful beach.", "The beach was very nice. What I liked about it was the friendliness of the people there. The view was very beautiful and awe inspiring."], ["Reviewed October 17, 2016", 5.0, "Quaint harbor town to visit", "Beautiful seascapes, houses and luxury boats dot the landscape of this peninsula town. Friendly locals, great restaurants, plenty of night life. Great for all!"], ["Reviewed October 12, 2016", 5.0, "Best beach in Southern California", "This is where we live! Beaches along Balboa Peninsula runs west to east rather than most of the SoCal beaches, that runs north south. So it is a lot warmer in the afternoon when the ocean breeze from the west picks up! Beaches are wide and never crowded due to the limited parking! Best chance to park will be around Balboa Peninsula Point area at the end of the Peninsula! There are normally plenty parking early in the day! Wedge is closely plus there is a nice small public beach on the bayside just past M street! Only drawback, no public bathrooms!\nShow less"]]}}