{"Norton Simon Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Norton Simon Museum", "url": "/Attraction_Review-g32859-d1028626-Reviews-Norton_Simon_Museum-Pasadena_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b3/c4/ba/sculpture-garden.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1057"}, "address": {"@type": "PostalAddress", "streetAddress": "411 W Colorado Blvd", "addressLocality": "Pasadena", "addressRegion": "California", "postalCode": "91105-1825", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "A Wonderful Collection!", "This is my second visit to the Norton Simon and I figured I’d finally write a review for it.While I believe the Getty has better architecture, gardens, and panoramic views, I believe Norton Simon’s collection of art is just as good if not slightly better due to its greater variety of art. Whereas the Getty mostly focuses on European art from the Middle Ages to the 19th century, the Norton Simon also has that, but includes later artists like Matisse and Picasso and is even more geographically diverse with its impressive collection of Asian sculptures (mostly from India, Thailand, and Cambodia) downstairs. At the time of this review, Rembrandt’s iconic Self Portrait at Age 34 was on loan from London and was the whole reason I came today as it is the first time it’s ever been displayed in the United States. I’m so glad I got to experience this opportunity while it lasted since it was the highlight of my visit! Definitely a nice place to take in some culture for the afternoon.\nShow less"], ["Reviewed 1 week ago", 5.0, "A true gem of a museum - stunning collection", "Worth a detour to Pasadena. One of the finest post-war private collections now in a public museum. Renaissance to 20th century and Southeast Asian art that are examples of the finest available. The museum is named after an industrialist who had the funds and the eye to select the best. Wonderful Impressionist to modern examples, not to mention outstanding examples of other periods. If you can't get to India, just go into the amazing Asian galleries.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Do it", "Really surprising. Lots of interesting artwork. Some are famous and seen in books. Takes a while to stroll."], ["Reviewed 2 weeks ago", 5.0, "Something for Everyone!", "What a gem! There is so much to see and the range of art covers so many regions and periods in history that it is a lot to take in but if you give yourself plenty of time you won't be sorry! There is also a sculpture garden outside where there is a pond, beautiful grounds! Stay for happy hour, it's a perfect setting!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Good selection of works from a range of periods", "We enjoyed this small museum. Conveniently located near old Pasadena, free onsite parking, lots of sculptures and a great selection of art. The outside garden with sculptures, pond and a little restaurant was a charming place for lunch. Food was simple but good."], ["Reviewed 2 weeks ago", 5.0, "Outstanding Art, Beautiful Museum", "Pleasantly surprised at the range and quality of art in this Museum. Why fly to Paris and work through the Louvre with this Museum in your back yard? Well-known painters and well organized by time periods. Loved the paint colors of museum walls that seemed to accentuate the paintings. The plaques on the paintings were outstanding, easy to read and understand, as opposed to the Louvre which was often confusing. We spent an entire day and could have spent another day. Museum cafeteria disappointing. Most of the entrees were “out” by the time we got through the line and what was left was mediocre. What I loved was the lack of crowds. We were visiting in December between Christmas and New Years and had entire galleries to ourselves to immerse in the art and feelings the art evoked. Parking was easy. All in all, extremely enjoyable visit and unbelievable art. Highly recommend.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "One of the best!", "I thought it was better and more intimate museum in LA, better than the Getty, great selection of art"], ["Reviewed 3 weeks ago", 5.0, "Visiting with family", "Once again I was very pleased with my visit to the Norton Simon Museum. This collection is stunning and invites a wide range of art enthusiasts to enjoy and appreciate gifted artist from the 14th to the 20th century. The visiting display on Rembrandt was magnificent.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Excellent collection!!!", "What an amazing collection of art through the years!!! Definitely worth visiting to some of the masters. Beautiful collection of early period Rodin sculptures as well. Highly recommend the trip to this museum to see a lot of highly acclaimed art."], ["Reviewed 4 weeks ago", 4.0, "Visited With a Friend, Decent Collection!", "Visited this location with a friend who is not only a local, but a contributor to the museum financially. Thus, we were granted complimentary access- and was impressed with the overall collection. I’m not very diverse with my knowledge base on foreign art and items- but this museum certainly has a widespread collection.\nShow less"], ["Reviewed January 22, 2018", 5.0, "We loved this little gem of a museum!", "I especially loved the garden and the inside is just wonderful as well. The art is beautifully displayed and that staff was welcoming and informative."], ["Reviewed January 19, 2018", 5.0, "Great for Gardeners with Nearby Arlington Garden", "Beautiful building, beautiful collection and wonderful gardens. If you are a gardener this is a wonderful place to visit. Huntington Gardens, Descano and Arlington Gardens are also wonderful Arlington is little known, but a free, 3 acre, beauitfully designed garden. NON-profit and maintained by community volunteers who must be very talented and passionate. Perhaps non-profit nature means it is not advertised so missed by tourists, but it is our favourite garden.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Beautiful collection", "An extensive art collection in an impressive setting. Easy to wander through the galleries and see a history of European painting. In a smaller location it makes it easy to see it all with very impressive works from as early as the 1300’s to contemporary. Boticelli, Rembrandt, Picasso, Monet, Van Gogh just to name a few. Beautiful sculptures in the garden by Rodin and Moore. Nice cafe overlooking the pond in the garden. Larger museums may be more complete, but can also be overwhelming. This was perfect.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Wonderful collection", "What a great museum, lots of excellent art from various periods. I enjoyed listening to commentary on my phone, the link is buried on their web page."], ["Reviewed January 13, 2018", 5.0, "The Norton Simon Museum is a true gem housing so many world-renoun art treasures from many historical periods!", "I am hard-put to find a family member, friend, community member or anyone who has visited The Norton Simon Museum who does not love it! While millions of TV viewers observe the building from the outside every New Year's Day as Rose Parade floats turn the corner from Orange Grove Avenue to Colorado Boulevard in Pasadena, most do not know that it is an amazing art museum housing the various collections of multi-millionaire art collector, Norton Simon; collections which span many historic periods. The museum is filled with treasures from numerous ancient statues and objects of art from Egypt and various Asian countries, to paintings of Rembrandt and Dutch Masters, to works of numbers of impressionistic artists including the Degas ballerina and female bather sculptures and paintings, to works of modern art. The outside surroundings of this museum are as beautiful and serene as those on the inside of the museum. Famous sculptors' works adorn the front entry area of the museum as well as the beautiful, quiet and serene lily pad pond and garden area at the rear of the museum. A small and lovely outdoor cafe is positioned in the lily pad pond sculpture garden area where one can not only enjoy hot and cold drinks, including wine and beer, lunch, snacks, and small bites but the beautiful natural surroundings; surroundings that provide one the feeling of being in a nature preserve oasis! While the museum does require entrance fees, my recollection is that there are child/student and senior reduced fees available. The museum offers entrance at no charge at least one day per month, and stays open late on a number of Friday evenings. It is important to check with the museum for special exhibits, entrance fee prices, days and times when there are no entrance charges each month, children's and adult's activities, classes, films, special tours and programs. I can guarantee that once you visit the Norton Simon Museum you will definitely want to make return visits!\nShow less"], ["Reviewed January 13, 2018", 5.0, "Peaceful Museum", "Wonderful gem in Pasadena! The collection has lots of great pieces (Van Gogh, Rembrandt, Picasso, etc) and it is definitely worth the ticket (15$). First Friday of every month the entrance is free after 5:00PM. Parking is free as well. The place is peaceful and the gardens around are absolutely gorgeous. I love the way the interior flows into the gardens. Highly recommend!\nShow less"], ["Reviewed January 7, 2018", 5.0, "BEAUTIFUL AND SERENE", "This museum is so beautiful with the statues and ponds. You really need a few days to really absorb the beauty. Rembrandt was on loan from London and really interesting. Looking forward to the next visit."], ["Reviewed December 27, 2017", 5.0, "Great museum in Pasadena", "It's one of the best museums in Los Angeles. A wonderful collection of classic and modern art, impressionists, and so on. Completely worthy!"], ["Reviewed December 26, 2017", 5.0, "A Hidden Gem", "I've lived here forever, but only recently visited the NS Museum. Reasonably priced and famous (you see it each year during the Rose Parade). When walking in the garden outside, one does hear the famous freeway, but it shouldn't damper your visit. Further, the cafe is quite nice and weather permitting (which is 350+ days/year), eating outside is quite enjoyable!\nShow less"], ["Reviewed December 24, 2017", 4.0, "Impressive trove of Impressionist paintings", "Unable to visit Paris? The Norton Simon will partially fill your Impressionist cravings until you can schedule a tour of the Musée d'Orsay, Orangerie Museum, or the Marmottan Museum there to view work by some of these artists works in their country of origin."], ["Reviewed December 22, 2017", 4.0, "Interesting museum with lots of old masters", "This is a pleasant museum in Pasadena to spend a couple of hours at. The building is well laid out. There's lots to see."], ["Reviewed December 21, 2017", 5.0, "A Must See", "A treasure of a museum! Small and intimate by comparison to most with an extraordinary art collection that will make you feel you are enjoying a surprise meeting with an old friend around every corner. Don’t miss a stroll in the beautiful garden as well."], ["Reviewed December 21, 2017", 5.0, "Best Museum for Impressionistic Art", "Most people know the Norton Simon Museum because for decades it has served as the backdrop for the New Year's Day Rose Parade. But next time you are in Pasadena don't just view the Rodin's from on the outside, spend half a day inside.\n\nThe heart of the exhibit is the private collection of business man Norton Simon and his second wife, actress Jennifer Jones. Their personal collection is so extensive the present venue cannot display all the wonderful art. This means that the collection is constantly rotating so if you went to see a favorite Degas in June, you may find it replaced by a Monet in December. This is a good thing. There's always something new to explore.\n\nIf you, like myself, are partial to the French Impressionists then you will be totally happy for they are all here! There are no big crowds and no rush. This too is a good thing.\n\nThe Norton Simon also has a lovely cafe and a small garden to wander through. And while you are there you will want to check out their lecture series. So next time you are in Pasadena, do check out the Norton Simon Museum.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Hidden Gem", "You will be very pleasantly surprised by the wonderful collection. This is one of the places locals visit often. Tucked away in Pasadena. Enjoy the museum and then a fine dinner in Pasadena."], ["Reviewed December 17, 2017", 5.0, "Lovely collection.", "I’ve been coming back to this museums for decades and love it. It’s not too big but has a pretty extensive collection covering the old master painters to the modern. The garden is lovely and a good place go get some snack and proseco. Currently on display, Rembrandt’s etchings are pretty great. Highly recommend.\nShow less"], ["Reviewed December 14, 2017", 5.0, "It won’t disappoint you", "Awesome world class museum right here in Pasadena. Great collection as well as traveling exhibitions. Great for all. Stretch you brain. Go into the right hemisphere and enjoy what life truly has to offer! Become a member support what truly matters."], ["Reviewed December 2, 2017", 5.0, "Just a lovely place to visit...", "I had recently gone to the Getty Center Museum with friends and that was awesome but REALLY BIG-the Simon museum is very do-able in a day, has some amazing pieces by Degas and Van Gogh, a great gift shop and truly beautiful garden. Monet would have loved it...\nShow less"], ["Reviewed November 30, 2017", 5.0, "A 'must-see ' place", "A wonderful collection of art and artifacts, it's a must-see place for young and old. Plenty of parking and a friendly, knowledgeable staff."], ["Reviewed November 28, 2017", 5.0, "A truly scenic strill", "Impressive collection European grand Master works and Asian art. Make a point of watching the 30-minute documentary about Norton Simon: it provides nice historical and biographical context that explains how one man’s passion became this museum."], ["Reviewed November 28, 2017", 5.0, "Check out the Asian art", "Fantastic museum! Not terribly large, but I've been twice and still haven't seen everything. Usually has a couple of nicely curated small temporary exhibits. Sculpture garden is pleasant, but not exceptional. Impressionist exhibit is great, but i thought the outstanding portion of the collection was the gallery of Asian art. Parking is free and easy. Students are free. Staff is friendly and helpful. A wonderful experience.\nShow less"], ["Reviewed November 21, 2017", 5.0, "An excellent art gallery set in a beautiful sculpture garden", "I was very impressed with the art collection, particularly the late Impressionist collection. the sculpture garden is beautiful - be sure to take the free guide which will tell you about both sculptures and plants. Best to visit in all seasons."], ["Reviewed November 17, 2017", 5.0, "What a jewel!", "Easy free parking right at location, beautiful gardens with Sculptures and great foliage, good lunch available with beer and wine! Great little gift shop, a lot of modern masters, Van Gough, Picasso, and the Impressionists, a lot of 16th Century Dutch painters, really good for a slow, adult, romantic date! Strange little film about Norton Simon in the Theater there, that's worth seeing, (and its free)\nShow less"], ["Reviewed November 14, 2017", 4.0, "A long time fixture of Pasadena.", "I have lived in Pasadena for over 30 years and I have seen the museum go through major changes. Its still a great little museum with a good ambience.\nUnfortunately, for my own desires it was transformed from a Contemporary or modern art museum into a more accessible art museum. I was truly hoping that it could have maintained and built up the Contemporary art pieces as a fixture in Pasadena. Much of the modern collection disappeared slowly.\nNever the less a great spot for art.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Just Wonderful!", "This museum is a trifecta - the art, the setting, and the gift shop are all terrific. The gardens are lovely and a pleasant place to enjoy a cup of coffee or snack. The Degas sculptures are unmatched . The Asian art and buddha exhibit was breathtaking in its content and curation. We also loved the gift shop and bought a terrific art game for our granddaughter. The icing on the cake is that parking is free!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Second visit in 25 years....I waited too long!", "Yesterday we made a trip to the Norton Simon museum, which I had last visited over 25 years ago. Then, as now, the building and the grounds are beautiful and peaceful. (Try as hard as you can to ignore the freeway sounds coming from the 210.) We had time only to visit part of the museum (19th and 20th century art) on a visit that lasted several hours. We have visited many museums all over the world and agree that the labels on the wall beside the art work provide more than the artist name and date created. They give phenomenal background and details regarding each piece, written so well and in such a way that it impressed us enough to mention it here.\n\nWe visited on a Saturday, so the museum was busy with many multi-generational families--so nice to see. It seemed there were also groups of art students visiting with their instructors. The volume was louder than we would have liked, but one would expect that on the weekend.\n\nThe line for lunch at the outdoor café was long, but we stayed strong and waited for a good 20-25 minutes only to find a number of food options had run out. The only criticism I have for the Norton Simon museum is to encourage the vendor to better anticipate customer numbers, especially on weekends.\n\nThe outdoor garden is stunning. Take a walk on the winding path around the pond and point out all the plants, sculptures, and ducks to your children or parents. :)\n\nThe cost to visit--$12 adults, $9 seniors, free for children, students and active military with ID--is generous considering the quality of work represented. While our return to the Norton Simon museum will be much sooner than the previous span in between visits, we will definitely return again to see more of this high quality \"attraction.\"\nShow less"], ["Reviewed November 12, 2017", 5.0, "A surprise every time.", "Visiting here just once or 365 times a year will reward your soul and body. There is always a new surprise in every part of the large park and museum complex. You could spend your whole visit outside roaming the famous park sections from giant cactus garden to rose garden to Camilla path. Or hit the special exhibits and permanent collections of WORLD CLASS art. Or do some of both! If you live close enough, your going to want to be a member so you can follow your favorite plants through their seasonal changes and not miss the free lectures offered after closing.\nShow less"], ["Reviewed November 11, 2017", 5.0, "World class museum", "This museum has everything to offer! I have specifically enjoyed medieval European paintings in this museum. Spend an early morning in this museum or visit during the late evening for a couple of hours, either way it's a mesmerizing experience."], ["Reviewed November 10, 2017", 5.0, "Wonderful and extensive collection", "We spent a morning here and wished we had more time. The main floor is Western art, with a vast collection of Impressionists and Post Impressionists plus artists from earlier centuries, including my favorite Rembrandt. We had to skip the lower floor which was dedicated to Asian art due to time constraints, but we will definitely return on another trip. The sculpture garden is beautiful, mostly Henry Moore's but others as well. We really enjoyed our visit.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Wonderful collection. Relaxing garden.", "I love the Norton Simon museum. The permanent collection of art is superb. Mr. Simon had quite the eye for art. The rotating exhibits are fresh, inclusive, interesting, and provide for a really cool experience. The sculpture garden is a lovely place for a stroll then enjoy a delicious sandwich and a glass of wine in a peaceful setting. You simply must make your way there.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Fabulous art.", "Small but delicious art museum. Some treasure for everyone. Abit of French, Dutch, Asian, Sculpture, a real treat."], ["Reviewed November 9, 2017", 5.0, "My favorite.", "Is it the biggest? Is it the most famous? Is it the richest? Is it worth going to? It is one of my favorite museums in the WORLD. If I did no live in Southern California I would have to come to just go here."], ["Reviewed November 9, 2017", 5.0, "Great set collection and beautiful sculpture garden!", "this museum rally has it all. It has beautiful sculptures of Rodin, Maillot, and it garden looks a bit like Giverny. Inside there are great works from Asia, European paintings such as Albrecht Durer \"Adam and Eve\". Modernist paintings: Rothko, etc. A ver eclectic\ncollection and beautiful for a midsize museum.\nShow less"], ["Reviewed November 4, 2017", 4.0, "excellent", "busy sat. afternoon--great weather to enjoy the gardens. Of course, the exhibits are good. parking can be tight but doable. the museum shop was a good one. great choice of a few hours destination"], ["Reviewed November 4, 2017", 5.0, "Fabulous Collection", "This is a relatively small museum with a fabulous collection, very close to Old Pasadena. We spent about 3 hours there and were museumed out, but will go back for sure. They have a lovely sculpture garden with lots of Henry Moore sculptures, a small pond and a café. A great place to take a break.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Great Art Collection", "A beautiful setting with an amazing sculpture garden in the back. Hard to believe that the majority of the art collection came from one person, Norton Simon, a very wealthy businessman."], ["Reviewed November 4, 2017", 5.0, "A must", "The museum is a must to visit for all art lovers. Not huge but top class collection. Very pleasant to see and contemplate high art. Highly recommended."], ["Reviewed October 27, 2017", 5.0, "Excellent Curation & Presentation", "If you are interested in art, find a way to visit the Norton Simon. I was able to spend only a couple of hours there, and I will definitely be going back. It's a small museum with an excellent collection, nicely arranged in a series of room with very good lighting. There's also an outdoor sculpture garden, which is outstanding. Admission is free for children under 18, students with ID, and active duty military with ID.\n\nThis museum is about 10 miles east of Griffith Park, easy to find, and has it's own parking lot. You can get detailed information about hours, admission, events, etc. and also preview some of the collection at the museum website. TripAdvisor does not permit links in reviews, but you can find the website easily enough using a search engine.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Great exhibits of masters", "I am not an art lover, but truly enjoyed our visit to the Museum. The art work was great. The pictures were within inches of easy viewing."], ["Reviewed October 12, 2017", 5.0, "Amazing and very Broad Collection - didn't know it existed", "We came to Pasadena to visit the Gamble House (just up the road) and consulted with TripAdviser to see what other attractions were around.\nThe Norton Simon Museum - which frankly we had never heard of before - was a quite staggering find - we could have stayed there all day.\nLoved the gardens, sculptures and the well-sited snack area.\nBroad Collection of European Art - with most well known artists well represented. Don't miss the Basement and the Eastern Art.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Museum", "Excellent lace to visit if you have never been there. It has its own parking and is an iconic building"], ["Reviewed October 10, 2017", 5.0, "Lovely Gem of a Museum!", "I love the Norton Simon! It is a small museum that is very manageable and contains some paintings(by well-known artists) in it's permanent collection which I had never seen before, such as VanGogh's Mulberry Tree! The setting is full of light and the garden is lovely. It is a wonderful place to spend several hours with friends culminating with a garden walk and a little something to eat at the outdoor cafe!\nShow less"], ["Reviewed October 3, 2017", 4.0, "Very fine collection", "Museum staff is helpful and grounds and museum are impeccably managed. There is an exceptional museum store for finding special gifts for fellow art lovers"], ["Reviewed October 3, 2017", 5.0, "Great Gem in Pasadena", "The museum is relatively small but has a great collection of various art forms, (painting, sculpture)."], ["Reviewed September 26, 2017", 4.0, "Wonderful Little Museum", "This is a not-so-small museum in Pasadena. It's in a very nice building which seems fairly new. There's a wonderful garden and cafe out back.\n\nI went mainly for the Galka Scheyer (a promoter of modernism) exhibition (now closed), which was really quite good.\n\nI'm from the East Coast, so I don't really know the area. Pasadena seems to be an upscale community, and they've built themselves a museum to be proud of.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Norton Simon", "Since our last visit 10 years ago, this art gallery has only improved. It is set in beautiful lush grounds in Pasadena. Entry fee is very reasonable and staff are friendly. Old Masters and Impressionists are especially well represented, but there is a wide range of art. Everything is well explained in detailed captions. There's also a free audio guide which we did not use. Outside, there's a lovely pond with a nice cafe and plenty of shaded seating. Staff in the entire museum are friendly and helpful. A special exhibit downstairs was just ending. It was excellent and whatever follows it is sure to be worthwhile. There's a very extensive collection of Asian art, especially sculpture, which we did not have time for.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Lovely, small museum", "We needed a destination for Uber to get us to Pasadena, so picked this museum almost at random from a magazine in our hotel room. Since were dropped at the door, we opted to go in - and were glad we did. They have a nice selection of paintings, a relaxing sculpture garden, and it's small enough that you can see everything in one visit.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Excellent!", "This beautiful museum has a fantastic lay out with lots of natural lighting. The art ranges from the Renaissance to contemporary and is of high quality. The sculpture garden is of a rare beauty. Downstairs there's another floor filled with asian art. The number of Rodin sculptures in the garden is astonishing. Only lacking Wi-Fi.\nShow less"], ["Reviewed September 23, 2017", 4.0, "A great museum but not too welcoming", "Impressive variety of world class art including impressionists, Asian art and figures, a Botticelli, a Raphael, a Van Gogh (Irises) and Rembrandt. The gardens are somewhat small compared to the Getty. The oils are behind protective glass (!) and the guards are not very friendly; for example, don't lean against the walls. Our docent did a mediocre job in her selection and explanation of a few works. Average food service options.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Great art easy to view", "We arrived around 1pm on a Wednesday. Parking is free and ample. Entrance for seniors is $9 so really a bargain. Great art displayed in a way it is easy to view. We paid $3 for the audio tour and it is worth the extra $3. This is a jewel right off the freeway so it is not hard to find. The basement has asian art and it was very informative. There is a small but lovely garden area with a small cafe with food and drinks including wine and beer. We spent about 3 hours and while we did not see everything we were able to focus on our interests. We highly recommend this fi you like art.\nShow less"], ["Reviewed September 6, 2017", 5.0, "A Small Museum with a Big Soul", "The Norton Simon Museum is a treasure hidden in Pasadena. Compared to the Getty, both of them, the Los Angeles County Museum, and most major museums, it is little. Perhaps “intimate” is a better word to describe its presence. To my mind, it has the finest art collection on the west coast, or possibly in America.\n\nIt has an excellent Asian collection, and it contains extraordinary impressionist and post-impressionist paintings.\n\nAmong the works I find most captivating are Rodin’s Burgers of Calais in all its august grandeur and the matter of fact and quiet eloquence of Zurbarán’s Still Life with Lemons, Oranges, and a Rose. Between these two, very different works of art, one can find a full range of human expression.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Superb European collections for a small museum", "I went back for a visit this past weekend when it was 100+ degree. What a pleasant refuge and what a feast for my eyes. However, after two plus hours of European art, I could not translation over to the Asian collection. So I will be returning to see the sculpture garden and the Asian collection when I go back to Pasadena.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Large art collection in seemingly small building", "What an impressive art collection that the Norton Simon museum houses. It had been eighteen years since my last visit to the NS and oh my, I had forgotten what a wonderful and varied collection of art work the museum offers to the public. I was at the museum for four hours and did not get a chance to see all of the collections and to enjoy the beautiful statue garden. The entrance price is only $12, but the beauty of the art is worth millions!\nShow less"], ["Reviewed August 29, 2017", 5.0, "Excellent!", "We we're staying with friends in Pasadena and found this place just down the street. Great art galleries, easy to wander around, good air conditioning, it was very hot outside, and a plethora of wonderful paintings and sculpture, a great way to spend a few hours, far from the madding crowd, and they sell beer.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Very Quaint", "This museum may be small, but packs a nice punch. The museum is very clean, very quiet and has a very pleasant staff. Restrooms are clean, the displays are well illuminated and spaced and you're able to sit or stand and actually enjoy the art.\n\nThe grounds are well kept and its a very relaxing atmosphere. Very calming.\nShow less"], ["Reviewed August 27, 2017", 5.0, "don't miss this gem", "Fantastic small museum with European and Asian art. Saw some Van Gogh paintings we'd never seen, even in huge traveling exhibits. The garden is charming. Amazingly, our art-loving friends from L.A. have lived there for 5 years and had never gone here, and they also gave it a big thumbs-up.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Simply spectacular", "This is an amazing museum. The collection is excellent, the building spacious and the setting is ideal. It is a gem of Pasadena. Easy parking too."], ["Reviewed August 19, 2017", 5.0, "Chess Night", "I became a member because my son is an avid chess player & now through September there are chess matches in the garden on Saturday evenings.\n\nThe garden setting is beautiful; there is happy hour on Saturday evenings and I have the opportunity to relax & read my book.\n\nAfter a couple of hours playing chess & reading, we explore a new section of the museum.\n\nAll of the staff has been welcoming and I love being able to relax!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Lovely and easy to explore", "From pre-Renaissance to modern, this easy-to-explore museum offers a range of interesting paintings and sculptures. My favorite is the Impressionists. Lovely Degas sculptures and paintings, Cezannes, and van Goghs are easy to see and linger over."], ["Reviewed August 16, 2017", 4.0, "Really peaceful walk", "Great art museum, we really loved the sculpture garden. We travelled for 12 hours and found sculptures by Henry Moore , amazing."], ["Reviewed August 8, 2017", 5.0, "Excellent impression!", "Great museum with fantastic Impressionist art and a nice rotating collection of Old Masters. Sculpture garden is fun and there's a nice cafe. Easy access from Old Town Pasadena."], ["Reviewed August 8, 2017", 5.0, "Hidden Jem", "Great collection. No crowds, beautiful art, easy access. Its a great few hours for anyone interested in the arts."], ["Reviewed August 5, 2017", 5.0, "Great French Impressionists Collection", "If you are a fan of Degas, Monet, Manet, Renoir, etc., you will enjoy this museum's collection. Make sure to stroll through the beautiful sculpture garden and catch the 20-minute Gregory Peck-narrated movie about the life of Norton Simon and his art collection. Admission price is $48 (7/2017)\nShow less"], ["Reviewed August 4, 2017", 5.0, "First Friday Free is a great promotion", "Norton Simon Museum offers Free admission after 5PM the first Friday of each month. The museum offers a large impressive collection with periodic new collections.Well worth the time to visit"], ["Reviewed July 31, 2017", 5.0, "An amazing collection of art from all corners of the world", "This was a memorable day for me in many ways; the lady that I was dating was a very astute art aficianado, and had offered to guide me through the Norton Simon, a place that I hadn't visited in years. We started in the Indo/Asian section, and I enjoyed visiting with Hindu and Buddhist Gods and Demi-Gods that I had met long ago. In the European collection, I reveled in the many works from Degas, Van Gogh, and many Dutch Masters. It's a wonderful collection, every art lover will find something to thrill them. As we left, we stopped at some of the magnificent bronze statuary in the forecourt of the museum, finding bronzes of Chaucer, Rabelais and Balzac; which inspired us to join in a chorus from \"The Music Man\"! We kinda made a connection there.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Small and beautiful", "I love this place. It's pretty small and easy to see everything it has to offer in just a couple of hours. There are quite a few famous pieces here and the sculpts in both the front and the outside garden area are fantastic. A really lovely museum and definitely worth a visit!\nShow less"], ["Reviewed July 22, 2017", 5.0, "There aren't enough stars to say how wonderful the Norton Simon Is", "The Norton Simon is one of the States top collections, and it's hard to imagine a trip to this region without stopping in. And by stopping in, I mean going with the knowledge that you'll need time to absorb the depth of the collection. There's ample free parking and a modest admission charge. For the convenience of the parking and your support of the collection, you get access to some of the finest European paintings and Asian art anywhere. Do leave yourself time to walk the wonderful garden. It's simply breathtaking at every turn.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Beautiful, Beautiful, Beautiful!", "First time I came here was for a high school project. Ever since then, I love to visit this museum when I have a free day and need a beautiful space to relax in. Norton Simon Museum is not as huge and overwhelming as Huntington Library. You can finish the museum in a day. I really enjoy the Lily Pond.\nShow less"], ["Reviewed July 19, 2017", 5.0, "First Fridays are free!", "I come here with my father in law on Friday evenings to get inspired for the weekend. First Friday of each month the museum is free and open to the public so we love wandering the outdoor sculpture garden and saying hello to the permanent collection as well as visiting shows. This is a great outing for adults and kids who enjoy art.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Free night is the best deal ever!", "The first Friday evening at 6pm, the museum is free until closing time....what an awesome gift to us to see the works of monet, manet, degas and van gogh...plus an Asian collection that will blow you away....the first Friday of each month at 6pm.....so good!"], ["Reviewed July 18, 2017", 5.0, "A treasure trove!", "Though I live only ten minutes by car from the Norton Simon, I only recently went there for the first time with an out-of-town visitor. It's a beautiful museum indoors and out, with countless well known pieces from some of the worlds best known artists. I'm ashamed of myself for not having gone sooner, and I won't stay away too long either, now that I know what I missed all these years. It's not a small museum, nor is it so large that it exhausts you to see a mere fraction of it. I highly recommend a trip to the Norton Simon for locals and visitors alike.\nShow less"], ["Reviewed July 11, 2017", 4.0, "Great European and Asian Art", "Nice Museum - Start with the movie that goes through the history of Norton Simon who started as a business owner during the industrial age and then became an avid art collector. You can then get a perspective of the art collection. What is not well publicized is that the art that is displayed is only the tip of the iceberg. He has a collection of 11,000 pieces, so that the museum has rotating exhibits to display some of his stored works. Plan to spend 3-4 hours at the museum.\nShow less"], ["Reviewed July 10, 2017", 5.0, "My favorite place for Sunday lunch or an early evening glass of wine", "The Norton has a small but exquisite collection, especially Van Gogh's and Degas'. But the garden cafe is a true gem. Set in the sculpture garden which has a beautiful pond, the cafe us a great spot for a quiet lunch. The museum is open until 8pm on Friday. Nothing more romantic than a glass of wine as you watch the setting sun work its magic on the garden.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Fantastic museum", "Thoroughly enjoyed our trip to the museum. Very well maintained and easy to navigate. Great time was had by all!"], ["Reviewed July 10, 2017", 5.0, "A place of art and beauty", "This is a place where art, history and geography are beckoning to take you into what beauty and aesthetics have been through ages and parts of the world.\nTake your time and enjoy it.\nAs a premium you may treat yourself to a stroll in the meandering small garden around a pond of water lilies a la Monet.\nI may be partial to this place of which I am a member and visit to take refuge in beauty.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Great Collections", "The garden area is especially beautiful and peaceful with exceptional sculptures. Inside the collections are exquisite. Taking photos without flash is allowed. Parking was very easy. I spent 3 hours enjoying the art and renewing my creative interests. So glad I went!"], ["Reviewed July 8, 2017", 5.0, "An unexpected treat for any lover of art", "If you go to the Norton Simon any day you are in for a treat - a number of beautifully arranged galleries with masterpieces from the 16 to 21st century, plus a very fine collection of Asian art occupying the floor below the main floor. Surrounded by a beautiful garden. Go there during the week and you will feel like you have the place to yourself. You really should go, it will do your spirit good.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Small museum with a great collection", "We visited this museum with a teen aged granddaughter who likes impressionistic art. There is plenty of parking and admission was free for those under 18. We spent about 2 hours inside where they have a great collection of pieces from well known artists such as Van Gogh, Degas and Monet. Outside is a sculpture garden and beautiful lily pond.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Make time for a visit", "The Norton Simon museum is not to be missed. Mr. Simon built an incredible collection of pieces from many different genres."], ["Reviewed June 26, 2017", 5.0, "Great museum! Outdoor cafe", "Stopped by this museum the day after seeing U2 on our way back home.\nAmazing unexpected art collection and nice outdoor garden with Henry Moore sculptures and a little outdoor cafe to have some lunch and wine. We didn't have a lot of time, so we did not see the Asian art downstairs.\nGalleries are laid out well. Very cool, worth a visit and would return.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Great works of art in a small setting that makes it accessible for all", "I enjoyed walking through the halls and tracing the history of painting from the 14th to the 20th centuries. My favorites were the earlier works up to about the 17th century. Although there were security people watching at every turn, you could walk right up to the artworks and take non-flash photos. I would have loved to have had more time to read each of the descriptions. We had a little under 2 hours to look over the four wings upstairs and to view the Asian sculpture exhibit downstairs. It was quiet and cool in the museum. If it had not been such a hot day, I would have liked to roam around the sculpture garden. I highly recommend visiting this museum. My friend who lives in Pasadena had not been there and was really impressed.\nShow less"], ["Reviewed June 21, 2017", 5.0, "This is one of the Top Art Museums in the world, a must see.", "Ten stars if possible. Great museum with paintings and sculptures from the Great Masters. This museum houses some of the greatest artworks of mankind and is a pleasure to visit.\n\nThere are also outside sculpture gardens and a pond that make the experience even more great.\n\nDo not miss the ancient Asian exhibit or the special exhibits on the lower level.\n\nPlenty of on site parking, low entry cost, and ease of freeway access makes this a perfect stop for the art enthusiast and traveler.\n\nSpecial thanks to the staff member that found my camera case that had dropped out of my pocket and then searched for me to return it.\n\nSuper clean bathrooms, helpful people at each exhibit, and security that rivals Fort Knox make this museum a good visit.\n\nBe sure to allow two to four hours or more, and be sure to bring your camera {NON-Flash photography is allowed}.\nShow less"], ["Reviewed June 21, 2017", 4.0, "Small Museum", "This local museum highlights the history and evolution of paintings. The buidling is arranged in a large H and easy to get around.\n\nThere were many early American portraits that I found unappealing as the heads were too big for the bodies and the childrens faces looked like old people. But thats the collection, not the facility.\n\nThere are small outside areas, to purchase and eat food/beverages. We purchased a small split of wine ($30), price seemed excessive for a glass of wine.\n\nIf I had to choose a local museum I would select the Huntington Library and Gardens instead.\n\n\n\nShow less"], ["Reviewed June 18, 2017", 4.0, "Lovely Gardens with Sculptures, great european art inside", "From Cezanne to Matisse to Pisaro , this Museum has a nice assortment of Impressionist Art.\nAlso was impressed by the Marlene Dietrich Movie about a Woman on a Train..and a reconciliation of sorts. All in all, even the geese and ducks in the Garden were welcoming and it was a Haven of Serenity amidst the hustle and bustle of Los Angeles. I took the Orange Line from Union Station LA about 20 minutes.\nShow less"], ["Reviewed June 17, 2017", 3.0, "Small Art Museum", "Apparently they place great value on ultra modernism. Though, they do have a selection of other styles. Over zealous security watches every move you make. If you are short on time, there are much better museums close by and several better in the Greater Los Angles area.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Excellent Private Gem", "I try to go to the Norton Simon museum at least 3 times a year. It is compact sized space, located in civilized Pasadena on the cusp of Old Town. Its collection of first rate art, impressionism, some old masters, post impressionism, modern are an eclectic mix. The gardens are lovely. It does not overwhelm in size and features great exchanges and exhibits from other museums. I would rate this as similar to The Frick in NYC.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Great museum", "We so enjoy visiting various museums. This one also had a little place where you could get lunch. Children could also go there on field trips."], ["Reviewed June 10, 2017", 5.0, "Truly a hidden gem!", "My title is exactly how I felt after spending several hours here with my 2 children, ages 11 and 14 and my parents. The only question I had was \"why didn't I come here sooner?\". This place is fairly small (especially when compared to the Getty or LACMA) so it doesn't feel overwhelming for you or the kids. There are some big names here such as Rembrandt, Raphael, Cezanne, Monet, Van Gogh, etc... There were several pieces of art that I recognized as being famous even if I didn't always recognize the names. The collection for the most part was arranged in chronological order, kind of interesting. They have paintings dating back to the 12th century! Adults are like $12 I think, students with ID are cheaper and I believe kids under 12 were free.\nThe kids were pretty good about trying to learn about some of the art by reading the plaques but I wish I would have invested the $3 for each of us to have a hand held audio device you put to your ear, punch in a corresponding number for each piece of art and then learn about that piece. That would have been nice because you can jump around from piece to piece and just hear about the ones that interest you. If you have kids with you that are least 8 and up, I would highly recommend doing this, it will make it more interesting and easier for them to enjoy the art.\nThere is a lovely garden and cafe on sight. With kids, even older ones, I'd highly recommend planning a break at the cafe for lunch. Their food was expensive but also very good. I'm sure you could also bring some food in your own bag and no one would really notice.\nThey are extremely strict about having foods and liquids near the art! When you enter, if they see you have a water bottle, you will be asked to check it (they have a coat check-like desk). You can go back anytime during your visit and get a drink, it really wasn't a big deal. If your bag is over a certain size (like a back pack), you will need to check it (this may include large diaper bags, not sure).\nI would highly recommend you see the 30 min documentary about Norton Simon in their small theater. It was very well done and very interesting. They highlight certain art pieces in the exhibit (such as the ivory elephant chess set near the gift shop and the beautiful still life by Zuburan of lemons, oranges and tea cup and the picture of a child by Rembrandt.) If you try to show the kids some of the pieces highlighted in the film, they will be excited to recognize them while they watch it OR, see the film first and then make it like a scavenger hunt to find the pieces highlighted in the film. This would be fun actually! But we didn't see the film until 3:00, which was after we saw the art.\nOur group was there for about 4 hours and yet we only saw about half the collection and none of the special exhibits. We took almost an hour at the cafe and garden plus the film and I didn't want to exhaust the kids or get to the point where they were begging to leave.\nWe all enjoyed it and I can't wait to return sometime to see what I missed plus I will rent the audio device next time for each person. They don't open until 12:00 and their food is very expensive, so consider eating an early lunch before you go, but definitely take a break in the garden and cafe! Enjoy...we certainly did!\nShow less"], ["Reviewed June 6, 2017", 5.0, "A Jewel in Pasadena", "I have long felt that the Norton Simon is one of the best art museums in the country - and definitely my favorite. Very tasteful, engaging exhibits. In particular, not only do I like the collection, but I appreciate the architecture and intimacy of the museum itself. Definitely worth a visit for any art lover in Pasadena.\nShow less"], ["Reviewed June 1, 2017", 5.0, "I'm in heaven in my own backyard.", "One of the best museums in the world. Easy to park and get around. Magnificent gardens to meander around with lovely statues. Highly recommend for a few hours well spent."], ["Reviewed May 24, 2017", 5.0, "Morning looking at paintings in the Norton Simon Museum and walking in the garden in October 2015", "I arrived before it opened and was amazed to see how large their staff number was. They all arrived on time and uniformed and I found once inside were extremely helpful. There was parking there although I was dropped off.\nInside were marvelous paintings, many of which I had never seen before. Van Goghs and two gems of Boudin seaside scenes, gifted by the late Cary Grant. Other paintings by Degas, Renoir and Botticelli amongst many well known names.\nIn the gardens are Rodin statues, they may have been genuine but I did not have time to ask before I left. They certainly looked it.\nThe impressionist and post-impressionist styles are so well represented that I would have liked another morning there.\nThere is a restaurant which I did not eat at, but it looked as if it offered everything a traveler would need. The lake and plants in the garden have been designed to resemble Monet's garden in France and were very attractive with irises around the banks and taller species of trees behind them.\n\nThere were plenty of staff to guide one and as I left I was given a large photograph of the lake surrounded by flowering irises as a memento of my visit. This gallery is on the edge of the main streets of Pasadena and was a short taxi drive from where I stayed in that suburb. Small groups of students were being shown around but they were so quiet you could have heard a pin drop.\nThis is definitely a place for the seriously interested art addict rather than for young children although they would enjoy the garden.\nShow less"], ["Reviewed May 23, 2017", 5.0, "hidden gem", "great collection and a beautiful building and grounds- worth a visit for sure- can't believe I've been coming to visit the area for 4 years and only just discovered this museum"], ["Reviewed May 22, 2017", 5.0, "Favorite local museum", "The Norton Simon Museum is one of the best places to visit in Pasadena, if you love great art, sculpture and beautiful gardens. It is not a huge place, you can see everything within a few hours and enjoy a snack outside on the patio overlooking the pond and surrounding garden. We love to visit this museum, it is a real jewel.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Relaxing afternoon of art", "My husband and I came here with my friend who is from Idaho. We all enjoyed it very much. Tickets are $12 for adults and free for those with a student ID. They have a great collection of art from Italian Renaissance to Modern and Picasso. The sculpture garden is beautiful and relaxing. There's a small cafe in the garden where you can have lunch or drinks with friends.\nShow less"], ["Reviewed May 20, 2017", 5.0, "Neighborhood museum", "I live nearby, so I visit often. My favorite thing is to sit in the garden and have a drink. So peaceful. The art is great. I love the Degas' as I have an affinity for dance/dancers. Wide range of art with amazing temporary exhibits coming and going. Museum store has fun and unique gifts.\nShow less"], ["Reviewed May 19, 2017", 5.0, "Great collection and a beautiful location", "A must see in Pasadena. Strong Asian sculpture collection and a terrific impressionist collection. A great way to spend an hour or so. Recommended."], ["Reviewed May 16, 2017", 5.0, "A wild-life friendly Museum", "There will be many reviews about the arts, services, events, and the garden but, my review is about an unplanned incidence that shows the HEART of the museum. I was visiting one day during the early spring of 2017 and saw a fairly good portion of the garden was fenced off including one of my favorite stone bench. Since I frequent the museum so I know this is truly unusual. But than I saw them... A proud daddy duck standing on \"my stone bench\" watching over the dedicated mommy duck sitting on her eggs about 20 feet away. Although \"my stone bench\" was covered by duck ..... droppings.... I was so touched. This is a Museum with a heart.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Great museum in a good location.", "Enjoyed the entire collection in a limited amount of time (coupleof hours). Also enjoyed the outdoor dining area and statue garden with attractive pond."], ["Reviewed May 15, 2017", 5.0, "Great art in fabulous setting", "Gem of a museum. Love the special events: concerts and movies. The outside space makes the museum all the more delightful"], ["Reviewed May 14, 2017", 5.0, "Wonderful Way to Spend an Afternoon", "Visiting the Norton Simon recently took me back into a world when the great Masters\nwere taking a brush to canvas. The Museum is laid out in comfortable style with plenty of open space for optimal viewing. There are also lots of seating benches to allow you to reflect on a painting you may happen to enjoy.\nBe sure to watch the 30 minute movie on the museum's founder. It's quite worthwhile.\nShow less"], ["Reviewed May 12, 2017", 5.0, "Lovely lunch in the Garden Cafe", "Everyone else went to the USC graduation, but we were excused, so we met friends for lunch here today. It was cold and overcast, and we were quite worried, as there are no indoor tables. Everything is outdoors. However, it cleared up a bit, and this area is so sheltered, that we sat there for three hours without sweaters, and had a lovely time.\n\nMy husband and I shared a \"Smoked Salmon on Brioche\" sandwich, and we each had a beer. Our friends, who had driven up from Redondo Beach (and had to drive back), drank coffee with their 3 cheeses grilled sandwich. We also shared a piece of the freshest Lemon Merigue Pie for dessert. The food was delicious.\n\nWe got there early, and snatched a waterside table for four. A flock of Canadian Geese has decided to nest in that pond area, so security stayed alert that visitors don't get too close, as those geese can be bad tempered if they feel that their eggs are being threatened.\n\nIt was such a treat visiting with friends in this lovely setting. We were the first to arrive, and the last to leave. This Cafe has many tables, and they were all taken the entire time that we were there. No admission charge to go to the Cafe or the Gift Store.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Stunning Museum", "The Norton Simon is one of the most beautiful museums I have ever visited, with a world-class collection of art. I'm always surprised that it is not more busy. The gardens are beautiful and the cafe is excellent. The 19th Century art collection is not to be missed and the early 20th Century pieces are exceptional.\nShow less"], ["Reviewed May 5, 2017", 5.0, "When in PASADENA & You like Art!!!!!!!!", "This is a great museum & great location .......... you will find some surprise exhibits here ~~~ a must for day cation."], ["Reviewed May 3, 2017", 5.0, "Great Museum", "The Norton Simon is just the right size and contains numerous gems. It is small enough to tour within a couple of hours without incurring \"museumitis\""], ["Reviewed May 2, 2017", 5.0, "A Highlight of My Trip to The San Gabriel Valley", "A wonderful museum - Was able to see Rotari's Muses. It was excellent. The Simon art is also wonderful. If you are in the area very worthwile"], ["Reviewed April 19, 2017", 5.0, "Great museum", "Visited here many times and I should go back again soon! Lots of classic art to look at, the parking is kinda small but I never had a problem finding a spot."], ["Reviewed April 18, 2017", 5.0, "Giverny in Pasadena and a Lot More!", "Why did I wait over 10 years to revisit this lovely museum? Have no idea. So glad I went back.\nWe started inside with the old masters, quickly moving through 6 centuries of paintings--from the 14th to the 19th--which while grand to some were mostly dark and grumpy to us. Different strokes and 31 flavors, ya know.\nReaching the 20th century works we were happy. Lots of creative modern art. There was also a special exhibit \"Maven of Modernism, Life and Times of Galka Scheyer\" featuring the life, times and art of this amazing woman--art entrepreneur, dealer, lecturer--who brought modern European art to California. We were fascinated to learn about Galka.\nThence to the Sculpture Garden, one of the most amazing cultural oases in Greater Los Angeles. No joke, this is Monet's Giverny plunked smack in the middle of Pasadena. The harmony of nature and art is very much in keeping with European tradition. Every art lover should pay a visit. The flora is lovely, the art and layout are incredible, and the drakes and geese act like they own the place. Somehow this all works like a finely orchestrated Brandenburg Concerto. Geese, wind in the willows, water lilies and modern masters' sculptures all combine into a divine rhythm. Try it!\nShow less"], ["Reviewed April 15, 2017", 4.0, "Drop-in Visit before Dinner", "My husband and I arrived at 3:30 p.m., but left at 5:00 p.m. for a dinner reservation in Pasadena. We viewed the Rotari's Muses exhibit (through July 31, 2017), and the 17th & 18th Century galleries, plus part of the 19th Century Gallery. Very comfortable, spacious rooms; quiet and uncrowded while we were there.\nShow less"], ["Reviewed April 13, 2017", 4.0, "Good exhibits,", "This is a really good art museum. If you are interested in impressionists and other greats like Rembrandt this is a good place to go. Even my 9 year old who is studying these artists in school was impressed."], ["Reviewed April 7, 2017", 3.0, "Good art, badly lit", "They have good art, and some excellent art, but the top inch or two of most pictures is hidden in shadow. The museum uses thick frames, with spotlights on the ceiling almost directly over the pictures, so shadows hide the top of each picture. Most museums have multiple spotlights farther away, to ensure the whole picture is lit.\n\nI also agree with the reviewer who noted highly reflective glass on too many pictures. If they can't use non-glare glass, they need to ensure a plain background opposite the picture, so we can see the picture without reflections of something else.\nShow less"], ["Reviewed April 7, 2017", 5.0, "Excellent Degas Collection", "Overall, a great presentation of various works by European masters, but the Degas collection caught my eye. Many pieces by this famed impressionist - more than I've seen in any US gallery except maybe the MMA in NY. Very relaxed, uncrowded - definitely a must see museum when in LA.\nShow less"], ["Reviewed April 6, 2017", 5.0, "A Must-See for Art Lovers and Those Hoping to be Art Lovers", "This lovely little museum in Pasadena holds an extensive collection of Degas, Renoir, Gauguin, Cézan, Monet, Picasso,Rembrandt,Van Gogh and others. On the lower level of the museum is an excellent collection of sculpture from South and Southeast Asia spanning 2000 years. The smaller size of the museum makes for an intimate tour that can be completed in 1-2 hours. A delightful water/sculpture garden and the Garden Cafe make a nice spot to relax. The cost of admission is reasonable and students with ID are admitted for free. Parking is on the grounds and is free. The staff is helpful and knowledgeable about the collection..\nShow less"], ["Reviewed March 29, 2017", 5.0, "Who knew Pasadena had a world class art museum", "I've passed by here millions of times, and finally decided to check it out and I was thoroughly impressed. LACMA can be such a chore, and takes all day to not see much art. Norton Simon is small, and chock full of masters, without a lot of people. Shaded parking, important in Socal. Pleasant little garden, and located within walking distance of Old Town Pasadena. All the makings of a cultured, stress free afternoon.\nShow less"], ["Reviewed March 28, 2017", 5.0, "Great, manageable-sized art museum with outstanding pieces", "Amazing that this collection has such a great couple of pieces by so many famous painters/sculptures through so many genres, as well as excellent pieces from Southeast Asia. This is not an overwhelming museum where fatigue can set in. Instead it is very easy to see almost everything they have in 2- 21/2 hours and not feel rushed.\nDefinitely an uplifting experience and a good place to spend a rainy day.\nShow less"], ["Reviewed March 21, 2017", 4.0, "WONDERFUL MUSEUM!", "The Norton Simon Museum in Pasadena, CA is located not very far from Old Town Pasadena, where you can shop and stroll and enjoy tons of restaurants, etc. The museum offers free parking and has a small sculpture garden outside. Inside, there is a lot of interesting art work for you to take in. There's also a lower level, on which there is even more art. Should you want a snack, they also have a little cafe as well as a gift shop. This is a perfect activity for a rainy or very hot day, because you'll be inside. It's easy to spend the whole afternoon here, they really do have some very nice art pieces. I'm no art expert (far from it!:), but I was here for around 3 hours. I can see someone who is really into art spending a whole day here. They must offer work shops or art classes, because in one of the rooms there was a group of people with an instructor, painting or drawing. I would recommend this place to anyone who has a open mind to art, it's worth visiting.\nShow less"], ["Reviewed March 20, 2017", 5.0, "Be uplifted!", "We spent a few hours of a rainy afternoon with so many of the greatest artists on the planet you had to come away uplifted and appreciative. Rodin sculptures greet you as you enter each century has a glorious collection of paintings beautifully displayed with indirect light. The staff are helpful and unobtrusive. The gardens unfortunately were not open due to the rain but we will see them next time. The cafe offered an peaceful outdoor patio to enjoy a snack and talk about all we'd enjoyed. A great way to spend an afternoon in Pasadena.\nShow less"], ["Reviewed March 19, 2017", 5.0, "Pasedena Art Night", "We were lucky enough to see this museum for free as part of the art night events. It was crowded with a good mix of people. The staff were very courteous. We were latecomers so it was a quick visit.\nThe testimony is that I would happily revisit and pay the entrance fee.\nThese were the two artefacts I loved I am sure you will find ones of your own\nShow less"], ["Reviewed March 19, 2017", 5.0, "Art Can Blow You Away", "The Norton Simon collection has to be one of the world's finest, and tucked away as it is just west of downtown Pasadena, and perhaps a bit of a secret as well. We toured a limited number of galleries, but only because we were so overwhelmed by the quality of the exhibited pieces. We started with an Impressionist gallery, seeing pieces by famous artists which we hadn't seen before. Apparently the Simon must not lend a lot of their pieces to other exhibitions, but that's fine with me because looking at a gallery with 12 paintings, eleven of which I would die to own was revelatory.\n\nThe first gallery had pieces by van Gogh, Cezanne, Vuillard, and Matisse among others. They were wonderful examples of each artist and seeing them for the first time was exciting!\n\nThe next gallery was more contemporary with Braque, Picasso and others, one of which was Lyonell Feininger. His piece in this gallery was so stunningly beautiful that we took a lot of extra time looking at it again and again. It had both a depth and a lucidity that I was unable to match in any of the subsequent rooms. As we were leaving the museum, we were drawn back to view it yet again.\n\nAnother feature of this extremely well-designed building was an ability to see several galleries ahead, and what drew us through those rooms to the last one in this wing was a distant view of a huge installation by the American contemporary artist Sam Francis. Just getting to it was a thrill. The installation was three huge canvases, one perhaps twenty feet across by ten or twelve feet high. On an adjoining wall were two more very tall but thin canvases hung side by side but identical in composition, so all three had been done at the same time. I loved the freedom of these pieces, and their vivid colors as well.\n\nWe were finally lured away by the equisote outdoor gardens and pondside cafe where we enjoyed without guilt some delicious and creative pastries. The Norton Simon is a genuine treasure - thank heavens our son lives in Pasadena as I think I will be visiting this shrine many more times! Bravo, Pasadena, for this arresting structure and its incalculably fine collection.\nShow less"], ["Reviewed March 19, 2017", 5.0, "A gem!! Both the museum itself and the gardens!!", "Similar to the Guggenheim museums around the world, the Norton Simon art collection is a museum on a human scale. You can visit it in a could of hours, and be able to take it in, without getting tired or dizzy. It has some amazing pieces of art. On the sculpture side, for example it has, from the piece-de-resitance Bird in Flight by Constantin Brancusi, to a couple of Giacometti works, a number of Henry Moore scuplture, Auguste Rodin, Barbara Hepworth, Degas, Aristide Maillol. The painting includes important pieces of some of the classics such as Rubens and Rembrandt etc, but I was amazed by the richness of the late 19th and 20th century paitings: Van Gough, Renoir, Degas (quite a few), Manet, Monet, Cezanne, Pisarro, Picasso, Kandinski etc. There is a nice cafe outside, from where you can admire the nice pond and the gardens, which contain a number of sculptures by Moore, Maillol, Hepworth. LOVED IT!\nShow less"], ["Reviewed March 16, 2017", 5.0, "Must see for art lovers", "I've been to Norton Simon museum 3 times and every time I find it fantastic. I especially like the impressionist art collection, you can find many Degas statues and paintings, love his ballerinas. I loved it so much that I bought reprints from the gift shop and framed them. Besides Degas you can find impressionist and post-impressionist paintings by Manet, Corbet, Renoir, Corot, Van Gogh, Cézanne, Gauguin and my favorite Claude Monet. There are also sculptures by Rodin. Entrance is $12.\nShow less"], ["Reviewed March 16, 2017", 5.0, "Even though overcrowded - it was fantastic", "I loved every minute of it and would definitely go there again. Till the end of the day there were many people but it still allowed me to admire fantastic works. Only Louvre and Rijksmuseum impressed me with a comparable amount of classic painters, Impressionists, post impressionists, etc.\nShow less"], ["Reviewed March 14, 2017", 5.0, "Great museum packed with surprises", "Although not a huge museum it is very good. It has many impressionists and different from all others in having Asiaa art, mainly statutes/carvings from temples that you won't see anywhere else."], ["Reviewed March 13, 2017", 5.0, "Perfectly splendid collection- do not miss", "The Norton Simon is one of the finest private museums in the world. It is a must see - a superlative collection- where to begin? The Rodins and the rest of the incredible sculpture garden - a breathtaking Zubaran still life- the impressionist and post collection especially Degas and Van Gogh are worth the visit alone. Terrific Manets- splendid works in the Galka Scheyer collection- the Blaue Ryder and others- Rembrandts- and on the lower level South Asian artworks including a magnificent Chola bronze Siva Nataraja. Extraordinary and too many delectable works to be listed in a few words.\nShow less"], ["Reviewed March 8, 2017", 5.0, "Second visit as good as the first", "It had been a while since we had been to this museum, but we had some time to kill with friends and decided to go back. Our return visit reminded me again that this is a jewel of a museum, something like the Courtauld Gallery in London or the Phillips Gallery in Washington. In other words, a small museum containing a collection of extraordinarily high quality art. Definitely a must visit if you have a free afternoon in Pasadena!\nShow less"], ["Reviewed March 8, 2017", 5.0, "Don't miss this hidden gem!", "Small by some museum standards, Norton Simon is certainly a crown jewel. A smattering of a variety of artists like Renoir, Rembrandt, Van Gogh were all represented here. Beautifully displayed with appropriate lighting and captivating plaques with a paragraph about each painting. With four wings there is enough here to warrant the trip. Parking is plentiful unless you are later arriving. A lovely garden cafe overlooks the sculpture gardens.\nShow less"], ["Reviewed March 8, 2017", 5.0, "This is a gem!", "Make a point of visiting The Norton Simon Museum while you are in Pasadena - there is a shocking amount of world class art right here in this little jewel box! Monet, Degas, Rodin, Renoir, Canaletto, and so much more. Walking distance from Old Town Pasadena but with easy parking as well, it's easily accessible. It's a small museum that you can see in a couple of hours, and that will leave you feeling like you have been around the world.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Amazing collection", "This relatively small museum has an amazing collection of impressionist painters as well as the old masters. In addition to Van Gogh, Manet, Monnet, Picasso, just to mention a few, three Rembrandt paintings are on display! In the basement is a fantastic display of Indian and Asian sculptures and objects. Convenient and pleasant cafe that offers shaded seating in the sculpture garden.\nShow less"], ["Reviewed February 26, 2017", 4.0, "Great intimate museum", "We had a few hours in Pasadena and chose to spend out time here...it was a good choice. Quite a varied and interesting collection of painting and sculptures. Really enjoyed the Van Gogh, Rembrandt and Monet works."], ["Reviewed February 21, 2017", 5.0, "Amazing collection of 16th-20th century European art", "Easy access to museum. Impressive display of some of the most accomplished and well-known European masters. Hard to believe this was one man's collection."], ["Reviewed February 20, 2017", 5.0, "Incredible Museum. Well worth an afternoon", "We spent a rainy day at this museum. Besides the absolutely breathtaking artwork, beautifully displayed, there is a wonderful outdoor cafe area where you can have a glass of wine out by a pond. This place is a gem."], ["Reviewed February 17, 2017", 5.0, "Top notch collection", "Covers a lot of art history in a small but elegant Frank Gehry building with an exquisite sculpture garden. Highlights include a Raphael Madonna and child, a virtually unknown Henri Rousseau, a mesmerizing Zubaran still life, and a bold and beautiful Ribera of flower vendor with enormous calla lilies. It's a destination museum you can spend hours enjoying.\nShow less"], ["Reviewed February 16, 2017", 5.0, "Norton Simon Museum", "The Norton Simon is central to Old Town Pasadena has easy parking and a very reasonable admission cost. The Simon has a beautiful collection of Degas, Renoir, Monet, Van Gogh among others. As you enter the museum you will experience a Rodin sculpture garden. If you need a break you can enjoy a snack in the rear garden. Recently, we saw the largest collection of Picasso prints. Unfortunately, although Norton Simon owns these prints they are on exhibit for a short time and they go back into the volt until the next time.\nShow less"], ["Reviewed February 16, 2017", 5.0, "Amazing", "I live in Pasadena since 2014, and drive past the museum on a daily basis.\n\nI can't believe I hadn't visited before. Simply: Amazing. I had the privilege of admiring Picasso lithograph exhibition before it closed. A unique experience. Also the impressionist collection is awesome.\n\nI will return many times.\n\nWhen visiting Pasadena you must go!\nShow less"], ["Reviewed February 14, 2017", 5.0, "Europe comes to Pasadena", "From the moment you step foot in this beautiful and rare museum, you'll feel as if you've been transported to France both in the atmosphere and the art work. It's a must see if you're in LA."], ["Reviewed February 14, 2017", 5.0, "Great museum", "Norton Simon Museum has a great collection of impressionist and other paintings and a beautiful restaurant/sculpture garden. We enjoyed the small Van Gogh exhibit very much."], ["Reviewed February 14, 2017", 5.0, "A Little Bit of Paris", "The approach to the entrance contains many of Rodin's most famous bronzes. inside, one of the best collections of Degas works. Amazing display of post-war Picasso lithographs on display, giving a window into his process and experimentation. The outdoor cafe is charming."], ["Reviewed February 13, 2017", 5.0, "Wonderful Paintings and a Beautiful Sculpture Garden", "The Norton Simon Museum is one of those small gems not to be missed. An eclectic, but fine collection of art from the Renaissance to the 20th century, it is set against the backdrop of Monet’s garden at Giverny, reimagined and rich with 19th and 20th century sculptures. The lower galleries house South and Southeast Asian paintings and sculpture.\n\nMuseum highlights can be enjoyed in a two-hour walk through the museum, but if you have the energy and the will, plan a longer stay.\nShow less"], ["Reviewed February 13, 2017", 5.0, "A Small But Powerful Museum", "The Norton Simon Museum is a perfect visit because it does not overwhelm with corridors of exhibits. Instead, it's a well-curated collection that will provide several hours of pleasure."], ["Reviewed February 10, 2017", 5.0, "Many treasures in this museum", "Although this museum is smaller it is filled with wonderful art pieces. Nice way to spend an hour to two hours. The garden was closed but it looked lovely."], ["Reviewed February 10, 2017", 5.0, "A great Museum with an Art collection way above its size", "An excellent selection of paintings from diverse artists and historical chapters in the history of art.....The painting s are of high quality from Masters who's work is renowned world wide. Beautiful sculpture gardens add to your visit."], ["Reviewed February 10, 2017", 5.0, "A Gem of a Museum!", "I took my lovely bride to the fine place of culture last year. It was really worth the time and effort! The parking lot is large and always has a parking space. Getting in is very easy for this old gimp.\n\nWe went mostly to see the collection of Old Dutch Masters. To say that I was impressed would be a serious understatement.\n\nAlso the gift shop was extremely clean, well ordered and had lots of neat goodies. I was able to do a lot of Xmas shopping there. For small gifts for friends and other nice folks.\n\nAnyways I most highly recommend this joint to refesh ones soul. While in the area.\nShow less"], ["Reviewed February 6, 2017", 5.0, "Gem of a Museum", "This was my third visit to this museum. The art Norton Simon amassed is beyond incredible. I've read his autobiography and was anxious for another visit to this museum. Make sure you see the film of his life. This museum also holds many art expert lectures that are not to be missed; ask when you buy your ticket. The museum shop is excellent. I have too much to say about this lovely museum, so all I can concisely say is it is simply not to be missed.\nShow less"], ["Reviewed February 6, 2017", 5.0, "An Uncommon Art Museum", "An afternoon at the Norton Simon Museum is one well spent. The galleries are expansive and the central garden is beautiful. The 2D interior works are displayed in a way that draws the viewer into close examination. What is uncommon is that the most significant 2D works in the collection are covered in non-reflective glass. On a practical level, this reduces the cost of insuring masterpieces. Gallery staff noted that visitors either love or hate this means of display. I fell into the former category because the works were much more accessible. There was no objection when I stuck my nose within a couple of inches of a Van Gogh, Picasso or Monet. Such close scrutiny allows for a careful examination of brush stroke and technique. You will also find, of course, the requisite gift shop and cafe on site. A great way to spent a chunk of a day in L.A.\nShow less"], ["Reviewed February 2, 2017", 5.0, "One of the most beautiful museums", "The museum has a great location. Is incredible the collection that the museum owns. All the staff is really helpful. It is recommended to give plenty of time to each one of the rooms. The gardens are beautiful."], ["Reviewed February 2, 2017", 5.0, "School project!", "Great place to visit, specially with your children. You will have fun taking pictures outside with the statues"], ["Reviewed February 1, 2017", 5.0, "A very nice museum in", "We stopped by the museum knowing they have a number of Van Goghs on loan, including the bedroom. The museum has different rooms for periods from the 15th century onward plus a floor for Asian Art and a sculpture garden. I had expected to skip the earlier periods which often focus on religious art but in fact there was almost none of that. These periods, also comprised some fantastic portraits and landscapes.\n\nA thoroughly enjoyable 2 hours, although you could probably spend much longer if you are a true art lover.\nShow less"], ["Reviewed February 1, 2017", 5.0, "Amazing collections", "This is a smaller museum but elegant and well laid out. The Rodain sculptures are particularly amazing. On my visit I saw many of the greats, Picasso, Cezanne, Manet, etc. the gardens are lovely and well worth a visit."], ["Reviewed January 29, 2017", 5.0, "A 1/2 day museum", "The Norton Simon is a great 1/2 day museum to introduce your kids to fine art through the ages. There are ongoing exhibitions and unique pieces, and it is all displayed in modern rooms with indirect light. Certainly worth the low cost of entrance. Gardens are also nice.\nShow less"], ["Reviewed January 27, 2017", 5.0, "Beautiful !", "So much to see, this building houses some of the most beautiful pieces of art. On some days you may see students on field trips, but the place is big enough for everyone. Easy to get to off major freeway, ample parking. Admission price is very low compared to other museums. There is also a wonderful out door garden with many shady spots. Would highly recommend a trip, you won't regret it. Museum is located at end of Old Town Pasadena, take a walk down Colorado Blvd.\nShow less"], ["Reviewed January 17, 2017", 5.0, "Don't Miss This Gem at Any Cost", "Packed full of priceless treasures. For a few dollars, one can see the world's finest artists from the Nineteenth and Twentieth Centuries. A feast of Impressionist and Post Impressionist works, especially those of Degas, Van Gogh, Manet and many others. Degas' 'Little Dancer' is always the high point for us....we go say hello to her every year. There are other galleries too and a section of Oriental and Eastern Art Forms. DON'T DARE MISS IT! Delightful small gardens at the rear.\nShow less"], ["Reviewed January 17, 2017", 3.0, "Local Museum with Excellent range", "This is a local small museum with excellent Asian statuary, modern European and classical European collections"], ["Reviewed January 16, 2017", 5.0, "Beautiful Pasadena Art Museum", "Free parking, lovely grounds and nice art collection. So glad we made time for this during our trip. Only $12 admission fee for adults. In lovely Pasadena, no less. We especially loved the Asian exhibits. Too bad the outdoor sculpture garden was closed because they'd had too much rain.\nShow less"], ["Reviewed January 14, 2017", 5.0, "The small little but pleasant and precious. A lot of famous paintings to see.", "The first Friday is free admission to go to this museum, but parking space is limited. You can see Van Gogh, Renoir, Picasso.. so may more. You can view them in closed up without peeping through glass box. I really love this precious little museum and a lot of collections. You will not be disappointed.\nShow less"], ["Reviewed January 12, 2017", 4.0, "beautiful place to spend a day", "I have found my many visits to the Norton Simon to feel magical. It begins with the sculptured, grassy walk to the entrance and the surprise upon entering to see that the museum surrounds a wondrous outdoor sculpture garden with a lily pond. It is a haven - you'd never know the busy 210 is running by on the other side of the wall. I've seen many wonderful exhibitions; one of the most memorable was a Van Gogh. The museum store is definitely worth a visit; great selection of art books and gifts. There is not a restaurant, but there is an informal serve-yourself café in the garden. Remember that Pasadena summers get blisteringly hot and you will not find cool solace in the café.\nShow less"], ["Reviewed January 4, 2017", 4.0, "Amazing", "Amazing collection of artists. Well worth a visit. You can spend an hour or an afternoon there. Unfortunately they are not opened in the morning and only on limited days. Be sure to check their schedule."], ["Reviewed January 4, 2017", 5.0, "Amazing Pasadena Museum", "This museum seems small but it has an incredibly important collection of art. It also offers concerts, food and a lovely garden. The docent led tours are exceptional. You should schedule a visit around one of these."], ["Reviewed January 2, 2017", 5.0, "A fantastic art mueum with a beautiful garden.", "We went with another couple and spent several hours seeing some of the finest art on the west coast. It is week worth several hours of your time."], ["Reviewed December 30, 2016", 5.0, "Pasadena arts day", "I hadn't been to the Norton Simon in years so I was glad to go back and see Rodin's Thinker on the lawn, the lovely gardens and the fabulous art - Van Gogh exhibit was there. This museum is very user friendly and easy to maneuver through.\nShow less"], ["Reviewed December 29, 2016", 5.0, "World Class art, but right sized", "The Norton Simon Museum has some really great pieces of art, but it is not overpowering and exhausting to visit because it is right sized. In a couple hours at a leisurely pace you can take in and appreciate everything, with maybe another hour to stroll through and absorb the sculpture garden. Absolutely worth the time and effort to visit.\nShow less"], ["Reviewed December 28, 2016", 4.0, "Worth the time and effort to visit", "We were in Old Pasadena waiting for our flight out of Burbank later in the evening. We were visiting Old Pasadena are and were were glad that we decided to walk down Colorado Blvd to this museum. We spent a few hours and loved it. Not big like a Getty museum but large enough to have a nice variety of art to attract different tastes. The museum was peaceful but fairly crowded the week after Christmas. The building is modern and the grounds are nicely kept. It was a nice way to spend some time before catching our flight home. We would recommend this museum to family and friends.\nShow less"], ["Reviewed December 28, 2016", 5.0, "There is more to Pasadena than the Rose Bowel parade", "This is our second visit to the Norton Simon. It is a jewel. From the Degas statues to the early Monet seascapes to the Van Goghs up to the old Dutch masters, yes including Rembrandt, and through to Picasso the collection is amazing. Especially when one considers that it was amassed by one collector and his foundation.\n\nAnd when you think you are done, take a break and go into the sculpture garden with its lily pond. Grab a snack and a drink and enjoy a zen moment.\n\nWe drove 2 hours from where we were staying in Southern California to visit the Norton Simon and 2 hours back. The best review I could give is to say that when our excursion ended my wife turned to me and said \"I'm glad we went.\"\n\nOh, when we return to Southern California next year, and the next...., we'll take the 2 hour drive again to visit the Norton Simon no matter how crazy our relatives think we are. It will be like visiting a beloved old friend.\nShow less"], ["Reviewed December 9, 2016", 5.0, "Well worth the trip !", "We drove down from Ventura . I was originally from San Gabriel Valley and hadn't visited in years and am wondering what took us so long. Excellent impressionist paintings with wonderful Van Goughs. I never got to the other european art I was so intrigued with the impressionists, Picasso's lithographs and the drop dead asian art.\nVery helpful staff and small but nice gift shop. Parking is plentiful. A great place to visit if you love art and art history. Rodin's The Burgers of Calai were in front as you enter, doesn't get better than that !\nShow less"], ["Reviewed December 7, 2016", 3.0, "Nice modern building and grounds", "I don't have an eye for art, but I still enjoyed our visit to this museum. It was a walkable distance from the Pasadena Marriott Hotel. Wings of the museum are setup by time periods. The modern art wing was of no interest to me. I tend to stop and read each description so I was tired by the time we finished 2 wings. But, we did head downstairs to see the sculptures. There is a nice patio cafe for refreshments.\nShow less"], ["Reviewed December 1, 2016", 5.0, "High quality artwork in a modern building", "The Norton Simon Museum is wonderful. At most museums I have a short attention span, but this time I was captivated by the variety of the permanent collections. The descriptions next to each painting are especially informative, providing historical context plus details about the artists’ life and painting style. The main level of the museum is nicely organized into four wings, each with a major art collection: 14-16th century, 17-18th century, 19th century, and 20th century.\n\nThe museum’s lower level is dedicated to Asian art from India, Thailand, Cambodia, Indonesia, China, Japan and more. When you arrive downstairs, on the curving wall near the stairway are explanations and diagrams explaining the symbolism you’ll see in four major styles of Asian art, including Buddhist and Hindu. Large stone artifacts from archaeological sites like Angkor Wat were impressive, but made me wonder how they were acquired. No sign explains this and it is a sensitive issue nowadays. Perhaps it is discussed in the 30-minute film featured in the theatre, which I missed.\n\nThe informal café on the patio has outdoor seating next to the pond and sculpture garden. It provided a relaxing outdoor break for my eyes after viewing so much artwork indoors. Salads, sandwiches, soup, desserts, hot and cold beverages plus beer and wine are available. I visited on a Saturday and worried about finding a parking space at 2pm, but there was no problem. A holiday weekend would likely have been much busier. Overall, the Norton Simon collections are impressive for their quality.\nShow less"], ["Reviewed November 27, 2016", 4.0, "Great Museum", "A must see if you enjoy art. The special exhibit right now is of Picasso's early lithographs. The grounds and building are excellent with a cafe as well. Make sure you have at least 1-2 hours to browse through."], ["Reviewed November 26, 2016", 5.0, "an eclectic collection obtained by Norton Simon", "Very peaceful. Relatively small. snack bar. After his wife suggested they visit India he accumulated magnificent Indian art. Not a big place but well worth a couple of hours. The introductory movie about him plays every several hours and was very interesting. Worth a stop"], ["Reviewed November 14, 2016", 4.0, "Cambodian Art!", "I have come here for several exhibitions and to just tour the permanent collection. The museum has a Van Gogh painting I love to look at for the colors!! Anyway, the most memorable for me, beside all the Rodin sculptures, is the Cambodian art they have on display year-round. I have been to Cambodia twice now and seen Angkor Wat complex. The only thing I wonder, is how the pieces were acquired, so far I have never bothered to look into it but sometimes one wonders these things to make sure it is legit!\nShow less"], ["Reviewed November 11, 2016", 5.0, "Great collection in peaceful setting!", "We came for the impressionists and the renaissance painting ; Really enjoyed the sculpture garden next to a waterlily pond! Light refreshments in the shade and small quality giftshop!"], ["Reviewed November 9, 2016", 5.0, "A wonderful, small museum", "If it's a lovely day, do wander through the Sculpture Garden. Lots of Henry Mooore sculpture, but others as well. We saw the special exhibit of Picasso's lithographs. The exhibit was expertly and wonderfully organized and mounted so that each piece could be seen without distraction. Looking for a gift, try their Book Shop!\nShow less"], ["Reviewed November 7, 2016", 5.0, "Don't miss this beautiful museum!", "My daughter and I spent a really wonderful time visiting this museum. It's not to big and it has beautiful paintings and sculptures to see. You can enjoy the Renoirs, Degas, Picassos and two of the most beautiful Van Gogh's I've ever seen...!\nBesides, it has two pretty gardens: one in the front before the entrance- with Rodin's sculptures, and the one in the back with more sculptures and a very nice pond where several ducks swim,eat and play. We enjoyed it a lot !!!\nShow less"], ["Reviewed November 2, 2016", 5.0, "Super nice and beautiful!", "I really love this museum. First, the Thinker is just outside the museum, and there are more statues outside the museum. Second, the paintings, statues, others inside the museum is very elegant. There is big Buddism exhibition. There is also a big garden, that's very quiet and you can enjoy a coffee there. Parking is very easy, and it's also very close to Rose Bowl and Old Pasadena.\nShow less"], ["Reviewed November 2, 2016", 5.0, "Visit this gem", "We have visited LA a number of times and on a recent visit we were advised to visit Pasadena and especially the Norton Simon museum.\nWhat a surprise. A bit off the beaten track but it is a gem.\nIt has an excellent collection of European paintings and sculptures.\nA large number of sculptures are in the delightful gardens and you can soak them up over a coffee.\nPut it on your list. It's a must !!\nShow less"], ["Reviewed November 1, 2016", 5.0, "Light Lunch Wine and Art", "I was so excited to meet a new friend at the Museum. She had given guided tours of the Asian collect in the past and knew everyone well. We sat for a sip and a taste of food at the cafe. I had not been in a while and knew nothing of the upgraded care area So much to my surprise I felt nothing but joy. As well we sat in sight of the emaculate grounds as we talked. After dining we walked the grounds and took photos of some of the wonderful art. Oh how I would love to have such art in my yard. My host lead me to the book store where she explained the outstanding collecting of art books and praised the manager of the book store for his selection. We moved on as she explained to me intricate chess board. I think she said India had invented chess. We move along briefly visiting other sites in the hall way. Yes you can lunch at the Norton Simon walk the grounds and see a few Chinese statues along the way on a short visit. I recommend visiting often so you can tour the permanent collection or other times attending a lecture or film in the lovely movie room. Then save a visit for the Chinese collection.\nShow less"], ["Reviewed November 1, 2016", 5.0, "View the Masters!", "A stunning collection of works by the world's most celebrated artists from ancient works to the present day. The impressionist collection alone is well worth the visit."], ["Reviewed October 28, 2016", 4.0, "Excellent art museum", "A wonderful mid-sized art museum with a nice selection of Asian and Western art (16th to 20th Century)."], ["Reviewed October 27, 2016", 5.0, "What a wonderful museum!", "The only thing wrong with this gem of a museum is the limited hours it is open. Wonderful Rodin sculptures outside and the grand masters within. Loved the Picasso lithographs. Certainly worth a visit in my opinion."], ["Reviewed October 26, 2016", 5.0, "Fantastic Museum", "This is a hidden gem in Pasadena, the collections are amazing and museum is small enough to visit everything in under two hours, anyone loving impressionist will love this collection."], ["Reviewed October 26, 2016", 5.0, "Take the Time", "The Norton Simon is so easily accessed that local people forget what a jewel of a visit is available. World class art and exhibits are commonplace and the grounds are beautiful. Do visit!"], ["Reviewed October 25, 2016", 5.0, "Beautiful museum", "This museum is well laid out and easy to navigate. The artwork displayed is done nicely, and I love how the Asian art has it's own floor. The floor staff are great-they are really just there to make sure you keep your proper distance, and to answer questions. Beautiful garden area, too\n\nThe little cafe is fairly priced and has good food as well\n\nEasy parking\nShow less"], ["Reviewed October 23, 2016", 5.0, "One of My Faves - and I Travel A Lot", "Small. Quiet during the week off season. Fabulous collection of Impressionists. Lots of other stuff, but I seldom wander past the Impressionist galleries. Excellent info posted with the art."], ["Reviewed October 18, 2016", 4.0, "Classical private museum but a little precious", "A marvellous collection of art over the ages, reflecting the tastes of Norton Simon, close to the freeway in Pasadena. While it Had rained a little in they morning, it was disappointing that the beautiful sculpture garden was closed. It didn't seem flooded out to me.\nShow less"], ["Reviewed October 17, 2016", 4.0, "Gem of a museum", "My wife and I visited the Norton Simon Museum and had a great time. Awesome art and great collection from several periods. Beautiful garden in the center. Free and convenient parking."], ["Reviewed October 17, 2016", 5.0, "Outstanding collection, and very managable", "There is something for just about every category of art lover at the Norton Simon Museum. This isn't a huge museum, which means that you can look at pretty much everything in an afternoon without getting sore feet and becoming irritable. My particular favorite works are the van Rijn self-portrait and the huge \"Still Life with Fruit and Vegetables\" by Frans Snyders.\nShow less"], ["Reviewed October 15, 2016", 5.0, "We absolutely love this Museum", "It's just a 30 minute drive from Beverly Hills and what a gem this museum is. Surrounding a beautiful sculpture garden The Norton Simon houses one of the greatest collections of art. From Rothko to Degas you will find it all. And the current Picasso show will energize you and make you fall in love! Our favorite. A secret gem in LA. GO GO GO\nShow less"], ["Reviewed October 13, 2016", 5.0, "Don't miss downstairs", "I'm not huge on art museums, but I really enjoy this one. It's a good scale and has real diversity. Upstairs is all European art, downstairs is Hindu and Bhuddist art, quite a fantastic collection. They do a great job on contextualizing what you see, the lighting and spacing is inviting and intmate. Great date outing.\nShow less"], ["Reviewed October 12, 2016", 5.0, "One of my favorite Museums in the Los Angeles Area.", "So many great artists in a great setting. I live locally but have been back many times. Don't miss visiting Old Town Pasadena when your here."], ["Reviewed October 12, 2016", 5.0, "Best Collection in Pasadena", "This is an amazing museum. It was my first time going but well worth it. It has such varying tastes in art that everyone can walk away feeling satisfied."], ["Reviewed October 8, 2016", 5.0, "A small gem offering an intimate look at notable masterpieces", "An outstanding collection of works by Edgar Degas is just one of many highlights in this lovely museum. Small when compared to \"top-tier\" museums, the Simon nonetheless has spacious, well-lit, uncrowded galleries that allow art lovers to gaze as long as they like at works by Cezanne, Renoir, Van Gogh, Goya, Rembrandt, and many other masters. I was surprised and impressed by the range of artists represented. A serene sculpture garden beckons visitors outdoors, and a small cafe offers snacks and light meals. Conveniently located at one end of downtown Pasadena, there's really no excuse for art lovers to miss this fine museum. In fact, if you're someone who's overwhelmed by mega-institutions that require a full-day visit, this is an appealing and highly rewarding destination.\nShow less"], ["Reviewed October 8, 2016", 5.0, "Amazing collection", "This beautiful museum in Pasadena has an amazing collection of Impressionist and post-Impressionist paintings and a lovely sculpture garden. Lots of Degas. Definitely worth a visit."], ["Reviewed October 8, 2016", 4.0, "Inside and outside beauty", "The Norton Simon Museum offers a wonderful display of artwork both inside the museum and in the sculpture garden. A viewer can wander or sit to enjoy the beautiful displays of artwork inside and outside."], ["Reviewed October 6, 2016", 5.0, "The 30 minute movie is very interesting", "Our youngest daughter lives in the area, and as we visit her often, we have visited this Museum at least half a dozen times. I never reviewed it, as what is there to say? This Museum has so many masterpieces, that today, (10/6) we spent over four hours there, and wished that we had had another hour. On Thursdays, they are open noon to five.\n\nThe Museum Cafe has improved. About eight years ago, we met friends for lunch there, and it was such an unexpected disappointment. We love Museum restaurants, and always enjoy a nice meal at just about all of them. Here, the catering seemed to come from Costco. Large unappetizing portions prepackaged in clear plastic containers, and very few choices. The Cafe setting is among the loveliest but, the food was uneatable, and all four of us left it in their plastic. Today, we enjoyed our lunch. We split a \"Ham on Rye\" sandwich, and a Bass beer. The sandwich was freshly made and tasty. I saw no prepackaged sandwiches.\n\nWe always enjoy browsing in the Gift Shop, and I've often bought my Christmas cards here, but they are not out yet this year. There are more guards (inside and outside) here, than we have ever seen in any Museum anywhere. Not surprising, when, most likely, there is nothing here valued at less than several million dollars, and you can get very close to the masterpieces.\n\nEvery day, at 12:30 and 3pm, they show an interesting 30 minute movie about Norton Simon. It's shown in their Theater, which has the most comfortable cushiony seats, and the slope is such that there is a good view from any seat. Today, we watched the movie for the third time. We really enjoy hearing about how his passion for art developed. Surprisingly, so few people come to watch the movie. Today, there were only five of us in the Theater. It is very well worth seeing.\nShow less"]]}}