{"Oceanside Pier": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Oceanside Pier", "url": "/Attraction_Review-g32815-d526165-Reviews-Oceanside_Pier-Oceanside_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/3f/57/68/the-pier-at-oceanside.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1644"}, "address": {"@type": "PostalAddress", "streetAddress": "300 S Pacific St", "addressLocality": "Oceanside", "addressRegion": "California", "postalCode": "92054-2922", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Must do local attraction!", "Although we've walked the pier a number of times it never gets old! Very unique and casual. Nice way to take in the local ambiance!"], ["Reviewed 5 days ago", 5.0, "Romantic place for after dinner walk", "We live in Oceanside, and I love the pier. We have dinner, and then enjoy an evening walk. The view of Oceanside from the pier is breathtaking. I highly recommend a visit."], ["Reviewed 6 days ago", 5.0, "Great Wooden Pier", "Awesome place to view the locals fishing, surfing and enjoying the beach. Unbelievable place for photos of the sunsets."], ["Reviewed 6 days ago", 5.0, "A gorgeous walk! Try Ruby’s. See the Pelicans. Get snacks.", "Love this Pier! There’s a fun souvenir-bait shop halfway to Ruby’s with lots of snacks and fun items. Regular pelicans rest there - great photo Ops. A romantic and fun stroll, every time."], ["Reviewed 6 days ago", 5.0, "Pretty awesome", "We walk to the pier and enjoyed seeing all the birds and people fishing and of course the great views. We also had lunch at Rubys at the end of the pier the food was amazing and so is the staff."], ["Reviewed 1 week ago", 4.0, "Beware the over-zealous parking enforcement", "Parked in a diagonal spot for one hour and visited the pier, which is quite nice. Returned to a $58 parking ticket for backing into instead of driving forward into my parking spot!!! Highway robbery. Goodbye Oceanside!"], ["Reviewed 1 week ago", 4.0, "Nice walk", "Windy and cool the day we were here but very picturesque. Well build and easy to walk. Would be even nicer in nice weather."], ["Reviewed 1 week ago", 5.0, "Spend some time on the ocean.", "Perfect way to enjoy quality time with the family on the ocean. The pelicans are very friendly. The fisherfolk are very photogenic. Tin outdoor restaurant under the pier is excellent. Avoid Ruby Tuesday’s at end of pier. Folding chairs are welcome if you want to hang & enjoy.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "A nice walk down the pier.", "Pier was cool. But just a pier. Neat diner at the end called ruby's. I guess that's a cool thing to have at the end of a pier. A must see while down here but nothing that will blow your socks off."], ["Reviewed 2 weeks ago", 5.0, "A good walk down the pier", "Husband made it half way but I went all the way down to the end. Bought ice cream cones at the restaurant. Fun to see the surfers and the people fishing."], ["Reviewed 2 weeks ago", 5.0, "Cool Ares to see, longest pier", "Very beautiful area. The pier was very cool. Saw lots of surfers hanging out. Good rent supplies for fishing. Even had a restaurant at the end of the pier. Fun for all."], ["Reviewed 2 weeks ago", 4.0, "Walk to the pier", "I went for a run and found myself at the pier. I went all the way out to the end of the pier and back. There were shops and lots of people. It was really pretty and a great experience."], ["Reviewed 3 weeks ago", 4.0, "A walk down the pier", "Walking the pier and talking to the many people and family's watching the many surfers the fishing familys and enjoying life made our day."], ["Reviewed 3 weeks ago", 5.0, "Seashell hunting", "Great place great views and the sunsets lately have been so beautiful it's in believable I love this place"], ["Reviewed 3 weeks ago", 4.0, "Worth a Visit", "It’s definitely worth stopping by, yes, it’s a pier but you get a great view off it.\n\nI stopped by at sunrise, and took a walk down. The pier is fairly long and is adorned by people fishing, jogging and just casually taking in the view.\n\nWorth stopping by.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "beautiful area to visit", "I love the ocean. Every chance I get to walk out on a pier, I take it. This place is spectacular and awe inspiring."], ["Reviewed 4 weeks ago", 5.0, "Interesting Activity", "I often just walk out to the end of the pier, especially at sunset. It has a beautiful view, and it is interesting to see what the fisherman are catching. I have seen dolphins several times and a sea lion once. One time I could see sting rays on the bottom fairly near the beach. And, of course it is interesting watching the surfers. Please check the pelicans just past the store on the pier. There is usually at least one, and you can get a close picture.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great Walk!", "There is beachside parking and was able to park quickly and easily. We walked along the Pier and had a great view of the surfers and the friendly pelican at fishing kiosk. There was a lot of construction underway and some paths were cloeed but didn't detract from our access to the pier. Recommended.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Great view at end", "1954 foot per extending out into the Pacific Ocean. Has hamburger place at end of pier. Great place to watch the surfers. No charge to walk out."], ["Reviewed January 23, 2018", 5.0, "Wonderful Place to Take A Walk.", "It is a Wonderful place to take a walk. Watch the people fishing off the pier. Can walk out and watch the sunset. Great place to take pictures also."], ["Reviewed January 22, 2018", 5.0, "Long pier", "Walk down and watch the waves and surfers. Great spot to take pictures and fish or dine at the end of the pier."], ["Reviewed January 22, 2018", 5.0, "Day or Night, Great way to experience Oceanside.", "As a resident of Oceanside, I feel spoiled that I have places such as the Oceanside Pier to visit anytime I want. Weather it is an evening walk or a day event the sights are just awesome. The pier offers something for all ages, fishing from the pier is a regular sight. The restaurant at the end of the pier, Ruby's is a great place to have a full meal or just a snack and drink. At night, walking before or after a great meal is a safe, comfortable, and beautiful experience. You must keep your eyes open at all times, you never know what you will see in the water from your California surfers to a shark being brought in at the end of the pier from a small time fisherman just looking to have some fresh fish for dinner.\nAll in all if you have not experienced the Oceanside Pier you need to take advantage of it as a visitor or a resident it is one of my favorites.\nShow less"], ["Reviewed January 22, 2018", 5.0, "A trip down the street", "The longest wooden pier on the west Coast with Ruby's dinner at the end ,the best milk shakes in the world ,fishing is free from the pier no license required .Oceanside has the best weather in the world,"], ["Reviewed January 21, 2018", 5.0, "Longest Pier in CA", "Oceanside Pier is one of my favorite places for daily walk. So vibrant, lots of available parking (some free), a the tip of downtown with so many great brewery/restaurants - Farmer's market, shops. There is so much to do in this area - yes it is very safe.\nShow less"], ["Reviewed January 21, 2018", 2.0, "Better piers out there", "Oceanside is kind of a crappy area. Everything around this pier isn’t great. Pretty dirty and scummy. Lots of homeless. Go south to Carlsbad or north to laguna for better areas."], ["Reviewed January 21, 2018", 5.0, "Always a great place to take an enjoyable walk!", "I live in this town, and I come to this pier quite often. It is a great place to walk at any time of the day, but especially at sunset. You get to breathe the ocean air, take in the sight and sound of sand, surf, sun and seabirds (the 4 \"s\"!). Look for the big pelicans that frequently sit on the pier rails, they are quite impressive up close. And a definite treat I always look forward to, at the end of the pier: grab a yummy shake from Ruby's Diner for the walk back, or sit down for a great meal while enjoying the ocean view.\nShow less"], ["Reviewed January 21, 2018", 5.0, "A Sunday Stroll beyond Land’s End", "This is one long pier with a lot going on: Surfers down below to the left and to the right; Fishermen with an impressive arsenal of gear in little wagons. Strollers galore. A fun walk to Ruby’s at the end. No shortage of people to watch but did not feel excessively crowded (it is a huge pier). Fun looking back on Oceanside at the end. Restrooms midway.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Must see and walk", "This was so much fun to walk. It was a very cool and windy day. Fun to see the locals fishing. People watching! A must de in Oceanside"], ["Reviewed January 20, 2018", 5.0, "Great fun!", "Such a fun walk down to the end to people watch, watch the pelicans, and we ate at the restaurant at the end. The food was just ok, but the view and memories were wonderful!"], ["Reviewed January 19, 2018", 4.0, "Oceanside Pier", "It was another beautiful sunny day on the beach at Oceanside, Ca. The sand area was full of folks enjoying the sunshine and playing in the sand. In addition watching the suffers catching the waves. Easy parking lot close to beach ,spots for having a cook out with bathrooms in the area. The Oceanside Pier was long and has a great restaurant at the end of it. With a beautiful view of the ocean. ENJOY!!\nShow less"], ["Reviewed January 18, 2018", 4.0, "Great views!", "We enjoyed walking down the pier, there were pelicans and surfers to watch - there is a restaurant at the end that seemed popular. It's great to get some good pictures and watch the surfers. I'd read some bad reviews about Oceanside but I really enjoyed it, felt totally safe and had a really nice time!\nShow less"], ["Reviewed January 18, 2018", 5.0, "Leonard", "One of the most beautiful piers that I have visited. There was plenty to do on and around the pier. It is a must see if you are visiting the area."], ["Reviewed January 16, 2018", 4.0, "A nice walk. One small outdoor shop and a Rubys Diner at the end.", "A nice walk. You can fish off the pier or just view surfers and the waves. Rubys Diner at the end of the pier for decent food and great view."], ["Reviewed January 15, 2018", 3.0, "Oceanside pier", "Enjoyed walking on the pier with family after dinner. Entire family enjoyed some ice cream at end of pier."], ["Reviewed January 13, 2018", 5.0, "Love it", "It’s definitely a must see if you want to watch the sunset! We did it a couple of nights in a row, and was worth every minute. The beach itself is clean and nice to walk on. There is a diner at the end of the pier and a small gift shop on the way. Seems like the pier and beach itself may get “rowdy” after dark with a lot of teens and loud people around.\nShow less"], ["Reviewed January 11, 2018", 3.0, "Spent the weekend in Oceanside", "The oceanside pier is fun to walk out on, watch the surfers below, and people watch. Saw no trash on the pier. Watch out for the two brown pelicans, they will bite. Ruby's is at the end, but we didn't eat there. Recommend LTH (Local Tap House) for dinner and Sunday brunch at Oceanside Broiler.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Pretty but not easy for limited mobility", "We attended on a beautiful January day which was amazing for us Wisconsites - but I ended up staying on the beach because the pier was several blocks from parking, had a long uphill ramp and no places to sit once on the pier (I’m on a cane). The beach itself was very family friendly with benches and playground equipment. Lots of families with kids were there.\nShow less"], ["Reviewed January 2, 2018", 5.0, "New Years Eve Party at Hello Bettys'", "We stayed downtown and went to the NYE party on the rooftop of the Marriott Springhill Suites, hosted by Hello Bettys. Great crowd, fantastic DJ, party favors, food and champagne for all!"], ["Reviewed December 29, 2017", 5.0, "Great walk along the pier", "So, nice to walk along the pier chatting with the people fishing and enjoying the view. Great to get some fresh air after a meal at 333 Pacific Restaurant"], ["Reviewed December 28, 2017", 3.0, "Pass this one up or stay up all night", "Wow the pictures are beautiful but the ocean view rms are for timeshare Owners so the Hotel Rm Deluxe are on the east side city view which was a parking lot and the Amtrak train blowing its whistle 24/7.BEWARE WHEN U check in and see a basket of earplugs!! How could I have checked in well they asked for 1 day prepaid (smart). I wasn’t so smart to choose this place. Oh did I mention the timeshare presentation lasted almost 3 hrs trying to sell this spot and their club. The room was large and had a balcony, fridge and jacuzzi tub pay for view movies $19.95 hmmm\nWe did enjoy the pool area overlooking the ocean. Each tower has a sky lounge to look out and take pictures. The $8 BBQ chicken dinner put on by the activities Dept was really tasty thx to Jamie who thought up the idea, give her a raise for creativity! There is no cafe and it would be nice if they had donuts in the morning since u have to walk a few blocks. Save urself a good nights sleep don’t stay here.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Christmas eve morning", "My wife and I visited my folks for the holidays. We took a walk along the beach and pier Christmas eve morning. The temperature at 6:30am was 47 degrees and the sunrise was beautiful. We finished our walk at Ruby's restaurant on the pier."], ["Reviewed December 26, 2017", 5.0, "Birthday Getaway", "It was my very 1st trip to the west coast and, I was amazed wit the Ocean and the climate. it was perferct."], ["Reviewed December 26, 2017", 5.0, "Just like a painting", "What a great place to relax no matter OJ the morning, during afternoon or to watch the beautiful sunset. Other than the beautiful scenery, there are a lot of cafes, restaurants and bars nearby to hang out. Few of them are with rooftop balcony that you could enjoy the sunset with a cocktail in hand, and some do live music too :)\nWould highly recommend for a day out.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Relaxing", "Nice walk on a 60 degree day. Wonderful weather, scenery, and people down and back on the Pier! A great place to get away from hustle and bustle!"], ["Reviewed December 21, 2017", 3.0, "Beautiful", "Didn't have the souvenir shops like Santa Monica but as a result it was less crowded. We went specifically to go to Ruby's but it was closed for maintenance."], ["Reviewed December 18, 2017", 5.0, "Nice pier..... Lots of activities", "We walked the entire pier. We saw pelicans, seagulls, and fishermen. There were beautiful views of the ocean and the city."], ["Reviewed December 18, 2017", 5.0, "Great Views of the Ocean", "Walk to the end of the pier and see the unique perspective of the waves rolling in for the surfers. Awesome views."], ["Reviewed December 13, 2017", 5.0, "OCEANSIDE PIER", "This is the longest wood pier on the west coast, if not in the world. It was a blast to visit with great waves, surfers and sunshine and the food at Ruby's with a view looked great also. I bought a Oceanside magnet from the tiny store on the pier and he actually had the lowest price in Oceanside for a magnet. You can feed the pelican their also. If I could afford it, I would move tomorrow. A wonderful Oceanside community. Kind regards, Friscoboy.\nShow less"], ["Reviewed December 11, 2017", 3.0, "Just OK", "The pier is a good walk and a great photo stop but there isn't a lot to do. It's also difficult with strollers since the wood has gaps and is very uneven."], ["Reviewed December 8, 2017", 4.0, "Great Pier, with neat restrurant at the very end.", "Sunsets are awesome from this vantage point. Rent one of the bikes that are below the pier and ride down the shore line. Very pleasant."], ["Reviewed December 6, 2017", 5.0, "Holiday", "What a great place to relax and observe the ocean, surfers and local fisherman! We’ve really enjoyed our walks to the end of the pier and this morning had breakfast at the 50's diner at the end. Nicest pier I’ve seen."], ["Reviewed December 6, 2017", 5.0, "Beautiful place for a walk", "The pier is a great place for a walk, lovely views of the beach, and some fun people watching. The weather is good year round. It's safe and easily accessible for strollers or wheelchairs to enjoy the ocean without worrying about the sand."], ["Reviewed December 6, 2017", 5.0, "Fishing", "Rented fishing gear but didn’t catch any fish. Rental shop said come back at dusk and gear is free. Fish or not great time in Oside."], ["Reviewed December 5, 2017", 5.0, "Great vacation spot", "We absolutely love Oceanside Pier bunch of small little restaurants coffee shops and gift shops in the area Ruby's Diner is great"], ["Reviewed December 4, 2017", 5.0, "Nice pier", "Scenic pier. Lots of activity. Fun to walk along. Restaurant at very end of pier. Real pelicans on railings. Many fisherman, too. A great family activity."], ["Reviewed December 3, 2017", 5.0, "Pier Walking-", "Great family outing, walking the Oceanside Pier. Plenty of entertainment and food. Not to mention, amazing coastal view's and ocean Sunset's."], ["Reviewed December 2, 2017", 5.0, "A great walk & what views!", "The Oceanside Pier is a great discovery and truly a unique experience. It is ~ 1/3 of a mile and within walking distance of several nearby motels. Walking the pier is a special learning experience as it provides you a range of views of swells and waves. The surfers were out and offshore morning wind with high tide made for nice waves, good rides, and a reappearing Rainbow The pier is very sturdy and safe except for the famous brown pelican and a lot of bird droppings on the wood railings. Great views and fresh air!!\nShow less"], ["Reviewed November 26, 2017", 5.0, "Beautiful at night and not at all windy.", "The singer makes it extra special. And have fun looking for the fishermen to see what they are catching today."], ["Reviewed November 23, 2017", 5.0, "Long Pier", "It is a good walk to the end of the pier. The pier itself is well kept with a good Ruby’s restaurant at the end. Great sunsets but if there after sunset take a jumper or fleece as it can get cold."], ["Reviewed November 21, 2017", 5.0, "Claiming another Pacific Coast pier", "Claiming another Pacific Coast pier. My goal is to visit every pier on the Pacific Coast Highway, otherwise known as highway 1. It is fun to watch the surfers from the pier along with what the fishermen are catching off the pier. More than a notch in my pier collection it is a nice stop on my exploration of California.\nShow less"], ["Reviewed November 18, 2017", 5.0, "My morning walk workout; must abide fishing", "I fished with my dad as a kid, so fishing is ok by me. It's interesting to watch as you w a l k t h e l o n g pier, and there's a lot of it. The full pier walk out and back is a great wakeup, but halfway out to the souvenir shop and back is fun too.\nShow less"], ["Reviewed November 18, 2017", 4.0, "Very nice wood pier", "We really enjoyed our trip to oceanside. The pier is a nice viewpoint to watch the surfers or to fish. There is a RUby's Diner at the end of the pier"], ["Reviewed November 18, 2017", 5.0, "A lovely place to visit", "This was our second visit to Oceanside. We were there in the mid afternoon and it wasn’t too busy, lots of available parking and quick access to the beach and pier. I love walking on the pier, watching the surfers, seagulls and pelicans. When the sun sets it is absolutely the most gorgeous place to photograph!\nShow less"], ["Reviewed November 11, 2017", 5.0, "day trip with wife, son, and daughter in-law", "great pier with many things to see and do. it was fun watching the people fish and the surfers. nice to see that the people fishing were not charged using the pier. parking was reasonably priced and plenty of it if you get there early."], ["Reviewed November 10, 2017", 5.0, "Great walk and views!", "This is a great pier to stroll out on and enjoy the ocean and beach views. There is a lot of fishing going on, and it was fun watching everyone fish. There is no \"fee\" to walk out and there is a Ruby's Diner at the very end. We opted for the mom and pop Tin Fish at the bottom of the pier. Go early to find some parking!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Perfect stroll.", "Beautiful walk down the pier, watch the surfers and visit with local fishermen and see the eclectic mix of sea life. Have a meal or dessert at Ruby's Diner. There is a shuttle for those who have trouble walking back."], ["Reviewed November 9, 2017", 4.0, "North county Harbor Fun", "Lots of shops and restaurants ..plus I love the walk around the harbor. Fun to watch the boats coming in and out of the harbor plus Seals show up entertaining by standers. Also a nice little specialty coffee shop for a little afternoon coffee and snack.\nGreat way to enjoy the day.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Must see", "The pier reaches out into the water a ways and offers plenty of room to walk, sit, fish and watch beautiful sunsets."], ["Reviewed November 8, 2017", 5.0, "Beautiful view!", "very long pier with beautiful views. It was fun watching the surfers and the fishermen! We had delicious milkshakes from Ruby's diner at the end of the pier. You do have to pay for parking which was hard to come by late in the afternoon."], ["Reviewed November 5, 2017", 4.0, "Summer fun!", "Beautiful public beach with paid parking. Make sure you walk up & down the pier for scenic views & to watch fishermen. There is a diner at the end of the pier with good food & milkshakes!"], ["Reviewed November 3, 2017", 5.0, "2000 feet of Pier", "Nice stroll down the pier in the evening. Many fellow strollers and fishermen. Great place to watch the surfers and the sunset."], ["Reviewed November 3, 2017", 5.0, "Beautiful View!", "Offers a beautiful view of the ocean, beaches and swimmers. Nice little stroll for the family! The pier was clean and offered some shops along the way."], ["Reviewed October 30, 2017", 5.0, "Nice vibe... nice people", "Took an early evening stroll. Chatted with friendly fishermen and stall holders, watched the surfers and enjoyed the sunset... whatz not to like about this place..."], ["Reviewed October 29, 2017", 5.0, "Lovely Walk", "Easy, interesting walk out and back. Many people fishing. More strolling as we did. Sea birds fly by with the usual pigeons present too.\nWe saw a seal swim under the pier. Many surfers were out too on a cool Sunday afternoon.\nNo dogs permitted on the pier or the beach below.\nNice free attraction especially if you find free parking inland a few blocks.\nShow less"], ["Reviewed October 29, 2017", 4.0, "A bit dirty, but a nice walk", "We like this pier. Watch out for fish hooks and guts, but you can almost always count on some great bird sitings."], ["Reviewed October 29, 2017", 3.0, "Best thing was watching the surfers", "Being from the east coast with small waves, it's always a treat to watch people surf. diner at the end of the pier looked interesting, but I did not need a sit down meal. Better deal - Tin Fish at the foot of the pier. Really decent carry out fish sandwiches, et al. Parking lot across the street slightly annoying - you pay for an entire day; great if you need it, but if I'd had quarters with me, I wouldn't have.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Great Views off the Peir", "Awesome place to visit if you are in Oceanside, California. I really like the restaurant out on the end of the pier and the views are great. Take the family and enjoy the walk down the Peir"], ["Reviewed October 26, 2017", 5.0, "Gorgeous Views!", "My mother and I took a trip to Oceanside in early October and we walked out to the Oceanside Pier every day to experience the beautiful view of the ocean and eat at Ruby's at the end of the pier. It was fun to see the fish that people were catching and the unique birds along there!\nShow less"], ["Reviewed October 20, 2017", 4.0, "Long walk on a long pier", "Walked from South Carlsbad to the Pier. Great view of the beach, ocean and town from the Pier. Lots of people walking and enjoying the day even though it was blustery. Fishermen were catching fish sail boarders were busy on the water as well as surfers!\nAll in all fun walk!\nShow less"], ["Reviewed October 17, 2017", 5.0, "Great morning walk", "We were lucky enough to be staying right across from the Pier. We walked over there every day. It's a great people watching area. There were surfers out every day & also a lot of fisherman. Also, I was able to get a great close-up picture of a pelican!\nShow less"], ["Reviewed October 17, 2017", 5.0, "Nice", "Very nice pier. Clean with plenty of beach. Was able to see the sunset which was very nice. Parking nearby, as well as some restaurants."], ["Reviewed October 16, 2017", 5.0, "Beautiful!!!", "Loved the Pier, Loved the Restaurant!! Beautiful Waters and Beach!! We enjoyed watching the surfers and the fisherman"], ["Reviewed October 16, 2017", 5.0, "Nice walk", "I took my boys to the pier on a recent family trip. It was our first time in Oceanside. We'd gotten there in the mid-late morning. There was ample parking and the lot is only $5 for the entire day; however, a fisherman was leaving as we went to pay and gave us his pass, which we later passed on! We found the people here quite friendly. I have very social and curious boys, 7 & 9 years old, and the fisherman welcomed them over to watch them work. At the end of the pier is Ruby's Diner, a definite must for lunch!\nShow less"], ["Reviewed October 14, 2017", 5.0, "The Best Views", "What a great place to enjoy the ocean sites, and sounds. Great to watch the surfers or take a lovely stroll. Lots of fishermen, tourist, locals, but always felt safe. Lots of people walking the pier at night too."], ["Reviewed October 13, 2017", 4.0, "Great view over the water", "The Oceanside Pier overlooks a beautiful part of S. Cal's coastline. I enjoy walking along the street fronting the beaches and then detouring to the end of the Pier. It can get crowded and a lot of fishermen sometimes line the pier but it's well worth the visit.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Nice stroll out to Rudy's", "Great evening walk out to Rudy's for a early dinner. the walk was much better than the food. Fun to see the pelican next to the shop halfway out to the restaurant. many fishing couples. able to watch the surfers at sunset."], ["Reviewed October 9, 2017", 4.0, "Make room for this stop", "Our family, daughter, two granddaughters, grandmom and me (papa) arrived at 10:00am on a Monday in October. Parking was easy-pizzy. $5.00 for the day in lot on Pacific St. You can park down below by the beach for 1hr/$3, 2hrs/$6, 3hrs/$9. We headed to the beach next to pier. The beach was clean and free of garbage. The kids had a great time playing in the sand and serf. The adults enjoyed watching the surfboarders. Take the time to view the Pier from the beach and appreciate the construction and beauty.\nThe fishermen and smell of the sea combined to make our walk on the Pier interesting and rewarding for this Colorado family. The views back to shore were amazing. We will return in the evening for the sunset.\nShow less"], ["Reviewed October 9, 2017", 5.0, "AWESOME", "If your in Oceanside this is a must The View was amazing. My kids loved it. It is so close to everything"], ["Reviewed October 8, 2017", 5.0, "Great memories", "I used to go there years ago. I actually lived at 306 So. Pacific. It's just a peaceful experience with great food and atmosphere. I must go to place if ever in the area."], ["Reviewed October 7, 2017", 4.0, "Nice views", "Nice and amazing with seals. Beautiful sunset watching spot. Can rent boar or kayak and go into the laguna."], ["Reviewed October 7, 2017", 5.0, "Nice pier..strand and shop", "Nice area for walk...post and view very nice. Lots of military since camp Pendleton not to far away. Beach, shops and restaurants...nice day trip. Plenty of parking during the week."], ["Reviewed October 6, 2017", 5.0, "Surfers Everywhere", "Walked down to the Oceanside Pier every morning on my trip! Lots of people fishing and walking. Tons of surfers riding huge waves in. Mr. Pelican chilling out on the railing looking for something to eat. There are clean restrooms on the pier which I thought was a brilliant idea. And at the end of the pier there is a restaurant! Super cool!! Best part about this pier was meeting OG 4 Jesus from Gangland Ministry!! Thanks for representing and God bless you for what you do!! It was a pleasure meeting you and thank you for the t-shirt❤️❤️ Definitely coming back.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Enchanting in the Morning", "I fall in love with this place every time I visit early morning. I feel like I'm in a movie. It's enchanting... Surreal but nice..."], ["Reviewed October 2, 2017", 4.0, "Nice place to see Oceanside", "Go for a stroll, fish with locals, grab a shake at Ruby's. Great views from the pier. The only thing missing is activities (you have to walk back to land for those)."], ["Reviewed September 30, 2017", 5.0, "Beautiful!", "Oceanside Pier is beautiful. There's always people catching fish and waves! The pier has a restaurant at the end called Ruby's. Great atmosphere. There's multiple vendors under the pier on the weekends: ice cream, Italian ice, fruit stand, burger/hot dog stand, fish stand. It's a great place to visit on the weekends.\nShow less"], ["Reviewed September 27, 2017", 4.0, "Oceanside Pier", "We really enjoyed walking out to the end of the pier. Great views! Watching the sunset from the pier was breathtaking! We saw surfers and even had dinner at the end of the pier at Ruby's."], ["Reviewed September 26, 2017", 5.0, "Great beach with beautiful sunsets", "We stayed across the street at the Wyndham but would walk the pier at night. Watching sunsets, watching people fishing and enjoying the warm evenings. Never felt unsafe even later at night. Worth a walk on the pier."], ["Reviewed September 25, 2017", 4.0, "fun to just walk and enjoy the sights and sounds of the busy pier", "great area with lots of fishing happening (smells like fish..yes). It was great to enjoy the breeze and watch so many people fish at night. during the day its fun to walk out and maybe eat at the end of the pier. lots happening in the are. Check out the bubble guy!\nShow less"], ["Reviewed September 25, 2017", 5.0, "A must see destination in Southern California", "I lived in California for two years while my ex was stationed at Camp Pendleton. One of the first things I did was get a bus pass. I used to visit Oceanside nearly every day. One of my favorite places is the pier. It is one of the longest in California. There is a 50's style diner on the end of the pier called Ruby's. The food is delicious!\nShow less"], ["Reviewed September 23, 2017", 4.0, "Fun and a nice walk on the pier", "Great place to stroll alone, as a couple or with friends. Peaceful and calming. Not sure what it would be like in the summer months but I found it not crowded and not busy so that was nice"], ["Reviewed September 22, 2017", 3.0, "Fishing pier", "Nice pier for fishing .Many people catching mostly small mackerel or Bonita. A restaurant at the end of the pier did not try it. No charge to use pier. Bait and tackle shop on pier, reasonable prices."], ["Reviewed September 19, 2017", 4.0, "Walked the Pier and watched the fishermen and surfers.", "While walking the beach at Oceanside, we \"hit\" the Pier, Was busy and a lot of fishermen out there trying to score their lunch or dinner........ with some luck. Was fun watching the surfers also."], ["Reviewed September 17, 2017", 4.0, "Beautiful pier, beautiful views day and evening", "If you are looking for a relatively quieter and less crowded Southern California pier and still be able to enjoy the beautiful ocean and California coastline views this is the pier to come. With a lot less shops and commerce than other piers at Santa Monica or Mission Beach etc, there are also less crowd relatively speaking. Nonetheless, it's still a beautiful pier and it's also long so you get to go out further into the ocean. Views are really awesome both day and evening. Come and enjoy the unparalleled golden sunsets.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Traditional 1st Stop", "When we arrive in the Southern California area this is where we go first. We usually arrive In the afternoon. This is a fun place to play, eat, and watch the sun set.\n\nWe prefer to park in the lower lot at the base of the pier.\n\nThe beach area is clean and has fire pits. The restrooms are better than average. There is also a playground for littles.\n\nThe pier is long and memorable. We like to stop and watch the surfers. At the halfway mark there is a bait shop and restrooms. It's fun to watch the fisherman reel in their catches.\n\nAt both ends of the pier there is food. Our tradition is to eat at Ruby's Diner over the ocean. However, the Tin Fish restaurant at the base is also yummo. Ruby's is more for the atmosphere.\nShow less"], ["Reviewed September 15, 2017", 3.0, "Very boring pier", "The entire pier is occupied by fishing people. So, you really have no place to just lean and enjoy the view. Very disappointed. There is only one restaurant at the end of the pier. I am not sure what kind of food it had. No little shops or coffee shop. very boring\nShow less"], ["Reviewed September 14, 2017", 5.0, "Clean and a gorgeous view", "I could stand and watch the surfers and the seagulls for hours. The pier and ocean provided gorgeous views and even a light breeze during this unordinary hot season."], ["Reviewed September 13, 2017", 4.0, "Great visit great views!", "We had a couple of hours so we scooted down to the pier. What fun. The beach was full of swimmers and sun lovers. Lots of fisher-people, and lots of surfers. You do have to pay for parking. $5.00 for the entire day. If you're in the area, you need to stop and see it.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Nice pier", "Excellent pier just to walk along. The big parking lot nearby is $5 all day. Theirs a good beach nearby with bathrooms and a playground. The pier is free to walk down and has 2 bathrooms about halfway down. Theirs a sit down restaurant at the end as well as a bait and fishing gear rental place. The views are gorgeous, especially at sunset with little clouds. At night the entire thing lights up.\nShow less"], ["Reviewed September 10, 2017", 3.0, "It’s a pier", "It’s a pier. Lots of fishing. Lots of different peoples. Not much to say here. Kind of standard. Don’t cast overhead."], ["Reviewed September 9, 2017", 5.0, "An outstanding part of California history", "Take a walk on one of the longest wooden piers in the USA. Oceanside Pier is a great stop on you trip north or south on hwy 5. A nice restaurant (Ruby's) beckons you from your first step on the pier. You can shop at several small gift shops or buy your fishing supplies in the bait and tackle shop on the pier. A fishing license IS NOT REQUIRED while fishing on a pier. Go about 1/4 of a mile west into the and over the ocean and enjoy the views back to shore as well. Don't miss this nice coastal attraction while in O'side.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Great Place with Many Activities", "Oceanside has really come a long way to improve the area and its image, this includes the pier and the surrounding area. If you like walks on the beach, fishing from the pier or dining right at the ocean, this is the place for you. Sunset is a superb time of day to be here/\nShow less"], ["Reviewed September 7, 2017", 5.0, "Long and Great.", "I've been visiting Oceanside for manu years nor and one of the Great parts of Oceanside is the Oceanside Pier. At the end of the Pier is a Great 50's theme Restaurant called Rubys. They have Great Food and Shakes. If your going to Visit Oceanside anytime soon than I would Recommend visiting Oceanside Pier especially during the Summer.\nShow less"], ["Reviewed September 6, 2017", 5.0, "one of the longest piers in cali", "rubys dinner at the end of pier and a really good out door fish joint under the pier called Tin Fish great fish and chips. free fishing no licence needed on pier."], ["Reviewed September 6, 2017", 5.0, "Bum Land USA", "This is a great place to bum watch. There are homeless everywhere begging for money due to no jobs for Americans in this area."], ["Reviewed September 4, 2017", 4.0, "good but they don't allow dogs or service dogs on the pier! police safety told me personally.", "just don't bring your fur baby's with you. they don't allow them on the pier anymore.i had my service dog with me when this happened and to the harbor safety people! it didn't matter one bit."], ["Reviewed August 29, 2017", 4.0, "Nice Walk", "Very nice walk out to the end of the pier, excellent place to watch the sunset other than it is quite busy at dusk. Watching from the beach under the pier is nice as well."], ["Reviewed August 29, 2017", 5.0, "If you go to Oceanside..this is a must for everyone!", "This is a must do for anyone that goes to Oceanside. Super pleasant walk, people are always friendly. If you love the ocean, waves, saltwater and gorgeous sunsets.. This is a place for you!"], ["Reviewed August 29, 2017", 4.0, "Great views of surfing from the pier.", "Definitely not a place for high heel shoes :) the entire walk from one end of the pier to the other is uneven wood and steel bolts. I went on a Saturday morning, there were adults and children handing out bottled water and brochures of the day's activities. Nice touch.\n\nShow less"], ["Reviewed August 26, 2017", 5.0, "Great location", "This beach is one of the nicest in the USA. Very clean beach with nice sand. Very quiet. The kids had a blast"], ["Reviewed August 25, 2017", 5.0, "A must visit", "Every year when we come to Oceanside, we have to walk the pier. Fishermen were really catching a lot of fish today. We talked to one couple who fish there a lot and they said it was the best day they ever had. The shop half way on the pier will rent poles and sell bait. Very friendly.\n\nSurfers weren't having any luck today. I've never seen it so bad. Usually there are at least a few waves to watch the surfers ride.\n\nMetered parking on street ( coin or credit card ) as well as parking lots\nShow less"], ["Reviewed August 23, 2017", 5.0, "Great pier/beach for locals and tourists", "This is a great beach and pier for the locals and tourists alike, probably more for the locals. It's better that way, I assume. You can always feel the local culture and lifestyle.\n\nThe pier is a quite busy place, always full of fishers, swimmers, surfers, walkers, and what not. The scenery is great.\n\nClose to the pier, you can find lots of interesting local restaurants. Parking isn't really an issue, unless during the rush hours. You can always park on the neighborhood streets, and talk to the beach. There are also some metered parking spaces.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Love the Oceanside Pier", "Like many piers in Southern California, Oceanside pier has a Ruby's diner at the end of it. The pier is a great place to stroll, watch people in the water, fish, or just hang out. Public restrooms are midway down the pier and there is a place to buy a fishing license, bait, and rent fishing rods, too.\nShow less"], ["Reviewed August 19, 2017", 4.0, "Dinner and souvenirs", "We ate dinner after our sunset cruise at Pacific Marine Charters, and I accomplished my souvenir shopping."], ["Reviewed August 18, 2017", 5.0, "Incredible - do not miss walking out on this pier!", "Beautiful pier with plenty of people fishing for things living under the pier. There is a fishing shop about halfway down the pier with some fun pictures of fish that have been hauled up. Pretty incredible!\n\nGreat for people watching. Some street performers are on the pier so you never know what you might see. Be sure to walk UNDER the pier around sunset for some great pictures.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Love this pier", "We always have so much fun here. Great fish restaurant right below the pier and Ruby's at the end. The sunsets can't be beat. Wonderful calm walk watching the fisherman and surfers."], ["Reviewed August 17, 2017", 4.0, "Sights, sounds and interesting people!", "We checked out the pier at Oceanside to do some walking and sightseeing! A lot of folks strolling and a number of people fishing. We met up with some men and had an awesome conversation! Very friendly people! We stopped to check out the surfers for a few minutes. Ruby's is at the end of the pier! Worth the walk!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Locals But Love to Visit", "In Oceanside, the pier offers multiple restaurants nearby. The view is amazing, and less crowed during the weekdays. You can visit and enjoy the beautiful wooden pier that is featured on the TV show, Animal Kingdom. Filming of the show lasted an entire month this year. The pier offers a view of the beautiful Pacific, while the multiple numbers of surfer and fisherman entertain. Highly recommended if you stop by O'Side.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Always fun pier", "Great pier to walk out on- easy to access. Parking close by $5 all day that you can easily go in and out of."], ["Reviewed August 15, 2017", 5.0, "Walking out to sea", "Very nice long walk to the end of the pier. You are literally out in the ocean. You look back and realize how far you are from the beach."], ["Reviewed August 14, 2017", 5.0, "Fisherman's Pier", "While it's clean of trash, the pier is lined with fisherman, tackle and in many instances their families, wagons and coolers - they're there for the long haul. I didn't mind that, in fact found it fun and interesting - but maybe not all would find it so. At the end of the pier, behind Ruby's Diner, were the serious fisherman, with comparitively larger fish and being reeled in more frequently.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Pier Walk", "The pier is a great place to walk and get out over the water, watch some pelicans, and surfers. In good repair and maintained."], ["Reviewed August 13, 2017", 5.0, "Fishing", "Fishing is free on the pier.no need to have a fishing licence.pacific lobster season is in October and 7 is the limit per person per day.So if you like fish and lobster this is the place to try your luck catching. Happy fishing."], ["Reviewed August 13, 2017", 5.0, "Perfect for families", "Very nice beach with a restaurant at the end of the pier. Lots of families swimming and surfing and fishing. It was a perfect beach day."], ["Reviewed August 12, 2017", 5.0, "Go for the Sunste", "Hard to find a better pier than Oceanside. Great sunsets, lots of fishing, family friendly with Ruby's Restaurant on the end."], ["Reviewed August 11, 2017", 5.0, "Sunset", "The sunset views from the pier are unbelievable, there's not a bad spot to be when the sun goes down. The beach was well maintained and is a great place to visit"], ["Reviewed August 9, 2017", 5.0, "Where else can you walk out on a pier and on both sides of the pier are surfers catching waves back to shore?", "The Oceanside Pier is an Icon in the city of Oceanside. It is the longest wooden pier located in the entire Pacific Rim.. 1800 feet long. As you walk out on the pier you see the shore line on a clear day north to Dana Point and south to La Jolla. Miles in each direction. Fishing is allowed on the pier 24 hours a day without a license. Children love it.. great family time. As you walk out the pier you see surfers up and down the coast right in front of you catching perfect waves. Awesome location for photography. Weekends in the summer you find world famous surfing tournaments. At the west end of the Pier is the 1940-1950's style Ruby's Restaurant. Great burgers and malts, breakfast, lunch and dinner all while dining 1800 feet out onto the Pacific Ocean. What a place to be at Sunset. If you look close enough you may even be able to catch the infamous Green Flash just as the sun sets into the Pacific Ocean. I have.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Sand Wheelchairs", "I was so excited when I was putting together a trip itinerary for my great niece who is 12 and in a wheelchair to discover that two beaches in Oceanside have Sand Wheelchairs available for public use. The people I contacted by phone since I am in Northern Ca were so incredibly helpful. It's not always easy to find fun things for tweens in a wheelchair.\n\nThank you so much Oceanside!!\nShow less"], ["Reviewed August 9, 2017", 5.0, "Beautiul place to watch the sunset", "The Pier is a wonderful place to look out at the ocean, drop a fishing pole into the water or take a casual stroll. Ruby;s Diner is at the end of the pier for those who wish to eat overlooking the ocean."], ["Reviewed August 9, 2017", 5.0, "Nice stroll", "I have been 3 times this week and one of the times we ate at Ruby's... I have gone different times of the day and enjoyed late afternoon pre sunset the best. It seems to never be a dull moment, from fish being caught or watching the riders surf the waves. I like that there are bathrooms although I've never used them. I also like the half way point souvenir shop. I am super dramatic so I felt I always needed to push my huge double stroller and strap the kids in... this trip was different and I actually let them walk. They really enjoyed that. If you go after 6pm and you're lucky you might find a free after 6pm parking spot. I can say I have yet to pay for parking in the paid lot because someone is always leaving as I'm coming and gives me their ticket. So I pay it forward. Not everyone is as nice but it's awesome seeing people help each other out. It's so nice to have a place to go and unwind.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Great views and fishing", "This pier has great views and is a great place to watch a sunset, people watch, take photos, or go fishing.\nRuby's Diner offers good food and drinks at the end of the pier. In the middle is a great little vendor offering fishing rod rentals (no license needed), bait, shells and souvenirs. Convenient parking nearby on the street or at the beach parking lot at the foot of the pier. Fun for the whole family! The beach at the foot of the pier is also a fantastic place to swim, surf, sun bathe or enjoy an evening fire pit.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Heart of Oceanside!", "No visit to Oceanside would be complete without a walk on the pier. It is truly a regional treasure. The vantage point of the coast is unmatched! On your way, stop and see pictures of the previous piers and the giant fish caught from Oceanside's shoreline. It gives you a brief history of the pier and coastline. Waiting at the end of the pier is a vanilla shake or banna split at Ruby's!\nShow less"], ["Reviewed August 8, 2017", 5.0, "never better", "born and raised ti oceanside. the piers last reconstruction they sold names to be carved in the wood railings to help with the re-build\nmy family goes to visit the pier at least 10 times a year> all the names can lay claim to helping the pier. next time there take a look. (great for fishing don't need fishing lic)\nShow less"], ["Reviewed August 7, 2017", 4.0, "Nice Views", "The pier was fun. We ate at Ruby's at the end of the pier. Watched the sunset and the folks fishing."], ["Reviewed August 3, 2017", 5.0, "Great boardwalk in Oceanside", "Lovely pier to walk out on ocean and watch the surfers and fisherman........haven't tried the restaurant"], ["Reviewed August 1, 2017", 4.0, "Lovely but be sure to dress down for safety", "Oceanside is a great place but it doesn't have the safety of Laguna or La Jolla. You will be absolutely fine if you simply leave your jewelry and fancy handbags at the hotel. The Pier is a great and interesting walk as you pass folks who are fishing and enjoying the ocean scenery. There is a big police presence in the area....gives both a feeling of security and caution. If possible, go places in groups.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Great View", "A must see. There is quite a history of the pier. The pier offers a views of the ocean, shore and pier. There are people fishing along the way of the pier, it nice to stop and visit with them and ask how the fishing is going most always they will stop and interact. Above all it is a beautiful view.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Great place for beautiful views", "We had a great time enjoying the pier. We watched the surfers, swimmers, and people fishing. We got lucky and watched a guy bring in a shovel head shark. We enjoyed the pier very much."], ["Reviewed July 27, 2017", 4.0, "Pier, park, beach fun", "Great place to take the family. Pack your picnic for the beach or restaurants near by. There's the pier to explore, a playground for the kids, restrooms and beach showers to wash off. On weekends vendors set up(the weekend we were there). Wear water shoes as the beach is rocky but better at waterline.\nShow less"], ["Reviewed July 27, 2017", 3.0, "Fisher man's wharf for sure", "This pier was loaded with people fishing quite a bit if the entire distance from both sides. Not much space to actually view the ocean without fishing poles and the smell of fish and bait."], ["Reviewed July 25, 2017", 4.0, "Nice to see", "Being in Oceanside hard not to visit the pier. Everyone thought it was pretty neat. Great if you want to try your hand at fishing or go to the diner at the end. Also has a fantastic view of Oceanside."], ["Reviewed July 23, 2017", 4.0, "Nice views", "Nice views all around. This is a great place to people watch. Beautiful view of the beach. There is even a Ruby's at the end of it."], ["Reviewed July 23, 2017", 5.0, "Good place for an afternoon stroll.", "Very long pier with a place to buy souvenirs. Ruby's diner which is located at the end of the pier is also a must see."], ["Reviewed July 21, 2017", 5.0, "Oceanside is beautiful!", "We traveled to Oceanside for the first time and it was absolutely beautiful.It's a smaller area to visit and easy parking spots to locate above the main street the Strand. We parked and walked down the beach. The beach areas are mainly rocks. The view is gorgeous and the pier is neat to take a walk on. I would recommend going to Oceanside again.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Love Oceanside Pier", "It's a great place to watch the surfing competition, or enjoy the ocean breezes. There is permitted fishing from the pier, a gift and bait shop, and Ruby's restaurant at the end has indoor and outdoor seating."], ["Reviewed July 19, 2017", 5.0, "Great place to walk", "On a recent visit to SoCal, we took a trip and stayed the night in Oceanside. The pier was a great place to walk and people watch. It felt very safe during our day and night visit."], ["Reviewed July 19, 2017", 5.0, "Beautiful sunset", "Like any other ocean pier, the Oceanside Pier is great and offers wonderful views of sunrise/sunset. There is Ruby's diner at the end of it with two-level seating. It can get crowded but still the wait is not too bad.\n\nThe area around the pier is cleaned up quite a bit and looks much nicer than it used to. Parking can be a problem if you are looking to park for free but if you don't mind paying at a meter or a paid lot, it is available.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Great sunday afternoon activity", "Great people watching and easy walk down a very senic peir. The weather was fantastic. Nicely maintained and very clean."], ["Reviewed July 15, 2017", 5.0, "Super, Scenic Structure", "This is a great pier where you can take a leisurely walk or just stop and people watch. There are surfers to view along with pelicans and other wildlife. Fishermen are usually prevalent there and it is fun to watch them. There is also a neat little fish place at the base of the pier on the lower level that makes for a handy lunch. At the end of the pier is Ruby's Diner which we have not tried but has a good ocean view.\nShow less"], ["Reviewed July 13, 2017", 5.0, "A must see when in Oside!", "When you come to Oceanside, you have to visit the pier! It has Rubys Diner located at the end. Locals always fish from the pier. You usually can find a side show, band, or some sort of entertainment on or near the pier. You will have to pay for close parking. The free lot no longer exists due to new hotels and condo building. There is a little gift shop located in the middle of the pier. You can also rent fishing poles from them. Do not feed the local pelican!\nShow less"], ["Reviewed July 11, 2017", 4.0, "Easy Beachside Walk", "There is a lot going on in the area around the pier. The beach is nice right below the pier too, with an area to swim and an area to surf. The pier itself is really long and well kept with spots to sightsee, places to cast a fishing line (good luck, I've never had any success), or places to sit and enjoy the sun. Bring sunscreen, there is no shade to be found.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Longest wooden pier in North America.", "This is the longest wooden pier in North America. You can fish without a license from the pier. There is a Ruby's restaurant at the end of the Pier. Great Sunset Views. Open 24 hours."], ["Reviewed July 10, 2017", 5.0, "Sun and Fun all Around", "This a great beach to catch some rays, take a walk or enjoy some music.There is a large restaurant at the end of the large pier and a few other small stands along the beach. You can fish off the pier or just stand their to watch the surfers and boats in the distance. Lifeguards are at watch as you or your children jump around in the waves. There are many small seashells you can find to add to your collection. A bike rental place can provide you with many types of bikes to ride along the beach. Bring your skateboard or scooter along to coast on the smooth open areas.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Weekend Getaway with Kids", "Oceanside is great for families. Lots of places to hang out. Beaches are marvelous. Able to hit the beach in north or south side. Lifeguards everywhere. Pier is excellent for watching surfers and getting great photos. You can fish or just hang out on the pier. Didn't try Ruby's at the end. All around great experience 3 boys under the age of 8 thought it was fantastic. Will be going back next year.\nShow less"], ["Reviewed July 10, 2017", 5.0, "perfect beach time", "Lots of people, but well worth it. Parking can be challenging. bathrooms and food is close by. had a great time."], ["Reviewed July 10, 2017", 4.0, "Great view with an old fashioned soda fountain", "We stayed in Oceanside and frequently walked down to the pier and out to the end of it. Beautiful view, restaurant at the end is not fancy and great for kids. Chicken tenders are a must!"], ["Reviewed July 10, 2017", 5.0, "Longest wooden pier in California", "We live here, so hubby and I walk the pier about once a week. It is high up off the water and long enough for a nice stroll or brisk walk as we smell the ocean, see the pelicans hanging around the bait shop halfway along the pier, watch surfers enjoying themselves, and wish the fishermen good luck as they cast their lines into the ocean. It is wood, so the best shoes would be sneakers or comfy flats, definitely no high heels or fancy high wedges. There are restrooms as well as a diner at the end of the pier. Great, free, and healthy lesiure activity for all.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great Walk and Dine.", "Great walk on the longest wooden pier on the coast. Check out the fishermen and have a great meal at piers end at Ruby's. Always a great meal in 50's decor!"], ["Reviewed July 9, 2017", 5.0, "Beautiful views", "The pier is a great place to watch all the surfers, fisherman etc. and just take in the beautiful views of the ocean."], ["Reviewed July 8, 2017", 4.0, "Great area for family beach day", "Took an uber from our hotel to the beach around the harbor and we had a good time. There is bathrooms to change (kinda dirty after a while), food vendors (hot dogs, burgers, snow cones etc). Downside is that there is only one sand rinsing area with 4 water spouts which only 2 worked so long line. I think you can rent umbrellas, there are lifeguards near by at al times, white sand for castle building, some areas of the water may have huge pieces of rocks,. overall great place to spend the day with the fan.\nShow less"], ["Reviewed July 6, 2017", 4.0, "Southern California Culture.", "If you want a synopsis of Southern California culture, you can get it just by walking around Oceanside.\n\nPeople doing yoga on the beach, yellow \"Baywatch\" lifeguard vehicles, pelicans, fisherman, beach-houses, and lots of surfers, you see it all on the 1/4 mile walk up and down the pier.\nShow less"], ["Reviewed July 4, 2017", 4.0, "Family friendly Opportunity at Oceanside Pier", "Beautiful views up and down the coast as you walk out on this pier. We were fascinated to stand and watch the surfers wait for just the right wave. Waves were very good the day we were there (according to the locals). Food available towards the west end of the pier that smelled very good.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Super nice! A lot of activities!", "Clean and nice and very accessible. Parking is adequate and fairly inexpensive. Paddle board, sail boats and other water sport rentals. Super fun!"], ["Reviewed June 30, 2017", 5.0, "Loved!!!", "We stopped in Oceanside just so I could see the Top Gun house and when I looked across the street I saw the pier. We ended up sticking around for several hours! We ate lunch at the restaurant at the end of the pier and the kids played on the beach for awhile too!\nShow less"], ["Reviewed June 28, 2017", 4.0, "Walk on water..", "Visited Pier multiple times during 3 days stay recently, just have a great walk, watch the\nsurfers and fisherman, while enjoying the best view of coastline.\nLongest Pier in USA, well worth it and easy parking.\nso glad to be away from LA mess...\nHighly recommended...\nShow less"], ["Reviewed June 27, 2017", 5.0, "Oceanside pier", "Very nice place to see. Lots of things to do. You can rent bicycles, pedal cars, etc to ride up and down the boardwalk. Lots of vendors, shops and restaurants. There are parking meters or parking lots. Not sure how much the meters are but you can park in the lot directly across from pier all day for $5.00!\nShow less"], ["Reviewed June 27, 2017", 5.0, "Great old wooden pier", "Love the pier and the atmosphere, go here several times a month for the walk and the sightseeing. Always some sort of entertainment and fun to watch the beach goers and the surfers."], ["Reviewed June 27, 2017", 5.0, "Friendly!", "Walking along this lovely wooden pier, you can see waves crash, surfers waiting for waves, and waves starting to form - it's that long of a pier! Excellent fishing and friendly conversations with the locals and other travelers."], ["Reviewed June 24, 2017", 4.0, "Neat Attraction", "The pier is at the beach and one of the longer wooden piers I have seen anywhere. Great for people watching, surfer watching, dolphin viewing, or just a cool walk. Lots of people fishing off the pier as well. We went all the way out to eat at Ruby's Diner and after a short wait, we had a great burger, shake, and fries. A great place to eat. The only negative may be the parking. The streets are metered but not every meter accepts credit cards. Bring plenty of quarters. They are hard to come by.\nShow less"], ["Reviewed June 23, 2017", 4.0, "Good for a walk", "Oceanside has become a powerful tourist attraction, and it has hotels, motels, house rentals , time shares, paid parking meters to prove it. Needless to say, it is a sight to behold!From $10 Tacos, to bicycle rentals, and of course, the majestic Pacific Ocean, which makes it all worthwhile. The weather is also very kind to all who stop by.\nThe Oceanside Pier is a great place to go for a walk, bringing memories of times past, while enjoying a panoramic view of Oceanside life. Good exercise that is almost certain to revive appetites, so perhaps a well thought of picnic fare, might be more prudent approach. Unless, of course, all is well in fat wallet city, and then all temptations are within reach.\nOceanside Pier, boardwalk, sand and surf, it is truly a memorable experience in every way. Well worth the visit, even on a daily basis. Summer is king, and Oceanside Pier its wooden made castle. 4 Stars.\nShow less"], ["Reviewed June 22, 2017", 4.0, "Very impressive!", "Enjoyed our walk along the ocean and on the first part of the pier. It was a great place to watch the surfers! The wooden walkway is not great for small wheelchairs, however (tires got stuck between the wooden slats), so we didn't make it all the way to the end as we had planned.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Nice long pier for fishing, people watching, or just a nice stroll!", "This is a wooden pier that is very long and allows you to take a nice walk out for amazing views. There is a Ruby's Diner at the end of the pier which we did not eat at but seemed very busy and popular. Lots of people fishing off the pier as well. Afterwards we plopped down on the sand for awhile. I must say the sand on Oceanside beach is among the softest of the many Pacific coast beaches that we stopped at.\nShow less"], ["Reviewed June 19, 2017", 4.0, "Lots of parking, great for shows.", "Caught the SPF 949 show at the Amphitheater. Parking was actually pretty easy to find. Great environment, and I am looking forward to going back."], ["Reviewed June 17, 2017", 4.0, "Great for people watching", "Long leisurely walk down the pier. People watching along the way. Surfers working the waves and lots of people fishing. It's nice that there are benches along the way, you can sit and relax. Ruby's is located at the end of the pier in case you're hungry, thirsty or looking for ice cream even. There's a \" bait/ fishing rod\" rental little area if you need and a few standard souvenirs to be bought. Great pictures can be had also. They even have fish cleaning stations along the way.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Such a Beautiful Walk", "We walked all the way out to Ruby's Diner at the end of the pier. It was a beautiful afternoon and enjoyable to look at the ocean and see closeup, a very large pelican perched on the fence. Many people walk along the pier and it is a \"fun\" place to be.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Really nice", "Nice walk out on the pier saw dolphins and enjoyed the view very much. The day we went the restaurant was closed. This was a family visit that did not have teenagers or little kids. It is appropriate for both."], ["Reviewed June 12, 2017", 5.0, "Great views.", "Nice stroll, pier is in very good shape, lot's of activity on the pier, and at the end of the pier is a Ruby's Restaurant, bonus!"], ["Reviewed June 12, 2017", 5.0, "One of the last wooden piers.", "A trip to Oceanside would not be complete without stopping by the pier. The \"Top Gun\" house is just down the street a bit. It's a nice stroll on the pier, when you get to the end you can get some grub at the restaurant, or maybe a drink :)\nShow less"], ["Reviewed June 9, 2017", 5.0, "Graduation 2017", "Must must go to the pier and play. Watch the sunset and see all the surfers. Locals fish right off the pier. Was gloomy but everyone calls it June gloom guess it's normal. Definitely take a sweater or pickup a cute sweatshirt downtown on your way to the beach as the nights get cooler by the beach. You will not be disappointed\nShow less"], ["Reviewed June 9, 2017", 5.0, "What a view!", "My coworkers and I were passing through town on the way to San Diego from Laguna Beach for lunch at the local Hello Betty and we had to visit the pier. It was very pretty and different from what I experience on the Atlantic Ocean side.\nShow less"], ["Reviewed June 8, 2017", 5.0, "super getaway in oceanside", "betty fish house great. happy hour deals. portions great too. view of ocean unobstructed. roof top seating too. staff engaging. laid back vibe. thursday sunset market tons of food vendors and the like. town is walkable. people friendly all around. shops on ocean front walk way. parking paid as well as timed but free along street.\nShow less"], ["Reviewed June 7, 2017", 3.0, "Lots of folks", "This is a beautiful place to watch the sunset. You can see surfers and fisherman. It can get crowded. There is a restaurant on the pier. We didn't stop in, but it had people waiting to get in. Looked to be a 50's diner."], ["Reviewed June 4, 2017", 3.0, "Crime", "Stayed at a nearby hotel. First night there a homicide occurred at the pier entrance. Night time is sketchy and unsafe. Lots of \"gang\" folks and street people hanging around. Observed an open air drug deal in broad daylight near pier entrance out for my morning walk. Very disappointed.\nShow less"], ["Reviewed June 3, 2017", 2.0, "Just a pier", "I do not understand why Americans like piers that much. The oceanside one has just a restaurant in the end. The view is really beautiful."], ["Reviewed June 2, 2017", 4.0, "Oceanside pier", "Over the last 20 years I have been out on the Oceanside pier many times. Whether it's early in the morning to go fishing with 1 my son's, or late at night when all the lights are on. It's very enjoyable the walk along and see what activities are happening on the pier. It stretches out just over 1900 feet into the Pacific ocean. Good memories await for those who choose to make the trip.\nShow less"], ["Reviewed June 1, 2017", 4.0, "great views", "Love walking out on the pier into the ocean and see the families strolling, fisherman, surfers and a view back of the coast and Oceanside."], ["Reviewed May 28, 2017", 4.0, "Super Sunset", "Was there when the sun was going down. Lots of people fishing from the pier (free to fish here). Lots of surfers in the sea."], ["Reviewed May 26, 2017", 4.0, "Nice place for view of Oceanside", "The pier is a nice place for a walk, run, fishing, and great views of the beach, ocean, city, and sunset's. There's a snack bar half way down the pier that has items for purchase and a Ruby's restaurant at the very end."], ["Reviewed May 24, 2017", 5.0, "Staycation 2017", "Beautiful and quiet. Peaceful and full of beauty. I need to start visiting more. Lots of hotels being built to increase tourism. Better get there first."], ["Reviewed May 24, 2017", 5.0, "Beautiful views, fresh morning air, relaxing atmosphere", "Great location for early morning walk. Pick up a cup of your favourite drink at the nearby coffee shops then enjoy a stroll on the pier. On many a day you'll catch a glimpse of dolphins, baby sand sharks being reeled in by local fisherman or perhaps a whale or two.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Nice Walk", "We like to walk the pier. Great for people watching. People fishing, surfing, swimming The restaurant isn't great, but to go in and sit and have coffee and a desert it's OK."]]}}