{"Old Fisherman's Wharf": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Old Fisherman's Wharf", "url": "/Attraction_Review-g32737-d144837-Reviews-Old_Fisherman_s_Wharf-Monterey_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/09/fb/1f/pict-opp-time.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "2179"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Monterey", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Clam Chowder!", "Great place to walk around and enjoy the shops, food especially Clam Chowder or Fish and Chips! Well worth the trip and to just explore."], ["Reviewed yesterday", 5.0, "Great setting for my husband's photography hobby", "Beautiful well maintained wharf. This is a lovely outdoor spot to visit and relax. We walked to this wharf four times during our stay so we could feel the ocean breeze and calm atmosphere. Surrounded by restaurants, this wharf is a \"♥️ Go - to\" place on vacation\nShow less"], ["Reviewed 1 week ago", 4.0, "Good seafood.", "A good selection of seafood restaurants. Lots of clam chowder and sourdough bread bowl shops. Weekends are an hour wait to get a seat, so come with you patience."], ["Reviewed 1 week ago", 5.0, "grotto", "food is amazing, best filet and lobster anywhere - beats SF, and their pinot noir is a bit pricey but they have an extensive array of reds and the only place to carry my favorite"], ["Reviewed 1 week ago", 4.0, "So be a tourist!", "This is a real tourist, but sometimes that is ok. It is beautiful, has great bars and restaurants and the shirts and sweaters are inexpensive in case you didn't plan for the cool ocean breezes. In a two mile round trip walk on flat ground you can include cannery row.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Good food and people watching", "Very good seafood and not trendy. We had rented bikes to ride there and were able to see harbor seals close by resting and swimming."], ["Reviewed 2 weeks ago", 5.0, "Cold and Windy", "It was cold and windy (but what can you expect in January) but we enjoyed the area. We saw some wildlife and enjoyed the walk."], ["Reviewed 3 weeks ago", 5.0, "Fun night out", "Fun time, typical tourist area but nice outting, food, and friendly people. Lots of food options and suvoniers. It's fun to walk the wharf and have dinner overlooking the bay. Try it!"], ["Reviewed 3 weeks ago", 3.0, "Energetic fun vibe", "Beautiful waterfront and lots of activity on this wharf. There are many regular beach type/souvenir stores. There are also many restaurants that are vying for your business by handing out samples and coupons for free appetizers. It felt a little strange and high pressure, but we did sample some chowder and decided to take them up on the appetizer, and it was all fine.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Yep. It's Beautiful.", "Old Fisherman's Wharf had been on my bucket list for years. I wasn't disappointed. It has everything. Touristy shops, awesome stuff to do, really fantastic food. Amazing views. We started early ..wandered a couple of hours, took a tour into San Francisco, and came back to wander some more. Loved it.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Food place if staying", "If staying in Monterey, would be good to eat. But as a day traveler, the hassle of parking and food smells not worth the views."], ["Reviewed 4 weeks ago", 4.0, "Good for a few hours of shopping & eating...", "Old Fisherman's Wharf in Monterey has several pay parking lots located nearby....\nAs you stroll out onto the wharf, many of the restaurants hand out small samples of their clam chowder to lure you into their establishment\nThis place is good for a few fours of fun exploring of their tourist shops and then trying one of the many restaurants for lunch or dinner.\nYou can also take an excursion out onto the water to see the bay, fish or watch the whales migrate.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Great adventures and dinning", "There are a dozen great dinning and bar establishments along this warf. The fishing and whale watch adventures are someof the best south of San Francisco."], ["Reviewed January 23, 2018", 4.0, "One of my favorite piers in California", "The Fisherman's wharf in Monterey is one of my favorites. It's only one pier so a lot smaller than it's SF counterpart but it's lined with excellent seafood restaurants and shops. It's just a happy place"], ["Reviewed January 22, 2018", 5.0, "Lovely View", "Fantastic! You have to visit Monterey, I cannot wait to visit this place again just beautiful. Take a stroll through old fisherman’s wharf and it’s just super relaxing."], ["Reviewed January 21, 2018", 3.0, "Touristy shopping", "It's fun for a walk through if you're interested in some touristy stuff. There's a lot of high price things that I can't imagine buying while on vacation."], ["Reviewed January 20, 2018", 5.0, "Awesome!", "There are SO MANY places to visit in Monterey & this is one of the BEST!! Its filled with character & excellent food & quaint shops & its next to the harbor! This is a day long, yummy eating, meet the natives, enjoy your meals with great conversation type of visit & WE LOVED IT!! Just lots of fun.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Touristy", "The Fisherman's Wharf was within walking distance to our hotel, we walked there one night and had dinner. Very touristy but fun for the kids with the candy and gift shops. We did have dinner there at the Big Fish Grill, which was at the very end of the wharf and was fine for a family dinner.\n\nThere were some homeless people around, but nothing to be concerned about. The Wharf is old and a little run-down, but one of those things you should do once in Monterey.\n\nIf you have kids and want a touristy area to walk though, it is a good place to have dinner and do a little souvenir shopping. If you are looking for a nice dinner, I would opt somewhere else.\nShow less"], ["Reviewed January 16, 2018", 3.0, "Old", "I love boats and the water and seeing them together, but there is something deflating about this in many ways."], ["Reviewed January 15, 2018", 3.0, "It's OK", "The Wharf is one of those see it once things. About a block long of gift shops, resturants and a couple of small fish markets. If you want a more real experience, get there before sunrise to see the fishing boats and charters go out. The sound of seagulls and otters can be loud. The ocean air is strong. I may be biased as Monterey was my hometown, but even then the Wharf was a see it once kind of thing.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Within walking distance of the Navy PGS", "Walked down to this area on the morning before our flight home the nexxt day. Lots and lots of touristy shops as you might expect but the walkway along the waterfront is interesting with informational displays along the way. Several whale watching tours board from the wharf. Close to Cannery Row. Worth a visit just to say you were there.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Wildlife and good food.", "Been visiting here for years because: the large smoked salmon on roll ($8) for takeout, sea lions, sea birds, selection of seafood restaurants and the Whale Watching boat. Plus shopping and people watching, if you're into that..."], ["Reviewed January 9, 2018", 2.0, "Icky and crowded", "This is a very touristy spot. I mean, it's cool to have shops and restaurants on the ocean but its really dirty and there are hundreds of panhandlers at the entrance - they aren't passive about it either. I have compassion on these people but I also felt unsafe particularly with my kids there. Restaurants have people standing outside trying to force you to try clam chowder and make you go into their restaurants. They are not classy about it; they act like used car salesman. I've eaten at several restaurants there and none are worth what you pay. Dirty and meh.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Walk Back Into Time", "When you're in Monterey, a very pleasant place to visit is next to downtown within walking distance, the old wharf area has good restaurants and it's quiet. The opposite of Pier 39 in San Francisco, this is a genuine romantic part of Monterey where locals go to fish and just soak in the ambiance and beauty of Monterey Bay, watch the fishing, and get a bite to eat in the afternoon. The entrance is right on the bike path and across from El Estero Park, and a McDonald's, where you can eat and then rent paddle boats for a spin on the lake. You'll feel like it's fifty years ago.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Great place to visit", "Fantastic place to visit with kids. Plenty of places to eat and drink. Many gift shops and quality boutiques. Nice afternoon to spend in a very pleasant atmosphere"], ["Reviewed January 4, 2018", 4.0, "Same as it was 35 years ago.", "Nothing much really changes here mush except the price. they charge you to park now totally expected it was a dollar every half hour. It's a nice very old Pier with lots of restaurants and stores. One of the things they do now is they have samples of clam chowder out in front of just about every restaurant, they will also give you a free complimentary entree with any meal you purchase including a clam chowder bread bowl. Normally calamari strips or something very small not much of it but its free.. The clam chowder bread bowls range anywhere from $9 to $15 depending on the restaurant. I would suggest you try them all because they are all very different some very good some terrible. Surprisingly the stores are not too expensive for sweatshirts or logo Monterey souvenir hoodies tee shirt's.. unlike the clam chowder most of the entries are around the same price throughout the pier. One of the things I must mention the clam chowder that you taste outside of the restaurant that's full of clams and taste delicious is not the same when you get inside. It was hard to find any clams/ bacon in the chowder. It's like the old bait-and-switch we ate there at two different restaurants in two different days same thing happen both places. It's not as good as the San Francisco clam chowder or Pismo Beach area. But again this is a tourist trap area do your research. We come here about 1 time every two years never really get disappointed.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Smaller than San Francisco, but still wonderful.", "Very intimate and low key. While Fisherman's Wharf in San Francisco feels like a carnival, Monterey is less crowded but still has great food, sea lions right at your feet, and that smell. Okay, the smell is an acquired taste, but it's authentic.\n\nEat at the Sardine Factory on Cannery Row, or at any of the seafood joints right on the wharf. Fresh calamari is the best in the world and no one prepares it better than these guys.\nShow less"], ["Reviewed December 31, 2017", 5.0, "fun to explore places", "it was fun to explore places but quite expensive for me so had to pass but one thing I recommend is try whale watching if you haven't"], ["Reviewed December 26, 2017", 5.0, "Christmas lights and Carolers", "I had a wonderful stroll down the old wharf pier. I bought a Monterey Christmas ornament ate at Old Fisherman's Grotto and had ice cream afterward. Please vote if helpful."], ["Reviewed December 24, 2017", 5.0, "Worth the early rise!", "If you have never seen the sunset from here you are missing out!! Definitely a must see!! You can even hear the local seals if your lucky!"], ["Reviewed December 21, 2017", 3.0, "Fine, very touristy", "We went through, there were many touristy shops. The restaurants gave our their chowder samples and coupons to entice you in. So we had a good meal with a pretty view."], ["Reviewed December 17, 2017", 5.0, "Sure, it's touristy!", "I don't mind that Old Fisherman's Wharf is touristy, because I was a tourist -- and I sort of get a kick out of all the neon and T-shirt shops. The scenery is glorious. Parking, always a challenge in downtown Monterey, is actually pretty easy once you figure out where you're going. And the restaurants compete for business with lots of freebies and other incentives.\nShow less"], ["Reviewed December 12, 2017", 4.0, "Lovely ambience and range of shops & eateries", "We went for lunch and many places had value set lunches of $10+ per pax. There are cute and quaint shops and we could soak in the Christmas atmosphere. Good place to stop for a meal when visiting monterey."], ["Reviewed December 5, 2017", 5.0, "Fun little wharf", "It was a beautiful day in Monterey when we walked along the Old Fisherman's Wharf. It's a small wharf, not a long walk, with your typical shops with tshirts and trinkets, a few candy shops and plenty of restaurants to choose from. It's clean and the employees are very friendly. You can find at least one place to reserve a trip for whale watching, too. I would recommend going during the week, as the weekends seem to be more crowded.\nShow less"], ["Reviewed December 4, 2017", 5.0, "Had a such a good time that we went back the next day.", "So much to see and do and so many restaurants to try and we did. All handing our samples of chowder and candy. Bought some caramel popcorn so delicious that I am now ordering it online. Fresh seafood and shops, too. Lots going !"], ["Reviewed November 30, 2017", 3.0, "Commercialised to Modern", "Much has changed on this wharf and it is now quite commercialised and not representative of old. Better viewed from the distance... 2070"], ["Reviewed November 30, 2017", 3.0, "Commercial not historical", "If you want to shop or eat, this is great. If you want historic Monterey, this is not! If here, check out Monterey Bay Whale Watch ( not the other whale watches) - highly recommended."], ["Reviewed November 28, 2017", 4.0, "Stroll the Wharf", "It’s a pleasant place to walk about and take in the seascape, the boats, nets and nautical items - plus smell the salt air. More modern, thus not as authentic as SF Fisherman’s Wharf, it’s still pretty nice."], ["Reviewed November 24, 2017", 4.0, "Another place to go for a stroll", "Busy and bustling. Full of cafes and shops. Some interesting history. Some beautiful views from there though."], ["Reviewed November 24, 2017", 5.0, "Nice Place", "Fun place to walk along and visit the shops and restaurants. All the restaurants brag their clam chowder is the BEST, they even give you a free taste so you can compare."], ["Reviewed November 24, 2017", 1.0, "No children allowed in a restaurant on the pier as they annoy everyone else", "It's a boring pier full of shops selling fish dishes. On the other side, you can fish off the pier. Once I saw that children were not allowed in the dining room of The Old Fisherman's Grotto, I lost all taste for being there and swiftly left. This tourist trap is NOTHING BUT FAMILIES... It's not fine dining at all and I found it upsetting that a restaurant completely excluded families with small children. We had dinner in Carmel where children were welcome. The pier is super tiny and not worth going to.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Just like Cannery Row, this place is filled with life!", "Old Fisherman’s Wharf is a great place to visit if you are shopping, picture-taking and eating in Monterey! We had lunch here and also bought a few souvenirs. We also took lots of pictures while we were visiting. This part of town seems very popular for tourists and locals alike! If you like harbours, this is the place for you. If you like boats, this is the place for you. If you like shopping for souvenirs, come visit Old Fisherman’s Wharf!\nShow less"], ["Reviewed November 22, 2017", 5.0, "A Must See!", "If you are looking for a nice walk along the water where you can also do some shopping and sightsee at the same time and \"EAT!!\" then hanging out at the Fisherman's Wharf is where you need to head to. A lot of fun to have an adult beverage, eat seafood, do some shopping and people watch all in the beautiful setting of Monterey. *note of caution, if you are there later in the day, skip the vendors with the seafood and clam chowder, it has been sitting there all day...might keep you up all night, if you are early then by all means indulge. Many tasty things to try. : )\nShow less"], ["Reviewed November 20, 2017", 4.0, "One of the nice area to hangout", "Its a nice area nearby the golden gate bridge. Feels really safe to walk around the Fisherman's wharf.... Many things to do around"], ["Reviewed November 19, 2017", 3.0, "Tourist trap", "Total tourist trap. If you go knowing that, you won't be disappointed, but don't think it'll be anything but. Filled with typical touristy shops (t-shirts, candy, etc...) and LOTS of seafood resturants. Harbor tours and whale watching boats leave out of here too. Fun for little kids.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Vintage Tourist Trap", "Yes...this is a vintage tourist trap, but a trip to Monterey wouldn't be complete without a stroll down this famous wooden wharf. Besides people watching there are lots of restaurants, shops, whale watching and bay tour departures. I believe every restaurant was providing samples of their chowder in the entrance of their restaurant, so come hungry and eat free!\nWe dined at BIG FISH GRILL and it was terrific!\nPRINCESS Cruise Ship tenders use this pier to shuttle passengers to their ship anchored in the bay.\nShow less"], ["Reviewed November 14, 2017", 3.0, "Nice but!", "The pier is nice but the homeless people and beggers are to much. As you walk to get to the pier their are so many people asking for money, and people with animals which make the surroundings uncomfortable."], ["Reviewed November 13, 2017", 5.0, "Ready set Go! Strolling, Shopping and plenty of good eating!", "A wonderful place to stroll, people watch, shop and eat. So many choices for wonderful sea food from a quick bite to fine dinning! Just loved it!"], ["Reviewed November 12, 2017", 4.0, "Wonderful stroll dow the Old Wharf", "We were up early and decided to go for a walk down to the Old Fisherman's Wharf. Saw lots of seals and birds and admired stunning views of Monterey Bay and the open ocean."], ["Reviewed November 10, 2017", 5.0, "Relaxing Atmosphere", "Food was Fabulous, service was great, ambience, what more is there to say, we love everything there is about Monterey."], ["Reviewed November 9, 2017", 3.0, "Nothing special", "It's worth the trip if you are in the area but it's all touristy and mostly restaurants. You have to pay to park close by. Most restaurants have someone in front handing out samples of chowder which is fun."], ["Reviewed November 9, 2017", 4.0, "Quaint Wharf", "There are shops, restaurants, and nice boats at the wharf. It was fun walking around, sampling chowder from the seafood restaurants, having a bite to eat and people watch. Worth a stop to poke around if you are in Monterey."], ["Reviewed November 9, 2017", 3.0, "Fun tourist spot - food just OK", "This is a fun place to visit. You have to pay for parking. Food is just OK. We ate at Paluca Trattoria. Pricey. Lot's of bread/filling items."], ["Reviewed November 9, 2017", 5.0, "Gotta love the fish!", "Lots of souvenir shops and places to eat. Sooo many places to eat! We found one with a view of the harbor, and $15 dinner including dessert. Outstanding food—fish of course!"], ["Reviewed November 8, 2017", 3.0, "Resturants and Shops", "The shops are not as unique as Fisherman Wharf (SF) and the shops were sum what dirty. The restaurants are all trying to get you to eat there and can be somewhat pushy. My advice it is a place to visit and go to the restaurant that is not a pushy or you feel appeals to you.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Beautiful wharf!!!", "Great place to watch the boats or surfers. Also great place to be on the lookout for wildlife. Tons of restaurants and things to do in the wharf area."], ["Reviewed November 7, 2017", 5.0, "Cruise 🚢 Ship in the harbor!", "We always love to visit Monterey Bay! There is a great park in between cannery row and fisherman‘s wharf! This time there was an actual crew ship in the harbor right off the shore! We were able to walk from Cannery Row to fisherman‘s wharf to the old municipal wharf for breakfast. What a great time! Don’t miss the restaurants and shops on old Fisherman’s Wharf!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Love the atmosphere", "Glad I got to visit fisherman‘s wharf in Monterey. I read a lot of reviews that said it was too touristy but I really enjoyed the atmosphere. It was fun walking down the wharf, tasting all the clam chowder‘s, and looking at all the seafood displays outside of the restaurants. Also lots of little souvenir shops to pick up something to remember your visit. Don’t miss it.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Free samples", "Lovely for a wonder and free samples of clam chowder. Very vibriant and lively. Lots of nice views over the sea."], ["Reviewed November 3, 2017", 4.0, "Very scenic!", "We love to visit Old Fisherman's Wharf when we're in Monterey, CA. There are some great restaurants there and places to take you on dolphin or whale watches. The scenery is beautiful with all the boats, water, and seals!"], ["Reviewed November 1, 2017", 4.0, "Great ambiance", "A bit less busy than Cannery Row, Old Fisherman's has nice restaurants, gift shops and great views on the harbour."], ["Reviewed October 31, 2017", 3.0, "Average Tourist Area, Better Things to See Elsewhere", "We have been to Monterey on several occasions and usually find ourselves wandering on Old Fisherman's Wharf. It is perhaps the most touristy area of Monterey, even more so than Cannery Row. The wharf is filled with places to take glass bottom boat tours, harbor tours and fishing tours. There are also numerous restaurants all trying to tempt one in with offers of free appetizers and usually giving free samples of their special, like no one else's clam chowder. My advice, skip most of these restaurants and head to Cannery Row or beyond for better food. Old Fisherman's Wharf is nice for the walk but little else (unless you want to sample clam chowder).\nShow less"], ["Reviewed October 30, 2017", 2.0, "It has become increasingly tacky", "We first visited Fishermen's Wharf 25 years ago, but a return visit recently left us underwhelmed - just restaurants touting for business and tacky souvenir shops"], ["Reviewed October 30, 2017", 5.0, "Smaller version of the one in San Francisco", "Very quaint! Lots of cute shops, bars and restaurants with amazing seafood! Usually live music. A short walk from cannery row."], ["Reviewed October 30, 2017", 3.0, "tourist trap", "super cute wharf, but I could have done without being heckled to eat at a restaurant. I ate at the crab house, it was just average. Go to this wharf if you want to buy touristy items. On a positive note, whale watching trips leave from here and that was a lot of fun!\nShow less"], ["Reviewed October 29, 2017", 3.0, "Nothing but shops and restaurants", "If you want to spend the day walking down a row of restaurants and shops, this is the place for you. With the exception of the fact that you also can find whale watching outfits and fishing charters here there is nothing much to see or do. It is a rundown version of Cannery Row. Skip one or the other.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Touristy Yes Fun Yes", "Yes the focus of the Wharf is to sell you something Monterey but it still provides a fun atmosphere to breath in the sweet salty air and enjoy an adult beverage and some good chowder."], ["Reviewed October 26, 2017", 3.0, "Interesting/good observation decks", "Was not as exciting as we were expecting, but worth walking too from the Monterey Hotel. Lots of decent places to eat/drink and nice observation deck at the end where I watched the sun rise, took pictures and listened to the wildlife. Very quiet in the morning and not much was open.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Nice Walk", "Lovely warm evening to have a stroll - Plenty of shops and restaurants with tasters outside to tempt you in. Lovely to see wild Humming Birds sampling nectar from the flowers."], ["Reviewed October 23, 2017", 5.0, "Go There Just For The Whale Watching", "It's a tourist trap par excellence but the whale watching out on the boats from there is simply awesome."], ["Reviewed October 22, 2017", 4.0, "Pretty View", "Pretty to walk around and see the boats and possibly a seal. Not much else to do in Monterey. But the walk path near and around the Old Fishermans Wharf is nice."], ["Reviewed October 22, 2017", 4.0, "A great way to spend the afternoon", "Good for any age. Lots of shops, bars, and restaurants. A fun, vibrant feel. Beautiful views. Yummy clam chowder in bread bowls at many places!"], ["Reviewed October 22, 2017", 5.0, "Busy", "Lots of people lots of shops and restaurants it's got look out places to see the harbour and spot the Sea lions and Sea otters sit in restaurants look out at the Sea. Great place"], ["Reviewed October 20, 2017", 4.0, "Interesting", "We were on a cruise ship and our tender arrived at Fishermans wharf. The wharf is very pleasant, with restaurants and tourist shops. Various boat tours are offered. We watched seals from the wharf."], ["Reviewed October 19, 2017", 5.0, "A stroll down memory lane", "So many folks are able to enjoy this lovely preserved Wharf. From fishing trawlers to recreational boats, the Wharf is a very vibrant location. It was fun to sit on a bench and watch the walkers, cyclists, children playing on the grass and boaters going about their day.\nShow less"], ["Reviewed October 18, 2017", 3.0, "Worth a Look", "This is a must visit when I’m Monterey but it’s so touristy there is little need to linger.\nYou are assailed by canvassers and commercial signage on all sides.\nStill worth a walk out to view the Sea Lions and indeed others may wish to visit the many bars, restaurants and gift shops!\nShow less"], ["Reviewed October 18, 2017", 3.0, "Love the seals", "Nice place to have a stroll. Enjoyed watching the seals. Shops ok, pretty touristy as were the eateries but ok for a little mooch around."], ["Reviewed October 17, 2017", 3.0, "Picturesque", "Very pretty and great for taking pictures, but not a whole lot to do here. My partner and I enjoyed watching the seals in the bay, walking down the pier and just looking out over the very blue ocean, but all the stores were very touristy and we didn't spend more than about 45 minutes here. Still, great if you're into picturesque, beachy places.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Girls Trip", "Loved this place. So much to see. Very clean. Everyone was very friendly. Something for everyone here. Nice marina."], ["Reviewed October 16, 2017", 5.0, "Birthday celebration of 170 years", "The Sunday we went to old Fisherman's wharf was its birthday celebration with cake and food giveaways. There are unique shops, restaurants and boat tours of whales and dolphins. Old Fisherman's Groto has my favorite clam chowder that I have been eating for 25 years. Abalonetti has different styles of calamari steaks. There is a second story viewing platform at the end of the warf where I eat my clam chowder. If you are into a 2 mile walk, park at the warf and hike to cannery row on the walking trail.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Fun Wharf, my wife and I kept going back.", "You could really feel the history while on this wharf. Lots of fun things to do for everyone. My wife and I loved the view of the harbor and surrounding area. You can see jellyfish in the water and the occasional seal cruising by. Food and shops galore.\nShow less"], ["Reviewed October 11, 2017", 3.0, "What a great view, awesome experience", "We hit the wharf just on sunset. Sunset at this time of year is over the hills. But the atmosphere is just electric. Lots to see, to take in , to absorb"], ["Reviewed October 11, 2017", 5.0, "As good as ever", "Old Fisherman's wharf isn't a long walk, but it's loaded with interesting stuff. Both sides of the wharf are solid with restaurants, novelty shops, jewelry stores and the like. There is an open spot near the end where you can looki over a railing to watch the water of the bay and maybe see a bunch of jellyfish, I did! Well worth the time and the opportunity to eat some wonderful seafood.\nShow less"], ["Reviewed October 11, 2017", 4.0, "\"Old\" Fisherman's Wharf", "It would not be a trip to Monterey without visiting Fisherman's Wharf. It felt a bit like going back in time as the wharf has candy stores and restaurants that feel a bit dated. Of course tasting the clam chowder samples is always a treat."], ["Reviewed October 9, 2017", 3.0, "Good for one day", "Stopped here for an afternoon. Nice path to ride, walk, run. Some shops, but not many, and mostly touristy junk. Would love to see some nice clothing or art shops?"], ["Reviewed October 9, 2017", 4.0, "Gotta see spot", "Cool old warf with lots to see and do. Boats, shops, eating spots and seal lions and seals to enjoy."], ["Reviewed October 8, 2017", 5.0, "Great find", "Stumbled upon this looking for breakfast and found an amazing little place. We had breakfast and were offered 10% discount the breakfast was very nice and the customer service was amazing. We then found a little glass bottom boat tour that took 30 mins and showed us some sights offshore.\n\nWe saw sea lions, otters and jellyfish as well as getting some history of the area.\n\nWell done to the little mermaid boat tour group\nShow less"], ["Reviewed October 8, 2017", 5.0, "Must see", "So glad we stopped off in Monterey to experience this on the way up the coast! Lovely unique stores and restaurants. All food is on the pricey side but in line with the area. For any seafood fan this is the place to be. I recommend taking the boat tour at $18 to see the sea life up close!\nShow less"], ["Reviewed October 5, 2017", 4.0, "Fun Kitschy Place", "Okay, it is sort of typical tourist trap in a lot of ways. T-shirt and trinket stores, but there are some really good restaurants and good views and of course the whale watch boats leave from there. I enjoyed just wondering around on the wharf."], ["Reviewed October 4, 2017", 5.0, "Packed with restaurants, sweet shops, shops etc", "This is a gorgeous part of Monterey and we even spotted some seals probably waiting for fish to be thrown to them.\n\nWe ate here and noticed there are lots of restaurants with lots of very cheap offers. The chocolates are more expensive though and there are also several boats that take you at sea for whale watching etc.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Small but well worth the visit.", "Been to the Wharf several times thru the years and always enjoy walking thru and seeing all the sites. Numerous very good restaurants, gift shops, boat tours, whale watching excursions, etc. Well worth the time to stroll thru, also very handy to a brief walk downtown to other shops and eating places.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Picturesque", "We drove into Monterrey & immediately sought out the Fishermans Wharf taking a trip down memory lane.\n\nWe had early dinner at the Japanese restaurant there. We took a window seat upstairs facing the sea and had a wonderful time watching the Yachts & sailboats moored at the Wharf. Best of all was the sight of the sea lions playing in the water just below us!\n\nFood was good and service was reasonable...\nShow less"], ["Reviewed October 2, 2017", 4.0, "Fun, but not big enough to spend much time on", "We spent about 45 minutes watching the sea lions and the many jellyfish, which were drifting all around the wharf area (they were my favorite part). We didn't go into any of the many restaurants or shops because they all looked a little scruffy and crowded. We enjoyed the views of the bay and the many boats docked nearby. It is a pleasant place to stroll around for an hour or so on a sunny day, but don't count on it for a day long adventure, unless you pay to go on one of the boat trips available there.\nShow less"], ["Reviewed September 30, 2017", 4.0, "Lots of animals to see!", "Lots of animals to see, including sea lions, giant pelicans, otters, and seals. Surprised at some of the signs regarding no strollers and high chairs, but found plenty to accommodate us."], ["Reviewed September 30, 2017", 5.0, "view the boats", "nice day to take some pictures and just sit for a while. after a boat ride seeing the whales. was a great trip, also visited a little eatery on the wharf."], ["Reviewed September 30, 2017", 4.0, "MrGG-Old-Fisherman's-Wharf", "This is a nice shopping and eating location. Nice stroll down and back to browse and shop. Various eating places."], ["Reviewed September 29, 2017", 4.0, "Colorful day out at the Wharf", "We enjoyed a fun filled day at the Wharf. Our day started with a whale watching Cruise which is locating at the end of the pier. We booked ahead as we only one day in town. Afterwards we had lunch at Albalonetti. I recommend Fishing and or sailing as the water is calm. There are so many unique shops such as Carousel Candies and The MB Siver Company. If you want a little history lesson you can book a tour with Tim.\nShow less"], ["Reviewed September 29, 2017", 2.0, "A tired tourist trap", "Besides the sea lions and otters, I was sorely disappointed by the wharf. There are a dozen or so restaurants all selling some version of the same mediocre food. People out front try to \"sell you\" on the specials, tastings, etc. You could tell they were all competing for business and I found it off putting. The shops I found quite tacky with items of low quality. It really felt like an old washed up boardwalk, but not as fun. Paid parking wasn't too expensive so I'm not sure why they even charge. I would only come back to take another trip with Monterey Bay Whale Watch, which leaves from the wharf.\nShow less"], ["Reviewed September 27, 2017", 4.0, "Great to visit when it's less crowded", "I guess it is cool to tell people that there's an \"older\" fisherman's wharf than the one in San Francisco :) Great spot to take photos with fishing boats, blue skies, and deep blue ocean in the background. However, this place could easily get crowded. I have tried several restaurants - they are okay, but not impressive. Paid parking is available nearby.\nShow less"], ["Reviewed September 27, 2017", 4.0, "Same ol same ol", "Looks like a tired version of San Francisco's wharf but it shrunk in the wash!\nCould use a freshen up though.\nPlenty of restaurants and souvenir shops but mostly tired and seemingly struggling Businesses????\nSpruikers touting for business only adds to the air of desperation in my opinion.\nGreat walking cycling path nearby. I am sure this place would be horrendously busy in the peak of summer!!!\nShow less"], ["Reviewed September 26, 2017", 5.0, "This was a nice place for families to walk and just enjoy each other.", "Lots to see, shop at, eat from. Pretty active pier with lots of restaurants and shops. Parking is plentiful and there is enough to do to spend hours here."], ["Reviewed September 25, 2017", 4.0, "Loved it", "I had a great time walking up and down the wharf. Everyone wants you to try the clam chowder to eat in their restaurants. Was able to hang out and watch the sea otters plays around."], ["Reviewed September 23, 2017", 2.0, "Restaurateurs Peddling For Your Business", "The pier is about 1/4 mile long with a handful of casual pier style seafood restaurants and tshirt type gift stores. The restaurateurs stand outside trying anything to lure you into their place which is really annoying. The pier is very uninviting. But on a positive note I loved seeing the seals swimming and hanging out in this area.\nShow less"], ["Reviewed September 22, 2017", 4.0, "Wharf", "Tender docks at end of the Wharf. Seafood restaurants, bars and shops. Good seafood at Scales and Old Fisherman's Grotto restaurants. Observation deck on top of Big Fish Grill."], ["Reviewed September 22, 2017", 3.0, "Typical Tourist Places", "The Wharf is full of restaurants and gift shops. You can get a nice view of Monterey Bay from the upstairs deck at the end of the wharf."], ["Reviewed September 21, 2017", 4.0, "Trip to Monterey", "The warf is a great place to grab a bite to eat or do a little souvenir shopping. There really isn't anything amazing here. Unless you plan to eat here it isn't worth the trip. There are several homeless people that are at the entrance hoping for some spare change. If that is something that makes you uncomfortable I would suggest Cannery Row.\nShow less"], ["Reviewed September 21, 2017", 4.0, "Looking for fresh fish?", "This is a great place to do some shopping for souvenirs or to get a fresh fish meal. Since I didn't have much shopping to do, we got through the wharf pretty fast, although I did have fun watching a few sea lions play. If you are looking for souvenirs, this place is for you and it looked like some good prices too!\nShow less"], ["Reviewed September 19, 2017", 2.0, "Tourist area", "Not sure what all the fuss is about. With various souvenir shops and restaurants lining the street this feels more fairground than wharf. It’s pleasant enough in the marina area but not worth a special detour unless you want to do a boat trip."], ["Reviewed September 18, 2017", 5.0, "Lovely", "Much nicer than the Wharf in San Francisco. Pretty, busy, catch a whale watching trip from here and enjoy the views of the many Whales in the Bay."], ["Reviewed September 17, 2017", 3.0, "Pleasant commercial vista", "Having been here before and being back in Monterey we chose to conclude our day out by taking a stroll along the Wharf. There are several shops and plenty of restaurants competing for your business and some great views out to sea. It's one of those \" you have to do it\" type of places but nothing spectacular\nShow less"], ["Reviewed September 15, 2017", 5.0, "Authentic Fisherman's Wharf", "This is one of the few wharves where you can still see working fishing boats, and fish processing plants. Plus you can do so from the comfort of your car (you can drive slowly all the way to the end of the pier, just watch out for the tourists and occasional fisherman).\nShow less"], ["Reviewed September 14, 2017", 4.0, "Restaurant and shopping", "This place is a great place to get to the beach and layout swim. There is shopping and restaurants available. Plenty of opportunity to watch the seals up close and take plenty of pictures. You do have to pay to park. I would get use to paying to park you have to everywhere you go.\nShow less"], ["Reviewed September 13, 2017", 5.0, "A picturesque marina and a world-class view.", "Take a stroll on the pedestrian way along the marina and all the stresses of the day will melt away. There are lots of shops to visit and places to either dine-in or grab a snack. Be sure to enjoy some of the local-caught seafood ... it doesn't get any fresher.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Nice wharf area", "Sure, it is not as large as the San Fran wharf, but it is nicely done with some great looking seafood restaurants and fun shops to browse in. Also, there are sightseeing boats that leave from this area and when the weather is nice, you can take some great photos of the sea lions if they are out and about.\n\nA little tricky to get into the parking lot, which by the way, they charge for. Parking is at a premium in Monterey and you will have to pay to park in many areas.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Fun to see!", "My family loves to walk around and shop and eat at the various restaurants. The hardest choice is picking which one!"], ["Reviewed September 8, 2017", 4.0, "Monterrey visit", "Goy to take a walk along the Wharf. Lots of shops and resturants. There are the odd people trying to get you in to their resturant but they do it in a nice freindly way with no hassle. Great seafood everywhere and parking 50m away."], ["Reviewed September 7, 2017", 5.0, "Whale watching", "Monterey is a little fishing town with a few bars and restaurants we stayed at the Stephenson hotel which was only a ten minute walk away we had a nice meal while we were there at one of the fish restaurants very good value. we went whale watching on are secound day well worth the trip we seen plenty of whales it was fantastic the captain of are boat took us further out to sea and we seen blue back whales it was amazing well worth the trip.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Always Enjoyable", "Was here for my daughter's Bday and just wandered around in and out of the shops. I have been here many times and always enjoy it. Nice restaurants and touristy shops. Withing walking to downtown Monterey, close to hotels, fine dining and just walk along the water.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Took my parents here on sunday sep 3 they had lots of fun eating delicious food.Once there we decided to go whale watchi", "Had soo much fun the weather was perfect and my parents really enjoyed the ride on the boat.my father was taking pics and his face was lighted like a lil boys face.I was happy they came with me.whale watching in monterey is very fun for all the family\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great whale watching from here and good restaurants.", "When you visit Monterey Fishermans Wharf, you will experience some great restaurants, fun places to shop and pick up souvenirs and go on the best whale watching boat! The Monterey Princess is our favorite with the Monterey Whale Watching expeditions (yellow building toward the end of the Wharf). There is also the Glass Bottom Boat for the younger kids.\nShow less"], ["Reviewed September 5, 2017", 2.0, "Don't go on holiday", "We were in Monterey on Labor Day weekend. It was impossible to find a parking place. I'm not sure I would enjoy this even if we could have found parking. If you have been to one wharf you've probably seen the same."], ["Reviewed September 5, 2017", 5.0, "Beautiful View", "If you go early in the morning, you'll miss alot of traffic and the crowds. The shops are all worth a visit as many souveniers are available at half the cost."], ["Reviewed September 5, 2017", 4.0, "Couples weekend getaway", "We love the views and sea lions barking off in the distance. If you are looking to park here, you must get here early as parking fills up fast and stays full most of the day."], ["Reviewed September 4, 2017", 5.0, "SUMMER OF LOVE", "Lots of places to eat , go fishing, whale watching, shop or sit and watch the street musicians. Parking is a little crazy so if you have a reservation for anything give yourself plenty of time."], ["Reviewed September 3, 2017", 3.0, "Not really worth a visit.", "We visited Old Fisherman's Wharf during our visit to Monterey on our California Coast Road Trip.There is really not very much to see. It is mostly t shirt shops and over priced casual eateries. There were some street performers and musicians near the entrance. Parking is limited. We had to park several blocks away.\nShow less"], ["Reviewed September 3, 2017", 4.0, "Quaint", "Great places to eat. It can be very busy though. I would recommend domenicos and Randy whale watching"], ["Reviewed August 30, 2017", 4.0, "Best Clam Chowder", "We always eat at the Fisherman's Grotto. The food is so awesome. The drinks are unforgettable and the deserts!!!"], ["Reviewed August 29, 2017", 4.0, "Mostly shops and restaurants", "A much smaller version of a wharf the the one in SF. It is still mainly shops and restaurants although you also catch the whale watching boats the end of the wharf. A nice place to be, but very busy and I think the restaurants in town are nicer and better value.\n\nWorth going to.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Nice visit", "Interesting and attractive scenery. Not quite at expansive s San Francisco but worthwhile stop to visit. Lots of boats and a few restaurants. Some better than others. Mostly scenery rather than actual attractions. Fairly easy access."], ["Reviewed August 28, 2017", 5.0, "Best whale watching ever.", "We loved Monterey. Two days were not enough. But the annual Sotheby's auto auction was starting and our room rate tripling!"], ["Reviewed August 27, 2017", 5.0, "Carole", "A must stop. Huge parking lots, but one can walk a bit more & park free on side streets going inland. Excursions & many good dining choices. Can see harbor seals, sea lions, seagulls waiting for all their leftovers & a forest of sailboat masts."], ["Reviewed August 26, 2017", 5.0, "Small, quaint and good eats", "You can walk up the warf and fish if you like or you can go down to the shops and restaurants. Bring a jacket it is always a mix of sun and clouds."], ["Reviewed August 25, 2017", 5.0, "Lovely walk", "Great place for a lazy walk with the family. Loads of small, lovely places to grab a bite(clam chowder rules). Great atmosphere!"], ["Reviewed August 24, 2017", 5.0, "Pretty with a great walkway", "Great area to walk, ride a bike or rollerblade. Scenery is so pretty - and the sounds of the sea life is awesome. We're not from the area so it's super cool to hear the seal sounds. Very romantic."], ["Reviewed August 24, 2017", 3.0, "A rather tacky experience.", "Whilst this should be attractive it is actually just a melee of restaurants and tourist outlets, with no view of the harbour."], ["Reviewed August 23, 2017", 5.0, "One of my favorites in Monterey!", "Love the atmosphere and nice ocean view seating. The food is excellent and love the clam chowder! After dinner they even present ladies with a rose, nice touch! Fun spot on the wharf!"], ["Reviewed August 23, 2017", 5.0, "Quaint, lots of shops & restaurants", "We loved Fisherman's Wharf! A great atmosphere with plenty of gift shops & restaurants. It was lovely at night with all the lights from the harbour. Prices were reasonable as well, we purchased jackets, fully fleece lined at just $19.99! The locals are really friendly & helpful too. We ate in one of the restaurants & had a really good meal for dinner & another one for lunch (which was fairly expensive). Would highly recommend.\nShow less"], ["Reviewed August 22, 2017", 5.0, "We love this old wharf!", "We visit Carmel each year, and make sure we take a day to visit the Wharf. A fun walk. You can take a boat out to view whales, or just watch seals on the wharf. Shops with kitschy items, and some delicious seafood! Or go up the street to Rosines for some great Italian food!\nShow less"], ["Reviewed August 21, 2017", 4.0, "Don't miss Loulou's Griddle in the Middle", "This is a must visit diner. Don't let it's looks deceive you. We had sand dabs, crab cakes, and fish and chips. All of it was amazing!"], ["Reviewed August 20, 2017", 4.0, "great plaace lots of restaurants to choose from", "had a nice time walking around. lots of places to eat. great views of the water, sea life. very nice."], ["Reviewed August 18, 2017", 4.0, "Great Clam Chowder", "Walked the wharf and checked out the many shops. They offer ocean cruises and whale watching tours. We saw a ton of jellyfish off the wharf, which is acitally paved over with blacktop. If your going to Monterey, check out the wharf. If you like seafood, specifically clam chowder try the many samples along the walk and grab yourself a bread bowl full of creamy clammy goodness.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Fish Lovers Paradise!", "If you love fish this is the place to visit! You also board the boats for whale watching here. Lots of quaint eateries and little shops here. Lots of fish selection and quite reasonable. Worth a visit!"], ["Reviewed August 15, 2017", 2.0, "Had a great meal, but the wharf was disappointing", "Not what I expected. It's not a boardwalk, but a paved (blacktop) walkway that's really commercial and not charming at all."], ["Reviewed August 15, 2017", 4.0, "Surroundings are great!", "Yesterday my husband and I started the day with going to the Fisherman's Wharf and then walked over to Cannery Row. I think that I liked the walk better than the actual Wharf itself but I did find that the restrooms seemed to all be in good condition and working order and that is a plus! Some of the food smells were not combining well with one another but being able to go up and look from the overview at all of the surroundings was really great! It actually encouraged us to go ahead and go for a walk and we ended up at Cannery Row where we shopped for awhile and then took the Trolley (free at this time of year) before heading back to where we had parked our car. I would recommend this visit if one has never been there because one never knows what kind of wildlife one might see (we actually were able to see seals, otters, pelicans and other sea birds) and the sculptured art (relief and statues) are great in both areas.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Interesting Place To Tour", "This is an interesting place to visit. There are a number of shops, restaurants and places to arrange and take cruises, and fishing trips."], ["Reviewed August 14, 2017", 5.0, "Historical and Lots to see and shop", "Nice place to walk around and shop for gifts and fun wear. Food not so great here. Go to Cannery Row for that. Easy bike access. Safe for families."], ["Reviewed August 14, 2017", 4.0, "Worth a visit (especially if you loved Little Big Lies)", "So my wife is a HUGE fan of Little Big Lies and loved visiting the coffee shop that they featured in the show. Other than that, it is a good place to come spend a few hours and grab some seafood."], ["Reviewed August 13, 2017", 3.0, "Very touristy", "Unsurprisingly, the main function of FW is to extract money from tourists, which it does very effectively via a plethora of over-priced restaurants and souvenir shops. It's loud and brash but is also the departure point for most whale-watching tours so you'll probably have to brace it at some point.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Clearly a tourist attraction, but a good experience!", "My favorite thing about the wharf, aside from the historic aspect, are the abundance of restaurants and their talent for creating a carnival atmosphere about their food. The displays, the variety of clam chowders that they give samples of are all signs of a healthy \"touristy\" atmosphere. Sometimes they even have \"barkers\" outside soliciting diners, which I think is wonderful. Just go there with an open and positive outlook, and take in all that is there, and enjoy. The fresh air, the seals, otters and boat traffic, the beautiful water and activities all make for a unique and wonderful atmosphere. If you are a jaded, grouchy type, then you likely won't care for it, but I love it every time I go there. And I love taking visitors. The souvenir shops are packed in there, and they are crowded, btu its part of the venue. The candy shops are worth a stop also.\nShow less"], ["Reviewed August 12, 2017", 3.0, "Touristy But Fun", "Definitely a tourist stop, but a fun way to spend some time if the weather is good. Lots of places to eat and shop for tee-shirts, souvenirs and trinkets. There are about six candy shops in this short wharf area, and you can catch some boat trips there, as well. Keep in mind you have to walk down several stairs to get to the boat docks, so if you have any kind of handicap, this isn't the place to catch a boat. We had a fun day here watching the people and the sea life. We were amused by a little old guy on a bicycle who has appointed himself the litter bug retriever. He rides around on a bicycle pulling a small trailer behind with rubber iguanas and signs proclaiming what he does there on the Wharf. It looked like he really enjoyed the \"job!\"\nShow less"], ["Reviewed August 12, 2017", 4.0, "Small wharf to visit", "Smaller version of the San Francisco version or a good intro to the San Francisco version. You have some restaurants, some gift shops, three or four whale watching tours. And views of boats the bay and so on. The central plaza has historical buildings to visit andd a downtown shopping district is within walking distance.\nShow less"], ["Reviewed August 12, 2017", 1.0, "Not good", "A bunch of tourist trap restaurants and overpriced souvenir shops - not a good place for the discerning traveler. Best avoided. Parking is both difficult and expensive.. You can see seals and otters."], ["Reviewed August 11, 2017", 4.0, "a taste of san francisco wharf", "old fishermans wharf is way smaller than the one in san Francisco, but still fun to enjoy the many shops and eateries. it lies just a little wal;k from the old historical park.now its important of you to walk from here to the direction of cannery row. theirs plenty of coastal rock where you can see sunbathing seals.when you get to cannery row just take the free shuttle to most anywhere of visitors importance in Monterey. enjoy\nShow less"], ["Reviewed August 10, 2017", 4.0, "See otters and seals!", "You can get close pictures of otters and seals swimming by! The pier has a good variety of shops. There were opportunities to sample many types of chowder which were offered free. Toilets are clean."], ["Reviewed August 9, 2017", 4.0, "Good early evening walk as the fishing boats came in", "On our trip down the coast from San Francisco to Los Angeles we stopped for a night in Monterey. We walked down to the wharf, had dinner and then wandered around the other areas of the wharf and enjoyed the experience very much."], ["Reviewed August 8, 2017", 5.0, "very cool", "really neat pier with tons of cool stuff to buy and eat... great views.. prices are touristy trap though so eat elsewhere if on a budget.. cafes are reasonable though if you just want a coffee oe something.. lots of free stuff to do all over Monterey\nShow less"], ["Reviewed August 8, 2017", 4.0, "Pleasant for a stroll on the Pier", "We had a brief stop in Monterey and had a walk down Fisherman's Wharf. Lots of places to eat and novelty shops - quaint and worth a visit."], ["Reviewed August 7, 2017", 2.0, "Tacky and expensive", "A tourist trap that offers little apart from overpriced food and souvenirs. I would avoid, along with most of Monterey, and spend time in Pacific Grove and Carmel instead."], ["Reviewed August 7, 2017", 3.0, "Very Commercial", "This is not a Fishermans Wharf but rather a tourist trap - a wharf of tourist stores and tourist type foods. Limit your time if you visit - there are better sights in Monterey."], ["Reviewed August 7, 2017", 4.0, "Good pier to visit", "Arrived at the entrance to an Army veteran playing his guitar and singing. Music was ok, singing debatable.\nThere are many shops to get any gifts for friends, at reasonable prices for a tourist spot. Restaurants are also lining the pier. All but one restaurant that we past had fresh samples of clam chowder. Talk about some good chowder!! We had a good time visiting this pier. And our stomachs were full.\nShow less"], ["Reviewed August 6, 2017", 2.0, "Touristy and crowded", "Restaurants lined up, advertising their dishes to get people in. Not a good atmosphere. The view is ok, but it is not spectacular."], ["Reviewed August 6, 2017", 3.0, "Tick", "Getting a bit run doen but you should visit, we did for dinner. Most of the restuarants are trying to get your trade wuth samples of chowered out the front. Pkenty to choose from and the usual tourist shops."], ["Reviewed August 4, 2017", 4.0, "Great place to go for a pleasant family walk!", "We stopped by Monterey only for a day on our way to SF. We stayed at the Pelican Inn which was only 10 min drive away from the Wharf so we decided to go and see if there is any decent place to eat. The Wharf itself is not big however it offers plenty when it comes to food. We had a hard choice (being tourists) choosing a place to eat but in the end, we settled for Domenico's On the Wharf. The place is beautiful however the food is so so! The view was impressive. I would definitely recommend to anyone visiting Monterey to go to the Wharf! There is plenty of parking and it is cheap.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Quaint.", "Old school quaint pier. Lots of options for food. Seafood, Italian, chips etc. Parking nearby costs approx $7. It is definitely worth a visit. Great views with entertaining seals & seagulls."], ["Reviewed August 4, 2017", 4.0, "Lots of food!", "My husband and I came her to get on one of there activities they have here. We did whale watching. Some of the food was good!"], ["Reviewed August 4, 2017", 5.0, "Worth a wander round", "We went to the wharf to have Sunday Brunch and had to kill some time waiting for a table, so had a wander round. Much quieter than other parts of Monterey."], ["Reviewed August 3, 2017", 4.0, "Very Pretty,", "While it is pretty, way too much junk. A lot of stores selling stuff. There is one good restaruant, and a couple of really average to below."], ["Reviewed August 3, 2017", 2.0, "Touristic", "This is a place you could skip. Plenty of tourists, but not really anything to see or to do. Did not try any restaurants, but looks extremely touristic."], ["Reviewed August 3, 2017", 4.0, "Quite a surprise", "We stopped off here on the way to our hotel, shops are great value and restaraunts offer great food. Everything is reasonably priced for a tourist area."], ["Reviewed August 1, 2017", 3.0, "Enjoyable for an hour or 2", "Lots of sea food options ranging from quick service to $100 meals. Dom at Cafe Gina was extremely nice especially for a restaurant owner. He even came to our table to chat with us when we sat down. There are some shops with \"Monterey Bay\" mercy and typical tourist items. Best part of the wharf is towards the end and it is called Discovery Whale Watch. Best whale watching I have seen compared to my family's 10years of regular whale watching expeditions.\nShow less"], ["Reviewed August 1, 2017", 1.0, "Very touristy", "Tourist trap with bad, overpriced restaurants, that are all mostly owned by the same people. It is dirty and not worth the trip."], ["Reviewed August 1, 2017", 3.0, "Nice walk through area", "This location is more picturesque compared to Cannery Row's \"new Fishermans wharf\". You can witness the vessels owned by private charters and private owners berthed. Most of these are pleasure vessels but they do look quite pretty at the pier.\nWe didn't eat here because LouLou's was too crowded but had a walk around whilst on the Coastal Trail.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Nice wander around!", "We had a nice leisurely walk around the wharf. Ate/drank a lovely cup of clam chowder and daughter had a shrimp and crab cocktail. Lots of places to eat at and numerous souvenir stores. Watched the seals basing on the rocks around there."], ["Reviewed July 31, 2017", 5.0, "A nice place to spend time", "A must see in terms of the beautiful view . Fun to walk around. The weather was warm and pleasant for December. Sunny and bright."], ["Reviewed July 28, 2017", 4.0, "Sea Otter Experience", "After a nice early evening meal, a stroll along the Wharf watching fishermen and various ships in the setting sun was made unforgettable by the many Californian sea otters lying on their backs in the sea cracking crabs and mussels on the stones held in their bellies. The sight and sound was wonderful. We could have watched them for hours.\nShow less"], ["Reviewed July 28, 2017", 3.0, "Restaurants and shops.", "The Wharf is fairly small and all restaurants and shops. We heard some of the restaurants were good but we didn't eat there. The shops were not particularly interesting."], ["Reviewed July 27, 2017", 4.0, "Fun stroll through \"Restaurant Row\"", "I wasn't quite sure if I should give it an \"average\" rating or a \"very good.\" I decided to go with the higher rating as we always visit Old Fisherman's Wharf when in Monterey - although it never really changes, it's a \"must-experience\" (at least for tourists). The restaurants are side-by-side and you have hostesses try to offer you samples all along the way. In the end, you probably settle for one of the restaurants even though you probably would have found better food for the buck in town. Nevertheless, it's nice and the restaurant at the very end of the wharf has a roof terrace that is open to the public, which is probably the best of the visit there. You can overlook the bay and hear the seals, sea lions, and watch the otters play - another reason to give this place a 4-rating :-)\nShow less"], ["Reviewed July 27, 2017", 4.0, "Food, T-shirts, Harbor Atmosphere", "We enjoyed our walk around the Wharf area. There are lots of restaurants, hucksters, T-shirt vendors, fish markets, and a nautical atmosphere. We weren't looking to buy anything, so we just enjoyed the walk. The good weather made for a nice afternoon at the Wharf and Cannery Row later in the day.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Qwerky little place", "Some lovely little shops and restaurants, all giving out samples of chowder, good views over bay, best place to book whale trips and to while away a few hours"], ["Reviewed July 26, 2017", 5.0, "Small, touristy, but beautiful, loved it! just charming", "Its a small Wharf, but charming, yes its now geared for tourists, lots of restaurants, and gift shops, but we found the cafe where the ladies from the tv drama Big Little Lies had coffee, so we had coffee outside on the veranda!!! tick ! Saw seals and pups and star fish and sea otters, I was in heaven.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Fun, tourist attraction", "Lots of candy, seafood, souvenirs and whale watching tours here! Take the tour, you'll love it. Highlight of my trip."], ["Reviewed July 22, 2017", 4.0, "I know it’s touristy but it’s still fun", "Yes, you’ll have hawker’s trying to get you to go into their restaurant. There will be souvenir shops all selling basically the same thing but it’s all kind of fun and I like it. There must be a reason why it is always crowded huh?"], ["Reviewed July 21, 2017", 4.0, "The feel good place", "We catch the whale watching cruises from this wharf and love visiting the little shops after our boat ride. Best clam chowder bread bowls anywhere! The have samples at all the restaurant so pick your favorite and go have a bowl. Tons of marine life to see frolicing in the bay. Many boats in and out...highly recommend stopping in for a glimpse of Wharf life. Note you do have to pay to park but you can catch a complementary trolley from the Wharf to Cannery Row or you can make the walk ( lovely and worth it mostly after that chowder bowl).\nShow less"], ["Reviewed July 21, 2017", 3.0, "Restaurants and souvenir shops", "This wharf in Monterey is where you will find fish/seafood restaurants and souvenir shops and whale watching tours. We ate at a good seafood restaurant here."], ["Reviewed July 20, 2017", 3.0, "Touristy but worth a short visit", "We walked around the wharf area for a short walk with the kids. They mainly enjoyed looking for sea otters, sea lions, and other wildlife in the bay. The better restaurants tend to do less hustling out front. You'll know what I mean."], ["Reviewed July 20, 2017", 3.0, "Quick stop", "Nice to walk along the pier and see some seals but a bit of a tourist trap.. the place to book a whale tour"], ["Reviewed July 20, 2017", 5.0, ". Go there, don't miss this one!", "There are beautiful little shops, a museum and whale watching companies here. It is terrific early morning or evening"], ["Reviewed July 20, 2017", 5.0, "Very pretty", "We actually liked the Monterey fisherman's wharf better than the one in San Francisco. We had a lovely meal on the pier watching a seal playing in the water. Bliss! Prices are reasonable and the food delicious. We also bought some bargain t-shirt on the pier. A lovely day including the whale watching\nShow less"], ["Reviewed July 19, 2017", 4.0, "Great, if you're looking for food!", "We weren't sure what to expect and wandered over to the wharf from Cannery Row. It was all restaurants (mostly seafood), so if you're hungry, it's a great find! If you're looking for shops or things to do, probably not."], ["Reviewed July 19, 2017", 4.0, "Second visit", "This was our second visit to the Monterey wharf we find it pleasant a little hokey but a must see if you're traveling through Monterey\nIt gives you the opportunity to have some great seafood buy some souvenirs and get to see some sea lions playing and if you're lucky if you otters.\nThere's also a walking path that you can take that will bring you out to Cannery Row so you only have to park once but if you're not used to walking a mile or more you may want to think about taking the car\nShow less"], ["Reviewed July 18, 2017", 3.0, "Good to people watch", "Bit of a tourist trap but worth a stroll along the pier, lots of eateries, nice atmosphere, but very commercial"], ["Reviewed July 17, 2017", 4.0, "$ star for Seafood", "If you're a seafood lover, can't go wrong here. We like a chowder with primary ingredient that is not just heavy cream, and grotto has it! There are tons of fresh seafood restaurant, pick on and you won't be wrong. Each restaurant even give you a sample of their special soup. There are ice creams and chocolate/carmel dipped banana/apple. Not forgetting, souvenirs! This is where you go to buy tickets for whale watching too. Fun walk!\nShow less"], ["Reviewed July 17, 2017", 3.0, "Mostly shopping and restaurants", "We took a walk to the Old Fisherman's Wharf during our recent visit to the Monterey area but were not impressed with what we saw. It is geared towards the tourists with plenty of souvenir type stores and restaurants."], ["Reviewed July 17, 2017", 5.0, "Neat place to walk & people watch", "Had a nice stroll down the wharf on a recent visit. Lots of good food and treats. Homeless distraction at entry."], ["Reviewed July 16, 2017", 5.0, "Quaint", "Nice, clean and charming restaurants. Cafe Fina was farm grown garden products and almonds. Great bloddy Mary."], ["Reviewed July 16, 2017", 2.0, "Not worth the trip if you're not already going for boat tour etc.", "Totally dead during our visit. Nearly more beggars than tourists. Shops not as good as cannery row. Husband liked clam chowder samples though."], ["Reviewed July 16, 2017", 4.0, "Great place for tourists", "We were on the lookout for a store on the wharf that might have a pirate flag and a restaurant serving good seafood. Found the flag but we felt the prices were a bit too high for the seafood. It seemed like, on a quick preview of offerings, that most of the places serve similar food. We had time on our hands so we chose to go elsewhere.\nThe wharf as a place to visit is interesting and very busy. If you like busy and a lot of people this is the place for you.\nShow less"], ["Reviewed July 16, 2017", 4.0, "Great place te eat and people watch.", "We really liked it here, lots of decent restaurants to eat, we came hear during the day and night and really enjoyed the ambiance. Lots going on."], ["Reviewed July 15, 2017", 3.0, "A place to eat", "Old Fisherman's Wharf consists of several eateries, 2 overpriced candy stores, and a couple of souvenir shops. It's fun to stroll the pier, but unless one is sitting at a restaurant window, one does not see the sea otters, seals, loons, and people rowing out to their boats. Bring your quarters because parking is $1.50/hr. Our meal for 2 people without alcohol cost $75 with tip.\nShow less"], ["Reviewed July 15, 2017", 4.0, "Tourist Attraction", "Nice area for seeing boats, shopping, some wildlife viewing and some good restaurants. After seeing it visit all the other areas like Cannery Row. I don't need to visit the Wharf more than once."]]}}