{"Old Sacramento": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Old Sacramento", "url": "/Attraction_Review-g32999-d102771-Reviews-Old_Sacramento-Sacramento_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/11/7e/18/historic-buildings.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "2600"}, "address": {"@type": "PostalAddress", "streetAddress": "1002 2nd St", "addressLocality": "Sacramento", "addressRegion": "California", "postalCode": "95814-3202", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "A taste of the Gold Rush times", "I’ve visited Old Sacramento several times - and might have reviewed it before - but each visit is always a delight. It’s done so well, and there’s just enough to give the feel of the towns of the Wild WEst during the gold rush without being overwhelming. Old-time themed stores can be found along the streets and the occasional horse-drawn vehicle adds colour. Ok, some might say it’s a bit touristy, but it’s all so well done! The buildings are genuine, the costumes, when worn, are authentic and the goods on sale aren’t all the usual tourist tat. Old Sacramento works whatever the season. There’s plenty of parking under the freeway, too.\nBonus - the river front is nearby, and a short walk away is the Railway museum which has to be one of the best in the world.\nShow less"], ["Reviewed 3 days ago", 2.0, "Dreary", "This place has very little life. There were lots of empty store fronts. It looks like it's seen better days. Not sure who this appeals to. You walk the place in a half hour. The restaurants are not very good. It was a bit dirty. It is worth a quick drive through.\nShow less"], ["Reviewed 5 days ago", 4.0, "Old Architecture", "Come and see a charming group of old buildings from around the Gold Rush, nicely preserved. Very touristy, but charming. Lots of places to eat and drink."], ["Reviewed 6 days ago", 5.0, "The Firehouse Resturant", "Very nice place to eat the dinner was superb will go again and close to the Holiday Inn downtown. The atmosphere was great in an old fire house"], ["Reviewed 1 week ago", 4.0, "Sacramento", "We walked around old town Sacramento, it was a fun place to visit. It had a lot of fun shops and good eating places!"], ["Reviewed 1 week ago", 4.0, "Delightful Walk", "Lovely area, beautiful weather. We came to the area primarily for the Train Museum. We enjoyed several “gift shops” which primarily hawked similar souvenirs. There was one home/kitchen store that provided entertainment. There were a couple of art/jewelry shops with limited displays. There are a few restaurants, but the menus were just too similar. We opted for a restaurant on the river, a seafood restaurant with a seafood salad to write home about, but service was unremarkable and almost non-existent. Old Town is worth about 2 hours.\nShow less"], ["Reviewed 1 week ago", 4.0, "Old Sactown!", "Nice area to walk around. A couple of good museums, souvenir shops, bars and restaurants! Loved to strolled parallel to the Sacramento river with great views of the tower bridge. The only sad thing was a the alarming number of homeless people in almost every corner, dumpster diving for food and asking for money. It blemished the area, but it give us a reminder of our society flaws.\nShow less"], ["Reviewed 1 week ago", 2.0, "Disappointing", "The old buildings are nice but they are all filled with tourist trap sorts of shops, bars and restaurants. But worst of all is a major California highway, 99, is literally right on one side with traffic whizzing by, the noise is horrible."], ["Reviewed 1 week ago", 5.0, "Love it here!", "We always love coming to old town sac to walk around and browse the stores. Always good for a day trip. Definitely recommend the tours."], ["Reviewed 2 weeks ago", 5.0, "Fun stop!", "Sadly there are quite a few empty buildings here but the view is lovely and the stores that are still here are great. The kids enjoyed walking around and there is a big area where cars are not permitted. It was a safe fun place for the kids to run around.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun place to visit", "Old Sacramento - lot of cool shops like Evangline, sweet candy stores and other different shops. It's by river - good to watch some boat go by sometimes. Holidays are fun too especially Christmas, Halloween and Mardi Gras! A must visit in Sacramento."], ["Reviewed 2 weeks ago", 5.0, "Great place to walk around", "It's safe and not too busy. Lots of fun shops to walk around. Lots of yummy food - great selection of cheap (Subway) to fine dining. It's on the river, making it very scenic."], ["Reviewed 3 weeks ago", 5.0, "gorgeous day", "Weather was gorgeous for February so we spent the day walking around and visiting all of the small shops. Ice cream, sock shop, fun stores."], ["Reviewed 3 weeks ago", 5.0, "History Comes to Life", "Old Town Sacramento has undergone a lot of changes in the last few years, but one thing remains constant and that is keeping the history of the area preserved. There is a LOT to see, and you really have to plan a whole day to take it all in. HERE'S A HEADS UP!! Just found out this weekend that the Gold Rush Days is being moved to Memorial Day Weekend from Labor Day Weekend. And that's not too far away - so you heard it here first!\nDefinitely take in the California State Railroad Museum and the California History Museum, and ride the train and have lunch at Joe's Crab Shack. Or one of the many other wonderful places to have lunch. I'm just partial to Joe's.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Not much to do", "Old Sacramento is basically a collection of souvenir and candy shops in a faux Wild West town setting. It was pretty boring."], ["Reviewed January 23, 2018", 5.0, "Great place to visit with kids", "Extremely touristy but fun if your out to eat, shop, and see some history. Pretty fun for kids and if you look hard you can find some cool history stuff. See the train museum you won’t go wrong."], ["Reviewed January 22, 2018", 3.0, "Walking tour of downtown Sacramento", "Interesting collection of historic buildings, shops and restaurants. It is within easy walking distance of the train station, capitol mall, downtown shopping and museums."], ["Reviewed January 21, 2018", 4.0, "Leisurely visit to Old Sac", "My wife and I visit Old Sacramento approximately every other month nth or so. We enjoy our leisurely walks through through the old comity and visiting the unique shops. The shops are unique and usually not available in any other part of Sacramento. A fun excursion.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Truly an \"old\" Sacramento area", "We went here because I was craving for a particular candy and the maps pointed us here. That time they were lighting the big Christmas Tree. Its a small place, it has few merchandise stores, bars, few candy stores, resto-bar. But other than that, this place has nothing much to offer. I wish they put more lighting in the area.\nShow less"], ["Reviewed January 21, 2018", 1.0, "Not like it use to be.", "Old sac use to have a lot going on. Now a lot of the businesses and restaurants have shut down. There’s a few bars and touristy places still open. But definitely not like it was before."], ["Reviewed January 21, 2018", 5.0, "amazing place", "hese 28 acres on the Sacramento’s historic waterfront were the site of both tragedy — fire and flood — and triumph — the raising of the streets, the founding of the Transcontinental Railroad, the terminus of the Pony Express, and the home of California’s first thriving business district, fueled by gold, agriculture and the river.\n\nDue to past and current efforts by the State of California, private and public museums, individuals, business, the City and County of Sacramento, the Historic Old Sacramento Foundations, scores of volunteers, and many others, Old Sacramento lives on as thriving shopping and entertainment district as well as a global tourist destination.\nShow less"], ["Reviewed January 19, 2018", 3.0, "Touristy feel, but old town feel too", "Typical tourist fare of shops (candy, trinkets, toys, souvenirs - with very few unique stores thrown in. Just walk through but resist the junk."], ["Reviewed January 17, 2018", 5.0, "Extensive walk back in time", "My family (4 kids ages 5-14) LOVED this area of Sacramento! We spent about 3 hours one day and the kids wanted to go back for more, so we came back for another 2 the following day. We were there mid week, mid Jan, but had nice weather and NO crowds. Kids loved the toy and novelty shops. Evangeline's costume mansion was fun - and you can buy SHOES for your period costumes, which are hard to find. They also had great masks at decent prices. My 8 yr. old loved the $.25 sarsaparilla from one of the saloons (the one with a carved miner out front). We were told to check out Fanny Ann's, and it was interesting, but too many suggestive pictures of women inside to want to haul the whole family into another saloon for a look-see. (Didn't notice the pics in the first saloon, but my hubby said there was some nudity in the art - I didn't see it so it might have been period appropriate...?) We waked on and around the river boat, the Delta King. Had free samples at Candy Heaven. Ate lunch at Steamers - meal for 6 ran $62. Took a 10 min carriage ride around for $15. Generally had a ball. We are from Utah and the area compares to Park City's Old Main Street in appearance, but the shops, pleasantly, are not nearly as high-end, and this was many more streets. We did stop by the Sacramento museum. Their underground tour was closed (open Apr - Oct I think they said). Had only 1 hr before it closed and it didn't seem worth the price for just 1 hour so we skipped. I don't think I would try to do the train museum AND the Sacramento museum in 1 day with kids.\nShow less"], ["Reviewed January 16, 2018", 1.0, "Tourist Trap", "Sadly the Old Town is a collection of taffy shops and tourist tee shirt stores with little else. Everyone walks along the old boarded sidewalks at snails pace as if they’re seeing the Statue of David. I liked the cobblestone street beside the river but the jackhammering and construction killed the atmosphere.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Old Town Sac", "Old town Sac is on the Sacramento River with great walking. The train museum is not free, but has reasonable ticket charge; has good exhibit of old locomotives and train cars and information on the railroad system building from the East Cost to the West. Great shops to explore; Candy, clothes and many different choices for dining. Good family day and good options for night life entertainment or adults.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Disneyland-mento!", "Tons of botique shopping, amazing candy stores, and no shortage of ways to leak money. We went down to attend the Christmas light show which was amazing! Vastly exceeded our expectations. The only hassle was parking which was in short supply. Be wary of the parking tower on the way in. They charged me a flat day rate as soon as I drove in (instead of the hourly rate which would have been way better.)\nAlso made a second trip back by bicycle (love the Sacremento bike share program) and it was fun to toddle through the cobblestone streets.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Old West -Gold Rush History Town", "An excellent view of an old western town. Wood walkways, old western houses, good restaurants, nice experience for all the family and an excellent opportunity to teach your youngster about the Old West way of living ."], ["Reviewed January 6, 2018", 4.0, "Quaint", "Went to visit early in morning, there is a large inexpensive parking garage close by. We walked around the old town area with ease at it was very quiet, had a nice cup of coffee in the central cafe. There are some interesting shops and a number of souvenir outlets. Was worth a visit but not that special.\nShow less"], ["Reviewed January 5, 2018", 3.0, "Needs an upgrade", "The idea of this place is great. There are many nice restaurants and gift shops here. Families will have a very good time when they visit. The only bad part is the number of homeless people here. Last night while visiting I went in the men’s restroom and there was a homeless man sitting on the sink in a drunken stupor. This place really needs more security and an upgrade to make you feel safe. While I love the old look and feel to the place, I was a little worried for my wife and my safety. This place is nice but it needs an upgrade.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Cute place to visit", "Had some time to kill before the red eye and someone said I should go to Old Sacramento. I drove into the area and parked my car. I immediately saw two security guards and asked if I was at the right spot. These two guys were so helpful! What a fantastic way to start. I walked up and down the wooden plank walkways and in and out of some of the shops, up since I got there after 6PM, many were closed. I chose not to eat there because either the food was like pub-food or expensive places. I was looking for something less costly and more simple. I will bring my wife here when I come again.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Free NYE fireworks and christmas activities", "parking off side streets not bad at all. we arrived at 8pm and found street parking right away. just had to walk half a mile to bridge. fireworks show was 15-20 minutes and it was easy to get a good spot near bridge. we close to where they fired off fireworks so we can experience loudness and smell the smoke! it was a 9pm show. old sacramento was nicely decorated in christmas lights. police and security were in force so we felt real safe. We've done the same schedule for July 4th fireworks too.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Fabulous Christmas Show and Christmas Decorations... FREE FOR THE FAMILY!WOOHOO WE LOVED THE LIGHT SHOW", "This Christmas my family, young and old (I was the oldest, oh my. Hahaha) ages 9 years up to 60ish) went to Old Sacramento Light Show. The lights displayed was breathtaking. The tallest tree would display themed light shows. Santa, Mrs. Santa, reindeer, Santa's sled, elfs, Grinch were live and on building roof tops. Out of nowhere, it started snowing. Snow flakes (man made) falling onto spectators. What a thrill. The shops in Old Sacramento and Macys were open and warmly greeted shoppers.\nI think this has become an annual event for me, my adult children and my grandchildren. Is it Christmas yet? Hahaha\nShow less"], ["Reviewed January 2, 2018", 5.0, "Festive atmosphere", "This is a great place to hang out with friends and family. Has a little bit of everything, from gift shops, coffee shops, restaurants, tatoo parlors, and bars. Don't forget to take a stroll through the old school house, and get your free taffy sample at Candy Heaven across the street. During Christmas you can take a ride on the Polar Express train and see the Light Festival. There's metered parking and parking structures on each end.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Nice step back in time for a couple of hours", "Most people have already hit the major details here. Upon entering 2nd street, you see a parking structure, I recommend parking there. $10 all day vs. trying to hunt for limited street parking. There is a Railroad Museum that if you choose to visit is a couple of hours, else maybe 2 hours walking around the Old town and riverside area. It's about 3 blocks long by 2 blocks wide. Alot of restaurants for casual eating and old building and souvenir shops you can visit.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Jump in your way back machine and enter 1849", "Jump in your wayback machine and enter 1849. Saloons, cafes, restaurants and fascinating shops. The greatest collection of trains and railway history all on the Bank ofthe Sacramento River. Everything possible is done to continue the illusion includingworkers in historic garb. Fun place to hang after dealing with politicians and lobbyists.\nShow less"], ["Reviewed December 25, 2017", 4.0, "You step back in time here", "Coming down into Old Town is like stepping back in time. Wooden sidewalks, horse carriages, Old trains and Ferris wheel turning boats even some folks dressing up as if it was a western period. Great food, Candy stores and sites at the Railroad museum is a must. Many items from across the state are here for the viewing. Everyone can walk on an old train or take a live one that goes along the river for a 2-3 hour ride. Reservations a must. The Sacramento River is right here and seals can be seen once in awhile from coming up the Delta from the San Francisco Bay. Turtles can be seen if you look. Sacramento River cats are right across the river. Sacramento Kings easy walking to the new Golden One center. Lots of site seeing and shopping spots for all.\nShow less"], ["Reviewed December 23, 2017", 4.0, "Like a western movie set", "There’s a bit of touristy charm in old Sacramento, which is a couple of city blocks along the river with souvenir shops and restaurants"], ["Reviewed December 22, 2017", 4.0, "Nice place to visit", "The good thing about this place is that it is very well preserved as old places should be. It is not very big so it is easy to walk around. A nearby parking charges 1.5 dollars per hour and therefore it is reasonable. There are bars, a comedy club and shops. A bit pricey, but hey! that's what all touristy places are.\nShow less"], ["Reviewed December 22, 2017", 2.0, "Interesting", "Went here in an afternoon to explore. Touristy area. Lots of shops with souvenirs, t-shirts, postcards etc. many places to eat. There was a train station for some kind of scenic train ride. The railroad museum is in town also."], ["Reviewed December 22, 2017", 3.0, "Not Very Accessible", "I say the only if any in Old Town Sacra get a FIVE STAR is Visitor Center! Many restaurants, probably many shops, not Handicap Accessible! One example Annabelle Pizza or Amabelle Pizza! They always passing flyers for it! If he she in wheel chair other medical device, he she not getting down there! Then recently found this Annabelle Pizza or this Amabelle Pizza in danger of being closing down when lease expires January 2018 or February 2018! Even people at Sacra Visitor Center not recommend, now to me that bad if a person at Sacra Visitor Center not recommends!\n\nThen there LUIS JR! Such rudeness, I went and put the twenty dollar back to the A T M! That is really bad! Then again many Spanish restaurants because I looking like child, they been rude to me of me! Rio City Café, forget! What place is way more expensive than hotel restaurant! Really, Pediatric sandwich $9.00 or $10.00 before the tax? Forget tip at that cost! To me, any more expensive than hotel restaurant, I not my own going there! No Chinese/Japanese restaurants! When do volunteer summers on Saturdays I know most likely I not eating lunch in Old Town Sacra! Not, as say, many not have the ramps!\nShow less"], ["Reviewed December 21, 2017", 5.0, "Thanksgiving and lighting of tree", "They had a the tree decorated and a jazz band that played in the square...so enjoyable for family and friends"], ["Reviewed December 21, 2017", 5.0, "Old Sacramento", "I visited Old Sacramento twice. The first visit was with an organization that I belonged to and the second visit was with my daughter. Old Sacramento brought a flavour or reliving the past but celebrating the current. Old Sac have a variety of stores."], ["Reviewed December 17, 2017", 5.0, "A fun walk back in time with excellent shopping", "Old Sacramento is always so much fun. Horse buggy rides, fun creative shops, excellent food and bike rentals; we had a lot of fun! Good food, an arcade, it really was a good day."], ["Reviewed December 15, 2017", 5.0, "Daughter's first time to Old Sac", "It was fun to see her light up at the blend of old and modern. She loved the shops.plan on going again when it is a bit more favorable weather."], ["Reviewed December 12, 2017", 3.0, "Cool Old Town", "I think it's pretty neat how Sacramento has preserved it's old town's history. There are guided tours and LOTS of candy shops, along with a number of restaurants.\n\nUnless you get a tour of Old Town you're really only shopping at the touristy shops, which can be found anywhere.\n\nI suggest taking the time to learn a bit about the area while you're there!\nShow less"], ["Reviewed December 10, 2017", 4.0, "Cool gem", "We were in town and walk through old sac plenty of things to see and do. Review restaurants cause some were not good. Shops were good ."], ["Reviewed December 10, 2017", 4.0, "Watch your step around Old Town", "Keep an, and a hand on your kids and elderly adults because this area is famous for uneven surfaces. People stumble and fall due to broken concrete, poorly maintained asphalt, cobblestones and exuberant tourists with unsupervised children. I wonder if any repairs are planned to repair the streets...\nShow less"], ["Reviewed December 10, 2017", 5.0, "Lovely place", "We came to the area for dinner. The atmosphere is electric. It felt very safe for us 5 women to be wandering around."], ["Reviewed December 7, 2017", 4.0, "Full of life and light at night at this time of year", "Visited a few days after Thanksgiving. Christmas decorations were already up. So, there was a sense of festivity with a live-show from the balcony of one of the buildings.\n\nMost if not all of the buildings here have been converted to restaurants or food outlets and shops selling souvenirs or specialty items like olive oil (The Olive Mix - highly recommended!).\n\nMade for a pleasant walk-about. We were too late for the train musuem there which had already closed for the day.\nShow less"], ["Reviewed December 6, 2017", 5.0, "History is great.", "Awesome place to spend time. Walking around brings you feeling of 100 plus years back. Old buildings, wooden siding walks, antique shops and more. Love the place."], ["Reviewed December 5, 2017", 5.0, "Great place", "I loved Old Sac, been there twice now. It’s a cool place. Good restaurants and lots of little shops. The museum was cool, a little over priced but still cool. I will visit ever time I am in Sacramento"], ["Reviewed December 1, 2017", 4.0, "Fun for the whole family.", "My family and I have enjoyed visiting Old Sacramento several times over the years. We never get tired of walking up and down the streets soaking up the atmosphere and spending our dollars. A few of our favorite places to spend our money are Candy Heaven (an old time candy emporium) and Evangeline's where you can find all sorts of quirky gifts. We went this year for the Christmas tree lighting ceremony and it was a great way to get us into the Holiday spirit.\nShow less"], ["Reviewed December 1, 2017", 3.0, "Good weekend outing, but busy", "Fun for shopping, eating and moderate entertainment. If you don't mind walking for a distance on uneven surfaces, you will enjoy the stroll around old Town. There's a lot of history and plenty of novelty and snack stores. Great time to go is fall and spring.\nShow less"], ["Reviewed November 28, 2017", 4.0, "Quiet after 4:00", "Old Sac is a charming old neighborhood with touristy restaurants, a riverboat hotel and restaurant, olive oil and vinaigrette tasting shop, multiple candy stores (some with free tasting), ice cream and fudge shops and art galleries. One of the most interesting shops was in the basement down a long hall. They had thousands of old LP records, juke boxes, neon business signs and other collectibles. Holiday parking is free after 4:30.\nShow less"], ["Reviewed November 27, 2017", 4.0, "Lots of Renovation Going On but Still very Cool", "You've gotta love Old Sacramento - the old West lives! The boardwalk, the great facades, old buildings, brick streets, the railroad and the steamboat are all just perfect. We had coffee and wandered the shops. There's a great kitchen supply store, a lower level classic vinyl store and tons of other shops to explore.\nLots of food options so you can have whatever you want. We had lamb satay at an Asian stand that was fantastic! Great day!\nShow less"], ["Reviewed November 25, 2017", 4.0, "Trip back in time...", "Very interesting. Many places to see. The town is like a time capsule. Not a lot to do. Many candy shops."], ["Reviewed November 23, 2017", 5.0, "I love allllll the old buildings!", "I love love love all things old! Walking around here let me day dream of another era! The old Wells Fargo building! The Pony Express that ran through here! I love all the old planks of wood! I loved the little donuts, and the old saloon!\nShow less"], ["Reviewed November 20, 2017", 4.0, "Very nice visit", "We stopped in Sacramento on our way to Tahoe. The atmosphere in the old town is worth the stop if you have never seen it."], ["Reviewed November 20, 2017", 4.0, "Fun, but ...", "Not as good as it used to be. I was there just after Labor Day. Many stores were closed but unfortunately, many more were vacant. It seemed to me (maybe it's just me) that most of the serious retailers have closed/moved out, leaving nothing but tourist schlock. The railroad museum is a must-see and Fly's is a good place for lunch.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Nice place to view Historic buildings", "Old Sacramento was steps away from my hotel. I ealked around for a few hours to view historic builfings and the Delta King steam ship. All wa very nice."], ["Reviewed November 18, 2017", 5.0, "Pretty cool.", "Rich in history. Plenty to do and see.\n\nVery busy and hard to navigate a pram with an inquisitive toddler in some shops.\n\nThere is a really cool dress up/costume shop that's a must see. It's 3 or 4 floors full of costumes of all kinds for all ages and interests.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Anniversary stroll", "We visit Old Sacramento on occasion and always enjoy ourselves. Even with the construction going on our visit was enjoyable. Visit the different eclectic shops and don’t take it too seriously. Train museum is also worth a look"], ["Reviewed November 17, 2017", 5.0, "fun", "My husband and I spent 2 hours walking around this historic district. We had fun people watching and browsing the shops, some very unusual."], ["Reviewed November 17, 2017", 5.0, "Love the old town", "Bars and shopping loved the area. Worth going to see nice job had so much fun at the bars. Good bargains in the area"], ["Reviewed November 16, 2017", 4.0, "Nice area to visit as a tourist", "Nice looking buildings, although you expect a more preserved sidewalks and areas outside the buildings. Lots of tourist traps and souvenir shops but some gems in between. Don't miss the candy stores, best salt water tuffy I tasted in a long time."], ["Reviewed November 15, 2017", 4.0, "parking difficult in old sacramento but many great activities", "parking difficult in old sacramento but: many great activities good cars and restaurants nice walk in the streets"], ["Reviewed November 15, 2017", 5.0, "Worth a visit", "This is definitely the best part of Sacramento! A perfect place to spend a day(s) or hours learning about history, shopping, drinking good coffee, or just wandering around chatting with friends. I was amazed, and definitely recommend a visit."], ["Reviewed November 14, 2017", 2.0, "Mostly tourist shops and tourist food.", "I walked around in the morning before most of the stores opened. You can try to get a feel of how Sacramento once was. But behind the facade of buildings, some restored, some rebuilt altogether, there is nothing but a roaring tourist trade of souvenirs and eateries. Speaking of roaring, the nearby interstate was so loud that it ruined any attempt to go back in time in your imagination.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Cute, yet a little touristy", "Cute area and fun to walk around and look at the buildings. A few interesting little shops, but most are tee-shirt shops or candy stores. Seems to be very focused on kids, yet lots of bars. Unsure who this place is directed to... kids or adults.\nWe did have fun walking around and exploring. A couple interesting museums.\nI would recommend this for a half day trip. We walked the area in about 2 hours.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Nice escape to the past", "Dirt roads and vintage storefronts add to the vibe. Nice place to just walk around and pop in to bars and restaurants as needed.Lots to chose from. We stayed on the Delta King converted riverboat hotel for an extra historical treat within walking distance."], ["Reviewed November 11, 2017", 5.0, "Take a stroll down memory (tourist) lane?", "When visiting Sacramento, one MUST make the trip to Old Sac (that's worth a laugh right there!)...and take a gander at how history evolves. What once was a wild west, history rich area filled with brick streets and saloons, has now become a mecca for all things tourist! There is a great record store to dig through crates, and many places to eat along your journey. Horses carry visitors through the streets, and the sights and smells of \"New Sac\" are aplenty.\nOne of the greatest joys of Old Sac is Christopher and his Musical Marionettes.\nGo visit!!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Old Sac", "Fun for a historical location. Very touristy. Lots of cute little shops, and little eatery's. Some of it overpriced, some of it not."], ["Reviewed November 6, 2017", 4.0, "Nice walking tour", "Fun little shops and bistros. Great railway museum. Cool costume shop. Mini-donuts made while you wait. Horse drawn carriages. Several candy stores. Food from fine dining to take away snacks. And LOTS of T-shirt places. Pleasant way to spend a day. Some places even validate parking.\nShow less"], ["Reviewed November 6, 2017", 3.0, "Old Sac is worth going to see!", "We love the history of Old Sac, but it is sad to see so many empty stores now. It took away from the awe of the attraction. Still, there were many great stores to browse through and eateries to visit!"], ["Reviewed November 5, 2017", 4.0, "Cool part of town", "Great architecture and a good perspective on the history of Sacramento. The historical museum was worth a visit, but I was generally a bit disappointed in how touristy the majority of the area was. LOTS of t-shirt and candy shops - the usual tourist stuff - with some good restaurants and bars mixed in. It would be a great place to take young kids, but was not what I was looking for on my own. Good place to get a sense of the beginnings of Sacramento!\nShow less"], ["Reviewed November 5, 2017", 4.0, "Back to the past", "Durimg my visit there were a lot of empy shop and works in progress all arpund the area, so It was not so really nice, still you can breathe western air!! Go there just for a walk!!"], ["Reviewed November 4, 2017", 2.0, "Scary run down", "Have not visited in years but went to try dinner. Sadly, many homeless and scary folks walking around. We canned out of there. They need to clean it up."], ["Reviewed November 3, 2017", 5.0, "Fun ANYtime and for ALL ages - Eat, Play & Learn", "Old Sacramento is a hidden secret in Sacramento because it is separated from the city by Highway5 and bordered on the West by the Sacramento River. But if you take the time to explore, you will be pleasantly surprised with the variety of entertainment available. There are wonderful restaurants and bars from exclusive and fancy to hip, quirky, economical and just plain fun. There are stores selling artisanal and craft items as well as most tourist oriented paraphernalia. But the several museums are truly exceptional and exciting as well as seriously educational. This is a place with something for all ages. Parking can be a challenge so use the parking lot and beware the parking meter$. 'Candy Haven' will help you remember all the candies that even your parents grew up with, the restaurants on the river are exciting and beautiful and 'Fanny Ann's\" is a place you will NEVER forget.\nShow less"], ["Reviewed November 2, 2017", 5.0, "A piece of history", "Such a beautiful place that has kept its history. We visited the bars, restaurant, shops, museums, boat and train rides. We loved spending our time down there and would love to go back!"], ["Reviewed November 1, 2017", 4.0, "Neat Area", "Very nice and clean historical area that has many shops and restaurants. Right along the river. Easy to walk. Only 8 tenths of a mile walk to the capital building. Worth a stroll!"], ["Reviewed October 30, 2017", 3.0, "Residence", "It was nice and quaint I Enjoyed myself. I would visit again. I would like to bring my family to Sacramento for vacation to see the sights and even visit the capitol I enjoyed the drive along the river I'd like to check and see maybe about even going fishing\nShow less"], ["Reviewed October 29, 2017", 4.0, "Work in Progress", "Old Sacramento is going through a Renaissance. But there is much to do. Restaurants abound and I appreciate that the city is reinvesting in its local owners and farmers. FUN"], ["Reviewed October 29, 2017", 4.0, "Very nice place ti spend a day", "Great place to walk around and visit all the stores. Several places where you can get food. Parking available. Wear comfortable shoes to walk on cobblestone roadways."], ["Reviewed October 28, 2017", 3.0, "Ignore the touristy and look at the city", "Love to appreciate the historical value of cities. I have read books over the years about the Calif Gold Rush springing up cities in 1848, and this is a good example. We were here on July 4 for a day between Yosemite and Tahoe, and it was very hot, so it's good that Sacramento is very, very high on the list of the number of trees per capita in the world. Unfortunately the art museum was closed, but we did enjoy the Railroad Museum and the riverfront and looking in the endless saloon/store replicas (and of course the Citizen Hotel). One of the best moments was sitting on the curb in the shade across from Subway where we had gotten ice cold drinks.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Absolutely love old town", "Great place to spend a day walking around relaxing and shopping. There are plenty of shops and restaurants to enjoy. The area is very safe for families and solo travelers."], ["Reviewed October 27, 2017", 4.0, "lovely place", "So many different shops and if you find the right one you can even see a TARDIS standing in a doorway :D love the view of the bridge and the museums as well :)"], ["Reviewed October 26, 2017", 5.0, "Pity the river side is under construction", "Enjoy the old 1850 feeling. Interesting small shops. Remind me a bit of the old town in Reno. I was here on a weekday so it's not crowded at all. It's pity that the riverside is under construction. The video played in the visitor center is helpful and would be great to have more information or stories about old Sacramento during the walk.\nShow less"], ["Reviewed October 26, 2017", 3.0, "Fourth star pending", "This area could use some upgrades. There is some construction going on, so I guess they agree. The restaurants bars and shops are very diverse. I tried a few of the restaurants that were good. The bar seemed friendly and decent. This is a very quaint area with wood sidewalks, a riverfront dock, and a train running through the town. You can image what it once was. The town need to do a better job of recreating the old town feel. It is a little touristy. It is a little kitschy. It does have some potential and I had a good time there.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Excellent Place to Spend a Day", "About 10 square blocks of shops, bars, and restaurants. Something for everyone. Wooden sidewalks add to the \"old-time\" charm."], ["Reviewed October 23, 2017", 4.0, "Wish We'd Had More Time Here", "Visited Old Sacramento on a Friday night before we were due to fly out and wish we had more time here because it seems to offer a variety of interesting activities, buildings, museums, shops, restaurants, and bars. Our journey there started from Embassy Suites, when we went down to the dock to get a better look at the bridge and a tour ship coming through. We were drawn to head to the other side of the bridge by the old riverboat that serves as a hotel and restaurant, and we enjoyed wandering around there for a while. From there, headed up to the railroad tracks and crossed over into Old Sacramento. Really enjoyed a brief walk through and a couple of longer stops at shops and dining options. The place is funky cool. Streets are narrow in places and I am certain parking is at a premium, but our little walkabout has me determined to return and spending several hours. Yes, a few rough edges, but the area has a lot to offer.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Train Museum", "AWESOME!!!!!!! Take the time to stop by and check out the museum when visiting Old Sacramento. I can guarantee, you won't regret it. There are also various train rides available, but make sure to make a reservation, they fill up fast!"], ["Reviewed October 22, 2017", 1.0, "Full of aggressive homeless", "We went on an evening cocktail cruise snd when we were trying to buy tickets we were surrounded by homeless bombarding us. The ticket booth said they don't take cash only credit cards because they are always robbed. It was a little scary."], ["Reviewed October 18, 2017", 5.0, "Gold-Rush Sacramento", "Although it is a bit touristy, with plenty of tacky touristy shops and restaurants, Old Sacramento is a wonderful and important place to visit and it is actually a real Gold-Rush-era cityscape, not a reproduction. Some of the buildings are reproductions of ones that were lost, but usually even they are faithful copies of ones that stood there while many of the buildings are truly original and they are among the oldest surviving commercial structures in California. These include the Lady Adams building, built in 1852 by merchants who sailed around Cape Horn and arrived in Sacramento on the ship Lady Adams. They took apart the ship to make their store using the masts, etc., for various parts, while making the masonry structure out of the ballast from the ship, making the building after the ship. Another is the B.F. Hastings Building, which in the 1850s served as the first permanent home of the California Supreme Court. It also was the western terminus of the Pony Express. The area had become a Skid Row by the 1950s and was thankfully saved from destruction and partly returned to its Victorian character. It includes the core of the city's waterfront and the magnificent California State Railroad Museum, the California Military Museum, and the Sacramento City Museum. Christmastime is festive here, there are carriage rides, living history days, and more. It is also still a living part of town with apartments, many eateries and bars besides just touristy ones.\nShow less"], ["Reviewed October 18, 2017", 3.0, "Wanted to like", "It here, they did a lovely job making it look like the wild west. But is has deteriorated into a tourist trap. Some nice historical stuff, but a lot of ice cream and taffy. Nice boardwalk and sandy street."], ["Reviewed October 17, 2017", 4.0, "Wild West", "This really was old town set up like the Wild West! Saloons and horse drawn carriages. Lots of food and souvenir shops."], ["Reviewed October 15, 2017", 5.0, "reminiscing", "i was born here in 63 and haven't been back to old Sac in 20 years. The river and the railroad museum are always nice to see. we went specifically to see the terminus point for the Pony Express. The Statue and Plaque are located near 2nd street and the railroad museum. Nice w block walk with good chocolate shops and candy shops other shops and boutiques\nShow less"], ["Reviewed October 15, 2017", 5.0, "History fun for the whole family!", "We visited Old Sac in June, and we particularly enjoyed our guided tour and learning about their response to flooding in the olden days. We learned that they actually raised the whole city building by building along with rerouting the river. Lots of touristy shops that the kids and adults enjoyed.\nShow less"], ["Reviewed October 14, 2017", 3.0, "Great Idea to Save Buildings and a Little History", "September 11, 2107 - We walked from our hotel about twenty minutes to visit Old Sacramento. It is a fairly large area of historic buildings with wood board sidewalks in front of each building. The buildings are occupied by various businesses: restaurants, bars, children's activities, etc. It is very well done.\n\nAlso, in this area, one can board a train with a steam engine for a short round trip ride along the river. This would be a great activity for children. We did it but we were not too impressed. You do get to see and feel how a train runs on the tracks and you do get to see the steam engine change directions by moving the tracks to enable the engine to move from the front to the rear. It was a hot day.\n\nI would not put Old Sacramento as a must see on its own. But, if you are next door to visit the Railroad Museum, you might as well walk around the Old Town for awhile.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Old Town", "Fun place to visit. I especially liked the river view from the restaurant that I ate at. The yellow bridge and river was an amazing background."], ["Reviewed October 14, 2017", 4.0, "Tourism area", "Not many places we wanted to go, but still worth checking out. We ended up at a small dive bar with good food and bartender was awesome."], ["Reviewed October 14, 2017", 3.0, "Not a Must See...", "Sorry but this was eventually our most disappointing place we visited during our trip. Far behind what we have expected. It seems we are not the only people considering it that way. If you are walking through Old Town there is not much what could make this to an unforgettable event. Eventually the days when the historical steam train is in use it‘s more exciting.... The biggest original western city is generating eventually too high expectations.\nShow less"], ["Reviewed October 13, 2017", 4.0, "Well Preserved Western Relic", "It's neat to see a preserved timbered cluster of buildings as it was during the Gold Rush era of yestercentury. A cluster of stores are unfortunately concentrated around that most touristy set of taffy barrels, trinkets and cheap tees, but there are a couple of regional California curios for more authentic palettes, as well as dining ranging from the expected tack to modest impression. The in tact railroad lines (and impressive Rail Museum) and river docks lend an easily imaginable air of the mid-1800s. Well worth a visit, but tough to make a full day out of this \"marquee attraction.\"\nShow less"], ["Reviewed October 12, 2017", 4.0, "A fab accidental find", "Was meandering outside of CalPERS' compound when accidentally stumbled upon the place. What can I say, I am a sucker for knicknacks and trinkets. The place is full of little interesting things that could be gifts for loved ones or like me, I got the gift for myself. Mine was a Darth Vader iron-on patch that has Mexican stylizations on it. Just fab. Didn't have much time to explore the whole place but I'd think it would be really interesting if I get to do that some time in the future.\n\nThere is this cafe at the corner, across from the railway stop that has pretty good coffee and pastries and stuff (can't remember the name, unfortunately). Pretty good place to chill.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Great place to spend the day", "We visited Old Sacramento on a Sunday and had a wonderful day. Started with a wine tasting at the Underground, then walked the blocks and blocks of unique stores and items. Plenty of places to eat and drink and plenty of history to take in. Can't speak for parking because we used Uber. The best part of Sacramento for sure.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Nice place to get a feel of old Sacramento", "Old Sacramento is a small 2-3 block area easily recognized by the old western style architecture and cobbled streets. There are a multitude of shops selling all kinds of gifts and souvenirs. A few of the stores had pretty unique items for sale.\n\nTake a look at the old train depot and the Delta king moored at its berth on the Sacramento River just across the train tracks. There are quite a few small places to eat as well as a few restaurants. Please note that prices here can be 20% higher. They close by 6 or 7 pm on weekdays so plan dinner accordingly. Meter parking is available. Nice place to spend a couple of hours.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Fun remnant of the old west", "Old Sacramento is a small area of town just off the I5 near the state capitol. The buildings have a whiff of old west charm that is made even more fun with a wooden boardwalk and cobbled streets. The area has a number of tourist trap stores, but is also home to a great railway museum and a couple of good restaurants. Parking on the street is limited to 2 hours, though, so plan on a fairly quick visit or paying for the off-street parking.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Fun place to spend an afternoon", "The cornerstone for Old Sac is the California Railroad Museum. We'very been a dozen times over the years and always learn something nwe when we visit. The shops are interesting to browse through. There'should a handful of decent restaurants."], ["Reviewed October 11, 2017", 4.0, "Loved it!", "We visited Old Sac and just loved it. I love that all the buildings have been maintained. It was a great place to hang out on a Saturday evening. Lots of shops and restaurants."], ["Reviewed October 11, 2017", 4.0, "nice place to bring out of town visitors", "Brought some out of town visitors to Old Town Sacramento -- they all enjoyed themselves as did I. Very fun to walk around and look at the shops and all the waterfront activities It was a Saturday when we were there so it was full of people but still had a good time\nShow less"], ["Reviewed October 9, 2017", 3.0, "A walking history lesson and shopping", "I was visiting my sister and walked around Old Sacramento seemed like a good day trip while she was working. i enjoyed the museums and the shops. I especially liked the underground tour. Learning history in this manner is always more fun than an old book. I was disappointed that there wasn't more history and less candy. Living in AZ, I am near Tombstone, so this type of attraction is commonplace for me. However, the history is different and that was what interested me the most. I was surprised to learn that women could own property as individuals. CA was progressive even in the 1800s.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Trip down memory lane", "6-8 of our friends visited Old Town one Sunday afternoon. What a blast from the past!\nOur walks thru the old time stores with stops in candiland (50's time candy in jars) and those munchies we ate as kids. Best of all were the many selections of fine restaurants and saloons to choose for fine foods. Sunset and many had bands/music to enjoy.\nA great family and friends destination.\nCome and enjoy OLD TOWN SACRAMENTO\nShow less"], ["Reviewed October 8, 2017", 3.0, "Touristy, but interesting", "Preserved buildings from the 19th and early 20th centuries make this a nice place to walk and imagine what life was like during that time. With the exception of a few museums, the rest is largely touristy with gift shops, candy stores and restaurants. It could benefit from a wider selection of stores and galleries.\nShow less"], ["Reviewed October 7, 2017", 4.0, "1 square mile of enjoyment", "I had no idea about the history of Sacramento, but got an idea walking around the old Town.\n\nLast train station to the West. And then onto the radar steam boat ... You can just picture it here. And it was nice that they were playing around with one of the steam trains.\n\nThis is where you have the Golden gate bridge. The gold color bridge that is. An impressive piece of work.\n\nDifferent restaurants around, I am sure all good to go. I enjoyed the story visit.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Lovely ol'west town", "Fun to just walk around, but after years of visits I'd recommend: Evangeline's Costume Mansion, a hornblower cruise of the river or horse drawn carriage ride and eating on the outdoor terrace overlooking the city at La Terraza Mexican Restaurant (live Mariachi's Sunday nights). If seafood is more your thing then Joe's Crab Shack or Rio City Cafe also have patio dinning overlooking the river. Walking across the yellow bridge= \"Tower Bridge\" is also cool. There is a tunnel to down town Sac connecting these two places. CA's impressive state capital building is also only a short walk away.\nShow less"], ["Reviewed October 5, 2017", 2.0, "Mostly boring candy shops", "Old Sacramento is just a tourist attraction, other Victorian cities like Ferndale are much more attractive. The shops are mostly candy shops, have you seen one, you have seen them all. City history museum was great!"], ["Reviewed October 4, 2017", 4.0, "Fun Tourist Place", "As a native to Sacramento, I always brings out of town guests to Old Sacramento because it is a unique tourist attraction to our town. It is authentic even though its redone to be a tourist attraction. The old storefronts with their wooden walkways are fun to poke in and check out. There are several good restaurants on the waterfront and a water taxi that can take you up stream to other eating venues. It has its share of tacky tourist traps but also some really cool shops that sell interesting and useful things for home and hearth. Its worth a visit if you have never been to Sacramento.\nShow less"], ["Reviewed October 4, 2017", 3.0, "What happened?", "My husband and I stopped in Old Sacramento to have dinner about 4 in the afternoon. We got there about an hour and a half before most of the shops should be closed. I was quite surprised that many shops were closed before 5. Maybe it was a bad day to go, but I was very shocked to see how few people were there.\n\nWe drove through old Sacramento, and they were a few people walking around. But it was more like a ghost town than the busy streets we normally see.\n\nIt used to be there were many restaurants there, but now it seems to be mostly candy shops and novelty shops. Although I don't mind the candy shops and novelty shops, it's more fun to have places that you can stop and eat that are different.\n\nMaybe we went at a bad time or on a bad day, but I have never been there before that the streets were not filled with people. Old Sacramento still has its quaint and old time atmosphere. I love the wooden walkways. I think they're quite fascinating. The strange thing about it is that your feet don't hurt and if you walk around for a while. On concrete, it takes a few blocks, and then your feet hurt. But on these wooden walkways, you can walk quite a ways before your feet begin to bother you.\n\nAs usual, parking is not easy, and we had to walk a block and a half from parking on the street to the restaurant. Of course during the busy time of year, you're lucky if you find a parking place at all and usually have to park in the garages about 6-8 blocks away.\n\nIt's still have a lure to us, but it was almost a ghost town we went. I was very surprised. By the time we finished dinner, nearly all the vehicles were gone and we saw a few people here and there walking around.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Great fun!", "Old Sacramento is a great place to visit, over and over again. There are unusual and unique stores, great restaurants, funky old time saloons, museums, and entertainment. Stroll through the old-time streets or take a horse & buggy ride."], ["Reviewed October 2, 2017", 2.0, "Kinda fun but not really for kids.", "Just a tourist spot with no parking, loud Harleys and drunk obnoxious fake bikers causing trouble, then there's a place blaring crappy rap \"music\" and thug patrons who look like they want to kill you."], ["Reviewed October 2, 2017", 5.0, "Old Sacramento is a great place to visit.", "Old Sacramento is a wonderful and great place to visit. The old charm and cobblestone streets take you back in time. There are various shops and eateries. Once in a while, there's people dressed in western attire and reenacting the old days. It's a must see if you plan to visit Sacramento.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Old western town", "This is a well kept old western town with lots of things to look at and restaurants to boot. The rail road museum is right next door."], ["Reviewed October 2, 2017", 5.0, "I love old Sacramento", "This is the part of Sacramento that takes you back in time, to the 1800s, the building of the cross-country railroad, the gold rush, and the many that made their living off of it. There are a great collection of restaurants, museums, and other colorful attracts.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great venue", "Great anytime, event or not. So many unique shops, bars and restaurants alm in an old west setting with boardwalks."], ["Reviewed September 29, 2017", 2.0, "Ugh. Shouldn't have wasted the money on parking.", "Just a honky tonk tourist trap with horrible parking and sky high rates. Went into a couple of places to have dinner but immediately left each one."], ["Reviewed September 27, 2017", 5.0, "It is more than a Tourist attraction", "In old Sacramento there are some nice restaurants. A wonderful railroad museum, a CA State museum, Well Fargo has a small exhibit. Lot of little sops plus a short railroad tour plus a seasonal short sightseeing boat trip on the Sacramento River."], ["Reviewed September 25, 2017", 3.0, "Board walks and gift shops", "There wasn't much to see in Old Sacramento. The boardwalks are not user friendly for those with wheelchairs or walkers. Most the stores are gift shops, strangley two sock shops. The Wells Fargo Museum is very small but we did enjoy going on the paddle wheel boat.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Nice stroll, good restaurants", "I always come here when I visit Sacramento. There are some gems tucked in among the tourist shops and candy stores (also fine in their own way). Sadly, things shut down early around here, so it's not as much fun as it used to be in the evenings. There are some great restaurants nearby so you can make an evening of it, but you might want to,shop first and then eat. On street parking is metered and you should download the app so you can add time without a lot of hassle. 2 hr max is kind of a pain.\nShow less"], ["Reviewed September 24, 2017", 3.0, "Great concept, but way too many aggressive panhandlers...", "Lots of neat shops and small food places set in an old-time town setting, but sadly LOTS of beggars and panhandlers that seem to be given more attention and leeway to operate than customers and patrons. Sadly I will avoid this in the future."], ["Reviewed September 22, 2017", 4.0, "Great area", "Love the old time area with shops that have obviously been in these buildings for over a hundred years. This has become more touristy that in my youth but still worth the trip."], ["Reviewed September 22, 2017", 4.0, "Fun little old school town", "It was very pleasant to walk through this area, though touristy but of course it would be, right? I enjoyed strolling on the cobbled streets and the wooden planked sidewalks... The stores and shops are fun to peek in.\nBeware of the father and children that are begging along the streets for money though... the father takes the children through the streets and has the children come up to you to tell you their names, then a story following \"will you give me money to...??\" >_<\nShow less"], ["Reviewed September 21, 2017", 5.0, "Beautiful old western style", "Old Sacramento is an area of a couple of blocks full with restaurants and shops, in buildings that are old western style, very nice to visit and look. The stores are also nice even if you don't by anything. There are a lot of nice candy shops that will give free samples. Late morning, early afternoon is the busiest time, late afternoon is quieter to look around the stores. It's definitely worth the visit. You will need to pay for the parking.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Fantastic step back in time", "Awesome place to visit if you're in the area. Everyone was so friendly and it has a lovely feel. Parking was easy and cheap. We didn't go in the museums as we only had time for a quick stop but you could certainly enjoy a good afternoon there.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Nice place", "Spent an afternoon touring the town during a stop over. Well done with a variety of stores occupying the old town. If your looking for historical recreations of the old town, this isn’t your place. I can say the old train station with its exhibits of old locomotives and cars was done well. The towns ambiance was nice. The Wells Fargo exhibit was interesting.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Fun area of town", "Old Sacramento is an area spanning several city blocks, full of campy and fun shops and attractions, as well as places to grab a bite to eat. Great for a visit with family."], ["Reviewed September 19, 2017", 4.0, "Old Sac", "Old Sacramento is a lot of FUN! Comprised of several streets, you wander the boardwalks looking and shopping and eating your way along. Can be crowded on weekend."], ["Reviewed September 19, 2017", 3.0, "Nice old town with boardwalk", "Pretty typical old town but nicer than most. Has the nice benefit of the train and Sacramento history museums right there."], ["Reviewed September 18, 2017", 3.0, "Losing its charm", "Always come to Old Sac when in area. Lovely historic buildings. Last came 6 years ago and it was quiet but still had some interesting shops. Today many samey shops and some vacant properties. The highlight today was chatting to the 2 guys in the visitor center. Ex military. Really interesting characters who I found very welcoming\nShow less"], ["Reviewed September 18, 2017", 4.0, "Touristy but worth checking out.", "Worth a visit. Cool old architecture. A couple of museums available nearby. We visited the Railroad museum and even though I'm not really into trains it was very interesting and had great displays. There are a lot of shopping and dining options but many of the stores reminded me of being on a boardwalk at the beach. Not that it's bad but worth knowing what to expect.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Historic Old Sacramento", "There are so many things to occupy and distract in Old Sacramento! From vintage steam loco, the Delta Queen paddle steamer, horse and cart rides, historic views to photograph and the numerous gifts and curios stores as well as places to eat.\n\nI'd recommend to visit in the morning or early afternoon if you'll be walking around on the boardwalks: the thermometer rises in Old Sac during the hottest summer months. Alternatively, dress appropriately...and sport a straw hat or baseball cap!\nShow less"], ["Reviewed September 13, 2017", 4.0, "What you expect for Old Downtown", "Lucky that we got to experience Gold Rush Days on Labor Day weekend 9/1-/9/2/17. Had street shows, bands, horse wagons, plays, exhibits of the bygone era of 1850's-1900's. Make sure you take the \"Underground Tour of Sacramento\" at the County Museum, $15/p walking tour of how the buildings were raised after the great flood. Excavations in the 1970's discovered many remnants almost like a Time Capsule buried under the buildings. The whole area has shops, restaurants, the old railroad and Sacramento River, so it's a good place to just pass time.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Great spot for a couple hours of fun", "Old Sac is a great place to explore, with historic buildings, Quirky establishments and of course the California State Railroad museum. Several good restaurants, Some with a view of the river and Tower Bridge. The Delta Queen is a paddle wheel steamship that was turned into a floating hotel and meeting center, and is fun for drinks or for dinner.\n\nThe Railroad museum is an EXTENSIVE collection of Railroad history and even some one only mildly interested should expect a few hours to see it, and if your into Trains, Book the whole day. IMHO, there is enough to see to keep you coming back, since displays and rolling stock change periodically and the docents are knowledgeable and friendly. Many of them are dressed in period clothing which adds to the fun.\n\nDuring select parts of the year, a ride on a vintage Steam Train on the tracks of the Sacramento Southern Railway provides a once in a lifetime view back into history.\n\nParking on the street is metered as is parking in the large lot under the freeway, If it is a busy time, I suggest the freeway parking lot. All in all, a very enjoyable location, with lots to do. The only caveat is the uneven cobblestones can be tricky as can be the planks on the boardwalks and the river front. Take care, high heels are not recommended.....\nShow less"], ["Reviewed September 13, 2017", 5.0, "Always enjoy our visits", "Even though I live in Sacramento, and we visit frequently, I believe Old Sacramento is a must see \"attraction\". As in the 1800's people walk on wood plank sidewalks. If history is your interest there are several museums and tours to choose from. There are events throughout the year so check out their website. Parking prices are very expensive when there is an event at the Golden 1 Arena.\nShow less"], ["Reviewed September 13, 2017", 2.0, "Meh!", "Old Sacramento is trying to make something of itself but it reminded me of a cheap boardwalk with stores filled with kitschy souvenirs, candy and ice cream shops, and an occasional historical building. We ate lunch at a Mexican restaurant and being from Texas, we were NOT impressed with the cuisine. I encourage visitors to this wonderful city to take in the zoo, the state capitol, the railroad museum, the Leland Mansion or walk along the river, all much more enjoyable than Old Sacramento.\nShow less"], ["Reviewed September 13, 2017", 5.0, "A must see!", "It's one of those places that comes off special. Lot's of shops but still doesn't feel like a tourist trap. Lot's of space to walk around . History is everywhere and well documented so one can learn about the time period. Museums are first rate. If you get a chance I also recommend the carriage ride around Old Sac. Reasonably priced and a wonderful moment to look back on. Around the holidays it real shines with a live outdoor Christmas show that is free to the public.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Lots of Unique Shops", "This is a great place to take out of town visitors for a day. Lots of interesting one-of-a-kind shops to browse through. I can always find interesting things to buy! My teenage granddaughter and I had a blast in some of the shops!"], ["Reviewed September 9, 2017", 5.0, "Labor Day time trip to old West", "The Old Town puts dirt on the streets, dresses up for the Old West experience. Full of experiences and exhibits as well as the stores and shopping. Great opportunity to revisit the past with living history. Especially like the cannon fired on the hour. It's great anytime, but especially during Labor Day weekend. We take the whole family.\nShow less"], ["Reviewed September 8, 2017", 3.0, "Getting run down", "Took a walk through Old Town. Haven't been there for many years. Much is still the same but many of the store fronts are empty. I noticed an abundance of candy stores for whatever reason. I don't know how they can all stay in business. Many of the old restaurants are still there: Firehouse, Fat City, Fanny Ann's Saloon. If you've never been there, it's a little touristy but I still think it's worth a visit just for the historical significance.\nShow less"], ["Reviewed September 8, 2017", 4.0, "Family fun", "So much to see and experience. Walking around the area on wooden walkways, crossing the cobblestone streets, stopping for your favorite flavor of ice cream. Stopping by the kite shop s great fun with a myriad of colors and choices. Stop by the old schoolhouse to see how a one Odom schoolhouse operated. Climb aboard the riverboat for lunch or in the evening an interactive mystery play after a delicious dinner. Visit the Railroad Museum or History Museum. Relax on a horse drawn ride around old town. Expect to spend thee tire day as there is lots to see and do\nShow less"], ["Reviewed September 7, 2017", 3.0, "Fun for all", "Visiting Old Town Sacramento is something we do by ourselves for restaurant dining and with the family and out-of-towners when they have younger children\nWe start with a visit to the railroad museum. The children love the interactive exhibits and the adults just love the trains and the history.\n\nThere is a grassy area outside the railroad museum where the children can run and jump around to release energy, and there is a train can take as well.\n\nThe shops cater to tourists, so we rarely do our shopping in Old Town, but visitors find the shops fun and interesting – – especially the candy store!\n\nThe area is being updated, keeping the old time wooden sidewalks and streets feel but replacing it with smoother surfaces that should be safer and easier to walk on for older adults.\n\nIf you have a little time and money, the area is a quaint replica of the 1800 gold rush era with a lot of commercialization. It is definitely fun to visit.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Step back in time", "Great place to see how it was in the late 1800's on Labor Day weekend. Pan for Gold, see a reenacted gun fight, crafts and dress for that period 👍"], ["Reviewed September 5, 2017", 5.0, "One of the nicer free things to do in Sacramento!", "Old Sacramento is a nice leisurely walk through Sacramento's past with stage coaches, saloons, a rail road museum (Not Free), candy shops, restaurants, a comedy shop and access to the river."], ["Reviewed September 3, 2017", 5.0, "Great stroll through tine", "We come to Old Sacramento a couple times a year to enjoy festivals or just walk and enjoy the historic Old West ambience. It is just a fun place to stroll with memorials and boardwalks."], ["Reviewed September 3, 2017", 5.0, "Better than most old Western towns", "Old Sacramento makes a great place to visit. Right at the east end of Sacramento is the classic old city that harkens back to the gold mining towns of the 1800's. With several streets and lots of shops and some of the best restaurants in Sac the place makes a nice destination if all you want to do is get something to eat. But what makes it better than most old towns is the recreated streets with wooden sidewalks, the building facades, its location on the river and the two great museums. The railroad museum is a destination unto itself and one of the best for this genre in State--Nation? Old town San Diego, Virginia City in Nevada, the gold rush towns of the Sierras all have nothing over Old Sac.\nShow less"], ["Reviewed September 3, 2017", 4.0, "FUN PLACE TO VISIT", "Takes you back to the good old west days. Lots of restaurants, gift shops, train trip, the old paddlewheel, carriage rides."], ["Reviewed September 1, 2017", 5.0, "Dont miss the Railroad museum.. Nice walking and if you have a chance go to the Rio restaurant on the river.", "Its a nice example of the city on the old days. Cool walking and nice shops.\nThe river is right there and go to the Restaurant near the river.. Avoid the Crab place.. too noise.\nBut dont miss the Railroad museum.. it does value the US$12.\nWas easy parking on the streets using the provided meters machines..\nEnjoy, 1 hour is more than enough if you dont go to the museum or restaurant.\nShow less"], ["Reviewed September 1, 2017", 3.0, "A tourist trap", "Loved the well maintained facade, but didn't care for the touristy shops everywhere! You could walk and explore the area pretty fast. The on street parking makes for an incongruous scene - old building facades, with modern cars instead of horses!"], ["Reviewed August 31, 2017", 3.0, "Fun Wild West architecture though more adult oriented ...", "Old Sac is definitely a tourist Mecca, with a plethora of souvenir shops, but it lacks in things to do for the children. One can only shop so much, drink and eat. We would have loved to see more history, learn more about the area. The city would do well to emulate Virginia City, which has actors all through town dressed up as historic outlaws and heroes and so on.\nStill though Old Sac has its charm with its wood sidewalks, saloons. Our favourite part? We grabbed an ice cream cone, and sat on a bench on one of the sidewalks and simply people-watched. Overall, not sure I would return whereas Virginia City definitely would.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Tour", "Old town is constructed to look like the old west - covered walk ways of railroad tracks. Many stores filled with a variety of stores and a variety of merchandise. Candy stores, Well Fargo. museums Souvenir stores, restaurants, bars."], ["Reviewed August 29, 2017", 4.0, "Nice Visit!", "We just went to Virginia City in Nevada and enjoyed eating and walking around Old Sacramento. Lots of shops and museums. The railroad museum was the icing on the cake!"], ["Reviewed August 26, 2017", 5.0, "Historic", "Nostalgic place to be at. Reminisce California's wild, wild West days with a visit at this historical place"], ["Reviewed August 26, 2017", 4.0, "Relaxing Visit", "Nice place to walk around and visit small shops. Not an overwhelming walking tour if you park in near the area. Checkout the railroad museum."], ["Reviewed August 23, 2017", 4.0, "Nice to walk around.", "It was nice to see old Sacramento, the buildings are lovely, of course everything is quite expensive and there are too many cheap tee shirt places that seem to populate everywhere these days. I don't know how they survive selling exactly the same stuff."], ["Reviewed August 20, 2017", 4.0, "Old Sac", "Old Sac has a multitude of places...stores...restaurants to visit. It is very interesting to see the history."], ["Reviewed August 18, 2017", 3.0, "Not what it used to be.", "We hadn't visited Old Sac for several years and were sad to find many shops had closed down and the area in general wasn't as we remembered it. Still good for killing a few hours as a stopover when traveling. We had a little extra time to kill as we were staying overnight on the Delta King to break up our road trip north. The area still has a few neat restaurants and shops to explore so I would still recommend walking around town, having lunch and visiting the museums. Also, if your staying overnight try the Delta King it's really fun.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Nice experience", "Never been before. Nice walk back in time. A lot of renovating going on and many buildings vacant but still nice."], ["Reviewed August 17, 2017", 5.0, "Must visit if you go to Sacramento", "Sacramento is the administrative capital of California, We went for a business meeting and we had the afternoon to roam around. This is a show piece of the real history of America. When you walk in it reminds of those Cow boys films of yester years. There is a lot to do. Museum, Eateries, walking etc., You must visit this area.\nShow less"], ["Reviewed August 16, 2017", 5.0, "A piece of my historical city", "Old sacramento the downtown historical community is a must visit to partake in. Close to hotels one can walk over and visit. You be amazed at the different eateries and self own shops it has to offer. A tourist attraction like no other. A bit of the wild west fir it sits right on the great sacramento river. The cobblestone roads and wood planks that will have you walking at least 9 different bungalows. You can also partake in the various eateries on the waterfront. Bring your wallets because the shopping in fantastic! Parking is acessiable in parking garages or meters right in the area. Enjoy yourself californias capital city has much to offer.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Something for everyone!", "Old Sacramento is a fun little gem on the river's edge. It is separated from the updated part of town by I5. Full of history and adventure, you learn about the beginnings of our beautiful city. Food? What kind do you want? Eateries for every taste bud and wallet are many and varied. Shopping? Old or new? Cosmic or historical? Kites or Hollywood? Add to that river front dining, a paddle wheel restaurant and hotel. Train rides on historic old trains, boat tours and some of the best pubs and entertainment in the area. I love this place! To be fair not all parts are easily w/c comfortable, and steps and stairs can be difficult for some.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Great Place for a Little of Everything", "Really enjoyed strolling the streets and the glimpse of the way it was. Lots of great food, shops, and bits of history. Warning... Lots of candy stores too with barrels and barrels of candy... Parents be ware."], ["Reviewed August 15, 2017", 4.0, "Turtles of Old Sacramento", "1017 2nd St., Old Sacramento. A candy shop. Everything is delicious. They have chocolate covered bacon, first time I've ever had it... OMG it is to die for! Dennis the owner, is a really great guy."], ["Reviewed August 15, 2017", 3.0, "Needs work---but great buildings.", "I love the concept of old town, but the mix of shops and things to see definitely need a nudge. If it weren't for the Delta King Riverboat restaurant and the Train Museum, I wouldn't go back. I think it needs to get ideas from the gold rush town of Columbia!\nShow less"], ["Reviewed August 15, 2017", 4.0, "Old wild west modernized", "I walked here down the path from my hotel. easy to find. A lot of shops, restaurants, souvenirs in the old buildings. Great to walk around and see about the 1800's. About after a 10min walk you can see the modern side of it all."], ["Reviewed August 14, 2017", 3.0, "Interesting but...", "A few streets of historic buildings and boardwalks close to the river. Most of the buildings are occupied by tourist shopping or restaurants and candy stores. I suppose in these hard economic times this is inevitable and if it keeps the Old Town afloat then that can only be good. I would have liked more signs telling me about the history of the area and of the buildings.\nShow less"], ["Reviewed August 13, 2017", 3.0, "Old wild west environment", "The area depicts the old wild west. Snack and souvenir shops all around. Nothing special. Good for families."], ["Reviewed August 11, 2017", 5.0, "Great place for a family outting", "This is a great place to take the family for shopping and eating. Lots of great shops for people traveling through Sacramento and history of the area."], ["Reviewed August 10, 2017", 3.0, "Old Sacramento", "We didn't do much other than walk around looking at the different store fronts and take pictures - but the streets were clean with plenty of seating outside for taking a break - would definitely visit again if we were in the area"], ["Reviewed August 9, 2017", 5.0, "I love old sac", "Is a nice old town stile place with lots of shopping and great places to eat nice river front and a railroad"], ["Reviewed August 9, 2017", 4.0, "Interesting", "A quick walk from downtown via a tunnel under the highway. I wasn't sure if I wanted to venture in but was pleasantly surprised as there is s history exhibit along the wall and a young man playing the guitar. When I surfaced lots of fun shops you would typically see - art, jewelry, restaurants, candy and the like. Unfortunately it seems this area may have been hit with hard times as several shops were empty. Definitely worth a visit.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Good Afternoon", "I recently revisited Old Sacramento for a early dinner on a Saturday. While it was quite hot outside, the afternoon was fun. There are tons of shops to check out, my favorite being Evangelines. There are excellent museums, especially the Railroad museum. And a bunch of different types of dining establishments. Very fun place for kids and adults.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Cool", "Bike nite with led lights , we were just strolling around old sac when we notice bikes all over do we had to take pics and videos"], ["Reviewed August 8, 2017", 2.0, "Rinky Dink", "If you like cheap touristy souvenirs, then this is the place for you. I did not like it. The majority of the shops are geared towards this kind of merchandise. I didn't notice anything lovely about this area. We didn't even enjoy our dinner at what seemed to be a nicer restaurant in the area. I won't be back.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Great Historic Old West Attraction", "This is a fun way to spend a day. Not a lot to do for little ones - a few toy stores, etc., but plenty of restaurants, candy stores, and other places. There's a comedy club and other nighttime activities too. The river is pretty with riverfront restaurants and open air seating.The California Railroad Museum is nearby and is a great attraction for all ages.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Always bring out of town guests to Old Sac...they love it", "Although the day was incredibly hot we enjoyed strolling around and cooled off with a nice brew at Fanny Ann's Saloon which is an ICON!"], ["Reviewed August 7, 2017", 5.0, "Such a fun town to visit!", "Old Sacramento is a really fun town to visit, great shopping, great food, and entertainment. Want to take a train ride or a ride in a horse drawn carriage? They have both available for young and old!"], ["Reviewed August 7, 2017", 2.0, "Don't waste your time!", "So looking forward to this after seeing the pictures online. What a bitter disappointment. It's a big area with many shops......empty shops! There are a lot of empty buildings and closed shops. Of the few that were trading, some looked like glorified junk shops, walked in and walked out again. The museums are overpriced and the restrooms are in desperate need of cleaning. What a waste of our holiday time!\nShow less"], ["Reviewed August 6, 2017", 4.0, "Lovely buildings and setting.", "A really nice, well laid out, walk through some (very genuine and historic) streets, buildings, businesses, and history. One feels you really are in the old west during the heyday of economic growth and the push for the Pacific.\nYes of course, there is a bit of the ever present touristy crass-ness and twee looking places, but this is genuinely a lovely way to walk through a beautiful area. The setting by the River Sacramento, and the California State Railroad Museum plus the Delta King paddle-steamer, maker this all very picturesque on a sunny afternoon. The choices of food, drink, and refreshment are many, and good. Wish I had more time to take in a few more museums (I would love to have done the Wells Fargo one). Spend the best part of a day here, and then come back for drinks and dinner too. Enjoy!\nShow less"], ["Reviewed August 5, 2017", 5.0, "Great place to take visitors", "We go to Old Sac occasionally, but mostly with friends who visit from out of state. The railroad museum, good restaurants, fun shops, quirky entertainment... it's all there."], ["Reviewed August 5, 2017", 5.0, "A step back in time!", "A great trip to Old Town and all that it offers. Walking on the wooden sidewalks really makes me feel like I could close my eyes and go back in time. Granted it is a lot of tourist shops but there is still a lot of great history here.\nShow less"], ["Reviewed August 3, 2017", 4.0, "Interesting place", "Lots of interesting shops and a variety of places to ear -- including bars. Despite the latter it still appeared to be a family-friendly location, if you had children with you - at least during the day."], ["Reviewed August 2, 2017", 3.0, "Disney without the rides", "Just for tourists. One and done. No need to repeat. Some high end restaurants. Otherwise it's all tshirts and ice cream."], ["Reviewed August 2, 2017", 5.0, "Always a fun time!", "Old Sacramento always has a lot of things going on all year long. The shops are very unique and there are some very good restaurants. Highly recommended by locals to people and tourists from all parts."], ["Reviewed August 2, 2017", 3.0, "Disappointing....", "A few colleagues and I walked over and were disappointed that most of the retailers were closed by 7:30 pm. Many of the shops were no longer in existence and sitting empty. I think there needs to be an investment in cleaning it up and attracting tourists and locals.\n\nThe meter attendants ticketing the few cars in for a visit certainly won't help attracting tourists to this location.\n\nWe had s quick bite at speakeasy which was terrible and the establishment patio was old, run down and we had to hold down the table legs with our feet so our drinks and food didn't topple over.\n\nCertainly not worth the effort.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Old Town Shopping", "Fun place to go back in time to 1800s and present. Great shops and food for everyone. Candy Heaven is always on our stops in Sacramento!!"], ["Reviewed August 1, 2017", 5.0, "Old Sacremento", "The old town was fantastic lots of stalls to look at on the old board walks, just when you thought you got to the end it went around another corner, all sorts of shops and restaurants.\nThey have the best Xmas shop to browse around and right in the corner at the beginning of the walk there is a really nice fish & chip shop only small but taste great.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Historically interesting", "Old Sacramento was an interesting visit. Old wooden boardwalk and interesting shops and restaurants . There was an old paddle wheel boat that was interesting to look around. Definitely worth seeing."], ["Reviewed July 31, 2017", 3.0, "Old Town Sacramento", "My family visited Old Sacramento before our flight out of Sacramento International after ten amazing days in California. This was our least favorite experience in Cali. There is a little history there with a LOT of shopping.We were there on Sunday and as it got later in the day, lots of people who appeared to be under the influence of drugs were wandering about. The school house is very interesting. If you just want the history, this is a quick stop. If you enjoy many candy stores and shopping for touristy items, you may want longer.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Old town", "This is a must to see how old Sacramento was in the old days. It's restored with wooden sidewalks and retro advertising signs. Plenty of food joints. Best to go on a weekday as weekends are very busy"], ["Reviewed July 28, 2017", 4.0, "Taste of History", "Took the opportunity to visit Old Sacramento whilst in Northern California. It really is nice to see the old trains (twice the size of your old british steam trains) and the old station. The old town itself has all the original old buildings, and even has the wooden sidewalks. It is very commercial with all the gift stores and restaurants but it is easy to lose three or four hours just walking around. It has a great ambience about it, and there would definitely be something there for everyone to enjoy. What's more is it cists nothing.\nShow less"], ["Reviewed July 27, 2017", 3.0, "More commercial than historical", "When driving from San Francisco to Lake Tahoe decided to visit the old town of Sacramento. It's just 3 minutes of the highway so very convenient to visit. However, it was somewhat disappointing. Yes, there are all old buildings that make you think you are in an old Western movie, however all buildings are occupied by all kind of stores and food places. Expected more than that, would still recommend to see it and take a picture (and if around lunch time I am sure you can find something good to eat), but quickly after that move on.\nShow less"], ["Reviewed July 26, 2017", 3.0, "Some historic charm", "Some of the charm includes the original board walks and brick laid streets. However, not all business are \"senior\" or \"handicap\" friendly. There are a few restaurants that have very good food, especially the Mexican one, Louis Jr's. This one is an exception to the area's over priced food.\nShow less"]]}}