{"Old Point Loma Lighthouse": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Old Point Loma Lighthouse", "url": "/Attraction_Review-g60750-d266820-Reviews-Old_Point_Loma_Lighthouse-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/01/20/5c/ajouter-une-legende.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1283"}, "address": {"@type": "PostalAddress", "streetAddress": "Point Loma", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 weeks ago", 5.0, "San Diego History and Awesome Views", "I enjoyed visiting this old lighthouse, learning the history of it, and enjoying the views from high up on Point Loma. In addition, there are remnants WWII fortifications and a very interesting exhibit explaining the importance of Point Loma in WWII. This is part of the Cabrillo National Park(also excellent) and I made a separate trip to just see the lighthouse.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "An outstanding and unusual look, literally, at San Diego", "Outstanding way to spend a few hours learning about San Diego's lighthouse history. This is a low key attraction with outstanding instructional opportunities and remarkable views of the harbor, the city, the airport and the naval facility. A little bit of climbing but very interesting information regarding the early activity surrounding San Diego's harbor. The views were incredible- a great way to spend a couple hours or the better part of a day.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Interesting history. Great views.", "Great views of San Diego, Halsey Field and the ocean. Lots of history of the area from the founding of San Diego to modern times."], ["Reviewed 2 weeks ago", 5.0, "Fun to visit and observe the way of life for Early Lighthouse Keepers", "Great place to take children and let them enjoy the outdoors. Lovely walking trails. Part of the Cabrillo Monument Park."], ["Reviewed 3 weeks ago", 5.0, "Another don't miss site", "This area is especially suited for people who can walk easily on steep trails and paths. However, the view from just the light house and the overlooks it well worth the drive and these areas are easily accessed and even for handicap. Free parking and visitors center. From there one can drive down to the lower parking lots where you can climb the Clift areas and get into the tide pools on low tide. Fabulous views of downtown San Diego, Coronado Island, the bay and of course the Pacific Ocean. Don't miss this. We spent several hours walking around and packed a picnic lunch as there is no food available in the area.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Sweeping Ocean and San Diego Bay views.", "Situated near the end of Point Loma peninsula, west and south of the San Diego airport, is a fairly long drive from most tourist sites. It's worth a visit both for the history and views. Further, on the way to the Lighthouse, you pass through a National Monument, a Navy installation, and by an exquisitely maintained--but almost unknown--National Cemetery with thousands of graves neatly arranged and marked with white headstones.\n\nNeither the Old Point Loma Lighthouse nor the various viewing overlooks are far from the parking area, and various explanatory boards give interesting information about the sites and history. Quite often Navy ships pass by on their way to or from one of the San Diego Navy installations in the Bay.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "History Abounds", "This lighthouse is very unique in that it is in Cabrillo state park. It sits atop the bluff that overlooks San Diego harbor. The house itself is open accept for the top floor. It is a small home that has original furniture and layout as it was in past years. On the grounds beside the house is a building that provides the history and also a small garden. Surrounding the building are trails that can be used so bring comfortable shoes and snacks if you plan to use.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Beautiful views of San Diego and the surrounding area.", "Even in January it was a warm and beautiful day out by the lighthouse. Not much happening on the ocean side but the harbor was very busy with ships and boats going in and out. There were beautiful views of the harbor, the city and the surrounding area.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Lighthouse witha view", "One of my favorite spots, we have been here many times and it never gets old, such a gorgeous spot and the view is incredible from all across the top of Point Loma. I love to go up there, you can see so far that you feel like you are at the edge of the Earth. The view of San Diego it nice with the mountains behind it and the harbor and sail boats make for a great photo graph.\nShow less"], ["Reviewed January 17, 2018", 5.0, "This is at the Cabrillo National Monument!", "Worth the visit. Great views form the whole park area. Lighthouses always offer so much history and this one does not disappoint. You also get to see some military items from WWII."], ["Reviewed January 17, 2018", 5.0, "Breathtaking Views", "Unbeatable panoramic views of San Diego. Hiking trails with an abundance of flora and fauna. Many Historical sites, and learning about the lighthouse and its caretakers is pretty amazing. You can take a guided tour or go solo. Make sure you're wearing comfortable shoes!"], ["Reviewed January 17, 2018", 5.0, "Beautiful View", "We drove to Old Point, and we were surprise how beautiful was the view from there. You will be able to see all San Diego. Very Nice, Highly Recommended!!!"], ["Reviewed January 15, 2018", 5.0, "Historic Lighthouse", "This historic lighthouse has amazing 360 views of San Diego Bay and the ocean. The former lighthouse is now a museum and it is very interesting to see the various light/mirror mechanisms used to protect people along the coastline.\n\nThe family’s living quarters remind me of life on the plains. Think Little House on the Prairie only it’s not a log cabin, but a lighthouse on the rocky coast. It is very interesting!\n\nThis has a reputation of having the best view of San Diego Bay. We are glad we went (even with the fog cutting our trip short). Highly recommended if you are in the area!\n\nFee: ten dollars per private car. Commercial vehicles are more.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Great Picture Op", "Put your polarizing lens filter on your camera and get some striking pictures of Old Point Loma Lighthouse. Try different angles and enjoy your pleasing results;ts."], ["Reviewed December 30, 2017", 5.0, "If you visit Point Loma, you have to check-out the Lighthouse", "It's a lighthouse, I love lighthouses so this was an awesome visit for me and my family. I highly recommend checking it out, some amazing views here and seeing this old beacon of the Sea is worth the time and effort."], ["Reviewed December 25, 2017", 5.0, "Very Interestng", "I had never visited a lighthouse before and found this really interesting.\n\nIt is amazing how they used the different lenses to focus the light and achieve a greater viewable distance (or however it's described). It's also amazingly crowded - not the visitors - the structure. I found it amazing that a family managed in such a small building. There's quite a bit of history here so take your time and bring a camera.\n\nIt is part of the Point Loma park area so there's no additional fee to visit.\nShow less"], ["Reviewed December 12, 2017", 4.0, "nice views", "Part of Point Loma and gives one the way navigation was managed many years ago. Get ready to walk up as parking is not too close."], ["Reviewed December 6, 2017", 5.0, "Historical Haven with a beautiful view", "This is such a cool thing to do as an adult but the kids loved it too. Learn about the history of this lighthouse in San Diego. The views are amazing and the history of this lighthouse is priceless."], ["Reviewed December 3, 2017", 5.0, "Historic Site Well Preserved and Presented", "We visited Point Loma with its fantastic views over San Diego city and the harbor. The video presentation was very informative and well put together so spend the 20-25 mins watching it. We then walked up to the old lighthouse and had a peek at how the old keepers of the lighthouse lived back in the day. It was very interesting.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Amazing", "I visited this location about 11am. It wasn't as crowded. Wear comfortable clothing and tennis shoes. You will have to walk up the hill from the Cabrillo visitor center. If you go inside the house, you can walk up the steps and see the living quarters of the person who would stay at the lighthouse. There is also an overlook where you can see the migration of the whales. Be sure to check out the tidepools below.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Great views from Pont Loma", "We have been here a few times over the years, beautiful place to walk around, enjoy the city views and watch the military planes fly in and out."], ["Reviewed October 26, 2017", 5.0, "History on the Hill Top", "This light house is an amazing piece of preserved american history with you being able to go in the light house and up the tower as well as see how they would of lived when it was first built. There are amazing views out to see and you might even spot a whale.\nShow less"], ["Reviewed October 24, 2017", 4.0, "That view!", "This is a very nice lighthouse and view of the Pac Ocean. It also has a extremely large Veterans Cemetery that has one of the best views of downtown SD around. Very quiet and serene place to visit early morning"], ["Reviewed October 19, 2017", 5.0, "Alway nice to visit!", "When our travels start in San diego then we always visit point loma and Cabrillo national monument. Then we always walk the path around old point loma lighthouse. Such beautifull sights!"], ["Reviewed October 18, 2017", 5.0, "Great view of both the Pacific Ocean and downtown San Diego", "This was a recommendation from our concierge and a simple, but enjoyable ride from the Mission Bay area."], ["Reviewed October 11, 2017", 5.0, "Well preserved Lighthouse", "A must see when visiting Cabrillo National Monument. A short walk from the Information Center. You can goo inside the lighthouse and see where the keeper lived and alongside it there is the history of the lighthouse and keepers."], ["Reviewed October 11, 2017", 5.0, "Beautiful lighthouse", "The lighthouse was great! So beautiful to see. Awesome view from this great area overlooking San Diego."], ["Reviewed October 11, 2017", 5.0, "Worth the trip", "This lighthouse is kept exactly how it was when lighthouse keepers stayed there. Easy walk from the parking and spectacular views! Well worth seeing."], ["Reviewed October 1, 2017", 5.0, "San Diego should be proud of this Lighthouse", "Well done to San Diego for keeping this lighthous in great condition. The whole experience was amazing and is well recommended."], ["Reviewed September 28, 2017", 4.0, "Awesome view from here", "The light house was attractive and the surrounding views are spectacular. You can see the great coastline of San Diego."], ["Reviewed September 13, 2017", 5.0, "Spectacular view", "Awesome view overlooking San Diego. We were lucky enough to watch a Submarine pulling back into port. Lots to see from the top."], ["Reviewed September 5, 2017", 5.0, "Incrediable photo opts.", "This National park is one the most beautiful spots in the Country. Set above San Diego you will be able to photogaph all of downtown, North Island Naval Air station. Hotel Del Coronado and more. The is wild life with the tide pool area to birds, rabbits reptiles and more. The history of California's discovery and the Military use of the point for observation is very very interesting. Highly recommended.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Worth a stop", "This is much better seen up close than from a boat in the harbor. The views from this place are amazing!"], ["Reviewed August 31, 2017", 5.0, "Awesome Views of the Pacific Ocean & San Deigo Harbor", "Lots to see here, expansive views of the Pacific Ocean, remnants of US Coastal Artillery batteries during World War 2 and impressive views of the San Deigo Harbor."], ["Reviewed August 26, 2017", 5.0, "Great view!", "I has a great view of San Diego and the ocean. It's well preserved. The small garden is also cute. The tide pool nearby is a must go if you have kids or just love sea creatures. There's a bit of wait to pay for the entrance fee but well worth it.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Fascinating, historical, wonderful views", "I visited this place as part of the park area and was glad I didn't miss it. There is great detail with photographs and artifacts from back in the day when they help to manage the lighthouse. The incredible light itself is something to see. It's good for everyone, there are restrooms close by and I would definitely make this part of a visit to the whole park itself. It doesn't take long to get around the lighthouse and you can Enjoy some very pretty walks along the Cliffs and visit the Cabrillo Monument. I think there are passes available but we went by car and it was a $10 charge to enter. Well worth it. Would go back.\nShow less"], ["Reviewed August 25, 2017", 4.0, "Amazing views", "Visiting lighthouses is always on our \"to do\" list. Old Point Loma Lighthouse is perched on a hill that is not a bad walk from the parking lot. The Lighthouse keeper rooms are open for viewing and there are some interesting exhibits. You can't climb to the light itself but from on top of the cliff you still have some great views.\nShow less"], ["Reviewed August 19, 2017", 4.0, "Interesting History", "While visiting the Cabrillo National Monument, we walked to the Old Point Loma Lighthouse. Inside the lighthouse were interesting exhibits about how the light house keeper and his family lived. Outside was a very nice garden. Restrooms are located across the road from the lighthouse, a short distance away.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Super cool stop in San Diego area", "Plan on getting here early to avoid being stuck in a line of cars trying to get in. This park is absolutely beautiful. There's plenty to do. The tide pools nearby are incredible. Would not recommend if you are traveling with little kids as the sea side cliffs could be sketchy to navigate for the little ones.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Beautiful views", "This park with light house is a must see when in San Diego, great view of navy ships leaving or coming in from the sea. Very interesting light house with museum."], ["Reviewed August 8, 2017", 4.0, "Quiet area for an outside walk with awesome views", "You can climb up inside the lighthouse and see how they lived. You can also learn a bit of history in the museum there. If the tides are low, you can drive down to the tide pools."], ["Reviewed August 7, 2017", 5.0, "Magnificent breathtaking views", "This is a must see. Easy walk with unbelievable views of the Pacific and the Bay. Line of cars a the entrance can get long, but well worth 10 min wait."], ["Reviewed August 1, 2017", 5.0, "Love Ligthouses", "Always try and go to lighthouses if we can. No exception here, there are actually 3 of them on Point Loma. Very nice displays and historical facts."], ["Reviewed July 30, 2017", 4.0, "Interesting History", "This old lighthouse is at Cabrillo National Monument which is a good place to go just for the views. The National Park Pass will get you in otherwise it's $10."], ["Reviewed July 28, 2017", 5.0, "Point Loma Lighthouse", "Beautiful scenery and interesting history. Very peaceful when not crowded. A wonderful place to take photos. If you are able, climb the inside staircase in the old lighthouse to explore the rooms."], ["Reviewed July 28, 2017", 4.0, "Amazing views", "The history of the lighthouse is interesting to learn about, but nothing beats the views from the area around the lighthouse. Ocean for miles!"], ["Reviewed July 24, 2017", 4.0, "Breathtaking views", "Whenever I have friends in from out of town, I bring them to see this lighthouse. It's on the property of the Cabrillo National Monument and close to Fort Rosecrans National Cemetary. All three sites have excellent views of San Diego Bay and the Pacific Ocean as they're on the Point Loma peninsula. At the lighthouse itself there are several signs about the history of the lighthouse as well as the light, which is amazing. Take several hours here and walk the trails, then drive down to the new lighthouse (which is inaccessible to the public because it's on Coast Guard property) and check out the tide pools. This is a great place to visit, even if it's not sunny.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Beautiful!", "A must see if you are a enjoy visiting lighthouses. Sweeping, picturesque views of the Pacific from this park."], ["Reviewed July 19, 2017", 5.0, "Love it!", "One of my most favorite lighthouses! Not only is it a beauty but the views of San Diego and the ocean cannot be beat! Plus you can also visit the Cabrillo Monument and Ft. Rosecrans on the drive out to the end of Point Loma."], ["Reviewed July 18, 2017", 4.0, "Very cool!", "This is inside Cabrillo National Monument, so you'll have to pay to go in, but it's worth it! A very cool old light house with lots of info and great views!"], ["Reviewed July 13, 2017", 5.0, "Great Vistas of San Diego and Beyond", "This is a cool little place to visit when in San Diego. You have to drive to the end of Point Loma and pay parking/entrance fee. The seagulls up here are fearless and will eat your lunch out of your hand so watch out. the light house is turn of the century and has an interesting history. We saw whales and dolphins below from the vista point.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Historic site...interesting", "This is inside Cabrillo National Monument. Nice little light house (not very tall, but it sits on a high bluff.) They have it furnished the way it would have been many years ago. We enjoyed it."], ["Reviewed July 10, 2017", 5.0, "Great visit to light house and tide pools", "Kids 6 and 8. Loved the tide pools. We checked the tides to time our visit. The kids did like the old light house and display. We then visited the museum. Good experience for all."], ["Reviewed July 8, 2017", 4.0, "Beautiful City View from across the water", "This place closes early, 5pm. The first day we stopped by, it was closed. We though we could just snap some photos outside the light house when it was all lit up, but you can't get close enough to do that. It's all fenced up way back to the road. In Maine, we can still go see the light house, climb on boulders beneath it to take picture of the sunset over the ocean with the light house lit up. It was so pretty, so we thought we could do the same but not the case. Don't waste your time going there after 5pm because you can't really see the light house. It's not worth the long drive down there. You could visit here first, and after it's closed, go see the sunset at Sunset Cliff toward the opposite end of the lighthouse. It could be a 3-hour wait.\n\nThe second time, we got there late afternoon, so we didn't get to see everything and rushing through. The lower section closed at around 4pm, so, we missed that. We only have 4 days in San Diego, so we can't keep driving there. There is a $10 entrance fee. The views from here of the city is spectacular. You could see the navy base and Coronado Island on the other side of the water. I assume that it's not worth making the trip there on a cloudy day if you can't see the skyline. There has to be a place nearby where you can see the lighthouse lit up at night that we're not aware of.\nShow less"], ["Reviewed June 1, 2017", 4.0, "The real deal.", "Toured the inside of the lighthouse to see how the family lived inside of this charming old structure. Take stairs up to the top inside. The real deal."], ["Reviewed May 30, 2017", 4.0, "Visit Cabrillo and the Lighthoust", "Lighthouse is in the Cabrillo location, so you pay $10/car. Interesting lighthouse history. Building is restored and open to visitors. This is definitely worth a tourist hour."], ["Reviewed May 27, 2017", 5.0, "Whale watching from the Point", "Well kept grounds. A little pricy charging parking. You can get a State Park pass that should work at any park around the USA. Interesting history museum."], ["Reviewed May 16, 2017", 5.0, "A Great Place for All", "A great place with alot of history. A must see for all ages when you visit San Diego. Easy access with plenty of parking. Wonderful views!"], ["Reviewed May 14, 2017", 4.0, "Beautiful spot on your lighthouse tour", "Visiting the Cabrillo monument you have a beautiful view of the Point Loma Lighthouse. The history plaque at the monument provides necessary details & when you drive down to the tide pools you understand there has been a new lighthouse built in addition to this historic one.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Love the history of the place", "Anytime I'm able to travel sans children I get to enjoy these types of sites so much more. It was nice to be able to take the time to read about the history of this beautiful spot of the world."], ["Reviewed May 10, 2017", 5.0, "Weekend trip!", "A look into the past! Lots of antiques to give you that old time feeling. Perfect for a family weekend drive trip. The views are just beautiful. Bring a nice camera to capture the nature beauty."], ["Reviewed May 3, 2017", 5.0, "Small but beautiful", "Nice historic display. Grounds are pretty, but are better when flowers are in bloom. Wish you could go all the way to the top"], ["Reviewed May 2, 2017", 5.0, "Great views - well worth the drive!", "It was great to see one of the oldest light houses in California, and the keepers quarters which were maintained the way they were at the time lighthouse first opened. The history of the place was fun to read, and the views were amazing! Well worth the ride.\nShow less"], ["Reviewed April 30, 2017", 4.0, "Beautiful View!", "Lighthouses are all about the view and history. Here you can definitely learn about the history of families who lived here and the work of a lighthouse worker. It is not an easy job, but a very important one !"], ["Reviewed April 19, 2017", 4.0, "What a View", "this is well worth the trip it is a long ride and you will walk a lot but the view alone is worth the walk"], ["Reviewed April 18, 2017", 5.0, "Breathtaking views", "Take a ride to Point Loma. Along the way is the Military Cemetary, reminiscent of Arlington with it's neat rows of headstones. The area around the lighthouse has an observation area that you can view the Navy Base in Coronado and you can see Mexico and some small islands off the coast from there as well. This is part of our National parks system, so there is admission.\nShow less"], ["Reviewed April 17, 2017", 4.0, "Historic lighthouse, tide pools and amazing views", "This part of San DIego is a must see. I always take visitors here for a great view of dowtown San Diego, Coronado and the coastline. There is an entry fee as it is a state park but you can get a year pass which is good value for money.\nThe lighthouse is interetsing to see, if you can join a guide as he/she describes the conditions for the lightkeepers family and the conditions they had to endure, it adds so much more to the experience.\nYou might be lucky enough to see seals from the coastline, you can take the little bus down to the water and spend some time peering into the tidepools.\nAt the visitor center there are often local guides giving talks about local wildlife or early settlers.\nThere are toilets, a few seats to enjoy a quick snack, telescopes to see downtown San Diego better and an area to watch the ships sail past below you.\nShow less"], ["Reviewed April 16, 2017", 3.0, "It's a Lighthouse. What More Is There to Say?", "A functional lighthouse serviced by the US Coast Guard at the end of Point Loma. Unless you are a true light house afficianado there is not much to see."], ["Reviewed April 14, 2017", 5.0, "Amazing scienic views and walks", "We decided to take a ride to Point Loma to take a look at the city form the perspective above Point Loma. What a surprise this was! The city views were OK, but the views of the ocean and the beautiful landscape was incredible!! Highly recommended.\nShow less"], ["Reviewed April 12, 2017", 4.0, "Nice", "Located in Cabrillo National Park, a nice place to check out. Nice views, nice walkways and the lighthouse has some good history."], ["Reviewed April 10, 2017", 4.0, "A DISTINGUISH HISTORICAL BEACON", "Old Point Loma lighthouse, a familiar and best known landmark, sometimes also is incorrectly referred to as the old Spanish lighthouse. It perched atop the southern point of San Diego and is 422ft above sea level of which unfortunately low fog and cloud often obscured the beam of the lighthouse for ocean-going vessels. The Old Point Loma lighthouse was put out of commission in 1891 when a new and better one was built. Nowadays the refurbished lighthouse which is listed on the National Register of Historic Places, is partially open to the public and is located with the Cabrillo National Monument\nShow less"], ["Reviewed April 7, 2017", 4.0, "Sightseeing", "It is out & up on the tip of the Point Loma finger. Military free since it's a Nat'l Park. In the same area is the Cabrillo Monument and the most amazing lookout view ever! You can see downtown San Diego, the North Island Naval Air base. You can also see for miles around. While at the Lighthouse you will be able to look South & West over the Ocean. There is a history theater as well as a gift shop. You can also look down where the Navy trains porpoises. Pretty amazing.\nShow less"], ["Reviewed April 4, 2017", 4.0, "Well presented historic sight", "We visited the lighthouse as part of a trip out to the Cabrillo National Monument. It's well presented and a great piece of San Diego's history to visit."], ["Reviewed March 29, 2017", 5.0, "Wonderful views - great place to walk.", "In Cabrillo National Monument Park, the lighthouse is a great place to walk surrounded by the entrance to San Diego harbor, great views of the city and the ocean, with trails leading down to the water's edge."], ["Reviewed March 28, 2017", 5.0, "Worth a Visit!", "The day we were there the lighthouse was open to the public. It was very interesting to see the various displays as well as the folks dressed in period costumes. We received a handicapped pass at the gate so we were able to drive right up to this beautiful place.\nShow less"], ["Reviewed March 27, 2017", 4.0, "Beautiful view", "The best part about this lighthouse is the view once you climb the hill. Although you are allowed to go in the small lighthouse and climb to the top, it was very crowded when we were there and the stairs are too narrow for people to pass. I was essentially stranded at a small landing for a while. There was no air flow. I literally felt claustrophobic (doesn't happen to me often) and had to get out of there. So if you are planning to climb the lighthouse, be sure to determine how many people are already up there or on their way down!\nShow less"], ["Reviewed March 24, 2017", 4.0, "Decent but a little hyped", "We climbed up for basically nothing. You pretty much relish the view from Point Loma and can look at and admire the lighthouse for what it stands for - all those years gone by."], ["Reviewed March 23, 2017", 5.0, "very nice little lighthouse", "We loved the Point Loma location. Very peaceful and very pretty. We looked around and took lots of nice photos."], ["Reviewed March 20, 2017", 5.0, "Point Loma", "Great historical place to visit. Nice trails to take you to different viewing areas. A great place for people of all ages. The views are spectacular!"], ["Reviewed March 20, 2017", 5.0, "Great piece of history", "This is a great point of US history in the tucked away corner of Cabrillo Ntl. Monument. Well worth the visit"], ["Reviewed March 17, 2017", 5.0, "Cool History and Great Views", "We visited the Lighthouse after having an Uber driver recommend the views and history as a \"must-see\". Even with fog, this is still a cool thing to see. Lots of history and only $5 a person if walking/biking or $10 per car if driving. Beautiful views even in the fog.\nShow less"], ["Reviewed March 16, 2017", 5.0, "Even in the Fog!", "Rode a rented bike out here on a day with fog. The sun tried to come through at times which made the area even more beautiful. Great views of the bay and ocean. I nice lighthouse."], ["Reviewed March 15, 2017", 5.0, "Lovely elevated view sea and San Diego", "Lovely elevated view sea and San Diego. Great view of city of San Diego Tour old lighthouse and surrounding hillside. Admission $10."], ["Reviewed March 13, 2017", 5.0, "Fabulous View", "We loved all we found on Point Loma. The views are wonderful. There are many naval ships to watch, Coronado Island and its bridge to view, and the city spread out below you. It is a wonderful place for a walk. It is easy to navigate (a bit hilly), very clean, and there is lots of learn if you are interested.\nShow less"], ["Reviewed March 13, 2017", 4.0, "Well explained", "While going up the lighthouse is a bit tight and you don't see that much more, the accompanying displays and models make it a very interesting visit."], ["Reviewed March 10, 2017", 5.0, "Great views", "You can tour the lighthouse and walk throughout, but can't go all the way to the top. Interesting that this wasn't a very useful lighthouse because of how high up it was built. Volunteer was very informative. Enjoyed very much!"], ["Reviewed March 10, 2017", 5.0, "Absolutely stunning views!", "We visited the Lighthouse and Point Loma, and we are so glad that we did. It was recommended to us by two US Navy sailors that we met during our visit of San Diego. The view of the ocean and mountains from Point Loma is just stunning and the history and details of the lighthouse itself are amazing and interesting. You get to see an actual lighthouse lens with its thousands of mirrors that lit up the Point during the years it was in service and learn about the life of the light house keeper.\nShow less"], ["Reviewed March 9, 2017", 5.0, "Two for the price o fone", "The light house is part of the Natl park system. To get to it you pass an impressive military installment complete with a beautiful and humbling military cemetery. Cabrillo point is here also."], ["Reviewed March 9, 2017", 5.0, "BEAUTIFUL SITE OF ORIGINAL LIGHTHOUSE WITH MUSEUM", "A delightful walk up to the restored Lighthouse. Visit the keeper's home restored to 1892 style and adjoining Museum displaying the Lighthouse lenses."], ["Reviewed March 6, 2017", 4.0, "Beautiful view", "If you need a moment just to get pure air in your lungs or a relaxing moment visit this place beside having a breathtaking view you can also know more about the lighthouse and how living there it was 😊"], ["Reviewed March 5, 2017", 5.0, "One of the best views in San Diego", "It would be hard to find a better view of San Diego and of the Bay area. You can watch ships sail in and out of the protected bay, including submarines."], ["Reviewed March 5, 2017", 4.0, "Great views", "We visited this as part of Cabrillo National Monument tour. Interesting enough, but lots of other things to see as well. There is the assistant keeper's quarters and lighthouse exhibit. If you like walking around there is the 2.5 mile roundtrip Bayside Trail. Also a short walk from Visitor's Center to see the Cabrillo statue, coast defense exhibit, the Kelp forest and the overlook for viewing grey whales on their yearly roundtrip migration of 12,000 miles. There are also fascinating tide pools and you are allowed to walk and picnic on the beach. We used our National Pak Pass to get in free. Well worth the journey.\nShow less"], ["Reviewed March 4, 2017", 5.0, "Part of the Cabrillo National Monument site. Great views!", "Great views of the city, the ocean, the bay, and Coronado Island. History of the light house, whale watching area, military reservation, and discovery of San Diego by Cabrillo."], ["Reviewed March 4, 2017", 3.0, "If You Like Lighthouses, Stop By Here", "The original lighthouse is in part of the Cabrillo NM complex. So if you don't have a park pass you'll have to pay an entry fee. Once here, though, you can explore the lighthouse and the keeper's quarters, hike on the bluff, and then go down and search the tidepools below on the ocean beach.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Bit of a walk, but worth it!", "The Old Point Loma Lighthouse is located on the southern tip of the Point Loma peninsula, near the Cabrillo National Monument. Parking is free after paying a $10 per car entrance fee to the Cabrillo National Monument - you might as well check that you while you are there. (You will receive a brochure with info on both places.) The trail to the lighthouse is paved, but is (of course) uphill. Wen you reach the lighthouse, you can walk through part of the keeper's quarters, and enjoy a museum on the workings of a lighthouse. The views of the ocean and San Diego Harbor are amazing.\nShow less"], ["Reviewed February 24, 2017", 5.0, "3 in 1 ATTRACTION!!! Wonderful History of CA!! Spectacular Views!!", "The lighthouse is all part of the Cabrillo National Monument. The history of lighthouses in CA includes the lifestyles of the keepers, and those with families is just fascinating. Cabrillo, the explorer, is part of the history too, as he discovered the area. If history is not your thing, forget about it, and just take in the MOST magnificent views IMAGINABLE!! Don't miss this three in one attraction!!\nShow less"], ["Reviewed February 19, 2017", 4.0, "Interesting History, Beautiful Spot", "My biggest issue with the Point Loma lighthouse was pushing a stroller up the hill! But for those who aren't lazy like me, this provides some really fantastic views and interesting insights into the history of the Bay. It's a beautiful setting and there are some interesting displays as well.\nShow less"], ["Reviewed February 13, 2017", 4.0, "Fantastic spot for an afternoon stroll and to enjoy a wild sea!", "As a local who lives within bike riding distance (4-miles away), I buy the annual pass every year. The cliff-top vantage points are one of my favorite spots to go when I have guests in town, to quietly reflect on life's adventures and to dream about the future.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Great veiw from a historic site", "It's amazing to consider this spot was once so remote when the lighthouse was in active use. Now it's an easy drive and a short walk to learn about the maritime history of the area and to enjoy the fabulous views of San Diego harbor and the Pacific Ocean. Well worth the visit (there is a fee to enter the Cabrillo National Monument).\nShow less"], ["Reviewed February 12, 2017", 4.0, "Beautiful View of the Bay", "This is the second time Ivisited the lighthouse and museum enjoying the walk and view and the history provided of the Bay area."], ["Reviewed February 12, 2017", 5.0, "serene", "Serene,beautiful and informative. Overlooks all of San Diego and is close to the tide pools which is a great family experience."], ["Reviewed February 11, 2017", 5.0, "Cool visit", "What a neat lighthouse to visit - you can really learn about lighthouse living here. Plenty of other great things to see around here also. Highly recommend visiting here."], ["Reviewed February 7, 2017", 4.0, "At Cabrillo National Monument", "While visiting the Cabrillo National Monument stop by this historic lighthouse for a half-hour visit. You can climb the short steep stairs to the top, see a nice display of lighthouse lenses and technology, and see the few rooms that the lighthouse keeper and family lived in. The couple buildings on display have been nicely restored. From the walkways nearby there are nice views of the harbor and downtown SD, as well as out over the Pacific. Note that this lighthouse has been out of service for many, many years as the site, although high, was not a good one for a lighthouse. The new-er lighthouse is down the hill at sea level on the point.\nShow less"], ["Reviewed February 6, 2017", 5.0, "Maritime HIstory", "A visit to the US coast is not complete with seeing our famous Lighthouses. This one is charming and the setting ideal"], ["Reviewed January 30, 2017", 5.0, "Might As Well", "If you drive out to Point Loma to visit Cabrillo National Monument you might as well take the time to visit the Old Point Loma Lighthouse...., absolutely great views."], ["Reviewed January 27, 2017", 4.0, "Love to Visit", "I love to visit Point Loma Lighthouse, the view is amazing and it is a little piece of history. Nice walk, plus beautiful scenery, if you feel like a longer hike, you can walk down to the tide pools and see the critters in them."], ["Reviewed January 26, 2017", 5.0, "Cool learning experience and great views of San Diego", "Exactly what we expected: a chance to learn and explore a lighthouse and how the people that manned it likely lived. Good views of San Diego as well."], ["Reviewed January 23, 2017", 5.0, "stunning views", "We were able to take some beautiful pictures. The road was picturesque and we stopped many times along the way. Well worth the trip."], ["Reviewed January 18, 2017", 5.0, "Amazing!", "We loved every aspect of this monument. The history, the view, the architecture! I learned a lot about lighthouses in general as well as the local history."], ["Reviewed December 31, 2016", 5.0, "Great View and Fun Memories", "We always take time to visit the Lighthouse and the tide pools while in SanDiego.\n\nMy kids are over 18 and I still worry about them slipping off the edge into to ocean.\n\nThis is a great place to bring your kids for pictures and family memories.\n\nWe always start at the pools below and then explore the lighthouse, museum, and bay/city views above.\n\nGreat memories are always made!!!\nShow less"], ["Reviewed December 31, 2016", 5.0, "Beatifull views!", "This is a great place to visit specially if you love light houses. To my surprise the light house I quite small. It great to visit specially since you get a great view of the ocean!"], ["Reviewed December 30, 2016", 5.0, "GO see for the views and history", "Loved walking along beach and seeing view. Interesting history on the area, light house and views of San Diego."], ["Reviewed December 26, 2016", 5.0, "Perfect timing", "Definitely worth the stop.\nThe Lighthouse is ONLY open for tours, 3 days out of the year. It was our lucky day as we arrived on one of the 3 days. If I remember correctly its (1) the Anniversary of the lighting and (2) extinguishing of the lighthouse. (3) Also the Anniversary of the National Parks.\nViews are breathtaking !!!\nShow less"], ["Reviewed December 26, 2016", 3.0, "A lighthouse like any other", "Just one of many features on a beautiful walk along the coast. Obviously provides a vantage point to view the ocean but otherwise nothing special to report."], ["Reviewed December 18, 2016", 4.0, "Great views of and around the Lighthouse", "We have seen a number of lighthouses in our travels. The usually do offer great views, since being seen and seeing is part of their purpose. The historical info and other visitor information was good."], ["Reviewed December 16, 2016", 5.0, "Beautiful", "Beautiful place. Very Pretty location. You can walk around beyond the lighthouse and discover the area."], ["Reviewed December 12, 2016", 3.0, "I guess you need to be a lighthouse fan", "I guess unless you're a hardcore lighthouse fan, it seems to be pretty ordinary. The lighthouse is pretty small. It does have well preserved living area and some exposition about its history but I wouldn't say it's worth a trip."], ["Reviewed December 12, 2016", 4.0, "HISTORIC TOUR", "The Old Point Loma Lighthouse is a well maintained and interesting historic site. It sits atop a hill overlooking the San Diego harbor. You are able to enter the lighthouse and see the way the lightkeeper lived."], ["Reviewed December 10, 2016", 4.0, "Historic site", "This lighthouse has been around for many years. The exhibit explains the use and how the light worked, as well as how the light house keepers would have lived. An interesting place to see"], ["Reviewed December 7, 2016", 5.0, "Camera worthy", "Perfect, safe spot to take city view photos and learn some interesting facts. The lighthouse is the coolest. It has nicely preserved historical items. Be sure to wear walking shoes! There is a fee for vehicles to park, city bus goes there, or you could ride a bike.\nShow less"], ["Reviewed December 7, 2016", 3.0, "Small Lighthouse, More to See Outside Than Inside", "This is part of Cabrillo National Monument which is a very busy place. The lighthouse looks large from outside but they don't let you go into the rooms so it is quite cramped. The building, such as they let you walk through, is probably a comfortable fit for about 12 people. The small building in back has more history and more interesting things to note, plus the old lighthouse lens that you can get close to (can't go to the top level in the lighthouse itself). It's worth about a 15 minute stop at Cabrillo National Monument.\nShow less"], ["Reviewed December 2, 2016", 4.0, "Magnificent views!", "The lighthouse is really small and you can learn about lighthouse technology and also how the keeper and his family lived. However, the really outstanding feature is the panoramic view of the Pacific (south and west) and of the San Diego skyline."], ["Reviewed December 2, 2016", 5.0, "Quaint and Charming", "We loved visiting the lighthouse. So much history and being able to go up inside and see how the lighthouse keeper and his family lived many years ago was very interesting. Exploring the little garden that the current groundskeepers plant was also very exciting to me because I love vegetable gardens. The views from the lighthouse are also very spectacular. Definitely give this one a visit. Make sure and walk down the path behind the lighthouse to learn about the whale migration and also see more spectacular views.\nShow less"], ["Reviewed December 1, 2016", 4.0, "Full of history", "Visit the Point Loma Base, and you'll find lots of hidden treasures, of course excluding the lighthouse."], ["Reviewed November 27, 2016", 5.0, "Historica San Diego", "Panoramic views of the harbor and westernmost coast. Plenty of room to roam with kiddos/visitors or alone. WONDERFULLY kept grounds and structures. Well worth it!"], ["Reviewed November 27, 2016", 3.0, "A nicely preserved lighthouse", "I love photographing lighthouses and visited this one. It is not that photogenic but is still worth a visit. Its location is great and the surrounding areas are worth a visit."], ["Reviewed November 27, 2016", 5.0, "Cool Lighthouse", "If you like lighthouse this one is cool for its views of the coast line, very easy to get to and great views"], ["Reviewed November 22, 2016", 5.0, "beautiful view.", "Recommend this tourist spot to everyone. This is a great place to spend the day. It is part of a bigger plan. Stop at the Visitors center. Look out over the bay and take pictures of San Diego, then walk over to the statue and hopefully see some Military boat coming and going. Then walk up to the light house. Other things to do while at the light house there are some beautiful ocean cliffs to see pack a lunch and then go over and remember our military at the cemetery. plan on staying a while and relaxing.\nShow less"], ["Reviewed November 14, 2016", 4.0, "if you have extra time in San Diego, don't miss this visit and view", "this is the best view in San Diego. Be sure to go on a clear day. The light house is decorated in the style of the 19th century and is very informative about the life and life style of the 19th century light keepers. A previous visit to Old Town will give you an idea of how far the children who lived in the lighthouse had to travel to school. Children will love this site.\nShow less"], ["Reviewed November 13, 2016", 5.0, "Nice views from the Point", "Point Loma has so many spectacular views, the Lighthouse is just one of them. You can spend hours on the point, walking. Check out the small military museum."], ["Reviewed November 12, 2016", 4.0, "Interesting history", "The old point Loma lighthouse is a very interesting example of a working lighthouse and home. The home part seemed a lot more comfortable than I would have imagined it, but the history of this light house and the keeping of it was fascinating. I would never have imagined that keeping the light going each evening would be a full time job every day. But when you see the size of the light and understand that the glass had to be polished continuously, you can understand the time requirements.\n\nI was disappointed that we couldn't go all the way up into the lighthouse tower itself, but that only detracted slightly from the visit.\n\nThis lighthouse is accessible to everyone but does have steps up into it, as well as steps inside. Allow a few hours to look at the light house and wander some of that various trails around the peninsula. The views are stunning.\nShow less"], ["Reviewed November 11, 2016", 4.0, "Interesting", "Great view of the coast, ocean and interesting information on the light house; self guided. Easy to get to."], ["Reviewed November 8, 2016", 4.0, "Well preserved", "A well preserved site that offers fantastic views of the sea and land. The buildings are nicely presented with good information explaining the role played by the lighthouse and its keepers & their families. Nice place to chill out."], ["Reviewed November 7, 2016", 5.0, "Original lighthouse.", "This is the original lighthouse for the bay. Great history and story of the caretakers. Beautiful view of the whole area from the top of the hill."], ["Reviewed November 4, 2016", 4.0, "Historic Lighthouse", "This is located by the Cabrillo National Monument. Interesting exhibits are located inside the building. There is plenty of parking nearby. Great views of the ocean and San Diego. There are also a few public restrooms available."], ["Reviewed October 31, 2016", 5.0, "It is beautiful and the views amazing.", "I love lighthouses and am always delighted to stop and visit this one. It is a cute one and a good little tour of the inside. All the surrounding grounds are gorgeous and you can see forever, if the weather permits. If it is foggy, and you just want to visit the lighthouse, fine, but if you want views, wait until you have a clear day.\nShow less"], ["Reviewed October 29, 2016", 4.0, "A well short-used preserved 1840's lighthouse.", "As one of the ironies of history, apparently there were more ships running aground entering the San Diego Harbor after this lighthouse was built than before. The light house is on a cliff, roughly 300 feet or so above sea level. Sailors would apparently be looking \"up\" and run aground onto the shoreline below. For this reason, after a few years of service, the coast guard erected a new light house on the shoreline below.\nShow less"], ["Reviewed October 26, 2016", 5.0, "Great views from a historical location!", "A must see out on Point Loma. There are many things to see along the drive to the lighthouse. There is a ton of history attached to the lighthouse and surround attractions."], ["Reviewed October 24, 2016", 4.0, "Good Example of Old Lighthouse", "This is all part of Point Loma and Cabrillo Park. T he lighthouse is not a tall one, but has several rooms on display showing what it was like in years bygone. Of course the ocean and bay views are spectacular."], ["Reviewed October 22, 2016", 5.0, "Amazing views", "It's about a 10 minute walk from the parking lot to the light house. This light house is much shorter than what I'm used to on the east coast but since it is on a cliff it doesn't need to be. The views here are amazing.\nShow less"], ["Reviewed October 22, 2016", 4.0, "Worth a Visit", "It is a short walk to the lighthouse from the visitors center parking lot. There are great views of the harbor along the way. The lighthouse has a fresnel lens display, a small vegetable garden and recreated living quarters."], ["Reviewed October 21, 2016", 5.0, "Great spot to visit and perfect for a picnic", "This is part of the admission fee to the park at the end of Point Loma. Lots of interesting information and a must-see if you are a lighthouse enthusiast. Even if you aren't, though, it's a great spot to visit. A wonderful place to get great views of San Diego Bay, or to look out to the Pacific. Great for a picnic and lovely walks - but nothing extreme. You COULD do some heavier walking/hiking on some of the trails or just keep it light and easy. :)\nShow less"], ["Reviewed October 21, 2016", 4.0, "Interesting historical monument", "We visited this historic lighthouse at the end of Point Loma. From the hill top you overlook the Pacific and the Coronado island on one side and San Diego harbor on the other. On a clear day there are great views of the mountains and Tijuana. Grey whales can be seen from the point but unfortunately none were seen whilst we were there. The lighthouse includes two buildings: The lighthouse itself and a small museum. The lightkeepers's living quarters have been restored and provides a look at the lives of the keepers families in the nineteenth century. A spiral staircase gets you close to the actual lamp and lenses.\nClose by is the former oil storage building, now converted to a museum that details the history of the Point Loma lighthouse, the evolution of lighthouse technology, and the history of various California coastal lighthouses. There are multiple bathroom facilities around the visitors center and lighthouse area along with a short film about the area and a shop to buy related things.\nShow less"], ["Reviewed October 15, 2016", 5.0, "Another great afternoon activity!", "$10 to get into the national park for a week entry. Definitely worth it only if you have a couple hours to spare. Went to the visitor center first and timed it right to get in one of the parker Rangers tour. The actual light house isn't too big but neat to see how they tried to keep it historic. The tour we were able to see the basement which a normal visitor would not see. They've done a good job and keeping the lighthouse and surrounding area well maintained.\n\nStop by the tide pools and cemetery on your way out. Spectacular views!\nShow less"], ["Reviewed October 9, 2016", 5.0, "Wonderfully well kept and interesting historical site", "The lighthouse has been restored to show the conditions the lighthouse keeper lived in. The views are amazing!"], ["Reviewed October 8, 2016", 5.0, "Day trip", "First I checked out the Monument, then the light house. The very top was closed but you can see in all the rooms and read about what it was like when it was operated. Tip for the staircase picture- put your phone in selfie mode and put it on the floor pointing toward the ceiling :)\nShow less"], ["Reviewed October 4, 2016", 5.0, "Unique breathtaking views", "Worth a special trip. Views of the pacific ocean and all of San Diego's harbor. Leave the selfie stick home and experience it first hand."], ["Reviewed September 30, 2016", 5.0, "See all over San Diego", "I have relatives from PA that love this place, so much that I sent a skyline picture of San Diego from the Light House as a Wedding Gift. There are interesting short movies, a small museum and a beautiful walking path. You will love it."], ["Reviewed September 29, 2016", 5.0, "Beautiful scenery", "We stumbled upon this place and it was great. the landscapes were beautiful and we found the history exciting."], ["Reviewed September 28, 2016", 5.0, "If you go to San Diego, you must go to the Lighthouse", "This is a historic place, and it has probably the best view of the entire city or San Diego, the bay and the ocean. Go here first, and then you will know where you are traveling as you see the many sights of San Diego. Getting there you drive through the military cemetery, at once beautiful and sobering as you think of the sacrifices of the many for us. The lighthouse stands tall over all, a symbol of lifesaving for mariners that still ply the waters you can see stretching to the horizon. Very well kept historical monument.\nShow less"], ["Reviewed September 28, 2016", 4.0, "This is a great place to see", "Lots of history. The scenery is Beautiful. And great for kids. And close to the ocean. Easy drive from San Diego."], ["Reviewed September 27, 2016", 5.0, "Great Views of San Diego", "All part of the point loma experience, where you visit the light house, Carillio Monument, and the lower sections of the point that you can drive or walk down. Great views of the San Diego bay and out to the pacific"], ["Reviewed September 25, 2016", 5.0, "Amazing view", "First, I rode my bicycle up to the park and knew that I'd need to come back to explore the area. There is an outstanding view from the lighthouse overlooking all of San Diego. The tidal pools below where a cool to walk around."], ["Reviewed September 24, 2016", 5.0, "The whole point is a must see!", "This was one of the favorites of our trip. The views from the point are amazing and the park is well kept."], ["Reviewed September 23, 2016", 4.0, "Great views and history", "A nice stopping point to see some history and views of San Diego's bay. Very interesting displays and the docents on duty were informative and very knowledgeable about the light house."], ["Reviewed September 20, 2016", 5.0, "Great lighthouse", "A must see for lighthouse fans and photographers. Good views of the light. Museum inside with old Fresnel lens. Stunning views of San Diego, harbor, naval bases."], ["Reviewed September 18, 2016", 5.0, "Small Lighthouse with a Spectacular View", "A trip out to the far western end of Point Loma is worth it, if only for the view. The lighthouse is small and well maintained, but surrounded by stunning scenery. This is a National Park with an entry fee of $10 per car, but if you're lucky enough to be a senior with a park pass, it is free!\nShow less"], ["Reviewed September 18, 2016", 4.0, "A bit of history", "The lighthouse is small and takes only a couple minutes to visit but the information about its history is worth reading. It's worth a stop in while you're visiting the monument and the area in general."], ["Reviewed September 14, 2016", 4.0, "Not much to see, but glad to see it", "Very tiny little hose with a small staircase, not really much to look at, but was historically important to San Diego shipping"], ["Reviewed September 12, 2016", 3.0, "Part of the Cabrillio National Monument", "Lighthouse sf average for a good national park lighthouse. It is located on the hill above the Cabrillo statue. Take the time to walk up there and see it. The light tower was not open to the top."], ["Reviewed September 11, 2016", 5.0, "It's a lighthouse", "Another lighthouse to check off our list. Beautiful views in all directions. Quiet and peaceful. Great place to just \"hang\"."], ["Reviewed September 11, 2016", 5.0, "A beautiful place", "A National Historic site. A great view of San Diego harbor. A gift shop with bathrooms. Lots of plants and flowers. Worth the trip. An admission charge for the car load."], ["Reviewed September 10, 2016", 5.0, "A piece of America's history...", "Beautiful lighthouse located within the Cabrillo National Monument area. Nice walkway up to the lighthouse. Check out the keeper's quarters for a history lesson on the lighthouse. Great experience!"], ["Reviewed September 8, 2016", 5.0, "Always Worth a Visit", "The view is the best in all of the San Diego area, especially after a rare rain storm. The military history of Ft. Rosecrans is also of interest, and the lighthouse story informative. I believe they do tours of the coast artillery emplacements once a month, and whale watching is fun at the right time of the year.One can also walk to a rocky shore, or visit the tide pools.\nShow less"], ["Reviewed September 8, 2016", 5.0, "Interesting living history experience", "The people dressed up as historic characters are fantastic it gives you a great feel for what life was like in point loma"], ["Reviewed September 7, 2016", 4.0, "Cheap activity", "Beautiful views. history lesson, only $10 per car and it's good for 6 days! There is a gift shop and bathrooms as well."], ["Reviewed September 4, 2016", 5.0, "Well maintained, beautiful to tour, great photo spots,", "This was something we unexpectedly did with another couple and were very glad. It did cost $10 to get into but the drive up to it was very beautiful with the cemeteries and the view of the bay. The facilities were very well kept up and clean. The lighthouse was a wonderful history lesson from it age of time. We took our time and read a lot of the postings and then toured the original lighthouse and saw there living quarters, kitchen, parlor and bedrooms which are all dated from the 1800's. This was well worth the time to drive up and see.\nShow less"], ["Reviewed August 30, 2016", 5.0, "In beautiful condition. NPS Rangers great!", "Lighthouses are always fun to visit and in beautiful places, with (normally) sensational views. This is one of them with National Park Rangers that are more than friendly and prorfessional."], ["Reviewed August 28, 2016", 5.0, "Cabrillo National Monument and Point Loma Lighthouse", "The Cabrillo National Monument is part of the National Park Service. The cost is $10 per car and you have access to the monument, the Old Point Loma Lighthouse and the tide pools as well a couple of hiking trails that wind around the property. Be forewarned - there are lots of military bases in the downtown San Diego area. It looks like you are driving ONTO a base because the road goes past a guard shack with the gates up - this is correct! Your phone map will not steer you wrong in this case. We had an unfortunate map accident trying to find a Rubio's that turns out is on a PX in San Diego and you can literally turn right into the base entrance lane with no prior warning. Anyway, this park is just minutes from the airport and downtown San Diego hotels. The park itself has an amazing view of Coronado, the airport, the harbor and a beautiful of Fort Rosecrans National Cemetery to the North and East. There is a small historical museum, a gift shop, several lookout locations, and the actual Cabrillo Monument. The walk up to the lighthouse is short and easy. The lighthouse is set up as it would have been \"in the day\" and you can climb the staircase up to the second level. There is interesting information and a display of the actual light and gears as well in the building next to the house. To the south is a view of the new light house (USCG property) and Mexico and to the west - the wide expanse of the Pacific. This is apparently on the whale migration trail and they say in February that you can often times see whales. You can drive down the hill to the tide pools and there is a park ranger there to explain if the pools are accessible and what you might see. This section of the coast is bluffs and cliffs - not beach. The pools were closed when we were there but we enjoyed the beautiful views along the bluffs. Great picture taking opportunities. We were there for a couple of hours - an easy morning trip on limited time. On the way back up the point you can drive through the Fort Rosecrans National Cemetery - it too enjoys beautiful views of both sides of the Point and boasts its own kind of precious history. One other note on our hilarious SD adventures - my cell phone started sending me Welcome to Mexico texts while down at the tide pools and my husband's phone on a different carrier did not have reception at all. My carrier quickly corrected that for me but just something to be prepared for so close to the border.\nShow less"], ["Reviewed August 28, 2016", 3.0, "Interesting history, spectacular views", "Definitely worth the drive out - a little history and some spectacular views of the city, Coronado, and the ocean below. Make sure you allocate time for both buildings as the second building (the barn?) is more interesting as it has lighthouse lenses and excellent interpretive information.\nShow less"], ["Reviewed August 28, 2016", 4.0, "Point Loma Old Lighthouse", "Delighted to arrive and find the park was not collecting fees due to the 100 year celebration of our National Parks.\nAnd stupidly, we went on a Sunday - big mistake - so does everyone else.\nBut found the history of it fascinating and coupled with the information on Cabrillo and his discovery of the area and why the new lighthouse was established to be very interesting - very well maintained and well marked. Enjoyed.\nShow less"], ["Reviewed August 26, 2016", 4.0, "Point Loma old lighthouse offers a glimpse into the past", "It was nice to be inside the lighthouse and how people used to live and work in cramped quarters. The surrounding area used for growing food was also impressive. Very educational!"], ["Reviewed August 25, 2016", 4.0, "POINT LOMA HEADLAND LIGHT", "The Old Point Loma lighthouse is located within the Cabrillo National Monument so you will have to pay the NM admission fee to access the lighthouse. Once you park you cross the street and climb uphill towards the lighthouse. Once there you can view the house close up. In addition, a trail runs around the bluff area that affords great views of the ocean and informative kiosks. The lighthouse is not as nice as others on the Oregon/California coast but this one affords great views of San Diego and the Pacific Ocean.\nShow less"], ["Reviewed August 24, 2016", 5.0, "Point Loma Lighthouse", "Interesting and scenic lighthouse. You can go inside to see the quarters of the keepers. Popular tourist area."], ["Reviewed August 23, 2016", 4.0, "Interesting Historic site", "Lots of walking to get to lighthouse. Small historic site. with wonderful views of ocean and San Diego harbor."], ["Reviewed August 23, 2016", 4.0, "Make this a part of your visit to Cabrillo National Monument", "I must have 500 pictures of lighthouses around the world this one is probably in one of the prettiest places high up on the mountain. The view is great of San Diego and the ocean. There is a Coast Guard light just below this light at beach level. There is a museum open to the public but you can't go up to the light.\nShow less"], ["Reviewed August 22, 2016", 5.0, "Interesting History & Beautiful Views", "If you like history or photography - or both! - this is another great stop on your San Diego tour. In one afternoon you can walk Fort Rosecrans National Cemetary, check out Cabrillo Monument, and Tour Old PL Lighthouse! Add to this the photographic opportunist for these locations and the views, and you'd think that was enough ... But wait! You could also come away with family photos that you will always cherish! This is worth the $10 car admission.\nShow less"], ["Reviewed August 22, 2016", 5.0, "Beautiful Views", "Great visit to lighthouse where you can tour inside and see how the people lived. It is well worth the trip for the views alone. Cabrillo Monument is adjacent so plan to see both."], ["Reviewed August 19, 2016", 5.0, "Lovely Small Lighthouse with Great Views", "The Point Loma lighthouse is at the very end of Point Loma - Catalina Blvd on the property of the Cabrillo National Monument. There are some nice walking trails around and you can go inside the restored PL lighthouse. It is darling and has lots of great photo opportunities in and around it. There is always a VERY good breeze up at the top of the cliff so plan accordingly. :)\nShow less"], ["Reviewed August 14, 2016", 4.0, "Should definitely be on your visit list!", "Point Loma is peaceful and beautiful with a great view of San Diego. If you love lighthouses, you shouldn't miss it. And a nice gift shop to get a keepsake of your visit."], ["Reviewed August 12, 2016", 5.0, "Take the Easy Paved Trek to the Lighthouse Landmark", "Set atop Point Loma, the Old Point Loma Lighthouse has breathtaking views of the Pacific and San Diego Bay. The lighthouse with living quarters, complete with furnishings, the vegetable garden, area for collecting water and spiral stairs to climb provides visitors with a good idea of what it was like for the lighthouse keeper to live here while maintaining the lighthouse. Views from inside the lighthouse are as spectacular as from many areas at Point Loma and Cabrillo National Monument.\n\nThe Fresnel lens displays a beautiful colorful prism as light shines through the lens from outside. The original lens was too large and had to be replaced with a smaller version in this original Point Loma Lighthouse. Listed on the National Register of Historic Places this stop on a walking tour of Cabrillo National Monumental is well worth the time. Those with strollers or mobility concerns will not have any difficulty seeing the lighthouse - except the spiral stairs. The lighthouse may be explored in approximately 30 minutes. A treasure, visitors will enjoy the setting, the easy, paved trek to the lighthouse and the wonderful history the 1855 lighthouse provides. Very highly recommended.\nShow less"], ["Reviewed August 11, 2016", 5.0, "Cool vantage point", "You can go in and check out the Old Lighthouse and living quarters. Small museum in out building. Little bit of a walk, but well worth it."], ["Reviewed August 9, 2016", 5.0, "An interesting place to visit.", "This was a good day trip for us. The grounds was easy to get around. The lighthouse was well preserved and interesting. The rooms mad you think how did these people do this?? There were great vistas for pictures . There was a ten dollar charge for a pass but the pass was good for two days.\nShow less"], ["Reviewed August 7, 2016", 4.0, "A must see for lighthouse fans", "It's always enjoyable to see something historic that lit our nations coast lines. The steep staircase to the top of the lighthouse gives you a feeling of how time was back in the day. The rooms are blocked off from plastic restraint but you are able to look into them with no problem. Outside is a garden where the keepers would grow their own food.\nShow less"], ["Reviewed August 5, 2016", 4.0, "You can go to the top at certain times of the year.", "During special anniversary days, you can go inside to the top of the lighthouse. However, be aware that you will have to wait in a long time and you only get a few seconds up there. However, the inside is pretty cool to look at even if you don't get up to the tower.\n\nYou have to pay to get into the National Monument in order to get to the lighthouse.\nShow less"], ["Reviewed August 5, 2016", 5.0, "not to be missed", "educational with rewarding views of the ocean and bay- helps support the national parks too - combine with Cabrillo"], ["Reviewed August 2, 2016", 4.0, "Remembering old times...", "The lighthouse is very charming and well kept. The area has a fantastic view to the city and to Mexico. An important part of the San Diego history."], ["Reviewed August 1, 2016", 5.0, "Beautiful!", "Went here with the family and were so amazed by the architecture and views of the Pacific. It's like a step back in time. The kiddos also enjoyed taking the spiral staircase to the top Although you couldn't see out of the lighthouse, it was still neat to see where the light is at the top of the stairs.\nShow less"], ["Reviewed July 31, 2016", 5.0, "old light house", "One of the historical site inside Cabriilo National Monument. Educational. Awesome view of the oceans and the city of San Diego"], ["Reviewed July 28, 2016", 4.0, "National park", "Interesting to learn of women light keepers. Good access to home, not light itself. Fourth graders can use national park pass if completed online in advance. Seniors can buy a lifetime national park pass for $10 here. Otherwise $10 car."], ["Reviewed July 28, 2016", 5.0, "Make the Drive to Point Loma.", "You will not be disappointed. Entrance to Point Loma is 10.00 dollars, and it is worth every penny. VIEWS without end. The lighthouse is just so full of history ... an amazing history it is."], ["Reviewed July 26, 2016", 5.0, "Great little visit", "This is really a great way to spend a morning or afternoon. Very interesting and they allow total access to all buildings. Very cool"], ["Reviewed July 24, 2016", 5.0, "Have to see!", "Been going there since the 50's. Has changed a lots since then but the views are amazing. There are people dressed up for the time period of the 1880's and the rooms have been restored to show how the rooms would have looked back then. Even has a small garden.\nShow less"], ["Reviewed July 23, 2016", 5.0, "Beautiful Point Loma!", "Enjoyed everything about the Old Point Loma Lighthouse, the very beautiful and scenic San Diego Bay on one side and Pacific Ocean on the other. This is a great way to spend a few hours taking in the History of Cabrillo Monument, along with the beauty of the Point Loma Conservation Area.\nShow less"], ["Reviewed July 16, 2016", 4.0, "Very nice", "This is great. We went in and walked around. It is setup like it was back when it was operational. The history of the families that lived there is interesting. The garden outside is plated with crops just like it was."], ["Reviewed July 14, 2016", 5.0, "Historical interest and natural beauty", "Great place to visit. There is a fee. The views are gorgeous, and the lighthouse set up like it was furnished in the old days. A large visitor center with books and souvenirs is on site. On the road below are tidal ponds to explore. It closes at 5 or so, so don't go late in the day.\nShow less"], ["Reviewed July 14, 2016", 5.0, "Amazing views", "Best part is to be able to see both US as well as Mexico settlements on both sides of border. Nice views of sea and San Diego. Loved the time spent there"], ["Reviewed July 13, 2016", 5.0, "History", "Go back in the past to when candles lit the the pathway for sailors. Except for park entry fee, everything else is free. Great views of San Diego plus history!"], ["Reviewed July 7, 2016", 3.0, "Tiny lighthouse is cute but don't make a special trip", "Very small lighthouse in which they only allow you to see the living quarters of the keeper but you are not actually allowed up to see the light. Probably good because it is very tight in there. It's cute and there are some plaques to read but the view is average and it's not worth a special trip unless you are there to see the Cabrillo Monument and the tide pools.\nShow less"], ["Reviewed July 4, 2016", 5.0, "Go if you like lighthouses", "A nice quiet walk up a hill to an amazing retired lighthouse and spectacular view, in same area as the Cabrillo monument so do it the same day."]]}}