{"Old Town San Diego": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Old Town San Diego", "url": "/Attraction_Review-g60750-d6611940-Reviews-Old_Town_San_Diego-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/34/21/10/old-town-san-diego.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1396"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "A short visit", "While waiting for our La Jolla Beaches tour bus, we briefly walked around the Old Town area. It reminded me of what Tijuana would be like (haven't been there). The shops were very clean, and the \"spirit\" of the area was enjoyable."], ["Reviewed 2 days ago", 5.0, "Great place", "So many wonderful restaurants, and just lots to see and do. We would definitely go back, and wished that we had more time here."], ["Reviewed 3 days ago", 4.0, "Fun for shopping.", "Enjoyed spending a couple of hours here, walking around and shopping for souvenirs. Not too crowded on a Saturday morning ."], ["Reviewed 3 days ago", 4.0, "Great State Park", "This is a great State park with plenty of Mexican restaurants and shops. You also have a lovely church in the middle of Old Town."], ["Reviewed 6 days ago", 5.0, "Have Visited Before, Hope to Visit Again!", "Just wandering the streets of the Old Town area is such a relaxing, pleasant experience. You'll feel (a little) as if you are really in one of the Mexican tourist towns, especially with shopping and restaurant options."], ["Reviewed 1 week ago", 4.0, "Awesome and Cool", "This was a cool trip I took from the Pacific Beach area. By uber it was about 10 minutes. I am really glad I saw this, as it truly does capture the history and origin of San Diego. It mixes mexican culture and the late 1800s westward movement feel (wagons and blacksmiths) and some native american culture. Admission to very mini “museums” ( there were multiple building with artifacts that took approx 5 mins to go through) were scattered as if it was a town. There are also a lot of mexican resturants down the block and slme shops. If youre in San Diego and have time to visit, totaly do so. However in my opinion it is not a “must see”\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Most unique", "Old Town is definitely a little different from the other tourist stops around San Diego. The old fashioned feel is refreshing. Great Mexican dining options and small shops to explore"], ["Reviewed 2 weeks ago", 3.0, "Night Visit for a bit of fun", "I came to Old Town San Diego at night and overall its a mock up of an old US town. If you are looking for something very historical this isn't for you, if however you are looking for a few hours of fun with some nice restaurants this isn't a bad choice.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Be transported back in time!", "A lovely place to sight-see in San Diego! Definitely touristy, but gift shops have unique items that make wonderful gifts. Nice to walk around the old buildings!"], ["Reviewed 2 weeks ago", 5.0, "Great dining, shopping, and fun!", "On our last day in San Diego, we decided to take Lyft from our downtown hotel to Old Town and we are so glad we did! We had a great lunch there, and spent several hours exploring the quaint shops and museums. Definitely a highlight of our vacation.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Back in time", "I really liked Old Town San Diego! Although some stores carry the usual tourist Knick knacks there are a few that make you feel you're back to the 1800 hundred. The houses are very well preserved, I'd recommend the McCoy house, you learn a lot about southern California history\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Historical site", "This is the place to go to see the birth place of San Diego & to learn more about its roots, founders & history. Great place to shop at local merchants & local tastes."], ["Reviewed 3 weeks ago", 5.0, "Very clean city", "Very interest city. We took the trolley to visit all the different section of town. You can get off and on as you please."], ["Reviewed 3 weeks ago", 4.0, "Historical place", "The Old Town is one of the must-visit places of San Diego. You can spend some time at the Historical Park and also drive around the area to get a glimpse of history."], ["Reviewed 4 weeks ago", 4.0, "Go at your won pace", "Our family enjoyed the exhibitsmand shopping, and strolling through this historic old town was wonderful! The Tin shop was a hit, and souvenirs were available everywhere."], ["Reviewed 4 weeks ago", 4.0, "nice for the saturday artisan's market", "super kitschy tourist zone, but has some interesting history nonetheless. Lots of touristy looking restaurants and shops. The artisan craft stands were really nice."], ["Reviewed January 22, 2018", 4.0, "Great resturants", "What a nice place to stay and eat, close to the San Diego zoo, aquarium, and a beautiful drive to the zoo. The people are really friendly and can't do enough for you. Would come back again."], ["Reviewed January 22, 2018", 3.0, "Fun to see..", "We basically stopped here to kill a bit of time before a scheduled activity. We only had a little over an hour here, which in my opinion is a little too short. I did enjoy wandering and looking at what we could in the time we had here. We stopped and looked around in the wells fargo museum and the stable museum which were both interesting. There are a lot of tourist shops here as well so if you like to shop knick knacks... you have plenty to choose from. There are several restaurant choices in and around the immediate area. Many of which smelled fantastic, but we did not actually try... I do recommend giving this place a visit, To note we found street parking easily right around 11am.\nShow less"], ["Reviewed January 19, 2018", 3.0, "Solo visit as part of the trolley bus tour", "Once you get past the trinket shops there's some interesting history on display. I didn't eat here but plenty of restaurants if you did choose to eat."], ["Reviewed January 18, 2018", 4.0, "must see!", "I loved the Old Town! We came early in the morning and a lot of the places weren't open yet, but I still loved looking around and taking pictures! This would be a really great place to spend an afternoon, and it's a stop on the Coaster train and the trolley! I hope I can visit San Diego again because I will plan to spend more time here!\nShow less"], ["Reviewed January 18, 2018", 5.0, "LOT'S OF HISTORY IN OLD TOWN SAN DIEGO", "Stopped to visit Old Town San Diego while on an Old Town Trolley excursion. What a great experience. Lot's of history in this part of San Diego. Well worth a visit if you are visiting this part of California. While there we stopped to have lunch in the Old Town Mexican Cafe. Well worth the stop. Food was great and the Margarita's were outstanding.\nShow less"], ["Reviewed January 17, 2018", 4.0, "A nice place to see the origins of San Diego.", "We were looking for some mexican food so we decided to visit Old town. It does have its share of tourist shops but lots of people like these sorts of places. The atmosphere as a whole is pleasant and worth of visit to see where San Diego was founded, even if its just to grab a drink or a bite to eat.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Nice place to wander and browse", "Nice place to wander and browse. The Old Town Market offers a good selection of souvenirs, many appear to be handmade. Nice relaxed atmosphere and no hard selling here.\n\nThe ‘Assay’ office is a very impressive and extensive collection of gems and minerals worthy of a museum. Lots of lovely jewelry items available here.\n\nWe had a wander around the other streets here and they seemed to offer some authentic local foods but we were still full from brunch so I can’t recommend any !\n\nA pleasant way to spend a couple of hours wandering and browsing.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Lots of History", "Fun place to visit with lots of history. Museum artifacts good food and shops. Good way to spend a nice afternoon."], ["Reviewed January 11, 2018", 5.0, "Great", "Great place to visit. It’s very well kept so gives you a real idea of what San Diego was like. I would highly recommend visiting."], ["Reviewed January 10, 2018", 4.0, "Great place for evening dinner and walk", "Walking in the downtown of old town is fun and there are plenty of nice restaurants. Parking could be tough."], ["Reviewed January 10, 2018", 4.0, "Very cool", "The San Diego Old Town area is a very cool place to walk around and see. Lots of interesting shops and restaurants."], ["Reviewed January 9, 2018", 5.0, "A bit of history", "Shows a bit of history from when San Diego was just a tiny town.. Great shops and restaurants. Great place for young and old"], ["Reviewed January 9, 2018", 5.0, "Fun Night Out", "Four of us went for dinner and exploring on a weeknight. Such a family-friendly atmosphere, but not over run with wild kids. Interesting shops and things to see. Lots of history, which I love!"], ["Reviewed January 7, 2018", 4.0, "Discover California's Birthplace...", "Visit Old Town where history comes alive and the fiesta last forever. Enjoy Old Town San Diego State Park which commemorates the early days of San Diego. Enjoy great dining, shopping, entertainment and museums."], ["Reviewed January 3, 2018", 5.0, "Beautiful old town", "I came here with my family and was amazed by the scenery. I loved all the shops and historic buildings. I wish I had more time to spend in this little town."], ["Reviewed January 3, 2018", 5.0, "Caught the trolley there and then stayed for dinner afterwards", "It has sort of a Santa Fe-like charm to it. There was plenty of parking there when we caught the trolley so we were surprised when we came back on the last trolley how busy all of the restaurants were. We did a little shopping and then grabbed a bite. Fun area to visit.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Another stop on the hop on/off tourist bus", "Personality drivers give an amusing and informative commentary - good way to see the city and decide the shape of your visit. The Old Town is worth a look."], ["Reviewed January 3, 2018", 4.0, "History of southern cali", "Enjoy a multitude of how the San Diego area was first started, walk through one of the original school houses and explore the quaint shops"], ["Reviewed January 3, 2018", 3.0, "Morning visit", "Old town is unique. Spend a few hours bumming around and enjoyed an early lunch at one of the Mexican restaurants. It is a place to visit while you are in San Diego and is something to do."], ["Reviewed January 3, 2018", 3.0, "It was Okay", "Went there because you kinda must if your in San Diego. It was Okay. Many things were closed because on Mondays they are closed. It was a bunch of cheap Mexican souvenirs. Could get elsewhere much cheaper. Some of it was pretty to see but very commercial!\nShow less"], ["Reviewed December 30, 2017", 4.0, "Old Town San Diego Quaint & Historic", "Quaint & Historic area... reminded me in a way of the Alamo area of San Antonio. Trolley stop makes it easily accessible. You will see period costumes & interesting historical sites."], ["Reviewed December 30, 2017", 4.0, "California dreaming", "One of the best places to visit in San Diego. Great to stroll around with a lot of quaint shops and Mexican restaurants. Great for the family."], ["Reviewed December 28, 2017", 5.0, "Our USA honeymoon", "Old town was lovely to walk through at night, we enjoyed all the little shops and the staff in each place were very sweet.\nWe went to eat and the best thing was the margarita and the hubby's sangria the food was very average definitely thought Mexican food would be better there but we were left disappointed and looking forward to going to our Mexican restaurant once we were home.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Shop Old Town San Diego", "Visiting San Diego? Take time to walk the streets of Old Town and shop at the many stores offering southwest style clothes, home decor, and souvenirs. There are also several restaurants offering southwest type victuals for your enjoyment."], ["Reviewed December 20, 2017", 5.0, "Great shopping mecca with restaurants", "This is a wonderful place to visit if you love to stroll along streets filled with shops and restaurants. It is the first establishment in California and in San Diego. Don' t expect any great bargains but the ambiance is a lot of fun."], ["Reviewed December 20, 2017", 4.0, "Good at night", "If you are going to visit here plan to arrive late afternoon as the place looks great an night with all the lights and restaurants lit up"], ["Reviewed December 19, 2017", 4.0, "Where San Diego began", "Yes, we can say that San Diego began here but most of what is there today consists of shops and places to eat and drink. Buildings advertised as museums were more shops than museums. Despite that we spent an enjoyable half day here during our recent vacation to San Diego. We also climbed up Presidio Hill but failed to find the old mission museum dedicated to Father Serra. However, we did find a considerable number of very nice homes, many of which were built in the old Spanish mission design. It was easy to get there from the downtown area on the computer trolley. We did not use the tourist trolley. We also had a very nice lunch in Old Town and enjoyed much of the architecture.\nShow less"], ["Reviewed December 19, 2017", 4.0, "nice shops and restaurants and alot of history", "nice to go walk the area and see the sights and get some good food.just a fun place to visit and see the sights and get some exercise visiting different shops."], ["Reviewed December 19, 2017", 5.0, "lots of transit options and cheap", "Great place to take the whole family.there is shopping dining of mexican cuisine.the trolley and many buses are available most days.on weekends a small shuttle that runs from old town does not run on weekeneds only stops at hotels near fashion valley transit center."], ["Reviewed December 8, 2017", 4.0, "Fascinating glimpse of \"Mexico\" for tourists", "We wandered round here for several hours, absorbing the atmosphere and enjoying the history. We've never been to Mexico before and it offered an easy glimpse of \"Old Mexico.\" There were plenty of what appeared to be authentic Mexican restaurants - we ate in Café Coyote which was excellent.\nThe Sheriff's Museum and Campo Santo Cemetery were fascinating places to explore. We visited in early November, just after Halloween, so there was a lot of \"Day of the Dead\" exhibits which we hadn't seen before\nShow less"], ["Reviewed December 7, 2017", 5.0, "Been here lots of times", "I live in Maryland but love Old Town San Diego love the restaurants the park and the shops. The Mexican Food is great."], ["Reviewed December 6, 2017", 5.0, "Historical FUN", "This is a great place to visit in San Diego. Food and shopping are amazing. Cocktails everywhere. And if you are really wanting to learn the history take a haunted tour."], ["Reviewed December 3, 2017", 5.0, "Touristy But Easy South of Border Experience", "Old Town is a fun place to visit with a wide selection of stores and restaurants all reflecting the strong ties that San Diego has with Mexico. There's quite a bit of history mixed in as well and the architecture is very interesting--transports you South of the border. This is a much cleaner and easier trip than going to TJ. Definitely worth a visit.\nShow less"], ["Reviewed December 1, 2017", 5.0, "Enjoyable Day Stepping Back in Time", "Spent a whole day here walking the streets and going in and out of the stores and buildings. McCoy House Museum was a look back at the past, Felt like I could board a stagecoach in the Express Stage Co., Wonderful little gift shops including the pottery shop and tinsmith shop...if I only had more room in my suitcase. If you get hungry there are lots of restaurants.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Lovely time", "Enjoyed having lunch at a Mexican restaurant and walking afterwards into the village of markets and shops.Takes you in time"], ["Reviewed November 28, 2017", 5.0, "See how SD began", "Good place to start your visit to SD, especially if you are a history buff. Walk the streets and take yourself back in time. Visit all the shops. Sit and admire the large old tree in the center. Good for at least a few hours. (Added bonus, just outside the eastern end of the demarked historical area up the hill is a nicely done model train exhibiton run by volunteers.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Old Town shopping", "I loved the shopping in Old Town with quaint little shops mostly offering brightly colored Mexican made goods."], ["Reviewed November 20, 2017", 5.0, "Three stop from downtown", "Take the light rail. Great village of restaurants and shops. Don't miss the big O scale train layout, and it's free. You'll feel like you are south of the border."], ["Reviewed November 20, 2017", 5.0, "A must do!", "Haven't been to Old Town in a long time and I'm not sure why, but had an enjoyable afternoon. Stopped for lunch and visited several stores, making a lot of fun purchases. Something fun to do if you want to browse, eat or learn more about old San Diego.\nShow less"], ["Reviewed November 20, 2017", 5.0, "GORDON BERRY THE BEST", "Wonderful, magnificent, loving an classy. Gordon Berry directed and his ideas and connections were very pleasing."], ["Reviewed November 20, 2017", 5.0, "I ate with my friend and her dog at Freds Mexican restaurant in Old Town San Diego", "We arrived at this restaurant based on a recommendation from the restaurant across the street which told us my friends dog ... Stormy ,,, would be welcomed ... we were greeted in a friendly manner and along with our menus was a menu for the dog ...\nwhen we sat down they brought a cute dog bowl with paw prints on it full of water for the dog... My friend took a picture of the menu and forwarded it to friends and family who were amused and impressed with it .. The dog got a delicious looking dinner of chicken strips and French fries which she enjoyed immediately ... while we enjoyed the refreshing margaritas and our delicious dinners ... It was a very popular restaurant and as the night went on more and more groups arrived to eat there... military men and spouses had a party along with another group having a wedding rehearsal dinner ... the place was large with several areas to dine in and our waiter ,,,Thomas remained attentive to us even as he was serving the large wedding party ...The dog was pleased with the attention and the food she was given ..\nShow less"], ["Reviewed November 19, 2017", 4.0, "A good insight into old San Diego", "There are some great old buildings here. You can get soem great looking Mexican food too. The Tea shop is really nice and heaps of interesting choices. Better Mexican ceramics in the shops behind the restaurants."], ["Reviewed November 19, 2017", 5.0, "What An Interesting Place!", "We visited Old Town San Diego while we were there and found it to be so interesting! It was very busy and fun. The streets are full of restaurants and shops and people!! We found some great items to buy and ate at a wonderful restaurant. The street is easy to cross and in only a couple of blocks, you can see all kinds of places! We really enjoyed it!\nShow less"], ["Reviewed November 19, 2017", 4.0, "Good Food", "Lots of restaurants, some very popular, we chose a slightly quieter one and had a super Mexican meal. You have tihave good food to survive here I reckon."], ["Reviewed November 18, 2017", 4.0, "Walk around Old Town", "My wife and I recently visited San Diego with friends. While there, we took the trolley and made a stop at Old Town. This is a very interesting and historic part of San Diego. There are numerous shops mostly located in the old original buildings. There are several exhibits of early San Diego history such as a court house and a Wells Fargo stage office. This was a worthwhile excursion and I would recommend it as a “must see”.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Cool Town", "Old Town was pretty cool. There is a haunted house known as the Whaley House. All kinds of little shops were you can buy cool souvenirs. Lots of places to get something to eat. REAL Mexican food. You can watch them make real tortillas. You can eat inside or out depending on where you decide to eat. We ate at just about every food place there was. All are good.Colorful town. Good for all ages.\nShow less"], ["Reviewed November 13, 2017", 5.0, "My Favorite Part of San Diego", "I was in town a short time so I was trying to cram in as much as possible, but I could not and did not want to rush this section. As the birthplace of CA, I loved the style of the buildings infused with Mexican culture and music. I enjoyed the vibrant colors, the fun shops, and learning about the early days of the mission. We ate at Cafe Coyote and the food was incredible. I highly recommend visiting this area if you have the chance.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great place to visit!", "I️ always visit Old Town when visiting San Diego! Good food (Miguel’s is my favorite), people watching and browsing the shops is the thing to do. You can get an idea of what historic San Diego was like."], ["Reviewed November 11, 2017", 4.0, "Really enjoyed this area", "This review is from Sept/16. Wear good shoes and do a lot of walking to see buildings, restaurants and attractions. We really enjoyed this area of San Diego and made a point of walking the entire length of it as we were on the hunt of a specific piece of Mexican pottery. I would definitely return as there were many restaurants we wanted to try but just didn't get the chance.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Birthplace of California", "Old Town dates back to 1769 and was the first settlement in California and is the historic heart of San Diego.\n\nThe town contains many specialty shops many restaurants but mostly Mexican food.\n\nOld Town San Diego State Historic Park is in the centre of Old Town and a must visit as one can experience life from the early Mexican-American period of 1821-1872.\n\nIts great that the heritage of Old Town has been preserved for many to enjoy for years to come.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great shops, food and atmosphere", "We had a sisters trip to Old Town San Diego on the Day of the Dead celebration. Lots of neat shops, found many treasures to bring home. Did a lot of walking and enjoying the entertainment here."], ["Reviewed November 9, 2017", 3.0, "FunTime", "Enjoyed the trip to Old Town. Lots of interesting shops with a little of everything. Great Olive Oil Shop so delicious. Good music and food"], ["Reviewed November 8, 2017", 5.0, "Great place to visit", "We ended up going to old town after visiting another tourist attraction given the bus exchange depot is right across the train tracks and it is well worth the visit.\nIt is not only informative just also fun. Not all of the buildings were opened while we were there but you could still see inside and take a step back into history which is what this place is all about reliving history. You could spend an hour here or half the day here and still have an enjoyable time, it is easy to get around the area and even easier to get to from downtown you just jump on the train and walk across the road to it.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Entertaining State Park", "We thought the entire Old Town area was great especially being a San Diego native. Walking through the historic area was very educational and enlightening since we saw the original town layout in the information center, the first school in san diego snd realized that the first mission was dedicated here by Junipero Serra in Presidio Park overlooking Old Town. There were many Mexican style restaurants with indoor and outdoor seating which all looked to be very lively. We ate at the Coyote Cafe just outside the main old town square and it was excellent both in food and ambiance. This area is great for locals, families and visitors\nShow less"], ["Reviewed November 8, 2017", 5.0, "Fun place!", "We had a great time checking out all the shops and historical buildings. Make sure and eat at one of the multiple restaurants!"], ["Reviewed November 3, 2017", 5.0, "Great informative fun", "I love this place and have to visit every time I go to San Diego. The museum bits are very informative and you also have retail outlets and eateries."], ["Reviewed October 30, 2017", 5.0, "Great to stay near here", "This was a place to visit on a nightly basis. Many great restaurants. Old San Diego village at back. Mexican dancers. Mariachi players. Fun atmosphere. Lovely Catholic cathedral. Attended Mass. Friendly people. Very enjoyable. Seems safe."], ["Reviewed October 29, 2017", 4.0, "Nostalgic place to visit", "This old town is a nostalgic place to visit. If you like western movie you should see this place with its streets and buildings. Do not forget to visit the Stable Museum."], ["Reviewed October 29, 2017", 4.0, "Worth your trip beyond Gaslight", "Neat little place to walk around, pick and choose what interests you. There is free parking, but you have to look for it and it's off the beaten path. Some remarkably hilly sections with views that at not part of the typical tourist experience if you want to climb. More than a smattering of attractions, activities, things for kids, places to eat, etc. Well part of your afternoon.\nShow less"], ["Reviewed October 27, 2017", 5.0, "LOVED this place !!! The setting was \" old world \".", "There were museums mingled with shops and restaurants. Very pleasant day You just walked around going into tha places that appealed to you."], ["Reviewed October 26, 2017", 4.0, "Great gift shops and history", "Old Town San Diego had many charming shops, and happened to be hosting an arts and crafts fair when we were there. The vendors were friendly and had lots of reasonably priced and unique items to sell. We had lunch at a Mexican restaurant, the Alamo. Their margaritas and tacos were delicious. The ambience throughout old town consisted of the old west meeting the contemporary west. Found some wonderful souvenirs, and just enjoyed walking around.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Super fun!", "The old town is charming! There are so many wonderful shops with products from around the world. A must see in San Diego! Good parking, children friendly and a very nice place for a couples date. Many restaurants, musicians, and historic buildings filled with lots of charm.\nShow less"], ["Reviewed October 25, 2017", 4.0, "beautiful and awesome time to visit during Day of the Dead celebrations", "Awesome set up of original structures and a lot of free historic tours/ information about the area. Tons of great little gift shops and places to eat. We just went in late October and it was very cool to see all the decorations for the Day of the Dead celebration that's approaching.\nShow less"], ["Reviewed October 23, 2017", 4.0, "A slice of history with a modern twist!", "We were so mesmerized by the food and the ambience that we ended up visiting old town not once but thrice during our three day visit to San Diego. The historical site offers a great peek into the history with buildings and museums from the bygone era. Once you are hungry walking, you will be spoilt for choice in terms of Mexican restaurants offering great food, drinks and music. Once you satisfy your hunger you get to shop for mexican souvenirs without having to visit Mexico.\nShow less"], ["Reviewed October 22, 2017", 3.0, "Mexican restaurants and artisan shops", "I went to Old Town several days for dinner. There are many mexican restaurants with a pizza/italian restaurant as well. There are areas where you can walk and shop and eat. But the area is bigger with longer walks to some of the other stores and restaurants. I bought souvenirs at reasonable prices. There were many handcrafted items in addition to local wares.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Great place to learn history and shop", "It is easy to walk around all of Old Town and tour the various buildings there. Most are turned into uniques shops that are fun to look at."], ["Reviewed October 19, 2017", 5.0, "Margarita's and Music", "We had good time at Old Town. It was a warm day and a bit crowded but the people moved around without feeling on top of each other. We ate at a good restaurant overlooking the square with good food and a place for people watching. We also came across music and found some nice shops to stroll through.\nShow less"], ["Reviewed October 16, 2017", 4.0, "A Touch of History with Modern Touches", "Old Town is what it is history with modern & traditional storefronts the church is gorgeous and the shops with a variety of items for every interest."], ["Reviewed October 15, 2017", 4.0, "Touristy", "Nice little place to wander around and look. It’s become VERY TOURISTY. There are still some interesting buildings to look through."], ["Reviewed October 12, 2017", 5.0, "History and contrast", "If you think downtown San Diego is the real deal as I did...you have it all wrong. This is were it all began witha far west flavour to it and many places to visit around the Plaza de Armas."], ["Reviewed October 12, 2017", 3.0, "A must go..non-genuine old town??", "I was told I should go and Old town is a must and it is included in the trolley bus tour..In fact it is just a gallery for Mexican gifts that are present in other places....there is no admission fees, free parking and restrooms are available..take care important restaurants are located on the other side of the street with fresh tortilla baked in front of you..\nShow less"], ["Reviewed October 12, 2017", 5.0, "Interesting place!", "Been here 2 times already, cool place to walk around and enjoy the (old) buildings and houses, eat and drink something,..."], ["Reviewed October 11, 2017", 4.0, "Party in Old Town", "A place worth visiting. It has the Spanish architecture that is so appros for the area. We had a delightful evening with Mexican food, drink and music. The shops had some unique items and the atmosphere was uplifting and fun."], ["Reviewed October 11, 2017", 5.0, "Eat and walk in Old Town San Diego", "Wife and I had a great time walking around this historic part of San Diego. Authentic Mexican food, great gift shops. A safe relaxing time."], ["Reviewed October 10, 2017", 3.0, "Very touristy", "Very touristy anymore. Came here several years ago and looked forward to coming back. Was generally disappointed. Many of the old exhibits have been replaced by stores.\n\nThe remaining museum sites are deteriorating. Signage is getting hard to read and many signs have part of their commentary ripped off.\n\nIf you're in the area or have extra time, go ahead and stop. But, don't make a special trip.\nShow less"], ["Reviewed October 10, 2017", 5.0, "My San Diego Trip", "A walk back into time. Old Town San Diego gives you a history lesson about this wonderful city. This is a must see when visiting here."], ["Reviewed October 9, 2017", 5.0, "A walk back in time.", "The old town in San Diego is like going back in time. Apart from the buildings and the setting, there all of kind of shops and cafés available. Many of them are specialty, like a vegan coffee place, restaurant serving mostly mexican influenced food and souvenir and candy shop.\nA visit is in order even more if you like being taken back in time.\nShow less"], ["Reviewed October 7, 2017", 4.0, "Absolutely breath taking", "Nice that you can visit Mexico without actually going to Mexico. To eat and drink it is a little costly but a great environment especially as the sun is setting."], ["Reviewed October 7, 2017", 3.0, "Historical Area", "Walked around Old Town and looked in the different shops. Many areas had descriptions of what places were famous for. Mostly tourist type stuff to buy."], ["Reviewed October 3, 2017", 3.0, "OK, but nothing special", "This I my third time at OT, spread over 15 years. This time, I was a little under whelmed. It was a bit more touristy and less authentic for me.\n\nI'd still visit here, but perhaps come at night for dinner - plenty of fun / atmosphere.\n\nPlenty to see if you want to go to a museum but otherwise it is just restaurants / food shops / trinket shops.\nShow less"], ["Reviewed October 2, 2017", 4.0, "A Great Part of Your Trip to San Diego", "If you have time, it's worth going to Old Town, San Diego. The food is so close to Mexico that you do get authentic grub. And there are so many fun things to do, including plays, restaurants, outdoor and indoor markets."], ["Reviewed October 2, 2017", 3.0, "A Little Underwhelming", "We love San Diego! But on our recent week long stay in this beautiful city, this was the most average attraction we took in. It just didn't really grab us and, as we'd never previously visited Old Town, we were looking forward to doing so. in the end we walked around for a couple hours one morning and that for us was definitely enough time. Much of Old Town seemed a little tired and slightly run down to us, and the shopping consisted largely of overpriced trinkets. Then we moved on to Point Loma, which we enjoyed a lot more.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Be sure to eat lunch or dinner while there. Authentic food.", "Really interesting experience -- you feel like you are in real Mexico. Be sure to visit the cemetary -- funny epitaphs. The candy store had a lot of old things that you haven't see since you were a kid. I was looking for \"chicklets\" for a shower game and I looked alot of places and finally found them here. Plan to eat a meal there -- most of the places are good and authentic Mexican.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Must place to see in San Diego", "Very well maintained and cool place full of history and charm. Every corner has something interesting to discover."], ["Reviewed September 28, 2017", 4.0, "Busy but interesting", "Was in a hotel only a few hundred yards away from the old town so made a visit. Its very commercialised as you might expect, and very busy. Theres a small museum in the centre, and also a wells fargo coach"], ["Reviewed September 27, 2017", 5.0, "Old Town", "What a fun place. Shops,restaurants and some history. Very enjoyable day. Fun to take the old fashioned trolley around the rest of San Diego too."], ["Reviewed September 27, 2017", 3.0, "Free But Touristy", "There's not much to dislike about Old Town San Diego and its touristy shops and restaurants. It's free and open to all, and the pretty grassy area is the perfect place to relax and people watch on a nice San Diego day (which is nearly every day of the year). There are historical sites mixed in with overpriced souvenir shops, and mostly mediocre Mexican restaurants lining either side of the main drag. During the summer, there's an awesome outdoor market on the weekends.\n\nYou can get much better food elsewhere in town, but what makes Old Town so famous is their warm, fresh tortillas! Nearly every restaurant makes them from scratch and some even have walk up windows where you can purchase a made to order disc of flour-y goodness.\n\nParking can be nonexistent and expensive during busy times of the year, and at the end of Old Town there's a convenient trolley stop. The historic buildings are all free to enter. A good place to visit if you're in San Diego.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Great History", "It is a great place to walk with the family and learn some history, great shops and things to enjoy while walking there, in addition you have some of the best restaurants in the city right next door"], ["Reviewed September 26, 2017", 5.0, "Touristy", "Certainly the heart of the tourist district. Interesting history here. Places to eat are not far away. I would bring comfortable walking shoes with you."], ["Reviewed September 24, 2017", 4.0, "Great shopping and restaurants in Old Town San Diego, CA", "Something for everyone in your entire family while in San Diego, CA. Great restaurants, bars and shopping in Old Town San Diego. Lots of \"one of a kind\" shops and historic sites of interest."], ["Reviewed September 24, 2017", 3.0, "Tourist hot spot", "One of the biggest tourist draws in the city. Traffic and parking are difficult no matter the day of the week. It does offer some interesting sites and has some decent restaurants."], ["Reviewed September 22, 2017", 5.0, "Worth a Visit, Not a Tourist Trap", "I was pleasantly surprised by Old Town San Diego. The setup reminds me of Williamsburg, but on a smaller scale. Each building offers a bit of the history for Old Town and each building on-site is unique. Take the time to visit each to learn about Old Town’s history. The visit will take about 2 hours or longer.\nShow less"], ["Reviewed September 22, 2017", 4.0, "Nice to stroll and have dinner.", "Very busy location on a Friday evening. Lots of options for dining, with no or little waiting. Many authentic Mexican restaurants. Quaint shops."], ["Reviewed September 21, 2017", 5.0, "Great History", "Visiting Old Town was great. I took my grand-daughters and they had a great time seeing Old Town, we bought some spices and we saw them make home made tortillas. We enjoyed walking around and see all the crafts. If you have a change you must visit Old Town.\nShow less"], ["Reviewed September 21, 2017", 3.0, "Okay shops", "I was expecting a lot more from the good reviews, but the shops were crazy expensive for Mexican goods. $69 for a Mexican blouse? $250 for a dress? No thanks. I bought a cookie and empanada because they reminded me of the ones I used to get from the panaderia growing up, but the cookie was dry and hard, not fresh baked tasting at all. Disappointing over all.\nShow less"], ["Reviewed September 18, 2017", 5.0, "First time in San Diego and Old Town was recommended", "Lots to walk and see. Many shops to look through. Very good restaurants. Easily accessible from our hotel. Was easy for our family to walk around together."], ["Reviewed September 17, 2017", 5.0, "Very fun little town", "Lots to see and do here. Amazing food and very friendly businesses. This town has lots of history. The shops are endless. I can't wait to go back."], ["Reviewed September 17, 2017", 5.0, "Museums (historical buildings) interesting and for free", "The area is filled with souvenir shops - this seemed to be the biggest attraction.\n\nI did not have great expectations of the old town, but enjoyed very much strolling through for an hour. You probably don't want to spend much longer than that - however, do dive into the historical buildings, which have good displays of what life was like in early San Diego times. A few of the staff were also very happy in sharing their knowledge without judging me for my ignorance in American history - not least because there weren't too many visitors.\n\nIn sum, a surprisingly pleasant afternoon activity!\nShow less"], ["Reviewed September 16, 2017", 5.0, "Love Old Town San Diego", "Such a fun vibe with terrific restaurants, excellent shops, lovely architecture, photography opportunities and historical elements as well. What isn't to love about that? You can spend a little time or a lot of time, but either way, it does not disappoint. One of my favorite places in San Diego.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great visit", "Had a great time at Old Town. Rode the coaster down to avoid traffic. Tons of shops, food and specialty stores. Ate there and wandered all the stores. We were too tired to go out of the state park. Would do this again."], ["Reviewed September 15, 2017", 4.0, "Good mexican food", "Mexican and California history with a pinch of Amusement Park feel and look. It was a nice walk with the family, shoot some photos with old building reproductions from the Far West and Mexican past, but the best was the Mexican food"], ["Reviewed September 13, 2017", 5.0, "We love the church", "Came to old town after moving to San Diego years ago, and especially like the Catholic Church. We come here as often as possible, and even baptized our son here."], ["Reviewed September 13, 2017", 5.0, "A must visit", "This is the absolutely perfect place to dine and shop. The best of Mexican food and the atmosphere is great. Music and drinks! Always a first stop for me."], ["Reviewed September 9, 2017", 5.0, "Perfect for a history filled afternoon and BEER! :)", "Charming place, filled with beautiful architecture.\nIt beautifully shows how San Diego once was, displaying houses, furniture and a lot of information about life as it once was.\n\nGreat for walking and exploring!\n\nPerfect for an afternoon, exploring and beer :)\n\nGreat food at the Café Coyote and delicious coffee with Mexican chocolate!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Old Town is a nice place to visit and hang out !!!!!", "I have been to Old Town many times and still enjoy going there and taking in all the culture. So many stores and restaurants and a local flare. Nice !!!!!!!!!!"], ["Reviewed September 8, 2017", 4.0, "Nice place to spend the afternoon...", "Visited for the first time from the east coast and followed some friends to Old Town not knowing much about the area before touring Old Town, but were glad we took the opportunity. There were lots of interesting old buildings and happy hour specials were to be found! Tons of shops with reasonable prices and several great places to eat. Very fun visit especially Café Coyote.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Unexpected Find!", "We didn't know much about the area before touring Old Town, but were glad we took the opportunity. There were lots of interesting old buildings, shops, penny presses, restaurants and even traditional Mexican dancing shows! I loved some of the souvenirs I bought, like the glass stars at the tin shop and jewelry from another little shop. And, food was so good, we came back for dinner another night!\nShow less"], ["Reviewed September 6, 2017", 4.0, "See what old San Diego looked like.", "Many older buildings still stand today with some older hotels still in service. Plenty of places to walk to and eat the weather is almost always good because of Old Towns proximity to the coast. You can also take the trolly or coaster to and from Old Town. Plan to spend several hours walking so wear good walking shoes. There are places to take tours which is nice if you haven't been to San Diego before. Plenty of locals like to take walks around Old Town including my wife and I.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Interesting look at founding of San Diego", "Enjoyed learning about the history of the area and some of the early residents. Love the historic buildings and some of the vendors. Recommend souvenirs from the visitor center as they support the park."], ["Reviewed September 5, 2017", 5.0, "Historical area", "Step back in time to when California was born. Lots of shops, restaurants & museums to visit & great photo ops. Safe & easy to walk around."], ["Reviewed September 3, 2017", 4.0, "Unique!", "Loved the look of this place. Felt like stepping back in time. Several shops and restaurants available. A must see!"], ["Reviewed September 3, 2017", 4.0, "The birth place of California", "Cute town with huge Hispanic influence. Lots of shops and restaurants. Look for the small round brass markers all over the streets and sidewalks that mark where a grave site is."], ["Reviewed August 31, 2017", 4.0, "ANOTHER OLVERA STREET!", "We visited Old Town twice on our trip. Once for the first time because friends had recommend going and the second time when we went on the Trolley Tour. About the same experience. Many places to eat, shop and take pictures. Reminded us of Olvera street in Los Angeles California.\nWould recommend going at least once. Ate at local places and the food was very good.\nHope that helps.\nEnjoy!\nRABBIT\nShow less"], ["Reviewed August 30, 2017", 5.0, "Nice Experence", "Nice atmosphere, good surroundings, good food, nice shops, friendly merchants. People actually acted like they were happy to see you enter their establishment!!"], ["Reviewed August 26, 2017", 4.0, "Quaint area", "I liked visiting the area. Cute shops, lots of food options. Best Mexican food found here. Candy store was great too, salt water taffy is really tasty."], ["Reviewed August 22, 2017", 5.0, "When in Rome...", "If you can subtract the touristy vibe, you can really take yourself back to a by gone era. Old town is safe and easy to walk. Plenty of scenery and places to eat and drink."], ["Reviewed August 20, 2017", 5.0, "Cool Experience!", "I would recommend checking this out. It's a different cultural experience with great shopping! I enjoyed walking around and looking at the different things."], ["Reviewed August 20, 2017", 5.0, "Love visiting Old Town!", "I love visiting Old Town every time I visit San Diego I make sure I visit Old Town. It has great shops and restaurants. Love seeing all the old buildings."], ["Reviewed August 12, 2017", 5.0, "Quaint shops and restaurants/historical area", "Large variety of gift shops and restaurants within just a few blocks. Easy to walk through the entire area. Parking is somewhat limited on the street, but there are lots within close proximity."], ["Reviewed August 12, 2017", 5.0, "Great town", "We had a great time here at OldTown. It's a must see in San Diego. Plenty of restaurants, shops and museums. The flea market had great items, tin shop, tea/coffee, soap/candle, pottery, etc....."], ["Reviewed August 10, 2017", 4.0, "Nice day of walking and shopping!", "If you like walking, shopping, browsing, eating, and drinking, this is your place! A lot of the places have the same type merchandise. Some shops have different and unique items. I stopped at one of the kiosks and was looking a a diecast toy truck to take home to my son. I picked up the truck to look at it and the lady started pointing to her sign \"Don't PLAY with the toys.\" Seriously? First of all, I'm an adult, not a child. Second, there's a difference in PLAYING and LOOKING. If I can't LOOK at something and check it out before I decide to buy it, then I'm not going to spend my money on it! I'll take my $$ elsewhere! But that was just one snooty lady that we had an issue with. Everyone else was friendly and didn't mind us LOOKING at their stuff! We also visited the Sheriff's Museum and the old cemetery next to it. Both were very interesting and worth the time to walk through.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Close to hotel La Quinta Inn and great restraunts and shops from Mexico", "We like to go here as it is in walking distant from our hotel La Quinta Inn and they have all kinds of mexico foods and shops."], ["Reviewed August 10, 2017", 4.0, "Awesome", "I visited old town San Diego with my kids and all of loved traveling in time..it was amazing.. the old artifacts and old town houses were love at first sight.. kids also enjoyed watching the dressed up women walking around downtown.."], ["Reviewed August 9, 2017", 5.0, "Tours", "WE had the tour of old town the trains are great, took to coma con from old townthis would be a great place to stay next year..."], ["Reviewed August 8, 2017", 5.0, "Must see!!", "This is a sweet area of San Diego! And especially good if you like Mexican food! Eat at Miguels and across the street is Old Town Mexican Cafe. Both are great in their own way"], ["Reviewed August 7, 2017", 5.0, "Family Time", "Mht daughter , her Husband and I took the old town trolley around town and especially enjoyed old town, we stopped and ate somewhere , however for the life of me I cannot remember the name"], ["Reviewed August 6, 2017", 5.0, "Very interesting part of San Diego's history", "Old Town is a very interesting part of San Diego's history. Good sightseeing, unique shopping, and Mexican dining and drinks. Another must to visit when in San Diego."], ["Reviewed August 6, 2017", 5.0, "An Relaxing Stop for Meals, Museums and Shopping", "Old town has something for everyone:historic museums,a state historic park,Mexican, Japanese and Italian restaurants, and many unique shops.\nOur favorite Mexican restaurants are the Algave (gourmet, expensive with small portions, but delicious with a BIG variety of Tequila)) and the Coyote Cafe ( large potions, excellent chicken enchiladas, and huge margaritas...see my review).\nThe Cosmopolitan Hotel and Restaurant, which dates back to 1827 as an adobe home, has Spanish and American food in a Victorian setting. It's a great place to relax in the shade of some trees and sip tea or a nice drink of your choice.\nThe Bazaar Del Mundo has many Mexican crafts: ceramics, leather purses, hand-made blouses, shoes, candy and books.\nThe Fiesta Del Reyes has a copper shop,a chocolate shop, and hand-crafted treasures to name a few.\nIf you feel like walking, some of the worthwhile museums include: the Blacksmith Shop (1868), La Casa de Estudillo (1829), an original adobe mansion,Mason School (1865) San Diego's first public school, and Seeley Stable (869) an original stage stop in the 1850s.\nThere is a bus, taxi and trolley stop on Taylor Street with a large parking lot there for cars and four parking lots on Juan Street. Try to park and eat during the early afternoon. Most of the restaurants start filling up early for dinner (4pm) and you will have to wait for seating if you haven't made reservations.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Fun Summertime visit!", "Always a must see when you're in San Diego. Old Town is a treat for the senses as you walk back in time through the adobe buildings exploring the ways of the old west. Just south of the main village is Cafe Coyote, great spot for fresh tortillas & GIANT Margaritas! Just mentioning if you get a little thirsty....\nShow less"], ["Reviewed August 2, 2017", 5.0, "Nice Place for Shopping", "We enjoy shopping all kinds of stuff and live music too . We took the trolley for 2 days and made sure we stop for food and shopping price was good."], ["Reviewed July 29, 2017", 5.0, "Fun and Food on Every Corner", "The historic park and buildings are interesting, but it is the shops, restaurants, and Pubs as well as the street vendors that make the trip a blast. Art Galleries, Antiques, Novelties, a Magic Store. There is an Authentic English Pub that serves \"Yard Tall\" beer. I Challenge everyone to finish a glass without getting a face full near the bottom.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Olde Towne better than expected", "We stayed nearby Olde Town in San Diego and walked through it almost everyday to catch the green line Trolley. Thus, we saw it both during the day, night and weekends. The weekends are cool because they have many people visiting in character costumes from the 1850 period of old San Diego. They do a lot of what the settlers had to do back in the day like, yarn, create candles, do games w/kids. There are several restaurants and all are pretty good Mexican fare. Very friendly folks. When in San Diego we may go back for a visit.\nShow less"], ["Reviewed July 26, 2017", 4.0, "Interesting", "We didn't have much time to spend here on our brief visit. We did get into the Sheriff Museum and the train museum. both were really interesting. We had lunch at one of the many Mexican restaurants. One could spend an entire day here seeing all the museums and sights.\nShow less"], ["Reviewed July 24, 2017", 3.0, "Very Interesting", "If you are nearby the old town is worth a visit however I would not go out of my way to visit. There several restaurants, cafes and bars that are interesting."], ["Reviewed July 24, 2017", 5.0, "A lovely mix of contemporary restaurants and shops and old, historic charm.", "We used the Old Town Trolley 2 day pass and stopped in Old Town San Diego on both days. There is so much to see and do in just this space. It's interesting to see the park that talks a lot to the founding history of San Diego and streets away there is a market for craftspersons and artisans (Saturday and Sunday) as well as modern restaurants and shops. A little bit of everything, live music, history, crafts, jewelry and great food. If you're looking for amazing coffee and churros there is a small coffee stand next to the Old Town Trolley station that is amazing!!!\nShow less"], ["Reviewed July 24, 2017", 5.0, "Awesome landmark and historic town", "What a cool place to walk around! We learned so many cool things. The shopping is really cool. Be sure to park and walk around to check out all the little stores and shops."], ["Reviewed July 21, 2017", 5.0, "so much to see", "definitely take a whole day or two to visit this amazing historic place. we only had a half day and left wanting to see more but time ran out for us. Good food, good history...we will be back to finish the tour"], ["Reviewed July 19, 2017", 5.0, "Worthwhile Spending an Afternoon", "The Old Town is worthwhile for anyone interested in learning about the history of San Diego. In addition there are plenty of shops and restaurants to stop into. Parking is at a premium so get there early to take advantage of the free public lots close by the park.\n\nShow less"], ["Reviewed July 19, 2017", 3.0, "Sadly not the \"old\" Old Town", "For a first time visitor, this might be a nice stop but for someone who remembers the real Old Town, before it became the tourist trap that it is now, it was sad to see. If you'd gone back then, you will be very disappointed to revisit it.\nShow less"], ["Reviewed July 19, 2017", 5.0, "take the tour", "take the tour that will bring you around and at the same time walk the streets and read about the old town. A must see for visitors and residents alike."], ["Reviewed July 18, 2017", 4.0, "Shops, restaurants, and the Old Town feel", "A great place to spend some time. There are lots of shops with local fare and souvenirs along the Main Street. Restaurant options are vast, from Italian to the expected Mexician. Worth wandering through in the afternoon or early evening. Avoid visiting early in the morning as stores may not be open.\nShow less"], ["Reviewed July 17, 2017", 4.0, "where history comes alivell", "As it is with many places, Americans know how to preserve their history and culture. Old town with its museums and 19th century houses (replicas and some originals) is a live set of history..Most museums including the prime attractions like the stable and Ramonas marriage chapel are free. Start your tour with a visit to the tourist center house and collect the leaflets detailing the Indian, Spanish, Mexican and American history..Dont forget lunchpp at the Cosmopolitan Hotel, one of the survivors from the old times.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Nice stop!", "Old Town is worth a stop. We went to the Whaley House and did a little shopping at the 5 and dime store. There are plenty of places to eat, it is easy to get to, and there are plenty of parking options."], ["Reviewed July 17, 2017", 4.0, "Good history", "We walked around the whole town and learned about the history of Old Town. The restaurants were good, but the margaritas were better. This will remind you of other old towns you may have seen, like St. Augustine, etc. Great history."], ["Reviewed July 17, 2017", 4.0, "Good place to buy souvenirs", "Historic buildings and traditional city setting. Good place to buy mexican candies, hot sauce, pottery and clothing."], ["Reviewed July 16, 2017", 4.0, "A huge tourist mall", "Very nice atmosphere built for tourists, you can buy all souvenirs you need in an old western style shopping mall."], ["Reviewed July 13, 2017", 4.0, "This Place is Cool", "I love going to old town because you can find really authentic Mexican food for not too much money. Lots of happy hour options and of course trinket and souvenir shops galore. Its one of the stops on the San Diego trolley line so easy to get to from downtown.\nShow less"], ["Reviewed July 12, 2017", 5.0, "A Walk Through the Past", "Old Town San Diego is a historical site not to be missed while in San Diego. You can easily spend the day here seeing all the historical sites and visiting all the shops and restaurants."], ["Reviewed July 12, 2017", 4.0, "A great way to spend a few hours in San Diego!", "We spent a few hours here after visiting Sea World. The park was easy to find, clean and the people working there were very good to the tourists.\n\nThere were lots of little shops to poke into, as well as spots to get a drink and relax. This was a location that I wanted to spend a bit more time in.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Great Area for shopping and eating!", "We stumbled onto Old Town San Diego as we were out exploring San Diego. This is a very well kept up downtown with lots of shops and restaurants. Definitely a place to look for souvenirs. Lots of great restaurants located here to choose from for breakfast, lunch, or dinner. Very kid friendly downtown.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Fantastic!", "Great Mexican Restaurant! Food was great, service impeccable and super ambiance. Everyone, even the four year old was happy. Lovely band playing nearby added to the fun!"], ["Reviewed July 6, 2017", 5.0, "Riding the Old Town Trolley with James", "We took a round trip tour on the Old Town trolley. Our guide was James. His easy banter made for a very enjoyable and informative tour. His pre-recorded instructions where funny due to the fact that the voice-overs where Ronald Regan, John Wayne and the Terminator, Arnold Schwarzenegger the best! He also played songs by Dean Martin, Judy Garland , Marilyn Monroe, Jerry Lee Lewis and many more artist. He kept us laughing. He presented us with so much information, we wanted to get off at every stop, but we also wanted to stay to continue his trolley tour! This is the best way to discover San Diego. Especially when you have a guide like James.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Old Town is a Favorite", "Always enjoyable to walk through Old Town's shops, streets, and displays. Great place for souvenir shopping. There are many, mostly Mexican restaurants, within. Easy, unhurried walking. Parking lots fill up so best to get there early in the morning."], ["Reviewed July 5, 2017", 5.0, "Adorable shops, restaurants", "We loooooove Old Town San Diego! It's the one place I must visit every time we go to the area. With great restaurants and adorable, fun shops, it's full of eye candy!! It's my favorite district in the area!"], ["Reviewed July 5, 2017", 4.0, "Enjoyed it", "Really enjoyed the overall vibe (minus some of the cheesy trinket shops) and the history lessons, especially in the stable. Great place for a casual afternoon topped off with very good options for Mexican food for dinner just up the street."], ["Reviewed July 3, 2017", 4.0, "Good History and GREAT food", "Nice to walk about and read the signs - what the buildings once were and why they were preserved. Lot's of great food places....my favorite Café Rios in center of Fiesta Rios plaza . You need to look for it or you miss it, because it is just outside the main square area\nShow less"], ["Reviewed June 30, 2017", 5.0, "Delight", "This is a fab place to visit. Plenty of shops both with old and new items, mex food, old style shops and plenty to see. Give yourself a few hours here"], ["Reviewed June 27, 2017", 5.0, "Love Old Town San Diego", "Excellent Mexican food, homemade tortillas, and entertainment. Nice place to walk with historical buildings"], ["Reviewed June 25, 2017", 4.0, "Very cool place", "Totally cool place to spend some time poking around the different stores and stalls. Surprisingly, the prices for souvenirs were really good in the general store. Definitely worth a visit when you're in San Diego."], ["Reviewed June 24, 2017", 5.0, "Step back in time", "This was one of the stops on our bus tour. What a place!! Lots to see, lots of shopping. Quaint eateries too."], ["Reviewed June 24, 2017", 4.0, "A peek back into frontier times!", "We started our San Diego vacation in this historic location. You can get here easily on the San Diego train (we came from Gaslamp quarter). The site is a very short walk from the station.\n\nThis is the site of the old pioneer village. There are shops, restaurants, and even a hotel. Every day there is spanish dancing in the square. There is a great rock shop, and a candy shop that has everything you can think of. Lots of things to see and do.\n\nWe ended our visit with margaritas at the saloon. Pretty good day.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Old town Mexican cafe.", "Best authentic Mexican food. Great service and food. You can also buy tortillas to go.prices are very reasonable"], ["Reviewed June 16, 2017", 4.0, "Landscaping was interesting - cute merch in shops", "Enjoyed spending some time here window shopping. Prices weren't unreasonable, but a little higher than expected. The landscaping was unique - many VERY large cacti and plants made for great photo opportunities. We picked up the trolley here and finished our day at the Alamo Mexican Cafe (good food) when we returned.\nShow less"], ["Reviewed June 14, 2017", 4.0, "Very colourful", "Laid out as a Mexican old town with lots to see and explore museums of how life used to be. Lovely food to choose from lots of Day of the dead artefacts to buy. Worth a visit day or night but Pretty at night time with all the establishments lite up.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Historic little town", "Such a quaint little town with lots of gift shops and a variety of restaurants. You can plan on spending a couple hours there. We loved visiting the little church in town and there was also a very old cemetery just up the road from it that was interesting to walk through. If you keep walking to the end of the town you will reach the historic old town. Bring your camera!\nShow less"], ["Reviewed June 11, 2017", 5.0, "Fun and free", "We had a few cloudy days here so we went to old town. It was a nice combination of history, shops, art and places to eat."], ["Reviewed June 11, 2017", 4.0, "Nice area", "We came here with the trolley tours. It's a great area to visit and the stores and shops and museums all take you back into the old western time. Nice restaurants and shops. Liked our stroll around this area."], ["Reviewed June 11, 2017", 4.0, "Nice area to visit", "I visited Old Town during the first week of June 2017. I found it to be quite delightful. Walking along the Main St. in downtown Old Town is really quaint. There are some very good authentic Mexican Restaurants. If you want something different, visit the New Orleans restaurant tucked down a side street along the main path.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Quaint town with lots of shops, eateries, and some sights to see.", "A nice little village with some attractions, a lot of shops and eateries. Great place to spend the day walking around, there are various old buildings and sights to see. Enjoyable."], ["Reviewed June 9, 2017", 4.0, "A trip to SD is not complete with a stop in Old Town", "History, tourist shops and great restaurants all in one place. Once you tour the historic areas head to the Old Town commercial district with restaurants and shops. Food is good and prices are reasonable. We especially love OLd Town Mexican Cafe....where the tortillas are freshly made on the premises, chips are homemade and great salsa!\nShow less"], ["Reviewed June 8, 2017", 4.0, "A blast from the past with guacamole on the side.", "We had a great time at this little town. It felt like going back in time with a touch of the Mexican and old western cultures. Parking is a bit hard to find and could be expensive depending on the distance. There are plenty of street store with memorabilia and vintage souvenirs. There are also a couple of museums and art galleries. Right in the middle of the town is a big field to have a nice picnic or lay for a siesta. There are Mexican and folk shows to view as well. Food is not an issue, restaurants are all around the town with delicious Cali-mex culinary taste. If you are planing to visit California, you must not miss this experience. Enjoy!\nShow less"], ["Reviewed June 8, 2017", 5.0, "San Diego old town", "Great place to start your San Diego journey. Experience the old days. The place to be for Mexican food. From here easy to hub on green line to downtown SD"], ["Reviewed June 7, 2017", 5.0, "Visited 3 times in 4 days", "A must see in Old Town San Diego is the haunted Whaley House! I didn't believe in hauntings but I did experience something with the porcelain dolls! The Old Town has a lot of great places to eat. Suggest going during the day to get the most benefit of the surroundings.\nShow less"], ["Reviewed June 6, 2017", 4.0, "love this place", "This is a must do if you visit San Diego , just a lovely place to stroll around , look in the shops and then eat in one of the many Mexican restaurants, parking can be an issue at times especially at weekends"], ["Reviewed June 6, 2017", 4.0, "Cool little place to eat and check out", "Quaint little area to check out, restaurants, cigar and gifts shops, heritage listed buildings and history on the area. Worth a look if new to San Diego."], ["Reviewed June 4, 2017", 4.0, "Old Town", "I love old town. We go there every time, we are visiting. Take the time to walk around and find some of the hidden gems throughout the area. We go typically to eat and drink. So I would suggest to take UBER or a cab there.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Aussies in America", "What a great spot to walk around and enjoy. The Mexican part was wonderful for gardeners and the shops were awesome. It was so interesting reading about the past and looking at the old time shops."], ["Reviewed June 3, 2017", 3.0, "it was ok", "its was ok but nice to visit, nice for pictures also.definetely worth to see if you come to san diego"], ["Reviewed June 2, 2017", 3.0, "old town", "The main part of old town is interesting. There are 2 visitor centers - one hi up on top of the hill and the other in the center of the old town building.s If you go to the one in the center they have twice a day tours which give you the history of old town. You pay extra fot ir, but it helped bring everything you saw into perspective. The young man who took us around made the history come alive. This is not advertised. We stumbled onto it.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Takes You Back In Time", "I love visiting Old Town San Diego as it does take you back at a time when the Spaniards were in control of California. The mission style architecture, furniture, decor, and whole place feels like you are brought back in time. I especially like the different shops and the food!!! There seems to be a lot of good Mexican restaurant there. A short walk is the Whaley House. It's supposed to be haunted. I did enjoy that and it did give me goosebumps. Overall, Old Town San Diego is a must visit for those visiting San Diego for the first, second, third, etc. time.\nShow less"], ["Reviewed June 1, 2017", 4.0, "Great Family Visit!", "Lots of good places to eat. Great shops to find all kinds of goods. Good for all ages. The historic town was very interesting and educational"], ["Reviewed May 31, 2017", 5.0, "What a pleasant surprise", "We walked through Old Town and have to say we were pleasantly surprised. What a vibrant, exciting area. Bars, resaurants. music and people everywhere."], ["Reviewed May 31, 2017", 5.0, "Great time at Old Town", "I was with my husband visiting San Diego .. mid of May 2017. we took Uber to Old Town ... our flight was late evening .. we had plenty of time to go to old church .. cemetery .. market .. had lunch .. we saw Old prison .. many gift stores .. we stopped for ice cream and coffee .. we had a lot of fun\nShow less"], ["Reviewed May 30, 2017", 3.0, "Not the best, but not the worst", "There are some great places to eat here but be prepared to wait for the really popular ones on weekends and some evenings.\n\nThere are a lot of interesting shops but they mostly sell tourist rubbish. If you like that sort of thing then you can easily spend a nice early evening here and then have something to eat.\n\nParking is a little bit of a problem so come prepared to drive around a little and perhaps park a few blocks away from the main area.\nShow less"]]}}