{"Old Mission Santa Barbara": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Old Mission Santa Barbara", "url": "/Attraction_Review-g33045-d104226-Reviews-Old_Mission_Santa_Barbara-Santa_Barbara_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/ed/a4/41/mission-santa-barbara.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2320"}, "address": {"@type": "PostalAddress", "streetAddress": "2201 Laguna St", "addressLocality": "Santa Barbara", "addressRegion": "California", "postalCode": "93105-3611", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Queen of the California Missions", "Having lived in California for 56 years and traveled the coast almost annually, we've been to many of the missions. San Juan Capistrano is probably the most well-known because of the swallows and also the most beautiful since it's an active church that was majestically rebuilt. Carmel Mission is the burial site of St. Junipero Serra and Sonoma Mission in the Sonoma Plaza is the northernmost.\n\nBut Mission Santa Barbara resting high atop the city of Santa Barbara is probably the most important for its grounds and the fact that it is the home mission for the Franciscan Friars. We've been to the mission many times but never took the docent tour until April of 2017. The 1-2 hour tour (small fee) is well-worth the effort. The docents are well-versed in the history of the missions, the grounds are incredibly well-kept, the church and associated buildings are well-preserved, and the views are spectacular. Great history.\nShow less"], ["Reviewed 4 days ago", 4.0, "Beautiful church steeped in history", "Spent a couple of hours wondering around the old mission. Using individual headphones enabled you to wonder around at your own pace with commentary informing about the place. Would be much improved if had an individual person rather than headphones"], ["Reviewed 5 days ago", 5.0, "Yes, it is fantastic \"living\" Mission", "Have visited the Mission along most others in California. This is fabulous since in addition to the usual historical significance and its magnificence you can enjoy an outstanding view of the distant Pacific. The parking is good and the fact that is a working Parrish adds to the welcoming feeling. If time allows attend a Service there, it is a unique experience\nShow less"], ["Reviewed 1 week ago", 5.0, "Historical!!", "Spent a couple hours at the Santa Barbara Mission and it was quite pleasant!! Interesting history of the mission and mission system. Plenty of artifacts and things to see-and then a great view of the Pacific!"], ["Reviewed 1 week ago", 5.0, "Mission Critical", "If visiting beautiful Santa Barbara, visiting this mission is critical. History, beauty, and views make it worth attending. Don't miss a drive by at night to see it lit up in the evening. Great photo ops from the rose garden across from the mission provides a full view of the mission.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Another beautiful California mission", "My wife and I visited yesterday on a road trip down 101. I think this is the only mission with two bell towers, which makes it distinct from the others. Admission to the self-guided tour is $7.00 for seniors, which is well worth it. The church is splendid with beautiful paintings and woodwork. We loved wandering around the old cemetery and the surrounding grounds. If you're visiting Santa Barbara I would not miss this mission.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Gorgeous!", "So beautiful! I took the self-guided tour and strolled the Mission and the beautiful grounds. Really beautiful buildings."], ["Reviewed 2 weeks ago", 3.0, "Birthday", "Everyone we encountered were very helpful and accommodating. Gift shop was well stocked. Was able to get Holy Water. Grounds were immaculate. Easy walking."], ["Reviewed 2 weeks ago", 5.0, "Well worth a visit", "A must to visit when you are in Santa Barbara. Also see the video first then take this fascinating tour"], ["Reviewed 3 weeks ago", 5.0, "Amazing Old Mission", "Take a Hop on Hop off Bus tour, and then do a self guided tour spending quite some time leisurely touring the Mission."], ["Reviewed 3 weeks ago", 5.0, "A favorite attraction", "Beautiful grounds and garden in a great neighborhood. The staff is very knowledgeable. The Mission itself is well maintained. I recommend driving there and then driving around the adjacent neighborhoods which are quite nice with some great views"], ["Reviewed 3 weeks ago", 4.0, "Stop by for a stroll", "We visited the Mission on Sunday, and therefore couldn't see the church because the service was being held, but its a very pleasant stroll and provides more information about the Spanish history of California."], ["Reviewed 4 weeks ago", 5.0, "Inspirational Mission", "If you visit the Santa Barbara Mission, please be advised it remains a place for prayer. When I was photographing the interior, I couldn't believe the amount of people who were talking, laughing and otherwise being rude. The mission is a historic structure that features religious icons and paintings in its sanctuary. It also has historical displays that explain the mission's history. I haven't been able to photograph the mission with my pro equipment, but a number of years ago, I did photograph it with a consumer-grade DSLR, so please forgive the photos, which are not high in quality. However, they give you an idea of what the mission is like.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice stop!", "Located in downtown center, this is a good stop to take a breather and enjoy a beautiful view. It is an official state building with running court cases and an amazing court room. Great garden, high tower and cool let you enjoy spirit! A good 30 minutes stop well worthed after a long but fun road trip!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Really nice tour.", "This building really is as old as it seems. We did the whole tour including the movie and the Olive Garden walk. I was surprised to find out that the woman from Island of the Blue Dolphins was at this mission after she was saved. This is worth spending time and money to see Its steeped in history.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "....Could use some updates", "Interesting but could use some updated points of interest. We would have liked to know more about the garden; the day-to-day lives of the priests, etc."], ["Reviewed 5 weeks ago", 4.0, "Quick visit on the side...", "Stopped by just to quick get some pictures before heading out of town. Didn't go on the tour, but the grounds were beautiful. Wasn't too busy on a Saturday afternoon."], ["Reviewed January 22, 2018", 5.0, "Great mission", "Very well put together with the grounds and museum. Nice to wander around the mission and the garden and just be at peace."], ["Reviewed January 22, 2018", 4.0, "Standard mission", "We were going to visit the mission, having been to others we didn't expect anything much different. Issue is that we couldn't find any parking. It was a Sunday, maybe that's why, but there was absolutely no where to park. Disappointing."], ["Reviewed January 22, 2018", 5.0, "Love the SB Mission", "Stunning choir and glorious setting, with beautiful views of the ocean, and much history. Love the Franciscan monks and services. Attend when ever possible!"], ["Reviewed January 22, 2018", 5.0, "STEP BACK IN TIME: View Early Santa Barbara today!", "IMAGINE you are one of the Monks treking the length of California in the 1700-1800's, dependent on reaching one of the Missions for replenishment and safety. From San Diego to Northern CA, Missions were built to establish communities several days apart, as the Monks established settlements across the state. The Santa Barbara Mission and El Presidio were the first significant buildings in Santa Barbara, supporting each other as the community grew. Walk the same tiles as early settlers, see remnants of the successful aquaduct from the Mission back into the foothills of the Botanic Garden; walk around the early water cistern still functional across from the Mission; and discover the inner Mission courtyard, a Memorial to those that came before us. Be delighted with the fantastic ocean view from the steps of the chapel. This Mission is a keep sake, cherished, alive and serving its community still.\nShow less"], ["Reviewed January 21, 2018", 5.0, "DO NOT MISS THIS VENUE WHEN VISITING SANTA BARBARA, CA!", "The Old Mission in Santa Barbara, CA is known as the \"Queen of the Missions\" because it is so beautiful, elegant and imposing inside and out. Beloved Padre Junipero Serra, OFM, the first Presidente of the Franciscan Missions of Alta California Padre Serra founded nine missions, which he located one day's horse ride apart,including The Old Mission and La Purisima Mission in Lompoc, CA. There are regular masses held here (check the schedule), plus many other activities such as the Il Mandonari Festival where artists create chalk drawings on the asphalt, La Fiesta Pequena (first week in 'August)\nShow less"], ["Reviewed January 17, 2018", 5.0, "Peaceful place", "The mission itself is quite impressive. The gift store, the foyer area, the outside landscaping, are all very well done. I did not go inside the mission, but I walked on the Olive Path outside. It is very well done with flowers and a mosaic depiction of the Stations of the Cross. A lovely and peaceful place.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Beautiful Mission", "Didn't expect to stay very long at this site, but what a surprise. Lovely grounds and self guided tour is informative and interesting. A great piece of California history."], ["Reviewed January 12, 2018", 5.0, "Stunning!", "This must be one of the most beautiful and well-kept missions in California. One of the best tours I have taken in the museums. Started with an informative film, then a walk through several rooms with exhibits. I really like seeing the living quarters the friars lived in. Beautiful courtyard, cemetery and of course, the magnificent church. The was a nice gift shop. Only $7 for senior (a $1 discount). Beautiful for photography. After dark it is beautifully lighted for some really nice photos. I am so happy to have finally seen this stunning mission.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Island of Blue Dolphins Lady Buried Here", "This is a great mission to visit - it is gorgeous and has a fabulous view of the ocean.\nFor those California students studying California history - this is the perfect mission to study and visit combining with a read of the book Island of the Blue Dolphins as the main character of that book ( based on a true story) is buried here.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Must see attraction", "The Old Mission is definitely a must see to fully understand the history of Santa Barbara. And the gardens are gorgeous."], ["Reviewed January 7, 2018", 5.0, "Island of Blue Dolphins woman buried here", "Read the book Island of the Blue Dolphins? The main character is buried here. Interesting Calif history site, plus a great place to visit for live animal nativity pre-Christmas and for chalk art at Fiesta time."], ["Reviewed January 6, 2018", 5.0, "Big and Beautiful", "Set slightly apart from downtown this mission is one of the largest and most active we have seen. Beautiful grounds and even more beautiful church. The museum and film were well done and interesting. We were a bit surprised by the $9 entry fee, but the money is going to a good cause ... preserving this piece of California history, beauty, and charm.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Such an Impressive Sight", "Driving up to the mission is beautiful. Enjoy the view from the car but get out and walk around. You can self tour and learn about the mission, then enjoy the gardens. For an extra treat, pack a lunch & picnic in the open area across from the front.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Interesting", "The Old Mission was on our list to visit during this trip and it was well worth it. The grounds are beautiful, the buidings and architecture along with the historical aspect of it is very interesting. The small gift store is packed with various religious souveniers.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Lovely park by the mission", "Mission Park is a small grassy park across from the beautiful mission. While at the mission go across and see the park and its lovely rose garden with beds full in bloom in December! It is a great addition to time exploring the mission."], ["Reviewed December 31, 2017", 5.0, "We took a self guided tour of the museum and the church.", "The information was easily accessible and very informative. Allowed us to get a better understanding of how the area developed and how the native population contributed to the local culture."], ["Reviewed December 30, 2017", 5.0, "A must-see!", "You see and feel history here. The architecture and grounds are beautiful. One needs at least an hour, preferably more, to see everything. It is at the opposite end of town from the train station, perhaps an hour's walk.\n\nPut it at the top of the list of things to do!\nShow less"], ["Reviewed December 28, 2017", 5.0, "wonderfull piece of history", "a must see when you visit Santa Barbara t really is an interesting building with a fantastic history well worth the time to visit he mission and the gardens"], ["Reviewed December 23, 2017", 5.0, "See what California looked like before it was a state", "If you are a visitor to California, make sure you stop here before you leave. Tourists here for Disney, the beaches, Hollywood, etc will miss out on a part of California that was here before the first tourist attractions. The Santa Barbara mission is one of the many mission churches that Spanish missionaries founded in the 1700s and 1800s. The museum does a very good job of handling the situation between the indigenous people who were here, and the missionaries. The missionaries brought knowledge and faith from Europe and the local people taught the missionaries about the land and local food sources. The beautiful church and grounds have withstood earthquakes, fires, floods, etc over the years. If you are Catholic, there is Mass there every day.\nShow less"], ["Reviewed December 21, 2017", 5.0, "On every tourist's must see list, but maybe not yours", "Tourist buses stop here and visitors make a point to go here and so probably will you. It is a beautiful structure and across the street is a rose garden that is pretty impressive. The history of this mission is not as attractive as its architecture. You will notice that it has a prime location and may wonder who inhabited the place before the mission was built and how did it get built. If you are interested in history, like a lot of history, there is exploitation and controversy. If you do visit at night and have a way to get back at night it was well lit and shows itself off quite well.\nThere are events throughout the year that happen here and you might want to check out the Santa Barbara Independent online to see what is happening here and around town. The \"Indy\" is free and comes out every Thursday. If you happen to be in town around Memorial Day or the few weeks afterwards make a point to drop by and see the sidewalk painting. Pretty impressive\nShow less"], ["Reviewed December 21, 2017", 5.0, "See all of Mission - Pay for Tour", "Mission is a must for anybody who visits Santa Barbara. I urge visitors to see the entire Mission. Take tour if available. If not available, pay for entrance to entire Mission property. Then travel towards the mountains in Mission Canyon to see the Botanical Gardens which has a stream, a dam and remnants of Mission water system.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Definitely worth the visit", "Nobody can visit Santa Barbara and not see the Mission! The building and the grounds transfer you to another time. In line with the city's architecture (or the other way round!), it's a walk through the past and we enjoyed every minute of it."], ["Reviewed November 30, 2017", 4.0, "History Personified", "My husband and I took the city bus from the port when we were on our cruise from Vancouver to Los Angeles. We only had a few hours in this beautiful city, and this 18th century mission was a great place to learn a lot of history of the area.\nThere is a lot of history about the native Americans that was very interesting.\nWe did the self guided tour through the mission and cemetery.\nThe location of the mission is incredibly beautiful and very serene!\nShow less"], ["Reviewed November 29, 2017", 5.0, "Interesting and Informative", "Went here with my family and loved it. When I was in grade school we had to pick a mission and build a miniature replica so I have always been intrigued with the missionary settlements and the people that lived there and how they lived. The Santa Barbara Mission has all of the classic design elements and history. You can walk through and get a sense of how life was like then. You can spend all afternoon walking around in amazement.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Serra in SB ...", "A grand example of the string of Spanish Missions set up by Fr. Junipero Serra in early California. Well preserved and maintained by the church. Has a walkthrough Availability to see the old structures - splendid and historically significant!"], ["Reviewed November 26, 2017", 5.0, "surprisingly fun stop...", "self guided tour of grounds, cemetery and church...history area was informative...nice little gift shop...glad we went"], ["Reviewed November 21, 2017", 5.0, "Historic", "Great self guided tour. You can spend 30 minutes or two hours. The church is often in use and not always open for the tour. The third time we stopped the church was open. It was worth the extra effort. Well over 200 years of history in this Old Mission.\nShow less"], ["Reviewed November 20, 2017", 5.0, "The best Mission we have visited in California", "We ended up doing the self-guided tour which was fine as the docent one was not available on Monday. Well worth the price."], ["Reviewed November 19, 2017", 5.0, "A must-see when you visit Santa Barbara area.", "Bill McNamara was our docent (tour guide) for our visit to the Mission. He was a virtual cornucopia of knowledge. Very informative and well worth the $13 price ($11 Seniors)."], ["Reviewed November 17, 2017", 5.0, "Historic and Sacred Space", "A visit to California is not complete without a visit to one of the missions established in the late 18th century. The missions remain a controversial institution. However, history points to the fact that Native Americans were enslaved to the Spanish mission system. The story of Native Americans in California and the role of the missions is sad, and I felt the museum here paints a somewhat accurate picture but not entirely. Still, the missions existed and remain and so does our native Chumash community. I would like to see more inclusion of the Chumash culture at the mission. The fact that the mission is so beautiful shows the artistic prowess and dedication of the Native Americans who actually built and decorated the missions and were an integral part of them. The mission presents a good place to think about and consider this and to contemplate imperialism, exploitation, racism, and the role of faith in all of this in the past and today.\nShow less"], ["Reviewed November 15, 2017", 5.0, "One of the best Missions on the Camino Real", "The location of this Mission is amazing. with wide expansive views out over the ocean to the Channel Islands, and backed by the mountains. Santa Barbara spreads out down the hill to the coast.\n\nThe Mission itself is in very good shape and obviously well cared for. Take the time to watch the free video as it helps understanding the context and local history. Of course, anyone who visits the Missions of California already knows all this, but there are local nuances that the video reveals.\n\nThe mission church and the attached graveyard are the highlights. The colours inside the chapel are golden and warm, and the history on the gravestones is incredible.\n\nOf course, the whole place exists on the basis of invasion by European nations and to say that the mission is built on the bones of the native inhabitants is both figuratively and realistically true. There are, apparently, hundreds, if not thousands, of unnamed native inhabitants buried in unnamed graves in the graveyard.\n\nMake the time to visit. It is as old as anything you will find in California.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Really nice mission", "You get to go through the church, cemetary, mission and mosoleum. In addition, there is a free video offered. The gardens surrounding the mission are gorgeous and the mission is very well kept up. The church us all original"], ["Reviewed November 9, 2017", 5.0, "Very interesting old Mission, church and mission building itself", "It is interesting to take a tour of the mission and seeing part of the inside and gardens etc. You get to get a much better idea of what was when and why, by going on a guided tour. They are not too long, and easy to follow\nShow less"], ["Reviewed November 9, 2017", 5.0, "The \"Queen of the Missions\"", "This mission is one of the best preserved missions out of the 22 surviving Spanish missions. It is beautiful!\n\nGreat tours are available, and it is a magical experience to go there for a Sunday Mass, or especially on Christmas Eve(be sure to get there very early, as has a waiting line)! One of the \"Must see's\" in Santa Barbara!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Around the corner", "Lovely gardens, a must to visit while in Santa Barbara. Take the docent tour and travel through history. Don’t forget to go to the bookstore, good tourist gifts. Take a picture with the Padres, many live and or retire at the mission."], ["Reviewed November 9, 2017", 3.0, "The Old Mission Santa Barbara", "The docent conducting our tour had a cold and you could not hear much of what he was saying. I would recommend taking the tour $22/person, unless you have knowledge of the 21 Missions in California, if so, do your own tour using the free map. If you have an interest in the Missions, you might want to take a docent tour of Mission San Juan Capistrano, the only remaining Mission where Fr. Serra celebrated Mass, and Masses are held in Serra Chapel every day.\nShow less"], ["Reviewed November 7, 2017", 1.0, "Not Your Money’s Worth", "It is good to understand what a museum is all about. Mission Santa Barbara was a mission by the Spanish Franciscans. The establishment of this mission was before California became part of the US in 1786. In 1790, the first buildings were put up.\n\nAccording to the stories, the original purpose of the mission was the Christianization of the Chumash Indians. However, the Mexican government secularized the mission.\n\nWhen California became part of the United States, the mission was turned back to the Catholic Church in 1865. In 1812 a large earthquake destroyed the church. The final restorations, after the following 1925 earthquake, were done in 1953.\n\nOne thing I didn’t like was the entrance fees being stop in proportion to what is being displayed. In reality, they could have fees half of what they are charging now, or even a third less. For a big group like ours, we definitely had to pay quite a big sum for so little artifacts displays and a cemetery(?).\nShow less"], ["Reviewed November 7, 2017", 4.0, "Beautiful mission", "This is worth a side trip to see. The view of the Mission from the adjacent rose garden is beautiful. They have a very nice little gift shop and restroom facilities."], ["Reviewed November 3, 2017", 3.0, "Interesting but not “over the top”", "This is a 200+ year old mission set in a beautiful locale in the hillsides of Santa Barbara. The museum part of it (where the Franciscan monks stayed) was beautifully kept and showed a bit of their lifestyle. Garden was small but pretty. A worthwhile 1/2 hour or so.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Aptly named \"Queen of the Missions.", "The setting and grounds are gorgeous. Having visited most of the California Missions I can see why this is called the Queen. Our timing was such that we heard the mission bells peel. Do try to visit if you are in Santa Barbara."], ["Reviewed October 28, 2017", 4.0, "Beautiful old Mission stays true to its origins re architecture.", "Nice self-guided tour. You can imagine what it was like in early days. Great little gift shop. Nice history of Father Junipero Serra. Gorgeous setting."], ["Reviewed October 26, 2017", 5.0, "Beautiful place and surroundings", "The Old Mission is a great place to visit and to walk around the gardens. Good place for photos with the mountains in the background. The church is interesting and the visitor centre and shop worth a look. You can pay to do a full tour but there is almost enough to see without paying. Easy parking\nShow less"], ["Reviewed October 25, 2017", 4.0, "Enjoyed Learning the History of the Area", "The mission had a self guided tour with video in one room. Even with all the people around, the mission was a very peaceful place. There was a lot of historical information about the Santa Barbara area and the California missions."], ["Reviewed October 24, 2017", 5.0, "Charming Mission", "If you like to visit historical sites, the Santa Barbara Mission is a must see. This is probably one of the top attractions in this beautiful seaside community."], ["Reviewed October 23, 2017", 5.0, "Great tour with docent!", "I visited the mission on a recent trip to see my daughter who lives in Santa Barbara. I decided to go one afternoon while she was at work. I had the luck of getting there shortly before a weekday docent tour with a professor at Santa Barbara Community College. She was really knowledgeable about the history of Santa Barbara and the mission. I would highly recommend spending the extra $4 to go on a docent tour! Really enjoyed my visit!\nShow less"], ["Reviewed October 21, 2017", 3.0, "First time touring this mission - fun to see all the history of missions and CA", "Self tour so you can take as much or as little time as you want. Beautiful grounds, mission chapel so beautiful, but cemetery was impressive with such old graves/headstones. Awesome, huge, Fig tree in the cemetery grounds."], ["Reviewed October 21, 2017", 5.0, "A Photo and Rose Stop", "I stop here every time in Sata Barbara to enjoy the street art and adjacent rose garden. The algea laced fountai is a great photo that i have yet to capture. The varieties of roses and their unique fragrence, some do not have any aroma, are to long for and actully quite educational. It brought back memories of when planted and raised roses in our midwest environment years ago.\nShow less"], ["Reviewed October 21, 2017", 4.0, "A piece of History", "We took a quick tour of this place as we had some downtime before a wedding. I learned that this is the old mission continuously run by the Franciscans since 1786. It was worth wild seeing the old spanish architecture and artifact."], ["Reviewed October 17, 2017", 5.0, "One of the Finest Missions You Can Visit", "The opportunity of taking the self-guided tour through this mission should not be missed. The gardens offer a contrast of blossoming cacti with other plants including an ancient fig tree. The rooms offer examples of art and life in the original mission. One of the first stops is a short video of the mission's history. Among the graves is one belonging to the subject of the book Island of the Blue Dolphin. This is a wonderful experience set at your own pace.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Interesting", "Tastefully done museum. The gardens and cemetery were lovely, quiet, and peaceful. It's wonderful piece of California history."], ["Reviewed October 17, 2017", 5.0, "One of the prettiest in California", "Every age group can enjoy this mission. There's a large church and a smaller chapel. Also on-site, the grave of the Native American girl (true story) in Island of the Blue Dolphins, along with others in a small, pretty cemetery and gardens. Very nice gift shop. Light a candle!\nShow less"], ["Reviewed October 16, 2017", 5.0, "exploring Santa Barbara", "Self-guided tour through history. Loved the roses in the garden and fig tree in the cemetery. Such amazing architecture & a serene church. The antique photos of the Mission were super interesting as well! Over all... Glad we made this our 1 morning in Santa Barbara.\nShow less"], ["Reviewed October 16, 2017", 3.0, "Nice Enough", "The Mission is decent enough to check out. You will end up there without fail. Up to the person to pay for entrance if that is your desire. We skipped on that. Nice for photo's."], ["Reviewed October 14, 2017", 5.0, "It's the best of all the missions", "I love this mission and the church/ cemetery next to it. You get a good idea of the life in that century."], ["Reviewed October 14, 2017", 3.0, "Very nice and an important mission but I like SJC and SLO better", "This is a lovely and important mission in the Camino Real collection but honestly, it lacked the charm of San Luis Obispo or the authentic feel of San Juan Capistrano (yes, I know a lot of it is rebuilt but I still preferred it). The massive fig tree is amazing and the grounds are lovely. Skip the olive grove/stations of the cross---not worth the walk to it. We did not take the audio tour; perhaps that would have made a difference.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Historic Santa Barbara Mission", "This location is so historic for the history of Santa Barbara, the conquest of the Channel Islands and the Catholic Church as the first European residents. I always light a candle for the Saint of Santa Barbara and hope for peace."], ["Reviewed October 13, 2017", 4.0, "Worth a visit", "We were on a short stay in SB and not been before. We had been told the Old Mission was worth a look, so we did. Being British the 4 mile walk from our hotel didn't phase us and gave us the opportunity to wander along State Street to see the many shops bars and restaurants. We were also able to stroll through Almeda Park and experience some of the lovely houses in the surrounding neighbourhood. The Mission itself is quaint and only takes around 30/40 mins to explore (including the 18 minute video). Interesting history though particularly surrounding the various earthquakes and how they affected it.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Quite the Mission!", "It is well worth it to pay the small fee to take a tour! There are recordings and visuals along the way, making it a great field trip idea for students who will pay attention.\nDon't rush through.\nGo in the morning or a couple hours before sunset for beautiful lighting and ambiance.\nShow less"], ["Reviewed October 11, 2017", 3.0, "Very interesting site", "It was an interesting site, full of history. Not to be rushed , but enjoyed. The weather was perfect today, warm , sunshine and the building stood out brilliant against the backdrop of the hills"], ["Reviewed October 9, 2017", 4.0, "Great history at a living Mission", "Really wonderful historic site, and still a working Mission. Amazing to tour and read about the history, even though it definitely white-washes the rather brutal history of what the missionaries did to the Chumash people. Nevertheless a really great day."], ["Reviewed October 9, 2017", 4.0, "Historic", "It's always fun to see how places we visit started. The grounds are well kept and we like touring on our without a guide. Worth seeing in Santa Barbara if you are there for a few days."], ["Reviewed October 8, 2017", 4.0, "Beautiful mission and view", "Visited the mission museum. Very interesting exhibits showing the history of the mission. Beautiful grounds with views toward the Pacific. A must-do in Santa Barbara. Wish we could have taken a more comprehensive tour but not available on day we were there."], ["Reviewed October 7, 2017", 3.0, "Historical Attraction", "We stopped for a self-guided tour at the Mission Santa Barbara that was included with our bus group. It is a Spanish mission founded by the Franciscan order in 1786! So obviously many of the items are very worn or faded due to their age. It was a nice break from the hustle bustle from the other attractions we were visiting.\nShow less"], ["Reviewed October 7, 2017", 5.0, "As always wonderful", "I always visit the mission when in Santa Barbara as it has a lot of history. I love the gift shop. There is a sense of peace in the mission’s well kept garden"], ["Reviewed October 7, 2017", 4.0, "Pleasant", "There is a fee to tour around this mission but inside it was very nice to look around. The additions provide an aesthetically beautiful location."], ["Reviewed October 6, 2017", 5.0, "A must!", "We didn't have a chance to go into the mission but it's definitely a very nice and historic place and there is plenty of parking."], ["Reviewed October 5, 2017", 5.0, "Wow! Start with mass and then tour", "Such a lovely place - well worth the stop and history lesson you will receive. It takes about an hour to tour and is inspiring. If you go to mass (I think it was at 8 in the morning) get directions ahead of time because it is not in the main part of the mission - but for us - a wonderful way to start the day - really enjoyed it.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Historical", "The Mission is such a nice place to spend the day and it delivers you to a special place way back in time."], ["Reviewed October 3, 2017", 5.0, "I Madonnari", "The Old Mission was founded in 1786 on the birthday of Saint Barbara. It is one of a chain of Missions established up the coast of California, linked by the road known as Calle Real. It is beautiful to tour or simply to enjoybthe peace it radiates. From the steps one looks over a rose garde, red tile roofs down to the ocean. On a clear day you can see the Channel Islands. Every Memorial Dayb weekend the Mission hosts I Madonnari, not to be missed! \"Madonnari, or street painters, transform the Mission plaza using pastels on pavement to create 150 vibrant and colorful, large scale images.\" Truly captivating!\nShow less"], ["Reviewed October 2, 2017", 2.0, "Disappipointing", "The mission charges $9 each for a \"self-guided tour\" aka, just to walk inside. $4 to light one of their candles. It is surrounded by walls and there is nothing to see without payment but the outside steps and gift shop. We had recently visit the mission in Carmel, which was free to all and exceptionally beautiful. These fees rubbed me the wrong way and we left.\nShow less"], ["Reviewed October 2, 2017", 2.0, "Unwelcoming, Disappointing", "We made this mission our last stop on what otherwise was an amazing 2-day “missions” trip because it was the “queen” of the mission, but we were very disappointed.\n1. There is an ugly mini-mall style parking lot filled with cars right at the door step of the mission church and all along the front of the mission. Talk about pulling down paradise and putting up a parking lot! Not a welcoming nor attractive entrance to the “queen” of the missions.\n2. Once we got through the ugly parking lot, we tried to get into the mission grounds. We were there around 4:30, and were told that the last tour left at 4:15, and we were not going to be permitted to enter the grounds. The website is not clear, and only stated tour times. Otherwise it seemed the missions was open until 5:15pm. We did not want a tour, so the last tour leaving at 4:15 seemed like it should not be a problem. But it was. I asked if we can just pay and quickly take a few pictures. Answer – No! Why? I guaranteed them we would be out in 10 mins. Still No!\n3. So we figured we would salvage the trip here and at least go into the mission church before the mission closes. Wrong again. There was a mass from 4 to 5 and we were not permitted to even enter the church. I get it this is a church, but make mass from 5 to 6 when you are not supposedly welcoming guests to see the place. This seemed like a poor selection to have a service time. Perhaps a little consideration for the folks who have driven hundreds of miles to see the place would be nice. Starting mass at 5 instead of 4 would be nice for those visitors. But do they care?\nSo after going through an ugly parking lot, being told no we can not even take pictures of the grounds even though there were lots of people still in the grounds, and not being able to even go into the church, we left. Not a fun experience. They get too many people here to care. At all the other missions we visited, the staff were very nice and they seemed to care. Not here. It was disappointing. Hit all the other missions before going here.\nShow less"], ["Reviewed October 2, 2017", 3.0, "It was okay.......", "Unfortunately, half of the exhibit was closed due to a function at the Mission so it did influence my thoughts on the mission. The part that was open was not much and thought it was not worth the half price admission for what we saw (a short film on the history of the mission). If I had to choose between going to the free Santa Barbara County Courthouse or the paid entrance into Old Mission Santa Barbara, I would choose the courthouse. I am returning next summer, and the mission did not make the list.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Visit Old California", "Great pictures at sunrise because the morning sun shines on the facade. This building is reminder of Old California when it was an outpost of Spain."], ["Reviewed September 29, 2017", 4.0, "History of the exploitation of the indians", "Nice location, well maintained. Worth spending a Lille time here and learning how the mission helped the Indians. Slightly one sided story, but still gives you a small experience of the days before the beach culture"], ["Reviewed September 28, 2017", 5.0, "Must Do", "Stopped here when visiting the beaches of Santa Barbara. The architecture and grounds are beautiful. An amazing calm comes over you as you tour through this mission. It is very simple but very very interesting."], ["Reviewed September 27, 2017", 4.0, "Well worth a visit", "Very peaceful when we visited (around 4pm) and an excellent little museum to visit alongside the church and gardens."], ["Reviewed September 25, 2017", 3.0, "Quick stop-off in Santa Barbera", "This was our 2nd stop on our tour around Santa Barbera and it was ok to see some local history but not really my thing,"], ["Reviewed September 24, 2017", 5.0, "The Queen of the missions", "This mission is unique because it rests on several acres of land in a semi rural area. A beautiful fountain greets the visitor. Tours are available and there is a nice gift shop."], ["Reviewed September 22, 2017", 5.0, "Classy Old Spanish Mission", "The old California missions built by Junipero Serra are among the neatest places to visit in California. There is a nice little museum, a mission garden, and a great small cemetery (in which 8,000 Chumash Indians are purportedly buried)."], ["Reviewed September 22, 2017", 5.0, "Beautiful mission, lovely rose garden", "When visiting Santa Barbara the Old Mission Santa Barbara is a \"must see\". The church is simply beautiful. But I must say I enjoyed the rose garden across from the church even more. It has so many colors and varieties of roses. It is very peaceful and lovely to walk through.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Excellent Experience for anyone, especially Native Californians", "For those of us who grew up in CA and studied the Missions and Native American History this is one of, if not THE, best memorials to our State's History.\n\nThe architecture, the exhibits, the grounds, the history are all incredible. As one person who, as an elementary and middle school student, went on a lot of school field trips and family trips to State of CA Historical Landmarks and Parks, I can state unequivocally that time spent here is invaluable, educational and pretty entertaining overall. Yes, there are some somber and sobering stories, however it is our history - if we don't learn from it we are doomed to repeat it, right?\n\nHighly Recommend this and the various tours available.\nShow less"], ["Reviewed September 18, 2017", 4.0, "Well worth a visit, if you're not into the church, certainly the Indian history", "Gives a great insight into California's history and colonisation, even if it's a little \"sugar coated\" around how the Indians were treated. Buildings, museum and gardens are all really interesting"], ["Reviewed September 14, 2017", 4.0, "Spanish Eclectic Architectural Flair", "Gives a little taste of history that dates back to Spanish settlement here in California. Regardless of your religion or beliefs this is a great place for any person to visit. From the Mission it self you can have a gorgeous view overlooking the ocean. You can pay the admission fee and take a walk inside the mission but I'v never done it. I hear its beautiful. This is a great place and the surrounding of this place is a great place to walk around and too take photos.\nShow less"], ["Reviewed September 13, 2017", 5.0, "The Best California Mission", "I've lived near the mission for almost 20 years. I never tire of it and am always in awe when I drive past it, especially at night. It's absolutely beautiful. Take a tour. You won't be disappointed. And make sure to check out the rose garden on the lawn across the road. It's very special when the roses are in bloom.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Beautifully Preserved and Serene Visit", "$9 admission for adults, given a brochure for a self guided tour, you are directed in one direction so can't miss the sights. Don't miss the 18 min audio visual it is informative. Everything else is well posted with information boards and very informative. The church is a working one and closed for mass on Sundays, don't miss the church, is beautiful in its simplicity. Loved the sad story of Juana Maria xx\nShow less"], ["Reviewed September 12, 2017", 5.0, "Amazing outpost", "It is really quite remarkable (regardless of ones religion) that these priests/monks could build such a great place in the middle of no where. Scenic drive nearby."], ["Reviewed September 9, 2017", 5.0, "Sense of History", "We walked around this building one Sunday morning, but didn't go in as a church service was taking place. We were under pressure for time and so didn't stay long, but we were impressed with what we saw. We intend to return on a later visit to give the place some justice\nShow less"], ["Reviewed September 6, 2017", 4.0, "Worth a visit", "Thought the chapel was the highlight. We didn't take a docent tour and may have benefited more if we had. Nice visit and worth a stop."], ["Reviewed September 6, 2017", 5.0, "A calm retreat packed with history", "Well worth the visit to see one of the historic missions. It's location is within easy walking distance from the centre and worth the effort."], ["Reviewed September 5, 2017", 5.0, "The Old Mission Tour", "The Old Mission tour was very nice and informative. I love the way they have preserved the history of the mission as well as the relics. They may not be the oldest mission in California but they have preserved their church and its history. Looking at the museum makes me learn the things that they did in the past. I would recommend coming to this landmark.\nShow less"], ["Reviewed September 1, 2017", 4.0, "Docent tour very interesting", "We enjoyed the tour given by the docent very much, although there was sadly a funeral happening that day so we were unable to fully explore the church and grounds. There is a great deal of history here and it was very interesting to learn a bit more about how California came to be the state it is today.\nShow less"], ["Reviewed August 29, 2017", 5.0, "A Living Relic", "The mission tour is very informative with descriptions packed with detail for every object and site. Worth taking pictures for at all nine stops. Everyone is given a brochure, and if English is not your first language, the staff has brochures in other languages too. Adults cost $9 and students under 17 cost $4. Beautiful pictures to take in the garden and the cemetery. There is also a video that lasts 18 minutes if you feel like learning more. The church and the museum provide more history. The museum details every day life including the living quarters, everyday occupations, and artifacts used. At the end of tour, you will feel that you were actually there, as it is incredibly detailed with facts.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Worthwhile visit", "Beautiful place to visit with an excellent introduction video about the history of the mission. If you're interested in history, art and architecture, I'd recommend. There is an entry fee, but it's reasonable."], ["Reviewed August 28, 2017", 5.0, "Very beautiful", "Great way to learn about the CA missions, tho whitewashed story as usual. Very good condition, lots of explanations. Good parking. Next stop the botanical gardens nearby"], ["Reviewed August 26, 2017", 5.0, "Enjoyable and Educational", "Visiting Old Mission Santa Barbara was an interesting stop on our California Coast Road Trip. I was surprised at how much there was to see at the mission. It is $9 admission for the self guided tour. There is an orientation movie that provides a historical overview of the mission in the chapel. You follow the well marked tour through the mission courtyard,garden,cemetery,priests' former living quarters,church and museum with information boards along the way. The garden is beautiful. There are many interesting exhibits and artifacts in the museum. There are some very old monuments and tombstones in the cemetery. After we finished the tour, we followed the stations of the cross in the grove of olive trees on the mission property. The stations were made of colorful tiles, It was a nice area for quiet refection. There is a gift shop on site selling religious articles and non religious gift items. The restrooms are on the lower level. There is a picnic area on the grounds.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Docent Tour was great!", "Really enjoyed our multi-generational visit with the one hour docent tour. It brought the mission to life in a way we would not otherwise have experienced. Totally worth the $4/person extra fee!"], ["Reviewed August 23, 2017", 5.0, "Nice Historical site to visit", "Walking distance (for the healthy - it's about 2 miles) from State Street the Mission is worth the trip. Purchase the self guided tour and walk through the halls reading and seeing the history of the mission and the cemetery. It is really beautiful!"], ["Reviewed August 22, 2017", 5.0, "Cultural insights of this rainbow nation", "This is a great story of how the founders of modern America embraced the traditions of the indigenous peoples and how they all worked together to create this magnificent historical architecture and place that had to be rebuild and rebuild to withstand the forces of mother nature. Really interesting to see the numbers of native Irish priests and brothers who were part of the founders of this mission and how important it was to the foundation of Santa Barbara.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Visit a part of history", "I highly suggest you read up a bit on this mission before arriving, it will bring it to life as you enter the grounds.\n\nIt's a wonderful experience for the whole family (except those still in strollers).\n\nCome with enough time to enjoy and appreciate each exhibit.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Great place to learn some California history!", "If you are interested in California's history at the time of settlement, then this is a great point of interest to visit. It remains as the only active mission today though over 14 were built when California was re-discovered by the Spanish. The history of the Chumash is compelling and recounts their sophisticated social and economic structures. Catholic doctrine is not so much discussed as is the history of California's people's.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Very interesting and educational", "This is a very old mission with much history. It was only $7 to do a walking tour of the grounds and buildings. There are lots of beautiful flowers in the gardens and a very interesting old tree. The buildings are well preserved and restored. We are not Catholic so much of the symbolism was lost on us, but still beautiful. It is very low key, especially compared to everything else in California. A nice stop on our journey.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Rose Garden so fragrant and beautiful", "I love the Rose Garden down across the lawn in front of the Old Mission. It is planted with so many different varieties of roses, in so many different shapes, sizes and colors, all in little clumps so you can see several of the same type of rosebush.\n\nIn colder climes, roses might bloom only in summer. Here in Santa Barbara they bloom all year round, except for in January and February - and that is because a day of Community Rose Pruning is held there in January, in which people can come and learn the right way to prune roses. By March or so, the blossoms are back, and the roses just keep on blooming until the following January when the plants get pruned again.\n\nThe Old Mission has so many more attractions, too. I think it is one of the best places to visit in Santa Barbara. The Mission is a beautiful place to visit on the outside, day or night, with lovely soft illumination all night long. Outside there is a lovely fountain, a historic water trough where people used to come to wash their clothes, and nice views out over Santa Barbara to the ocean and islands beyond. On the inside you can take a self-guided tour that takes you to many parts of the interior, the central garden, the sanctuary, and the old graveyard.\n\nThe steps of the Mission are a gathering place at certain times of the year, particularly at the sidewalk chalk art festival I Madonnari on Memorial Day Weekend, at the Fiesta Pequena on the Wednesday before Fiesta (always held the first weekend in August), and at Christmas, when a manger is erected outside in front of the Mission.\n\nOf course you can also attend Mass at the sanctuary here, all year round.\n\nI love all of these things about the Old Mission. But this summer, on warm evenings, Oh! The beautiful Rose Garden has just surpassed itself.\nShow less"], ["Reviewed August 16, 2017", 5.0, "When Visiting Santa Barbara....", "When visiting Santa Barbara it is a must to see the Old Mission Santa Barbara. The church is simply beautiful."], ["Reviewed August 16, 2017", 5.0, "Gorgeous Mission", "Definitely a must visit. I visit all missions in California if I'm in it's town. So special! Love all of the California Missions! This is one of the best ones to visit!!"], ["Reviewed August 15, 2017", 5.0, "Decent Experience for History Buffs", "This can be a shorter visit, meaning you can tour the exterior and impressive grounds and gorgeous building. Or, you can opt for the self guided tour, which takes you through the interior of the mission and includes displays of artifacts that convey a lot of the history both of Santa Barbara and of the mission itself. There is no audio or guide; you just walk through the corridors and rooms by yourself at your own pace, so the tour can take hours (slow pace) or 30 minutes (just a quick run-through). The mission is, in fact, something of a museum, which is a great place to be for anyone who likes history.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Interesting to learn the history of Santa Barbara", "Great place to lean about the early history of Santa Barbara with good views and an interesting self walk tour"], ["Reviewed August 13, 2017", 5.0, "The queen of the missions.", "On of my favorite missions, we got 21 missions on El Camino real, Mission Santa Barbara, also known as Santa Barbara Mission, is a Spanish mission founded by the Franciscan order near present-day Santa Barbara, California. It was founded by Padre Fermín Lasuén on December 4, 1786, the feast day of Saint Barbara, as the tenth mission for the religious conversion of the indigenous local Chumash-Barbareño tribe of Native American people. The mission is the namesake of the city of Santa Barbara as well as of Santa Barbara County.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Definitely worth it", "If you have a spare hour or two in Santa Barbara, then do visit the Old Mission. There is plenty of free parking, the admission price is very reasonable and the tour easy to follow. We took the self guided tour which guides you round the mission with plenty of information on boards as you go round. It gives an insight in to California's history as well as the history of the mission itself. The tour includes a video which we watched although others skipped. I suppose if you have no interest in history, then this isn't the place to visit, but we were really glad we went.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Beautiful Mission", "This is a wonderfully preserved old mission of the Early California period. Built in the late 1700's or early 1800's."], ["Reviewed August 7, 2017", 5.0, "Takes you back in Time", "I have visited the mission/church on 2 previous occasions. This past week, I finally paid for the tour. It was 7 dollars for seniors. I had no idea that there was a cemetery behind the mission and a museum until this visit. It was well worth the seven dollars.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Historical location-Worth the stop", "We enjoyed the rich history and self guided tour of this mission. The introductory film was very good at providing the history of this site, the only mission in continuous use in the U.S."], ["Reviewed August 2, 2017", 5.0, "Wonderful Santa Barbara history", "My sister's and I had the Old Mission on our must see list and were not disappointed. Excellent display of history, art and culture."], ["Reviewed August 1, 2017", 4.0, "Well worth a visit", "We found this as part of the not so scenic drive and it's a little gem. Very reasonably priced for the tour and a tranquil place to spend an hour"], ["Reviewed July 31, 2017", 4.0, "Tour Was Good", "Nice visit and fascinating to learn the history of white person settlement in this area. Once again, it's a bummer how we treated the indigenous folks. Th mission portrays it as clearly helping them make a better life, but it sounded like their life was fine before conversion.\nShow less"], ["Reviewed July 31, 2017", 5.0, "An active mission with lots to discover...", "We have seen other missions in CA and most of the missions in San Antonio. They all have their own magic, but this one has a unique vibrancy as it is an active mission in the middle of the beautiful town of Santa Barbara. The chapel and grounds are beautiful. Come marvel in the fact that on a super hot day, the cloisters are very cool.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Worth a visit", "Santa Barbara is home to one of 21 mission buildings established in California by the Spanish as it sought to secure territory in America. It's such a key part of the town's history that it has to be visited by any tourist to get a look at how its Franciscan Monk inhabitants lived, as well as their impact on indigenous people and their culture.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Peaceful and Insighful", "Well worth a visit - worth walking if staying in SB as some great houses and gardens en route. Did the self guide tour and found it fascinating - the place itself just exudes a lovely peaceful calmness."], ["Reviewed July 24, 2017", 5.0, "Nice", "We came here both during the day and in the evening. Well worth a stop at any time of the day. Beautiful place."], ["Reviewed July 24, 2017", 5.0, "Fun while learning !", "The Mission is a remarkable place to learn the history of California settlements. The grounds are lovely and the Mission Church breathtaking. You can either tour on your own, or join a guided group. A very inexpensive way to learn and enjoy California."], ["Reviewed July 23, 2017", 4.0, "Feel the Spanish atmosphere here", "What a beautiful old church this is. Interior is well preserved as well as the exterior. We even managed to attend the Sunday mass, but did not stay long as we were tourists and felt a bit out of place.\nGardens surraounding this mission were well preserved and on a hot day worth visiting.\nShow less"], ["Reviewed July 23, 2017", 5.0, "The largest of the California missions", "The Old Mission is well cared for and worth seeing. Facing a large open space with other undeveloped property nearby, you can at least convince yourself you have a feel for just how impressive this was when it went up. There are wonderful grounds (including an adjacent olive garden), an informative museum, fine art work, and the Spanish mission. Save time to walk through the (separate) rose garden at the other end of the plaza. Great site.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Love it!", "The tour is great, so much history! Less crowded during the week. Don't miss the beautiful rose garden...I visit every year."], ["Reviewed July 22, 2017", 4.0, "Pretty and historical", "Interesting place to visit, you can get some great pictures of the building. Not a place to spend hours but enough just to recognise the historical significance and admire the architecture. Especially liked the little rose garden opposite the front entrance."], ["Reviewed July 20, 2017", 4.0, "A Piece of History", "This mission is so important in the history of Santa Barbara. it is a magnificent structure on a hill with lovely grounds."], ["Reviewed July 19, 2017", 5.0, "A Point of Interest You Don't Want to Miss!", "If you are visiting the Santa Barbara area, stop and see the Living Old Mission and Museum and take the Garden Tour (on your own or with a docent) which is operated by the Franciscan Friars. The Mission is beautiful and is in great repair. The walking tour takes about an hour on your own and includes the Sacred Gardens, the video room where one can watch a brief but very informative video of the making of the mission and the history of the area, cemetery, the church (which has amazing artwork), the Museum, The Fountain and the Aqueduct and of course the gift shop. Make sure you wear appropriate clothing for visiting a church and very comfortable shoes as the grounds are a bit irregular and rough in places. No pets are allowed and neither is flash photography. There is limited handicap access. One of the most interesting things that I learned is that the book, \"Island of the Blue Dolphin\" is based on a true account written by one of the friars of a girl who was left behind by her people for almost 18 years and survived on her own until she was rescued and brought to the Mission where she lived out her days and is buried there. I would highly recommend touring here. As a side note, outside and to the left of the parking lot there is a picnic area and a Meditative Olive Garden Pathway one can walk if one is so inclined and Stations of the Cross. The La Huerta Historic Gardens can only be accessed by calling and making a reservation.\nShow less"], ["Reviewed July 19, 2017", 2.0, "Disappointing", "Very little to see. A minor attraction. Try some other options first. Perhaps if your a history buff you might find it somewhat interesting."], ["Reviewed July 18, 2017", 5.0, "Tour of the Mission on July 4, 2017", "The Old Mission was most interesting. The self guided tour was well laid out and coordinated with the pamphlet. I enjoyed learning about the history of the mission."], ["Reviewed July 17, 2017", 5.0, "Fascinating piece of Santa Barbara history", "Beautiful old mission with a very good self-guided tour. The displays through the various parts of the complex give an interesting picture of the role of the mission from California's early days under the Spanish right up to today. The grounds are lovely, too."], ["Reviewed July 17, 2017", 5.0, "Site seeing", "This Mission is Beautiful. Loved the paintings and artifacts The Church is amazingly Gorgeous! We really enjoyed touring it."], ["Reviewed July 16, 2017", 5.0, "Beautiful church and grounds", "Nice church with interesting history. Great way to spend an afternoon. Plenty of parking. Include it in your must see of California missions!"], ["Reviewed July 13, 2017", 4.0, "One of the most spectacular views of the California mission system", "Beautiful, sweeping views from this \"Queen of the [California] Missions\" are worth the short trip from downtown. Tours are conducted daily by friendly staff. The buildings are in need of repair and greater maintenance which is why one star is lost, but we donated and hope others do as well for much needed repair.\nShow less"], ["Reviewed July 13, 2017", 4.0, "Beauty", "It's $9 per person to get in and it's just gorgeous. So much history on the early settlers and one of the best preserved missions I've seen. It's a must see If you're in the area as it's beautiful both inside and out and doesn't take long to get a good look.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Grand old beauty", "This Mission has a wonderful view of the ocean and is well situated in the city of Santa Barbara. It has lovely grounds and a good museum with artifacts from long ago. You really get the sense of how it was in the 1800's. The gardens are wonderful and the inside of the church is quite lovely. They have a good gift shop and of course the iconic front steps. Pleanty of parking and rates are affordable.\nShow less"], ["Reviewed July 9, 2017", 3.0, "Good to See--If You Have Time", "If you have the time this is worth the visit. This is one of the best preserved missions in California. There is a charge to enter. The path through it does not take long but provides interesting insight into how the area was colonized."], ["Reviewed July 8, 2017", 5.0, "Beautiful Old Mission", "Found this Mission to be absolutely beautiful outside and in! Located a short walk from the main street in Santa Barbara (State Street), this mission is a gem! It's obvious that the caretakers love this mission as it is in such good state and more colorful than I expected. The church itself is open to the public. There are also self guided tours ($9) and guided tours ($13) to let you get the full experience. We were lucky enough to catch it during an art festival to boot! So lots of activities outside and people milling about. If you're into Southern California missions, then this place is a must!\nShow less"], ["Reviewed July 8, 2017", 4.0, "Well conserved Misdion", "Tour available, beautiful mission with lots of explanation. Could not go in the chapel until mass time at 4 or with purchase of tour."], ["Reviewed July 8, 2017", 4.0, "My 93-yr-old father-in-law enjoyed it also", "I had been to \"Mision Santa Barbara\" (how they write it Spanish). But that was many years ago. They have since organized the tour a bit: There is a one-way route, and they end (of course) with the gift shop.\n\nMy father-in-law was using a walker, and there were very few places where he could sit down for a short break off his feet. Though he said he was fine at the time, later I heard from my wife that he was fairly exhausted.\n\nBut he did enjoy the tour, as did I. it was a Saturday, and we were waiting for a break in the too-long video, when a nice volunteer guide lady alerted us that it was getting close to Noon. On Saturday (and Sunday?) the church proper is placed off-limits for tours, as they have services (weddings, funerals, etc.). So we broke off our plans for the video, and toured through the sanctuary.\n\nAfter finishing the tour (through the Museum, ending in the gift shop, right?), I asked the ticket-taker if we could go back to see the video, which she allowed us to do.\nShow less"], ["Reviewed July 8, 2017", 4.0, "Interesting visit", "We have visited most of the missions in California and have enjoyed the history of them. The Santa Barbara mission is a good one to visit because you can get a good feel of the history and how it might have been living 200 years ago. While each mission is different there is a basic theme. So if you are into history this is a must stop if you are not then there are many other attractions in the area. The mission tour guide was very knowledgeable and well worth while. The church is still active and the facilities are in good shape. Also the area is pure California which makes for a beautiful setting. It takes about two hours to properly visit the mission and well worth it.\nShow less"], ["Reviewed July 7, 2017", 5.0, "History at its best!", "The old mission of Santa Barbara is one of the most iconic of them all, specially because of its elegant and large gardens. They have a museum inside (small fee) and you get to walk inside the grounds and visit the cemetery.\n\nThe church is still in use and regardless of your beliefs is a nice quiet place to visit.\n\nFrom state street is only about 5 to 8 minutes away. Busy on weekends, but they have a large parking lot. The gardens have a large collection of roses with benches and a large lawn to share a family picnic.\n\nComplement your visit to the mission with other historical sites in town - like the Casa de la Guerra, the presidio and the Santa Barbara History museum.\n\nWant to relax - enjoy a session on the Salt Cave right on state street and casa de la guerra st.\nShow less"], ["Reviewed July 7, 2017", 5.0, "History of California", "Historical site with a beautiful active church. We actually watched a wedding service while visiting. It is the 10th mission in California, beautiful gardens and very well kept structure."], ["Reviewed July 7, 2017", 5.0, "Eye opening", "I wasn't sure if my kids would get bored at the mission.But they had a great time! They enjoyed the grandure of the Mission as we drove up. They liked the gardens and the mission cemetery. They were liked the museum with the artifacts."], ["Reviewed July 5, 2017", 5.0, "Beautiful mission and historic!", "The mission is just gorgeous. We took the self guided tour. It's $9/person. You can go at your own pace. So much history on the early settlers and their interactions with the local Chumash people. It's a must see If you're in SB."], ["Reviewed July 5, 2017", 4.0, "Worth a Visit", "Definitely worth a stop during any visit to Santa Barbara. It's a beautiful building and a great intro to the region's history."], ["Reviewed July 5, 2017", 4.0, "Mission SB", "We have visited July 3 and it was not too busy. The entrance fee was $9 for adults. We spent a couple of hours there on a self-guided tour. The grounds and the historic exhibits were very nice, as well as the 18-minute video. Quite a bit of attention was given to the Chumash Indians, as should be. They never really said that the Indians were slaves but were trained in work details. And I didn't see any Indians buried in the cemetery.\nThe Rose Gardens and the interior gardens are beautiful. The chapel inside had beautiful artwork. The Mission is definitely an important part of California history. It's not to be missed.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Necessarily to be seen", "Calm place in a haste world. In a church you can see the great sculptures. Old cementery. Piece of history."], ["Reviewed July 3, 2017", 4.0, "Nice outing for a couple of hours", "We had a nice afternoon at a very interesting historic mission. They had a recent sidewalk chalk art display on the plaza in front of the cathedral that was entertaining too."], ["Reviewed July 2, 2017", 5.0, "Excellent Tour", "The tour is self guided and includes the gardens, an 18 minute video, cemetery, church, and museum. Pictures can be taken but with no flash. Allow one hour for the tour. There is a gift shop at the end of the tour. Bathrooms are available before you enter on a lower level. I especially enjoyed knowing that this is a living mission of Franciscans.\nShow less"], ["Reviewed July 1, 2017", 5.0, "Charming & Historical", "From the expansive rose gardens out front to the historic mini-museum within, the Mission offers a poignant view into California's complex religious & cultural history. Lovely gardens, classic California architecture & sunny gardens make this a worth-it stop if you're in the area."], ["Reviewed June 30, 2017", 5.0, "Lovely Santa Barbara", "We took friends from out of town to the mission for a picnic on the lawn. It was warm and lovely out. It was the perfect place to enjoy a Saturday afternoon."], ["Reviewed June 29, 2017", 5.0, "So glad we went!!", "Best time to visit is at before sunset. Although the gift shop and mission itself was closed when we went it still was spectacular! I would definitely pack a picnic for lunch or early dinner and just hang out on the grassy park area."], ["Reviewed June 28, 2017", 4.0, "this is Father JUniper Serra missions along the CA coast", "pay the fairly reasonable admission fee and self guided tour via leaflet - interesting to past time and parking was OK , but I can see this to be crowded , if lots of people come at once."], ["Reviewed June 26, 2017", 5.0, "Authentic Cali", "Longest continuous mission in California. Self guided tour of grounds & museum just enough to keep interest of teenagers. Highly recommended."], ["Reviewed June 25, 2017", 3.0, "Nice Museum about the old Mission", "This mission was destroyed in 1925 and rebuilt in 1927. The current museum presents a detailed history of the museum and how the Jesuit Missionaries worked with the local Indians. Still a working mission."], ["Reviewed June 23, 2017", 5.0, "First time visiting", "You have to visit this mission. Lovely, historical, informative. Love the huge fig tree in courtyard. Well kept up. Museum was so interesting. California history at it's best."], ["Reviewed June 23, 2017", 4.0, "Beautiful", "We visited early in the day, before it opened. The grounds and building are beautiful. Would have liked a tour."], ["Reviewed June 23, 2017", 5.0, "Santa Barbara Misdion", "Founded in the 1700s, Santa Barbara Mission is still an active Catholic Parish. The self guided tour was a history lesson about the missions in California with many artifacts on display in the museum. Visitors can take as long as they like in the mission as the tours are self guided. Be sure to watch the 15 minute video at the beginning of the tour as it explains the history of the mission. A small gift shop is also a part of the museum. I would definitely recommend visiting Santa Barbara Mission.\nShow less"], ["Reviewed June 22, 2017", 2.0, "Old mission pics", "Went before the crowds arrived. Wouldn't rush back there to be honest. Santa Barbara has plenty of other things to see"], ["Reviewed June 21, 2017", 5.0, "Required visit in Santa Barbara", "This mission encompasses the history of Santa Barbara, California missions, the story of the indigenous people of the area. The grounds are spectacular. Try to visit when the chalk art covers the area in front of the mission."], ["Reviewed June 19, 2017", 5.0, "Beautiful & Fun History", "From the lavenderia to the chalk paintings by locals in front of the mission, take the time to stop here. California history at its best. Inside tours and shops close at 4:30ish, but the photo ops with Friars Tubby, Jellybean & Thumper remain available until dust in the arched breezeway Fun for all ages.\nShow less"], ["Reviewed June 19, 2017", 4.0, "If self guided, watch the short video", "If you do the self-guided tour, definitely stop to watch the approximately 18 minute video on the mission. It provides an good (but brief) overview and history. If you have time it's worth a visit."], ["Reviewed June 14, 2017", 4.0, "Great location, view, and historic building.", "I've visited several of the California missions and this one is sited so well with views all around. Just nice to be there. Good location history lesson."], ["Reviewed June 13, 2017", 5.0, "Missed opportunity", "Make plans to visit here when it is open\nIt closes at 5pm. I would imagine the history is good to read about. The building has been well preserved on the exterior. There is a park directly across the street that would be a great place to picnic with family and friends.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Amazing History", "We went to visit the Mission after-hours. So, we did not go inside. The outside is beautiful. We looked up some history on it while we were there (we knew nothing about it) Compared an old picture from when it was first built.. it is amazing the architecture and structure are still very much alike hundreds of years later. We will go inside when we visit next time.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Great place to see", "Beautiful grounds and excellent museum. The tour was worth the time and money. I am writing more beach use TripAdvisor won't let me submit with the initial two sentences if that is not enough for you then read another review"], ["Reviewed June 11, 2017", 5.0, "The iconic California mission", "Beautiful well restored and maintained California mission. It is an essential part of California history. A must see for a Santa Barbara visit."], ["Reviewed June 11, 2017", 5.0, "One of the best missions in California", "This is the only mission in California that is still functioning as a church. The Franciscans still live on the property. The architecture is beautiful and in great condition. The grounds are lovely. Some great history displays. One of the best spots to visit in SB.\nShow less"], ["Reviewed June 10, 2017", 4.0, "Interesting..", "Interesting place to visit - worth a look around and the entrance fee. Definitely head to the botanic gardens too if you are up this way!"], ["Reviewed June 6, 2017", 5.0, "A visit to remind one of basic needs", "Apparently wherever the Spaniards went, they built two things--a fort (presidio) and a mission. There was obviously a symbiotic relationship but clearly the missions are always spartan in comparison.\n\nThis is one of the best preserved missions and a good visit to remind one of what is necessary in life. Which of course is in contrast to the Hearst Castle, which is a reminder of what one does not need to live the good life.\nShow less"], ["Reviewed June 6, 2017", 4.0, "History is great", "The Mission isn't chock full of things to see and do, however if you like history it's worth the $8.00 admission. It's about an hour or so to tour the grounds. There are beautiful sites in their chapel and the cemetery is history laden. Outside of that, it's fairly benign and kind of boring. I would recommend a guided tour to get more of the history. All that said, there are great pictures to be had outside, and the drive to the spot takes most through high $$ real estate.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Really cool and informative!", "This was my first visit to any of the California missions and I really loved it! The building itself is beautiful but the best part is the courtyards and gardens. The woman at the gift shop was very friendly and we had a great conversation about piano music, I didn't get her name but she was great!\nShow less"], ["Reviewed June 5, 2017", 4.0, "Old Mission on the Camino Real", "This little mission is not as well-known as San Juan Capistrano but it is still standing as one of many missions built to provide religious comfort to the inhabitants of that area. This mission seems to cater to children."], ["Reviewed June 3, 2017", 3.0, "Some history", "One of the places to visit in SB. Nice drive up where there are nice views of the surrounding area. The old Mission is an iconic landmark."], ["Reviewed June 3, 2017", 5.0, "One of Father Junipero Serra's crowning achievements.", "Long before the internet and all of us Father Junipero Serra made his trek along the California coast creating missions along the way. One of the finest is in Santa Barbara. Many events go on throughout the year outside of it. Today was a dog event and last weekend was the chalk event. Great grass plot of land adjacent to the mission to just hang out for a few hours and soak it all in. One of the local wonders not to be missed.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Street Painting", "we go here often always bring people from out of town here and We have been to the Chalk Drawing event a few times just wanted to post it this time to encourage anyone to go see this if you haven't"], ["Reviewed May 29, 2017", 5.0, "Great place", "It is a little far from the train station. However, it is totally worth to walk about 40 min from downtowns Santa Barbara to visit the place. It has more than 200 years history behind the place. One of the place that I recommend for people to visit Santa Barbara.\nShow less"], ["Reviewed May 29, 2017", 5.0, "History place", "Beautiful and historical place . Lots of tourists with a beautiful gift shop. Affordable entrance ticket. You can either have access or just walk around and about the property."], ["Reviewed May 28, 2017", 5.0, "An interesting place", "We visited this site on Memorial day weekend. The Mission is interesting, The outside has doric columns. The gardens are peaceful and beautiful and nothing beats the Californian sunshine, so bright and warm. The highlight was that we visited during Memorial Day weekend and we were able to watch sidewalk artists creating beautiful drawings! It was a lot of fun\nShow less"], ["Reviewed May 27, 2017", 3.0, "Queen of the Missions?", "This mission was fine, but I didn't think it lived up to its name as \"Queen of the Missions. I was expecting a little more.\n\nThere was a sidewalk chalk festival that may have detracted some from the outside ambience of the mission. This occurs over Memorial Day weekend.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Historical landmark", "This was a very interesting landmark and beautiful church. I learned about the Chumash people and the Franciscans who had great influence along the California coastline."], ["Reviewed May 27, 2017", 3.0, "chalk festival", "we visited during the chalk festival which was crowded and lively. The mission is impressive although not the original, rebuilt several times. There is a lovely rose garden and green space just in front to enjoy and the chalk artists were numerous. Nice view of the mountains and ocean.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Beautiful", "We returned to Santa Barbara for the express purpose of visiting this Mission. It did not disappoint. There is a lovely video covering the history of how the mission came to be, and the background had detail that we recalled when we toured the property. It is wonderfully maintained and there is a distinct aura of peace and tranquility. So glad we took the time to see this old mission.\nShow less"], ["Reviewed May 23, 2017", 4.0, "Interesting", "I love touring historical places. This is a very old place for the US. It reminded me of old churches in Italy- you can definitely see the old European influences here. The building and grounds are beautiful and make for great photos. Also don't miss the rose garden across the street.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Beautiful and Full Of History", "I highly recommend all to visit the Old Mission. In fact each Mission is a day of walk from each others. The chapel is"]]}}