{"Old Town Temecula": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Old Town Temecula", "url": "/Attraction_Review-g33165-d605085-Reviews-Old_Town_Temecula-Temecula_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/ef/a8/bc/old-town-temecula.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1565"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Temecula", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 1.0, "Not Worth the Time!", "Staff at our winery tour said we should definitely visit Old Town. So we drove down there, what a disappointment- a bunch of newer buildings, all with an antique type facade stuck on their front. Nothing old or historic about this place. More like a classic tourist trap. The usual cheesy gift shops, candy/ice cream shops, clothing shops, olive oil and soap, candles, etc. plus some bars and cafes. All with high prices... simply not worth your time and money. Nothing unusual or novel; a waste of time, Don’t bother to stop.\nShow less"], ["Reviewed 3 days ago", 3.0, "Ok for walking around", "It was ok. Had antique stores and other venues. A been there done that type. Not much for me. Everyone else loved it. I enjoyed people watching. Did find a good place for food. The Bank."], ["Reviewed 4 days ago", 5.0, "Fun", "Many shops and restaurants and fun. I enjoyed the quaintness of this strip, I ate at a bar and grill (forgot name) and it was very good."], ["Reviewed 6 days ago", 5.0, "Loved it!", "We walked around old town Temecula when visiting for the Diva Run. This place is just fun. They had the cutest shops and really good restaurants. Also the vibe in the area was so nice. People were just relaxed and happy."], ["Reviewed 1 week ago", 4.0, "Dave some time to look around", "Nice place to shop with a variety of shops, bars, and eating establishments. We spent 3 hours and needed more time."], ["Reviewed 1 week ago", 4.0, "Lots of Cool Stores Within Short Distance", "We LOVED the Olive Oil company store on the main street. Great olive oil products and the olive tasting experience was quiet educational. Their olive oil moisturizer stick and lip balms are richly moisturizing (and they DO NOT smell like olive oil but, whatever oils they had added to them - e.g., lavender, etc.).\nAlso, the \"Temecula Lavender\" store is an AROMA Therapy experience just by walking into it! It has ALL naturally scented lavender lotions and products but, I just love the \"whipped shea butter\".\nShow less"], ["Reviewed 1 week ago", 5.0, "Great local shops", "Had lunch at a Mexican restaurant that was formerly a bank.Good portion size and quality food. Purchased items at the Farmers Wife Mercantile and another shop near it."], ["Reviewed 1 week ago", 3.0, "Busy place", "Went to Old Town Temecula for lunch, lots of traffic, very busy, parking is an issue as is trying to get across the street. The shops are quaint."], ["Reviewed 2 weeks ago", 4.0, "Quaint town", "Many restaurants but not alot of shops. Also no overview of the history of this area although it was established in 1859. A bit under whelming as i was hoping for a village or small town atmosphere ."], ["Reviewed 2 weeks ago", 3.0, "Resurrected Frontier Town with Restaurants.", "They have taken the old town center and rebuilt it as a frontier town from the 1850's. The buildings are neat to look at, the sidewalks are faux-wooden planks. Lots of restaurants."], ["Reviewed 2 weeks ago", 5.0, "New Old Town", "Great area for people, bikes antique and muscle car watching, lots of shops tons of bars, saloons, restaurants. A fun place on the weekends as well as week nights."], ["Reviewed 2 weeks ago", 4.0, "Fun Place to Visit", "Visited with family and had a great time! Lots of places to eat, live entertainment in some. Old West style street fronts and wooden walkways give great atmosphere. Nice shops to browse through and just enjoy a day out."], ["Reviewed 3 weeks ago", 5.0, "So much to do!", "We had been out in wine country on Winery Hopper and were dropped off in Old Town. We decided to explore the area...what a terrific little town! There were so many great restaurants and bars. We will definitely have to come back!"], ["Reviewed 3 weeks ago", 5.0, "Fun and quaint town", "Great shops of antiques, clothes, restaurants and tasting rooms of wine to olives and olive oils. We just wish we would have had more than one day to explore this sweet town and hope to return some day!"], ["Reviewed 3 weeks ago", 5.0, "Great Western Atmosphere!", "Lots of boutique shops, independent restaurants, old fashioned western style buildings and live music on weekends. The Swing Inn Cafe has good home style food with an extensive menu."], ["Reviewed 3 weeks ago", 4.0, "Try and avoid crawling traffic and crowds on weekends", "Had breakfast here before returning home after a couple of days in the wine country. On a Saturday parking was a little challenging. Shops a bit touristy but never the less interesting. There is still a sense of history."], ["Reviewed 4 weeks ago", 5.0, "Great Place to Hang Out", "Old Town Temecula has something for everyone, good restaurants, great food, good bars, good shops for clothes, antiques, olive oils, ice cream, and almost anything. It’s a popular place any day of the week, even a great place just to take a stroll. Finding a parking spot can be trying at times. Don’t know anyone who doesn’t enjoy their time in Old Town Temecula.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Busy on Weekends !", "We did a Sunday morning and it was a busy area - parking is extremely hard and limited - love the shops and restaurants- worth a visit if in the area !"], ["Reviewed January 24, 2018", 2.0, "couldn't find a parking spot", "so can't say much except it's a relatively quick drive thru. And we were there in January. Can't imagine what it would be like at peak season!!"], ["Reviewed January 24, 2018", 4.0, "Fun place to visit", "Had lunch here at Goat and Vine. Very good! Food was good and service great! Waitress told us about the different wineries. Good advice!"], ["Reviewed January 24, 2018", 5.0, "Well done!", "Temecula is creating a new old town and doing an excellent job. It is not full of plastic and Disney decor but tries to maintain the appearance of the old streets. Jazz music and wine tasting shops set the mood. We want to return and sample some of the restaurants, shops and wine.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Great attraction stop in Temecula", "It’s a great historical place to visit with plenty of shops and eating to choose from . There is a farmers market there on the weekends as well as parades and different events throughout the year."], ["Reviewed January 22, 2018", 5.0, "Antiques Shopping", "Sadly the downtown is being taken over by \"Bistro's\" as are most towns like this, i.e. Ventura, Orange. There are still a few larger stores left for browsing or purchasing if you find that special treasure as we do most of the time we visit."], ["Reviewed January 22, 2018", 4.0, "Pretty Cool Area", "Ended up here while I was looking fro a restaurant. Very cool area, lots of restaurants and bars. Parking is at a premium, but if you find a place, stay awhile."], ["Reviewed January 22, 2018", 5.0, "Classic Old Town feel", "Wonderful place snuggled behind the hustle and bustle of the city. Sneak away to a town where old time ice cream and taffy are still made. You may find yourself going down memory lane as you walk inside the Antique shops. This town has a family friendly vibe. We were delighted to watch talented performers on the corner on this particular visit. We tipped them generously because they were really good! They have many different resteraunts for all kinds of eating habits and if your staying in town for a visit I recommend Pachenga for a seafood dinner! Yummy! Old town Temecula is a great and safe place to drop off your teens so they can walk up and down the street shopping and talking with friends and be entertained by the crowd and vibe. Mom and Dad can stop in and take a much needed seat in one of the local eateries for a meal or beverage of choice and a relaxing conversation with just the two of you while the kiddos check out the shops! Enjoy your visit to Temecula\nShow less"], ["Reviewed January 22, 2018", 4.0, "Very cute town!", "Loved walking around old town Temecula. Xmas lights made the visit special. Most of the shops are geared for tourists. Glad that we opted to dine away from the center."], ["Reviewed January 21, 2018", 5.0, "A perfect way to spend the day", "Charming stores. Lots of great snacks and samples and yummy places to eat. Sample wines from the region and the wares from over 20 micro brews. There is always a concert or an event. Old Town has something for everyone including the kiddos at Penny Pickles Children's museum.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great area to visit", "Old Town is a cool place to walk, visit, shop and dine. Lots of cool restaurants. Many great shops. Can be hot in the summer, so beware. Close to wine country. Make it a day trio and enjoy."], ["Reviewed January 20, 2018", 5.0, "House shopping", "We decided to investigate a relocation to Temecula from Las Vegas....Visiting Old Town was part of our exploration......a quaint boardwalk throughout the shopping & restaurants lining main Street added character.\nThe restaurant selection is diverse and the antique mall offers exceptional glimpses into our 20th century....\nShow less"], ["Reviewed January 16, 2018", 4.0, "Lovely tourist one street town.", "Nice feel to the whole Old Town, full of eateries, bars and interesting shops offering antiques, gifts, clothing, etc, etc. Bring plenty of money with you."], ["Reviewed January 14, 2018", 5.0, "Dining Out Fun", "Busy little street bustling with an array of restaurants and bars. Probably a good idea to Uber here so you can partake in all the spirit options too.\n\nLocal shops too! From clothing to t-shirts to gifts. Oh, and a must is the Temecula Olive Oils. Try the array of flavors then I suggest buying for self or for gifts. Love the basil one.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Wow never knew this was here.", "Ok, I graduated from high school down in San Diego nearly 50 years ago. Temecula was a sign on us 395 with the name on both sides. Never stopped, never visited. Had no idea. What a neat little town strip. Many cool businesses. You need to plan a couple hours to walk Main Street then enjoy a meal at one of the great eateries.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Great place", "Great place to drive threw and walk with it all light up at Christmas . Nothing has changed same cute little strip . The traffic is slow . But such a neat little drive and to see everything . Tons of stores and shopping ."], ["Reviewed January 12, 2018", 3.0, "Brief visit", "We enjoyed our time there. Nothing really unique; lots of shops like ones you expect in any tourist area, but pleasant and friendly. The Cheese Shop was the highlight of the day."], ["Reviewed January 11, 2018", 5.0, "What a fun place to look at all the stores and have a meal!", "We love old Town Temecula. There is something for everyone. Quaint and fun and unique stores and boutiques. Wonderful restaurants and fun bars and wine tasting. All in a span of a few blocks. Weekends are very busy. Just find a parking spot off the main street and then enjoy walking around for a few hours.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Fun in Old Town!", "Great Food and shopping, with a relaxing atmosphere. Amazing night life too with many options depending on your mood."], ["Reviewed January 3, 2018", 5.0, "Enjoyed a great day shopping!", "Lots of shops, ice skating, food and beverages to spend the day in Old Town before we went on some winery tours in the afternoon."], ["Reviewed January 3, 2018", 4.0, "Great to walk around", "Old town is a fun experience whether with friends or family during the week or a weekend. Parking is at a premium.\nIt's lively & bright, filled with music and chatter and the smell of grilling as you walk down the street.\nIt's fun to take pictures by the little vintage shops, or grab a coffee and ice cream as you browse the souvenirs.\nIf you crave Mexican food or sushi or have any Mediterranean lovers in your group you will find something for everyone.\nOnly negative is that there don't appear to be any public bathrooms!! And that is a large drawback!\nGoing to old town for a day is a great way to experience something different.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Charming area with so many food and beverage options!", "I did not get to experience Old Town the way I hope to in the future because it was chilly and we were on a bit of a schedule, but I really loved the atmosphere and that there were so many great options to stop and have a drink or grab dinner.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Nostagic atmosphere", "Old Town Temecula is a mix of older and new buildings. There is a push to preserve the older buildings and the architecture is sort of western late 1800s. The newer buildings respect the older architecture and blend in rather nicely. The Civic Center is beautiful and has provided much needed off street parking. There is an abundance of quality restaurants and stores. Was quiet on Christmas day when we visited but would be a very bustlling place to visit any other day.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Love it", "Wife and I went to old town to look for decorations for house. There are many places tucked into corners that you can spent a good part of a day shopping. As most places you have to watch prices and know what is a true deal. I like being able to support local shops and sometimes just bust the amazon craze. These places are our neighbors. Go here and shop and eat.\nShow less"], ["Reviewed December 31, 2017", 3.0, "Temecula’s Old Town", "Old Town is quaint but crowded. Parking is limited and traffic is slow. Not worth the higher prices."], ["Reviewed December 30, 2017", 4.0, "Interesting", "The flavor of Old Town Temecula is western. The old town stretches along a Main Street with shops. The variety of shops was not great though there were a few unique places. The traffic though is continual and makes crossing the street a bit of a challenge. There are several places to eat on the Main Street or on the side streets. There is an ice skating rink up by the City Hall which surprised me for the hot December day we were there.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Front Street holidays", "Front Street in Old Town Temecula is a great place to go look at holiday decorations and enjoy beautiful views. The rest of the year it’s a place for lots of fun, things to eat, sites to see, and it is just generally a happy spot. Car shows are fun. Try breakfast at the Swing Inn.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Looking for a meal", "Two work mates needing a meal and look what we found! Spectacular! The street was all dressed up for Xmas and looked gorgeous. Lots of eating options- bars or restaurants - & music. Great spot."], ["Reviewed December 27, 2017", 4.0, "A delightful small community for shopping, dining, drinking, people watching,", "Definitely plan to spend a few hours strolling through this charming small town center. Multi-generational - everyone will be happy campers"], ["Reviewed December 24, 2017", 5.0, "You may not want to leave!", "I absolutely love Old Town Temecula. I discovered it for the first time when a friend was teaching a summer ballet camp nearby and asked me if I wanted to come down for two days to hang out with her.\n\nTemecula Olive Oil comany offers olive oil and vinegar tastings of their delicious oils and vinegars (you can also tour the locations where the olives are grown) and cooking classes are also occasionally offered through the shop.\n\nThe staff is so sweet and helpful and the tasting is a very special occasion!\n\nThere are also luxurious products made from olive oil for sale in the shop.\n\nThere is a tremendous children's museum in Old Town that's quite interactive, and wonderful shops of many kinds, great restaurants (I've eaten several times at Public House and at 1909, and many years ago there was a great gelato shop in Old Town but it is possible it's moved since.\n\nThe farmer's market on Saturday is fantastic. I love the fresly made ceviches that come with tortilla chips, the salami man when he is around, the various flower sellers, the yogurt seller, the hot food, the artisanal brittle creator... too many to count!\n\nAnd the Temecula Museum is right by the farmer's market.\nShow less"], ["Reviewed December 22, 2017", 3.0, "Trying too hard, even in the home of Disney", "Spent an afternoon visiting. Some of the shops were interesting but felt more tourist trap/theme park than historical. Antique shops were intriguing, got a nice coffee at a place called Starbucks and saved a wad on my favorite Scots Whisky at the local Liquor Store. All in all, a pleasant experience. Just don't set your sights too high.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Quaint setting", "We enjoyed strolling the streets even though we are not big shoppers. There are many places to stop and rest, neat little shops and places to eat. Dog friendly, with water dishes and treats at several of the shops."], ["Reviewed December 21, 2017", 5.0, "Great place to explore And enjoy. Great food and wine I highly recommend it", "Great place to visit and enjoy . Great food I highly recommend it make it your next trip for dining and great wine."], ["Reviewed December 21, 2017", 3.0, "A relaxing Sunday afternoon.", "We visited the area after a day around the wineries (hint: use uber to go around the wineries and only visit 3 as 4 can be too much)\n\nThe main street has the feel of the old western style building and is worth spending the later afternoon walking around. After main street go up and have a look at the civic centre and then find a bar and watch the cars cruise the drag.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Fun area to visit and enjoy", "This is actually a fun spot to visit during the week or on weekends. Be advised that the weekends are quite crowded. If you prefer less of a crowd and are able, you may prefer weekdays and week nights. There are many restaurants as well as boutiques and specialty shops. Plenty of options for wine and beer too. There is a public parking garage which helps a lot if you cannot find on street parking.\nShow less"], ["Reviewed December 21, 2017", 3.0, "Wooden sidewalks are very uneven.", "There are some good restaurants and in the summer/fall there are bands playing outside but the sidewalks are hard to navigate in high heels. In December there were several more empty buildings than when we came in the fall."], ["Reviewed December 21, 2017", 5.0, "Walk back in time", "Old Town Temecula has grown by adding numerous upscale restaurants with varied menus. Something for everyone as you walk along wood-plank sidewalks and enjoy a slower pace while browsing the boutiques."], ["Reviewed December 19, 2017", 5.0, "Great place for dining and the wineries are great", "There are some really lovely restaurants in Old Town like devilicious. There are so many wonderful wineries nearby. My favorite is Miramonte. Lovely views, great staff."], ["Reviewed December 12, 2017", 4.0, "Lunch and window shopping", "Great atmosphere, nice shops, and many very good places to eat. We had lunch at Rene's Cowgirl Cantina twice and the burrito's we had were great as well as the chips and salsa. Waitresses both times were great."], ["Reviewed December 9, 2017", 5.0, "A nice way to spend a Saturday afternoon", "After winery tour decided to spend the afternoon in town. A really quaint Main Street with restored buildings offering a range of shops and places to eat and drink.\n\nWe sat on the veranda of a bar and watched the world go by. Clearly this is the place where old cars and motorbikes are driven up and down the Main Street for all to see.\n\nWorth a visit for a short time.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Holiday Taste of Old Town", "What a fun evening. Old Town Rotary held the annual Holiday Taste of Old Town last night and it was such a blast, an xlnt deal and for a good cause. Had about 25+ stops at different restaurants and shops where the merchants gave a small bite of food paired with an beverage. It's also a great way to see places we may not have been into before. The Lavender Co. was and always is my favorite. Looking so forward to next year.\nShow less"], ["Reviewed November 28, 2017", 3.0, "Nice stroll", "enjoyable stroll along the boardwalks of Temecula dipping in and out of a variety of different shops. Interesting to see restoration of buildings ongoing."], ["Reviewed November 25, 2017", 4.0, "Good for walking around", "Stopped here as it was recommended. Nice place to look around and see all the antiques. Not really my thing but there was a lot of people looking around (long weekend Saturday)."], ["Reviewed November 25, 2017", 5.0, "Adorable little town.", "Came to visit the day after thanksgiving. Walked in the evening and had a great time. It's an old town feel with all the modern commodities. A great place to bring family to eat or shop. A must do on your list."], ["Reviewed November 25, 2017", 5.0, "Fun, Food, Shop", "We were visiting the wineries in the area. We were mostly disappointed. But here you have some funky shops and places to eat. The Temecula Olive Oil Company — a better tasting experience than the wines."], ["Reviewed November 21, 2017", 4.0, "Small town main street", "Small Town Main Street, with a Western feel. Lots of pubs and casual restaurants. Good for an afternoon or early evening stroll. Local farmer's market also small but very pleasant with local products. Great place to buy presents - natural products. A few hours including time to eat and browse is all you need.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Places to eat!!", "There is a place for anyone and I mean anyone To find good places to eat is very pretty At night time ,we had a great time we will go back there again sometime"], ["Reviewed November 14, 2017", 4.0, "Very Friendly People", "We felt welcomed in every shop. Our little dog loved all the attention she got from shop staff and patrons. The shops were stocked for Christmas and after hitting one or two there was a sense of every shop carrying the same merchandise. Nice antique shops with lots of merchandise. The town is nicely maintained and has a welcoming feel to it. A place you’d like to return to.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great way to spend a weekend afternoon", "Lots of unique shops, restaurants and bars. Enjoyed strolling along and taking in all the varied offerings. Great art/craftsmen shops for furniture, art and other things. Loved Temecula Olive Oil company."], ["Reviewed November 11, 2017", 3.0, "A bit disappointing", "Old town Temecula is a strip of tourists shops and restaurants with nothing much to recommend it. Only a quick visit is needed."], ["Reviewed November 10, 2017", 5.0, "Fun and history too.", "This town was actually a stop on the Pony Express route.\n\nIt is becoming a mix of the old and new. Wish the city had been stricter on blending in new construction.\n\nHas a great street fair in Saturday’s until 1:00.\n\nSomething is almost always happening in the weekend.\n\nLove the Mexican food at Texas Lil’s.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Weekend get away", "Great place to visit old down town Temecula. They have art and wine festivals in the summer and nice restaurants to eat at."], ["Reviewed November 9, 2017", 5.0, "Great place to visit", "When visiting Old Town Temecula a must place to visit is the Olive Oil Company. You can sample olive oils and balsamic vinegar with fresh bread. I always plan to stop by this place after eating lunch or dinner at one of the many restaurants in the area. If you have young kids you can take them to Penny Pickles Museum and they will have a fun experience. Do you love to listen to music? There are places like the Old Merc to take in a concert, there is also a live theater called the Old Town Temecula Theater where you can see a live play or musical.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Always a good time", "Old Town Temecula is always a good time for both families and couples. Very good restaurants, friendly people around and great drinks."], ["Reviewed October 28, 2017", 2.0, "Old only in this façade", "There’s no characteristic of this town of being old. Only part of the sidewalk and some façade of buildings are old. The rest of it are completely new and uninteresting. Is it better to characterize this as a rebuild of an old town."], ["Reviewed October 28, 2017", 4.0, "Shopping excursion", "This was our first time in Old Town and the merchants were very friendly with an assortment of goods. It was a pleasure just to walk around and experience the old town."], ["Reviewed October 26, 2017", 1.0, "Dont waste your time", "This is a neat and tidy touit area but a very poor recreation of an old west town. The only thing that is real is the geographical location. With shops like Scandanavian Viking and authentic English pub you'll get my meaning. Not worth the stop"], ["Reviewed October 20, 2017", 3.0, "same old tired collections of antiques and other trinkets", "Soros Mediterranean Grill was truly a highlight both for the food and hospitality. Papa and his staff cooked up a great batch of food which more than made up for the staid and stale Old Town area."], ["Reviewed October 20, 2017", 4.0, "Cool place to hang out for an afternoon or evening", "This is a classic main street district that has been converted to a restaurant/shopping/street fair area. It is large enough to provide a nice selection of stores but not so large that you can get separated from your group and get lost in the crowd. Most importantly - there are very few (if any) chain stores in the mix. We walked through a nursery and bought some garden art, took in the farmers market and had plenty of samples, bought a custom-written poem from a guy sitting behind a typewriter (try that in a mall), got a free ice cream sandwich from a church truck, bought a metal fence art sculpture and came back for dinner that evening. A wide selection from serious looking burgers (not chains!) to upscale Italian to spicy southwestern (our choice) And we didn't pay a dime to park - a nice change from our big city urban expectations. So if you are looking for a place to hang in Temecula, I say skip the strip malls and head to Old Town for a little slice of small time Americana. A pleasant respite from the craziness of So Cal.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Quiet Little Town", "Many shops and places to eat as well as micro brew houses. Good food. Traffic was respectful to pedestrians allowing us to walk where needed. No LA hustle & bustle. Need more than one visit to experience it all."], ["Reviewed October 18, 2017", 5.0, "Cute center of town", "We loved old town Temecula. We found family friendly dinner options there. Nice time just walking the streets and visiting the little Temecula museum."], ["Reviewed October 17, 2017", 5.0, "Road trip", "Great little town! The buildings are right out of the Old West atmosphere. Lot's of shops and restaurants. Highly recommend making this a stop on any road trip."], ["Reviewed October 13, 2017", 5.0, "Old Town", "A quaint Old Town with a western twist. Perfect for touring, shopping, antiquing, dining and entertainment. Plenty to do for day or half day, including a tourism center, museum ,\nChildren's workshops, and theater. Little boutiques offer hand made items and collectibles, and more sophisticated stores include jewelry and clothing. There is plenty of variety along the main road and alleyways when it comes to fine or casual dining including bars and wine tastings. Several small motels and boutique hotels including a Historic Victorian house are spread out in town.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Antique Heaven", "We stopped at Old Town Temecula on our way to San Diego. Lots of great shops to browse or buy antiques and clothing. The stained glass bottles at J. Gordon were interesting. The Old Town Antique Faire has a huge inventory and great selection of antiques. There were several places to eat that we may try on our next trip. Rosa's Cantina caught my eye because that's the name of the place in the Marty Robbins' song \"El Paso\" where he meets Felina. \"Night time would find me in Rosa's Cantina, music would play and Felina would whirl.\"\nShow less"], ["Reviewed October 6, 2017", 4.0, "Old Town Temecula", "I Drive through this area almost every day. During most of the day the area is heavy populated with people. People Must love the area because they look as though they are having a great time!!"], ["Reviewed October 4, 2017", 4.0, "Frequently visit", "It's much better when you don't go on the weekend. Go to the far end of town right off the freeway and park. The traffic is awful right in town. Once you get out and walk, it's great. Plan to have a relaxing time. There's a great Farmers Market on Saturday mornings. Bring a cooler to keep your stuff from spoiling. Then just ramble around the many cute and funky shops. They have Temecula Olive Oil Cpany, where you can do tastings; must do! There are also other great foodie shops, including a tea and spice shop, cheese shop, candy shop, and more. Many good places to eat, but recommend the pub across the street from the olive oil shop, especially if you enjoy beer. The selection is awesome and the food is good.\nYou can go to the wineries tomorrow. Don't miss Fazzeli's! Great place for lunch! Start there and have a blast! The smaller wineries you haven't heard of are the best\nShow less"], ["Reviewed October 4, 2017", 4.0, "Interesting spot with many attractions", "I have been to old town twice now and have always found the area interesting. Lots of shops to checkout and heaps of eateries to tempt even the most fussed eaters. Recommended for a good half day out. Parking can be a little tight...."], ["Reviewed October 3, 2017", 4.0, "Great Day Trip", "Enjoyed visiting the Old Town section of the city. A lot of shops to look in and many restaurants to feast in. Was a little crowded, parking hard to find. Had a health fair that day and it was the end of cowboy days. The sidewalks are made of planks on the most part making walking a little uneven. The merchants were very friendly and seemed interested in you as a person.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Catch live music", "Had a chance to hear great live music in about four restaurants/bars on a recent Friday night. We were amazed at the talent we have right here in town. We've moved here from Chicago three years ago and we know \"good\" music. Love Old Town and also the nearby wineries.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great place to go and hang out", "Just moved to Temecula in January of 2017, and Old Town has quickly become one of my favorite places to go. There is something for everyone there. Pennypickle's Workshop is a great place to take young kids. The Theater has great shows at very reasonable prices. Any kind of food you can imagine. It even has a market on weekends.\nI love old town Temecula.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Interesting shops, good restaurants", "Old Town Temecula is a great place to visit, with interesting shops, good restaurants and a number of boutiques. Often they have old time car events."], ["Reviewed October 2, 2017", 5.0, "A Little Bit of Everything!", "This is a great place for everyone! Husband and I enjoyed walking around Old Town. There is wine tasting, breweries, all kinds of different restaurants, gift shops and more. We ate at 1909 and had a great experience there :)"], ["Reviewed October 2, 2017", 5.0, "Local Theatre", "We love our local theatre here in Temecula We normally go to early dinner at the Goat & Vine and then walk over to the play. Very nice evening"], ["Reviewed October 2, 2017", 5.0, "Fun all around", "Great place to shop, grab lunch or just a beer. Has the feel of an authentic Gold Rush town. must try the Old Temecula Pub"], ["Reviewed September 30, 2017", 5.0, "Old Town Tonight!", "Old Town Temecula has a wide variety of shops, restaurants and activities to do in a relatively compact area. It has a very cool historical vibe to it as well, as it is where the original town of Temecula originated. Our favorite places are Baily's of Old Town, a mid priced bar and grill that has great sandwiches and pasta. They also have live music on the weekends, which makes it a great place to chill. The Crush & Brew is another favorite of ours, which is a great place to sample local craft brews and wines and their food menu has mid priced dishes that has good variety. Mad Madeilines is a really good burger joint in Old Town, if you are looking for that kind of fare. Lastly, the Beer and Wine Garden is an awesome hangout for great draft brews, live music and dancing until the cows come home, if you know what I mean.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Girls weekend", "Such a fun place to visit. Lots of great shops, restaurants, and bars. Great place for a girls weekend. Lots of places to sit outside and enjoy the scenery and people watch. Cheers to Old Town."], ["Reviewed September 25, 2017", 5.0, "Great local community theater", "Neat little town with a great community theater. Intriguing architecture, lots of interesting restaurants and little shops. Very much recommended to visit."], ["Reviewed September 21, 2017", 4.0, "Take a stroll", "Great place to take a stroll around this nice little area with its shops, theater and restaurants. Can get crowded so go early if it is on the weekend."], ["Reviewed September 20, 2017", 5.0, "Historic and Fun Place For the Whole Family!", "There are all kinds of shops ans restaurants. There's even a museum for kids! All around it's a wonderful, fun time for family and friends! Part of the town has the original wooden sidewalk (from the 1800's early 1900's) that the horses used to pull up to park on and drink at the trowels! What a great, great town with a lot of great history! I love this part of the city!\nShow less"], ["Reviewed September 17, 2017", 4.0, "Cool old town", "Went for Farmers' Market and found other cute, antique, food, places to check out as well. The produce and products that merchants have at the market is awesomely genuine. Recommended to visit."], ["Reviewed September 16, 2017", 3.0, "I Have Found Where the Hippies From 1970 Went", "This is a street about a quarter mile long lined with food places and specialty stores. One nice thing is there is not one chain store, except Starbucks. There are no really upscale places to eat and all food places have a bar or tavern atmosphere. A couple are rather nice, others are basic clean bars with food.\n\nThe stores have an array of things you may not find anywhere else, but most stores reminded me of the jewelry or woman's clothes store of the hippy era. There are a few antique places also. There is public parking available, just follow the signs. Try to not drive on Front street as it can get busy and backed up. If you have never been, it's worth an hour or two to walk through. Not a place I would go back to regularly. The stores are really lower caliber with knickknack junk you don't need.\nShow less"], ["Reviewed September 16, 2017", 4.0, "Daytime for families, Evening for couples", "From the Saturday morning farmers market, to the Friday night bar hopping, Old Town is a great destination. Unique shops, good restaurants at reasonable prices, free parking, and lots of strolling, make it a good place to meet up with friends and family. Sidewalks can get crowded, and driving down the main drag is stop and go, with occasional loud motorcycles or cars, but for some, this is part of the entertainment. This is the perfect mid-way stop between LA and San Diego, as it is just a couple of blocks from the Rancho California exit (west of the 15 fwy). Have fun!!\nShow less"], ["Reviewed September 15, 2017", 5.0, "A classic must stop when in Temecula", "This place has a lot of rich culture and history. Handfuls of quaint shops, boutiques, restaurants and historic spots. From wine tasting to grubbing down on a classic cheese burger and fries, old town has it all. If your into mexican food, eat it in a old bank. In need of some antiques, find all sorts of shops to fit your needs. Old country style stores with cute nick-nacks to suit your design needs. Old town also has a great Christmas parade during season down main street as well as an outdoor ice rink. Its a great stop!\nShow less"], ["Reviewed September 15, 2017", 4.0, "Fun Place", "Old Town Temecula is a fun place to spend the afternoon just walking, enjoying food/drink and cute shops. We go there for brunch quite a few times a year."], ["Reviewed September 13, 2017", 4.0, "Enjoy walking aroung Old Town", "There are some really good restaurants there on side streets. And of course there is Temecula Oil Company. My wife really enjoys shopping too."], ["Reviewed September 12, 2017", 5.0, "Great town to walk around!!", "Old Town Temecula has many shops and restaurants so you can walk around for a couple of hours and really have a nice time!! There are also several antique shops if you enjoy antiquing! On Saturdays they have a farmers market as well right in town!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Small area with lots of history, sort of, worth a few hours", "We've lived in San Diego for over 10 years, and would pass Temecula every now and then. Last weekend, we finally made it to the Temecula Old Town and it turned out to be a happy surprise. It's totally worth spending a few hours here.\n\nThe old town neighborhood is right next to I-15 highway. The small area has a few blocks, full of old buildings from late 19th or early 20th century. There are a lot of buildings that are over 100 years old, but all of them were well maintained or renovated. You can find lots of quaint restaurants, drink shops, wine tasting places, gift shops, antique shops. You can basically park your car and walk around, pretty much to everywhere in the neighborhood.\n\nThere are lots of free parking and parking meters throughout the area. And there are also a large free public parking structure next to the city hall.\n\nThe old town area can be pretty hot during the summer months. But many restaurants would spray water mists to help cool you down. A pretty cool feature.\n\nThe place does give you a feel of the old America, which more or less resembles Julian in a way. But this area feels larger than the downtown Julian.\n\nAnyway, we plan to come back again soon.\nShow less"], ["Reviewed September 7, 2017", 4.0, "A need to go place", "Old Town Temecula is a nice place to visit for an afternoon. The town is quaint with lots of great shopping and good food. There is something for everyone. Visit the Temecula beer and wine garden for a fun night of dancing under the stars on the weekend.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Great Place to Spend the Day", "Front Street in Old Town Temecula is a great place to shop for anything from antiques to olive oil to real estate. Get information from the Visitor's Center just behind The Swing Inn on Third Street and Mercedes. The Swing Inn has delicious breakfast specials. Rosa's Cantina has great Mexican cuisine and Bailey's is fine dining. There is a free parking lot on 6th Street, directly behind the Beer Garden. \"Mad Madaline's\" has great burger's, best burger this carnivore has ever eaten. Please spend the day in Old Town when you come down to Temecula for some fine wine tasting on Rancho California and surrounding winery road in beautiful Temecula.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Looking around", "Something for everyone here. Tasting great wine beer and olive oil plus a lot of history here. And antique stores food and bars galore."], ["Reviewed September 6, 2017", 3.0, "Quaint", "Very nice downtown area. Great restaurants and shops. Would be a nice place to spend night on next wine tasting tour. Must see and get small town feel."], ["Reviewed August 31, 2017", 4.0, "Great shops and restaurants", "Get some great food (Mexican) and wine. Make your way to the antique stores but the ones we visited did not have air conditioners. It was 105 degrees!"], ["Reviewed August 30, 2017", 4.0, "Nice little getaway in the So Cal wine country.", "Old Town Temecula is an historic of a few walkable blocks. Lots of little shops, restaurants, antique stores, and historic buildings. Because of the proximity to the wineries, there are wine-tasting specialty stores as well as flight offerings at the upscale restaurants. Night life if somewhat limited to the weekends although you can find at least one place with live music most nights.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Cute area!", "Cute old town with many unique shops and restaurants. Like that the city is keeping the old town theme even with new businesses coming in. Nice to see growth. Note: most shops do not open until 10 a.m."], ["Reviewed August 29, 2017", 5.0, "Nice place for a day out", "They've really done a nice job in renovating and bringing Old Town back to life. There is a great variety of shops and restaurants. Parking is getting better with the addition of the stacked parking garage. I have been coming down here for years and love the atmosphere. There is a cool nightlife with multiple places having live music. If you haven't been down there lately I would take a trip and see how well they've made this tiny town come back to life.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great for shopping!", "Lovely place to shop and find all sorts of neat things! Went with some friends and had a wonderful time while walking the streets, fresh air, clean town, with so many quaint things to do!"], ["Reviewed August 28, 2017", 5.0, "Interesting little town", "Fun place to visit and shop. Like most tourist towns traffic can be terrible on weekends so best to go during the week. Plenty of bars and restaurants. The town is clean. One side of the street sidewalk is paved and the other is an old boardwalk ( hard to walk on with heels ladies). Shop prices can be pricey but expected for a tourist area.\nShow less"], ["Reviewed August 27, 2017", 4.0, "Nice side reip", "Pretty, clean, nice atmosphere. Lots of little shops & restaurants. Don't miss the olive oil store and the tasting they offer."], ["Reviewed August 21, 2017", 5.0, "A small stretch of road that has a lot to offer", "A unique little downtown with a wide variety of shops and restaurants. Whether you are looking for a bargain , an antique, or a rather expensive gift for someone, you can probably find it in Old Town Temecula. There is also an abundance of choices for a place to get food and drink. While being a relatively short distance from one end of town to the other you could spend the better part of a day browsing and dining in this quaint town that takes you back in time.\nShow less"], ["Reviewed August 21, 2017", 4.0, "INTERESTING", "Lots of interesting shops and places to browse. I think if you go to Temecula you should definitely see Old Town. I ate at Mad Madeline's and had a delicious hamburger/malt."], ["Reviewed August 20, 2017", 5.0, "What a quaint town!", "This town was cute and plenty of choices for food. You can walk all of old town. Weekend nights had music coming out of everywhere. Sidewalks busy, restaurants busy. Kids reminds me of Jackson Hole without the antlers."], ["Reviewed August 19, 2017", 5.0, "Nice stretch of town for a stroll", "Be prepared for parking issues and traffic on weekends and summer. Interesting variety of shopping and restaurants. A number of small item antique stores on Front street."], ["Reviewed August 18, 2017", 4.0, "Great Downtown with Many Shops!", "This downtown is like the old west! We went to an ice cream and candy shop, balsamic and oil shop, and a cheese shop. All were great to visit and there was so much more to see but we didn't have enough time. If you are in Temecula for any reason it is great to stop here even if it is quick!\nShow less"], ["Reviewed August 17, 2017", 4.0, "Lot has changed in 15 years", "It's been 15 years since we were here last and it is so much more interesting than it was then. Lots of shops and restaurants and a cool olive oil place you should visit. We avoided the area for so long it was time to re explore. Glad we did.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Charming Historical Area to Walk and Enjoy!", "Historical and enjoyable walking experience! There are so many old buildings, shops, restaurants and antique shops. Such a great place to hang out for both locals and tourists alike. Highly recommended !"], ["Reviewed August 12, 2017", 5.0, "Fun to stroll around Old Town", "I can remember about 40 years ago when Old Town was the town! Great place to window shop, sample olive oils, wines, fruit, etc. On Saturday the Farmers Market is bustling and parking can be a little hard to find. I like to park at the Civic Center parking garage and walk from there. We saw the recent sidewalk chalk art and got a nice photo at the fountain.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Quaint", "Old Town Temecula has so much to offer! My husband and I went there last Saturday for our Anniversary night. We were able to have a nice steak dinner at the Gambling Cowboy, enjoyed a classy speak easy called the Apparition Room and ended up at a genuine Irish Pub, The Lucky Stone. There are so many options for food, entertainment/live music and bars!! Most of the locals are super nice too!\nShow less"], ["Reviewed August 8, 2017", 4.0, "Lots of things to do!", "Lots of places to eat, shop and see. Some of the wineries have tasting rooms. Farmers market and live music on the weekend. There is free public parking structure near city hall. Street parking can be challenging."], ["Reviewed August 8, 2017", 5.0, "Love Old Town Temecula", "Old Town Temecula has a small town vibe to it. Awesome place to bring family and friends. Great restaurants, friendly people and a great environment to be in!"], ["Reviewed August 8, 2017", 5.0, "You can compare with Austin's 6th street or other great town music food and libation towns", "Temecula is a great place for the young at hear, and even our \"of age\" young adults. Lots of food, wine, and booze but we have become a great spot for live entertainment. You do not have to choose your genre, everything is there. Weekend days are great for Antiquers - by night it is for foodies. This is a casual town, jeans, shorts are welcome everywhere.\nShow less"], ["Reviewed August 1, 2017", 5.0, "LOVE IT!!!!!!!!!", "This is such a well kept and fun area! I had so much fun with my niece. We walked the area, shopped, ate and just had a blast. People were friendly and helpful. We also enjoyed the wineries. The hotel was great too. I highly recommend a visit!\nShow less"], ["Reviewed July 31, 2017", 4.0, "Cute Place to Walk Around", "We had a nice time here the other day just walking around and poking into the antique, candy, and garden shops. We enjoyed the cowboy theme and the fact that there was a clean public bathroom for us. We would have liked to see the History Museum but we were with someone that was not interested in walking anymore. I think any tourist should include this area. Had a Taco lunch which was ok.\nShow less"], ["Reviewed July 30, 2017", 4.0, "Interesting Visit", "For anyone visiting the area Olx Town offers a bit of a glimpse into its history with various restaurants and shops to visit."], ["Reviewed July 30, 2017", 4.0, "Nice atmosphere", "Always enjoy visiting Old Town Temecula - nice village vibe, easy to walk around and plenty of places to grab a bite to eat. Good place to spend a relaxed hour or two."], ["Reviewed July 30, 2017", 5.0, "Busy area on Saturday", "Visited the farm market which was smaller than I thought it would be but it had lots of nice booths, good fresh fruit and veggies. Delicious fresh baked breads. Lots of interesting crafts. Walked to a few local shops and antique stores. Decided not to have lunch there. It was hot walking around but there were benches available at various shops. Would go back.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Nice Area", "Lots of shops, restaurants, historic sites in a easy to walk area. Wooden sidewalks in some areas. Nice little park and museum at one end."], ["Reviewed July 26, 2017", 4.0, "What a great little town to stop in and enjoy an afternoon!", "A GF and I drove through this past afternoon and decided to stop and check out a few cute stores and walk down the main street. It was easy to get around since it was mid week and not terribly crowded. I'd put it on your list.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Drchick3", "Rosie's Cantina! Just finished lunch there. Walk Up Service, but worth it. Authentic Mexican Style Foods. Reasonably Priced. They serve MILK there, which is a Necessity, if you plan to partake of their Homemade (HOT) Salsa. Didn't wait long for our food. Never a disappointment."], ["Reviewed July 24, 2017", 5.0, "Charming western town with a modern attitude", "I have been visiting Old Town Temecula for 10 or so years now, and it gets better every time I visit. The farm to table restaurants and delightful gastropubs are popping up at a rapid pace. We did gourmet olive oil and vinegar tasting at Temecula Olive Oil Company on Front Street - 100% California Extra Virgin Olive Oil. Interesting flavors. I settled on Fresh Blood Orange Olive Oil and 911 Hatch Chile Bianco Vinegar. Wine tasting rooms are also fun in Old Town - Lorimar is welcoming. And the restaurants...too many to mention all. But I will give Public House and Stasha a shout out for the fantastic experience we had there. Heard lots of great live music as well. Lots of original architecture, museums and historical venues for those who like that sort of thing. Go and visit - you will not be disappointed.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Cute but very commercialized", "Lovely area, very commercialized and extremely busy. Difficult to cross the road. Lots of restaurant options. Worth a visit."], ["Reviewed July 17, 2017", 5.0, "Freeway To Heaven", "After an hour on one of the many freeways in California,otherwise known as a parking lot, we emerged in Temecula to find a gem of a city.\n\nIt's quaint, it's cute, it's well landscaped, and it looks like it sprouted from the imagination of a dapper romantic.\n\nWhat fun! And old town, gorgeous wineries, swaying plants and palms and cypress trees.\n\nYou can stroll and indulge.\n\nOr you can drive and indulge.\n\nEither way, you will not be disappointed.\nShow less"], ["Reviewed July 15, 2017", 4.0, "Wild West feel", "A really fun afternoon wandering the streets, having lunch and a drink, shopping. Feels like stepping into the Wild West. Really fun."], ["Reviewed July 14, 2017", 5.0, "wedding visit - day after in town", "What a great old town area! Lots of shops and great specially restaurants! Lots of eating places to pick from! We did a walking tour of the bars in the area! Each offered different activities to do! Some had sports stuff like throwing bags in holes and horse shoes! Big fire pits to sit and talk by! Enjoy the weather and friends company! Many little shops to wonder thru! Parking can be a problem! So park soon and walk! The old town was on the west or south side of the freeway!\nEnjoy ur visit!\nShow less"], ["Reviewed July 13, 2017", 5.0, "Cute small town", "Cute town that I didn't know existed. Bought a hat for $7 to support the local shops. Great lunch experience at The Public House."], ["Reviewed July 12, 2017", 5.0, "Ol Town", "I love the old wooden sidewalks. Walking the town and stopping at the pubs, restaurants and shops is a must. Only problem you will come on is parking."], ["Reviewed July 10, 2017", 5.0, "Great food!", "Had such a blast in old town, had a great time at the country bar Stampede and took some dance lessons with my girlfriend. Lots of great little markets and shops to look at and explore!"], ["Reviewed July 10, 2017", 5.0, "Looks like a old country village, great fun walking around", "All kinds of different shops, lots of restaurants. Have a large Farmer's Market and Saturday with fresh fruit, vegetables and lots of crafts"], ["Reviewed July 10, 2017", 5.0, "Step back in Time", "This is a lovely area to get insight on what life was like in bygone times, good food at a number of establishments and plenty to see and do!"], ["Reviewed July 10, 2017", 4.0, "Old town/time fun !", "great place to hang out on a hot summer evening ! Great eateries (try the Goat & Vine cant go wrong) , great live music (beer garden) Great local vendors ...all this a a great local farmers market on the weekend mornings ... Cool places cool fun !\nShow less"], ["Reviewed July 10, 2017", 5.0, "Old Town Charm!", "My office is just blocks away from Old Town Temecula. I love going to lunch there and also checking out all the shops! My favorite places to go are Devilicious, Swing In, The Rootbeer Store and The Farmers Wife. Great place to walk around and spend the day and the night life is fun too!\nShow less"], ["Reviewed July 10, 2017", 5.0, "A Special Day in Old Town Temecula", "I am so lucky to live in the gorgeous town of Temecula. So why would I want to travel when I have so much on my doorstep. My friend and I spent an entire Saturday strolling through Old Town. First we meandered over to the Farmers Market and tasted locally grown produce and handmade products. We then visited the Temecula Museum and felt like some lunch. We ate at the Goat and Vine. Which has a great patio and delicious fresh tasting dishes and great local wine.\n\nAfter lunch we did some shopping and I loved the variety of shops but my favorites are Vintage Bagonia, Farmers Wife, Temecula Lavender Co...., to name a few\n\nThen it was time for Sangria and Tapas at Viva Vino's Wine Bar. That melded into music and drinks at Baily's on their great patio then dinner of Chicken Schnitzel and Ribs. Yes by then we were very full and feeling great but dancing was still on my list at Temecula Stampede with the typical western line dancing and local beer. No I did not ride the bull.... are you kidding? A full wonderful day and just 4 miles from home.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Quaint Old Town", "Great little town . Lots to see and do. A nice stop if you are in the area. There are many shops and restaurants. There were some great antique stores if you're into that."], ["Reviewed July 9, 2017", 5.0, "Bowie wedding rehearsal dinner", "Love old town Temecula. Lots of shops & restaurants too. Take a quite stroll on the streets. Ate at 1909 restaurant. Not too bad. Has a different kind of variety of food selection. Back patio area was a nice spot for our family's gathering for our daughters wedding rehearsal dinner. Love the Zoro restaurant as well.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Day in Old Town", "A unique area within Temecula, Old Town offers shopping, dining, entertainment and adult beverages. While some of the retailers are the typical tourist traps, there are numerous artistic clothing, fine art and jewelry stores in abundance. In the evening one can find a great selection of pubs, restaurants and many locations providing entertainment. Worth a stop if you are int eh Temecula area.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Great way to spend a day", "You can spend a day just shopping and eating. Stroll thru the shops and get some local eats. It is a family friendly day."], ["Reviewed July 3, 2017", 4.0, "Plan on 2 to 4 hours.", "Enjoyed a nice cup of coffee and a stroll around to check out all of the antique shops. If you are a fast shopper, plan on 2 hours. If you like to shop and wander around, plan on 4 hours. Free street parking.\n\nWe finished off our stroll with a visit to the pub!\nShow less"], ["Reviewed June 29, 2017", 4.0, "Crazy busy on a Saturday, however worth the visit", "We arrived midday on a Saturday and were surprised how busy Old Town was. Traffic through town travelled at a crawl, once parked it was easier to navigate along the street. Farmers market was great, shops were quaint. Recommend heading over in the morning to get ahead of the crowds.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Good fun", "A lot of bars and restaurants. We didn't eat but bar hopped for a few hours. Pricy drinks... average $7.50 for draft beer. Farmers market on Saturday was great."], ["Reviewed June 27, 2017", 5.0, "great bars and shops", "all the people were very friendly and helpful had a great time going thru the old shops and hitting this one bar irish pub had a great sax player and at night had a country rock band"], ["Reviewed June 23, 2017", 5.0, "Gambling Cowboy", "Wonderful food. Great atmosphere. Perfect service. Can't say enough about how good the good was here. Would definitely go back."], ["Reviewed June 19, 2017", 5.0, "Fun old town area to walk around", "Cute little shops and restaurants lining the street where the sidewalks are still wooden planks. It feels like a throwback to an old western town like Old Abilene Town or Dodge City. We found some great little shops with very friendly and helpful owners! If you like antique stores, they have those store, too.\n\nWe really enjoyed the Pink Pineapple shop with great selection of men's reyn spooner shirts and The Nifty Gift shop which featured local artists creations.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Fun little town", "Went to the gambling cowboy and it was awesome. Great other bars and restaurants too. Lots of live music."], ["Reviewed June 18, 2017", 5.0, "Cool Small Town", "Old town Temecula has much to offer from small farm fresh vegetable and fruit stores to antique shops. This is a great town to walk around and take in the unique shops or have a beer and watch the people walk by. I recommend Temecula to anyone for a wonderful day out.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Lovely Evening", "We visited old town Temecula and had a wonderful evening. We like strolling the Front Street and enjoy all the shops. And the restaurant and bars are great. It's a great evening out any time."], ["Reviewed June 14, 2017", 5.0, "Saturday morning walk in Old Town", "Weekends are wonderful in Old Town! When the weather is nice (which is most of the time), you will find people walking, shopping, eating, and just enjoying the ambiance. The farmers market is full of local offerings, from organic fruits and vegetables, fresh flowers, and specialty foods, to handcrafted decor and other locally-made wares. It's nice to just stroll through with a few bucks, picking up whatever looks or smells good along the way.\n\nThere are activities and events scheduled to occur on weekends throughout the spring and summer months. Temecula has a nice mix of rustic and modern architecture that gives it a certain charm and makes it especially quaint. Stop in and grab a bite at one of the restaurants with patio seating, so you can people watch and take it all in.\n\nEnjoy!\nShow less"], ["Reviewed June 14, 2017", 5.0, "Love Old Town Temecula", "I live in the Temecula area and visit Old Town Temecula every so often to eat at one of the many restaurants or browse in the many fun and unique shops. The shops vary from antique shops to \"specialty oil\" shops to clothing shops, etc. There is a multi-level parking garage just off the main street, and you'll have to walk just a bit to get to the shops & restaurants. If you have more time, be sure to visit the nearby the wineries of Temecula.\nShow less"], ["Reviewed June 13, 2017", 5.0, "I heart Old Town Temecula!", "I have had the pleasure of working here for 3 years! I have come to know many of the nearby shops and I have had many meals at a wide variety of places! And this two is growing with BIG improvements to make getting around easier! Don't miss out! Stop On By!\nShow less"], ["Reviewed June 12, 2017", 5.0, "A nice place to spend a morning or afternoon wandering.", "Old town Temecula has some old town charm and has a variety of shops and places for a bite to eat. Although it appears lacking fine dining options, there appeared to be a number of casual options to choose from as well as bars and places for coffee. There are several antique shops both in old town and on the other side of old town that are worth a look. Parking could be a challenge on busy weekends but there is a parking garage up at city hall if street parking is limited.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Great Day Trip", "Many restaurants, cute \"different\" shops, etc. It's like a chaming, small town, in itself. Could easily spend a few hours there. If looking to do something else after, making it a whole day trip, there is the wineries 15 minutes away, as well as the casino, ten minutes away. All three make a great, all day trip, to Temecula. I live here and know the area very well.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Great architecture, cute atmosphere, great restaurants and live music", "This was our first visit to the area, and we loved looking at the buildings and stopping in the shops. Many great restaurant choices, and many places with live music when we were there on a Friday evening. Looking forward to returning."], ["Reviewed June 9, 2017", 5.0, "Nice little town with lots of restaurants and bars", "Very relaxing town. Good to hang out for a few days. Add a wine tour. We had a great stay. Shops are cute but much of the same."], ["Reviewed June 8, 2017", 4.0, "Lunch and shopping", "Very quaint and quite a lot of various types of shops, with friendly proprietors. A great place to eat, shop and walk. Adequate street parking and something for everyone. Antique shops clothing and a cupcake bakery, too many to mention."], ["Reviewed June 7, 2017", 5.0, "Family friendly during the day; lively bar scene at night", "Temecula keeps its old west roots alive and well in Old Town. Nestled in the foothills of the Temecula valley, you'll enjoy shopping at boutiques, farm fresh produce, antiques, salons and speciality shops. The exceptional restaurants are too abundant to mention by name. Old Town Temecula frequently hosts festivals and activities on the weekends. Don't miss a play, concert or a musical in the Old Town Temecula Community Theater. Many venues have live music on the weekends too.\nShow less"], ["Reviewed June 7, 2017", 4.0, "Fun to walk around", "Get their early!! Great shopping but lots of traffic. We have so many great stores. All sorts of restaurant choices, too. Be prepared to park and do a lot of walking."], ["Reviewed June 4, 2017", 4.0, "Oh What Fun...", "Old Town Temecula is a great place to casually wander around and enjoy the shops and people. It's relaxed, casual and full of things to discover. People watching is also interesting."], ["Reviewed June 4, 2017", 5.0, "Our favorite place to visit", "We always end up in old town Temecula several times during our stay. We start at the welcome center to find out what events are happening during our stay. Then we stroll the streets stopping in the many shops, having lunch or dinner and maybe catch one of the many music offerings.\n\nSaturday farmers market is worth exploring.\n\nWell worth a stop or two as you escape to a slower paced gentler time.\nShow less"], ["Reviewed June 1, 2017", 5.0, "MUST Visit", "If you are visiting the temecula area for the wineries, take a de-tour to Old Town. It is a quaint high street with bars and restaurants. A proper \"old town\" feel to it."], ["Reviewed May 29, 2017", 4.0, "Can be crazy on Friday night", "If you want a lot of choices to eat in a fairly small area, this place has tons. My personal favorite is Luke's but you can find just about anything you want here. The Bank of Mexican food or Rosas are always popular choices and easy on the wallet.\nShow less"], ["Reviewed May 27, 2017", 4.0, "Vibrant location", "The buildings throughout old town are all very well maintained and interesting architecture, the area is very vibrant and active, it seems to be a destination city."], ["Reviewed May 27, 2017", 5.0, "Love, love, love this town", "Wonderful restaurant at 1909, great vinegar tastings, candy shop, lovely garden shop and so much more. Every visit to Temecula is special"], ["Reviewed May 25, 2017", 3.0, "Food, Shops and Farmers Market--Old Town Has it All", "The Saturday morning Farmers Market is exceptional. Many interesting things for sale as well as produce and prepared food. Shops along the main street are quaint, usually small and several have only limited merchandise. Many good restaurants along the way. Good walking shoes recommended as the wooden \"sidewalks\" are uneven and can easily snag a heel or flip flop. Crowds are a problem on weekends.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Charming reminder of days past--short and sweet", "You only need 30-60 mins to walk up and down the strip perhaps get an ice cream and poke your head into the little shops. Coin shop was interesting.."], ["Reviewed May 24, 2017", 4.0, "Very nice old town", "We went there after our winery tour. The town is very nice , many awesome restaurants and bars. Town has its own unique style."], ["Reviewed May 23, 2017", 5.0, "Beautiful place to spend the day", "My husband and I really enjoyed all the restaurants/bars and shops. We also went to a wine tasting room right off the main street. There is something for everyone. Luckily it was only about 75 degrees when we were there. It does get pretty windy in the late afternoons. It's a really nice way to spend the day. We were there during the week so there was a lot of parking but I'm sure on the weekends parking could be an issue.\nShow less"], ["Reviewed May 22, 2017", 5.0, "It Never gets Old in Old Town Temecula", "I've lived in Temecula for just under a decade and this little town never gets old. Old Town has anything you could want to pass the time. Great restaurants like Swing Inn for Breakfast or Public House and Gambling Cowboy for lunch/dinner. Also some great entertainment options like Pennypickles Workshop, a great interactive science theme museum, to the MERC and Temecula Theater. Make a day out of it, it never gets old!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Just looking", "Temecula old town is for people who wants to just stroll down and take in new and old scenery and like to try new foods. Great for a day out"], ["Reviewed May 21, 2017", 5.0, "Georgeous main street", "Probably you need 15 minutes to see the highlights. Main street looks nice. I was there in may and it was very hot, close to 100 degrees so mind your timing of visit."], ["Reviewed May 21, 2017", 5.0, "Very nice old town with tons of restaurants, bars, and shops", "Really quaint old town area with great food, bars, antique shops, etc. Gets pretty crowded on weekends. Stay off the main drag and park in the structure by city hall. Very short walk from there. And your car will be cool when you return."], ["Reviewed May 17, 2017", 5.0, "Old Town Temecula", "This is really one of my favorite towns to visit. Off the beaten path just a little. I always feel like all I'm missing is my hat and my horse! Plenty of shopping, cool restaurants and out door bars. A good base camp for touring the local wine country. Several good hotel options as well. I never mind coming here for work from Florida.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Fun for all ages", "Lots of restaurants and shops to browse Farmers market on Sat. mornings has several vendors and lots of goodies."], ["Reviewed May 17, 2017", 4.0, "Cute but closes eaA few blocks can be explored in a few hours. Plenty of shops selling various gifts and knickknackrly.", "A few blocks can be explored in a few hours. Plenty of shops selling various gifts and knickknacks. Restaurants and bars. Safe area and not too dark after hours. Most stores are open between 11 am and 5 pm. Lots of parking."], ["Reviewed May 16, 2017", 5.0, "Very cool Old Town", "Lots of antique shops and restaurants. Very short walk from one end of town to the other. We only shopped the antique shops."], ["Reviewed May 16, 2017", 4.0, "Quaint litte shops and restaurants", "I didnt get to really spend much time here but the time I did get I really enjoyed the area. It is worth a trip."], ["Reviewed May 15, 2017", 5.0, "TEMECULA OLD TOWN CHARM", "I think old town is worth visiting. It has changed in recent years with all the new buildings but it has retained its charm. There is plenty of parking so you can wander about. There are one off shops to explore and antique places if that is your thing. Every street has at least one restaurant that vary from organic to burgers. Every ethnicity is covered as well as wineries and beer establishments. You can just walk about and window shop. The sidewalks are wooden which adds character. If you are around on a Saturday they have an old town tour that leaves from the museum. It is also nice to walk around in the evening. For car lovers take a seat and watch the cars;you are sure to find one you like.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Stepping back in time", "You walk under the arched street signage and you step back in time. Walking on wooden railroad tie streets. Antique shops are everywhere. Many shops in and along the streets, however don't forget that many shops are in among the buildings - so get off the sidewalk and walk up on to the covered porches and you will find even more.Loved the feel of this area.\nShow less"], ["Reviewed May 14, 2017", 5.0, "Busy/Noisy", "Don't go if you lack patience! The streets were busy; parking was a problem. But once we found a parking spot on a side street, it was an excellent visit. Shops almost all open on Mother's Day!"], ["Reviewed May 11, 2017", 4.0, "Fun place to walk around and shop", "Old Town is a fun place to walk around and shop, as well as eat and drink. The only negative is the parking can be a challenge when it's busy, which is most every day."], ["Reviewed May 10, 2017", 5.0, "Modern old west", "Fun anytime . Daytime shopping, unique shops from candy to art to olive oil tasting to clothes. Restaurants offering burgers to Cuban to Italian to Mexican to sushi and a variety of bars. The Swing Inn and Penfold's are perennial favorites for the cafe breakfast crowd. Night time it's still alive!\nSpecial events enliven it as a staging area for rod rods, chalk art, parades, Christmas lutes and music, and city hall hosts an ice rink! Free parking in a safe enclosed parking structure next to city hall too!\nShow less"], ["Reviewed May 10, 2017", 5.0, "Just walking", "These few blocks are so beautiful and calming..they have so many beautiful things to see and places to eat..I love sitting out side eating"], ["Reviewed May 8, 2017", 5.0, "Lots of interesting shops.", "If you are in the area, you should really check out Old Town. There are lots of interesting shops and award winning restaurants."], ["Reviewed May 8, 2017", 3.0, "Place to visit once", "I was not too impressed by this Old Town. Considering the beautiful wineries in the wine country, the quality of stores and restaurants was very disappointing."], ["Reviewed May 7, 2017", 5.0, "perfect place to meet up with friends", "Old town Temecula is just that....an old charming town. It has great restaurants, shops that have handmade items, a dance hall...everything you could want. On the weekends, Temecula is very motorcycle friendly and a lot of people travel from nearby communities to meet up with other bikers. It can get loud with all the bikes but its a great time for everyone. A lot of families can be seen with their children strolling the shops\nShow less"], ["Reviewed May 6, 2017", 5.0, "Fun place to visit with Family or Friends", "Great places to eat out or do some shopping. This place has great history lot of restaurants with some really good food, the shop owners and employees are very friendly and helpful."]]}}