{"Old Town San Diego State Historic Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Old Town San Diego State Historic Park", "url": "/Attraction_Review-g60750-d104586-Reviews-Old_Town_San_Diego_State_Historic_Park-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/10/9b/58/e7/just-some-of-the-specialty.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "4796"}, "address": {"@type": "PostalAddress", "streetAddress": "San Diego Avenue at Twiggs Street", "addressLocality": "", "addressRegion": "California", "postalCode": "92110", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Loved it", "We enjoyed our time here, strolling the grounds and visiting the historic structures. There are several dining options and lots of shops."], ["Reviewed 2 days ago", 4.0, "Nice place to go", "We walked through as part of a food tour. It's a really neat place to go, and I'm glad it was part of the tour."], ["Reviewed 3 days ago", 5.0, "always a great place to visit and definitely eat", "Great food ... great atmosphere. Loved the shops that had the tiles and the shops that had other Mexican made things."], ["Reviewed 3 days ago", 5.0, "Little gem close to San Diego.", "My friend and I accidentally ended up here and we were not disappointed. Area filled with museums, restaurants and street vendors. Beautiful park in the end of the street, perfectly for an afternoon nap or just chill."], ["Reviewed 4 days ago", 5.0, "Best Mexican Food in SD", "A must stop when you’re in San Diego. Top spot for drinks and Mexican food for us is Cafe Coyote and this year we went twice in 6 days. Great shopping, great food, outstanding people, and it feel like you’re stepping into a small Mexican town.\nShow less"], ["Reviewed 4 days ago", 5.0, "Old Town is a must see", "Many historic buildings and museums. Access to Old Town is free but most parking is paid through parking meters. Great walking tour. There are also many shops with hand crafted items . Many restaurants. In the afternoon, a mariachi band played in the square so you really get the feeling of the Mexican history of the area.\nShow less"], ["Reviewed 5 days ago", 3.0, "Just ok", "Not a lot here just some stores. The old part had some nice old buildings but parking was a problem nice place to visit for about an hour or two"], ["Reviewed 6 days ago", 3.0, "Cute piece of history...", "If you are looking for Mexican food, this is the place. If there is one Mexican restaurant there is a hundred and some with fresh tortilla making stations on the street. There are several cute authentic shops along with the tourist shops. It's touristy and a small piece of San Diego history.\nShow less"], ["Reviewed 6 days ago", 3.0, "Fun but closed too early", "We were walking through about 6 pm but most shops were closed except the restaurants.. at least open to 7 or 8? Having said that, it was a neat place with clear historical significance and fun lessons for the kids. Apparently need to go back during the day.\nShow less"], ["Reviewed 6 days ago", 5.0, "SO UNIQUE", "Its so amazing to just walk around the area and see the building construction and old charm. The shops and restaurant are so interesting."], ["Reviewed 1 week ago", 4.0, "We been several times, but took friends this time", "It is best if you do a bit of study before you go. These historic homes formed the basis of San Diego. Original, repurposed, rehabbed and rebuilt. Shopping is one aspect. History is the most interesting to us. We went during the week. The lack of crowds was nice. On the weekend there are a lot more period costumes, craftsmen plying their trade and craft faire.\n\nEating is a highlight. Recommended shop is the pottery store, where prices are quite good. Start at the VC. Unfortunately you pass a lot of old town on the way, before you get the intro, but you get that stuff on the way back. Easy 5 hours. There are museums in easy walking distance and some a short drive that would fill the whole day. During the week, much before 10am is unnecessary. A few things are open, the VC is not. Bathrooms are plentiful and free. There is a wine and beer tasting venue. The Fudge and candy store is popular. Make sure you keep an eye on the plants thought out the area. Many are very old and quite interesting. Parking is free, at least ours was.\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice Historical Musuem", "The park contains a number of buildings, some of which are museum exhibits, some shops, and some a combination of both. This is an interestring place to spend a few hours on a sunny day. Lots of historical information and exhibits with costumed folks to provide explanations.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun place and well worth the visit!", "When I popped in here to leave a review, I noticed some \"terrible\" reviews so I had to see what the deal was with those. Yeah, it's commercialized but I enjoy visiting the shops and seeing all the stuff so it was fun for me. I didn't buy anything but it was still fun seeing all the goodies.\n\nWe enjoyed roaming around, seeing the historical stuff and poking around the shops. If it fits your schedule, check the Old Town Market area in the evening to see if there is anyone performing on the music stage. We sat for close to an hour just listening to the guy singing traditional Mexican songs for tips.\nShow less"], ["Reviewed 1 week ago", 4.0, "Neat place", "Pretty neat place. Walked through a few of the shops, cigar shop has a really cool collection of old pipes. Tons of history and things to explore. Plenty of people to ask about things too."], ["Reviewed 1 week ago", 5.0, "A must see", "This is a must see location for tourists. Great restaurants with plenty of seats, fun shops to go into and did you know the Whaley House of haunted? Lots of sightseeing and walking and worth the trip."], ["Reviewed 1 week ago", 5.0, "Very nice place to spend the day", "Parking in the are can be somewhat difficult.\nUse the public trolley system from anywhere in San Diego.\nThere are plenty of small shops to meet the interest of all who may go there.\nThere is a lot that can be learned by walking and reading the signs.\nI took my 3 grand sons with me on this visit and they truly enjoyed it and were very appreciative for the education.\nThe weather was not great but we entered several establishments and looked around which gave us a short time to warm up.\nShow less"], ["Reviewed 1 week ago", 5.0, "Excellent time in Old Town.", "The original San Diego, this area of town was all kinds of fun. Fantastic dining and plenty of family friendly activity."], ["Reviewed 1 week ago", 4.0, "Old town historic site", "Interesting view of the old San Diego lots of touristy things prices and quality not bad dont go to early as the area around the museum seems to have a lot of campers in the brush ok in day light a bit alarming in evening. Stay on sidewalks no problem a lot of restaurants in this area as well\nShow less"], ["Reviewed 1 week ago", 4.0, "Interesting place, lots to eat and buy", "If you're into history, shopping, and eating this is the place for you! A great spot to wander and explore. I was there on a Saturday and it was very busy but in a good lively way."], ["Reviewed 1 week ago", 5.0, "Old San Diego", "Loved old town. The culture was great and enjoyed all of the museums and shops. Food was amazing authentic Mexican. Yum!"], ["Reviewed 2 weeks ago", 3.0, "Part of ten stop tour", "Not much to do. Good food and drink. Not much to see that holds your interest. Has some small shops for shopping, but nothing special"], ["Reviewed 2 weeks ago", 5.0, "A fun place to learn some history, buy stuff, eat good food", "San Diego Old Town is a place where you can see genuine reconstructions of original buildings, buy tons of T shirts or sweaters with San Diego on them, buy the tackiest tourist junk, some classy stuff, see a haunted house, a couple of genuine stage coaches, and loads of other stuff. It’s a fun place! Go there!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Interesting", "This is our second visit to Old Town San Diego. I think for first timers it is worth stopping here to see the history of the area. Overall, it is very touristy. There are shops everywhere. If you want gifts, this area offers a lot of choices.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great day in San Diego!", "What a wonderful historical place to visit! Been to SD many times and never been here before! Great restaurants, shops and all kinds of great historical buildings and museums to see. A great place to take families for a day’s outing."], ["Reviewed 2 weeks ago", 3.0, "Historic buildings and experience", "Went here to see the original Court building replica. Was fun to see the jail cells in the back, wished I could have a set of those back home to put the kids in sometimes!! Overall was a fun diversion for a few hours, keep the kids entertained away from all of the major tourist attractions that suck your wallet dry!\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Rebuilt historic town.", "This is a 4x4 block area of the original town site that has been rebuilt and restored. Interesting history. The most amazing part for me was learning that there were only 600 people in San Diego while San Francisco already a booming city.\n\nLive history in many of the buildings with a working blacksmith teaching kids, lots of gift shops, restaurants and bars.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Tacos, history, a place to stroll with nice shops", "Aside from historical buildings and an old plaza to walk with around with seasonal attractions you can fill up on tacos and beer within walking distance from actually active archaeological dig sites, the local universities maintain them. This place has true history and you can feel the difference there the buildings are representative of the age and history of the location. There are walking tours of haunted areas and you’ll learn a lot about the original downtown San Diego. Park, walk around the plaza, look through cultural and specialty shops, pick your taco joint, maybe checkout the high tea house and definitely don’t miss this place around the day of the dead celebration in October!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Little Mexico in downtown", "You cannot escape the atmosphere, live mexican music, awesome smells from multiple eateries and the wild west style of this little town is just great. I visited as a part of a city tour, so didnt have time to enjoy much but Im pretty sure evenings must make this place a spot to be.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Not phony or contrived- a true (but rearranged) old western town", "This is interesting place to expire for a few hours. Lots to learn about the history of San Diego and the way people lived back in the ' frontier day's.\nDon't miss the beautiful enclave of old Victorian houses just outside the main area - up the residential street past the best western hotel.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A Must See", "We spent an enjoyable afternoon wandering in and out of the various historical buildings. Probably the most interesting was the barn with the old stage coach and wagons in it. There are also shops and eateries. I think the old town gives a good flavour of what things were like. There is plenty of free on street parking near by.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Pleasant", "Easy to get to, often over-looked, full of great attractions and live music the day we went. Take the tour bus!"], ["Reviewed 2 weeks ago", 5.0, "Always great food options", "Old town is great for visitors and locals\nLots of great restaurants and not all of them are Mexican\nCool gift shops\nHaunted cemetery\nParking can be tough at nite and on weekends but a cool place to eat and walk around for a few hours\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great way to spend an afternoon", "Mainly a mecca for tourist and artisanal shopping in quaint and historic buildings. Opportunities to read about and enjoy the history of the area. Very crowded on a sunny Saturday and parking availability (paid and comp lots as well as on street) will be at a premium.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fabulous...", "This place it's full of history, we love it and we came here in every visit to San Diego. Great stores to get a souvenir, it has great restaurants also."], ["Reviewed 3 weeks ago", 5.0, "Wow", "We went to this state park and were blown away. A veritable 1800s Mexican village is set up with vendors, restaurants and buskers. To top this, there are many historical tableaux that describe what San Diego was like at the beginning of western American history.\nI recommend this as a must-see experience.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Many great attractions !", "only had an afternoon to spend here...The weather was sunny and warms!!:-) (Isn't it always here?)\nPeople are friendly and welcoming. There are many shops and stands to visit as well as restaurants & museums. There is a tour bus that seemed very popular and enjoyable.\n\nThe markets have many traditional and handmade items from Mexico and California.\n\nGreat for a day event. Plenty of restaurants and sights to see!\n\nSo much to see and experience...Make a day of it!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "good eats", "Enjoy a wonderful Mexican lunch or dinner. Take an hour or two to walk around Old Town. The hop on hop off trolley stops here."], ["Reviewed 3 weeks ago", 4.0, "Nice atmosphere and great for Mexican restaurants.", "Lovely for an evening stroll to soak up the atmosphere, shops, bars and restaurants. We had dinner in one and enjoyed the experience, starting with a beer or two and some traditional Mexican grub what’s not to like."], ["Reviewed 3 weeks ago", 5.0, "Great experience.", "This is a must visit. The town square with all the old buildings and museums was great. Make sure that you see the small jail behind the courthouse."], ["Reviewed 3 weeks ago", 5.0, "San Diego History in lovely setting", "We often go to Old Town San Diego, to see a play at Cygnet Theater, to have a great Mexican meal (we especially like La Piñata on Juan street), and to wander through the interesting shops. We love the restored hacienda and the Wells Fargo building with a stage coach. Of course it is fun to check out the candy shop and the shops filled with Mexican goods. It is a happy place with green space, live music and people enjoying all there is to see and do. The school house and garden are especially nice too.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great place to visit", "Great place to visit if you have a couple of hours to kill. Great food lots of shopping. There are restored buildings to see. The people are kind and friendly. The sales staff aren’t pushy."], ["Reviewed 3 weeks ago", 5.0, "Go early in the season", "We spent about 3 hours here wandering through the historic buildings and souvenir shops. We found that this early in the season that the park was nearly deserted and we could explore and shop without the hassle of the crowds. Take time to talk to the costumed docents in the various buildings as they are experts and happy to talk about their fields.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "The Old Town", "Very nice place to visit the scenery is beautiful and the people are welcoming. If in San Diego please visit."], ["Reviewed 3 weeks ago", 5.0, "Wonderful Historical Park", "Old Town is the historical landmark of the beginning of San Diego. The historical and cultural atmosphere takes you back in time. Visit the museums, shops, and restaurants. We have visited this place many times and each time I learn something new. Parking can be very difficult during the summer months. I suggest going a few blocks away from center of Old Town - a walk but saves driving around.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "History", "Nice display of 19th century housing starting with the Spanish settlers. Houses are in good condition and information is provided out the history of each. Quite busy and touristic."], ["Reviewed 3 weeks ago", 4.0, "Reminder of old times", "This is a well-preserved piece of history filled with numerous old-time stores and restaurants. You can easily spend a couple of hours hanging out in Old Town."], ["Reviewed 3 weeks ago", 5.0, "Recommend for everyone", "Great restaurants, shopping and culture. Kids would love it and adults too !! Awesome authentic Mexican food"], ["Reviewed 3 weeks ago", 5.0, "Great History", "Great area, all people in period accurate clothing shops, buildings. Local history and people with displays."], ["Reviewed 3 weeks ago", 4.0, "Love Old Town! This is one of my Very Favorite Places in San Diego!", "I've been coming to this area since I moved here - in 1996. They have fabulous Mexican food here. My favorite places are the dining areas that feature an outdoor patio dining experience, and this area is full of them. Some places allow you to take your dogs, my dogs always loved this place. Great place to walk around for dates with your beloved. Love this!\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Not much here", "This is where you can catch the on/off bus tour, but really not much there. Nice older church - not sure it's a mission. Also little Mexican shops but seemed over priced. Several good restaurants and of course the atmosphere is pure hispanic and pleasant."], ["Reviewed 3 weeks ago", 4.0, "A step back in time and good experience", "We liked being able to stroll around here at leisure and check out the little stores and the restaurants. Had MEXICAN food and margaritas for the first time. Good for all ages."], ["Reviewed 3 weeks ago", 5.0, "History,food and drink...great combo!!!", "We visited the old town by train from Santa Fe which stopped very close to the entrance and enjoyed touring the old buildings of old Mexico and Early America . We arrived in the afternoon so it wasn’t very busy and were able to walk around at our leisure. There are some interesting shops selling Mexican goods of all kinds and several restaurants with delicious food. We sat for a while near a stage and listened to a modern Mariachi band which was excellent and really connected with the audience, asking for requests of music to play.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Neat place", "Cool place to visit. No admission. Lots of stores with Mexicana items ranging from jewelry to pottery, linens, handmade leather belts and bags, culinary items and apparel. Historical buildings and exhibits. The Awesome Sauce hot sauce store is a must!"], ["Reviewed 4 weeks ago", 4.0, "Interesting historical perspective", "Arrived by Lyft at 9A before things opened but the weather was beautiful and you can walk around in relative peace. School groups start showing up around 10A which makes for some noise and crowds but not awful. Lots of interpretative signs to read about what you're looking at which is nice. Learned a lot about a period I didn't know much about.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Take your time and see the sights.", "Lots of shops to see and a lot of places to eat also. Take your time and enjoy all the shops in the area. Go inside all the old buildings and see the Displays."], ["Reviewed 4 weeks ago", 5.0, "A Must See in San Diego", "Old Town has so much to offer both the visitor and resident. There are many shops, restaurants, and even a Theater. If you would like to see San Diego in a day, start here and hop the Old Town Trolley."], ["Reviewed 4 weeks ago", 5.0, "Excellent Impressions of Old San Diego", "We were staying in San Diego for 5 days and got the local train to the Old Town. We were very glad we visited as it gives a good impression of the old San Diego and the time of the Gold Rush. Entry into the Old Town National Park is free as are the small museums within the park, including an old school. There are other, again small, museums outside the park which cost a few dollars to enter. We didn't find the staff as friendly or as knowledgeable as the National Park staff. There are some interesting shops within the old buildings in the National Park, many again are as you would have expected them to look in the 18 hundreds. The shops have very interesting and quality items for sale.\nIn conclusion, we thoroughly enjoyed our visit and our taste of Old California history and everything in the N Park was much better than outside of it.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Really enjoyable", "Went to this area twice during our stay. Something for everyone, shopping, food, entertainment, history, museums. Would recommend for everyone. Can walk the entire area easily, free parking on site."], ["Reviewed 4 weeks ago", 5.0, "A lot of History melded into one place", "This place has something for everyone and continues until late night with different things to do and see. During the day schools sometimes make field trips to visit the old homes and the open area to learn how to make candles, a smithy and other museums. Thru even have a haunted house and tour of its history. On the other hand besides the cutesy shops, they have wonderful Mexican restaurants and great drinks !\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Great historical attraction", "What a wonderful sense of history we gained from our visit to Old Town. Great story boards to provide historical information. Wonderful places to eat."], ["Reviewed January 24, 2018", 5.0, "Old San Deigo township.", "Can not say enough about this historic site. Restaurants, gift and Mexican craft shops, and the old historic buildings thoughout the village. Old town trolley stops outside and the tram just across the street to down town San Deigo. Spend a least 3 or 4 hours enjoying the history and lunching at one of the fine restaurants.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Great sunny day activity", "Stroll through the town and enjoy history, music and shopping. Fun day for the whole family. There were vendors selling jewelry, scarves, t-shirts etc. Love the beautiful earrings I bought!"], ["Reviewed January 23, 2018", 4.0, "Touring the area", "Toured old after our hop on hop off tour. Had a beer and snacks at Fred’s and enjoyed people watching from our seats"], ["Reviewed January 23, 2018", 4.0, "Nice way to spend an afternoon", "Nice FREE historic site with good mix of history, shopping and dining. Good for all ages. There is some renovation going on but still so much to see---every building is its own museum."], ["Reviewed January 23, 2018", 5.0, "Loved Old Town", "Great place to visit, such a vibrant street atmosphere and plenty to see and great places to eat. Caught an Uber from lamp district and cost about $10."], ["Reviewed January 22, 2018", 5.0, "A lot of fun (although a bit touristy)", "There is lots to do here, but mainly it is shopping and small museums. It is fun to just wander around, and the mexican food here is fantastic."], ["Reviewed January 22, 2018", 5.0, "Sunday visit using metro was great outing", "Our visit to Old Town was on an early Sunday morning. Not all museums or stores were open yet, but we used the time to attend Catholic Mass at the Church right there. It was a beautiful service and very welcoming of all visitors. We used the metro train from Gaslamp area to get there - buying a daily pass right at the train stop. The museums and stores are fun for young and old alike - I like the gem shop. So much to do. We also attend a small craft market off one of the side streets.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great history of San Diego", "Great place to visit and learn about the history of the area. Lots of neat exhibits and buildings. Good food and souvenirs as well. Mormon Battalion centre is close by as well. Great exhibit for young children whether you’re Mormon or not and best part is that it’s free!!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Really Cool", "A must see! It has the food, the bars, the ambiance and the charm of a small town but everything you could want is available."], ["Reviewed January 21, 2018", 3.0, "Quite touristy", "I may not have seen all the true history here, but it certainly felt heavily touristy. The haunted house was interesting - if you read the provided literature, and ask questions of the staff."], ["Reviewed January 21, 2018", 4.0, "Great Lil town", "Loved the old stores and shops. The Mexican food was great! The Trolly ride so worth it. You get to see so much in a small amount of time. Nice trip with family."], ["Reviewed January 21, 2018", 5.0, "Great for a Drive Through or to Stay A While", "I was in town for a wedding on a day that was cloudy and foggy so I knew anything beach related may not be a good choice. As I tooled around the area I ran across the old town district. I enjoyed driving through and seeing the sites. I did not have a lot of time to spend, but would suggest a drive through at minimum for people visiting the area.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Interesting blend of Victorian era buildings", "This park is both less and more than we expected. It was interesting that one of the main buildings is a synagogue, relocated from downtown San Diego 40 years ago. The surrounding Victorian houses were also moved to the park, and are a contrast to the Spanish architectural styles most commonly found in Old Town. One house has a tea room where we enjoyed a delightful afternoon tea.\nShow less"], ["Reviewed January 20, 2018", 3.0, "Enjoyed the afternoon", "We enjoyed walking around the area. The restaurants in the area were good. We looked in the shops. Lots of things were closed."], ["Reviewed January 18, 2018", 5.0, "A visit back in time", "Absolutely worth it. Beautiful old buildings and very quaint restaurants. Lovely people throughout the whole town. Really worth the trip"], ["Reviewed January 17, 2018", 5.0, "Love this cute little place", "This place was very cute and had a lot of little shops to walk around. The best thing was the food! Feels like a little Mexico city!"], ["Reviewed January 16, 2018", 3.0, "Great Idea but Implementation could be better", "I love the idea of seeing the restored town as it was in 1865. When I was first reading up about the state park online I thought there would be a good separation between the historic sites and the vendors.The place felt very much like a tourist trap to me more than a historic site as there seemed to be more stores and restaurants than actual things to see. Yes, all the vendors dressed in the clothing of the time but I don't know it just seemed to diminish the experience for me. The shopping was nice but everything was way over the top expensive. I'll give an example a single maraca goes for $9.99 were in seaport village down the road you can get the same souvenirs for $2.00. The sites that they did have were nice and the staff was very informative it just seemed they were more interested in earning money than portraying the original town.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Lots to see and do!", "Old Town is the perfect place to start and end your Trolley Tour. There's many excellent restaurants to choose from. We loved Mexican Cafe maybe the most. Their fresh tortilla's are a must! Plan on doing a little shopping, there's great brick and morter stores, along with a few street venders at times.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Christmas in Old Town", "We always love to visit Old Town when in San Diego but have never been there around Christmas. For a Friday night it was surprisingly quiet and low key. The local restaurants were hopping but Old Town itself was a bit scarce.\nKilled some time here before heading to a show at the Cygnet.\nAs usual though, Fiesta de Reyes was lively and full of activity. Had a few street tacos while listening to some southwest Xmas music.\nShow less"], ["Reviewed January 14, 2018", 4.0, "An easy day out", "A bustling lively place, plenty of small shops selling a variety of products such as art, clothing, jewelry, as well as coffee shops, bars & restaurants. Easy to get to via the trolley, and an easy way to pass a morning or afternoon"], ["Reviewed January 13, 2018", 5.0, "Old Town Experience", "An interesting place to stroll around and read or experience and explore the history of San Diego which is very interesting. There are shops galore and restaurants too many to mention. Worthwhile when in the San Diego area."], ["Reviewed January 13, 2018", 5.0, "Old Town Charm", "We came here as part of our day in San Diego. What a great place to visit with both young or older folks. I loved the people, they were so friendly, courteous and helpful. The shops were great to visit. I really enjoyed the cigar store and the restaurants. The food was just amazing, there was plenty of sites to visit as well as small attractions and shows for all to enjoy.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Lots of History", "If you enjoy history and learning about how the United States was settled, you will enjoy this park. Lots of history to learn. My only disappointment is I’ve been here twice and both times the school house has been closed. Lots of cute little shops and places to eat. Worth the time, but check the hours I believe they close at five. Located just off the train, making it easy to access.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Always fun", "This is a fun place to come, walk around, learn a little history, and have a great meal. I’ve been going here since I was a little girl and it really hasn’t changed."], ["Reviewed January 13, 2018", 3.0, "Nice stroll", "We stopped here because it was close to our hotel. If you like touristy shops and Mexican restaurants this would be a good place to go. A bit boring for our adventurous style. Good place to pick up the old town trolley to head into downtown or along the beaches.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Historic district", "Lots of shops, museums and great Mexican restaurants. Stop A of the trolley tours. District is not too large to walk - but is a bit hilly, like lots of San Diego."], ["Reviewed January 11, 2018", 5.0, "Memories from the past...", "What a lovely place! There were times I felt I was in Mexico and times that I was part a Western movie. It's a place that will take you on a time travel with many shops for souvenirs and some nice restaurans too. It's worth a visit.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Old town is great", "Visited old town for dinner with friends and had s great evening. The Mexican food was excellent and the atmosphere great. Parking was a challenge but worth it."], ["Reviewed January 10, 2018", 4.0, "GREAG", "The park has been kept extremely well and gives a great idea of what life was like in Old Town San Diego. Great day out, must see!"], ["Reviewed January 10, 2018", 4.0, "Lots to see and do and don't miss the model trains nearby", "I wasn't sure what to expect but was really very uimpressed with the very varied stores, historic buildings, museums and atmospheric feel. there was plenty to look at- I particulalrly liked the Wells fargo Office Museum/reconstruction. There were plenty of choices to eat or have asnack, and the area was well signposted so you could see where everything was.\n\nAlthough there were lots of people there when I visited, that just added to the atmosphere -it made it feel like a real town rather than just a museum. Well planned and my top tip for San Diego\n\nI'm not sure if it's actually part of the Old Town, but certainly just a few minutes walk away there is a fascinating and extensive model train layout. It covers two large rooms; in one you can see trains go through an imagiantive and extensive city layout and in the other the train takes you through some spectaular mountain scenery. Great for \"kids of all ages\"! (and free\nShow less"], ["Reviewed January 10, 2018", 4.0, "Well worth a visit", "We spent an afternoon here wandering around looking and learning about the fabulous history of the settlement of San Diego and it's tapestry of culture. There is excellent free parking both inside the entrance to the 'Old Town' precinct and at a number of other access points from surrounding streets.\nThere is a lot to see here, numerous really well delivered exhibitions and video documentaries in particular the Wells Fargo museum. There is a lovely shopping and retail square with fudge shops tea shops and a few nice places to grab a meal. We did think that the tourist souvenirs were a tad pricey and found them cheaper just a street across from the older precinct. We walked the extra blocks out of the old town as well and it was pleasant and interesting. There were a few local characters present that I would recommend you avoiding where possible. We never felt unsafe just aware of our surroundings. This is a must do whilst in San Diego.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Fun afternoon shopathon", "This old world plaza is the perfect retreat from a conference or meeting. Dozens of craft shops and artisan markets-live the tobacco shop! Great restaurants to pick up a margarita (or a couple) and enjoy the gorgeous old-world beauty. The flowers are stunning!"], ["Reviewed January 9, 2018", 3.0, "Cool are", "Some good eats in the area. It was cool to see the \"birthplace of California\". Some of the shops were tacky, but we expected that. A good spot to spend 1.5 hours at."], ["Reviewed January 7, 2018", 4.0, "Living History Lesson", "Old Town San Diego Historic Park pays tribute to the cultural influences that make California, California. Museums, shops and restaurants capture the energy of the community between 1821 and 1872. Free history tours are offered."], ["Reviewed January 7, 2018", 5.0, "Interesting Historic Town", "Had a few hours to kill, so we decided to see Old Town San Diego Historic Park. All museums are free, and so is the parking. We spent about an hour and a half looking at most of the museums (Wells Fargo was a favorite), and found all of it worth the time. There are even guided tours every few hours. We were there at the time of opening for most of the buildings, so there was not a crowd. Definitely would recommend.\nShow less"], ["Reviewed January 5, 2018", 3.0, "Picturesque!", "It was colorful and vibrant with a delightful Mexican flavor. I loved the many gift stores; each one an experience in itself."], ["Reviewed January 4, 2018", 4.0, "Nice afternoon", "A really neat place to visit. Great shops with tons of Mexican crafts, tiles, art, etc. We caught the trolly tour here and was able to learn some of the history. All very interesting. Lots of reaturants. Some nice green space area that could be taken advantage of if you needed a rest.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Excellent", "We weren’t aware of this gem before coming to San Diego, very authentic and interesting history to be seen with people dressed in historical clothing, nice shops museums and accurate historical information"], ["Reviewed January 4, 2018", 4.0, "Worth A Visit - See Historic San Diego", "A bit of early to mid-19th century San Diego with restored buildings, a covered wagon and a canon mixed with tourist shops and restaurants, serving mainly Mexican food. There are stores with local artisans demonstrating their crafts. Some of the employees are dressed in clothing appropriate to the time. Definitely a place you should visit if you want some unique photo opportunities while in San Diego. There are a number of free parking lots.\nShow less"], ["Reviewed January 4, 2018", 4.0, "A place to stroll for an hour or so.", "You can park for free at the trolley lot, then walk around this partially historic reproduction of San Diego's first Spanish settlement, circa 1800's. Everything is encompassed in 1 sq mile. In addition to the historic reproductions, there are many Mexican restaurants, curio and art shops. They have re-created many 1800 adobe buildings: a school house, Stable, fort etc. Bazaar Del Mundo, Heritage Park, and Junipero Serra Museum should be visited in the same trip. There are some ok Mexican restaurants here, but not the best San Diego has to offer.\nFor more of this historic San Diego reproduction, I recommend Mission Basilica San Diego de Alcala, the first of 21 Spanish Catholic missions that comprised the backbone of Spanish California settlement. Also Balboa park- with numerous museums, the zoo, gardens and structures that date back to the 1915 Panama-California Exposition.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Touristy but nice to see", "This area is quite close to San Diego airport so if you have an hour spare check it out. Lots of touristy shops and usual souvenirs but there’s some lovely old buildings and it’s a nice place to stroll around. Great cafes and restaurants and some places have great deals on beers and margaritas!\nShow less"], ["Reviewed January 4, 2018", 4.0, "Interesting Family Visit", "We enjoyed the old buildings, toy store, and Mexican Cafe for the fresh handmade tortillas and Carnitas. It's dusty, dry, and a bit crowded with families and tourists of every walk of life. Took the red metro train to get there which was a mistake (lots of crazys), and took the Old Town Trolley back which was a fun ride and informative. Looked lime most people drive and park in large lots.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Great place to stroll and take pics and enjoy", "Super nice place. Easy to park, great to stroll, take many colorful pics, meet other travelers eat Mexican, return again to do it again."], ["Reviewed January 3, 2018", 4.0, "Interesting historical area", "We enjoyed walking around the Old Town area and visiting the restored buildings, now shops. The grounds were well landscaped and made for a nice morning stroll."], ["Reviewed January 3, 2018", 5.0, "So much to see!", "I'm a local, but I love to frequent Old Town. The are so many great restaurants and shops. Parking can be a little tough, but it's well worth it!"], ["Reviewed January 3, 2018", 4.0, "good place to go to", "get the trolly tour and the sealion adventure have lunch at seaport village after take the whole tour finish with dinner at old town"], ["Reviewed January 3, 2018", 5.0, "Great walking area", "I love walking the streets of this area! It is full of life. Lots of fun shops and places to eat in the area as well."], ["Reviewed January 2, 2018", 4.0, "Great food options", "My partner and I wandered around looking at the shops for an hour or two. Plenty to see though most of the shops are duplicates of each other. Had lunch at one of the many restaurant. Great people watching."], ["Reviewed January 1, 2018", 5.0, "Enjoyable Shopping Experience", "Love going into Old Town Square. The kids always have to have some time to run around in the grass area next to the square. They also love visiting Gepetto’s Toy Shop. Brought my sons here when they were kids. Now they bring their children. So many other shops to look at too.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Mexico is alive!", "If you want to live a little bit of Mexico in San Diego, California, this is the right place! The area is packed with a lot of Mexicans restaurants and stores and the atmosphere is simply amazing! Find yourself in a Mexican town, and enjoy its magical perks\nShow less"], ["Reviewed December 31, 2017", 3.0, "Closed on Christmas day", "Being European sets the bar for this type of Museum or collection of buildings.\nThis version is slightly touristtrap-like in my opinion, but being a young country the buildings must of course be relatively new ie. 100-200 years old.\nI enjoyed my walk in the Gaslamp district more...\nShow less"], ["Reviewed December 31, 2017", 3.0, "Boring", "Some old architecture, some restaurants and stores, but nothing special. There is not much to see here. However, it is recommended to stop by one time when you have a chance, just to know it."], ["Reviewed December 30, 2017", 4.0, "really enjoyed our walking tour, wish we had more time", "We took the Trolley here from the San Diego waterfront. So happy we did. We enjoyed walking around, just wish there had been more time to see everything."], ["Reviewed December 30, 2017", 5.0, "Nice Authentic Town", "Free admission. Plan to spend about an hour there. This place has tourist shops, restaurants and exhibits. Loved the Cosmopolitan Hotel. Since It was the Christmas holidays, the town was decorated very festive."], ["Reviewed December 30, 2017", 3.0, "Historical", "Story of life in the old days. It’s like most historic villages. Educational experience. Plenty of gift shops. If you’ve been to Conner Prairie in Indiana, it’s like that."], ["Reviewed December 29, 2017", 5.0, "Interesting", "This is a bit of a tourist trap - but only if you let it be. There are some real gems here amongst some of the stuff that is bit less so. Take your time, don’t rush into buying anything until you’ve had a good look around and just enjoy the atmosphere and experience. There are a couple of really good and unique stores and a couple of great museums worthy of your time. However, you have to look to find them.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Great for family and couples", "So much history in one place. Amazing food and always something going on. Been here numerous times and never disappointed"], ["Reviewed December 26, 2017", 3.0, "A couple of hours spent going back in time.", "We enjoyed all the specialty shops, especially the Mexican ones. The schoolhouse tour was very informative. Don't miss the tiny jail cell."], ["Reviewed December 25, 2017", 1.0, "Visit to Old Town only", "Did not visit the Historic park. I made a mistake and my visit was only to Old Town San Diego with a city tour by trolley. There were many opportunities for shopping and .some unusual items. A good place for browsing and a restroom break. .\nShow less"], ["Reviewed December 25, 2017", 2.0, "Not my choice", "We had taken a tour van around the city. Of all the places we stopped in the 4 hours, this was at the bottom of my list. Seemed dirty, lots of the same things (T-shirt/sweatshirts) lined up in rows."], ["Reviewed December 24, 2017", 5.0, "Everyone enjoyed something", "Overall it was an interesting place to spend some time at. Those in your group can speed through the historical aspects or take your time. My teen daughters didn’t want to go when I mentioned it but they actually liked it and found some things to buy. We ate at one of the nearby Mexican restaurants and then wandered around for an hour or two. Free parking. It wasn’t that far of a drive from the Mission Bay area.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Great place for the whole family", "After the Hillcrest farmers market we drove over to Old Town and spent a few hours exploring the history and foods here. Definitely worth a stop."], ["Reviewed December 22, 2017", 5.0, "Fun time", "This is a fun place to spend 3 or 4 hours. Cute shops and many options for dining. Where we chose wasn't great, but overall experience at the Old Town San Diego Historic Park was fun!"], ["Reviewed December 22, 2017", 5.0, "Historic site", "Really interesting history of San Diego. Great preservation of the original settlement over the space of the 300 years between the Spanish and the Americans. Would recommend a visit you this quaint area and it's free to walk around and see the different architecture styles."], ["Reviewed December 22, 2017", 3.0, "Nice relaxing ares where you can step back a bit in time", "Lots of things to see. The arts, architecture, and culture are brought to life with a range of events, festivals, and tours. Take your time and make sure you have a glass or \"Prickly Pear Cactus Lemonade\"!"], ["Reviewed December 21, 2017", 4.0, "San Diego History", "Old Town is a great little piece of San Diego history. Plan on an hour or 2 to wander, and then time for lunch. Old Town Mexican Cafe is a great lunch spot. Order some fresh tortillas to go!"], ["Reviewed December 21, 2017", 5.0, "great place to spend a day", "went there to see what we could see and do. There was double decker trolley tour which was great and there was a sky tram which gave you a over all veiw. You need a full day to absorb this place properly."], ["Reviewed December 21, 2017", 5.0, "Awesome", "This was a fun place. We spent the entire day in Old town and had a ball. There are many things to do and a lot of cool shops to check out"], ["Reviewed December 20, 2017", 5.0, "Fun", "Was fun good food drinks were cold. Trolley access and easy access. Fun for kids and older adults too. Shopping fun shops very nice"], ["Reviewed December 20, 2017", 5.0, "Wonderfully historic area to visit", "While traveling with my sister-in-law in California, one of our stops was in San Diego to see my daughter. We all went to the park for a day's outing and enjoyed all the historic sites. It was nice to be outside in the fresh air and to see families enjoying a little bit of the past.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Historic Center of San Diego", "Wander through dozens of eclectic shops and mostly Mexican restaurants. You will never become bored in this very busy spot which is the birthplace of our city."], ["Reviewed December 18, 2017", 4.0, "Kinda a cool area", "Interesting area part flea market part historic district. Lots of history surrounded by small local shops and gift shops. From handmade crafts to typical souvenirs. Outside the area there are lots of restaurants and more souvenir shops. Old town features an open air market as well as interconnected shops. Has sort of a cruise port feel to it. Also the main stop for the old town trolly tours.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Charming", "This charming place brings you back to early Mexican-American period. Nice shops and restaurants with authentic Mexican food."], ["Reviewed December 17, 2017", 4.0, "Pleasant surprise. Free. Interesting to see. Photogenic. Restaurants and shops.", "We stumbled upon this attraction. Turns out it is set up as the original town here - the beginning of the development of California. It is free, since besides things to see there are restaurants and shops. The Wells Fargo building was interesting. There are several smoke shops. The Fiesta del Reys was very fun with a band and lots of shops and restaurants. I suppose it is permanent, but wondered if it could be just seasonal. There and throughout, there are lovely Christmas decorations. Nice time to visit.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Fun historic village- highly recommend", "This is a charming historical district of San Diego honoring its roots. You can stroll through the historic village with buildings from the 1800s. Each building is set up as it would have been when the town was established along with people dressed in 1800s garments available to teach you of the time and heritage. Continue on you stroll and find shops and restaurants. The handmade tortillas and smell of delicious food will likely lure you in and you won't be disappointed.\nShow less"], ["Reviewed December 15, 2017", 4.0, "Not enough time.", "We unfortunately arrived mid afternoon and really had not enough time to explore it all. What we did cover was fun and had a great vibe. We could have spent much longer here. We ate at Rust General Store and it was really good. Would love to return again one day.\nShow less"], ["Reviewed December 15, 2017", 4.0, "Cheap day out", "We got the trolley from just in front of our hotel, cheap senior tickets, we got $1.25 one way tickets to avoid the $2 charge for a card.\nThe old town really looks like an old town, most of the museums are free entry, lots of cute shops to wander around, loads of restaurants too. Generally very atmospheric with lots of people dressed in olde world clothing.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Great place for many happy memories", "A great place to stroll for soviners and have a bite to eat. Many small shops and places to eat. Also can see there people dressed in clothes from that time period."], ["Reviewed December 12, 2017", 4.0, "Cute", "This was an interesting place - splashes of traditional Mexico intertwined with modern day Christmas. Loved the shopping opportunities, the restaurants and street-side entertainment. Just a whimsical and fun place to explore."], ["Reviewed December 9, 2017", 4.0, "History, history, history", "This is by definition a historical place, it is small as territory and buildings, but very interesting.\nThere is a synagogue, not in use these days, the first one in San Diego.\nThe restaurants in the Old Town are excellent, too.\nI tried two of them and I was not disappointed, I am sure the others are as good as the two I’ve tried.\nThe Old town is well worth visiting by anyone who cares just a bit about history.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Always a great place to go...", "Always a great place to go to enjoy the rich culture and history of the area and some pretty awesome restaurants there as well. Take your time reading many of the historical site information, don;t just get caught in all the tourist trap stores."], ["Reviewed December 9, 2017", 4.0, "Area has been developed as a park", "Spent a pleasant couple of hours. Parking is difficult. Fairly commercial and not terribly authentic, but it seems to draw a fair number of people."], ["Reviewed December 8, 2017", 4.0, "Nice place to visit", "We like to visit Old Town whenever we go to California. There are a lot of neat little shops to visit and restaurants to choose from along with museums and old buildings. You can see & buy tortillas street side being made fresh while you wait. The tortillas we are use to are a little thicker and better tasting but these are ok since they are hot & fresh.\nShow less"], ["Reviewed December 8, 2017", 5.0, "Old San Diego and best Mexican food", "This very great place to know about old times of san diego and touch of old Spanish culture.\n\nLove the traditional ambiance of mexican restaurant here and food. Food Music and drink have real flavour of mexican culture.\n\n\nFeel like you are back in Mexico.\n\nEnjoyed tostadas and margaritas with Mexican music.\nShow less"], ["Reviewed December 7, 2017", 4.0, "Great way to spend a couple hours", "Got into old town about 1:00 and had lunch at one of the Many Mexican restaurants in old town. After lunch took a good hour and half stroll through the shops and stores on both sides of street. Lots to see and lots of history."], ["Reviewed December 7, 2017", 3.0, "Disappointing", "This seemed very commercial to me. We walked about 1/3rd of the way down the one side of the area and decided that they had nothing new here. It seemed like they are trying to be Williamsburg, unsuccessfully. I would not go again."], ["Reviewed December 6, 2017", 4.0, "Old Cowboy town", "Good photo opportunities and lots of old buildings and a good museum with Stagecoaches etc. must visit if you are in San Diego and brought up on Cowboy films like we were."], ["Reviewed December 6, 2017", 5.0, "Old Town should be part of your San Diego tour", "We were limited on time due to the train schedule to San Clemente. We only had time on this San Diego visit to see Old Town and it was a treat.\n\nTwo main streets about 3 blocks long make up the majority of the area. There are fun areas to walk just beyond the official Old Town, and if you have time you should take it in.\n\nMany of the historic buildings are beautifully restored and it's like being in Old Mexico. There are so many places to eat, the only problem is in choosing which one to try.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Old West, Old California, Spanish charm, lunch and shops for all tastes.", "Old Town Historical Park is the original settlement of San Diego, and with the history and culture represented in the compact museums, shops, visitor centers and restaurants in and around the Park. Enjoy a churro and coffee while listening to music of Guadalajara, sample local olive oils, learn about the Yankee and Spanish founders, browse for Mexican folk art and other attractions in a compact, clean, inviting atmosphere for singles, couples and families.\n\nNote, the Mormon Battalion museum and Heritage Park are just across the street from it all. Parking? usually good if you are patient.\nShow less"], ["Reviewed December 6, 2017", 5.0, "San Diego's History", "I have visited this park many times and there is always something new to discover. I very much like the display in the Information Center of what San Diego used to look like when the first people settled here in the beginning of the 19th century. Don't forget to visit the El Campo Santo Cemetery where you can experience history firsthand.\nShow less"], ["Reviewed December 6, 2017", 5.0, "A place for food, entertainment and culturally engaging", "This is a great place to enjoy mexican food, drinks and shopping. The catholic church is beautiful, and the shops are fun to browse."], ["Reviewed December 5, 2017", 5.0, "Charming and free!", "What is not to love with free museums, lots of shops, great food, and real history. This charming district that encompasses about 4 square blocks is a wonderful respite from the hustle and bustle of San Diego. The iron works shops is amazing and the men who work there are full of stories. A wonderful afternoon was spent exploring Old Town San Diego!\nShow less"], ["Reviewed December 3, 2017", 5.0, "Nice piece of History", "Great place to learn the history of the area. Also nice shops for very nice merchandice. A pleasant park to sit and relax."], ["Reviewed December 3, 2017", 4.0, "California history combined with eateries & shops", "This popular spot for visitors is a nice place to learn about San Diego history, while enjoying live music, dining, and gift shopping too :). Viewing the restored and well maintained buildings gives you a sense of life in the “pioneer days”... be sure to check out the interpretive displays as you stroll around... enjoy!\nShow less"], ["Reviewed December 3, 2017", 4.0, "Lots of Fun Little Shops", "Old Town is a fun place to visit. Lots of interesting history and lots of fun little shops to visit. Don't limit yourseld to the state park, but make your way in to the little town area as well. Lots of nice restaurants"], ["Reviewed December 1, 2017", 4.0, "Very busy and touristy", "This is a cute area with a lot of Mexican influence. There are a lot of older buildings and it goes over the history of the area which was interesting. There are a lot of buildings that are now shops and it is a big tourist attraction.\nShow less"], ["Reviewed November 30, 2017", 5.0, "Little bit of history combined with great food and shopping", "We were going to cross the border into Tijuana but we came here instead. Much easier and no queues. Seriously, great Mexican food and wonderful shopping."], ["Reviewed November 25, 2017", 5.0, "Just like an open air museum, just cool! And it made us happy we stopped", "While visiting the San Diego area, my wife and I dropped in on the historic park on our way back to the hotel in La Jolla and spent a good hour there, if not two! It was enjoyable, the attractions very interesting and we found a couple of good shops and at the end of the stay a very nice cafe. But probably the winning touch for me was that it was so clean and tidy, all the people working there as custodians or shopkeepers we re extremely friendly and knowledgeable, and all the people we saw there enjoyed themselves, that's how you run an attraction, be happy and it will rub off!\nShow less"], ["Reviewed November 24, 2017", 5.0, "Very cool step back in time", "You feel as if you have stepped back in time to the founding days of San Diego. Lots of shops with cool things, restaurants, bars and just a lovely setting. Preservation is the name of the game here."], ["Reviewed November 23, 2017", 5.0, "Nice historic park; good place to learn about the city's first days", "Lots of historical buildings, some excellent theme museums. Also lots of tourist shops and several good restaurants, mostly with outdoor garden seating areas. Adjacent to a main transit node (Old Town Station)."], ["Reviewed November 22, 2017", 5.0, "Just like being in Mexico!", "Love Old Town. Great tourist shops, enjoy the history, the restaurants. Great location right at the bus depot."], ["Reviewed November 22, 2017", 4.0, "If you have time", "Very touristy, very spread out. Great for authentic Mexican cuisines. Some venues have live Mexican dancing shows, no charge, beautiful shopping choices for pottery and Mexican flare iterms. Certain areas dark to walk in between shops. Evening parking after 6 was a breeze and free, off of Wallace St.\nShow less"], ["Reviewed November 22, 2017", 4.0, "History and shopping", "We really enjoyed the walk through the Old Town. The trees and flowers around the courtyard are beautiful! There are many little quaint shops and restaurants. Throughout the park are various museums/historical buildings to go through freely.\nIt can be quite crowded, but still worth visiting. We found free parking and didn’t have to walk far.\nShow less"], ["Reviewed November 20, 2017", 3.0, "Depends on if you like that sort of thing.....", "My husband and I enjoy historic places... while we enjoyed some of the displays... there were too many tacky gift shops.. the historical part seemed like a back drop for tacky gifts and subpar Mexican food. Best display was the Wells Fargo building... we stayed there quite a while... reading and viewing the video they had on how Wells Fargo started. Most of the tourist walked in... and straight out... I’d give this location a one star rating... but upped it to a three just because some people seemed to enjoy the brickabrack and tacky souvenirs... I guess I had set a higher standard... and it didn’t live up to it... so think of it as a tourist trap... then you might be surprised... seemed “low budget”... could be so much more.\nShow less"], ["Reviewed November 20, 2017", 5.0, "History is always a teaching tool.", "This is a place everyone should visit, especially with children. It takes you back to experiencing what the town of San Diego was like. The museum is cute and full of facts of the period."], ["Reviewed November 19, 2017", 3.0, "Glad we stopped back in", "There have been numerous changes to this park over the years. The historic items can be way to miss in the middle of the stores and restaurants. However, the buildings are being taken care of and the staff inside are very happy to share the history if each area.\nShow less"], ["Reviewed November 19, 2017", 1.0, "Tat", "Very disappointing. The park is surrounded by ghastly shops selling overpriced trinkets The one hour tour - advertised as free but now charging $10 and going at different times to those in the official tourist guide - does noyt accept cash. The women supposedly organising the tour were engaged in a serious bit of gossiping well past the supposed time of departure. So unprofessional as to be laughable. We left. Wake up.\nShow less"], ["Reviewed November 18, 2017", 3.0, "Not that interesting", "Our bus driver had indicated it wasn't as good as it used to be and he was correct. Some of the structures were interesting, but not much to see demonstrated"], ["Reviewed November 18, 2017", 1.0, "Don't waste your time", "This is really not worth the visit. It reminds me of every port on a cruise ship - cheap souvenirs and poor food."], ["Reviewed November 17, 2017", 5.0, "SD Old town", "The train leaves you right across the street from Old Town. This place is a mix of museum structures, shopping, restaurants and entertainment. Take you time and walk around, the place is much larger than you think. I went into the chocolate store and purchase some sweets and got a good recommendation on the available restaurants.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Traditional attraction", "Our first point of call when arriving in San Diego was to visit the Old town which is worth doing. There are some of the most amazing original houses with a Mexican flavor with gift shops and restaurants to tempt any pallet. Don't forget the marvelous array of Margaritas at every corner, very colorful and fun to explore.\nOnly down side is the amount of homeless people that are sleeping rough, leaving debris and sometimes begging for money. I realism homelessness is a major issue but it is so sad to such a volume of homeless people drinking alcohol and laying around the grounds.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Great family activity", "Tons of shopping and historical buildings. Took us two days to go through all the streets. Had some excellent Mexican food in Old Towne as well."], ["Reviewed November 16, 2017", 4.0, "Full of rustic charm", "I have now been to this attraction twice and it’s a great way to spend a sunny afternoon if you don’t want to visit San Diego’s large commercial zoos and theme parks which can work out expensive. A bonus for me was that it was within walking distance from my hotel.\n\nThe historical old town has plenty of parking close by, a variety of restaurants, cafes and restrooms. There is an open picnic area too.\n\nThe historical old town is made up from some original old buildings reconstructed on site, ranging from a schoolroom to a blacksmith. These are all free to visit as are the museums. There are local people dressed in period costume who are pleased to tell you about life back more than a hundred years ago.\n\nThere is also a Victorian Heritage Park over the road too which has some interesting old houses, though it’s a shame you can’t go inside them.\n\nThere is a visitor centre and range of gift shops.\n\nAlso next to the old town is a Mexican festival themed restaurant and shopping area which is a bright and colourful way to end your visit.\n\nThere are lots of photo opportunities too.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Fun place to get insight into days gone by,have lunch or dinner and do some light shopping.", "Went to Old Town this trip for lunch as was looking forward to authentic Mexican. Great food always and interesting museums and stores but the highlight was the fact that it was decorated for Day of the Dead. Beautiful altars and displays made the day so much more colorful and enjoyable!\nShow less"], ["Reviewed November 13, 2017", 1.0, "Not worth going", "I thought this was an old part of downtown San Diego but it is only a small \"Disneyland\"like place with shops and fake old houses. Don't waste your time going there."], ["Reviewed November 12, 2017", 4.0, "Fun place to visit", "It is a cute old place for tourist to spend half day in. They offer a $10 old town tour in the visitor center which we missed, but it is very easy to walk around even if you don't have a guide. There are shops, restaurants, church, parks and museums. I will recommend this place to people who wants to spend weekend with their family or those who want to know more about the San Diego history!\nShow less"], ["Reviewed November 12, 2017", 4.0, "Made to look really old", "Maybe it's the period costumes that people in the shops and the activities wear, but there is a sense of going back in time. Certainly, this is a tourist attraction with many places that are really souvenir shops. Lots of Mexican restaurants."], ["Reviewed November 12, 2017", 5.0, "Very interesting and a nice way to spend the day", "We spent the afternoon in Old Town San Diego and thoroughly enjoyed ourselves. There is a lot to see and do from historic buildings and sites to quaint shops. If you’re staying near the Convention Center or the Gas Lamp district, take the green line train and it will take you right to the entrance for $2.50 per person. Well worth a visit if you’re sightseeing.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Interesting", "We walked around a little bit in the early morning before evwrything was open.\n\nVery cute little town. This is how I imagined the old west but without all the chochkie shops.\n\nChocked full of resturants, guided tours, hotels and a lot of fun.\n\nIf you decide to walk around wear sneakers nit heals there are hills.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Day at Old Town San Diego", "This place is rich with culture and history. There are an abundance of historic small buildings and museums to see. Many shops with various items to purchase were available to include clothing, candles and food. There are authentic Mexican restaurants to choose from which have good meals at reasonable prices. Although it is definitely a tourist attraction, I did not see \"cheap stores\" that you would want to avoid, We had a pleasant day!!\nShow less"], ["Reviewed November 11, 2017", 5.0, "Old Town a must see.", "Enjoyed the shopping and the old town feel. Had lunch at Miguels and it was very good. Nice day or half day trip."], ["Reviewed November 11, 2017", 5.0, "Mostly fun, mostly free", "We spent a couple hours here exploring the sites and checking out the exhibits. If you are a history nerd there is lots to see here. Many fun mexican restaurants and even an old syle candy store.\nSome that we particularly enjoyed were the Wells Fargo museum, old schoolhouse complete with a teacher in period dress and an authentic ranch and buildings.\nWell worth a visit.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Cultural, Rich and Colourful ! Marvelous Place!", "Old Town is cultural beauty that you must not miss if in San Diego! It has plenty to offer from beautiful and colorful Mexican shops, restaurants, museums etc. I loved the change from rest of San Diego here and being a cultural bug, was fully immersed in the exciting and romantic Mexican culture. You are going to Love this place!\nShow less"], ["Reviewed November 10, 2017", 5.0, "Old Town San Diego", "We took the hop on hop off bus to get to this place and it was very well worth it. Touring the old town brings you back in history. There are restaurants which are serving authentic Mexican cuisine. We dined at the Reyes restaurant and we were not disappointed with our order of tacos and burritos.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Hispanic Rich Culture", "Every visit to SD, this is one of my favorite places for entertainment, food and shopping. All this along with the rich history and culture makes this a must-see stop on any San Diego visit."], ["Reviewed November 9, 2017", 4.0, "Good food and tourist shopping", "Lots of good restaurants- Old Town Mexican Cafe is always good. If you don’t want to cross the border - but want to buy Mexican gifts - this place has it all from blankets, Mexican dresses, piñata and just about anything you see selling on the streets of TJ - just a little more expensive.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Interesting history", "So San Diego is not where it originally began, Old Town marks where its origins. The Spanish heritage and interesting glimpse into the past captured and held my interest and it was a great visit. Undoubtedly we'll return. My only criticism was that everything held a shop and while there were interesting wares to be had, I hoped it was a bit more will Williamsburg and a bit less like the Mall of America Southwest edition.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Great history.", "Enjoyed walking around and visiting Old Town. Great restaurants and history. Nice restaurants and shops."], ["Reviewed November 9, 2017", 5.0, "halloween", "This is the spot to go if you want a real old west experience San Diego style. Lots of history, food and other stuff"], ["Reviewed November 8, 2017", 4.0, "Rustic- touristy, attractive & fun!!", "Okay so it is a tourist attraction but locals like to eat here too! Old town has a little of everything from the early pioneer, cowboy and hacienda days of San Diego: ..old school house, restored hacienda, pedestrian areas for lots of walking, souvenir shopping both current and ancient, historic Presidio-on-the-hill & open green areas. There's also an area of relocated historic San Diego buildings. Parking can be challenging on some weekends but there are several public lots within easy walking distance. Even a few low key hotels. All in all a family friendly experience that is close to a lot of other attractions: Sea World, Mission Valley, SDSU, Mission Bay.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Commemorates the early years of San Diego", "We visited Old Town San Diego State Historic Park during our city tour with SDR Tours.\n\nThis park is state protected and commemorates the early years in the town of San Diego and includes many historical buildings from the era 1820 to 1870.\n\nIn this historical park are gardens, specialty shops, Mexican food and many museums.\n\nYou must get to this historical park when in San Diego.\nShow less"], ["Reviewed November 5, 2017", 3.0, "Good that this has been maintained or restored", "From the information I had read beforehand, I thought this was the place to go in San Diego. I was somewhat disappointed that there wasn't more to it when I got there. A nice restoration job has been done, but I have seen more interesting exhibits elsewhere.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Walk thru California history", "I have been here before, but was surprised at some recent additions. The cemetery is small & yet to be fully restored, but is worth stopping by. Take time to read about the native Californians that are part of the fascinating history that has taken place here. We met the caretaker that set up the altar for the Day of the Dead. As an Latina raised in the USA, it brought back memories of those featured in the framed black & white fotos I.e. Cantiflas, Pedro Infante to name a few. Finally the shops are fun to pick up a handicraft. Where else can you buy a coffee cup in the shape of a skull, beautifully hand painted to add to your coffee cup collection?\nShow less"], ["Reviewed November 4, 2017", 5.0, "Superb", "This is a superb day out as there is so much to see and much of it is free as it repliIcates old San Diego. There are also retail outlets in the old buildings and some eateries. Well with a visit."], ["Reviewed November 3, 2017", 5.0, "Excellent", "The place is a museum mixed with retail outlets, and restaurants. When I visit San Diego this is a must see place (this was my 4th visit). We looked around the old stables that tell the story of old town and the gold rush. The blacksmith workshop around the back is well worth a visit and we had an interesting conversation with the people working there. They showed us how they make any equipment they want. It was really interesting and informative. There are also more carriage displays out the back.\n\nThis place is interesting for young and old alike.\nShow less"], ["Reviewed November 2, 2017", 5.0, "What an awesome place to be", "Can't say anything negative about Old Town. Easy to navigate, lots of shade ( it was 98 when we were there). Shops all have something unique to take home. Free exhibits and museums. Food and drink, everything in walking distance. Blacksmiths were fascinating. The period buildings are matched with the employees in period dress. All makes for a great day.\nShow less"], ["Reviewed November 2, 2017", 4.0, "Old town With shops in most houses", "Bit of a merged between an open air museum and street mall with tourist shops and restaurants and a open air marked. The old houses are nice and give one an inside to the old time San Diego both from the Spanish/Mexican period and the early US period. However, the inside of the buildings are for most of the used for shops and not exhibits.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Old Town San Diego", "We totally enjoy this great park. Easy parking, good food and friendly people. In the park we visit the hacienda, a museum of the way the original Spanish lived. There are lots of historical buildings and exhibits all around the central green area and the original flag pole.\nWhen you get hungry, you can visit Fiesta de Reyes, enjoy the garden and shops and then eat at Casa de Reyes with mariachis singing and fun, fine food.\nLater, just outside the park is the town part of Old Town with lots of fun restaurants and shops.\nMust try's are Rockin' Baja Lobster, Cayote Cafe and for tequila fans, El Agave tequilaria.\nCincio de Mayo and Day of the Dead are great times to visit and party. Viva!\nShow less"], ["Reviewed November 1, 2017", 5.0, "Too Many Skeleton", "It was just on time, before Halloween and it was perfect to visit this little town to see some interesting skeleton dressing and a lot more as well in the Reyes section. The town was preserved nicely. There are tons of historical facts and artifacts. Nice park in the middle to catch your breath for more. I liked the court house and the theater in Reyes section, the artists were getting ready for the performance. I stopped at the gem store to pick up some stone/mineral for my young ones collection. Right there I could spend hours to have better idea of geographical facts about US and the rest of the world.\nShow less"], ["Reviewed October 31, 2017", 5.0, "One of my favorite places to sight see in San Diego", "I have now been twice to the adorable Old Town San Diego State Park. It is more of an eating, drinking, shopping and sight seeing historic little town that reminded me of Rawhide Arizona or South Dakota little Western towns off the highway. How cute that it is right by the train stop before downtown San Diego. Eat at the Mexican restaurant with the sign \"Fiesta de Reyes.\"\nShow less"]]}}