{"Olvera Street": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Olvera Street", "url": "/Attraction_Review-g32655-d207644-Reviews-Olvera_Street-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e0/c0/94/photo4jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1185"}, "address": {"@type": "PostalAddress", "streetAddress": "Main and Alameda streets 125 Paseo de la Plaza 90012", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90012", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 weeks ago", 5.0, "El Pueblo de Los Angeles", "Olvera Street is across the street from Los Angeles' main railroad station, Union Station. The pedestrian walkway through Olvera Street is a recreation of old LA. You will find Mexican restaurants, food stalls and shops.\nWell worth a visit which can be combined with other cultural neighborhoods close by.\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Gross", "This is a small street with junk trinkets for sale and nothing else. There was some kind of Native American dance performance in the plaza that was okay, but very basic. The area is really dirty, extremely hot in summer, and seemed way too seedy to eat.\n\nAs others have stated, it is a total waste of time. Go to a food truck for better food.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Taquitos", "Make sure you stop and get some taquitos at Cielito Londo restaurant with the green sauce. Small place with shopping and eateries along Olvera Street."], ["Reviewed 2 weeks ago", 4.0, "Not very authentic, but still historic", "While a \"tourist trap\" there are still a few good restaurants for chips, \"guac,\" and a margarita. She stall shops are fun and even the locals will stop here. Walk around the plaza and visit some of the original buildings from the founding of the city.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Great place for gifts", "Olvera Street is constantly packed but if you don't mind the crowds it's a great place for gifts. You can find gifts, food (the BEST potato tacos at La Noche!), baked goods, candy, decorations, clothing, traditional costumes, sewing items...you name it they have it. I have bought some treasured things there from a Guadalupe scarf to sequin roses for my jacket.\n\nBEWARE: hold on to your items close, there can be pickpockets!\n\nTIP: If you are in LA during Dia de los Muertos check out the market and festivities! It won't disappoint.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Flop", "I read that the was one of the best streets in the world which intrigued me. It was a small street with about 100 Spanish/ Latin American souvenir stalls. It took us 10 min and the main event was to take a Starbucks in the local vicinity. Don't bother.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A fun place to shop.", "An interesting tourist attraction and shopping area. You have to remind yourself that you are not really in Mexico. Interesting shopping Kiosks as well as restaurants/snack bars."], ["Reviewed 3 weeks ago", 5.0, "Beautiful and Delicious History", "Olvera Street remains one of the most beautiful, and historic, remnants of early California. It's a gorgeous street, filled with artisan pushcarts and stands of hand crafted Mexican themed crafts and baked goods. Either side of the street is lined with Mexican folk art shops and very good Mexican restaurants. The street sports the oldest original house in California (Mexico at the time) and spans history, from the catacombs where the Chinese workers who built California's railroads were warehoused, to the church where they bless the animals once a year. Plaques along the way tell you what you are looking at. A sunny afternoon on Olvera Street should not be missed. And Chinatown is around the corner, in case you prefer Tsing Tao to Margaritas.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Old Town LA", "Nice little section that shows how the old west used to be. Lots of souviniers can be purchased here."], ["Reviewed 4 weeks ago", 3.0, "average", "a nice place to visit if you have an extra 45 mins of your time while visiting LA, it is nice with many shops that sell only Mexican historical items and clothes, to be honest it is nothing special, if i was visiting mexico then definitely i would love to visit such shops but not while visiting LA\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Cool Museums", "Olvera Street has quite a few museums in amongst the touristy shoppes and the restaurants. We visited he Avila Adobe and wandered thought the rooms, the Plaza Firehouse, the Sepulveda House and the Siqueiros Mural. All were well tended by volunteers and employees. All very educational and fun to visit and all increased our knowledge of the people who founded LA and how they lived. Definitely a place to visit when in LA.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "WATCH YOUR WALLET!", "We ate at one of the sit-down restaurants (Casa de Colonrinda\". The food was AWFUL, it was extremely expensive for what they served and the portions were small. Never knew anyone could mess up on enchiladas. They were made with a tomato base (no mole) and and very sloppy. The only saving grace was the rice and beans. Asked for a lime danqueri and they tried to push a strawberry danqueri on me because they didn't have whiskey sour, and their frozen margueritas were premade. HORRIBLE SERVICE/HORRIBLE FOOD. NEVER AGAIN! VERY EXPENSIVE.\nShow less"], ["Reviewed 5 weeks ago", 1.0, "Waste of time", "Literally a waste of time. Too touristy, only shops, not easy to find parking close by. There is a public parking across the street but very expensive, $2.5 for 15mins…"], ["Reviewed January 22, 2018", 5.0, "Old history", "Love this place...great for a date or a nice family outing. Lots of rich history to enjoy and amazing restaurants."], ["Reviewed January 22, 2018", 5.0, "Lively, colorful, fun", "Great area of Los Angeles full of history, tourist shops and restaurants. Very fun and within walking distance of Union Station and other downtown landmarks."], ["Reviewed January 22, 2018", 5.0, "Nice place to visit you can find authentic Mexican souvenirs", "it is a must see if you are in LA, it is the first street in LA if you are there you need to visit the Avila's Adobe house one of the first houses built in LA back in 1827, also you can find authentic Mexicans souvenirs and good Mexican food,\nShow less"], ["Reviewed January 21, 2018", 5.0, "Historic Heart of LA...Good Food/Drinks meet History!", "This small street is the historic heart and birthplace of a little town that grew into a city called Los Angeles! Some of the oldest buildings in California reside on this street that has roots in the 1790s. This is a hotspot for souvenirs, drinks, and great Mexican food. Sit down and enjoy the atmosphere, food, and music and take it all in. I have taken many of my out of state friends here to explain to them the history of LA and of diverse cultures that call this place home. Parking can be tricky. Plan to park across the street at Union Station for hourly fees. While there, visit the Union Station too!\nShow less"], ["Reviewed January 20, 2018", 4.0, "Street Stalls", "We visited this place and liked it a lot. There were some street stalls selling mainly Mexican products and there were quite a few restaurants. Nice place to spend an hour or two on a day!"], ["Reviewed January 16, 2018", 4.0, "Had to visit and shopped a bit", "I had to go here for the history and for chicano pride :) Pros: decent shopping of a lot of Mexican and Mexican American products. I actually went there to eat, but ended up walking around. I found some cute things and purchased a few gifts. I am a bit disappointed in that it is a huge tourist trap, instead of a more cultural experience for Mexican Americans, but if you want to buy stuff this is the place. I don't think haggling is a thing here, and I wish I had bought the huraches!!\nShow less"], ["Reviewed January 12, 2018", 4.0, "Mexican Street", "Interesting street, shops cafes, entertainment and most of all the people are lovely. Its beside Union Station so handy to get to. Large Square and Church so its a pleasant place to spend a few hours."], ["Reviewed January 10, 2018", 5.0, "Different from rest of tourist places in LA", "We went here on Christmas day. So it was not much crowded but most of the shops were open. It was a different experience to walk through this colorful street with a fountain and a wishing well offering colorful background."], ["Reviewed January 3, 2018", 3.0, "Orignation of Los Angeles", "This where it all started for Los Angeles. Lots of interesting shops and restaurants to enjoy. A little crowded at times."], ["Reviewed January 2, 2018", 4.0, "Olvera street", "Cute place to walk and take pictures. We spent about one hour . Parking was easy to find but attendant was not available. Left money in a “money drop place”"], ["Reviewed December 29, 2017", 4.0, "Not Your Usual Tourist Trap", "The food is good here. The shops are not overpriced in the main and the Guayabera shirts are reasonable and decent quality. If you're going to a show downtown this is a good place to eat. If you are going to Union Station this is a good place to eat. Some great historic buildings are on this street and events are held throughout the year. the Blessing of the Animals (Saturday before Easter), Cinco de Mayo, Fiestas Patrias (Mexican Independence Day), Dia de los Muertos (Oct. 25 - Nov. 2), and Las Posadas (Dec. 16-24).\n\nYou are close to Chinatown in this area, Union Station and a famous French dip eatery. Ask they'll point you in the right direction but have your wits about you. There are some rough areas around here. Go in the daytime.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Weekend in LA", "Such a great place to visit. Lots of culture, shopping and great eating establishments. There is a museum and some historical landmarks to see as well as live entertainment."], ["Reviewed December 29, 2017", 5.0, "Iconic Los Angeles destination", "Olvera Street is one of those iconic local places that every city has, that is both a must-see tourist \"trap\", and simultaneously a genuine local favorite. It's corny, and kitschy, but it's also a lot of fun, and a great place to take the kids when you don't want to spend the whole day, or a ton of money.\nIf you're in town around Easter time, the blessing of the animals is a local favorite tradition on Holy Saturday. It's a big ole party, and kids love it.\nI like to start with a flauta at Cielito Lindo, and stroll south to the Los Angeles Plaza park, and maybe stop for a beer at La Luz Del Dia. You want Olvera Street on your list if you have some free time in Los Angeles on a lazy afternoon.\nShow less"], ["Reviewed December 25, 2017", 4.0, "Quaint", "small street with shops and restaurants. there was a festival that started that day which made it a pleasant surprise."], ["Reviewed December 22, 2017", 5.0, "A must do if you love Mexican food", "Found this recommendation on instagram and it didn’t disappoint. Great marketplace, great Mexican vibe. Great food, lots of craft and gifts. Definitely visit"], ["Reviewed December 22, 2017", 5.0, "Afternoon walk", "Loved everything about it! From the various shops, food options and entertainment. It’s stroller friendly and vendors speak both Spanish and English. Very friendly service and pleasant atmosphere. ATMs are available on site. Recommend you take cash. Some places only accept cash or will charge you tax for credit cards at some shops.\nShow less"], ["Reviewed December 19, 2017", 4.0, "Worth A Visit", "Sure it's pretty touristy and may seem like nothing but booths selling souvenirs but there is a lotta history here and if you take the time to look around and take things in you'll discover why this area is an important part of Los Angeles."], ["Reviewed December 18, 2017", 5.0, "More local than you would think", "I happened to be there on the feast of Our Lady of Guadalupe, a very significant Mexican Catholic feast day. Locals were out and about celebrating the feast, and there were dances and displays for the holiday. There were very few tourists, at least in the morning, but it was extremely safe, with families with kids all around and worshipers filling the church and enjoying lunch and everything. Along with Downtown, this is a great place to experience Old Los Angeles!\nShow less"], ["Reviewed December 3, 2017", 5.0, "november visit", "we walked trough the Olvera street all mexican small shops very cozy and we had very good weather we also eat something there"], ["Reviewed December 2, 2017", 5.0, "Must Visit in L.A.", "Olvera Street is one of those L.A. mainstays that everybody must visit. Yes, yes, it is kind of a weird, tourist style street but there is something about this place that is truly fun.\n\nLike most people from L.A. I have been coming here as long as I can remember. As a child, I loved it. There are a bunch of business stalls that line the center of the street. And, it has been that way forever. Through the years what they sell in these stalls has changed with the times but, though the items have changed, the overall visual feeling and energy of this place has not changed at all. It is the same as when I came here as a child.\n\nTo the sides of the stalls are the businesses that are located in actual structures. Within these stores you will find a wide variety of curiosity items and things you never knew that you wanted or needed. Overall, in terms of shopping, this is a great place to find that unique gift that is truly something different from the norm.\n\nThere are also several restaurants that line the interior of Olvera Street. They are all, obliviously, Mexican cuisine orientated. Each one is a unique place to dine. There are a couple larger, dine in style resultants, and several food stall. Each offers a unique interpretation of Cali-Mex Food.\n\nOverall, fun place. You never know who or what you will see and what fun you may have.\nShow less"], ["Reviewed November 22, 2017", 3.0, "Go Later?", "We went about 10am and many of the shops were still closed. I'm not big on shopping, but we wanted to check it out anyway. I wish we had been there closer to lunchtime as some of the food smelled amazing!"], ["Reviewed November 18, 2017", 3.0, "worth a stop if you have time", "interesting shops, good prices and good food stands. Worth the walk through the shops and can be an easy stop while in downtown."], ["Reviewed November 10, 2017", 4.0, "'Calle Olvera': L.A.'s oldest street", "Used to come here as a kid. We dined in every restaurant there multiple times and loved to watch the Mexican craftsmen make things like belts and glass blown animals. Those craftsmen are mostly gone, replaced by tall stalls of imported tourist items, but the food's still there and it's still great. Many sit-down restaurants, and one take-out place especially famous for it's taquitos.\nShow less"], ["Reviewed November 10, 2017", 5.0, "wonderful !", "We lived near by ,so I actually walk by Olvera Street every day. I enjoyed looking at those colorful kiosks, bustling restaurants and tourists from all over the world. This is a very good hispanic attractions and you will learn a lot about LA past history and old buildings.\nShow less"], ["Reviewed November 10, 2017", 5.0, "A time warp into the Pueblo area of Los Angeles", "This is the original street of the Los Angeles Pueblo. It is nicely restored and there is a park next to it and museums. Good Mexican food and many shops with Mexican ware."], ["Reviewed November 9, 2017", 3.0, "Okay", "It was just okay, with the history of the area (and the oldest building in LA) being the most interesting aspect. However, if you want to buy some Mexican souvenirs or other goods, the prices are excellent."], ["Reviewed November 8, 2017", 5.0, "Mexico in Los Angeles", "Enjoyed going to the market - very colorful with lots of varied merchandise. Nice vibe. Surrounding streets had beautiful music. Highly recommended!"], ["Reviewed November 8, 2017", 4.0, "great place to visit and enjoy the culture.", "This part of my LA tour. There are so many nooks and crannies to explore. I park at the us post office and walk across the street or take the train to Union Station. There is a street sign that I always take a picture of the group I am with. You have to have a street taco at one of there street vendors. Go into the stores and enjoy the Mexican vibe. Make sure to read the signs to understand the importance of this little village. Today there was a Mariachi band walking around. They have a little museum that is neat to explore with a clean bathroom. Across the street from Olivia is an old catholic church and cemetery. Very small but worth the visit. On the weekends they have bands and dancers in the court yard. You never know what your going so see on Olvera street. You cab also take the train to Union Station explore Union station and enjoy downtown LA.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Historic", "I was last here in 2014 but didn't know much about it. I know more now. Make sure you visit while in LA."], ["Reviewed November 1, 2017", 4.0, "Historical place in LA", "We found old mexican culture in such place like LA. Old buildings remind about long time ago. Every thing connect to mexican culture. We found mexican handycraft and of course mexican restaurants. Its good place to know about mexican culture."], ["Reviewed October 25, 2017", 4.0, "Awesome and authentic!!!", "I loved visiting Olvera Street! There was a live band playing, street vendors were set up with all sorts of items for purchase (cheap Mexican blankets, $9.99 and ponchos!!) and tons of food options!! The taquitos are the most well known item from here, but I sadly didn't care for them (too bland). FYI public parking is available close by, but plan on spending $10+\nShow less"], ["Reviewed October 24, 2017", 5.0, "dinner", "Olvera Street is a place we stop every time we are in the area. We love just wondering the street, we have eaten at several places, but El Paso is the best.."], ["Reviewed October 15, 2017", 4.0, "The oldest place in LA", "The only way to describe Olvera Street, is to say that that it appears to be completely out of place in this modern city.\n\nI walked into the square and suddenly the culture changed from American to Mexican, it actually felt like we were in a totally different country.\n\nThis area is a good example of American history, it explains how this part of California was once part of Mexico. It was nice to see the the old Mexican buildings, one of which being the oldest building in LA.\n\nThe building currently consists of 9 rooms, back in day it was estimated to have had in the region of 21 rooms which demonstrated that the owners of the property would have been extremely wealthy land owners.\n\nIt’s well worth taking the time to explore.\nShow less"], ["Reviewed October 4, 2017", 5.0, "little piece of Mexico", "Absolutely love it! My favorite place to go when in LA. I feel just like in Mexico, which is a very beautiful country, unlike the mass media tries to picture it"], ["Reviewed October 4, 2017", 4.0, "Historic buildings and culture", "We visited on an afternoon of a weekday, it was not crowded and we walked around the streets freely. This place has many old historical buildings. There are some souvenir shops. But near the entrance area is not that pleasant, because of homeless people. You feel bit unsafe but when you go in it's okay. This is close to Union Station (metro) and the China Town\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great place to take in a bit of California's history.", "It's always a good time to visit Olvera Street and learn a bit about the Los Angeles' humble beginnings. If you would like to experience a true Latin American cultural experience, I recommend visiting towards the end of October-beginning of November. If you visit during the week mentioned then you will be able to experience the \"Day of the Dead\" celebrations, when latin american families honor and celebrate the lives of their deceased loved ones by erecting an altar in their memory. A definite must see!\nShow less"], ["Reviewed September 29, 2017", 5.0, "A Feast for the Senses", "We went to Olvera Street last year on Halloween weekend to experience the Dia De Muertos events and honorees.\nThe whole experience was so beautiful for our entire family that we are making last minute arrangements to go back again this year. It truly is that special. The beautiful clothing, lovely dancers and music and the tastes of tradition really made a permanent impact on us.\n\nPlenty of restaurant, shopping, and historical options for everyone. I would recommend Olvera Street at any time of the year, but Dia De Muertos was exceptionally beautiful.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Colorful area with friendly vendors", "We went mid-afternoon on a weekday, not crowded and some vendors weren't open. A pleasant stroll through. Overall relaxed experience to spend an hour of so- easy to combine with Union Station visit."], ["Reviewed September 24, 2017", 4.0, "Historic and tourist place", "This is a historic and tourist place in downtown Los Angeles, all the buildings are original...you can find a mexican stores and restaurants. The parking is difficult to find but there are some parking lots nearby. You can find alive music too!"], ["Reviewed September 23, 2017", 4.0, "See where Los Angeles began", "This is where the village started in 1781. Most of the buildings here are original. The Plaza Church is across the street. In the middle of the cobble stoned Olvera Street are stalls and stands full of vendors wares. An old restaurant called LA GOLONDRINA serves good Mexican food.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Taste of Tijuana in Los Angeles", "Taste of Tijuana in Los Angeles. Try the taquitos at the end nearest to Union Station and seek out the cactus candy at on of the stands in the middle of the marketplace. Crafts match what you would find in Mexico."], ["Reviewed September 17, 2017", 4.0, "Like a visit to Mexico", "A great street market with restaurants, food stalls, market stalls and shops complete with a wandering mariachi band. Visit the free museums in this, the original downtown LA. Check out the fire museum too if it's open."], ["Reviewed September 17, 2017", 4.0, "worth to be there", "Close to Union Station. You may visit Mexical Pueblo, Chinese Museum and Museum of 1st firefighters. Drinking water available and restrooms."], ["Reviewed September 16, 2017", 5.0, "Down memory lane....", "Si, es Espana y Mexico en L A ! The beginning of LA ! How can you avoid visiting this grand ole street from the ancien past , when in LA ? A walk down this memory lane is a must to experience the birth and growth of LA. Buy a handicraft, watch an impromptu shake-a-leg at the square , or, taste a bite of original original . And while there do see the oldest residence preserved as it was !\nShow less"], ["Reviewed September 15, 2017", 4.0, "Historic open air mall", "Nice place to spend a few hours enjoying a version of what old Los Angeles pueblo looked like. Lots of shops, restaurant and bars. Wandering musicians etc. can make this an enjoyable place to spend time."], ["Reviewed September 13, 2017", 4.0, "Oldest street in LA", "Quaint Mexican Street , lots of history, places to eat, free small museum. Tacky but fun Mexican market stores, close to Union Station\nTip: if in car, parking not easy, lots of car parks over $2 per 15 mins. We parked easily in US postal office terminal annex , diagonally opposite Olvera Street for $6 all day , closes at 7pm\nShow less"], ["Reviewed September 11, 2017", 5.0, "A Day On Olvera Street", "I was waiting on my shuttle bus to LAX at Union Station. I decided to go for a self guided tour. I happen to come across this little gem. I couldn't stop myself from eating everything I saw from Carne Asada Fries to Giant Homemade Cookies. The Hispanic charm of this place is both authentic and charming. I would recommend any traveler to stop and have a meal and pick up a few things.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Stepping back in time", "Olvera Street is across the street from Union Station in Los Angeles. Walking here is line stepping back in time. The street is lined with small shops and cafes all with a Mexican theme to them. Lots of cool things to see, buy and eat. Very safe neighborhood full of friendly people.\nShow less"], ["Reviewed September 7, 2017", 5.0, "a local staple an must see", "I've been coming here with friends since my school days and it's one of my favorite places in LA. It's a unique historical spot with some old homes-turned-museums, delicious restaurants of all price ranges (get the churros!), and a nice outdoor market to stroll through. There are daily free tours of the area as well, but I've never taken one.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great place for a taco and margarita", "Olvera street is a small little street in the Downtown LA area and a great spot to go grab a drink and some Mexican food. Parking isn't ideal but a quaint little street, that is a must see at least once, while visiting LA."], ["Reviewed September 6, 2017", 3.0, "Olvera Family Trip", "Very nice place. Lots of Mexican Culture. Food is overpriced. Needs more things to do and a place to tell us what to do around the area. There is a very nice Peruvian Restaurant."], ["Reviewed September 6, 2017", 4.0, "Tip Toe Back In Time...", "This is a wonderful place to go visit with the family. It just reminds you of being in Mexico back in the day. The atmosphere is amazing. Little small mexican restaurants with Café style seating. A place for the entire family. There's even performers there on certain days!\nShow less"], ["Reviewed September 6, 2017", 5.0, "OLVERA STREET", "For anyone interested in what Los Angeles was, once upon a time, a visit to old Olvera Street is an absolute must. Mostly Mexican trinket open air shops and food shops (some selling cactus candy, which is delicious). Don't miss the tacito stand at the north entrance. Also, the full service restaurants offer some of the most delicious Mexican food in Los Angeles. History!!!\nShow less"], ["Reviewed September 6, 2017", 4.0, "It's a fun explore day", "Olvera Street can be a fun experience and day trip adventure. If you're from LA or visiting you can take the metro and exit Union Station. Right across the street from lovely Union Station is Olvera Street. It is a great place to shop, explore, dance, and most importantly eat. There are many specialty leather shops, authentic Mexican pots & houseware, and even authentic and handmade clothing & jewelry. There are tasty treats at every corner, many sit down restaurants, taco places, and a churro (cinnamon sugar bread dessert) location. Many love a rolled taco place at the end of Olvera street, but its not my favorite and not very tasty at all. My favorite eatery is the one right at the entrance to Olvera Street by the placita (open courtyard) by the toy donkey. The food is absolutely delicious there and they have seating in the flower courtyard.\nShow less"], ["Reviewed September 5, 2017", 4.0, "Had a wonderful experience", "Went to spend an afternoon and had fun talking to the vendors and eating all kinds of good food. Fun place for the whole family."], ["Reviewed September 4, 2017", 4.0, "Small, But Charming", "This is an interesting part of town. It is essentially the historic core of Los Angeles from when it was part of Spain and then Mexico, so the Hispanic influence is very much apparent here. There is a lot of character to this area, with tiny shops, old architecture, and statues of people like Antonio Aguilar and King Carlos III of Spain. It's right by Union Station so if you're traveling up to LA, it's worth a look.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Great food at a great price!`", "Love going here..by METRO! right across from the train station in downtown LA! Food is priced well, but some times restaurants are crowded. No \"luxury\" here, just good Hispanic food! If you want to buy souvenirs there are plenty of places. Worth a trip if you are not from LA!\nShow less"], ["Reviewed September 4, 2017", 3.0, "Historical and shopping", "Interesting if you go to the Adobe Avila. Shopping typical Mexican outdoor market. Ok but not super impressive"], ["Reviewed September 3, 2017", 5.0, "History, History", "The center of the original pueblo, now a commercial street loaded with restaurants and shops. Culture and history, old Los Angeles preserved."], ["Reviewed August 31, 2017", 5.0, "Small, Historic, Remarkable!", "I played a game with my family called \"Urban Adventure\" in May, 2017. We gave ourselves a goofy inside joke name and howled with laughter as we scored points and saw our name climb the ranks! We did this game along with about 100 other groups online. The goal is to use clues and hints in the questions to find the answers; these are all based on historical or significant monuments and places based on the DTLA area.\n\nI am actually a little ashamed to say that I had NEVER been to Olvera Street before this. I've lived here for a few years, so that's just crazy. I missed out on such a gem. The food is AMAZING here and very affordable. It is friendly for families and children, and couples alike. Spanish and English are spoken fluidly.\nThough I've spent lots of time in DTLA, I had never taken advantage of the remarkable sights, sounds and smells of this historic street. I learned so much.\n\nDefinitely GO! It is worth it.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Great for sightseeing an LA must!", "This place is a small street full of vendors, snacks, restaurants and a rich history. Great to visit and pick up some souvenirs."], ["Reviewed August 18, 2017", 5.0, "Venga Aqui!", "Have you ever travel to Mexico? if you haven't is ok, because Olvera Street or el Pueblo can really acomodate the feeling that you are visinting some ramdom market in Mexico. And if you are from Mexico or had viisi this beautiful land, then I'll promise you will give yu nostalgia.The food is authentic, the music singed by charros and the merchandise made by Mexican can easily transfer your state of mind to the Spanish ambiance in the middle of Los Angeles. The heat in the midst of August accompanied the culture and its original attribute of weather. Colorful and flamboyant garments décor the kiosks and stores that compile in an only one block of pure Mexican ethnicity. Bring your camera, you can't stop taking pictures.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Pulci & Co.", "Very nice place to wander about the streets. All in. Shoppy and grabby. Use your fantasy and you'll get good choices."], ["Reviewed August 15, 2017", 5.0, "Olvera Street Historic Marketplace of Los Angeles", "Olvera Street was created in 1930 “to preserve and present the customs and trades of early California.\" Many of the merchants on Olvera Street today are descended from the original vendors. Olvera Street in Los Angeles, California is also known as the :El Pueblo Historical Monument, Calle Olvera, and La Placita Olvera! Known as “the birthplace of Los Angeles,” is a Mexican Marketplace. Olvera Street is a block-long narrow, tree-shaded, brick-lined market with old structures, painted stalls, street vendors, cafes, restaurants and gift shops.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Colorful Street and Marketplace", "This famous street is located in the historic district directly across from Union Station in the heart of El Pueblo de Los Angeles. It was named after the first judge of the city and county of LA, Agustine Olvera. Olvera Street is colorful, vibrant, and full of life. You can feel the vibe of LA here. Yes, it is touristy, but well worth a visit. We always have lunch at La Golondrina Cafe where you will be served authentic Mexican food, and you will be serenaded by Mariachis. You can buy typical Mexican merchandise here without having to travel to Mexico. Nearby is Chinatown and Little Tokyo.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Small area but worth a visit", "Get a small feel here of Mexico, a few old buildings but mostly stalls, souvenir shops and restaurants. Restaurants are really good. Nice area to stop for a meal, good atmosphere. Its very close to Union Station."], ["Reviewed August 10, 2017", 3.0, "Not what I expected", "All the reviews I read said culture, shows, etc. When we went, it was mostly just people selling stuff and food. Didn't buy much and didn't eat much. It was also quite small and we almost passed by it."], ["Reviewed August 9, 2017", 4.0, "Family wedding trip", "What a fun time down the alley. So many Tourists things to buy. Kids love it. The food is to die for! (if you love hispanic foods).This was a great historic and cultural stop"], ["Reviewed August 8, 2017", 5.0, "Old History of California", "Enjoyed strolling through the street, seeing vendors, restaurants, and historical buildings and mural along the way. There are deals to be had shopping here. Very festive and educational."], ["Reviewed August 5, 2017", 3.0, "Where Los Angeles began", "It is where Los Angeles began some years ago, It has a Latin environment and lots of art crafts from Mexico. Mexican food restaurants are also a big attraction in the area."], ["Reviewed July 27, 2017", 4.0, "Nice break", "Checked out Olvera St, very nice break from walking all over LA (and getting lost). Lots of colors and great taquitos just at the end of the street. Many stands that sell stuff so very touristy but you can still imagine what it was like a long time ago.\nShow less"], ["Reviewed July 26, 2017", 4.0, "A little bit of Mexico, across the street from Chinatown", "You'll probably be in the area either since you're visiting Chinatown, or maybe passing through Union Station or going downtown. If that's the case, why not spend an hour and check out this little slice of Mexico, somewhat reminiscent of Tijuana from what I remember. Food offerings, souvenirs, blankets, snacks...A fun stop, not necessarily a destination.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Relaxed atmosphere", "Just a local market. Not the place to buy anything of real value, but the atmosphere is fun and enough stalls to keep you occupied for an hour or so. Nice little restaurants selling delicious food."], ["Reviewed July 19, 2017", 5.0, "A Classic Tourist Trap - I love it!", "Now if one wants to see an Old School Tourist Trap. With fakery and tinsel. (THey don't call it Tinsel Town for nothing)\n\nThen by all means come here as you can get a hint of what LA LA Land was like back in the 1950's. The only problem is parking which is expensive and very hard to find.\nShow less"], ["Reviewed July 14, 2017", 4.0, "History, food & shopping!", "This is a easy walk from Union Station, this walk down Los Angles beginnings is a must! It has the sight, sounds, AND tastes of Spamish/Mexican history of LA."], ["Reviewed July 14, 2017", 4.0, "Cute walk through Little Mexico", "I didn't even realize Little Mexico was right across the street and up the hill from the LA Union Station. I had some time to kill so I followed the groups of people going in that direction and was pleasantly surprised by the sight. It was just at the end of the summer seasons but the plants were in bloom, adding a lot of life to the already vibrant decorations from the stores. It was fairly early in the morning so the shops were just opening up but I could see there were a lot of places to eat. Going through the nooks and crannies, I found a free museum and also a shack where apparently some Olympians had stayed. I simply walked through but there wasn't that much to do since it was early in the day - I thought it would be fun to visit with other friends for a meal.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Mexico in LA", "Walking around the area, stalls selling everything in the street,Intereting shops around the edge of the stree, Visited the oldet house in LA. In he courtyard there was a grape vine producing grapes that was tested at150 yaer old plant. Visted the Catholic curcrh built in erly 1700s,Offers information in Spanish & English,\nShow less"], ["Reviewed July 10, 2017", 1.0, "Boring", "Blah! Pretty much every vendor is selling a slightly different version of the same thing. You see one vendor, and you've pretty much seen them all. It's a tourist trap with a few good places to eat."], ["Reviewed July 10, 2017", 5.0, "So much fun!", "Such a fun afternoon with lots of interesting finds! Definitely worth the trip over for the unique items and a visit to \"Mr. Churro\"."], ["Reviewed July 10, 2017", 5.0, "Historical and nice.", "No problems here at all - very interesting historical area of Los Angeles - nice to wander through. Would recommend."], ["Reviewed July 3, 2017", 3.0, "Touristy", "I feel it might lose its charm for being too touristy. You can visit 1st street in Boyle Heights or Whittier Blvd in East L.A. or Pacific Ave in Huntington Park to get the Angelino Mexican experience."], ["Reviewed July 1, 2017", 3.0, "a tourist attraction", "Olvera Street is actually the oldest street in Los Angeles, but that being said, it is just a tourist attraction now. There are many shops that sell things that are made in Mexico, but they also have things made in China. There are Mexican restaurants that are pretty decent, although a bit overpriced. If you have never been to Mexico, you would at least get a sense of some of the architecture.\nShow less"], ["Reviewed June 30, 2017", 4.0, "Feels like in Mexico!", "The place is a good touch of Mexico. You could buy a lot of local Mexican souvenirs there. Also has some nice mexican restaurants."], ["Reviewed June 28, 2017", 4.0, "Loved It", "Bustling little area, just across from Union Staion, with lots of stalls selling anything from Mexican clothing to toys to snacks to tacky souvenirs. It was early Saturday afternoon when we visited so may have been busier than normal but there was the added attraction of some entertainment going on. There was some traditional Mexican dancing in one area whilst a chap resembling Erik Estrada from CHIPS was belting out some tunes in another whilst the crowd danced away.\nA great afternoon\nShow less"], ["Reviewed June 26, 2017", 4.0, "Old town mexico", "One of the best historic places in Los Angeles. A nice get away for the day to shop and best of all eat authentic Mexican food of all kinds."], ["Reviewed June 26, 2017", 5.0, "Great shopping area with historic background", "Loved this find on TA! Great shopping, many items from Mexico, some hand crafted, some trinkets. Great atmosphere, architecture and history. Public restrooms available. We did pay $15 for parking."], ["Reviewed June 25, 2017", 4.0, "Ver typical and interesting street.", "Was there the start of Lo Angeles city. Is a very important place to visit, because will make you understand better the Mexican culture. People who created Los Angeles and made it as great as we see it today."], ["Reviewed June 16, 2017", 3.0, "restaurants and tacky souvenirs", "not much here unless you are eating. a bit of history sprinkled in nearby. but maybe worth a leg-stretch."], ["Reviewed June 15, 2017", 4.0, "Quick Stop", "This was a quick stop on our tour of LA but we really enjoyed ourselves. The little food trucks were good and the people were friendly. Go stop to pick up some gifts. We ended up catching a performance that was amazing."], ["Reviewed June 14, 2017", 4.0, "Sweet and fun! GREAT for families!!!", "I love going there. Never bores this LaLaLocal. Apart from all the kiosks and shops, please do try and hunt down the hidden little museums....the best being the oldest house in Pueblo De Los Angeles. A must do."], ["Reviewed June 13, 2017", 5.0, "A must-see place in LA", "If you live in LA or you're only visiting, you MUST visit Olvera street And be sure to have lunch or dinner in one of their restaurants"], ["Reviewed June 8, 2017", 5.0, "Funky little neighborhood...", "It was a little difficult to get to on the bus, until we got our bearings, but it was well worth it. Great place to shop for unusual items from Mexico, it's fun to stroll up & down between the stalls. Had my first sweet tamale from one of the many casual dining spots - yum!\nShow less"], ["Reviewed May 29, 2017", 4.0, "Love the history", "we Loved visiting this it has a lot of history of LA it was fun and the food was great the shops were nice and had some authentic things in them"], ["Reviewed May 29, 2017", 4.0, "Think Old Mexican Market!", "I like Olvera Street because it is the oldest street in LA. Expect to find trinkets and tourist stuff, but not what I would buy. It is a well kept area and a site for some directors to use for films. They have a few restaurants and get busy with locals...\nOn site is a house as it was years ago. The area is a piece of history, but not a must every time we visit. Go at least once!\nShow less"], ["Reviewed May 28, 2017", 5.0, "Great shopping, history and dining", "It is easy to get here by Metro and skip the hassle of driving/parking. If you do drive, try parking in the old Post Office parking lot for $6.00 all day. We go for dinner or lunch and you can enjoy a nice sit down meal or grab something to go at one of the take out places. This place has been here forever and has a lot of history. There are little shopping Kiosks as well as large shops. We go to Mexico quite a bit, and I would almost say they have a better selection here and the prices are fair too. Traditional Mexican clothing and handicrafts, food, blankets, purses and knick-knacks.\nShow less"], ["Reviewed May 26, 2017", 1.0, "JUNK and strictly tourist trap", "Had been years since I visited Olvera St and it will be never before I waste my time again. I remember some pop-up shops hawking Mexican wares, but really????? door to door junk shops. After the first three of the innumerable \"shops\" there is really no reason to go further. It's all the same and very little worth even considering. You can find most of it at any street market in So Cal. Very very disappointing. Perhaps the food would be good but was so disappointed in the overall affect I didn't even bother. Other reviews extol the \"Mexican Experience\"....but I hate to think this is what people take away as an authentic experience. The Avila Adobe and the accompanying historial movie was the only thing of even remote intrerest.\nShow less"], ["Reviewed May 25, 2017", 5.0, "California History", "The shops and restaurants here are quite good. You can find some fun deals and souvenirs. You may even get a free outdoor concert!"], ["Reviewed May 25, 2017", 4.0, "Time on our hands", "We visited Olvera St while waiting for our Amtrak train. We had several hours and this was a great place just across the street from Union Station. There were several restaurants, a mexican outdoor market, etc. There was also a firefighters museum near by. It was a great way to spend some extra time.\nShow less"], ["Reviewed May 24, 2017", 5.0, "So close to Union Station and a must do for Mexican Experience", "I was waiting at Union Station. I have friends in LA who came and brought me to Olvera Street (a short walk across the street). WoW! Amazing markets, wares and foods from Mexico. Great afternoon wandering around. If you get a chance, go have a look.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Definitely worth a visit", "If you're a local or a visitor Olvera Street deserves at least one visit, even if just for the great food and excellent margaritas in one of the restaurants. There's okay shopping that's great for souveniers but it's fun to walk up and down the street and soak in the Angelino atmosphere. It's legendary. Go. Have lunch. Spend a few hours. You can get there easily on the train to Union Station. Olvera Street is within walking distance and the kids will love the train ride.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Exploring LA", "Took the metro link from glendale to union station 12 minutes ride. Walked to Olvera st(first in Los Angeles) lots of music good Mercian food. And cute local shopping."], ["Reviewed May 21, 2017", 3.0, "Pretty small area", "Olvera Street is really just a small block long. There are some good restaurants and some interesting buildings in the area though."], ["Reviewed May 21, 2017", 5.0, "A Fun Play to Visit, but Parking is Scarce", "We made the mistake of trying to visit on a Saturday around noon. The parking lot was full, there was major construction in the area, and no obvious on-street parking. bast on our previous visit, this would have been a good place to see, but I recommend an early arrival especially on weekends.\nShow less"], ["Reviewed May 18, 2017", 4.0, "Mexican shopping/walking area", "Fun area to pasear un rato. Shopping in little shops and stalls. Restaurants. We picked up a large glass of hibiscus tea right there before starting our stroll."], ["Reviewed May 14, 2017", 4.0, "TOURISTY AND TERRIFIC AT THE SAME TIME", "Small area and easy to see it all. Some history mixed in with the touristy shops. Pedestrian area, so no traffic as you might expect a \"street\" to be. Good choice of Mexican restaurants. There's often a Mariachi group playing. Right across from LA's main train station. Also next to Chinatown, so doubly interesting. An enjoyable day out. If you can go in the winter, the \"Blessing of the Animals\" is quite an event. I believe it's in January, but check the date for the annual blessing.\nShow less"], ["Reviewed May 10, 2017", 5.0, "Real LA culture.", "This feels like being transported to an old fashioned small town in Mexico. Great shopping, food and people watching. I think everyone should make a visit during their time in LA."], ["Reviewed May 9, 2017", 5.0, "Very cool", "Fun little area, there's so much to see in such a little place. I could have spent hours there. A fun fact, it's right down the road from China town. So you can take a 5 min walk and check out China town. Definitely check this place out.\nShow less"], ["Reviewed April 30, 2017", 5.0, "Los Angeles Culture", "Away from all of the glitz and glitter there is a history and culture that many miss. Olvera Street is a small window into this culture. From the mariachi bands and dancing to the Mexican cuisine to the street vendors selling cultural items. Cielito lindo has been selling taquitos on this corner since 1934. Across the street? A church that has been a cornerstone to Los Angeles since Los Angeles first came to be. A must stop on your visit to Los Angeles.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Dia de Los Angeles !!!", "If you are going to Olvera Street, be sure to wear a flower in your hair.\nI have been here many times in the last 30 years.\nOlvera Street is a 1930's era romanticized (rebuilt) version of old Spanish/ Mexican Los Angeles. Though its History goes back to the days (1700's) of the Californians, when this was a Spanish Territory/ then a Mexican Territory and the Missions were still being built up and down the Coast. Nowhere in LA is like Olvera Street. Amazingly most Angelenos have not even been here??? Have some wealth and taste in old Los Angeles History and bring a date here to see this wonderful little place, then up to Griffith Observatory (1935) for the views, then over to Yamashiro for great Cal-Asian eats and possibly the best views of Hollywood from the magical Japanese Garden path. I Love Olvera Street for the Trees, Music, History, Food and the Spirits of the \"Californians\"\nShow less"], ["Reviewed April 27, 2017", 4.0, "Historical place", "There's some museum and free of charge. You also can find a lot of souvenirs with Mexican style. Some restaurants."], ["Reviewed April 26, 2017", 3.0, "bit of history", "Olvera street is a typical market area with some interesting historical facets - especially some artistic gems. The stalls are what you would expect and the food is quite good and reasonably cheap. Easy to get to by public transport."], ["Reviewed April 26, 2017", 5.0, "Great place to visit", "This is a nice place to visit with the family, but it depends on what day of the week you go. Usually weekend are super crowed."], ["Reviewed April 24, 2017", 2.0, "Really needs a revamp", "Olvera Street is the oldest street in Los Angeles. It is now not so much a \"street\" as a series of restaurants and individual stalls that all sell the same cheap merchandise all made in China. We're talking child \"guitars\", Mexican dresses, cheap whistles, purses, plastic toys, etc. Each stall sells the same thing the last stall was selling, so don't worry if you saw something you might be interested in buying, you'll see it again in another 10 feet. The stall proprietors are in my many experiences here, not friendly but watch you like a hawk with a suspicious eye. The worst thing about Olvera Street is how inauthentic it is. It could be amazing if there were real Mexican craftsmen selling their products, homemade tortilla makers, etc. but I suspect these stalls are granfathered ownership plots and there is no way to fix this problem. On the other hand, there are a couple of very good restaurants here at opposite ends of the street. My favorite is Cielito Lindo which has been open since the 1930's - it's not a sit-down restaurant although there are a few tables for a quick sit. The taquito plate is a must - that is their speciality! The line snaking across the plaza moves quickly and speaks to the quality and popularity of Cielito Lindo. It;s the only reason I ever come to Olvera Street. It's worth a visit if you're interested in having the most amazing taquitos you've ever tasted, but if you want authentic Mexican/American merchandise and history, you'll have to look elsewhere.\nShow less"], ["Reviewed April 23, 2017", 3.0, "Worth Seeing and Visiting", "I live in LA and always bring out of town guests here to see this wonderful part of LA History. The restaurants are average and nothing to write home about but it's worth the money. The downfall is all the kiosk selling Chinese imported Mexican souvenirs. They are simply in the way and unneccesary.\nShow less"], ["Reviewed April 22, 2017", 3.0, "Mexican market.", "A Mexican market place. Same things in most stalls. Ok if you like this kind of thing. Good prices if you are looking for Mexican wares."], ["Reviewed April 20, 2017", 4.0, "A taste of old Mexico", "Not a huge place but we ended up spending several hours wandering around the shops. Oh the smells....several places to eat there. Lots of colorful clothing and art. At one end is a kind of courtyard with statues. There were some homeless people hanging around and one was blocking the public mensroom doing something unmentionable so, I would not use the public facilities. Beautiful flowers and tiles. I'd recommend going.\nShow less"], ["Reviewed April 18, 2017", 3.0, "Much like Tijuana!", "Not much to see here--all the shops sell the same souvenirs, and there are better restaurant choices in the neighborhood across the street. The shops reminded me a lot of Tijuana, selling cheap trinkets mostly, although there are some authentic things like sugar skulls. I was surprised by how small it is. Not worth spending much time there, that's for sure\nShow less"], ["Reviewed April 18, 2017", 3.0, "SADLY AN OVERRATED, COMMERCIALIZED AND SOMEWHAT TRASHING “HISTORIC CENTER”", "Compared to the OK Corral in Tombstone, Arizona or Colonial Williamsburg in Virginia, Olvera Street as a “historic center” is a huge disappointment and has become a huge commercialized taco stand. Except for Old Plaza Church, Avila Adobe built in 1818, Pelanconi House built in 1857, and the Sepulveda House built in 1887, the rest of the “pueblo” is a waste of time. Touted by the city of Los Angeles as \"A Mexican Street of Yesterday in a City of Today\", Olvera Street is an urban joke and a fake display of a “historic village”.Olvera Street is an example of underfunding, mismanagement, lack of maintenance and municipal bumbling. An example: on a Saturday around noon following a mass, the church was closed for two hours to clean the church. When I asked the custodian why we could not enter the church while the employees were cleaning, she replied that the church was closed out of respect for the cleaners who did not want visitors to see them cleaning the church -- LA is politically correct. However, if you are in the area to visit the Union Station or to eat a French Dip at Philippe’s, take an hour or so to visit Olvera Street.\nShow less"], ["Reviewed April 17, 2017", 3.0, "Early morning walk", "interesting area with lots of info of early settlement and buildings. We had no problems but there were a lot of homeless people on the streets."], ["Reviewed April 16, 2017", 5.0, "Fun way to spend a few hours", "We enjoyed strolling the walkways and shops at Olivera St. Took us about 2 hours total. The souvenirs are fun and priced very reasonable considering. There are lots of Mexican themed items to choose from. There are also many options for lunch. They seem to be sticklers on taking photos with merchandise so be mindful of that. We paid $5 to take a funny picture with our camera. Parking is directly across the street and cost us 6.50 for the 2 hrs.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Love it !", "There's some good restaurants in there and there's a lot of little shops and things you can buy that are always fun"], ["Reviewed April 13, 2017", 5.0, "Discover the History of Los Angeles", "You don't need to go to Mexico, as a little piece of this country still resides in Los Angeles! There is a market selling colourful goods, plenty of Mexican cafes and restaurants offering authentic cuisine, and you can visit Avila Adobe, built in 1818 – it is the oldest house still standing in Los Angeles. As you wander down Olvera Street, you really feel like you've been transported back in time to the beginnings of Los Angeles – it's brilliant, and a great antidote if the garish glitz and glamour of Hollywood has you feeling a little jaded.\nShow less"], ["Reviewed April 12, 2017", 3.0, "I would not make a special trip to visit here", "This is just a small street near Union Station, lot of small shops that sell the same souvenirs and a lot of small restaurants to sample from. A couple of old buildings to show were the city started from, but really not worth a special trip.\nI would visit if you have an hour to kill.\nShow less"], ["Reviewed April 12, 2017", 3.0, "Short and Sweet", "Enjoyed Olivera Street. It's very unique and a tiny strip of town that takes you away from the hustle and bustle of Downtown LA. Great places to eat and buy trinkets then return to your busy life. Perfect day trip get away"], ["Reviewed April 11, 2017", 5.0, "SO THIS IS WHERE IT ALL BEGAN!", "Olvera Street takes you back to LA's Mexican roots. It's a fun place filled with tzochkes for sale (Mexican ones, that is!), some good restaurantsm lots of local color. Definitely worth a visit to see the roots of this vast city. You can go from here to China town -- or Korea town -- for an immersion in the rich multicultural life of this fabulous city,\nShow less"], ["Reviewed April 11, 2017", 3.0, "Can't see what all the fuss is about", "The street itself is full of shops and kiosks selling very similar goods. There were two good attractions on the street - a museum to a street painting and the oldest house in LA. Nearby is Union Station which is worth visiting."], ["Reviewed April 10, 2017", 5.0, "If you love culture and history this is your place", "No matter your background, or country of origin to get a feel and taste of old Los Angeles Olvera street is authentic LA. Enjoy the history of Chicano and Latin blend as only LA offers. Great food and shopping galore. Also go to Grand Central Market\nShow less"], ["Reviewed April 9, 2017", 4.0, "La Luz Del Dia - Good Food", "If you are wondering where to eat at Olvera Street, you have several choices. Look around and see what looks appealing if you are there for dinner, you can sit inside, or in many places sit outside cafe style. My usual go-to favorite for lunch or light dinner is La Luz Del Dia, the food is good, reasonably priced, and convenient and easy to find at the south end of the shops area. The downside: they take cash only.\nShow less"], ["Reviewed April 8, 2017", 3.0, "Touristy stroll", "It cute, but quite small so gets crowded easily, which you'd expect from an street as old as this one. The buildings are great to look at, but it's way, way too touristy, filled with stalls that carry the same merchandise. I wish it was regarded as the historical site that it is.\nShow less"], ["Reviewed March 31, 2017", 3.0, "nice stroll along the street, but way too crowded", "It is a tourist spot in Los Angeles. Go there in the weekdays if you really want to enjoy the time. Otherwise, parking is difficult, and the street is just overfilled with people."], ["Reviewed March 31, 2017", 5.0, "Where It All Began", "The heart of old Los Angeles. Reconditioned a few times, but its still the original Old Town of Los Angeles. A family tradition for generations of Angelinos. Best restaurant is Luz del Dia, Simple, traditional, and surprisingly unaffected by all its fame. Short walk from here to China Town and Little Tokyo, not to mention the regular downtown nearby....old downtown to the east, new stuff to the west. Then hop on the Red Line to Hollywood, the other Old Town really...in all its revitalized, gentrified glory. (I do miss the degenerate days.)\nShow less"], ["Reviewed March 31, 2017", 5.0, "Latin flavor", "Olvera Street is one of my favorite places to go to whenever I'm craving latin flavor foods. You can find all sorts of latin things there and enjoy the day. I would recommend this place if you are ever in the area."], ["Reviewed March 30, 2017", 3.0, "Good for a historical perspective", "Value souvenirs , not quite what I remembered it to be from my childhood , still worth a visit ...don't expect to spend a lot of time here, unless you hit it when there's live music or entertainment"], ["Reviewed March 29, 2017", 5.0, "Worth a walk around", "This area, where LA started, is worth visiting The square is neat as are the buildings around here. The mission church is worth exploring,"], ["Reviewed March 27, 2017", 5.0, "A sense of history", "I enjoy coming to this historic street because I imagine a different time for Los Angeles. Around Halloween (día de los muertos) is the best time to come as you can see skeleton mariachi but year round this place holds its sentiment. The first street in LA. It will be around for many years to come.\nShow less"], ["Reviewed March 27, 2017", 5.0, "Great Place To Spend An Afternoon", "Historical area with great shops and restaurants. Great place to spend some time with your children."], ["Reviewed March 24, 2017", 5.0, "So beautiful", "Lots of little shops with creative things. The food around was good, the atmosphere was calm and lots of history."], ["Reviewed March 20, 2017", 4.0, "Early Los Angeles", "The area known as Olvera Street is part of the larger \"El Pueblo de Los Ángeles Historical Monument\" in downtown LA.\n\nThe street is the site of early settlement in Los Angeles and at one time was the center of commerce and social life in the city.\n\nAmong the buildings located there is the Avila Adobe, the oldest standing home in LA. Well preserved, it is a must see for anyone interested in the history of California.\nShow less"], ["Reviewed March 20, 2017", 4.0, "Fun day for walk", "you will see different cute and interesting stores, lively colors and activities, can be crowded at times. Usually there are dance and music performance by different groups. Authentic restaurants and delicious food."], ["Reviewed March 20, 2017", 5.0, "Great Mexican brunch and great atmosphere", "We had a lovely brunch in La Golondrina Mexican Café and walked around the shops and stalls that line Olvera street. There's a great atmosphere with a street band playing Mexican music to diners in the cafés and restaurants. You can also find some unusual gifts etc. to bring back to people at home if you're on vacation which we were.\nShow less"], ["Reviewed March 18, 2017", 3.0, "Historic precinct ... Shopping mall", "This area is part of a larger Historic area. The Spanish Homestead on Olvera Street was interesting & free of charge. Regretfully a lot of locations to keep viable have to make money. There are a lot of stall holders down the centre of the street.\nShow less"], ["Reviewed March 17, 2017", 5.0, "DAY TRIP WITH MY DAUGHTER", "We love taking the Metro down to Olvera Street. We love to go and eat the Taquitos at Cielieto Lindo."], ["Reviewed March 16, 2017", 5.0, "The birth of Los Angeles!", "Once upon a time, Mexico owned California. A trip to Olvera Street can enlighten you on the first settlers of Los Angeles. There you can see an original Hacienda from the 1870's."], ["Reviewed March 15, 2017", 4.0, "A wonderful caltural atmosphere", "We spent a charming afternoon at Olvera Street, full of entertainment (there's live music and dancing in the square), history (the first street in LA with few landmark buildings), food (many great restaurants on the street) and shopping (lively street market with colorful merchandise). The Union station is across the street and there are few interesting museums in the area.\nShow less"], ["Reviewed March 14, 2017", 5.0, "Great Food and atmosphere!", "Olvera Street has great shopping, great food, and isn't too far from Union Station if you want to combine it with a train ride... get a real taste of the history of California and Los Angeles, and a great way for kids to learn about\nL.A's history.\nShow less"], ["Reviewed March 13, 2017", 4.0, "bright Mexican blouses, tiny ukuleles, marionettes and Mexican food galore", "Been going since I was a kid, this place is always alive. this is the real Los Angeles experience and walking distance to many downtown attractions. Great Mexican food restaurants, strolling Mariachi bands, tons of cute little souvenirs, bustling place for locals and tourists. mostly outdoors so beware of that one day of rain we get each year!\nShow less"], ["Reviewed March 13, 2017", 4.0, "Where Los Angeles started.", "Highly interesting place to see some of LA's early history. Vendors and and Mexican dining. Crowded on weekend and highly commercialized. Visited many times over the years with and without out of town guests"], ["Reviewed March 8, 2017", 4.0, "Old Mexico", "If you've not been to Mexico, here's your chance to experience it's charm and flavor. From Mariachi to street vendors, shops, and delicious food -- a lively visit to include the kids is great.\nI visited the street location only. I have not been to the hotel.\nShow less"], ["Reviewed March 1, 2017", 4.0, "I Love Olivera Street .", "This is were Loa Angeles was Born. It takes you back in time and you feel the culture and History.My daughter and I come here every once in a while to eat Taquitos and walks around a bit. My parents used to bring my sisters and I here since before our birth when they were dating as teenagers. they are 80 yrs old and still love to come and eat here. It has become a third generation treat and brings very warm memories. Our family always eats Taquitos and lots of them. The sauce is the best and it is always a treat. There are lots of places to eat at on Olivera Street but we always go to the first stand on the left at the entrance. this is a real piece of Loa Angeles History. A Must go at least once.There are places along the walk to buy a few take home small gifts.\nShow less"], ["Reviewed March 1, 2017", 4.0, "A Beautiful Piece of Los Angeles History", "Olivera Street is where Los Angeles began. A beautiful must see attraction. Loads of shops and restaurants."], ["Reviewed March 1, 2017", 5.0, "Best Flavor of Classic Spanish Angelino Culture", "Brings you back to the era when Don Diego DeLa Vega may have roamed around Los Angeles. The San Antonio winery is amazing and the churros are the best in LA. A must see if you are around downtown LA"], ["Reviewed February 24, 2017", 5.0, "Quaint and Compact", "Very sweet and quaint wee market area. Lots of nooks and cranny areas to explore. Make sure you take the time to visit the previous censored, but now being restored, Revolutionary Mural by David Siqueiros. This area is steeped in history and definitely worth a visit.\nShow less"], ["Reviewed February 22, 2017", 5.0, "Fun place to visit.", "This place is really fun to walk around and browse the shops for authentic Mexican goods. Nice Resturant's , some with music. Great margaritas to drink. Outdoor entertainment at the end of the block where there are two nice churches to visit. I love the old adobie house that has tours through it.\nShow less"], ["Reviewed February 21, 2017", 5.0, "Best taquitos ever!", "Celito Lindo is a little hole in the wall place on Olivera Street. They have the best taquitos at a great price. Seating is tight and a line forms around noon, but the line moves quickly. The chili relleno is also the best in the Pueblo area.\nDefinitely a must try if you're in the area!\nShow less"], ["Reviewed February 19, 2017", 5.0, "Mexican history and shops", "This street has the oldest house in LA. It is very interesting historically and has great mexican shops and stalls. Had a good time here."], ["Reviewed February 18, 2017", 5.0, "history", "oldest part of la and contains oldest house very mexican, good atmosphere but one or two dody characters lurking abouyt"], ["Reviewed February 16, 2017", 4.0, "Great place for some Los Angeles History", "Olvera Street is a great place to go for some Los Angeles History and Flavor. There are several cultural museums, the oldest Adobe House, places to eat, even a Social Justice Museum!"], ["Reviewed February 15, 2017", 5.0, "Old Los Angeles at it's Best", "If you ever wanted to go back in time while in Los Angeles then Olvera Street is the place to visit. The weekends are filled with song and dance just like ole' Mexico... Enjoy"], ["Reviewed February 15, 2017", 5.0, "No Miss Old LA", "This restored area shows what LA was in the early years. There are museums, old houses, shops and restaurants on the street and there is usually music. The area is surrounded by historic old LA buildings such as Pico House and the old fire station. Don't miss it.\nShow less"], ["Reviewed February 15, 2017", 5.0, "A day in Olvera Street", "You will get to enjoy delicious Mexican Food...and take home a few Mexican souvenirs! There is a lot of history also that you'll pick up on the way."], ["Reviewed February 14, 2017", 3.0, "Nice but over rated", "Olvera Street is nice to visit but it only takes about 30 mins to tour. It like going to the market place in Mexico. You can plan several places after touring Olvera Street."], ["Reviewed February 14, 2017", 5.0, "A taste of Mexico", "I am an old veterano of this place. My first little forays with my parents took place at least 66 years ago when I first saw the glass blower, and smelled the great taquitos frying along the paseo and tasted churros for the first time.. Most recently I still had the super taquitos as I was on jury duty at the courts. Even to this day 2017 I love the charm of la luz del dia even if I have to stand in line and be helped by the stern old lady to a table of her choosing. One year my wife and I played at the Encuentro de Jaraneros in the plaza. Great memories and basically unchanged in 50 years.\nShow less"], ["Reviewed February 13, 2017", 5.0, "The Birthplace of Los Angeles", "Step back in time, to the year 1818 to a charming block in Downtown LA known as Olvera Street. An old time square, which is lined with dancing couples serenaded by the broadcasted or live music, surrounds the 100 year old trees and authentic cultural vendors. Once inside the rustic gates that tote, \"The Birthplace of Los Angeles,\" the Avila Adobe house is tucked inside. Tour the original home that is among the modern day buildings of Downtown LA. Also, is a Catholic Church founded not long after with a museum in the basement that typically showcases artists, history, and holidays meaningful to the culture. Amazingly, this is a small block of history that all should visit not only for educational reasons, but for the culture that is so prevelant and meaningful in this city. (Parking and restrooms are across the street in a dedicated parking area for about $10) Olvera Street is a must see for all!\nShow less"], ["Reviewed February 13, 2017", 5.0, "Wow, this place is great!!!", "It is now,Pueblo de Los Angeles. It has changed a lot! Yes, the stands are still there with their tourist goods, yes,the cheap but delicous small restaurants are still there. Now,there are 5 museums, Aztec Dancers and a fantastic natural upscale place that's great!"], ["Reviewed February 13, 2017", 5.0, "An Afternoon In Mexico Without Leaving Los Angeles", "This is a great place to go with family and friends! Very festive atmosphere with a lot of good and very reasonable places to eat. You can also find a lot of authentic Mexican merchandise!"], ["Reviewed February 13, 2017", 5.0, "Wonderful little neighborhood", "It's a great way to spend an hour or two - you can shop around, listen to some live music, eat churros, get some lunch, and it's train accessible!!"], ["Reviewed February 13, 2017", 5.0, "cute walk for an afternoon", "If you are spending the day in downtown LA, Olvera street is a great way to experience some cool family fun. Take in some free music, fun shopping and great food!"], ["Reviewed February 13, 2017", 5.0, "Great place to visit and grab a bite.", "Very touristy, but fun place to grab a bite. The last booth on the north end \"Cielito Lindo\" serves up the best taquitos on the planet. Las Golondrinas has outdoor seating to have some good food and people watch."], ["Reviewed February 13, 2017", 4.0, "Walking around Olvera Street .", "There are many shops with great prices and all kinds of places to have really good food. Its nice to take the train there and just walk around for the day"], ["Reviewed February 12, 2017", 5.0, "Angeleno Historical and Fun", "I am an Angeleno by birth and have been coming to Olvera street since I was a little kid. It's a great place to bring out of town visitors. But I've also been there for protest marches, business breakfasts that helped me attain sales goals, shopping for ponchos, sandals, and Mexican candies. There are several typical Mexican style restaurants (try the taquitos with quacamole and margaritas-yummy). Don't miss this. Yes, it's touristy, but you'll see what Los Angeles was like before the Gringos took over. And didn't I say it was fun?\nShow less"], ["Reviewed February 10, 2017", 1.0, "nothing much there", "tourist trap - better eats & gifts all over la - they can try selling mexican dinner wares & 100% cotton dress & shirt or something worth it to buy & get some cook direct from mexico - how hard is that?"], ["Reviewed February 9, 2017", 5.0, "LA historical landmark worth the experience.", "This is one of LA's historical landmarks, the beginning of the city itself. At one end is the governor's mansion, Pio Pico, who presided over the area when it was Spain, then Mexico, then USA's governance. And he served all three. Lots of little eateries, the most famous La Golondrina which has been around forever. Food is ok but the experience of eating sidewalk side as if in Europe is delightful.\nShow less"], ["Reviewed February 7, 2017", 5.0, "Yes Go!", "If you're going to go to L.A., go here for REAL Mexican food. The area is worth visiting and you can have some amazing food and really good service too. There are lots of arts & crafts as well, great for gifts."], ["Reviewed February 6, 2017", 5.0, "The heritage of Los Angeles and a fun place to shop", "Olvera Street is the oldest original part of Los Angeles. It has it's own museum, cultural center and lots of stores and vendors. It was part of the original Pueblo and all of the vendors, and restaurants serve up Mexican goods and food. Plan on spending several hours shopping and allow an hour for a very authentic Mexican meal. Take a break and listen to live music and the dancing in the pavilion area. Lots of fun for couples of a family.\nShow less"], ["Reviewed February 5, 2017", 5.0, "The beginning of Los Angeles", "Stroll down the very first street in Los Angeles. Enjoy a bit of history, hear folk music from Mexico, grab dinner at one of the very real Mexican restaurants. Lots to see, wonderful crafts to take home, thesis where LA began."], ["Reviewed February 5, 2017", 3.0, "Somewhat disappointing...", "Maybe I had idealized it in my head based on the reviews but although it was cute, the place wasn't as fun as i had hoped. It's all restaurants (40%) and shops (60%) and all the shops look the same and very touristy. Food was tasty though. I would still have gone in retrospect but we stayed at most 30min when i would have anticipated hanging around longer....\nShow less"], ["Reviewed February 4, 2017", 4.0, "Oldest Street in Los Angeles; Very Interesting", "December 31, 2016 - While visiting the El Pueblo de Los Angeles area, we walked down Olvera Street. It is an area full of shops, restaurants, and souvenir stands. But, it also has the oldest house in Los Angeles, Avila Adobe, which dates from 1818. I review the Avila Adobe in a separate review.\n\nOlvera Street takes about 30 minutes to walk down and back up the other side. It is interesting to see Latino families mingling with tourists as they walk past the sights. I went briefly into one restaurant that had a beautiful fireplace.\n\nIf you ignor most of the gaudy souvenir shops, you can enjoy the festive atmosphere and perhaps, partake of one of the Mexican restaurants.\n\nOlvera Street is worth visiting while you are in the area. It is just across the street from Union Station in Los Angeles.\nShow less"], ["Reviewed February 3, 2017", 4.0, "a tiny colorful gem", "i really loved this little street. Sure it's touristy, it's a bit like a Mexican themed part of Disneyland ran away to the city but it's a charming street to take a couple of laps around before grabbing a hearty bite to eat."], ["Reviewed February 1, 2017", 3.0, "Charming atmosphere marred by endless pseudo Mexican souvenir shops.", "Shop and kiosk after shop and kiosk or largely the same, for the most part, tacky items. However, if you look beyond that, there are some amazing glimpses into original Los Angeles. There are quite a few interpretive stations explaining that period of history, but you have to work hard to find them amongst the shops. Lovely little plaza at the beginning of the street, when I was there a band was playing and a little street dance going on.\nShow less"], ["Reviewed January 31, 2017", 3.0, "Fun shopping", "Bright and colorful shopping area. A bit expensive but a fun day of looking thru a small, colorful Mexican village."], ["Reviewed January 31, 2017", 3.0, "Expensive", "I thought the food was really expensive. It was really hot to walk around I had to leave. The shops were also priced higher than anticipated. I will go back to see if I can have a better experience."], ["Reviewed January 29, 2017", 3.0, "Small & touristy, but worth visitng if you're in downtown L.A.", "I like Olvera Street, don't get me wrong, however, the prices are high & it's small & touristy. If you're doing the DTLA tour (Chinatown, Staples Center, Japantown), it's worth a visit, espec around Dia de los Muertos (11/01) or Las Posadas (12/24). But my favorite \"historical\" Mexican town in SCA is still Old Towne San Diego.\nShow less"], ["Reviewed January 25, 2017", 5.0, "Where it began.", "I loved walking through this area! It felt like a Mexican village of colorful shops and restaurants."], ["Reviewed January 19, 2017", 4.0, "Authenticity!", "I was looking for a birthday present for my granddaughter and it was suggested that I visit Olivera Street. This is a great place to see Mexican and Indian culture. There were performers, lots of shops, and places to visit. I found what I wanted and more.\nShow less"], ["Reviewed January 18, 2017", 4.0, "Learn about Los Angeles History", "Olvera Street is a great place to visit and learn about Los Angeles history. There are many photo ops and I especially enjoyed the old firehouse."], ["Reviewed January 17, 2017", 4.0, "A taste of Spanish culture", "It gives you a feeling that you are in South America, Mexico or Spain as it has such a unique flavor and tapestry."], ["Reviewed January 17, 2017", 4.0, "a nice day", "its a cool place to visit. ethnic, colorful. you don't have to spend money there to enjoy yourself. you can walk to the end of the street and get a taquito for under $5 and be as happy as can be. buy confetti eggs 3 for $1 and break them there without anyone getting mad about the mess.\nShow less"]]}}