{"Pacific Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Pacific Beach", "url": "/Attraction_Review-g60750-d1091705-Reviews-Pacific_Beach-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/71/f8/87/pacific-beach.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1003"}, "address": {"@type": "PostalAddress", "streetAddress": "Grand Avenue", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "Great place to walk around", "Drove down from Palm Springs to stay in a condo just ariund the corner. Great people watching, nice sand to walk on, also a nice sidewalk to walk on. Many shops and restaurants to visit. Love the area"], ["Reviewed 1 week ago", 5.0, "Fun in the Sun!", "The beach is clean and bursting with energy! There are many bars and restaurants which overlook the ocean. I especially loved visiting Crystal Pier to see the beach cottages high up on the pier- so adorable and what a view!"], ["Reviewed 1 week ago", 5.0, "Love the area", "This is my fifth winter that I have spent a couple weeks renting a place on Ocean Blvd. Sorry, I won't mention the specific place because it is small and quiet and I like it that way. If you like to watch the ocean, surfers, bikers, walkers, this place is fun.\nShow less"], ["Reviewed 1 week ago", 5.0, "One of the Best Beaches In Southern California", "We ate lunch at World Famous on Pacific Beach and after lunch walked along the promenade and out onto the PB Pier. The promenade is paved and well kept up. A short concrete wall contains the sand to the beach and the hundreds of people enjoying the beach was astounding. While we did not walk on the beach, it is wide and smooth. Lots of places for sports and the like. We only walked about a mile total but we will definitely be back here!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A Great Walking Beach", "We were very fortunate to stay in a hotel a block away from the Pacific Beach. This is one of the great walking beaches, it is wide and smooth.and you can walk for miles.On the beach walk you will find cafe's, bars and shops. Walking on Crystal Pier offers great views of the coast and the ocean. It's fun to look for fish in the clear water below and to watch the surfers.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Walk along the ocean", "Pacific Beach has a long section of paved sidewalk/walking path a level above the sandy beach. There are a good number of benches with ocean view and a couple of sets of public toilets. People walk, run, walk dogs, skateboard and bike. You do need to watch for the bikes as many are rented to people who do not bike frequently. There are usually surfers to watch. If you play Pokeymon Go, there are several stops and gyms to use.\n\nCome early if you want to get a bench to sit and watch the sunset.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great beach", "We loved this beach. It is nice and long for walks, and lots of sand for laying out. It gets busy but not crowded because it is so long. Nice little tourist shops, restaurants and coffee shops nearby. Stunning sunsets and scenery.\n\nExpect to see lots of young people on weekends as the university is nearby. The vibe here is young, welcoming and energetic. So refreshing!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Increadable!!!!!!", "One of the most beautiful little quaint beach towns I've ever visited!!! Increadable food. Great little bars! Live shows!! Highly recomended!!! P.s. Go to Hodads!!!! You wont regret it!!"], ["Reviewed 3 weeks ago", 5.0, "Nice sandy beach", "Very long, sandy beach, not very crowded during the week, so you are able to find a quiet spot. The water in September was quite rough and not very warm, but it was good to cool down after sunbathing. A lot of beach shaks and bars along the walking street.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice beach and boardwalk", "This is a big beach with lot of sand and open space to jog and people watch. The boardwalk is long and walkable. The water is not all that pretty but the sunsets are beautiful."], ["Reviewed 4 weeks ago", 5.0, "A Great Place To Relax", "We have visited Pacific Beach a few times and we always enjoy the walk, the pier, the cafes and the views of the surf and surfers. A great place to relax."], ["Reviewed 5 weeks ago", 4.0, "Pacific Beach, a great place to stroll, eat and people watch.", "We strolled along Pacific Beach and greatly enjoyed the people, the sand, the waves, and all the interesting homes and restaurants. A Must Do activity for visitors."], ["Reviewed January 24, 2018", 4.0, "Great college town/beach", "This is an awesome beach, very clean with lots of restaurants and bars. The nightlife here is amazing. I found there to be a lot of college kids here, at night more of a 20-40 age group, but all ages would enjoy it."], ["Reviewed January 23, 2018", 5.0, "Best sunset in the world", "I have been lots of places but this area of the world had the best sunset I have ever seen, also there is so many amazing pubs to eat at"], ["Reviewed January 23, 2018", 5.0, "Beach hut", "Rented a beach hut right on the boardwalk. A great sunset and it was great to watch beach life start up in the morning. Friendly lifeguards and lots of surfers. A fantastic location!"], ["Reviewed January 17, 2018", 3.0, "Good place to explore", "This was our first stop in San Diego just because it was near our hotel. Was a busy place, lots of surfing and walkers. There was a lot of seaweed on the shores but not bothersome. My son enjoyed looking for shells and rocks. Great place to watch the sun set.\nShow less"], ["Reviewed January 17, 2018", 5.0, "One of the nicest beaches I have been too", "I came here on a Saturday and I actually started my journey at Mission beach and walked up the boardwalk all the way to Pacific Beach. The views are amazing, even from the boardwalk. The walking, riding, and running path can get a little crowded at times as its frequented by both locals and tourists. The Pacific beach pier offers more amazing views of the coast and Pacific ocean and its pretty cool that they have bungalows you can rent right there on the pier. The boardwalk was clean and very well maintained. There is only really one main street for shopping but there are a few restaurants scattered right off the boardwalk or adjoining street. The only things honestly I did not care for was the quality and upkeep of the public bathrooms. They look like something out of a prison documentary. Metal toilets, no toilet seat most of the time and from what I can tell not cleaned on a regular basis. That would be my only suggestion to the city would be to put some more time into those.\nShow less"], ["Reviewed January 15, 2018", 5.0, "P.B. is one of the best beaches around", "I Love P.B., its beautiful, there is a pier or a boardwalk for a nice walk. Grab one of the best breakfast burritos ever at Konas and then eat it over looking the ocean."], ["Reviewed January 14, 2018", 5.0, "great place to chill", "Stayed in the neighborhood for 5 nights and with so many good choices for eating/drinking it worked out well"], ["Reviewed January 9, 2018", 5.0, "Nice clean beach", "The beach is kept very clean and is a great beach to walk on. We didn't get in the water so I cannot comment on that."], ["Reviewed January 9, 2018", 4.0, "nice beach", "Nice beach with a long boardwalk. It was some good people watching here. The beach was big and long, which allowed you to walk on it for some time."], ["Reviewed January 1, 2018", 5.0, "One of great San Diego beaches, very small sea town feel", "While San Diego is a large city, this area feels like some small sea town. It has a wide and long sand beach, a public peer (Crystal peer) - a nice place to to walk and a lot of small shops and cafes to complete the picture.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Laid Back and Energetic At Once", "We stayed near Pacific Beach and went there everyday for the sunset. The people watching is great. Watch it when you are on the Promenade, the 'traffic' of skateboards, bikes, and other modes of transport are chaotic. The sand is clean and very walk-able. There are numerous places to eat, from dive to fancy. The ocean is the star, as is should be.,, impossible to review.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Beautiful beach inclusive of everyone", "Yes, it's a beautiful beach with clear waters and white sands. I wanted to point out the lifeguards who did so much to keep things clean and peaceful by enforcing the rules about dogs and swimming areas so everyone could enjoy their own version of the experience without being disturbed by others. Not to say that the public was unruly, because it was very friendly, but as someone who is respectful of others, having the lifeguards remind everyone that it is a shared space was greatly appreciated.\nShow less"], ["Reviewed December 25, 2017", 5.0, "San Diego is PB", "With is long beautiful pier in the centre Pacific Beach is the perfect start for a southern California visit. Came her in the 80´s and return as often as I can. The mix of boardwalk life with bars and shops and the beach scene with sun and surf PB is a Californian stereotype for us Europeans. In the best interpretation. Tourmailine surf park in the north end is where you meet the San Diego Senior Surfers Association in the mornings. In the south you have more bars and shops close to the boardwalk.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Great walking beach", "Beauitul spot to take in the cliffs along the beach. You can walk along the beach for miles. There a few trails to hike up nice waves if your into water sports."], ["Reviewed December 8, 2017", 5.0, "Great to walk & ride bikes", "We walked up & down the boardwalk along PB. Loved all the shops & places to eat. Right on the beach!"], ["Reviewed December 7, 2017", 5.0, "Nice Beach", "Very nice area, lots of fun bars! There were a lot more surfers than I was expecting and we enjoyed watching them!"], ["Reviewed December 6, 2017", 5.0, "Headed back to Mission Beach to stay at my favorite place, Pacific Shores Inn for New Years!!! Got a big room this time", "So many bars, restaurants and great shopping near the Pacific Shores Inn. Just off the boardwalk. We park our vehicle in their parking lot and bicycle everywhere. Cant't wait to bring in the New Year at my favorite location."], ["Reviewed November 28, 2017", 4.0, "Normal perfect weather & people watching along the beach.", "Temperatures were record high of 97 & we kept cool walking along the boardwalk here. Sun worshippers, bars, restaurants, gift shops & sport rentals are not overwhelming here. Many bikes, skateboarders, & surfers were out holding their spots for the occasional perfect wave. People are pleasantly enjoying strolling on the boardwalk.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Fun for the beach and also for the views.", "Whether a beach person, surfer, walker, etc. or viewing from the cliffs, it is a beautiful beach. I try to go as often as I can. The distant view of La Jolla is also very nice."], ["Reviewed November 24, 2017", 4.0, "Young hip beach", "Pacific beach, also known as PB, is a cool, hip, college town environment. Lots of young fun people in this town and at the beach."], ["Reviewed November 22, 2017", 5.0, "This is the best part of San Diego!", "Love Pacific Beach! You can walk in different directions for miles. The sunsets are the best ever. So many restaurants and bars. Lots of happy hours. Very friendly and a feeling of being safe."], ["Reviewed November 20, 2017", 4.0, "Lovely wide beaches", "We enjoyed our visit to Pacific Beach which has lovely wide beaches. I loved the pier where there were holiday homes for let for fantastic ocean views. The area has nightclubs, bars, restaurants/cafes, and retail stores and a great place to hang out."], ["Reviewed November 19, 2017", 4.0, "Surfers!!", "Beautiful beach full of surfing! Shops and restaurants are fun. GREAT food. Helpful friendly staff all around. Beware of bums. keep your children close! Shop prices are just right for the area. If searching for souvenirs, go to CVS or similar to save some cash."], ["Reviewed November 9, 2017", 5.0, "Gorgeous views and great area!", "So much going on in this area! Shops, bike rentals, restaurants, beach, surfing and an amazing view!"], ["Reviewed November 9, 2017", 5.0, "Just like it's sister- Mission Beach- But Different", "Well I spent many a fun and wild time at Pacific Beach as a yute (from My Cousin Vinnie) and back when I was in college.......a lot of fun.\n\nThe beach is exactly like Mission Beach, wide, soft sand easy waves for swimming. Lots of people, families, some really good eateries, bars and of course beautiful women showing their wares.\n\nAt Mission Beach, there's only one access road in and out and parking can be trying to say the least when it's busy, but PB has many streets in and out and lots more parking so it's easier access. Don't let me fool you though, on a nice sunny day it can be crazy busy, But Mission on the same day can be really difficult.\n\nThe good news is that the boardwalk starts in Pacific Beach and runs all the way (about 3 miles) to the southern end of MB with lots of space in between.\n\nAt night the party crowd comes for the many bars and restaurants that serve the 20-30 something's, and the want to be back in the 20-30 something's crowd. Popular with the seemingly billions of college kids in the area.\n\nIf you really want to see something very cool, in the late spring and summer on some of the nights of the full moon, the Grunion run. What's a Grunion you ask and where are they running to? Grunion are small fish sort of like anchovies, that come up on the beach to spawn and are gone by morning. First time I saw it, I went down to the beach at about 1am and there were millions of shiney little fish flopping around on the beach and dozens of people with buckets running around filling their buckets. It really is a very cool site to see.\n\nThis is one of SD's best beaches and worth a day or two.\nShow less"], ["Reviewed November 6, 2017", 5.0, "AMAZING beach with lots of good food selection and \"quirky\" shops to visit!", "A MUST \"go to\" when visiting San Diego. GREAT surf and sunbathing with bathrooms galore. Make sure to hit \"Taco Surf\" a block off the beach for the Carne Asada Burrito!"], ["Reviewed November 4, 2017", 5.0, "Great beach and area", "A really lovely beach which has really nice and probably costly housing with some interesting shops as well as many eateries."], ["Reviewed November 4, 2017", 5.0, "Favorite beach!", "PB was my hangout place when I used to live here so I always make sure it is my hangout place when I return to visit. So beautiful and so much to do. Renting bikes is always my favorite and so many good restaurants and bars to choose from. People watching is fun, taking long walks on the beach and watching the sunset is the best (after getting a Kono's coffee of course)!!\nShow less"], ["Reviewed November 2, 2017", 5.0, "Home away from home!", "I love PB! Beautiful beach, fun quirky places to shop and a nice little farmers market on Tuesday afternoons. You can get pretty much everywhere using mass transit from here and it’s pretty reliable."], ["Reviewed October 29, 2017", 5.0, "You should like a hippie vibe :)", "Really, this is a funky little town, in the best way. Crystal Pier would be a fascinating place to stay, restaurants galore (don't expect foodie fare). One get the sense that people of any age could get slightly lubricated and have fun. Or just enjoy watching the crowd - some of whom are still in the VW van phase of life - at 50. There's a strip of antique cum junk shops, typical souvenir stores, mainstream chains for those lacking adventure: really, just a fun afternoon getaway if you happen to be in SD for a convention or something. Thoroughly enjoy spots like this that don't take themselves too seriously.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Nice beach, lots of space.", "Not to crowded with a lot of young people and bars which is really cool. You can walk around and have a good margarita anywhere if you get bored."], ["Reviewed October 18, 2017", 5.0, "Nice beach. Not too crowded.", "clean not overly crowded although the small paved walkway along beach did have bike riders. good variety of places to eat."], ["Reviewed October 15, 2017", 4.0, "Rugged, good for a long walk", "Apart from some facilties by the pier, it's a beach. No frills. Lots of surfers to watch. Mainly just enjoy the noise of the surf and the breeze and chill out, and walk, and walk...."], ["Reviewed October 12, 2017", 5.0, "Beautiful Beach and Boardwalk", "Beautiful beach and boardwalk! If you are at nearby Mission Beach/Belmont Park and you walk 2 miles, you will run into Pacific Beach at the other end of the boardwalk. It's a beautiful walk and it's fun to look at the stunning oceanfront houses as you pass them.\n\nWhile at this beach you can do so much! Walk or rollerblade on the boardwalk, build sandcastles, have a quick bite to eat, play volleyball, work on your sun tan, or simply take in the amazing views.\n\nIn my opinion, there is a better selection of restaurants and bars by Pacific Beach compared to Mission Beach.\n\nThis beach does get very popular in the summer and is quite crowded. If you want easy parking on Memorial Day or July 4th weekends, plan to arrive early.\n\nThere are many shops and eateries by and not far from the beach. You will find some great spots just a short walk from the beach. I recommend Baked Bear for ice cream and Mr. Moto if you are looking for good NY style pizza.\n\nIMO the parking is better at nearby Mission Beach, there are not the large lots down here. However, I did visit Pacific Beach mid-week during the off season and parking was not too bad!\nShow less"], ["Reviewed October 8, 2017", 5.0, "Beautiful!", "We spent a beautiful Sunday here! The boardwalk, pier, restaurants, etc are so beautiful! Nice place to walk or ride a bike, not too crowded and very clean! We recommend this place a 100%"], ["Reviewed October 7, 2017", 5.0, "Beautiful beach, not crowded", "Beautiful beach with lifeguards. There is a walkway and bike path that runs along the beach. Great restaurants line the beach. A wonderful breakfast place to visit is KONOS"], ["Reviewed October 5, 2017", 4.0, "Nice", "Nice, clean beach and boardwalk, many bars and restaurants and souvenir shops , Can also walk out on Crystal pier. We stayed right on the beach at the Ocean Park Inn which was great.Some homeless people on boardwalk and beach but they left us alone."], ["Reviewed October 4, 2017", 4.0, "Late August trip with grandchildren", "We had a wonderful time in PB. We rented a condo 2 blocks from the beach, which came with beach-cruiser bikes. The kids were 6 and 4 years old, and they really enjoyed the scenery as they walked to the beach: the homeless people, the weekenders who were from other parts of the world, the shops near the beach which had an incredible following depending on which day of the week it was. Not only the grandchildren, but all of the members of our group--I was the only one who had ever been there before. I was so thoroughly thrilled to demonstrate the culture of this area of California to them as it was exactly as I remembered it when I was just a teenager. In don't think PB or OB will ever change\nShow less"], ["Reviewed October 3, 2017", 5.0, "Nice place", "Pacific Beach is in a nice area with a boardwalk with some cute shops and restaurants. We were able to find parking about a block away, not too bad. The sand is nice and clean! Plenty of sandy shoreline safe for little ones to play."], ["Reviewed October 2, 2017", 4.0, "Nice beach...", "Loads of people, surfers, runners, restaurants and sand... stayed here for a few days and loved the place"], ["Reviewed October 2, 2017", 3.0, "Needs some TLC", "I've been coming to Pacific Beach for around 30 years now and I was disappointed this time. The boardwalk is dirty and the area looks old and tired. I would love to see it be cleaned up. we rented a condo with no air and had to have the windows open and it was so loud we had a hard time sleeping. It really is a party area.\nShow less"], ["Reviewed October 2, 2017", 4.0, "True California Beach", "The beach itself was beautiful! Clean sand, and lots of space. You can walk for awhile (probably all the way to Mission Beach - but I didn't make it that far) and enjoy the scenery. The water was cold but the sun was hot, so make the most out of it! Lots of surfers to watch too.\nThe town itself wasn't that nice - a few decent looking restaurants but not the \"beach\" town vibe we were looking for.\nI'd go back, but only for the beach.\nShow less"], ["Reviewed September 26, 2017", 5.0, "a beautiful day", "We live near the mid-Oregon coast and quite familiar with ocean city tourist shops. We went so we could compare the water at the 2 different locations."], ["Reviewed September 21, 2017", 3.0, "PB is kind of dirty for my taste", "Ok, first of all-Pacific Beach (PB) is a beautiful coastline in the San Diego area, but it is a real beach town with the dirty feel to boot! Sorry locals...it's just authentic. The beach is nice but more homeless people down in that area. I know that sounds awful to say, but just my opinion! The town of PB is full of some great bars, restaurants and surfers. Cool beach town if you like the real beach towns! There is no major glitz or glam here, just the real deal here.\nShow less"], ["Reviewed September 18, 2017", 4.0, "Volleyball, surfers and kelp", "Nice beach but covered with seaweed. Not too crowded which was also nice. Can walk for miles. Nice soft sand."], ["Reviewed September 17, 2017", 4.0, "PB", "This is a nice chilled beach to go to and just walk and enjoy the sun. Didn't stay here too long but I did enjoy the long walk along the beach and took allot of pictures."], ["Reviewed September 16, 2017", 5.0, "Pardise", "This beach was nice and clean. Water was a bit cool but after being in the sun it was nice to run in and cool down. It was fun to watch the surfers. Loved watching the helicopters fly over. Not too many seagulls which was nice. Beach was not rocky at all. Wear good sunblock!\nShow less"], ["Reviewed September 13, 2017", 4.0, "Nice beach", "We had a good time at Pacific Beach. It's a clean beach popular with young adults. Nice board walk for a stroll and some good restaurants. Worth a visit."], ["Reviewed September 11, 2017", 5.0, "Such a blast!", "We enjoyed PB so much while we were on vacation! Great environment, lots to see and do. It was awesome to see all the surfers out. Highly recommended!"], ["Reviewed September 8, 2017", 5.0, "An amazing place!", "Visited from the east coast and I absolutely loved it! Great place to chill, people watch, eat and have drinks all in one. The beach itself was clean, great waves, and by the pier is the best spot to watch the sun go down while hitting a watering hole.\nLots of quaint shops along the boardwalk, plenty of food and drink.\nShow less"], ["Reviewed September 6, 2017", 4.0, "A fun beach.", "I have regular family reunions here, and honestly. What beach is bad. The only reason I gave it a 4 is because I don't care for the seaweed."], ["Reviewed September 2, 2017", 5.0, "Love this beach", "This beach is clean and well maintained. There are lots of life guards. There are many places to shop, eat and rent bikes/scooters. Lots of fun"], ["Reviewed August 30, 2017", 5.0, "Love this beach", "What a great beach for people watching. Its great to rent a bike and explore the entire strip during your visit. A lot of delicious dining options at the beach, especially for taco lovers!"], ["Reviewed August 29, 2017", 5.0, "Great beach with lots of activities", "Board walk and pier was a great place to walk and people watch. Shopping was reasonable and many restaurants and bars to enjoy. Belmont Park within walking distance. Great family place where police patrol regularly."], ["Reviewed August 28, 2017", 5.0, "Great boardwalk!", "Very clean beach area with a boardwalk that extends for several miles. Plenty of beach access. We enjoyed watching all the surfers from the beach and the pier!"], ["Reviewed August 22, 2017", 5.0, "pacific beach", "this was an awesome beach, easy to find off the bus route. friendly vendors, beach chair rentals, boogie boards. trolley train to old town and then bus to get to beach , a little hard but it can be down. great place to beach"], ["Reviewed August 21, 2017", 5.0, "LOVE THIS PLACE", "White sands, clean beach, surfing, swimming, heavily patrolled to keep people safe.You can enjoy the pier or just sit and watch the crowds all day long."], ["Reviewed August 19, 2017", 3.0, "Recommended for boogie boarding and surfing", "Good beach for boogie boarders and surfers but parking is difficult and our family found it a bit crowded (the beach is very long but somewhat narrow), the water a bit too cold (especially for the young ones), and generally not quite as enjoyable as other beaches in the area. We quite like the Pacific/Mission Beach area and so we'll surely return to the beaches here as well but for a dedicated family day at the beach we'd likely go elsewhere.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Huge beach with great boogie boarding waves", "We visited several beaches in the San Diego area, and this one was the largest. The boardwalk alongside stretches for quite a distance, and all along it, you will see an expanse of soft sand. There's one section with some restaurants/snack shops right on the boardwalk, along with a place to rent boogie boards and surfboards - I think it was between Reed Avenue and Grand Avenue. We parked right on Reed Avenue and found a free spot only a short walk to the beach. There are areas marked for surfing and areas marked for swimming, and the lifeguards will tell you to move to the right area, a fact that helps you feel a bit safer if you've got kids playing in the water. Though there's a bit of seaweed, the water is pretty free of jellyfish and the like, so between the nice sand for sandcastles and the inviting water, this is an inviting family beach.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Classic west coast beach", "Go early in the morning, just after daybreak, to mix with the habituals - surfers quietly waiting for the next big wave, yoga practitioners sitting quietly, and the \"fit\" crowd running jogging biking along the boardwalk.\n\nDuring the day, its filled with bronze (and bronzing) bodies. And then evening brings the groups and couples watching the sun go down.\n\nLots of quaint shops along the boardwalk, plenty of food and drink - you'd think you were off on a tropical island destination somewhere - but really only 15 minutes from Downtown San Diego.\nShow less"], ["Reviewed August 15, 2017", 5.0, "One of my favorite beaches in SD", "This is a great beach in a great location. Around it are great places to shop and eat, like Urban Outfitters, Brandy Melville, and The Baked Bear. I went several times and it was never very crowded."], ["Reviewed August 14, 2017", 5.0, "Beautiful Pacific Beach", "Absolutely loved this beach!!! It is huge! If you are there for swimming, be sure to set up between the yellow and black flags. The other sides of the flags are designated for surfing. I must say,the surfers were amazing to watch. We went to the beach 6 out of are 7 days in Pacific Beach! The boardwalk is also very fun. Huge variety of restaurants,bars and shops.My family will definitely be going back to the beach and boardwalk!!!!\nShow less"], ["Reviewed August 8, 2017", 4.0, "Be aware what area you are going to swimming or surf", "The beach was nice, but there was some seaweed. Look for any signs as to if the area is a swimming or surfing are. We ended up in the surfing area and had to move quite a distance if we wanted to swim. It was fun watching the surfers though.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Less crowded than OB", "Spectacular views made be seen from PB. Parking was never a challenge for us the four times we went but I think we had parking karma going cuz there weren't a lot of close-up places.\n\nSeveral restaurants lay close by the beach, which offered outdoor showers to rinse off sand before heading to breakfast, lunch or dinner.\n\nThe beach was clean, provided life guards and was good for surfer watching. Less crowded than OB too.\nShow less"], ["Reviewed July 30, 2017", 3.0, "There are Better Beaches", "Summertime here is pretty crazy and I find it to be a bit grungy. Walking down the boardwalk is best done in the evening as there are lots of bikes, skateboards, roller blades all zipping in and out among the walkers. There's very crowded bars & eating places and I was amazed to see Tower 23 located here as it seemed more upscale La Jolla than PB. All in all, I prefer Carlsbad Beaches or the more laid back Ocean Beach.\nThis all seemed more manic than relaxing.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Lots going on", "Fun and lively area. Lots to do here- bike riding along promenade, shopping, eating, people watching, surfing, sun bathing. Sunsets are amazing!!"], ["Reviewed July 21, 2017", 4.0, "Grand beach, lots of dining options too", "Get there early to park close by, or face a long walk. Absolutely beautiful and safe. Walk out on the pier, that's cool too"], ["Reviewed July 21, 2017", 5.0, "Favorite Beach", "I spent one of my days here, on a recent week-long trip. Pacific Beach was one of my favorites! Plenty of beach amenities (restrooms, showers etc) and very clean. Make sure to spend some time walking the promenade - plenty of interesting shops, great places to eat. Only negative is parking...it was very difficult to find on a weekday afternoon. I ended up shelling out a decent sum to park in a nearby plaza, only because I really wanted to visit. Despite the cost, it was worth it (to me) for the experience, pictures and memories!\nShow less"], ["Reviewed July 20, 2017", 4.0, "Fun casual beach", "Great wide beach with soft sand. Easy to walk along the shore and great views of the Crystal pier. Look for parking on the side street in town and walk down to the beach."], ["Reviewed July 20, 2017", 5.0, "Not as crowded as Mission Beach", "I've tried both Mission Beach and Pacific Beach. I found the latter less crowded and thus more peaceful."], ["Reviewed July 20, 2017", 5.0, "Great Town with an Exciting Strip", "The Nightlife is exquisite! From the \"Baked Bear\" Ice Cream parlor to the plethora of Micro-Breweries and Bars...the town of Pacific Beach is Hip, Fun and innovative!"], ["Reviewed July 19, 2017", 4.0, "Pretty hippy area to hang around", "Pacific Beach (PB for short) is a hippy area for local San Diegans. A lot of young people, beach-goers and surfers live in this area. The beach is great, and the PB pier is a great location to hang around. Lots of interesting restaurants and stores in the area. Very hippy indeed.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great Beach, a must see", "We were on a family vacation and my two teenage children took surf lessons at Pacific Beach. Great beach, not overly crowded, fairly clean and an good boardwalk. A bunch of good beach shops. Parking is somewhat difficult, you'll have to park a couple of side streets away, but its worth it for sure. Good time, safe, no seedy activity seen.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Great Beach option!", "This beach is gorgeous! We went on a Friday and Saturday. Friday was so nice because it wasn't too crowded. Saturday was crazy! There were a ton of people! This beach has restrooms, showers, and water fountains. The water was a nice temperature in the heat of the day. There is a section for surfing closest to the pier, a section for swimming next to that, and then another section for surfing. The lifeguards strictly enforce this! If you don't really care about which section that you sit in there are many spaces for towels and stuff. However, if you want to be near the swimming section of the water, it gets really busy! We always felt really safe and spent most of our time here!\nShow less"], ["Reviewed July 17, 2017", 5.0, "Lobster Bisque", "World Famous at Pacific Beach had great Lobster Bisque. The wait was long but we were there at prime dinner time. Call ahead and make reservations. Don't forget to try the Lobster Bisque!"], ["Reviewed July 16, 2017", 5.0, "Excellent beach", "When we were in San Diego in mid July there was a high surf warning at the beach. There were tons of surfers and beach goers, we had a great visit."], ["Reviewed July 14, 2017", 5.0, "Surfs up!", "Beautiful beach,great way to spend the day and soak up some sun. we parked a couple of blocks away which your best option."], ["Reviewed July 12, 2017", 5.0, "Amazing Sunset Walk", "We did not spend the day at this beach, but wandered down for a walk after our supper at Buddy's Diner. Words do not describe how beautiful the walk is at sunset here. It's is the quintessential California beach sunset that people long to see."], ["Reviewed July 12, 2017", 5.0, "Peaceful", "We tried to go to the other more popular beaches and found that parking was a nightmare. We stumbled upon this beach and it was a gem. There were quite a few people here but there was plenty of space to be somewhat secluded. We collected seashells and relaxed. It was very nice and not too busy. They had restroom areas at the 'entry' area before the stairs and a wash station before you leave the beach. It worked out really well. Oh and we had to park in the neighborhood but it wasn't bad.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great Beach", "This is a wonderful beach. Lots of sand and waves. There is a boardwalk where you can get souvenirs and food."], ["Reviewed July 10, 2017", 5.0, "Great place to visit and surf", "We love staying in the Pacific Beach area, this year we were able to signup our grandson for surf lessons. He had a great time and wants to do it again next time we visit here."], ["Reviewed July 10, 2017", 5.0, "Great time", "Visited fourth of July, lots of people but was family friendly. The beach is cleaned nightly, plenty of garbage cans and restrooms. Lots of restaurants/bars and shops."], ["Reviewed July 6, 2017", 4.0, "GO EARLY!!!", "This is a great public beach with limited parking that is gone by mid to late morning! Go early, and if you need to use the bathrooms just remember it's the same city that manages them as the city that never fixes it's roads..."], ["Reviewed July 5, 2017", 3.0, "Don't get run over", "This beach has a young crowd, including some skaters that will pretty much run you over when you are on the sidewalk, be careful. Nice, clean beach, but I think there are some options in San Diego that are as good and better."], ["Reviewed July 4, 2017", 5.0, "The grandchildren enjoyed the surfing at Pacific Beach.", "The grandchildren, ages 7, 9, and 12 took Surfboard lessons for three hours a day at Pacific Beach. The school is located at the corner of Law street and Mission Bay Drive. . Excellent teachers."], ["Reviewed July 4, 2017", 3.0, "Typical public beach", "It's a nice, clean public beach, but I wouldn't exactly call this a must see attraction. There are many restaurants, bars, and shops in the area - nothing unlike you could see anywhere else. I've heard it's a good place to see the sunset, unfortunately for me it was a cloudy day.\nShow less"], ["Reviewed June 28, 2017", 5.0, "My favorite!", "This is my absolute favorite beach in San Diego, next to Coronado. It's a great mix of locals and tourists during the high season. Pacific Beach is absolutely beautiful."], ["Reviewed June 28, 2017", 5.0, "Broken eyes!", "why did you come to San Diego? If it was for the sun, beaches and hot young crowd you've found your spot. Wear sun glasses to block those wondering eyes...you too girls! All people are here, people from all walks of life but those especially skin tone babes will blow your mind. Just pitch your umbrella, enjoy the view and don't break your eyes...you too girls! Enjoy!\nShow less"], ["Reviewed June 27, 2017", 4.0, "Great California Beach", "Very scenic, white beaches, ocean is pretty cold and rough! Be careful going out too far, rip tides can be dangerous! In June, weather was hot but its comfortable in the shade. A Beach Umbrella is a must, if you are going to camp out all day. No alcohol allowed on the beach. Everyone biked to the beach, parking is few & far between, we got lucky and found a pay to park lot. $5/1hr or $10/4hr at Jose & Mission. 30 second walk to beach from there. If you are in the area, at least take a walk along the coast or stay & play!\nShow less"], ["Reviewed June 24, 2017", 5.0, "Amazing views!", "This was such a beautiful beach with plenty to see, from the surfers and beach walking, boogie boarding and shopping and restaurants! What a great place, so glad we spent some time there!"], ["Reviewed June 23, 2017", 5.0, "Sun and surf!", "This is by far the best place in San Diego to catch the sun and surf. Big clean beaches with lots of choices for food and other things near the boardwalk within walking distance."], ["Reviewed June 22, 2017", 4.0, "great week end on the beach with every other human being", "My favorite beach, but this time very crowded. Hot beach and very hot sand, but great view. Love that beach"], ["Reviewed June 21, 2017", 5.0, "Every time", "I go here every time and it never disappoints the waves are always huge and the beach is so close to restaurants you practically don!'t leave"], ["Reviewed June 16, 2017", 4.0, "Beach Time!", "Great Beach - can enjoy watching surfers or walking out on Crystal Pier. Interesting with the cottages on the pier. Have not seen that before."], ["Reviewed June 14, 2017", 5.0, "Nice beach, beautiful sunset", "This is a nice beach with lifeguards posted. There are separate areas for swimmers and surfers. Bike rental is available, along with restrooms. Look for jumping dolphins from Crystal Pier."], ["Reviewed June 10, 2017", 5.0, "A must-see!", "One of San Diego's finest areas, for beaches, dining, fun, and almost anything one can look for in a beach city."], ["Reviewed June 9, 2017", 5.0, "Beautiful", "First time to visit California. We had to visit Pacific Beach. It is a beautiful place. I've never been to a beach that your looking at the ocean and mountains at the same time. It was so cool to see people surfing, skateboarding, riding bicycles and playing volleyball! Very relaxing place. We loved it!\nShow less"], ["Reviewed June 9, 2017", 3.0, "Spring break all year", "Nice beach, but it's crowded with people, bars and alcohol. If you're into the college spring break scene you will love it."], ["Reviewed June 7, 2017", 5.0, "If you just want to hang in shorts and flip flops this is the beach for you.", "My family have come to this beach for three generations and Mission Beach before that. It is still my favorite. Great waves for surfing, boogie board, body surf or just jumping up and down while laughing at the cold (which is what I do a lot). I find the water exhilarating. I hope I never get too old to go. There is food right on the cliff top - and Kono's is a tradition for us now. Good enough hotels. Bathrooms, life guards. Go to the zoo in the am and the beach in the afternoon. A perfect day ends with hot food and cold beer nearby.\nShow less"], ["Reviewed June 3, 2017", 4.0, "love it", "i was there for 2 hours to accompany my friend Sun bathing, even though i already born with dark skinhahaha .. the point is i love it"], ["Reviewed June 1, 2017", 5.0, "Stunning", "Stunning beach, amazing views. Only issue is the \"side walk\" is rather small and often packed with runners, walkers, skaters and cyclists. It could do with being a little bigger."], ["Reviewed May 30, 2017", 5.0, "Love this Beach", "This beach has to be one of the best in the world, Chrystal Pier is fun to walk out on. The walk from Pacific Beach to Mission Beach is very enjoyable, great little shops, lots of people and DOGs just having fun"], ["Reviewed May 30, 2017", 5.0, "Walk, sit, surf, run...all good activities", "Long, clean beach. The beach sand is compact enough to support running. Take the long walk on the beach or the strand. Water views are cool, but so are the views of all those beach-front homes."], ["Reviewed May 21, 2017", 5.0, "Beautiful beach, great area, smashing boardwalk.", "Great beach for walking and swimming or sunbathing, although sea can be a little hairy at that time of year. Great boardwalk, piers and surrounded by eateries and hotels nearby."], ["Reviewed May 18, 2017", 5.0, "Great place to people watch", "I enjoyed watching everyone frolicking on the beach - also watching the surfers. Lots of fun shops and restaurants all along the waterfront. Paved for easy walking or biking."], ["Reviewed May 16, 2017", 5.0, "We didn't want to leave!", "It is fun place with a lot of character! Terrific beach for lounging, running, water sports of all kinds with a mix of locals and visitors. There is a paved road for walk/runners between the houses and the beach with bike lane down the middle. My SIL was pointing to a cool beach house and a bike rider high fived her like it was normal! It was hilarious. Very friendly people, lots of places at each end to grab drinks and snacks. The beach houses range from old school cabana cabins to high end modern architecture. They make up a very small organized neighborhood and are worth a look.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Beautiful place", "Great beach area. The entire \"PB\" area is vibrant with young people and lots of food/beverage choices. My son lives in the area so I visit there often. Great place to get a cocktail and \"people watch.\" Try the \"Firehouse\" restaurant and bar. Very cool with a unique menu ... right on the water.\nShow less"], ["Reviewed May 10, 2017", 3.0, "Not as great as I remembered", "I lived in Pacific Beach shortly after college and thought it was the best place ever! To be fair, it probably still is for college kids and beach bums... but if you're out of your 20s and looking for a bit more culture and sophistication, PB probably isn't for you.\nShow less"], ["Reviewed May 7, 2017", 3.0, "Overcrowding and urbanization have had unfortunate effects on the beaches", "I'm far more familiar with Oregon coast beaches than California, so I couldn't help but compare when visiting the San Diego area beaches. It's much warmer here, and that's nice, but the beaches are much dirtier than I'm used to. There is just a lot of garbage on the beaches and half buried in the sand. The dense city building structure continues right up to the beach, and often the smells of garbage and car exhaust are literally strong enough to completely cover the scents of the ocean.\nIt's still the ocean, though, and it's always beautiful to visit the ocean :)\nShow less"], ["Reviewed May 2, 2017", 5.0, "A beach for everything!!", "Spent a great full day at PB~~~ everything from good waves to excellent tide pooling at the north end. The beach is broad, clean and no rocks. Plenty of food choices just over the road."], ["Reviewed May 2, 2017", 5.0, "Lots to do!", "Pacific Beach offers several restaurants and shops. There is also a walk path along the beach that makes it easy to stroll or ride a bike. The beach offers cliffs and level areas that allow for beautiful scenery."], ["Reviewed May 1, 2017", 5.0, "Amazing!", "What can I say, other than this Beach made for an amazing Family vacation. The Beach is extremely clean and well looked after, and there were a lot of places to eat and drink. There is a Ralph's grocery store located a couple of blocks from the beach, which made it convenient.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Great for surfing and sand activities", "Beautiful sandy beach was lively today with the temp close to 80. Plenty of room for beach games and for children to play. Numerous surfers taking advantage of some decent waves.\nPlenty of restaurant options and the usual souvenir shops also.\nThere are hotels on site, though I did not check prices. I stayed in an Air bnb.\nIf you're in San Diego you really need to add a day here if the weather cooperates- which it nearly always does April through September for sure.\nShow less"], ["Reviewed April 26, 2017", 4.0, "Busy, active and fun", "We stayed in a hotel a block off the beach and enjoyed to easy availability of a beautiful beach with a walking/biking path that goes a long way. There is much to discover and this is a good location for going anywhere else in the San Diego area since it is on the north end of the bay. The only difficulty we found was how crowded it can be and how little parking there is, something very common to California's beach communities.\nShow less"], ["Reviewed April 25, 2017", 5.0, "Nice for a walk in the morning", "We like staying at Pacific Beach notwithstanding the traffic in and around this area of San Diego. Talk a walk in the morning to see the surfers but be wary of the many homeless people who sleep at the beach and hang out on the beach pathway. It's a sorry state that San Diego has not dealt with what seems to be a widespread problem and very sad for these folks. Still, PB, as they call it, is worth a visit. Parking is often difficult on the weekends.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Beautiful!", "Went at a really good time early morning, we had no problems parking. It was just beautiful! People were out surfing, jogging, fishing off the pier. First time for my son to see the ocean it was chilly but that didn't stop him from running into the waves.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Beautiful! great for people watching", "Beautiful! Our friend had a quick small private wedding on the pier and it was beautiful and amazing experience"], ["Reviewed April 12, 2017", 5.0, "I Love it", "I Love to swim, to Look across the Waves, the surfers, Ly on my towel and the sun. Have Picknick there The only problem was the lifeguards with their Cars . They Drive to fast"], ["Reviewed April 5, 2017", 4.0, "Beautiful area", "This was a beautiful area with a nice boardwalk. There seems to be a lot of younger people however it could have been spring break time."], ["Reviewed April 2, 2017", 4.0, "wow, a must visit", "amazing boardwalk. Lots of life, action. Great restaurants. Lots of free road parking options about 5 blocks from beach."], ["Reviewed March 24, 2017", 5.0, "Golden Coast", "Gotta love Cali and its beaches: this is one to be sure to visit. Was a little chilly in March, but couldn't help jumping in the water and playing with my kids. Would like to have access to the pier, but looked to be only for those renting the cottages on top of the pier (strange). Was there on St. Patrick's Day, and the college kids were coming out when we were leaving (Spring Break), so would imagine it's a busy busy place on the wknds. Lots of shops along the beach to explore, along with restaurants and bars. Parking is a nightmare, but you can pay for public parking and get it validates (still a pain tho).\nShow less"], ["Reviewed March 24, 2017", 5.0, "Great beach, no rocks!", "Great beach with no rocks! Perfect for the family. This beach even has bathrooms and showers. The down fall is the big hill to climb down and very little parking, so arrive early or late."], ["Reviewed March 22, 2017", 5.0, "Best Boogie-boarding", "I didn't expect to see people in the water in March boogie-boarding, but the perfectly breaking waves over a shallow and safe beach are irresistible. The wide and sandy beach is popular year round. Nearby are many casual cafes and ice-cream shops."], ["Reviewed March 18, 2017", 4.0, "Fish for Golden Sea Bass...", "Nice wide beach, full of Hotties, and at sunset the breakers are full of Sea Bass, whats not to like... BBQ those fresh suckers with some chilled wine and beer. Hope this has been of some help for you... Can get very windy and stormy..."], ["Reviewed March 15, 2017", 4.0, "fun beach", "Pacifc beach seemed full of locals. The area is bursting with beach and surf shops, coffee shops, restaurants and a very casual vibe,"], ["Reviewed March 14, 2017", 5.0, "So cool", "Iconic area of San Diego. All you could expect out of the area for beach activity. one thing I did not find was a public bathroom. I am not sure how they handle that. I am sure they are there. I just did not find it. over all very cool. Lots of swimming, surfing, etc going on.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Great location for people watching", "The pier is a great place to watch the surfers ..lovely sunsets but tends to be very busy at the weekends .,get place for people watching"], ["Reviewed March 13, 2017", 4.0, "Lots of energy", "Youthful crowd. Busy boardwalk and lots of sunbathing, weather permitting. Jammed packed drinking establishments. Most restaurants, bars, grocery stores, etc., are along the side streets or the main street which parallels the boardwalk. Fun place to hang around."], ["Reviewed March 11, 2017", 5.0, "Really nice beach town", "We visited here as a day trip from San Diego and included the Mission nearby. This area is really nice and very much a vacation location."], ["Reviewed March 9, 2017", 5.0, "Very Pretty...", "We stayed at Pacific beach for 4 days and walked the beach and the board walk daily...very nice walkways...clean beach...watched the surfers...beautiful"], ["Reviewed March 8, 2017", 4.0, "Walking...", "Nice place for walking, people watching and spend few hours on the beach. Every time I come to San Diego I spend some time there."], ["Reviewed March 7, 2017", 5.0, "Beach bicycle ride!", "There are several spots where you can hire city bicycles and take a ride along this gorgeous beach and its promenade. Soak up the sunshine, sea, & sand! Plenty of parking, restaurants, cafes and the ideal spot to take a swim in the Pacific!"], ["Reviewed March 6, 2017", 5.0, "Beach fun!", "Great place to check out the beach and shops. Off season and weekdays are best as it gets busy. But we like to rollerblade up the coast."], ["Reviewed March 3, 2017", 2.0, "Too many people", "This was the most crowded beach around San Diego and had the worst parking. I would choose Ocean Beach or Mission Beach any day over this one."], ["Reviewed March 3, 2017", 5.0, "Laid back and friendly with lots to do!", "We visited Pacific Beach and La Jolla and liked PB better. The energy was more laid back and fun where La Jolla is more upscale."], ["Reviewed March 1, 2017", 3.0, "Clean", "We visited a few beaches on our long weekend. Pacific Beach wasn't the busiest. It was a cleaner beach than Mission and Dog Park."], ["Reviewed February 26, 2017", 5.0, "One of our favorite beach stops along the 101", "We liked this beach better then most of the others along the 101, nice pier, with views up and down the coast, surfers to watch and a nice mix of oceanfront stores and restaurants and lots of free parking...."], ["Reviewed February 22, 2017", 4.0, "High energy fun in San Diego", "Pacific Beach is a blast for the adult crowd. Not really a kid's place. Several waterfront bars and resturaunts, most are casual but a few are very nice. PB has grown up a bit over the years, not just a college party scene, but defiantly an adult environment. Dive in...have some fun in Pacific Beach!\nShow less"], ["Reviewed February 21, 2017", 5.0, "Very cool town", "Pacific Beach ( known as PB to the locals) is a cute town with a surfer vibe. Nice restaurants, plenty of bars, cute shops, great boardwalk and nice long piers to walk or fish on. Young adults will live it!"], ["Reviewed February 20, 2017", 5.0, "Fun Beach", "Fun, Great Beach with a killer pier, especially when the wave are high. You go far out there! lots of stores and bars of course!"], ["Reviewed February 17, 2017", 5.0, "Pacific Beach is everything you could dream of in California.It is very chilled and relaxing.", "Pacific Beach is a charming colourful busy beach. It's Californian vibe ensures warm balmy sunny weather all year round. There are small boutique hotels facing the ocean which offer clean comfortable basic accommodation. For breakfast stroll along the beach where little cafes serve Burritos which you can munch while sitting on stools over looking the sea. There is pathway fro walking, running and skating.There is a sense of joy and freedom in the air. People dress in colourful Summer clothes and some have rich and colourful tattoos. Pacific Beach is a place of freedom and tranquilly and fabulous relaxation and fun.\nShow less"], ["Reviewed February 17, 2017", 5.0, "Beautiful", "Best sunset views! Terrific beach and the Boardwalk (actually a sidewalk) is wide and always lively."], ["Reviewed February 14, 2017", 4.0, "Love this area", "Ive had some of the best fish tacos in this area. Always request to go to PB when I'm visiting my relatives."], ["Reviewed February 13, 2017", 5.0, "A piece of heaven....", "Stayed right alongside the beach, and it was well worth the expense... Every morning we walked the beach, got coffee, and watched the many surfers catch waves. Just so peaceful and relaxing. The waves were loudly crashing 24/7, and that was just fine....Can't beat the sunsets, oh those beautiful sunsets......\nShow less"], ["Reviewed February 13, 2017", 5.0, "Great beach for singles, families, seniors...", "Pacific Beach is a great place, period. The sand is soft, the surf is gentle enough for families to enjoy, but also works for boogy boarding and surfing. There are plenty of restaurants and shops in the area when you need a break. Walking/biking/jogging/skating along the boardwalk is an experience into itself. Always plenty of people watching opportunities. This is California at its best.\nShow less"], ["Reviewed February 9, 2017", 5.0, "Loved it!!!", "Wow, I can't get over how helpful and friendly people are!!! Even complete strangers. I'm sure I look like a tourist so maybe that's why they stop and talk. Even saw John Cena at the 7/11!! He was very nice and holy cow was he huge.\nAnyways love walking the path along the Ocean and watching all the people.\nShow less"], ["Reviewed February 3, 2017", 4.0, "Great for exercise with a view", "With miles & miles of 20' wide sidewalk lined oceanfront & shops & restaurants scattered along the inland side, there is little better place to stretch your legs! Take the sidewalk or the beautiful white sand beach. Ride s bike in the bike lane, roller skate or jog your belly fat away! Can be very busy on the weekends, but still doable. Weekdays are great, especially earlier. Stop at Kona's for breakfast with a view (deck dining across the street).\nShow less"], ["Reviewed January 29, 2017", 5.0, "Very Nice Area", "The highlight of this Area is Crystal Pier with its Hotel and Cottages located right on the Pier. Nice Boardwalk, Restaurants and Bar. Check for ''Kono's Restaurant'' and ''710 Beach Club and Grill''"], ["Reviewed January 26, 2017", 5.0, "Fun and Beautiful!!!", "You can walk and walk on the boardwalk in PB and just enjoy. If you want a more calm, private experience, check out mission bay, great for young children."], ["Reviewed January 24, 2017", 5.0, "Just love it!", "I'm from the North (Canada), so basically a beach is always welcomed! This one is really nice, close to town and different from what we usually see on the east coast because of the cliffs."], ["Reviewed January 21, 2017", 4.0, "A busy town with lots to see", "We walked around here for a while then hired bikes to go both to La Jolla and to mission beach. Highly recommend this walk/ ride"], ["Reviewed January 17, 2017", 5.0, "Toes in sand", "A great place to walk in the sun and let the Pacific Ocean lick at your toes. Seabirds all year long. Keep an eye out for dolphins past the surf."], ["Reviewed January 17, 2017", 4.0, "The 90's", "Haven't been here since the early 90's, but it was one of my favorite places to go, plenty to do and see"], ["Reviewed January 14, 2017", 5.0, "Great vibes!!!", "I've heard so much good things about San Diego and really lives to the expectation. I love surfing and Pacific Beach was really cool."], ["Reviewed January 5, 2017", 5.0, "A great beach to walk in a great area to stay!", "This trip Val & I stayed up in Carlsbad to be near our cousins but the last day of our stay drove down to spend a day in our favorite part of south California.\nWe love the atmosphere, the beach, the restaurants and the people of the area.\nNext time!\nShow less"], ["Reviewed January 4, 2017", 5.0, "Beautiful Beach", "The beach is so beautiful on the board walk. You can walk, jog and better yet ride your bike on the board walk. So many shops and restaurants. Would love to vacation in one of the rental homes."], ["Reviewed January 3, 2017", 5.0, "Fantastic", "If you want to go shopping this is the area for the best prices. T-shirts for example get more expensive the further away you go from PB. When I visited the beach is was during non-peek season so I can only provide some inside during their non-peek times. There are a lot of places to eat on this end of the beach compared to Mission Beach. You can walk the pier and enjoy watching the sunset. The washrooms are quite disgusting but this was consistent along the whole beach strip and not just this area specifically. I found the beach to be really cleaned and the people quite respectful however the boardwalk can get quite busy with bikes riding in and around the people walking.\nShow less"], ["Reviewed January 3, 2017", 5.0, "Awesome for walking and beachside restaurants", "A great neighbourhood to walk around in and check out the local scene. Would stay in this area next time we go."], ["Reviewed December 29, 2016", 5.0, "Great place to stroll and explore", "We randomly picked this place to go on a Wednesday evening. We got there just before sunset and went out on the pier (free) then walked up the beach and stopped at some local bars. Everyone was so friendly and the walk was beautiful. Lots of neat houses to look at and bars/restuarants/shops to stop in. Always felt safe. We took an UBER here from Misson Valley and it was very cheap and the drivers all frequent this area so our return pick up was quick, we only had to wait 5 minutes. Lots of shopping you can do from local shops to name brand stores.\nShow less"], ["Reviewed December 29, 2016", 5.0, "The Real Ocean", "Big crashing waves, fantastic boardwalk, excellent pier, and numerous eateries. Lots of high-dollar homes to ogle."], ["Reviewed December 29, 2016", 5.0, "Just fun fun, great for family", "Got a Airbnb on the beach at an apt., our teens loved it all. Nice clean beach, lots of characters to gawk at but nothing scary or dangerous. Waves are perfect, we did a surfing lesson which was the highlite for the kids. Tons of eateries and nice shopping too.\nShow less"], ["Reviewed December 26, 2016", 4.0, "Nice beach", "This beach is nice to watch the surfers. The view from the top of the pier and water is beautiful. Definitely check it out."], ["Reviewed December 25, 2016", 5.0, "Rent A Biek and Join the Fun!", "Take time to rent a bike ($15) and ride the bike paths around the bay. Altough we were there in December there was still a lot of activity going on (beach volleyball, surfing, and frisbee). If you are in to people watching, this is a great place to view a variety of people from beach dwellers to hard core cyclists.\nShow less"], ["Reviewed December 23, 2016", 4.0, "Great beach community for variety of fun", "Pacific Beach is located just north of Mission Beach along the same pacific shoreline but Pacific Beach is much more vibrant than Mission Beach. There are many restaurants and shops on the beach front and the side streets. It is a great beach for surfers and big wave swimmers. A small park along the beach gives visitors to sit and watch surfers in action while enjoying the sun and the breeze.\nShow less"], ["Reviewed December 12, 2016", 5.0, "LOVE PACIFIC BEACH!", "Pacific beach is great fun. I came here for the day, we hired bikes and cycled along the front up to mission beach and back and then got boogie boards!\n\nThe waves are amazing, I would definitely recommend getting yourself a board.\n\nThe beach is great and there are plenty of places to eat and shop.\nShow less"], ["Reviewed December 11, 2016", 4.0, "Great neighborhood", "Funky surfer vibe in this beautiful coastal community. Laid back and friendly locals. Great boardwalk for getting around and great ocean views. Surfing is good. Crystal pier is nice also. Good restaurants and brew pubs throughout the neighborhood."], ["Reviewed December 7, 2016", 3.0, "Nice place to visit", "Nice place to visit but traffic is crazy and parking is near impossible. There are a few nice spots though."], ["Reviewed December 7, 2016", 5.0, "Nice area", "The walk along the promenade is nice and not too busy. The beach was lovely and there are nice eating & drinking places nearby. Was great watching the surfers."], ["Reviewed November 29, 2016", 5.0, "Always visiting!", "Love to walk along the promenade ... or if we are feeling like it ... walking on the sand along the surf. Wonderful waves and breakers. The walk along the Crystal Pier is an experience everyone should try ... especially when the waves are high."], ["Reviewed November 29, 2016", 3.0, "Ok", "A good promenade for walking but very few places to eat and drink do not really a winner for me Ocean beach just along the coast is better"], ["Reviewed November 27, 2016", 5.0, "Pacific Beach (PB) is a must while in SD!", "I went to PB twice while in San Diego. Once during the day to enjoy a great breakfast at Kona's and walk around the beach; and once at night to enjoy the nightlife. This is a great area in SD and I highly recommend it!"], ["Reviewed November 27, 2016", 5.0, "Activities all year long.", "Besides just beach visits, there are endless water sports (surfing, windsurfing, paddle boards, etc.) and other beach activities. Even beach fires are allows. Dogs are allowed at certain times of the day. Joggers love the beach or the strand way, which is also crowded with bikes, rollerbladers and all types of motion. People watching is great and just starting at the huge waves could be an all day activity.\nShow less"], ["Reviewed November 26, 2016", 5.0, "Had a great time.", "We stayed right off pacific beach about 15 years ago when I was a teen. I agree there were homeless people on the beach but one of the best stories our family has of that trip is a man we met who was a pool shark and spent his nights sleeping on the beach. Beautiful place to vacation!\nShow less"], ["Reviewed November 15, 2016", 5.0, "Fun Time Back in the old Stomping Grounds!", "It was a busy week and we're staying north in Oceanside. But we just had to go back by our old stomping grounds (as in 45 years ago!). We were able to spend a little time along the Boardwalk, eat lunch at a cafe with views of the beach, and just see the sights that make PB so special for those who've lived there.\nShow less"], ["Reviewed November 15, 2016", 4.0, "Sun n Surf", "My husband and I loved our stay at Pacific Terrace Resort. Wonderful breakfast and true to name the terrace is very pleasant. Great for beach walkers. Rode bikes along the boardwalk, Awesome jogging, Affordable fun pub meals - a great get-away."], ["Reviewed November 15, 2016", 5.0, "Lovely Beach!", "Spent an afternoon on Pacific Beach just soaking up the rays and watching the world go by! There's swimming and surfing, beach volleyball and lots of characters walking up and down the boardwalk! Just be careful of rip-tides if you're going for a swim - they can really catch you out if you're not careful! Definitely worth spending a few hours here if you're looking for some down-time!\nShow less"], ["Reviewed November 14, 2016", 5.0, "We live where most people want to vacation!", "Pacific Beach is a fun and exciting place to spend time in the San Diego area. The area has really grown up over the past few years. Better restaurants, mellower environment, several beach-front places to hang out and an amazing beach!"], ["Reviewed November 14, 2016", 5.0, "very nice", "I like this beach during the week as it is not crowded and can find parking. lovely area too for eating lunch and just seeing the sights."], ["Reviewed November 14, 2016", 5.0, "Clean and friendly", "The boardwalk along Pacific Beach is wide enough for walkers, joggers and bicyclists. The area is clean and feels completely safe. The views are fantastic."], ["Reviewed November 13, 2016", 5.0, "Awesome beach, romantic sunset", "The beach was spacious... there is lots of room for everyone. Crystal Pier was cool - we got to walk out to the end and watch the waves crash underneath. The sunset was absolutely wonderful, very romantic."], ["Reviewed November 10, 2016", 5.0, "Awesome weekend!", "We loved Pacific Beach! Great surf, shops,restaurants and atmosphere! A definite must see while in San Diego!"], ["Reviewed November 9, 2016", 5.0, "Fun by the Crystal Pier", "I have been very blessed to be able to spend a lot of my younger life in Pacific Beach. I lived there for many years as I am an avid beach lover. I usually have a spot right by the Crystal Pier. As a beach lover you get familiar with the Boardwalk and the people all around it. Sufficed to say that laying on that sand and watching the waves, watching the families and children, seeing the Lifeguards is one of the most wonderful things about living in San Diego. I know all the non-touristy places to park and I don't mind walking a block or two to get to the beach. My family and I have even stayed on those cottages on the pier and that is truly a wonderful experience. Life is good when you are on Pacific Beach. Just remember sunblock and stay hydrated!\nShow less"], ["Reviewed November 7, 2016", 5.0, "Beautiful beach with incredible waves.", "There are some spots for swimming where there is less rip tide but I wouldn't bring a toddler here for fear of them getting swept away."], ["Reviewed November 1, 2016", 5.0, "Beach & Party", "This area is for youngster and hipster. Party on weekend is crazy...time to time I see people get thrown out because they were so drunk!! ... but its all good fun."], ["Reviewed November 1, 2016", 5.0, "A must stop for a fun walk", "We were in town for business. Decided to rent a car for the day and went up the cost from downtown SAN Diego. We wanted to walk the boardwalk and shop & eat. Had a great time."], ["Reviewed October 30, 2016", 5.0, "Walk in the beach", "We are from the east coast so had to go to the beach. It was a partly cloudy day so we just went for a short walk. Lots of surfers. The have the beach blocked of in sections for swimming ( water was to cold for swimming) and surfing. Beach seemed to be well kept. Was nice to see the west coast beach as we are definitely beach fans on the east coast of New Hampshire\nShow less"], ["Reviewed October 29, 2016", 5.0, "PB heaven", "Love this place. Great place to see the sunset. Love Crystal Pier. Oscar's is the great place to eat at. Will be back in November."], ["Reviewed October 28, 2016", 4.0, "A Must See", "Ahhh, the ocean...the waves....the sunset!! An awesome, must see location. You will not be disappointed. Beautiful views. It was not overly crowded. People out walking, running and bike riding. Enjoyable and relaxing."]]}}