{"Pacific Coast Highway": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Pacific Coast Highway", "url": "/Attraction_Review-g28926-d147161-Reviews-Pacific_Coast_Highway-California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/12/70/cb/sea-lion-cave-near-florence.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1432"}, "address": {"@type": "PostalAddress", "streetAddress": "147161", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "A Beautiful Drive", "We drove from Monterey to San Francisco on Highway 1. The first 30 minutes or so were pretty boring. The rest of the way is totally amazing! Beautiful views of the oceans and cliffs during the drive. We had to pull off a few times to enjoy the view and take a few pictures. If you are in the area it is well worth the trip.\nShow less"], ["Reviewed 1 week ago", 5.0, "Natures Roller Coaster Ride", "Do roller coasters leave you a little dizzy, breathless and thrilled to the bone? Try driving Highway 1 from San Francisco north. It's gorgeous, awe-inspiring, 100% nature. You drive along the Pacific Ocean, through mountains and the Redwood forests. I challenge you not to limit your view from one of the many turn outs; but to hike part of the many miles of trails.\nRemember this is country, there aren't many fast food places or gas stops; you won't have 100% cell coverage. Dress casual, with good shoes and pack a coat. Many areas close at sundown. Most important - don't forget your camera:) The highway curves with the coast, it's slow so exploring the coast takes days instead of hours.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "World Class Drive... when open!", "I was super excited for this drive on our Honeymoon. Sadly a massive landslide had closed the road just south of Bixby so we had to come by the inland highway to Carmel-by-the-sea and then head south from there missing the section from Santa Barbra to Bixby which was heartbreaking. The 50 miles or so we could explore was worth it all the same with almost uninterrupted views the whole way. It was a little hazy but that couldn't spoil the grandeur of the drive. It is right up there with the Great Ocean Road and Captain Cook Hwy in Australia, the Kaikoura Hwy in New Zealand or even the North Scottish coast for awesome coastal touring. The only good part about missing it is now we have to return and spend more time exploring the area.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Pacific coast highway 1", "If you never took the drive you are missing out. It was so wonderful visiting Ventura, Venice Beach, Pismo Beach , LA , and Malibu. Being from the East Coast it was this site we don’t get to see often even driving up the coast which we have done many times from Maine to Florida and back again the people and places are wonderful!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Wow!", "This is a beautiful highway! So much scenic nature, and great places to stop and enjoy the amazing views! If you have time to stay and explore the area, there is so much to see and do."], ["Reviewed January 4, 2018", 5.0, "Complete guide to enjoy the hot spots along Pacific Coast Highway (PCH)", "So many people have taken this most romantic PCH drive from Los Angeles to San Francisco, people want to know what are the spots they should visit, which city to spend the night. Honestly, you could spend months to explore all the glory of California, but these few places you must visit, if you have not gone to these place, you need to re visit :).\n\nFrom LA, we drove 1.5 hours and arrived in our first city:\n\nSanta Barbara- it's small town feel, romantic, the downtown State Street is filled with little boutiques, restaurants and bars for you to enjoy.\n\nSolvang - Next, we took a slight detour away from PCH 45 min drive to Santa Ynez Valley, to visit this super charming town known as Danish village, you will feel like you are no longer in U.S.\n\nSan Simeon - 1.48 min. drive we arrived at San Simeon, where we spend the night, visited the famous Hearst Castle! Breathtaking tour, you have option to do the day tour or night tour, we did the night tour, it is during the Christmas Holiday, the castle is decorated with lights and christmas trees, performers wearing the period holiday costumes, really festival, truly enjoyable. During the morning, we stroll down to see all the lovely elephant seals along the boardwalk. truly beautiful.\n\nBig Sur - If you don't pay attention, you would drive right through it, but we managed to make couple of stops just to take in the stunning view of the nature and the Pacific Ocean.\n\nCarmel by The Sea and Monterey - Small beach cities on California's Monterey Peninsula. Truly the most romantic spots along the ocean, you can't go wrong pick either one of these two side by side cities to spend the night. Whether strolling into the boutiques and shops along the main downtown streets, or visit the Monterey Bay Aquarium, just relax, sip coffee, enjoy the easy life by the bay, California style.\n\nPebble Beach - Make sure to drive by Pebble Beach, it is an unincorporated community on the Monterey Peninsula in Monterey County, California. It lies at sea level, very sweet view.\n\nFrom there, it is about two hours drive San Francisco. The whole journey along PCH you can spend as little as 3 nights or, as long as you wish, it all depends how much you want to see, trust me, you can spend a lot longer if you have the time.\n\nBe careful making stops if you drive from LA to San Fran, since the ocean is on your left, you will need to watch out the traffic turning left (or walk across the highway) when stop at all the vista points.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Fantastic Road Trip", "We decided to go for a Road Trip between San Francisco and Los Angeles. We had heard that the Road was closed appr. 100km south of Monterey. This was true, but we decided anyhow to do this part, which meant that we had to go all the way back to Monterey and take 101 south until we could go out on no 1 again at Camria. We for sure do not regret this, the winding Road from Carmel and 100-150km south is according to us the best part. Coming further south 1 and 101 are run together and are more of motorway with limited views. Coming close to LA you should secure to go on 1 as much as possible to be closer to the water. Some nice areas at Malibu. I really recommend this Road Trip!\nShow less"], ["Reviewed November 30, 2017", 5.0, "Half Moon Bay to Pismo Beach", "This is a great highway. It is sad that it is dtill partially closed however I did drive two sections being Pismo Beach to Ragged Point, and Limekiln State Park to Half Moon Bay.\nIt is a sensational drive and thoroughly enjoyable. Hopefully they will be able to clear the section around Gorda and open the whole road next year.\n2075\nShow less"], ["Reviewed November 11, 2017", 5.0, "Amazing!!!", "The Pacific Coast highway is truly incredible with spectacular beach front and coastal views from the south to the northern parts of California. Highly recommend a road trip on this highway"], ["Reviewed November 4, 2017", 5.0, "Amazing", "I'll bet I said \"WOW\" a thousand times today. Every turn produced a million dollar view. Saw a whale, seals and water as blue as the Caribbean."], ["Reviewed November 4, 2017", 5.0, "How long does the PCH drive take?", "Hi- we are planning a road trip for May 2018. How long does the drive take from SF to Santa Monica? We are looking to stay in either Big Sur or Cambria? What is the recommended time it takes? Thanks :)"], ["Reviewed November 2, 2017", 5.0, "Surreal !", "Superb, excellent, mesmerising! I really have very few words to describe the beauty of the ocean and the shore. 17 miles drive was simply stunning. Highly recommended!"], ["Reviewed October 31, 2017", 5.0, "Awesome PCH!!", "We drove along the PCH from LA to SJ on our way back home. some part of the Big Sur was however closed due to landslide but still the remaining part was still well worth a drive. You can park the car & take pictures & have food too along the way since there are many restaurants for the food of your choice. Some of the lanes are quite narrow near the ocean & with traffic merging & distraction due to wonderful views around, need to be cautious driving around.Will do it again , if given a chance & hopefully this time with Big Sur!! fingers crossed..!!\nShow less"], ["Reviewed October 26, 2017", 4.0, "Drive down the coast", "We started back from San Fransisco through Monterey to Santa Barbara but as we left Carmel, the highway was washed out due to storms and had to divert to the 101 but what we saw of the coast highway was impressive."], ["Reviewed October 20, 2017", 3.0, "driving PCH", "Not like the OLD DAYS. Lots of traffic in the summer. Many many tourist have taken away the old charm. Also many commuters use the hwy. to avoid congested freeways"], ["Reviewed October 19, 2017", 5.0, "Enjoyed the Ocean Views", "We traveled from San Diego, CA all the way up the coast to Washington. Yes, we knew prior to our trip the stretch at Big Sur is not drivable and there is no time frame if/when it may/may not open. We didn't let this dampen our trip. We took the historic 101 & 1 (at Camp Pendleton you drive on I5 for a time). The roads can be curvy at times with the speed limit not very fast but you want to go slow and enjoy the views. The ocean view never gets old....\nShow less"], ["Reviewed October 18, 2017", 5.0, "Stunning Place", "Very relaxed place with lots of rugged coastline and natural habit. People very friendly and weather just fab. A long drive but worth it as scenery is breathtaking along the pacific ocean. Make sure you walk some if it so as to see the beautiful flowers and cactus.\nShow less"], ["Reviewed October 16, 2017", 1.0, "What a disappointment", "We had planned to drive from San Francisco to LA along the PCH. Obviously I had not done enough research as when we got to Carmel we found out that the Highway was closed 50 miles south and had been for some time due to landslides. What a disappointment as we had to go inland to Pismo Beach\nShow less"], ["Reviewed October 16, 2017", 4.0, "Warning. You cannot drive from Monrerey to San Luis Obispo on R1. Road blocked", "This is a tremendous drive and well worth it, but don't be caught out by thinking you can drive the length of it. It's been blocked at Gorda for months and is apparently likely to remain so, and the only (unsigned) detour is near Lucia over the mountains via the Hunter Liggett Military Reservation. The road is subject to closure by the military but was open when we drove it. It brings you out on the US101 at Bradley. It's about a 40 mile drive, some of it not for the faint hearted. It's narrown, steep and with lots of bends on the coast side. The only alternative is to go back the way you came on R1 which, if you are heading south in a hurry, is a long way round.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Amazing scenery", "The views never get tiring along the Pacific Coast Highway. We really enjoyed our trip alongside the ocean, past various subdivisions and looking at the mountains. It's a nice winding highway, clean and has many places that you can pull off and take pictures."], ["Reviewed October 2, 2017", 5.0, "Great views", "The Pacific Coast Highway goes through a long stretch of coastline and offers some great views of beaches, sea life, and interesting landscapes."], ["Reviewed October 1, 2017", 5.0, "Great time to visit", "This area of Hwy. 1 is only accessible from a long and windy road from Hwy. 101 making the trip on the PCH a once in a lifetime event as there is next to no traffic."], ["Reviewed September 25, 2017", 5.0, "Pictures", "Like to take pictures? This is a must. Had driven CA 101 along coast, but this is more striking. Enough turnouts for great views. Not as crowded either. Worth the hour to the coast from the main highway. Glad we did it."], ["Reviewed September 22, 2017", 5.0, "Once in a lifetime", "We drove from San Diego up to San Francisco over the course of 10 days, and it was just incredible! It was an experience I will never forget and I recommend it to everyone."], ["Reviewed September 16, 2017", 5.0, "Great scenery (SF to Seattle)", "Starting from San Francisco, driving up to Seattle, the PCH is an amazing experience. You get a little bit of everything from twisty mountain/forest roads, to twisty shoreline roads, to twisty canyon roads. Note the twisty adjective on all of those. Pro tip: if you're renting a car to do this, make sure it handles well. There are long stretches where the road is constantly changing directions. Seriously, there are very few straight sections of the PCH.\n\nThis road is actually best experienced in a convertible. You want to be able to take in as much of the scenery as possible and there really is a lot of it to take in.\n\nIt's best to also plan out where you're going to stop for food and gas. There are lots of little towns along the way, but not all of them have accommodations. Cell service is very spotty if you have (at least if you have T-Mobile) so search for places to stop ahead of time and then save them in your phone's map app.\n\nOverall, this was a bucket list item for me that I'm glad to have checked off.\nShow less"], ["Reviewed September 11, 2017", 5.0, "From San Fran to Santa Cruz", "After spending a week in San Francisco we were off to San Jose via a scenic road ride. Multiple scenic turnouts to view the breathtaking sites. It was a little cool, so we did not spend any time on any beaches, but the views were spectacular and worth taking the time to drive this highway. We also opted to take Route 9 once we got to Santa Cruz to go to Big Basin Redwoods State Park. ( see my review ) That was an unbelievable, hair raising ride!!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Breathtaking scenic drive", "It is indeed one of the best road trips in the world. It is an experience worth to witness. \"Nature at its best \" is something I would say about this trip.\nYou feel surrounded by mountains on one side and the Pacific ocean on the other.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Can't wait until it is completely open.", "We drove from Santa Barbara north. The road is closed at Ragged Point due to a mudslide. The drive is worth it anyway. We drove to San Simeon and saw the elephant seals and then turned around and took the 101 to get further north. Morro Bay is a nice place to stop along the way.\nShow less"], ["Reviewed September 8, 2017", 4.0, "MUST-DO!", "We decided to drive down highway 1 from LA to Monterey. What we can tell you about the experience is that the scenery is absolutely beautiful. What you really need to know is that it's a looooong drive though. Traffic in LA is the worst so before you get to Malibu you've been on your way for a while. If you like to drive and you have time, do the full route, but do it in 2 days as this will make your trip more enjoyable. Driving the full route in a day, makes it a really full day! About the PCH (Pacific Coast Highway) itself, there are loooong lengths of the highwayl that are - in our opinion - too long. So if you do want to drive to Monterey in a day, we recommend doing the 'highlights'. First of all, Monterey is a city, a mini LA actually. It is not a small town. So if you want to visit this, make sure you calculate your time right. About the scenery : Malibu is worth the visit - the beachhouses, the coast, the vibe - it's nice! Everything in between Malibu and Ragged Point is not really a must-see so you might want to drive to the main freeway in between these spots as this will cut you time. You can't drive directly from the main freeway to Ragged Point, you need to exit in Cambria (eat here since you will not come across much after this point!) and once you arrive there, you can get back on the 1 (PCH-route). If you follow that - you can drive to Monterey if you want, we finished the trip in Pebble Beach but if you finish at Carmel-by-the-Sea you've done the best part! What we can tell about the parks that you will come across is that they are forests. Anyway, do this trip!! Wether it's the full drive or only the highlights, everybody should have seen/done this! It's amazing!\nShow less"], ["Reviewed September 7, 2017", 5.0, "amazing views.", "A must do if visiting California, We travelled from San Diego up to San Francisco, with a great stop over at Avila beach lodge and Redondo beach.\nIgnore what sat nav and google maps says for timescale as it will take much longer as so much to see on the way.\nShow less"], ["Reviewed August 30, 2017", 5.0, "My favourite drive in the whole world", "We've driven from Seattle to San Diego & this road is the most beautiful drive you can ever take. The scenery is out of this world & so different along each section. Beautiful beaches & rocky coastlines. Wow."], ["Reviewed August 27, 2017", 5.0, "Spectacular drive", "This highway is a spectacular drive close to the Pacific Coast, where you can stop and go, swim in the several beaches, stare the cliffs, or simply unwind. Check official website to avoid road closures."], ["Reviewed August 23, 2017", 5.0, "Malibu to Santa Monica - Wow!", "We enjoyed a leisurely drive from Malibu down to Santa Monica and back on the PCH and found it to be one of the most gorgeous places we've seen. The only place we've been as pretty was in Italy. The scenery is simply stunning, with mountains coming right down to the sea, to some of the most beautiful beaches anywhere! The drive also takes you through areas with a \"small town\" feel and other areas where the mansions on both sides of the highway are impressive indeed. If in the area, set aside some time for a drive on the PCH!\nShow less"], ["Reviewed August 17, 2017", 4.0, "Part closed currently", "We hired the obligatory convertible only to find out it's closed a large chunk of the way. It's closed at Big Sur going south due to a landslide but we cut across going south at Pismo Beach (worth a stop for a night) and then went round through Malibu to Santa Monica which was still very worthwhile.\n\nObviously didn't get the full experience nor the big views of the Sur but still really good experience on the shorter version that we travelled. Stunning beaches, properties and vistas and travel from Pismo south was awesome.\nShow less"], ["Reviewed August 11, 2017", 5.0, "What an adventure!", "We actually drove from Santa Monica to Seattle along the coast and of course used the 1 in California. It was such a wonderful and memorable trip. If you have a partner, have them make the video camera ready as you’ll certainly want to have video memories of you coming out of forest turns and into over cliffs with the expanse of the ocean as your backdrop.\n\nTips\n1. Dive slowly and enjoy it. So many people were flying down the 1. If you’re in a hurry, use the 5.\n2. Don’t drive at night because it is very dangerous with it being so dark, windy with dangerous curves where you have to slow down to 10mph.\n3. If you are a slower than normal driver, turn off when there are 3 cars behind you.\n4. Have a reliable wifi provider as you’ll need internet access to get road updates, restaurants, and lodging. Our wifi wasn’t reliable.\n5. Expect foggy conditions in the early morning and use your high beams.\n6. Take water and snacks.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Road Trip", "What an adventure! We started off in LA. Had previously visited LA the year before so this time we stayed 2 nights in Long Beach. A trip on the Queen Mary and then late afternoon we drove to The Griffiths Observatory. We stopped off at many places on our way to San Francisco. Highlights were Santa Barbara, Morro Bay, Pismo Beach, Hearst Castle, Bixby Bridge, Whale watching in Monterey, Santa Cruz to name but a few! Stunning views once we left Pismo. Would do this trip again but travel from North to South next time\nShow less"], ["Reviewed August 7, 2017", 5.0, "Only question that needs to be answered, do I go North - South or South - North?", "Probably enough positive reviews about this historic road running on the West Coast at the coastal edges of California. For my review, I just wanted to give you some background as to go North - South or South - North?\n\nWe went from South - North, as that was how we planned our trip. So what are the advantages? : 1) For the driver it gives you a better view of everything 2) Traffic appears to be slower South - North\nDisadvantages: 1) If you want to stop to make a picture, you have to cross the road and get back again....It's actually the only disadvantage I can think of and it can be overcome in all honesty. Based on that I would prefer South - North over North - South, in any case, it's a beautiful stretch of road with many interesting stops along the way. Be aware, it gets very busy in July and August. Also be aware, earlier this year a couple of landslides happened, there are still some parts closed.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Rent a Convertible!!", "We rented a convertible and drove this from San Francisco up to the Redwood Forest, absolutely worth it."], ["Reviewed July 25, 2017", 4.0, "Can be slow going. But a nice drive if even for a little while.", "We jumped off Highway 5 on our way from San Diego to Long Beach. It can be a little slow going but when you get to the views it's worth it. We drove it for a little while and then hopped back on to Highway 5 for the rest of the way.\nShow less"], ["Reviewed July 15, 2017", 5.0, "A wonderful journey", "Helen drove which meant that I was able to stare out of the widow transfixed by the gorgeous scenery as the miles rolled by. Fittingly one of the most famous road trips ever."], ["Reviewed July 15, 2017", 5.0, "Classic Road Trip", "California StateHighway One, CA1, The Pacific Coast Highway runs 655 miles from Dana Point in Orange County to Legget in Mendocino. Along the way it will take you to the beaches of Southern California, past the rocky grandeur of Big Sur past beach towns and fishing villages past Point Reyes and the light houses of the north coast till finally it ends in the midst of California's Redwood Parks. It is the drive of a lifetime!\nShow less"], ["Reviewed July 7, 2017", 5.0, "Pacific Highway Road Trip", "Our 14 night California holiday revolved around this road trip from the south to the north.\nTaking in the towns and sited of the fantastic coastal route and towns along the way.\nStarting in LA and finishing in San Francisco, via Santa Barbra and Carmel.\nThe landslide of the Big Sur into the sea just before we got there caused us to made a detour around.\nBut still saw most of it.\nShow less"], ["Reviewed June 30, 2017", 5.0, "Totally awe inspiring.", "We traveled the PCH south from Monterey to California Sea Otter State Game Refuge, The views are so absolutely beautiful!! While we were there we watches the clouds over the Pacific Ocean move onshore and engulf us in their fog. Well worth the drive!!"], ["Reviewed June 28, 2017", 5.0, "Pictures can't capture the beauty", "We drove the PCH from Carmel to the Big Sur camping areas. The scenery was breathtaking. There are numerous areas to pull over for the views and pictures...but a camera can't capture the magnitude, especially on a clear sunny day; you have to see it for yourself.\nThere are also several types of landscapes and vegetation, including animals, along the way.\nUnfortunately, due to the landslide, the area just south of the Big Sur camping areas is closed. It's worth the trip down, about 22 miles from Carmel, and the drive back.\nShow less"], ["Reviewed June 25, 2017", 4.0, "A American Highway Hero", "Many of us have this as this as a \"Must Do\" on our Bucket List. It was among the first items that we did after we retired. Driving the Pacific Coast Highway (P.C.H.) is the type of thing that requires a good bit of planning and selecting. Here are some of the bits of advice that I would offer:\n\n1. I recommend that you drive south to north. In that manner, you will be on the inside lane of the wild curves that are included on the PCH. When you come north to south, you are on the outside lane looking straight down the cliff to the water. Just a thought !!!\n2. Plan around the toughest place to get tickets for. The Hearst Castle is an excellent example of what I mean. Tickets for the tour are sold out early. Plus, your ticket has a day AND a time slot. Also, you may want to do more than one tour. You need to plan a place to sleep before and after.\n3. Gas Stations on the PCH are infrequent. Play it safe. Don.t let your tank get too low. As they say, don't pass an operating gas station.\n4. Get your list of places you want to see and map it out with hotels.Then, start working with a map on the miles between each site.\n5. Try going with one hotel chain (like Best Western) that has many hotels on the way. You can get a lot of points and maybe some pull to get a location that you want.\n6. Have an exploring nature ! For instance, we got off at the Pismo Beach exit because we remembered Pismo Beach from the Beach Boy's songs. We would a great place for lunch with a wonderful view of the coast ! See attached photo.\n7. There are plenty of pull over for scenic view places. Use them !\n8. Unfortunately, you need to check of road closures and detours. There have been too many lately !\n\nThis was our list. We flew to San Diego to visit long term friends and then we headed north. This is our list: Mission at San Juan Capistrano; Descano Gardens; Getty Museum; Getty Villa, Cambbria, Pismo Beach, Hearst Castle (San Simeon); Sea Lions State Park; Ragged Point; Monteray Bay, Santa Cruz and SF Bontanical Gardens. We flew home from San Jose. We felt that there was some special in each of these places. Hearst castle is absolutely amazing and something that everyone should see !!!\nEnjoy your trip !!!\nShow less"], ["Reviewed June 19, 2017", 5.0, "Words don't do it justice!", "This road is amazing to travel. The beauty is spellbinding! The changing colors of the ocean, the cliffs, the Bixby Bridge, the gorgeous colors on the cliffs due to flowers, cactus, grasses, etc. all combine to make it a memorable drive. We drove from Carmel to Pfeiffer Beach. The road was closed at that point due to mud slides. The drive back north was as beautiful as it was on the ride down. A must see if in the area!\nShow less"], ["Reviewed June 15, 2017", 5.0, "Amazing road with beautiful stops all along, even with closed patches", "I and my wife drove from Los Angeles till San Fransisco. A large part of the highway was closed due to the land slide (from Ragged Point till Big Sur), but we were still happy that we took the highway for whatever was open. This was my first time experience driving along a coastal highway and it was just amazing.\n\nThis is the itinerary we followed with the night stops with an open top rental car -\nLA (started early morning) > Santa Barbara (overnight stop) > Cambria (overnight stop) > Monterey, Big Sur(Drive through) > SFO.\n\nFrom Cambria to Monterey, we took Highway 101 and took a detour to visit Bixby Bridge and Big Sur before proceeding to San Fransisco.\n\nIf you are not in a hurry to reach San Fransisco from LA, I suggest you take Highway 1 as much as possible. Don't miss the Santa Monica pier, Santa Barbara town, Elephant seal vista point at Cambria and Bixby Bridge at Big Sur.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Don't miss it!", "Pacific Coast Highway is an experience which everyone should have on their bucket list. The scenery varies a lot and is really something special. It’s very difficult to decide the best part of the road among the charming bridges, the numerous view points, the tunnels, the charming city Santa Cruz, the woods of Big Sur etc.\nEven though it takes a long time I would recommend to drive all the way from San Francisco to Los Angeles and make sure to make one overnight stop to avoid spending the whole day in the car.\nMake sure to stay on the road, it's sometimes tempting to leave the road for the Freeway since the pace is slow on the road but hang in ther, otherwise you'll miss something.\nShow less"], ["Reviewed May 28, 2017", 4.0, "Beautiful", "Be aware of road closures from Big Sur to Ragged Point. There's a 100 mile detour due to landslides and we were informed by locals that this will be in place for years due to a 200 yard bridge completely gone! You will have to take the following route to get back onto the 1. From Monterey go east on 68, south on 101, west on 46. You can pick the 1 back up just south of Cambria, from which you can only travel north to San Simeon. We picked it up from Monterey to Big Sur, then Cambria to Santa Monica. Fabulous scenic views along the Monterey to Big Sur part, where seals and sea otters can been seen basking in the sun. Stopped in Monterey, Carmel, Big Sur, Cambria, Cayucos, Santa Barbara, Carpinteria, Ventura and Santa Monica.\nShow less"], ["Reviewed May 23, 2017", 4.0, "Honeymoon drive Pacific coastal road", "We got a white convertible mustang to do the drive as it was our honeymoon and wanted a treat.\nIt was a fantastic car and very easy to drive and worth the expense.\nWe had to pay a little more to drop off at Los Angeles as it's not the pick up location, we used Budget and they were very good\n(I don't usually have good experiences with car hire companies). We picked it up on a Monday which means you tend to get the car you've requested as most cars are returned on Sundays.\nI've had plenty of times when I've been provided a very different car to what I'd ordered.\nWe set of from San Francisco and got to Monterey in 2 hours by not using the coastal road because we wanted to make our booking for whale watching in Monterey at 2pm.\nWhen we got there the whale watching was cancelled although the weather didn't look that bad.\nThe staff at the whale watching say as a heads up the weather and sea is calmer in the morning and gets worse through the day so you are more likely to have afternoon bookings cancelled.\n\nThe whale watching was amazing, we saw 20 humpback whales, sea lions, sea otters, seals & dolphins.\nIn a 4 hour tour it takes an hour to get out to the under water canyon where the whales swim and feed and an hour back.\nThe guys on the tour with us were marine biologists so were really passionate on the tour which I liked.\nWear layers as it went from being freezing to being hot.\nThere were a lot of others that suffered from sea sickness so take tablets prior if this is the case for you.\nFYI\nThere is a company which does whale watching at moss landing on a rib but it is 150 dollars each and a standard boat we used was 45 dollars.\nThere is a company that does whale watching at Morrow bay a bit further south and at Santa Barbara although I get the impression sightings are more likely at Monterey.\nBecause we had to wait until the next day to whale watch we had to find accommodation.\nTo find anything good value that is not a motel is challenging.\nWe chose the Ramada which was very basic, there was a big gap under the front door and it smelt of damp.\nWe didn't sleep very well, even though we drunk plenty of wine to help, but we were undeterred as we had to be up early.\n\nWhen we continued on the highway we then discovered the high way is closed around the big sur which I believe to be the most scenic part.\nYou can drive on the highway in to the park (about an hour) but then have to turn back and go the way you came.\nThere is a destroyed bridge which is causing the issue.\nYou then have to take a diversion around the park to king city where you can start heading back to the coast until you get back to Morro bay this takes around 3 hours.\nFrom here we joined the 101 as the coastal\nRoad didn't really run along side the sea.\nIt took us to Los Olivos which we took a 10 minute detour as this is where michael jacksons Neverland ranch is.\nYou can only get to the gates but the country side is beautiful and Los olivos is very pretty.\nWe then headed south for half an hour to gaviota. The road then really did run along the coast to Santa Barbara which was great.\nWe stopped in Santa Barbara and really loved it.\nWe ate at a pizza bar called Paixtis, the food was great and the staff amazing and very helpful. We'd visit Santa Barbara again.\n\nDriving the last section through Malibu and to Santa Monica was beautiful especially with the top down. There is not really a centre to Malibu it is just the road, houses and some cafes on the beach.\nIn essence plan the journey and make sure you leave yourself enough time for each stage. Also research the Big Sur and the national park and which roads are open it really effects the route.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Beware!! Route 1 is closed until December 2017", "The Pacific coast highway is incredible as all of the reviews say. As of now, the road is closed at several points. You cannot drive it along the whole way due to repair work so you must take the decidedly less interesting 101 to drive the entire distance from SF to LA. We drove the section of route 1 from Monterrey down to Big Sur. It is amazing and definitely worthwhile. But then back to Monterey to get on the 101 as no way through route 1 to LA.\nShow less"], ["Reviewed May 14, 2017", 4.0, "Easy Drive but Beware of the Fog!", "We drove southbound along the Pacific Coast Highway on the part of our road trip from San Francisco to Los Angeles.\n\nFortunately, when we travelled in early June 2016, the road was open for its complete length albeit with the occasional single direction traffic control area.\n\nWe found the single lane highway drive to be very easy, with everyone cruising at comfortable speeds, and with numerous opportunities for sightseeing stops.\n\nWe took it easy and stopped for one night each at Carmel, Pismo Beach and Santa Monica, before arriving in Los Angeles.\n\nWe included an extended five hour stop at Hearst Castle and would thoroughly recommend a guided tour of this very enchanting place if you are nearby. When we arrived at Hearst Castle the fog lifted and the views of the surrounding area were absolutely stunning.\n\nUnfortunately, over all of our three days, the road was always enveloped in patchy fog which was quite dense at times and therefore spoiled some of the views.\n\nI would recommend the drive but perhaps it would be worth researching the best time of year to guarantee fog free views!\nShow less"], ["Reviewed May 11, 2017", 5.0, "Lovely drive", "It's a lovely drive. We enjoyed this scenic drive. It was very windy when we went. The highway is closed after Big Sir due to some construction work."], ["Reviewed May 10, 2017", 5.0, "Would love to see even more of it next time.", "Our family of six (ages 6 to 60-ish) traveled as much of PCH as we could of while doing our family trip in California. We started out near Muir Woods and made our way down to L.A. Unfortunately, there was a huge fire near Big Sur, so we had to skip a large section of some of the most scenic parts in this area. We were extremely grateful for the part we did get to see though.\n\nIn just the limited area we had access to, some of the sections were pretty twisty, tight, and hugged right up to the coast, which was breathtaking. However, we had to rent a bigger vehicle for our larger group, so I was more nervous as it felt like we were taking up all the room available and still felt like we didn't have enough space next to the ocean drop off. I think this would be a fun road trip in a small convertible with just a couple of people. It was pretty nerve racking in just the small parts we tried with the larger vehicle.\n\nWe ventured off a lot of different sections of this route in just over a week in California and could see someone definitely making a longer trip with all the things there are to see and do\n\nWe thought this was an amazing, beautiful, and scary road trip, and we only were able to see a little bit of it.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Glad we chose this route!", "We took the 101 from Oregon to Northern California. We are very happy we took this highway instead of the interstate. What a beautiful drive! Many opportunities to pull of the road and check out the beaches or the viewpoints."], ["Reviewed April 28, 2017", 5.0, "BE WARNED", "This road is closed until September only open from San Francisco to just before Big Sur, and from Santa Barbara to Raggy point."], ["Reviewed April 28, 2017", 5.0, "Breath taking", "We drove Hwy 1 from San Francisco to Big Sur. The weather was not ideal (drizzle) but the views were still stunning. We stopped here and there to take in the views until we got to Santa Cruz. We stopped to watch some surfers and checked out the Surfing Museum (tiny but fun and they just ask for a donation) We had lunch near the boardwalk and then headed on. Our next stop was Point Lobos State Natural Reserve. Wow! Such a beautiful place. Several easy hikes get you to some incredible views. This is a must!! We then headed on to Big Sur. The views are incredible! Well worth the extra drive. About 15 minutes past the Bixby bridge we decided we had gone far enough. We turned around and stopped in Carmel-by-the-sea for dinner. (Wish we had more time here! Great little town!) We then drove back to San Francisco in the dark. It was a long day but fantastic!\nShow less"], ["Reviewed April 28, 2017", 4.0, "Some pointers: LAX north bound till ragged point (road closed there)", "1. In general if possible recommend that southbound seems prettier than northbound because the sea is west of you.\n\n2. We found the Santa Monica beach to be the best. Longest stretch of beach, wide, superb sand but could be crowded on weekends. Plenty of places to park as you get away from LA. Lots of restaurants.\n\n3. Malibu pretty but beaches not as great in my opinion. Point Mugu there is a large sand dune just off the road on you right going northbound quick 20 min fun.\n\n4. We then stayed in Goleta near Santa Barbara. Found best western there the best value for our money. (See separate report). Plenty of nice beaches. We found Goleta beach county park nice tho close to UCSB students COULD at times make it noisy.\n\n5. Next day traveling northbound you could go eastward to get a taste of the Los Padres National Forest (LPNF) for a change of scenery. (Photo 1 below)\n\n6. We found Los Padres National Forest website hard to navigate and a lot of the numbers listed are disconnected. For the main number you have to leave a number then they call you back in couple of hours but once they call they are very helpful for the kind of hikes you want.\n\n7. Further northbound on PCH: Gaviota state park is isolated nice and small but due to the exit being closed (April 2016) it takes a bit longer.\n\n8. We took a detour to go up northbound to Los Olivos to go to LPNF to Figueroa Mtn where there are a few nice hikes. Wildflowers in spring.\n\n9. In the Central Coast area we thought Pismo beach area was the best beach. Morro Rock is beautiful but rocky area.\n\n10. We stayed in Cambria. Just small mom and pop hotels but nice. Boardwalk there is beautiful. (Photo 3 below). Beach is isolated but could be rocky. Not much for a swim. When we went it was very windy and just between Pismo and Cambria we found a big temp drop and lots more windy.\n\n11. Of course big attraction in this area is Hearst castle (separate review)\n\n12. 4.5 miles north of Hearst castle (well marked) is a spot where you can see elephant seals.. an awesome sight (photo 2 below)\n\n13. As mentioned road is closed here at Ragged Point at this time (April 2017). To go further north you have to go south take 46 and take 101N\n\nMore in separate review.\nShow less"], ["Reviewed April 25, 2017", 5.0, "California at it's best!", "Perfect getaway route! 'Just can't get enough of beautiful sceneries, it's a breathtaking road trip!"], ["Reviewed April 22, 2017", 4.0, "Road to kick back and go with the flow", "We drove from Monica and Venice up to Malibu to have some lunch, but also to drive on US PCH1. As it was a Saturday there seemed to be everyone doing the same thing although it was in the opposite direction, as the road was pretty jammed all the way. Having said that, the sun was out and if you relax and just take in the road it will be fine, after all you aren't trying to do it at break neck speed surely! We stopped for lunch at Moon Shadow on the coast side of the road, and it was a bit tricky to cross the three lanes of fast ,owing traffic to get to it, so be careful. Coming back was the same, heavy traffic. We have done this before on a week day and it was much lighter traffic and probably more enjoyable if you want to feel the freedom of the road\nShow less"], ["Reviewed April 13, 2017", 5.0, "A California must see!", "It was a good time to see this part of the Pacific Coast Highway as there were few people and it was a beautiful day."], ["Reviewed April 7, 2017", 5.0, "PCH", "This is a must-see! There is so much to stop and explore along the highway or to view from the car. The weather changes are something from another world. I drove up a hill to find myself submerged in a cloud to then drive down into clear skies!\nShow less"], ["Reviewed March 25, 2017", 4.0, "Sensational Drive", "Went from LA to Monterey. San Luis Obispo is where the coast really gets interesting. Recommended stops: Hearst Castle, Nepenthe, Big Sur, Bixby Bridge."], ["Reviewed March 22, 2017", 4.0, "What a drive: The PCH from Santa Monica to Seattle", "Easily 1 of the top 5 road trips we've taken in the US is north along the Pacific Coast Highway from Santa Monica to Seattle. The scenery is terrific from start to finish, but especially so in the Big Sur/Carmel area, Northern California and the entire Oregon coast. We took several days to drive it, stopping whenever we came upon a point of interest, which were many and often. One day in Oregon we drove a total of only 7 miles because of all the other interesting things we found to do. We recommend you take this drive, and if you can, do it when you have the time to stop and smell the roses.\nShow less"], ["Reviewed March 19, 2017", 5.0, "Amazing Views", "Although we went only from LA to north of Malibu, the views of the cliffs and coasts were amazing. Great drive, we had a lot of fun. Take this drive as far as you can if you have the time."], ["Reviewed March 14, 2017", 5.0, "Beautiful Drive", "We recently took a trip to California specifically to drive the PCH, a bucket list item for my husband. Like typical tourists we rented a mustang convertible (necessary to complete the dream apparently) which turned out to be a lot of fun, and definitely worth the extra cost.\nWe drove from San Francisco down the coast to Los Angeles, and then in to Palms Springs and finally ended up in Vegas.\nUnfortunately due to the heavy rains they have been receiving lately part of the PCH (starting just south of Bixby Bridge for about 30 miles) is closed, so we went as far we could and then turned around and detoured inland.\nThe most beautiful area (that we were able to drive) was from Carmel down to Bixby, but I'm sure we missed some of the best parts between Bixby and Ragged Point. I guess we'll just have to come back to drive it again!\nShow less"], ["Reviewed March 10, 2017", 4.0, "Never ceases to amaze me - one of the most beautiful parts of the country", "Yes - it is crowded - yes, traffic can be terrible - yes, there are many surfers, bikers, and tourists who don't pay attention....but nothing can take away from the beauty of this gem of California. Travel this route whenever in LA. I would not miss it and no, it does not get old. Food along the route is highly expensive and you have to sell your first born at any gas station to fill the tank but spend some time gazing at the ocean and all of that is forgotten. Take time away and visit this gem. It will take your breath away.\nShow less"], ["Reviewed March 6, 2017", 3.0, "Traffic", "I don't really get the hype. We took the PCH from around San Diego up to Malibu. Yeah sure there are beautiful stretches, but it's really just a traffic mess most of the time. Way too many red lights and towns. I guess it was OK but I won't be doing it again. Just pick a few destinations and stick to them.\nShow less"], ["Reviewed March 1, 2017", 4.0, "Not a problem travelling with a 28' travel trailer", "I have read that the highway isn't trailer friendly so I was worried. But for not. Not sure if it was due to the time of year but we discovered it to be relaxing and FUN!!"], ["Reviewed February 28, 2017", 5.0, "Pacific Coast Highway USA", "We had always wanted to travel the Pacific Coast Highway so after my husband retired last year, we set out for a 21 day adventure. We started in Seattle and ended up in San Diego. What a trip we had. Beautiful country and friendly people. There was so much to see. We stayed on the Coast so we want to go back and travel inland to see the sights. We highly recommend this trip. We traveled in the off season so we only made hotel reservations in the major cities and winged it along the way.\nShow less"], ["Reviewed February 22, 2017", 5.0, "Simply Beautiful!", "This drive was amazing! All you have to do is get in your car and find a nice spot (it won't be hard). The scenery is breathtaking and there are places along the way to stop for pictures or a great meal."], ["Reviewed February 20, 2017", 5.0, "Amazing vistas and scenic drive!", "We drove from San Francisco to LA on the PCH in May 2016 and crossed Big Sur and the Bixby Bridge. Amazing vistas, scenic drive but very, very few places to eat at one point. We ended up stopping at a road side hotel that had a restaurant. Memories and stories to tell! I held on to the door handle most of the drive because of the height of the cliffs. I think the drive is best done going south, but haven't driven it north. We were able to see seals on the beach and cows along the road. Such an awesome adventure!\nShow less"], ["Reviewed February 18, 2017", 5.0, "A Most Beautiful Drive the Expanse of CA", "This is the most beautiful way to see California from top to bottom. PCH is not fast - it goes through many small towns - but it's always just next to the water and tremendously beautiful. The worst thing about California is the traffic- it's always rush hour here with bumper to bumper traffic. Take your time and meander down (or up) PCH (Highway 1) to really enjoy the beautiful tranquility, nature and huge beach homes hat California has to offer.\nShow less"], ["Reviewed February 18, 2017", 4.0, "Be prepared for a long drive.", "Having left Northern California and Carmel behind we set off on the last long leg of our US adventure heading for Santa Monica. This proved to be a very long drive, especially as we found the need to stop so often to take in the view and take the obligatory photo or two.A spectacular drive initially which gradually became less interesting the closer we were to Los Angeles. Gas stations along this route are few and far between and almost double the price you pay at either end of the route. After 9 hours we arrived in Santa Monica at dusk and from the starting single lane winding road to the 14 lane freeway was certainly something of a difference! Our Hotel was easily found and a very welcome place.\nShow less"], ["Reviewed February 16, 2017", 5.0, "Breathtaking, From San Fransisco to San Diego and everything in between!", "We drove the Pacific Coast Highway from Napa Valley/San Fransisco all the way down to San Diego and it was breathtaking the entire way. Almost the entire highway is right on the coast with beautiful views of cliffs, beaches, etc. The most beautiful parts were definitely north of LA (from Monterrey down to LA are the best sights to see) where there are less big towns and most of the highway is right on the gorgeous cliffs, with amazing bridges and plenty of spots to pull over and take pictures. I recommend driving the highway Southbound for the most opportunities to pull over and have unobstructed views (you'll avoid oncoming traffic obstructing any views). Some areas can be heavy with traffic but there is plenty to see and take in, so it is definitely worth it. Up north I would recommend stops at the Julia Pfeiffer Burns State Park and stay in Pismo Beach (the most gorgeous, quaint little town, we stayed at the Sea Crest Inn which had GORGEOUS ocean view rooms for a decent price). Also stop in Monterrey at Cannery Row and drive the 1 mile drive through Pebble Beach (we saw several gorgeous sights and a ton of seals!). Oh yea...we rented a convertible which in my opinion gave us the best views while driving (the driver has more visibility in a convertible) and allowed us to enjoy the perfect California weather!\nShow less"], ["Reviewed February 9, 2017", 5.0, "Excellent and Comfortable Drive! Classic!", "We drove through the Pacific Highway as one of the first excursions in the US West Coast. We started from Los Angeles heading towards Monterey and then on to San Francisco.\n\nThe drive from LA to Monterey was very nice given the December weather and if we had the option of a convertible, driving with the top down would have been nice!\n\nThe drive is comfortable with most drivers driving comfortably, neither fast nor slow, as they take in the scenery.\n\nThere are short stops along the way to take pictures and also main stops to keep in mind like Solvang, Ragged Point, Bixby Bridge, Big Sur, and the Sea Lion viewing points.\n\nOverall I would highly recommend driving through this historic highway as it gives you one of the best driving views in the USA and is a good road trip starting point to other points in the west coast.\nShow less"], ["Reviewed February 9, 2017", 5.0, "Breathtaking!!", "After months of planning and anticipation we drove PCH just last week and OMG, words can't adequately describe the beauty of this stretch of the Californian coastline!!\nIt is, without doubt, the most beautiful drive we have ever made.\nAnd some of the stops en route?! Wow!!\nSanta Cruz, Carmel, Pismo . . equally as gorgeous!\nIf you like driving, you MUST do this route!!\nShow less"], ["Reviewed February 9, 2017", 5.0, "Hire a car and cruise this beautiful coast line", "We hired a muscle car (boy thing) to drive from LA to San Fransisco Plenty of excellent places to stop off for food, drinks or just views With lots of stops it took about 13hrs....well worth hiring the car and cruised at our own pace"], ["Reviewed February 9, 2017", 5.0, "A wonderful highway", "The scenery is magnificent with lots of wonderful towns to visit on the way between Los Angeles and San Fransisco."], ["Reviewed February 5, 2017", 5.0, "Another great classic US drive", "This is juat another classic drive in California that should be on everyone's \"to do\" list. But be prepared to stop at every little locaiton to check out the history and the food. This is a very enjoyable and scenic drive, along the Pacific Coast.\nHighly recommended\nShow less"], ["Reviewed February 1, 2017", 5.0, "Historical PCH", "Beautiful roads and and plenty of historical locations to choose from you have shopping centers restaurants drive-thrus and plenty of gas stations have been opened up since the nineties.\n\nIf you want to check out PCH and truly get a bang for your buck driving in a hybrid or maybe a Prius would satisfie you more..you'll enjoy it.\nShow less"], ["Reviewed January 26, 2017", 5.0, "Tips for driving this beauty", "Driving CA 1 was my dream for many years and became reality in Dec 2016. The voyage is perfect, it's a lifetime memory,....that probably everyone of you knows so I won't bother you with that, but include some tips I was searching when planning.\nI was driving SF-LA direction, but the same can be implemented driving vice versa.\nStart driving early, around 7 AM.\nLENGTH & OVERNIGHT:\nThere's around 450 miles, depending where you'll drop by and turn from the highway for a visit.\nIt's one lane highway for each direction only, and speed limits are pretty low, so you cannot drive fast (and it would be pity to do).\nDO NOT drive it in a day!!! You'll miss all of it.\nMake at least one overnight on route, preferably two (we made one, but we had a big tour through 3 states, so there wasn't more time).\nWatch out for cars turning aside to stop, and also for cars entering the hwy from a side stop. It happens frequently, often without any indicator signs.\nPLACES TO VISIT (SF-LA direction):\n* first 30 miles south of SF has fabulous places by the ocean with perfect views of the coast. You'll stop on several places here (count total 1 hr)\n* Santa Cruz - cute surfer town. There's a nice center with boardwalk and a kind of theme park with rides. Lots of shops and restaurants (2 hrs)\n* Monterey - another cute town (1-2 hrs)\n* Big Sur - best part with amazing scenery...nature at its best with woods, ocean,... The road is very winding here. Stop at Bixby bridge,Mc Way falls and Elephant Seal Rookery (more than 3 hrs)\n* Hearst Castle - away from hwy in the hills. Cannot enter on your own, but with the tour (last tour around 3.15 PM) (more than 2 hrs)\n* Cayucos - cute seaside town. There's a Saloon on the main street. Also look for the Brown Butter Cookie Co for their famous butter cookies. Nice pier there. (2 hrs)\n* Morro Bay - another nice town, many seals by the Morro rock (1-2 hrs)\n* Pismo Beach - nice city center with many restaurants and fantastic pier (1-2 hrs)\n* Santa Barbara - cherry on the cake. Most beautiful town in Spanish architecture, rebuilt after a devastating earthquake. (more than 3 hrs).\nANOTHER TIPS:\nFuel up to full at the starting point. Fuel prices are higher along the route.\nTimes I gave for towns listed are approximate for visiting them only, WITHOUT driving times between them.\nEnjoy this iconic drive.\nShow less"], ["Reviewed January 24, 2017", 4.0, "Nice drive", "Really nice drive along the Pacific coast. At the beginning we stopped almost every minute to take pictures :) It would be great to have there some more refreshment stations (snack bars...) and also names of the sites, or map of the area. But it was great :)\nShow less"], ["Reviewed January 22, 2017", 5.0, "A great andd memoable drive, I've done it all", "Certainly one of the premeir drives in the US, It really has everything: great, even wonderous views, lots a of beautiful side trips, huge variety places to stay that will takes hours to decide. You must not hurry and let the views and opportunities to enjoy soak into the psychic.I never thought ae drive woiuld be so delicous and entertaining.\nShow less"], ["Reviewed January 16, 2017", 4.0, "Nice drive, but many hairpin turns", "Best is to drive part of the PCH, maybe end around San Francisco and then take the freeway on from there. Beautiful views, but mostly for everyone, but the driver unless you stop. Better for couples not so much families. Many 15 mile per hour hairpin turns along the cliff sides from San Simeon up to Monterey and Carmel area. Bring gravol or seabands if you get motion sickness. Also, can be quite slow going and traffic builds due to this. Drive through redwoods along the PCH. Many small coastal towns to visit such as San Simeon to see the Hearst castle (estate of Randolph Hearst former newspaper businessman). Half moon bay up from SS. Not many towns between Half moon bay and San Francisco, mostly driving. Best to stay overnight along the drive and break it up a bit.\nShow less"], ["Reviewed January 6, 2017", 5.0, "Stunning Natural Beauty", "We drove from LA to Big Sur up the Pacific coast highway. I wish we had given ourselves more time for the drive, but we were limited on time and wanted to see as much of California as we could. The Highway was my absolute favorite part, and we went to Disneyland and Yosemite, so that is saying something. There is just something about the coast here that is so peaceful and calming. The sights are amazing, our first stop was the Monarch Grove in Pismo Beach, then a few random pull offs, onto the elephant seals. We saw the Bixby bridge, a really awesome Island with a lighthouse, and waves crashing into the rocks all up and down the coast.\n\nWe stopped in Big Sur over night, but did not visit any of the state parks, no time, and many of them were closed due to the fires over the summer. Watching the sunset over the fog bank was just ridiculously beautiful. It looked like you were driving above the clouds. There was not a single place on the coast that wasn't awe inspiring. I recommend taking your time, and communing with nature and fellow people here. Either the highway attracts wonderful people, or it's beauty does something to everyone driving on it, because everyone we ran into was in a great mood and really enjoying themselves, you could just feel it.\n\nAnyway, as I said take your time, look up ahead of time places you might want to stop, but do not limit yourself. There are hundreds of great places to stop, and lots to see and do. Keep an eye on the ocean, as there is apparently good whale watching as well!\n\nI would like to return and drive more of the highway some day, and also stop at the places we missed, like many of the beaches and waterfalls. But even missing those things, the drive was surreal and wonderful, and looking at my pictures even makes me feel peaceful. It is a powerful, beautiful place!\nShow less"], ["Reviewed December 23, 2016", 5.0, "So many different things to see and do!", "Took 3 days with my daughter to do this trip to Los Angeles after visiting my son in San Francisco. Leaving SF, day 1 consisted of Monterey and Fisherman's Wharf, Bixby Bridge and Nepenthe for lunch. Due to the fires, we where not able to hike to McWay Falls, drove the Limekiln Tunnel and then seeing the Elephant Seals at the Pedres Blancas Rookery. Do not care for how commercialized Fisherman's Wharf was, the the elephant seals definitely made our day! Stayed in San Simeon.\nDay 2 - Due to the fires, the Hearst Castle was closed! I got the tickets on the web before we went, but they refunded the money. So we did the anti-Hearst thing and stopped in Cambria to see Nit Wit Ridge also had lunch there. Drove on to San Luis Obiscpo walked around and saw the Gum Wall and onto Pismo Beach and Pier where we stayed there over night. This was just a very scenic route.\nDay 3 - Santa Barbara Mission for a bit of history, very beautiful! Venice Beach, visited the canals and the beach area to our hotel in LA. Of course in LA, drove around the well-known avenues, Chinese Theatre, had a minute on Americas Got Talent with Tape Face on the street there! The Dog Cafe and the Tar Pits where very interesting! Along the way, met very friendly people and had a wonderful time with my daughter! So much to see, very hard to decide where you would want to stop to explore. I guess I need a second trip!\nShow less"], ["Reviewed December 20, 2016", 5.0, "Driving from LA to Santa Barbara? Take PCH", "Driving from LA area to Santa Barbara? Time it so it is near sunset and take Pacific Coast Highway. Worth a bit of traffic to see this beauty."], ["Reviewed December 14, 2016", 5.0, "Unforgetable take your time", "This is a drive you will never for get or find any where else in the lower 48 states its unique. It runs almost the entire west coast of California up to Oregon and past Referred to as HWY 1,always check on internet or highway department for closures, landslides, erosion washouts, quakes , or fires before getting there, some closures last for months. Make sure your camera is handy and charged opportunity's are endless and often, sensory, and wild life. The road runes right along the beach in places with lots of pull offs and parks. Take as long as you possibly can, stop at all the towns on the way, get out and talk to the locals. Spend as much time as you can on internet before you go, find every thing there is and plan the trip first. There is so much to see and things and places to go it would take weeks to write down. A small RV or van is the best way to go. I know you will love the trip and I wish I was doing it again with you Brian We did it before Jan. 16\nShow less"], ["Reviewed December 7, 2016", 5.0, "A great drive in any weather", "We have driven the Pacific Coast Highway from one end to the other and I love the Fort Bragg to Crescent City the best as it take you through the Redwoods. You need about three days to see the real beauty."], ["Reviewed December 4, 2016", 5.0, "Bucklist Check", "Started in San Francisco and drove south. Nothing but beautiful. It was worth the trip. Stopped 3 nights but could have made it 4 between San Fran and LA. Nothing but peace and wow! We will definitely recommend this trip"], ["Reviewed November 29, 2016", 5.0, "This is a must do-bucklist item", "Started in LA and drove to the Oregon border. We took our time stopping along the way. Next time I would drive southbound for easier access to pull offs. Take your time, lots of quaint towns along the way, great places to see. Must do places are Glass Beach, Seal Beach,Bixby Bridge,17 Mile Drive, Montecino, Venice Beach, Golden Gate Bridge. Big Sur. So many places to stop I can't name them all. Spend the extra money and get a convertable and enjoy the great weather. Plan on 7-10 days to do it right, the scenery is breathtaking!\nShow less"], ["Reviewed November 26, 2016", 5.0, "Exciting rides with spectacular views", "While the going can be slow...it's okay since it gives you time to take in the beautiful blue water of the pacific from cliffs and sea level. Be sure and have the camera ready!"], ["Reviewed November 16, 2016", 5.0, "Must do once", "This is indeed a wonderful ride with lots of great scenery. The stretch from Cambria to Monterey is the best in my opinion. I still think the Great Ocean Road in southern Australia is better, but you should not miss it."], ["Reviewed November 14, 2016", 5.0, "A must-see on a visit to Cali!", "A drive through the Pacific Coast Hwy from San Francisco in the North to LA in the South is worthy of being on any avid traveler's bucket list. Take your time and stop by at San Luis Obispo or Santa Barbara for a night. The views are breathtaking!\nShow less"], ["Reviewed November 14, 2016", 5.0, "Absolute Bliss", "Drove from San Francisco to Big Sur...and back. I wish I had more time to enjoy the nature, which is at its best here... so many places to see.... mountains on one side and Pacific on the other... couldn't get better. Must Drive!!!!"], ["Reviewed November 13, 2016", 5.0, "AMAZING!", "My husband and I had stayed in San Francisco for two days and then planned to drive up to Napa Valley, decided to take a small detour to drive along the coast for a bit and it couldn't have been a better choice, absolutely beautiful day, perfect to have the windows down, the views were incredible! We stopped in Stinson Beach so we could dip our feet in the ocean, also totally worth it! We couldn't believe the beauty this drive had to offer, so worth the extra 5 HOURS we took to actually get to our final destination! Will never forget it!\nShow less"], ["Reviewed November 12, 2016", 5.0, "A must do in Calif", "Was on the stretch of PCH from Seal Beach to Huntington Beach today. Air was not the best but it was sunny and not so windy. Perfect condition for a really relaxing scenic beach drive"], ["Reviewed November 11, 2016", 5.0, "Must-Drive!", "We took 5 days to drive from San Diego to San Francisco & wouldn't have wanted to do it quicker! So much to see along the way - gorgeous state park beaches & fabulous hiking trails, waterfalls & sunsets cliff-hugging turns along the coast - what a trip!\nShow less"], ["Reviewed November 5, 2016", 5.0, "Romantic Adventure", "My fiancé and I arrived in San Francisco and rented a convertible mustang. We cruised the PCH all the way to San Diego - breathtaking! Trip of a lifetime!"], ["Reviewed November 5, 2016", 5.0, "Best drive in the world!!!!!", "We drove in October and the weather was hot and beautiful. We drove from LA to San Francisco. The drive is gorgeous and I recommend (though cliche) a mustang convertible. We had no issues with parking or traffic. The road is very safe and not dangerous. Be patient with other drivers who may be slower then you. However, there are dangers and you should be alert; animals, rock sliding and drivers who are risk takers. General rule is keep up with the pace of the traffic. If you go too slowly pull up to let others over take.\nShow less"], ["Reviewed November 2, 2016", 5.0, "Most favourite drive...", "We drove from Los Angeles to Seattle, encompassing the Pacific Coast Highway between LA and Monterey. It was, and is, truly magnificent. You will have moments that take you so high - pure happiness and a sense of wonder at the sights before you. You could, and people do, spend weeks on this stretch of the highway alone. And we will too, at some point.\n\nThe best advice is simply to stop at as many places that you can within the timeframe that you have. Essentials, to us, were - quite predictably - Bixby Creek Bridge and McWay Cove. Two locations that capture the scenic best of the PCH. Happy, happy times and wonderful memories.\n\nWish you good weather and all the very best for your trip...\nShow less"], ["Reviewed October 21, 2016", 5.0, "Great trip with fabulous views", "We had so much fun driving around Wine Country in San Francisco and downtown in the city. Then hit Highway 1 with beautiful Vistas along the way including the ocean and cliffs and the elephant seals. They were so fun to watch on the beach. We continued to travel down Highway 1 to San Luis Obispo and spent the night at a fabulous Hotel. La Cuesta could not have been better. Then we left there and continued on the Pacific Coast Highway going towards LA with beautiful Farm views and more ocean views en route.\nShow less"], ["Reviewed October 21, 2016", 1.0, "Driving South from Point Reyes Station", "I was not able to find much info on line to tell me how dangerous this stretch of road is.\nIt's barely wide enough for 2 cars, is literally on the side of a cliff, has blind hairpin turns, no guard rails at several places and has many bicyclers sharing the road to boot.\nAlthough I'm sure the vistas are fantastic (my wife and I had our eyes glued to the road) it is not for the faint of heart.\nOh, I forgot to mention that once you are on it you are committed to stay on it.\nGood Luck !!!!\nShow less"], ["Reviewed October 20, 2016", 4.0, "Leave double the time you think it will take", "We drove the stretch of 101 and 1 from San Simeon to San Francisco, taking sections of it over 3 days, and alternating north and south.\n\nPlan your entrances and exits carefully, for if you get tired of the twists and turns you may still be stuck on the road for an hour until there is a road to take east.\n\nAlso plan your fueling carefully, and take a xanax if your driver only likes to stop when the Low Fuel light comes on, as opposed to you, who tops off the tank at the beginning of every day trip.\n\nPack a picnic lunch and a cooler full of hydrating beverages. I didn't see any layby's with picnic tables, but a tailgate lunch is do-able. You will most likely find restroom facilities at the State Parks/Beaches, so mark them on you map in advance.\n\nNote that Rt 1 is not all on the coast, and in the Santa Cruz to Monteray section you will be out on Very Slow Route 101. Rt 1 also leaves the coast after Piedras Blancas, although you can see the ocean from the road.\n\nThere is an elephant seal rookery, with volunteers to answer questions, at Piedras Blancas. There is also a store supporting rookery preservation and conservation a bit south, and I got a nice quality tee shirt there. Worth the stop!\n\nOn our day from Watsonville to San Simeon, we ended up in the middle of a bicycle road race. The twists and turns of the road are hairy enough, but toss in hoards of bicyclists fighting for road space, and you're going to be slamming on your brakes at every turn, and white-knuckling it. Do dome googling to find out if you could end up in the middle of a road race; and if so plan your trip for some other day. Any. Other. Day.\n\nIt was the last time in our lives we'll be able to see the west coast/drive it, as we live on the east coast and the flights are just to painful to endure. We're glad we did this trip, (combined with 5 days in Yosemite NP) in mid-September.\nShow less"], ["Reviewed October 18, 2016", 4.0, "Do this going North only!", "This is a beautiful ride along the coast of Northern California which is less traveled by people from out-of-state than the PCH south of San Francisco.\n\nThe northern drive provides beautiful vistas as well particulary the spectacular Muir Woods Lookout just a few miles north of the Golden Gate bridge.\n\nThis is not an easy drive, particularly the last 30 miles. I would not do it again but I am glad that I got the chance to do it once. The rocky coastline was great to ride along even on the overcast day that we did it. It's a part of California that most people, except locals, do not get to see. We did this on the way up from San Francisco to the Redwood National Park. There are plenty of places to pull over to take pictures.\n\nThe entire drive is about 180 miles and the last 30 on the northern end were the most harrowing because of the S curves in the road that do not appear on the map. There does not appear to be a way to avoid this. So be prepared to drive super slow.\nShow less"], ["Reviewed October 18, 2016", 5.0, "A must see!", "This was on my bucket list and I was so impressed I hope to travel it further next summer. From someone from Middle TN----it was certainly a sight to experience!"], ["Reviewed October 12, 2016", 5.0, "Amazing place must see", "Beautiful drive with the family.\nPlenty of photo opportunities or a great place to set up a canvas and paint.\nThere were cool places to grab a bite to eat.\nBeware of the roads they are curvy and are not recommended for RV's or large trucks towing trailers.\nYou can make it through but it is a very tight road\nDo the drive during the day so you end up a a destination before the during or before the spectacular sunsets.\nDriving the road at night sucks!!!!\n.\nShow less"], ["Reviewed October 12, 2016", 5.0, "Another one crossed off the Bucket List!", "We have flown extensively, cruised extensively and stayed at tropical oceanside resorts extensively. The closest thing that I can say about the PCH is that it is a cross of all 3 wrapped up in an exciting roller-coaster. We drove from Santa Monica to Monterey and then on to Sonoma Valley in one day. It is truly a day to remember. First off, I would like to share some advice with readers that I have not seen too often in reviews or forums (actually not at all). Fill up your gas tank,visit the restroom and get any and all food and drink that you might need before embarking on the journey. There is a good length of road where there are absolutely no service stops of any kind.\n\nThat being said, the views in BOTH directions are simply breath-taking, the winding roads, just amazing. We stopped too many times to count, just so that we could take in the scenery, looking BOTH ways. We were in a convertible. I know that quite a few people advise against it because they are too low, but we had fun, had great views and if we had to do it again, we would get the same convertible.\n\nA drive of a lifetime!!!\nShow less"], ["Reviewed October 10, 2016", 5.0, "one of the highest rated drives in the world for beauty and adventure", "the coastal drives in Africa, Australia and the mountain drives in china compare to this one. Start anywhere in Washington or Oregon. the whole drive whether on the coast or not is captivating and challenging. there are opportunities all along the way to cut into the inland and see different sites such as the big trees, wine country, mountains, etc. don't miss FRENCH LAUNDRY RESTAURANT for a bit to eat. and take your camera!!!\nShow less"], ["Reviewed October 8, 2016", 4.0, "What a great roadtrip", "We actually did the trip south from San Francisco to Santa Monica back in April 2013, but have just stumbled across the TripAdvisor entry so thought I'd pen an article.\n\nIf my memory serves me correctly it took us 2 or 3 days & our only regret was that we couldn't do it in a convertible (but that was never going to be possible for the 4 of us Aussie holiday makers with plenty of luggage).\n\nNaturally there's plenty of fantastic vistas along the way, but if my memory serves me well, highlights excluding the views were, the Bixby Bridge, Big Sur, those many smelly elephant seals, having lunch on the Santa Barbara pier, stopping to stretch the legs in trendy Carmel, taking a guided tour through the mighty impressive Hearst Castle & walking the world famous pier at Santa Monica.\n\nGet your camera ready.\nShow less"], ["Reviewed October 7, 2016", 5.0, "Great Drive, but technically not Pacific Coast Highway.", "Sure, it is a highway along the Pacific Coast, but it is not PCH.\nPCH is only the small section or SR1 in Dana Point to Oxnard.\nNorth of Santa Barbara to San Francisco, it is Cabrillo Highway.\nNorth of San Francisco to the end near Leggett, it is Shoreline Hghway\n\nEnjoy the trip, whatever you decide to call it.\nShow less"], ["Reviewed October 6, 2016", 5.0, "Awesome Views", "Always wanted to do this drive. Finally had the chance after attending a wedding in the area. Started in Cambria & drove north to South San Francisco. I think driving this route in either direction works. Just be careful pulling back on to the road. Also keep your eyes on the road where it's cut into the cliffs. It was on 9/11 & with the fires, the traffic was light. The views are incredible. Unfortunately for us, the fires had the parks closed so we missed McWay Falls and Julia Pfeiffer State Park. Still, there was plenty of beautiful stops. Bixby bridge was one of the highlights. Even without park stops, it still took us most of the day.\nShow less"], ["Reviewed October 5, 2016", 5.0, "My most favorite - Pacific Coast Hy", "Every year I go on a trip up the CA coast - Pacific Coast Highway, route 1. It is the most beautiful ride of all times for me. I've been on it at least 30 times in my life. So much to see. It's romantic if you drive slow and stop and just enjoy the views of the oceans and then the beautiful trees, and different areas. GO. Do it.\nShow less"], ["Reviewed September 30, 2016", 5.0, "Bucket List Item Ticked", "Driving PCH has been on my \"bucket list\" for a long time - especially driving in an Cabriolet Mustang.\n\nThis was achieved last week, when we drove from San Fran to Santa Monica. We took 3 days driving the route. We stopped overnight at Monterey and then Pismo. The most amazing part of the journey was from Monterey to Pismo.\n\nYou must drive south as this allows you to be closest to the sea and also means that the pull-offs are on your side of the road.\n\nThere are plenty of places to pull off, take pictures, walk (or hike), or just admire the stunning scenery.\n\nThe best way to describe the journey is \" a new vista at every turn\".\n\nWe saw plenty of wildlife including Sea Otters, and Elephant Seals. I can see why some people spend a week or two driving PCH as there is so much to see.\n\nBe warned the roads are very twisty and very steep, with many hairpin turns with little or no crash barriers to stop you falling over the edge!\n\nMake sure you have plenty of space in your camera and that you have plenty of power in your camera / phone - you cant help but take hundreds of pictures.\nShow less"], ["Reviewed September 29, 2016", 5.0, "Beautiful drive", "Drove from San Francisco to Newport Beach. Wonderful drive, great hikes, places to stop to sleep and eat. A sea lion even put on a show for me."], ["Reviewed September 21, 2016", 5.0, "PCH is excellent, beautiful, amazing!", "If you can, this drive is a must see! It's beautiful at every turn. So much to see. I recommend this drive. You will take a lot of pictures, it's hard to stay in your car! I only had 5 days to do this and I spent a lot of that driving there and back. Check out spots of interests for the area you're in. I drove from SLC to SF and then North down to LA. The 17 mi drive was awesome too! My favs were Santa Cruz/Manresa State Beach, Monterey, Moss Landing and Morrow Bay. There was no way to see it all. I did miss some places that I wanted to see but I'm glad that I did get to see as much as I did. I would do this again! I'd probably start a little further down South.Just make sure you plan your time so you can see all of Big Sur. I missed the last 1- 1/2 hr. But I did get some great sunset pics. Loved this!\nShow less"], ["Reviewed September 18, 2016", 5.0, "Amazing Views!!!!", "We drove the Coastal Highway from Monterrey to Big Sur. We stopped a bunch of pull offs and hiked around. Besides amazing views, there was also some nice hiking trails and beaches. Those who are afraid of heights just a warning this will be a little frightening, but I strongly suggest you take the ride down the coast!\nShow less"], ["Reviewed September 18, 2016", 5.0, "What a truly awe insipring and epic drive", "We drove from LA to San Fransisco over two days along Route 1. Awesome tunes on the stereo, a clear sky, all we needed was the convertible (not the Chevy Impala that we rented). Saying that, not even the hire car could spoil what was a really memorable drive. Plenty of things to see along the drive with little towns dotted here and there along to fuel the car and the driver! We'd heard that the drive was great, however we didn't really get just how great it was until we got about two hours north of LA. Wow. Simply Wow.\nShow less"], ["Reviewed September 16, 2016", 5.0, "Magnificent Vistas", "Awesome view of the Pacific atop a curvy road that hugs the edge of the mountain looking down at the craggy coastline with cypress and pine trees and rocks and seaweed and sea lions. Just a perfect well-maintained road with lots of places to stop and take in the vista.\nShow less"], ["Reviewed September 15, 2016", 5.0, "Mrs", "We drove the Pacific Coast Highway 1 out of LA to San Francisco. It was a trill to see all the wonderful sight. We found a beach that was covered with sand dollars in Morro Bay. We saw the Elephant Seals, Big Sur. It was all beautiful.\nShow less"], ["Reviewed September 14, 2016", 5.0, "Incredible route!", "I would definitely taking the PCH1. I went from San Fran down to LA on this road and it was absolutely stunning. It does take longer than the road inland but the views are unbeatable, the water is right next to you."], ["Reviewed September 13, 2016", 4.0, "Coastal highway", "I live near the coast and often take highway 1 for a relax drive. It's passing through many fabulous coastal towns such as Laguna Beach, Corona Del Mar, Huntingon Beach, Seal Beach and all the way through Santa Monica, Malibu...The down side is traffic is congested in summer. Best to take it in the fall or winter. Welcome to beautiful Southern California!!!\nShow less"], ["Reviewed September 12, 2016", 1.0, "Upper north drive terrible", "Do not bother with the portion of this highway where it cuts west fro 101 near Legget, Ca and goes to Fort Bragg. It is extremely windy, with lots of hairpin turns. Also steep up and down, and really is not very scenic. Fort Bragg is a pretty little town, but by the time we got there, we didn't care. Don't be fooled by the short mileage distance. It may not be too far mileage wise, but it is very arduous. We returned to 101 via state highway 20, which wasn't as bad, but was still curvy and steep. We've picked up this highway south of San Francisco before and that part is great. Would recommend waiting until getting down there before taking it.\nShow less"], ["Reviewed September 12, 2016", 5.0, "Beautiful drive", "We took the scenic rote from San Diego to Carlsbad. The 40 minute drive was a perfect blend of seaside villages and spectacular views. Do yourself a favor and take the long way!"], ["Reviewed September 12, 2016", 4.0, "A drive worth taking", "The Pacific Coast Highway is the greatest road in the US if you are a fan of fantastic vistas. With every turn there are mouth gaping views of the Ocean and rock cliffs. Stop and walk with the giant Redwoods. Not a whole lot to complain about on this road trip.\nShow less"], ["Reviewed September 10, 2016", 5.0, "Quick but amazing", "My husband and I were in the area visiting my brother in law. We had one afternoon with no plans so we decided to drive up route 1 for just a few hours. I wish now that we had way more time! We drove from Santa Cruz to Half Moon Bay. This is really only about 60 miles or so, but it was worth it! We pulled off numerous times along the way to admire the views. We stopped at wilder ranch, Davenport, mantara, Waddell beach, San Gregorio beach, pigeon point light station, up to half moon bay and the marina. It was so fun to watch the kite surfers at Waddell beach. We took great pictures from the cliffs of the coastline. Pigeon point lighthouse was really pretty. The marina at half moon bay was beautiful...all the fishing and sailboats looked like something from a magazine. We even got to see Pelicans in action. This is a great walking area, and there Are several great restaurants at this spot as well. Even though it was just a few hours and few miles, I loved every minute of this drive. I would recommend doing as much or as little as possible of this extraordinary route 1. I hope someday I get to do much more of it!\nShow less"], ["Reviewed September 10, 2016", 5.0, "Breath-taking. A must-see some time in ones life!", "My daughter and I traveled the PCH from San Francisco to Morro Bay. Unfortunately, we traveled there this past August, during the Soberanes Fire, but it was still incredibly beautiful. Big Sur was smokey, however we were grateful to see a different kind of beauty ~ not so much of ocean and blue sky, but of the hillsides and beautiful flowers and close up sights. Hard to explain with the smoke interference, but it was still a trip of a lifetime and not to be missed. At the end of Big Sur, the sky lightened up and we saw lovely blue views and then the Sea Lions!!! :)\nShow less"], ["Reviewed September 7, 2016", 2.0, "Disappointing", "What a disappointment. Everyone says that this is a fantastic journey with some spectacular views and many unmissable stopping points for views of the coast.\n\nThis is not the case. There are some good spots where the view is really nice but it is nothing ultimately special worthy of a special trip. Some coastal trips around the British coast are just as good.\n\nWe have done many things in the USA that are unique to the USA but this is not one of them.\n\nMy advice is that if you can spend the time in other truly spectacular and interesting places then do so in preference to this\nShow less"], ["Reviewed September 7, 2016", 5.0, "Running the PCH from Oceanside to Solana Beach", "We went on a terrific long run along the Pacific Coast Highway north of San Diego. We parked at the train station in Solana Beach and rode the Coaster train to Oceanside. We ran back along Coastal Rail trail and PCH. It was a great sixteen mile run. Good long training run. Scenery is breathtaking and there are a lot of people biking, walking, and running.\nShow less"], ["Reviewed September 4, 2016", 5.0, "Rent a Convertible!", "We rented a Mustang Convertible and drove north from Laguna Beach to San Francisco with stays in Laguna, LA, Pismo Beach, and Carmel. We stopped along the way to see Malibu, Santa Barbara, the Hearst Castle, San Jose and Palo Alto. but the area is beautiful and a great place for an overnight. Something to keep in mind is that if you drive north you are on the inside of the road. Driving south would be a harrowing experience with winding roads along the cliff. Especially for the person in the passenger seat. As the driver, having a convertible allowed me to experience all the beauty of the scenery and feel more comfortable not having to worry about the cliff. There are many places to pull over to let cars going faster pass you. We took it slow and enjoyed the view. The Mustang had seat coolers and warmers which came in handy when warm and cold outside. Just roll up the windows, put on the A/C or heat and the chair cooler or heater and enjoy! Keep in mind that during the summer fog sometimes rolls in and hovers over the Big Sur part of the route. In addition, that is brush fire season so when you get to Big Sur and Carmel you might drive through smoke.\nShow less"], ["Reviewed September 4, 2016", 5.0, "Absolutely a must do at some point in your life", "Driving the PCH is truly an amazing experience. We went from San Francisco down to LA. We did the typical stops along the way.. Santa Cruz, Monterey, etc and seeing everything, from the Pacific from the cliffs, to rural lands to the beaches of Malibu makes you really appreciate the vastness and diversity of our country. It was easily my husband and my favorite part of our honeymoon\nShow less"], ["Reviewed September 1, 2016", 5.0, "Bucket List", "Drove from San Francisco to San Diego for a road trip and all I can say is this is a must do for everyone and anyone. Incredible views and many pull offs to stop and take in the views!"], ["Reviewed August 29, 2016", 4.0, "Drove from San Francisco to Big Sur", "We started off in San Francisco and headed south to Santa Cruz. During this leg of the journey we stopped at the usual turnouts and Ano Nuevo State Reserve to check out the elephant seals. My favorite turnout during this part of the drive was the \"sharkfin rock\" which jetted out of the ocean. We hiked down to the beach/alcove below and hung out down there for awhile. Its a beautiful spot for pictures. We continued on to Santa Cruz and stayed there for two nights. However if I did this trip again I would only stay there one night. Santa Cruz has a boardwalk which was fun to check out but other than that there was not much to do--plus the town had a large homeless population and there was a man yelling incoherently outside of our hotel the first night until the police were called.\n\nAfter two nights in Santa Cruz, we continued south to Big Sur. Our plan was to hike around Julia Pfeiffer Burns State Park in Big Sur but it was closed due to the wildfire in the area. Big Sur was a nice little town and we stopped there for a late lunch. Along this leg of the journey we stopped at the Bixby Bridge turnout which was pretty.\n\nThe views along the PCH were gorgeous and I would recommend driving it both north and south as you get a different perspective each way. However, I wouldn't recommend driving the PCH in August like we did as it was very overcast. Some locals told us the overcast was due to the high temps inland which pushes the clouds out to the coast. I thought it would be sunny and we would be able to see the ocean for miles but we couldn't. However despite the lack of sun it was still gorgeous.\nShow less"], ["Reviewed August 29, 2016", 5.0, "A must see", "We spent the day driving down the PCH with our 3 children. It was wonderful! The views were amazing and there is tons of pull off to take in the scenery, stretch your legs or let the kids run around. You could spend days traveling the long winding road but even if you only have one free day like us it is worth the extra drive time to see it.\nShow less"], ["Reviewed August 29, 2016", 5.0, "Among the most beautiful sceneries in the world", "Mythical Route 1 is a so must-do in this area. It takes about 1 hour for one way without the stops which are likely to be many. Point Lobos reserve, Bixby bridge, Julia Pfeiffer Burns State Park (but it was closed when we went), Pfeiffer beach with its Mc Way falls are the main points of interest. Our stop in a scenic restaurant (in our case Sierra Mar) was a pure joy.\nShow less"], ["Reviewed August 29, 2016", 5.0, "Driving from San Fran to San Diego Coast", "I have returned and completed our beautiful trip thru parts of CA, and could not have done that without Kibbles16 giving me valuable insight, suggestions and guidance and Pasca for help.\nMy trip would not be for the faint hearted but we safely completed our amazing bucket list.\nSunday: Flew into San Fran, picked up car, began our sightseeing. We went to Painted Ladies, saw Alcatraz, Pier 39, Lombard St, The Presidio and crossed the Golden Gate Bridge, traveled around SF as we headed towards Monterey. Pebble beach and 17 mile drive closed- Went to Monterey Bay Aquarium, headed to Carmel settled in for a quick dinner and strolled the quaint shops.\nMonday: Early breakfast ; Carmel beach stop, went to The Mission, a quick trail at Point Lobos, saw the seals and off to Big Sur. Pics of Bixby Bridge, stopped for a quick Nepenthe, and go. Fires prevented us from seeing McWay Falls, so we made a few stops along Big Sur for beautiful views... Stopped in Santa Barbars sat on beach, stretched legs watched kite surfers and continue to LA stopping at Malibu for a quick drive by (parking is so hard)! Traveled thru Laurel Canyon and made night in LA. Started TUES:morning w Warner Brothers Studio, Hollywood Sign, flowers to Marilyn Monroe resting place, drive thru Beverly Hills Streets and Rodeo Drive, stop at Farmers Market for a bite to eat, walk of Fame and Chinese Theatre and strolled around the madness of LA. WED: stopped to Santa Monica Pier, then Venice beach for a few pics and settled in at Laguna Beach. THURS: Disneyland. FRI: Universal and off the San Diego to see family. SAT: quick tour of Mission SD, stopped at La Jolla beach, lunch (pit stop at zoo- but did not have enough time for the $56 entry fee) so we left for airport for a 10pm flight. MANY THANKS PEBBLES 16... Your guidance kept us safe n happy. On point info- Big Sur should not be driven at night by 1st timers, unless used to those snake winding curves. Never plan time deadlines as CA will always be highway traffic to slow you down. GPS no go - get trip maps, fill up your tank n have patience. Enjoyed our appetizer style vacation - LA my least favorite, loved Carmel, Laguna and La Jolla as I am a beach person. My daughter of course enjoyed Burbank. So glad for TripAdvisor Forum Excellent Community of Advisors!!!!!!!!!\nShow less"], ["Reviewed August 29, 2016", 4.0, "An interupted journey", "I had planned to leave Thousand Oaks (LA) & join up with Hwy 1 / 101 to journey along the coast to Monterey & then to San Francisco Bay. There was a sea fog hugging the coast all day so on the first day I saw patches of beautiful coastal scenery. I overnighted at the San Simeon Lodge after checking out the elephant seals at Point Piedras Blances. It was interesting watching these 5,000 lbs mammoths lie around & chest slam each other. I had a fisherman's basket for dinner at the San Simeon Restaurant. Next morning I attended Hearst Castle Visitors Centre to view their history movie in an IMAX then took a 1 hour tour at the castle. It is a must do. Due to bushfires in the Big Sur area I took the inland road to San Francisco. I have done this journey before & would recommend it to others. Allow 2 - 3 days to complete.\nShow less"], ["Reviewed August 27, 2016", 5.0, "A trip you have to do.", "Take a couple of days to stop over on the way. Checkout, Carmel, the elephant seals, and all the view points on route.\nLook out for seal and whales which we was at least 6 of as we drove along this stunning coastline.\nThrough forested areas all along the coast past cliffs and over amazing bridges.\nShow less"], ["Reviewed August 27, 2016", 5.0, "Do it at least once.", "I finally checked this off my bucket list. I live in Southern California and never had the courage to do it because it all sounded overwhelming, tiring, and confusing. There are so many stops, didn't know how to plan it all out. This is how I did it.\nI drove from L.A. to Carmel.\nNo San Fran, I have been there already.\nIf you want San Fran, add 2 more days.\n(1 for driving in to town, checking in, etc; 2nd day to fully enjoy SF).\n\nPay attention to the road, some parts of the road can get hairy.\n\nLeft L.A. and stopped at:\nSanta Barbara for coffee\nMorro Bay (skip if you don't have time)\nHearst Castle (purchase tickets in advance)\nElephant Seals\nRagged Point\nNepenthe Cafe\nPfeiffer Burn State (closed due to fire)\nCarmel\n\nThere are so many vista point stops along the way and it included Bixby Bridge as you approach Carmel. Make sure you do the vista point stop after crossing the bridge if coming from south to north for pictures. If you drive from north to south, you can miss it by driving on it without knowing. LOL\n\nI did Point Lobos, 17 mile, and exploring Monterey all in Day 2.\n\nDay 3, drove home taking 68 to 101 fwy.\n\nTbe drive is beautiful and I am SO glad I did it. It is tiring, but do it at least once.\n\nPRO south to north-the drive is less scary because you are not driving by the edge of cliff (some parts have no guardrails).\n\nCON south to north-turning in/out of vista point is not as smooth as coming from the other way but no biggie.\nShow less"], ["Reviewed August 22, 2016", 5.0, "Nice way to travel", "Even if it's a little bit slower - it's a better way to travel then being stuck in traffic on the 101. The views are worth it and is definitely more relaxing drive."], ["Reviewed August 20, 2016", 5.0, "Breathtaking views. A truly memorable trip", "We made a video to show you what the trip is like: https://www.youtube.com/watch?v=HfcckBSy-4c And an itinerary to help you too: www.lifeofreilly.tv/route-one"], ["Reviewed August 14, 2016", 5.0, "A beautiful highway along the Southern California coast", "Driving from seal beach to Huntington bch\".newport bch..corona del mar..Laguna bch..stores,shops, restaurants and beautiful scenery of the pacific coast ocean"], ["Reviewed August 13, 2016", 5.0, "Incredible Beauty", "The most stunning landscape that just keeps going on and on, almost too many vista stops to appreciate its incredible beauty, many places to visit along the way to soak up incredible scenery. You travel / drive one road in your life this is the one!\nShow less"], ["Reviewed August 11, 2016", 5.0, "Don't just make a drive of it.", "I don't know why everyone is saying drive from the south to the north. I don't believe it matters either way. My wife and I did it and we did it in a day... Don't do that. It is way to long of a drive from Oakland International Airport to LAX. It took us 15 hours. We stopped at a lot of places but only enough time to take some pictures. Mainly driving and it still took that long.\nEverybody wants to do it in a convertible... Another, don't do that. We rented a convertible camaro. To low to the ground you can't see a lot of the views because of the guard rails. We had the top down maybe a total of 3 to 4 hours the entire trip. To cold (58 degrees) and this was the and of July. Rent an SUV. More spacious better views.\nWatch for the Bixby bridge. I did not see any signs that you were coming up on it. I wasn't sure when we passed over it until we stopped at the elephant seals and then we were to late. It was way back up north. And that was one of the things I wanted to see (so bumbed). The elephant seals were very cool but still really cold. We wanted to stop at Hurst Castle but we just ran out of time. Big Sur is amazing. Beautiful big trees and amazing views. Stop off at any of the stores or stay the night in one of the hotels there in that area. There's not many of them so make the best of it.\nEverybody has been on curvy roads at some point in their life; maybe 5 or 10 miles of them here or there. I grew up around curvy roads so I was used to them but not like 70 and 80 miles of them. Some get pretty hairy... PAY ATTENTION especially for other drivers who like to come over into your lane coming around a corner with no barrier and 100 foot drop off.\nAll in all, this has been one trip we can check off our bucket list. Well, maybe half a check. We will come back and take more time to give it a full check. Give it the time it deserves.\nI hope this review helps. Happy travels.\nShow less"], ["Reviewed August 10, 2016", 5.0, "Must do it North to South", "We drove from San Francisco to Los Angeles and the drive is amazing. Started off in the fog but soon met the sunshine and scenery is breath taking. We stopped at lots of vista points and every time it was a breath taking view of the landscape and ocean. High lights was Big Sur and seeing the Elephant seals on the beach.\nShow less"], ["Reviewed August 9, 2016", 5.0, "Amazing Adventure", "We started out journey in San Diego and ended in Sausalito just outside San Fransisco! I agree with other reviewers and should have driven north to south , easier to pull over to the vista points to take photographs and ending up in the sunshine (San Fran was freezing). However, we still had an amazing time. Our itinerary was:-\nSan Diego... Great city USS Midway and Zoo were well worth a visit, gas lamp quarter a bit disappointing!\nLong Beach.. Lovely place to look around and some good shopping\nAnaheim.. Disney ..\nLA... Hollywood Boulevard tacky but ticked off list of things to see. Beverly Hills, Rodeo Drive etc worth seeing.\nSanta Barbara ... Gorgeous.\nCambria... Quiet unspoilt little town\nBig Sur ... Fab\n17 Mile Drive... Beautiful especially if you're into golf!!!\nCarmel... Pretty town to stop off for lunch\nMonterey... Great place to spot sea otters!\nYosemite... Long drive inland but well worth it. Stayed in Oakhurst which is near the southern entrance to Yosemite. Not the greatest place to stay but convenient. Yosemite is BEAUTIFUL.\nSausalito.... Just outside San Fransisco, over priced and not much to do. Got the ferry to San Fran every day but had to be back on last one around 7.30ish. Would have been better staying in San Fran but still enjoyed the last few days of our holiday.\nAlong the way we drove through/ stopped at La Jolla, Pismo Beach, Morro Bay, Hungtington Beach, Malibu, Cardiff By The Sea and lots more places too numerous to mention. A real adventure !!! One word of warning.. America is no longer a cheap place to visit. We have visited many times and eating out has always been so much cheaper than UK but this time it's much more expensive than home\nShow less"], ["Reviewed August 6, 2016", 5.0, "Beautiful beyond words", "This is one of the best things we have ever done. The drive is beyond beautiful. There are a lot of places you can stop and take pictures of the unbelievable views. There is also a place where you can stop and see elephant seals! There was no traffic when we drove through the highway. Make sure you have plenty of gas in your car because you may not find any gas stations (or rest areas) for a while. I cannot wait to do this again!\nShow less"], ["Reviewed August 4, 2016", 5.0, "Best drive ever", "Started Pacific Coast highway drive at Moro Bay Highway 1 to San Francisco. The drive is absolutely breathtaking. Make sure you have a reliable vehicle and a full tank of fuel because they are few and far between. How this road was built is amazing cutting through mountains. This is a drive you will never forget.\nShow less"], ["Reviewed August 2, 2016", 5.0, "Beautiful route, scenic and hair raising at times", "This is a beautiful route with breath taking scenery at each turn. If you visit in July be aware there is a fog that hangs around every morning until around 12 noon but clears after that until around 5pm. So we resisted the urge to get on the road early and took advantage of the 12 noon check out at the hotels we stayed at- otherwise you won't see anything. The roads are good at not too crowded. There are plenty of turn outs for taking photos along the way even at major ones.\nShow less"], ["Reviewed August 2, 2016", 5.0, "Beyond beautiful", "My roommate and I (early and mid 20s) took a girls trip. We flew into San Francisco and out of San Diego and we took a week to drive down PCH. We spent one night in SFO, two nights in Big Sur, a night in San Luis Obispo, and two nights in San Diego. We stopped every two hours because honestly the scenery changed that frequently. From foggy, sleepy beach towns and brilliantly steep cliffs, to white and purple sand beaches and small town wineries, there was so much to see. This was definitely a \"bucket list\" trip and I recommend that everyone adds it to his/her bucket list.\nShow less"], ["Reviewed July 31, 2016", 5.0, "Amazing Drive...", "The only real mistake we made when undertaking this at times, breathtaking drive, was to navigate it from south to north (LA to SF). As a project manager I should have done my homework and realised that it's so much easier to stop if you're travelling south and the views are that little bit closer too.\n\nWe stopped off for the night in Monterey (not impressed, wish we'd stopped in Carmel) and Cambria which was great.\n\nBe aware that there are incredibly few decent places to stop and get fed and watered without coming off Route 1, at one point we had a long wait when we finally found somewhere.\n\nAn absolute must do in California though, in fact we intend to do it again only southbound next time.!\nShow less"], ["Reviewed July 30, 2016", 4.0, "Very beautiful, but you may not see much if it is foggy", "We did the CA-1 from LA to SFO and then back from SFO to LA. When heading north, we stopped for 2 nights in Santa Barbara, Morro Bay and Monterey. On our way back to LA we slept one night in Pismo Beach. The most beautiful views are between Morro Bay and Monterey. From Santa Barbara, I advise you to get the 154 to Santa Ynez passing by the Lake Chachuma (nice views) and Solvang. Then, you get Highway 101 again, heading north and back to CA-1 when you reach Pismo Beach. When we were driving north, it was not foggy until after Monterey, so we enjoyed the views in CA-1 and in the 17 mile-drive in Carmel. On our way back, it was too foggy all the way from SFO to Morro Bay and we did not have the same experience. We traveled in July 2016. The views are really special due to the nice combination of sea, rocks, sand and sea fog.\nShow less"], ["Reviewed July 28, 2016", 5.0, "brilliant drive", "fantastic drive and amazing views all the way up to monterey , the popular pull in areas for photographs were a little busy so not easy to pull over for some amazing photographs but hey you have to do this drive once in your life to see how incredible it is\nShow less"], ["Reviewed July 27, 2016", 5.0, "Breathtaking", "Everyone should add this drive to their bucket list. The views are wonderful, just breathtaking. Take the time to stop at the beaches and little towns. This is not a one day trip - take the time to spend a couple of days."], ["Reviewed July 27, 2016", 5.0, "Heaven on Earth!", "If you are ever lucky enough to travel any part of the PCH than you have to do it! We traveled from Santa Cruz back up towards San Jose and it was a highlight of our trip. The views are amazing and the photos we got are priceless! Who knew riding in a car could be so much fun. Everyone put their electronic devices down and enjoyed the view. What more could you ask for than nature at its finest!\nShow less"], ["Reviewed July 26, 2016", 5.0, "Great Scenic Drive", "Great drive over the 17 mile drive and then on down the coast to Big Sur and Napthene Restaurant for wine and cheese and excellent views aided by some clear weather. Great afternoon activity."], ["Reviewed July 25, 2016", 5.0, "A Scenic Road trip to Remember", "One of my fondest childhood memories was a road trip my Dad took me on following Pacific Highway 1 in CA. I was able to repeat history with my grandson. The scenic CA coastlines are as diverse as its history. The cool sea breezes were a welcomed treat for a couple of AZ desert rats! We enjoyed hiking in Big Sur although a little more difficult for me to manage at times. We made a point to stop at every public beach so my grandson, age 10, could try his luck acquiring pieces of sea glass and sea shells. The tide pools were just as capitivating. The drive along Highway 1 is still breathtaking and other drivers seemed to have lowered their speeds as well.\n\nPicnics on the beaches were a welcomed alternative to the plethora of eateries along the way. We stayed in off-the-beaten path motels (separate reviews would be appropiate). Overall, this is a family vacation that is budget-minded with something for everyone to enjoy. Many of the state parks are now accessible for the disabled but a word of caution on hikes that are located along the spiked cliffs like Big Sur are not recommended for travelers that need assistance with climbing stairs. While breathtaking, the physical challenges will spoil your trip. I look forward to taking my grandson on a second road trip--to visit all the Franciscan Missions in Calfornia.\n\nGas prices are reasonable now but were still the largest portion of my budget. Lodging was second. Awe! The memories are priceless!\nShow less"], ["Reviewed July 23, 2016", 5.0, "Here's my guide to a great family holiday!", "I have just returned from 16 nights summer holiday travelling the PCH with my 16 and 9 year old children. Here are my recommended delights and the disappointments we discovered on our wonderful (but quite expensive) family holiday.\nThis holiday can be done much cheaper and on a stricter budget than we did it. However my choice was to have comfortable hotels with swimming pools for the children.\n\nI have separately reviewed all hotels/restaurants and things to do on Trip Advisor.\n\nThese were our stops:\nSan Francisco 4 nights\nMonterey 2 nights\nSanta Barbara 3 nights\nLos Angeles 3 nights\nSan Diego 4 nights\n\nDon't miss San Diego. It is beautiful and now one of my favourite cities!\n\nI will tell you about my recommendations for each place but first here are some general tips;\n\nCalifornia is expensive so be prepared that you may overspend your budget. One hidden cost was parking the car. It always cost between $10-20 for a day in tourist spots and beaches and almost our hotels charged for parking about $20 per night over and above the cost of the room.\n\nCalifornia temperatures are cooler than you think in the summer because of the sea har (fog) and cool breeze. This is especially true anywhere north of Los Angeles. San Francisco was freezing! Dressing for the first week of our trip I would recommend a woolly hat and gloves-no kidding! We ended buying them because we left our winter clothes at home in Scotland! Especially needed for Boat trips eg Alcatraz and Whale-watching. Layer up. I did not wear my summer clothes and shorts until the second week-Santa Barbara and beyond. I should have taken more long-sleeved tops with me.\n\nCar Hire: a car is not require in San Francisco. We hired it at the start of the journey south. Alamo tried to tempt us with all sorts of upgrades. We upgraded the car for added comfort and it's built-in sat nav was very reliable. Remember to tell it what State you are in or your destinations won't come up in the list!bit took us a while to realise that ours was set for Texas when we picked it up. We regretted not taking the Wifi package. It would have been useful again and again for finding restaurants/ coffee stops recommended on Trip Adviser whilst travelling in the car. I would do that on a future trip.\n\nSAN FRANCISCO: Delights;\n\nAlcatraz was the highlight and a MUST but book well ahead of the holiday. It's one of the best family days out you will ever do!\nLombard Street was a quirky find-the crookedest street. It was fun!\nWalk or cycle the Golden Gate Bridge. We were lucky to see whales below the bridge. But it was absolutely freezing. Gloves/ woolly hats and jackets recommended.\n\nEat at 'Fog Harbour on Pier 39 for outstanding food, service and a view to die for! Book ahead if you can.\nMUST try The Codmother Fish and Chips! To take away of eat on their picnic tables. Scrumptious but share adult portions or buy kids portions as they are enormous!\n\nDisappointments;\nOur regret is that the hotel was at Union Square. With children you are better to be near the seafront and Wharfs.\nWe had a 3 day open top bus ticket. What a waste of money. Buy a one day pass to see round the city and use your feet or excellent and cheaper public transport for the rest of the time.\n\nSANTA CRUZ-afternoon road stop.\nWe headed south to Monterey intending to stop at the seaside town of Santa Cruz for a quick break in the journey. We were there for hours! The kids were in heaven.\nSanta Cruz has a boardwalk with an old-fashioned amusement park on it. It was brilliant and the sun shone on us at last but there was still a chilly breeze. The many rides were very cheap but parking cost $15\nFinally, we dragged the kids back to the car but it was well worth the stop!\n\nMONTEREY\nOver-rated and a tourist trap. My least favourite place on the holiday.\n\nMONTEREY-Delights:\nWhale-watching trip. The most incredible experience for us all. TOP TIP; take sea-sickness tablets ahead of the trip even if you have a strong tummy. I am SO glad we did! Wear woolly hats/ gloves/ warm jackets.\n\nFisherman's Wharf has great seafood restaurants. The place for clam chowder.\n\n20 min Coastal walk from Fisherman's Wharf to Cannery row is lovely. You can watch seals playing on the rocks.\n\n17 mile drive and Pebble Beach Golf Course-well worth doing. The drive goes from Monterey round the peninsula to Carmel. A charge of $10 though which grated a bit!!\nWe never completed it though because, being golf fans, we got sidetracked by Pebble Beach Golf Club which is about 11miles into the drive. We did not realise it was open to the public so we did get a lovely surprise to discover we could wander down to the 18th green and beach, see the trophy room and eat in the clubhouse grill.\n\nMONTEREY-Disappointments:\nCannery Row- totally over-rated, kitschy, over-priced and touristy. We did not hang about!\nAquarium- it's meant to be fantastic but would have cost us just under $200 dollars for a family entry!! So we chose the whale-watching trip instead.\n\nCARMEL-By-Sea\nWe wanted to see Carmel but by the time we left Pebble Beach the previous evening it was dark so we never completed 17 mile drive! So we stopped here for breakfast before beginning the 238mile coastal drive and Big Sur on the way to Santa Barbara. It was well worth the visit and I wish we could have spent longer here.\n\nDelights:\nPretty place and Free parking in the streets!\nLittle Swiss Cafe-perfect breakfast stop. Quirky and good food/reasonable prices.\nI will come back to Carmel for longer one day.\n\nNo Disappointments!\n\nBIG SUR DRIVE\nYou won't be disappointed. Plenty of stopping places along the way. All the cars driving it are tourists so everyone just having fun and enjoying the views. We did it in a day but I would love to do it in a camper van sometime and take more time to explore the various state parks along the way. My sons watched whales out at sea as we drove. TIP: Bring binoculars with you to see them better.\n\nHEARST CASTLE (Simeon)\nWe did not have time to do the tour but stopped at the visitor's centre and had something to eat and use toilets. It is somewhere I would like to visit properly another time for a look.\n\nELEPHANT SEAL BEACH\nWe came across this large lay-by/ rest area as we drove from Simeon to Morro Bay. It is busy with tourists stopping because of the presence of very large seals on the beach. It is definitely worth stopping and not to be missed. Just by lying there the seals are incredibly entertaining and fascinating to watch and made us laugh a lot. My children loved them.\n\nSANTA BARBARA\nDelights;mAt last some heat and sunshine!! I finally took off my fleece.\nWe stayed in the Fess Parker Hilton Hotel on the beach-front. Not cheap but I loved this hotel because of its very spacious room, ocean-front location and swimming pool and jacuzzi which were open until 11pm.\n\nTip for hotel: join Hilton Rewards scheme and then wifi is free at Hilton Hotels otherwise they charge.\nWe had a morning run along the fabulous beach path every day ( the lifeguards go for their run too so it's a bit like Baywatch!)and we enjoyed the walk into town along it-about 20 minutes-every day. The car never moved.\n\nJust enjoy wandering this lovely town. Explore the harbour area, marina and beach front as well as State Street.\nWe loved hearing and seeing the train come through every day.\n\nToma's restaurant is a must if looking for a top notch meal. The scallops were amazing!\n\nDisappointments;\nCar Parking charge at hotel $19 per day.\nHotel could have been cleaner.\n\nWe heard the amphibious bus is really good but missed the last run of the day so did not get to do it. Never got round to seeing the courthouse either. Something for another visit perhaps.\n\nLOS ANGELES\ndelights;\nUniversal Studios-My kids thought the entire experience was one of their best days ever.The studio tour was amazing. Our favourite family ride was Jurassic Park water ride, especially the 84 ft drop at the end.\nThe Hogwarts Harry Potter ride was incredible but made us all a bit queezy! The waterworld show was brilliant as was special effects show.\n\nWe stayed at The Garland, North Hollywood- handy for Universal Studios; quirky, modern, clean rooms. Free trolley to Universal Studios. Expensive to eat in though.\n\nVivian's Millennium Cafe- excellent for breakfast. A short walk from the garland.\n\nSanta Monica Beach\nIconic location and Fun pier and beach. We had a ride on the Ferris Wheel and spent an afternoon on the beach. Amazing gymnastics park on the beach which my boys loved!\nVenice Beach- a quick visit for the experience.\nWe took a drive around Hollywood Boulevard, Sunset Boulevard, Beverly Hills and Rodeo Drive.\n\nDisappointments:\nHollywood Boulevard was tacky.\n\nEating in at Garland Hotel-RIDICULOUSLY EXPENSIVE. By far the most expensive meal of our entire trip (and by far not the best). A shame really.\n\nDELIGHTS OF LOS ANGELES TO SAN DIEGO\nWe drove through downtown LA to Long Beach and explored the beautiful area. The Queen Mary is now moored there and Long Beach is lovely. Could have spent much longer here but short of time.\n\nHuntingdon Beach ( known as Surf City).\nWe stopped where all the surfers were and spent an afternoon on the beach. The waves were huge. My kids loved it. Well worth doing for a chill out afternoon. Good shopping here too!\n\nSAN DIEGO\nDelights:\nThis is now one of my favourite cities. I loved it and it's not to be missed. Incredible harbour front and endless marinas and views. Nice downtown area too.\nWatching baseball at Petco Park is worth-while doing. The kids had fun.\nHighlight for us was the USS Midway Aircraft Carrier. Awesome day out for the entire family.\nWe stayed at Bahia Resort at Mission Bay. It was an Idyllic location. The hotel had its own paddle steamer to take guests across the beautiful lagoon. Free parking/Wifi. Rooms were a little tired and outdated though.\nAirport bizarrely in the downtown area so very convenient and quick to get to.\nDisappointment-our holiday had come to its end! And we had plenty time and opportunity to chill and relax by the pools or beaches so we did not feel tired at all.\nI would thoroughly recommend travelling the Pacific Coast Highway. We had the most incredible holiday experience.\n\n\n\n\n\n\nShow less"], ["Reviewed July 23, 2016", 5.0, "Beautiful!! If at all possible, take food and drinks!", "An absolutely beautiful drive!! Take your time and take lots of stops and just enjoy the beautiful drive!!\nMake sure your gas tank is full!! Highly recommend taking a cooler if at all possible! Not a lot of food options at all. Limited options and expensive and not that good. At least take snacks and bottles of water.\nShow less"], ["Reviewed July 21, 2016", 4.0, "Different", "Don't do this if you get travel sick. Ensure you have plenty of food, fuel and drink and be prepared to travel most of it at 30-40 mph. Lots of up, down, side to side with some stunning views. You pass through state parks too and we ended up from Carmel to San Luis Osbisipo\nShow less"], ["Reviewed July 20, 2016", 5.0, "Take Deep Breaths", "You will want to take deep breaths for several reasons: the air is immaculate and just feels clean and also to bring your heart rate down from the death-defying turns. Since I have a real fear of heights, I thought it best that I drive this. The scenery is spectacular and other-worldly, but the road. Man the road! It is serious business. I had no problem using those turn outs to let those who wanted to drive fast and risk their life fly by me. I went the speed limit, but not a mile over it. There were moments where I really thought I couldn't do it anymore. At one turn, it was so sharp I practically came to stop to make the turn and you could see the road along the mountain for miles... never ending... and I didn't think I could do it anymore. Fortunately, just when you feel that way, it turns into an expressway and gives you some reprieve. If you've never done it and get the chance, do it. If I do it again, it will be as a passenger high on something!\nShow less"], ["Reviewed July 20, 2016", 4.0, "Very beautiful but views become repetitive", "The road is very scenic, no question about it! Beautiful views and some excellent spots for pictures.\nGive yourself enough time so that you can appreciate the route properly. We drove from San Francisco to San Diego with several stops halfway.\nThe only \"drawback\" is that, even though views are great, after a while they seem to be more of the same and become repetitive.\nShow less"], ["Reviewed July 15, 2016", 5.0, "Put this on your bucket list", "What a start to our road trip through western USA. The pacific coast drive is something everyone visiting (or residing in) the US should do. A small amount of research will give you a long list of things to stop and look at and a shortage of time meant we probably didn't do the journey justice by only taking two days. Loved every minute of it.\nShow less"], ["Reviewed July 15, 2016", 5.0, "Breathtaking ride", "The stretch of highway 1 from Monterey and southwards is one of the most beautiful rides I have ever had. Totally dramatic! Don't know how many stops along the way for pictures. One view more stunning than the other. Some lovely beaches, Big Sur, sea elephants. Definitely one of the top 3 in my book! Absolutely worth it.\nShow less"], ["Reviewed July 14, 2016", 5.0, "Year 2", "This place just never gets old.\n2yrs in a row and I still get a rush going through here.\nWe had too much fog but it couldn't stop the excitement.\nIt's true what they say.\n\"Everyone has to do this drive at least once in their lifetime!\"\nShow less"], ["Reviewed July 13, 2016", 5.0, "Beautiful Drive", "I love this stretch of road. I recently made my way from San Diego to San Francisco via Los Angeles. Parts of this trip were along US1 although I have previously driven all of it (1992 road trip). The highlight this time was Pismo beach (where the photos were taken) to San Simeon, and the final stretch in San Francisco which goes along the coast near the Golden Gate Bridge.\nI hope to drive the full route again soon - great memories.\nShow less"], ["Reviewed July 11, 2016", 5.0, "San Fran to LA along the PCH and the stops along the way", "My husband and I traveled down the PCH in early July 2016. I will discuss the outline of our trip, where we stayed and places we visited. Each individual location will also be reviewed individually.\n\nWe started our trip in San Francisco (SF). We stayed at the Holiday Inn Civic Center because of it's central location. While conveniently located right off Market Street (SoMo), this hotel is not in a desirable neighborhood. Thank goodness for Uber. While in San Fran we visited Golden Gate Park. The park is HUGE! We searched for Hippie Hill (google it) and wandered around a bit. It's a lovely park but all attractions cost money to get into. That same evening we took an Uber to Crissy Field. Before going in, we walked through the Palace of Fine Arts (a beautiful architectural feature worth a peak). From Crissy Field in Presidio Park we strolled along the trail all the way to the Golden Gate Bridge. We took this walk about 3 hours before sunset and had plenty of time to walk up to an under the bridge. It is a lengthy walk, but totally worth it with hidden gems along the path. You can walk up onto the GG Bridge, although we did not. We did not walk all the way back, rather picked up an Uber by the welcome center. Visiting the Presidio is a MUST do in SF. BEWARE- SF is very chilly, especially along the water and as the sun sets.\n\nNext up in SF the cable car. I would HIGHLY recommend this although the wait from Market Street is long. We waited about an hour and a half in the afternoon. We took the Powell and Hyde Street car which takes you right between Fisherman's Wharf and Ghirardelli Square. You will pass by Lombard Street on this line. If you take this line, it is best to sit on the right hand side of the cable car for the best views. Fisherman's Wharf is VERY crowded and a complete tourist trap, but whatever, check it out anyway. From there we did a tour of Alcatraz. This is another MUST! We did the evening tour which advertises as an \"adult\" cruise. There were kids on it. I don't really know what was different from the tour except that your time is more limited.\n\nSince our goal was to see the Pacific Coast Hwy, we rented a camper van from Lost Campers USA (review upcoming/google them). The van had everything we needed for 3 nights of camping except for food and beverages.\n\nWe left SF with Monterey as our destination. You DO NOT need to take the PCH- Hwy 1 as there is nothing to see. But you also may want to avoid the 101, it is a parking lot. Trust me. We stopped at the Monterey Aquarium. It was a Saturday so it was super crowded. Overall, I was underwhelmed by the aquarium and Monterey.\n\nFrom Monterey we were headed to Big Sur to camp for 2 nights. About 20 minutes or so into our drive we happened upon a restaurant right off of the PCH called Rocky Point Restaurant. Turn here! Spectacular views and excellent food with reasonable prices. From there we headed to our camping destination Fernwood Resort. This privately owned campground is located right next to Pfieffer Big Sur State Park. We took the opportunity to hike Buzzard's Roost to the peak of a mountain. It is a difficult 5 mile round trip hike, but certainly doable. There is allegedly a panoramic view of the ocean at the top but we were unable to see it due to the daily marine haze that exists in the area. I would recommend taking any hikes, etc, after 12 when the haze lifts. There are redwood trees along the path as Big Sur is the southern most area for Redwoods in Ca.\n\nLeaving our camp ground, we stopped at Julia Pfeiffer Burns State Park in Big Sur. This is a very popular attraction as the McWay Falls trail is here. STOP HERE! This very short walk on the right side of the PCH traveling south is absolutely stunning.\n\nThis is where the PCH becomes what you expect. All along the route there are numerous points to pull off and view the virgin coast. You could literally stop every few yards, it's that gorgeous. Take your time, stop and just be present. It is so rare to see such natural beauty. Beware, there are not a lot of places to stop and any places there are will be CRAZY expensive! So have the supplies and gas you need to get you through the Big Sur region.\n\nOur next destination as Morro Bay about a 3 hour drive. We did it in 5 because of a few stops. We stopped in San Simeon and walked out on the pier. It's a nice area. Maybe stop and have some lunch. We found a great Mexican restaurant in the area. There are many \"touristy\" places to stop such as Elephant Seal Park and Hearst Castle. We didn't do these. We did stop at Moonstone Beach which was pretty cool.\n\nIn Morro Bay we stayed at Morro Strand RV Park (no tent camping). It is in a cute little town and the park was about 2 blocks away from the beach. We were able to sit on the beach and watch the sunset.\n\nOff to LA next to see friends. If it wasn't for our friends, I could have skipped LA, but we did stop through Santa Barbara on the way for some local brew and wine. In LA we went to Venice Beach and saw the skate park and muscle beach. It was interesting.\n\nOverall, this is an amazing trip, and if you have the time and desire, I would camp my way down the PCH. It makes you feel a part of the natural beauty of the environment.\n\nIt is good to have a plan with ideas of stops and travel time. But just as important is to be open to stopping and exploring. Take pictures and take moments.\nShow less"], ["Reviewed July 10, 2016", 5.0, "Unforgettable family road trip", "Flew into San Diego, rented a car and and drove all the way to San Francisco in one week. Probably not long enough, but we had a great time. Multiple great vistas and places to see and visit. We made day stops in San Diego, Los Angeles area and beaches, Santa Barbara, Monterey, and San Francisco.\nShow less"], ["Reviewed July 10, 2016", 4.0, "Bodega Bay up to Mendicino, CA", "We decided to drive up the coast starting in Bodega Bay up to Mendicino. It is a beautiful ride with hairpin turns, high cliffs, lots of birds & flowers. Start out as early as possible. Yu will want to stop & enjoy the views-which are different around each corner.\nFill up your gas tank before getting on Highway 1 as gas prices are quite expensive. Also remember to take lots of water & snacks as a lot of places are not open during the off season.\nShow less"], ["Reviewed July 8, 2016", 5.0, "Family vacation that was awesome", "Flew into SF stayed two days then took Hwy 1 South. Stopped whenever along the way taking pictures and just taking in the water, sceneries and animals. Stayed in Monterey. Did the 17 mile around Pebble Beach and headed south Caramel and took in the highlights suggested on TripAdvisor. The state parks fees are good for several days so show them and you will not have to pay in another park. Stayed in San Simeon. Headed to Morro Bay then East to Sequoia and stayed in Three Rivers two nights. Check out Rio River house. Headed to Yosemite and stayed in Yosemite Lodge two nights then headed to Oakland to fly out. 1500 miles and a perfect trip. I planned this myself and checked prices continuously and on rentals cars too. Prices change. I had no problems with reservations. Check TripAdvisor as they are spot on with reviews.\nShow less"], ["Reviewed July 7, 2016", 5.0, "Family vacation", "We flew into Sacramento and we're flying out of San Diego. We had a week, this is a trip that really requires more than a week. It's a beautiful route to travel. Make sure to keep your tank full in the larger towns, it ranges from $4.50 - $6.50 a gallon in the smaller towns. This is a trip I'm glad we took with the kids when they were older. There's too much getting in and out of the car with smaller kids in my opinion. Lots to stop and see.\nShow less"], ["Reviewed July 2, 2016", 5.0, "Well with the drive", "'California Dreamin'\n\nA long overdue road trip. Driving from LA to Palm Springs and onward to San Francisco, taking the northern route in my belief was a great choice. The ruggedness of the coast is inspirational and calming. A highly recommended tour of Hearst Castle in San Simeon, and accommodation in Cambria. A lovely sunset and morning drive northward.\nShow less"], ["Reviewed June 30, 2016", 5.0, "Definitely a MUST DO when in California", "Drove from San Francisco to Santa Barbara and the drive was simply mind blowing. The Views will leave you spellbound. If you love driving then you just cannot miss this one."], ["Reviewed June 29, 2016", 5.0, "Absolutely Breathtaking!", "I am just sorry that it took us this long to make this drive. Around every curve (and there are lots of those) is a post card perfect view. It has been voted the most scenic drive in the US and it is the best we have ever done (Glacier Park being a close second). Be prepared for slow speeds and many stops. Going north to south is probably best because of course the views are to the west.\nThere is a stop to view elephant seals, they were sunning when we were there.\nThe area around Big Sir seemed to be the busiest, but other areas were just as beautiful and not so crowded.\nTo really understand the beauty you have to see it yourself.\nShow less"], ["Reviewed June 27, 2016", 5.0, "Tourists must ride on the Pacific Coast Highway!", "How can you visit LA without a trip up the coast on the Pacific Coast Highway? You can walk the boardwalks on Venice and Santa Monica Beach or ride them by bicycle. There are bike stands that rent them. Of course there are the beaches to also visit. Further north is Malibu, another must see. Stop at Grom for ice cream and visit the nature preserve there filled with beautiful native birds and plants, not mention wild prehistoric pelicans that have their own island there, as well as native Californian surfers of all ages enjoying the waves. I highly recommend Malibu, always my ultimate destination. If you need to pee, there is a great public bathroom in the mall by the Malibu theaters behind the Malibu Coast Animal Hospital. If you have dogs, there is a great walking trail right beside this animal hospital, as well as a dog beach further north at Leo Cabrillo Beach. Enjoy! Malibu never disappoints.\nShow less"], ["Reviewed June 25, 2016", 5.0, "A MUST from North to South unbelievable views", "This was by far one of the most exciting and beautiful car rides I have ever taken. I left San Fransisco and went down to near LA. The upper portion from San Fran to Monterey had light blue waters and beautiful skies. A photographers delight. Monterey to LA slightly less spectacular but still worth the ride. I want to go up to Eureka and drive down to San Fran before I leave LA.\nShow less"], ["Reviewed June 24, 2016", 5.0, "America at its most beautiful", "San Diego to San Francisco. It was spectacular. San Diego must-dos include the Zoo, the adjacent Botanical Building in Balboa Park, and dinner and seal-viewing in La Jolla. In LA, the Getty Museum can't be missed. Make sure to spend a day each in Santa Barbara (whale watching, Lotusland) and before enjoying the stunning drive up through Big Sur to Carmel (shopping in quaint village for art, Monterey Acquarium. In SF, contemporary art museum, botanical garden, Golden Gate Bridge, visit to Muir Woods, and lunch /stroll in Saulsolito.\nShow less"], ["Reviewed June 23, 2016", 4.0, "Nice srive", "The drive was nice. There were plenty of turnouts to stop and take pictures of the view. In the afternoon the turnouts were a bit crowded."], ["Reviewed June 23, 2016", 5.0, "Gorgeous drive!", "We took PCH from Santa Monica all the way up to Carmel by the Sea and it was one of the most beautiful drives ever. We stopped along the way at places like Santa Barbara, SLO, and Big Sur. THIS DRIVE IS A MUST SEE!!!!"], ["Reviewed June 22, 2016", 5.0, "Beautiful Drive", "The PCH has to be one of the most beautiful drives in the world. Whether you're looking westward toward the coast or eastward at the beautiful homes dotting the hillside. Be sure the pull-off and stop and one of the many beaches along the way. Traffic can be congested during rush.\nShow less"], ["Reviewed June 22, 2016", 5.0, "Stunning, breathtaking, gorgeous", "We visited LA, San Fran, and Napa and took the Pacific Coast Highway up, and driving in the car was my favorite part of the trip. It's absolutely awesome, I was very impressed, we stopped in countless places and towns. Don't go if you get carsick and don't like sharp turns.\nShow less"], ["Reviewed June 22, 2016", 5.0, "The dramatic coastline once again", "In January of 2015, I drove up the coast from LA to Sonoma Valley and beyond to Sausalito and Oakland. Nothing compares to the Elephant Seals having their babies right below us on the beach in San Simeon or to Big Sur. However, while I was in LA this time around (June 14-21, 2016), a good friend drove us south to Laguna Beach, and I was back, reunited with all that dramatic beauty that is the California coastline.\nWe walked out onto the rocks and looked for sea anemones and mussels while the pelicans flew overhead and a few seals sunbathed on distant rocks. On the way down to the beach, I got to see the wonderful bungalows, including some original picturesque houses beautifully preserved that gave a sense of the artists' colony this once was. The flora is divine--every kind of blooming flower and a vast array of trees indigenous to the area--I am a New Yorker, and the Pacific Coast just sends me.\nShow less"], ["Reviewed June 22, 2016", 5.0, "Archers Pacific Coast Explorer", "We have had and amazing holiday travelling on an air conditioned coach from Los Angeles all the way up the Pacific Coast highway 101 to Seattle. Which took 13 days. Loads of stops on the way with highlights being included trip to Alcatraz which was brilliant. Visited two different Redwood parks which are awesome. The tour director was very helpful and extremely knowledgeable. Top marks all round\nShow less"], ["Reviewed June 21, 2016", 5.0, "One of the world's great treasures", "I have driven some great roads : completely around both Maui Volcanoes ,\nthe Southern French coast, many a Swiss mountain pass and they ALL are Great..\nbut there is something magical about Hwy 1.\nTips :go speed limit..not too fast nor not too slow, there are Many Many vantage points stop and enjoy..if U see something try to pull off road a bit..UNLESS U R southbound then B carefull 'cause the Drops are drastic ..in fact try to research a bit so U are aware of what is where...if U see bikes GIVE THEM ROOM..if U see Seals or Whales ..make note of the \"pull over spot\"..there are often many many motorists doing the same thing so beware .\nPack an Ice chest with \"drink and eat\" goodies because stores are far between here\nGet Reservations for hotels 'cause hotels fill quick.\ntry to Stop at Nepenthe and ask about Esalen\ntake is EZ ..make sure Device has back up power for when fotos load up\nShow less"], ["Reviewed June 20, 2016", 5.0, "Beautiful yet wild, inspiring yet accessible", "We flew a long way to visit California, and decided on this family trip we had to see the famed coastal road. So we drove from San Francisco to Anaheim along the road for as much as we could, and despite some inclement weather every now and then, weren't disappointed. There's so much to see, much of it beautiful yet wild, inspiring yet accessible, and we were tempted to stay for longer if we could. There's obviously a fair bit we didn't drive through (especially the section north of San Francisco) but I'm satisfied, very satisfied.\nShow less"], ["Reviewed June 19, 2016", 5.0, "San Francisco to Mendocino on Hwy 1", "What a gorgeous drive along the rocky coast! Give yourself about five hours just for this leg. So many turns and wonderful views. A bit scary at times with locals who are more familiar with the route on your bumper and anxious to pass. There are plenty of turn offs to pull over and let faster drivers pass so be courteous and do that. Be rested as the drive can be tiring. Relax and enjoy!\nShow less"], ["Reviewed June 19, 2016", 5.0, "Wow", "Ok we followed the 1 from LA all the way up to SF. If I were to do it again I wouldn't bother doing the whole thing as after you clear Malibu it's not that great so I would recommend getting back on somewhere before San Simeon which is a good half way stop and has some great elephant seal viewing.\nThe drive after San Simeon just gets better and better, it is stunning and you need to allow a couple of days if you wanna stop and enjoy the incredible scenery. The roads in some places are very twisty with a few nasty drops so be careful .\nWe went up to Carmel and then picked up the 101 again.\nShow less"], ["Reviewed June 18, 2016", 4.0, "Excellent views", "This is a wonderful experience if you have a little time and love scenic views. I had some time after a business trip and it was a wonderful drive with seals and beautiful waves."], ["Reviewed June 17, 2016", 5.0, "Every 5 years, you have to \"Just Do It\"!", "We've done this drive and started from Carmel. We usually stay in the quaint town 2 or 3 days because it's dog friendly, beautiful and has some interesting art and characters around. Driving south seems to be the best way as you are on the right side of the road and can pull off several times. We skipped the Castle since our kids were small but stopped at Pismo Beach and stayed at a motel there on the beach with ocean views and a great restaurant. We could have stayed two nights here but we traveled on to Santa Monica. It wasn't too much if you break it up to 2 or three nights on the road. We also went to Solvang and that is another place we loved. The ocean and coastal views call you back every 5 years or so and it's worth the long trip (we're from the East Coast) to get your roadtrip on and enjoy the view.\nShow less"], ["Reviewed June 16, 2016", 5.0, "Most beautiful road scenery anywhere", "We left Santa Cruz and headed south on Hwy 1, the Pacific Coast Highway. Enjoy the pictures we took."], ["Reviewed June 15, 2016", 5.0, "You have to experience it at least once!", "This is an amazing experience, but beware, you are on tight roads so if you are scared of heights, you may get freaked out. The views are amazing and worth the extra time to take this highway. With that said, like I said the turns are tight in some areas and I do not recommend taking this after dark - we got off as soon as the sun set, but it was a beautiful ride I would do again!\nShow less"], ["Reviewed June 15, 2016", 5.0, "Truly beautiful", "I am joining everyone else in love with the beautiful Californian coast. We did this road trip 4 years ago and since then, we did the road to Hana last year and the Amalfi coast, a few weeks ago. That's the reason for writing this review :) I concluded Hwy 1 is amazing! And I will definitely go back.\nShow less"], ["Reviewed June 12, 2016", 5.0, "Stunning", "AMAZING. This must go on your bucket list!! Stunning scenery. Great little places to stop of and explore. Scary yet fun drive. A great adventure."], ["Reviewed June 12, 2016", 4.0, "A real driver's road.", "The Pacific Coast Highway is a stunningly beautiful road that winds along the very edge of the Californian coast.\n\nYou can pull over in the small lay-bys dotted along the road for photos and there is one point where you can go for a short walk to see a waterfall, although chances are that what you'll actually see is a cliff where there should be a waterfall but isn't one due to the drought. There's also a sea lion colony a bit further south.\n\nThere's not a terrific amount to stop and do, but if you like to drive for the sake of driving then it's pretty much the perfect road. If, as I did, you find yourself stuck in a vehicle being driven at 15mph by someone else, kick them out of the driving seat at the first possible opportunity or suffer interminable frustration.\nShow less"], ["Reviewed June 11, 2016", 5.0, "Beautiful", "This was the most enjoyable drive I have ever been on. You get such great views of the ocean and the vineyards and orchards are beautiful as well. I encourage you to get out and adventure on the coast, we had a blast in a little beach cove!\nShow less"], ["Reviewed June 9, 2016", 3.0, "Pick the right month or risk the weather", "A trip down the PCH is legendary, the views are great and the beaches are stunning but lets be clear its dependent on the weather, there are not so many beaches you can reach easily Between Carmel and LA and it gets very crowded.\nBig warning do not go in June the coast becomes susceptible to sea mist and you can spend a lot of time shivering in the cold moist air looking at fog.\nA pacific coast is a pacific coast, its dramatic and rugged and I ve seen it it in Oregon. Having said that its a nicer drive than the fast motorway.\nShow less"], ["Reviewed June 5, 2016", 5.0, "This is a fantastic drive...", "Pacific Coast Highway 1\n\nThis is truly an iconic drive that should be taken if at all possible!\n\nThe highway starts from near Pismo Beach and will take you northbound all the way up to San Francisco.\n\nThere are plenty of places to stop and take in the spectacular scenery and also the Pacific Ocean along with some of the beaches.\n\nCarmel-by-the-Sea and Monterey Bay are around 225 miles north from Pismo and 124 miles south of San Francisco.\n\nThe next stop is Monterey…this is where the Big Blue was filmed (in the aquarium in Monterey Bay).\n\nBig Sur, about 35 miles south of Carmel-by-the-Sea, is a National Forest area which also has lodging and a camping area.\n\nThere are lodging places along the route.\n\nThere are also two dedicated stopping places where you can see seals…\n\nDependent on the time of year and how lucky you are, you may even get to see some whales!\nShow less"], ["Reviewed June 1, 2016", 5.0, "Memorable landscapes along Pacific Coast Highway", "We are family of four started from SF on Saturday before Memorial Day. Took us 13 hrs to reach Santa Monica after several stops for lunch at Monterey, refuel at Cambria, photo shots at those attractions stops. But it was worth journey with all those terrain transformation from small town by seasides to cliff driving, many of state parks, undulating grassland to mountain views. PCH is still the best coastal driving in US for drivers.\nShow less"], ["Reviewed May 31, 2016", 5.0, "Beautiful Sights~Windy Roads", "A must when in the area! Traveled to Bodega Bay, where we were staying, as well as wineries and restaurants. Many breathtaking views, pull offs for pictures but windy and narrow roads. Well worth traveling!"]]}}