{"Painted Ladies": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Painted Ladies", "url": "/Attraction_Review-g60713-d104540-Reviews-Painted_Ladies-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/7b/b5/97/the-painted-ladies.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1322"}, "address": {"@type": "PostalAddress", "streetAddress": "Alamo Square, Steiner and Hayes Sts.", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 4.0, "Fun to do but wouldn't go out of my way...", "We really enjoyed standing in nearby Alamo Park and looking at the different views of the city from the top of the hill. San Francisco is a city filled with beautiful victorian homes and the painted ladies were very nice, but there are plenty of other examples and neighborhoods that are much more interesting. If you were a Full House fan as a kid, then you definitely want to see this.\nShow less"], ["Reviewed 4 days ago", 3.0, "Higher expectations, but not sue why...", "The houses are gorgeous being older Victorian homes. But finding out that the Full House 'house' isn't amongst then kinda puts a damper on the visit. Being a 90s kid, there was a bunch of nostalgia with this visit that wasn't really met. Still worth checking out but don't waste much of your day here.\nShow less"], ["Reviewed 5 days ago", 3.0, "Just go for a quick stop", "You don't need more than 5 minutes to get your pics but walk up a few mins in to Alamo Park and you will get a great picture of the city too. There's nothing else to do other than photo a few houses..."], ["Reviewed 2 weeks ago", 4.0, "Beautiful Surroundings", "Did you ever watch Full House as a kid? If so do you remember the intro of the show where you saw the row of colorful homes? The Painted Ladies of Alamo Square are 7 homes that were in the intro for Full House. Just in front of it is Alamo Square Park. The park is so nice and cute, there are coffee vendors so you can grab something to drink/eat and go park yourself on a bench and take in the views. The park is up on a hill, the is a playground for kids, plenty of grassy area to bring a blanket and have a picnic. Dogs are allowed to play around as well. Wish we had a park like this where we live- would be spending a lot of time there if we did!\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Cute", "There really isn't much to say about the Painted Ladies other than \"cute\". We spent about 5 minutes there, and that seemed like an eternity. The views of the city skyline was much more pleasing than the views of the houses. Not something to go out of your way to see, but if in the area it's worth a quick visit.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Who didn’t love Full House?", "As an avid fan of early 90s tv, the ‘Full House’ Houses had to be on my list of things to see during my trip to San Francisco. My British husband didn’t quite get it but happily went along with me. They didn’t disappoint for the full 5 minutes we were there. Go if it’s on the way but don’t travel hours just for a glimpse and as it’s catty corner to a high school perhaps time your visit so you aren’t in a hoard of high schoolers?\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great tourist location. Beautiful views", "This location is easy to find. I would suggest maybe stopping here towards the before sunset portion of your day. With all the walking done in SF it was nice to have this be our final stop and just relax and enjoy the view from the park.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great doot", "Great spot to take pics. Parking somewhat limited. There’s a park across the street with a few nice playgrounds and restrooms. Eve restrooms aren’t so clean but they work."], ["Reviewed 3 weeks ago", 5.0, "Very interesting buildings", "Going to SF you must visit the Painted Ladies. The alamo Square park (in front of the houses) is also a nice attraction. People walk with their dogs, do pic nics, etc."], ["Reviewed 4 weeks ago", 5.0, "I can get some of the Skyline in the pic", "You can get a pic of the painted ladies with a part of the San Francisco Skyline which is awesome. It's to far to walk from the financial district to the painted ladies but it's worth coming anyways."], ["Reviewed 4 weeks ago", 3.0, "Pretty", "Pretty. If you have a short amount of time in SF this is something I would suggest you skip. They do line a beautiful park. It was nice to walk and see the many dogs playing."], ["Reviewed January 22, 2018", 4.0, "Iconic houses of SF well worth a look", "We headed here on our way out to the airport and glad we did. The houses are beautiful and such a part of San Francisco's architecture (a review further on describes the Painted Ladies perfectly).\n\nGreat photo opportunity and the skyline looking back is lovely too (even on our overcast day!)\nShow less"], ["Reviewed January 21, 2018", 4.0, "Cute little strip of houses, kids thought it was cool we visited", "My husband and I stopped by here during a short trip to SF. We knew it was really just a short street of Victorian houses, which wouldn't normally attract us to visit. But both our girls have grown up watching reruns of Full House and the most recent Fuller House so we had to swing by for a quick photo opt. We sent our teenager a selfie of us and the houses and she about died, she loved it. If you grew up watching Full House or your kids enjoy the show, it's worth a quick stop just for the visual coolness. If not, you could probably skip it as there isn't really anything else there besides a large park that locals seem to bring their dogs to.\nShow less"], ["Reviewed January 21, 2018", 3.0, "Only a very quick photo opportunity required", "If you haven't got much time then you won't have missed much, but if you have spare time then these seven differently painted houses in a row, with a fantastic backdrop of the Financial District do make for a great picture (id it's not overcast as it was the day we went).\nShow less"], ["Reviewed January 17, 2018", 3.0, "Nice", "Nice houses. Nothing fantastic have a look whilst in the area they are famous but wouldn’t go out of my way to see them again"], ["Reviewed January 16, 2018", 5.0, "Painted Beauties", "Beautiful Victorian homes are a must see as a part of SFO history. Architecture is amazing and breathtaking. They are beautifully cared for and worth a visit.\n\nThere is a man who is selling art/photographs of the painted Ladies at Pier one. (I think on Saturdays and Sundays.) He takes the photos and then pixelates them. Beautiful work and beautiful soul.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Didn't really understand the appeal", "It takes a bit of effort to get there; like a lot of places in San Francisco, you have to go up and down a lot to finally get to your intended destination. This time, the whole ups and down didn't really seem to worth it. The row of painted houses are known for their unique architecture but to me a lot of houses and neighborhood in San Francisco seem to share the same appearance. I probably do not have the fine taste in architecture to understand the uniqueness of them. On the plus side, you get a great city view from this location\nShow less"], ["Reviewed January 8, 2018", 4.0, "Iconic", "Maybe this is a case where the picture is better than the actual sight. The houses are iconic. But to really get the full breath of the painted ladies genre take a look at the Painted Ladies book."], ["Reviewed January 7, 2018", 5.0, "Great view!", "The view from this park is fabulous. I was excited to finally see the houses but I hadn't realized how great the view of the city was going to be. We did the hop on hop off bus tour and this is a walk of a couple of blocks to get to the park.\nShow less"], ["Reviewed December 25, 2017", 5.0, "Beautiful houses", "Visit the neighborhood and make sure to visit Alamo Square park for a view of the painted ladies and San Francisco Skyrises."], ["Reviewed December 22, 2017", 3.0, "Nice houses", "The houses are nice but not worth the headache of finding parking or making a special trip for. The area is surrounded by tourists and buses"], ["Reviewed December 20, 2017", 4.0, "Deja vue \"Our new house\"", "We just purchased a town house in Calgary Canada which is modeled after the SFO Painted Ladies.......so had to go and visit the originals. Worth the Uber ride out to the Filmore area, while there walk through the Filmore area and have coffee."], ["Reviewed December 19, 2017", 4.0, "New to that.", "Charming row of houses, out of standard design you find from the area. Journey to get there was more interesting."], ["Reviewed December 6, 2017", 5.0, "Got their name from from being painted in three or more colors", "We visited the “painted ladies” during our city tour with Dylan’s Tours.\n\nThey were built in Victorian or Edwardian style depending on which year they were constructed, and get their name from being painted in three or more colors to enhance their architectural details.\n\nIt is believed that there were 48,000 houses in the Victorian and Edwardian styles were built in San Francisco between 1849 and 1915. Many of these style homes in Nob Hill were destroyed by the 1906 San Francisco earthquake, but there are thousands of houses that did survive the earthquake.\n\nBeautiful historical buildings well worth viewing.\nShow less"], ["Reviewed December 3, 2017", 3.0, "Just painted houses.", "There are some cool houses in San Francisco, if that's what you're into, perhaps this is a highlight for you. For the rest of us-this is just a few houses. San Francisco is huge, don't spend time looking for these when there are so many other cool things to see and do.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Enjoyed seeing them on a bus tour!", "Exactly how I think neighbourhoods should be, colourful and attractive! These buildings are lovely and a pleasure to see. Not worth walking to I don’t think but was nice to pass by :-)"], ["Reviewed November 23, 2017", 4.0, "Iconic San Fran history", "So pleased we made time in our 3-day visit to San Fran to see the Painted Ladies.\nAs with most historic sites, we knew some of these buildings' history and present-day context, and our visit was enriched by that.\nOver the road, there's a lovely park for a stroll, with children's play area and The Lady Falcon coffee bus: delicious coffee served by lovely people.\nEasy access to the area by public transport.\nHints: learn a little of Painted Ladies' history / try to visit before mid-morning, as it can get busy later in the day, especially at weekends if good weather. Chill out with a coffee at Lady Falcon.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Elegant symbols of the past.", "The Painted Ladies are Victorian styled townhouses which have been restored structurally and painted in bright colors, some would say gaudy colors.\n\nWhatever, they’re a symbol of San Francisco just as is the Golden Gate Bridge.\n\nHard to believe but the Ladies are said to have been painted in Battleship Gray, I.e. Haze Gray, after WWII because the Navy had a lot of surplus paint. Or so the story goes.\n\nFrom the street, you have a view not only of the Houses but down to City Hall and downtown.\nShow less"], ["Reviewed November 14, 2017", 4.0, "Absolutely San Francisco", "The pictures of this block of Victorian houses are ubiquitous and closely associated with the commonly known view of the city.\nThere are 1000's of these rows in San Francisco but these ones are famous because of the backdrop.\nWhile there are better ones these are the famous painted ladies and I add my couple of photos into the mix.\n1972\nShow less"], ["Reviewed November 7, 2017", 3.0, "a spot for a photo", "Lots of people here taking photos. most stayed back but some had to be right up front getting in everyone else's pics."], ["Reviewed October 31, 2017", 3.0, "Nice homes, high crime area.", "As others have mentioned, watch out for car break-ins while visiting this popular tourist spot. SF has a lot of crime and bums - our rental car was broken into during the middle of the day and I'm convinced that someone the area acts as a lookout.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Beautiful", "We cycled here and it was so hilly. The hills kill us.\n\nBut once you are here, sit in the park for a while and view the city. The 7 painted sisters/ladies are beautiful and with the SF in the background, it is a feast for the eyes.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Very Popular Spot", "Be prepared to walk a ways to get up close and take some good photos. As others have suggested, I would do this on a guided tour. It’s tough to find parking in this area and it’s rife with tourists. That being said, if you don’t go you’ll probably regret it because of the iconic photos you’ll miss out on!\nShow less"], ["Reviewed October 17, 2017", 5.0, "Make This a Part of a Guided Tour", "There are several choices in guided tours of the San Francisco area. Most include these homes as part of their agenda. While famous, there are many other homes to see in the city. Walking tours of special areas are a great investment."], ["Reviewed October 17, 2017", 4.0, "Nice View", "The \"Painted Ladies\" are a row of historical houses on a hill just outside the downtown area of San Francisco - on the perimeter of a park. There are great views of the city."], ["Reviewed October 16, 2017", 3.0, "If you are on car rental, dont park at the Hayes/Pierce St area... or any area not visible as you visit the park.", "After staying less than 15 mins in the park, we went back to our car (rental) parked at the Hayes St near Pierce St. From about 300 meters from the car, i saw a guy looking through our car windows. A black car was idling at the opposite lane... obviously the getaway car. We didnt leave anything on the car seats and there were no valuables in the car but i saw the guy raising his arm and about to break our window. I screamed on the guy from the distance and he immediately ran towards the black car and sped away. They didnt get anything but these guys ruined our awesome San Francisco experience.\nShow less"], ["Reviewed October 9, 2017", 3.0, "Views from park are great!", "The houses use to be painted different colors and many a poster shows them that way but now they are all painted the same of neutral color and are very bland to the eye; however, the view of the city from the hill is worth the trip. It is a short cab ride or uber. Great for a picnic on the grass or flying your drone which is how techies fly kites. If your looking for something that is up lifting and not to stressful, give this a go. Basically, these are just four houses that look a like in a row, Don't expect anything more.\nShow less"], ["Reviewed October 8, 2017", 3.0, "Love the gistory", "It was fun to walk down Steiner Street to see the painted ladies. So much history and beautiful architecture to admire."], ["Reviewed October 8, 2017", 5.0, "amazing architecture and colors", "ALamo Square and the victorian ladies perfection and beauty to our eyes.I enjoyed my time there. I highly recommend to visit them."], ["Reviewed October 6, 2017", 5.0, "Color Me...", "If you visit San Francisco there are a few things you must see and the Painted Ladies are one of them. The pleasing colors, the architecture, the way they were built on the hillside...a side trip worth viewing."], ["Reviewed October 6, 2017", 5.0, "Great!", "Really nice to see on a sunny day! Easily accessible with public transport. And a nice little park across the road to sit on the grass or entertain the kids on the playground! Go and see!"], ["Reviewed October 5, 2017", 4.0, "A must see in San Francisco if you have a car.", "Check this one off the bucket list. As I wrote in my Alamo Square review, these houses are very pretty, but so are other ones on the main streets surrounding Alamo Square. What sets these particular six houses apart are that they are all in a row and have an open background behind them which makes for nice pictures!\nShow less"], ["Reviewed September 29, 2017", 4.0, "Worth seeing!", "If you don't do this as part of a tour, just grab a lyft there. Easy to get to, and a great spot for pictures."], ["Reviewed September 26, 2017", 4.0, "See all of SF houses, not just these", "The Painted Ladies are an iconic part of SF. So you really must go and see them. The views from the hill just across for them are fantastic so you get more than just a view of some houses.\n\nBut, there are much nicer houses all around San Francisco. Not just these. So absolutely go visit the painted ladies but take some time to just visit some regular houses too. They are all beautiful!\nShow less"], ["Reviewed September 26, 2017", 3.0, "Only if you are a Full House fan", "There is a park on a hill, tourists taking photos of the row of houses, and not much more. Sorry, we were not impressed."], ["Reviewed September 23, 2017", 5.0, "Classic San Francisco!", "Love visiting the painted ladies. Yes it's just a row of houses but it is a classic and a SF must see. Now that Alamo Square park is back open you can enjoy the painted ladies even more from a shady spot atop the hill."], ["Reviewed September 20, 2017", 3.0, "Underwhelming - walk around and see more beautiful houses", "We were quite underwhelmed when we eventually got to the painted ladies as the houses looked like they needed a refresh. There are plenty more beautiful and colourful streets with houses just like this all over the city with views that are even more amazing!\n\nWe would recommend walking around / getting lost and coming across some nicer parts of San Fran\nShow less"], ["Reviewed September 20, 2017", 4.0, "Nice houses", "This place is one of the nicest places in SF. I think every visitor of SF should come to see them. THough I expected there would be more of them:)"], ["Reviewed September 17, 2017", 4.0, "Iconic", "I know the Painted Ladies are only a row of houses but they are just so San Francisco!!! Have seen them on each of my four visit to the city and still find the beautiful."], ["Reviewed September 16, 2017", 4.0, "Full House Fan", "I've always wanted to see these it person, and I finally did. The 30 year anniversary of the release of Full House was this month, so I wanted to stop by and see these. They are beautiful, but there are other homes in the neighborhood that are just as beautiful.\nShow less"], ["Reviewed September 15, 2017", 3.0, "Pretty cool", "The park is quite nice, lots of room to sit and walk. The views are good but not the best in the city. The location is fairly far from the downtown (Union Square), but $10-$15 uber. The houses are cool and make a nice picture. I never really watched Full House so didn't have a culture significance to me. Still worth an afternoon or a couple hours if you are in the city for more than 3 days.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Beautiful homes", "the houses upclose are beautiful and the current owners have maintained them very well, they are occupied so try no to disturb the homeowners, theres a park infront where you can see them from afar and take great pics."], ["Reviewed September 14, 2017", 5.0, "The Painted Ladies - Most Famous SF Homes", "Drive by - pop out and take a photo - of this cadre of painted Victorian Homes...Unique - and fun to see - sicne youve seen them in TV adsadn TV shows forever"], ["Reviewed September 14, 2017", 4.0, "Novelty visit", "I wanted to visit after a childhood growing up with Full House so a bit of a novelty visit.\nThis is a bit of trek on foot as there isnt really anything else around and a bit far from the main part of town.\nBut photo worthy none the less.\nShow less"], ["Reviewed September 12, 2017", 3.0, "Quick look on way through", "Not a whole heap to do here but walk past and take a picture. It gets quite busy and we were fortunate enough to get a car park but plan on having to park and walk."], ["Reviewed September 10, 2017", 4.0, "Worth a look", "While San Francisco is full of beautiful architecture, the immaculate presentation of these homes along with the stunning skyline of San Francisco in the background makes them worth a visit . Sitting in the park opposite, you won't be the only one loading your \"Full House\" pics to social media.\nWe caught the number 21 bus out from the middle of town and it was a very easy ride - about 12 minutes. The buses seem to run fairly frequently in both directions .\nShow less"], ["Reviewed September 6, 2017", 4.0, "Lovely architecture of homes", "Lovely neighbourhood filled with old victorian/edwardian houses. Lovely to walk around and admire the beautiful architecture. Finally made it to Alamo Sq where the painted ladies are located. Beautiful place."], ["Reviewed September 6, 2017", 5.0, "Well worth the visit", "Although we visited on a record breaking hot day in SF, it was well worth the visit.\n\nThe Painted Ladies, a set of exquisitely preserved Victorian houses, sit just off Alamo Square and they are like the postcards. It's my second favourite SF scene after the Golden Gate Bridge.\n\nAlamo Square itself is a a lovely Park and lots of people were out picnicking. It also offers stunning views over SF right down to City Hall.\n\nGo visit!\nShow less"], ["Reviewed September 5, 2017", 1.0, "SF trip 2017", "This was pretty boring for anyone not familiar with Full House. The park is nice, but not a real stop-worthy experience. Maybe if there were a tour of the buildings, it would be better. Won't be planning to go back unless driving by."], ["Reviewed September 3, 2017", 4.0, "Beautiful Homes", "Very pretty area in general. Would have loved to spend more time at the park and walking around the neighborhood. Parking is limited during certain hours so I'd check before you go. Great stop in my opinion."], ["Reviewed September 3, 2017", 3.0, "Nice but nothing amazing", "We were in the area and deliberately walked past, whilst they are lovely, San Fransisco has many streets with great and well maintained Victorian houses. Good park across the road for best views."], ["Reviewed August 31, 2017", 4.0, "Nice to have seen", "When we went it was great weather took a couple of pics then sat on the grass for a bit would have been good for a picnic wouldn't have been so nice in the rain"], ["Reviewed August 27, 2017", 3.0, "Overrated", "These houses are pretty, but in my opinion, overrated. If you have limited time, I wouldn't put them at the top."], ["Reviewed August 27, 2017", 4.0, "A quick and short visit.", "There is not that much to see but it is a historic landmark so I guess in that aspect it makes it worth a stop. I prefer the park that the ladies face more as it has a nice view of the city. It's clean and you can lounge around or even have a picnic there.\nShow less"], ["Reviewed August 27, 2017", 4.0, "Pretty", "Pretty houses that are easy to get to (on Alamo Square) with easy on street parking. They are worth seeing but there is not much else to do once you've seen them - we drove to them as part of another journey and I think this is the best way to see them.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Downtown views are great!", "The downtown views are great in the background. Don’t miss that part. Usually the tourist crowd take pictures of the houses and leave. But wait for the sun to go down to see the downtown when the building lights come on. The views are spectacular! If you need the address to visit this place, get to Steiner St, San Francisco and you will not miss to spot the Victorian style houses.\nShow less"], ["Reviewed August 21, 2017", 4.0, "The Tanner Household", "If you ever are in San Francisco, and if you're an 80's baby who grew up watching Full House then you absolutely have to head down to Steiner Street (opposite Alamo Park) for a glimpse of the Painted Ladies - the iconic Victorian houses (characteristic of San Francisco) that were featured in the cult 80's sitcom, which was also where the fictional Tanner family resided (of course, back then, the house was off-white and had a red door). It doesn't take too long to get there, and it's pretty centrally located. You'll be able to catch a view of the whole row of colorfully painted houses from the small park (Alamo Park) across the street. Do note that these houses are privately owned, so please don't get too close or even trespass. Rumour has it that the creator and executive producer of the show Jeff Franklin owns the house that was meant to be the Tanner Household.\nShow less"], ["Reviewed August 19, 2017", 3.0, "Pretty but nothing special", "First of all, to appreciate these six houses, you must have at least a slight understanding of the history behind it (go to wikipedia or just google painted ladies and there's a lot of write ups about it). Other than that, you go to Alamo Square (just a park across the street) for best view point. To the right is one ugly big building, and to the left sits another older Victorian house that the original designer and builder once lived. Yes, the designer builder that built all six Painted Ladies used to live in the house on the left. Other than that, read up a little on Victorian architecture first to gain more understanding.\n\nNeighbourhood wise, it's not super safe. But then again, I've being warned by local people, that theft really target tourist cars around that place, by breaking into cars and stealing things, just anythings. So be careful.\nShow less"], ["Reviewed August 19, 2017", 3.0, "Nice set of victorian houses", "... but you don't have to see them... I went there on purpose... nice to see. The view from ALamo square is nice though."], ["Reviewed August 19, 2017", 4.0, "Good for a quick visit to say you saw the iconic houses", "It's a nice place to stop and you can do it in a half hour or less. We circled Alamo Square Park a couple times, as parking was tough. Just look a few blocks away and you should find some street parking. There weren't that many people when we visited on a cloudy Thursday morning, so that was nice. Tourists get so excited over the houses, and you will see tons of giggling girls.\nShow less"], ["Reviewed August 16, 2017", 3.0, "Worth a Drive By", "Of course, if you grew up on Full House, these are iconic. Not much to do here though. If you walk up the hill opposite the houses, it's a pretty great view."], ["Reviewed August 16, 2017", 4.0, "Cute", "We visited the Painted Ladies because my daughter wanted to see them. People think that one of the houses is where Full House was recorded."], ["Reviewed August 16, 2017", 3.0, "Painted Ladies - Seven Sisters - Full House Opening Credits", "The painted Ladies are seven Victorian homes that are an iconic image of San Francisco immortalized in the opening credits of the shows Full House and Fuller House.they are right across from the Alamo Park where the picnic scene for the opening credits was filmed and a mile away from 1709 Broaderick which was the Tanner Family house. We went on a weekday at 2 pm so there wasn't a lot of traffic and we could take pictures.\nShow less"], ["Reviewed August 14, 2017", 3.0, "Better if you don't visit on a weekend.", "Beautiful houses in an iconic setting. When Alamo Square Park is full on weekends, it gets harder to take pictures without people in them (and much harder to find parking).\nOnce you have seen the houses, there really isn't a reason to return to see them again.\nWe visited twice as we had friends that wanted to see the houses. Fortunately they were able to visit during the week. They were done with the ladies after 5 minutes.\nStreet parking can fill up fast.\nSo many other places to visit in the city, this is not on our list of must see attractions.\nShow less"], ["Reviewed August 13, 2017", 3.0, "Nice set of homes", "A bit isolated from the \"heart\" of San Francisco. They are a nice set of homes but other than a quick glance and taking a few pics, not much to see. The park across the street (filmed in opening of Full House) looks like a decent sized park but parking wasn't available when we went so didn't get a chance to see. Worth going if In area but personally wouldn't go out of your way.\nShow less"], ["Reviewed August 8, 2017", 3.0, "Nice to glance at, not a lot else to see!", "This area is a little isolated and other than stopping to take a photo of these houses or have a rest on the grassy bank opposite, there is little else to see or do. We did, however, note free wifi in the park which as useful!\n\nI'm sure the homeowners must get quite annoyed with the number of tourists stood opposite taking photos.\n\nUnless you are really interested, perhaps give it a miss.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Kool Scene", "Beautiful historic houses next to a park on a hill. Nice place to stop and rest and take in the views."], ["Reviewed August 8, 2017", 5.0, "Noted Tourist Spot", "The Painted Ladies are easily seen from a short walk through Alamo Square. Some people brought picnics and sat around the grass areas; others walked through for a quick picture in front of the known houses. The area is easily accessible and tourist friendly."], ["Reviewed August 7, 2017", 3.0, "Ok", "Came here via cab, ok for a few photos, opposite a small park with kids playground.with quite a lot of tourist still not a lot to see."], ["Reviewed August 6, 2017", 4.0, "Good but construction work in the park", "At the end of the day this is a row of old houses in pastel colours. I felt we had to visit this famous location on our trip and was pleasantly surprised by the view. It was a beautiful day too but sadly the park opposite had construction work going on which somewhat compromised the view.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Painted Ladies Nostalgia", "The \"middle class\" Victorian homes made famous by the Full House show are there to behold in their full splendor. Lovely stop on a tour. Tip if you go to the top of th e hill you'll catch a nice photo of the houses with the San Francisco skyline in the background.\nShow less"], ["Reviewed August 4, 2017", 3.0, "Worth a visit", "Houses were on our list bit disappointed with the houses as not as many as I thought but worth a visit .to be fair it was overcast so if the sun was out and you could sit and have a picnic it woyld be nice"], ["Reviewed July 31, 2017", 3.0, "Iconic", "You have probably seen this iconic set of buildings in 90's shows like Full House. A collection of beautiful architecture.\n\nIt's a \"nice to see once\" kind of thing, and I wouldn't go out of my way to see them, but if you're close by give it a go.\nShow less"], ["Reviewed July 30, 2017", 5.0, "A touristy attraction, but a nice place to sit and relax", "Alamo Square is a great place to plant yourself on the grass and take a few photos of the painted ladies. The parking around here is pretty easy to deal with on the street, and the houses are well manicured and worthy of a few photos.\nShow less"], ["Reviewed July 30, 2017", 4.0, "Cool view and great park / playground", "Great sunny day out in July at the playground opposite the painted ladies. It's worth an Uber up to this area and then a walk down Hayes St as it's a cool neighbourhood."], ["Reviewed July 28, 2017", 5.0, "this was neat", "We took a Lyft to see the Painted Ladies when visiting San Francisco. We went in the evening. It was one of the coolest things we did in SF. First of all the Lyft dropped us off and there are lots of people in the park across the street all reenacting the picnic scene from Full House. As the fog started to roll in the park was a beautiful place to be. It was like standing in a cloud. We walked all around. It was just such a beautiful part of San Francisco to see.\nShow less"], ["Reviewed July 27, 2017", 4.0, "Worth seeing once, but that's it", "These homes are iconic for the city are beautifully restored. They have been featured on TV and movies so if you're into that sort of thing, it's cool to go and say you've been there. You get a nice view of downtown San Francisco as well. I've been there, seen it, won't return if we're ever in the city again, however.\nThat said, parking is Very hard to find. Alamo Square park is directly across the street from the Painted Ladies and it's a nice little park to have a picnic, take a nap on a blanket, or just hang out with family or friends....which is what most everyone was doing. You'll need to climb some stairs to get up off the street and up to the grassy area. There's a dog park up over the hill as well. The bathrooms are nightmarishly filthy...yuck.\nShow less"], ["Reviewed July 26, 2017", 3.0, "nothing special", "It was the strangest thing..the tour bus said to get off at this park and see these houses so we did. Tons of people were picnicking and staring at these houses. It was really weird. There was nothing special about these houses. I don't get it. I feel sorry for the people who live there having people staring into their front windows all day. They aren't even painted brightly. We have these kind of houses in every historical city. Am I missing something?\nShow less"], ["Reviewed July 25, 2017", 4.0, "Beautiful houses and cityspape backdrop", "My family of four (kids aged 10 and 12) came here after our arrival on a long flight. We had time before we could check into our AirBnB so we made a stop here. We were lucky enough to find a parking spot directly across the street from the houses, on the park side. The park was teeming with like-minded people taking their own pictures of these iconic houses.\n\nWe posed, took pictures, and used the bathrooms (gross but usuable) at the playground. The kids played for a few minutes at the playground but it was really for younger children. Beautiful views of the city and the TransAmerica Pyramid from the park.\n\nI had read numerous reports here about car break-ins and thefts. Luckily, we were not affected, but take the crime problem into consideration if you decide to visit.\nShow less"], ["Reviewed July 23, 2017", 3.0, "Been there, don't feel like I need to go back", "I have grown up visiting San Fran but have never made it to this iconic spot. The park across the street is Alamo Square which has great views of the Painted Ladies and is a good spot to take pics. They are beautiful and worth a stop but I don't feel like I need to go back for future visits.\nShow less"], ["Reviewed July 22, 2017", 1.0, "Up to 70 car break ins PER DAY!!! Don't leave a car unattended!", "Totally anticlimactic and VERY unsafe location. We parked for 15 minutes in front of over 100 tourists taking pictures, and our window was smashed and my 10 year old son's backpack was stolen with his lifelong favorite stuffed Curious George. Police say there can be up to 70 break ins PER DAY in that area. We saw 3 in the hour we dealt with our issue.\n\nTOURISTS AVOID!!!!!\nShow less"], ["Reviewed July 22, 2017", 5.0, "Must stop in San Fran!", "Very easy to find and visit, you can park and hang at the public park across the street and get some great views. Both of the city and the painted ladies. The houses look phenomenal and you can see them without getting that one theme song in your head, you know the one!!\nShow less"], ["Reviewed July 20, 2017", 4.0, "Iconic", "These old Victorian & Edwardian houses look simply stunning. They are familiar from various TV series & films and might be the most photographed sight in SFO. Just check them out."], ["Reviewed July 19, 2017", 3.0, "Iconic from Films and TV", "I know they are pretty iconic when you think of the city, thanks to their appearance in numerous films and TV shows but they sadly werent really that interesting in person. We saw them whilst on the hop on hop off bus tour and didn't actually bother getting off the bus as they are simply some painted buildings, not even very unique to be honest. If your interested in the film locations angle then great, but I don't think they are worth making the effort to see if you are tight on time in the city\nShow less"], ["Reviewed July 18, 2017", 3.0, "Painted Ladies of San Fransisco", "Well, I know that Painted ladies on Steiner St is probably one of the most featured, most popular and dearest landmarks of SF. But, to me, it's just 7 houses painted in different colours.\n\nBut however if we visit SF, again, our visit wouldn't be complete if you do not visit these seven victorian houses. But, once is enough.And try to dig some historical backround and fun facts about it prior to your visit.\n\n15 minutes is just enough to enjoy and photograph painted ladies unless you wanna do picnic on Alamo Square which is right in front of the houses. A public toilet is located in the square. But it's not that clean. If you travel with kids, and your kids are not into the houses, just take them to the play ground at Alamo Square.\n\nFor tourists who come with big tourist buses, normally bus will drop you off & pick you up at the intersection of Fell St & Pierce St. Then, you have to walk up to the right at Pierce St towards The Alamo Square. Once, you reach Alamo Square, voila, you'll find Painted ladies on you right at Steiner St.\nShow less"], ["Reviewed July 17, 2017", 4.0, "You Got it Dude", "I will honestly say that there isn't much to the Painted Ladies but if you grew up watching Full House, you won't care. I had to hop in an Uber and climb that damn hill just to see the exact angle at which the opening scene from Full House was filmed. I can say that it wasn't as vibrant as what I remember from the show and I didn't get the exact angle but it was still magical. I loved it. I would do it again. It was free and easy to do so, why not?\nShow less"], ["Reviewed July 17, 2017", 4.0, "An American icon", "What a joy to go see the houses, my family wasn't particularly interested, but honored me for the stop. Beautiful homes & park, so glad I made it a priority!"], ["Reviewed July 14, 2017", 2.0, "Nothing spectacular", "We were headed to Golden Gate Park so we made a side trip to find the six houses. They were pretty average houses not nearly as bright as I expected them to be, not really worth the time or effort to find them."], ["Reviewed July 13, 2017", 3.0, "Painted ladies (watch for crime)", "Well the painted ladies are worth the drive for the scenery. Alamo Park across the street is nice for a quick walk and there is a fun playground for kids to play. HOWEVER your car will likely get broken into (as ours did and I have read other reviews that have had this happen). We had a small picnic lunch bag they took. So maybe just drive it if you don't want to deal with insurance issues. Police don't come out for smash & grabs. They make you dial 311 to file a report. Good luck.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Worth exploring more of the ladies", "The story and inhabitant of this houses is quite interesting, but the overall story of how the western addition came to be, even more. You will find equally or more beautiful Victorian homes scattered around the city, some actually moved there when the area was deemed needing a \"renovation\" that just happened to chase the poor to benefit the rich. The setting in front of the park is spectacular\nShow less"], ["Reviewed July 11, 2017", 5.0, "Fun", "The park was pretty crowded and hard to find a parking spot, but totally worth the effort. My sister and I are big Full House fans so this was the perfect end to our San Francisco trip."], ["Reviewed July 9, 2017", 2.0, "Waste of time. They're not even that cool", "My husband says they're neat because there was so much craftsmanship that went into these cookie-cutter homes. I wasn't, however, as impressed. The park across from the Painted Ladies was filled with a bunch of pot-smokers waiting for the 4th of July fireworks when we visited. I think it was a waste of time, but maybe if I knew more about them or their history I would think it a cooler experience.\nShow less"], ["Reviewed July 9, 2017", 3.0, "Worth a quick stop if you're in the area", "On a recent trip with my sisters to San Francisco, we headed for the painted ladies, down near Alamo Park. We admired the intricate detail work on these beautiful Victorian-style houses while humming the Full House theme song. We also walked around Alamo Park a bit, as there are interesting houses to see on every side.\n\nWorth a quick stop if you're in the area. Better on a pretty day, as you're outside on a wind-swept hill.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Wonderful wine tour", "Unique and fun wine tour. Love the VW vans. Highly recommend. They went above and beyond to make sure we had an awesome time!!"], ["Reviewed July 8, 2017", 5.0, "Beautiful restored homes", "Sat in the park and gazed at the Painted Ladies as well as other homes in the neighborhood. The detailing is exquisite."], ["Reviewed July 7, 2017", 4.0, "Spectacular sight of old and new San Francisco", "Worth taking a look at to get some spectacular views of the modern skyscraper bearing San Francisco with the beautiful painted ladies houses in the foreground."], ["Reviewed July 6, 2017", 4.0, "Good option", "I think this is better than some of the more touristy spots like fishermans wharf or pier 39. The views are amazing and it's actually a pretty tranquil spot. If you have kids with you there is a nice playground with views of the painted ladies and the city. It's really clean to especially compared to some of the more touristy locations. Check it out if it's close, I wouldn't spend a lot of time getting there however.\nShow less"], ["Reviewed July 6, 2017", 4.0, "Nice View", "Nice little park nearby with a great view of the city on a clear day. Worth a short stop. Its great for a family with kids as there is a gated playground. The houses themselves are interesting and very photogenic."], ["Reviewed July 6, 2017", 3.0, "Playground in Alamo Square", "We were stopping over to take the very touristy picture of the painted ladies but ended up staying for a while so the kids could play on the playground in Alamo square. Alamo square is very nice and peaceful. It was a good way to spend 30 minutes and let the kids just be kids for a bit.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Sentimental Value, Pop-Over Stop", "We aren't really the picnicking type and my husband didn't really have a strong opinion either way about seeing the houses, so we stopped by in our uber while we were on our way to another destination so I could pop-out and take a few pictures for sentimental value (#fullhousefans). Iconic view of the houses for those who recognize them from TV and movie scenes.\n\nAlamo park seems nice and is no longer under construction so maybe a nice picnic spot.\nShow less"], ["Reviewed July 1, 2017", 5.0, "Picture Taking Opportunities", "These beautiful homes are displayed in the opening credits of the tv series Full House. Some people think one of these houses is the home used in the show. The actual Full House Home is on a different street.\n\nThese homes are directly across from the Alamo Square (a park).\n\nHere are some tips to consider:\n1. Parking is free all around the park if you can find a spot.\n2. The best picture taking is on the Alamo Square on top of the hill directly in front of the Painted Ladies.\n3. Nearest public restroom is at Alamo Square facing the Painted ladies.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Cool little street.", "We visited around 11am and got some great photos from the park opposite with the city background in the back drop. Put simply these are a must when in San Francisco!"], ["Reviewed June 27, 2017", 4.0, "The visit is worth it", "You have to go to Alamo Square to see the Painted Ladies and there is nothing else to see or go close to this Square but the visit is worth it. There are people living in these houses but you can approach them."], ["Reviewed June 26, 2017", 2.0, "Theft and Vandelism issues", "Went there today with the kids to take a pic in front of the Painted Ladies and to use the washroom at Alamo Square. They don't make it easy to find parking-blocked off for the most part. Managed to find a spot. Was there for 10 min. Washrooms were disgusting. Park was great and Painted Ladies and their SF city backdrop was beautiful. Great photo ops for Full House fans. Like I said, 10 min later, went back to our car and the back windshield was smashed. Stolen were 3 of our backpacks-thank God I had our passports on me. Noticed shards of broken glass along the same street. Read reviews that this has happened to many others. Why aren't police patrolling this area? No police were in site. We hung around and tried to get through on the phone- no luck. Drove to Richmond Police station to file a report. What an upsetting way to finish off an otherwise great visit from Toronto. Although the weather and many parts of the city are great, it was a reminder of the crime issue and massive homeless/drug problems that exist. I wish better precautions would be taken by law enforcement considering this is a very common problem tourists encounter in the city. Please protect your tourists San Francisco!\nShow less"], ["Reviewed June 23, 2017", 1.0, "Terrible theft in the area", "We parked on the street and got out of our car for 10 minutes to snap a photo of the infamous painted ladies. When we came back, someone broke our car window and stole two bags from the car. Two other cars were broken into around us. After walking around the park, we realized this happens ALL the time. Broken glass lined the street. There is a police station 2 blocks away, yet, don't do more to prevent crime. They stole our child's backpack with his baby blanket. Very unfortunate.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Beautiful reminders is San Francisco past", "They don't build them like this today, but the Painted Ladies are beautiful reminders of San Francisco's past and the way that San Francisco meshes its past with the scant garde.\n\nThings like this don't just happen. Credit to those who replaced the old Navy Gray paint once popular because it was cheap. The paint and blend of color is a pleasure to the eye.\nShow less"], ["Reviewed June 14, 2017", 1.0, "Not worth the trip unless you really enjoyed Full House", "While esthetically pleasant, stopping by to see these houses is not worth the trip. It was more entertaining to watch the hundreds of people sitting in the adjacent park mesmerized by the houses. I guess if you are a super fan of Full House it's ok. Otherwise spend your time elsewhere.\nShow less"], ["Reviewed June 10, 2017", 2.0, "Undergoing Reno", "WE went in April and the whole Alamo Square opposite was closed to renovations so it was disappointing we could't sit in the park and enjoy the view. The houses and street was amazing though. Not easy to get to go either by public transport."], ["Reviewed June 9, 2017", 5.0, "Gorgeous homes in a beautiful neighborhood. Unlike any other", "We went to see the Painted Ladies during a recent trip to San Francisco and felt it was worth the drive. The homes were beautiful and the other homes in the neighborhood were equally as exquisite. We felt it was worth the drive. I have included a photo.\nShow less"], ["Reviewed June 4, 2017", 4.0, "Only architecture lovers will like this", "It's very hilly in this area so it was hard for my mom to hike up the hill to get a good view of the city over the rooftops. The alamo square park was closed due to remodeling and an upcoming event but they left a small corner for people to go to look. Most of the houses surrounding that whole park were very beautiful. I walked almost all the way around the park and admired each house I saw. There were a few shops a couple blocks away along with a few restaurants. Very nice area.\nShow less"], ["Reviewed June 1, 2017", 5.0, "Painted Ladies Better Than Expected", "I expected to get to the hill take a couple pictures and then head out. But it is actually an awesome view all around, especially the painted ladies with skyline in background. Grab a seat and enjoy."], ["Reviewed June 1, 2017", 5.0, "Great Spot for Photos", "This is definitely a must-see especially in great weather! When I visited in November 2016, the park in front of the Painted Ladies was closed for renovation. Check before you go if the park is open because that's the best place you can take photos and enjoy the view.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Fun trip!", "Quick ride on the city bus to catch a picture. A must do in San Francisco! Some construction in the park, but still able to get a great view."], ["Reviewed May 19, 2017", 1.0, "Nothing much to see", "There are only a handful of victorian houses to see at the address mentioned. I did not really find it worth a great deal."], ["Reviewed May 18, 2017", 5.0, "Snap and go", "The Painted Ladies (aka the Full House) are pretty self explanatory. At this time the Alamo park is under construction or some minor remodeling, but one can still take advantage of the view. I'd imagine that when the park is not under construction that people gather around and have picnics as this would be the perfect place to do so.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Great photo op!", "Nice little park in front of the houses. Houses in beautiful colors. San Francisco is definitely a place one should go visit on their bucket list! Food is Excellent! Such a variety of it! I lived in San Francisco years ago and this was one place I made sure to see.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Very Cool!", "here's another free sight to take advantage of. Cool architecture, iconic photo-ops, nice park to relax in (it was closed when we were there). And the houses around the block are cool too."], ["Reviewed May 13, 2017", 3.0, "Iconic view but nothing more than a photo", "Whilst the houses are lovely you will only spend a few minutes here unless you take advantage of the green area up the road (looking down onto the houses). Here you can sit and take in the vista. They are beautifully painted and upkept and make a nice picture but not a lot more to see here. Best to do this as a stop off - perhaps if taking a bus tour or on the way to something else.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Cute Historical Houses", "What a cuties this Ladies!!! Small houses painted in beautiful colors, in Steiner Street, near Alamo Square. Beatiful view of the city, with skyscrapers on the back."], ["Reviewed May 8, 2017", 4.0, "Iconic view", "One of those iconic views that need to be seen as part of a visit to SF, easy to reach by bus, and there is a large park opposite from which to view and photograph the buildings without upsetting the occupants.\n\nWon't take long to visit but definitely worth including on any planned visit to the city\nShow less"], ["Reviewed May 7, 2017", 5.0, "San Francisco Eye Candy!!", "You've seen these Painted Ladies everywhere through the years. Postcards, posters, stationary, Movies, commercials, on and on. But if you have a chance to see them in person, now that's the best!"], ["Reviewed May 6, 2017", 4.0, "Grand old Ladies", "A classic site but work on the park limited the view. A quick visit to these grand old houses is worth it. to admire the great architecture of these unique houses. Its a quick drive from downtown"], ["Reviewed May 5, 2017", 4.0, "Just go see it! Cool view of the bay from the park.", "I will admit, the main reason motivating my visit was the fact I was a Full House fan as a kid, but the houses are beautiful. Do a little research on them before going and you'll find it even more enjoyable when you get there. Lots of history. Don't let any snark guy walking by tell you any different. ; )\nShow less"], ["Reviewed April 30, 2017", 4.0, "Beautiful old buildings", "These beautiful old buildings are well maintained Victorian houses, colorfully painted and make a pretty picture against the back drop of San Francisco. Easy to get to by pubic transport or drive to. An iconic spot to take photos."], ["Reviewed April 28, 2017", 3.0, "The Painted Ladies", "This is one of the main attractions in San Francisco. Very easy to find. Having not seen the television show \"Full House\", I didn't really see the fascination with this, apart from the buildings themselves."], ["Reviewed April 26, 2017", 3.0, "Nostalgic with a good history.", "Visiting the painted ladies was a \"full house\" nostalgia moment. It really wasn't much else. You can get a good view from the park across the street. However the park was closed when we visited so we could only stand on the edge of the hill. If you read about the houses they have a neat history. I wouldn't make this attraction a top one unless you were a fanatic of \"full house\"\nShow less"], ["Reviewed April 25, 2017", 5.0, "Pretty ladies", "If your in San Francisco this is one of the main attractions. Easy to find and the pretty little painted ladies are a lovely site to see. Great photo opportunity."], ["Reviewed April 24, 2017", 4.0, "Interesting", "There are plenty of nice houses there. Perhaps it's the history behind it that makes it stand out. Great to take a tram ride or bus ride to go around the neighbourhood to explore the area."], ["Reviewed April 23, 2017", 5.0, "Full House Nostalgia", "I was never a fan of the Full House television series, but I seem to be in the minority. There was a ton of people taking pictures and selfies of this row of houses and it's sure to get worse once they have opened the park.\n\nThe park next to this row of homes is currently under construction and limits some of the foot traffic per the tour guide. However, there was a little patch of grass available for pictures of the houses and there had to have been 200 people taking pictures.\n\nThe houses and History were interesting, even if you are not a fan of the TV show. They were beautiful homes and neighborhood with some scenic views of the bays in the background.\nShow less"], ["Reviewed April 19, 2017", 5.0, "The Painted Ladies of San Francisco", "I had to come see the Painted Ladies while I was in San Francisco! Growing up as a fan of Full house (tv show) I always said to myself, \"one day, when I make it to America I'm going to make sure I stop to see and appreciate the Ladies in all their glory!\"\nShow less"], ["Reviewed April 12, 2017", 4.0, "Nice architecture", "Nice architecture, beautifully painted. Something to see if your in the area. Not much time needed for viewing."], ["Reviewed April 10, 2017", 4.0, "Nice houses", "Typical San Francisco houses in different colours, climbing the street. Worth seeing, nice overview of San Francisco to."], ["Reviewed April 8, 2017", 3.0, "Decent", "If you're in the area, drive by. Not somewhere you need to plan into your vacation. Nothing to do here. Only cool for a couple of pictures and that's it. If you're passing by, stop and take some pictures, but there's not really a reason to go out of your way to see it. Google images has better views than tourists have access to.\nShow less"], ["Reviewed April 8, 2017", 4.0, "Full House, house!", "Loved!! I grew up watching Full House, so seeing the ladies was a must! A quick 2 mile walk from the Omni Hotel, where we stayed!"], ["Reviewed April 6, 2017", 5.0, "Beautiful Houses", "Beautiful architecture and fun history of the Painted Ladies. All homes in the area are beautiful! The park was closed when we were there, but would be a great place to have a picnic and enjoy the surroundings."], ["Reviewed April 5, 2017", 4.0, "A long way for a picture", "It's exactly what you expect it to be. Worth seeing if you have a car or are in the area. Might have been nicer had the park across the street been open (it was completely fenced off for construction). You don't need more than a couple of minutes here.\nShow less"], ["Reviewed April 2, 2017", 3.0, "There are LOTS of pretty houses in SF. There are just a few.", "I remember seeing a few episodes of Full House back in the day, so it was fun to see the houses. That said, look around and you will see LOTS of houses of this same style that are beautifully painted. (Some of the park across the street is closed for renovations right now.)\nShow less"], ["Reviewed March 29, 2017", 4.0, "Despite renovations in Alamo Square Park, still a nice view", "During the time of our visit, the park ws undergoing a renovation, causing it to be closed. Fortunately, there was a viewing area where the Painted Ladies could be seen, against the backdrop of downtown San Francisco. Be aware that the renovation work will last until about mid-April 2017. The best time to see the painted ladies, is mid-afternoon, as the facades of the houses are in the shade in the morning\nShow less"], ["Reviewed March 29, 2017", 5.0, "Amazing", "The Painted Ladies are beautiful, the Alamo park is under construction, but they have an area for people to take pictures, there is parking along the park, so you can just pull up, park and take pictures, a must see in San Francisco."], ["Reviewed March 27, 2017", 4.0, "If You're Looking for The Tanner's", "Like most teens, my daughters wanted to see the \"Full House - House\" while in SF. That's at 1709 Broderick Street. Set your GPS, and you can skip the rest of this attraction. That house is owned by the Fuller House production company, has a marker out front telling you which one, and is the famous front of the house we all know and love. There will be a crowd out front waiting to take their pictures on the steps. No organization or fee, so it's all reliant on good manners. To both each other and the surrounding REAL homes. No parking, so most just pull over as far as they can and put the hazards on, and the kids can jump out and get their pics as fast as possible. That's illegal of course, so make sure one remains behind the wheel to quickly move if necessary. Just drive around the block. Worth the effort for the unique photo-op!\nShow less"], ["Reviewed March 24, 2017", 4.0, "The Full House experience", "I confess when my friend took me here I had no idea why we'd gone. I mean they were nice but we'd seen other gorgeous houses but as i stood on the hill I got it. The park was closed for work but as we walked along the path a car drove past blasting the Full House theme which was hilarious. It's worth going to see a piece of TV history.\nShow less"], ["Reviewed March 23, 2017", 3.0, "Nice for a quick stop", "It is a nice view of the houses. Doesn't take long and its free. Currently they are doing construction on the park across from the houses."], ["Reviewed March 23, 2017", 5.0, "Spring Break Trip", "We were fortunate to get a pretty, sunny day. It was a bit traffic crowded along street to get the photos I'd like to have had but it was still a fun spot to see. The girls loved the iconic row houses."], ["Reviewed March 23, 2017", 3.0, "Pretty Views", "They are beautiful houses an in the background one has a lovely view of the San Francisco skyline. Alamo Square features some of San Francisco's best preserved architecture. Unfortunately there has been an invasion of tour buses."], ["Reviewed March 18, 2017", 2.0, "Not worth the trip", "This was really disappointing. Changed my original plan to visit Haight Ashbury by Crissy Field, etc and went to this section instead to see the houses. Oops! Big mistake.\n\nYes, there were very nice houses with interesting and ornate construction. There were also a couple of good photo ops from the front of the closed small park. So after ten minutes of that, what next? Nothing. We wandered a bit and ended up at a neat little lunch spot for a beer, but it was a waste of an Uber to get there and back.\n\nIf you have a rental car, and want to drive by, have at it. Otherwise, see any of the other great things in San Francisco.\nShow less"], ["Reviewed March 16, 2017", 3.0, "Cute homes, but not much going on", "The few homes on this row have some amazing architecture, but it wasn't that exciting to me. We ended up walking another 20 min to find the Full House house and that was worth it to see. Much more fun for me than 4 random houses.\nShow less"], ["Reviewed March 16, 2017", 2.0, "Park currently under construction", "There's not a good way to get an unobstructed view right now due to the construction of the park across the street. Go re-enact the beginning of Full House, but the houses are just people's homes."], ["Reviewed March 14, 2017", 5.0, "Amazing homes", "I am so glad we visited the painted ladies. I love Full House! And now Fuller House!!! We all relived the times when we watched the series as we sat at the park across the street. The park is under going construction so we couldn't sit right across the street but it was good enough. All I can say is it's beautiful and having a picnic across the street would have been perfect however we didn't have time to do that.\nShow less"], ["Reviewed March 14, 2017", 2.0, "Eh...", "If killing time do a drive by. But no need to go out of your way unless it's a must see for you personally."], ["Reviewed March 14, 2017", 5.0, "See the ladies!", "Beautiful and Iconic homes! You've seen them on TV and now it's time to see them in person! We were so blessed to meet one of the owners of these beautiful homes and get some of the history. It was really cool to see this popular scenery! Don't miss it if you can help it. It stunk that they were remodeling the park which was also made famous by the Full House sitcom. But still worth the visit! The bonus is that it's FREE!!!\nShow less"], ["Reviewed March 9, 2017", 4.0, "Beautiful ladies", "Really beautiful houses. Be sure to take your camera with you. Finding a parking spot nearby can a bit difficult."], ["Reviewed March 8, 2017", 3.0, "There are many more lovely houses in the city than these.", "One of the many places we stopped at in 4 days in the city, and the one that least appealed to me and was our shortest stop, but M'Lady wanted to go, and we were on honeymoon so who am I to argue?\n\nOk, so now the good bits, these houses are very iconic and have a history & background which is worth finding out about (we listened in to a tour guide). They also cost stupidly large amounts of money if they come up for sale. Unfortunately the park opposite was under renovation, so we didn't have anywhere to sit and enjoy the view.\n\nChances are you may well have seen then in a film or TV program based in the city at some point. They tend not to show the apartment block next door though!\n\nPersonally this is one row of houses I wouldn't want to live in, never mind the prices but too many damned tourists, including one couple having a photo-shoot on the steps of one of them.\n\nHowever, there are very many beautiful houses in the city (including just a few door up the hill) and having had a wander around on my own 5 years ago, I did find these a bit boring in comparison. They are also very similar in design.\n\nBut, if you are on a tour that takes them in, then great, but I wouldn't go out of my way to see them again.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Seven Sisters of Haight Ashbury.", "We really think the Painted Ladies are wonderful. Located across from Alamo Square (ongoing construction in park), the Painted Ladies are a row of seven colorful, Queen Anne-style, Victorian houses. All are private homes and not available for touring but the exteriors are truly awesome. Among the architectural features, they all include beautifully intricate stained-glass windows, bay windows & gingerbread gables. Great visit just wandering down the street and closely inspecting the exterior of each house.\nShow less"], ["Reviewed March 1, 2017", 4.0, "Beautiful", "These houses are the typical icons of San Francisco. Seen in numerous movies. We made the walk up the hill to the park overlooking the Painted Ladies and they are beautiful. They are a must see if you visit San Francisco"], ["Reviewed February 26, 2017", 3.0, "Pretty", "Love the houses, park was under renovation so couldn't sit and view, not as vivid as I thought, but still nice to visit."], ["Reviewed February 23, 2017", 3.0, "Cut.. it.. out.......of your itinerary.", "The houses are quite nice, and I realize it was a touristy thing to do, but who doesn't love full house nostalgia. However, the park across the street which gives you a good vantage point for pictures, is closed and you really can't get a good picture or look of the city behind them. It was underwhelming anyway.\nShow less"], ["Reviewed February 20, 2017", 4.0, "Nice unique place to go and see", "One of those things that each city has that you should go and see and the Painted Ladies is one of them. Yes its just houses but there is a nice park opposite them to take in the view of the city."], ["Reviewed February 13, 2017", 5.0, "Part of San Francisco's History and Charm", "This is really a drive-by attraction, but worth experiencing at least once, like Lombard Street. None of the Ladies are open for tours as they are all private homes. Alamo Square Park is right across the street where you can sit to take in their beauty and contemplates SF life during that era. If you are a \"Full House\" fan, the fictional Tanner Family lived near by (about 1 mile away) at 1709 Broadrick. My 17-year old granddaughter loved finding the Tanner house.\nShow less"], ["Reviewed February 11, 2017", 3.0, "Kind of boring", "The only reason people cum here is because of the Full House tv program. Not much to do once you have seen them"], ["Reviewed February 10, 2017", 5.0, "Painted ladies", "One of the most beutiful and well keep neighborhoods in United States. You may have to search around for parking, but is totally worth it."], ["Reviewed February 8, 2017", 4.0, "Great visual appeal", "It was great to see the Victorian houses and the setup was absolutely great\n\nI fact housing around the entire block for really nice and pleasant. All houses look awesome and are very well maintained\n\nI have traveled a lot to Europe in the past and it did give u the European feel\nShow less"], ["Reviewed February 7, 2017", 4.0, "As Long as your Here!", "We drove to the park across the street from The Painted Ladies. Girls loved this! Very lovely with San Francisco back drop. Kids got lots of selfies here. Enjoy!"], ["Reviewed February 4, 2017", 5.0, "Must see", "Really cool to see. Just like in the movies. Really busy though. These are actually people's homes which is crazy. Don't need any forward planning you can just show up"], ["Reviewed February 2, 2017", 3.0, "Colorful homes", "Beautiful, colorful homes. If you have the time, take an early morning walk here for a quick view. Postcard views indeed. But it is not a must-see place"], ["Reviewed February 2, 2017", 3.0, "Busy", "This is one busy street to see these beautiful homes. Be careful with the huge RVs trying to park to come see this. Too many tourists"], ["Reviewed February 1, 2017", 1.0, "Don't waste an uber or cab fare", "Underwhelmed to say the least. If I'd have walked there I'd probably just be disappointed but we were too far away so took an uber. We were expecting this amazing street on a hill with beautifully painted houses. It's a little street with a small number of painted houses!! There are loads of similar design houses across SF and some painted ones as well. Just walk round some of the neighbourhoods you are near unless you are close enough to walk.\nShow less"], ["Reviewed February 1, 2017", 2.0, "Not worth it", "It was inconvenient to get there, had nothing else nearby to do, and just wasn't much to look at. It might be more worthwhile if you are driving a car instead of taking the bus."], ["Reviewed February 1, 2017", 5.0, "Just like the movies!", "It is just like the movies seeing this! Alamo Park - across the street - is currently under construction/renovation - so it makes it a little difficult to take pictures, but it still can be done. Very cool to see these homes in person - they are beautiful. While you're there, take a look at the other homes in the area. The architecture is gorgeous. Please note, these are near the top of the hill - so you will have to walk UP from wherever you're coming....\nShow less"], ["Reviewed January 27, 2017", 1.0, "Construction everywhere!", "We were so disappointed to visit the Painted Ladies and see the entire park across the street all gated up and under construction. The whole point of visiting this area is to 1) get an awesome photo of the houses with the city in the background, and 2) visit the park that's featured during the opening credits of Full House. Well right now you can't do either. The sign said it would be done by winter 2016 and to be honest, there didn't look like much was going on behind the fences anymore. I'm not sure why people are denied access to the entire park!!! Our only option was to take photos up close just across the street. But it was garbage pickup day so the houses all had a few big garbage cans out front and there were trucks parked in front. All around a disappointing part of our trip that we were really looking forward to.\nShow less"], ["Reviewed January 25, 2017", 4.0, "Currently park under construction", "If you can come back to San Francisco I would wait to see the Painted Ladies later as the park across the street (the one they show in Full House) is currently under construction and the pictures came out with the construction fence. Other than that it will be a lovely tourist attraction once it's finished.\nShow less"], ["Reviewed January 25, 2017", 3.0, "OK, not a must, there are nicer", "First of all I must warn travelers that Alamo Sq is under renovation currently, there's a fence around and only a small part is left for catching these 7 ladies.\nSecond, if you came only for houses, there are far more beautiful around SF (N and S of Haight St specially).\nBest thing about the Ladies is the contrast panorama with modern SF downtown high rises in the background.\nShow less"], ["Reviewed January 18, 2017", 4.0, "A must see!", "You can't go to San Francisco and not see what most people know as the Full House house. There are beautiful!"], ["Reviewed January 14, 2017", 4.0, "Good Victorian style", "Went for walk from UN plaza to painted ladies. It is five houses in Victorian architectures. Each house is painted in own colour and there are minor differences in external details."], ["Reviewed January 12, 2017", 3.0, "Don't bust a boiler", "To get here. Cute to see if you're in the neighbourhood, but there are some incredibly beautiful homes around the city. It's the 'houses plus city' backdrop that makes it picturesque so best on a sunny day."], ["Reviewed January 8, 2017", 5.0, "Strenuous Walk, but Worth It!", "The Painted Ladies are just in a normal neighborhood in San Francisco. Use Uber or walk to get there; the hills are tough, but there are park benches in Alamo Square to rest and enjoy the view of the homes, and of the city beyond."], ["Reviewed January 5, 2017", 4.0, "Cute Colourful Houses", "This is a quick stop on a tour of San Francisco. The park beside the houses is currently undergoing renovations so there isn't much green space where to sit and enjoy the view. There is a nice view of the city beyond the Painted Ladies. The houses are definitely cute and picturesque and worth a quick stop.\nShow less"], ["Reviewed January 4, 2017", 4.0, "Ahhhhh dj Tanner's house!", "Iconic local attraction. The park across the street is temporarily closed which would have made for some great photos. Plenty of tourists snapping pics , even going onto the steps of these homes. I don't recommend it, people actually live in these homes. Not much else in the area .\nShow less"], ["Reviewed December 29, 2016", 4.0, "Great for a quick drive by!", "My boys and I had just started watching the new fuller house on Netflix, so while in San Fran I knew this would be fun to see. The park across the street was under construction so it was tough to find parking and there were no bathrooms to use (check progress before going). It's not a long activity by Amy means but still a great drive by and worth a quick picture. You will be surrounded by other tourists doing exactly that.\nShow less"], ["Reviewed December 28, 2016", 2.0, "Not What it is cracked up to be", "We thought this was a \"must see\" in San Franciso. It is not. Pictures make the Painted Ladies look like they are across from a huge park when the park is really small. Houses looked nice, but not really that special"], ["Reviewed December 27, 2016", 4.0, "Drove by on business trip", "We rented a car on a business trip and specifically drove past the painted ladies. Really enjoyed seeing these old houses being taken care of so well!"], ["Reviewed December 26, 2016", 5.0, "Iconic", "Worth the visit these ladies are. Like most attractions in San Francisco make sure you use Uber or make some form of transportation to get there!"], ["Reviewed December 24, 2016", 5.0, "A jammin tour!", "Tour was great but what really made it special and unique was the custom music track that matched the stops- from Otis Redding to Hendrix. There are stories behind every stop and track. This is a must for your trip!"], ["Reviewed December 20, 2016", 5.0, "Best way to get acquainted with SAN Fran", "What a wonderful experience. Driving around with Antoine in his 1973 BW wagon was a unique way of learning about SF. He dove through all the main areas of the city and provided excellent info. He stopped at several locations for photos as well. Just a great time was had by all.\nShow less"], ["Reviewed December 20, 2016", 4.0, "Worth seeing", "House numbers 710ish on the street are the main spot and are truly beautiful if you pay attention to the architectural details of the Victorian/Edwardian houses. Really though thousands of these houses were built during the period so even during a business ride around/through the area, keep your eye out for several beautiful examples of the period.\nShow less"], ["Reviewed December 18, 2016", 5.0, "The most popular Victorians in the City", "The ‘Painted Ladies’ are the most popularly colored residential Victorian houses you will see in your tour through the city. Go to any souvenir shop around the city and you are likely to see a photo and postcards of these Victorians along with other popular tourist attraction photos of Golden Gate Bridge, Fisherman’s Wharf, Cable cars, antique Street cars, Coit Tower and more.\n\nThese ‘Ladies’ have been depicted in movies from Mrs. Doubtfire, Invasion of the Body Snatchers, to TV series Full House. A postcard sent from the city is not complete without one from postcard row of the Painted Ladies.\nShow less"], ["Reviewed December 17, 2016", 3.0, "Worth a look", "The Painted Ladies highlight some of the nice architecture in the area around Alamo Square, but are not the only houses like this in the area.\n\nWhen we were there in November they were doing work on the square so you could not enter all of it, but you can still get good photos of the painted ladies.\nShow less"], ["Reviewed December 17, 2016", 3.0, "Beautiful Buildings!", "The buildings are beautiful and it boasts magnificent architecture. Its a great tourist spot and a must see if you are in San Francisco as it's the epitome of the neighbourhood. When we went, the far west house was under construction so it hinders the beauty of the other painted ladies building. Parking is very limited around the area as well.\nShow less"], ["Reviewed December 16, 2016", 5.0, "Spectacular!! Beautiful!! Stunning Decorations!!", "Painted Ladies is a must see if you enjoy houses looking their finest! These ladies are all dolled up and are purely fun to view!"], ["Reviewed December 12, 2016", 1.0, "The area around Alamo Square is nice, but the Painted Ladies really are no more beautiful than the others in the area", "We walked around the area of Alamo Square - there are some great buildings and cafés and playgrounds. The Painted Ladies houses really don't look much different than many of the other houses in the area."], ["Reviewed December 6, 2016", 3.0, "Lovely Buildings", "The walk along the street was a lovely stroll and the houses were very pretty. There are some nice pictures to be taken along here"]]}}