{"Palace of Fine Arts Theatre": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Palace of Fine Arts Theatre", "url": "/Attraction_Review-g60713-d104538-Reviews-Palace_of_Fine_Arts_Theatre-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/8d/78/59/night-visit-what-a-difference.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "3968"}, "address": {"@type": "PostalAddress", "streetAddress": "3301 Lyon Street", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94123-1002", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Beautiful building", "One of my favorite place to visit when in San Francisco. Any photo of any angle of the building is beautiful, and you can even stay and hang out read a book. It's even more beautiful at night."], ["Reviewed 1 week ago", 3.0, "Nice to stop by if you're in the area", "Imposing structure, good for taking pictures and walking around the ground. Within walking distance from Crissy Field East Beach. There are also Palace Games on the grounds (which consist of 3 escape rooms)."], ["Reviewed 2 weeks ago", 3.0, "Beautiful", "This was a photo stop on our night bus tour. The views were nice and the architecture was gorgeous. We especially enjoyed being able to look up and see the stars in the night sky. Not worth spending more than 15 minutes or so however."], ["Reviewed 3 weeks ago", 5.0, "Stunning must stop", "We stopped here on a tour and loved it. It was an amazing historic place and had a lovely park area. I would definitely recommend going at dusk so you can get photos when the lights come on, its absolutely stunning at night."], ["Reviewed 3 weeks ago", 5.0, "Awesome Surprise", "We were headed back from a long walk from the ATT Park to Chrissy Field to watch the sun set behind the Golden Gate Bridge. Heading up to Marina Blvd, where I thought an Uber driver might find us I saw an interesting looking building. Decided that Uber and dinner could wait and walked to it. In the meantime the lights came on. It was magical. I can't speak to what it looks like in the day, but its other worldly at night. Very interesting place. And it's free! If you are anywhere near the area near Marina Boulevard it is well worth the trip.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Art of Serenity", "We only visited at night. We walked the grounds which were absolutely serene & beautiful. The art details are amazing."], ["Reviewed 3 weeks ago", 5.0, "Beautiful pkace", "This is a beautiful place to explore. It’s more like a nice park - there are many people walking, picnics, lots of people getting professional photos done. It’s still a great place to stop. Do the research on the history of the place before you go so you understand the meanings of certain aspects of the architecture.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Breathtaking", "Wonderful place full of amazing history and beautiful sightseeing. It is a nice place to spend the afternoon and get a little of the nostalgic feeling of the old San Francisco. I loved it"], ["Reviewed January 21, 2018", 5.0, "Great walk", "We visit just the exterior of the Palace but is truly a Visual pleasure to walk in this path ways, is full of great details the magnificent cupola is amazing is really a part of SF that we enjoy."], ["Reviewed January 21, 2018", 5.0, "Freeee and worth it", "Photos don't do this place justice! Its beautiful and an architectual masterpiece. If you have time definently go to the palace and stroll around."], ["Reviewed January 21, 2018", 4.0, "Great architecture", "Great architecture made up of a pergola around a central rotunda, with lagoons and walkways which are very relaxing (as long as there are not too many coachloads of tourists there at the same time)."], ["Reviewed January 17, 2018", 4.0, "A great place to relax and see superb buildings.", "It’s a great place to be sure. Walk about and relax. It is a must see for all. Not much to do other than walk about but it is a true beauty."], ["Reviewed January 16, 2018", 5.0, "Beautiful Site", "The architecture and design is amazing. It is an awesome sight to behold and we highly recommend taking the time to go see this beautiful part of SFO.\nThe Palace of fine of arts is a great place to take pictures or if you are an artist to photograph or draw/paint. A MUST SEE.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Now I Know Why it is Called Palace of Fine Arts", "As you marvel at the intricate design, architechture and lanscaping you'll know why it is called so. You will probably strain your neck looking at the ceiling and appreciate the ornate design before you. A must see for travellers and tourists!"], ["Reviewed January 10, 2018", 4.0, "Great for photos", "There is not much to do here other than to appreciate the architecture. It is a great spot for some nice photos. The best place to take a photo is across the lake so you can take in the entirety of the dome structure. I also experimented with some close up wide angle views and they also look good.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Nice architecture", "The Palace of Fine Arts is a beautiful stop in San Francisco. It is definitely best to visit on a dry/sunny day. The gardens surrounding the palace are pretty and nice to walk around. The architecture is gorgeous."], ["Reviewed January 7, 2018", 5.0, "Still can't get enough pictures!", "It was my second time to visit the Palace and I still can't get enough pictures! It was still stunning as ever! Though I am wiser this time - if you are looking for a restroom and the ones within the palace is not open (like in our case) - your best bet will be the Marina Green Restrooms West which is a short 10 minute walk in the direction of the beach along Yacht Road. We had to leave after a few hours because the crew was hungry, and good thing it was also a reasonable 10-15 minute walk to the restaurants at Lombard\nShow less"], ["Reviewed January 7, 2018", 5.0, "Like Being in Another Country!", "The Palace of Fine Arts Theatre was built for the Worlds Fair held long ago in San Francisco. It does not appear to serve much of a purpose now except for being a beautiful place to walk around outside. Being there makes you feel like you are in ancient Greece or Rome. It is a fantastic photo opportunity during a clear day. Serene place to visit, we enjoyed watching the ducks in the water. A fine place to rest after lots of SF sightseeing.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Beautiful architecture, lively and it's free", "Visited late afternoon on a Sunday. The low angle sun rays made this place even more majestic. We walked along the Marina Blvd to get there and our way got to see lots of nice houses with intense Christmas decoration as well. All sorts of activities were going on there: from couples dancing, brides having their photo shoots, people celebrating their birthdays and popping balloons, etc.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Beautiful place to visit", "There wasn't much on when I visited, but this place is just beautiful to walk around the gardens and see some of the architecture. I highly recommend popping past if you want to find a nice relaxing area to visit."], ["Reviewed January 3, 2018", 3.0, "Great place to take pictures.", "Cool place to see if in the area. Pack with lots of tourist. Water pond in the middle with vary pretty architecture."], ["Reviewed January 3, 2018", 4.0, "Picnicking and selfies", "This site is very beautifully maintained as it was part of a world's fair in 1915 and was only meant to last a year or so. It is a gorgeous place with plenty of photo opps.. In fact wedding photos were ing taken while we were there. A lot of tourists were just loitering around the structures picnicking or just taking selfies. 30 minutes is plenty of time if you just want to check it out.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Beautiful!", "Went in the evening time and it was so pretty. Didn’t feel like I was in SF. Highly recommend visiting and checking out."], ["Reviewed December 31, 2017", 4.0, "Beautiful photo spot", "Must visit after visiting Golden Gate bridge. Very beautiful photo spot in front of the lake. No public restrooms."], ["Reviewed December 26, 2017", 5.0, "Such a cool place.", "From the time I arrived in SF, this place was on my MUST SEE list. Unfortunately, as things would have it, I was forced to wait for a little, but the opportunity finally presented itself where I could take a walk down to the Marina and check out the palace, Crissy Field, and walk across the Golden Gate.\n\nWhen I set out on my adventure, the weather seemed lackluster lots of clouds and very chilly. However, I learned that's the finicky nature of San Fran, and by the time I reached the Marina, the clouds had given way to a beautiful blue sky.\n\nJust in the distance was the Palace. The moment I had been waiting for, and it didn't disappoint. I was early enough to beat the crowds. Allowing me the potential of taking some great shots.\n\nThis place is fantastic; it is an excellent piece architecture, nestled in the most exciting areas. Wedged between Presidio, The Golden Gate, and the Marina.\n\nThe pond was filled with birds, and the grounds were neatly kept and clean. Many of the other visitors were awestruck by this marvelous landmark as was I.\n\nI walked around the grounds collecting as many photos as I possibly could. Promising myself to come back during the twilight hours to see this it up at night. I haven't been back, but before I go, I'm going to make it in the evening to see it again.\n\nI highly recommend you check this place out. It will not disappoint. Bring your camera, and if you're feeling adventurous keep walking towards the bridge and you find some excellent angles along the way!\nShow less"], ["Reviewed December 25, 2017", 5.0, "Beautiful place", "Went for a stroll in the afternoon. The place is great for a walk, lots of nature and beautiful building and houses surrounding the palace."], ["Reviewed December 23, 2017", 5.0, "A must see!", "A beautiful structure and grounds with an interesting history. It is a nice place to walk around or take a picnic lunch. A lot of wedding pictures are taken here and it is fun to watch."], ["Reviewed December 21, 2017", 5.0, "Don't Miss This Beautiful FREE Attraction", "While I had considered going to this place before my trip, it hadn't made my short list due to time constraints. I was in a shared Lyft and when we pulled up here for the other passenger, I had to get out too. This place is breathtaking! There were a number of professional and amateur photographers taking pictures of families, couples, and Quinceanera celebrants with the fantastic weaving of classical architecture and natural elements in the background. Plus, since I was away from the hotel for a long day of sightseeing, I appreciated the free restrooms, and there was a small cafe.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Spectacular faux-Greek architecture", "Between Crissy Field and the Presidio is this fabulous collection of mock classical Greek buildings. Wonderful architecture and carvings. A great place for photographers."], ["Reviewed December 16, 2017", 5.0, "Gorgeous building with great architecture not too far from the Golden Gate Bridge.", "Awesome structure right in a neighborhood. It was quirky to see house across the street from this gorgeous building."], ["Reviewed December 15, 2017", 5.0, "Advice from a local!", "This is one of my favorite places to take folks who are visiting from out of town. Best times to visit are early mornings, early evenings or evenings when its all lite up. I highly recommend and i can't stress this enough, DO NOT PARK HERE!!! This area is notorious for car break ins. If you're visiting I recommend taking an uber/lyft or public transportation. Other than this place is great for picnics and photos.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Gorgeous", "Beautiful gorgeous building makes you feel as though you're walking through ancient Roman ruins. The building is also lit up at night so it's also worth coming and viewing in the evening as well."], ["Reviewed December 11, 2017", 5.0, "Very nice place", "Very nice place to visit. Clean and easy to find parking. Accessible for stroller. In maximum one hour it’s possible to see a lot of history architecture."], ["Reviewed December 4, 2017", 5.0, "During the day visit", "It feels very bizarre to have something of this architecture in its location. It is however a must see whilst in San Fran. Very European in style, well Greek. And nice for a walk."], ["Reviewed December 1, 2017", 5.0, "Breathtaking", "I had seen the structure from afar and wasn’t particularly impressed. Being there is a whole different story. The columns are so tall that they remind you of the Redwoods. The embellishments are sophisticated and well placed. A beautiful setting didn’t hurt either."], ["Reviewed November 29, 2017", 5.0, "A Step Back In Time- Amazing!!", "We had no intention of visiting here but it happened to be on a tour that we attended. Wow!! We are certainly glad it stopped here. It's like you stepped back in time and are in an ancient Roman ruin. There are Roman columns sort of half standing in the back as well as the fabulous arch structure you see in all the pictures. Beautiful, peaceful, water surrounding the structures with swans and ducks. Right in the middle of San Francisco. Apparently this was originally built out of paper mache type of materials for the 1915 Panama-Pacific Expo. Everyone loved it and after the expo it was rebuilt in concrete.\n\nAbsolutely amazing. A must see!! Don't miss it!!\nShow less"], ["Reviewed November 27, 2017", 5.0, "Beautiful", "Loved the view. Took a bunch of photos of all the monuments and great scenery. Great sight seeing for tourists to visit. Looks perfect for wedding pictures or any type of professional pictures"], ["Reviewed November 26, 2017", 5.0, "Beautiful!", "Been there as part of our tour in San Francisco. This is truely a magnificent place to walk or just seat and appreciate the beauty of arts. Lovely place for pictorial specially for pre nuptial, family or debut photos."], ["Reviewed November 25, 2017", 4.0, "So magnificent and beautiful at night", "We went at night and it was so romantic. There are more activities in the day, but I was so mesmerized by its night view."], ["Reviewed November 11, 2017", 4.0, "Lovely place for spending couple of hours", "I discovered this place by accident as it was on our bike tour. It is a located in a very nice part of San Francisco and is quite old as it was built for the 1915 exposition in SF. The architecture is classical Greco-Roman style. With its domes, columns, tranquil lake and picturesque views, it is no surprise that this is a very popular spot for weddings. You can easily spend couple of hours here just relaxing or leisurely walking. And it is completely free !\nShow less"], ["Reviewed November 8, 2017", 3.0, "Beautiful remnant of the 1915 Expo", "Very nice for a quick stop. The hundred year old structure of Beaux-Arts style.\nBe very careful to take your valuables with your or lock them in your trunk. My laptop and passport were stolen from my car (window was smashed open) during an 8 minute stop. Neighbors claimed this happens 3-4 times a day. Police will respond, but you will be better off going to the station to file a report.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Like being in another world- just stunning", "Wasn’t in my plans when I planned for San Fran but when TripAdvisor pointed me in its direction and I saw pics I just had to go. Caught the bus there easily enough and the wife and I just adored walking around. The architecture was gloriously unlike anything else in town and the gardens just so serene and lush. Just walk around, sit down and stare and rest for a while. Beautiful.\nShow less"], ["Reviewed November 6, 2017", 4.0, "One of the San Francisco landmarks", "Beuatiful buildings modeled after epic Greek and Roman architecture. We took a bus from Nob Hill to get here then walked to Fisherman's Wharf. It was a beautiful sunny October day so we spent about an hour just walking around and admiring the grounds, lots of benches to sit down and enjoy the views. Great place.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Great!", "Our visit was during our bike ride, it's definitely worth it , it's so si beautiful and big :) Just walk around and take pictures :)"], ["Reviewed November 4, 2017", 3.0, "Warning! Car break ins", "Warning! This place is located in a beautiful neighborhood but please do not leave any valuable personal items in the car even if it's just few minutes to take pictures. My rental car was broken into from the driver side window. They stole my backpack which had my wallet and purse inside it. This happened at 1:00 pm on 11/03/17. Other than the break in it is a nice place to visit to take photos. Please be careful.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Beautiful Building and Garden", "While we did not actually go in... we did stop to take a better look at this amazing building! The statues and gardens are simply beautiful!"], ["Reviewed October 23, 2017", 4.0, "Beautiful", "A gorgeous building. Many wedding happen here. Beautiful and serene surrounds. Take time to walk around and enjoy the peace and greenery."], ["Reviewed October 20, 2017", 5.0, "Serene surroundings", "Very beautiful and calm place! Someone was playing violin inside that added to the serenity of this place. We spent about 2-3 hours just walking and clicking pictures!"], ["Reviewed October 18, 2017", 5.0, "Magnificent Architectural structure from 1915 Panama Pacific Exposition", "Built for the Panama-Pacific International Exposition of 1915, the Palace of Fine Arts set in the Marina District adjacent to the Presidio, is a marvelous place to explore. I had the wonderful experience of enjoying a San Francisco City Guides Walking Tour on a Monday afternoon at 1:00pm with Mr. Paul Robinson who was a wealth of knowledge about the history and architecture of the Palace. Bernard Maybeck, the architect, created a structure to celebrate the arts with statues, friezes and decoration that has been lovingly restored after falling into disrepair in the early part of the 20th Century. With its domes, columns, tranquil lake and picturesque views, many conclude that this location is one of the most romantic spots in San Francisci. The number of bridal parties taking photographs on the afternoon of my visit seemed ample evidence of that belief.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Beautiful", "We spent an hour walking around the grounds. Its a beautiful peaceful place. We saw hundreds of either terrapins or fresh water turtles and all kinds of birds around the lake. The building is truly magnificent"], ["Reviewed October 17, 2017", 4.0, "Not what I expected", "Not sure what is 'fine' about the art. Maybe I missed something (the large display building was closed due to setting up for something but the rest rooms were open (though not very clean)).\nNice bit of architecture though having spent a bit of time in Greece this seems very 'Disney Land'.\nOverall the effect with the lake and walkway is a nice way to spend an hour. Take a picnic if the weather is good.\nShow less"], ["Reviewed October 16, 2017", 4.0, "such a palace", "a must visit at night to really appreciate this place and how wonderful and romantic place it truly is at night....saw in daylight what a difference at night and omg such beauty"], ["Reviewed October 16, 2017", 4.0, "Beautiful!", "Worth coming to see this structure, especially during the sunset time when the light is golden. Really beautiful!"], ["Reviewed October 16, 2017", 5.0, "Super cool place to take pics", "Had a great time walking around the grounds. We were able to get some amazing pictures and really enjoy the beauty of pond and the architecture. One of the highlights of our trip and definitely work a visit."], ["Reviewed October 11, 2017", 5.0, "Wonderful time", "We had a wonderful time last weekend at this place. Weather was nice. Lots of photo ops spots. Whole family enjoyed. Took long walk. Will do again."], ["Reviewed October 10, 2017", 4.0, "A piece of history", "This must have been such a huge and wonderful structure before it was destroyed. For what was left now, one can imagine its elegance and grandeur. One can just sit around and marvel at humongous pillars and sculptures. There were also ducks that strut around aside from the swan swimming in the lagoon that surrounds it.\nShow less"], ["Reviewed October 9, 2017", 5.0, "very beautiful place to visit", "Great place to visit; the structure, the street, the lake are all amazing. It is highly recommended to be visited."], ["Reviewed October 8, 2017", 5.0, "Excellent view", "I have been to SF so many times. Palace of Fine Arts surprises me!!!!!! So pretty and a great place for wedding pictures! It was a little windy though in early October. I also enjoyed the Ballet from Smuin!!!!!"], ["Reviewed October 6, 2017", 5.0, "Rotunda Building", "The Palace of fine arts @ San Francisco has amazing 'Rotunda' architecture. The engraving is also very interesting. The lagoon in front renders serene look. We could spot swimming ducks and other chatting birds. The manicured lawn with ornamental seats gives a grand look. Since its not that crowded; a small party can be had around this place. The other houses in the neighborhood too have an ornate & rare architectures.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Great place", "We loved the place - it is not overcrowded with tourists and you can wonder around and admire the site."], ["Reviewed September 26, 2017", 5.0, "Amazing", "This is one of the things that I highly recommend seeing if you are in the Bay Area. It is a very cool place to walk around and take a few pictures. I think the architecture is stupendous from many angles. Take some time and walk around the perimeter so you can view the structures and the reflecting pond in different lighting and perspectives.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Gray Line Tour", "What a beautiful place. Take a trip back in time. It was wonderful to hear the history of it. You will want to watch any movie associated with it."], ["Reviewed September 21, 2017", 5.0, "Must see spot in sfo", "This place make you travel back in time. The statues and the building itself is amazing. The whole tour takes less than an hour. We went with my four year old. The place is stroller friendly but don't take it.. let the kids run a bit. It was our first stop in sfo that day and it's very near to Golden Gate Bridge. The place was not crowded. Ample parking space and no admission fee. It was an amazing place to relax and the palace looked picturesque. If you are taking first timer to see sfo this is a must stop.\nShow less"], ["Reviewed September 20, 2017", 5.0, "'Classical' SF?", "Didn't get to the Palace of Fine Arts last time we were in SF and were determined to get there this time. Delighted we did. Walked there along the waterfront from Ghirardelli Square, took about 30mins to the edge of Crissy Field...end there she is. Magnificent. A quiet haven of water and 'classical' architecture. Yes it's 'modern' / 20th century imitation, but that is really not important here. Would recommend this to any visitor, and do the walk there too.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Impressive", "A must see. So very impressive in it's beauty and scale. Would love to own one of the homes that wrap around it ; )."], ["Reviewed September 13, 2017", 4.0, "Rome in San Francisco", "This is worth stopping here. The architecture is stunning. It is free to visit and will take less than 1 hour if you are in a rush. If you have more time then sit on one of the several benches and relax and absorb the calm here.\nThis is a busy tourist attraction. I was here during the week and it was very steady, I can only imagine how busy it is on weekends.\nThe fountains and ponds are an added bonus to the picturesque structures. There are swans in the pond and they have no fear of anyone, could practically reach out and touch them when I was taking pictures.\nInside the building there is a small café inside and we had the small calzones.\nThey also had games inside the kids were able to play. Ping Pong, bean toss & foosball were all available and at no cost.\nI only wish I was able to visit in the evening. I've seen pictures and it looks breathtaking.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Lovely Place!", "This lives up to its name - PALACE OF FINE ARTS! The beautiful and intricate details of the walls and ceiling, actually, of the whole structure are soooo amazing! <3 This is a must-visit!"], ["Reviewed September 4, 2017", 5.0, "Lovely place", "Stop by here after or before a visit to the Presidio. It's a beautiful place for a stroll and some pictures."], ["Reviewed September 4, 2017", 5.0, "Beautiful...especially at night", "Was here for a lovely wedding ceremony and fell in love with the place all over again. The design and artwork is amazing. The dome is calming refreshing. Takes me back to Rome...."], ["Reviewed September 3, 2017", 5.0, "SF's version of Central Park", "This palace and park area reminds me of Central Park (sort of). The rotunda and columns are grand and beautiful. It's also a great place to have a picnic if the weather is warm enough. I went when the temperature is 78 degrees Fahrenheit.\n\nIt's fun to see brides and quinceanera-teenagers celebrate and pose in their beautiful dresses.\n\nAlso, it is free!\nShow less"], ["Reviewed September 3, 2017", 4.0, "Picturesque Gardens and Architecture", "A friend who had lived in the area insisted that we take photos of the exterior features of the Palace, and we obliged. We should note that we did not actually enter the Palace and hence have no feedback on that aspect of the site. However, the outdoors gardens, water features, statutes and architecture were more than enough to provide artistic inspiration and many good photographs. The Palace is tucked in at the eastern edge of the Presidio and the western end of a neighborhood. There are multiple walking paths leading in and around the outdoor areas, allowing for a number of different ways to take it all in.\nShow less"], ["Reviewed September 2, 2017", 5.0, "BEAUTIFUL!!!", "We had a smart private driver that took us here, or we wouldn't have thought to do it. I'm not posting a photo because I'm sure that I couldn't do it justice."], ["Reviewed August 31, 2017", 5.0, "Getting better!", "A new cafe just opened and what a treat it is, the Palace itself iconic and so beautiful. What started as temporary became so loved the plaster became concrete. Enjoy!"], ["Reviewed August 28, 2017", 5.0, "Awesome", "Beautiful architecture. White swans seen in the pond. A peaceful place to take a walk and get some pictures."], ["Reviewed August 27, 2017", 4.0, "Stepped back to Rome for a few moments", "We stumbled upon the Palace of Fine Arts by our awesome Uber driver. She wanted to show us her favorite spot in SF before dropping us off at the Golden Gate Bridge. So glad she did.m! We literally felt like we were back in Rome. The architectures were beautiful and so unexpected in a city like SF. There's not much to do but you can relax and enjoy the scenery for a bit before heading back to hectic city.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Amazing and Beautiful!!!", "This is a San Francisco, MUST- DO!!! Built for a world exposition, it remains uniquely beautiful, and sits in the Marina District, which is also, really beautiful! Go for a production, picnic, a walk, this place will take your breath away!"], ["Reviewed August 24, 2017", 4.0, "A piece of history", "Whilst clearly cast concrete the overall effect is very grand quite nice and makes great photos. Taken back to an era when World Fairs were a thing. Popular with tour buses, we visited in the day, no food outlets, the large building adjacent was pretty much empty (has toilets), maybe still used for exhibitions ?\nShow less"], ["Reviewed August 23, 2017", 5.0, "A lovely place for pictures", "This place is very beautiful and well preserved. It feels like you are walking in an English University. There are so many places for picture opportunities and it's nice to go there just for a stroll :)"], ["Reviewed August 23, 2017", 5.0, "Quite Historic Place to see in USA", "Palace of fine Arts is a must visit place when going to San Francisco. It's beautiful architecture with luxury houses surrounding it gives you a royal feeling. Also a very good place for any kind of photo shoot. It is one place that we liked the most in SF. Parking is not an issue here, there is ample parking and also it's not a very crowded place. Golden Gate Bridge is also very close to this place.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Beautiful buildings, perfect for a relaxing walk or any photo ops", "On a Sunday afternoon, my daughter and I stopped at the Palace of Fine Arts to walk and enjoy the grounds.\nEasy to park on a side street, we walked the monumental grounds. There were many photo opportunities, couples, families, and of course tourists abound.\nPlusses included: Many benches to sit if you get tired, and trash containers if needed.\n\nWould have loved to see this venue at night, but time did not allow us to stay but an hour.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Beautiful World Fair Remnants.", "Very busy. Go on a sunny day if you can. Enjoy strolling around and reading the signs with it's history on them.Immense and larger than life."], ["Reviewed August 19, 2017", 5.0, "Beautiful! A MUST See", "The Palace of Fine Arts is a hidden gem! It feels like a cross between Rome and Greece hidden in San Francisco. In the evening the views are stunning. One of my favorite sights in the city! We went in the evening but I'm sure it's amazing in the day too!\n\nIt's free to walk around and take in the sights.\nShow less"], ["Reviewed August 16, 2017", 5.0, "A beautiful historic structure", "Originally built for the 1915 Panama-Pacific Exposition as an art exhibition, the Palace of Fine Arts in the Marina District of San Francisco is one of only a few surviving structures from the Exposition. It is quite a beautiful structure to look at, especially when across a small artificial lagoon. Bring your cameras or smartphones, by all means, to photograph this structure as one of your highlights of visiting the City by the Bay.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Great photo ops and SO relaxing!", "Brought the kids this time to see the Palace of fine arts. Such a beautiful setting for some photos and an easy walk. We did not go in (teenagers) but did enjoy the view."], ["Reviewed August 12, 2017", 5.0, "Relax and Recharge", "Every trip needs a time and place when you can relax, recharge and take a break. This is the place to do it if you are touring San Francisco.\nIt is free. It has a rest room. You don't go out of your way to find it. I think you can go any time of day that works for you.\nThe new-Classical structure is beautiful to look at and photograph. But it is surrounded by grass and water so if you have a blanket and rest, snack or picnic would be nice!\nI'm so glad I took the time to relax here for 30 minutes.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Imposing and impressive", "Fantastic building and nice (although not terribly well-kept) gardens. The attached exhibition space was pretty empty when we visited but I am sure it houses some interesting exhibits from time to time."], ["Reviewed August 9, 2017", 5.0, "Picture perfect Palace", "What a beautiful place this is. Whilst the Palace of Fine Arts Theatre is a fully operational live theatre venue and art space hosting international acts & works, the place is visited by many (including us on the day in question) purely for its magnificent architecture and external features. There was even a wedding party there the day we visited on our way to Golden Gate Bridge for photos under the main structure.\n\nOutside there a large pond with turtles, ducks and lush green grass (perfect for a picnic) and of course the immaculate structure of the palace itself which is a Colosseum-like marvel that looks like it has been transplanted to San Francisco from Ancient Rome.\n\nI'd highly recommend a visit. The Palace is close to the Marina & Presidio area and walking distance to Crissy Field & Fort Point so it's a fairly convenient stop off as part of a day trip through San Fran. Now I want to return to see a theatre performance and check out what is on the inside.\n\n\n\n\nShow less"], ["Reviewed August 9, 2017", 5.0, "Stunning", "Another recommendation to visit. The place is absolutely beautiful and great for just a gentle stroll around to take photos and to look at the wildlife. An excellent place to relax; a lot of people seemed to have the same idea !"], ["Reviewed August 8, 2017", 5.0, "Awe inspiring as wedding venue", "My daughter and my (now) son-in-law had their wedding here and it was a beautiful venue! Private parties are reserved through the San Francisco City Parks and Recreation Department. Because it is a public place, the wedding ceremony is not private and anyone can walk by. The area of the actual ceremony is marked as private, but visitors can see the wedding taking place from a short distance away. Everyone passing by was very respectful and it really was nice to have unknown visitors enjoy the beautiful ceremony. We had chairs to sit on and although amplifiers are not allowed, the violin/cello duet, who were hired for the processional and recessional, was easily heard, as was the officiant and the speakers in the ceremony. It felt very private. The location is under the rotunda, which is a magnificent structure.\n\nThere is a lake in the park with birds and turtles and fishes. It is a very beautiful setting. On one side, along the outermost path surrounding the Park, the Golden Gate Bridge can be seen.\n\nThere is an enclosed building that was formerly an attraction, but now only holds some indoor children's games, and has a large coffee kiosk seating area to rest from being outdoors. There are very clean restrooms available in this building as well.\n\nIt does get windy in this area, so be sure to bring a jacket with you even if the day is otherwise warm. It is a chilly kind of wind, so you will be glad to have something warm to put on.\n\nAs with all outdoor venues for weddings, weather can always be a surprise. We had a bit of rain in a week that had been sunny every day! So that is my only caveat about choosing this as a venue for a wedding or other ceremony. The rain and chilly wind did not dampen the joy of the wedding one bit; it's simply something one must plan on and be prepared to accept. Mother Nature always has the upper hand.\n\nThe great structures and beautiful lake make excellent photography opportunities. The photo I am attaching to this review was taken with my basic cell phone, so you can imagine what great photos more advanced cameras will take.\n\nThe Parks and Recreation staff were very nice and professional and helped keep things flowing. I highly recommend hiring them to help with any event you book. You never know what may come up and it's well worth the peace of mind to have these friendly and knowledgeable people helping on your big day, no matter the occasion.\n\nEnjoy this attraction just for strolling, photo taking, or for your own big event! You'll have a grand time!\nShow less"], ["Reviewed August 7, 2017", 5.0, "Beautiful spot with unfortunate history.", "Sadly, the Palace of the Fine Arts Theatre is the only remaining building from the 1915 Panama Pacific International Exposition. It is an impressive structure that gives a glimpse to another time. Plan on spending 1-2 hours strolling about the grounds."], ["Reviewed August 5, 2017", 5.0, "Fun", "We went to Google and Fb Headquarter in California. After that we went Twin Peak to see the panorama of Sanfrancisco, Palace of Fine Art where has got big pillars,Limbard Street ,Golden gate suspension bridge. Joseph Stauss eas the designer of the Golden Gate. It was dangerous and difficult to build.The sad thing is it is a popular place to suside.\nAfter that we went to Aquarium of the bay. We can see the sea lions in there. They felt safer in Pier 39 after earthquake . After that we went Yangon restaurant before going back home with Singapore Airline.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Palace of Fine Arts Review", "Wow! Such a beautiful place to visit and take photos. Walk around the fabulous structures and gardens. Lots of people taking photos. Place where some of the The Rock movie was filmed. Recommend highly to visit."], ["Reviewed August 4, 2017", 4.0, "Great photo opportunity", "A beautiful and peaceful place in San Francisco. It's worth visiting although you probably don't need to stay long. We walked from the palace to the Golden Gate Bridge along the bay. It's a brilliant photo opportunity as the grounds are stunning. Lastly, it has an interesting history worth exploring.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Miust see place in San Francisco", "This is a beautiful place to see with its ornate structures adorned with Corinthian columns. There are meandering pathways where you can leisurely walk around a small lake and in between the structures while taking nice pictures with a camera or cell phone."], ["Reviewed July 31, 2017", 5.0, "Visit at Night", "A must to see. Surprised that not many people go here. We visited late in the afternoon but must be awesome at night as seen in photos."], ["Reviewed July 29, 2017", 5.0, "Beautiful relic from 1915 world expo", "It is surprisingly peaceful. Easily walked around to enjoy surrounding scenery. Highly recommended. Great place for family outing."], ["Reviewed July 28, 2017", 5.0, "Beautiful site in the midst of a busy city", "They don't make them like this anymore. One of the most beautiful area in the city and a great place to relax or take photos."], ["Reviewed July 25, 2017", 4.0, "Picture opportunity", "We found this area while wandering around. It is beautiful and well worth the time. We got some lovely pictures and even found a turtle enjoying the sun!"], ["Reviewed July 25, 2017", 5.0, "Surprising!!", "After driving through cities and packed roads around San Fran this location truly is a sight to see. In the middle of houses and restaurants there's this oasis to one side of the road filled with beautiful flowers and greenery and just amazing structures! The Palma of Fine Arts Theatre has no fine art nor a theater that we saw, but the dome and columns are impressive enough!\nShow less"], ["Reviewed July 23, 2017", 5.0, "Serene Beauty", "You probably don't need to spend more than 25 minutes at the Palace of Fine Arts Park. It's a photo stop. But it is beautiful and serene. It's a perfect place to take a moment and relax in San Francisco!\n\nTruly beautiful scenery! And it's FREE!\nShow less"], ["Reviewed July 21, 2017", 4.0, "a place with a difference", "small lake adds beauty to this place of concentric semicircles of pillars . there are ancient cut out figures with backs in the outer and faces in the inner circle. a place where you will come across many newly weds for a photo shoot out .\nShow less"], ["Reviewed July 19, 2017", 4.0, "elegent and magnificent building", "The Roman styled building was contructed for the World Fair, and it is quite elegent and magnificent."], ["Reviewed July 17, 2017", 5.0, "Excellent chance visit", "Great stop! Saw it out the window while we were on the bus on the way back from the Golden Gate Bridge and the man sitting next to us said we had to stop and check it out. Glad we did and we had a great time wandering around the grounds. A couple of weddings and quinceras there to take advantage of the grand location. Relaxed and rested our feet. Very relaxing.\nShow less"], ["Reviewed July 16, 2017", 4.0, "I so much wanted to love this place!", "Don't get me wrong the architecture, surrounding grounds and the lake are all gorgeous but there is no ART like nothing, zero! I When I first heard about it in my mind I imagined this place to be the equivalent of Louvre or any other major European museum but unfortunately no! Its sad that the place couldn't be filled with some historic or art pieces, it would definitely make this location stand out!\nShow less"], ["Reviewed July 14, 2017", 4.0, "Worth visiting in SF", "We went to this place early in the morning so it wasnt crowded at all then at around 11 am tourist buses came along so it was kind of busy. It was nice walking through the palace grounds cos of its historic architecture."], ["Reviewed July 12, 2017", 5.0, "Great spot for pictures and relaxation", "The Palace of Fine Arts is a great place to take photos with a unique and beautiful background. Across the pond there are also beautiful homes that offer a nice backdrop. It's close enough to Fisherman's Wharf and the Golden Gate Bridge that it's worth a visit.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Beautiful", "Beautiful place, and quite quiet mid-week. Somewhere you can relax with a book and take in view You can get various commuter and MUNI buses to the street next to it."], ["Reviewed July 10, 2017", 4.0, "Tranquil oasis in SF", "Hard to believe you're in San Francisco at this lovely and tranquil spot! This area is a little further out from the main tourist areas but well worth the visit to stroll around the pond and marvel at the architecture!"], ["Reviewed July 10, 2017", 4.0, "A beautiful walk", "Take a break from the busy city and stroll around this beautiful park. It has a great grassy area for picnics and sitting on blankets to take in the view. It is not far from Golden Gate Park ."], ["Reviewed July 10, 2017", 4.0, "Lovely Tableau At The Palace Of Fine Arts, San Francisco", "After seeing so many beautiful photos of this place, we made a point to get there and take a photo. It really is striking, and so unique. We went in the late afternoon, so it wasn't too crowded - although parking is a bit of an issue. It is a very relaxing place to walk around a bit, but one caveat: we heard from at least one source that there are lots of car break-ins - evidently people hang around waiting for tourists to park and leave their vehicles - and then take advantage of the vacant cars to break in.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Beautiful, Relaxing, & Romantic...", "This is one of the most beautiful places in San Francisco. The outside scenery is all free to walk through. As will everywhere, parking is limited. I was told that many people choose to have their wedding pictures taken here. It is just like a park. There are benches all around for your convenience. Its a very quiet and peaceful place if you need a break from all major tourist spots. It was really enjoyable.\n\nTIPS:\n1. Its a short 1.7 downhill hike from the Golden Gate Bridge. You cant miss it.\n2. There is a public restroom across from the Palace of Fine Arts at the park by the boats.\nShow less"], ["Reviewed July 4, 2017", 3.0, "Be careful, lots of car break-ins.", "This was my third visit in the past 30 years. We were there there the second week in June 2017. The park has not changed. It is as beautiful as ever and the swans are still there. We went in the late afternoon at 7:00 pm to take advantage of late afternoon light. I stopped and spoke to a gentleman that own a gorgeous Spanish style home on the corner of Baker and Jefferson Street. I commented if the neighborhood was not that safe given there were bars over the lower windows. He stated they were on the house when they purchased it many years ago. He did state there were lots of car break-ins due to San Francisco having very lax laws. No sooner had we finished our tour which included a short walk to the bay, our rental car was broken into. The cracked the front passenger side window, and broke the rear passenger side window.\n\nBe careful. Clear all belongings out of the car. Do not hide under the seats either.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Feels like you're taking a stroll in Europe", "The Palace of Fine Arts Theatre is so incredible! Absolutely stunning with beautiful architecture and gardens. The water is serene. I can't believe this is free. It's certainly a hidden gem and it's huge. Definitely worth a walk through anytime you're in the area."], ["Reviewed July 2, 2017", 5.0, "Beautiful classical folly", "Sitting on the edge of the Presidio this is a beautiful classical architectural feature with a lake and a fountain. Spend as much or as little time there but do spend some time."], ["Reviewed June 30, 2017", 5.0, "Beautiful, peaceful spot - don't miss it!", "The architecture and grounds here are amazingly beautiful. You want to take photos at every turn. A trail runs all the way around the pond, and informational signs tell you the history of the building and the park. Many birds are here, and I learned that not only are they beautiful to see, but also that this is an important spot on the Pacific Flyway. The pond has turtles and many lovely plants and trees planted all around it. The architecture of the massive building takes your breath away. I went in the late afternoon when the soft sunlight was slanting across, which was the perfect time to take photos. What a lovely spot.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Amazing", "Just walking through the sculptures and the grounds is wonderful... great location and big as to not feel crowded... even a wedding photo shoot was going on when we where there... massive pillars and art works which are amazing and beautiful!"], ["Reviewed June 26, 2017", 5.0, "Gorgeous architecture & grounds", "The Palace is an absolutely gorgeous place to visit. The attention to detail in the structures and vegetation is awesome. We loved taking a slow, peaceful stroll around the grounds, pausing to watch the birds and turtles doing their thing.\nDespite the amount of visitors, the area remained peaceful. Everyone respected the grounds and wildlife which was great to see.\nTake some time to experience it...you'll appreciate it.\nShow less"], ["Reviewed June 26, 2017", 5.0, "So beautiful!!", "Definitely stop by and walk around this beautiful 'Palace' and take the best pictures you possibly can with your loved ones."], ["Reviewed June 24, 2017", 5.0, "Such a beautiful theatre!!", "We did not go into the Palace of Fine Arts, but wanted to stop by and see this magnificent building in person. There are walking paths around and many benches so that you can spend some peaceful time enjoying this beautiful area. It is definitely worth a stop! I would like to come back again and see it lit up at night.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Where beauty meets peace...", "I have come here at least 4-5 times now in a span of 2 months. The place has something to it...a serenity...peacefulness and quietness...whether there are people taking wedding/prom pics, or tourists taking shots of the beautiful building or artists playing live music, or you're just simply walking by and sitting alone with your book. It's a magical place.\n\nLove the ducks and swans...we don't get many swans in Oakland so you get my excitement :)\nHaven't been inside yet or for a concert but waiting for a good one to come up and will be running to attend :)\nShow less"], ["Reviewed June 20, 2017", 5.0, "Magnificent", "Came here few times and never feel bored. I liken the architecture of the building and the small pond. You can walk across the road and take the photo for Golden Gate Bridge. There is rest room available in the building.!"], ["Reviewed June 19, 2017", 4.0, "Beautiful venue and theatre!", "A spacious venue but the location is near the freeway to the Golden Gate Bridge which can get congested. I think Uber, Lyft or public transportation is your best bet, but if you have to drive, do not leave any valuables in your car as one of the crew from the singer we were seeing got their van broken into. Upon leaving the venue after the show there was alot of broken car window glass.\n\nThis was my first time seeing a show here. I was the first in line for will call and doors were not open til about 5:45 pm and the meet and greet before the show was at 6 pm and standing outside I felt cold as it was very windy.\n\nOnce we got in, very easy to get your tickets and then there was a wait inside to get into the lobby of the theatre. Once we got into the lobby, there are restrooms as well as refreshments in the spacious lobby as well as plenty of tables and chairs.\n\nThe theatre itself is spacious and we had great seats in the second row and seats were rocking comfortable and space between rows was roomy.\n\nGreat show and venue but better to take public transit or Uber or Lyft\nShow less"], ["Reviewed June 18, 2017", 5.0, "Beautiful grounds!", "I'll come clean up front, we didn't go to a performance, but we did stroll the park-like grounds, and thoroughly enjoyed ourselves. Beautiful backdrop for pictures."], ["Reviewed June 17, 2017", 5.0, "Great place", "Amazing photo opportunities. Great spot to wander around. Impressive buildings. And a short walk to the beach after."], ["Reviewed June 15, 2017", 5.0, "Beautiful Site", "I cannot understand why this site is not amongst the top twenty on Trip Advisor. We stumbled upon it after walking from the bridge,through Crissy Fields & along the beach. This site was originally where the 1915 World Exhibition was held, then fell into disrepair. Was saved & rebuilt by a philanthropist, and is a truly beautiful place to spend an hour or so.They also have exhibitions there.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Beautiful oasis in the city", "This is a beautiful spot near Chrissy Fields and the Golden Gate Bridge. Unexpected and interesting architecture and history. We took so many photos. A serene place to wander around, take pictures and relax!"], ["Reviewed June 9, 2017", 5.0, "Beautiful", "By day it is a stunning place, do yourself a favour and also see it by night, I missed that am kicking myself."], ["Reviewed June 7, 2017", 4.0, "Monumental structure", "one of the most photographed site of SFO.The place is popular destination for wedding photoes.The monumental structure with greek architecture was constructed for Panama Pacific explosition during 1915.Good for picnics in the neighbourhood park. relax watching birds and swans in the small pond.just stroll around watching beautiful structures.connected by Muni buses.Golden gate bridge is nearby.\nShow less"], ["Reviewed June 5, 2017", 4.0, "Beautiful structure with a romantic feel", "The place was filled with beautiful Rome design and the surrounding was simply breathtaking. Couples will fall in love again in the romantic settings, great photo-taking place."], ["Reviewed June 4, 2017", 5.0, "Wow this is a beautiful place!", "Such a great place to take pictures and go for a romantic walk. The kids might get bored quickly just walking around here but it's definitely great for adults. You can see everything in under an hour. It's just so beautiful and looks like you have been whisked away to italy.\nShow less"], ["Reviewed May 31, 2017", 5.0, "A San Francisco Gem!", "Beautiful day or night, this is a lovely place to walk around and take photos or to bring a picnic or anything at all. You can walk from the Letterman Building in the Presidio easily to the Fine Arts Palace and it is very worthwhile. Beautiful and romantic!\nShow less"], ["Reviewed May 23, 2017", 4.0, "Have a romantic walk", "Walking around the Palace of Fine Arts Theatre during the night gives you the opportunity of see this impressive place at its best. sit in a bench near the pound to the best romantic place."], ["Reviewed May 22, 2017", 5.0, "Perfect for a stroll.", "Beautiful park with lovely architecture. Take your time to negotiate the tourists picture taking and stroll by the marina. Close to the Disney museum as well.."], ["Reviewed May 20, 2017", 4.0, "Stunning", "A beautiful Greek style building set in lovely grounds\nWe ended up visiting this place as we were visiting Chrissy Park and realized to pick up our hop on hop off tour bus we could walk through this attraction and get the bus on the other side\nI was amazed by the grandeur of the whole building, it was so peaceful compared to the hustle and bustle of the main areas of San Francisco\nI thought it was going to be an art gallery and was surprised to find it wasn't\nLovely place to take photos\nWorth visiting\nShow less"], ["Reviewed May 16, 2017", 5.0, "Absolutely Breathtaking", "The hustle and bustle of San Francisco can wear on you. Everyone should take a breath and enjoy the architecture of the Palace of Fine Arts. Every angle provides a Perfect picture taking spot and it is a beautiful reminder to stop and enjoy the simple things in life.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Great architecture", "This is really a must see in San Francisco. Quiet and nice atmosphere, two adult swans and a baby swan in the pond (They should be famous). It doesn't long time to walk around and pretty close to the Golden Gate Bridge. Not a bad choice to come here and take a break after visited Golden Gate Bridge.\nShow less"], ["Reviewed May 15, 2017", 4.0, "Great atmosphere but beware of robbers", "Beautiful location in San Francisco and enjoy a lovely walk around the pond. Please be aware not to leave Any valuables in your car when parked behind the buildings because they will get broken into."], ["Reviewed May 14, 2017", 5.0, "Nice Roman architecture", "Really nice place to visit while in San Francisco for 30 minutes. Columns, Arches, Sculptures of Greek- Roman style with a gorgeous lake to walk around."], ["Reviewed May 10, 2017", 5.0, "Great place for a walk", "Excellent place to enjoy with family of good architecture. Great place for a walk. Definitely recommend"], ["Reviewed May 6, 2017", 5.0, "Mesmerising!", "I spent a lovely hour here, the weather was good and it wasn't too busy....I discovered this place accidentally, but well worth the visit."], ["Reviewed May 5, 2017", 4.0, "What a gem", "Stumbled across this place on a bike ride. It is pretty, tranquil and beautifully built. There's not much genuine Roman architecture in San Francisco, so grab a small bit and visit this place."], ["Reviewed May 5, 2017", 5.0, "Beautiful architecture & great for pictures", "We stopped by here and spent about an hour looking at the beauty of the architect on this site. Neat history and so kind of whimsical for this place to be in the city.\nWould be a nice place to bring a picnic too and just relax. Also, great place for pictures.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Beautiful", "Me and my husband visited here on the way to the Golden Gate Bridge, we are so glad we stopped by! It was breathtaking, the buildings are beautiful and the area is well looked after! When we visited there was a music group singing and it echoed around the palace - it was amazing! Great spot for photos too!\nShow less"], ["Reviewed April 26, 2017", 5.0, "Beautiful Architecture", "Beautiful complex, Lovely Architecture and Scenery, Nice complex, with gardens and a lake. A Great Spot to Spend a relaxing afternoon"], ["Reviewed April 26, 2017", 5.0, "Must see", "My wife and I were able to go see the Palace of Fine Arts during the night and day. If you love architecture you will love this site. When we went the crowds were low. It is wonderful to walk around at night"], ["Reviewed April 26, 2017", 5.0, "Beautiful Architecture", "What an amazing place to wander around and be astounded at what architects and craftsmen can do! Beautiful landscape, a pond and some places for breathtaking photos."], ["Reviewed April 25, 2017", 4.0, "Simply beautiful", "Just relaxed walk here with viewing beautiful land mark. There were some wedding going on, and that was amazing. No bathroom here...watch out. (We went Chesnut St with a lot of stores to find it. Walgreen's have one)"], ["Reviewed April 25, 2017", 5.0, "Absolutely Incredible", "This is one of the few places in the U.S. you are going to see something like this with the Roman columns and this degree of details on the sculpture. It is absolutely breathtaking to say the least.\n\nI did not know what to expect coming here, and while I thought there was more to it, there was still enough for someone who appreciates this kind of thing. The theatre was not open when we were there, so we did not get to go inside. We did enjoy the outside though with a lot of pictures on a nice day.\n\nIt doesn't cost anything, and many tours will take you by it. If in the area, you should definitely check it out and get your selfies. Our helicopter tours flew over it, so it was nice to see in person.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Beautiful place to take a walk!", "We spent some time walking the grounds & it was beautiful. One of my highlights of our trip. We rode the hop on off bus. It was a great place to see. Would recommend if you enjoy lakes & serene architecture. <3"], ["Reviewed April 24, 2017", 3.0, "Good monumental attraction", "It is a good monumental attraction in middle of San Francisco city. One can spend 20 to 30 minutes to roam around with peace."], ["Reviewed April 24, 2017", 5.0, "A gem of SanFrancisco", "I went there on my way to Walt disney family museum. No tickets to visit this place it is FoC. Here we can see replications of old Roman buildings with beautiful carvings ,land is decorated with beautiful ponds, fountains and benches to sit and rest. If you are in SFO it is worth to allocate half an hour to visit and enjoy this beautiful buildings and peaceful surrounding.\nShow less"], ["Reviewed April 23, 2017", 4.0, "Memories of a Bygone Era", "Built for the 1915 Panama-Pacific Exposition, the park is a beautiful oasis, surrounded by a busy city. Situated only a few blocks from a main feeder from the city to the Golden Gate Bridge, it is a beautiful spot to walk around and appreciate."], ["Reviewed April 23, 2017", 5.0, "A MUST SEE. ABSOLUTELY BEAUTIFUL AND PEACEFUL!", "I love this place! We walked here from a downtown hotel. (I don't recommend walking unless you really like to walk long distances. It was a challenge for me and my sister. But we didn't regret doing it.) Most people don't know about this place. Not sure why? We asked the Hotel tourist advisor how to get there. They had no clue. Great place. Take a lunch and hang for awhile. The pillars are huge. The ornate decor is fantastic. A small lake with ducks too. Close to the Golden Gate Bridge. We took a taxi back to the hotel. Fantastic day! Will go again if given the opportunity. Don't miss. Gorgeous!\nShow less"], ["Reviewed April 22, 2017", 4.0, "Unique place to visit", "We decided to visit this place while we were in San Francisco. It was very unique. If you have spare time I would definitely recommend seeing this attraction."], ["Reviewed April 20, 2017", 5.0, "Beyond Expectations", "Never expected this place to be so grand. Loved the place and the surrounding gardens. Worth a visit. You could cover this place in 60 minutes."], ["Reviewed April 20, 2017", 5.0, "Nice picnic spot", "It's a nice place.. With a small pond in the middle.. It would make a nice place for picnics during nice weather.. Can see fishes and birds and turtles around.. Nice place for kids as well"], ["Reviewed April 19, 2017", 5.0, "a good place for some reflection", "a relatively quiet place, despite all those visitors. Suitable for some reflection in the face of the site that used to host exposition demonstrating human progress and now carries the marks of time (even though the building is a rebuilt one). See a couple taking wedding photos here.\nShow less"], ["Reviewed April 18, 2017", 5.0, "Beautiful architecture", "This is a beautiful building at any time of the day. Photographs at any time can be quite lovely. The surrounding area is beautiful and the water is also good to spot waterfowl. This is another must see if you are visiting San Francisco. I have been here many times and have never been disappointed.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Amazing architecture", "A little piece of old Greece right in the middle of San Francisco! Larger than it seems, very ornate & detailed, absolutely beautiful. So picturesque, easy to see why there were bridal parties there taking pictures with this in background while we were visiting. Nice to stroll around quiet pond and see structures from all angles. Allow about 45 minutes. There were several locals hanging out reading & quietly talking as it was beautiful & serene, which also seemed appropriate.\nShow less"], ["Reviewed April 14, 2017", 5.0, "Great place to take a walk", "Great place for a walk around the grounds. We ended up sitting in the grass for a while and just enjoying the area. Definitely worth the stop."], ["Reviewed April 12, 2017", 5.0, "Beautiful", "Me and my wife went in the morning and later in the night and looking at this beautiful piece of architecture in the sunlight and with artificial light is just mesmerizing."], ["Reviewed April 12, 2017", 5.0, "easy stroll from the Presidio", "Beautiful structure and relaxing area to just relax, at least during weekdays. Was easy to include in our visit to the Presidio area."], ["Reviewed April 12, 2017", 5.0, "Stunning", "Don't leave SF without visiting this incredible place. Arguably, the most beautiful site in the city. The architecture is just incredible. Best photo spot to get the whole Palace and people in the picture us from the sidewalk in front of it. Just gorgeous."], ["Reviewed April 11, 2017", 5.0, "Excellent", "Wonderful design and architecture, and enjoyed the visit to this attraction. It is worth both a day and night trip. Expect to spend less than an hour each trip as after a while, there isn't much else to see."], ["Reviewed April 8, 2017", 5.0, "Beautiful at night", "I highly recommend going at night. Absolutely beautiful. Just be careful of puddles after a storm in SF"], ["Reviewed April 8, 2017", 5.0, "Beautiful and clean.....", "The grounds are beautiful, quiet and clean. Such a relaxing walk around the grounds. Such a variety of creatures! Families, Photo Shoots, Witnessing carts, great place to spend a morning or an afternoon."], ["Reviewed April 8, 2017", 5.0, "amazing must see.", "This should be on the top of everyone's list while in San Francisco. The place is absolutely beautiful and you will always see wedding or engagement photos being taken because of how amazing it is. Doesn't take very long to walk through and see it all, but highly worth the trip there.\nShow less"], ["Reviewed April 3, 2017", 5.0, "Such a beautiful place to Visit", "Omg This is the most beautiful place I have ever seen. I felt like I was in Buckingham palace. It's so spacious with a unique infrastructure. It would make a beautiful place to have a wedding. A must see if you're visiting San Fransisco."], ["Reviewed April 3, 2017", 5.0, "Awesome Architecture", "Cool architecture and amazing beauty. Walking around the lake/pond allows you to see the entire grounds. Contains an Urban Wildlife Refuge as well. Turtles/ducks/geese/swans/various birds can all be seen. If you like architecture/columns and such you need to stop by."], ["Reviewed April 1, 2017", 5.0, "Beautiful Architecture", "This \"little\" park was amazing. Got to see it on a sunny day and the architecture was incredible. Not necessarily a ton to do but a great spot to sit, take a break, and eat some food. Definitely worth checking out even just for a short time. The attention to detail on the design and layout is extraordinary.\nShow less"], ["Reviewed March 31, 2017", 5.0, "awesome park!", "I kept seeing a large dome in the distance and then we happened to drive right past this place on our way to see the Wave Organ. We immediately pulled over and found a parking spot. We spent about 30 minutes walking along the path around the pond and taking in the scenery.\n\nThe architecture of this site is beautiful and, at the same time, very out of place in San Francisco. It's very European. There are some nice placards around that tell the history of the site.\n\nDefinitely worth a half to a full hour of your time while in San Francisco. It was one of my favorite sites.\nShow less"], ["Reviewed March 30, 2017", 5.0, "AMAZING & BEAUTIFUL!!!!!", "My family and I visited for our first time and it was breathtaking. Such peace and tranquility. The view is absolutely amazing! Would have loved to just chill in the grass area for a few hours and relax. If ever in the area again, I'll definitely return.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Gorgeous, scenic location. Don't miss it!", "Beautiful spot to take pictures and experience this important landmark in San Francisco. Good idea to park at the Presidio and make a day of walking the area. You can walk to the Golden Gate Bridge through the park along the bay and see the origins of SF in the museum of the Officer's Club. A full day and very inexpensive.\nShow less"], ["Reviewed March 25, 2017", 5.0, "Beautiful", "The Palace was a very beautiful, peaceful setting. I loved the water with gulls and swans in the forefront. It's a perfect setting for photographs and we intend to go back for graduation photos today"], ["Reviewed March 24, 2017", 5.0, "Suprising Beauty", "This place was such a beautiful place in the middle of the city. The history is fascinating and it is a great place to walk around and relax.\nThe building itself is impressive and there are many corners to check out. The little pond in front is beautiful and you can walk around with different views.\nIt's a great place for views of the city and great for good weather.\nThere is enough parking but our Hotel staff warned us not to leave anything laying around and have an eye on the car or park in a busy place. We did that and had no issues.\nShow less"], ["Reviewed March 21, 2017", 5.0, "Nice place", "You will need around 30mins to an hour to walk about. Do walk over the pond so that you will be able to take a good photo of the entire place."], ["Reviewed March 21, 2017", 5.0, "Lovely place to take pictures", "This place is gorgeous and a must see when you visit San Francisco. Kid-friendly and dog-friendly. There were lots of wedding and other formal pictures being taken. Lots of wildlife. Look for the branch covered in turtles. The kiddos loved it!"], ["Reviewed March 19, 2017", 4.0, "Very nice and relaxing", "We walked there from our hotel on Lombard St. and then went down to the water. Very nice and relaxing. If you're in a car I'm not sure where you'd find parking. Easy to spend some time there. Nice benches and good shade."], ["Reviewed March 16, 2017", 5.0, "Simply Stunning", "A must to see! Tranquil, Romantic and Beautiful are just a few words to discribe this truly magnificent park. It's like a Roman Pavilion with huge pillars surrounded by a lake with a fountain in the centre, full of fish and ducks. You can walk around or bring a picnic with you and just sit, relax and enjoy the scenery. It's truly a hidden gem and all for free.\nShow less"], ["Reviewed March 12, 2017", 5.0, "Amazing and awesome", "We drove by on our way across the Golden Gate Bridge and had to go back. The lagoon and Corinthian structures were wonderful. I need to learn more of the history of the park . I am sure a lot of donations were made to preserve the structure, those citizens had the vision of the beauty of this area. Take the Lyft to get there parking is not good.\nShow less"], ["Reviewed March 12, 2017", 5.0, "amazing place many tourists miss", "designed by Bernard Maybeck,it was meant to just fall down after the PPIE. however,it was decided it had to be saved.the original was dismantled,then reassembled. it is worth a visit to see this beautiful building/"], ["Reviewed March 7, 2017", 4.0, "Amazing considering its origins", "It's mind boggling that its original purpose and why it was built, was for a fair!\nWhere today, a fair is a place you go in shorts and a t-shirt, this was obviously not how people dressed to come see this back then!\nIt's nice to visit both in the daytime and after dark.\nShow less"], ["Reviewed March 3, 2017", 5.0, "Beautiful grounds and architecture", "If you are looking for a picturesque spot in SF, then this is a great option. The architecture is very grand, the park is extremely pretty and you can take some wonderful pictures. It's not a huge place, but worth bringing a picnic and watching the world go by on a sunny day.\nShow less"], ["Reviewed March 3, 2017", 4.0, "It appeals to the starved romantic heart in all of us.", "An interesting example of why some things need to be saved. It was built to mimic a ruin, which it actually became when it began to crumble.\n\nConstructed originally for an exhibition, designed as a fictional ruin from another time, beloved by those that saw it, preserved, repurposed, fell apart... and then totally rebuilt.\n\nI hope they fix the grounds. The old planting is a bit unkept and the new suffers from poor drainage, poor and infertile soils, improper planting and unschooled trimming.\n\nPhotographers snapping engagement photo's abound. It would be a great place for revenge photo's, too.\n\nEvery travel to San Francisco requires my visit here.\nShow less"], ["Reviewed March 1, 2017", 5.0, "Palace of Fine Arts", "The building has great architecture and the grounds are scenic with a pond. Worth checking out when in San Francisco."], ["Reviewed February 27, 2017", 4.0, "Watched a show here", "Such beautiful architecture makes you think you're somewhere in Europe. A great place to hang out and take photos. Inside of the building needs an upgrade and Needs to be cleaned more!"], ["Reviewed February 23, 2017", 5.0, "A great place to be with the one you love.", "My wife and I always go back here because this is where we got married. Now, we take the kids. It's a great place to have a picnic, take a walk or even get married."], ["Reviewed February 22, 2017", 5.0, "Beautiful Architecture in picturesque neighborhood", "My husband and I loved walking around this remnant of the Panama Pacific Fair. Walking the grounds and structure, there is beauty (and often wildlife) at each turn. Plaques tell the history of the original structure and the various changes and preservation that has occurred over the years.\nShow less"], ["Reviewed February 22, 2017", 5.0, "Lit up 24/7", "If you're looking for something to do that costs nothing but the car to get there, a midnight stroll at the Palace of Fine Arts is the perfect call. Intended as a World's Fair exhibit that the locals decided to keep (it happens around here) it is still a place of local delight. It has been backdrop to proposals, romantic walks, and all sorts of lovely happenings. It isn't a place of excitement - you will need to entertain yourself, possibly by bringing a picnic basket.\nShow less"], ["Reviewed February 19, 2017", 5.0, "Beautiful architecture, especially at dusk", "The Palace of Fine Arts is located in the Marina district of San Francisco and it was originally built for the 1915 Panama-Pacific Exposition and then rebuilt in 1965. We visited this place twice, once after a long walk we took all the way from Fisherman's Wharf near the Aquatic Park to the Marina Blvd before we made a left. It is located in one of the most beautiful spots of the city and seems popular with both tourists and locals. We decided to come again another time after sunset with the lights of the park on and enjoy the atmosphere at dusk. I suggest you do the same. It's a beautiful structure with lots of places to relax and watch people passing by. One of our highlights of our trip.\nShow less"], ["Reviewed February 14, 2017", 5.0, "I just love this place.", "I am just as amazed that this beauty exists in neighborhood (albeit a very pricey one). A must see both in the day and the night."], ["Reviewed February 14, 2017", 4.0, "Cool Structure", "This is an impressive part of local history, but it probably isn't worth going out of the way to see."], ["Reviewed February 9, 2017", 5.0, "another must see in SF", "This is a must see. The architecture is amazing and has survived some serious earthquakes. The pond and palace are gorgeous!"], ["Reviewed February 9, 2017", 4.0, "A pleasant with some history", "The Palace of Fine Arts is a huge structure originally constructed for the 1915 Panama-Pacific Exposition. It is impressive. It was a sunny day and the ducks and water were very beautiful. Lots of families out for a walk"], ["Reviewed February 9, 2017", 5.0, "Can't Miss Seeing this Iconic Place", "A walk around the grounds here is so beautiful. We were there in the morning. There are beautiful plants all around and lots of birds. It is one of those places you should go just because it is beautiful, And if your family enjoys the \"we've been there!\" moments when watching movies or tv, you surely don't want to miss this one. I wished we had more time and a blanket because i would have loved to sit on the grass and relax for a while.\nShow less"], ["Reviewed February 9, 2017", 4.0, "Another great piece of Architecture", "This elegant piece of Architecture truly amazes even if one just decides to pass by. It has a man-made lagoon in front where we saw some ducks swimming and wading. There was also an on-going pre-nuptial picture taking when we went there. People come here to walk their dogs, have a stroll, ajog or just resting on the benches or on the grass. This free attraction showcases Greek and Roman architecture.\nShow less"], ["Reviewed February 8, 2017", 5.0, "Beautiful location and architecture", "This is such a gorgeous attraction in San Francisco and the entrance is free!! The architecture of the main dome and the surrounding structures is superb and we loved strolling along the lake. It's a very popular location for wedding photography as well. Located very close to Golden Gate Bridge.\nShow less"], ["Reviewed February 7, 2017", 5.0, "just so pretty", "We had an amazing time taking pictures and walking around . . What lovely architecture and picturesque gardens located in the city"], ["Reviewed February 6, 2017", 5.0, "A Gorgeous Piece of History", "The Palace of Fine Arts is the best free attraction in San Francisco. My friends and I fell in love with the place. The photography results at twilight are breathtaking. You should definitely visit the grounds."], ["Reviewed February 6, 2017", 4.0, "Interesting Walk-Through, Not Much Else", "This place does what it says on the tin. There's a bunch of buildings in a classical style and some ponds with fountains. That's about it - there's really nothing else to the area besides what you bring with you. If you just walk through the place it might take you half an hour, you could probably stretch it to an hour if you brought a sandwich and pose for one of those \"water shooting out of my hand\" pictures with the fountain.\nShow less"]]}}