{"Palm Springs Air Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Palm Springs Air Museum", "url": "/Attraction_Review-g32847-d106643-Reviews-Palm_Springs_Air_Museum-Palm_Springs_Greater_Palm_Springs_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/ba/4d/2c/b-52-bomber.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1589"}, "address": {"@type": "PostalAddress", "streetAddress": "745 N Gene Autry Trl", "addressLocality": "Palm Springs", "addressRegion": "California", "postalCode": "92262-5464", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Exceptional", "This is an exceptional museum of aviation history capturing roughly the period of WWII through Vietnam.\n\nThe displays are VERY well laid out and the descriptions from signage and videos is amazing.\n\nThe condition of the \"restored\" aircraft and other items is a great testimony to the skill and dedication of the many hands that are involved in bringing these great creatures back to life.\n\nParticularly poignant for me was the POW bracelet display and the associated wall of pictures of American heroes by their capture date. Too many faces I recognized.....and the memories that brought back.\n\nI look forward to returning -- there is simply too much to properly absorb in one visit.\n\nVery well done --- thank you all!\nShow less"], ["Reviewed 2 days ago", 5.0, "Great Collection and Other Displays!", "The PS Air Museum covers mostly military aircraft from WW 2 through today. There are also some civilian aircraft to augment the collection. There are fully restored aircraft (many airworthy), displays of models, uniforms, art, weapons, stories, dioramas, etc. There are plenty of docents there to answer questions, and there is a little café to get a snack. The museum is housed in a series of aircraft hangars that are open to the outside weather permitting. A very impressive air museum well worth a visit.\nShow less"], ["Reviewed 2 days ago", 4.0, "Surprizingly fun place to visit.", "We went to the museum thinking it would be a short visit. There was so much to see and even touch we spent a half day! There are planes and jets from WW1 through current day. There is a small fee, but it is worth the money. You can even take a ride on a P-51 plane (much more expensive). Often there are events that you can attend. There are retired people associated with or retired from the military that help guide you or answer questions. It may be emotional if you have had a relative or have been in the military.\nShow less"], ["Reviewed 3 days ago", 5.0, "Top Notch Warbird Museum", "Aviators and history buffs alike will find plenty to see and learn in this collection. The aircraft are oriented chronologically by war experience and permit up and close inspection. Don’t miss the upstairs library, veteran interview recordings, and an opportunity to fly computer simulations. If you like talking aviation, military or otherwise, you’ll enjoy spending time with the old heads upstairs.\nShow less"], ["Reviewed 5 days ago", 5.0, "Recommended as an interesting day out", "I had expected to see a lot of aircraft but they had put so much more into making this an interesting and worthwhile experience. There were hands on areas and a children’s section plus details and photos of the people that flew in these planes and also what happened to them. We spent most of the day there and had lunch in the little cafeteria this is a must visit in Palm Springs\nShow less"], ["Reviewed 6 days ago", 5.0, "Do not miss this gem!", "So much to see. So much history to learn. They have veterans on hand to answer questions making the experience extra special. You must visit this museum."], ["Reviewed 6 days ago", 5.0, "Can't miss for Aviation Buffs", "Wonderful history of U.S. Military Aviation. Great tour by very knowledgeable guides. Spent a couple of hours there and will definitely go back for another tour."], ["Reviewed 1 week ago", 5.0, "\"Where Histroy Comes Alive\"", "The museum opened in 1996 and I think my husband and I came a year or two after that. It has grown a lot.\nThey have plenty of free parking and planes outside to view before entering the museum.\nYou check in at the Visitors Center, and go inside the gift shop. The admission fee is very reasonable, $17 for adults.\nYou are directed to Visitor Services where they tell you about the facility and give you a map. I also picked up a menu for the Freedom Fighters Cafe, but they were closed today, Thursday 2/15. They are having their Annual Gala tomorrow in the evening. It is a big fund raiser event for the museum, which is not funded by the government.\nThe menu looked good, hot dogs, hamburgers, sandwiches, salads, etc. All at reasonable prices. I would like to have lunch there, next time we go.\nThey have volunteers and docents (men who served in the military) that talk about the planes and exhibits and answer all your questions.\nWe arrived in the afternoon and stayed 2 1/2 hours. You really need more time to see everything. They are open from 10 am to 5 pm. Next time I want to spend 4-5 hours there and have lunch.\nThey have planes from WWII and jets. They also have a B-17 bomber open for a tour. My husband took the tour and said it was FANTASTIC! I am not a fan of close quarters so I didn't go inside.\nThere are plenty of exhibits to see and videos to watch. There is a section dedicated to women pilots and those who worked in the factories. They also have a F-16 flight simulator, that would be fun to do.\nThe hangars are all air conditioned which is nice.\nThe museum is a learning experience for both young and old. I don't remember being taught all this history in school.\nOn our way out, we stopped at the gift shop and bought a few things. A T-shirt and magnets.\nAll the proceeds from the gift shop and donations help keep the museum running to Preserve, Educate and Honor.\nYes, I did take some wording from their brochure to make sure what I write is correct.\nI would HIGHLY recommend this attraction when in the Palm Springs area. Can't wait to come back!\nShow less"], ["Reviewed 1 week ago", 5.0, "Air Museum a pleasant surprise", "The quality and quantity of aircraft and displays and general wartime information is world class. Although limited to the US during past conflicts, the aircraft on display are varied and in absolutely outstanding condition. The museum itself is spread through 4 connected, well maintained hangars. Around the inside perimeter of the hangars is enough military information to entertain both casual and serious historians for many hours. They also have a very large and dedicated group of veteran volunteers willing to add to the experience.\nShow less"], ["Reviewed 1 week ago", 5.0, "If you love history and planes, this is for you!", "An intriguing visit to the Air Museum in Palm Springs as volunteers bring alive the history having lived through the times the planes were used. If it wasn't for the volunteers it would just be another airplane museum, but these passionate people share history that brings history alive. Give at least 4 hours to see everything. Definitely worth the time.\nShow less"], ["Reviewed 1 week ago", 5.0, "Superb air museum", "We had a lovely time here with the grandchildren. The museum has few barriers, allowing close interaction with the exhibits. There are planes you can climb in and sit at the controls - which went down really well with the children.\n\nThere is a good range of aircraft here, including many of WW2 vintage and some fast jets.\n\nWe had lunch in the cafe - also good, with a variety of basic food at reasonable prices.\n\nHighly recommended - this museum should be able to keep anyone amused for a little while, even those with little interest in aviation.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great museum", "This a great place to visit. A lot of planes and displays to see. Very well maintained. Planes and displays from WWII, Korea, Vietnam and Iraq and Afghanistan. Reasonable admission. Recommend this when in Palm Springs."], ["Reviewed 1 week ago", 5.0, "Up close and personal with the planes and airmen.", "This is a wonderful museum, staffed by very friendly and informative aviation masters eager to answer your questions. We were able to actually stand underneath the open doors of a WWII bomber bay to see and learn how all the different sizes of bombs were loaded. To realize that these bomber crews were only 18-20 years old was both jaw-dropping and upsetting at the same time. Would highly recommend this as a 'do not miss' attraction in Palm Springs.\nShow less"], ["Reviewed 1 week ago", 5.0, "Wonderful Museum", "Love this museum. The aircraft are well maintained and they were even washing them during our visit. The docents are knowledgable and very nice. The exhibits are very interesting. I loved the decent guided tour of the B-17G aircraft. It looks so large on the outside, but the space for the crew is so limited. Amazing.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fantastic place and experience", "The other day I was touring the Palm Springs Art Museum and I see a lumbering WWII era C-47 overhead... it came from this museum, and they offer rides on it! The rest of the museum - so impressive. First time I ever went through the interior of the B-17 Flying Fortress. Hangers full of planes and parked outside also, civilian and military. Interesting exhibits throughout - videos, displays, models, artwork, educational things, exhibits honoring our military services. I spent a couple hours there and could have spent more I became so engrossed in everything. And I never took the airplane ride, although it was out flying while I was there, and then landed next door and taxied right into the museum court. A great experience, highly recommended. Um, the negative... its not exactly cheap - I think it takes a lot to keep all these machines in good shape; my Adult admission was $17.00. Still, unique and super high quality experience that you don't come across very often.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A fascinating place for all ages", "Well worth the admission fee, which supports a magnificent collection of planes and artifact displays from WWII on. You don’t have to be an Air Force vet, like my husband, to enjoy a visit here. There are volunteers and ‘docents’ throughout the exhibits, many of whom are vets that had personal experiences with the planes on display and are happy to talk with or answer questions. In addition to the fixed displays, working planes are on the tarmac outside and some offer rides for the adventuresome.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Allow plenty of time for this one!", "What a fabulous museum and a real tribute to those who have served. Be sure to allow time for the History channel movie, and the simulated air raids."], ["Reviewed 2 weeks ago", 5.0, "A Must See in Palm Springs", "This air (and naval) museum is one of the best I've visited. The thing that stands out is that the majority of these aircraft actually are flight capable. We visit the Coachella Valley for a couple months per year and always take our visitors and guests to the air museum. It provides an excellent overview of history of WW11, the Korean and many of the other world conflicts since. For a vintage aircraft enthusiast, the photos won't end! The helpful volunteers are full of stories as many were directly involved with these airplanes. Watch for special weekend events which feature knowledgable speakers and often aircraft flight demonstrations celebrating specific world conflict events. The Canada Tribute Day is always well attended by snowbirds. There is also a small cafe to grab a snack and soda.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Spectacular -A Don't Miss Attraction", "If you love Air Force, Naval Aviation, models of aircraft carriers, historical documentaries this is the place to go. Could have spent an entire day there."], ["Reviewed 3 weeks ago", 5.0, "Interesting", "There is lots of interesting things to see there if you are interested in our military history. Be sure to visit the library before you leave. There a lots of people there to explain things."], ["Reviewed 3 weeks ago", 3.0, "First Time Visit", "A very interesting museum seeing vintage airplanes from world war two and the Vietnam war. Interesting looking at the history of World War II in the Pacific and some from Vietnam war. Oh so interesting and looking at all of the conflicts that the US has been involved with countries around the world\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Looking for something to do in Palm Springs? Check out the Palm Springs Air Museum!", "This educational, volunteer-run organization is a terrific place to go and see aircraft dating back to WWII and up to Vietnam. Great historical displays in several hangars with music piped in to match the time periods. A gift shop and small cafe are also on site.\n\nWe've been there in the past with our grandchildren and they enjoyed it very much!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Don't miss this", "Great collection of WW2 and Vietnam era aircraft. The volunteers are extremely knowledgeable and eager to share their knowledge. You can see an example of the F-104 that Chuck Yeager flew, without permission and crashed, as depicted at the end of the movie The Right Stuff. Be sure to tour the B17 Bomber, definitely the highlight of the tour.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "ENJOYABLE Museum!!", "Many planes from WWII, Korean War and Vietnam!! Plus many interest exhibits, including a shadowbox description on the attack on Pearl Harbor, models of many war ships (destroyers, battleships, etc). The B-17 is one of the stars of the show!!\n\nThere are four hangers of planes and exhibits, plus more planes outside. It is across from the Palm Springs Airport and has access to the airport for taxi ways and the runway when they are operating the planes.\n\nA nice touch are the docents who are veterans of the wars and always willing to chat!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Airplane Buffs will be in Heaven", "Airplanes from World War II, the Korean War and Vietnam are on display in four large hangars. There is a B-17 that can be toured for an added $5 fee that my husband enjoyed. Around the sides are other displays, some with videos. There are many volunteers to give you information as you visit each section.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Allow a few hours...", "to fully explore this great museum. This place has some of the best explanations of WW2 battles I've seen - and we've been to dozens of Air Museums around the world. Gorgeous painted murals cover the walls, and beautiful tributes to the Tuskegee Airman, Gulf War and Vietnam vets as well as dozens of beautifully restored planes fill the halls. If you are a Vet, know a Vet or have any interest in war history, you will love this gem.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Went for the B-17 experience . . .", "Ended up staying most of the day. There is something for everyone here with aircraft from WWII thru Desert Storm on exhibit. I had a personal interest in the B-17 because my uncle was KIA after a bombing raid over Berlin in 1944. He was the co-pilot. For a small additional fee you can actually get inside the B-17 which I did. It was an overwhelming, once in a lifetime (for me, probably) experience. The Docents here are priceless. There are several films played throughout the day in the theatre, and there is a research library on the second floor. I got some leads from the Librarian that might help me learn even more about my uncle. I'm so glad I went and I am so grateful to the people who have the foresight and ability to preserve these aircraft and the heroic stories of the Patriots who made up their crews. Visit this air museum. You won't regret it. A wonderful learning experience for the kids too.\nShow less"], ["Reviewed January 23, 2018", 1.0, "Terrible day", "We went to the Palm Springs Air Museum with our grand kids to have a great and informative day. Bummer, we were so done disappointed that we will write reviews to any social media’s available. Kids are definitely not welcome there. They could not seat on any plane, and were told that there were too little to understand. Since when it is an adult museum? We build that visit for weeks to be rebuffed by people who have no customer service or understanding how you can ruin little kids day. I definitely DO NOT recommend that place to visit.\nTotally UNACCEPTABLE\nTheir advertising should let people know that kids are not welcome there\nShow less"], ["Reviewed January 23, 2018", 4.0, "Very Interesting WWII history", "Staff by veterans who know their stuff. There's lots to see covering most of the planes that flew in WWII as well as an old fire truck, 2 vintage cars. It borders on the PS airport so you can watch the planes fly in and out. I think there was only one plane that you could actually climb in the cockpit.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Outstanding", "This museum is outstanding. Not just for their collection of airbirds but for models of ships, info about famous pilots. We thoroughly enjoy the Korea and Vietnam hangar. There were many doecents who could answer questions."], ["Reviewed January 22, 2018", 5.0, "Great Museum", "We have visited a lot of air museums and Palm Springs Air Museum is as good as it gets. It’s staff is knowledgeable but they don’t over power you. Everything is squeaky clean and maintained."], ["Reviewed January 22, 2018", 5.0, "BIG!", "Largest air museum after Evergreen (OR). War themed, some very rare flying exhibits, many good tutorial booths, very fair entry price, dozens of docents, many ex-pilots. Takes a while to see it all--like 2 hours."], ["Reviewed January 21, 2018", 5.0, "Surprisingly interesting!", "So much history at this museum. Airplanes are awesome. Worth a visit at any age. Not only do you get to go through airplane hangars full of planes, as a side benefit you can watch the planes at the Palm Springs Airport take off and land. The cost is $17.00 to enter. There is also a small restaurant. We had lunch there, and it was very good. Reasonably priced too.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Ps Air museum", "One of the best air museums in the US I’ve been to many this is worth a stop If your hungry there’s a place to eat if you’re thirsty there’s a place to drink if you want air-conditioning in the hot summer they have at the airplanes they have there are some of the finest examples of airplanes are seen in the world not to mention almost all of their airplanes must be maintained in flyable condition you will not find that with the aircraft and other museums though there are impeccable condition they do not fly\nShow less"], ["Reviewed January 21, 2018", 4.0, "Fun For All Ages!", "We were visiting Palm Springs with a group of 17 (ages 10 to 73) so decided to check out the Air Museum. Everyone loved it! The kids loved the flight simulators and the grandparents liked talking to the staff about the history of the planes. Highly recommend.\nShow less"], ["Reviewed January 21, 2018", 4.0, "History", "Went there with our Son & Daughter-in-law and Granddaughter had a great day felt very informed. Would love to go back again 😎😎"], ["Reviewed January 19, 2018", 4.0, "Great Golf Alternative", "This museum has the broadest collection of WWII and Vietnam fighter aircraft anywhere. The contrast between the 1940's and late 60's aircraft is amazing. Lot's of great stories. Wonderful volunteers."], ["Reviewed January 18, 2018", 5.0, "Extremely well presented", "We went to look at the planes and tour the B-17; loved them, but the stories, memorabilia and many volunteers were the highlight. As a veteran, I appreciated the meticulous care, detail and research so obvious in their displays. The Pearl Harbor attack diorama was exceptional.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Took my Dad.", "My father was visiting for a month and he is a veteran of WW ll. He is now 94 years old and thoroughly enjoyed the displays spanning the WW ll Pacific and European theaters, along with Korea and Vietnam. Most of the aircraft are still flyable and pass over my home on special occasions.\nShow less"], ["Reviewed January 17, 2018", 5.0, "A must see", "$15 senior rate. 49 Vintage aircraft and a B-17 bomber open for interior touring. Great docents that help you understand the history and use of each plane. A B-25 Mitchell bomber like used on the Doolittle raid. Also a BRITISH Spitfire & 3 Migs. WWII, Korean, & Vietnam planes, with displays everywhere and pictures of Write Brothers flights, Tuskegee Red Tails and women aviators\n\nShow less"], ["Reviewed January 15, 2018", 4.0, "Nice display of old planes", "It was nice to see all those planes in perfect condition and to be able to seat in the copkit of a real war plane!"], ["Reviewed January 14, 2018", 5.0, "The best day ever.", "The only time I have been this close to planes is when I FLY IN THEM!! haha. Seriously super duper cool."], ["Reviewed January 13, 2018", 5.0, "Terrific air museum", "Lots of lovingly and carefully restored aircraft. Vast majority of them are in one of three large hanger areas each for a different war time - WWI, WWII and VietNam. Museum also has information on particular pilots, details about the wars, uniforms, medals, etc. Shades of Maverick and TopGun, I especially liked the film about a dogfight during the VietNam war. There are a number of docents eager to share their experiences and knowledge. Small cafe in the rear food and drink. Discounts for military and AAA as well as some occasional other coupons.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Cool air museum!", "My husband and I enjoyed our visit here! Get a great history lesson across the many decades and wars. I also enjoyed watching the planes take off and land next door. Beautiful views of the mountains too!"], ["Reviewed January 12, 2018", 5.0, "Really great even if this is not something that in your typical interest!", "My husband has been telling me this is the best museum he has ever gone to for the last several years. I finally went, and although I may not go that far, I really enjoyed it (my interests generally run more toward art, food, design, fashion, etc). The stories that are told are incredible and there is so much to see. We were there for several hours, but I think it would probably take several visits to see everything and do it justice.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Great collection", "Would recommend this amazing museum collection for all ages. A definite must for tourists to Palm Springs."], ["Reviewed January 10, 2018", 5.0, "Spend some time here!!!", "If you have ANY interest in aviation this is a must see museum, even if you aren't an aviation enthusiast it is worth the entry price. Lots of vintage WWII and other aircraft, and there is always veteran fliers there to relate their experiences of flying the aircraft and tell you the history of them. I went there while waiting for my flight and didn't have to have the rental car back, so it's just a 5 minute drive to the other side of the airport. Great place for kids too. Highly recommend that you go to visit it, as a previous reviewer said you can spend hours there.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Great Air Museum", "We visited this hidden jewel on the first Saturday of 2018 and listened to Lt. Col. Dean Hunter tell his story. He is a great story teller. He is also a docent at the museum on a regular basis. I encourage you to visit this wonderful jewel in Palm Springs. They have four hangars of aircraft and displays that are very well done. It is easy to spend a day there.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Lots of War History", "What a remarkable place. Hangers from WWII thru Vietnam are filled. There were a few Vets to answer questions & tell you about their experiences at Korea & Vietnam. The MIA/POW wall & Bracelets they've collected is worthwhile seeing. You can enjoy being a pilot & gunner upstairs too.\nShow less"], ["Reviewed January 7, 2018", 5.0, "What a unique air museum where they actually fly the airplanes", "A unique air museum where they actually fly the airplanes. A lot of atmosphere is added by the veterans working as guides in the museum. One of the best air museums I have ever been to. Our 2 year old kid loved the old fire truck though. And to add to this they are actually flying these amazing machines when we were there. Just wow. This is a must to visit when in the area.\nShow less"], ["Reviewed January 6, 2018", 5.0, "A must see when in Palm Springs!", "This museum is incredible not just because of the planes, exhibits, library, and flight simulator, but because of the amazing docents, many of whom are veterans. They add so much to the experience of this museum with their knowledge and personal history. They were so friendly and accessible, often walking up to us and beginning a conversation. We spoke at length with Jim, who was just amazing with his knowledge of aircraft carriers and warships.\n\nBeyond the docents, the airplanes are fascinating. They are all parked on the ground (versus hanging from the ceiling) so you can touch them, look in the windows, and even climb into some.\n\nThis museum is well worth your time. It is interesting and highly educational.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Informative", "Had a great time. So many photos, info, and memorabilia. Flight simulators, theater to view films, library, lots of planes to climb into and explore. Many Vets work there and are very knowledgeable.Cute gift shop."], ["Reviewed December 30, 2017", 5.0, "Great museum with wonderful volunteers.", "Must see for history buffs and airplane buffs alike, and for those who want to teach their kids that freedom isn't free. We were hear over Christmas vacation, and they fired up and flew two of their vintage planes as a gift to their guests. Such a treat! I can't say enough about the volunteers here. All were so knowledgeable, friendly and gracious. A great group of folks!\nShow less"], ["Reviewed December 28, 2017", 5.0, "This is now my favorite air museum", "This is now my favorite air museum because you can get close and touch the aircraft and even climb through the B17. There are also many volunteers who have great stories and facts that make the place special. Since we had a few hours until our flight departed out of PSP, my wife and I spent just over 2 hours there, and we are so glad we did so. I have been to air museums in Europe, Wash DC, Virginia, McMinnville, +; and this one deserves a visit.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Outstanding Air Museum", "The Palm Springs Air Museum is located next to the Palm Springs Airport. It has an excellent collection of vintage air craft from the Second, Korean and Vietnam Wars. It is housed in converted hangers which gives you an appreciation of how these aircrafts helped to fight these conflicts. Retired veterans are more than happy to offer insight into the life and times of air men during these difficult times.\nShow less"], ["Reviewed December 27, 2017", 5.0, "First-rate air museum", "We have been to both sites of the Air & Space Museum numerous times and found this a unique and enjoyable experience. Staffed entirely by very knowledgeable volunteers and offering hands-on opportunities, it was fun and educational."], ["Reviewed December 26, 2017", 5.0, "Very nice Museum!", "Very nice museum. large variety of planes and displays. Staffed by members very enthusiastic about their museum. Stopped to listen to their stories of service to the United States."], ["Reviewed December 25, 2017", 5.0, "Nice piece of history", "Great air museum, especially if you are interested in military air history. There is some general aviation history, as well, including a nice wall dedicated to women in aviation. Kind and helpful docents everywhere ! Good sandwiches and burgers for great price in the cafe !\nShow less"], ["Reviewed December 24, 2017", 5.0, "Been there three times", "Fascinating museum to visit, veteran pilots present each time. A lot of dedication and hours showing love of the history of flight went into this museum. I keep returning as I find something new to learn, or a new film or video to see each time. Fascinating!\nShow less"], ["Reviewed December 24, 2017", 1.0, "Very loud, annoying, propeller planes disturbing the peace", "Very annoying, low flying and loud propeller planes all day and everyday. What about the poisonous fuel falling on top of us all day from these planes?"], ["Reviewed December 24, 2017", 5.0, "great tour and guide", "The planes were wonderful, and our guide was so informative, we really enjoyed everything about this tour. Would definitely recommend to anyone who has any interest in planes or history."], ["Reviewed December 23, 2017", 5.0, "A place to see.", "Have a few hours to be able to see everything. Learned a lot, Lots of very interesting stories. Many people to help you around and to ask questions to. Worth going to see."], ["Reviewed December 22, 2017", 5.0, "Wow, this is a new must stop for my visitors to the Desert", "Spent 2 hours with my brother there after we met a docent at breakfast. Fascinating salute to the Best Generation, and to all those who have served,so that we may live in Peace. I immediately became a member."], ["Reviewed December 22, 2017", 5.0, "Christmas Vacation", "Our family really enjoyed the displays, history, the Warbird’s and other aircraft at this museum. The docents were extremely friendly and knowledgeable. Go by and tour. Your admission fee and donations help them keep these birds flying!"], ["Reviewed December 21, 2017", 5.0, "Great place to study history and see some beautiful airplanes", "We spent a couple of hours at the museum and still have one hangar we didn't get to. Beautifully kept planes, enthusiastic and caring docents. And, for $15, not a bad price for adults. There is also a cafe and gift shop. Take time to climb inside the B17 Flying Fortress and imagine what it was like for the crew!\nShow less"], ["Reviewed December 21, 2017", 4.0, "AIRPLANE SPECIAL PLACE", "This museum is just wonderful and gives adults and youngsters alike the opportunity to see aircraft up close and there are lots of exhibits and you can enter and explore all sorts of planes."], ["Reviewed December 21, 2017", 5.0, "Great education and experience", "Excellent staff and volunteers, best opportunity to see US military aircraft. On certain days, open access cockpit tours, and some occasions flying aircraft take passengers."], ["Reviewed December 21, 2017", 3.0, "A Piece of History", "We went there to see one of the planes our nephew flew for the Navy. We were told it his name would be left on it and wanted to take a picture. Well it was and we did. One of the guides took us to the plane and gave us some history on it, it's arrival and so forth. He was very knowledgeable and helpful. I wish we had left more time in our schedule to look around this place because there is a lot to see.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Very interesting. Coolest photographically.", "I thought I was just going to kill some time before I picked my sister up at the airport. But I brought my sister back with me and we enjoyed checking out the planes and many of the interesting displays. Very well done."], ["Reviewed December 11, 2017", 5.0, "Fantastic History, Great Staff!", "I grew up flying (instead of driving) to see my grandparents and family. My dad was a pilot and worked his entire life in general aviation. Having been around airplanes most of my life I like to see museums dedicated to aviation. The Palm Springs Air Museum is one of the best! A beautiful Staggerwing Beech had just landed and was on display, a fantastic restoration of this 1930's aircraft is just one of many fully operational historic planes you can see at the museum. We toured an airworthy B-17 (you can walk through) to get the experience of what it was like to be in the aircraft, what the crew did and how they did it. Most of the planes on display are airworthy (meaning they can still fly) with complete backstories of the planes and the people who flew them. The staff are very helpful and knowledgeable, eager to help you understand what your looking at. You don't need to be an aviation enthusiast to enjoy this museum. Allow yourself at least a couple of hours to fully experience, a must see if your in the area!\nShow less"], ["Reviewed December 8, 2017", 5.0, "Excellent museum!", "Staff were friendly and knowledgeable and exhibits were extensive and excellent. A must see for pilots or those interested in aviation."], ["Reviewed December 6, 2017", 4.0, "Enjoyed my Visit", "This is a really cool military museum to visit, especially since the restorations are accomplished by dedicated veteran volunteers. The old planes look fantastic, and are backed up with detailed information kiosks and film. I especially liked the veteran volunteers there to answer questions. The B-17 can be toured for an additional $5. Easy to spend a couple of hours here and well worth it. Also cool to watch jets taking off at next door runway.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Checking Out the Air Museum", "If you are interested in air planes this museum is a must. They have the largest collections of World War II flyable planes. They also have American history on the war and how the air power changed the outcome of the war."], ["Reviewed December 5, 2017", 5.0, "A taste of our country's history", "We learned so much. A real enjoyable day. Learn about our history and those who fought for us all. Not just for military or WWII history buffs."], ["Reviewed December 3, 2017", 5.0, "Awesome Air museum!", "We went to the air museum thinking there would be a few planes. Not so!! There were four hangers packed with planes! Great place to learn about past wars and how planes helped and changed through the wars. The docents are very knowledgeable and are everywhere! They even have a list of POWs where we found my great uncles name. All ages would enjoy this trip.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Had a great time.", "My son (8 y) loved it here. Learned a lot and had a wonderfully interactive experience. The B17 was a highlight."], ["Reviewed November 30, 2017", 4.0, "Great escape to beat the heat", "The airplanes and helicopters on display were great to see. Loved the historical displays and technical information they gave about each machine. The docents were a lot of retired military with great stories."], ["Reviewed November 29, 2017", 5.0, "Terrific-must go if you have Rug Rats", "very well done air museum, lots of old timers manning the place as voluteers-well done. we were fortunate to see one of the planes used in the pacific in wwII start its engines and then to our astonishment, it taxied to the runway and sure enough it took off-a terrific sight\nShow less"], ["Reviewed November 28, 2017", 5.0, "Fascinating collection of historial artifacts that bring personal experiences alive", "We were pleasantly surprised at the breadth and depth of the collection. In addition to the aircraft that served in WWII, Korean War and Vietnam War, there are dozens of models of airplanes and war ships, uniforms, personal letters, photographs, and other memorabilia. There is a strong educational component, with recorded videos in various areas, an interactive children's area, lecture room, and special exhibits honoring women in service, the Tuskegee Airmen, US Presidents in service, to name a few,\nStaff of volunteer docents are mostly war veterans that are ready and willing to share their experiences to enrich a visitor's appreciation of the real action that took place -- really makes history come alive!\nWe saw so much in 2 hours, but there is so much more to see. We will definitely return another time!\nShow less"], ["Reviewed November 26, 2017", 4.0, "a real history lesson", "I thought this museum was great. I am not generally interested in airplanes, but anybody who went through WWll or if your parents told your stories, or if you used to watch war movies, this is really an interesting way to spend a couple of hours. The best part is that it has so many volunteers working there, many of them war vets, that you can practically get your own guided tour, just keep asking questions. You can climb inside planes and imagine what it was like for the young men who actually had to fly in them. The whole thing became a fascinating history lesson. I highly recommend it.\nShow less"], ["Reviewed November 26, 2017", 5.0, "A Great Air Museum at Palm Springs Airport", "I love air museums, and this is among the best I've visited. It focuses on military aircraft from WW2, Korea and Vietnam, impressively displayed in three era-specific hangars on spacious grounds.\nThe highlight: the perfectly preserved B-17 you can tour with a docent for a small extra charge. Well, well worth it, especially in view of how rare they have become. Most planes are in flyable condition. The entire facility is lovingly spotless and possesses a strong historical and patriotic vibe.\nWonderful for all ages and plenty of parking at its convenient location at Palm Springs airport.\nShow less"], ["Reviewed November 26, 2017", 1.0, "Very annoying propeller planes flying in circles around during our hotel stay", "These propellers planes were flying so low around our hotel all day, even in the nighttime, until 8 pm we could hear these propeller planes. We had to put our phone calls on hold while the loud propeller planes flew over us and in general we felt very bothered with the constant low flying propeller planes in our very expensive Palm Springs vacation stay.\nShow less"], ["Reviewed November 25, 2017", 4.0, "History in detail", "To see the aircraft that helped to win World War II was an eye opener. The fighter aircraft made me realize that our pilots went out to battle well equiped"], ["Reviewed November 22, 2017", 5.0, "Awesome Air Museum", "I did an event at the museum and was offered a free and unsupervised tour. The aircraft they have are awesome. It's a great way to spend the day, especially when the weather is super hot. You can visit this ir conditioned museum and see some very cool stuff!\nShow less"], ["Reviewed November 21, 2017", 5.0, "HISTORY", "Enjoy the air museums and all the history they have,. The guides were excellent and gave us a lot of information. Would go back again"], ["Reviewed November 20, 2017", 4.0, "Well conceived and produced museum", "First of all, I am not a big enthusiast of museums. To me, museums are full of dust, old items and memories. However, after passing by this museum for the past 20 years and not going in, I made an effort to see it this year. I was more than just pleasantly surprised at how clean and well-lit all the displays were and how much work has gone in to make this a museum of history of our military aviation and included some film and hands-on demonstrations. It is divided into segments that include WW2, Korean War, Vietnam and the cold war. There is a wonderful library with catalogues of information and yearly chronicle of events. There is also a flight simulator than can be operated with the supervision of an instructor. I thoroughly enjoyed talking to all the volunteers in the different locations and they were very knowledgeable and eager to answer questions or add to the explanations of the displays. Many of the aircraft have small replica models that show cut-away portions of the fuselage and other operating parts of war planes. Seeing what is underneath the skin of the airplane was very interesting. Many of these aircraft are flown even today. It is well worth spending at least three hours in this museum, longer if you really want to absorb our aviation progress for the last 75 years.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Jets, Planes, Helicopters and History", "I was so surprised by this museum. It was well worth the visit. Our history is so fascinating from the aviators perspective. It is so interesting to see all the different kinds of jets and planes up close. Even on a couple of them you can go inside. The people who are there to guide you thru the museum are so helpful and knowledgeable. I would not miss this museum.\nShow less"], ["Reviewed November 19, 2017", 5.0, "A pleasant surprise", "I did not expect to find a museum of this quality in Palm Springs. First, the facility is first class; large modern hangers, The quality and diversity of the planes on exhibit is amazing. A number of them are actually operational. There are many great examples of aircraft from the 2nd world war, Korea and Vietnam conflicts so it is difficult to pick out any favorites but I was particularly impressed with the B-17 and B-25 bombers. For an additional $5 you can tour through the B-17. The guides that are located through out the facility are very helpful and knowledgeable. If you are planning a visit to Palm Springs a visit to the Air Museum is a must.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Don’t miss this", "This air museum is truly where history comes alive. The museum is huge over 89,000 square feet. There are over 49 vintage aircraft From WWII through Korea and Vietnam. There is a B-17 bomber open for touring (extra 5 dollars). There is extensive aviation art, murals and dramatic exhibits. The Pearl Harbor diaorama is amazing. The docents are very knowledgeable and helpful, many are veterans themselves. You will get goosebumps as you read the stories of the brave men and women who fought for our freedom. Truly a MUST SEE!!!!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Great place to spend Veteran's Day!", "PSAM is a great place for history or aviation buffs and a wonderful museum for visitors of all types. We were lucky to be able to visit on Veteran's Day as the museum had live fly-bys as well as B-25 and Stearman biplane rides. The displays are very well maintained as many of the planes are in flyable condition and you can get \"up close and personal\" with virtually all of them. The docents are friendly, helpful and a great source of information. It's well worth it to spend the day there, as reading all of the information displays, watching the many video presentations, and admiring the planes and the courage and dedication of the men and women that flew them will take some time. Better yet, come back a second or third time to catch all the things you missed before!\nShow less"], ["Reviewed November 14, 2017", 5.0, "Make it Your First Stop", "This museum is absolutely amazing and is placed in actual hangars. The thousands of hours put into restoring all the aircraft is unbelievable. The retired volunteers are ex-military veterans, each one with an abundance of amazing stories. The museum is wheelchair accessible and you could spend hours taking it all in. The F16 flight simulator is a real treat. It is an actual simulator and not just a video game. The simulator instructor is an ex navy pilot instructor who actually teaches you how to fly (in the simulator of course). Truly a unique experience unlike no other.\nShow less"], ["Reviewed November 14, 2017", 5.0, "If you like aircraft history you;ll enjoy a visit here", "Great display of WWII aircraft and a lot of history. Also many knowledgeable staff/volunteers to answer questions. Numerous hangers to visit and a gift shop. Really enjoyed it."], ["Reviewed November 13, 2017", 5.0, "Most of the planes here can still fly", "I am not one for military planes, but I still found this museum interesting. This museum is dedicated to educating the public about the role air power plays in preserving American safety in military eras of WWII, Korea and Vietnam wars. There are veterans on site to answer questions about some of the exhibits. There is an inside and outside area as well as a cafe and library. Upstairs you can try a test flight on a computer. There were planes in front of the museum as well.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Had to do it!", "My hubby is really knowledgeable about planes and the wars. He wanted to experience this and we didnt realize how close it was to our route.\n\nThe entrance fee was reasonable. They have a lot of great displays. Very educational. This makes history tangible and more relatable.\n\nI would def recommend this anyone who has interest in military history. They have put a lot of effort in restoration and presentation.\n\nIf youd like to shoot some great pin up shot this would be an incredible place to do it.\n\n\nThat being said...contact them directly. I do not know what the policy is.\n\nAgain best thing is you can touch these planes. There are several you can get into.\n\nI liked the parachute wedding dress display and story. The wall of women in aviation was epic.\n\nI recommend this if you have time. This is not a quick stop. It took us 2.5 hours.\n\n\nShow less"], ["Reviewed November 11, 2017", 5.0, "Amazing!", "Must do for aviation and military enthusiasts. Great displays. Helpful staff floating around, good facilities"], ["Reviewed November 10, 2017", 4.0, "Large Collection of Aircrafts with Friendly Staff", "The museum consists of four warehouse sized rooms filled with aircrafts and exhibits. There are over 50 aircrafts on view and you can go inside several of them and sit in the cockpits. However, the panels with information on the aircrafts and the exhibits are dense, lengthy, and not very accessible or interesting. It was still nice to wander around the museum though simply to see the aircrafts and the docents are knowledgable, friendly, and bring the museum to life.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Great collection", "We spent a fun morning seeing the collections. My husband had a great time on the flight simulator. Informative volunteers were always ready to answer questions."], ["Reviewed November 10, 2017", 4.0, "If you love vintage aircraft, this is the place for you!", "It's amazing to see all the vintage aircraft that are here. All the restorations has been performed by volunteers which is even more amazing! Many of the volunteers that are on site has personally flown in some of the aircraft at the museum. How cool is that??\nShow less"], ["Reviewed November 9, 2017", 5.0, "A great history of military Air Travel in the US since WWI.", "Have four large hangers with lots of planes from different eras of wars. Great dioramas, signs and exhibits along with some vehicles and ship models. Great Diorama of Pearl Harbor attack."], ["Reviewed November 9, 2017", 4.0, "Lovely little museum with some great planes", "Coming from Washington, DC with the Air & Space Museum, we are always interested in checking out other Air museums when we travel. This was a really beautiful collection and their WW II artifacts are wonderful. Children especially loved the flight simulators with retired pilots as guides!\nShow less"], ["Reviewed November 9, 2017", 5.0, "The Gift of History for the Whole Family", "This museum has an incredible combination of historical artifacts and narratives that complement the planes on view. It is the most well maintained and complete air museum that I have seen outside of some Smithsonian exhibits. Time your visit to be able to sit in the cockpit of a jet fighter and snap a photo for your history!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Huge museum", "Not a quick stop. There are more than a few hangers to check out and the people who work/volunteer there are helpful and very informative. Great visit."], ["Reviewed November 8, 2017", 5.0, "Great WWll Planes", "I was primarily interested in the B-17 flying Fortress and was not disappointed the Ball Turret is open so you can see how cramped the space is where the airmen had to climb into and sit, it was just astounding"], ["Reviewed November 6, 2017", 5.0, "Unforgettable experience", "WW2 and Vietnam war planes, apparently almost all still in flying condition. You will come away with a small degree of what it was like to serve in these wars. What makes it so special are the abundant staff (ex-service men) to show and tell you everything. Interactive video and simulators will send you back into a time never to be forgotten.\nShow less"], ["Reviewed November 5, 2017", 5.0, "A Great Place to Visit and Educate yourself and children", "This is a must see attraction when your in Palm Springs. Entry is not all that expensive and there are wonderful exhibits on World War II and the Korean War. Planes, and other equipment is available to actually touch. There are plenty of Docents to explain anything to you and many educational experiences available. There is a brand new Vietnam hanger just opened.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Up close and personal", "Interesting mix of Aircraft and historical information in a fairly intimate setting. The real wealth of information here is supplied by the supremely enthusiastic and helpful Docents and Staff. Not often can you climb into the equipment and really imagine what kind of harrowing experience the Pilots and Crew navigated. Great for all ages and interests but really fantastic for Aviation enthusiasts or history buffs.\nShow less"], ["Reviewed November 3, 2017", 4.0, "History buffs should allow full day", "As a military history buff, visiting here was like a trip to the promised land. Four hangers contain most of the major aircraft used in the major wars of the past century.\n\nThere are cases and cases of models of hundreds of planes and ships. There are murals and exhibits to read as well as interactive displays. It is overwhelming - even for a history lover. Allow a full day.\n\nThe only negative was that when I wanted to remember my visit with a souvenir from the gift shop, I found the selection lacking. Many of the items had the 20th anniversary from 2016. But I was there in 2017. By the time they sell all that merchandise, it will be their 25th anniversary!\n\nIt is located on the far side of the airport from the city.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Big collection of restored Military Aircraft, and history", "This is a worthwhile visit, not just for those interested in aircraft (including from WWII, Korean, Vietnam, wars etc) but for the vast amount of military history on display. Perhaps best are the docents--veterans , many (all?) of who have served, and who can answer questions and tell you about what you're looking at in detail. Four big hangars of displays plus aircraft outside on display. Even a fun cafeteria for lunches! Plan for 2-3 hrs to take it all in.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Museum Visit", "As a commercial pilot and War Bird gear head, I can tell you this is one of the best Air Museums in the US. Nice selection of A/C. The static displays are unique and very well done. They have one of the P51 Red Tails on display. This is the same P51 that raced at the 2017 Reno Air Races. If in Palm Springs be sure and take three or four hours to visit the place……you will not be disappointed.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Great selection of war birds.", "Worth the drive to experience flight history. Educiancial for all ages. Large selection planes to view."], ["Reviewed October 26, 2017", 5.0, "Interesting Visit to Palm Springs Air Museum", "I very much enjoyed going to see the Palm Springs Air Museum. The planes are amazing to see and in very good condition. There are many planes that were involved in the war effort such as World War II.\n\nThere is also many videos to describe the planes, what the role of the planes were, and more.\n\nThere is a gift store and small cafe.\n\nStaff is very nice.\n\nI went on a hot day - one building is air conditioned, but just be prepared if going on a hot day to be a bit tired afterwards. Drink plenty of water.\nShow less"], ["Reviewed October 23, 2017", 4.0, "palm spring museum", "history in any courner in thisplace great for family time price low people here is super fredenly they explain all about plain history"], ["Reviewed October 22, 2017", 5.0, "Even more to see", "Since our last visit, the museum has opened a very interesting Korea/Vietnam hangar, and just as with all the other displays, the information is very clearly set out and put into a human context rather than a merely technical one.\nThis is a fantastic place to visit; especially when they have open cockpit days.\nYou can spend hours there, you don't even have to be an aircraft enthusiast.\nThe volunteers are so knowledgeable and friendly.\nThere is so much to see and the cafe is excellent.\nThe restrooms are spotless and well kept.\nThe shop is well stocked and has a wide range of items.\nPlenty of free parking.\nA wonderful day out (again!)\nShow less"], ["Reviewed October 21, 2017", 5.0, "Planes everywhere!!", "Many planes from all eras are in hangers. You can walk right up to them. Great photo and history opps. Plenty of staff there to answer questions. You could spend hours there. Nice gift shop. I really enjoyed being so up-front and personal with soooo many aircraft.\nShow less"], ["Reviewed October 20, 2017", 4.0, "So many planes and interesting stories from the engaging volunteers", "Visited with our 5 year old son and he loved the vast number of planes and being able to see them up close and watch the videos of some of them flying. For adults there was a lot to learn and the place really came to life with the personal stories both on the displays and from the volunteers (many of them ex-serviceman) who actively engaged you to answer questions and share their own thoughts. Going on the cramped B17 in the hangar is a terrifying insight into WW2 and the conditions of the young soldiers.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Wonderful Military Air Power History Lesson", "Visited the museum while my wife was attending a conference. It is wonderful to be able to get so close to these war birds! Well worth the modest admission price. Very friendly docents and staff, don't miss the B-17 hangar!"], ["Reviewed October 14, 2017", 4.0, "Just The Spot For a History Buff", "Three big hangers loaded with WWII, Korean and Vietnam era aircraft. My favorites were the B-17 from WWII and the F4 from Vietnam. Each display had an explanation of the history of the aircraft. And if you had any questions lots of volunteers willing to share their own knowledge. If you are a history buff or just a veteran who served you will enjoy several hours at the PS Air Museum.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Very educational", "We loved the Pearl Harbor exhibit. Also the Vietnam exhibit. Was hot out that day but back and forth to the air conditioning helped. Really enjoyed talking to WW 2 vets! Lots of amazing aircraft from the era."], ["Reviewed October 11, 2017", 5.0, "Worth a Visit", "Good range of exhibits, not too expensive, Interesting and well presented. Only downside for me was the desert heat and glare when viewing the outside exhibits. Recommended."], ["Reviewed October 8, 2017", 5.0, "Lots to see and touch", "We spent 4 hours at the museum and didn't get to see and read everything they have on display. There's a lot on display for what looks like a small museum. I liked that you can get up close and touch the planes where other museums make you stand behind ropes.\n\nWhen we went in November 2016, they had a history of WWII exhibit in the hangar and had many planes outside. Not sure if they have the same display or if there is a different theme in the hangar.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Wonderful historical visit with Beer Garden fundraiser", "Historical maps and histories of conflicts with aircraft that is inspirational. A great venue for those interested in our WW2 history. The Beer garden was an effective fund raiser for a great cause"], ["Reviewed October 2, 2017", 5.0, "Great for kids and adults", "A fun interactive time and lots to learn in our history of aircrafts. A must see if you come with kids over 7 to the valley."], ["Reviewed October 2, 2017", 5.0, "Really nice!", "We were in love with the museum, so many planes, so many history, everything very good organised, with a lot of super friendly volunteers! It was great!"], ["Reviewed October 2, 2017", 5.0, "Enthusiastic guides", "Very interesting museum with some quality aircraft present. Extensive library. Odd items of interest - USMC Mighty Mite for example if the owner is there he'll give you an interesting yarn on how he bought it."], ["Reviewed September 27, 2017", 5.0, "Entertaining and Informative!", "This is a really good attraction to take the time to see. Not only is it fun but it is historic and education. A definite must see!"], ["Reviewed September 25, 2017", 5.0, "What a venue!", "Visited here as part of an industry convention. What an unbelievable place to hold an event. Staff were amazing. Museum was super cool and the volunteers were incredible. Learned a lot, had a ton of fun and took some amazing pics!"], ["Reviewed September 25, 2017", 5.0, "Great Aircraft", "This is a must do if you are in the area. 4 large hangers with a collection of planes dating from WW2 to present A key part of the visit is the many docents waiting to show you around. Easy parking"], ["Reviewed September 18, 2017", 5.0, "Interesting", "Visited last summer and thoroughly enjoyed our visit very I interesting going around all the lanes and trying to land a plane on the simulator was great best of all was meeting some of the veteran pilots and chatting listening to their stories fantastic"], ["Reviewed September 17, 2017", 5.0, "Fun for the whole family BUT leave the less appreciative soles somewhere else if you can!", "Love this kind of history! Plenty of volunteers to answer your questions. Great historical aircraft displays. I leave the less interested soles somewhere else allowing for a more enjoyable visit"], ["Reviewed September 8, 2017", 4.0, "Enjoyable", "A nice exhibit of aircraft used in WWII thru Vietnam era. Lots of volunteers to answer any questions. Many volunteers were military personnel. Have a senior rate."], ["Reviewed September 6, 2017", 5.0, "High Flying Dellight", "This is a real gem, right here in Palm Springs. To be able to walk between the aircraft of our history; to view the exhibits and special events are some of the things I really like about this museum...and I'm a local. Recently I purchased a ticket to fly in one of the few remaining Ford Tri Motor Aircraft. What a treat. It was a beautiful to look at as it was to experience in flight. And these opportunities continue to be offered on a regular basis. Check it out, I do every year.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Surprisingly interesting!", "Never thought i would be interested in aircraft. Not a lover of flying AT ALL, I went along because my dear husband takes guests there and this time it seemed rude not to go. I am an art historian so I am predisposed to like museums, but the subject matter just not my cup of tea. NOT SO! GO! The history is something we can all be interested in and the funny old planes that got us victory in WWI and WWII are well worth seeing, the photographs, too. (I remember an Ansel Adams temp exhibition there that was excellent and totally unexpected) Well curated and well worth a visit. I think good for kids over 8, too.\nShow less"], ["Reviewed August 30, 2017", 5.0, "My son loved it", "Very interesting and fun way to discover these historic planes. The guides were friendly and happy to provide information."], ["Reviewed August 30, 2017", 5.0, "Unmissable if aviation is your thing", "An outstanding collection of military aircraft from 2nd world war and other conflicts.\nStaffed by very knowledgeable volunteers who seemed to get great pleasure in talking to you. This added to the experience\nThe majority of the machines in the museum are exhibits capable of flight, this together with the fact that you are actually allowed to touch and get in these machines is what makes this collection virtually unique\nFree parking, modest entrance fee completes the package\nShow less"], ["Reviewed August 28, 2017", 5.0, "First time to an air museum", "Very worth visiting. A huge library with books, magazines, computers for interactive games. All sorts of memorabilia on wars, planes, services, service members. The men working there were very friendly, helpful and informative.\nYou can tell they enjoy what they do.\n\nThe planes and displays downstairs were amazing. You can sit in some of the planes. Kids love it. Set aside at least two hours.\nShow less"], ["Reviewed August 17, 2017", 5.0, "What a fun time out of the sun!", "What a fun time we had. The aircraft were all inspiring and amazing. The B-17 takes you back to every WWII documentary that you've ever seen. It's all so incredible."], ["Reviewed August 15, 2017", 5.0, "fun for old and young", "The museum was very interesting and and informative. The staff were friendly and helpful. My eight year old grandson had a very good time. He especially enjoyed the flight simulator."], ["Reviewed August 14, 2017", 4.0, "Why history buffs need to visit", "So often in life, many things are theoretical especially historical events. The Palm Springs air Museum captures several historic moments in time via Aircraft. Aircraft alone will paint a canvas of technology, but paired with the staff of Veterans it immerses you in the moment. Hearing the stories makes every visit a unique experience.\n\nTo make your visit more memorable, take a flight in one of the retired planes.\nShow less"], ["Reviewed August 13, 2017", 5.0, "History you can see and touch (mostly!)", "You can't touch all the exhibits, but there are many planes you can actually go into, best one is the B17 Bomber from WW2 that's 1 of 11 still operating planes. They ask a minimal donation of $5 per adult that we were more than happy to pay\nShow less"], ["Reviewed August 12, 2017", 5.0, "Great for History and Airplane Buffs", "A must see, good for the entire family. Knowledgeable docents bring the museum alive. Climb aboard one of the planes and visit the visual presentation of the attack on Pearl Harbor"], ["Reviewed August 8, 2017", 5.0, "A \"must see\" if you are in the Palm Springs area and love planes and history!", "A nice way to spend a hot afternoon and get \"cool\" tour of the museum. There are so many planes to see throughout three hangers. The planes are nicely displayed along with other displays such as ships, some antique cars, firetruck, WWII memorabilia. You can also go in the cockpit of one of the planes for a small donation. There also is a flight simulator. Worth the trip.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Worth a visit", "Had a look around very interesting lots of world 2 war planes went inside one plane really impressed by our guide."], ["Reviewed August 8, 2017", 5.0, "Big place, spend a few hours at least", "Something for every age group and lots of experienced old timers with stories. Plenty of eye candy. Cafe is so so, so eat ahead and plan on walking around quite a bit."], ["Reviewed August 7, 2017", 4.0, "Stopped in for the afternoon", "It was a wonderfully entertaining and educational spot. Lots to see and learn. However, their snack/drink area was closed which would have been nice to have some sodas and or cold snacks since it was so hot."], ["Reviewed August 6, 2017", 5.0, "Very Interesting Place", "Visit the museum mid day. There were a lot a aircraft that were very well restored. Also a lot a historic WW II, Vietnam an Korean War pictures and memorabilia. The librarry was quite interesting. Over all a fun experience."], ["Reviewed August 3, 2017", 5.0, "Ah mazing", "Make sure to visit the library upstairs too. My 10 year old son and I had a week wonderful afternoon here."], ["Reviewed July 31, 2017", 1.0, "Has no respect for Guard and Reserve military members", "Claimed to offer a military discount. Asked and was told it was not available to Guard and Reservist. Asked why, \"You don't really serve.\" What an offensive remark and an affront to 800,000 Reserve Component members and their families. First and only place I have ever been where a business explicitly excludes Reserve component members. They claim to be huge supporters of the military but their actions tell another story. This is about money to them...nothing more.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Plane fun", "A must-see one of the top five items to view in Palm Springs during your stay great history wide variety of different planes from all years"], ["Reviewed July 21, 2017", 5.0, "Awesome air museum", "Visiting this museum is a must when in Palm Springs. Impressive collection of planes, some helicopters and a few motorcycles, trucks and jeeps. Very clean, large, easy to move around and you're able to get very close to the aircraft.\n\nWe were given a tour of the Boeing B-17G (you get to walk through most of the airplane), which was absolutely fantastic! Well worth the extra $5 donation that provides a very knowledgeable custodian that walks you through the plane.\n\nHighly recommended!\nShow less"], ["Reviewed July 21, 2017", 5.0, "Take a trip back in time.", "If you are looking for a unique activity that will transport you back in time and remind you of the heroic efforts of our armed forces check out the PS Air Museum. They just recently added a new area dedicated to the Korean and Viet Nam theaters. The World War II collection of aircraft is one of the best in the USA. Many of the volunteers are veterans with first hand knowledge of the aircraft and interesting stories to share. Check their schedule to see when they are having flight demonstrations.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Fantastic place to visit", "Such a huge place inside with several levels. Would recommend to anyone, very informative staff. Came upon this purely by error did not see it advertised anywhere."], ["Reviewed July 18, 2017", 5.0, "Aviation and WW2 history in detail", "If you're not into history, don't go to the Palm Springs air museum. If you are into history, don't leave town without a visit. Up close and personal with rare and historic airplanes and knowledable docents to make your visit worthwhile. In addition a great display of the attic on Pearl Harbor that will bring what happened to life. Plan on at least two hours. You will not be disappointed!\nShow less"], ["Reviewed July 14, 2017", 4.0, "Air Museum", "My Husband and I went to the Air Museum for a few hours. It was fun to see all of the airplanes on display. The movies that are shown are very interesting. My husband is a pilot so to him it was a really great day for him.\nShow less"], ["Reviewed July 13, 2017", 5.0, "One of the best Museums in Palm Springs", "If you are visiting Palm Springs you don't want to miss the chance of seeing this place. They have a huge display of planes and history the whole family would enjoy. If you're lucky you might get to enjoy the Chili Cook off they do. This place is so clean you could eat off the floor.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Great Place to beat the heat", "It was such a nice place to visit and great for the kids. They have a kids area where they can climb in and out of planes. Volunteers are also AMAZING."], ["Reviewed July 10, 2017", 3.0, "Love the music!", "there are four separate areas to view aircraft according to there time periods. There was a nice representation of aircraft and memorabilia that went with them. It would have been nice to see in cockpits instead of just what you could see from the ground.\n\nThere were several gentleman about the place to ask questions, they seemed very knowledgeable.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great!!", "This air museum was really a blast, Great time with family, They offered a lot of things to do ,Saturday we were able to put together wooden model airplanes. Had a open cockpit we were able to get our picture taken.All staff were friendly and knowledgeable, love it there, All kinds od world war 2 warbirds,I highly recommend a visit a must for your Palm Springs visit!!\nShow less"], ["Reviewed July 10, 2017", 5.0, "See Planes up close", "If you love military planes you will really enjoy the experience. There were mainly planes from WWII. However, they just opened a new area with aircraft from the Korean and Viet Nam war. The best part was that you can walk right up to the planes ... no barriers. There were plenty of docents to talk to about the planes too. I was able to talk to someone who served on a PT boat.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Wow!", "Small but mighty these planes are fantastic and the view from the hangar is great. Truly a gem in the desert of Palm Springs."], ["Reviewed July 8, 2017", 5.0, "Friendly Staff - great collection of planes", "We visited on July 4th and had a fabulous time.\n\nThe staff were very engaged and keen to chat and swap stories around the subject which made a huge difference to our enjoyment\n\nThe highlight was a tour inside the Flying Fortress- let's hope they get it airborne again soon\n\nA great local attraction - top thing to visit in Palm Springs\n\nFun for all ages!\nShow less"], ["Reviewed July 5, 2017", 5.0, "Magnificent museum", "Magnificent place to learn all about the history of the planes during WWII. Good for families ,the elderly and schools."], ["Reviewed July 5, 2017", 5.0, "Great exhibits", "Fab place to visit with wonderful exhibits and informative guides to tell you about the air craft. Highly recommend the guided tour through the B17 Flying Fortress"], ["Reviewed July 2, 2017", 5.0, "Bigger than Expected!", "This place was amazing!! Much bigger than you'd expect. The docents are epic! They are extremely knowledgeable about everything there. Lots of planes, there are various interactive planes, and this museum is picture friendly. Great for families, friends, kids...it's just cool for everybody. They have AAA discounts. It's definitely a place to visit, you could spend most of a day here.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Amazing!", "Really enjoyed the time spent visiting the Palm Springs Air Museum. It was great to see all the old warplanes. The fact that many of the airplanes still fly really makes them special. The new Cold War hangar is a must see. Go there and enjoy the visit!\nShow less"], ["Reviewed June 29, 2017", 4.0, "interesting", "One of our party was into Military planes so we spent morning - quite interesting -lots of hands on and staff and volunteers very entusiastic"], ["Reviewed June 27, 2017", 5.0, "If interested in WW2 and Viet Nam aeronautical history, this is a must see", "We went to the Air Museum several years ago and decided to go back when we learned there was a new hanger covering the Korean and Viet Nam era. This museum is very special in that many of the docents actually worked on and/or flew the aircraft. Obviously many of these people are not going to be around a long time. The planes are beautifully presented with very interesting back ground information. (Many are not flyable though). The exhibit on Presidents who served was very interesting. This is something worth seeing!\nShow less"], ["Reviewed June 26, 2017", 5.0, "Small museum with very helpful Volunteers", "Nice place to spend a few hours if you enjoy planes and history. Very well preserved displays. Enjoyed the afternoon."], ["Reviewed June 25, 2017", 5.0, "Interesting and Amazing...🤗...", "The more you see the more you want to learn at the Palm Springs Air Museum. It's very interesting and amazing...And the staff/volunteers are very helpful informing and/or assisting you. Also, the museum has new displays \"Korean and Vietnam Wars\"...DON'T MISS OUT...😉..."], ["Reviewed June 22, 2017", 5.0, "New attractions.", "New Vietnam display. Most all volunteers and they are vteranns and very knowlegeable about the the planes. WWII to Vietnam with alot of displays and movies."], ["Reviewed June 22, 2017", 5.0, "A Major Highlight for me", "As a WWII historian and an aviation enthusiast, I love this place. And I especially love the perfectly preserved B-17 that you can climb into and experience the interior of WWII's most famous bomber type. The veterans that staff the museum are great to talk to.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Excellent representation of aircraft", "The museum is awesome and well worth a trip. The docents were WWII vets...that alone gets my $$!! The quality and amount of different aircraft is astounding...quite the collection!!"], ["Reviewed June 15, 2017", 4.0, "Splish Splash", "First time partying at Splashhouse event won't be my last! Not so hot weather bonus for the weekend of musical craziness. Had package with tickets and room at the Rivera it was jammed their to."], ["Reviewed June 14, 2017", 4.0, "The Love of AirCraft", "Interesting Place to go especially if you love aircraft. There are several planes that you can touch an actually go inside in the left hanger. The right hanger has this Great small display of Peal Harbor behind glass. Many interesting displays."], ["Reviewed June 9, 2017", 5.0, "Wonderful Learning Experience", "Don't miss this well-run and informative museum! Powerful day and experience! The docents are well-trained and helpful. The planes on display speak volumes about our history!"], ["Reviewed June 9, 2017", 5.0, "Great Memorial Day Event", "We were fortunate enough to take an Uber over to the air museum on memorial day. The museum was crowded with visitors and there were many speeches,displays and recognitions having to do with Memorial day. This is a great location to keep you out of the sun. Even though it was a hot day, the large hangers were cool.\n\nWe were greeted by a number of docents, many of home were in the various wars that are depicted in the air museum. We were fortunate to meet one such docent who served in World War II and served in the Solomon Islands. We read all of the exhibits and we're very interested in the exhibit on women in the military. I also enjoyed the large map that depicted the Pacific theater and all the different battles in that area during World War II.\n\nWe were treated to some flyovers by some of the World War II planes that are still flyable in the museum area. It was quite interesting to see an old fighter fly by there at the airport doing a low pass and then a few minutes later air Alaska fly in with passengers deplaning at Palm Springs. We also enjoyed lunch in their small cafeteria or dining area and the food was fine. Couples would enjoy this or families with children who are a bit older, lots to look at and enjoy.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Volunteers give great information", "Every area had someone who would give an informative talk about the different airplanes. You can climb through several planes to see the inside."], ["Reviewed June 6, 2017", 5.0, "Wonderful exhibits", "We thoroughly enjoyed each exhibit. Having been to almost every air museum this was right up there. Nice to be able to get close each aircraft. You can even get inside a B-29 ,one of their planes they are restoring! We enjoyed a chicken Caesar salad at their cafe' and was a pleasant yummy surprise. (A half size was HUGE).\nWe would highly recommend!\nMy wife even enjoyed this including the antique pin-ball machine.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Pleasantly surprised", "It's a pretty cool museum. You get history from different perspectives. Definitely pay the extra $5 to go inside a plane, well worth it."], ["Reviewed June 6, 2017", 5.0, "Great piece of history!", "Great place to go see. The volunteers are all great and had a world of knowledge and experiences to share."], ["Reviewed June 5, 2017", 5.0, "Top 5 air museum with wonderful / knowledgabel staff", "My wife & I have visited many air museums throughout the world. The Palm Springs Air Museum is a beautiful museum with volunteer staff that are passionate & knowledgeable about the museum & the aircraft. The majority of the aircraft are still functional & beautiful. Great presentations! Plan to spend the day if you really want to see the museum properly.\nShow less"], ["Reviewed June 3, 2017", 5.0, "A must see. A step back in time.", "Well today we toured the air museum. The facility and its airplanes are amazing. A shout out to Bob and Dave who were two of the docents we were lucky to have during our tour of the B-17. I could have sat with Dave and listened to his stories for hours about his service in WWII in the Philippines.\nThe hard work and dedication to all those involved in the restoration and development of this museum is unbelievable.\nThanks to all you !!!\nShow less"], ["Reviewed June 2, 2017", 4.0, "very interesting and you can tour some planes too", "We enjoyed the history and did climb aboard certain planes for a donation. we also saw demonstration of some actually fly!"], ["Reviewed June 1, 2017", 5.0, "Memorable Memorial Day", "The Palm Springs Air Museum has an outstanding tribute to our troops on Memorial Day with World War II aircraft doing flybys and the dropping of red and white carnations from a B-25. There are exhibits, hangers of military aircraft from various wars and rides in vintage aircraft.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Check it out", "Loved the air museum. It was great for young kids with lots of displays and things to see and planes to sit in. The staff seem to be volunteers and all lovelly and helpful.\n\nIt has a really amazing collection of flying historical warplanes.\n\nMake sure you go up and check out the simulators in the library.\n\nDefinitely recommended\nShow less"], ["Reviewed May 29, 2017", 4.0, "Great Memorial Day experience despite the blazing heat", "Excellent, knowledgeable and friendly staff. Fun carnation drop with fly over. Very kid friendly. We were seating bullets but still had a good time."], ["Reviewed May 29, 2017", 5.0, "Great museum!", "This is a fun museum to visit, and there are lots of enthusiastic docents that are interesting to talk to."], ["Reviewed May 28, 2017", 5.0, "Quite an interesting attraction", "There are so many, well preserved war planes here, you actually have no problem sizing the pilot's experience. Many have stairs to let you see inside cockpits, while you can walk inside other planes. Exhibits are really interesting and do get your attention. They were offering rides on b-52s for the holiday. Iwaa really impressed and learnt so much more of WWII, Korean and Vietnam wars.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Pleasantly Surprised", "I have to admit, I went for the pressed penny machines. This type of museum isn't usually my cup of tea but I enjoyed my visit. I learned some things about WW ll that I didn't know. There were VERY knowledgeable volunteers to answer questions or in my case give you a very interesting short history lesson. The war was over before I was born but I grew up with seeing a lot of the memorabilia and the museum's collection brought back memories.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Awesome day with airplanes", "Have an interest in aviation or military history? If so, do not miss this gem! I've been to well over a dozen air and space museums, and this one is right up there with the best. It's not super big, but it's high on quality, so much so that we spent 4-5 hours enjoying the exhibits. It's really great they are preserving these momentous pieces of history. We hope to visit again, especially as they are soon opening a whole new exhibit hanger.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Make sure you tour the B-17 Bomber!", "An amazing aviation museum! At first glance, I wasn't impressed - it's basically a small main building with a gift shop and hangers out back. BUT once you start exploring, you will become engrossed with the numerous planes, the exhibits about local men who served (and died), the miniature Pearl Harbor ships meticulously detailed, etc. But the real highlight is being able to actually tour the massive B-17 bomber. You are able to tour it with a guide and see all the areas of the plane and hear some amazing stories about the brave men who crewed the B-17s.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Aviation History at its best", "This is an outstanding air museum. It is one of the best places anywhere to view vintage planes, especially those from WW11. The displays are attractive, informative and interesting. The history behind each of the planes and the WW11 background is detailed and yet holds one's interest. It is even possible to climb inside some of the planes (if you dare). For taller people, it is a stretch (pun intended) to stoop down enough inside some of the tight spaces. We have enjoyed our visits here on multiple occasions, taking various people for their first experience. Aviation history at its best...\nShow less"], ["Reviewed May 23, 2017", 5.0, "Air Musuem Rocks", "This museum is the place to take anyone who wants to realize the spectacle of our military air power over the years, especially in WW2. A wonderful place to share history with young people and let them understand the story."], ["Reviewed May 22, 2017", 5.0, "Had to breeze through", "Only had one afternoon to play around in Palm Springs and decided that the air museum was the best way to spend it. I only had a couple hours but learned an awful lot and I was really glad that I spend the time there.\nThis is definitely a must for any aviation enthusiast and the location near the airport allows you to see some modern and classic airplanes.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Spend an Interesting Afternoon with vintage planes", "While I live literally at one end of the Palm Springs Airport (can walk to the departure gate in under 15 minutes) and drive past the museum going to the I-10, it wasn't until this spring that I finally went. They had a Ford Tri-Motor and that lured me over. It is a nice facility but huge sections were shut down so you couldn't see the entire selection. My father who was a US Army Air Corps flight instructor would have loved it. During special events that are held every weekend, I often see vintage planes fly overhead.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Palm Springs Air Museum Is Great Fun And Worth The Time", "At first glance I had no idea how big this museum was. Wow! It has wartime aircraft in four big air conditioned hangers and even more outside on the tarmac. The displays are very well done with explanations of all aircraft on display. I was lucky enough to meet a docent, David Sawyer, who was extremely knowledgeable and was able to give me all kinds of tidbits about the planes and their history in wartime. Make sure to make enough time to spend several hours. There's lots to see.\nShow less"], ["Reviewed May 20, 2017", 5.0, "An Interesting and Informative Museum", "A fine collection of old (and some not so old) warbirds. The volunteers are well informed, informative, and enjoyable characters who help make the exhibits enjoyable, including some of the histories of the aircraft types on display. The flight simulators are fun, even though we non-pilots seemed to have a tendency to crash. Strongly recommended for anyone who has an interest in military aviation.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Fascinating!", "We spent hours at the Air Museum and it was awesome. So many interesting stories, items and the staff was well-trained and could answer any questions. So many interesting aircraft and a well-stocked library you could spend an entire day here."], ["Reviewed May 16, 2017", 4.0, "Planes Up Close & Personal", "It was nice to get up close and see some of the \"warbirds\" on display here. Knowledgeable docents. Look for their discounted admission coupon in the local guide. Allow at least 90 minutes for your visit; more if you want to try the computer flight simulations.\nShow less"], ["Reviewed May 14, 2017", 5.0, "Great attraction", "Best air museum I have ever experienced. Focused mostly on WW II through Vietnam era's. The volunteers that help run the museum are very knowledgeable and friendly, which helps make the visit even more special. We worth a 1-2 hour visit."], ["Reviewed May 14, 2017", 5.0, "Private tour of B-17", "If you love military aircraft, this is the place for you.\n\nWent late afternoon about 2 hrs before closing on a Sunday. We had the place pretty much to ourselves. Spouse took the private tour of a B-17 bomber and loved it. He was able to go inside the plane and lol around.\n\nWe spent so much time looking at the planes that we ran out of time to go upstairs to try the simulators so we must come back.\n\nThere is a building that has aircraft from the Korean and Vietnam wars that can only be entered from the outside so don't forget to visit that room.\nShow less"]]}}