{"Palm Springs Aerial Tramway": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Palm Springs Aerial Tramway", "url": "/Attraction_Review-g32847-d104111-Reviews-Palm_Springs_Aerial_Tramway-Palm_Springs_Greater_Palm_Springs_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/19/38/6a/photo0jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "7599"}, "address": {"@type": "PostalAddress", "streetAddress": "1 Tramway Rd", "addressLocality": "Palm Springs", "addressRegion": "California", "postalCode": "92262-1828", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Do the ride and dine!", "It was $10 more to have a ride and dine than just the ride. Beef burgandy, veggy lassagna, pork ribs or chicken were the protein options. Sides were mixed veggIes, fingerling potatoes, mashed or corn cobette.\n\nThey have a full bar up top. It was 13F at the top when we headed down to a beautiful view of the valley lights.\n\nIt was beautiful with the fresh snow.\nShow less"], ["Reviewed yesterday", 4.0, "Wonderful experience but expensive", "Ok, this is worth doing as can be seen from the rating. However, bring plenty of cash! Firstly, we had assumed that we would not need to pay for parking. Wrong! Stupidly, we hadn't realised how cold it would be even we could see snow on top from Palm Springs. So make sure you get well wrapped up. If you do this and it is cold, I can recommend the chowder in the cafe. Even though it is expensive, it is very warming!\nShow less"], ["Reviewed yesterday", 5.0, "The tram is definitely worth a visit", "There are beautiful vistas at the top. Bring your camera. You do stand once inside the Tram. It does revolve so it doesn’t matter what side you stand on.\n\nFirst you drive four miles up the road to park for the tram. There are restrooms, gift shop, etc. there. Once you get onboard the tram and get to the top, there are more facilities. There is hiking too. The Palm Springs visitor center is at the bottom of the hill so that’s a convenient stop on your way to the tram.\n\nNote: it seemed like a bit of a walk uphill to get to the tram after we parked our car. There are various parking lots and you will be guided into the lot that is open.\nShow less"], ["Reviewed yesterday", 5.0, "A must see", "We tried the ride and dine, and was worth the price. We walked from the road and was a tough hike. And used Lyft on the way down. I would go again."], ["Reviewed yesterday", 5.0, "Desert View Trail", "Plenty of informative notes from travelers about the Tram. So this is a hiking review:\n\nWe opted for the easiest trail. Temps were below zero w. gusting winds up to 34 mph, so we didn't feel like Jeremiah Johnson.\n\nOn the bottom of the paved walkway, a ranger asked, \"Where are you headed?\" and when we mentioned Desert View Trail, he told us, \"Folks tell me Notch 3 has the best views.\"\n\nWe set off on the well-marked trail. Pace yourself, the altitude is 1.6 miles (13.6 km) at the mountain trail. Let yourself acclimate to the thin air. We hiked to all 5 notches (easy to find), and the ranger was correct, Notch 3 was impressive. There were several large boulders to sit on (lunch, sketch, gaze).\n\nAnd the views were magnificent.\nShow less"], ["Reviewed 2 days ago", 5.0, "Wow!!!", "Absolutely great activity to do when in Palm Springs. Beautiful view below and because of rotating motion all the way up, you get to see from all points of view. Nice hiking trails at the top as well."], ["Reviewed 2 days ago", 5.0, "Unique experience", "The tram is area is well run, having each group ready to go when the tram arrives, which seemed to be about every 20 minutes. Try to be the first or last to board and you will be up front. There is really no bad areas to stand.\n\nSomeone takes your picture on your way in and they are ready to purchase when you reach the top.\n\nWe sat in the bar and had wine and a humus/olive platter. They were both excellent. I thought that the prices were very reasonable for a tourist area.\n\nThere are steps to climb to enter the facility. NO dogs are allowed on the tram.\nNot really suitable for small children (steep cliffs), especially if you don't have warm clothes for them.\n\nI hope that this review was helpful.\nShow less"], ["Reviewed 2 days ago", 5.0, "Incredible view and great hikes", "Not only is the 360 degree tram a one of a kind experience -it offers amazing view of Palm Springs and area. At the top, the view is breath taking. Appreciate the history and culture provided throughout the building. The employees are very knowledgable. Went on a couple little hikes but could easily spend several hours up here. We were only there for three hours. Did not visit restaurant this time.\nShow less"], ["Reviewed 2 days ago", 5.0, "Great view of the Coachella valley", "The aerial tramway is unique in that the car rotates as it rises up 5.800 feet up to 8,800 feet. On most days the views are great. In the summer it is about 30 degrees cooler up at the top. Hiking, restaurants and a small gift store at the top.\nShow less"], ["Reviewed 2 days ago", 5.0, "Nice rice to spectacular views", "We decided to do the ride and dinner combo ($36/person) and thought it was well worth it. You ride up after 4:00 and are able to have dinner at the buffet after 4:30. It is day light going up and dark coming down the lights of Palm Springs glitter - it is beautiful! Be warned to dress in layers. It was 56 degrees F when we left the base and it was 16 degrees F at the top. It felt like a ski lodge with some light snow coming down. Romantic! There is a bar as well as a sit down restaurant. We chose the buffet that was included in the ticket and were please with the food.\nShow less"], ["Reviewed 2 days ago", 4.0, "An exceptional way to see Palm Springs & the Salton Sea", "Easy to access; plenty of parking; several restaurants to choose from; several walking trails; souvenir gift shop; theatre with a short movie providing the background to the building of the Tram"], ["Reviewed 2 days ago", 5.0, "Snowsuit in the Morning, Swimsuit in the Afternoon", "This is a fantastic experience. You can purchase tickets online or on a “first come, first served” basis on the day of your adventure. If you purchase online, make sure you print out or download the tickets before arriving as there is no cell service. Also, arrive 45 minutes before your departure time as you need to allow for parking and getting in the departure area ten minutes before your scheduled time. You enter on an access road, pay $5.00 for parking and are assigned a lot. A shuttle bus takes you to the tram building. Make sure you have winter clothes (jacket, warm shoes, gloves, hat, etc). There can easily be a 40 degree change in the temperature from the bottom to the top. The trip takes about ten minutes and the floor rotates 360 degrees. However, do position yourself by a window so your view is not obstructed. There are lots of decks at the top if you do not feel like hiking. We took the loop Desert Valley 1.5 mile trail. It has five “notches” for magnificent views. Although, this is a “easy” trail, you walk downhill to it, and navigate many rocks. My fitness tracker showed a total of fifty flights of stairs. It took about an hour to walk the trail and stop for pictures. After our hike, We enjoyed a bowl of chili in the cafeteria restaurant. There is also a bar and a waiter served restaurant at the top. You may have a brief wait to descend, depending on crowds and the tram schedule. We loved our day and upon returning to our hotel, we were poolside in our swimsuits.\n\nShow less"], ["Reviewed 3 days ago", 4.0, "A must do", "The tramway was great! So glad I got up early and was able to spend a full day hiking. I think the path back to the tramway can be difficult for those that are not in good shape or elderly."], ["Reviewed 3 days ago", 5.0, "Must do", "If you are in Palm Springs, find time to do this. Views are outstanding. The tram takes you up to 8600 ft above sea level."], ["Reviewed 3 days ago", 5.0, "Amazing", "Just what you would expect- be prepared for 30-40 degrees colder at the top. The short ride is amazing and fhere are beautiful walks to take at the top."], ["Reviewed 4 days ago", 5.0, "Awesome", "Was a fascinating and beautiful experience! Will definitely do it again, hopefully in the summer so we can do some of the hiking trails. Was too cold for that in February!!"], ["Reviewed 5 days ago", 5.0, "Cold", "The fact that the car rotates ensures everyone has great views. Spend the time to wait in the FRONT of the line to get to a window. We were last on for the trip up (still fine) but learned. Check the temp up top before you leave. It was cold!\nShow less"], ["Reviewed 5 days ago", 5.0, "Amazing views!! Desert to Forest in minutes, crazy.", "I must say I balked at the cost of the tram ride at the beginning, but once we were up at the top I was glad I went forward with it. The tram ride itself was amazing with a rotating floor that makes two full revolutions during the trip up and again back down. This gives you a chance to see from all angles. Once at the top we followed one of the trails that was about a mile loop. It led to some incredible views of the desert valley below. It was in the low 70s at the desert when we entered the tram and in the low 40s at the top/in the forest - so be prepared for this. There were some spots of snow and ice (med Feb) and we saw more than one person slip as they adventured away from the main trail looking for better views or taking pictures. This crisp mountain air was quite refreshing. But mostly, I cannot adequately describe the incredible views from various spots along the trail. It was well worth it and I highly recommend it.\nShow less"], ["Reviewed 6 days ago", 5.0, "Great views", "Great views and a great history lesson. The tram ride is 11 minutes each way with all the time you want at the top. A must see"], ["Reviewed 6 days ago", 4.0, "Awesome View", "Had no idea what to expect and overall it was fun. Food at the top was average but satisfying and loved the view. Outside was much colder than the bottom and wish I’d thought of that or someone had mentioned it earlier as we could have stayed outside longer and would have enhanced the experience to take a joke up there in the Alpine climate.\nShow less"], ["Reviewed 6 days ago", 5.0, "nice view quick ride to the top", "The view was nice, the ride up was very quick but very cold at the top. We went at night during February."], ["Reviewed 6 days ago", 4.0, "Unsurpassed view of the valley", "Very educational ride and movies about the area at the top. Places to eat both at the top and bottom. Many hiking trails at top and all require a very strenuous section of downhill cross back trail. It's even more strenuous hiking back up, should only be attempted by serious hikers or the very most physically fit. You could spend all day here, but some people just hit the highlights in and the building on top. We had to wait 1 1/2 hours for the tram ride up and about 20 minutes for the tram down. Often long waits going up and coming down on weekends and during peak hours. Try scheduling your trip early morning on a weekday for the smallest crowds and shortest lines.\nThe tram itself is one of the longest and highest trams in the world. It's a rotating tram, rotating more than 2 times during the one way quick trip. It's a little tricky to keep your balance in the outside row when going over the 4 towers since the swings and the outside handrails keeps moving and the floor moves too. It's much easier to ride in the interior rows where the handrails are stationary and goes the same speed as you.\nIt's really a valuable experience that I recommend you go if you can afford it. It costs about $25 each plus $5 parking.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very Interesting Site to Visit", "The tram takes you to an elevation of over 8000 feet and temperature is 30 degrees less than the valley floor. the circular tram is apparently the largest in the world and was packed going up and down before noon and Would suspect all day, even though the temperature was in the 50s going up and 28F at the top. Dining facilities and a cafe at both levels and a gift shop on both levels. Well worth the visit to see nature and to walk the travels if you are fit enough to do so.\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth it", "Great views and a pleasant walk at the top to see even more amazing views! We even found areas of snow in the forest at the top of the tramway. Would recommend."], ["Reviewed 1 week ago", 5.0, "An Awesome Experience", "A long way up in a short amount of time. The views are amazing & the climate change is dramatic. It's fun & a must when visiting PS."], ["Reviewed 1 week ago", 5.0, "So cool", "This is a great experience. The view at the top of tram is amazing. It is unexpected cool, only -6 degree at the peak"], ["Reviewed 1 week ago", 5.0, "Must see Palm Springs attraction", "We took the tram with our friends who were visiting from out of town. The tram experience is one of the must do activities when visiting the area for the first time.\n\nThe staff was friendly and efficient. The tram is comfortable and roomy. It is a little bumpy when going over the support towers.\n\nThe views at the top are fabulous. Dress warmly though! I can be cold and snowy at the summit.\nShow less"], ["Reviewed 1 week ago", 4.0, "A fun experience but colder than expected and think air at 8700 feet,", "Four of us took the Aerial Tramway rise. It was fun with breathtaking views of panorama. The tramway cars hold about 40 people each; the floor rotates 360 degrees so everyone gets to see the mountain and the panorama going up and down. The facilities were very nice at the top with walkways for better views of the panorama in all directions; plus nice dining room area; bathroom facilities; and gift shop. The staff were friendly and professional. In general it was a very good experience. A little pricy, but we felt well worth it for a half-day of fun and adventure. Note: It was cold up there -- about 10 degrees colder at the top than the bottom; and the thin air adversely affected one of our group..\nShow less"], ["Reviewed 1 week ago", 4.0, "Great views of the valley if its not cloudy", "Took the tram for the second year in a row to the San Juncito State Park. Great views of the valley on the way up and down the mountain. Gondola cars rotate so everyone gets a good view. There is a short 1.5 mile roundtrip hike at the top with 5 stops to visit for stunning view of the valley but make certain to go when there are no clouds obscuring the view. Remember the temperature at the top is 30-40 degrees colder than on the valley floor so dress accordingly if you are going to walk around.\nShow less"], ["Reviewed 1 week ago", 4.0, "All the View You Want Without Any of the Palm Springs Flair", "This is a not-to-miss attraction. And for midcentury architecture fans, both stations are world-class and fascinating. However, they have been subjected to very, very painful Home Depot suburban-style updates. The food and drinks are unremarkable. But the view and hiking is amazeballs."], ["Reviewed 1 week ago", 5.0, "Bring a jacket", "There is a thirty degree difference from the bottom of the tram to the top. The view of the men’s. And the valley are spectacular. A bit pricey $25 over ten. But, this is a must see. The tram rotates as it moves."], ["Reviewed 1 week ago", 5.0, "Wonderful sights", "Excellent tour. the 11 minutes ride up the ride is great. The sights are wonderful. Bring a jacket to the top, as there was a drop of 35 degrees, when we got to the top. Well worth the time. The rotating tram car gives you excellent views of the valley and the mountains.\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth the time", "This was very interesting and worthwhile. Only takes about 10 minutes one way. Great views of the valley, assuming no clouds. Has some nice hiking trails. Good information on the way up and down."], ["Reviewed 1 week ago", 5.0, "On a clear day you can see forever!", "Interesting trip to the top with a rotating tram car to maximize views. A bit steep so not great for those who don't do well with heights. Trails, a restaurant and gift shop at the top. Bring a jacket as its quite a bit colder on top.\nShow less"], ["Reviewed 1 week ago", 5.0, "Must visit in Palm Springs", "A great way to experience the mountains and see the city from a whole new perspective. Wear warm clothing as it is as much as 40 degrees colder than the city."], ["Reviewed 1 week ago", 3.0, "Takes Forever to Return!", "Beware - going up is easy with a reservation but coming back down took over 90 minutes of waiting! Also, if you go at night when it's dark you won't be able to see a thing."], ["Reviewed 1 week ago", 5.0, "It's the Number One Attraction for a Reason!", "So glad I finally made it to the top of Mount San Jacinto and had the chance to hike around the top. We went on the short hike to the viewpoints and were wowed by the vista. It was a bit hazy the day we were there but was still very impressive to see the highs and the lows. The trip up and back was a thrill ride, especially when coming to the towers where the tram would swing a bit.\nPretty good gift shop and two dining choices at the top.\nShow less"], ["Reviewed 1 week ago", 5.0, "Cold and Beautfiful", "It snowed! We knew it would be cold, but didn't expect snow. 17 degrees up top and 52 down below. A treat, but we couldn't do any hiking. NO worries, gives us a good reason to go back. The tram ride up is so peaceful and we loved the way it turns around to give everyone a good view. Tip: You can stay up as long as you like. If the weather is good, go later and try to come down when the sun goes down so you can enjoy the city lights!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great experience!", "It's a great experience if you're not afraid of heights! You should also be aware that it gets very cold at the top! When I went it was sunny and warm down on the ground but snowing ontop of the mountain"], ["Reviewed 1 week ago", 5.0, "Wow!", "This is an exhilarating ride to the top of San Jacinto mountains. The view is stunning, there are walking paths up at the top, a restaurant, a gift shop and a theatre. We went during daytime hours but in hindsight, going up late afternoon, having dinner, and taking the tram down in the evening would be breathtaking.\nShow less"], ["Reviewed 1 week ago", 5.0, "Wow!! You have got to go!!", "Had an amazing time, insane trip in tram up onto the mountain!! It's safe & comfortable. Had lunch in restaurant not a cafe spot. Great service & seating. Prices higher but not totally crazy. 8 adults with drinks was $240.00 + the cost of tram itself. It still is worth it!!\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautiful views on hike", "This was the second time we hiked the loop just past the ranger station. There was snow and there were parts of the trail that were icy. Some hikers we passed were wearing chucks (converse sneakers) and were slipping and falling on the ice. Just wear hiking boots or at least sneakers with a good tread and you will be okay as long as you watch your step. Ice grippers on your shoes (yak tracks) were recommended by the rangers but not required. We kept to the right when starting the trail as recommended by the very friendly rangers in ranger station. The hike was slippery in some spots and steep in some spots but the area is beautiful. Once we started around the other side and were headed back the views of the valley below were amazing. A few years ago we saw quite a few deer as we were hiking but this year we did not see any. It could be it was too early in the season or the loud people ahead of us scared them off.\nOverall a great hike. Steep in places. Wear proper footwear and bring water.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful but terrifying", "I don't enjoy heights so this was difficult for me, but hiking around in the mountains was well worth the scary tram ride. The views from the top of the mountain are remarkable and the air is indeed fresh and cool. If the valley floor is hot, you may even want an extra layer for the cool heights.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun Day with the Family", "So loved this trip - the tramway - one of 3 rotating tramways in the world - is so fun. If you are a bit squeamish, stand back away from the windows. The state park at the top is amazing. Great for little kids and big alike. Great visit!\nShow less"], ["Reviewed 1 week ago", 5.0, "Palm Desert", "Great day trip. Tram ride is fun, walking trails for all levels. Lunch at the restaurant was welcomed after a nice hike and delicious. We made the second train up in the morning. We left the top about 12:30 and it was starting to get very crowded.\nShow less"], ["Reviewed 1 week ago", 5.0, "first time visit", "Great thing to do while visiting good value must see nice ride great views great hike helpful staff save for the guy at the information desk dont know if he had a bad day or not but being rude was very noticeable."], ["Reviewed 1 week ago", 5.0, "Cloudy tram ride", "Our trip was planned well in advance so the day we took the tramway was cloudy, but still enjoyable. The valley could not be seen from the top of the mountain but we enjoyed the ride and learning about the area and building of the tramway. There is $5 parking charge not included in the ticket price. We wondered around the area for a bit, had a Bloody Mary and appetizer before taking the tram down.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Views", "Great views Great experience with revolving tram cars. Check weather b4 going up could be snow at top or sunny & warm w/no snow. Must be a good walker if you plan to explore"], ["Reviewed 1 week ago", 5.0, "An amazing ride.", "Wow just magnificent view and I loved the story of how it was constructed which you can find in the visitor centre. A friend who suffers from sea sickness found the rotating a little difficult so if you are prone take your usual precautions and you will be fine do not make it an obstacle to going. Wear warm clothing. When you get up there there is so much to do and see. Do not miss it.\nShow less"], ["Reviewed 1 week ago", 5.0, "Wow..fun day", "Had a very enjoyable day at 8500 feet..hiking and the tram was so nice..great day above Palm Springs!!"], ["Reviewed 1 week ago", 5.0, "More than just a tram ride!", "We did not realize that the tram is not only interesting in itself, with magnificent views of the Coachella Valley, but provides access to a wilderness area that most people would otherwise not see -- Mt. San Jacinto State Park.\n\nThere are easy walks in Long Valley -- Nature trail, etc., but they don't make clear that the only way down to the valley is a path with a long series of switchbacks. It was not as hard to come back up as I expected, but it is a hike. Also, they are not kidding when they say it is 30 degrees cooler at the top than in Palm Springs.\nShow less"], ["Reviewed 1 week ago", 5.0, "Unique Experience", "Views you'll get no other way.\n\nThe tram, which is a few miles north of Palm Springs proper, is well worth a half-day's effort and the roughly $30 per person price. The cars ascend and descend every 15 minutes. They tend to be crowded, but rotate, so you get a couple of 360 degree views on the very steep route. (This is not an adventure for people who are afraid of heights.) You'll get better views if you stand by the glass than if you stand in the middle of the car.\n\nAs other reviewers have mentioned, it is much colder at the top than at the bottom. Take layers. At the top is a nearby nature trail with spurs from which one can take in views of the desert below. Many passengers use the tram as a way to get to and from the hiking trails at the top, too.\nShow less"], ["Reviewed 1 week ago", 5.0, "UP, UP AWAY!", "We arrived in Palm Springs for a night. My daughter told us about the Tram so we decided to try it. It was dark but with the full Blue Moon. We saw the movies about the Tram & how it was built & the tips on what to take on hikes which we enjoyed & highly recommend. There were a few places to eat at the top but they were closing down & the choices were limited. They took a great picture of us on the way up which we saw at the top. I wanted it but it was $35! WHAT? We just paid $46 for the tram ride. We opted out.\nEven so, the ride up was fun, we had the whole tram to ourselves and could see the moutain due to the reflection of the moon lighting up the surroundings. The ride down was just as fun & they rotate the tram for everyone to get a view.\nThe staff were friendly. There is only two of these in the world. Great time & a must. We will have to go back during the day & play.\n\nIf you go during the day you can spend all day there. Take comfy shoes for hiking.\nShow less"], ["Reviewed 1 week ago", 5.0, "Dress warm!", "It was 77 at the bottom and 36 at the top- dress in layers! The tram revolves so it doesn’t matter where you stand. The views are beautiful. What an engineering feat! There is an easy hiking trail at the top that made the trip a little less touristie. There are restaurants, bar, and gift shop at the top.\nShow less"], ["Reviewed 1 week ago", 5.0, "Timing is everything!", "Having read other reviews, we went on a Thursday afternoon for the ride and dine. We went up a little after 4:00 and ate an early dinner at 4:30. The ride wasn't terribly crowded going up and was very enjoyable. The meal we were served for $10 was excellent! The service was good and the views from outside on the cliffs were fantastic!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Tramway is a must do", "The tram was amazing to experience...we did it at sun set and it was gorgeous....definately worth it! But dress warm for the top because there was a 40 degree difference from the bottom. Bummer was the fog was too thick at the top to see anything below.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Well worth it!", "The tramway ride to the top of the mountain is fun and the hikes are terrific. The best restaurant has great views and excellent burgers. Take your friends or go again solo. What a great place to explore and see breathtaking views of Palm Springs and the Coachella Valley.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Dont miss", "Trip to top only takes 10 minutes. You don't know it is rotating unless touching window. It sways slightly going over tower but operator warns you. Lunch at top in restaurant food good service poor. Lovely hiking trail and cross country sking. Great for the whole family.\n30 degrees cooler at top, great in summer to cool off. 72.00 for 3 seniors.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best tram", "I have ridden a number of trams, but this one in Palm Springs has become my new favorite. We left 80 degrees in the valley, took a breathtaking ride to the top where we went on a beautiful hike with snow. Not to be missed."], ["Reviewed 2 weeks ago", 5.0, "Great trip to the top!", "Pass several biospheres and change temperatures. Terrific hiking and great places for picnic spots. Very different from valley floor."], ["Reviewed 2 weeks ago", 4.0, "At least 40 degrees cooler up top. A Very cool ride to a great park.", "What a beautiful place to wander.\nSan Jacinto State Park featuring Chino Canyon. I wish I had brought the right clothing with me.\nI can imagine that this place gets very busy when its real hot in the Desert.\n\nSome great views to take in and I suggest you keep track of where the sun is. If you don't there is a possibility of getting a bit lost in the dark.\nSomething to keep in mind if doing this trip solo.\n\nDo not go walking alone too far from the lodge. Its wild animal area up top. Mountain lion, Bear and other things. Snakes too. No arms, no legs and they can kill you.\n\nI realized this fact when alone later in the afternoon and taking in a view on #6 or 5 but when I heard a loud noise, and realized nobody else was around it dawned on me that as beautiful as it is do no wander in the forest with nobody else around. Because what I just heard may have just heard me.\n\nTram ride is awesome! The floor of the tram turns so everyone gets a chance to see all the views. If you are afraid if heights give this a second thought. Not that is fast or bumpy its just you are on a steep climb or decent if realizing that affects you adversely I suggest not going.\nHowever if you are a thrill junky just go and wander.\n\nReally cool ride up the mountain to get there. A somewhat steep climb up the parking lot. You can drop off those not wanting to do that part of the walk right at the stairs to the tram. Then go park.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Treat for the eyes", "If you venture to Palm Springs make sure you check this out. Lots of parking and shuttle to the tram, very busy place but moves fast, about 60 people on each tram and it rotates 360 degrees so everyone sees everything. Restaurant and hiking trails at the top, AND THe VIEW! Fabulous! Met people from all over the world.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must do", "This was worth the time to go up the mountain on the only rotating gondola great views. You can eat or have a beverage or go on a hike once you get there. It was very warm this year when we visited but much cooler on top of the mountain. You can also reserve and go up for dinner. When we visit again would like to bring better shoes to go for a hike!\nShow less"], ["Reviewed 2 weeks ago", 3.0, "A lot scarier than anticipated", "We arrived around 1pm and had to wait till 2;30 tram up the mountain. Not much to do in the area to keep the kids entertained. The ride up felt like a bunch of sardines in the tram. Although we were 80 people on the tram, I can't believe how much it swayed .... and tower 3 is scary!! Once up there, there isn't much of a view as I anticipated. The hiking trails are nice and well maintained but after hiking the Canyons, these trails seemed to be what you could find anywhere. Then we had to wait another hour in line to get back down. Wasn't worth the steep price.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun Day!", "First off we should have started this adventure earlier in the day. I didn't realize how much there is to do once you ride to the top of the hill. I had thought the tram ride was the attraction. And while it is fun and exciting and a great view. There is a lot of hiking, walks, picnicing that can be done once you get to the top. So pack your hiking boots and a warm jacket cause it's cold up there!\nShow less"], ["Reviewed 2 weeks ago", 3.0, "6th grade Field Trip", "It was just okay! Not the most fun..but not the worst way to spend the day either. Reasonably descent hiking for small kids, newbie hikers, or senior citizens. Food there is not reasonable so eat before you go. The gift shop is crazy expensive unless you buy a bag of semi precious stones. Which has absolutely NOTHING to do with the tram! Soooo???\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome must-do when in Palm Springs", "The tram offers beautiful views of the terrain and various climates as you head up the mountain. It revolves twice on your trip so you get varied views and don’t have to worry you will miss something. It is a little pricey but there is plenty to see and do!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Weekend Trip", "Fantastic, and worth the trip. The food was a bit expensive. We opted for the buffet, which was about $57 for two people. This is the restaurant at the top. The wait time to get back down, is about an hour of standing. So be prepared.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Gorgeous desert mountain and valley views", "This unique tramway takes you for a 15-minute ride up a steep canyon, from 2,600 to 8,500 feet, near the top of San Jacinto Mountain (10,400 ft.). And slowly spins the tram car so that everyone gets a 360-degree view of the gorgeous desert mountains and valley below. The top station has a bit of a museum plus two brief films about the building of the tram and an overview of the San Jacinto State Park's scenery, flora and fauna. Well-worth a stop if in Palm Springs, especially on a clear day, when you can see for up to 30-miles around\nShow less"], ["Reviewed 2 weeks ago", 5.0, "AWESOME Trip", "When your in Palm Springs you should go up the Tram just getting to the base gives you an incredible view and from the top its spectacular. Buy your tickets around $25 per person get the next tram to the top, 80 people at a time. The floor rotated do you get to see all around on the way up with abit of excitement as the car passes the towers and swings abit views from the top are beautiful you can grab lunch for a reasonable dollar and stay up as long as you like hiking trails and wildlife for you to experience. If you have time this is a must see in Palm Springs\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A wonderful must-do activity in Palm Springs", "The tram ride itself was more interesting and beautiful than expected, as the decks rotates 360 degrees so that your view changes and you don't have to jostle for position. Plan to spend some time at the top, because the forest and mountain meadows are both beautiful and 20-30 degrees cooler than the valley. Hiking trails are easy to moderate and offer excellent views. The film about the construction of the tram was also interesting. The tourism information center at the start of the road to the tram is a mid-century modern architectural treasure.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fabulous experience", "Great trip unique experience in revolving cars. check the weather up there, it can be cold. Amazing views."], ["Reviewed 2 weeks ago", 5.0, "Hate heights but worth the trip up!", "Excellent views from the top. We did the hiking trails to the lookout points. Absolutely beautiful, very scenic. Take your jacket as it did start to cool off on the trails by 4:30 pm. Ate in the restaurant. Excellent food and views."], ["Reviewed 2 weeks ago", 5.0, "A Room With a View", "The views from the tram car are amazing! But there were even more amazing from the top which in addition to the view you have the opportunity to encounter nature and wild life that makes up the park."], ["Reviewed 2 weeks ago", 5.0, "A \"MUST DO\" item if you are visiting Palm Springs", "Tram ride and the view from the top is obviously best in good weather when there is good visibility. Take a jacket because it can be quite cool and sometimes windy at the summit. You can stay at the top as long as you like, with trams departing about every 15-minutes.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great hiking so close to Palm Springs!", "We took the tram up to the mountain and had a great time hiking! You can take the tram up, then back down or enjoy the massive trail system! Make reservations ahead of time online, simple, and print your pass. Good food up top or pack for a hike. Really great views of Palm Springs form 8500 feet! The tram ride is pretty amazing, up and down ten minutes each way. Lots of parking with a tram to take you to the entrance no matter what parking lot you park at. You will be happy, go!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A worthwhile activity when in Palm Springs.", "The drive to the parking lot is quite steep. The walk from the lot to the tram building is also steep and would be quite challenging for those with mobility issues. The tram carriages (two) are unique in that they slowly rotate while moving. Staff, in our view (6 persons), cram too many passengers aboard (standing only). Once again challenging for those with mobility issues. The views from the top are stupendous and the educational displays/videos are good. There is ample provision for food and beverages. We would recommend timing your visit so that you are at the top to experience after dark - the night views with lights below are impressive.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fantastic views and walks", "Well worth a trip. We will go again. Tramway travel was exciting and onceat the peak there were plenty of walks to choose from and lovely views."], ["Reviewed 3 weeks ago", 5.0, "You gotta do it!", "Amazing views of the valley and surrounding mountains. Very efficient operation. Great ride up the mountain. Take the time to walk one of the trails. I would recommend the hike to five different lookouts: each view is stunningly beautiful!"], ["Reviewed 3 weeks ago", 5.0, "Great views", "About 5 miles off the main street on a private road. No businesses on that road. $5 to park. We went on a weekday. Almost no wait to go up. 10% discount with AAA - which you have to ask for. It’s not noted on the price listing. About a 10 minute ride up on an 80 person gondola with a rotating floor. Great views of the Coachella Valley while going up and once up there. Short movie about the Wilderness area. It was a shade over 50 degrees up there - 30 degrees cooler than the valley floor. Pleasant walk on marked paths. Other than the walk down/up from the tram stop, walk was on reasonably level ground. Plan on spending at least 2 hours. Restaurants at both tram stations but we didn’t try either one.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Exciting ride", "This was one of our must dos on our trip to Palm Springs. A quick drive and you are there. The ride takes about 10 minutes to get up to the top, 8500 plus feet. We went around noon and the wait was short.\n\nIf you are scared of heights, this might not be for you. I am a little edgy but made it. Since it revolves, you have a good view of the entire valley.\n\nOnce up, I went straight to the bar to knock the edge off. Wonderful little bar. We then walked around, went to all the lookout points and really enjoyed our stay. The air is pretty thin so going slow is good.\n\nWe were going to take the short hike, but the altitude was difficult for my partner. We stayed up a little over 2 hours but would be easy to wander around more.\n\nReally enjoyed our day.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "San Jacinto Peak", "I only took the tram to start the San Jacinto Peak hike. The hike was amazing if anyone wants to try it, the average person takes 6 hours.\n\nThe tram ride was a quick 10 minutes. I really did not enjoy the spinning. It doesn't make you dizzy, but if you're already nervous about the height, and how packed the tram is (they really pack you in there), the spinning does not make you feel comfortable. It's also standing room only, and be prepared for the tram to swing when it reaches each tower. I was impressed how quickly they got everyone on and off the tram. We didn't have to wait too long to get on one. Even if you're not doing a hike, it is a beautiful view once you're up there!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Unique and unexpected in the desert", "When driving along the desert floor you see the mountains but they look barren and uninhabited. Taking the tram showed us how high the mountains are and where the forest is and who thrives in this wonderful wilderness. The tram ride is totally thrilling. Well organized and we'll worth doing.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Spectacular View From the Top", "I am afraid of heights yet this was something I saw and decided I really want to do it. I’m very glad I did. It wasn’t as bad as I thought. It was amazing. Take a jacket because it is cooler being high. Has a resteraunt, cafe, hiking trails. If you visit the area this is a must do.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great view lovely supper", "Trip trip up at 4pm with supper included. Was great time to go had view on way up lots of time to sightsee nice supper then city lights on way done were sensational"], ["Reviewed 3 weeks ago", 5.0, "Amazing! Not to be missed!", "We read online and heard from family that we HAD to do this. They were right! Words and photos don't make up for experiencing it yourself. Be sure to wear layers."], ["Reviewed 3 weeks ago", 5.0, "Cool View", "It was my last day in Palm Springs and I wanted to do something special with the 3 hours I had remaining. My local friend suggested the tram. We quickly got tickets and only had to wait a short time for our turn on the tram. While we were waiting there was an informational video to watch. It was a fantastic ride up. The best part of it was that the tram rotates so you have a chance to see the cliff up close and then the view of the whole valley. Everybody has a chance for a perfect view of all sides. The ride up was very fun and you definitely get a sense of high up you are. People with a fear of heights will find it challenging but safe. Once up there we walked outside into the very cold air. There was still snow on the ground and some kids were trying to sled. It was a real treat to be up there in the snow when 20 minutes earlier we had been down In the heat of the desert. We did not have boots so couldn't go walk anywhere besides the walkway that leads down to the meadow. We stopped in the restaurant and got some very good chili to eat. I highly recommend the tram!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Worth the drive from San Diego", "I had read about the Palm Springs Aerial Tramway years ago and tried to go once before. The first time we drove up there from San Diego, the weather was foggy so we didn't go in. This time it was sunny. We paid $5 for parking and parked in the handicap lot right next to Valley Station. We purchased tickets and had to wait 50 minutes for our tram car. There plenty of things to do while waiting. We viewed the original cars and took photos by the waterfall. There is a gift shop, museum, self-serve cafe, and patio.\nI didn't realize before getting on the tram that the floor of the tram rotates, so you get a 360-degree view. The views were fantastic; I only wish the trip was longer. Once we arrived at Mountain Station, we walked around and enjoyed the views. We decided to try the Peak Restaurant. We were lucky enough to get a seat without a wait. The food was great. We started off with flatbread pizza; it was delicious. The restaurant closes for an hour from 4 to 5. Overall we had a great time.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing view and exciting experience", "My husband and I road on the palm springs tram recently. The large gondola offers a fantastic 360 panoramic view of the Coechella valley, the rugged mountains and even the sultan lake. The floor inside the gondola slowly rotates which allows for the view. The facility at the top offers a continuous film showing the engineering dream, the ef f ort to get funding and the building of the entire tram. There are several viewpoints within easy walking. Several eating spots, including a nice restaurant with outstanding views. There are over 50 miles of trails that hikers can enjoy. Well worth the minimal fee.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful viewa", "My husband and I went up the tram on our vacation to Palm Spring last month. The ride going up was a little scary as both of us are afraid of heights. The views from the tram were breath taking..\nThe staff were very friendly and helpful. There are trailing to take that are easy to follow and more aggressive ones for those more adventurous. The parking was $5 and to go up the tram for adults $25.95.\nIf you are planning on going to Palm Springs this is a most see.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A must-do in Palm Springs", "We visited the tramway the first day of our visit to the area to get a lay of the land. The summit offers spectacular views of the Salton Sea, the valley, and Mount San Jacinto. A volunteer on the summit can answer any questions you have about what you're seeing, and there are helpful signs as well.\nThings to keep in mind: Parking costs $5. Check current weather conditions on the tramway's website. Wear your warmest clothes and take a jacket to the top because it is colder up there. Try to stand in front of a window on the tram either going up or coming down. The tram rotates, so it doesn't matter where you stand initially. Patience is necessary, as there will be hordes of tourists. The restaurants at the top do not offer healthy fare. It's mostly pizza and fried foods. You can take a picnic, and you can eat it at the outdoor picnic area, but not inside the restaurants.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "\"A must do in Palm Springs\"", "This is one of those attractions in an area that one should do as it gives a real good idea of the surrounding landscape. One thing i must say is that you can sure get a work out getting to the entrance if you park at the bottom of the parking lot. It is a steep climb. The place was busy but their operation is very efficient. You buy your tickets ($25.95 for an adult), they give you a boarding time and give plenty of notice when its your turn. The tram holds a lot of people and moves along quite quickly. There is plenty of area at the top to take nice photos. There are a few eating establishments at the top although we never tried any. It was well worth the money we paid.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "An amazing place in Palm Deserts", "We purchased advance tickets for this attraction as it was our top target for the weekend Palm Springs gateway. This is an engineering marvel; the rotating tram almost moves 900 feet up through 5 distinct climatic zone. At the base level when the temperature was mid 8-s the top was at mid 30s :) We even found snow on the trail above the mountains.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Hiking Afternoon!", "We’d heard a lot about the Tramway, so had to experience it for ourselves. Thursday afternoon, paid $5 to park then the shuttle took us to the visitor center— and thank goodness, the parking lots are a steep cruise down from the center! We bought our tickets then sat out back to enjoy the view while waiting about 35 minutes for our tram. Now, each tram has a driver who gives a brief hello and introduction to what will happen as you go up. Our driver up was Gabe, who sounded like the rapid talker telling you the fine print at the end of radio car commercials. I only understood something about each tower would cause the tram to swing. Glad I caught that! He was silent the rest of the way, so we rotated and rocked through all five towers as we went up. Amazing views! We landed at the top where it was 32 degrees but only a very light breeze. The path down from the center to the nature trails was steep but nicely railed and zig-zagged, so you were in a rapidly descending walk, seemingly pacing back and forth. We set off on the hiking trail, with me barely realizing that we’d have to do the steep back-and-forth climb UP to get back to the landing. I’m not an avid hiker but really enjoyed the shorter route, with many signs giving facts about the mountain top desert. Lots of good exercise and great pictures! This would be a great date, too! We made our way back up the steep railed sidewalk, with me stopping at every other bench for a breath. I tell you all of this so you’ll know that to truly experience the top, be prepared to do some exertion in the cold with thin air. This was totally doable, though, even for me who usually walks a 20 minute mile. Basically, I’m not fit but it was fine! The views and experience are totally worth it! Oh yeah, our tram driver on the way down was much more fun and involved, calling out each tower so we could brace. Great afternoon!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Day Out", "Kids came for a visit and decided to go up the mountain great choice as it is very well organized. Great trails once you are up there. Did not have anything to eat up there"], ["Reviewed 3 weeks ago", 5.0, "A must do....", "Worth every penny! We wore flip flops but sneakers would be recommended also a few extra layers for temp changes. Awesome experience."], ["Reviewed 3 weeks ago", 5.0, "Tramway", "Beautiful, unique and definitely worth the trip to the top. We went up around 3, explored until 5 when the restaurant opens for dinner, had a fabulous meal and rode down after dark. I would not miss this, especially if it is a first trip to Palm Springs.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Views and Hiking", "This is a must do when visiting Palm Springs. You can spend a few hours or all day, drinking in the spectacular views. We did the 1.5 mile loop, a fairly easy hike with great notch views. The cost of a tram ticket at around $26 per person (and $5 to park) isn't exactly inexpensive, but we did think it was a worthwhile excursion. Though it was very warm on the winter day we visited, it can get very cool at that elevation, so check the weather at the top and plan accordingly!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Wonderful", "We enjoyed the tram so very much! Breathtaking views- the ride up to the top is incredible as is the return! We did the loop hike at the top and were blown away at the beauty:"], ["Reviewed 4 weeks ago", 5.0, "Excellent experience", "A must do when you are in Palm Springs. The air tram rotates 360 degrees so you and all passengers have the opportunity to see all views. Good hiking trails that are not too long and there are also longer hiking trails. The lookout points are stunning! Recommend wearing good walking shoes if doing trails.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "good", "good. beautiful, fun on tram, fun with snow, nice hikes, maybe be hard for some folks with MCS or EI in buildings on the top."], ["Reviewed 4 weeks ago", 5.0, "Fun and stunning outing", "Get tickets in advance or there (we waited maybe 45 minutes, not a big deal). The tram itself is very cool. Rotates so you see all sides, a spectacular 11 minutes to the top, through 5 different ecosystems up 6,000 feet\n\nWe then did the Desert View trail in a little over an hour, which features 5 'notches', each with spectacular views of the mountains and valleys. A few helpful hints:\n* It's about 30 degrees cooler at the top than at the base: wear layers\n* It's up high enough that I found myself out of breath during the hike, which they accurately rate as 'moderately strenuous'. Nothing ridiculous (no scrabbling or the like), but definitely not flat.\n* One of the maps they gave us reversed the orientation of the hike (right was left, etc), so we got lost, which was frustrating. It turns out that the back of the signs at each notch point you to the next notch. Some of the signs are just leaning against rocks, but if we had known this, we would have just looked for that, and not gotten turned around. The trails are well-trodden but not otherwise marked, so being pointed the right way is important.\n\nWe've been told that the food at the top is expensive and actively awful, but this is second-hand, so I don't know if accurate or not.\n\nWe had a blast and would definitely do it again, exploring different trails (there are a bunch of them).\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Caution advised", "Yes, the view is beautiful and the hikes at the top are very nice as well. They load the tram car like a cattle car so if you are adverse to crowds in confined quarters you might find this very uncomfortable. Also, since the floor rotates, if you have the slightest inclination toward motion sickness the ride up may not bother you but the slow spin might. It's an experience worth taking if you are aware of the drawbacks. It's also quite expensive.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing!", "Took the Aerial Tram during sunset and the sky views from 8000 feet up were amazing! It was cold but so worth it! I was amazed by the facility and how much there is to do up there. Even though the ride up make me nervous, it was worth it to see what was waiting at the top. Highly recommend!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Beautiful and fun!", "This was our first time taking this tram and it was fun. Make sure to bring a jacket. It was cold, about 40 degrees, some snow at the top and very, very windy. They dont tell you how strong the winds are and a small child could easily get blown off! No animals are allowed and you cant leave them in your car or you will get fined. The restaurant was a little expensive for what we got, but rhe food was good and they have a full bar. They have a food area with some more reasonsbly priced selections too. We spent about 2 hours at the top. The ride in the tram was fun, you can take a lot of pictures as the inside floor slowly rotates as you ride up. I would do this again. I thought the price for the tram was reasonable and there are two gift shops (one at the top and one at the bottom) with fun stuff. This is a good activity for all ages. The staff everywhere waz very friendly and helpful.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "No reservations needed", "We enjoyed our afternoon at the Tramway. I would bring warm clothes and comfortable shoes as once you get up top there are lots of very hilly walking trails. I was too cold to walk and I wish I dressed warmer. 70 degrees at the bottom is about 40 degrees up top.\n\nRestaurant and bar up top, but bathrooms were gross.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great view!", "Spectacular views from up at the top! Well worth the trip, with the revolving gondola giving everyone on board a good view all they way! Certainly cooler up top!"], ["Reviewed 4 weeks ago", 4.0, "Quick trip to the top", "We were in town for another event and because of the large amount of people waiting, we weren't able to spend much time at the top. It was a neat experience. The revolving floor in the tram makes the view (especially on the way down) much more interesting. My recommendation is to visit on a weekday or early morning on the weekend.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful views", "Must do! Little Chilly in January. So bundle up. The ride itself is beautiful and the hikes at the top are fantastic. Its a Very old established forest. Buy your tickets ahead of time to avoid the wait."], ["Reviewed 4 weeks ago", 5.0, "Great experience", "Very enjoyable tram ride up, hiking at the top on Mt. Jacinto, and lunch in the dining room. Remember it is much colder at the top, and the day we went the wind was blowing really hard. We still enjoyed hiking along the paths to the lookouts and seeing the majestic trees and views. Food in the restaurant was good. All in all an enjoyable day.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Definitely worth a visit", "We rode the tram up the mountainside and managed to walk a few of the trails and take in the sights on all sides possible. We went on a nice sunny day and the views were breathtaking. I would recommend it to everyone unless you're really afraid of heights; then it may not be for you. Bring a light jacket or sweater if you're going as it's cooler up there.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Not to be missed!", "A ride up San Jacinto Mountain in a large cable car, with unmatched views of the area. Great hiking fun at the top of the mountain. The climate is so different than the desert below. We've left 90 degrees F in the parking lot to hike in the snow at the mountain top.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A MUST!", "Two adults $47 for seniors. Well worth the trip up a 8400+ mountain. Beautiful views. Tram is fun and exciting. Two restaurants at the top. Hiking trails. Gift shop. Clean and good. You can walk for hours or take a short 3/4 hike—whatever you want. Well worth the trip!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Interesting", "Pricy but worth it. Tram was fun but didn't expect it to be spinning. Took a short hike as the paths were icy. Nice views."], ["Reviewed 4 weeks ago", 5.0, "Like An Amusement Park Ride!", "20 of us bought tickets to go on the tramway at sunset. Gorgeous views and nice bar at the top! The ride is really fun because it rotates and swings as it crosses the towers. A couple folks in our group had vertigo and were a bit uneasy so if you have anyone like that with you, they might want to stay in the gift shop at the base lodge :)\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Must-See Attraction in Palm Springs", "I loved this experience. It is a very high, and very long, rotating tramway that takes you from about 2500 feet in elevation to almost 9,000 feet. On the way up, which takes about 10 minutes, the tram rotates several times to allow spectacular views of the valley below and, on a clear day, the Salton Sea. Once at the top, there are hikes along the edge of the mountain with several stops at spectacular lookouts. It can get crowded, so buy your tickets in advance online and get to the Tram station as early as you can. We had a wonderful time at the top and enjoyed the spectacular views on the way up and the way down. If you're in Palm Springs, or anywhere near, don't miss this experience.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Excellent", "It's a very enjoyable 10 minute tram ride to the top of the mountain. There's 2 short video to watch and a choice of an informal or more upscale restaurant. The upscale restaurant had very good food and an excellent view. You might want to consider going up at sunset and have dinner and then view the stars\nShow less"], ["Reviewed January 24, 2018", 4.0, "Excellent view", "The wait was a bit long but well worth it because once we got on the tramway the view was WOW! My son loved the scenery."], ["Reviewed January 24, 2018", 5.0, "Don't miss this very cool side trip", "We've been to this twice, with the whole family. The kids enjoy it and out of towners are blown away by how cold it is up on the mountain via the tram.\n\nThe tram is an unforgettable experience up the mountain, great photo opptys and views.\n\nThere is a restaurant and bar in the lodge at the top, so parents can have a glass of wine or beer while the kids look out the windows and have snack.\n\nThere is hiking at the top as well, the tram runs about every 10 mins.\n\nParking is easy and there are a couple large lots,\n\nThis is a 2 hour visit you won't ever forget.\nShow less"], ["Reviewed January 24, 2018", 5.0, "A Must See in Palm Springs", "We aren’t adventurous people , by nature, so there was some mild trepidation when we decided to go up to the top in this little box hanging on a slim cable. Death surely would follow!\n\nBoy, are we glad we did. Yeah, our tummies flipped a little traversing that first tower, but after seeing that a little sway wasn’t a sign of impeding doom, we relaxed and enjoyed the trip, and the views, and the nature.. we even threw some snowballs, which is something we Floridians don’t get to do all that often. STRONGLY recommend this fun adventure to anyone visiting Palm Springs. We drove over from Costa Mesa for the day in an easy commute that was interesting in its own right. The desert and Mountain View’s are spectacular.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Breathtaking views aboard a rotating floor on the gondola.", "This is the most recommended tourist attraction in Palm Springs and Palm Desert and for good reason. This is a must see.\nIt is very well organized from the parking right through to the staff overseeing the patrons.\nIn the winter it is a wise move to take lots of warm cloths and good walking boots that will perform on ice and snow if you are adventurous enough to spend some time hiking to the view spots.\nShow less"], ["Reviewed January 23, 2018", 5.0, "This thing is Cool!", "We had a great time on the tram trip. They did pack the tram car a little tight for sure. But the views were outstanding. This is a fun way to spend a few hours. We did have a beer at the bar & it was a little steep, $18.50 for 2 drafts not including the tip. It is 30 degrees colder than the valley, so bring a jacket.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Short ride to great hiking", "The tram holds 80 people so can get crowded. Once you're at the top the hiking trails are endless. If you go when there is snow prepare for every hike to take longer than you expect. Hiking poles would be helpful. Shoe spikes would be good but we did it without.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Worth the trip up the mountain", "Great terrain for hiking and great views Nice to get away from he desert for he afternoon and experience a different environment"], ["Reviewed January 22, 2018", 5.0, "Worth a trip up the mountain.", "A great way to spend an afternoon. It offers great views and hiking in a totally different environment than the desert. We got a better deal on tickets by buying them through our hotel"], ["Reviewed January 22, 2018", 5.0, "Palm Springs for a wedding", "Had several days in Palm Springs , weather was great , it was mid October 2017.\nMy girlfriend and I rode the Tramway up .... it spins slowly around for GREAT views !!\nWe knew there were hikes at the top so we had our hiking shoes and WATER n Snacks\nReady to go ....\nWe did a 2 mile loop trail , but there are several others , longer n shorter.\nVery nice country side , fresh air , just great..... would go again if in the area.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Nice place", "There are many things with giving the great experiences. It is not only riding a cable-car, but also impressive various trails on the top. I believe your son and daughter come in happy there."], ["Reviewed January 22, 2018", 5.0, "you have to do it", "This is impressive, even to Europeans like us who have seen Alpine cable cars. It's a long way up, and what you get to is totally different to the desert below. As you'd expect you don't have to walk far from the top station to be away from the crowds, and the trail to various view points of the valley is well worth doing.\nShow less"], ["Reviewed January 22, 2018", 5.0, "The enginerering triumph and incredible marvel that is the must-see jewel of Palm Springs", "As a Palm Springs resident, I highly recommend this incredible must-do activity. It is one of the amazing things Palm Springs has to offer, and more extreme and awe inspiring than you can imagine. Begin your ride at the Valley Station (elevation 2,643 feet) and end at the Mountain Top Station (elevation 8,516 feet). Such amazing panoramic jaw-dropping views await you on your informative 360 degree journey to the top, as you learn the immense undertaking that went into the construction of this Palm Springs marvel. Be sure to bring adequate and correct clothing as the temperature is 20 to 30 degrees cooler at the higher altitude. At the top, there are also shops and restaurants and various things to do as well as numerous hiking trails of varying lengths for the eager adventurers. So give yourself plenty of time to experience the wonderment of this Palm Springs jewel. Then when you are ready to return simply hop on the next available tram back down, which run regularly every 20 to 30 minutes. A visit to Palm Springs is not complete without a visit to Palm Springs infamous Tramway!\nShow less"], ["Reviewed January 22, 2018", 3.0, "Nice ride to a cool forest", "When you want to escape the heat of Palm Springs, take the aerial tramway to Mount jacinto for a cool walk in the forest with majestic views over Palm Springs and it's Valley."], ["Reviewed January 22, 2018", 5.0, "Fantastic", "This is a great place to visit and hike, but if you habe a fear of heights the tram may not be for you."], ["Reviewed January 22, 2018", 5.0, "Great Day on top of Palm Springs", "What a great place!! This was far better than we expected. Expecting just a tram ride to the top, a quick visit and down again, BUT NO, there is a whole park up there, with lots of hiking trails, some go on forever. It's a beautiful old wood forest up there, with trees much larger than I'm use to seeing. The view of the valley is spectacular. The Tram rotates 360\nso you get a great view on the way up and down. Dress for the weather, bring water/snacks and good footwear. At the top, if you want to leave the visitor center, it starts with a very very long downwards ramp to the forest, trails are great and easy to walk, but at the end you have to go back up that very very long/steep ramp... Good exercise but very hard for the elderly or disabled. There is lots to see if you choose to stay at the center.\nShow less"], ["Reviewed January 22, 2018", 5.0, "One a kind experience", "Take some time to really enjoy this experience. We went up with the sun and came down with sunset. Incredible. I wish that we had brought hiking clothes and spent more time at the summit."], ["Reviewed January 21, 2018", 5.0, "WOW!!!!!!!", "Definitely worth the trip!! This was SO worth the time & money. What an amazing adventure! I would highly recommend this to everyone!"], ["Reviewed January 21, 2018", 5.0, "An engineering feat, great views, must-do in Palm Springs", "Bring your coat as the temperature is much cooler at the higher altitude. It's always great to bring visitors up the tram to see the views and get a narrative of how the tram was built."], ["Reviewed January 21, 2018", 5.0, "More extreme than I thought", "Great views, but definitely more of an adventure than I thought it would be. I've taken gondolas skiing etc, but this was faster and higher than expected. Also it spins slowly and sways when you go over the five tram towers along the way."], ["Reviewed January 21, 2018", 4.0, "Trip to the Top", "The tramway was a lot of fun. A little on the exhilarating side but with no fear factor. The views are spectacular from the top but the dramatic elevation change left us trying to catch our breath as we walked to the very top of the mountain.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Best place to go to get away from the heat", "This is the best thing to do there. What they don't tell you is how much cooler it is up there, there is a bar and a whole park where you can camp. I didn't camp but it had great view points (easy enough to follow for novices). They have a few indoor movie clips of how it was build and why, with stuffed animals of the local wildlife. I had a drink and bar food wasn't cheap but worth it. The trek up there was worth it. Although glad I read TripAdvisor and avoided 4th of July. The locals get season memberships so this place is uber crowed when locals go. We where there on a regular day so it was fine. Totally recommend going. Parking was free and there is a shuttle to take you there.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great ride - stay up for the hike and the views", "Lots of trails to explore on top. The tramway runs in 20 min increments (at least for the time i was there). There's a cafe and shop up top if you need water (recommended). Lots of trails that are marked, try them all, they all have different views. Spent about 3 hours up here on a clear afternoon and got some great shots.\nShow less"], ["Reviewed January 19, 2018", 4.0, "Nice attraction in Palm Springs", "This tram costs approximately $25 per person so it is not cheap. But it is very different in that you are taken 8,500 feet up in a tram car ride lasting about 10 minutes each way. At the top are some wonderful views and several cafes and restaurants. You can also hike and watch 2 movies (included in price) about the construction of the tram and about Chino Canyon and the State Park.\nShow less"], ["Reviewed January 19, 2018", 4.0, "NIce Gondola which rotates", "good view of mountains, wild life, etc The restaurants are very busy and pricey, have good variety of food on menu unfortunately we had traveled in January, so it got windy and cold outside."], ["Reviewed January 19, 2018", 5.0, "Tram Ride and Dinner", "The day we wanted to go up all the time slots were booked except the night slots. We ended up buying the ride and dinner package. That way, we were able to go up at 4 pm and saw the views while it was still light outside. Our kids (ages 9 and 12) ran and played in the snow for about an hour until it got dark. Then we headed inside for our dinner. Food was pretty good. After we ate, went down the tram in the dark and saw the night views of the city. It was perfect! Temps were a lot colder on the top of the mountain so dress for that and wear good walking shoes.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Must do in Palm Springs", "We purchased the Ride and Dine tickets which was a good deal for us. Food was not fancy but plentiful. The trip up the mountain was beautiful and just a little scary if you've never ridden a gondola. We arrived just at sunset so got beautiful views. The short movies at the top are interesting but wish there was more info on the engineering used when it was first built. Recommend for anyone visiting the area.\n\n\n\nShow less"], ["Reviewed January 19, 2018", 5.0, "360 degree tram", "Took the tram to get further into the mountains. Walked around some of the easier trails. Beautiful area. Our one comment would be to better mark the lookout areas. It was kind of slushy that day but other people helped us find the way. great fun. Not as cold as expected, fortunately.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Dogs on a Tram?", "Labs are generally gentle. \"Terrier types\" is too vague of a description. But, I doubt they would bring vicious animals within close proximity to people if they were apt to bite, else they be sued. I have a Boxer. They are the most gentle of dogs, and are excellent with small children and even babies. However, Boxers are also very lively. I would want to take my boxer for the simple fact that she is for all intents and purposes my daughter. She is losing her eyesight and doesn't like being left behind or alone. I have a chronic life-threatening illness, which is a matter between my doctor and myself. It is actually illtegal, for example, to ask a person parking in a handicap space with a placard or plate what their disability is. So, I can understand why it isn't yours or anyone else's business why they require a \"service\" animal. You are thinking \"service animal\" means they are trained to help you cross the street, or to fetch you a beer from the refrigerator; when in fact, they can be of service merely by existing and being close. For instance, when I get angry at the insanity that is our news every day, and if I yell at the tv or computer, my dog doesn't run and hide, she comes running to me. She promptly sits down next to me and looks over her shoulder at me suggesting that I pet her to calm down. When I had cancer on my leg, she examined it every single day until I was well-- although she does sniff my right eye, never my left, when I put my face up to hers... tumor? Because she is large, and because I'm not crazy, I do not take her to places such as the pharmacy or the grocery store; but the LOVE her at Lowes and Home Depot. I dont take her to the pet shops because, although I trust her, I do not trust other people's large dogs from past experiences from having owned 3 boxers over the years-- my dogs have been attacked without provocation on four separate instances. But, one day you might see Bossier, my boxer, on the tram; and I'll just pray that disagreeable people are not on the tram, or I will ill wait for the next. The only other Tram I have been on that I can remember just now, is the Tram at Pão de Açúcar (\"Sugar Loaf Mountain\") in Rio de Janeiro, Brazil. Very different experiences, both beautiful, both recommended.\nShow less"], ["Reviewed January 18, 2018", 5.0, "A must to go to", "Staying at La Qunita, it took about 40 min to get there. Not much of a wait so the ride up was nice. The floor moves so you get to see all views going up. About a 10 min right. Views are great up there. Nice place to had a snack, lunch or dinner. We only stayed up there about 30-40min. Got some great pics. So if you can time it with the food, it makes the trip a little more worth while. Nice go there around 330 , so you can look around, have dinner and watch the sunset. Bit pricy at 25-26 person.. Plus % to park. They should give you a discount if you have dinner there...Nice fun ½ day trip\nShow less"], ["Reviewed January 18, 2018", 5.0, "Amazing views!", "Although I was quite surprised by how expensive it was to ride in the tram - it was well worth it. I took about 3 hours of our day which was about perfect."], ["Reviewed January 18, 2018", 5.0, "Dress for it!", "This is a must do if you are in the area. The tram rotates 360 as it travels up the mountain, something that is hard to find anywhere else in the world. The views are fabulous as are the trails when you get to the top. Bring warm clothes and good walking shoes as the temperature at the top could be 20 degrees F cooler than at the bottom. Also suggest you bring a camera as the scenery is something you will want to remember years from now.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Unusual ride", "When it talked about the tram rotating as it ascends the cables, we weren't prepared for the detail that the floor rotates, so you don't get to stay by a window as you rotate past all of them. The view from the top was nice. Many hiking trails, but it was too late in the evening by the time we were up there (just before sunset), so did not get to enjoy any. (Allow time for higher elevation affects and season.)\nShow less"], ["Reviewed January 18, 2018", 5.0, "A MUST at least once!", "I had pre-booked tickets online a month prior to arrival which was great & totally worth it bc you get to cut line & enter during your timeslot. Upon entering to pay for parking, we were directed to Lot E which is about a 10min walk up which we did since there was such a long wait for the shuttle & we would've missed our timeslot. We made it up and ended up missing our time by 2mins, but we decided to wait standby for the next tram up. Luckily all 6 of us were able to make that tram. There is not a bad spot on the gondola as it rotates on the way up. Once up, there are restaurants, gift shop, viewing areas, and walking/hiking trails. We went on one trail that had 5 lookout points. It was an easy to moderate hike and was lovely, filled with amazing tall trees, boulders, & spectacular views of PS below. I've been going to PS for years and have always wanted to take the Tramway & I'm definitely glad I did. It really is a MUST at least once!\nShow less"], ["Reviewed January 18, 2018", 4.0, "Amazing Views", "We went here the Saturday of Thanksgiving weekend. We arrived early and were able to get parking easily. We still had to wait awhile to catch the tram up the mountain. It is expensive to take the tram, but I thought it was completely worth it. The tram is like the ones in Switzerland - huge with the ability to carry a lot of people. The trams also rotate as they go up the mountain, so you have a complete view of everything.\n\nIt was a boiling hot day in Palm Springs (unusual for Thanksgiving weekend), but up at the top of the tramway it was close to 70 and just beautiful. The tram ride is fun and the view are stupendous. Many people told us to come back in April when there is snow up at the top, but I'm for Massachusetts originally and have seen plenty of snow. We hiked around at the top and got to see Palm Springs and the desert from different vantage points. We also stayed and had lunch in the restaurant which was quite good.\nShow less"], ["Reviewed January 17, 2018", 5.0, "A world-class attraction and microcosm of a continent", "In retrospect, I can't believe I waited so many decades before embarking on this adventure. It seems a bit pricey at first blush, but it's actually quite reasonable given the quality of the infrastructure. In a matter of minutes you rise above the desert floor and end up on a snow-encrusted plateau studded with majestic, yellow Jeffrey pines and vistas of the desert below that extends to the Salton Sea and on to Mexico. Don't miss it!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Awesome View", "This was a bit pricey for my taste but the wife wanted to go, so, \"yes dear.\" There is a bit of a parking problem. We went in the Fall so it was not so crowded but Summer must be a mess. Everyone wants to get the 30 degree drop in temperature from the HOT valley below. Huge difference! There is a beautiful meadow at the top with lots of hiking trails. Inside, you can get lots of good food as well as great souvineers to take home. The view is fantastic! You can see for miles. I would recommend it once but would probably say \"no,dear\" next time.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Exhilerating Trip To The Top", "We went here during the Christmas holiday with our son and his fiancé. Get up here when they open. It can get busy. They offer a senior discount which is nice. You park and they bus you up to the tram station. the tram itself is amazing and makes you wonder how did they build this so long ago. I came here 30 years ago and it was amazing then. We bought our tickets and boarded. Everything is done in an orderly fashion. The tram goes up 2 miles and the floor slowly goes around so you can see everything. Beautiful day and not super cold. Make sure you wear a warm coat. No snow at the top so we hiked a bit. Great to do just once, if you have never been here.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Snow on the Desert Mountain Top", "It is a spectacular tram ride up 8,000 feet and every inch is an outstanding view. The tram rotates so your view gives you a full scope of what you are rising above. Once you arrive on top, there are great viewing areas. There is a great gift shop and areas for dining. Descending is fun too!\nShow less"], ["Reviewed January 16, 2018", 4.0, "Reprieve from the heat", "A great trip which takes you from desert heat to snow via an amazing climb. There are trails to explore the alpine woods when you reach the top but bring your own food as the cafes are highly priced and the food not great"], ["Reviewed January 16, 2018", 5.0, "A Must Do", "Planned a short get away and I had not planned the Tramway, but my wife had other plans. I am so glad she did. I would make this a must do if you are in the area. Reasonable fare to ferry you from the desert to the Alpine mountains. Great views of the desert below and the majestic rock formations on the way to the top. We were lucky enough to spot a few mule deer on our trip. Getting to the top can be a bit exciting depending on the weather and the tower crossings with the swing of the trams is exciting. Thankfully, there is a bar in close proximity to the exit at the top that serves a good cocktail and a nice selection of food and appetizers. Glad I made the trip and would suggest it if you are in the area. Incidentally, the Tram is known of around the world. Don't miss it. By the way, when thinking of how to dress. You are in the desert at the bottom, at the end of your journey, you are in the high mountains with snow at times and very cold.\nShow less"], ["Reviewed January 16, 2018", 5.0, "We really wanted to do this !", "We were traveling with our son and other parents for a soccer tournament. When we saw this tram we talked and talked about doing it. And talked and talked some more. We had to time it so the boys could go and not be too tired for their games or late for their games. It’s was an ordeal as we heard it could get crowded. We were still in n east coast time so getting up early and going was the best plan on a busy MLK weekend. We got there and had tickets for the 9:00 on a Sunday. Perfect timing. We got tickets and got right on. The views from the top are amazing and it is well worth the cost. An under 12 cutoff for kids would be better than 10. We visited with 3 tween boys and three adults.\nWe all enjoyed the trip and wish we had more time to hike. Families were bringing sleds to play in the snow. Weather is much cooler at top so bring a hoodie\nShow less"], ["Reviewed January 16, 2018", 4.0, "Scale the heights", "This attraction is easily reached from downtown Palm Springs but once you get there you enter another world. The parking is very organized. I attended on a day that was very busy but things moved along. We had to wait one hour to get on the tram but spent time on different decks, viewing museum and browsing the gift shop. Once we were called we started the dramatic climb (to me anyway). The tram rotated so you could see the sheer cliffs as the tram rose and feel the swaying when it went over each tower. Quite thrilling. Thing is an engineering marvel. At the top you can do somemore viewing of the valley below or hike on some trails which we didn't. Bring a jacket as it can get cool there. Two restaurants to eat at the top that are very reasonable (especially for families) and they give you a lot of food. We got chili for $5.49 and it was enough. Other choices also available.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Fun in the snow & sun⛄☀️", "My grandchildren enjoyed the day of fun in the snow for the first time. The tram ride would have been more enjoyable if it hadn't been so crowded which interfered with the view. Facilities at the top are nice and we had a good lunch there.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Amazing Views!", "This was one of the attractions that my wife and I had never done on any of our trips to Palm Springs and we finally did. For the price of a ticket it's well worth it. The tram has quite a bit of history behind it. The view on the ride up and down are amazing. Once you're up top there is a restaurant you can grab a bit to eat at called \"Peaks\". We stopped and had lunch there and a couple of drinks. There are stairs to different platforms once your on the top and you can take pictures and get some great views up there. It's advisable to wear long pants and bring a jacket because the temperature does drop 30' when you're at the top, I opted for shorts, not a good idea.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Up up and away!", "The best part of our trip to the area. Breath taking views, great hiking even in shorts and tee shirts through snow and mud trails. The desert view trail did indeed offer spectacular vistas of mountains, valleys and unbelievable colors and rock formations.\nModerately strenuous seemed more than moderate to those of us that live at sea level on the eastern coast.\nSo worth the effort and cost.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Great views", "Fun ride to the top to see spectacular views of Palm Springs. Hiking trails are easy to follow. Strangely the day we went it was warm at the top but we went at 11am, Only 20 minutes wait at that time of day"], ["Reviewed January 15, 2018", 5.0, "Amazing", "First time going up the Aerial Tramway and we enjoyed it. Great view from up there and great staff. We were hoping to see some snow but unfortunately there wasn't any."], ["Reviewed January 15, 2018", 5.0, "Very cool!", "We bought our tickets there the day of. Pretty cool experience.The views on top are awesome! You can see all the way to the Salton Sea. There is a cafe & restaurant on top. Check it out if you are in the area."], ["Reviewed January 15, 2018", 5.0, "Surprising Customer service", "We did the tramway on Sunday January 7, 2018. We enjoyed it very much but my purpose here is to share a surprising customer service experience. A couple came up on the tramway and the gentleman became ill, possibly from the altitude change. He saw in the landing room for ten minutes and then he and his wife asked to go back down. They had to wait for the next car so their total time up on the summit may have been a half hour. My companion and I saw them in the welcome center at the base and he went over to them to see how the man was doing. He told us that they were being given a FULL refund. What an absolutely nice and correct thing to do. I was quite impressed. It is rare today to see this kind of customer service and I felt it needed to be recognized.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Awesome views", "Driving up to the parking area was almost as spectacular as the rest of the trip. What a beautiful trip all the way around and well worth doing!\nIt does cost $5.00 to park and a bus will shuttle you up from the lots to the ticket and boarding area. It can be a long wait for a shuttle depending on what time you arrive. We waited about 15 minutes, but the line was much longer than when we had arrived by the time we boarded.\nCost per adult is $26.50. Trams run every 10 minutes and they can hold a lot of people. It begins to rotate as soon as it pulls away from the docking area, so you get different views on the way up and down depending on where you are standing. We arrived at 12 and were assigned to the 12:30 tram.\nIt’s about an 10 minute ride and obviously very steep. There are bumps and sways as you cross each suspending tower, but it wasn’t scary. The view from the top was amazing. We found the temperature about 20-30 degrees cooler than the valley. There was snow, which was an awesome backdrop to the mountains and beautiful pine trees.\nThere are places to get snacks and drinks as well as a restaurant. Don’t expect it to be cheap!! A small candy bar was $2.79.\n\n\nShow less"], ["Reviewed January 14, 2018", 5.0, "Snow topped tramway", "Wow what a beautiful day ! Chilly, but absolutely beautiful in the snow at the top of the Tram way. The views were breathtaking and well worth it indeed"], ["Reviewed January 14, 2018", 4.0, "Fantastic", "I have been to a lot of different places, although the Aerial Tramway is amazing. We ended up going during the evening, which does get cold at night so i would recommend to bring a jack and light gloves. What we saw when we got to the top was unreal, my mom and I got to see the launch of the Falcon X satellite from there and it was nothing that we have ever seen. It looked like something from outer space. The tram it self from going up and back down was fun, got to see the sunset from there as well as getting pick of Palms Springs and the valley. The floor of the tram moves 360 so that you can see everything without hitting anyone. It was fun. There are different activities for everyone that goes up into the national park, lots of different trails to do from beginner to expert. Great time for us up there.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Great experience, do not miss!", "It is amazing to go from dessert weather to winter (with snow!) Bring some warm clothes, take your time to walk the trails and to watch the movie about how it was built, is amazing!"], ["Reviewed January 13, 2018", 5.0, "Business trip", "Large group and everyone enjoyed the view and ride. Would definitely recommend this attraction. Especially when the weather is good."], ["Reviewed January 13, 2018", 5.0, "Aerial Tramway", "The views were terrific. The gondola rotates so everyone has a great view on the trip up and down. The station at the top has a bar and concessions. All in all, a great attraction."], ["Reviewed January 13, 2018", 4.0, "What a view", "I've been to this attraction twice in the last 3-months and every time it was a different experience. I the heat of summer it was over 35-degrees cooler than Palm Springs proper; in the fall the colors were beautiful and in late December you could see forever. The ride up is mostly smooth but if you're afraid of heights never look down! Once on top the restaurants have great views and the food is a little expensive but good. The windows out show the forest on one side and the desert floor on the other. Hiking is great once you make it down the path. Don't overdue as at the end of your hiking you must come back up that steep path!\nShow less"], ["Reviewed January 12, 2018", 4.0, "A trip to a winter wonderland", "The tram was a great experience. The kids coming from Australia, have no experience of snow and were amazed to be knee deep in it after our ascent. Highly recommended."], ["Reviewed January 12, 2018", 5.0, "Excellent view", "One of 3 that rotates in world twice around up and down, interesting museum and short movie on construction, State park above with many trails, Grill, restaurant and bar."], ["Reviewed January 12, 2018", 5.0, "Favorite Palm Springs activity", "We've done this with my young son for the last 3/4 years. It is something we look forward to each trip. The tram ride might be a little claustrophobic for some, or scary if you don't like heights, but it is well worth the trip (just don't look down - keep looking up). Also be prepared for the dips when you go past the posts.\nhe hiking is amazing once you get to the top and so many different options and different things to see snow, desert, mountainous, woods, etc. We've been able to increase the challenges as my son has gotten older. Be ready for the climate change from the city and come prepared for your activities (water, jacket, sun screen).\nThe restaurant has ok food but has a great view, and a good way to regain energy after a long hike.\nShow less"], ["Reviewed January 12, 2018", 4.0, "Beautiful Experience-Top of Tram Restaurants Sickening", "Had a beautiful ride up to see the snow. Went for hike and came back to\n\"Pines\" for lunch. It used to be buffet-Cafeteria.\nOrdered French Dip and fries.\n\nNo juice or gravy, girl took meat out of plastic bag. French fries were burger king surplus,\nDid not tasre good as they were not fresh. Was sick to my stomach for the ride down.\nSfrongly urge bring your own lunch, have a beer or drink at bar.\n\nChoke and almost puke in Palm Springs.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Stunning view, great experience, lots of options at top \"Must do\"", "This is the second longest tram in world, and only one of two with rotating tramcars, two full revolutions each trip so you see it all. They sell tickets based on time of arrival and we waited a half hour during a crowded time so plan accordingly. Lots of parking and a shuttle to take you from the more remote lots, steep walk! At the top are two restaurants and a bar, we ate at sunset in the sit down formal side, so so food and poor service. The cafeteria side was packed and looked like good food at reasonable prices. View everywhere is stunning. Lots of hiking at all exercise levels, rare chance to be in the woods at 8,000 feet. This is something you really should do while in the area, great for all ages. Also a great free movie at the top in the small theater.\nShow less"], ["Reviewed January 12, 2018", 4.0, "Rotating Tram", "We arrived a little after 10am and drove the 4 to 5 miles from the visitor’s center. About ¾ the way, we had to pay the $5 parking fee. Apparently, there are several parking lots. Parking lot A is near the entry. It is a steep walk from the parking lot to the tram building. Be careful when you open your downhill car door, gravity will fling the door all the way open. If you park close to another car, you will ding the other car. We quickly purchased our tickets while the 10:30 tram was lining up to load. We had 10:40 tickets and loaded right on time. You go through a security check of bags and backpacks then enter another room and wait a few minutes before loading. The tram capacity is 80 persons and it does not have any seats. You can only stand. Of course, if you are adjacent to the windows, you have the best views. The tram actually rotates, so you get 360 degrees of views as you ascend and descend the mountain. Each time you go over the 5 towers the tram sways, the 3rd tower going up the mountain has the biggest sway. When you arrive at the top of the tramway, you enter the building on the 2nd level. The upper level has the best views of the valley to the north and the forests to the east, south and west. The upper level also includes a cafeteria and the Peak restaurant. The lower level leads to a steep concrete switchback trail that takes you to the forest floor. The forest includes 1.5 mile and 0.75 mile trails. These trails are adequately marked and not difficult. The hardest part of our trek was getting back up to the tram building. Of course, going down was easy. It is very steep. There are some benches on the way up if rest is needed.\nWe visited on a weekday in January 2018, it was 72 degrees at the visitor’s center in the flats when we began the drive up the hill. It was several degrees cooler, when we got out of the car at parking lot A. When we got to the top of the hill and got out off the tram it was 48 degrees. When we got back down to the visitor’s center (2pm), it was 77 degrees. Total time with lunch was about 4 hours.\nShow less"], ["Reviewed January 11, 2018", 5.0, "DON'T MISS THIS!", "During the busy season it fills up fast so it's good to go early. In the afternoon there was a 2 hour wait, even though it is very well organized. The ride it great, with spectacular views!\n\nOn the top there is a film about building the tram, gift shops and restaurants. Good food at reasonable prices. A fun time!\nShow less"], ["Reviewed January 11, 2018", 5.0, "A fun treat", "Worth the trip if you are vacationing in the area. The view at the top is spectacular, and the ride up and down is scenic."], ["Reviewed January 11, 2018", 5.0, "Amazing views", "Definitely worth a visit! Either go up just for 15/20 mins to just enjoy the views or hike down. The aerial tramway is really enjoyable and departs every 15 minutes."], ["Reviewed January 10, 2018", 5.0, "A must do", "An unbelievable experience. Plan to spend at least three hours on-top of mountain walking and checking all the view points. Have supper at the restaurant or drinks in the bar. Then come down at night for a whole new experience."], ["Reviewed January 10, 2018", 4.0, "Good for a half a day or so", "Quite popular and expensive. About a 10 minute ride up in a modern gondola. Can be crowded and you can spend time walking the trails. Bring a jacket. Views are spectacular and food and drink available."], ["Reviewed January 10, 2018", 3.0, "Disappointed", "I was expecting an experience akin to Table Mountain in Cape Town or the trams at Sugarloaf and Corcavada in Rio. Not even close.\nViews in tramcar obscured by grabrails and sashes, the view is quite distant to the town, and you have to exit to the outside deck in high winds for a decent view.\nOK just not great.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Just do it!", "A spectacular 10 minute ride up a steep cliff in a gondola that revolves so everyone gets great views on the trip (it revolves twice on the journey) to a breathtakingly beautiful national park at the top. There are routes for everyone whether you just want a stroll and some views or some serious hiking. The landscape is pristine and the air is so clean. Just make sure you get there early as it gets busy as the day goes on.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Nice hike", "We took the tram without reservations. We easily got an 1120 spot and did a beautiful almost 5 mile hike. Because of our timeframe we opted to eat at the sit down restaurant it was fabulous! The homemade vegetable beef soup was perfect seasoned well. My husband and I had wedge salad also perfectly balanced w right any of dressing. Our kids had turkey avocado clubs. This was a great experience especially since we didn’t have reservations.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Great Night Time Views", "This was my first time on the tram and it was great. Lucky that we bought the ride and dine package, so we got moved to the front of the line for going up. Otherwise there would have been over an hour wait."], ["Reviewed January 9, 2018", 1.0, "Only if you go early", "The tram takes you up to Mount San Jacinto State Park, if you like to hike plan to go early in the day, pack a picnic lunch and enjoy the beauty of the park. Just going up the Tram was disappointing. The food options are disappointing and they literally pack you into the tram itself. Overall very disappointing.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Always Exciting", "Having been up before, this time I have to say, it was just as exciting to ride the tram. The views are spectacular and the drama of the aerial tram never diminishes. Worth it for everyone visiting to try this."], ["Reviewed January 9, 2018", 5.0, "Must Do - Go 1st Thing in AM, Fantastic Views", "We almost didn't go because all the reserved tickets were sold out for the days we could go, after stopping by the visitor's center, we found out that you can just buy your ticket at the tram and they will fit you in.\n\nTIPS - Go Early (try to arrive before the first car goes up), use your AAA card for a discount, Dress in layers (cold in the winter months, even if 80 in PS. bring hat/gloves), If hiking bring 1 quart of water for every 3 miles you're hiking per person. no water on trail. Drive to the top of the parking lot to find the best spots.\n\nStop by the rangers station and talk with them about hiking.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Good views but overrated", "Tramway ride to the top is good with rotating car so you get the complete view. Get your tickets in advance for the specific time. Give yourselves some time for parking from there buses will take you to the tramway every 5 to 10 minutes. If you have tickets, stay to the right on the stairs and go to the cafe or boarding area. If you don't have tickets get in the line to the left (sometimes starts all the way from the stairs). make sure only one person is standing in line for tickets. others can hang out at the cafe or boarding area. I think the tram ride itself is a bit overrated as I have gone in many cable car rides before in Quito, Swiss, Hong Kong, Rio.\nShow less"], ["Reviewed January 8, 2018", 4.0, "Great Scenery", "We did the Tram twice - each time was a different experience. We had supper in the restaurant & traveled down after dark. Don't be in a hurry & be prepared for a wait - there are a few hiking trails & take warmer gear as it is cooler at 8,600 feet.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Amazing", "I have been going to P.S. for many years and until this weekend had never been on the tramway. We took a\n5 o'clock and had dinner reservations at The Peaks Restaurant. The view was spectacular ans the dinner was just amazing. I don't know why I hadn't done this before. This is a must visit if you are headed that way.\nShow less"], ["Reviewed January 8, 2018", 4.0, "a Must Do!", "The tram is wonderful and a day hike up top is to die for! The restaurant is a bit lack luster and the bar prices crazy though so plan accordingly"], ["Reviewed January 8, 2018", 5.0, "Great place for a day of hiking, or more", "We came up on a perfectly sunny day and the temperature at the top neared 50. Wearing a heavy leather coat was almost too much, but This was an ideal day.\nThere are hiking trails from .75 miles to 100 Miles, if you want with great views of the Coachella Valley and surroundings.\nBe prepared to walk incline and wear good hiking shoes to maximize your experience.\nWe got there within an hour of opening and had no wait at all. As the day goes on, it gets busy and the tram ride will have a wait,\nI have avoided this in the past, since I am from a cold winter climate, but on a good day, I’d head back up in an instant, pack alumch for a good long hike.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Beautiful day adventure.", "Beautiful. We walked the trails. Nice photo opportunity. This is a popular attraction in Palm Springs. They were very busy but we didn't have a long wait."], ["Reviewed January 7, 2018", 5.0, "Wonderful trip but take a heavy coat", "It is great fun taking the Palm Springs Aerial Tramway, but remember to take a heavy coat. It was very cold when we got to the top. I enjoyed the hot chocolate."], ["Reviewed January 7, 2018", 5.0, "Must see in Palm Springs!", "Great trip going up to the mountain and being on the rotating tram. You always have the best place in the tram. Food is not very good at the tram station so better pack some snacks."], ["Reviewed January 6, 2018", 2.0, "Poor communication while we were stuck up on top", "The tram ride itself and view are amazing, but both the long wait on the bottom (next time, we will buy our tickets in advance for the time we want to board) and the TERRIBLE experience at the top, where we were stuck for 2 hours waiting for a tram to take down really created a negative experience. There was absolutely no communication from the staff at the top as to why we had to wait 2 hours for a tram down the hill. Things happen and if we had gotten an explanation (i.e. power trouble, or heavy winds are slowing us down) that would have gone a long way. However, we were kept in long lines and then once in the holding area, still kept uninformed as to when the next tram would arrive. I would recommend asking before you board the UP tram as to what the travel down time is... if our ticket seller had mentioned the long delay, we would have chosen not to go up, as we missed our dinner engagement due to the long wait at the top.\nShow less"]]}}