{"Palm Springs Art Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Palm Springs Art Museum", "url": "/Attraction_Review-g32847-d103422-Reviews-Palm_Springs_Art_Museum-Palm_Springs_Greater_Palm_Springs_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/05/6f/4b/eb/palm-springs-art-museum.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1342"}, "address": {"@type": "PostalAddress", "streetAddress": "101 N Museum Dr", "addressLocality": "Palm Springs", "addressRegion": "California", "postalCode": "92262-5659", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Much much better than I expected. A must see experience.", "We really enjoyed this museum. The Women and Glass exhibit is very good. I definitely think this museum is worth visiting. There’s some Dale Chihully pieces. There’s a nice sculpture park outside. Lots of interesting things to see. Great gift shop too."], ["Reviewed 2 days ago", 4.0, "Above average enjoyable experience", "Didn’t expect much but was pleasantly surprised at how nice the art and displays were. Nice array of modern art in many forms. Very walkable and enjoyable for a modest price."], ["Reviewed 2 days ago", 5.0, "If you like modern art then this is the place to go", "The art museum is close to the main street in Palm Springs and has parking. The collection is fun and interesting wit the focus on modern art and a small western collection. The media include sculpture, glass, and painting. Outdoors on the lower level is a small but excellent sculpture Garden.\nShow less"], ["Reviewed 2 days ago", 4.0, "Impressive Artwork", "This is an impressive art museum, with several different types of exhibits, and a good number of works shown on display. There were particularly some very impressive modern art specimens as well as a special feature of female glass artists. A number of different genres are there. It is easy to do the entire museum; there is a nice flow from floor to floor.\nShow less"], ["Reviewed 3 days ago", 3.0, "Not the strongest for its size", "In such a wealthy community one would hope for a more focused curatorial direction. There is some mice work on view, likely more in storage but it did not leave a strong impression. The auditorium is a nice facility"], ["Reviewed 5 days ago", 5.0, "Great Variety", "This museum has an excellent collection in a manageable building. Not too enormous or overwhelming, but you still get to see an incredible variety of work. Loved it."], ["Reviewed 6 days ago", 5.0, "Always a favorite", "We always like to come here when we are in Palm Springs. The museum is just the right size to spend a few hours admiring the modern art. Our favorite is always the glass."], ["Reviewed 6 days ago", 5.0, "nice", "We were in Palm Springs for a short vist. we enjoyed the Museum. It was located very convient to down town coverd parking was very convient."], ["Reviewed 6 days ago", 5.0, "Modernism Week", "I attended many lectures at the museum over the course of the extraordinary modernism week. Every time the standard exceeded expectations. The pop in bistro was wonderful. Lovely location in the sculpture area and great food"], ["Reviewed 6 days ago", 4.0, "A very eclectic collection", "Worth a visit, we returned to enjoy the free admission Thursday 4-8. Probably enjoyed the crowd as much as the art. Each piece has information about it and several locations had docents speaking and a lecture in the auditorium was announced so a visit at this time offered benefits beyond the free admission.\nShow less"], ["Reviewed 1 week ago", 3.0, "Worth a short visit if you have time", "Not the greatest art museum in the world but work a visit if your looking for something to do. Ample parking. Certain days the admission is free."], ["Reviewed 1 week ago", 4.0, "Beautiful Museum", "We viewed a special glass exhibit. Arrived late Thursday for free entry. Saw all we needed to see and then went for dinner."], ["Reviewed 1 week ago", 5.0, "Nice Exhibits", "We were very pleased with the museum. It is well laid out and has a very interesting collection for a museum of it's size."], ["Reviewed 1 week ago", 5.0, "Great museum", "In December we visited the glass art pieces by women artists. It was a well curated show as there was an excellent variety of pieces that used glass in diverse ways. Outside of this special exhibition, we noticed American crafts that showcased again different materials such as pottery, leather, fabric. As we climbed the stairs, I was impressed with the museums collection of acquisitions over time such as a Lipschitz. And further up still, the contemporary pieces made art accessible to all ages. I wanted to bring my grandkids back because I knew the colours, designs and topics would spark intriguing discussions. This collection and curation are jewels in a museum small enough not tire the viewer. 8mpressive\nShow less"], ["Reviewed 1 week ago", 4.0, "Very nice afternoon", "It was very informative about local culture and there was an excellent Glass exhibit by Women artists. The outdoor sculpture garden was a plus."], ["Reviewed 2 weeks ago", 5.0, "Great collection; well-curated", "Excellent collection of art from many places as well as local connections. Certainly worth a couple of hours. Docents are knowledgeable and helpful. Easy access to displays and lots of information given in the galleries. Easy walk from downtown and near hiking trails."], ["Reviewed 2 weeks ago", 4.0, "An excellent local museum", "This museum is easy to tour and offers convenient free parking. Exhibits in included mid-century modern furniture and art, a sculptural garden, contemporary paintings and sculptures, and an excellent temporary show on glass works by women."], ["Reviewed 2 weeks ago", 5.0, "Transcends regional boundaries", "This is a significant art museum, showing many major works, and significant regional work as well. The spaces are large and generous, the traveling exhibitions are unfailingly interesting, and the span of art shown will keep you engaged as you make your way through the museum. Cost of admission is reasonable, and this trip can be combined with other things to do in the immediate area.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Not to miss", "After visiting Palm Springs for many years, I finally made it to the Art Museum and was blown away! It's immense and took us two visits to see it all. Loved everything we saw and how things were presented. We'll be back every visit!"], ["Reviewed 3 weeks ago", 5.0, "Brief but inspiring visit", "I had gotten to the end of my visit to Palm Springs and had still not seen the Palm Springs Art Museum, so I squeezed in a 45-minute visit on a Monday afternoon. There were less than a dozen other visitors in the whole place (so that's a great time to go!). I was able to quickly cover three floors. The sculptures, paintings, and glasswork inspired awe and stirred the kid in me. Some of the permanent exhibits -- the giant spinning plates -- were downright fun! I highly recommend a visit here -- do it first, not last -- and I will go again when I can linger. The intricate detail and creativity of the current exhibit \"No Glass Ceiling! Women Working in Glass Part 1\" (through March 5, 2018) is worth a visit on its own. And if you love glasswork, there is a large Chihuly piece in the center of the museum. Note that adult admission to this museum is $12; it is free only at the Palm Desert location.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "take the docent our", "wWith the docent tou, r what a great introduction to their modern art collection! One of the best things we did in Palm Springs"], ["Reviewed 4 weeks ago", 5.0, "Go on Thursday late afternoon!", "Went Thursday late afternoon when admission is free. I’m guessing it was more crowded because of that but the art work was worth seeing! Top floor is the most interesting part."], ["Reviewed 4 weeks ago", 5.0, "Amazing!", "A truly wonderful museum and an amazing experience. Well done Palm Springs! Thoroughly enjoyed everything we saw and would definitely go back and recommend it."], ["Reviewed 4 weeks ago", 4.0, "Nice Way To Cool Off", "It was pretty warm the day I visited the area. Had been walking the main strip and was looking for a non-food/beverage spot to cool down.\n\nIt was easy to spend an hour casually looking around. Interesting Native American woven bowl collection located here. Also some older stone art from 900-600 B.C.E and 600-900 C.E.\n\nNot a ton of stuff but well worth an hour or so of perusing.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful!", "A fantastic building with four floors of galleries and a sculpture garden! The art works on display ranged from ancient to current artists. Quite an interesting combination of artworks. We particularly enjoyed the Women in Glass show. Outstanding and fascinating works. Don’t miss this fabulous art museum!\nShow less"], ["Reviewed January 24, 2018", 5.0, "Worth a stop", "This museum looks hugefrom the outside but has a nicely displayed collection and did not take but an hour and a half to see. There is a good variety and some western art and modern art."], ["Reviewed January 23, 2018", 5.0, "Great glass exhibition", "If you have some spare time stop by the Palm Springs Art Museum, you won't be disappointed. The \"No Glass Ceiling! Women Working in Glass, Part 1\" alone was worth the price of admission. George Montgomery's hand crafted furniture was amazing! Great visit."], ["Reviewed January 23, 2018", 3.0, "It's a Regional Museum", "I specifically went to see Dale Chihuly, but they only have about half dozen pieces. However, there was a glass exhibit which was very interesting; modern local artists and native basket weaving. The gift shop was interesting. I would visit again if there was a special exhibit on.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Unique Stuff", "Probably the largest piece of Chiluli glass ever, and the always surprising driftwood horse. Unique woven middle eastern \"flowing\" rug hanging that seems to say \"we were once an ordered, disciplined and artful society and now have been reduced to chaos\".\n\nVery good basket collection, nice gift shop. Free parking. Coffee shop was closed midweek.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Beautiful building. Interesting exhibits.", "If nothing else, the building itself is worth the price of admission. Some very famous people and some very generous people have done the city Palm Springs a huge tribute.\n\nWith its various floors and the outdoor courtyard it does a great job of telling the story of the Desert West. I would say it was much more meaningful for me after taking a couple of the walking tours put on by the palm springs historical society. They are a must.\n\nBut there is much to enrich your life in the art museum.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Terrific Collection!", "My parents and I were visiting the Palm Springs area so we decided to check out the Art Museum. What an amazing surprise! Terrific collection and just the right size. We were there for the Kinesthesia exhibit which was excellent. Highly recommend!"], ["Reviewed January 18, 2018", 4.0, "A Fun Museum", "First visit to PS: go here and cool down a bit. The first and second times to the museum, this is a short delight. Not too large for children - but hands off. This is a small museum with a rather diverse set of displays. The third visit was a little familiar. Make sure to get to the fun basement.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Palm Springs Art Museum", "What a gem in the desert! Fabulous museum, Mr Reed as our docent was terrific and informative. Loved Rhe Women in Glass exhibit!"], ["Reviewed January 15, 2018", 3.0, "Some Good Exhibits and Events at this Small Museum", "The Palm Springs Art Museum offers some good exhibits and events for locals and visitors alike. The permanent collection - featuring some examples of Native American, Western and modern art - is not very impressive. Free Thursday evenings after 4PM, but expect a crowd during the high tourist season. The Annenberg Theater in the museum is a very good venue for films.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Lovely small museum", "We spent 2 hours enjoying the beautiful exhibits in this wonderful art museum. Especially notable was the \"Glass Ceiling\" exhibit of woman glass artists--just amazing. The museum is free on Thursdays after 4 pm, just be prepared for crowds if you're in Palm Springs int he high season.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Lots of interesting art. Free Thurs 4-8pm.", "Lots of interesting, wide ranging art here. Free on Thursday evenings from 4-8pm. Also free docent tour at 5pm. Rotating temporary exhibits provide new things to see every few months."], ["Reviewed January 12, 2018", 3.0, "Go Thursday 4-6 for free", "Nice new building with plenty of space just not much in it. Saw women in glass, 20 pieces 4 good others to modern/abstract for me. Good collection of native baskets. Only one Moran and one Russell. They seem to spend their endowments on space and have not purchased much art to fill it nor have they had major gifts from benefactors , like Denver has with impressionists.\n.\nShow less"], ["Reviewed January 9, 2018", 5.0, "A joyful and eye opening collection of art in a small museum.", "My husband and I have been to this charming small museum twice in the past year.\nThe art blew us away each time. The permanent exhibitions are lovely enough to bring a smile every time we see them again. The new sculptures and paintings are very powerful and the special exhibit we saw there recently on women artists in glass was amazing.\nI think it is a hidden treasure and shouldn't be missed. Easy to get to and easy to park.\nEntrance fees are reasonable.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Nice small museum", "Take an hour or so and visit. Very soothing and convenient to downtown. Free museum parking and overflow across the street in free city ramp."], ["Reviewed January 3, 2018", 5.0, "always fun and with innovative and current themes.", "This is a small very accessible museum that never fails to provide food for thought and the soul. Affordable, accessible, (although it is blocked by the towering new hotels.) and enjoyable."], ["Reviewed January 2, 2018", 5.0, "What a nicely curated musuem", "The Palm Springs Art Museum is a treasure. There is a very eclectic permanent collection and some very nice visiting exhibits at the museum. In January there will be an Andy Warhol show that looks worth checking out.\nIt took my wife and I about 2 hours to tour the collection and the admission price is $12.00 for an adult ($10 for seniors).\nIf you go on Thursday after 4 the admission is free. Definitely a stop worth making.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Something for Everyone", "This is a small museum with enough variation of exhibits to appeal to almost anyone. It is well staffed, offers a guided tour, and has a nice gift shop. Very affordable and located in a convenient part of downtown Palm Springs."], ["Reviewed December 28, 2017", 5.0, "Great for family", "I have a crew of high school and young adult kids with us on vacation. Finding a fun adventure everyone likes can be tricky. Yet, we did it with the museum. Fun exhibits that intrigued all ages and delighted all eyes. Just large enough to keep us entertained without overwhelmed. Incredible glass exhibit and extremely knowledgeable docents. Our art major asked many questions and the docent was on her game.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Small Art Gem in Palm Springs", "My wife and I love art and go to museums when we travel. Although we did not have high expectations in Palm Springs, we were surprised. The museum is not large, but has a good permanent collection and had two or three small special exhibits which were well curated. The modern statues and Latin early art were quite good. The contemporary art on the third floor is not my cup of tea, but is well exhibited and fun to see. Well worth the trip and right near downtown against the mountains.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Varied exhibits that offer something for everyone", "I always try to visit this museum when I'm in Palm Springs. It's convenient and very affordable. They have interesting rotating exhibits and I usually find something in the permanent collection that I missed before. There is western art and beautiful desert landscapes from the California Impressionist school as well as contemporary art. The current exhibit of glass art by female artists (\"No Glass Ceiling! Women Working in Glass, Part 1\", through Mar. 5, 2018)) is awe inspiring on many levels. I also enjoyed the Kinetic art from Latin America (\"Kinesthesia: Latin American Kinetic Art, 1954–1969\", through Jan. 15, 2018). The Photo Secessionist work (through Mar. 28, 2018) is very noteworthy. There is a great little gift shop and a nice restaurant. The people who work there (many volunteers) are pleasant and very helpful.\nShow less"], ["Reviewed December 21, 2017", 5.0, "who knew?", "i love modern art, especially when it is disolayed well and lit. who knew alm springs had such a diverse and important collection!"], ["Reviewed December 21, 2017", 5.0, "interesting museum of art", "We spent time there since we attended the Palm Springs International Film Festival when the films were shown there."], ["Reviewed December 21, 2017", 4.0, "Wonderful Surprise", "Stumbled onto the museum while strolling around Palm Springs one evening and discovered it was free, beautifully laid out in an open concept way, had friendly staff specifically designated to answer art questions, and had many very interesting artworks and especially great pieces of sculpture."], ["Reviewed December 19, 2017", 4.0, "Plenty for everyone", "Went with my wife and enjoyed the experience . They have an eclectic collection of paintings , sculptures and various artifacts appealing to many tastes . Some I found to be modern art wacky and others I found truly inspiring .\n\nI was there when school children were touring the museum and it was a delight to see their faces light up when they saw something new and appealing . They have an outdoor sculpture gallery that is not to be missed . Mother Nature provides a backdrop that is nothing short of impressive .\n\nBottom line : very well done and worth the time to tour this wonderful museum .\nShow less"], ["Reviewed December 18, 2017", 5.0, "Great glass show and fabulous paintings", "Enjoyed viewing the additional juried art show that competed for a part of the Museum collection on the first floor. What a cool thing to support local artists!"], ["Reviewed December 13, 2017", 5.0, "Palm Springs Art Museum is a gem!", "I visited this art museum and I really LOVED it! It has a wonderful array of exhibitions and installations and it appeals to all ages and audiences. It's a must-see when you're in Palm Springs."], ["Reviewed December 10, 2017", 5.0, "Unexpected rich museum.", "We were impressed with their general presentation and their collections. First, the design of the building is organised from a center court where all the large halls of exhibitions converge.\nLots os space to appreciate the art works. Great collections of European and 20th century American artists. The sculptures collections are of many disciplines. A great museum to put on your list of places to visit while in the area.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Docent tour provided in the afternoons", "Visited the museum on a Tuesday afternoon. Ample parking and several docents were available to aid in the enjoyment of experiencing the exhibits.\nThe special exhibit on the first floor was \"Women Working in Glass part 1\". A magazine was available for free that provided a picture of the art work being exhibited as well as a narrative from artist with an explanation of the sculpture and the technique used to create the piece.\nI recommend the docent tours - the docents give a new prospective on the works of art that they highlight- I will never look at art in the same way. Walking around a picture, or sculpture enhances the experience.\nThere is a restaurant at the museum which is currently being renovated. It should reopen in Feb. 2018.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Went on a Thursday night", "Free on Thursday nights!\nImpressive space and well curated. A wide variety of art with a good connection to this geographic area.\nVery nice staff and volunteers.\nNot the greatest for smaller children as most exhibits are “reachable” by them, do Jeep a close eye on them while there.\nShow less"], ["Reviewed November 29, 2017", 5.0, "amazing", "went for free on the thursday street market nite, was an added bonus for us unintelligent non-arty people. was pleased we toured as i was unaware Picasso made pottery as well(i am very uneducated). heaps of well known artist represented here"], ["Reviewed November 29, 2017", 5.0, "Well worth a visit", "A great place to spend a few hours, with particularly strong collections of modern sculpture and art of the American West. The architecture of the gallery is lovely. Although not huge, there are lots of great names in modern art represented here. When I visited, there was a superb visiting show on as well. Parking is extremely convenient, immediately adjacent to the building.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Beautiful Museum. The best attraction in Palm Springs.", "We found the art and sculptures very interesting. We wish we could see more museums of this high quality in our own home town."], ["Reviewed November 24, 2017", 5.0, "World class museum, well curated and displayed.", "I have been to the Palm Springs Art Museum five times. Each visit has brought me to appreciate the museum's collection and the shows they host."], ["Reviewed November 21, 2017", 5.0, "An absolute gem!", "Beautiful collection of traditional and contemporary art in a beautiful building. Gift shop had a good selection of local items and mid century themed gifts. Lovely staff.."], ["Reviewed November 21, 2017", 2.0, "Saw Art Museum", "Quite a variety of Art. Most not to our taste, except for a couple of items that we quite enjoyed. Certainly not impressed with garbage bags filled and piled up.\nWe went on an evening it was free so can not complain about cost. Would not pay to attend.\nShow less"], ["Reviewed November 20, 2017", 3.0, "Lovely museum", "A lovely Museum and a nice way to spend time whilst in Palm Springs. Not the easiest to find if you're on foot but I got there in the end!"], ["Reviewed November 20, 2017", 5.0, "You must go to this art museum! What a gem in Palm Springs", "Great collection of art, furniture and special exhibits. Staff are very helpful and knowledgeable. Save your ticket and sticker so you can also go to the architecture museum several blocks away. I think they are also valid for visiting the museum in Palm Desert (which was closed for remodeling at the time we visited).\nShow less"], ["Reviewed November 19, 2017", 5.0, "The Art is Enlightening", "Great kinetic exhibit. The museum had some very interesting pieces. The sculpture garden was fun. It is small but some nice pieces are exhibited. Very glad we made time to visit."], ["Reviewed November 18, 2017", 5.0, "Eclectic!", "Museum has a wide range of exhibits from color, to moving art to glass and celebrity created art. M favorite was art made by George Montgomery. As well as being an actor he was a skilled wood craftsman and tables and chairs he made are on display. He also did bronze sculptures and one he did of Butch Cassidy and Sundance Kid on horseback is there and one of Clint Eastwood is there also.\nIt is wonderful that they open for free after 4PM on Thursday which is the evening of the Village Fest in PS.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Great museum", "Luckily I went on the free night - Thursday I think - which I didn't know till I got there. A volunteer gave me a thorough rundown before letting me loose.\n\nThe White Room really messed with my head. Its really an experience when you can do it without anyone else in there with you. My brain kept trying to process the color but it almost kept giving me vertigo with its constant attempts to judge depth and color.\n\nLots of cool pieces that kept me staring at them for a while (the light boxes most especially). The upper level was full of all different kinds of things that I enjoyed.\n\nStaff was super helpful and really nice.\n\nWould absolutely come back.\nShow less"], ["Reviewed November 14, 2017", 4.0, "If You Enjoy Art, Stop By!", "This is a really fun place for those who love art or simply want to escape the heat while looking at some cool exhibits. Check with their website to find out the details of what is being featured to see if it's something that interests you.\n\nThe facilities are well kept and organized. Also the staff is friendly and helpful if you have any questions. Enjoy!\nShow less"], ["Reviewed November 13, 2017", 5.0, "Stop and Stare!", "Add some culture and learn at the same time! Staff polite and welcoming. Beautiful exhibits, and we'll curated. Must see!"], ["Reviewed November 12, 2017", 5.0, "Holiday activities", "As the weather was abysmal we were looking for indoor activities. The dosa t at the museum was excellent and the display was very well organized?"], ["Reviewed November 10, 2017", 5.0, "Great attraction for art lovers", "This is a small museum with an interesting permanent collection and routinely mounts wonderful spcial exhibitions. Currently -- November 2017 -- two special exhibitions are well worth a visit. One major exhibition is of \"kinetic\" art by Latino artists. The selected items mounted in the exhibit feature light, shadow, and motion -- providing fascinating viewing. Special gallery installations invite the viewer to \"take part\" in the viewing with fun and interesting features after walking into the spaces. The museum also currently has a wonderful installation of glass art by very skilled women artists. Although the museum restaurant was closed for remodleing when this review was written, by the time many will read this, the restaurant will be reopened, providing a great place for a lunch or snack break.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Not To Be Missed!", "\"Whenever\" is a good time to visit the Palm Springs Art Museum but now is an especially outstanding time. The current show, Kinesthesia, offers unique interactive experiences for visitors. At its entrance a large three-dimensional optical illusion that moves as you move contains a secret passage that, from a viewer's point of view, appears to lift one's soul from one's body! And then there's the much advertised color exhibit which, with a little experimentation of staring first at a wall, turns an immersive light experience into a psycheledelic room of rainbows! Many many fun and surprising experiences await you. And it's all part of Pacific Standard Time (thank you Getty) featuring Latin American artists. Don't miss it!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great experience on South Western Arts", "Many exhibits great exhibits. We really enjoyed good portion of morning here to see many different types of arts. I am not an Art type of person, but this was a good place for family and enjoy. On third floor, I thought there were old couples sitting down on bench, but that was actually an art. You will enjoy it.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Terrific art musuem", "This is a 'don't miss' musuem whenever we visit Palm Springs. While some of the art displays remain constant the main floor has new exhibits every few months. Very diverse there is probably something to please every artistic taste. The current exhibit of Latin American Kinetic art was so interesting. Make sure to spend the time at each piece as they are on timers so not always 'on' at the same time. Worth the wait. On Thursday's from 4-8 admission is free.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Awesome collection", "The current exhibit of Latin American Kinetic Art was unusual and fascinating. Exhibits are varied and engaging on so many different levels. Everyone in the family felt artistically fed, I noted to my husband afterwards, it was like a breath of fresh air through my brain, to wish he enthusiastically agreed.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Very nice, eclectic collection of art on four floors", "Great place to spend a warm afternoon! Great kinesthetic art exhibits! The most striking exhibit is on the fourth floor, where we encountered an elderly couple quietly fixated on a modern art piece. It took a second look to realize that they WERE an art installation themselves! Creepy!\nShow less"], ["Reviewed October 31, 2017", 5.0, "Diverse collections of art", "This gallery ('PSAM') has a wide assortment of art and mediums on display. As befits a communtiy with some generous (and wealthy) benefactors, there have been many donations that have helped make this a top art musuem in the USA. From modern to classic, and much Americana art from the past centuries, a truly impressive collection. While not every piece will attract you (art is subjective, after all) you're sure to find enough to engage you. Note: free admission Thursdays 4pm-9pm!\nShow less"], ["Reviewed October 29, 2017", 5.0, "Amazing!", "This place was a huge surprise! Such an interesting collection, eclectic and fun. There was an interactive kinetic show that entertained for some time. It was nicely spaced and super comfortable."], ["Reviewed October 25, 2017", 5.0, "A gem in the desert", "Excellent collection of modern art. Nice presentation. Great pieces of Moore, Picasso, Warhol, Liechtenstein, ...Temporary exhibition of kinetic art and glass art by female artists was well done! Worth a visit."], ["Reviewed October 25, 2017", 5.0, "Great Museum", "This museum has a wonderful collection and a wide variety of artists. It is a place to visit when you are in Palm Springs. We spent hours there going through the different exhibits, both permanent and visiting. The curator has a great sense of what works together and a eye for interesting work.\nShow less"], ["Reviewed October 24, 2017", 5.0, "COOL Museum and venue", "The Art museum is excellent and has regular temporary installments that continue to draw major crowds. Last year, the \"High-Heels show\" was amazing. History and humor rapped all in one show. They have the theatre downstairs and they host a LOT of events locally."], ["Reviewed October 21, 2017", 5.0, "A gem of a local museum", "We arrived 25 mins before closing and the ticket desk were very accommodating to us. Lovely Picasso plates."], ["Reviewed October 21, 2017", 5.0, "Wonderful mid-sized art museum", "This museum has a great selection of art and easy to spend a couple of hours exploring. From the Native American basketry of the West to the incredible kinetic art exhibit, there is always something of interest. We always run into the same couple who sits upstairs resting their weary body.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Great museum", "I make a visit to this museum on every trip to Palm Springs. Exhibits and the permanent collections are always fresh and the building itself is spacious and beautiful. Great cafe with outdoor seating."], ["Reviewed October 19, 2017", 5.0, "Wonderful museum", "I've been coming to the desert for many years and I always make a point to take in PS Art Museum. One of the many treasures of the area. I think they always have at least one exhibit that will appeal to you. I have many memories of some of their past exhibits. Thursday evenings are always free admission that coincides with the Thursday street fair. Relax and enjoy....\nShow less"], ["Reviewed October 17, 2017", 5.0, "Brilliant", "What a great mid sized contemporary museum (4 floors). They have a variety of spaces to show both there own and touring collection / exhibitions.. A really well curated modern art display. The sculpture garden is worth the visit itself, small, calm and perfectly formed."], ["Reviewed October 16, 2017", 5.0, "Surprising", "Wasn't sure what to expect but ended up spending a couple of hours just wandering around the place. Great displays."], ["Reviewed October 11, 2017", 4.0, "Worth a couple of hours ...", "With at least two locations in Downtown Palm Springs, the Palm Springs Art Museum is worth a visit. The exhibited collection is not large but well selected, well presented and housed in a simply gorgeous building that defies common sense as to why it is there.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Enjoyable experience", "I visited the art museum on a Sunday and on this Sunday it was free which made me happy. The museum has several levels of art displays and for being a museum on the smaller size, I had one of the best times I had ever had in an art museum. The displays were outstanding, with a friendly staff and if you have the time when you are in Palm Springs you should really stop by and treat yourself to a great experience\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great museum", "I loved the kinetic art exhibition. The permanent collection was interesting and well presented. Not too big...I would think you'd need at least an hour, though. A well stocked gift shop and the guard were very helpful in getting a wheelchair the senior in our group. I nice reprieve from a hot day.\nShow less"], ["Reviewed September 24, 2017", 3.0, "Escape from the heat", "Not many signs and found it by accident after stopping for a coffee. Most of the kinetic art was not kinetic and uninspiring. After 4pm it is free which is helpful as we would have been disappointed if paid. All in a few interesting artworks but nothing outstanding. If you want to get out of the heat then go and visit.\nShow less"], ["Reviewed September 12, 2017", 3.0, "Some real gems - showcasing modern and contemporary art", "I am visiting from out of town.\n\nThe curator strikes a balance between earlier western and modern works - many of which I found thought prevoking and emotionally evocative. I also found the experiential and perceptual art engaging and fun. The sculptures were a pleasant surprise.\n\nOh, addmission on Thursdays is free. What a great gift - PSAM. I would return and recommend this venue.\n\nMy rating is 3/5 as I have seen better exhibits in larger cities.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Take a break , enjoy an air conditioned eye candy visit \"", "The Palm Springs Art Museum was founded in 1938, and is a regional art, natural science and performing arts institution for Palm Springs , California . From Native American to Modern you will be mesmerized by this Incredible huge museum . A natural allowance to rest , admire and re generate your energy for further outside sightseeing , I promise you will thank me later ~ enjoy\nShow less"], ["Reviewed September 9, 2017", 5.0, "Just right...", "Have visited the Palm Springs Museum several times. I have a short attention span, so it's perfect for me. Not too big...not too small...just right. Definitely worth a visit!"], ["Reviewed September 8, 2017", 5.0, "Must visit", "Far more energetic and eclectic that you might imagine in a town of roughly 40,000 (full time) residents -- fascinating touring shows, a very impressive in-house collection (sculpture and art), a collection of glass art which just dazzles and, always, exhibits which challenge and inform. Highly recommended.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Art Museum!", "Loved the art collection! Very well designed and divided in different sections that makes visiting really interesting and very flowing. They had the Kinetic exhibition on when i visited and I've find it mind blowing., you must try the Light rooms. Absolutely mesmerizing!"], ["Reviewed September 4, 2017", 5.0, "Great modern art museum", "Had an exhibit of kinetic art the was fascinating. The permanent collection is also very good with some wonderful pieces of modern art by iconic artists."], ["Reviewed September 4, 2017", 5.0, "Wonderful Museum in Palm Springs", "We visited the new Kinesthesia Exhibit at the Palm Spring Museum - it is amazing. We have to go back. The 3 light saturated rooms are different colors - the colors fade and brighten - you feel like you're in a fog at times - impossible to explain but a must see. There are also more rooms with more kinesthesia exhibits. Of course, the rest of the museum is wonderful - and a great place to escape the summer heat.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Outstanding!", "This museum has good open space to highlight its extensive modern art collection. A huge white ceramic dog now greets visitors at the entry and sets the tone for this fun museum. Currently (August 2017), \"Making It Modern\" has an all-star lineup with stunning paintings, plates (Picasso), and sculptures including Jean Arp, Henry Moore, Barbara Hepworth. The outdoor sculpture garden always intrigues me. In addition there's a cafe, a renovated book/gift shop (can always find unique gifts here) and permanent pieces, such as early Mayan pieces, Indian baskets, hanging glass sculptures, and the weary life-like elderly couple at the top of the stairs. In contrast I always feel enriched and rejuvenated after visiting.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Worth a visit", "We stopped by here to get a break from the heat but we're very happy we got the opportunity to enjoy the exhibits here. Not all of us are really into art but there seemed to be something for all of us."], ["Reviewed August 28, 2017", 5.0, "Personal tour", "Be sure to get a docent led tour. Ray was incredible with background details and customized the tour to my specific interests and energy level. So glad I arrived in time for the regularly scheduled 2pm tour. I look forward to returning next year and enjoying it before my room is ready. Also relaxed in the Muse cafe with a good lunch selection.\nShow less"], ["Reviewed August 16, 2017", 3.0, "Interesting", "A small but interesting collection . Worth a stop but certainly not a must visit in Palm Springs. Three levels in a very open space, the museam has a lot of Native American art and worth while descriptions of the history of Palm Springs"], ["Reviewed August 13, 2017", 4.0, "Not bad for a smaller location...and some great shows", "This museum is not on a level with larger city museums but has a respectable permanent collection as well as some very interesting shows. Thursdays nights 4-8 p.m. have been free to the public."], ["Reviewed August 7, 2017", 5.0, "Lovely Contemporary Collection.", "Face it, it's too hot to be out in Palm Springs in the daytime in August. Why NOT take in the art museum. And, it was a very pleasant surprise. Lots of artists I hadn't heard of, plus some I had: Picasso, Braque, etc. Very airy rooms, with well-used space. Loved the glass sculptures, which include a giant one by Dale Chihuly. Had lunch at the Cafe, which was just right, and very reasonable.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Fantastic!", "My entire family and I thought this museum was fantastic! A wonderfully curated collection of modern art of a quality that you would normally expect to see in large cities. Very good value admission. I highly recommend stopping off here."], ["Reviewed August 6, 2017", 5.0, "Great Collection", "I was not expecting to be so wow'ed by this museum. It's not a massive museum, but it has a wonderful and thoughtful collection. I especially appreciated the glass exhibit and the modern floor. The gift shop was small but full of lovely items.\n\nWe spent a very happy two hours here and would definitely go back if we return to Palm Springs.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Free Thursday Night - Superb Contemporary, Statue, and Art Museum - Palm Springs, Ca", "We went to the Palm Springs Art Museum on their free Thursday night. They also have free parking.\n\nThere are several floors of art work. I liked the modern art (contemporary) art the best. There is also a nice Chihuly art glass piece. There is a superb exhibit on Native American vendors. They have an interesting art video with a dog. There is a sculpture garden and more.\n\nWe very much enjoyed our visit.\nShow less"], ["Reviewed July 28, 2017", 5.0, "My Anniversary weekend", "Very nice museum, modern art, nice way to cool off for the afternoon. Really interesting art. My hubby ended up buying some pieces from the store museum. I truly enjoyed it."], ["Reviewed July 23, 2017", 4.0, "Very nice Muesum", "Interesting Museum with good close up access to the aircraft. Staff very friendly. I particularly liked being able to go inside the B17, although you have to pay extra to do so."], ["Reviewed July 20, 2017", 4.0, "Great even for a non-museum guy", "Very approachable even for me as a non-museum person. It is not a huge collection which makes it very manageable.(since Virtually all is on one floor ).\nPlus it's beautifully laid out with room to move and to comfortably walk on to the next section.\nAlso a good mix of media from oils to handmade furniture...; from sculptures to photos..\nShow less"], ["Reviewed July 13, 2017", 4.0, "A cultural oasis", "A lovely building housing an eclectic, Palm Springs-sized collection, better than you think it is likely going to be. There are 2 sculpture gardens, as well as a gift shop and a small cafe. Note: free admission on Thursday evening (4:00 - 8:00), so you can easily combine it with a visit to the nearby, less artful Village Fest street fair.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Must Visit Treat", "Our small group had a wonderful time visiting and it was the \"coolest\" place in town, literally!\nMuseum offers an eclectic assortment of modern/contemporary, native, meso-American and local art in a variety of mediums. We discovered pieces from Picasso, Warhol,Henri Matisse,Charles Bibs and Dale Chihuly to name a few. Make sure to visit their friendly shop, as there is a fabulous assortment of unique gift ideas, books and more for any occasion or anyone on your list. The admission fee is very reasonable and various discounts are available.\n\nDefinitely will return for a repeat visit when we are in a 100 mile or less proximity.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Cool spot and nice collection", "This is a great way to get out of the heat and enjoy a nice collection of art. Includes modern and traditional pieces. Call to find out free entry times. Worth the visit."], ["Reviewed July 10, 2017", 4.0, "Much better than expected", "Nicely displayed and curated. If you get a chance to go on Thursday evening, you are in for a treat as it is free. Many different collections, friendly staff and a great gift shop."], ["Reviewed July 10, 2017", 5.0, "Excellent small art museum in Palm Springs", "This is a very good although small art museum, but it has some very interesting collections. Especially interesting were collections of George Montgomery's furniture and other artifacts he collected. There was also an excellent collection of native baskets. While a small museum, there are some pieces by major artists such as Picasso, Chagall, and others. It's size makes it very accessible and you can easily see everything in just a couple of hours. The displays are very well done and well lighted. Definitely recommend a visit.\nShow less"], ["Reviewed July 8, 2017", 4.0, "Worth visiting", "There are many varied and interesting exhibits in this museum, some of which are interactive and really make you think! The admission is very reasonable considering the amount of time you could spend there. We enjoyed the sculpture gardens as well as the lovely cool temperatures of the Museum. There is a café on the lower level which was quite busy the day we were there and a very nice gift shop. Admission is free on Thursday evenings when the street market is on. Parking is free.\nShow less"], ["Reviewed July 1, 2017", 4.0, "Pretty neat", "I am definitely not an art lover. Went with my wife. They have some big name artists. To me some of it does not look like art, but it is. It is that way at any art museum."], ["Reviewed June 29, 2017", 4.0, "Modern and Architectural Art in an Open Design", "The Palm Spring Art Museum has been around for decades, highlighting the arts of the Palm Springs Glitterati as well as the local early settlers. The museum is quite eclectic, with numerous rooms devoted to specific styles or pieces. The furniture section shows mid-century modern furniture, some of it a highlight of George Montgomery (an early movie cowboy turned cabinet maker) creations. The art of basketry was also shown in another room, while pottery was shown in another. A \"pop-up\" artist exhibit featured mache works, while an exterior sculpture garden showcases art out of the discarded. Modern paintings and sculpture round of the collection, with a few odd carpets and Inca carvings thrown in for good measure near a Chihuly glass sculpture. Overall, it was an interesting respite from the 125 F temperatures. Free on Thursdays after noon!\nShow less"], ["Reviewed June 27, 2017", 4.0, "Beautiful Museum", "We learned that on Thursday evenings there is a street faire and that the museum is open with free admission. Admittedly we got there too close to closing time to really enjoy the entire museum but it is a beautiful facility with many interesting exhibits. We really enjoyed the Chihuly glass structure, If you enjoy art museums, worth a stop. We will return and spend more time there on our next visit.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Excellent museum!", "We were very pleasantly surprised by the wonderful exhibits at the Palm Springs Art Museum. We happened to be there in time to catch the \"Women of Abstract Expressionism\" exhibit, which was comprehensive and well-curated. Besides that exhibit, we especially enjoyed the contemporary art glass exhibit, which included pieces from several artists that we admire (e.g., Chihuly, Tagliapietra). This museum's collections/exhibits expose visitors to artistic diversity, for example, Movie star George Montgomery's furniture making, Picasso's clay statues, Native American basketry, art of the American West and more. The interior of the building is lovely - light and airy, and a cool respite from the extremely hot temperatures outside.The time we spent here was quite worthwhile. In fact, we didn't have time to see everything we wanted.\n\nNote: If you happen to be there on a Thursday, the admission might be free (opens at noon that day - at least as of this writing). I think this encourages folks to be part of the Palm Springs Thursday night VillageFest event.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Art Lovers Rejoice!", "So glad we were visiting Palm Springs during one of their unusual rainstorms last February! Other wise, I never would have discovered this jewel in the desert. Wow! My husband and I spent hours wandering all 4 floors of this amazing collection.\n\nUpdate: Visited the museum again just yesterday. (This time the city was experiencing one brutal heat wave and I wanted to avoid the 118 degrees outside!) Anyway, it was a heavenly way to spend a few hours. Currently, they have their 'Make it Modern' exhibit on display. Loved it!\n\nBest advice: During the summer months, the museum is FREE on Thursdays!\nShow less"], ["Reviewed June 4, 2017", 2.0, "Baby screaming acceptable museum", "I bet this is the only museum that allows baby screaming. When a visitor complained to the staff, he was told there is no policy to remove screaming baby. Really? Something is very wrong with the management. If not for this incident, it was not a bad place to visit. Liked the sculpture garden.\nShow less"], ["Reviewed May 31, 2017", 5.0, "A world class museum in a perfect location", "We have been members for several years. This museum enjoys a very healthy endowment and philanthropic support. The permanent collections range from modern to western art and glass. Always something new in terms of travelling or assembled shows. Easy to tour without committing and entire day. Don't miss other locations focused on sculpture and architecture.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Impressive Chihuly Glass Sculpture", "We drove out to Palm Springs from the Inland Valley specifically to see Dale Chihuly's stunning glass sculpture which is part of the Contemporary Glass Exhibit. We were given a free tour by a museum volunteer who pointed out details of the exhibits and answered our questions. There are three levels to visit which includes a museum store on the main level. The lower level has a sculpture garden and a small cafe. The Annenberg Theater is located on the lower level as well.\nShow less"], ["Reviewed May 29, 2017", 4.0, "More than meets the eye", "What a great museum!! This was both new and older exhibits, but really interesting. Can only recommend!"], ["Reviewed May 28, 2017", 5.0, "Women in Abstract Expressionism-wow!", "I'd been to the Museum previously and enjoyed the permanent collection, but this visit was really special. We saw paintings by Lee Krausner and Elaine DeKooning to name a few. The raw emotion and spectacular technique!"], ["Reviewed May 25, 2017", 5.0, "A mid-century modern masterpiece", "The Palm Springs Art Museum, in the heart of town, is a mid-century modern architectural masterpiece and the collections housed inside do justice to the beautiful building. We visited at dusk, while strolling downtown during the Palm Springs weekly Village Fest and were able to see it under the evening light, which enhanced its lower level open area and sculpture garden even more. The 3-stories of gorgeous interior spaces and world-class collections were a feast for the eyes and soul, as well, And, as part of the Village Fest event, the entry fee is waved on Thursday evenings, as an added bonus ! A must-see place when visiting Palm Springs !\nShow less"], ["Reviewed May 23, 2017", 5.0, "World Class Museum!", "I traveled to Palm Springs mainly to see the exhibit\" Women of Abstract Expressionism\" which was excellent.We took a guided tour with a very informed docent who was delightful and insightful by the name of Vincent Stoppia. Many other top drawer exhibits make this a must see stop for anyone interested in the arts.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Gem", "This art museum is fantastic. Very reasonably priced and walking distance from most of downtown. There is a huge free parking lot. Don't miss the sculpture garden outside of the cafe. Even when really hot is pleasant to sit out there. They have world renowned artists as well as little known. Check out all the floors , don't let the \"old folks\" on the third floor scare you or do. Even the architecture is cool. If you like art at all this museum is a must see.\nShow less"], ["Reviewed May 22, 2017", 5.0, "A good mix of artwork", "A good mix of artwork from a variety of Southwest art to contemporary. You'll find local artist's work there as well."], ["Reviewed May 21, 2017", 4.0, "Gem of a museum in the desert", "For a small town, this is a terrific museum. Is it MOMA or the Met? Of course not... but it's really swell. They have a lovely permanent collection, a lovely sculpture garden, and we saw a fantastic temporary show there (Women of Abstract Expressionism). We also like their Architecture and Design wing (in a different location) if there is a good exhibition there. Definitely worth a visit.\nShow less"], ["Reviewed May 20, 2017", 5.0, "A Gem of a Museum!!", "Art for everyone's taste.. women's abstract, modernism, western &on and on it goes. 3 floors including a cafe & sculpture garden. Thursday admission is free from 4-9pm. Stop by before going to village fest."], ["Reviewed May 16, 2017", 5.0, "Great art per square foot", "Each time I have been here I have been surprised by the quality of the exhibits considering the smaller size of the museum. They presently have an excellent exhibit on Women Neo-Expressionists. The curator did an excellent job with selecting the women to showcase as well as the examples of their art. They also have a wonderful glass art exhibit; but the stars of the museum reside on the 3rd floor which is fir their permanent collection. There are two artists who really stood out - Faig Ahmed whose tapestry rug is breathtaking and Jim Campbell whose work is mystifying and mind boggling. Art should make you think and marvel at how creative people can be.\n\nI was also reminded that their museum shop is better than most of the large museums across the country. They have so many interesting items that make terrific gifts as well as wonderful mementos. If you are looking for something that \"no one else has\" take a look.\nShow less"], ["Reviewed May 13, 2017", 5.0, "And a great place for a challenging hike", "Interesting collection just the right size not too big not too small. The hike out the back corner of the parking lot look straight up the side of the mountain. Great view of the city"], ["Reviewed May 13, 2017", 5.0, "Beautiful Collection of European and Native American Art and Artifacts", "Very popular art museum staffed with knowledgeable docents and artisans. Ever changing displays covering contemporary glass, native American basketry, women abstract artists, and many more collections. Plenty of parking, easy access and has a small, but decent restaurant available. Well worth the visit"], ["Reviewed May 12, 2017", 4.0, "Lovely Location at the Mountain", "This is a great museum to visit on a Thursday night while the Street Fest is on, as there is no entrance fee. We have been to this museum many times over the years and while a number of the exhibits remain the same, they always have something new to see. The gift shop is lovely, and while expensive, you might find something you 'must have'. The volunteers who work there are always pleasant and knowledgeable.\nShow less"], ["Reviewed May 9, 2017", 3.0, "interesting building , weird collection, astonishingly rude ticket seller.", "this is a splendid museum in a design sense, especially the 2 outdoor sculpture gardens. the \"collection\" seems to comprise a bunch of disconnected bits of painting and sculpture, albeit with some wonderful henry moore's , which appear to be either on loan or donated by \"collectors'. seems very tax deductible driven. awful board in the foyer naming people and their $ donation level. worth a visit as the building is great in terms of light and design, just don't get offended by the appallingly rude grey haired man at the ticket counter. truly the rudest person in such a role i've ever encountered!!\nShow less"], ["Reviewed May 5, 2017", 5.0, "We went, we saw, we enjoyed!", "Thursday is free admission day and the free trolley bus runs right past the museum on that day so it is very convenient and easy to visit the museum."], ["Reviewed April 28, 2017", 5.0, "Lovely museum and great exhibit", "Go to see the Women's Abstract Painting exhibit. It will be a gift you give yourself. Twelve artists work displayed beautifully!"], ["Reviewed April 25, 2017", 5.0, "Well-curated exhibits", "We always enjoy this museum. The special exhibits are thoughtfully arranged with informative placards. The one we saw on Women Abstract Expressionists included biographies and their creative philosophies. Not being a fan of this style, I left with a revised appreciation. This is the rare museum to feature women in regular holdings, such as CA artists.\n\nA small exhibit on George Montgomery displayed his artistry in woodworking and sculpture, contrasted with Western themes of his time. Once again, the unusual juxtaposition led to new insights.\n\nThe regular galleries are always a pleasure. This is a significant regional museum. Check for events as well.\nShow less"], ["Reviewed April 24, 2017", 4.0, "Manageable art museum", "We had a nice hour or two spent here. The museum is a manageable size for a quick visit. Not all the art was to our liking but hey that is what art is all about. Loved the sculpture garden. Worth a visit if you enjoy art.\nShow less"], ["Reviewed April 22, 2017", 5.0, "What a great find!", "Just had a few hours for an afternoon visit out of the heat. Terrific exhibition currently on women abstractionists from the post-war to 1960's. Lots of other great exhibits from the museum collection."], ["Reviewed April 15, 2017", 4.0, "Small, but a very nicely laid out museum", "They have special exhibits for extended peiods of time and a regular sampling of different art styles, i.e. Western paintings, Indian pottery, etc. Free on Thursday afternoons 4 - 7 PM. Nice gift shop and all of the volunteers are very helpful and friendly. I will go back again. Worth the trip.\nShow less"], ["Reviewed April 14, 2017", 5.0, "A quick visit!", "I didn't have time to actually visit the museum's exhibits and do justice to them, but I did want to at least walk in to this gorgeous building. It was a breath of fresh air from some of the usual Palm Springs architecture. I browsed through the gift shop which was well worth a visit on it's own. There was a lovely variety of merchandise for all ages.\nShow less"], ["Reviewed April 11, 2017", 5.0, "More than just modern art", "I had put off going to this museum as I had heard it was a modern art museum and I am generally not a fan of that genre. We were surprised what a diverse collection there was. Western art, Native American art, glass art and a larger collection of modern with some interesting and appealing pieces. Don't miss seeing the tourist couple taking a break on an upstairs bench, and check out his watch.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Excellent small museum", "Wonderful contemporary collection thanks to the generous donations of the MacMillan family. Eclectic tast will challenge even the most experienced viewer. They also have a fine sample of glass and Western art. A charming venue."], ["Reviewed April 10, 2017", 5.0, "Beautifully done - not to be missed!", "Have enjoyed wandering and taking in all the amazing art on several occasions - especially nice during a hot summer day! Always something interesting to see. Great for entertaining visitors. Highly recommend"], ["Reviewed April 8, 2017", 4.0, "Interesting, Quirky Museum!", "The Palm Springs Art Museum will surprise you; the extent and the depth of their collection is extraordinary. I was unaware of their 80-year history, so I was unprepared for the vast collection of fine art. My wife and I especially enjoyed the glass artwork on the Mezzanine floor, but there are numerous \"hidden gems\" around every corner. Recommended.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Worthwhile museum!", "This is a great museum. Free on Thursday. Great exhibits, tours, and speakers. Some exhibits are indoors as well as outdoors. Plan 2-3 hours."], ["Reviewed April 3, 2017", 5.0, "What a Trip", "Plan to spend at least 2 hours, parking, waiting for shuttle to take you to the ground terminal, buying tickets and then waiting for your time to be called, the pictures being taken as you board the aerial cars, then the time up the mountain, of course time for the beautiful view.\nShow less"], ["Reviewed April 2, 2017", 5.0, "A great way to learn about the architectural history of the area", "Free and filled with helpful docents, you can learn a great deal about the architecture and art history of the Palm Springs area. It's not overly large and the shows change."], ["Reviewed April 2, 2017", 5.0, "Loved it! A gem in the desert", "Spent two hours in this gem of a museum. Incredible variety -- Western, MesoAmerican, modern glass, modern art... and sculpture gardens outside. Some fabulous pieces and great special exhibits. Thursday nights during Villagefest it is FREE... terrific deal (but make a donation, so worth it)."], ["Reviewed April 2, 2017", 5.0, "Womens Abract Art exibition", "Wonderful samples of women's early abstact art. Very powerful. In addition, there are wonderful exhibts of local artist and American Indian art."], ["Reviewed April 2, 2017", 4.0, "Free visit Thursday evening, nice place", "The art museum here is a pleasant surprise, a nice place to spend an hour or two, with collections of Native American crafts work, art from the American West, and a collection of modern art. It is free from 4-8PM on Thursdays. Try it!"], ["Reviewed April 2, 2017", 5.0, "Surprisingly lovely museum", "I'm so glad I decided to check out this great museum. Spectacular layout with a great collection of female expressionism. A very worthwhile excursion."], ["Reviewed March 30, 2017", 4.0, "Intimate and Modern", "A pleasing place to spend an hour or two. Thursday evenings after 4:00 are free! Lots of modern and western art but not on a huge scale."], ["Reviewed March 29, 2017", 5.0, "Well Worth Visiting", "Entry was free on the Thursday night downtown fair. This museum was surprisingly nice for people spoiled by Boston, NYC, Chicago, L.A., Paris, St. Petersburg and Madrid."], ["Reviewed March 29, 2017", 4.0, "Great collection of vintage planes that actually fly", "A collection of war planes and models and pictures and maps. You are taken through each stage of each war. Very educational. This is not the typical air museum."], ["Reviewed March 27, 2017", 5.0, "Must-see lots of fun spent two hours here enjoyed every second of it . Three levels of modern art sculptures.", "Spend here about two hours. Have a great time. Admission only $15 free easy parking two thumbs up. Good for a couple, fun for the family."], ["Reviewed March 26, 2017", 3.0, "Wheelchair culture hit", "The gallery is wheelchair accessible with an elevator outside the North entrance taking you to an accessible entrance into the building. There is relaxing sculpture are on the lower floor together with a pleasant cafe. Offering sandwiches and salads. An ideal lunch. Service was very good and lunch was tasty.\n\nThere a further 3 floors housing the various artworks. Most of the works are modern - contemporary with a smattering of older works. They had a very interesting local 1960's exhibition interiors The travelling exhibition was a bit too abstract for my more traditional taste however the exhibits on the upper floors were really pleasing. Favourite being the melting carpet.\n\nThe shop was very well stocked with interesting merchandise.\nShow less"], ["Reviewed March 26, 2017", 5.0, "Much better than expected", "We came to the art museum to get out of the sun & for a change of pace. There was a special exhibit of abstract expressionism that was excellent. It included a short video for explanation. The museum itself is lovely with a nice sculpture garden. However, without the exhibit, it may have been a quick visit.\nShow less"], ["Reviewed March 24, 2017", 5.0, "Beautiful Gallery", "A stunning space with a great collection of art. A couple of hours allowed us a leisurely visit through the galleries and outdoor sculpture garden. Thrilled to see the show \"Women of Abstract Expressionism\" running until May 28, 2017."], ["Reviewed March 22, 2017", 5.0, "Fantastic indoor and outdoor galleries!", "Helpful staff and volunteers. Very open floor plan makes it a pleasure to stroll around. They have free nights here and there so try to catch them on those."], ["Reviewed March 19, 2017", 5.0, "Galen Art Museum in Palm Desert and sculpture gardens of Palm Springs", "What a hidden gem this was. Gallery housed ongoing and temporary art pieces. Displayed blown glass sculptures at this time. Amazing works of art. The Docent was so informative and eager to show us pieces of interest. Outside we visited the sculpture gardens . With their winding walkways and natural rock benches surrounding many water features. The Indian Maiden sculpture was amazing. So life like. I was impressed with the no entrance fee. Excellent must see.\nShow less"], ["Reviewed March 19, 2017", 1.0, "Very disappointing", "Obviously, I am not an art connoisseur. I do enjoy good artwork, but saw little of it here. My little grandsons could do as well as several of the pieces here."], ["Reviewed March 17, 2017", 4.0, "Nice smaller museum", "Quirky and fun. Light and airy. Don't be looking for major works but be happy to be exposed to something new and original."], ["Reviewed March 16, 2017", 5.0, "A gem!", "Small enough to cover in an hour or two. Large enough to offer real treasures. I absolutely loved the current show on female abstract expressionists. Don't miss it if you are in town."], ["Reviewed March 13, 2017", 5.0, "amazing museum worthy of any major city", "This museum boasts one of the finest collections of mid-century European and American modern sculpture this side of the Mississippi. The Henry Moore's alone are worth a visit and they are in good company with other famous artists. And even more surprising is the range and innovative reach of its international contemporary collection. While rooted in prominent California artists, it places their works in the context of global art trends and the issues that define current practices. Well worth the trip out from LA.\nShow less"], ["Reviewed March 13, 2017", 4.0, "Monday morning art tour", "very enjoyable and time well spent. Monday morning had very few people which was great. There was a great variety of art on display."], ["Reviewed March 13, 2017", 5.0, "a wonderful trip back in time from when I was on a flight crew", "We attended a volunteer gathering and were really impressed with the displays. The even had a part of my old aircraft (C-119 flying boxcar) cockpit. I was able to show my wife where I sat as the radio operator. I left there feeling like I had just experienced a wonderful viewing of the past aviation era.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Great Experience", "Put The Palm Springs Art Museum on your itinerary. The unique exhibits are expertly curated and the docents are wonderfully prepared to present this place of enrichment and enjoyment."], ["Reviewed March 11, 2017", 3.0, "Somewhat disappointed", "We have visited many art museums and galleries in our journeys. This is a fabulous building but we were disappointed as the cleanliness needs improvement, there is active docent and individual museum staff conversation ongoing in more than one installation. The major exhibition was discombobulated as there wasn't a specified travel pattern. More than a couple of times we viewed pieces without first viewing the artist bio. Disappointed that there was very little representation of southwest painting. There was very little local artist works. Having said that, the native baskets, sculpture and glass works were stunning.\nShow less"], ["Reviewed March 11, 2017", 5.0, "If you like art, and the West, and hollywood celebrities, you have to check this out", "The art museum is truly a reason in itself to go to Palm Springs, similar to the Norton Simon in Pasadena, the Getty Villa in Malibu, and others in SoCal. The modern collection is accessible to kids, adults, cognoscenti, and amateur art appreciators. The staff was extremely knowledgable. There's an art Glass section, two outdoor sculpture gardens, and both Native American basket art, and Hollywood photos that were just fun to look at. The information staff have lots a of additional advice about other art and architecture attraction in the area, not to be missed, as well as natural sites to visit.\nShow less"], ["Reviewed March 11, 2017", 5.0, "Sweet little museum with a varied and beautiful collection.", "We went on a Thursday afternoon, which is free to the public. You can see the thought and love that has gone into making this museum a little gem."], ["Reviewed March 10, 2017", 5.0, "Great", "I went to see the Woman's Abstract Expressionism show and was pleasantly surprised with the variety of pieces in the museum's collection. I love western art, indian art, modern art, and so was excited to see all the examples they had on display. This is not a run of the mill museum. They have some truly first class artists and pieces.\nShow less"], ["Reviewed March 10, 2017", 5.0, "Impressive Collection", "I spent two hours at the museum and thoroughly enjoyed my visit. The featured exhibit \"Women of Abstract Expressionism\" was impressive. I also enjoyed the collection of baskets of varying sizes. Don't miss the Chihuly and other sculptures on display. A charming and moving surprise was the narrative quilts made by Faith Ringgold.\nShow less"], ["Reviewed March 10, 2017", 5.0, "Must Visit", "Colourful, exciting and thought provoking. We visited twice when we were there. Lots to see. On Thursday evenings visits are free."], ["Reviewed March 9, 2017", 4.0, "food", "The small Art Museum cafe serves delicious freshly made hot soups. Can be eaten indoors or outdoors in the Sculpture garden."], ["Reviewed March 8, 2017", 4.0, "Don't skip this one!", "Wonderful small museum with varied \"plums\" from all ages, from 3,000 year old meso-American carvings to 50's modernist furniture."], ["Reviewed March 7, 2017", 3.0, "OK art museum", "Well worth a visit if you are looking for something to do. There is no admission fee although there is a donation slot if you wish. The gardens/sculptures outside are interesting, don't miss. Inside the gallery is an eclectic collection of artsy stuff."], ["Reviewed March 7, 2017", 5.0, "Include this on your visit", "This manageable-sized art museum is first class--don't miss it. Free parking. Great exhibits. It provides a really nice experience."], ["Reviewed March 6, 2017", 5.0, "Great Visit", "A small museum with a very nice collection of art from local artisans as well as a surprisingly varied collection of art from around the world. Mostly modern art, this museum is well organized and easy to browse in about an hour."], ["Reviewed March 6, 2017", 4.0, "Really nice museum", "We visited the museum on a Thursday evening (free entry) before going to the street fair. It was tough to find a place to park, but we enjoyed the museum quite a bit. You can go through the museum in an hour or two and it is well worth the visit.\nShow less"], ["Reviewed March 4, 2017", 5.0, "One of the best art museums of our California trip", "This museum really cares about art. The variety of treasures was amazing and the special exhibit of modern women painters was extraordinary. Loved the variety of art- the sculpture garden is a real treat."], ["Reviewed March 4, 2017", 5.0, "Great way to spend two hours on a rainy day", "Wonderful diversity of art, from abstract to photographs, in a space of attractive ambiance. We were impressed with the greeting by a docent, who gave a quick overview of where to see what."], ["Reviewed March 3, 2017", 4.0, "Intriguing collection of modern and western art", "While we are not particularly fond of \"modern\" art, this museum displays this genre in a very effective manner. There is also a good local connection to the works of actor George Montgomery who was an accomplished furniture maker and sculptor as well being a famous actor. We were also surprised to find some nice western themed paintings by N C Wyeth which were unexpected as we were aware of the Wyeth Maine connection. We spent the better part of an entire day with our son who has more art appreciation than I do.\nShow less"], ["Reviewed March 3, 2017", 3.0, "Spend some time to visit", "A great place to visit while in Palm Springs. Some very interesting and unusual art and sculptures house in a lovely modern and cool building in the heart of the city."], ["Reviewed March 3, 2017", 4.0, "Wonderful art museum !", "This isn't a large museum but you can spend a couple of hours enjoying it at your leisure. Seeing the architecture of the building is worth taking in. the space is light, bright and open. Lovely!"], ["Reviewed March 3, 2017", 5.0, "Try not to miss", "We very much enjoyed the museum. It was a welcome change of pace form the myriad of nearby stores and restaurants. We particularly enjoyed the western art and the fabulous display of \"indian\" basket art. We were less impressed with the feature display of abstract impressionism.\nShow less"], ["Reviewed March 2, 2017", 4.0, "Experience The Arts", "The Palm Springs Art Museum offers a diverse collection, in spacious and comfortable spaces over a few floors. Staff are friendly and helpful. The Women of Abstract Expressionism exhibit was fabulous. Afterwards, enjoy a drink and snack in their Muse Cafe."], ["Reviewed March 2, 2017", 5.0, "Super Exhibit", "We went here before our first Modernism event on the Sunday of President's Week-end. Sometimes a museum is a mishmash of bits and pieces of semi-important pieces and many times there is no coherence of the exhibit. No matter. The curators of the Women's art exhibit absolutely designed a spot on exhibit.\n\nThe pieces were almost all abstracts... with a heavy dose of Pollack's and DeKoenig's (sp) wives, who were great artists unto themselves. It got us off to great start for our immersion into mid-century modernism.\n\nThe regular exhibits were pretty standard fare that most good local museums are blessed with from their patrons.\n\nIt's an easy way to spend an hour to two hours.\nShow less"], ["Reviewed March 1, 2017", 5.0, "Beautiful facility", "Had a nice couple of hours wandering around the exhibits. Beautiful facility. Clean and well organized with friendly staff to answer questions."], ["Reviewed March 1, 2017", 5.0, "Great airplane museum AND history museum.", "The number of WWII aircraft are amazing. Also Korean and Viet Nam aircraft. Docents are very knowledgeable and will answer questions. Great library, and you can even fly a simulator. Great place to spend some time."], ["Reviewed March 1, 2017", 5.0, "What a treasure!", "Every time I visit this well-designed space for modern art, I discover something new. This time it was Bob Pruit's Deset Flea Market (only 1 week long) that occupied space in the redesigned foyer/entrance area that also now has bright cube seats and a different flow. In addition to the currentWomen of Abstract Expressionism & Grqass Roots shows I found some recent acquisitions, such as Faig Ahmed's Osho that melted down in the wall in a colorful stream. If you want to learn more about the architect of this museum, go down the street to thePS Art Museum Architecture and Design Center that is currently (Feb. 2017) featuring a video on the architect.\nShow less"], ["Reviewed February 27, 2017", 5.0, "The museum is free on Thursdays and Sundays.", "This museum has a very interesting collection of Western \"cowboy\" and \"indian\" paintings, some fantastic modern art sculptures, classic modern furniture, and digital art, as well as some beautiful cactus and sculpture patios on the lower level, with a nice coffee shop."], ["Reviewed February 27, 2017", 5.0, "Variety in The Collection", "We were pleased with the variety in the collection. Nice mix of mediums including sculptures. Easy walking with elevator if you need one."], ["Reviewed February 27, 2017", 4.0, "Interesting Collection", "We visited on a Thursday evening, as admission is free from 5pm to 9pm. I was expecting to pay for admission to the travelling exhibit, Women Abstract Expressionists, but it was part of the free admission too. What a wonderful surprise. I believe it is due to funding received from the municipality of Palm Springs, which is so great to see. The permanent collection is an interesting mix of media & styles & well worth a visit, if you haven't been before.\nShow less"], ["Reviewed February 26, 2017", 4.0, "free Thursdays, 4-8pm", "This is a small but interesting Art Museum that we enjoyed walking through. The gift shop has impressive offerings, at many price points"], ["Reviewed February 26, 2017", 5.0, "A great little museum", "This museum is just the right size for a visit of an hour or two. Great mix of modern and traditional art. I especially loved the section with the George Montgomery art, furniture and sculptures. Free admission on Thursday nights as well as on the second Sunday of the month.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Awesome", "This museum has amazing exhibits and never disappoints. Mostly modern pieces in a beautiful Palm Springs setting in the downtown area."], ["Reviewed February 26, 2017", 5.0, "World Class Meseum, Elite Exhibits, must see", "Recently we were in Palm Sorings for Art Palm Springs 2017. Prior to the show we visited the Museum. The facility is top notch and the exhibits and art works world class. Also a fabulous gift store. Much to do in the dessert this time of year, the weather is perfect.\nShow less"], ["Reviewed February 25, 2017", 4.0, "Interesting find", "The museum is conveniently located within walking distance of the center of town. Large variety of exhibits. Didn't have time to see everything. A good reason to return."]]}}