{"Petco Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Petco Park", "url": "/Attraction_Review-g60750-d482152-Reviews-Petco_Park-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/c2/a5/2b/caption.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "3721"}, "address": {"@type": "PostalAddress", "streetAddress": "100 Park Boulevard", "addressLocality": "", "addressRegion": "California", "postalCode": "92101-7405", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Clean and fun place to visit!", "We did not go to a game but took a segway and toured Petco Park which we loved! It was so clean and neat everywhere! Downtown is beautiful! We enjoyed the tour with personal touch of the history of the park along with the games attended. We would love to go back to see a game!\nShow less"], ["Reviewed 4 days ago", 5.0, "Worth the visit!", "Petco Park is one of the best MLB parks around. It’s clean, people are friendly, good drinks, great food and the views of downtown are truly amazing."], ["Reviewed 1 week ago", 1.0, "Homeless", "Way too many transients laying around. We did not feel safe at all. I really want the city to clean this area up. It has potential."], ["Reviewed 1 week ago", 5.0, "Family Day", "Had the pleasure of taking employees to see a Padres game for the day. The employees had a great day spoke about it for months."], ["Reviewed 1 week ago", 5.0, "Cool stadium!", "This stadium is super cute. There's an entire outfield area dedicated to dogs and their humans. Stadium wasn't overcrowded at all. Midway through the game we went across the street to a hotel rooftop bar where you can look down into the stadium to watch the game while having fireside drinks.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "One of my favorite stadiums", "May not be historically what Camden and Fenway are, but this place is beautiful and has some of the best food options I’ve seen. It’s very easy to move and has lots of good seats. Also in a great area for activities outside of games"], ["Reviewed 2 weeks ago", 5.0, "Jose and team provided the most interesting of tours", "Being from the U.K. means we have little knowledge of baseball. However, the tour was hugely interesting and engaging. From the hall of fame to the changing rooms to the press box, the field etc. We had an outstanding tour. The facilities are incredible at Petco Park. I’d loved to have seen a game there. Hopefully on our next visit. 10/10 even if you have little knowledge of baseball. Multi story car park opposite had plenty of spaces and quite reasonable.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Whatz not to like?", "Its great venue to catch a baseball game. Go Padraes. If you get an opportunity to see a concert- I saw the Rolling Stones there a long time ago. Wow. It's nice."], ["Reviewed 2 weeks ago", 5.0, "Tour of the Stadium", "This tour is very good. You get to see the broadcast booth, the field, dugout, hall of fame just to name a few places. The tour lasts about 1 1/5 hours. Once the tour is done you get another tour guide for the hall of fame. Wear comfortable shoes. The tour was very interesting and informative. Our guide had a lot of stories.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A ballpark just over a decade old in SD", "Park in a structure nearby and pay for it or take the trolley or a lyft. This newer ballpark has some distinctive Southern California features like a grassy hill were people watch from blankets to specific industrial decorations to make the stands blend into the downtown cityscape. The box seats we experienced offered puffy leather chairs with flat screens above the buffet to offer non stop game views. Although I’ve been for as little as $15 and definitely check out Hodads burgers!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great evening of baseball", "Great evening of baseball. And easy walk from our hotel. Nice crowd and of course a good hotdog. Make sure you walk toward the correct entrance. We had a walk around the block a few extra out of our way to get in."], ["Reviewed January 23, 2018", 4.0, "Tour of the stadium", "Very informative and Cheryl the guide loves her Padres She loves the stadium and her job Even though she tried to be funny she actually made me feel uncomfortable being a Yankees fan\nThe fellow who finished the tour in the Hall of Fame part of the tour was much nicer and more knowledgeable without the attitude\nYes I recommend the tour but pretend you are a Padres fan!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Outstanding stadium", "The food options are pricy but that’s to be expected in the city. The stadium its self is super clean and a great atmosphere to experience any sort of entertainment there. Very good experience!"], ["Reviewed January 22, 2018", 5.0, "Even if the team is bad you gotta go to this beautiful ball park!", "Located in the heart of the action downtown, you don't have to be a huge baseball fan to enjoy this ballpark. Easy parking near the park with TONS of great food and party bars right next to it. Once inside try a California favorite, the Rubio's fish taco at one of the many concession areas...\nShow less"], ["Reviewed January 22, 2018", 5.0, "outstanding venue and experience", "So, think that a ball game is going to be a long, boring experience? Think again. We caught the Padres game against the Cubs and were surprised at the end of the game that we'd been there for 4 hours. The experience from start to finish kept us both (wife's first game ever) interested and entertained. The staff working the game were incredibly helpful and very, very friendly. Will definitely do this activity again, next time we're in beautiful San Diego.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Beautiful stadium in downtown SD", "We went to a game last year, really fun, beautiful stadium and walking distance to Gaslamp district. Its a great night out in downtown"], ["Reviewed January 16, 2018", 5.0, "\" Great Educational & Interesting Tour \"", "My friend and I went on a Petco Park for a 1 1/2 hour tour. We went all over the ballpark, and learned so much from Patty our tour guide. Patty was so energetic as she took us all over Petco Park, and would tell us stories about the history of the Padres, and the other events at the Park. We went up to the broadcasters booth, and all the way under the stadium where the players go. We also visited the Western Metal Building where we could get some great views of the field. Great tour and well worth the time and $$$.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Business Reception", "Went to a private event here. Food was exceptional and the facilities were so clean. The lounge/bar with the pool tables was an awesome addition to the event and obviously, the rooftop bar is awesome and provides a great view of the city."], ["Reviewed January 14, 2018", 5.0, "One of MLB's Best Venues", "Great place to take in a ballgame. Close to the field for a modern stadium, with great sight lines. There's a variety of seating choices from the usual... to bar tools in several areas beyond the outfield or on a terrace at a sports bar inside the park. Great selection of beers from many of the San Diego micro breweries. If you can take the stadium guided tour on non game days\nShow less"], ["Reviewed January 11, 2018", 5.0, "Lovely Ballpark", "This is a beautiful ballpark. The Padres owners have a lot of things to work out on their end of things. If you want to just visit the park and don't care who is playing, pick a weeknight or a less exciting team for less expensive tickets. You can also pay for ballpark tours, but then you don't get all the fun of concessions. Sunday games are kids days with lots for kids to do free at the Park at the Park. (No more $5 park at the Park tix, so these can get expensive for some games.)\nShow less"], ["Reviewed January 10, 2018", 4.0, "Went with church group, was great!", "Even if you don't like or know baseball, like I did, the nice atmosphere and lack of overpricing makes this an excellent place to catch a game. It offers a glorious view of downtown, sitting in its seats."], ["Reviewed January 4, 2018", 5.0, "Stadium tour. Fun and informative!", "Stumbled across the baseball park as neither me nor my wife our big baseball fans. Still decided to do the tour and so glad we did. It was so much fun and a great opportunity to experience baseball. The tour costs $17 and gives access to the museum, changing rooms, VIP boxes, dugouts and pitchside. So much fun and well worth a visit.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Almost as nice as AT&T", "I've been here a few times and am a bit saddened by how many Giants fans are here, visiting from NorCal and that apparently live here. It's one of the prettiest parks, along with AT&T and Safeco Field (SEA). Really friendly people in every direction even if you're a Giant fan, wearing Giant gear. Walking distance from all the downtown hotels. Tons of restaurants and bars along the way.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Phenomenal Tour Even if You Are Not a Padre’s Fan!", "This was really a fun tour! We enjoyed seeing the Stadium & our tour guide, Mike, was very informative & funny. Tour is 90 mins & includes the field, the press box, visitors locker room, Lexus VIP Room (wow, wish we had a membership!) dugouts, indoor batting cages, etc. Mike shared lots of interesting & curious tidbits about what happens there behind the scenes!! Field is so well manicured & you get to see all the ‘sponsorship’. Well worth it!\nShow less"], ["Reviewed December 30, 2017", 5.0, "Excellent stadium. Great concert venue. Mediocre baseball team.", "Petco park is beautiful. Well designed. Views for everyone. Lots of food and beer vendors charging high prices. Parking around the place is minimal and often pricey. Trolley connects you to everywhere but can get crowded right before or after an event or game."], ["Reviewed December 29, 2017", 5.0, "Tour and baseball", "We did a tour here and came to see two baseball games verses the Colorado Rockies. Loved the baseball - our first ever games and the tour was great too. It’s a very modern stadium that has all the bells and whistles. During the games it was great to see such impressive food and drinks on offer. Leaves home for dead.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Nice tour", "They take you through the stadium and explain the inner workings. Groups can be large (30 plus). Allow at least 90 min. Vets get a discount on tickets. Lots of walking"], ["Reviewed December 26, 2017", 3.0, "LIke Watching Baseball in a Video Arcade", "Petco is a fun place but the extremely loud electronic music and speakers and the flashing lights and distractions are not ideal for this baseball fan and if I came again I'd find seats where there are no lights and loudspeakers. Transportation is relatively easy and there is fairly convenient parking. The tickets are expensive for good seats. The food is pretty bad. I would still consider buying season tickets if I lived in San Diego, because, Baseball.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Tour of the Park", "Got to see so much on the tour of the stadium. More than most tours we’ve been on before. The guide was great, walked at a good pace and was very easy to hear and understand."], ["Reviewed December 21, 2017", 5.0, "PETCO Park home if the San Diego Padres", "Voted the best baseball stadium in the world in 2017, and absolutely justified. Jim our tour guide was gold and a credit to the organisation. Whether you are into baseball or not it still is very very worth while. It’s an amazing complex with great people running it.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Season Tickets", "Awesome sauce great ball park great venue al together. Restaurants excellent . San Diego Padres vs other teams. Parking good get there early. I💙Petco Park"], ["Reviewed December 20, 2017", 3.0, "Red Sox vs. Padres", "Nice to watch the Red Sox play without paying an arm and a leg as one would at Fenway. The stadium is okay, no better, no worse that most other stadiums. Since my daughter lives right across the street, parking is no problem, but I know I have seen game-goers walking from quite a distance to get a better parking rate.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Batter Up!", "A trip to PETCO park can be combined with a meal at the Gaslight District and a leisurely walk.\n\nThe stadium ids right in the heart of the city and it's absolutely gorgeous. Check out a game if the Padres are playing. The view of the modern architecture and the ocean from the stadium are amazing and we had fun watching a professional baseball game. It was totally a spur of the moment decision and it was easy to buy tickets.\n\nFor more travel tips, please check out my popular travel blog.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Best Stadium Tour", "Great tour, Great tour guide. Sherie was very knowledgeable regarding every part of this tour. We toured the press box, the dugouts, the locker rooms, the cheap seats, the ground crew areas with their equipment, the field. You name it, we were there, then Pat took over for the outside area of the stadium with info on all the hall of gamers. I’ve toured many stadiums - but this was by far the best tour. If you are a baseball fan, the Padres do not need to be your favorite team but if in San Diego, you should partake in seeing this stadium.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Padres Baseball, Great Ballpark", "My daughter took me to the ballgame between the Padres and the Pirates. First time at Petco Park, really nice ball park. The hotdogs weren't great, the game was fun, the seats gave a good view of the game and I'm looking forward to going back.\nShow less"], ["Reviewed December 13, 2017", 3.0, "Huge", "Went to watch a game and was impressed by the size of the place. Great place to spend an afternoon with the kids"], ["Reviewed December 13, 2017", 5.0, "Great Ballpark", "This gorgeous stadium is the home of the San Diego Padres. It is a fan friendly venue which makes watching a game a joy. It is one of the most popular stadiums in the Majors."], ["Reviewed December 9, 2017", 5.0, "Labor Day weekend", "We were meeting friend's for the weekend and I wanted to do something fun for the kids and the adults. The Padres were playing the Dodgers so it was packed. Luckily, I had ordered great seats in advance. I recommend the 200 level as they offer roomier, padded seats and food/beverage service. The kids had fun shopping and the view from inside the park of the city backdrop is awesome. I think we'll be making this a yearly trip!\nShow less"], ["Reviewed November 20, 2017", 3.0, "I like the old park better.", "The best thing about this park is that you can get to it by trolley.\n\nI took a tour of it a few years ago. it's not finished well. Also, it's tough to move around the park and way too much obstruction.\n\nJack Murphy Stadium was more relaxed. This one is just an average modern-day ballpark with poor to mediocre play.\n\nThey should have put the tax payer's money in a library.\nShow less"], ["Reviewed November 19, 2017", 4.0, "Nice place to watch a game", "Petco is a nice ballpark with good side lines and lots of food options. It is very convenient to the downtown area and has available parking. Have particularly enjoyed games where Giants fans attend in large numbers. The designer did a great job incorporating the warehouse building in left field. Was a little chilly during the night game we attended but nothing like Candlestick. Will certainly return.\nShow less"], ["Reviewed November 18, 2017", 3.0, "Another Baseball Stadium But A Good One", "It is right in the heart of town and it is big and impressive and it is worth a visit for a game or just to see the place and see its size."], ["Reviewed November 18, 2017", 5.0, "One of the nicest baseballs stadiums", "San Diego might not have a championship baseball team (yet) but they have one of the nicest stadiums in the country. The food choices are insane and the walkway areas let you see the game without being tied to your seat. There’s a ‘park in the park’ which is a miniaturized baseball field for the kids to play while the parents watch the game from the lawn area. Another cool perk is the stadium tours. You get to visit the clubhouse, locker rooms, batting cages and a bunch more for a good price. Its right in the water so the views are insane + the weather is always perfect in SD.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Take me out to the ball game", "Fantastic ball park....Go padres visited metal building with all the amenities thanks to Richard. Cant go wrong and after the gaslamp district will be FUN FUN FUN"], ["Reviewed November 15, 2017", 5.0, "Great park", "I've been to about ten MLB parks and so far this is the best one to date. Great view of downtown San Diego"], ["Reviewed November 13, 2017", 5.0, "Awesome ball park", "Too bad the padres aren’t better, but this ball park is top notch. I’ve been to quite a few and this is one of my favorites for sure. Great place to watch a game and the weather is almost always perfect."], ["Reviewed November 10, 2017", 4.0, "Excellent ballpark tour", "The $12 tour of the ballpark is very informative and fun to experience. Loved the views and the way they incorporated a historical building as part of the stadium. Visited the press area, expensive boxes, locker rooms and the dugout and on the field.\nTheir Hall of Fame is great to experience. They also have a grass area for families to have fun and can also see a game.\nNice couple of hours.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Petco Park Baseball Stadium", "A great stadium to watch Major League Baseball. All the seats have excellent game viewing. I prefer left field lower boxes. These seats are field level and can be purchased for about 20 to 30 dollars. Row A is row 1. Bring a glove as Batting Practice is 90 minutes prior to the first pitch. Go Padres.Great food and craft beer selection.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Food and relax.", "The food, and the selection of beer and wine is nice. a great place to walk around and relax. Nice to place to people watch as it is their first time at the ball park."], ["Reviewed November 8, 2017", 5.0, "Don't have to love baseball to love this park", "Petco Park is fun for everyone, including the un-sports enthusiast. You can sit out on the grass and have a hotdog and beer with the family, or watch the kiddos play ball in the park in the park. There are many food options, including fish tacos and Hodad's burgers. It will cost you an arm and a leg, but what San Diego attraction doesn't?\n\nYou can take the trolley to the game and not deal with expensive and unfindable parking.\n\nA great way to spend a sunny Sunday afternoon!\nShow less"], ["Reviewed November 8, 2017", 4.0, "Great experience, too expensive!", "I came here for a game with my co-workers a few months ago and while the facility is incredible I could not believe the prices for food and drinks.\n\nSo the facilities: INCREDIBLE! It still looks brand new. It is well maintained and the staff who works here is also great.\n\nThe food: What I ate was just ok, but super expensive for what it was. I know there is other good food I can try next time I visit the park.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Good to see TONY!", "I am YANKEE fan and I am baseball fan, I would not miss the opportunity to check the place out. I have seen Tony play against us, I respected him a lot, so I had to go and see take some pictures. Nice park next to the stadium and Tony's sculpture. I really liked the area.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Padres!", "I don't even like baseball but now I love the Padres. Went to my first MLB game (last couple innings) & I finally get it. It was fun & I think tickets here were $11. The stadium was so convenient that we walked from our hotel. It was actually a spur of the moment event because the people working there were just awesome!\nNow I'm a fan! \"Talk to The Hand\" and\n\nEnjoy!\nShow less"], ["Reviewed October 30, 2017", 4.0, "Nice new park", "This is a nice new park. I like how the stadium is incorporated into the city with the outfield park. It offers nice views of the city to look at in between innings and there is nothing better than enjoying some perfect San Diego weather and watching baseball. The Dodgers were in town when we were there bringing many Dodgers fans to the game. In some stadiums that could be an issues but all the fans were very respectful which made for a great experience. We also took the tour which was great. If you can't enjoy a baseball game in this stadium you can't enjoy one anywhere.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Fun times and great games", "Petco Park is great experience even if you are not a baseball fan. The tickets are reasonable and some for less than $10 (sometimes free) you can get tickets for the lawn and see the field. The food is more reasonable than most sports parks. Many websites offer discounts for actual seats. Go Padres\nShow less"], ["Reviewed October 27, 2017", 5.0, "A true experience", "I grew up in San Diego but moved overseas several years ago. On my first trip back, we caught a Padres game, and I was really blown away. The park is beautiful, and offers so much in terms of restaurants, etc. One of these days, I'll move back to San Diego and hope to get Padres season tickets just so I can go there more often!\nShow less"], ["Reviewed October 23, 2017", 5.0, "Petco Park", "Petco Park has the charm of a nostalgic baseball park fitted with all the modern amenities one could possibly ask for. Another perk is that it is walking distance to numerous hotels, restaurants, shops and the bay."], ["Reviewed October 23, 2017", 3.0, "A different type of park", "I am a baseball fan and been to a number of other stadiums. The food here is surprisingly good, there is a small grocery in the stadium where you can purchase food just as you would at Whole Foods. The views from my seats were great for the price but the only downside is despite how nice the pictures make this stadium look unfortunately there is a large homeless population that mulls through the Gas Lamp district and the outside has a faint urine smell. I felt safe but I wish the area was more welcoming. I hope the Padres eventually have another good season as there were a lot more Dodger fans for a “home” game.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Cool Ball Park, Gaslamp Quarter, Open Every Day", "I was up early while staying in the Gaslamp Quarter walking to an exceptional coffee shop.(Copa Vida)\n\nWe stayed at the Hilton Gaslamp Quarter (nice) a couple of blocks away. I was surprised as I walked 5 or 6 blocks for coffee to find that one could walk thru the ball park and that it was perfectly integrated into the area.\n\nAs you walk thru one can find a beautiful setting that is a dog park, plus a nice kids play ground and it’s adjacent to city businesses. It has a very cool vibe.\n\nIt’s peaceful and enjoyable early in the morning. I expect the same except on game days when it might be a bit hectic.\n\nWell worth a visit.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Tour the Park!", "The Padres were out of town but we went on a tour of the park. It was fascinating! I really loved the history of the buildings incorporated into the park itself. It was fun to go into the VIP suites and the locker rooms. I would highly recommend taking a tour because it adds so much when going to see a game--so many things I did not know.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Wonderfully comfortable relaxing evening spent enjoying America's pastime.", "What a beautiful intimate modern baseball park in such a great location for San Diegans and its guests. Just a great way to enjoy a casual day or evening with a friend..soaking up the sun by day or chilling out in the cool San Diego evening bay breezes.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Great Park!", "Great place to see a game. I make it a point to try and get to as many baseball stadiums as I can in my travels. This is a very nice park. Good sight lines and good food to boot!"], ["Reviewed October 11, 2017", 4.0, "Tigers vs Padres", "very enjoyable afternoon at the ball park. great seats. my team lost, yet, we still had a great time."], ["Reviewed October 10, 2017", 4.0, "nice ball park to watch a game", "this park is beautiful in down town San Diego, close to all the places a tourist should see. The park is great but the fans are rude , I have never had to deal with more nasty fans , not only at the park but on the trains to and from the park. Overall though the architecture of this ball park is great , could use some better food choices , but as it is close the the Gaslamp Quarter I would say eat after the game and don't take the trains after a game unless you are an adult with no kids as these fans will push and shove their way in front of you.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Check in the box for a ballpark tour", "We're working our way through the major league ballparks. Petco Park was a good one. The downtown location was surprisingly convenient. It was easy to get to and had plenty of close parking. We parked in the \"tailgate lot\" about two blocks east (one caveat: this was a lightly attended game). There are interesting food and beer choices. most with a California flavor. Tickets were very reasonable compared to other parks--and they offered a military discount.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Wonderful Ballpark!", "The family loves to visit new (to us) ball parks across the United States. Petco is now one of our favorites. The view over the center field wall into the city is great. Loved it!"], ["Reviewed October 4, 2017", 5.0, "Quality ball park", "Years ago I'd seen the Padres play at Qualcomm, so I was interested in checking out Petco Park. I'd recommend it for baseball fans or for tourists looking for a great experience. The stadium is pretty spectacular, with loads of concessions and merchandise stands. Seats were comfortable too. On the day I visited they were giving out free team fedoras on entry, which was a nice touch. I was sat near the foul line marker and had a good view, but I think the upper tier would have a great view of the city skyline. Looking around me I could see couples, families, young kids hoping to catch a ball as well as baseball diehards. I like that baseball is a real slice of Americana so grab a beer and a hot dog and just relax and enjoy the game.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Love going to Petco with the Family and Friends", "Few things are better than heading to the ball park on a Summer afternoon with the family. Petco is a well designed park and is perfect to spend a long day taking in the Baseball History of San Diego and taking in delicious food and beer.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Petco is a great experience!", "Being baseball fans (not so much Padres fans anymore), we have been to Petco numerous times. It is a beautiful park, well laid out, great views of the San Diego skyline and the San Diego Bay, most seats have good views of the field, and there is a good variety of food choices.\nShow less"], ["Reviewed October 2, 2017", 5.0, "First visit", "It’s my 21st big league ball park and by far the nicest of the venues so far. Scenic with lots of room for family activities. Very clean and comfortable."], ["Reviewed October 2, 2017", 5.0, "Beautiful Park", "We went to Petco Park on a Monday for a Padres vs Orioles game. It's a beautiful new stadium in a great location (right downtown, near lots of bars/restaurants, near the convention center).\n\nThere a great area with a park and a small baseball diamond for kids. Beers and food are normal stadium prices - nothing I haven't seen before. There is free Wifi!\n\nWe sat in the loge section (200 level) right above home plate and the view was phenomenal! Much better than my home stadium (Skydome). It was fantastic, it felt like we were right in the game. Concessions are spaced out and in our section - you had to show a ticket to get into the concourse - there were never lines.\n\nTicket prices were very reasonable (which makes sense because we went at the end of a season where the Padre's weren't great) but regardless, it would be totally worth checking out while in San Diego.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beautiful Baseball Park", "Petco Park is a wonderful place to experience the great American pastime. We stayed at the Omni Hotel, which is directly connected to the park. What a wonderful way to see a game."], ["Reviewed October 2, 2017", 5.0, "Great family park!", "I surprised my husband by making a reservation at the San Diego Omni for the last night of our trip, because this park is literally attached to the park! What a fun, family centered place to go! You didn't need to be a baseball fan to enjoy this place. We are a baseball family, but there was tons to do around the park! We enjoyed some really good BBQ food that was being served just outside the field near the dog park and kids wiffle ball field! If you are a police officer, bring your ID- we received a 25 percent ( I think ) on each ticket! This was a really fun place to go, until the cockroaches came out... eww.. yes, there were many, just be aware. Besides the roaches, we had an amazing time!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Nice visit", "Was a fun night of baseball. Beers were huge and the Padres won. Tickets were extremely reasonable and staff was great."], ["Reviewed October 1, 2017", 5.0, "Fun Family Night", "What a fantastic ball park! We attended an early evening Saturday game with our children aged 10 and 13 during our stay in San Diego. It was a very family friendly atmosphere (complete with fireworks after the game) and the food exceeded any ball park or arena we have been to. The 'village feel' of the food vendor area is a nice touch as is the variety of food offered, particularly items that are more unique to San Diego itself and not just hot dogs. I thoroughly enjoyed my tri tip nachos. So good! We sat on the third base side, which was in the shade at 5:40 game time, Also loved the memory one usher gave to my children - they were watching batting practice in the outfield seats and longed for a ball to come their way. Upon leaving the area to get to our own seats, a lovely female employee asked them if they had been to San Diego before or caught a ball before. Upon answering no, she gave them the ball she had picked up in the seats herself. My kids were thrilled and are still talking about it.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Family & Friends", "This stadium is nothing short of amazing, High-tech & Awesome! Not only is the view in every seat FABULOUS but, it's not that old, it's clean, it's kept a wee bit of Old San Diego inside of her and, the food, (Phil's B-B-Q), oops, did I say that?, is awesome too! But, being a MIDWEST Man, I know my B-B-Q, and, I feel it's the best in San Diego! But, they keep this place Immaculate and very Clean so, you'll really love going! They also hold many other functions, i.e., Concerts as well as other venues such as Monster Trucks, from time to time so, if you look ahead and, plan correctly, you'll have a Grand time, when visiting, this Awesome, FABULOUS, Kick Butt City, but, come see for yourself as, there are so many things to do, you'll have to congee back, again and again, because, you'll need, ast last a month, to tryn complete some of the many attractions, but, pick your own, enjoy and, Safe Travels!\nShow less"], ["Reviewed September 30, 2017", 5.0, "Beer is expensive", "I had a great time but why do stadiums always have to gouge on the prices of their food and drink? It's just indecent I think."], ["Reviewed September 30, 2017", 4.0, "Great place to see a concert", "Went here to see Metallica what a great venue, not a bad seat anywhere, beware the extreme costs of beverages and food this was the only point that let it down, the staff are very friendly and they are organized."], ["Reviewed September 29, 2017", 4.0, "Nice way to spend an evening", "We went to a game on Taco Tuesday. Fun way to try different tacos. Our first visit to Petco. We have visited other parks and this one is nicer that some others. Got to see a Padre win also!"], ["Reviewed September 25, 2017", 5.0, "Beautiful Ballpark!", "As a baseball fan, one of my 'bucket list' items is to attend a game at all the MLB parks in the US. Petco Park is beautiful! They incorporated existing buildings into the structure of the ballpark for a very unique feel. They have a great grassy kids area beyond the outfield walls & awesome food/beverage options throughout.\nCombined with the San Diego weather, this is definitely a park I'll revisit.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Nice park, great game!", "Love baseball. Love visiting ballparks when I go to a city for business or pleasure, if the local team is in town. Petco Park was a nice venue, the food took a while (over 30 min from start of line to getting the goods) but it was made fresh and the burger and the fries were both 1st rate. And the Padres won the game, followed by an extensive fireworks display. Loads of fun. Loved it.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Trip to the ballpark turns into craft beer frenzy!", "Came for the baseball game, but found out this may be the best place in San Diego to sample all the local craft breweries' beers! Too many different brands/options to mention them all, but everything from Alesmith to Saint Archer. The park itself is fantastic as well - great place to watch a game and have a craft brew.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Great fun!", "while visiting San Diego we decided to go into Petco Park and watch a game. It was really a fantastic experience!! The stadium has a great atmosphere, clean, a lot of food venues, a great choice of drinks, friendly staff and views are great from anywhere. We would go back there just for a fun evening out.\nHighly recommend.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Go Padres !", "Went to the stadium to watch the Padres beat the Nationals and had a great evening.\n\nWe parked in the convention centre that was within a 5 minute walk at a cost of $15 all day (until 1am). We were at the car park very early, parked near the exit so there was no queue as we left the game and we were on the road within a few minutes.\n\nThe stadium is new, modern, with comfortable seats and plenty of food / drinks stalls at 'reasonable' prices given the captured audience.\n\nThe stadium did get a little drafty after sun set (don't they all?) so take an extra layer if you're at an evening game (we went in mid August).\n\nWe didn't do a tour, but wished we had.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Great sports venue but eye watering prices inside", "Really enjoyed my visit. Lovely stadium in a great downtown setting. The prices at the concessions stalls were some of the most expensive that I have ever seen. This was the most expensive pint of beer that I have bought anywhere in the world."], ["Reviewed September 22, 2017", 5.0, "Wonderful ballpark!", "Just a great ballpark. Views are good. The jumbo screen good. Be sure to see Tony Gwynn's statue (out behind outfield, near picnic area). There's also a casual restaurant that's good to sit down in and order and food pretty good. Lots of eating stalls."], ["Reviewed September 21, 2017", 5.0, "We liked it better than Yankee Stadium", "Is it because it's a little smaller and therefore feels more friendly?\nIs it because its in the heart of town and we could walk there from our hotel?\nIs it because, as always, San Diegans are so friendly?\nWhatever it was - we loved PETCO (we'd have enjoyed it more if the Padres had managed to win more than 1 of the 3 games we saw - but that's another story). For my money - it is better experience than yankee Stadium. Food options are immense and well presented, and, as you'd expect from the home of craft brewing - the beer options are endless. Claudia also found a great wine outlet.\nIf you are in Sani Diego in summer you really ought to go for the full experience.\nBut you can stroll through the part at the park and the Padres Hall of Fame even on non game days (and in the winter). So i think it is a must visit on any tourist trail.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Padres home ground", "Another awesome baseball ground, good views from most seats. Expensive food and drinks, take your own 'sealed' water. Bags searched on entry; large bags not permitted."], ["Reviewed September 18, 2017", 4.0, "Baseball!", "Caught a dodgers - padres game here, came over from LA. Nice ball park, prices not as high as in Dodger stadium. Easy parking. The sun was shining and the budlight was cold. LA won. What can I stay, might come here again :)"], ["Reviewed September 18, 2017", 5.0, "Giants lost but the park was great nonetheless", "One of the great ballparks in America. We stayed in the Omni Hotel and were able to walk across the skybridge. Great food and an awesome selection of local beers. Liked it so much we even went to a Dodgers game (they lost too, thankfully)."], ["Reviewed September 14, 2017", 5.0, "Great place to see a baseball game", "I live mostly in the Phoenix where we have to watch baseball in what looks like an airplane hanger. Seeing a game at Petco though, outside, with the views of downtown and the old building in the outfield makes seeing a game here a unique experience. The food and beer choices are different and very good for ballpark food. However, it's close to gaslamp for a pre or post game meal or cocktails at numerous locations even if you just want to stroll down 5th or 4th.\nShow less"], ["Reviewed September 14, 2017", 5.0, "visited for a game against the Cardinals", "As Cardinals fans, we still felt very welcomed to the ballpark. The ushers even told us about all the food options that he thought we would be interested in. The food was great, although the lines at Hodad's were not worth it. The Polish Sausage and garlic fires were wonderful.\nShow less"], ["Reviewed September 13, 2017", 5.0, "My sisters wedding", "We were in town for my sisters wedding. During our stay, we went on a tour of Petco park. The tour guide was friendly and knowledgeable. We saw the dug outs, press boxes and more. Great tour ."], ["Reviewed September 13, 2017", 5.0, "Beautiful Park!!", "Put this one on your bucket list, especially all baseball fans. The whole experience is worth the visit."], ["Reviewed September 13, 2017", 4.0, "Great view of the Playing Field", "We sat in the upper section but the view was great. We were very close to the concession stands & the restroom which is very convenient."], ["Reviewed September 13, 2017", 5.0, "Simply a fabulous stadium in an amazing city.", "San Diego in and of itself is a beautiful destination. In the heart of downtown, you'll find a baseball stadium with old charm and modern style. The place is not a baseball stadium. It's an adventure. You could go there and see and do so much outside of watching the ball game it's quite a pleasant distraction. There are park-like grass areas, bars, food joints, seating in so many different locations, good lighting, and good security. I can't wait to go back. Take me out to the ball game!\nShow less"], ["Reviewed September 13, 2017", 5.0, "Really great ballpark.", "The team that plays here does not deserve such a nice place to showcase their lack of talent, however it is still a great place. Spend an evening with friends at the park and you will see another one of the reasons that San Diego is such an amazing place.\nThe ballpark has great \"real\" food, high quality beer and the nice people from San Diego hanging out.\nGive it a try. CK\nShow less"], ["Reviewed September 13, 2017", 5.0, "Best ball park beer selection", "Petco is a great ball park and makes for a fun day, despite the struggles the Padres may be having. Kids will love the Park in the Park, which presents a fun family environment. There is good variety of food and Petco has embraced the San Diego beer culture by offering the best ball park selection of beer in the country.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Highlight of our trip!", "We were in San Diego for one day only so couldn't miss the opportunity to go to a baseball game. We got tickets the night before and headed over to Petco Park. Having never been to a ball game before, I'm not sure how the stadium compares to others in the US but we had a great day out.\n\nThe atmosphere was great, I would definitely recommend it. Only complaint was the craft beer was very expensive (although it was also good - Ballast Point, come to the UK!)\nShow less"], ["Reviewed September 11, 2017", 5.0, "Take me out to THIS ballgame!", "What a great venue! We walked from a our hotel, Hilton Bayfront. Great seats along the first base line. Beautiful spring night. I just tagged along with a group of friends and didn't care who won. Just fun to be at a ball game! It's a beautiful park. Seemed for a while that the sun would be right in our eyes, but it shifted. The food choices are amazing! Plenty of locally known - and loved - eateries. I thought the prices were better than at most ballparks. The park is in the middle of skid row but there were crowds of ball game visitors, so we were never worried. I'd go back any time!\nShow less"], ["Reviewed September 10, 2017", 5.0, "Baseball", "You cannot beat a good baseball game. This place has open house days when games are not being played. There's a small dog park right behind which looks like a baseball in field, Very cool."], ["Reviewed September 10, 2017", 5.0, "Great Atmosphere", "Decided to get tickets for a game whilst visiting from UK. Well kept stadium with helpful staff. Tickets were good value for money and collection of tickets was well organised. Good food and drink options and plenty of toilets. Fun atmosphere. Great for families."], ["Reviewed September 10, 2017", 5.0, "Friendly Ball Park", "Petco park is a very friendly ball park! We caught all three Giants' games of this series and sat in Sections 106, 103 and 104. These were great sections in which to sit since all were night games. During a day game all of these seats would have been in full sun! There seemed to be as many Giants fans as Padres fans with a very friendly rivalry atmosphere. The choice of foods was good with offerings of local favorites. The Baked Bear, an ice cream sandwich with fresh baked cookies, was outstanding!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Great views and beautiful ballpark!", "After a long convention day we went here. Arrive early so you can roam around and enjoy the views and all the delicious\nfood! Loved the locals we sat near. I have always been told\nIF you visit San Diego you will want to live there! This park\nrepresents a beautiful city!\nShow less"], ["Reviewed September 9, 2017", 4.0, "Petco is fan friendly and fun !!", "We recently spent time in San Diego, CA and spent some time at Petco Park. We got to see the Padres play the Giants. I like this stadium and liked the fan experience that it offered besides the game itself."], ["Reviewed September 8, 2017", 5.0, "Beautiful Ballpark!", "Petco Park is the last of our California Ballparks to see and it was quite beautiful. Everyone was warm and friendly and it helped that my team won...Go Cards. The museum is in the stadium and was free. Very beautiful park!"], ["Reviewed September 8, 2017", 5.0, "Great ballpark!", "Attended a game while on business, first visit to the ballpark and I gotta say it was great. Very affordable and we even had the buffet in the VIP lounge which was amazing and the waitress was friendly and prompt with beverages. Very clean and a family friendly atmosphere, I'd encourage anyone to experience a game here.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Great venue for a ballgame or a concert!", "Petco Park is such a beautiful stadium!!! We've been here only a couple of times but have been truly impressed. The food is really good, the stadium is clean, and there's quite a bit of shade seats available. We also loved that they allow kids to bring in food and drinks!!! We keep the kids stuff altogether, unopened, in a ziplock type bag and have never had a problem. The workers have also been very nice and helpful. Being local I know many people who also love going to Petco Park and have said great things about concerts held there. If you're thinking about going to a baseball game or concert and wondering if the venue is any good, it is!!!\nShow less"], ["Reviewed September 7, 2017", 5.0, "GREAT OUTING!", "My wife and I aren't the biggest baseball fans; however, we ALWAYS love going to a game at Petco Park. The location and atmosphere really is like no other ballpark we have experienced. The concessions are great and the views are spectacular. Definitely worth an outing.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Beautiful Ballpark", "I had one evening off and the Padres happen to have a home game. It was my first time attending a professional ballgame in many years. I thoroughly enjoyed the whole experience. If you come to San Diego, catch a game!"], ["Reviewed September 7, 2017", 5.0, "A special walk in the park", "We had the opportunity to visit Petco Park on our last trip to San Diego. We found out they give a guided tour of the park for a marginal fee. Since this was my home town, I thought my daughter might like to see where the big boys play baseball. The guides were great and we got to see the field from many different places that a regular fan does not get to see. Oh yeah, the ballgame was fun to watch and the hot dogs were great.\nShow less"], ["Reviewed September 7, 2017", 3.0, "Cardinals vs Padres", "We went to a food court and a baseball game broke out. It seems more attention is given to the mezzanine than the field. For the love of the game, it is disappointing there is such a small fan base. Prices are average. Was able to get excellent seats after the game started. The BEST part of Petco Park is the Cardinals won.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Top 10 MLB Parks", "My family and I have been to many MLB stadiums, and Petco Park is one of the best. We had great seats by the 3rd baseline, but after walking around, it doesn't seem to be a bad seat in the house. Lots of activities going on for kids and adults. We loved the wiffle ball game for kids. \"Park at the Park\" located directly behind the outfield where people could sit on chairs, blankets. Very nice. Great food and beer selection. Nice Padre's Hall of Fame area too.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Best Venue for Sports and Concerts", "The size and layout of Petco Park makes it the ideal place to enjoy music concerts as well as Sports."], ["Reviewed September 6, 2017", 5.0, "Play Ball!", "This park is beyond gorgeous, and our seats were great! We sat in the second row behind third base. I could see everything and eat my huge hotdog at the same time. Every single staff member I came in contact with was super nice and very cheerful!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Lots to See - More than the Footlocker 5K", "The first several times we visited Balboa Park was to watch the Footlocker National 5K in December. Who knew all the wondrous exhibits for the family to see? We enjoyed the rose garden, the botanical gardens and the engineering museum the most. Take time to people watch!\nShow less"], ["Reviewed September 6, 2017", 3.0, "Great place", "Rented to metal suite, had catered food and drinks. Nice AC, very comfortable, tad pricey. Shared bathroom with that tier, but easily accessible."], ["Reviewed September 5, 2017", 4.0, "This is on Hodad's / Toyota Terrace Section 203 upper level", "My Dodger friends who were with me for the Padres/Dodgers Doubleheader (7:10pm game Sat. 09/02/17) wanted Hodad's, This Padre fanatic said instead of going to O.B. - Let's have it during the game @ Petco!! So, we did. We all had Bacon Cheeseburgers (one combo had onion rings, another combo had fries and I had TWO Bacon Cheeseburgers with no side). My Dodger buds weren't too impressed, but I was - I didn't have stinky onions and they said the O's were overpowering. I told them on our next Padres game, we will visit Hodad's Ocean Beach as the Petco Park menu is quite limited, and the guy behind the counter admitted in the ballpark it's \"Quantity over Quality\". I still liked it, though - as I know Hodad's and for Baseball cuisine, it's the best as it comes. Four Claws UP!!!! Gay Friendly. Peace - GO PADRES!! (Padres BEAT The Dodgers both games!!) Joe G. Bear\nShow less"], ["Reviewed September 5, 2017", 5.0, "One of the top stadiums in MLB!", "I've been to many Major League Baseball stadiums in my lifetime, both new and old, and Petco Park is one of the best. Located in the comfy confines of San Diego, where the weather is always beautiful, a trip to the ballpark whether you're a baseball fan or not, will be well worth your time. With the backdrop of the city in the outfield and the harbor directly behind you, the views from anywhere in the park is spectacular. They've integrated the Western Metal Supply building in left field, a sandbox in right center, and a \"porch\" that juts in at the corner of right field - what a great and original design.\n\nThe food selection and number of windows open, provide plenty of options and you won't spend a whole inning in line. It is also very family oriented. One of the best parts of this stadium is the \"Park at the Park\" located directly behind the outfield. It is literally a park, with park benches, places to lay down a blanket and have a picnic and a huge monument to Mr. Padre, Tony Gwynn. It's so much fun to see people utilizing this area before and during a game, with kids throwing frisbees or playing a game of whiffle ball, and families enjoying the open space.\n\nThere is parking all throughout the downtown area and walking to the park is part of the experience, however if you'd like to park close to the stadium, I would recommend the parking garage near the harbor at the Hyatt Hotel where there is parking during game days and a bridge that connects directly to the entrance of the park so you don't have to navigate the street lights.\n\nIf you have time, the behind the scenes tour that they offer at Petco Park is outstanding. You'll get to go into the locker rooms, the dugouts and get some great information. Overall, a fantastic outing for the family!\nShow less"], ["Reviewed September 5, 2017", 5.0, "San Diego padres game", "We were in town for 2 days and bought tickets to see the Padres play. It was a 1:40 PM game and we bought tickets that offered shade and covering. We were in the infield 108 section (off 3rd base) and sat in seats 22-24. They were seats right off the aisle and head covering over us in the event of rain or to avoid direct sunlight. The seats were perfect and cost around $50 each.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Got to go", "Have been traveling since August 1 to baseball cities... NY to CALI PETCO is one of my favorites Great setting Fun atmosphere Went to 2 games!!!!"], ["Reviewed September 5, 2017", 5.0, "Beautiful ballpark", "We caught a Padres game while we were visiting the area. The park is very nice - full of amenities. It is fairly intimate - you're much closer to the field than many other ballparks."], ["Reviewed September 5, 2017", 5.0, "One of the Best in Baseball", "The team may not be very good right now, but Petco Park is worth a visit. Great views of downtown, all the amenities you want, and a ton of great craft beer!"], ["Reviewed September 4, 2017", 4.0, "A fun evening and good value.", "A spur of the moment decision took us down to an evening match. Visiting from England we weren't sure how good the night would be but wanted to try this all-American experience. It was fab !\n\nWe had seats high up but the ball went higher ! The view was great. It was a very family-friendly atmosphere and our teenager really enjoyed the match.\n\nPrice wise, an absolute bargain compared to the English Premier League. Lots of parking nearby.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Great ball park, clean, great views, great seats and lots of food option", "Wow, what a game and the Padres won :-) was our first time as a family, I've been to a few other ball parks and this was the best, lots of food and drink options, the beer is expensive at $12-15 but the food is cheaper. we were in section 122 and had a perfect view, managed to get up the big screen several times, I was surprised how many balls were lost to the crowd :-) would go back to a ball game here, there is no need to spend more that $35 on a ticket, our view was perfect\nShow less"], ["Reviewed September 3, 2017", 5.0, "Family fun", "My husband and I are touring all the MLB parks and this one is one of our favorites. It's clean, family oriented, pretty and the staff is so friendly. Lots of food options. You can bring your dogs!! We even caught a winning game. Sunday home games honor both active military and veterans - love that.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Ballpark right in the city !!!", "We enjoyed a Padres game while we were in SD. I like visiting as many ballparks as I can. I was shocked to be walking downtown & all of a sudden, there is a ballpark! There's lots of eateries there & it's a very friendly feel. I enjoyed my visit here. We had seats along the 3rd baseline between 3rd and the outfield. We probably would have been able to see a little better had we sat further up. We were only a few rows off the field. The food was very good and quite reasonable (for an East Coaster!) We were staying in Escondido so we drove to the trolley station at Qualcomm Stadium to take the trolley into town. Easy using the trolley to enjoy downtown !! I would definitely go back!\nShow less"], ["Reviewed September 3, 2017", 5.0, "Western Metal Supply Building rooftop patio is awesome!", "Hanging out on the rooftop of the building that anchors the left filed foul line is awesome. It's a great experience that is hard to top. The weather is great, the food tasty and the atmosphere unbelievable."], ["Reviewed September 2, 2017", 1.0, "Phil's BBQ in section 113 disgusting", "We had the chicken dinner. The chicken was so dry and chewy, it was nearly inedible. They're supposed to be freshly BBQ'd chicken pieces. We choked down half of it. No amount of BBQ sauce helped. The lemonade seemed to be that powdered stuff - very tart. The macaroni salad had a heavy dose of black pepper.\n\nThe beer was luke warm.\n\nThe onion rings were good.\nShow less"], ["Reviewed September 2, 2017", 4.0, "Nice park but....", "I found the park to be nice, doesn't seem to have a bad view anywhere. Had a great evening for ball and competitive game.\n\nThe team does a great job of advertising and hyping at the game. Lots of fun videos, we came on Stars Wars Night.\n\nParking was close for $25 and they have many people guiding traffic, helps to get out of there quickly.\n\nNot that impressed with... amount of concessions, they have little choice and we were in 233 section, gotta walk a bit to find anything decent for food.\n\nA large amount of walking so for anyone with disabilities be prepared.\n\nLocated in downtown, there was what seemed to be a homeless village blocks away. Many tents for the unfortunate. NOT any threat just an eye sore.\n\nAnyways.... had fun. Paid $25 to see them play rival Dodgers. I'd say pretty good. Doing a Baseball tour of all stadiums. I can check this one off now.\n\nShow less"], ["Reviewed August 31, 2017", 4.0, "Fun couple of hours", "As a brit seeing baseball for the 2nd or 3d time was good fun place with a nice family environment. A lot of entertainment other the baseball is put on, worth a visit to see it for really if you are in SD"], ["Reviewed August 30, 2017", 5.0, "Great Place to See A Game", "I try to see a major league game one a Summer as I live in a city without Major League Baseball. PNC Park in Pittsburgh is my favorite and Petco ranks second.\n\nThe park has easy access from transit or walking. There is not a bad seat to see the game. The food is typical, but they have nice souvenir wine glasses. The staff overall are a little gruff for a service industry. Nothing I can put my finger on, but maybe just not as friendly. The fans are friendly and we had good baseball conversation.\n\nIf you are in public safety and you attend a game during the week the Padres give a 25% discount on tickets. There are some restrictions like on Friday nights. This is offered at the box office only. They will ask for proof.\n\n\n\nShow less"], ["Reviewed August 30, 2017", 5.0, "Close and convenient", "We attended a game there, it was wonderful. I almost caught a foul ball.. lol. Take lift, it's cheaper than a cab. The weather was nice and the stadium has everything you need."], ["Reviewed August 30, 2017", 5.0, "Great ball park to view a game", "I always enjoy baseball at petco. Easy to get around the stadium, food is very good. Seats are always found to my liking. Its good old fashion baseball in a beautiful park.."], ["Reviewed August 30, 2017", 5.0, "One of the best ballparks in US", "Attended a Dodgers game in August. This ballpark is one of the best we have visited in the US. The facilities are immaculate and there are so many food and drink options."], ["Reviewed August 29, 2017", 5.0, "Great ballpark", "I attended a four game series with my kids from Washington DC. The ballpark is newer and very clean. Everyone we interacted with, from those working at the park to the fans, were friendly and social. My kids got some souvenirs for their first visit to the park.\n\nWe also did the ballpark tour. The tour gave a great history of the park and the Padres. We got to go into the dugout, press room and several suites. Batting practice was taking place inside and one of the batting coaches welcomed our tour group inside to watch one of the batters practicing.\n\nFood was usual park prices and there's a great variety of places to chose from. My favorite is there's a marketplace that you can shop at like a mini mart. If you are a drinker, there are more than enough options for a variety of beers and spirits.\n\nShow less"], ["Reviewed August 29, 2017", 5.0, "Beautiful ball park", "Picture perfect ball field. Very clean and well built. All staff are so accommodating and very nice. Seats are great no matter where you sit."], ["Reviewed August 29, 2017", 4.0, "Nice park for a game", "The park is nice, food is varied with affordable prices. The seats are cheap compared to other parks. The weather is a steady 70-80's so you can enjoy yourself for a day or night game."], ["Reviewed August 28, 2017", 5.0, "Very friendly and outgoing fans!", "We really enjoyed this stadium! Easy to get to, fantastic food options, I had pulled pork tacos! They even had my favorite Raspberry Fuze Iced tea. The fans and workers were exceptionally friendly! Great atmosphere and a neat stadium to visit!"], ["Reviewed August 28, 2017", 4.0, "Great Event", "I like this venue. My family came from out of town and we were able to come here for a game. We got some good seats and had a great time. The food was pretty good at the stands too!"], ["Reviewed August 27, 2017", 5.0, "San Diego easy", "The stadium is quite accessible, we walked to it from the Coronado ferry. It wasn't crowded but wasn't empty, it handled crowds very well. It is really well integrated into the city, the buildings are really close, yet there's a lawn for families. All the seats are close, concessions unrushed and uncrowded. Padres fans didn't like losing to the Mets but they were well-behaved. One of our favorite parks of the 18 we've visited.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Fun ballpark", "Good food options, craft beer and fun vibe. This is a great place to catch a game. If you are staying in town consider Uber as it may be less expensive than parking."], ["Reviewed August 26, 2017", 5.0, "First timer", "This park is amazing, i especially liked that there are so many easy access to food and drinks... plus free access to party deck totally worth it."], ["Reviewed August 24, 2017", 5.0, "Great modern ballpark", "It's easy to get pretty good seats because the Padres haven't been good in a while. Stub Hub for what are typically season tickets. Great food options & great beer options, too. Love the modern design, while factoring the Western building in, too. Wiffle ball field just beyond the outfield seats for the kids.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Great Ballpark", "My extended family of 20 attended two baseball games at Petco Park during our vacation in San Diego. This is a great venue. I don’t think there is a bad seat in the house. The ballpark is set in downtown San Diego and the Gaslamp District is directly outside. What really excited me about this ballpark is the food. In addition to the standard ballpark food they sell just about everything – tacos, sushi, ribs, mac & cheese. There is even a Fresh Market/Restaurant inside selling fresh salads, fruit and freshly made healthy sandwiches. They even have a bakery. I have a heart condition and it was refreshing to find so many healthy options at the ball park. Also, if you are a beer drinker you will be in heaven, the concourse was lined with numerous carts selling different craft beers.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Petco Park....always a terrific night", "The ballpark looks great....new scoreboards and many other upgrades. Food offerings, distribution, variety, service, cleanliness have all improved. Purchased tickets and parking on-line...very easy using MLB.com. Very busy downtown after the game.....San Diego activity was great that night."], ["Reviewed August 24, 2017", 5.0, "Enjoyable and fun night out", "Firstly, I must admit that I am British so my knowledge of baseball is basic and my wife had never been to a game before. However, this was a really enjoyable and fun night out. The atmosphere is fun and safe for families. We went to a Padres v Detroit Tigers game and the stand contained both sets of fans, who were very friendly towards each other.\nMy first tip is to book your tickets in advance via the Padres website, it's really user friendly and you can choose your seats via a stadium map. If you are not a big fan I would also recommend that you choose cheap seats. We sat on the front row of section 350, which were amongst the cheapest seats available. It was high up but diectly above the diamond, so it afforded us an excellent view of the action and the whole stadium. We were fully involved in the atmosphere of the crowd and the game.\nMy second tip is to use public transport if you can as the traffic is very busy at game time and the parking cost me $20.\nPicking up you tickets from the ticket office is very easy and there are lots of stewards who will guide you on where to go. There are security checks before entering the gound and even though the queues were long, we moved through fairly quickly. Once inside there are lots of stewards to guide you to your seat.\nI would recommend that you don't eat before you go as we found the food stands to be reasonably priced and plentiful.\nIf you are a Brit and not sure whether to go I would stongly recommend that you do, it's a great experience - go to a game, get a hot dog and buy a cap ($25). Go Padres!\nShow less"], ["Reviewed August 24, 2017", 5.0, "Amazing Ground", "Love Love Love this baseball ground. They had plenty of places to grab a bite to eat, have a drink or just chill. They have thought of everything. The atmosphere is amazing inside the ground. One of the nicest baseball grounds i have been to."], ["Reviewed August 23, 2017", 5.0, "Two games...Fav TACO TUESDAY", "We loved this park! We got to go to an afternoon Sunday game which was nice but could get very hot in the sun and on Tuesday evening for Taco Tuesday which I loved! We tried 3 different kinds of tacos as they were only $2.50 each. For Celiac there is gluten free beer (Red Bridge) and ciders at Seaside Market plus at the Stella beer stands they have Stella Cider. Husband was happy to have a beer even though one standard bottle was $10.75. The park is very nice and accessible to walk all around. We bounced around from section to section so we got a nice look from all angles. Note when you are coming in they check your bags and selfie sticks are not allowed. I learned this the hard way not at this park but in Chicago for a hawks game. I saw someone getting their taken away!\nShow less"], ["Reviewed August 22, 2017", 5.0, "The baseball might not be very good here, but the ballpark is the best!", "This ballpark is absolutely perfect. Every seat has a great view and the food options are endless, though between Hoddad's and Phil's you might forget that you originally went for a hotdog! I love this ballpark and I spend a lot of time here with family, fiends from San Diego and from out of town. Go and see, you'll be back often!\nShow less"], ["Reviewed August 22, 2017", 5.0, "comic con", "This is a Nice Park, Clean ,Shade need bring hat, Hot , Nice for an event,Can get to by train from old Town... ."], ["Reviewed August 22, 2017", 5.0, "petco park", "padres baseball was fantastic, not a baseball fan , but fun night out great food and people. must see if you come to san diego. family fun night . right off the trolly train. gas lamp village was right there after game. fun cheap night out\nShow less"], ["Reviewed August 22, 2017", 5.0, "Caught a game while wife worked.", "Petco Field is beautiful! Bought a general admission ticket and could sit anywhere I chose. Ushers are not sticklers like at other parks. Great place!"], ["Reviewed August 22, 2017", 5.0, "Great Venue", "This is my second time out to this park. I love the micro brew alley. Great vibes, food and fans...."], ["Reviewed August 21, 2017", 5.0, "Visiting from out of town", "I loved this ballpark. What a great value. We come from NY and to get tickets to a game for under $100 is great. The stadium was clean and we went on a night with fireworks. The fireworks were awesome!"], ["Reviewed August 21, 2017", 5.0, "Beautiful Park", "I've been to many ballparks, Petco ranks among my favorites. The park offers a nice skyline view, with open concourses and good selection. Taking the tour of the park you learn many interesting facts about the park. Tickets are cheap and the park is a gem.\nShow less"], ["Reviewed August 21, 2017", 4.0, "Excellent Baseball Park!", "San Diego's Petco Park is an amazing ballpark... convenient location to trolley and Gaslamp District. Great food options... Would be a SD must if the Padres were contenders!"], ["Reviewed August 21, 2017", 5.0, "Great Padres Game against the Mets!", "My daughter and I always try to catch a basebal game whenever we are in the states so hence the visit. We pre-booked our seats although I think plenty were available on the day. There are various food stalls for all tastes and everything appears accessible to all.\nShow less"], ["Reviewed August 20, 2017", 5.0, "I love downtown parks!", "This was a great ballpark. There are better but there are definitely worse. I really enjoy the downtown ballparks. They feel so quaint. I love how it is built within the confines of existing buildings. They had lots of food choices. Great ballpark."], ["Reviewed August 20, 2017", 5.0, "Fun baseball game", "We are not baseball fans, but had a great time at a Padre's Game. We Uber'd in, so getting in an out of the stadium was easy. It is really nice to spend time in the Gaslamp Quarter, then stroll in to see a major league game.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Craft beer, great food & stadium", "We had one person in a wheelchair and were able to experience everything this stadium had to offer. We stayed in the Gaslamp Marriott and literally wheeled across the street and into the left field entrance of the stadium. We went into the Padres Hall of Fame Museum and found it interesting even though we are not Padres fans. We went to two games and preferred handicapped seating in the Toyota Terrace section - even though it was farther away from our preferred food & drink we liked the view better. The handicapped seats in Section 113 did not allow a full scoreboard view. We thoroughly enjoyed the tri tip sandwich with wedge fries and coleslaw the first night and the pulled pork sandwich with fries the next night. Both nights we had an assortment of craft beers. The fans were friendly and courteous even though we were rooting for the visiting team. A great overall experience.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Beautiful Park in the Middle of San Diego", "This is a great park! So much to do even before the game. Once you get into the park, there is a hall of fame area and then an area just for kids that is free. My son played in a wiffle ball game and my daughter went into the bouncy houses. It is amazing how they created this park in the heart of the city and also kept some of the old building in tact nearby without destroying them. If you don't want to pay too much for a ticket, you can pay to sit on the hill in the outfield with a blanket. This works well for people with kids who can't sit still and want to run around. Inside the stadium there are so many food choices and drink options. It was great! The only thing I didn't like were the people trying to get you to go to a timeshare presentation. We had to walk by them a few times which was a little uncomfortable. Other than that we had nothing but positive things to say about Petco Park!\nShow less"], ["Reviewed August 17, 2017", 5.0, "Our day at the baseball", "We went to the park for an afternoon game, Padres vs Phillies. It was a great fan experience helped by lovely weather. The game moved along and all of the music, dancing and general sideshow was entertaining. Padres won 3-0, the food was good and plenty of craft IPAs available, what a good day and fair ticket prices.\nShow less"], ["Reviewed August 17, 2017", 5.0, "A Beautiful Ball Park", "We have been going to Petco Park ever since its opening. We go as a family several times a year. It is very accessible for disabled folks with limited mobility or in a wheelchair . If you go to a day game sit on the third base side or you will be in the fun all day! Evening games can get chilly so take a jacket . Go Padres!!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Awesome Experience", "Took a chance and thought I'd go and watch a Padres game whilst in San Diego. Never seen baseball (American Rounders) before so was quite excited about it.\n\nThe whole set up is brilliant, the ground, the staff, the view, the atmosphere and the game were amazing and well worth doing.\n\nThere was non stop entertainment, we even managed to get onto the big screen!\n\nThe whole set up was brilliant, but that may have been helped by the fact the Padres won aswell!\n\nThey even serve you food and drink to your seat...\nShow less"], ["Reviewed August 16, 2017", 5.0, "Tour of Petco Park", "The Padre's were out of town, so we took the park tour. Very reasonable price, the tour guide was awesome and we love the 80 minutes spent there.\nWe walked on the field, sat in the dugout, went in the locker room, suites for the fans with more $$ then we have and toured the Budweiser sports bar complete with pool tables and many big screen TV's. It was very enjoyable.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Great Fun!", "This is a beautiful ball park, with excellent seats for all! the food and drink are terrific too! Great family fun! Even more fun when they have one of their free giveaways!"], ["Reviewed August 16, 2017", 4.0, "Padre Palace", "Slowly but surely, I am making the rounds of major league stadiums with my son. While vacationing in La Jolla, we caught a mid-week game in July at Petco. Mets v. Padres. The weather was perfect. We sat in left field in hopes of catching a home run. No such luck. Instead we watched the Padres crush the Mets. Behind the outfield is a huge screen and picnic area. However, we could not see the scoreboard (i.e. Jumbotron) from our seats---which seemed odd.. Therefore, no replays, etc. Otherwise, great place to take the kids.\nShow less"], ["Reviewed August 16, 2017", 5.0, "MUST DO no matter WHO you route for!", "Hands down, one of THE BEST Ballparks in all of Major League Baseball. I am not even a San Diego Padres fan, nor a native Southern Californian. But, I ALWAYS make it a point to get tickets to a game when I am in San Diego. And, when I travel with members of my staff, I make sure WE all go to a game. RECOMMENDATION: If you ate government (civilian or military), register for GovX and get your DEEPLY DISCOUNTED tickets through the GovX website (25% or more). The is Ballpark in VERY Military AND Family friendly.\n\nFood and drink is way overpriced, typical of most venues. BUT, what I LOVE about Petco is that they designed their food service to be representative of the greater San Diego and southern California culture (microbrews and restaurants). Tuesdays are Taco Tuesdays at the park where you can get $2.50 fish tacos! I actually had the CHICKEN nachos at the Brigantine Seafood & Oyster Bar, and they were PHENOMENAL! BEST nachos I have ever had!\n\nBottom Line: Petco and the Padres are a MUST DO when in San Deigo REGARDLESS who you route for!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Love watching a game here", "Fenway Park is my home ballpark. $50 at Fenway gets you a seat out in right field, facing center-field instead of home plate, behind a pole. $50 at Petco got me a seat right behind home plate with a server bringing me good and drinks. :)\nShow less"], ["Reviewed August 15, 2017", 5.0, "A great ball park - plenty of character.", "Unlike other large cookie-cutter stadiums, the Padres' stadium has some character. the scoreboard, third largest in MLB, is huge, clear, bright and HD. The staff is friendly and helpful. Food choices are good, with variety."], ["Reviewed August 15, 2017", 5.0, "Let's Go Padres", "We had a great time visiting the game of the San Diego Padres. Petco Park is a great stadium with a good atmosphere! The kids (9 and 11 years) loved it. Food and beverages: plenty of choice, but not cheap."], ["Reviewed August 15, 2017", 4.0, "Great baseball venue", "Great place to watch a game, whether you're into baseball or not. The park is clean and has great views of the city. Food, like at most games, is insanely overpriced."], ["Reviewed August 14, 2017", 5.0, "A great way to do San Diego", "Petco Park may not be home to the greatest baseball team but it is home to some of the best views and is a must for all baseball fans. Every seat in the park is a winner but I recommend sitting up high and somewhere behind home plate looking out towards the skyline. It is fun to arrive early to an evening game ~7:10pm or so and watch the planes land at the San Diego airport. The slip in right behind the buildings and it is fun to watch.\n\nThe food is great and I always advise to get Phillis BBQ when you are there. Get the “El Toro” sandwich with fries and you will be watching the game on a full stomach.\n\nSpend some time up in the Ballast point bear garden and take in the Coronado bridge. That is a beautiful view especially at sun set.\n\nAs always root for the Padres. They sure could use any good vibes you could spare!\nShow less"], ["Reviewed August 14, 2017", 5.0, "Best ballpark anywhere!", "Parking is super easy (for a price, of course), the park has lots of room to walk around and explore; plenty of great food and drink, and there isn't a bad seat in the house. And, great city views to boot!"], ["Reviewed August 14, 2017", 5.0, "Great place to watch a game", "We visited Petco Park again a few weeks ago for a Giants-Padres game. Mad Bum was pitching for the Giants in his first start since being on the disabled list. Saw the Tony Gwynn statue, and walked around this impressive ballpark. It features lots of local eateries and shops within. Used to be able to sit on a stool and have a beer and watch the game outside at the Western Metal Supply building, but more: those are now sold as reserved seats.\n\nGreat park for baseball!\nShow less"], ["Reviewed August 14, 2017", 5.0, "Great event venue", "If visiting San Diego I highly recommend you check to see the event schedule at Petco. From baseball to concerts there are many things to do and the facility is first rate. Fun atmosphere to watch a baseball game even if you are not a hometown Padre fan.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Metallica", "Visited this time for the Metallica concert. Had a great time park was clean and comfortable and lots of places to find great food. Friendly staff to direct you in and out of the park. Parking is easy to get in and out of due to event staff great planning.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Padres baseball", "There are a lot of things to like about Petco Park for MLB baseball. Beautiful views, good food and excellent craft beer selections. Parking seems limited. but we used Lyft, and there are plenty of local public transportation options.\n\nThe only downside for our visit: We sat in section 109, and had poor sightlines because of constant foot traffic in the aisle blocking our view of home plate.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Impractical Jokers 2017", "Whoa! What a great venue! Great place to be and to do things in! First time visit was to an Impractical Jokers fest at Comic Con 2017. Great views and and great field! Wish I could watch a game there!"], ["Reviewed August 11, 2017", 3.0, "Subpar Staff and Fans", "I'm on a quest to see all of the MLB ballparks. Sorry to say, but the experience here has been my least favorite to date. The location is nice and the parking is not too bad but i had a rather poor experience with fans and staff. Now I'm a Dodger fan and was heir with my family to root on my team. Dodgers hit for extra bases, great I stand up and clap as the players circle the bases. Nothing obnoxious, no yelling or gloating. Just Clapping. The fans behind me say I'm blocking their view and ask me to sit down! I'm sorry, are we at tbe opera or a sports game? I explain I'm about to, just cheering on my team. About 10 minutes later a security guard comes and tells me I have to stay in my seat or he's going to escort me out of the stadium. Amazing. I've never experienced something like this at ANY other stadium. I'm rating it 3 stars anyway simply because visually the stadium is not bad and the location factor.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Wonderful Baseball Venue", "Enjoyed the ballpark. Good viewing from field level seats. Stadium is very clean and user friendly. Concessions are pricey as are the tickets."], ["Reviewed August 11, 2017", 4.0, "Great fun energy", "Charming stadium. Stayed for fireworks. Fun night. We live in Hawaii don't get to ball games, this was a great experience."], ["Reviewed August 10, 2017", 5.0, "Lots of ammeniaties", "The staff made us feel welcome with warm greetings upon entering the gates, the team shop, the hall of fame and each place including the ushers helping direct us to our seat. This is an exceptional place to take in a ball game. It offers numerous perks just not offered to the fans of other teams. Have kids they have a dedicated baseball field for the youngsters to play on. Have a dog. They have a dedicated section for the two of you to take in the game. Want to catch some rays as well as the game they offer a grass park in Right Center Field. Or a sun deck with drink service. A local military service member. Your made to feel very welcome. In ticket pricing, military appreciation days, dedicated wall to MLB players who served in the military. The stadium is beautiful and the concession and facilities like new. Best the stadium feels like part of the community. It is right in town and not isolated by massive parking lots.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Padres vs Tigers", "Flashy stadium with lots of great food options. Hard to find a bad seat in the place. Good access to the SD trolley for public transit option to/from the game."], ["Reviewed August 10, 2017", 5.0, "sports", "Petco Park is not only a blast it is a park within a park. The food is great and the atmosphere is awesome."], ["Reviewed August 10, 2017", 5.0, "Pirates vs padres", "Great ballpark incorporating an old building into the new stadium. Team store had a huge selection of men's and women's gear."], ["Reviewed August 10, 2017", 5.0, "METALLICA", "Petco Park was delightful, the staff were cool. I had no problems whatsoever! For a large venue these people have it going on. I didn't wait in any lines & when I was given a can in VIP a bartender grabbed me & poured it into a cup w/ a smile. I tipped those bartenders like crazy! I had the best time! I will definitely go back for a concert & maybe a baseball game.\nShow less"], ["Reviewed August 10, 2017", 5.0, "I like it", "the Petcopark stadium is really nice. Plan some ours for your trip and arrive a few hours before the game. There is a big fan shop to prepare yourself for the game. Inside the park you can visit the hall of fame with all the history of the Padres, there is also a little park for the little ones where they can play baseball. There is a wide range of different food like, hotdogs, ice cream, tacos, nachos, burgers and much more same with the drinks, like soft drinks, cocktails, many different beers…. The stuff is friendly and efficient, just perfect to enjoy the PADRES.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Not just ball park hotdogs.", "This ball park, built in 2004, is beautiful and in a perfect location for downtown visitors. Each year, they keep adding new and more interesting food vendors and, currently, they have some of the best food around. If food is not your reason for going (and it may not be for baseball devotees), the amenities are first rate. Also, it is within walking distance of a trolley stop, which allows for the convenience of not driving/parking your car. Go Padres!\nShow less"], ["Reviewed August 9, 2017", 4.0, "First time on Baseball", "I'm from Brazil, and here the baseball isnt popular, so i went to Petco Park to have that First experience. Its cool but a Little bit tiring. To know is Nice... But its all.. I Hope that you can understand my English =). Have Fun."], ["Reviewed August 9, 2017", 4.0, "Great food and experience, we just need a better team", "Going to PETCO Park is a great experience. The food and choices are outstanding, representing a cross section of the 'best of San Diego'. The park is beautiful and has a good flow and feel. We do need a better team on the field so that more people will fill the seats\nShow less"], ["Reviewed August 9, 2017", 3.0, "Downtown San Diego Stadium", "The stadium is situated in downtown San Diego and is home to the San Diego Padres baseball team. It's a big stadium and in my opinion the seats are way too steep and angled. Parking is a nightmare in downtown San Diego, so make sure you leave plenty of time for yourself when going there. There are many restaurants and food stands, but of course be ready to pay the high prices. All in all though it's a nice new stadium and good for San Diego.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Excellent Place To Catch A Game", "Was in town to see the Padres play the Twins. Most impressed with this ball park - very unassuming that fit's in nicely with the area. Sort of reminds me of the old Ebbets Field in Brooklyn and every seat has a great view. Food selection is very good, with a wide selection of local micro-brews. If in town and the Padres are in, go and enjoy - you won't be disappointed.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Amazing", "Have been traveling the states to all the ballparks. This one is prob on my top 3 so far. Just beautiful all around. Great beer and food selection. I will definitely be back!"], ["Reviewed August 8, 2017", 5.0, "Beautiful Ballpark", "Beautiful ballpark inside and out. Excellent food choices and many locally made craft beers available. Ticket prices are reasonable, and concession prices are average. Public transit stop is a short walk away."], ["Reviewed August 8, 2017", 5.0, "Awesome place to see some baseball.", "Petco Park is very unique, great food, drinks and great for the whole family. I love going to watch the Padres play!"], ["Reviewed August 7, 2017", 5.0, "Take me out to the ballgame...", "This is a great stadium to watch a ballgame! Lots of seats have shade all the time. We visited at a night game and sat along the first baseline... The weather was beautiful.. Need to watch for foul balls. Lots of great food choices too!"], ["Reviewed August 7, 2017", 3.0, "Concert visit", "We did not go to the park for a baseball game but went for a concert. There were several options for food and beverage which was great but the park itself is a little confusing to find your seats and there were not nearly enough bathrooms. The lines for that were so long at least a 20 min wait to use it. Other than that it was a nice park with amazing sound.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Metallica Show", "First time to Petco Park and I must sayy was very well organized for a concert of this magnitude. The place was very clean, lots of food varitey and lots of ushers to point tyou in the right direction. A little crowded at the bathrooms but overall a great facility.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Impressive stadium", "We do a ballpark tour every summer. We've seen 26 of the 30 MLB stadiums. Petco Park is in our top 10 for sure. It certainly helps that it's 77 and sunny in SD everyday. The stadium itself is very nice and has some cool things, like the Padres Hall of Fame and the 3 story historical building in LF that serves as part of the park. Overall, a great day and San Diego should be proud of what it built.\nShow less"]]}}